{
    "Calls to expel Republican Marjorie Taylor Greene after speech at white nationalist event\n": [
        {
            "id": "hyl0x17",
            "score": 1,
            "text": "\nAs a reminder, this subreddit [is for civil discussion.](/r/politics/wiki/index#wiki_be_civil)\n\nIn general, be courteous to others. Debate/discuss/argue the merits of ideas, don't attack people. Personal insults, shill or troll accusations, hate speech, any suggestion or support of harm, violence, or death, and other rule violations can result in a permanent ban. \n\nIf you see comments in violation of our rules, please report them.\n\n For those who have questions regarding any media outlets being posted on this subreddit, please click [here](https://www.reddit.com/r/politics/wiki/approveddomainslist) to review our details as to our approved domains list and outlet criteria.\n \n **Special announcement:**\n \n r/politics is currently accepting new moderator applications.  If you want to help make this community a better place, consider [applying here today](https://www.reddit.com/r/politics/comments/sskg6a/rpolitics_is_looking_for_more_moderators/)!\n\n***\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/politics) if you have any questions or concerns.*",
            "title_similarity": "0.5814253",
            "sentiment_compound": -0.3895
        },
        {
            "id": "hylk997",
            "score": -3,
            "text": "White nationalist event?\n\nYou mean CPAC?\n\nEdit:\n\nJust now checking back in and realizing how my joke was taken out of context/fell flat.\n\nI was trying (and apparently failing) to poke fun at the fact that CPAC has given a platform to actual white nationalists in recent years. It's not a stretch to suggest CPAC has been white nationalist-adjacent at the very least since the rise of Trump.",
            "title_similarity": "0.6241707",
            "sentiment_compound": 0.3736
        },
        {
            "id": "hylpbbi",
            "score": -3,
            "text": "ahh man the dems are back playing hardball with their “calls to expel”\n\nDo something or get off the pot. You’re wasting the last democratic majority we may ever see",
            "title_similarity": "0.6009044",
            "sentiment_compound": -0.2263
        },
        {
            "id": "hyl7kl8",
            "score": 6,
            "text": "TBH even a lot of Republicans want her gone.  She's an embarrassing mess.",
            "title_similarity": "0.6247659",
            "sentiment_compound": -0.5859
        },
        {
            "id": "hylrgqu",
            "score": -5,
            "text": "You throw out everyone who speaks at CPAC and there won’t be many of them left.",
            "title_similarity": "0.5866654",
            "sentiment_compound": 0.0
        },
        {
            "id": "hym0joo",
            "score": 2,
            "text": "Whatever appeals to the voter base y’all.",
            "title_similarity": "0.31447273",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyl2bnd",
            "score": -52,
            "text": "I think Greene should be expelled, but I worry about the GOP responding in kind when they take the House back later this year.\n\nThey'd expel the Squad and Pelosi and any other Democrat they please, and cite Greene as justification for it.",
            "title_similarity": "0.7641083",
            "sentiment_compound": -0.1655
        },
        {
            "id": "hyltxek",
            "score": -19,
            "text": "Cpac is a white nationals conference?",
            "title_similarity": "0.46035373",
            "sentiment_compound": 0.0
        },
        {
            "id": "hym1az6",
            "score": -7,
            "text": "Im fed up with all the scare tactics politicians use. I they want to take away your freedom your guns bla bla bla.\nI see the Ukranian president and wish our politicians were a little like that.",
            "title_similarity": "0.68103987",
            "sentiment_compound": 0.7357
        },
        {
            "id": "hylzl03",
            "score": -11,
            "text": "Who gives a shit? There are calls to expel her everyday for everything she says. Is this any different? No.",
            "title_similarity": "0.6050112",
            "sentiment_compound": -0.782
        },
        {
            "id": "hylimxq",
            "score": -8,
            "text": "Nothing will happen… why does it even get coverage anymore.",
            "title_similarity": "0.32463112",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyllw5b",
            "score": -2,
            "text": "I didn’t know MTG was speaking at CPAC",
            "title_similarity": "0.28198016",
            "sentiment_compound": 0.0
        },
        {
            "id": "hylhuhl",
            "score": -29,
            "text": "She’s from the South. This isn’t a surprise.",
            "title_similarity": "0.20405252",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hylmvi1",
            "score": 0,
            "text": "Literal, soup nazi. Amazing.",
            "title_similarity": "0.23160346",
            "sentiment_compound": 0.5859
        },
        {
            "id": "hym0dj3",
            "score": 0,
            "text": "Worn out call girl.",
            "title_similarity": "0.36914873",
            "sentiment_compound": -0.296
        },
        {
            "id": "hymrgdb",
            "score": 0,
            "text": "She needs more Ivermectin.",
            "title_similarity": "0.3473423",
            "sentiment_compound": 0.0
        },
        {
            "id": "hylt96f",
            "score": 3,
            "text": "[deleted]",
            "title_similarity": "0.31726855"
        },
        {
            "id": "hylef22",
            "score": -39,
            "text": "You can expel republicans for speaking at Republican rallies then? Edit ok so either me making a pithy comment that Republican events *are* white supremacist rallies, or people thought I totally didn’t realize where she was. \nStill though, does anyone honestly believe the Republican Party isn’t the party of homophobic white supremacy by and large? Meh.",
            "title_similarity": "0.7669457",
            "sentiment_compound": 0.8156
        },
        {
            "id": "hyloaxd",
            "score": -60,
            "text": "[deleted]",
            "title_similarity": "0.31726855"
        },
        {
            "id": "hylgob3",
            "score": -11,
            "text": "The Guardian Gazpacho said I read 10 articles last year. Wonder how many I need to read to get sent to the Gazpacho Gulag?",
            "title_similarity": "0.3797418",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyn0uph",
            "score": -4,
            "text": "Expel Antisemites Omar and Tlaib while your at it.  They all need to go.",
            "title_similarity": "0.6342766",
            "sentiment_compound": -0.4404
        },
        {
            "id": "hyn52j3",
            "score": -4,
            "text": "I’m all for her being an idiot but can we please just stop calling to expel people. It’s a slippery slope. Her people elected her and from what I can tell no laws were broke. Being a shitty or dumb person isn’t breaking the law. It’s up to her constituents to not elect her.",
            "title_similarity": "0.6664113",
            "sentiment_compound": -0.9709
        },
        {
            "id": "hylt4f0",
            "score": -1,
            "text": "This is like the 50th time I’ve read this exact headline about something she said",
            "title_similarity": "0.34284258",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hylz4gm",
            "score": 1,
            "text": "Just a reminder As we say in Germany, if there’s a Nazi at the table and 10 other people sitting there talking to him, you got a table with 11 Nazis. Cough cough Democrats cough cough",
            "title_similarity": "0.4579637",
            "sentiment_compound": 0.0
        },
        {
            "id": "hymhw7b",
            "score": 1,
            "text": "Oust her  by voting her out.\n\nBanning people from office for ideas you don't like is anti-democracy",
            "title_similarity": "0.7481444",
            "sentiment_compound": -0.2755
        },
        {
            "id": "hyll85y",
            "score": -40,
            "text": "Labeling someone or something as white supremacist, racist, nazi, etc. isn't enough, seeing as those labels are thrown around so loosely.\n\nI'm curious as to what these speakers specifically advocate for that is problematic/unacceptable.",
            "title_similarity": "0.5781253",
            "sentiment_compound": -0.235
        },
        {
            "id": "hylsg6d",
            "score": -16,
            "text": "Hear me out. Instead of canceling everyone, just vote. Go out there and out vote the racists pieces of shit putting those assholes in power",
            "title_similarity": "0.6555659",
            "sentiment_compound": -0.8979
        },
        {
            "id": "hylx6qf",
            "score": -15,
            "text": "All politicians suck",
            "title_similarity": "0.5158395",
            "sentiment_compound": -0.4404
        },
        {
            "id": "hyl3jc3",
            "score": -52,
            "text": "Blah blah blah. I can call for an Uber, I can call for a pizza, I can call for a dental appointment. \nCall all you want you spineless dickless woosies.\nYou'll DO NOTHING as usual.",
            "title_similarity": "0.48481345",
            "sentiment_compound": -0.2263
        },
        {
            "id": "hyltkfb",
            "score": 4,
            "text": "Is anyone even surprised at this point? \n\nCome on, nothing will happen.  We all know it.  \n\nThe republican party has lost its backbone.  They have members of their own party rooting Vladimir Putin and Russia on in an unprovoked war on Ukraine.  They are targeting civilians too.  Its fucking awful.  \n\nAnd these people are doing this stupid shit?  You can't tell me you \"didn't know\" who this man was. You always seem to be caught with white nationalists that you \"didn't know\" far too often.\n\nI mean how many pictures and events with white nationalists do we need to have you go to for us to start believing that you actually are a white nationalist?  I would say the amount MTG  has makes her extremely suspect.  Not to say anything of her political views.\n\nDidn't realize we were going to slide backwards on being tolerant towards others, but I guess fear sells.",
            "title_similarity": "0.6718243",
            "sentiment_compound": -0.8986
        },
        {
            "id": "hyn95rn",
            "score": -8,
            "text": "[removed]",
            "title_similarity": "0.29644835"
        },
        {
            "id": "hylrxb1",
            "score": -44,
            "text": "\"White Nationalist Event!!??\" LOL!! 😂 Gtfoh with that racist BULLSHIT!! 💩 What about all the black, brown, and yellow people that were there?? It's about right and wrong, not about skin color. How pathetic.",
            "title_similarity": "0.6096186",
            "sentiment_compound": -0.919
        },
        {
            "id": "hyldfqp",
            "score": 0,
            "text": "Not worth the time. Never enough votes.",
            "title_similarity": "0.30765367",
            "sentiment_compound": -0.1695
        },
        {
            "id": "hyllelz",
            "score": -4,
            "text": "[deleted]",
            "title_similarity": "0.31726855"
        },
        {
            "id": "hynbw4c",
            "score": -3,
            "text": "Expelling her is the privilege of her voting constituents.  Their determination is a reflection of the moral will of the electorate of her district.  And THEY should bear the social and economic consequences of that determination.\n\nFreedom of speech, freedom of assembly and freedom of association should not be abridged nor should it be punished by the government because the speech is unpleasant, hateful or disturbing.",
            "title_similarity": "0.61887646",
            "sentiment_compound": 0.743
        },
        {
            "id": "hylblt7",
            "score": 7,
            "text": "Don't hold your breath. The QOP will figure out a way to keep her in office. The Dems will help by doing nothing.",
            "title_similarity": "0.43490875",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hylsrpj",
            "score": -9,
            "text": "Expelling for attendance is weak. What did she say?",
            "title_similarity": "0.50160766",
            "sentiment_compound": -0.6705
        },
        {
            "id": "hym51l9",
            "score": -1,
            "text": "Now im all for that, as long as we arent using \"white nationalist\" as an inflammatory term for something that isnt at all white nationalist. I could read the article, but fuck US politicians",
            "title_similarity": "0.68697065",
            "sentiment_compound": -0.6956
        },
        {
            "id": "hylniiw",
            "score": -25,
            "text": "Can someone explain the direct correlation of this event to white nationalism. I couldn’t seem to find explanations other than “it’s white nationalism”.",
            "title_similarity": "0.53533334",
            "sentiment_compound": 0.0
        },
        {
            "id": "hylp6bv",
            "score": 0,
            "text": "lol good luck with that",
            "title_similarity": "-0.04739598",
            "sentiment_compound": 0.8271
        },
        {
            "id": "hylqjup",
            "score": 0,
            "text": "‘Calls to expel’. Right.  Nothing ever happens to these idiots.  Yet, here we are giving her the attention she loves.",
            "title_similarity": "0.4703877",
            "sentiment_compound": 0.7269
        },
        {
            "id": "hylw6b7",
            "score": 0,
            "text": "[deleted]",
            "title_similarity": "0.31726855"
        },
        {
            "id": "hylyj90",
            "score": 0,
            "text": "I believe is looking at the heart and see who desires to help the people and stand together",
            "title_similarity": "0.24324857",
            "sentiment_compound": 0.7845
        },
        {
            "id": "hylymtz",
            "score": 0,
            "text": "As individuals, this country has advanced so far, although they the idea of having to follow individuals who claim to represent the population contribute to undermine our democracy. These people contribute to their own benefits although it does not follow the representative democracy they claim. As a country we must come together and elect individuals who will truly represent us if posible",
            "title_similarity": "0.45158172",
            "sentiment_compound": 0.6486
        },
        {
            "id": "hym639j",
            "score": 0,
            "text": "From America? Awesome. How can I help?",
            "title_similarity": "0.27383617",
            "sentiment_compound": 0.7998
        },
        {
            "id": "hym7j1l",
            "score": 0,
            "text": "Narrator: they didn’t.",
            "title_similarity": "0.1649609",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyms9di",
            "score": 0,
            "text": "And nothing will happen because stupid is as stupid does and laser brain there will just get right back to those deep as a puddle thoughts",
            "title_similarity": "0.45938256",
            "sentiment_compound": -0.7783
        },
        {
            "id": "hyn1co4",
            "score": 0,
            "text": "“On Saturday, Greene sought to defend her appearance at AFPAC. She told CBS News: “I went to talk to them about America First policies and I talked to them about what’s important for our country going forward.\n\n“Now, in regards to Russia, Putin is a murderer and he should never have invaded Ukraine. What he is doing is completely wrong. I stand with our Nato member allies and I’m completely against this war. Everything that he’s doing is wrong. He’s killing people over and over so I’m staunchly against it and I’m staunchly against Vladimir Putin and his invasion of Ukraine.”\n\nAsked if she endorses Fuentes’s views, Taylor Greene claimed: “I don’t know what his views are.”\n\nThis article is misrepresenting her",
            "title_similarity": "0.6811745",
            "sentiment_compound": -0.9598
        },
        {
            "id": "hynb2yz",
            "score": 0,
            "text": "Nahh keep her there as a constant reminder of just how far in the gutter the Republican Party has fallen",
            "title_similarity": "0.6061293",
            "sentiment_compound": 0.0516
        },
        {
            "id": "hyrflqo",
            "score": 0,
            "text": "White nationalists? Lmao. Ok. The lies people tell themselves to validate their own perceptions is amazing.",
            "title_similarity": "0.5017212",
            "sentiment_compound": 0.8126
        },
        {
            "id": "hzfpegy",
            "score": 0,
            "text": "She’s a red",
            "title_similarity": "0.2902143",
            "sentiment_compound": 0.0
        },
        {
            "id": "i0ehvf6",
            "score": 0,
            "text": "That article calls the January 6th protest an \"insurrection.\" I would find a more reliable source.",
            "title_similarity": "0.5853065",
            "sentiment_compound": -0.25
        },
        {
            "id": "i0hgq7h",
            "score": 0,
            "text": "The story is almost unreadable. Gossip and innuendo could have been told by my loony leftist neighbor. It’s sickening how perverted the news has gotten lately and my number one reason for moving away from all of it. And yet almost like trained seals some move in and pounce on garbage news stories like they are the gospel. Critical thinking is about hearing a news story and looking for facts and taking a step back and thinking if it’s garbage or not. When I see a story about Joe and how his cognitive health is a problem, I think about the vast amount of evidence to this point. When I used to read about the cringe worthy tweets from Trump, I would do my own investigations and find that “yes”, they were not good. Obama and his grandma crossing the street to avoid black people? Ok, where’s the story line? I’m not changing minds here but, I’m telling you to engage yours.",
            "title_similarity": "0.5810269",
            "sentiment_compound": -0.3117
        },
        {
            "id": "i0xwwqo",
            "score": 0,
            "text": "Why would they expel her for speaking to their base?",
            "title_similarity": "0.67357755",
            "sentiment_compound": -0.4404
        },
        {
            "id": "hymqnct",
            "score": -10,
            "text": "This is CPAC. It is not a white nationalist event. There were several minority speakers. This is journalistic malpractice at best and borderline propaganda.",
            "title_similarity": "0.5122136",
            "sentiment_compound": 0.4939
        },
        {
            "id": "hyluos9",
            "score": -32,
            "text": "What is white nationalism? People who use that term to slander people just don't like white people simple as. Keep crying.",
            "title_similarity": "0.56075",
            "sentiment_compound": -0.6381
        },
        {
            "id": "hyllwab",
            "score": -6,
            "text": "Sorry the voters in her House district elected her and they're stuck until her term is up.",
            "title_similarity": "0.6104713",
            "sentiment_compound": -0.3182
        },
        {
            "id": "hym1fmx",
            "score": -5,
            "text": "What white nationalist event was this?\n\nDownvoted: what the fuck it’s just a question",
            "title_similarity": "0.61621296",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hynlfnk",
            "score": -5,
            "text": "Joe Biden is ruining everything, but please, continue to snivel and whine about Trump.",
            "title_similarity": "0.53059494",
            "sentiment_compound": -0.2023
        },
        {
            "id": "hylgojh",
            "score": 11,
            "text": "CPAC still didn’t have a problem with her speaking. Party of nazi family values",
            "title_similarity": "0.32044142",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hylgjft",
            "score": -59,
            "text": "This is hilarious - white national event … give me a break. It’s CPAC #FJB",
            "title_similarity": "0.5300137",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hynbvdd",
            "score": -6,
            "text": "Joe Biden attended the funeral of a head klansman. Spoke very highly of him.",
            "title_similarity": "0.40315336",
            "sentiment_compound": -0.3612
        },
        {
            "id": "hyl9d3x",
            "score": 12,
            "text": "They wont. They are already vocal about embracing white supremacy.",
            "title_similarity": "0.5254543",
            "sentiment_compound": 0.0516
        },
        {
            "id": "hylm76g",
            "score": -1,
            "text": "Expel her?\n\nWhat does she even actually do all day at this point beyond make herself look more ignorant ?\n\nI think she has effectively expelled herself, not that it shouldn't be formalized.",
            "title_similarity": "0.67171997",
            "sentiment_compound": -0.5794
        },
        {
            "id": "hylnkvt",
            "score": 1,
            "text": "In a proper country this would be common sense. We truly are a country full of idiots.",
            "title_similarity": "0.42648846",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hylodtd",
            "score": 1,
            "text": "What was the event? The republican National Convention?",
            "title_similarity": "0.50358284",
            "sentiment_compound": 0.0
        },
        {
            "id": "hylopb4",
            "score": 1,
            "text": "People like her make me concerned about my future in this country. I really hope that if I move to the UK or somewhere in the EU someday it will be because of job opportunities rather than just wanting to live in a civilized country.\n\nFuck these traitors.",
            "title_similarity": "0.48144695",
            "sentiment_compound": 0.5849
        },
        {
            "id": "hylpuu6",
            "score": 1,
            "text": "Stop talking about doing it and DO IT!",
            "title_similarity": "0.29409975",
            "sentiment_compound": -0.3595
        },
        {
            "id": "hylpvqr",
            "score": 1,
            "text": "Yes and toss her in prison.",
            "title_similarity": "0.43780416",
            "sentiment_compound": -0.1531
        },
        {
            "id": "hylqmb7",
            "score": 1,
            "text": "Let’s take out the trash",
            "title_similarity": "0.35314947",
            "sentiment_compound": 0.0
        },
        {
            "id": "hylqtfh",
            "score": 1,
            "text": "She needs to be dealt with.",
            "title_similarity": "0.26068783",
            "sentiment_compound": 0.0
        },
        {
            "id": "hylqxo5",
            "score": 1,
            "text": "You know, MTG is a complete shit stain, but she was elected by other shit stains to represent them and she's doing it exactly the way they want her to. Isn't that just democracy in action?",
            "title_similarity": "0.5786454",
            "sentiment_compound": -0.775
        },
        {
            "id": "hylrw7q",
            "score": -1,
            "text": "This article is asa",
            "title_similarity": "0.11370589",
            "sentiment_compound": 0.0
        },
        {
            "id": "hylsp82",
            "score": 1,
            "text": "If we expel her, she very likely ends up as a host on FOX News/OANN/Newsmax, where she can portray herself as a martyr and have a bigger audience than what she currently has.\n\nBest to leave her in Congress with no committee assignments.",
            "title_similarity": "0.68271327",
            "sentiment_compound": -0.0258
        },
        {
            "id": "hylt299",
            "score": -1,
            "text": "I have zero faith in the system. She will probably end up running as the GOP contender for 2024 and win.",
            "title_similarity": "0.5965334",
            "sentiment_compound": 0.7964
        },
        {
            "id": "hylt50y",
            "score": 1,
            "text": "Racists everywhere in government and a war with Russia. Nothing ever changes.",
            "title_similarity": "0.45267487",
            "sentiment_compound": -0.8126
        },
        {
            "id": "hyltauw",
            "score": -1,
            "text": "This is who she is.   Expose it let all see and hear it.     If the good people of her district are proud of her and share those views.   Do not give her a platform to walk it back.  Say it own. Play it let all see who they praise.",
            "title_similarity": "0.46422672",
            "sentiment_compound": 0.9118
        },
        {
            "id": "hyltmsk",
            "score": -1,
            "text": "Omg get this dumb bihh outta here already!",
            "title_similarity": "0.44565305",
            "sentiment_compound": -0.633
        },
        {
            "id": "hyltoui",
            "score": 1,
            "text": "She's just addressing her supporters who happens to be racist white nationalists. Got nothing to do with her being a racist white nationalist herself.\n\n/s",
            "title_similarity": "0.6899765",
            "sentiment_compound": -0.7269
        },
        {
            "id": "hyltrx0",
            "score": -1,
            "text": "I kind of wish we’d stop giving her any attention at all. She’s just a distraction that draws all attention away from the likes of people like Josh Hawley. MTG is just a pawn, imo.",
            "title_similarity": "0.6047455",
            "sentiment_compound": 0.6494
        },
        {
            "id": "hylvdx7",
            "score": 1,
            "text": "I better consult r/conservative for a really balanced res-.... oh I'm banned there. Um huh.\n\nThis post, right here. \n\nIt wasn't the plural blm marches, it wasn't voting for useless democrats, it wasn't any violent action, it wasn't  antifasc comments, it was the dumb joke comment assuming I was banned that got me banned. \n\n\nBut that second amendment,  that's the really important one.",
            "title_similarity": "0.6138796",
            "sentiment_compound": 0.1971
        },
        {
            "id": "hylw3u0",
            "score": -1,
            "text": "Too bad she’s not a senator, huh?\n\nedit- don't see what was wrong with this comment. the repub senators all seem to be on their best behavior so there's no way one of them gets ejected to make way for a tie breaker who will actually vote for the stuff we need. House republicans on the other hand can apparently be absolute animals just to see how far they can push the line because they don't have anything to lose right now.",
            "title_similarity": "0.50342727",
            "sentiment_compound": -0.5233
        },
        {
            "id": "hylwnuo",
            "score": 1,
            "text": "This is where we are at, so called “republicans” supporting white nationalism, nazis, and putin? If this was WWII they would have been ousted very quickly. McCarthy had trials about people supporting the enemy, and now they work in congress.",
            "title_similarity": "0.7021826",
            "sentiment_compound": 0.3744
        },
        {
            "id": "hylxetl",
            "score": -1,
            "text": "So an admission that CPAC is a white nationalist event.",
            "title_similarity": "0.5104827",
            "sentiment_compound": 0.0
        },
        {
            "id": "hylxzuv",
            "score": 1,
            "text": "This is scary. A large part of our country thinks this is not only ok, but is the direction they want our nation to move in. What has happened to America? How can we right the ship? I've tried getting through to many of my conservative family members, and they are all stalwart in their descent into madness. They all say the same exact things, as if they were given a script to read from. I don't know how to help them.",
            "title_similarity": "0.62394106",
            "sentiment_compound": -0.3204
        },
        {
            "id": "hylyouk",
            "score": -1,
            "text": "The first sentence reads that she was at a white nationalist event with Putin. How about learning how to write.",
            "title_similarity": "0.60159796",
            "sentiment_compound": 0.0772
        },
        {
            "id": "hylzlps",
            "score": -1,
            "text": "Calls by whom? Us? Like if that matters to them…",
            "title_similarity": "0.22515832",
            "sentiment_compound": 0.4515
        },
        {
            "id": "hylzyjo",
            "score": -1,
            "text": "Pretty sure last name Fuentes is Spanish what gives?",
            "title_similarity": "0.27551886",
            "sentiment_compound": 0.6705
        },
        {
            "id": "hym1p3b",
            "score": 1,
            "text": "We should continue screaming into the void telling the GOP what they should do with their membership. It’s extremely productive. Spending all out time virtue signaling while accomplishing almost none of our comparing promises. /s\n\nYou know how you prevent nazis from taking shit over? Give people economic security. Not a living wage but a middle class wage for an honest days work. If our political system keeps rewarding corporations and allowing the 1% to horde wealth we have just as much of a chance of ending up full on fascist than any other possible outcome.\n\nWhat does everyone think the firepower distribution by political party is? I’d bet it skews right by a metric fuck ton. Scary times we live in now. I hope we figure it out.\n\nEdit: grammar",
            "title_similarity": "0.57233316",
            "sentiment_compound": 0.8753
        },
        {
            "id": "hym3un8",
            "score": 1,
            "text": "She probably **represents** her constituents, as is her job.",
            "title_similarity": "0.34074956",
            "sentiment_compound": 0.0
        },
        {
            "id": "hym4rl5",
            "score": 1,
            "text": "I mean I know she’s especially ridiculous but there’s lots of prominent Republicans that speak at CPAC.",
            "title_similarity": "0.5237042",
            "sentiment_compound": 0.2625
        },
        {
            "id": "hym89bk",
            "score": -1,
            "text": "ugly ugly ugly little man",
            "title_similarity": "0.2215595",
            "sentiment_compound": -0.872
        },
        {
            "id": "hymdsns",
            "score": -1,
            "text": "I never really knew much about her until she went on the Timcast IRL show and after that episode total change of mind on her. That lady has my complete respect on the Timcast IRL podcast she stated that the congress does voice votes on bills and they are not registered so you do not know who you rep voted on. they also on vice votes have limited reps voting so the majority of the states are not properly represented. And  since they kicked her out of all the committees she was on she spend her time on the floor calling for roll call votes. \n\nThis forces all of congress back to make them vote on record and the first time she did this the bill would of allowed felons in prison to vote. And Rep Thomas Massey back this statement up on the second episode of TImcast IRL that she went on. Also even if CPAC was organized by Nick Fuentes she rejected his views. And why would you want to kick out a member of congress that want to force them to do their jobs in fact we need more like this in my opinion.",
            "title_similarity": "0.61880696",
            "sentiment_compound": -0.2516
        },
        {
            "id": "hymit8r",
            "score": -1,
            "text": "Shut the F up already. Nothing could do anything to her. The only way to get rid of her is to have a Dem wins her seat in her district. But her district elected her because they are as crazy as her. They are Qanon followers. She is here and will be there for years to come. That is a reality. Hopeless.",
            "title_similarity": "0.62654805",
            "sentiment_compound": -0.6956
        },
        {
            "id": "hymo98a",
            "score": 1,
            "text": "But loads of people get away with speaking at CPAC.",
            "title_similarity": "0.321715",
            "sentiment_compound": 0.0
        },
        {
            "id": "hymsauq",
            "score": 1,
            "text": "As a non-American when i read something like this headline i never know if the article is about actual white nationalist/supremacists or if its just slander about completely reasonable people. And i think thats a shame.",
            "title_similarity": "0.60589385",
            "sentiment_compound": -0.1531
        },
        {
            "id": "hymuhgu",
            "score": -1,
            "text": "CPAC happens every year and no calls to kick them out. Why the sudden change, and why just her?",
            "title_similarity": "0.48993546",
            "sentiment_compound": -0.296
        },
        {
            "id": "hymz74e",
            "score": -1,
            "text": "> Calls to Expel White Nationalist Marjorie Taylor Greene from White Nationalist Party Intensify!\n\nI'm so sick of these articles.  Pointless.",
            "title_similarity": "0.7537373",
            "sentiment_compound": -0.694
        },
        {
            "id": "hyn4fwx",
            "score": -1,
            "text": "If anyone wants to listens to her stances on domestic corporate policy, lobbying and congressional transparency they might figure out why corporate media and Neo-cons hate her so much.",
            "title_similarity": "0.66551185",
            "sentiment_compound": -0.6124
        },
        {
            "id": "hyn5qt6",
            "score": -1,
            "text": "Ooohhh white nationalist event. Me so scared",
            "title_similarity": "0.58147883",
            "sentiment_compound": -0.5777
        },
        {
            "id": "hyn7wu3",
            "score": 1,
            "text": "I sometimes sort the front-page by \"new\" and see r/conse rvative posts (that sub is not the actual conservative subreddit but a neofascist, unbanned  version of the_donald) and apparently some black people were invited to this event so therefore it CANNOT be a white nationalist event.  Kind of like how the ProudBoys are run by a latino so they are basically an equality group.",
            "title_similarity": "0.4890305",
            "sentiment_compound": 0.4235
        },
        {
            "id": "hynaw1q",
            "score": -1,
            "text": "No",
            "title_similarity": "0.15487781",
            "sentiment_compound": -0.296
        },
        {
            "id": "hynayhi",
            "score": 1,
            "text": "It won't work. As much as reddits been spouting about white nationalist, they're going to have a hard time convincing serious people when the only evidence is nick Fuentes.",
            "title_similarity": "0.618476",
            "sentiment_compound": 0.25
        },
        {
            "id": "hynnqly",
            "score": -1,
            "text": "A whole Queen 😍",
            "title_similarity": "0.33981612",
            "sentiment_compound": 0.4588
        },
        {
            "id": "hyns3hg",
            "score": -1,
            "text": "America First is a pac, not a white nationalist organization.",
            "title_similarity": "0.41145933",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyom429",
            "score": -1,
            "text": "Are they referring to CPAC as a white supremacist event? Not sure why they chose that thumbnail.",
            "title_similarity": "0.59802073",
            "sentiment_compound": -0.1184
        },
        {
            "id": "hylu9ow",
            "score": -13,
            "text": "Y'all sound like Putin.",
            "title_similarity": "0.31781828",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hylwwzd",
            "score": -15,
            "text": "“White nationalist advent” so biased lmfaoo. This is just a leftist circle jerk",
            "title_similarity": "0.6197355",
            "sentiment_compound": -0.6299
        },
        {
            "id": "hylli9k",
            "score": 2,
            "text": "How can you expel a representative of the white national party from the white national party?",
            "title_similarity": "0.76630485",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hyllvkv",
            "score": 2,
            "text": "MTG is a complete and total fraud and embarassment to our country.  I'm surprised she's still in the House.",
            "title_similarity": "0.51934725",
            "sentiment_compound": -0.4927
        },
        {
            "id": "hylmga5",
            "score": 2,
            "text": "There’s calls every day it means nothing, like an online petition. We can’t do shit, we elect people to represent our wishes and then they just don’t.",
            "title_similarity": "0.4557558",
            "sentiment_compound": -0.6261
        },
        {
            "id": "hylo46f",
            "score": -2,
            "text": "Still? Get a grip corp media. Reddit are you even paying attention??????",
            "title_similarity": "0.48815623",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyloeee",
            "score": 2,
            "text": "in terms of the nazi doomsday clock we are about 5 seconds to midnight.",
            "title_similarity": "0.37648442",
            "sentiment_compound": -0.5859
        },
        {
            "id": "hylsfsd",
            "score": 2,
            "text": "The republican party needs to be dissolved and its leadership imprisoned as the criminal organization that it is.",
            "title_similarity": "0.6389465",
            "sentiment_compound": -0.5719
        },
        {
            "id": "hylt0cs",
            "score": 2,
            "text": "I wonder how republicans can defend this (that was rhetorical)",
            "title_similarity": "0.46667963",
            "sentiment_compound": 0.0
        },
        {
            "id": "hylt0y2",
            "score": 2,
            "text": "The party of stupid and deception robbing their constituents of their hard-earned cash.\n\nReform campaign finance law.",
            "title_similarity": "0.60008657",
            "sentiment_compound": -0.5574
        },
        {
            "id": "hyltbj3",
            "score": 2,
            "text": "Is there a list of things that automatically remove you from office? \n\nIf not, there should be— and being a “white nationalist” should be one of them.",
            "title_similarity": "0.72635996",
            "sentiment_compound": 0.0
        },
        {
            "id": "hylteij",
            "score": 2,
            "text": "This woman is crazy, thats all I know.",
            "title_similarity": "0.3839428",
            "sentiment_compound": -0.34
        },
        {
            "id": "hylth71",
            "score": 2,
            "text": "The Republican Party has no problem with this and there won’t be any pressure for her to leave. They are plain rot.",
            "title_similarity": "0.45486856",
            "sentiment_compound": 0.3732
        },
        {
            "id": "hyltjk6",
            "score": 2,
            "text": "So a normal GOP event.",
            "title_similarity": "0.0778174",
            "sentiment_compound": 0.0
        },
        {
            "id": "hylu1i5",
            "score": -2,
            "text": "I’m thankful that this is one of our biggest problems in the US",
            "title_similarity": "0.22971267",
            "sentiment_compound": 0.25
        },
        {
            "id": "hylz33c",
            "score": -2,
            "text": "Pretty sure you’re allowed to be a white nationalist and a member of congress. I hate it but it’s true.",
            "title_similarity": "0.5813556",
            "sentiment_compound": 0.6249
        },
        {
            "id": "hym3uqr",
            "score": -2,
            "text": "Why stop there. We need to come together and fire all of them. They have forgotten they work for us . They were only supposed to serve a turn maybe 2 then go back to their lives. But they changed laws to make those jobs careers.. this is what needs to be done. See they spend so much on elections. That they need money from big business. For later favors. By the time they get a seat they owe so many favors they are pretty much useless.\n\n1 so fire them all.\n\n2 Set limit's on how much on can spend on an election.\n\n3 Set term limits.\n\n4 have elections with new younger candidates that might have better /new ideas. They won't owe a bunch of favors to big business. Only then we might  pull this county back up to where we used to be. And get shit done.\n\n5 make it to where the incoming president can't spend have of his term trying to reverse things done by the last president . Stop this two steps forward one step back cycles we are stuck in.\n\n6 figure out a reasonable cut off age for a president.\n\n7 no celebrity is allowed to ever run again.",
            "title_similarity": "0.61453784",
            "sentiment_compound": -0.8615
        },
        {
            "id": "hym4ug5",
            "score": -2,
            "text": "oRanGez..baD..",
            "title_similarity": "0.26206142",
            "sentiment_compound": 0.0
        },
        {
            "id": "hym9xm4",
            "score": -2,
            "text": "The answer to communism is fascism.",
            "title_similarity": "0.42551747",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyma36i",
            "score": 2,
            "text": "Stop giving her attention",
            "title_similarity": "0.38073823",
            "sentiment_compound": 0.0516
        },
        {
            "id": "hymsbjh",
            "score": 2,
            "text": "No fucking nazi should anywhere near politics. I'm tired of us not calling them what they are.",
            "title_similarity": "0.5280982",
            "sentiment_compound": -0.6249
        },
        {
            "id": "hymz56q",
            "score": -2,
            "text": "Stop the cancel culture bullshit with republicans it does not work she could literally get on TV drop N-bombs and nothing would happen focus on putting pressure on democrats into the doing the right thing and fighting back politically against republicans…stop crying about the  latest bullshit outrage a republican has done they don’t care and they love triggering democrats",
            "title_similarity": "0.65354073",
            "sentiment_compound": -0.9393
        },
        {
            "id": "hyn8chy",
            "score": -2,
            "text": "I call to ban you from this sub.",
            "title_similarity": "0.5902002",
            "sentiment_compound": -0.5574
        },
        {
            "id": "hynf08g",
            "score": -2,
            "text": "I’d like to hear the speech before saying it was white nationalist.",
            "title_similarity": "0.62516177",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hynn65m",
            "score": -2,
            "text": "As the next 2024 president said:\n\n\"Under our leadership the world was a peaceful place because America was strong and the perception of our country was like it never was before: powerful, cunning and smart. Now we are a STUPID country,” Mr Trump said.",
            "title_similarity": "0.39464873",
            "sentiment_compound": 0.6411
        },
        {
            "id": "hylcwwu",
            "score": -60,
            "text": "CPAC is not a white nationalist event.",
            "title_similarity": "0.28361267",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyl7nn5",
            "score": 11,
            "text": "The good people of Georgia will expel her in November.",
            "title_similarity": "0.6928787",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyl557i",
            "score": 17,
            "text": "Soup Nazi!",
            "title_similarity": "0.3261649",
            "sentiment_compound": 0.0
        },
        {
            "id": "hylr22w",
            "score": -19,
            "text": "I just love how anyone that isn't a full blown socialist is a far right extremist, white nationalist and putin sympathiser in the eye of the media nowadays. If you're gonna call AFPAC a white nationalist event, you probably shouldn't write in a major news outlet.  \n\n\nY'all elected a man that called Obama the first clean and articulate black man, which is the most racist thing i've ever heard in my entire life.",
            "title_similarity": "0.5796845",
            "sentiment_compound": 0.3832
        },
        {
            "id": "hylsfxk",
            "score": -20,
            "text": "Sorry not gonna happen. Cpac 2022 was amazing loved every second of it, how could you not if you are a true patriot.",
            "title_similarity": "0.2704537",
            "sentiment_compound": 0.8807
        },
        {
            "id": "hylqhgk",
            "score": -2,
            "text": "White nationalist event huh",
            "title_similarity": "0.41661173",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyls17f",
            "score": -1,
            "text": "American politics are trash - dig deep enough, even the american liberals would make centrists in Europe and Canada blush",
            "title_similarity": "0.6241927",
            "sentiment_compound": 0.0
        },
        {
            "id": "hylt4gm",
            "score": 3,
            "text": "Should be calling to expel all republicans. They were complicit in the insurrection.",
            "title_similarity": "0.69512624",
            "sentiment_compound": -0.4404
        },
        {
            "id": "hyltq46",
            "score": -5,
            "text": "Oh whatever, call me those calls for resignation come from her the majority of her own party.",
            "title_similarity": "0.61784995",
            "sentiment_compound": 0.128
        },
        {
            "id": "hymxs89",
            "score": -3,
            "text": "Why are black people talking at a white nationalist event? It can’t be a white nationalist event if black people speak at it. I’m so confused",
            "title_similarity": "0.55766773",
            "sentiment_compound": -0.4572
        },
        {
            "id": "hyn41lt",
            "score": -3,
            "text": "Wait. Lol. Was it CPAC?  Fucking great troll",
            "title_similarity": "0.22875753",
            "sentiment_compound": 0.8016
        },
        {
            "id": "hyn5b44",
            "score": -3,
            "text": "Uhhh….don’t forget that all that was debunked just here recently. You actually need to read the news, don’t believe everything you’re told. There are propaganda being delivered on both sides.",
            "title_similarity": "0.5034282",
            "sentiment_compound": -0.4404
        },
        {
            "id": "hyn74xw",
            "score": -3,
            "text": "I never really listened to her but my friend sent me the interview she did with cuck Tim Pool and all I gotta say is…holy hell the media lies",
            "title_similarity": "0.51609623",
            "sentiment_compound": -0.7783
        },
        {
            "id": "hynaeun",
            "score": -2,
            "text": "Written 20+ years ago\n\nGive Us Barabbas\nA Divided Country, The Cause and Cure\n  \n  By Roy Masters\n    \n\"...Because a nation with values is almost impossible to conquer, Communist and atheist strategists began their systematic attack upon the American family early in the 20 th century. They infiltrated our once-noble institutions of education, media, and government, so that the powerful few would dominate the docile many. The Soviet Union collapsed, but the seed, once planted here, took root. The result is two Americas in conflict, with the perpetrators of the quiet coup accusing the innocent.\n\nThey began by infiltrating our educational system and through that they made the government finance America’s own downfall. They dumbed down our children in government schools and enabled them to grow up from irresponsible teenagers into spoiled-rotten and immoral parents.\n\nThen they praised and excused their victims’ wildness and let them believe they were acting from their own volition. They glorified that license as freedom; nurtured failings until it became hateful envy, and held up filth as art to arouse passions to the level of addiction.\n\nTo confound us more, they promoted a debilitating dependency on “experts”; designed government “mental health” programs to make perversion, as well as mental and emotional illness, seem normal; threw money at social problems to produce wrong solutions; drove women out of their homes to work, leaving their children vulnerable; awakened unmanageable desires with obscene images; stimulated the young with pornography; glorified lowlife musicians and actors in order to sustain anti-social behaviors; made American family life cruel, base, and meaningless; doped up students to “learn”---and then blamed the whole mess on fathers and capitalism.\n\nAll this, to weaken our national resolve and render us suggestible to the demands of terrorists in every form.\n\nThen, when the programmers deem it time, they accuse the honorably elected of being tyrants and liars, just like their own rotten dads were. They use the “hate-your-father-love-your-mother” media to render those perceived deadbeat dads powerless and the nation leaderless…\n\n..University-programmed journalists---elitist intellectuals and rebels against traditional fatherly discipline---with all their enabling feminine sensitivities, will then hail terrorists as heroes fighting for their rights against bullies.\n\nBecause propaganda alters our perception of reality, good becomes evil and evil becomes good, as in Nazi Germany. The biblical “Give us Barabbas” mentality is here again…”...”Much worse is in store for America.\n\nKnowing that the corrupted are their slaves, the programmers have created two cultures in conflict, one of them opposed to the Founding Fathers’ intent. If they cannot get their way “democratically,” they will incite a civil war. ...Now do you see why the God-centered family is the target for destruction?....\n\nThis toxic culture is no accident: it is the result of a sophisticated psycho-political battle for our minds and hearts. Awaken now---turn from your manipulators’ cunning and forgive them. Throw away your drugs and booze; come home to family through the truth that makes and keeps us free.\"\nRoy Masters",
            "title_similarity": "0.6516156",
            "sentiment_compound": -0.9937
        },
        {
            "id": "hynefmq",
            "score": -4,
            "text": "[removed]",
            "title_similarity": "0.29644835"
        },
        {
            "id": "hynha9r",
            "score": -4,
            "text": "Have you tried eating less avocado toast?",
            "title_similarity": "0.36122876",
            "sentiment_compound": 0.0
        },
        {
            "id": "hynicnp",
            "score": -2,
            "text": "Holy fuck CPAC is NOT a white nationalist event. What in the actual fuck is wrong with all of you??????????? Go watch the event if you actual believe this PLEASE. Humanity is  at stake. You are being lied to on a massive scale….",
            "title_similarity": "0.59282446",
            "sentiment_compound": -0.8784
        },
        {
            "id": "hynsd64",
            "score": -3,
            "text": "But I bet you can speak at a black life matters rally and get applause 🙄 double standards",
            "title_similarity": "0.46505687",
            "sentiment_compound": 0.5927
        },
        {
            "id": "hylu7b7",
            "score": -12,
            "text": "Lol strawmaning much?",
            "title_similarity": "0.12130713",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hym328u",
            "score": -14,
            "text": "Actually just a republican convention, libbies are always the racists 🤡",
            "title_similarity": "0.6476978",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hylmgy6",
            "score": -4,
            "text": "> at white nationalist event\n\nCPAC?",
            "title_similarity": "0.53510267",
            "sentiment_compound": 0.0
        },
        {
            "id": "hylr97g",
            "score": 4,
            "text": "A Republican cozying up to racists??? Oh no who would’ve thought",
            "title_similarity": "0.60933554",
            "sentiment_compound": -0.7383
        },
        {
            "id": "hylzips",
            "score": -3,
            "text": "She was duly elected. Let her constituents vote her out.",
            "title_similarity": "0.57007515",
            "sentiment_compound": 0.0
        },
        {
            "id": "hym178v",
            "score": -5,
            "text": "I've noticed something it's all Republicans did a bad thing and I'm always confused like I thought this was politics not republican does oopsie",
            "title_similarity": "0.56481266",
            "sentiment_compound": -0.5106
        },
        {
            "id": "hym9l9w",
            "score": -4,
            "text": "White nationalist event lmao cpac??",
            "title_similarity": "0.4899652",
            "sentiment_compound": 0.644
        },
        {
            "id": "hynjct7",
            "score": -4,
            "text": "Is it illegal to speak in America?",
            "title_similarity": "0.54336035",
            "sentiment_compound": -0.5574
        },
        {
            "id": "hylx5o6",
            "score": -15,
            "text": "Am I missing something here? Isn’t Fuentes a troll or at the very least “edgy” content? She pretty clearly said she’s against what Putin is doing and I didn’t see anything else in there about white supremacy other than a shitty edge lord joke from Fuentes. People need to chill out. \n\nOn a side note it has been hilarious seeing the left media outlets trying to paint the right as white supremacists who support Putin because he’s white meanwhile he’s invading another white country. Another hilarious one is the people saying we should just switch to green energy tomorrow and the war is over it’s so easy. Wow thank you Twitter why didn’t uncle joe think of that ez fix.",
            "title_similarity": "0.70212334",
            "sentiment_compound": 0.9598
        },
        {
            "id": "hylmc73",
            "score": -17,
            "text": "[removed]",
            "title_similarity": "0.29644835"
        },
        {
            "id": "hylswyp",
            "score": -17,
            "text": "Wtf?? Reddit get a grip?'",
            "title_similarity": "0.31190157",
            "sentiment_compound": -0.6531
        },
        {
            "id": "hylgev2",
            "score": -5,
            "text": "Democrats will probably screw this up, but they really need a simple censure vote. Everyone on record. Slam Dunk. Should be anyway.",
            "title_similarity": "0.5920321",
            "sentiment_compound": -0.5574
        },
        {
            "id": "hylswjq",
            "score": 6,
            "text": "\"I'm not a racist, but I support racists, repeat the things racists say, and continually lay the groundwork for racism to thrive.  But I'm not a racist.\"\n\n-MTG, apparently",
            "title_similarity": "0.3815323",
            "sentiment_compound": -0.7998
        },
        {
            "id": "hylswn1",
            "score": -5,
            "text": "Still talking about Clinton… time to move on.",
            "title_similarity": "0.3504444",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyltqnh",
            "score": 4,
            "text": "Louis Theroux did a documentary on the exact group. They are quite clearly and evidently white nationalists.",
            "title_similarity": "0.5096977",
            "sentiment_compound": 0.4576
        },
        {
            "id": "hym4ens",
            "score": -6,
            "text": "[removed]",
            "title_similarity": "0.29644835"
        },
        {
            "id": "hym9spy",
            "score": -5,
            "text": "What law did she break?",
            "title_similarity": "0.50643384",
            "sentiment_compound": 0.0
        },
        {
            "id": "hymfv1k",
            "score": -7,
            "text": "The fact that this article categorized the event as a white nationalist event is exactly why the media and the left are the problem. I mean all it would take for anyone to do is watch the event for about 10 minutes to realize there’s no racial factor whatsoever and that the left clings on to the race baiting concept for votes is so blatantly obvious. Gross y’all",
            "title_similarity": "0.58988786",
            "sentiment_compound": -0.8055
        },
        {
            "id": "hymk5wq",
            "score": -4,
            "text": "“Everyone I dont like is racist and needs to be fired”",
            "title_similarity": "0.55346227",
            "sentiment_compound": 0.2755
        },
        {
            "id": "hymx7fq",
            "score": -5,
            "text": "Anyone know that she actually makes the rest of Congress show up to vote? She’s making them do their job. She’s not crazy as the media makes her out to be.",
            "title_similarity": "0.5114422",
            "sentiment_compound": 0.2584
        },
        {
            "id": "hymy2mr",
            "score": -5,
            "text": "Who would have predicted the left wing would go full McCarthism.\n\nI guess Russia is capitalistic now right?",
            "title_similarity": "0.42249775",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyn99b0",
            "score": 5,
            "text": "The GOP is a threat to humanity.",
            "title_similarity": "0.4787957",
            "sentiment_compound": -0.5267
        },
        {
            "id": "hynd3oy",
            "score": -5,
            "text": "If Liz Cheney doesn’t like it… it’s probably a good thing.\n\nP.S. White nationalists largely don’t exist in the mainstream anymore.",
            "title_similarity": "0.58466476",
            "sentiment_compound": 0.6597
        },
        {
            "id": "hyl5u2h",
            "score": 16,
            "text": "Please ! Do it !   This is why she’s lying now . Saying she didn’t know who these Nazi’s were ! Lol !",
            "title_similarity": "0.6097842",
            "sentiment_compound": 0.4344
        },
        {
            "id": "hylpq9j",
            "score": -17,
            "text": "I don’t think Fuentes is a white nationalist",
            "title_similarity": "0.43842918",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyludpg",
            "score": -17,
            "text": "So this is another everything is racist and everything you disagree with is bad. This country is built on the freedom to do what you want. When you want and to speak freely. We all don’t need to agree but remember who is behind all this. It’s the Political and rich elite that wants us peasants to fight among each other. We just need to ignore this rhetoric.",
            "title_similarity": "0.53885746",
            "sentiment_compound": 0.2023
        },
        {
            "id": "hylktsc",
            "score": -40,
            "text": "Didn’t you all know that the left own all the words and there meaning, that’s why they use hitlers name at will when it suits them, but don’t dare try and make a joke reference or it’s off to the gas chambers with you.",
            "title_similarity": "0.49270952",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hym60up",
            "score": -6,
            "text": "Black people have speeches there. Nice try",
            "title_similarity": "0.26557124",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hym7ndt",
            "score": -5,
            "text": "Where is the outcry for Biden voting against bills benefitting minorities?\n\nhttps://nymag.com/intelligencer/2019/03/joe-biden-record-on-busing-incarceration-racial-justice-democratic-primary-2020-explained.html\n\nSuch a warrior for racial justice.",
            "title_similarity": "0.64322555",
            "sentiment_compound": 0.4588
        },
        {
            "id": "hymb41q",
            "score": -7,
            "text": "It's funny how the self-proclaimed champions of democracy are always the ones calling to override the people's choice of representatives.",
            "title_similarity": "0.5061662",
            "sentiment_compound": 0.743
        },
        {
            "id": "hylaq09",
            "score": 25,
            "text": "Are there still people believing that fascism is only a fringe ideology among conservatives?",
            "title_similarity": "0.53545034",
            "sentiment_compound": 0.0
        },
        {
            "id": "hylrv8i",
            "score": -23,
            "text": "That isn't a white nationalist event. Wow Reddit is full of such ridiculous bias. Should maybe start actually getting the facts straight. Or actually using your brains instead of falling for stupid headlines like this.",
            "title_similarity": "0.58877796",
            "sentiment_compound": 0.0772
        },
        {
            "id": "hylovjs",
            "score": 7,
            "text": "I think civil war in America is unavoidable at this point. When you have half a political pary, an AMERICAN political party, praising a violent communist dictator, there’s no turning back from that mindset. This is what many Republicans want. An end of democracy so they can endlessly preach Christ, fleece the public and stay rich.",
            "title_similarity": "0.6561976",
            "sentiment_compound": 0.0258
        },
        {
            "id": "hym08wg",
            "score": -8,
            "text": "COAC isn’t white nationalist though",
            "title_similarity": "0.27414733",
            "sentiment_compound": 0.0
        },
        {
            "id": "hym1nfp",
            "score": -7,
            "text": "Will there be similar calls to expel those supporting White nationalist battalions in Ukraine?",
            "title_similarity": "0.6597693",
            "sentiment_compound": 0.0
        },
        {
            "id": "hym2i85",
            "score": -7,
            "text": "I called to expel y’all’s moms last night 😹😹😹",
            "title_similarity": "0.6451334",
            "sentiment_compound": 0.7003
        },
        {
            "id": "hymuh22",
            "score": -7,
            "text": "What a deceiving article! Pic is of Greene in front of CPAC sign. THAT’S NOT THE GROUP THAT THE ARTICLE MENTIONS!!!! \nAgain, bending facts to fit the liberal narrative! \nJournalism is less respectable than prostitution! And at least with prostitution you get what you pay for!",
            "title_similarity": "0.5941462",
            "sentiment_compound": 0.5385
        },
        {
            "id": "hymy5jy",
            "score": -7,
            "text": "Please Democrats hate free speech that’s obvious",
            "title_similarity": "0.57748467",
            "sentiment_compound": 0.2263
        },
        {
            "id": "hyna1e3",
            "score": -7,
            "text": "1st off, it's not a white nationalist event.\n\nI wish people would just debate the issues without the flame throwing.\n\n2nd, Biden, when he debated Paul Ryan, rolled his eyes when Ryan suggested Russia was a threat",
            "title_similarity": "0.5654967",
            "sentiment_compound": -0.1779
        },
        {
            "id": "hyndd8v",
            "score": -7,
            "text": "I don’t know what event she attended, but this is a political candidate, who I seriously doubt would attend a white nationalist event. I want proof showing that is was what the fake news is calling it is true.This is just another lie by the “Progressives” actually Regressive movement to smear anyone who doesn’t agree with them.",
            "title_similarity": "0.7263726",
            "sentiment_compound": -0.8402
        },
        {
            "id": "hylhihu",
            "score": 7,
            "text": "Trash.\n\nIsn't it ironic that she compares those opposite of her as being the \"Gazpacho soup\" police, yet they laugh at comparing Putin to Hitler \"they say that’s not a good thing\"?",
            "title_similarity": "0.5622152",
            "sentiment_compound": 0.3744
        },
        {
            "id": "hylqaoq",
            "score": -7,
            "text": "Hate Fuentes all you want, I do, but he constantly shit talks white nationalists and tons of groypers are non-white.",
            "title_similarity": "0.5838268",
            "sentiment_compound": -0.7964
        },
        {
            "id": "hylzejq",
            "score": -8,
            "text": "F for fake news",
            "title_similarity": "0.38628852",
            "sentiment_compound": -0.4767
        },
        {
            "id": "hym1kqn",
            "score": 9,
            "text": "Sort your shit out America. We have backed you for a long time and this is disgraceful. Get your house in order.",
            "title_similarity": "0.48086405",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hym56tw",
            "score": -9,
            "text": "“Everyone I don’t like is Hitler”",
            "title_similarity": "0.49874264",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hymg0d0",
            "score": -8,
            "text": "White Nationalists event? There were black and Hispanic speakers you dumb pathetic fucks, stupid ass pussy liberals why don’t you write facts motherfuckers.",
            "title_similarity": "0.6595807",
            "sentiment_compound": -0.9517
        },
        {
            "id": "hymi4wf",
            "score": -7,
            "text": "PROTIP: You can call for banishment of literally anyone anywhere by labeling anything they're associated with, as \"White Nationalist\" or \"White Supremacist\".",
            "title_similarity": "0.701173",
            "sentiment_compound": 0.128
        },
        {
            "id": "hyl45vd",
            "score": -110,
            "text": "Left extremists are dangerous to our nation.",
            "title_similarity": "0.5369897",
            "sentiment_compound": -0.4767
        },
        {
            "id": "hylgg1k",
            "score": 48,
            "text": "Serious question but are people in Georgia really this racist and/or stupid to keep electing this blabbering idiot? I mean she's a direct reflection of her constituents or the majority, correct?\n\nWhy do the keep voting for her? I haven't heard her ever say 1 thing that was based on fact.",
            "title_similarity": "0.65709555",
            "sentiment_compound": -0.9632
        },
        {
            "id": "hylu1d4",
            "score": -9,
            "text": "Stay off the front page you pretty dumb timewasters",
            "title_similarity": "0.52124643",
            "sentiment_compound": -0.0258
        },
        {
            "id": "hym4hyn",
            "score": -9,
            "text": "Ukraine nationalism good.....but  American nationalism bad.",
            "title_similarity": "0.41606495",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hym809v",
            "score": -8,
            "text": "And they gave Cunter Biden $30,000,000.00 for nothing huh?",
            "title_similarity": "0.48866272",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyncs0z",
            "score": -10,
            "text": "Anything to take focus off of Biden I guess.",
            "title_similarity": "0.3489628",
            "sentiment_compound": 0.0
        },
        {
            "id": "hylwpyf",
            "score": -10,
            "text": "There's always calls to expel politicians people don't like. That's undemocratic. If she's what the people she represents want, then that's it. It's not \"democracy, but only for people we like\". You don't like her, vote against her.",
            "title_similarity": "0.6891655",
            "sentiment_compound": -0.195
        },
        {
            "id": "hym0lvg",
            "score": -10,
            "text": "Freedom of speech, baby.",
            "title_similarity": "0.20158125",
            "sentiment_compound": 0.6369
        },
        {
            "id": "hym1yci",
            "score": -10,
            "text": "You don’t get disenfranchise her district because you don’t like who they sent to congress",
            "title_similarity": "0.5339806",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hym3bed",
            "score": -11,
            "text": "The Same convention that had two black commentators as speakers and guests? Really? Is this how low you all have to go? Blatant lying?",
            "title_similarity": "0.5415931",
            "sentiment_compound": -0.755
        },
        {
            "id": "hymhydq",
            "score": -10,
            "text": "I don't care! Trump is the best president for America and we will win again in 2024! MAGA! Let's go Brandon.",
            "title_similarity": "0.41474083",
            "sentiment_compound": 0.8046
        },
        {
            "id": "hym2bdt",
            "score": -13,
            "text": "[deleted]",
            "title_similarity": "0.31726855"
        },
        {
            "id": "hymut39",
            "score": -13,
            "text": "Lol... wait till the 2022 election results are in. Yes the NEW beginning of the lefty sky screamers will begin in earnest. \n\nLivin' rent free in your collective heads. It's gonna be great!",
            "title_similarity": "0.40024126",
            "sentiment_compound": 0.9324
        },
        {
            "id": "hyly6q2",
            "score": -14,
            "text": "Idiot.  Hillary was proven to be behind the “russian collusion” hoax. Get a grip",
            "title_similarity": "0.52883303",
            "sentiment_compound": -0.6597
        },
        {
            "id": "hylwjxi",
            "score": -16,
            "text": "All the neolibs have is name calling.. It's ridiculous. Years of name calling; No actual policy debate.",
            "title_similarity": "0.4571964",
            "sentiment_compound": -0.5719
        },
        {
            "id": "hylblwn",
            "score": 45,
            "text": "They’ve let her get away with everything else; this kind of thing from her was inevitable.  \n\nShe gets a ton of GOP donations with her antics.    That’s the part that I find most disturbing.  People are actually willing to part with their hard earned cash to support this malignant loudmouth.",
            "title_similarity": "0.43683463",
            "sentiment_compound": -0.3167
        },
        {
            "id": "hyldbun",
            "score": 16,
            "text": "[removed]",
            "title_similarity": "0.29644835"
        },
        {
            "id": "hym3609",
            "score": -16,
            "text": "OrAnGe +maN*\"baD\n\n'when all you have is a box of crayons--everything is a white nationalist'",
            "title_similarity": "0.53742504",
            "sentiment_compound": 0.0
        },
        {
            "id": "hylvjrq",
            "score": 15,
            "text": "I’m sure I’m not the only one but I’m genuinely so fucking tired of our government doing the worst shit and no consequences happen. Who gives a fuck if it’s a Republican or a Democrat? If they do something stupid - HOLD THEM ACCOUNTABLE. I’m tired of people supporting literal Nazis, attempting to overthrow elections, spew out blatant misinformation and still be allowed to remain making money on the tax payers dollars?! MTG isn’t helping *anyone*. She has no assignments and her only job is to rally insane people with insane ideas and try and bring them to fruition. It’s fucking 2022 and we are arguing over the DUMBEST shit.",
            "title_similarity": "0.65819055",
            "sentiment_compound": -0.9953
        },
        {
            "id": "hylzyv3",
            "score": -17,
            "text": "It's not a white nationalist group and for you to say it is is racist",
            "title_similarity": "0.46143568",
            "sentiment_compound": -0.6124
        },
        {
            "id": "hylhyr5",
            "score": 18,
            "text": "lol she said didn't know it was a white supremacist event and that she wasn't aligned with any controversial views. \n\nThat might be the most blunt example I've ever seen of someone blurting out the PR spin instead of seeding the narrative.",
            "title_similarity": "0.5893138",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hyliugi",
            "score": 17,
            "text": "Boy, I remember that time I accidentally stumbled into a Klan meeting",
            "title_similarity": "0.48213273",
            "sentiment_compound": -0.34
        },
        {
            "id": "hylocrb",
            "score": 51,
            "text": "If every republican white nationalist was expelled there would be no republican party.",
            "title_similarity": "0.70282096",
            "sentiment_compound": -0.666
        },
        {
            "id": "hym2u1b",
            "score": 21,
            "text": "Reminder that the GOP are now active national security threats after cozying up with Russia. \n\nEven more so after their maga coup in jan 6 2021 and trying to win putin's favor after invading ukraine",
            "title_similarity": "0.5249953",
            "sentiment_compound": 0.8316
        },
        {
            "id": "hyliiu5",
            "score": -59,
            "text": "Her and AOC are two alike.. one far right, other far left..",
            "title_similarity": "0.29796448",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyl2gx4",
            "score": 284,
            "text": "If anything, this will help her career.",
            "title_similarity": "0.16813335",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hym7op7",
            "score": -22,
            "text": "And just think, she is still a hundred times smarter than AOC.",
            "title_similarity": "0.2056883",
            "sentiment_compound": 0.4588
        },
        {
            "id": "hylf168",
            "score": 77,
            "text": "Nick Fuentes doesn't support women's rights, Taylor Greene being there is very hypocritical.",
            "title_similarity": "0.5130818",
            "sentiment_compound": -0.6758
        },
        {
            "id": "hylaqn9",
            "score": 375,
            "text": "Why? Are we just learning today she’s a white nationalist? Is that what we’re calling open racists now?",
            "title_similarity": "0.74344385",
            "sentiment_compound": -0.6174
        },
        {
            "id": "hylflrq",
            "score": 35,
            "text": "Isn't that her whole platform?",
            "title_similarity": "0.27986485",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyl233j",
            "score": 1027,
            "text": "Great idea but let’s do the math to see if it’s possible. To expel a House member, you need 2/3 of the House. Which means you would need 290 members voting to expel someone. Currently there are 222 Democratic House members. From the 211 Republicans, you would need to peel away 68 of them. So you would need about 32% of House Republicans to back this. Are there enough sane Republicans left to make that happen?",
            "title_similarity": "0.6319376",
            "sentiment_compound": -0.7311
        },
        {
            "id": "hyll34r",
            "score": 108,
            "text": "Isn't every Republican event these days a white nationalist event?",
            "title_similarity": "0.5590188",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyl76gq",
            "score": 187,
            "text": "Stop thinking the GOP will start being decent people doing what is right for the country.  They are garbage people and love her because they relate to her being a dirtbag",
            "title_similarity": "0.34491152",
            "sentiment_compound": 0.4588
        },
        {
            "id": "hyl671c",
            "score": 434,
            "text": "Elected republicans are so much deeply troubled. So much.",
            "title_similarity": "0.42906442",
            "sentiment_compound": -0.5509
        },
        {
            "id": "hym1hyk",
            "score": 70,
            "text": "I’m late but here’s something I keep on my notes for when she pops up:\n\nFor reasons this woman shouldn’t be a representative, her wiki page is interesting:\n\n> …she wrote 59 articles as a correspondent for the now defunct American Truth Seekers, a conspiracy news website\n\n> 27 articles for Law Enforcement Today, a pro-police fake news website\n\n> moderator of the organization's Facebook group [Family America Project], in which members posted death threats against Democrats, bigotry directed at the Obamas, and support for multiple conspiracy theories\n\n> When visiting the offices of Representatives Ilhan Omar and Rashida Tlaib, Greene falsely claimed that they were not \"official\" representatives because they were sworn in to Congress on the Quran.\n\n> She has also been reported to have ties to extremist militia groups and has called for the execution of Democratic politicians and FBI agents\n\n> Greene's Facebook account expressed support for the execution of leading Democrats, including Pelosi, Barack Obama, and Hillary Clinton\n\n**Then we have a nice list of the conspiracy theories:**\n\n- *Democratic Party elites are responsible for a satanic child sex trafficking ring*\n\n- *that the government orchestrated the 2017 Las Vegas shooting*\n\n- *that the Stoneman Douglas High School shooting in Parkland, Florida, was a false flag attack intended to help introduce gun control*\n\n-  *that the Sandy Hook Elementary School shooting was staged*\n\n- *that Barack Obama secretly visited North Korea and sabotaged nuclear diplomacy to cover up untoward dealings with Iran*\n\n- *that Obama and his advisor Valerie Jarrett were secretly Muslim*\n\n- *that the September 11 attack on the Pentagon was fake*\n\n- *the 2018 Camp Fire, a deadly wildfire in California, was caused by space lasers owned by the Rothschild family*\n\nMind blowing that this is an elected representative.\n\nEdit: formatting",
            "title_similarity": "0.6136275",
            "sentiment_compound": -0.9694
        },
        {
            "id": "hylc0kf",
            "score": 1465,
            "text": "She’s a blatant racist.\nMock and shame her into oblivion.\nDo it for America.",
            "title_similarity": "0.61593986",
            "sentiment_compound": -0.872
        },
        {
            "id": "hyl4ezi",
            "score": 760,
            "text": "Expelling her wouldn't even be done under the party's *old* standards. When Trent Lott got caught he just discreetly stepped down as minority leader.",
            "title_similarity": "0.7001165",
            "sentiment_compound": -0.3818
        },
        {
            "id": "hyl9piz",
            "score": 4593,
            "text": ">The event in Orlando, Florida, on Friday night was organized by the far-right extremist Nick Fuentes, who told attendees: “Now they’re going on about Russia and Vladimir Putin is Hitler – they say that’s not a good thing.”\n\n&#x200B;\n\n>Told that he is a white nationalist, she said: “I do not endorse those views.”\n\nYeah, I'm gonna call bull shit.",
            "title_similarity": "0.70932007",
            "sentiment_compound": -0.6973
        },
        {
            "id": "hyl19s0",
            "score": 5855,
            "text": "Maybe the gazpacho will finally get her.",
            "title_similarity": "0.3036974",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyl4hs9",
            "score": 1779,
            "text": "They wouldn't remove Steve King, they won't remove anyone.",
            "title_similarity": "0.33343536",
            "sentiment_compound": 0.0
        },
        {
            "id": "hylcxxw",
            "score": 13477,
            "text": "My dudes. Take a step back for a minute. How the fuck did we get here? Remember when not knowing how to spell “potato” was an absolute scandal?",
            "title_similarity": "0.52612925",
            "sentiment_compound": -0.7757
        },
        {
            "id": "hylb0j7",
            "score": 5,
            "text": "Qristian",
            "title_similarity": "0.043331303",
            "sentiment_compound": 0.0
        },
        {
            "id": "hylbc9l",
            "score": 18,
            "text": "The worst part is even though she is not on any committees, which means working, all she does is collect a taxpayer paid salary and fly around making these appearances and collecting another fee.  And she would most likely get voted in again.",
            "title_similarity": "0.50631523",
            "sentiment_compound": -0.6249
        },
        {
            "id": "hylbvv2",
            "score": 3,
            "text": "Imagine she gets expelled. Then what. She’ll join trump and say she was cancelled unfairly and whine and complain until she gets whatever validation she needs.",
            "title_similarity": "0.7184511",
            "sentiment_compound": -0.7003
        },
        {
            "id": "hylbvvt",
            "score": 5,
            "text": "The Republican catamites would never do such a decent thing. Besides they are to busy trying to pretend that they haven't been fantasizing about blowing Putin for the last few years.",
            "title_similarity": "0.57129914",
            "sentiment_compound": -0.1027
        },
        {
            "id": "hyldy2n",
            "score": 2,
            "text": "Call your reps and be civil. Let the voices be heard for the record.",
            "title_similarity": "0.39343077",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyle2yh",
            "score": 3,
            "text": "Whenever Greene does something to get attention, I wonder how much money she raised.",
            "title_similarity": "0.347578",
            "sentiment_compound": 0.0
        },
        {
            "id": "hylebjp",
            "score": 5,
            "text": "[Red Dwarf moment](https://tenor.com/bQpus.gif)",
            "title_similarity": "0.3898208",
            "sentiment_compound": 0.0
        },
        {
            "id": "hylfddd",
            "score": 3,
            "text": "She’s a cancer. She needs to be removed.",
            "title_similarity": "0.5678481",
            "sentiment_compound": -0.6597
        },
        {
            "id": "hylfkr7",
            "score": 26,
            "text": "She is just trying to reach her base",
            "title_similarity": "0.28406596",
            "sentiment_compound": 0.0258
        },
        {
            "id": "hylfulh",
            "score": 3,
            "text": "That dude is crazy!",
            "title_similarity": "0.17506762",
            "sentiment_compound": -0.4003
        },
        {
            "id": "hylg1n8",
            "score": 4,
            "text": "Yawn.  Wake  me up if anything happens to this wingnut.\n\n*\\*Rolls back over.\\**",
            "title_similarity": "0.32169515",
            "sentiment_compound": 0.0
        },
        {
            "id": "hylgvjx",
            "score": 3,
            "text": "She’s so far to the right that she’s popped out the other side.",
            "title_similarity": "0.2899259",
            "sentiment_compound": 0.0
        },
        {
            "id": "hylhkss",
            "score": 10,
            "text": "They will like her even more because of that tho",
            "title_similarity": "0.10750067",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hylhr6a",
            "score": 3,
            "text": "Not sure this will help Fuente’s case for helping plan the insurrection.",
            "title_similarity": "0.44467986",
            "sentiment_compound": 0.4475
        },
        {
            "id": "hylhwws",
            "score": 3,
            "text": "Complete f’ing moron",
            "title_similarity": "0.32141513",
            "sentiment_compound": -0.4939
        },
        {
            "id": "hyljemu",
            "score": 2,
            "text": "Just call them Nazis then you can invade them and kill them - Vlad Putin",
            "title_similarity": "0.62180597",
            "sentiment_compound": -0.6908
        },
        {
            "id": "hyljfh0",
            "score": 8,
            "text": "The calls would need to come from ranking members in the GOP and they are too weak and cowardice to say a word. They are soft and handed over the keys to the Qrazy’s in 2016.",
            "title_similarity": "0.5172365",
            "sentiment_compound": -0.4404
        },
        {
            "id": "hylji8o",
            "score": 3,
            "text": "Nope, not going to happen. With the world focused on Ukraine, this is probably THE best time for her to do shit like this. Can rile up the desired base while flying under the media radar.",
            "title_similarity": "0.5056423",
            "sentiment_compound": 0.7783
        },
        {
            "id": "hyljjdk",
            "score": 8,
            "text": "I remember when Fuentes was just some random nutjob everyone hated. Pretty fucking scary that he's pulling congresspeople to his events now",
            "title_similarity": "0.6022481",
            "sentiment_compound": -0.6697
        },
        {
            "id": "hylk2yq",
            "score": 1,
            "text": "Are there no lines in the states that are uncrossable anymore?? Wow.",
            "title_similarity": "0.37758106",
            "sentiment_compound": 0.4515
        },
        {
            "id": "hylk51s",
            "score": 2,
            "text": "You mean CPAC?",
            "title_similarity": "0.1341893",
            "sentiment_compound": 0.0
        },
        {
            "id": "hylkdur",
            "score": 1,
            "text": "Wait…was this really named the white nationalist event??? Wtf is wrong with people?!🤦🏻‍♀️",
            "title_similarity": "0.6602357",
            "sentiment_compound": -0.8463
        },
        {
            "id": "hylkhs7",
            "score": 1,
            "text": "Beady eyed crazy bleach done soaked into her brain 🧠",
            "title_similarity": "0.38134527",
            "sentiment_compound": -0.34
        },
        {
            "id": "hylkhvy",
            "score": 2,
            "text": "Oh.  I thought we were calling CPAC a white nationalist event now lol!",
            "title_similarity": "0.64781046",
            "sentiment_compound": 0.4753
        },
        {
            "id": "hylkl3z",
            "score": 1,
            "text": "So a campaign event?",
            "title_similarity": "0.32598317",
            "sentiment_compound": 0.0
        },
        {
            "id": "hylkmay",
            "score": 3,
            "text": "That seems a great time to point out that in the late 1930s Hitler had a significant number of politicians supporting him in the US. Most of which had been bought and paid for.",
            "title_similarity": "0.38181788",
            "sentiment_compound": 0.8442
        },
        {
            "id": "hylkmm5",
            "score": 2,
            "text": "What a fucking khunt",
            "title_similarity": "0.19178577",
            "sentiment_compound": 0.0
        },
        {
            "id": "hylks9e",
            "score": 1,
            "text": "Oh man, this is great - I’m looking forward to *literally nothing* coming of this because this is just the state of things now.",
            "title_similarity": "0.23292875",
            "sentiment_compound": 0.6249
        },
        {
            "id": "hyll1hs",
            "score": 1,
            "text": "Sounds good to me I don’t want those slimy pieces of shit in the Republican party",
            "title_similarity": "0.54794365",
            "sentiment_compound": 0.3182
        },
        {
            "id": "hyll2c7",
            "score": 3,
            "text": "Why? That’s perfectly representing her constituency. Some just realize they should be ashamed of it.",
            "title_similarity": "0.5161235",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hyll4wj",
            "score": 1,
            "text": "The racist dicks won’t do anything!",
            "title_similarity": "0.432199",
            "sentiment_compound": -0.6476
        },
        {
            "id": "hyll5h8",
            "score": 1,
            "text": "Pretty sure she is Putin wife 🤨",
            "title_similarity": "0.3907027",
            "sentiment_compound": 0.6705
        },
        {
            "id": "hyll72s",
            "score": 1,
            "text": "This trash needs to be thrown OUT!",
            "title_similarity": "0.47629547",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyll7c7",
            "score": 1,
            "text": "Expel?  Heck the republicans will run her for president",
            "title_similarity": "0.7318985",
            "sentiment_compound": -0.4404
        },
        {
            "id": "hyll8ih",
            "score": 2,
            "text": "I mean, basically all of the Republicans go to CPAC. Why is this year different? [reads article] Oh, a different white nationalist event. Got it.",
            "title_similarity": "0.6943227",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyll9rj",
            "score": 2,
            "text": "The l republicans are only upset because Taylor said the quiet part out loud.",
            "title_similarity": "0.43026873",
            "sentiment_compound": 0.1027
        },
        {
            "id": "hyllajv",
            "score": 1,
            "text": "but then who would represent the base of white national voters? /s",
            "title_similarity": "0.5414729",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyllakl",
            "score": 1,
            "text": "There's been calls to expel her for fuckin years now.",
            "title_similarity": "0.5060822",
            "sentiment_compound": -0.4404
        },
        {
            "id": "hyllcr7",
            "score": 1,
            "text": "How is this still a thing in 2022. Haven’t we been like over this for a decade.",
            "title_similarity": "0.29453784",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hyllfm5",
            "score": 1,
            "text": "What is a white nationalist event. Like, is it that overt now",
            "title_similarity": "0.5034996",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hyllg2o",
            "score": 2,
            "text": "If you support her or anything that involves her your a racist pos and your not “American” your a pos",
            "title_similarity": "0.57329196",
            "sentiment_compound": -0.3182
        },
        {
            "id": "hyllgl1",
            "score": 1,
            "text": "\" . . . she laughed, as the audience burst into applause.\" Even she knows they're a bunch of morons",
            "title_similarity": "0.2965561",
            "sentiment_compound": 0.5423
        },
        {
            "id": "hyllrsh",
            "score": 2,
            "text": "Americans with unabashed white supremacists members of government, without any meaningful action to expel them. It's shit like this that leave America exposed and especially vulnerable to (honestly) valid criticism of hypocrisy in their foreign policy. \n\nHow you going to call people out on shit when your own house looks this sloppy. Please clean house. Legit drain this white nationalist/neo nazi filth from your government. \n\nI dont expect a simple action, or singular move. This needs to be a multifaceted and coordinated approach across numerous intersections within the government and public interface. \n\nBut goddamn, please start. Get movement on this. The longer we wait, the more entrenched these fuckers are. Hell, America already had to deal with Trump, who for sure provided Putin/Kremlin with all the access they needed to undermine your military intelligence and government. Four fucking years of that shit. You so not want to leave your government that exposed ever again",
            "title_similarity": "0.7185444",
            "sentiment_compound": -0.9715
        },
        {
            "id": "hylltwo",
            "score": 3,
            "text": "She’s a metaphor of everything that is wrong with America.",
            "title_similarity": "0.5315106",
            "sentiment_compound": -0.4767
        },
        {
            "id": "hyllz06",
            "score": 1,
            "text": "It’s no coincidence that the white nationalist America First Political Action Conference was in the same city at the same time as CPAC.  Birds of a feather.",
            "title_similarity": "0.47560877",
            "sentiment_compound": -0.296
        },
        {
            "id": "hyllzv4",
            "score": 4,
            "text": "Don't forget - if the Republicans win back the house in 2022, they want to give her, Gosar and Boebert back their committee seats and take them away from AOC and Ilhan Omar and whoever they decide they don't like that day. Another reason to make sure you get out and vote in November.",
            "title_similarity": "0.723973",
            "sentiment_compound": 0.7146
        },
        {
            "id": "hylm444",
            "score": 4,
            "text": "Why would the Republicans punish one of their own speaking to their most loyal constituents? They’re not even trying to hide their white supremacy.",
            "title_similarity": "0.6440373",
            "sentiment_compound": -0.1298
        },
        {
            "id": "hylm4dv",
            "score": 1,
            "text": "Yup. Let’s end her career.",
            "title_similarity": "0.6023617",
            "sentiment_compound": 0.0
        },
        {
            "id": "hylm51o",
            "score": 1,
            "text": "I would expect nothing less from the villain from Star Trek Insurrection",
            "title_similarity": "0.4690501",
            "sentiment_compound": -0.5165
        },
        {
            "id": "hylm5q4",
            "score": 1,
            "text": "She is unfit for office",
            "title_similarity": "0.50067514",
            "sentiment_compound": 0.0
        },
        {
            "id": "hylm5yq",
            "score": 5,
            "text": "She's gone from kook to traitor pretty quickly",
            "title_similarity": "0.41940498",
            "sentiment_compound": 0.4939
        },
        {
            "id": "hylm7f8",
            "score": 1,
            "text": "This man face person is truly a POS",
            "title_similarity": "0.09325664",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hylm8d7",
            "score": 3,
            "text": "Lorem Ipsum school shootings, lorem Ipsum 9/11, lorem Ipsum ad vomitum",
            "title_similarity": "0.46834898",
            "sentiment_compound": 0.0
        },
        {
            "id": "hylm8fv",
            "score": 1,
            "text": "It’s headlines like this that make us Canadians go: **“Well yes expel her - obviously? What is even going on down there?”**",
            "title_similarity": "0.68984425",
            "sentiment_compound": 0.3939
        },
        {
            "id": "hylmaje",
            "score": 1,
            "text": "Seriously?\n\nThe Repuglikkkans have her on a pedestal.",
            "title_similarity": "0.34539825",
            "sentiment_compound": -0.1779
        },
        {
            "id": "hylmcl3",
            "score": 1,
            "text": "The white Georgian Republican is a white supremacist? Tell me it isn’t so",
            "title_similarity": "0.582878",
            "sentiment_compound": 0.128
        },
        {
            "id": "hylmmhi",
            "score": 1,
            "text": "Oh no!\n\n\nAnyway",
            "title_similarity": "0.17487413",
            "sentiment_compound": 0.0
        },
        {
            "id": "hylmnc2",
            "score": 1,
            "text": "I thought she always speaks at CPAC.",
            "title_similarity": "0.23595874",
            "sentiment_compound": 0.0
        },
        {
            "id": "hylmoe1",
            "score": 1,
            "text": "Listen, I just like that the background for this post is from CPAC, which is basically a white nationalist event. \n\n“Eh, close enough.”",
            "title_similarity": "0.5074563",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hylmwbz",
            "score": 3,
            "text": ">at white nationalist event\n\nThey had the Republican National Convention this year?",
            "title_similarity": "0.60632074",
            "sentiment_compound": 0.0
        },
        {
            "id": "hylmwsw",
            "score": 1,
            "text": "Expelled.  More like defenestrated",
            "title_similarity": "0.40289855",
            "sentiment_compound": 0.2006
        },
        {
            "id": "hylmxgz",
            "score": 3,
            "text": "How is she even still going? She's obviously bat shit crazy? Get her out my god.",
            "title_similarity": "0.52103186",
            "sentiment_compound": -0.644
        },
        {
            "id": "hyln1ck",
            "score": 3,
            "text": "She is a traitor and a bigot.  \n\nShe’s given power to those that hate America as it is and love America as they imagine it, a white only Theocratic State run by the few.\n\nWhen their simpleton supporters come, be ready.",
            "title_similarity": "0.6807958",
            "sentiment_compound": 0.7096
        },
        {
            "id": "hyln5bv",
            "score": 3,
            "text": "How is she still in office?",
            "title_similarity": "0.23751928",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyln5sm",
            "score": 1,
            "text": "Then do it. Nothing ever happens. Except, oh yeah, I get my rent raised for no reason and no recourse. Do we even have a government or just people who rip us off for fun and profit?",
            "title_similarity": "0.38317913",
            "sentiment_compound": 0.6124
        },
        {
            "id": "hyln6ld",
            "score": 3,
            "text": "Yep. 'So and so CALLS for such and such' means nothing will happen because apparently being a nazi in congress is acceptable now.\n\nThe GoP is shit.",
            "title_similarity": "0.57364213",
            "sentiment_compound": -0.0258
        },
        {
            "id": "hylnbb3",
            "score": 1,
            "text": "Gosh,can't believe that the party of people like Reagen and Lincoln has come to this point",
            "title_similarity": "0.38881394",
            "sentiment_compound": 0.6369
        },
        {
            "id": "hylnd45",
            "score": 1,
            "text": "Turd needs flushed!",
            "title_similarity": "0.23260936",
            "sentiment_compound": 0.0
        },
        {
            "id": "hylndn6",
            "score": 1,
            "text": "You know what? There’s a bunch of stuff in America that’s cancelled. Blatant racism is just one of them. Driving slow in the left lane is next.",
            "title_similarity": "0.5577477",
            "sentiment_compound": -0.7269
        },
        {
            "id": "hylnfzy",
            "score": 1,
            "text": "Donate to Marcus Flowers. He’s running to unseat her",
            "title_similarity": "0.6298805",
            "sentiment_compound": 0.0
        },
        {
            "id": "hylnh2z",
            "score": 1,
            "text": "Get this piece of fucking trash OUT",
            "title_similarity": "0.35682702",
            "sentiment_compound": 0.0
        },
        {
            "id": "hylnhbl",
            "score": 1,
            "text": "Spoiler: they won’t",
            "title_similarity": "0.22758646",
            "sentiment_compound": 0.0
        },
        {
            "id": "hylnhq8",
            "score": 1,
            "text": "MGT is part of a white supremacy party and their partner in it is a known pedophile and sex trafficker. If MGT wasn’t removed before, she won’t be for this.\n\nThis message is for all Republicans and conservatives: The GOP does not care about you or the values they pretend to hold, they just want to enslave you and fuck your kids.",
            "title_similarity": "0.67055416",
            "sentiment_compound": -0.6935
        },
        {
            "id": "hylnnak",
            "score": 1,
            "text": "Haven’t we been trying to get her expelled for what feels like ages now",
            "title_similarity": "0.5266814",
            "sentiment_compound": 0.128
        },
        {
            "id": "hylnsr3",
            "score": 1,
            "text": "The GOP is afraid to speak out against these actions because of money and votes.  They want racist money and racist votes.  I don’t think many politicians actually care about people who voted for them, they only follow what the party wants.  The GOP wants power and money and if they have to embrace white nationalist who love Putin then they will.  If they have to embrace idiots carrying the Nazi flag then they will.  I fucking hate the two party system.",
            "title_similarity": "0.5986099",
            "sentiment_compound": 0.5729
        },
        {
            "id": "hylntdj",
            "score": 3,
            "text": "Seriously, why do we tolerate these pro-Putin propaganda disseminators especially in government? Hate speech isn’t protected and clearly they have no concept of free speech or democracy and seek its obliteration.",
            "title_similarity": "0.668368",
            "sentiment_compound": 0.0094
        },
        {
            "id": "hylnwhq",
            "score": 1,
            "text": "Nothing is going to happen. The gop will bury their head. Dems will make noise for a day, then something else will happen, probably by her, and it starts over.",
            "title_similarity": "0.5807222",
            "sentiment_compound": 0.0
        },
        {
            "id": "hylnyp5",
            "score": 1,
            "text": "It still amazes me how blatant acts of racism/white supremacy and extreme nationalist points of view are so common and have such great amount of support in the US, don’t get me wrong I’m aware that far right and nationalist movements are rising everywhere in Europe and even in my country (Portugal) but still the vast majority of the population knows these views are wrong and in some cases straight up delusional, but I don’t understand how this type of behavior is so common and sometimes encouraged across the right wing party in the US, like where’s peoples common sense???",
            "title_similarity": "0.5057541",
            "sentiment_compound": 0.907
        },
        {
            "id": "hylo6ti",
            "score": 1,
            "text": "The picture used for the article is perfect.",
            "title_similarity": "0.06592963",
            "sentiment_compound": 0.5719
        },
        {
            "id": "hylo7tp",
            "score": 1,
            "text": "They're going to make us fight a civil war about it.",
            "title_similarity": "0.5998866",
            "sentiment_compound": -0.7579
        },
        {
            "id": "hyloamd",
            "score": 1,
            "text": "She is just such an ugly human being. Inside and out. Just vile..",
            "title_similarity": "0.34326804",
            "sentiment_compound": -0.8126
        },
        {
            "id": "hyloix3",
            "score": 1,
            "text": "She “doesn’t know his views” but he was literally leading a Putin chant seconds before she took the stage",
            "title_similarity": "0.556355",
            "sentiment_compound": 0.0
        },
        {
            "id": "hylokjx",
            "score": 1,
            "text": "Took them long enough",
            "title_similarity": "0.033523783",
            "sentiment_compound": 0.0
        },
        {
            "id": "hylompt",
            "score": 1,
            "text": "I don't care how loud and angry this pukes are, there is no way that they are the majority.  I hope that there is a day of reckoning for Marjorie and all of the white nationalists.",
            "title_similarity": "0.6279454",
            "sentiment_compound": -0.8226
        },
        {
            "id": "hylomtp",
            "score": 3,
            "text": "Not all republicans are white supremacists but all white supremacists are republican",
            "title_similarity": "0.4335198",
            "sentiment_compound": -0.4588
        },
        {
            "id": "hylov1z",
            "score": 1,
            "text": "She was just campaigning to her base.",
            "title_similarity": "0.39840323",
            "sentiment_compound": 0.0
        },
        {
            "id": "hylozp7",
            "score": 1,
            "text": "Majorie Taylor Greene is an interdimensional reptilian bent on the complete annihilation of the human species",
            "title_similarity": "0.60226464",
            "sentiment_compound": 0.0
        },
        {
            "id": "hylp2xr",
            "score": 1,
            "text": "Expel Greene",
            "title_similarity": "0.49374786",
            "sentiment_compound": -0.4404
        },
        {
            "id": "hylp61l",
            "score": 1,
            "text": "There was a time when even Republicans wouldn’t be caught standing next to trash like her. Bush senior or even Reagan wouldn’t have given scum like this the time of day. Now she represents what the GOP has turned into.",
            "title_similarity": "0.5735053",
            "sentiment_compound": 0.6124
        },
        {
            "id": "hylp8k5",
            "score": 1,
            "text": "Douche",
            "title_similarity": "0.19365078",
            "sentiment_compound": -0.3612
        },
        {
            "id": "hylpc6z",
            "score": 1,
            "text": "None is these assholes believe what they’re saying. They just want to get up on a stage, say outrageously idiotic things and bask in the 15 seconds of applause they’ll get.",
            "title_similarity": "0.44366127",
            "sentiment_compound": 0.0956
        },
        {
            "id": "hylpd01",
            "score": 1,
            "text": "Sadly, for those who voted for her, that’s a feature, not a bug.",
            "title_similarity": "0.39365527",
            "sentiment_compound": -0.4215
        },
        {
            "id": "hylpjbh",
            "score": 1,
            "text": "She’s just … made entirely of trash. Just decaying waste with a mouth. Everyone who’s ever voted for her should be on a watch list.",
            "title_similarity": "0.57039",
            "sentiment_compound": -0.6705
        },
        {
            "id": "hylpjgt",
            "score": 1,
            "text": "She needs to go!",
            "title_similarity": "0.3434926",
            "sentiment_compound": 0.0
        },
        {
            "id": "hylpjhk",
            "score": 1,
            "text": "Can’t even handle the level of trash this woman is.  Complete embarrassment to the human race",
            "title_similarity": "0.53434736",
            "sentiment_compound": -0.4404
        },
        {
            "id": "hylpkon",
            "score": 1,
            "text": "Fat fucking chance, and, based on what we know of MTG, ultimately a pointless article",
            "title_similarity": "0.50867355",
            "sentiment_compound": 0.3167
        },
        {
            "id": "hylpniq",
            "score": 1,
            "text": "At this pace, we will soon see the Republican party in white robes and hood with the confederate flag behind and not caring who sees them.  I do not like this one bit, it will destroy our great nation.  They piss on all the sacrifices, blood, sweat and tears that millions of people past and present have done for our great nation.  Hate only brings about more hate, and where does it stop? We have never needed a righteous movement like we do now.",
            "title_similarity": "0.647267",
            "sentiment_compound": -0.809
        },
        {
            "id": "hylpnle",
            "score": 1,
            "text": ".... Will go nowhere.\n\nLost half of your title there.",
            "title_similarity": "0.440001",
            "sentiment_compound": 0.2411
        },
        {
            "id": "hylpoe8",
            "score": 1,
            "text": "About damned time!",
            "title_similarity": "0.10210397",
            "sentiment_compound": -0.4389
        },
        {
            "id": "hylpqvv",
            "score": 1,
            "text": "This lady is just…………. Horrible",
            "title_similarity": "0.40698487",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hylpr6v",
            "score": 1,
            "text": ">Nick Fuentes, who told attendees: “Now they’re going on about Russia and Vladimir Putin is Hitler – they say that’s not a good thing.”  \n>  \n>He burst into laughter as he added: “I shouldn’t have said that!”\n\nHe makes a great republican spokesperson.",
            "title_similarity": "0.5916756",
            "sentiment_compound": 0.734
        },
        {
            "id": "hylpui9",
            "score": 3,
            "text": "It's interesting how many Americans seem to have forgotten the original America First movement was antisemitic and pro-Nazi, as well. I guess it's true that not knowing our own history is dooming us to repeat it.",
            "title_similarity": "0.6069968",
            "sentiment_compound": 0.4939
        },
        {
            "id": "hylpuw9",
            "score": 1,
            "text": "Here’s the gist of the article:\n\n“”Fred Wellman, a political consultant and Iraq war veteran, commented on Twitter: “This is where Marjorie Taylor Greene spent her evening. Laughing about comparisons to Hitler being bad. This is who she is. You know they burned crosses in Martin Luther King’s yard just 62 years ago. It’s time for Georgia to put this trash out forever.”\n\n“”On Saturday, Greene sought to defend her appearance at AFPAC. She told CBS News: “I went to talk to them about America First policies and I talked to them about what’s important for our country going forward.\n\n“”Now, in regards to Russia, Putin is a murderer and he should never have invaded Ukraine. What he is doing is completely wrong. I stand with our Nato member allies and I’m completely against this war. Everything that he’s doing is wrong. He’s killing people over and over so I’m staunchly against it and I’m staunchly against Vladimir Putin and his invasion of Ukraine.”\n\n“”Asked if she endorses Fuentes’s views, Taylor Greene claimed: “I don’t know what his views are.”\n\n“”Told that he is a white nationalist, she said: “I do not endorse those views.”\n\n“”Greene has a history of antisemitic and incendiary comments that include blaming California wildfires on “Jewish space lasers”, suggesting Muslims do not belong in government and warning that “gazpacho police” – presumably she meant Gestapo – patrol the US Capitol.",
            "title_similarity": "0.6366073",
            "sentiment_compound": -0.9834
        },
        {
            "id": "hylq013",
            "score": 1,
            "text": "Fucking Republican trash",
            "title_similarity": "0.49661112",
            "sentiment_compound": 0.0
        },
        {
            "id": "hylq66v",
            "score": 1,
            "text": "Given the state of this country, you are looking at a potential future president.",
            "title_similarity": "0.40035427",
            "sentiment_compound": 0.0
        },
        {
            "id": "hylq6j4",
            "score": 1,
            "text": "At an Orange Supremacist meeting?",
            "title_similarity": "0.48175842",
            "sentiment_compound": 0.128
        },
        {
            "id": "hylq750",
            "score": 1,
            "text": "Bye bye!",
            "title_similarity": "0.1101986",
            "sentiment_compound": 0.0
        },
        {
            "id": "hylq9ts",
            "score": 3,
            "text": "I just don't know if there's a bar anymore. It's so low I feel many who behave like this will continue to do so, publicly.",
            "title_similarity": "0.33887553",
            "sentiment_compound": -0.0622
        },
        {
            "id": "hylqhbf",
            "score": 1,
            "text": "Calls to expel (Shit Republican) after (insert racist action here) have been floating around for years. The GOP politicians are pieces of shit but face no repercussions for it. Ever! Until the propaganda machine is killed, this is the status quo.",
            "title_similarity": "0.60596573",
            "sentiment_compound": -0.9633
        },
        {
            "id": "hylqlv3",
            "score": 3,
            "text": "A white nationalist event was held in Orlando the same weekend the Conservative Political Action Conference was in Orlando?   That's convenient.",
            "title_similarity": "0.4669155",
            "sentiment_compound": 0.0
        },
        {
            "id": "hylqmzt",
            "score": 1,
            "text": "Lock her up already.",
            "title_similarity": "0.44731158",
            "sentiment_compound": 0.0
        },
        {
            "id": "hylqppz",
            "score": 1,
            "text": "Who is marjoram Taylor!?",
            "title_similarity": "0.3221742",
            "sentiment_compound": 0.0
        },
        {
            "id": "hylqthb",
            "score": 3,
            "text": "so she spoke at 2 nazi events in one day?",
            "title_similarity": "0.49453253",
            "sentiment_compound": 0.0
        },
        {
            "id": "hylqyrp",
            "score": 1,
            "text": "Get her the fuck out",
            "title_similarity": "0.43786293",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hylqzae",
            "score": 1,
            "text": "How in the actual fuck is this what triggers the call? Why are these bootlicking fascist shills allowed in public government positions?",
            "title_similarity": "0.65567636",
            "sentiment_compound": -0.8156
        },
        {
            "id": "hylqzxr",
            "score": 3,
            "text": "It’s embarrassing that this is even a headline. No sitting US Government official should have any remote ties to a racist organization. It flies in the face of the constitution that they swear to uphold. \n\nShe should be expelled immediately and barred from holding any office at any level.",
            "title_similarity": "0.7104962",
            "sentiment_compound": -0.875
        },
        {
            "id": "hylr0b1",
            "score": 1,
            "text": "Get her the fuck out. Maybe she can go join United Russia.",
            "title_similarity": "0.5711572",
            "sentiment_compound": 0.128
        },
        {
            "id": "hylr24d",
            "score": 7,
            "text": "Trying to figure out why the Jewish community hasn’t been more vocal about the rhetoric from Greene..??\n\nDidn’t the network that hosts Whoopi Goldberg’s show and the Jewish community punish and admonish Whoopi for her insensitive yet, non-racist comments, respectively??",
            "title_similarity": "0.49266565",
            "sentiment_compound": -0.594
        },
        {
            "id": "hylr6o9",
            "score": 4,
            "text": "How many 'calls' have been made by now? Take some fucking action or shut the fuck up.",
            "title_similarity": "0.48191604",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hylr8rx",
            "score": 4,
            "text": "why would they expel her? this is what they want / align with. Thye just use loud dummies to say adn do the quiet bits outloud. Then they dont say anything against it and the supporters love it.",
            "title_similarity": "0.46469414",
            "sentiment_compound": 0.6705
        },
        {
            "id": "hylr9tb",
            "score": 2,
            "text": "Is there a better qualified leader for her position, YES",
            "title_similarity": "0.2948698",
            "sentiment_compound": 0.7456
        },
        {
            "id": "hylrabj",
            "score": 2,
            "text": "Can this trick go away already? My patience is very thin right now and her stupid face makes me angry",
            "title_similarity": "0.46494934",
            "sentiment_compound": -0.7845
        },
        {
            "id": "hylranv",
            "score": 5,
            "text": "Fuck this stupid piece of shit!",
            "title_similarity": "0.3241977",
            "sentiment_compound": -0.8955
        },
        {
            "id": "hylrdoz",
            "score": 2,
            "text": "Might not want to use a picture of her at CPAC if you don’t want the average person to automatically write this off as a complete joke",
            "title_similarity": "0.5294027",
            "sentiment_compound": 0.3134
        },
        {
            "id": "hylrdp2",
            "score": 3,
            "text": "They just have to keep telling low IQ white people that they’re being oppressed.",
            "title_similarity": "0.60920703",
            "sentiment_compound": -0.6369
        },
        {
            "id": "hylrg2u",
            "score": 3,
            "text": "Why doesn’t anybody talk about what kind of dogshit rednecks would vote her into office? Sure the Republican Party should be embarrassed, but shouldn’t a majority of her Georgia district be able to vote her out? No, because they are dogshit too.",
            "title_similarity": "0.6613074",
            "sentiment_compound": 0.2755
        },
        {
            "id": "hylroji",
            "score": 2,
            "text": "The photo suggests that the event in question was CPAC… pretty accurate actually.",
            "title_similarity": "0.121822804",
            "sentiment_compound": 0.4939
        },
        {
            "id": "hylrolf",
            "score": 4,
            "text": "Current R. Representative Paul Gosar shows that it won't be an issue. Republican leadership's not gonna risk the white nationalist vote in 2022",
            "title_similarity": "0.4874649",
            "sentiment_compound": 0.2057
        },
        {
            "id": "hylrw78",
            "score": 1,
            "text": "We should leave things like this to a popular vote.",
            "title_similarity": "0.51150924",
            "sentiment_compound": 0.6249
        },
        {
            "id": "hylrwt6",
            "score": 1,
            "text": "Well aren’t all white nationalist parties considered domestic terrorists in the fucking US now anyhow?",
            "title_similarity": "0.6993832",
            "sentiment_compound": -0.0772
        },
        {
            "id": "hylryw5",
            "score": 1,
            "text": "What should be done almost never gets done...",
            "title_similarity": "0.22101063",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyls1pi",
            "score": 3,
            "text": "That’s not going to happen. Why would they alienate their based?",
            "title_similarity": "0.44622675",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyls56q",
            "score": 3,
            "text": "Man the whole Republican Party just keep digging bigger and bigger holes. Fucking 2022 and there’s still politicians that, even unknowingly, go and support white supremacy.",
            "title_similarity": "0.5712713",
            "sentiment_compound": 0.6808
        },
        {
            "id": "hyls6sp",
            "score": 1,
            "text": "Bruh",
            "title_similarity": "0.04987474",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyls8v0",
            "score": 2,
            "text": "I'm confused how they can call the Democrats commies but then worship Putin (an actual Communist), are they really that brain-dead?",
            "title_similarity": "0.5633805",
            "sentiment_compound": 0.2846
        },
        {
            "id": "hyls9lo",
            "score": 2,
            "text": "This is proof that Republicans are either white supremacists or empathize with them. There's no saying otherwise.",
            "title_similarity": "0.4674499",
            "sentiment_compound": -0.4939
        },
        {
            "id": "hylsapu",
            "score": 2,
            "text": "There is no room for this garbage in humanity.",
            "title_similarity": "0.3205182",
            "sentiment_compound": -0.296
        },
        {
            "id": "hylsbq3",
            "score": 9,
            "text": "This is just the tip of the iceberg. My buddy is a bartender at the bar that hosted her. He literally had to walk out",
            "title_similarity": "0.41832775",
            "sentiment_compound": 0.0
        },
        {
            "id": "hylshe3",
            "score": 3,
            "text": "How is this B actually still around? Holy shit make her an afterthought please.",
            "title_similarity": "0.3684656",
            "sentiment_compound": -0.3182
        },
        {
            "id": "hylsnur",
            "score": 3,
            "text": "It's not going to happen. She's a disaster but the GOP don't give a fuck",
            "title_similarity": "0.44794953",
            "sentiment_compound": 0.3016
        },
        {
            "id": "hylsqxx",
            "score": 1,
            "text": "Let’s get r/ Russia banned",
            "title_similarity": "0.5830859",
            "sentiment_compound": -0.4588
        },
        {
            "id": "hylsuwp",
            "score": 3,
            "text": "Their willing association with Putin makes their grievances seem all that more asinine. It would be a fine point to have the GOP finally split over this. We’ll find out how far Russian money has influenced all our politicians.\n\nI would absolutely go to war for Ukraine at this point. I say that as an older American who has been against every US military adventure since WW2 (and abhorred by the ones before, but that’s a different discussion, just provided for context). I’m so tired of the games and the lies, Soviet or otherwise. Imagine a world stage with smart, creative Russians, positively contributing on the world stage. If we don’t blow ourselves up in the process; but then again now it’s clear no one’s lives are secure with Putin.\n\nEdit: removed exuberant-but-hopelessly-optimistic option about the demise of assholery as a political viewpoint.",
            "title_similarity": "0.6359275",
            "sentiment_compound": 0.6815
        },
        {
            "id": "hylsyp1",
            "score": 2,
            "text": "She looks like the Leprechaun from the old Leprechaun horror movies.",
            "title_similarity": "0.39022177",
            "sentiment_compound": -0.296
        },
        {
            "id": "hylt5u7",
            "score": 1,
            "text": "This needs some likes and follows asap from https://viralhq.net/",
            "title_similarity": "0.19029917",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hyltb14",
            "score": 1,
            "text": "I’ll believe it when it happens.",
            "title_similarity": "0.089242816",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyltdq8",
            "score": 1,
            "text": "Those calls will always fall on deaf ears.",
            "title_similarity": "0.34171307",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyltfs8",
            "score": 1,
            "text": "Another call for action that will be left unanswered",
            "title_similarity": "0.33447206",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyltzt6",
            "score": 4,
            "text": "The Republican Party is a white nationalist organization.",
            "title_similarity": "0.50817955",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hylu14q",
            "score": 2,
            "text": "Why? Most republicans are white nationalist.",
            "title_similarity": "0.45700336",
            "sentiment_compound": 0.0
        },
        {
            "id": "hylu2g8",
            "score": 1,
            "text": "Wow. So we can go to a kkk rally out in the open these days huh? Blame the people that put her in power. Sad just sad",
            "title_similarity": "0.67955834",
            "sentiment_compound": -0.5859
        },
        {
            "id": "hylu4jc",
            "score": 2,
            "text": "[deleted]",
            "title_similarity": "0.31726855"
        },
        {
            "id": "hylu4va",
            "score": 1,
            "text": "bruh",
            "title_similarity": "0.04987474",
            "sentiment_compound": 0.0
        },
        {
            "id": "hylu5zi",
            "score": 1,
            "text": "“We’ve got to investigate Hillary Clinton’s campaign”\nWhat fucking year is this?",
            "title_similarity": "0.6139873",
            "sentiment_compound": 0.0
        },
        {
            "id": "hylu6fd",
            "score": 2,
            "text": "This grifter, Trump, and anyone like this, all come from the Right. Not the “Far Right”, just the Right. The “far” is implied. These are the people who turned me from a 2000’s Independent, into a 2018 and beyond Democrat.\nBeing an Independent is a luxury this country cannot afford.\n\nPeople love to “both sides” everything, which is so intellectually dishonest to the situation this country faces. You could “both sides” any issue back in the day. “Trickle Down” Republicans, or “Tax and Spend” Democrats. Isn’t that quaint? Back when your choices weren’t “The Blatantly Anti-American Party”, and “The Normal Americans”. I am a Democrat, because no matter what policy I may disagree with them about, I f’n KNOW they are patriots who believe in what the Founders wanted. To try to create that more perfect union. The other guys will wipe their ass with our flag and our American values & ideals, all in the name of retaining power.\n\nIf you’d “rather be Russian than Democrat”, you truly do not belong here.",
            "title_similarity": "0.52634966",
            "sentiment_compound": 0.5557
        },
        {
            "id": "hylu6hp",
            "score": 1,
            "text": "The bar is literally underground at this point.",
            "title_similarity": "0.15017971",
            "sentiment_compound": 0.0
        },
        {
            "id": "hylu8ge",
            "score": 2,
            "text": "As a non-american how do people like this even get elected? I've seen things of her in the past and she seems literally fucking insane",
            "title_similarity": "0.5519452",
            "sentiment_compound": -0.1263
        },
        {
            "id": "hyluay1",
            "score": 3,
            "text": "All the republicans will not let her be expelled because they are all white nationalists too. 9 people sitting down for dinner with a nazi is 10 nazis.",
            "title_similarity": "0.5679776",
            "sentiment_compound": -0.25
        },
        {
            "id": "hylufvj",
            "score": 1,
            "text": "It’s amazing that “Jewish space lasers” may not be the dumbest thing that can be attributed to her.",
            "title_similarity": "0.31467012",
            "sentiment_compound": 0.7581
        },
        {
            "id": "hylugl5",
            "score": 1,
            "text": "We all hate you except a small fringe of traitor republiQans. I hope you know that.",
            "title_similarity": "0.5436797",
            "sentiment_compound": -0.2023
        },
        {
            "id": "hyluk5j",
            "score": 1,
            "text": "There’s always “calls to remove….” And then nothing. I expect the same from this. If she isn’t gone yet she is here to stay.",
            "title_similarity": "0.3547848",
            "sentiment_compound": 0.0
        },
        {
            "id": "hylup9y",
            "score": 1,
            "text": "Nothing will happen.\n\nHell, MTG might even get a committee to guarantee she votes for McCarthy for Speaker come Jan 3",
            "title_similarity": "0.6530976",
            "sentiment_compound": 0.6872
        },
        {
            "id": "hylur67",
            "score": 1,
            "text": "The tragedy of America on display!",
            "title_similarity": "0.4815128",
            "sentiment_compound": -0.69
        },
        {
            "id": "hylureu",
            "score": 2,
            "text": "I see this type of post literally every week and she's still active.",
            "title_similarity": "0.15581533",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hylusln",
            "score": 1,
            "text": "They won't.",
            "title_similarity": "0.19085252",
            "sentiment_compound": 0.0
        },
        {
            "id": "hylv56c",
            "score": 1,
            "text": "White supremacy and Russian sympathizers party",
            "title_similarity": "0.46004236",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hylv593",
            "score": 1,
            "text": "She is the absolute worst",
            "title_similarity": "0.37103385",
            "sentiment_compound": -0.6249
        },
        {
            "id": "hylv8qs",
            "score": 1,
            "text": "Is there a petition or something?",
            "title_similarity": "0.23822676",
            "sentiment_compound": 0.0
        },
        {
            "id": "hylvbzq",
            "score": 1,
            "text": "Do it or I’m going to consider all of you fascist racist bastards and I will be correct.",
            "title_similarity": "0.54281455",
            "sentiment_compound": -0.9118
        },
        {
            "id": "hylvf99",
            "score": 1,
            "text": "With Putin getting all the attention, MTG was upset she might not win this years \"Worlds Biggest Piece of Shit\" award.",
            "title_similarity": "0.58267874",
            "sentiment_compound": -0.6977
        },
        {
            "id": "hylvh9n",
            "score": 1,
            "text": "Goodness this woman can't sink any lower",
            "title_similarity": "0.16967192",
            "sentiment_compound": 0.5978
        },
        {
            "id": "hylvmsi",
            "score": 1,
            "text": "Can you imagine Thanksgiving or Christmas dinner with her at the table?!? Good god....",
            "title_similarity": "0.32131037",
            "sentiment_compound": 0.686
        },
        {
            "id": "hylvn2k",
            "score": 3,
            "text": "Expel from what? The only valid choice would be planet earth, destination, the sun.",
            "title_similarity": "0.40627065",
            "sentiment_compound": -0.4404
        },
        {
            "id": "hylvo78",
            "score": 2,
            "text": "For the love of God, why do Republican women all wear shift dresses every fucking day? Didn’t they have conniptions just a few years ago when Michelle Obama wore sleeveless dresses? So tired of this racist woman’s asshole eyed dry orange face on top of a fucking red or blue shift dress every fucking day on my news feed.",
            "title_similarity": "0.6215786",
            "sentiment_compound": -0.2503
        },
        {
            "id": "hylvoei",
            "score": 1,
            "text": "She's a fucking idiot",
            "title_similarity": "0.33783984",
            "sentiment_compound": -0.5563
        },
        {
            "id": "hylvtfi",
            "score": 1,
            "text": "GQP strikes again. How can anyone in her district be proud of her?",
            "title_similarity": "0.59171283",
            "sentiment_compound": 0.1531
        },
        {
            "id": "hylvu2f",
            "score": 1,
            "text": "Is it just me or is white nationalism less offensive than asserting the existence of Jewish space lasers?",
            "title_similarity": "0.4345593",
            "sentiment_compound": -0.4033
        },
        {
            "id": "hylvuhr",
            "score": 2,
            "text": "Anyone else just assume the white nationalist event in question was CPAC?",
            "title_similarity": "0.5652146",
            "sentiment_compound": 0.0
        },
        {
            "id": "hylvzag",
            "score": 1,
            "text": "Gazpacho police. Lol.",
            "title_similarity": "0.19945502",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hylw1tn",
            "score": 1,
            "text": "*American in name only",
            "title_similarity": "0.31084096",
            "sentiment_compound": 0.0
        },
        {
            "id": "hylw2os",
            "score": 1,
            "text": "This chic has lost her damn mind. I can’t believe Republicans put up with her shit",
            "title_similarity": "0.5812684",
            "sentiment_compound": -0.7579
        },
        {
            "id": "hylwc2a",
            "score": 1,
            "text": "You're toxic I'm slipping under #Britney",
            "title_similarity": "0.4566514",
            "sentiment_compound": 0.0
        },
        {
            "id": "hylwd5s",
            "score": 2,
            "text": "She tried and failed to start an Anglo Saxon Caucus, why is this a surprise?",
            "title_similarity": "0.55911237",
            "sentiment_compound": -0.296
        },
        {
            "id": "hylwdv6",
            "score": 1,
            "text": "White nationalist event, her family reunion what's the difference?",
            "title_similarity": "0.63050526",
            "sentiment_compound": 0.0
        },
        {
            "id": "hylwfzv",
            "score": 3,
            "text": "I mean the RNC is a white national event.",
            "title_similarity": "0.41884345",
            "sentiment_compound": 0.0
        },
        {
            "id": "hylwiep",
            "score": 1,
            "text": "I have learned to hate all traitors, and there is no disease that I spit on more than treachery.\r  \n\r  \nAeschylus 525 BC",
            "title_similarity": "0.56956995",
            "sentiment_compound": -0.7096
        },
        {
            "id": "hylwjcy",
            "score": 1,
            "text": "OK. Steel-woman for me Marjorie Taylor Green. No jokes. Go\n\nedited",
            "title_similarity": "0.49049005",
            "sentiment_compound": -0.1877
        },
        {
            "id": "hylwqtp",
            "score": 1,
            "text": "Oh lordy....what did she do/say now?  Some people just never learn......bless her heart",
            "title_similarity": "0.44582596",
            "sentiment_compound": -0.5216
        },
        {
            "id": "hylwrsj",
            "score": 1,
            "text": "How are we still tolerating this talking sack of pig shit?",
            "title_similarity": "0.39122576",
            "sentiment_compound": -0.5574
        },
        {
            "id": "hylx4s0",
            "score": 3,
            "text": "So strange how groups like BLM, ANTIFA, and so forth, really any left leaning group, somehow has a hidden agenda to destroy everything Conservatives stand for and that is enough to want to bar them from doing anything (including exercising their rights) or even associating with them.\n\nYet when Conservatives constantly rub shoulders with hate groups whose whole existence is to target minorities and LGBTQ+ communities through targeted policies and even up to violence AND they are quite open about all of this including racism, bigotry, sexism, and more... this is totally fine and doesn't speak anything about their character, morals, or anything of that nature.\n\nSeriously fuck anyone still seated at the Republican table.",
            "title_similarity": "0.64351135",
            "sentiment_compound": -0.9571
        },
        {
            "id": "hylxaz7",
            "score": 1,
            "text": "Just when I thought she couldn't go more off the deep end, she really outdid herself thus time.",
            "title_similarity": "0.39236408",
            "sentiment_compound": 0.0
        },
        {
            "id": "hylxb0m",
            "score": 1,
            "text": "We will see if this sticks",
            "title_similarity": "0.124892205",
            "sentiment_compound": 0.0
        },
        {
            "id": "hylxbmb",
            "score": 1,
            "text": "Nobody brings a dog whistle to these events where she speaking yet?",
            "title_similarity": "0.33148307",
            "sentiment_compound": 0.0
        },
        {
            "id": "hylxd5o",
            "score": 1,
            "text": "I wonder how crazy you can become til they kick you.",
            "title_similarity": "0.43771806",
            "sentiment_compound": -0.34
        },
        {
            "id": "hylxedw",
            "score": 2,
            "text": "Get her the fuck out",
            "title_similarity": "0.43786293",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hylxr3g",
            "score": 2,
            "text": "Honestly not sure how she hasn’t been expelled already",
            "title_similarity": "0.34325534",
            "sentiment_compound": 0.0098
        },
        {
            "id": "hyly3a8",
            "score": 1,
            "text": "Who voted for this moron?",
            "title_similarity": "0.44272402",
            "sentiment_compound": -0.5789
        },
        {
            "id": "hyly4v4",
            "score": 1,
            "text": "Was she tricked into it like Edward norton’s character in Death to Smoochie?",
            "title_similarity": "0.5364345",
            "sentiment_compound": -0.4588
        },
        {
            "id": "hylyc9i",
            "score": 2,
            "text": "Will they just say they are nazi’s! We already know they are .",
            "title_similarity": "0.4275824",
            "sentiment_compound": 0.0
        },
        {
            "id": "hylycdt",
            "score": 1,
            "text": "https://www.ajc.com/politics/politics-blog/rep-greenes-speech-at-white-nationalist-event-draws-new-calls-for-reprimand/6RZ6WW73I5BKPNQOAIJK5VTTGE/?outputType=amp\n\nLink with actual videos of some of what the racist man-baby said the crazy lady’s justifications for being there…",
            "title_similarity": "0.7150471",
            "sentiment_compound": -0.7506
        },
        {
            "id": "hylye41",
            "score": 1,
            "text": "it’s about fuckin time",
            "title_similarity": "0.1283775",
            "sentiment_compound": 0.0
        },
        {
            "id": "hylyfyl",
            "score": 1,
            "text": "Neanderthal Barbie had no idea she was grunting to the like-minded.",
            "title_similarity": "0.35675403",
            "sentiment_compound": -0.296
        },
        {
            "id": "hylyj0k",
            "score": 2,
            "text": "The thumbnail is from CPAC but the event they are referencing was AFPAC which is literally headed by a self-avowed White Nationalist who also lead a round of applause for Putin before introducing MTG.",
            "title_similarity": "0.6337384",
            "sentiment_compound": 0.5719
        },
        {
            "id": "hylyp0o",
            "score": 1,
            "text": "Republicans have tried to expel Cheney and Romney for not supporting Trump's insurrection attempt, which was lead by white nationalist and a whole lot of other extremist idiots.\n\nRepublicans will not try to expel MTG for giving a speech at a white nationalist event because they didn't expel Republican Paul Gosar when he was there a few years ago.\n\nThat should tell you who the Republican party cares most about.",
            "title_similarity": "0.72513103",
            "sentiment_compound": 0.7654
        },
        {
            "id": "hylyrir",
            "score": 1,
            "text": "Why should they expel her from the GOP? The GOP is itself a party of white nationalists, she’s fits right in. I guess they forgot to tell her not to say the quiet part out loud.",
            "title_similarity": "0.7813516",
            "sentiment_compound": -0.0516
        },
        {
            "id": "hylyv7r",
            "score": 1,
            "text": "This dumb mother fucker.",
            "title_similarity": "0.36667997",
            "sentiment_compound": -0.8225
        },
        {
            "id": "hylyvqg",
            "score": 1,
            "text": "Send her to back to her Russian allies.",
            "title_similarity": "0.46960765",
            "sentiment_compound": 0.0
        },
        {
            "id": "hylyxqb",
            "score": 1,
            "text": "She can’t keep getting away with these",
            "title_similarity": "0.26550442",
            "sentiment_compound": 0.0
        },
        {
            "id": "hylz2u9",
            "score": 1,
            "text": "And nothing will happen.",
            "title_similarity": "0.18459652",
            "sentiment_compound": 0.0
        },
        {
            "id": "hylz4wz",
            "score": 1,
            "text": "She is adored by the right. She isn't going anywhere lol.",
            "title_similarity": "0.2154049",
            "sentiment_compound": 0.12
        },
        {
            "id": "hylzgal",
            "score": 1,
            "text": "I hope she’s nominated as the Republican candidate for the next presidential election! She’s doing a great job!\n\n\n\n\n\n\n\n\n/s",
            "title_similarity": "0.5016345",
            "sentiment_compound": 0.8217
        },
        {
            "id": "hylzgqw",
            "score": 1,
            "text": "How are they pro Putin and anti communist?",
            "title_similarity": "0.4950919",
            "sentiment_compound": -0.3182
        },
        {
            "id": "hylzhjg",
            "score": 1,
            "text": "Seditious, traitorous, mean, evil, bad and nasty.  And those are her good qualities.",
            "title_similarity": "0.31435814",
            "sentiment_compound": -0.9062
        },
        {
            "id": "hylzi9n",
            "score": 1,
            "text": "“I do not endorse those views... he’s way too moderate for me.”",
            "title_similarity": "0.32707444",
            "sentiment_compound": -0.2411
        },
        {
            "id": "hylzih5",
            "score": 1,
            "text": "This lady is an embarassment for the GOP. Hopefully, her constituents realize this and give her the boot.",
            "title_similarity": "0.41497892",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hylzjwb",
            "score": 1,
            "text": "Frakin’ Confederasah just won’t die already",
            "title_similarity": "0.19936803",
            "sentiment_compound": -0.5994
        },
        {
            "id": "hylznla",
            "score": 2,
            "text": "If America doesn't want to turn into Russia with a Christian mask, we need to remove and jail these traitors immediately.",
            "title_similarity": "0.6592322",
            "sentiment_compound": -0.0572
        },
        {
            "id": "hylznoh",
            "score": 2,
            "text": "She has weaponized her stupidity to the point she must be muzzled",
            "title_similarity": "0.47359014",
            "sentiment_compound": -0.4404
        },
        {
            "id": "hylzr80",
            "score": 1,
            "text": "She didn’t eat her Gazpacho soup when she received the invitation so she didn’t realize they were white nationalists. \n So she accepted the invitation but after the event she ate some Gazpacho soup her blood sugar was back to normal well as normal as hers gets and realized her mistake. \n So if they need to send her to jail make sure it’s the Gazpacho police because that way they can share their soup and her blood sugar can be regulated property and she can realize what she should and should not say.",
            "title_similarity": "0.6123279",
            "sentiment_compound": 0.7175
        },
        {
            "id": "hylzrp8",
            "score": 1,
            "text": "I mean. Start with her but maybe don’t stop until you toss out Hawthorne, Boebert and Gomert.",
            "title_similarity": "0.53450406",
            "sentiment_compound": -0.4215
        },
        {
            "id": "hylzst5",
            "score": 2,
            "text": "Nothing will happen to her - the GOP caters to and represents white terrorists and terrorists.",
            "title_similarity": "0.64953256",
            "sentiment_compound": -0.8481
        },
        {
            "id": "hylzyqe",
            "score": 1,
            "text": "YES\n\nFinally\n\nShe is the winner of the 2021 dumbest American Award.",
            "title_similarity": "0.48598957",
            "sentiment_compound": 0.8143
        },
        {
            "id": "hylzyw3",
            "score": 2,
            "text": "GA people can vote for her opponent, Marcus Flowers & get her out of there.",
            "title_similarity": "0.69131875",
            "sentiment_compound": 0.0
        },
        {
            "id": "hym03ue",
            "score": 45,
            "text": " She could speak at a klan rally and no one would care. Republicans can do whatever they want. There are no consequences. \n\nThe people who literally attempted to overthrow the government are getting 45 day sentences.\n\nIt's all shit.",
            "title_similarity": "0.5865171",
            "sentiment_compound": -0.5106
        },
        {
            "id": "hym0eme",
            "score": 4,
            "text": "> Greene has a history of antisemitic and incendiary comments that include blaming California wildfires on “Jewish space lasers”, suggesting Muslims do not belong in government and warning that “gazpacho police” – presumably she meant Gestapo – patrol the US Capitol.\n\n🤦‍♂️🤦‍♂️🤦‍♂️🤦‍♂️🤦‍♂️",
            "title_similarity": "0.64931464",
            "sentiment_compound": -0.6808
        },
        {
            "id": "hym0ewx",
            "score": 1,
            "text": "The only thing fair is for her to take an American History aptitude test. She either gets everything wrong or realizes at one time Native Americans couldn’t testify on their own behalf in court and that is super fucked and we all win.",
            "title_similarity": "0.61150974",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hym0qh3",
            "score": 11,
            "text": "She should have been expelled long before now for so many reasons.",
            "title_similarity": "0.5333358",
            "sentiment_compound": -0.25
        },
        {
            "id": "hym13zf",
            "score": 2,
            "text": "[deleted]",
            "title_similarity": "0.31726855"
        },
        {
            "id": "hym155y",
            "score": 2,
            "text": "Why? Did you just figure out she’s a white supremacists 😅",
            "title_similarity": "0.5737161",
            "sentiment_compound": 0.128
        },
        {
            "id": "hym165x",
            "score": 1,
            "text": "I assumed they were talking about CPAC.",
            "title_similarity": "0.28071392",
            "sentiment_compound": 0.0
        },
        {
            "id": "hym1e33",
            "score": 1,
            "text": "And there have been calls to expel her since she has been \"elected\", so what's the difference here?  It's not like they are going to do anything.",
            "title_similarity": "0.66312206",
            "sentiment_compound": -0.6136
        },
        {
            "id": "hym1e5y",
            "score": 1,
            "text": "There are always calls to expel her for various horrible things she says and does. I’ve lost hope that anything will happen to her.",
            "title_similarity": "0.50585395",
            "sentiment_compound": -0.7003
        },
        {
            "id": "hym1k5u",
            "score": 1,
            "text": "Why would they expel her? That’s all the Republican Party is these days. If anything the non-racist Republicans are the minority in their own party.",
            "title_similarity": "0.6924835",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hym1mee",
            "score": 1,
            "text": "This chick was a nimrod before but now associates with white supremacists be? She represents some of you? Youre fucked.",
            "title_similarity": "0.627698",
            "sentiment_compound": -0.8738
        },
        {
            "id": "hym1wap",
            "score": 2,
            "text": "Woof. Someone said to himself “I’m gonna marry that.” And then another dude said “I’m gonna break up that marriage but only after I roll this tire over 46 times.”",
            "title_similarity": "0.4592232",
            "sentiment_compound": 0.0
        },
        {
            "id": "hym1zwt",
            "score": 4,
            "text": "I don't think people understand, this is why she got elected. This is what her constituents want represented. The GOP isn't going to do anything about this because if they do, they aren't getting enough votes to win any elections",
            "title_similarity": "0.584109",
            "sentiment_compound": 0.6249
        },
        {
            "id": "hym214y",
            "score": 3,
            "text": "Are there any methods in place for us to expel the Republican party? I imagine we're past the point where removing a few of their members from public office is enough to compensate the public for what they have done.",
            "title_similarity": "0.6791192",
            "sentiment_compound": -0.0516
        },
        {
            "id": "hym23v3",
            "score": 7,
            "text": "A pedophile cannot use “i didn’t know she was 12” as a defence. It’s his legal responsibility to know. Her claim that she didn’t know the organizer’s view is offensive. It is her job to know before she attends a conference. Both she and the pedo should be locked up. Preferably in the same cell.",
            "title_similarity": "0.6205073",
            "sentiment_compound": -0.2732
        },
        {
            "id": "hym2dx6",
            "score": 3,
            "text": "Are you kidding?!?  She’s the new standard-bearer of the GOP.",
            "title_similarity": "0.4777184",
            "sentiment_compound": 0.2621
        },
        {
            "id": "hym2mqc",
            "score": 3,
            "text": "But are there any Republicans calling for her expulsion?",
            "title_similarity": "0.7162714",
            "sentiment_compound": 0.0
        },
        {
            "id": "hym2s6h",
            "score": 2,
            "text": "Lock this racist trash up. Hunt these nazis down.",
            "title_similarity": "0.5744071",
            "sentiment_compound": -0.6124
        },
        {
            "id": "hym2xsz",
            "score": 2,
            "text": "I heard the voters for the Reich, er, Right stand and salute her.",
            "title_similarity": "0.51185066",
            "sentiment_compound": 0.0
        },
        {
            "id": "hym3czo",
            "score": 2,
            "text": "I'm sick to fucking death with every single one of them. LONG overdue!!!",
            "title_similarity": "0.3835656",
            "sentiment_compound": -0.8544
        },
        {
            "id": "hym3dje",
            "score": 2,
            "text": "Shes going nowhere until her term is up!  She respresents the ignorant, racist, krakka america. (The poor ones who couldn't afford to make the move to eastern europe)",
            "title_similarity": "0.6080811",
            "sentiment_compound": -0.8588
        },
        {
            "id": "hym3jlq",
            "score": 1,
            "text": "keep your pants on, everyone. she aint going nowhere. She knows her base, and already sold her soul to reach them.",
            "title_similarity": "0.33830896",
            "sentiment_compound": 0.0258
        },
        {
            "id": "hym3wvi",
            "score": 1,
            "text": "Can you imagine being married to something like that 🙈",
            "title_similarity": "0.26793158",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hym486e",
            "score": 19,
            "text": "This is not a bug, it’s a feature.\n\nIf you vote Republican, you’re either a white nationalist or white nationalism is not a deal breaker to you.\n\nThe reason this is the case is because there was no outcry from the right towards Trump over telling white supremacy groups to stand by, nothing at Paul Gosar over his attendance at a white nationalist conference, nothing said over Matt Gaetz’s America First group looking to “restore Anglo-Saxon traditions”, and nothing said of this.\n\nAnd that’s not even getting into the book burning and laws passed to whitewash American history.\n\nRepublicans are a party of white nationalists.",
            "title_similarity": "0.5893334",
            "sentiment_compound": 0.691
        },
        {
            "id": "hym49x8",
            "score": 3,
            "text": "I remember when a vice president couldn't spell potato, and the country went mad over it. Now any fucking fool with crazy views can get into Congress.\n\nThe world has gone mad",
            "title_similarity": "0.63323206",
            "sentiment_compound": -0.9053
        },
        {
            "id": "hym4a03",
            "score": 2,
            "text": "Firing this hatemonging mouth breathing idjit into the sun is too good of a punishment.",
            "title_similarity": "0.44132733",
            "sentiment_compound": -0.4019
        },
        {
            "id": "hym4ejg",
            "score": 1,
            "text": "Fuck around and find out, dumb blondes make mistakes and she's the dumbest blond on the planet.",
            "title_similarity": "0.48130596",
            "sentiment_compound": -0.9118
        },
        {
            "id": "hym4gbl",
            "score": 2,
            "text": "is r/Conservative crying about people pointing out she is a racist yet?",
            "title_similarity": "0.6216563",
            "sentiment_compound": -0.7964
        },
        {
            "id": "hym4iqr",
            "score": 2,
            "text": "Marjorie Taylor Green looks like the cheerleader version of Eric Stoltz in “Mask”",
            "title_similarity": "0.44146913",
            "sentiment_compound": 0.5267
        },
        {
            "id": "hym4p26",
            "score": 1,
            "text": "Gaddafi. Sadam. Mousollini...",
            "title_similarity": "0.28482804",
            "sentiment_compound": 0.0
        },
        {
            "id": "hym4ug6",
            "score": 1,
            "text": "Well, if ya sit down at the table with nine Nazis , there are ten at the table",
            "title_similarity": "0.29921037",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hym4uid",
            "score": 3,
            "text": "Majorie Taylor Green looks like she teaches softball.",
            "title_similarity": "0.36933482",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hym4ypr",
            "score": 3,
            "text": "One thing I like to do is call the offices of the worst representatives and ask the workers how it feels to work for them after scandals like this. I’ll admit, it’s oftentimes not very easy to get to anyone, particularly in moments like this. But I ask everyone to call MTG’s office and not ask to talk to her, just ask whoever answers the phone just how it feels. How are they explaining to themselves why it’s okay to work for this evil person?",
            "title_similarity": "0.5667151",
            "sentiment_compound": -0.8273
        },
        {
            "id": "hym518e",
            "score": 2,
            "text": "Georgia.  Please.  You’re a peach.  You’re better than this.",
            "title_similarity": "0.21490006",
            "sentiment_compound": 0.6369
        },
        {
            "id": "hym536q",
            "score": 1,
            "text": "Slow clap 👏",
            "title_similarity": "0.14185491",
            "sentiment_compound": 0.0
        },
        {
            "id": "hym54vp",
            "score": 1,
            "text": "Holy fuck man this needs to happen by yesterday....",
            "title_similarity": "0.32100776",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hym59qp",
            "score": 2,
            "text": "Asked if she endorses Fuentes’s views, Taylor Greene claimed: “I don’t know what his views are.”\n\nOk, so hey why are you speaking at his larping event?",
            "title_similarity": "0.5112858",
            "sentiment_compound": 0.34
        },
        {
            "id": "hym5ej9",
            "score": 3,
            "text": "White nationalist event? Wait, is there an RNC this year.",
            "title_similarity": "0.5554347",
            "sentiment_compound": 0.0
        },
        {
            "id": "hym5exk",
            "score": 1,
            "text": "This is humanity at its best",
            "title_similarity": "-0.01166225",
            "sentiment_compound": 0.6369
        },
        {
            "id": "hym5mot",
            "score": 3,
            "text": "Expel? I thought this is what got her elected in the first place.",
            "title_similarity": "0.5610852",
            "sentiment_compound": -0.4404
        },
        {
            "id": "hym5oyb",
            "score": 1,
            "text": "Send her to Ukraine to dig toilets.",
            "title_similarity": "0.39770186",
            "sentiment_compound": 0.0
        },
        {
            "id": "hym5pak",
            "score": 1,
            "text": "Please!!",
            "title_similarity": "0.03193337",
            "sentiment_compound": 0.4374
        },
        {
            "id": "hym5rct",
            "score": 2,
            "text": "Georgian here, I apologize but we have some backward ass people around here. Imagine if a dem did this, talking at a rally with a dude whose speech was talking about needing more white Americans, then a Putin chant breaking out just as they are invading and starting a war NO ONE agrees with? We would never hear the end of it, just like Hilary's E-mails.",
            "title_similarity": "0.73898494",
            "sentiment_compound": -0.9251
        },
        {
            "id": "hym5t40",
            "score": 3,
            "text": "We need to remove these Russian puppets out of our government and these racist white nationalists…lock them up and charge them to the fullest extent of the law…",
            "title_similarity": "0.7144997",
            "sentiment_compound": -0.6124
        },
        {
            "id": "hym5yot",
            "score": 4,
            "text": "Why is the girl from White Chicks making a living doing speeches?",
            "title_similarity": "0.54277873",
            "sentiment_compound": 0.0
        },
        {
            "id": "hym6628",
            "score": 3,
            "text": "They are pro-putin but their main argument against leftist politics is that it's communist? The far-right have always pissed their pants about communism, why the fuck are they pro Putin?",
            "title_similarity": "0.5778853",
            "sentiment_compound": -0.9447
        },
        {
            "id": "hym66b6",
            "score": 1,
            "text": "No shit. She just openly supported a gang of racists.",
            "title_similarity": "0.5024332",
            "sentiment_compound": 0.1838
        },
        {
            "id": "hym6a0g",
            "score": 3,
            "text": "Majorie Taylor Greene is what you get if you use the hatred genes of Hitler to impregnate Snooki.",
            "title_similarity": "0.5862459",
            "sentiment_compound": -0.6369
        },
        {
            "id": "hym6cui",
            "score": 1,
            "text": "Waiting for her excuse of \"I wasn't aware what type of convention it was when i spoke\"",
            "title_similarity": "0.38618502",
            "sentiment_compound": 0.0772
        },
        {
            "id": "hym6eui",
            "score": 3,
            "text": "Do they mean CPAC or the event she attended just prior?",
            "title_similarity": "0.43760508",
            "sentiment_compound": 0.0
        },
        {
            "id": "hym6oi2",
            "score": 1,
            "text": "Really, just a fight between Republicans on whether it’s ok to say the quiet part loud.",
            "title_similarity": "0.550383",
            "sentiment_compound": -0.1689
        },
        {
            "id": "hym6qk4",
            "score": 2,
            "text": "The Nazi Marjorie Taylor Greene \n\nFTFY",
            "title_similarity": "0.53769815",
            "sentiment_compound": 0.0
        },
        {
            "id": "hym6vi9",
            "score": 5,
            "text": "I'm generally contrarian to any attempt to cancel someone no matter what they said whether it be J.K. Rowling, Chris Pratt, Dave Chapelle, Joe Rogan, ect and I love getting downvotes for defending them, but yeh not going to defend Marjorie on this one. She is crossing a line. We don't need that in congress.",
            "title_similarity": "0.5317008",
            "sentiment_compound": 0.2647
        },
        {
            "id": "hym76j2",
            "score": 1,
            "text": "why won't they this time. \n\nbeen time to expel her before she was ever elected",
            "title_similarity": "0.71238536",
            "sentiment_compound": -0.4404
        },
        {
            "id": "hym77al",
            "score": 6,
            "text": "For fucks sake just do it already. This women is the dumbest most hateful piece of shit walking around on this earth.",
            "title_similarity": "0.4781303",
            "sentiment_compound": -0.9259
        },
        {
            "id": "hym7bno",
            "score": 1,
            "text": "Amerikaren",
            "title_similarity": "0.12792027",
            "sentiment_compound": 0.0
        },
        {
            "id": "hym7zkh",
            "score": 4,
            "text": "She is so fucking vile",
            "title_similarity": "0.3357419",
            "sentiment_compound": -0.688
        },
        {
            "id": "hym89ss",
            "score": 3,
            "text": "knowing how America's mentality works, the state of Georgia will re-elect her. same for the one from Colorado. They are the new norm",
            "title_similarity": "0.48455817",
            "sentiment_compound": 0.0
        },
        {
            "id": "hym8m3i",
            "score": 1,
            "text": "Eh",
            "title_similarity": "-0.038714163",
            "sentiment_compound": 0.0
        },
        {
            "id": "hym8qwp",
            "score": 3,
            "text": "There's calls to expell her at least once a day, unless anything actually happens it's hardly news worthy",
            "title_similarity": "0.48232752",
            "sentiment_compound": 0.3862
        },
        {
            "id": "hym8s6k",
            "score": 1,
            "text": "What? She got the floor in Congress agáin??!?",
            "title_similarity": "0.41799048",
            "sentiment_compound": 0.0
        },
        {
            "id": "hym8w36",
            "score": 1,
            "text": "Lol.. hate her guts and would love that but that’s not going to happen. She’s a “star” after all.",
            "title_similarity": "0.51954925",
            "sentiment_compound": 0.2846
        },
        {
            "id": "hym8x75",
            "score": 1,
            "text": "Has to be because she trying to promote these ideas on her 2022 midterm elections spot",
            "title_similarity": "0.4700335",
            "sentiment_compound": 0.3818
        },
        {
            "id": "hym8y4s",
            "score": 4,
            "text": "So fucking sick of this bullshit.",
            "title_similarity": "0.3527995",
            "sentiment_compound": -0.8258
        },
        {
            "id": "hym8yuu",
            "score": 3,
            "text": "Why? She is just following the Republican (unofficial) line.",
            "title_similarity": "0.47678867",
            "sentiment_compound": 0.0
        },
        {
            "id": "hym97zp",
            "score": 8,
            "text": "When you hold public office and you use the excuse of \"i didn't know who was coming and i just wanted them to know my message.\", While speaking at the equivalent of a kkk rally, fuck off. You knew and your manager knew.",
            "title_similarity": "0.6097938",
            "sentiment_compound": -0.4939
        },
        {
            "id": "hym9feu",
            "score": 2,
            "text": "If your party has a Putin wing, get a better party.",
            "title_similarity": "0.36448166",
            "sentiment_compound": 0.8074
        },
        {
            "id": "hym9hx1",
            "score": 1,
            "text": "The thought that this is the last straw is hilarious to me",
            "title_similarity": "0.18678658",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hym9pgx",
            "score": 2,
            "text": "Looks at Ukraine news: \"Man, what a country, leader, and people to be proud of.\"\n\nLooks at US News: *Deep sigh*",
            "title_similarity": "0.31183493",
            "sentiment_compound": 0.4939
        },
        {
            "id": "hyma0cx",
            "score": 2,
            "text": "Isnt this not the first time shes done this",
            "title_similarity": "0.15486003",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyma3t0",
            "score": 1,
            "text": "What drugs? So I can avoid them. Thx",
            "title_similarity": "0.4233916",
            "sentiment_compound": 0.0094
        },
        {
            "id": "hyma465",
            "score": 3,
            "text": "c u next tuesday",
            "title_similarity": "0.2886686",
            "sentiment_compound": 0.0
        },
        {
            "id": "hymahna",
            "score": 4,
            "text": "What a piece of shit she should of been gone soon as she said that Jewish lasers bullshit",
            "title_similarity": "0.6053616",
            "sentiment_compound": -0.8126
        },
        {
            "id": "hymap30",
            "score": 3,
            "text": "She’s just being a Republican.",
            "title_similarity": "0.44131392",
            "sentiment_compound": 0.0
        },
        {
            "id": "hymb3qy",
            "score": 2,
            "text": "MTG might be the worst person on the planet and that is saying a lot",
            "title_similarity": "0.5003209",
            "sentiment_compound": -0.6249
        },
        {
            "id": "hymb7cq",
            "score": 2,
            "text": "She’s a massive embarrassment to humanity. The content of this meeting is disgusting",
            "title_similarity": "0.5294767",
            "sentiment_compound": -0.743
        },
        {
            "id": "hymbfmu",
            "score": 1,
            "text": "Fucking hell, they're *still* going on about Hillary Clinton.",
            "title_similarity": "0.5588366",
            "sentiment_compound": -0.7089
        },
        {
            "id": "hymbkkg",
            "score": 2,
            "text": "Was chasing down children involved in school shootings calling them liars not enough? The republican party is so far gone",
            "title_similarity": "0.61466897",
            "sentiment_compound": -0.1779
        },
        {
            "id": "hymbok3",
            "score": 2,
            "text": "On behalf of the State of GA (well…at least most of us, I think?), I am so, so sorry that we’ve spilt this lunatic upon you all",
            "title_similarity": "0.51461715",
            "sentiment_compound": -0.6696
        },
        {
            "id": "hymbtia",
            "score": 1,
            "text": "She's gotta be doing this shit on purpose at this point.",
            "title_similarity": "0.31386614",
            "sentiment_compound": -0.6428
        },
        {
            "id": "hymbxge",
            "score": 2,
            "text": "Why would they do that when they are also white nationalists?",
            "title_similarity": "0.5547791",
            "sentiment_compound": 0.0
        },
        {
            "id": "hymc9dw",
            "score": 1,
            "text": "This makes me barf.",
            "title_similarity": "0.23628576",
            "sentiment_compound": 0.0
        },
        {
            "id": "hymcbdq",
            "score": 1,
            "text": "The fact America let’s actual Nazi’s hold office makes me sick.",
            "title_similarity": "0.5841796",
            "sentiment_compound": -0.5106
        },
        {
            "id": "hymcj5e",
            "score": 2,
            "text": "Hillary Clinton was right, she ad people like her are despicable. Everyone who doesn't agree can get lumped in with them. And I'm saying this as someone who doesn't really like Hillary Clinton.",
            "title_similarity": "0.6217494",
            "sentiment_compound": -0.2351
        },
        {
            "id": "hymcq6v",
            "score": 3,
            "text": ">The Georgia congresswoman told the gathering they were “canceled Americans” who had a responsibility to “stop the Democrats who are the **communist party of the United States of America**”\n\nMeanwhile the ACTUAL communist party is laughing.  (All 13 members of it)\n\nCan people PLEASE stop calling everything left of themselves communism?  The word has no meaning anymore.",
            "title_similarity": "0.7028692",
            "sentiment_compound": 0.876
        },
        {
            "id": "hymcs6s",
            "score": 1,
            "text": "Doesn’t matter how they dress it up, NAZI’s suck",
            "title_similarity": "0.45521104",
            "sentiment_compound": -0.4215
        },
        {
            "id": "hymdftt",
            "score": 1,
            "text": "Get her out",
            "title_similarity": "0.38176322",
            "sentiment_compound": 0.0
        },
        {
            "id": "hymdqhq",
            "score": 1,
            "text": "Oh, the ol, if you do this again, we’re gonna start thinkin about gettin angry.",
            "title_similarity": "0.51710206",
            "sentiment_compound": -0.5106
        },
        {
            "id": "hymdwnc",
            "score": 1,
            "text": "Can someone explain why the government has the power to expel democratically elected representatives? I know it sounds like I’m trolling, but I have no love for Greene. I just have a thought exercise where I think about how any amount of power *can* be abused because there’s always the possibility that it *will*. I’m actually curious what the benefit here is in the larger picture",
            "title_similarity": "0.6512232",
            "sentiment_compound": -0.5027
        },
        {
            "id": "hymdzlm",
            "score": 2,
            "text": "She appeared at a GOP event?",
            "title_similarity": "0.39849618",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyme3mm",
            "score": 1,
            "text": "Fuxk her mercilessly with a searing tire iron, and anyone who voted for this stain of paramecium excrement.",
            "title_similarity": "0.49959543",
            "sentiment_compound": 0.0
        },
        {
            "id": "hymekr0",
            "score": 3,
            "text": "The irony of the picture accompanying the article being her speaking at CPAC and the headline still ringing true...",
            "title_similarity": "0.39228916",
            "sentiment_compound": 0.3818
        },
        {
            "id": "hymeuk5",
            "score": 1,
            "text": "We’re finally calling CPAC a white nationalist movement?",
            "title_similarity": "0.5860254",
            "sentiment_compound": 0.0
        },
        {
            "id": "hymf2vf",
            "score": 3,
            "text": "They need to get rid of this disgusting person.",
            "title_similarity": "0.48104542",
            "sentiment_compound": -0.6124
        },
        {
            "id": "hymfgxw",
            "score": 1,
            "text": "How many GOPers in recent history who have been called to resign have actually done so? This is meaningless as usual.",
            "title_similarity": "0.51559985",
            "sentiment_compound": -0.6486
        },
        {
            "id": "hymfj37",
            "score": 1,
            "text": "No but al franken is the problem",
            "title_similarity": "0.3617297",
            "sentiment_compound": -0.631
        },
        {
            "id": "hymfkkq",
            "score": 2,
            "text": "Can you imagine what she would say if she lost re-election? She would claim it was rigged and that her supporters must pick up guns and fight.  She is a nut job and dangerous and shouldn’t be allowed to service in public office.",
            "title_similarity": "0.71274066",
            "sentiment_compound": -0.765
        },
        {
            "id": "hymfqos",
            "score": 1,
            "text": "Hey why even bother with vetting, just find somebody who likes you and go right ?",
            "title_similarity": "0.3411337",
            "sentiment_compound": 0.1027
        },
        {
            "id": "hymftsn",
            "score": 1,
            "text": "Yes. Fuck GQP Weaponized Karen.",
            "title_similarity": "0.46596026",
            "sentiment_compound": -0.2023
        },
        {
            "id": "hymg1w5",
            "score": 1,
            "text": "Haha this is funny…should be in the r/funny because it will never happen",
            "title_similarity": "0.30851752",
            "sentiment_compound": 0.4588
        },
        {
            "id": "hymg6y5",
            "score": 1,
            "text": "Was that event called CPAC by any chance?",
            "title_similarity": "0.23697865",
            "sentiment_compound": 0.25
        },
        {
            "id": "hymgqgw",
            "score": 1,
            "text": "Why would the RNC ever expel her, doing shit like this wins her points",
            "title_similarity": "0.631835",
            "sentiment_compound": -0.0772
        },
        {
            "id": "hymgsx9",
            "score": 3,
            "text": "event that not only had a 'Putin! Putin!' chant, but also where the event organizer, who shook hands with and introduced MTG to speak, praised hitler in his speech.",
            "title_similarity": "0.41056848",
            "sentiment_compound": 0.6467
        },
        {
            "id": "hymh4yc",
            "score": 1,
            "text": "I can’t believe something like this would even be up for debate to do……..On second thought, in the 2020’s I’m not surprised anymore.",
            "title_similarity": "0.32292894",
            "sentiment_compound": 0.2105
        },
        {
            "id": "hymh5if",
            "score": 1,
            "text": "Yeah, yeah, and nothing will change.  \n\n\nAt what point do we start doing things instead of asking someone else to do them? Do we need another civil war or another terrorist occupation with hundreds of deaths? It seems like the GOP is gone off the deep end a long time ago and everyone else is just waiting for someone else to fix it. We might as well just succumb to the inevitable North Korea we're gonna become because too many people are sitting on their hands.",
            "title_similarity": "0.63354504",
            "sentiment_compound": -0.4515
        },
        {
            "id": "hymhcpz",
            "score": 2,
            "text": "**doing that** should just be a straight disqualification for the role. \n\n*we have no room for bigots, anti-semites, or hate groups in America*; that is not what we stand for and **not** who we support. Those in opposition have no room in our future.",
            "title_similarity": "0.6168928",
            "sentiment_compound": -0.8155
        },
        {
            "id": "hymhdrd",
            "score": 1,
            "text": "Like any cancer, she needs to be cut out before it’s too late.",
            "title_similarity": "0.5204419",
            "sentiment_compound": -0.6124
        },
        {
            "id": "hymhltp",
            "score": 1,
            "text": "I give 5 years until being an active klan member will be a requirement to join congress or the senate",
            "title_similarity": "0.35133243",
            "sentiment_compound": 0.5994
        },
        {
            "id": "hymhqa8",
            "score": 1,
            "text": "Fascism doesn’t magically appear one day, it grows little by little and she’s a part of the wave. This wave must be dissolved.",
            "title_similarity": "0.560028",
            "sentiment_compound": 0.0
        },
        {
            "id": "hymig38",
            "score": 1,
            "text": "I’m so sick of her. I’m so sick of the Republican Party.",
            "title_similarity": "0.6200332",
            "sentiment_compound": -0.7298
        },
        {
            "id": "hymioq4",
            "score": 1,
            "text": "I  think calls for her expulsion have been made since she got in.\n\nIts totally true. The rats living in this \"womans\" head have chewed completely through the wiring and shes straight up throwing error codes left and right.\n\nOnly  thing now to do with her is to take her to the car crusher and do it old school style.\n\nI mean on one hand we have this absolute legend of a politician and person in the Ukraine President. \n\nAnd then on the other hand we have Her.\n\ntalk about complete opposite ends of the spectrum of humanity",
            "title_similarity": "0.58795196",
            "sentiment_compound": 0.8268
        },
        {
            "id": "hymj32s",
            "score": 1,
            "text": "She is trash and has no business representing Americans.",
            "title_similarity": "0.51672035",
            "sentiment_compound": -0.296
        },
        {
            "id": "hymj3e3",
            "score": 1,
            "text": "Show your CPAC ticket at the door to the White Nationalist Convention and get $10 off admission.",
            "title_similarity": "0.5250423",
            "sentiment_compound": 0.0
        },
        {
            "id": "hymj7w0",
            "score": 1,
            "text": "Omg she’s a nazi?????",
            "title_similarity": "0.5253084",
            "sentiment_compound": 0.0
        },
        {
            "id": "hymjkf1",
            "score": 1,
            "text": "As much as I dislike this fucking moron, there will never be enough votes to get rid of her.\n\nStop giving attention to clickbait articles because it makes you feel like progress can be made when it literally can't.",
            "title_similarity": "0.5348722",
            "sentiment_compound": -0.1513
        },
        {
            "id": "hymjto3",
            "score": 1,
            "text": "Do I have this right? Are American conservatives ok with a Russian leader invading another European country????",
            "title_similarity": "0.6115179",
            "sentiment_compound": 0.4871
        },
        {
            "id": "hymk3ct",
            "score": 1,
            "text": "Why expel her when you can make her the chairman the Grand Wizard division of the GOP? They embrace white supremacy.",
            "title_similarity": "0.7257376",
            "sentiment_compound": 0.3818
        },
        {
            "id": "hyml0tt",
            "score": 3,
            "text": "Dude, she assaulted school shooting victims and told them they were liars and fakes. She made antisemitic comments by trying to convince congress that a Jewish space laser set fires in California. If that didn't make her lose everything she ever had in life and put on the street to starve, she is verified untouchable. \n\nHell, I bet her district will even vote her in again. We have been at the point where the GOP are the enemy of the free world, and they hold enough power to keep themselves (even the worst of them) from having to face any consequences, for a very long time now.",
            "title_similarity": "0.67450166",
            "sentiment_compound": -0.9659
        },
        {
            "id": "hymlf1t",
            "score": 6,
            "text": "Right, call on Republicans to expel a vicious, ignorant racist from their ranks. These are TRUMP VOTERS that we're talking about, ffs.",
            "title_similarity": "0.7570012",
            "sentiment_compound": -0.936
        },
        {
            "id": "hymlfsy",
            "score": 1,
            "text": "can you imagine if someone like AOC went to a conference that was pro Jinping or pro CCP, how quickly people like McCarthy and Greene other republicans would absolutely lose their shit?",
            "title_similarity": "0.7300315",
            "sentiment_compound": -0.4323
        },
        {
            "id": "hymlgyn",
            "score": 1,
            "text": "Masks off",
            "title_similarity": "0.2479846",
            "sentiment_compound": 0.0
        },
        {
            "id": "hymlj7n",
            "score": 1,
            "text": "If USA doesnt become more united after Putins invansion. It will be very hard",
            "title_similarity": "0.46492323",
            "sentiment_compound": -0.501
        },
        {
            "id": "hymlq5q",
            "score": 1,
            "text": "Could someone give me an example of a \"far left extremist\" being exposed as one in the guardian?",
            "title_similarity": "0.6289146",
            "sentiment_compound": -0.0772
        },
        {
            "id": "hymm1r4",
            "score": 1,
            "text": "'Call' all you want but it doesn't mean dick if you don't follow through.",
            "title_similarity": "0.21567042",
            "sentiment_compound": 0.5723
        },
        {
            "id": "hymma50",
            "score": 1,
            "text": "Finally calling CPAC for what it is: a “white nationalist event”.",
            "title_similarity": "0.5401559",
            "sentiment_compound": 0.0
        },
        {
            "id": "hymmeah",
            "score": 3,
            "text": "Fred Wellman, a political consultant and Iraq war veteran, commented on Twitter: “This is where Marjorie Taylor Greene spent her evening. Laughing about comparisons to Hitler being bad. This is who she is. You know they burned crosses in Martin Luther King’s yard just 62 years ago. It’s time for Georgia to put this trash out forever.”",
            "title_similarity": "0.6485874",
            "sentiment_compound": -0.6369
        },
        {
            "id": "hymmpfj",
            "score": 1,
            "text": "Calls from reasonable people?  Because that's not who the GOP panders to.  They pander to white supremacists.",
            "title_similarity": "0.57051337",
            "sentiment_compound": -0.25
        },
        {
            "id": "hymmzo0",
            "score": 1,
            "text": "that’s what you have to do to qualify to be a Republican, they certainly won’t kick her out for it.",
            "title_similarity": "0.5641903",
            "sentiment_compound": 0.34
        },
        {
            "id": "hymn1xb",
            "score": 2,
            "text": "When she was born the doctor slapped her mother in the mouth",
            "title_similarity": "0.5636544",
            "sentiment_compound": 0.0
        },
        {
            "id": "hymnaey",
            "score": 5,
            "text": "Trying hard not to despair over these kinds of headlines, because nothing ever seems to happen to the person in question. \"X ridiculed by online groups after insane (tirade, tweet storm, speech, etc.),\" \"Calls for Y's expulsion after (slip-up, clueless racism, ignorance, etc), \"Possible disbarment/censure/lawsuit after Z's (_phobic comments, Hatch Act violations, Epstein involvement, etc.).\n\nNot a month goes by without reading these types of news, doing their damnedest best to tank these people (manufactured outrage, some say),  yet there walks Boebert, there struts Taylor-Green, there grins Carlson; there they all are, riding high with viewership wins, flush with donor money, free as a bird, popular as ever.",
            "title_similarity": "0.56340605",
            "sentiment_compound": -0.7382
        },
        {
            "id": "hymnajn",
            "score": 3,
            "text": "Could the US, just get on with fucking this nut bag off and stop just taking about it.",
            "title_similarity": "0.5047916",
            "sentiment_compound": -0.296
        },
        {
            "id": "hymo20j",
            "score": 6,
            "text": "MTG is the GOP, she’s an a uneducated racist who believes every stupid conspiracy born in Russia she comes across. She’s a female trump, but even dumber and uglier. She’s perfect, they ain’t going to expel her, they are going to run her for POTUS",
            "title_similarity": "0.61580384",
            "sentiment_compound": -0.8674
        },
        {
            "id": "hymodlq",
            "score": 1,
            "text": "At least sterilize her.",
            "title_similarity": "0.32477167",
            "sentiment_compound": 0.0
        },
        {
            "id": "hymorm9",
            "score": 1,
            "text": "I hope they mean expelling her from the planet?",
            "title_similarity": "0.6708313",
            "sentiment_compound": 0.0772
        },
        {
            "id": "hympaqw",
            "score": 1,
            "text": "You won’t catch me saying anything positive about MTG or her contemporaries but hard anti-establishment candidates of both parties are pretty fucking braindead at this point.",
            "title_similarity": "0.58610106",
            "sentiment_compound": 0.8608
        },
        {
            "id": "hympm6x",
            "score": 1,
            "text": "“Ya’ll, How was I supposed to know them fine men were Nazis? They were just talking like good ol’ boys from back home that happened to think white men should be running things because white people were put on this earth by God to rule over inferior people? I mean…come on ya’ll, how was I supposed to know? All my supporters regularly intimidate others into letting me win when I run in districts I’ve never lived in, and what’s the big deal with a little friendly racism and cheering on murderous dictators before I get on stage to speak?”\n-allegedly probably MTG",
            "title_similarity": "0.61286247",
            "sentiment_compound": 0.864
        },
        {
            "id": "hympte1",
            "score": 1,
            "text": ",⁰9th r Raza ZZZz4",
            "title_similarity": "0.1542265",
            "sentiment_compound": 0.0
        },
        {
            "id": "hympvtn",
            "score": 1,
            "text": "I wish we lived in an age where this would be a no-brainer and proceed smoothly",
            "title_similarity": "0.339565",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hymqc6x",
            "score": 1,
            "text": "How did we get here",
            "title_similarity": "0.04629767",
            "sentiment_compound": 0.0
        },
        {
            "id": "hymqk4q",
            "score": 2,
            "text": "There are few lower than this pond life…🦠",
            "title_similarity": "-0.04206895",
            "sentiment_compound": -0.296
        },
        {
            "id": "hymqlk0",
            "score": 1,
            "text": "The end.",
            "title_similarity": "0.23587751",
            "sentiment_compound": 0.0
        },
        {
            "id": "hymqmx7",
            "score": 1,
            "text": "This will only prove to increase her power within the Republican Party.",
            "title_similarity": "0.47139698",
            "sentiment_compound": 0.6124
        },
        {
            "id": "hymqq14",
            "score": 2,
            "text": "My god this is great to hear. This psycho is not cut out for government works.  She’s racist, a antagonizer and honestly flat out stupid with garbage she says and does. I hope she’s done for good, she is a total piece of shit.",
            "title_similarity": "0.5449816",
            "sentiment_compound": 0.55
        },
        {
            "id": "hymr5aa",
            "score": 3,
            "text": "She is a filthy excuse for a human there is no loss in shutting down her vile work",
            "title_similarity": "0.40278727",
            "sentiment_compound": -0.4287
        },
        {
            "id": "hymrhgr",
            "score": 2,
            "text": "Vote. Vote vote vote. Who can stop these morons? We can. Vote.",
            "title_similarity": "0.5542113",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hymrxhr",
            "score": 1,
            "text": "\"Gazpacho police\". They don't sound so scary.",
            "title_similarity": "0.0744538",
            "sentiment_compound": -0.6269
        },
        {
            "id": "hyms49z",
            "score": 1,
            "text": "She's mental.",
            "title_similarity": "0.13049889",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyms6cq",
            "score": 2,
            "text": "I'm glad we're calling it the \"White Nationalist Event\" and not CPAC/AFPAC. Let's call it what it is.",
            "title_similarity": "0.5015716",
            "sentiment_compound": 0.4588
        },
        {
            "id": "hymsu9i",
            "score": 1,
            "text": "Thank you!",
            "title_similarity": "0.0054169707",
            "sentiment_compound": 0.4199
        },
        {
            "id": "hymtg8k",
            "score": 1,
            "text": " Calls from who? All her voters were in attendance.",
            "title_similarity": "0.31514737",
            "sentiment_compound": 0.0
        },
        {
            "id": "hymtpr7",
            "score": 7,
            "text": "anyone else ponder why a non white person would support republicans?",
            "title_similarity": "0.5093418",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hymuo55",
            "score": 2,
            "text": "This skank should be expelled from our country along with all of her Nazi supporters.",
            "title_similarity": "0.71724355",
            "sentiment_compound": 0.2263
        },
        {
            "id": "hymuvrd",
            "score": 3,
            "text": "“If there’s a Nazi at the table and 10 other people sitting there talking to him, you got a table with 11 Nazis.”",
            "title_similarity": "0.34930086",
            "sentiment_compound": 0.0
        },
        {
            "id": "hymv4eg",
            "score": 3,
            "text": "She is a Republican.  This is how every single one of them thinks and acts.",
            "title_similarity": "0.41630092",
            "sentiment_compound": 0.0
        },
        {
            "id": "hymvw4o",
            "score": 3,
            "text": "To be fair, any event at which she speaks is a white nationalist event.",
            "title_similarity": "0.61820924",
            "sentiment_compound": 0.3182
        },
        {
            "id": "hymwh2h",
            "score": 6,
            "text": "Any republican willing to denounce white supremacy, now's your time.",
            "title_similarity": "0.7270101",
            "sentiment_compound": -0.296
        },
        {
            "id": "hymwja7",
            "score": 3,
            "text": "No one is going to do anything. Who cares at this point. Anyone in a position seems to be an untouchable.",
            "title_similarity": "0.32502905",
            "sentiment_compound": 0.2023
        },
        {
            "id": "hymwrt2",
            "score": 2,
            "text": "Send her to Moscow. She’ll fit right in.",
            "title_similarity": "0.2618798",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hymwv8d",
            "score": 2,
            "text": "> \"He’s killing people over and over.\" \n\nHe's killing them *to death!* The monster!\n\nAttagirl Margie. You tell 'em.",
            "title_similarity": "0.50277317",
            "sentiment_compound": -0.9358
        },
        {
            "id": "hymwxkn",
            "score": 1,
            "text": "That woman is just pathetic, get her out",
            "title_similarity": "0.44924656",
            "sentiment_compound": -0.5719
        },
        {
            "id": "hymx61f",
            "score": 1,
            "text": "Expel? She just made sure another minority is in their camp….",
            "title_similarity": "0.5482218",
            "sentiment_compound": -0.1531
        },
        {
            "id": "hymxi3f",
            "score": 2,
            "text": "I usually disagree with the cancel culture and tend to lean right but I agree with this one.",
            "title_similarity": "0.23137134",
            "sentiment_compound": 0.2382
        },
        {
            "id": "hymxuuf",
            "score": 1,
            "text": "Fuentes Is such a beast",
            "title_similarity": "0.14609668",
            "sentiment_compound": 0.0
        },
        {
            "id": "hymya30",
            "score": 1,
            "text": "The only good thing is that whoever runs against her is going to have unlimited funding.  But then she'll just get picked up by Fox News...",
            "title_similarity": "0.44720614",
            "sentiment_compound": 0.2382
        },
        {
            "id": "hymynro",
            "score": 1,
            "text": "It’s ok you guys, she said she didn’t know (/s)",
            "title_similarity": "0.34885985",
            "sentiment_compound": 0.296
        },
        {
            "id": "hymyo7y",
            "score": 1,
            "text": "How are we just letting people like her destroy the fabric of our country? \n\nAre we really just hiding behind our phones and hoping that these people will go away? Is that what I’m doing right now? \n\nIt really feels like we’re losing our grasp on the United States… this is beyond shameful.",
            "title_similarity": "0.6699585",
            "sentiment_compound": -0.3485
        },
        {
            "id": "hymyqm4",
            "score": 3,
            "text": "You don't have to say, \"White Nationalist\"; you can just say \"Republican\". They are one and the same.",
            "title_similarity": "0.37628555",
            "sentiment_compound": 0.0
        },
        {
            "id": "hymyuse",
            "score": 1,
            "text": "Calls for this, calls for that. Wake me up when something actually happens.",
            "title_similarity": "0.17319861",
            "sentiment_compound": 0.0
        },
        {
            "id": "hymzjbv",
            "score": 1,
            "text": "She *is* the Republican party, there is no removing her.",
            "title_similarity": "0.46203864",
            "sentiment_compound": 0.128
        },
        {
            "id": "hymzw8k",
            "score": 1,
            "text": "We don’t have to overthink it. She needs to go. There is right and wrong, we can’t keep debating what we see is wrong.",
            "title_similarity": "0.39528164",
            "sentiment_compound": -0.7351
        },
        {
            "id": "hymzwz4",
            "score": 2,
            "text": "We need a new constitution.",
            "title_similarity": "0.39052123",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyn01eh",
            "score": 2,
            "text": "If the calls aren’t coming from inside the party, it doesn’t matter.",
            "title_similarity": "0.20899704",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hyn0kg9",
            "score": 1,
            "text": "Republicans are just lost. She should have been expelled long time ago but she is sucking someone off.",
            "title_similarity": "0.66879445",
            "sentiment_compound": -0.2846
        },
        {
            "id": "hyn11ec",
            "score": 1,
            "text": "narrator: \"she was not expelled\"",
            "title_similarity": "0.11533409",
            "sentiment_compound": 0.1877
        },
        {
            "id": "hyn1cvc",
            "score": 1,
            "text": "The likes of this elected official, speaking favourably of Putin should be rounded up and put on trail on the grounds of seditious support of a nation deemed a threat to American National security. McCarthy is spinning in his grave, he'd be chomping at the bit to put the idiots behind bars!!",
            "title_similarity": "0.68534386",
            "sentiment_compound": -0.3365
        },
        {
            "id": "hyn1li1",
            "score": 1,
            "text": "Lock her up.",
            "title_similarity": "0.41047823",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyn1r09",
            "score": 1,
            "text": "It drives me nuts words have lost all meaning, and reality is whatever you make it.\n\nShe says they are cancelled Americans and they need to drive out the ‘communist’ Democratic Party, she probably doesn’t even know what communist means, just a buzzword.\n\nFrankly, an anti-Semitic woman who bullies others, harasses school shooting survivors, talks with the intelligence level of a seventh grader, should be cancelled the fuck out of our government.\n\nGoddamnit, how did we get here?",
            "title_similarity": "0.7675904",
            "sentiment_compound": -0.8316
        },
        {
            "id": "hyn217k",
            "score": 1,
            "text": "Gosh, I just assumed this would be about CPAC. It just gets crazier.",
            "title_similarity": "0.39459044",
            "sentiment_compound": -0.0258
        },
        {
            "id": "hyn23ro",
            "score": 1,
            "text": "As big a piece of shit as she is, its painfully short sighted to call for her to be expelled for attending a white nationalist event. It would open the way for anyone to be expelled for  attending any event that was deemed subversive by the opposing party. She may be a fascist, but banning her would open the door to more fascism. Get her out legally.",
            "title_similarity": "0.77689",
            "sentiment_compound": -0.7003
        },
        {
            "id": "hyn28i6",
            "score": 1,
            "text": "Hey, let's not forget other faces seen there, our boy Paul Gosar should also receive the same calls.\n\n> Her patronage of AFPAC, where the Arizona congressman Paul Gosar also appeared via pre-recorded video, provoked sharp condemnation of party leaders for failing to discipline her.",
            "title_similarity": "0.6015136",
            "sentiment_compound": -0.7035
        },
        {
            "id": "hyn29x9",
            "score": 4,
            "text": "After 60 you shouldn't be allowed to vote or run for offices. The brain goes too soft.",
            "title_similarity": "0.5730314",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyn2hbe",
            "score": 2,
            "text": "I thought every time she speaks it becomes a white nationalist event",
            "title_similarity": "0.6390258",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyn2jej",
            "score": 1,
            "text": "She's courting every grifter around right now, shes going to try running for president, just watch.",
            "title_similarity": "0.5332382",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyn2ohu",
            "score": 1,
            "text": "She looks like a ball sack that has been sitting in the Florida sun for 50 years.",
            "title_similarity": "0.2152145",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hyn2rat",
            "score": 1,
            "text": "Trump has been real quite this last week and some change🤔",
            "title_similarity": "0.23173633",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyn2wja",
            "score": 1,
            "text": "Man, I was just thinking it’s been quite a while since I’ve heard about this moron. Welp.",
            "title_similarity": "0.32119614",
            "sentiment_compound": -0.5789
        },
        {
            "id": "hyn2xjf",
            "score": 3,
            "text": "Republicans don't care about being called racist.",
            "title_similarity": "0.439071",
            "sentiment_compound": -0.7669
        },
        {
            "id": "hyn2xvf",
            "score": 3,
            "text": "White supremacy event , not white nationalist.",
            "title_similarity": "0.4191758",
            "sentiment_compound": 0.0516
        },
        {
            "id": "hyn2z8h",
            "score": 2,
            "text": "She should join the Putine cabinet.",
            "title_similarity": "0.4311221",
            "sentiment_compound": 0.296
        },
        {
            "id": "hyn31n3",
            "score": 2,
            "text": "Worlds going to shit and of course these clowns have their annual sharing of the brain cell convention.",
            "title_similarity": "0.4002815",
            "sentiment_compound": -0.2023
        },
        {
            "id": "hyn32nf",
            "score": 4,
            "text": "White nationalism is extremely concerning and republicans being so comfortable with it is even worse.\n\nAmerican politics are absolutely abysmal.",
            "title_similarity": "0.5586035",
            "sentiment_compound": 0.2827
        },
        {
            "id": "hyn35wf",
            "score": 1,
            "text": "What the actual fuck.",
            "title_similarity": "0.19030836",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hyn36zf",
            "score": 1,
            "text": "She is a disgusting human! Only in congress to enrich her self more and more and interfere in progress and Taunt Parkland shooting students!",
            "title_similarity": "0.61163396",
            "sentiment_compound": -0.2924
        },
        {
            "id": "hyn390w",
            "score": 1,
            "text": "How can I help make this happen?",
            "title_similarity": "0.12816091",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hyn3acx",
            "score": 1,
            "text": "Whoever wrote this story is either very confused or just very manipulative, yikes.",
            "title_similarity": "0.35888034",
            "sentiment_compound": -0.3804
        },
        {
            "id": "hyn3c2s",
            "score": 1,
            "text": "Not excusing this in anyway and she should be in prison for half the crap she pulled but, weren’t a lot of southern politicians in the KKK? Again not excusing it just not shocked. Woman is absolute ignorant garbage and is a traitor to the USA.",
            "title_similarity": "0.62456346",
            "sentiment_compound": -0.4866
        },
        {
            "id": "hyn3f8w",
            "score": 1,
            "text": "She’s a Proboscis Monkey, you can’t change my mind.",
            "title_similarity": "0.2927451",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyn3seq",
            "score": 2,
            "text": "Tired of hearing about this carnie!",
            "title_similarity": "0.3472952",
            "sentiment_compound": -0.4926
        },
        {
            "id": "hyn3uh3",
            "score": 2,
            "text": "Literally an agent of chaos trying to sow discord into the ignorant so they can in turn do incredibly stupid things.",
            "title_similarity": "0.51503915",
            "sentiment_compound": -0.9041
        },
        {
            "id": "hyn44ff",
            "score": 1,
            "text": "I’ve been calling for her expulsion since she attempted to aid terrorists in a mass murder of the Democratic Party on Jan 6.",
            "title_similarity": "0.70177317",
            "sentiment_compound": -0.7964
        },
        {
            "id": "hyn46qi",
            "score": 1,
            "text": "Hey there was a lot more than just MTG speaking at CPAC.",
            "title_similarity": "0.1667839",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyn4dwb",
            "score": 2,
            "text": "After watching what is going on in Ukraine I have no patience with our absolutely fucked radical politicians",
            "title_similarity": "0.52336496",
            "sentiment_compound": -0.7841
        },
        {
            "id": "hyn4fpj",
            "score": 7,
            "text": "If you’re at an event where one guy displays a Nazi flag, and that guy doesn’t immediately get the shit kicked out of him, you’re at a Nazi event.",
            "title_similarity": "0.44981828",
            "sentiment_compound": 0.6124
        },
        {
            "id": "hyn4fzb",
            "score": 2,
            "text": "Clearly she is going to be our next president.",
            "title_similarity": "0.4519441",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hyn52lz",
            "score": 1,
            "text": "The woman that makes me think I don’t need a basic education to be in politics",
            "title_similarity": "0.460816",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyn5oqd",
            "score": 1,
            "text": "I feel like the only thing that can be effective at calling them out is when they're caught being candidly themselves. People are adept at doublespeak these days, and there's always plausible deniability, until they're caught using all the vulgar language they use at home. What comes to mind is the judge recently who had a video leak of her yelling \"it's a n___! it's a n___! Just like a roach!\" while watching home security footage of an attempted robbery.",
            "title_similarity": "0.47425967",
            "sentiment_compound": 0.8392
        },
        {
            "id": "hyn5uwa",
            "score": 2,
            "text": "She is so nasty, inside and out ❤️",
            "title_similarity": "0.33757526",
            "sentiment_compound": -0.6825
        },
        {
            "id": "hyn5vs1",
            "score": 3,
            "text": "Tell that Putin/ Trump worshiping trash to go fuck herself,  just in case!",
            "title_similarity": "0.6613631",
            "sentiment_compound": -0.4199
        },
        {
            "id": "hyn5xee",
            "score": 1,
            "text": "“Calls”….   We’ll see.",
            "title_similarity": "0.19156832",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyn6k3t",
            "score": 2,
            "text": "Purge the fascists of the world",
            "title_similarity": "0.6236706",
            "sentiment_compound": -0.2023
        },
        {
            "id": "hyn6t7o",
            "score": 3,
            "text": "Republicans believe that their constituents are the most gullible and susceptible in the world every election they bring up the same red meat.. the Democrats are going to come get your guns, Democrats are going to raise taxes, open borders , Hillary Clinton's emails , Hunters laptop, etc etc  etc but I guarantee nothing will come up on the things we all can prove Trump has done",
            "title_similarity": "0.63899446",
            "sentiment_compound": 0.154
        },
        {
            "id": "hyn6z76",
            "score": 1,
            "text": "may be you go figure out why her constituents voted her while you are at it...There is a real danger in happening again else where.",
            "title_similarity": "0.6040124",
            "sentiment_compound": -0.5267
        },
        {
            "id": "hyn76qo",
            "score": 2,
            "text": "Let’s get gazpacho out",
            "title_similarity": "0.36782178",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyn7btw",
            "score": 1,
            "text": "Are the “calls to expel” from dems? Because I bet the republicans would be totally fine with whatever she says",
            "title_similarity": "0.6534883",
            "sentiment_compound": 0.2716
        },
        {
            "id": "hyn7bwd",
            "score": 6,
            "text": "I keep asking this question here again and again. Why is it the responsibility of the Democrats to expel her from the House? Why is the GOP leadership NOT kicking her out of their conference? Why are her constituents not petitioning her to resign? Why is the Governor of her state not telling her to resign?\n\nIf one party has to carry the burden of the entire country, this Republic will not endure.\n\nStop putting the responsibility onus on the Democrats ALONE.\n\nCall out the GOP leadership, their funders and enablers for doing this.\n\nWhere are the patriots on the GOP side?",
            "title_similarity": "0.771607",
            "sentiment_compound": -0.8659
        },
        {
            "id": "hyn7fhk",
            "score": 1,
            "text": "can anyone verify that mtg has a penis?",
            "title_similarity": "0.2148776",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyn7gx1",
            "score": 4,
            "text": "Why doesn’t the GOP just come out as the white supremacy party at this point?  Everyone knows that’s what they really are.",
            "title_similarity": "0.5601449",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hyn7mq5",
            "score": 1,
            "text": "“Kick her out, kick her out!!!”",
            "title_similarity": "0.40639603",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyn7zwn",
            "score": 1,
            "text": "How can I help to get this woman removed from office?  Write my senator?",
            "title_similarity": "0.7514714",
            "sentiment_compound": 0.4696
        },
        {
            "id": "hyn8ckx",
            "score": 2,
            "text": "Everyone calm down. Did she publicly use Dijon mustard or admit to having a friend named Squee?",
            "title_similarity": "0.5161518",
            "sentiment_compound": 0.743
        },
        {
            "id": "hyn8e6h",
            "score": 2,
            "text": "I’ve never liked this clown",
            "title_similarity": "0.26160127",
            "sentiment_compound": -0.3252
        },
        {
            "id": "hyn8h14",
            "score": 2,
            "text": "Maybe she should know (she did)  what political views the organizer of a political events has before she agrees to speak.",
            "title_similarity": "0.59371245",
            "sentiment_compound": 0.2023
        },
        {
            "id": "hyn8kqd",
            "score": 3,
            "text": "This hateful creature needs to go.",
            "title_similarity": "0.39142728",
            "sentiment_compound": -0.4939
        },
        {
            "id": "hyn8nzk",
            "score": 2,
            "text": "Should have gotten rid of her a long time ago. She crossed a line and a line and a line. Can we not impeach representatives like a president?",
            "title_similarity": "0.74880254",
            "sentiment_compound": -0.2755
        },
        {
            "id": "hyn982g",
            "score": 3,
            "text": "She is probably \"yeah give in to your anger\" or whatever the phrase is. She probably have a ton of hate related gigs lined up.",
            "title_similarity": "0.5946117",
            "sentiment_compound": -0.7351
        },
        {
            "id": "hyn9m4r",
            "score": 3,
            "text": "This is the republican party now. When \"nice people\" donate money to the GOP, it ends up in the hands of nazis. This is not Ronald Reagan's party, this is a dirty, ignorant stain on America. Don't donate to them, and don't vote for any of them.",
            "title_similarity": "0.67112434",
            "sentiment_compound": -0.1921
        },
        {
            "id": "hyn9n2d",
            "score": 2,
            "text": "MTG seems like the type to have a bbc fetish behind close doors.",
            "title_similarity": "0.37204793",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hyn9o6t",
            "score": 2,
            "text": "Fuentes is a bargain-bin Joker merely lacking a coat of clown paint, it's telling that baby Republicucks love him almost as much as they love blacked.com",
            "title_similarity": "0.2723412",
            "sentiment_compound": 0.872
        },
        {
            "id": "hyn9x1i",
            "score": 3,
            "text": "been overdue.",
            "title_similarity": "0.034394383",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyn9xni",
            "score": 5,
            "text": "If this clown is re-elected it will show the complete dumbing down of America.",
            "title_similarity": "0.65298843",
            "sentiment_compound": -0.128
        },
        {
            "id": "hyna3ds",
            "score": 4,
            "text": "I thought they were calling CPAC a white nationalist convention but no, she actually spoke at an even more white nationalisty convention lol. Imagine not feeling like CPAC is conservative and white nationalisty enough, that's the state of the Republican party.",
            "title_similarity": "0.7732173",
            "sentiment_compound": 0.6162
        },
        {
            "id": "hyna9r5",
            "score": 1,
            "text": "The alternate reality is now reality. And it’s a scary F—-ing thing.",
            "title_similarity": "0.3040055",
            "sentiment_compound": -0.4939
        },
        {
            "id": "hynacu5",
            "score": 2,
            "text": "It’s time her and her tiny troll hands and troll feet were shown the door.",
            "title_similarity": "0.23986821",
            "sentiment_compound": 0.0
        },
        {
            "id": "hynak9o",
            "score": 2,
            "text": "FFS Congress!! Get your shit together!",
            "title_similarity": "0.3747933",
            "sentiment_compound": -0.8753
        },
        {
            "id": "hynap4g",
            "score": 6,
            "text": "She could literally hang nooses from her stage and they'd defend her to the end.  Has this past year not shown that the racist do not care of you know they are racists?",
            "title_similarity": "0.6491104",
            "sentiment_compound": -0.8787
        },
        {
            "id": "hynb4zc",
            "score": 3,
            "text": "Her entire career and income is based on the support of the “telephone pole-as-a-family tree” type. How is anyone surprised?",
            "title_similarity": "0.37684742",
            "sentiment_compound": 0.5574
        },
        {
            "id": "hynbiwv",
            "score": 2,
            "text": "Looks like nazis want round 2.",
            "title_similarity": "0.47032115",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hynbjdd",
            "score": 2,
            "text": "The fact that it’s even a question that she would be removed shows how bad things really are.",
            "title_similarity": "0.51569605",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hynbjxu",
            "score": 2,
            "text": "Not going to happen. It should happen but it’s not going to",
            "title_similarity": "0.22669992",
            "sentiment_compound": 0.0
        },
        {
            "id": "hynbqc0",
            "score": 2,
            "text": "“gazpacho police” Ladies and gentlemen, she's so fundamentally broken she doesn't even know what Gestapo are",
            "title_similarity": "0.54313314",
            "sentiment_compound": -0.5233
        },
        {
            "id": "hync8ny",
            "score": 2,
            "text": "She should be expelled just for the Gazpacho comment.",
            "title_similarity": "0.6625516",
            "sentiment_compound": -0.25
        },
        {
            "id": "hyncak6",
            "score": 2,
            "text": "Throw the fascist out",
            "title_similarity": "0.6017498",
            "sentiment_compound": -0.5574
        },
        {
            "id": "hynce0c",
            "score": 3,
            "text": "yeah we dont need any more of this fascist bullshit. hopefully their russian money dried up",
            "title_similarity": "0.51393336",
            "sentiment_compound": -0.6683
        },
        {
            "id": "hyncpfh",
            "score": 1,
            "text": "Should be up to her constituents... Who, unfortunately probably eat this mouth-breathing shit up.",
            "title_similarity": "0.56237054",
            "sentiment_compound": -0.7184
        },
        {
            "id": "hyncxs5",
            "score": 1,
            "text": "Who’s her primary callenger",
            "title_similarity": "0.2625495",
            "sentiment_compound": 0.0
        },
        {
            "id": "hynd7gl",
            "score": 2,
            "text": "Send that lady straight to hell",
            "title_similarity": "0.4855966",
            "sentiment_compound": -0.5719
        },
        {
            "id": "hyneew0",
            "score": 1,
            "text": "Yo are we okay with openly bigoted people in the halls of Congress?! This is not the lowest bar, because it's currently being set",
            "title_similarity": "0.42959252",
            "sentiment_compound": 0.5229
        },
        {
            "id": "hynemwb",
            "score": 2,
            "text": "Why would you expel her?  She is talking to the base of the GOP?  This has been the way for the last 19 years at least.",
            "title_similarity": "0.62481415",
            "sentiment_compound": -0.504
        },
        {
            "id": "hynf61g",
            "score": 1,
            "text": "Why is she still there?",
            "title_similarity": "0.148995",
            "sentiment_compound": 0.0
        },
        {
            "id": "hynf720",
            "score": 2,
            "text": "“This has no place in the Republican Party…” ummm doesn’t seem so weird in that god damned circus…",
            "title_similarity": "0.51127887",
            "sentiment_compound": -0.6048
        },
        {
            "id": "hyng4re",
            "score": 1,
            "text": "Ignorance is bliss.",
            "title_similarity": "0.04051051",
            "sentiment_compound": 0.296
        },
        {
            "id": "hyng71e",
            "score": 1,
            "text": "One time she sneezed so hard, a demon got in",
            "title_similarity": "0.40223157",
            "sentiment_compound": -0.2183
        },
        {
            "id": "hyngc8u",
            "score": 3,
            "text": "Because she wasn’t openly white nationalist enough before then?\n\nWhat about expelling Rep. Gosar? I still don’t understand how it is possible he’s on any committees.",
            "title_similarity": "0.63206285",
            "sentiment_compound": -0.4515
        },
        {
            "id": "hyngdd7",
            "score": 3,
            "text": "Fuck this monster, she’s gotta go.",
            "title_similarity": "0.49654663",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hyngylm",
            "score": 1,
            "text": "And she did not “know” about event she was attending?\n\nYou are fired.\n\nLying incompetent asshole.",
            "title_similarity": "0.5519855",
            "sentiment_compound": -0.8779
        },
        {
            "id": "hynh1w4",
            "score": 3,
            "text": "Expel from where?  The RNC is the white nationalist committee.",
            "title_similarity": "0.7446737",
            "sentiment_compound": -0.4404
        },
        {
            "id": "hynh6ui",
            "score": 3,
            "text": "They can call all they want. These scumbags seem to be above the law and no one will touch them.",
            "title_similarity": "0.30335724",
            "sentiment_compound": -0.2263
        },
        {
            "id": "hynhiz3",
            "score": 2,
            "text": "Seriously, what will it take to remove a shit stain like this from office?",
            "title_similarity": "0.5997377",
            "sentiment_compound": -0.4215
        },
        {
            "id": "hynhr6v",
            "score": 1,
            "text": "When the Republican Jewish Committee made a statement that \"racism has no place in the Republican Party\":\n\nUm....soooo who wants to tell them",
            "title_similarity": "0.6306617",
            "sentiment_compound": -0.5574
        },
        {
            "id": "hynifn8",
            "score": 1,
            "text": "They want to kick miss piggy out?  Just for riling up some nazis?  I can’t believe the Republican Party would ever do something like that.",
            "title_similarity": "0.6958306",
            "sentiment_compound": 0.644
        },
        {
            "id": "hynipwv",
            "score": 2,
            "text": "I'm glad all this stuff is exposing the Republican party for what it is.",
            "title_similarity": "0.58524454",
            "sentiment_compound": 0.5574
        },
        {
            "id": "hyniwtl",
            "score": 1,
            "text": "Does anyone have a link to her speech?",
            "title_similarity": "0.34635162",
            "sentiment_compound": 0.0
        },
        {
            "id": "hynj2kz",
            "score": 4,
            "text": "She has pig feet and a horse face",
            "title_similarity": "0.16480128",
            "sentiment_compound": 0.0
        },
        {
            "id": "hynjotu",
            "score": 1,
            "text": "And then she went straight to CPAC.",
            "title_similarity": "0.3422046",
            "sentiment_compound": 0.2263
        },
        {
            "id": "hynjsas",
            "score": 3,
            "text": "I went into this article thinking this was a click bait headline and it couldn't be that bad. I'm thinking, the media and left need to stop calling those in the other political party \"white nationalists\" or nazis.   \n\nWell, fuck that.   \n\n>The Georgia congresswoman told the gathering they were “canceled Americans” who had a responsibility to **“stop the Democrats who are the communist party of the United States of America”**.    \n\nAmerican (probably the world) politics is absolute fucking bullshit. This is what happens when your political ideology is so weak that all you have to left to resort to is, 'the other guy is the bad guy'.   \n\nI remember in the 80s and early 90s when I first started to become aware of politics. We all hated the political attack campaigns on tv. We felt compelled to vote for the politician who *didn't* resort to attacking their opponent.  \n\nI do my best to put myself in other people's shoes. I can understand not voting for Hilary or being a one-issue voter. I don't agree with you but I understand - let's chat about it. But there has to be a better option that someone like MTG. Like, don't people give a shit about anything other than \"owning the libs\" any more? Don't you care about your community, your family, your local economies, or yourself? I know the answer to that is that not everyone does based on some disturbing stories I've seen about people dying of covid. Some people truly would prefer to loose their families and their lives than give in to \"the libs\".      \n \n  -  \n\nA totally unrelated side note regarding \"communism\". In the US, we have some people who believe in strict personal sovereignty and limited government oversight and some people who believe that through the power of community we can all benefit from one another.   \n\nOur early ancestors survived based on both of these concepts. Those who established villages need to band together to fight off intruders and help one another with their health and education. But before they established that village, they had to leave another village that was less hospitable, fertile, or unsafe. \n\nThe United States is unique in that it's still a young country. It was established by those who left other countries for the freedom to protect and practice their beliefs. Villages were founded which turned into cities. They found that through cooperation and shared resources they could build a stronger, more resilient, and profitable community. But it was only about a hundred years ago that Americans again moved west in search of more freedom and personal wealth with little government oversight. Our federal government is obligated to protect these freedoms and ensure that every *citizen* is provided with equal opportunity without oppression, discrimination, or interference by others. States provide their own obligations and our founders were wise to give the states their own powers.  \n\nAs I said, I try to put myself in others' shoes. There's two sides to this country which I believe we have to respect. Communism / Socialism doesn't work for some of us and Capitalism does not work for the others. That doesn't give anyone the right to attack people for their political party associations. We need our country to figure out a middle ground; or get back the more production middle ground we knew.",
            "title_similarity": "0.77823627",
            "sentiment_compound": 0.9957
        },
        {
            "id": "hynjvns",
            "score": 1,
            "text": "How many times is this now?? Clearly it doesn’t mean anything since she’s still able to have her position.\n\nI feel like they should’ve expelled her when Twitter banned her. Very confusing and illogical the country we live in now.",
            "title_similarity": "0.6492076",
            "sentiment_compound": -0.3298
        },
        {
            "id": "hynkaeg",
            "score": 1,
            "text": "She’s from rural Georgia, white supremacy is her constituency. This only solidifies her position as the are she represents continues to see increased poverty, decreased education, and irreparable damage to their communities. All to own the Libs.",
            "title_similarity": "0.5961036",
            "sentiment_compound": -0.6369
        },
        {
            "id": "hynke6h",
            "score": 1,
            "text": "The GOP is such a repulsive group of absolute scum. There just is no depth too low for them any more. And they no longer face any consequences for what is clearly a terror organization. This country disgusts me for letting them get their claws so firmly planted in society.",
            "title_similarity": "0.4862035",
            "sentiment_compound": -0.8612
        },
        {
            "id": "hynl5xz",
            "score": 1,
            "text": "Why should the RepubliKKKans want to cancel one of their own for attending one of their own events? She's exactly what they voted for. We just need to stop voting garbage in",
            "title_similarity": "0.73006713",
            "sentiment_compound": -0.4404
        },
        {
            "id": "hynlwgu",
            "score": 1,
            "text": "Oh OK they can't defend this shit I'm not into politics but they can't defend her on this right?",
            "title_similarity": "0.4946379",
            "sentiment_compound": -0.1676
        },
        {
            "id": "hynm17i",
            "score": 1,
            "text": "Listening to the speeches at this conference while knowing that members of Congress are in attendance and ALSO guest speakers is just chilling and surreal. It is out in the open in plain view now. They will lie and re-write the narrative and sweep it under the rug as if nothing happened. Meanwhile the party is unified in its condemnation of Cheney and Kinzinger because they are accused of being anti-Trump. Truly surreal times.",
            "title_similarity": "0.6580532",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hynm649",
            "score": 2,
            "text": "Can someone please clarify what group this is and proof of them being in favor of white supremacy?",
            "title_similarity": "0.532193",
            "sentiment_compound": 0.6369
        },
        {
            "id": "hynm68p",
            "score": 1,
            "text": "When will america learn they love racism and these kinds of ideologies.",
            "title_similarity": "0.4325229",
            "sentiment_compound": 0.0258
        },
        {
            "id": "hynmf49",
            "score": 1,
            "text": "we are not trying to cancel you, we are trying to EXPEL you",
            "title_similarity": "0.48363927",
            "sentiment_compound": -0.4391
        },
        {
            "id": "hynmgwb",
            "score": 1,
            "text": "“Is you is, or is you ain’t my constituents?”",
            "title_similarity": "0.35770077",
            "sentiment_compound": 0.0
        },
        {
            "id": "hynmiks",
            "score": 1,
            "text": "Her ignorance is dangerous, she should have been removed from her position in government. Instead we have this headline as a current reality.",
            "title_similarity": "0.69088227",
            "sentiment_compound": -0.6808
        },
        {
            "id": "hynn0bu",
            "score": 2,
            "text": "Can we just call it what it is? White supremacy?\n\nCalling it white nationalism sounds like such a cop out",
            "title_similarity": "0.62964505",
            "sentiment_compound": 0.4696
        },
        {
            "id": "hynnfcq",
            "score": 1,
            "text": "With every ‘call to expel’ there will be a recommendation for a Congressional Medal of Honor, or some such.  She’s everything some people want and runs interference and deflection by doing and saying more and more batshit crazy stuff. Sadly she serves a purpose.",
            "title_similarity": "0.57544243",
            "sentiment_compound": 0.2782
        },
        {
            "id": "hynnqzp",
            "score": 1,
            "text": "There’s always a call for her to be expelled. It’s not going to happen.",
            "title_similarity": "0.51375145",
            "sentiment_compound": -0.25
        },
        {
            "id": "hyno20m",
            "score": 1,
            "text": "Yes it’s time.",
            "title_similarity": "0.01515843",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hynpf6t",
            "score": 1,
            "text": "I hope she gets voted out. I’m embarrassed she’s from my state.",
            "title_similarity": "0.62704164",
            "sentiment_compound": 0.1027
        },
        {
            "id": "hynporo",
            "score": 1,
            "text": "She’s a fucking clown",
            "title_similarity": "0.19275172",
            "sentiment_compound": 0.0
        },
        {
            "id": "hynqfqu",
            "score": 1,
            "text": "Jesus fucking Christ. This has got to end man.",
            "title_similarity": "0.41132724",
            "sentiment_compound": 0.0
        },
        {
            "id": "hynr5zc",
            "score": 1,
            "text": "She is a chameleon for a paycheck. One night she's speaking at a pro-Putin conference, the next night, she condemns Putin. One minute she argues democrats want too much government, while speaking at an event that supports a dictator who uses the government to control everything from media to gas/oil reserves. One night she's speaking at an event organized by Fuentes, the next night, she's never heard of the guy.",
            "title_similarity": "0.66588545",
            "sentiment_compound": -0.4767
        },
        {
            "id": "hynrbps",
            "score": 1,
            "text": "And yet nothing will happen. The fact that she's still there is enough to prove that.",
            "title_similarity": "0.22676167",
            "sentiment_compound": 0.0
        },
        {
            "id": "hynrn2l",
            "score": 1,
            "text": "Just the gobshite GOP trying to make their tent bigger any way they can. Never forget the asshat goons in Charlottesville chanting \"You (jews) will not replace replace us, Russia is our friend\". This isn't new. It's so wrong and so stupid and Trump gave them so much oxygen.",
            "title_similarity": "0.5269497",
            "sentiment_compound": -0.5884
        },
        {
            "id": "hynrpxd",
            "score": 1,
            "text": "I mean what has she actually done for the people of Georgia? Can someone please gimme something positive. At least dems actually have an agenda and are actually doing things. Listening to rubbish from\nthis one really makes my blood boil. How dare she.",
            "title_similarity": "0.5613835",
            "sentiment_compound": 0.7096
        },
        {
            "id": "hynsvab",
            "score": 1,
            "text": "“… will be ignored by GOP.” There finished the headline.",
            "title_similarity": "0.58952665",
            "sentiment_compound": -0.3182
        },
        {
            "id": "hynt2hl",
            "score": 1,
            "text": "The Republican Party has lost it balls And now has these looney tunes representing us.",
            "title_similarity": "0.58256054",
            "sentiment_compound": 0.1027
        },
        {
            "id": "hyntv8u",
            "score": 1,
            "text": "that woman seems like she would vote to bring back slavery",
            "title_similarity": "0.5805302",
            "sentiment_compound": -0.5106
        },
        {
            "id": "hynw6og",
            "score": 1,
            "text": "If you all start expelling racist Republicans the GOP is going to be empty",
            "title_similarity": "0.74631226",
            "sentiment_compound": -0.8126
        },
        {
            "id": "hynwh4s",
            "score": 2,
            "text": "What an ugly human being",
            "title_similarity": "0.24074146",
            "sentiment_compound": -0.5106
        },
        {
            "id": "hynwoub",
            "score": 1,
            "text": "Do you think she will win another term?",
            "title_similarity": "0.37988982",
            "sentiment_compound": 0.5859
        },
        {
            "id": "hynxu9b",
            "score": 1,
            "text": "I don't know how this idiot is even still in office at this point as it is. What a world we live in today.\n\nMy late grandfather was a big GOP person but he'd cry at this shit today, I swear.",
            "title_similarity": "0.4528653",
            "sentiment_compound": -0.9151
        },
        {
            "id": "hynxwjm",
            "score": 1,
            "text": "Why not just ignore her?",
            "title_similarity": "0.46123815",
            "sentiment_compound": 0.2755
        },
        {
            "id": "hynyqm8",
            "score": 1,
            "text": "Seize this moment and momentum — expel her regardless of her new false claim.",
            "title_similarity": "0.531774",
            "sentiment_compound": -0.4404
        },
        {
            "id": "hynzjog",
            "score": 1,
            "text": "White nationalist event???",
            "title_similarity": "0.4679964",
            "sentiment_compound": 0.0
        },
        {
            "id": "hynznjb",
            "score": 1,
            "text": "Ship her off to Russia",
            "title_similarity": "0.3927011",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyo0jqp",
            "score": 1,
            "text": "Less talking, more doing. These fuckers should have been out already.",
            "title_similarity": "0.45724717",
            "sentiment_compound": -0.6326
        },
        {
            "id": "hyo17s8",
            "score": 1,
            "text": "Do they except her not to pander to her base.",
            "title_similarity": "0.49438155",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyo3azi",
            "score": 1,
            "text": "No one is going to expel her. The entire GOP is starting to become the party of Nazis and white nationalists.",
            "title_similarity": "0.6071485",
            "sentiment_compound": -0.34
        },
        {
            "id": "hyo3czc",
            "score": 1,
            "text": "DonnyT has Russian wives, Russian kids, Owns Little Miami, why don’t we consider him a Russian Oligarch?  He berates America and Americans, NFL, anyone who is not white, our FBI, our military, CALIFORNIA, Georgia, even our constitution.  Russian oligarchs are enemies of state.",
            "title_similarity": "0.61249036",
            "sentiment_compound": -0.4939
        },
        {
            "id": "hyo3xti",
            "score": 1,
            "text": "She gives a white nationalist speech all day long to anyone who will listen.",
            "title_similarity": "0.4672982",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyo51yn",
            "score": 1,
            "text": "I didn't know she spoke at CPAC.",
            "title_similarity": "0.26913047",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyo5mn2",
            "score": 3,
            "text": "“White Nationalist Does White Nationalist Thing and White Nationalist Party Remains Largely Silent”",
            "title_similarity": "0.4941215",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hyo736m",
            "score": 4,
            "text": "The GOP White Supremacists must be opposed at every turn.",
            "title_similarity": "0.6855149",
            "sentiment_compound": -0.25
        },
        {
            "id": "hyo7nh0",
            "score": 3,
            "text": "How come the leaders of these organizations have Spanish names? Fuentes?? Lol leader of the proud boys Enrique Tarrio?? Lol I don’t understand",
            "title_similarity": "0.3965742",
            "sentiment_compound": 0.8645
        },
        {
            "id": "hyobkr0",
            "score": 3,
            "text": "I’ll be campaigning in her district for whoever becomes her opponent. Fuck you Marge.",
            "title_similarity": "0.673925",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hyok4hb",
            "score": 4,
            "text": "“stop the Democrats who are the communist party of the United States of America”\n\nLol I wish. Please commie Biden give me free healthcare and a free education, spend less on war and more on infrastructure. \n\nThat will never happen calling Biden a commie is so wrong it causes me to be stunned with how stupid it is",
            "title_similarity": "0.6401796",
            "sentiment_compound": 0.757
        },
        {
            "id": "hyonsjy",
            "score": 1,
            "text": "Oh c’mon, we all know she isn’t going anywhere.\n\nTrump was president, the GOP isn’t suddenly going to draw the line with this nutjob.",
            "title_similarity": "0.55020344",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyoow0c",
            "score": 2,
            "text": "Remove them both. Actually, just remove all of the current Republicans. They aren't helping.",
            "title_similarity": "0.6743971",
            "sentiment_compound": -0.2235
        },
        {
            "id": "hyorhvd",
            "score": 2,
            "text": "Everyone who spoke at CPAC spoke at a white nationalist event.",
            "title_similarity": "0.49460492",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyos8tx",
            "score": 2,
            "text": "Maybe just expel her for being fucking stupid and not understanding any aspect of her job?",
            "title_similarity": "0.5910914",
            "sentiment_compound": -0.7645
        },
        {
            "id": "hyosh1w",
            "score": 3,
            "text": "Again - I can't say this enough. If we had a 2-yr 2 term max for the Legislative Branch of the U.S. Government:\n\n* U.S. House of Representatives\n* U.S. Senate\n\nand keep the 4-yr 2 term max for the Executive Branch of the U.S. Government, I promise you Sen Marjorie Taylor Green and the likes of her would be a different people if one could not make a career being a politician.\n\nShe is willing to say and do anything just to get reelected.\n\nIt would be like the choice to be a social worker, firefighter, solider, EMT, policer officer (some anyway) you take the job because you want to do good.",
            "title_similarity": "0.5831377",
            "sentiment_compound": 0.8689
        },
        {
            "id": "hyov0vv",
            "score": 1,
            "text": "Regardless, she should be toast for this. Could you imagine if Obama had “accidentally” spoken at a Black Panther event? The conservatives would never have let that go and wouldn’t have believed any excuse. We shouldn’t either. Anyone who likes this woman is an idiot.",
            "title_similarity": "0.6510601",
            "sentiment_compound": -0.0516
        },
        {
            "id": "hyp226q",
            "score": 1,
            "text": "Those calls only matter if they’re coming from\ninside the house, which they are not",
            "title_similarity": "0.2538483",
            "sentiment_compound": 0.0258
        },
        {
            "id": "hyp8cpi",
            "score": 1,
            "text": "These people are idiots and have the collective IQ of a steaming cow pie. Uneducated buffoons.",
            "title_similarity": "0.4041059",
            "sentiment_compound": 0.0
        },
        {
            "id": "hypauhb",
            "score": 1,
            "text": "Where do I sign up?",
            "title_similarity": "0.16903389",
            "sentiment_compound": 0.0
        },
        {
            "id": "hypjfo0",
            "score": 1,
            "text": "\"*“Quite simply, the longer Kevin McCarthy gives Marjorie Taylor Greene an unfettered platform and promises to elevate her, the more complicit he is.”*\"\n\nThis sums up the extent of her accountability in the GQP. Racist traitors supported by a base of racist traitors.",
            "title_similarity": "0.60021025",
            "sentiment_compound": -0.6249
        },
        {
            "id": "hypnss4",
            "score": 1,
            "text": "Well, the Republicans are the white nationalist party, so they would never vote to expel her. The Dems certainly don't have the votes to do it without the Republicans.",
            "title_similarity": "0.5802146",
            "sentiment_compound": 0.8227
        },
        {
            "id": "hypt4pb",
            "score": 1,
            "text": "Get her out of congress asap. She is a big part in helping America lose iq points.",
            "title_similarity": "0.7247832",
            "sentiment_compound": -0.128
        },
        {
            "id": "hypva31",
            "score": 1,
            "text": "It used to be speaking in favor of another country and against the united states' during a conflict got you a charge of treason- see Tokio Rose. Now an x secretary of state an X secretary of state!!! Goes on a news channel along with an X president and procede to like Putin's boots.",
            "title_similarity": "0.6380919",
            "sentiment_compound": 0.5684
        },
        {
            "id": "hypveid",
            "score": 1,
            "text": "Nothing will happen to her, she is  one of the faces Republican Party. She represents the current republicans party.",
            "title_similarity": "0.5392945",
            "sentiment_compound": 0.6597
        },
        {
            "id": "hyq2ags",
            "score": 1,
            "text": "We’re on the brink of WW3 and these motherfuckers are having what is essentially a KKK rally. Unbelievable…",
            "title_similarity": "0.5835837",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyq58yn",
            "score": 1,
            "text": "She’s toxic",
            "title_similarity": "0.33534557",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyqqe58",
            "score": 1,
            "text": "Can we expel her into orbit?",
            "title_similarity": "0.44904852",
            "sentiment_compound": -0.4404
        },
        {
            "id": "hysk3wt",
            "score": 1,
            "text": "I fear that no matter how obviously corrupt or incompetent these politicians are that there will never actually be any consequences if they have the right support.",
            "title_similarity": "0.41893196",
            "sentiment_compound": -0.5682
        },
        {
            "id": "hywqk0r",
            "score": 1,
            "text": "The face of the party: uneducated, ugly, stupid, racist",
            "title_similarity": "0.49415994",
            "sentiment_compound": -0.8402
        },
        {
            "id": "hyy95ou",
            "score": 1,
            "text": "What do you say? You just can't wipe the skank away.",
            "title_similarity": "0.37712607",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz3bj8y",
            "score": 1,
            "text": "That’s not a white nationalist event why are they saying it’s for whites....  there are literally black people running for political positions who are republicans..... wonder how they feel when they see an America First rally being called a “white” event. People who aren’t white can still think for theirselves. Liberals seem to forget that......",
            "title_similarity": "0.63099897",
            "sentiment_compound": -0.2263
        },
        {
            "id": "hzf0s5o",
            "score": 1,
            "text": "This is the biggest farce of a headline",
            "title_similarity": "0.2657119",
            "sentiment_compound": -0.4019
        },
        {
            "id": "hzh1jdt",
            "score": 1,
            "text": "Americans, just say NO to Putin’s little Greene woman.",
            "title_similarity": "0.65167",
            "sentiment_compound": -0.4466
        },
        {
            "id": "hzss8zi",
            "score": 1,
            "text": "Calls to expel go straight to voicemail and poorly transcribed by Apple voicemail.",
            "title_similarity": "0.5295416",
            "sentiment_compound": -0.25
        },
        {
            "id": "hzwh2l7",
            "score": 1,
            "text": "Fucking republicans will not do a thing so Fuck in sad",
            "title_similarity": "0.47834387",
            "sentiment_compound": -0.834
        },
        {
            "id": "i076kt4",
            "score": 1,
            "text": "Know your history Trump brought Mar-A-Lago into the 21st century when he allowed blacks and Jews to join his club after fighting with the town fathers who wanted no Jews or blacks at Mar-A-Lago he fought them in one now they are allowed there as long as they have the money for membership and dues Trump said if you've got the money you can join here if not you don't get in I guess he's being a racist when he only allows green to get what he wants lol most of your races would never do that and the fact that he dated a black woman for about 4 years before he got into politics most racist won't do that either but believe what you want it's all out there all you got to do is do some research and you'll find that I was right all along",
            "title_similarity": "0.562236",
            "sentiment_compound": -0.5569
        },
        {
            "id": "i077gxq",
            "score": 1,
            "text": "Hillary is not out of the woods yet attorney Durham is breathing down her neck as we speak for colluding with the Russians to spy on the Trump campaign and then to spy on his offices in the White House. These these actions were taken from the day he announced for president Watergate looks like a walk in the park compared to this Justice will be found it's just that the wheels of Justice grind slow especially for republicans or January 6th arrestees",
            "title_similarity": "0.65136504",
            "sentiment_compound": 0.8271
        },
        {
            "id": "i0wqn6m",
            "score": 1,
            "text": "What happened to free speech in this country?!",
            "title_similarity": "0.43546265",
            "sentiment_compound": 0.5562
        },
        {
            "id": "i13qchg",
            "score": 2,
            "text": "Disgusting human.",
            "title_similarity": "0.22531852",
            "sentiment_compound": -0.5267
        },
        {
            "id": "i1ghefq",
            "score": 1,
            "text": "Republicans will be the death of America",
            "title_similarity": "0.66399837",
            "sentiment_compound": -0.5994
        },
        {
            "id": "i2524je",
            "score": 1,
            "text": "Get that disgusting ,RED NECK ,dirt ignorant,burned out \ngym rat ass hole out of congress.FUCKING NOW! Send \nit back.All the way back,to where it came from.",
            "title_similarity": "0.61737484",
            "sentiment_compound": -0.8622
        },
        {
            "id": "i25amio",
            "score": 1,
            "text": "What Cheney doesn't realize is the majority of her Party supports Greene.",
            "title_similarity": "0.44174004",
            "sentiment_compound": 0.6369
        }
    ]
}