{
    "Poll Shows Majority of US Voters Blame Corporate Profiteering for Inflation\n": [
        {
            "id": "hyujpw5",
            "score": 1,
            "text": "\nAs a reminder, this subreddit [is for civil discussion.](/r/politics/wiki/index#wiki_be_civil)\n\nIn general, be courteous to others. Debate/discuss/argue the merits of ideas, don't attack people. Personal insults, shill or troll accusations, hate speech, any suggestion or support of harm, violence, or death, and other rule violations can result in a permanent ban. \n\nIf you see comments in violation of our rules, please report them.\n\n For those who have questions regarding any media outlets being posted on this subreddit, please click [here](https://www.reddit.com/r/politics/wiki/approveddomainslist) to review our details as to our approved domains list and outlet criteria.\n \n **Special announcement:**\n \n r/politics is currently accepting new moderator applications.  If you want to help make this community a better place, consider [applying here today](https://www.reddit.com/r/politics/comments/sskg6a/rpolitics_is_looking_for_more_moderators/)!\n\n***\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/politics) if you have any questions or concerns.*",
            "title_similarity": "0.40247384",
            "sentiment_compound": -0.3895
        },
        {
            "id": "hyuyoqh",
            "score": 7,
            "text": "Trying to blame anything except for the man in charge",
            "title_similarity": "0.40465307",
            "sentiment_compound": -0.34
        },
        {
            "id": "hyuob5u",
            "score": -5,
            "text": "Majority of US voters are correct",
            "title_similarity": "0.3768569",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyun4au",
            "score": 1,
            "text": "[deleted]",
            "title_similarity": "0.14869753"
        },
        {
            "id": "hyuohtl",
            "score": -2,
            "text": "Still I worry many will vote for republicans anyway.",
            "title_similarity": "0.6142261",
            "sentiment_compound": -0.4404
        },
        {
            "id": "hyv4y5t",
            "score": 4,
            "text": "Poll brought to you by Liberals of America.",
            "title_similarity": "0.55553246",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyum4wq",
            "score": 3,
            "text": "I agree. But how do we combat it? Americans aren’t going to stop buying things and wanting things..",
            "title_similarity": "0.50641733",
            "sentiment_compound": -0.631
        },
        {
            "id": "hyusmgj",
            "score": -5,
            "text": "work for a corporation. can confirm. costs go up, but prices go up more. inflation is a good excuse and customers continue to pay. everyone is doing it, workers willing to accept a low wage is low and those are the only people getting hired (so there is an effective labor shortage), people are planning/committing to their needs  late so they're under a time crunch and more likely to pay top dollar. Any excuse to improve profit margins is a good one, so if costs go up 10% then prices go up 20% and not only is the deficit made up for but more profit is gained.",
            "title_similarity": "0.664228",
            "sentiment_compound": 0.9726
        },
        {
            "id": "hyv2lqo",
            "score": -2,
            "text": "Profits grew exponentially, wages stagnated, this was profiteering",
            "title_similarity": "0.63577485",
            "sentiment_compound": 0.3182
        },
        {
            "id": "hyv4waj",
            "score": -2,
            "text": "Poll shows majority of Americans are correct.",
            "title_similarity": "0.48490793",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyupy5u",
            "score": 73,
            "text": "This is fucking insane. We just gave out $4.5 trillion COVID relief. We all learned in school what causes inflation.",
            "title_similarity": "0.6097995",
            "sentiment_compound": 0.0276
        },
        {
            "id": "hyv6ij1",
            "score": 24,
            "text": "Most people know nothing about economics. This bout of inflation was TOTALLY avoidable. Blame the dems policies infusing way too much money into the economy chasing product and services. \n\nInflation hurts the poor the most. Quit making excuses for the current administration screwing the economy up.",
            "title_similarity": "0.72674537",
            "sentiment_compound": -0.8879
        },
        {
            "id": "hyuo7v7",
            "score": -1,
            "text": "Are Dems smart enough to take advantage of the twin enemies of corporations and foreign dictators? Honest to God the midterms are gonna be easy if you can just pull your messaging together.",
            "title_similarity": "0.5713676",
            "sentiment_compound": 0.8316
        },
        {
            "id": "hyuphkf",
            "score": 61,
            "text": "nobody blames $1 trillion being injected in the economy to fight COVID?   I'm shocked.",
            "title_similarity": "0.64986116",
            "sentiment_compound": -0.765
        },
        {
            "id": "hyuusnf",
            "score": -5,
            "text": "Because corporate profiteering is the main driver of inflation this time? Duh.",
            "title_similarity": "0.8144808",
            "sentiment_compound": -0.1531
        },
        {
            "id": "hyus5j2",
            "score": -15,
            "text": "ItS ThE DEmOcRAts",
            "title_similarity": "0.24656244",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyuu8tm",
            "score": -9,
            "text": "Majority of US voters recognize facts!* fixed the headline",
            "title_similarity": "0.49213773",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyv6ynk",
            "score": -1,
            "text": "Idiots absolute idiots - I thought the evil Trump was all in bed with corporations and greed?  Why wasn’t inflation Huuuge under him?  Biden and Dems have gone on an unprecedented spending binge - kept the country locked down - mismanaged every aspect of the economy……the inflation is a result of Dem policies and spending.",
            "title_similarity": "0.7589969",
            "sentiment_compound": -0.8156
        },
        {
            "id": "hyv8d5a",
            "score": -1,
            "text": "Been a life long Democrat and held fundraising events to help politicians. I’ll say this as honest as possible… The economy was a lot more stable and stronger under Trump flat out. Just because I align with a party doesn’t mean I can’t take a unbiased look at everything going on.",
            "title_similarity": "0.55523723",
            "sentiment_compound": 0.9179
        },
        {
            "id": "hyuswm6",
            "score": 3,
            "text": "Ask yourself: Would business owners with Republican sympathies resort to a dirty trick like that, during an election year?",
            "title_similarity": "0.63021946",
            "sentiment_compound": -0.1531
        },
        {
            "id": "hyutzkp",
            "score": -6,
            "text": "Exactly.",
            "title_similarity": "-0.0764841",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyvrljz",
            "score": 0,
            "text": "Majority of us voters are idiots.  Giving people free money, the great resignation, lowering interest rates when everyone was generally in better financial shape than anticipated in 2020: these are the causes of inflation. Oh, and ambivalently overseen by the Biden administration.",
            "title_similarity": "0.8138852",
            "sentiment_compound": 0.91
        },
        {
            "id": "hyute0a",
            "score": 7,
            "text": "No shit. When corporations refuse to raise wages or benefits, or ever absorb losses, while milking us dry from all sides, it becomes a more clear. They have spent billions lining the pockets of our politicians, in order to peddle the “trickle down economics” message to us. We’ve all seen prices rising more and more, yet when the influences they tell us are to blame, evaporate, the prices never seem to go down… 🤔… me thinks we are being lied to.. doesn’t take a genius to know that $$$ equals power, and power corrupts.",
            "title_similarity": "0.76929253",
            "sentiment_compound": -0.1238
        },
        {
            "id": "hyunilj",
            "score": -4,
            "text": "Is that a beam of light I see breaking through the clouds??",
            "title_similarity": "0.21025905",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyul61g",
            "score": 8,
            "text": "Holy shit they better get a spin on this quick!",
            "title_similarity": "0.17345583",
            "sentiment_compound": -0.2481
        },
        {
            "id": "hyv4vm2",
            "score": 14,
            "text": "Poll shows most Americans don’t know about inflation. And neither do redditors.",
            "title_similarity": "0.6347413",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyv63go",
            "score": 5,
            "text": "Whatever makes you feel better at night to sleep. You are not serious individuals.",
            "title_similarity": "0.16792402",
            "sentiment_compound": 0.4805
        },
        {
            "id": "hyv5t1m",
            "score": 6,
            "text": "That's because the majority of US voters don't understand that indiscriminately \"printing money\" and flooding the economy is a direct and very efficient way to cause inflation.",
            "title_similarity": "0.7436949",
            "sentiment_compound": 0.4754
        },
        {
            "id": "hyvd0l7",
            "score": 4,
            "text": "This is a red herring.   Inflation is caused by monetary policy set by the FED.  Companies raise prices for their products as a response to inflation, not as the cause of inflation.  Do due diligence.  The current round of steep inflation is from the FED pumping money into the economy in myriads of trillions of dollars over the last 10 or so years.",
            "title_similarity": "0.7460021",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyv1d5s",
            "score": -11,
            "text": "No we Blame Biden!!! Fuck this post !!!",
            "title_similarity": "0.3892424",
            "sentiment_compound": -0.7033
        },
        {
            "id": "hyv5q2u",
            "score": 9,
            "text": "If anyone believes something as blatantly and verifiably false as that it’s because of propaganda like this article. Not that I actually believe this “poll” was anything close to a legitimate, nonpartisan survey. Probably asked 100 people in downtown Portland.",
            "title_similarity": "0.559384",
            "sentiment_compound": 0.128
        },
        {
            "id": "hyuky6i",
            "score": 52,
            "text": "Jees, I guess the majority of US voters pay some attention.",
            "title_similarity": "0.57263273",
            "sentiment_compound": -0.1027
        },
        {
            "id": "hyv7pyn",
            "score": 7,
            "text": "Poll shows majority of US voters have no idea what cause inflation.",
            "title_similarity": "0.7730414",
            "sentiment_compound": -0.296
        },
        {
            "id": "hyv41tx",
            "score": 9,
            "text": "Not the massive amount of dollars created by the fed?",
            "title_similarity": "0.6795616",
            "sentiment_compound": 0.25
        },
        {
            "id": "hyv77cd",
            "score": 5,
            "text": "Try this headline instead … Poll demonstrates most US voters are under educated in financial literacy…",
            "title_similarity": "0.7919196",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyv8l33",
            "score": 5,
            "text": "The majority of Americans don’t understand basic economics. I’m sure printing 1/3 of all the dollars to ever exist in a year had anything to do with it",
            "title_similarity": "0.6691242",
            "sentiment_compound": 0.3182
        },
        {
            "id": "hyv9phv",
            "score": 55,
            "text": "Inflation is caused by the federal reserve.  That’s where the money supply comes from.  Excess money supply causes inflation. Some corporations are using inflation as an excuse to price gauge. But  inflation is caused by the FED.",
            "title_similarity": "0.76489997",
            "sentiment_compound": 0.0387
        },
        {
            "id": "hyv3rfu",
            "score": -4,
            "text": ".... because that's the reason.",
            "title_similarity": "0.042815555",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyuzju8",
            "score": 76,
            "text": "Lol I guess economics isn’t taught too much at colleges.",
            "title_similarity": "0.4148156",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hyumgg6",
            "score": -1,
            "text": "Yes",
            "title_similarity": "-0.07160499",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hyusyvq",
            "score": 1,
            "text": "Biden seems to be getting the blame though.",
            "title_similarity": "0.36225313",
            "sentiment_compound": -0.34
        },
        {
            "id": "hyuxqhq",
            "score": -1,
            "text": "Bc the majority is awake and paying attention. We are watching actions not listening to cheap words or distractions.",
            "title_similarity": "0.24669035",
            "sentiment_compound": -0.25
        },
        {
            "id": "hyuyznt",
            "score": 1,
            "text": "But will their votes reflect this sentiment…💁🏻‍♂️💁🏻‍♂️",
            "title_similarity": "0.25642285",
            "sentiment_compound": 0.8625
        },
        {
            "id": "hyuzh2j",
            "score": 1,
            "text": "Need to start rounding up the greedy feckers that profit off the suffering of people and start using them as firewood, in Minecraft of course",
            "title_similarity": "0.54804695",
            "sentiment_compound": -0.3612
        },
        {
            "id": "hyvs0w3",
            "score": 1,
            "text": "The majority are not acquainted with basic economics that says the US prints more money and inflation always follows.",
            "title_similarity": "0.75252426",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyvu0st",
            "score": 1,
            "text": "Of course they do, it’s so much easier to blame those nameless and faceless corporations than accept the fact that it’s our government’s policies. This site is full of ignorant and young Americans who think they know all the answers and where all the blame lies. They blame Republicans, corporations, banks, big Pharma and anyone else that suits them. These threads are full of sheep repeating the same nonsense every day instead of seeking the truth themselves. So many stupid people all jerking each other off, it’s pathetic. Almost as pathetic as this site’s baiting posts.",
            "title_similarity": "0.71519655",
            "sentiment_compound": -0.9487
        },
        {
            "id": "hyw58eh",
            "score": 1,
            "text": "The science has been settled. The people have voted. Lmao this sub is a joke",
            "title_similarity": "0.5035124",
            "sentiment_compound": 0.7269
        },
        {
            "id": "hywejid",
            "score": 1,
            "text": "Nope, we blame Biden",
            "title_similarity": "0.36033553",
            "sentiment_compound": 0.2584
        },
        {
            "id": "hywez0y",
            "score": 1,
            "text": "Sure, it's not the federal reserve nigh endless printing of money and injecting it into the economy. It's not their confined record low interest rates.\n\nIt's not like there isn't historical examples of what happens to counties that try to print money on large enough quantities to get out of a bad situation.\n\nNo let's blame it on the corporations and not the government who is actually at fault.",
            "title_similarity": "0.63085234",
            "sentiment_compound": -0.6456
        },
        {
            "id": "hywk3f0",
            "score": 1,
            "text": "Majority of US voters don't understand economics in that case.",
            "title_similarity": "0.5729073",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyx3gp9",
            "score": 1,
            "text": "The majority of US voters don’t understand simple Econ 101",
            "title_similarity": "0.5586134",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyvfx2v",
            "score": 5,
            "text": "Poll shows majority of US voters dont understand economics, shocking. Might want to look at the money supply and blame the FED.",
            "title_similarity": "0.85683715",
            "sentiment_compound": 0.0408
        },
        {
            "id": "hyvkc5v",
            "score": 7,
            "text": "Everyone here is blaming companies for inflation when the government basically ran the money printers full speed ahead and pumped roughly 6 Trillion dollars into the economy since Covid started.\n\n[You can look for yourself.](https://fred.stlouisfed.org/series/M2SL)\n\nIn Jan 2020 there was $15.4 Trillion in the economy.\n\nToday there is $21.8 Trillion\n\nOf course printing a fuck ton of money is going to raise inflation.\n\nThe 7% number they're telling is is massively underselling the truth.\n\nThey added 40% more money into the economy.  It's pretty simple math to figure out what the actual inflation rate is...",
            "title_similarity": "0.765015",
            "sentiment_compound": -0.2263
        },
        {
            "id": "hyv5vfe",
            "score": 10,
            "text": "Majority of the population isn't too bright either, it's simple, if you double the money supply in a year or two, you are going to get a fuckton if inflation, it's really that simple",
            "title_similarity": "0.6765945",
            "sentiment_compound": -0.3412
        },
        {
            "id": "hyuvtqo",
            "score": 199,
            "text": "Yes. Inflation doesn’t cause regular grocery items to increase by 20-30%, that’s pure robber baron greed shit. This is what I’m seeing on the price tags. For example, a product I buy almost each time I’m at the store jumped from $5.99 to $7.49 overnight. That’s not inflation.",
            "title_similarity": "0.68110096",
            "sentiment_compound": -0.7096
        },
        {
            "id": "hyuzkc6",
            "score": -3,
            "text": "That’s because it’s true",
            "title_similarity": "-0.017106198",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hyuzzfl",
            "score": -3,
            "text": "Truth.",
            "title_similarity": "-0.056711692",
            "sentiment_compound": 0.3182
        },
        {
            "id": "hyv3jst",
            "score": -3,
            "text": "The majority aren't wrong, either.",
            "title_similarity": "0.07001886",
            "sentiment_compound": 0.3724
        },
        {
            "id": "hyv5vhm",
            "score": 5,
            "text": "Are we sure it wasn't the absolutely unholy amount of money that was given away, to people and businesses, created in response to the pandemic?",
            "title_similarity": "0.69523394",
            "sentiment_compound": 0.5106
        },
        {
            "id": "hywezcp",
            "score": 5,
            "text": "Lol there’s no way people are that blind. It’s really simple the government wildly increased the amount of dollars while the number of things to buy with them was cut short by Covid restrictions. Thus more dollars chasing fewer goods leads to inflation. Idk how much more text book economics this situation could be.",
            "title_similarity": "0.6941149",
            "sentiment_compound": -0.296
        },
        {
            "id": "hyv88we",
            "score": 6,
            "text": "It’s because we shut down for two years and printed money to pay people to stay home.",
            "title_similarity": "0.5273094",
            "sentiment_compound": -0.1027
        },
        {
            "id": "hyvefc8",
            "score": 8,
            "text": "So basically this poll says that the majority of voters have no idea what the cause of their woes is...\n\nI mean seriously how can people be so blind to blame corporations and not the Federal Reserve for printing trillions of dollars? I refuse to believe people are this dumb.",
            "title_similarity": "0.77201974",
            "sentiment_compound": -0.9519
        },
        {
            "id": "hyuk57s",
            "score": 74,
            "text": "Possibly. But polls do not determine the cause of inflation. This isn’t some kind of subjective topic.",
            "title_similarity": "0.3082429",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyuljg4",
            "score": 29,
            "text": "Certainly greed accounts for some of it, but the problem is what do you do about it? Big businesses will always be greedy and will charge what people are willing to pay.",
            "title_similarity": "0.6909531",
            "sentiment_compound": -0.8047
        },
        {
            "id": "hyuxg9k",
            "score": 3,
            "text": "When we hear corporations on their quarterly stock calls talk about “not leaving pricing on the table”, they are talking about gouging customers to make obscene profit.  (See: ExxonMobil)",
            "title_similarity": "0.72854495",
            "sentiment_compound": -0.2263
        },
        {
            "id": "hyv2oae",
            "score": 7,
            "text": "Now if only Democrats would *do* something about it, they'd have a reason for people to vote for them in November.",
            "title_similarity": "0.48585343",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyvikmr",
            "score": 5,
            "text": "I mean isn’t corporate profiteering a major aspect that drives inflation in the first place ?",
            "title_similarity": "0.7731356",
            "sentiment_compound": -0.1531
        },
        {
            "id": "hyvjs0d",
            "score": -1,
            "text": "Biden caused record inflation.",
            "title_similarity": "0.6198268",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyw02sl",
            "score": 2,
            "text": "So it’s not due to all the stimulus from the Federal Reserve?",
            "title_similarity": "0.5334412",
            "sentiment_compound": 0.0
        },
        {
            "id": "hywfmiz",
            "score": 4,
            "text": "100% corporate greed. The company I work for has been raising prices even though the earnings report for the last quarter came in $ 1.3 billion over plan…..",
            "title_similarity": "0.7551558",
            "sentiment_compound": -0.4019
        },
        {
            "id": "hyv3y2f",
            "score": -9,
            "text": "Punishment for electing a democrat.",
            "title_similarity": "0.48214847",
            "sentiment_compound": -0.4939
        },
        {
            "id": "hyv7ae3",
            "score": 9,
            "text": "GM and Ford even after supply chain stabilizing deliberately under producing vehicles. Dealers are happy with it too. All in on scam.",
            "title_similarity": "0.511595",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyuz322",
            "score": 17,
            "text": "Most “US voters” don’t know how to spell Wensday.",
            "title_similarity": "0.45107213",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyuv8yj",
            "score": -1,
            "text": "They are not wrong",
            "title_similarity": "-0.086864494",
            "sentiment_compound": 0.3724
        },
        {
            "id": "hyuxab2",
            "score": 2,
            "text": "I mean, that’s because that what it is. Jack up prices and give the ceo 30mil dollar bonuses",
            "title_similarity": "0.6477555",
            "sentiment_compound": 0.5574
        },
        {
            "id": "hyv3lh8",
            "score": 4,
            "text": "Was there any doubt about that in the first place?",
            "title_similarity": "0.15454239",
            "sentiment_compound": -0.3612
        },
        {
            "id": "hyw3rkc",
            "score": 2,
            "text": "And the mass printing of money...",
            "title_similarity": "0.50527054",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyukao8",
            "score": 85,
            "text": "Canadian here. Can't vote, but I agree!",
            "title_similarity": "0.2646417",
            "sentiment_compound": 0.5487
        },
        {
            "id": "hyv5hgh",
            "score": 14,
            "text": "Can I get a \"no shit?!\"",
            "title_similarity": "0.03312592",
            "sentiment_compound": -0.5983
        },
        {
            "id": "hyuybz8",
            "score": 2,
            "text": "Seeing as how many corporations are seeing increased profit *margins*, the majority of US voters is absolutely correct.",
            "title_similarity": "0.6346112",
            "sentiment_compound": 0.6124
        },
        {
            "id": "hyv1gma",
            "score": 0,
            "text": "Yeah. We fucking do.",
            "title_similarity": "0.016325433",
            "sentiment_compound": 0.296
        },
        {
            "id": "hyv4fv1",
            "score": 0,
            "text": "Gee, maybe there is some hope for this country yet if most get at least this much.",
            "title_similarity": "0.2647911",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hyv4pyb",
            "score": 5,
            "text": "That's not how inflation works. If companies raise prices, people purchase less product. Inflation occurs when people continue to purchase the same or more despite a price increase. There are two sides to the equation. People have a hard time accepting that they are spending money irresponsibly. \n\nThe article presenting a one sided situation seems to argue for price fixing, but yet does not present evidence. Perhaps they should alert federal investigators, if they have evidence. But they obviously don't, so they should instead stop posting misinformation.",
            "title_similarity": "0.6484386",
            "sentiment_compound": -0.547
        },
        {
            "id": "hyv4vim",
            "score": 0,
            "text": "I bet if you asked the right way they'd also blame Joe Biden, Bernie Sanders, Donald Trump, Democrats, Republicans, cancel culture, wokeness, millennial, or pretty much anything else. \n\nI tend to agree that a large portion of it is corporate greed but I'm skeptical that's actually the feeling of people outside of polls.",
            "title_similarity": "0.78604865",
            "sentiment_compound": -0.34
        },
        {
            "id": "hyv52im",
            "score": 0,
            "text": "But look at the profits, they're soaring! /s",
            "title_similarity": "0.47858992",
            "sentiment_compound": 0.63
        },
        {
            "id": "hyv5oqu",
            "score": 6,
            "text": "Guess a majority of US voters don't understand what the Fed has been doing for the last 2 years.  Not shocked, just disappointed.",
            "title_similarity": "0.66483057",
            "sentiment_compound": 0.5448
        },
        {
            "id": "hyv5z2x",
            "score": 0,
            "text": "I didn’t vote in that poll or hear about it fyi",
            "title_similarity": "0.22807059",
            "sentiment_compound": 0.2023
        },
        {
            "id": "hyv66ca",
            "score": 0,
            "text": "I thought It was printing most of our money supply over the last three years. More money equals less value. Hence inflation.",
            "title_similarity": "0.6802902",
            "sentiment_compound": 0.2748
        },
        {
            "id": "hyv6ag7",
            "score": 0,
            "text": "Wow cant wait to read the next NYT article about petty theft",
            "title_similarity": "0.47454244",
            "sentiment_compound": 0.4588
        },
        {
            "id": "hyv6p6i",
            "score": 0,
            "text": "What people want or need to buy vs. its availability rules prices.  We’re in a very odd time with a pandemic that has shut down production on some things but other things have stayed level on production.  It’s people panicking and buying more than what is usually needed that has sent prices higher on everyday or weekly costs. \nIt does corporations no good to profiteer, they will fail.  People buying a ridiculous amount of product and selling it at crazy costs are profiteering.",
            "title_similarity": "0.74065745",
            "sentiment_compound": -0.9607
        },
        {
            "id": "hyv6yrk",
            "score": 0,
            "text": "What reliable poll you using?",
            "title_similarity": "0.17690815",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyv795n",
            "score": 0,
            "text": "well… then those ppl clearly live in a dream world where anyone with money only did it by being evil",
            "title_similarity": "0.5434252",
            "sentiment_compound": -0.1779
        },
        {
            "id": "hyv7nqb",
            "score": 0,
            "text": "I thought that new entrants were supposed to come in and make everything cheaper!!!",
            "title_similarity": "0.5217917",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyv7qkd",
            "score": 0,
            "text": "Well I was just getting gas and say a sticker of joe Biden saying I did that so it was clearly Biden, fake news",
            "title_similarity": "0.5248144",
            "sentiment_compound": 0.2415
        },
        {
            "id": "hyv82l5",
            "score": 0,
            "text": "Printing more money dilutes the value of the dollar.",
            "title_similarity": "0.6637353",
            "sentiment_compound": 0.34
        },
        {
            "id": "hyv8gpi",
            "score": 0,
            "text": "Inflation is caused by money printing,  always.",
            "title_similarity": "0.62846345",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyv8uqz",
            "score": 0,
            "text": "The government needs inflation to devalue the national debt, so, they can in turn keep spending.",
            "title_similarity": "0.6549078",
            "sentiment_compound": -0.3612
        },
        {
            "id": "hyv8v1k",
            "score": 0,
            "text": "Printing a fuckton of money is a much more likely cause",
            "title_similarity": "0.5155155",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyv8wkg",
            "score": 0,
            "text": "The majority of voters aren’t versed in finance and economics. Corporations raising prices is part of the inflationary process. This has more to do with The Federal Reserve. Some corporations have abused their pricing power, but it’s not rampant or obscene. This is a macro economic issue.",
            "title_similarity": "0.7947892",
            "sentiment_compound": 0.4512
        },
        {
            "id": "hyv8yco",
            "score": 0,
            "text": "Not FED money printing?",
            "title_similarity": "0.34864652",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyv9137",
            "score": 0,
            "text": "Were corporations not profiteering before inflation?",
            "title_similarity": "0.67763066",
            "sentiment_compound": 0.1139
        },
        {
            "id": "hyv92nl",
            "score": 0,
            "text": "Quantitative Easing had NOTHING to do with it /s",
            "title_similarity": "0.13326815",
            "sentiment_compound": 0.25
        },
        {
            "id": "hyv9b51",
            "score": 0,
            "text": "I guess it has nothing to do with the massive increase in money supply at a time of material shortages and supply chain issues. \n\nEcon 101 is too tough for some.",
            "title_similarity": "0.57738626",
            "sentiment_compound": 0.0516
        },
        {
            "id": "hyv9erj",
            "score": 0,
            "text": "Hahahah what a bunch of idiots\n\nSurely the mass printing of fiat currency and welfare checks during the pandemic had nothing to do with it",
            "title_similarity": "0.5603781",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hyvac4c",
            "score": 0,
            "text": "Fuck the corporations. Fuck USA. Because of their shitty policies and greed, the entire world suffers. Ukraine is suffering because of USA. Fuck that country.",
            "title_similarity": "0.6469954",
            "sentiment_compound": -0.9719
        },
        {
            "id": "hyvaq4f",
            "score": 0,
            "text": " Because most people are ignorant to reality. They simply ignore that fact there is clear evidence that politics influences inflation, supply chains, and tariffs more that corporate profiteering … just look at Russia/Ukraine … I mean, you really think that gas shot up because some corporate CEO decided he needed another yacht? Clearly, politicians have way more influence over negativity in the economy… THEY are trying to squash crypto, NOT corporations. It is because they can’t control markets that are DEFI … Corporate America WANTS YOU TO BE WEALTHY!! Wake up people, how naive can you be?",
            "title_similarity": "0.7454163",
            "sentiment_compound": -0.5862
        },
        {
            "id": "hyvb1m4",
            "score": 0,
            "text": "Rising prices occur because demand is greater than supply.\n\nDemand is greater than supply right now because we injected 5 trillion dollars of stimulus spending into the economy.\n\nIf companies can increase prices, and people still buy their products, then they will raise prices. If you can increase your salary by moving to another company, you will raise the price of your labor by doing so.\n\nBasic economics. \"Fairness\" has nothing whatsoever to do with it.",
            "title_similarity": "0.64074636",
            "sentiment_compound": 0.765
        },
        {
            "id": "hyvb7tf",
            "score": 0,
            "text": "Nah, it's the President. Polls show majority of Americans agree along with the majority of Americans disapproving of his term so far.\nHe's been President for only a year and most Americans agree, according to polls, we're in a worse place now than we were a year ago.",
            "title_similarity": "0.7067997",
            "sentiment_compound": 0.197
        },
        {
            "id": "hyvbesc",
            "score": 0,
            "text": "It isn’t.",
            "title_similarity": "-0.06282853",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyvciav",
            "score": 0,
            "text": "Pretty sure it’s the politicians that cause inflation but good job cooperate propaganda",
            "title_similarity": "0.74148697",
            "sentiment_compound": 0.6249
        },
        {
            "id": "hyvcv41",
            "score": 0,
            "text": "The funny thing is that Trump supporters bash companies saying that it’s them driving everything more expensive yet, that’s how their “god” has made his living!!!  He gives no fucks about anything but himself….for fucks sake, he’s a trust fund baby!!!",
            "title_similarity": "0.6939453",
            "sentiment_compound": 0.7307
        },
        {
            "id": "hyvd60s",
            "score": 0,
            "text": "Inflation is a monetary phenomenon.",
            "title_similarity": "0.54243165",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyvd9wn",
            "score": 0,
            "text": "Too many dollars chasing too few goods.",
            "title_similarity": "0.45687395",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyvdeea",
            "score": 0,
            "text": "So what?! The majority of my fellow U. S. voters can’t find their own ass - even with both hands and a flashlight. Asking them to understand basic supply & demand is well beyond their abilities - or even desire.",
            "title_similarity": "0.46263388",
            "sentiment_compound": 0.2714
        },
        {
            "id": "hyvdjje",
            "score": 0,
            "text": "Silly me, I thought it was all that money the fed printed.",
            "title_similarity": "0.67020273",
            "sentiment_compound": 0.0258
        },
        {
            "id": "hyvdtyi",
            "score": 0,
            "text": "No mention of the money handed out over the last two years as a contributing factor? We’re just going to use “corporations” as the fall guy here and not ask any more questions?",
            "title_similarity": "0.56377375",
            "sentiment_compound": -0.3736
        },
        {
            "id": "hyvdxl7",
            "score": 0,
            "text": "Profiteering is why inflation persists but isn’t the reason it happened. \n\nGod, I wish we weren’t so collectively uneducated.",
            "title_similarity": "0.5871381",
            "sentiment_compound": 0.7096
        },
        {
            "id": "hyvea7u",
            "score": 0,
            "text": "*ABC News Feb 27 2022*\n\n“20-point lead for the Republican Party in trust to handle it…40-year-high inflation leads his headaches: Americans are twice as likely to say they’re worse off than better off under his presidency, by 35-17.”\n\n“The result: A career-low 37% of Americans approve of Biden’s job performance overall, with 55% disapproving….Even in his own party, nearly a quarter of Democrats either disapprove of Biden (19%) or are withholding judgment (4%).”\n\n*Five Thirty Eight Historical Comparison*\n\nhttps://projects.fivethirtyeight.com/biden-approval-rating/\n\nNot great!",
            "title_similarity": "0.7348703",
            "sentiment_compound": 0.6703
        },
        {
            "id": "hyved55",
            "score": 0,
            "text": "Bet if Trump came back in, it would go down. Js.",
            "title_similarity": "0.45352474",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyvenv3",
            "score": 0,
            "text": "Its not the businesses… it IS the governments. \nGood thing we have crypto to save the world. \n\nhttps://forkast.news/headlines/russian-soldiers-offered-bitcoin",
            "title_similarity": "0.5166533",
            "sentiment_compound": 0.7269
        },
        {
            "id": "hyverwe",
            "score": 0,
            "text": "Polls also show your average American is dumb AF. Because I'm sure yet another fringe article from common dreams is a reliable source. \n\nIt is really irksome the fringe left keeps pushing this insanely stupid narrative that 'CoRpOraTiOnS!' are the root cause of the highest level of inflation we have had in over 40 years.  \n\nIt couldn't possibly be the fact that the Federal Reserve has run near zero interest rates for 12+ years, expanded the money supply by 50% in about 1.5 years, and run up a $9,000,000,000,000 balance sheet simultaneously while the Federal government injected multiple trillion dollar stimuluses into the economy now could it?\n\nGo look up the goddamn PPI for starters.  That'll explain why 'CorPoRATioNs!' have to raise prices. Costs for producers are seeing inflation levels even worse than consumers.\n\nHoly shit, learn econ 101. There is far too much money and liquidity in the system.  Inflation is almost non-existent in countries like Japan and China who pursued far more measures approaches during the pandemic to bolster the economy.  US injected far more stimulus than even Europe, which also explains why US inflation is far worse than the Euro bloc.  The fringe left of course will never ever blame the govt and massive multrillion dollar debt fueld govt spending that was monetized by the FED for the inflation.",
            "title_similarity": "0.7570486",
            "sentiment_compound": -0.9032
        },
        {
            "id": "hyvfa0b",
            "score": 0,
            "text": "Just realized, there’s other stuff going on on the “world “that don’t deal with dying for no no goo reason too!!",
            "title_similarity": "0.26791698",
            "sentiment_compound": 0.3553
        },
        {
            "id": "hyvfdr4",
            "score": 0,
            "text": "The US printing trillions of new dollars didn't help either",
            "title_similarity": "0.5060315",
            "sentiment_compound": -0.3089
        },
        {
            "id": "hyvfe91",
            "score": 0,
            "text": "The rest blame Biden.",
            "title_similarity": "0.43216115",
            "sentiment_compound": -0.34
        },
        {
            "id": "hyvffy7",
            "score": 0,
            "text": "They should do more research on the Federal Reserves irresponsible fiscal and monetary policies. Being informed and knowing who to be mad at is half the battle.",
            "title_similarity": "0.6926457",
            "sentiment_compound": -0.8271
        },
        {
            "id": "hyvfhdl",
            "score": 0,
            "text": "i'm sure this has nothing to do with the federal reserve printing 80% of all us currency in circulation in a single fiscal year. \n\nyep. nothing to do with that.",
            "title_similarity": "0.531525",
            "sentiment_compound": 0.5423
        },
        {
            "id": "hyvfk0p",
            "score": 0,
            "text": "Stockholders are the cause for stagnant money thusly causing inflation. Having money tied up in shares does nothing to help the economy and there’s billions tied up there. The money the government gave to people as a stimulus went right back in to the economy and those companies did nothing with it except stash it away to collect nothing but dust and interest.",
            "title_similarity": "0.731007",
            "sentiment_compound": 0.6087
        },
        {
            "id": "hyvfl91",
            "score": 0,
            "text": "Gas is up 43% YOY\n\nAre people blaming profiteering on fuel cost?\n\nBuilding materials. (Resin, doors, windows Sheetrock, lumber and steel). Up about 40% as a whole.... profiteering?\n\nNah... hard pass",
            "title_similarity": "0.63798094",
            "sentiment_compound": -0.7622
        },
        {
            "id": "hyvfzhn",
            "score": 0,
            "text": "Funny how I’ve been a lower management middle class employee of a corporation for 15 years and they give me a benefits package and wages no non corporation has been able to come close to. Non college graduate here, I’m supposed to blame my boss for treating me well? God bless corporations and all that revenue they have invested back in me and millions of others non college graduates of all races colors ethnicities genders sexualities etc….. really bad people.",
            "title_similarity": "0.66753423",
            "sentiment_compound": 0.228
        },
        {
            "id": "hyvg1ea",
            "score": 0,
            "text": "Poll shows majority of US voters have absolutely no understanding of basic economics or their countries fiscal and monetary policy over the last two years",
            "title_similarity": "0.67994297",
            "sentiment_compound": -0.3597
        },
        {
            "id": "hyvhnfy",
            "score": 0,
            "text": "So the majority of US Voters don't understand basic economics.  I believe it.",
            "title_similarity": "0.68022597",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyvhokv",
            "score": 0,
            "text": "Why aren’t they blaming the Federal Reserve and the U.S. Congress for the crazy amounts of dollars they have pumped into the economy over the past years through quantitative easing?  I guess that it’s better to blame someone who has no control over the money supply.",
            "title_similarity": "0.8013621",
            "sentiment_compound": -0.6486
        },
        {
            "id": "hyvixrc",
            "score": 0,
            "text": "It's called supply and demand. When you have low supply or high demand, prices rise until the amount of available supply equals the amount of demand at the higher price. Right now we have low supply due to shortages of just about every input (fuel, skilled labor, raw materials). Plus there are the lingering effects of lockdowns on supply chains plus the disastrous effects of dysfunctional ports and truck driver shortages. \n\nSome root causes of these issues are: going cold turkey on fossil fuels instead of a gradual transition, lack of vocational training in high school and apprenticeships, NIMBYs creating a housing shortage (which itself leads to inflation in housing costs) which then creates labor shortages in over half the country, and excessive tariffs on important goods such as lumber, steel, and electronics.  Just to name a few.\n\nThen of course we have more aggregate demand sue to the money supply exploding over the past two years.\n\nPrice controls would just lead to rationing, even less total supply as other countries outbid us or certain production facilities become unprofitable, and an inefficient distribution of resources based on luck on the rationing system.",
            "title_similarity": "0.65980303",
            "sentiment_compound": -0.8062
        },
        {
            "id": "hyvj0vi",
            "score": 0,
            "text": "Lol no it doesn't.",
            "title_similarity": "-0.053453922",
            "sentiment_compound": 0.1531
        },
        {
            "id": "hyvko04",
            "score": 0,
            "text": "They would not understand basic supply demand economics then.",
            "title_similarity": "0.3487468",
            "sentiment_compound": -0.128
        },
        {
            "id": "hyvkqtv",
            "score": 0,
            "text": "No one wants to blame all the free money they got over the past couple years? Easy to blame the evil corps! \n\nYea go ahead, downvote me into oblivion. And then wake up and smell the coffee.",
            "title_similarity": "0.6071503",
            "sentiment_compound": -0.6696
        },
        {
            "id": "hyvlm5h",
            "score": 0,
            "text": "And they are correct. Look at the companies that are claiming record profits. It’s because they’re price gouging and blaming inflation. Example: I have four grocery stores near me that I can choose from. Three of them have nearly doubled their prices. As in a 12 pack of soda that used to cost $3.49 is now $6.79. The other store’s prices are pretty much the same. Guess where I’m doing my shopping.",
            "title_similarity": "0.68191576",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hyvn8ku",
            "score": 0,
            "text": "As they should because it is 100% true",
            "title_similarity": "0.09017833",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hyvnnpa",
            "score": 0,
            "text": "Damn straight",
            "title_similarity": "-0.015690647",
            "sentiment_compound": -0.2023
        },
        {
            "id": "hyvqhss",
            "score": 0,
            "text": "Basic economics would suggest that the inflation we are seeing is because of government policy and not the corporations of America. In a free market, equilibrium is met. When there is too much government interference the market becomes skewed on way or the other.",
            "title_similarity": "0.720523",
            "sentiment_compound": 0.5106
        },
        {
            "id": "hyvu233",
            "score": 0,
            "text": "Always follow the money….unless it had to do with covid right?",
            "title_similarity": "0.34909698",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyvue8n",
            "score": 0,
            "text": "Corporate profiteering occurs because of our politicians. And I mean both parties are to blame.",
            "title_similarity": "0.81055915",
            "sentiment_compound": -0.0772
        },
        {
            "id": "hyvwcib",
            "score": 0,
            "text": "\"Poll shows Americans may not be quite as dumb as we once thought.\"\n\nFor once something not quite so bleak.",
            "title_similarity": "0.45119038",
            "sentiment_compound": -0.5542
        },
        {
            "id": "hyw6lew",
            "score": 0,
            "text": "These people are really that dull",
            "title_similarity": "0.1425322",
            "sentiment_compound": -0.4549
        },
        {
            "id": "hyw6vmt",
            "score": 0,
            "text": "“Poll shows” I’ve never been polled so I automatically take all these articles for bullshit",
            "title_similarity": "0.44812572",
            "sentiment_compound": -0.5859
        },
        {
            "id": "hyw73ed",
            "score": 0,
            "text": "Isnt this the least likely possibility?\n\nIf the rich make more money, they are less likely to spend it... It is when money is more evenly distributed that people spend the most and drive inflation.",
            "title_similarity": "0.70879865",
            "sentiment_compound": 0.5574
        },
        {
            "id": "hyw9fco",
            "score": 0,
            "text": "Clickbait title. Read literally the first paragraph before crying about the fed.",
            "title_similarity": "0.5894582",
            "sentiment_compound": -0.4767
        },
        {
            "id": "hywcby1",
            "score": 0,
            "text": "“Profiteers” was literally a term designed to slander farmers in Russia before the Communist Revolution",
            "title_similarity": "0.552632",
            "sentiment_compound": 0.0
        },
        {
            "id": "hywdwbo",
            "score": 0,
            "text": "Definitely nothing to do with the massive expansion of the money supply.",
            "title_similarity": "0.40178365",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hywe3cm",
            "score": 0,
            "text": "isn;t this the same thing that happened in the 70s where people were blaming corporations for the inflationary environment when it turned out the true culprit was the federal reserve's easy monetary policy. cant help but feel the same mistakes are being made again. Everyone is blaming Biden or big corporations whilst completely ignoring the fact the fed is continuing to pump money into markets despite inflation coming in at 7% yoy.",
            "title_similarity": "0.840552",
            "sentiment_compound": -0.9085
        },
        {
            "id": "hywg2iu",
            "score": 0,
            "text": "Right, is there another reason?",
            "title_similarity": "0.0027494924",
            "sentiment_compound": 0.0
        },
        {
            "id": "hywh13u",
            "score": 0,
            "text": "I know what to do. Create new laws and regulations that hurt the big guys but put  more of the little guy's out of business. Then afterwards we'll cry about the lack of a competitive market. Rinse and repeat every year. This very subs user base has been incredibly supportive of these policies.",
            "title_similarity": "0.6195071",
            "sentiment_compound": -0.5362
        },
        {
            "id": "hywh5km",
            "score": 0,
            "text": "Too broad of a poll.  It depends on sector.  Anything imported has seen a steep rise in container rates which is bringing the price up. Most businesses thought it would be “transitory” so they absorbed the MARGIN LOSS rather than raise prices.  Now that we know it isn’t transitory, businesses have no choice but to raise prices.  It is a big hassle to try and raise prices, most suppliers don’t do it unless they need to. If you want to blame Walmart, Apple, etc that’s fine, but I’ll say it again, anything imported costs A LOT more in import freight compared to three years ago.\n\n$2,500 per container is $24,000. Depending on the volume of the product, that item will balloon in price.",
            "title_similarity": "0.7148888",
            "sentiment_compound": -0.4707
        },
        {
            "id": "hywhafs",
            "score": 0,
            "text": "Because it’s true",
            "title_similarity": "-0.051873017",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hywicey",
            "score": 0,
            "text": "Majority of Americans don't even know what inflation is or what causes it.",
            "title_similarity": "0.6123732",
            "sentiment_compound": 0.0
        },
        {
            "id": "hywivzg",
            "score": 0,
            "text": "Wow crazy that this poll would have been taken and then, this post would have appeared the same *day* it's announced as a Democratic taking point\n\nhttps://www.cnn.com/2022/03/01/politics/senate-democrats-inflation/index.html",
            "title_similarity": "0.5025326",
            "sentiment_compound": 0.34
        },
        {
            "id": "hywjdvu",
            "score": 0,
            "text": "How many of those people polled actually have enough education for their opinion to be relevant?",
            "title_similarity": "0.3562051",
            "sentiment_compound": 0.0
        },
        {
            "id": "hywju8s",
            "score": 0,
            "text": "Article: commondreams\n\nPoll: Data for Progress\n\nYea, there isn't any bias in this at all\n\nNot to mention the pictures in OPs profile...",
            "title_similarity": "0.2763877",
            "sentiment_compound": 0.476
        },
        {
            "id": "hywjzu2",
            "score": 0,
            "text": "There’s the joke of the year.  Has absolutely nothing to do with dumping TRILLIONS of dollars into the economy.  Nope not at all.\n\nMove along, nothing to see here.",
            "title_similarity": "0.45215157",
            "sentiment_compound": -0.0258
        },
        {
            "id": "hywlb3r",
            "score": 0,
            "text": "Said a different way: Poll shows majority of Americans don’t understand economics.",
            "title_similarity": "0.72280633",
            "sentiment_compound": 0.0
        },
        {
            "id": "hywlbuz",
            "score": 0,
            "text": "Yeah, it wasn’t supply chain issues caused by COVID, oil production disruptions, the Russian invasion, record M2 supply, etc.\n\nTotally corporate profiteering. SMH.",
            "title_similarity": "0.45639166",
            "sentiment_compound": -0.657
        },
        {
            "id": "hywm22w",
            "score": 0,
            "text": "And the reality is insane amounts of government spending",
            "title_similarity": "0.556138",
            "sentiment_compound": -0.4019
        },
        {
            "id": "hywm5e0",
            "score": 0,
            "text": "Poll shows US voters blame cause of inflation for causing inflation",
            "title_similarity": "0.84472126",
            "sentiment_compound": -0.34
        },
        {
            "id": "hywm5fe",
            "score": 0,
            "text": "I'm pretty liberal and all but corporations clearly didn't cause inflation, the causes are complex but involve very low interest rates for over a decade and printing hundreds of billions of dollars and *giving it away* to every non-wealthy citizen during the pandemic to encourage them to stay home and not spread COVID.\n\nDoesn't mean corps shouldn't be criticized for price increases in excess of currency inflation, of course.",
            "title_similarity": "0.61608154",
            "sentiment_compound": 0.9531
        },
        {
            "id": "hywoffd",
            "score": 0,
            "text": "Not the fact the government gave out billions in stimulus? That’s the biggest leading cause to inflation.",
            "title_similarity": "0.74972177",
            "sentiment_compound": 0.0
        },
        {
            "id": "hywpv8s",
            "score": 0,
            "text": "I was never polled on this issue?",
            "title_similarity": "0.075967014",
            "sentiment_compound": 0.0
        },
        {
            "id": "hywqivn",
            "score": 0,
            "text": "Lol... Couldn't be government forcing everyone to lose their jobs and then printing 65% of all US currency in the last year. No no. Gotta be evil corporations. \n\nYou can't be this stupid.",
            "title_similarity": "0.7367572",
            "sentiment_compound": -0.8885
        },
        {
            "id": "hywqugb",
            "score": 0,
            "text": "Lmao no they dont. It’s the +$7 trillion that we just decided to fucken print overnight",
            "title_similarity": "0.5692157",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hywr0jl",
            "score": 0,
            "text": "That's because the average voter is an economically illiterate buffoon.",
            "title_similarity": "0.57209396",
            "sentiment_compound": 0.0
        },
        {
            "id": "hywrfs6",
            "score": 0,
            "text": "Finally they are catching on.",
            "title_similarity": "0.01764322",
            "sentiment_compound": 0.0
        },
        {
            "id": "hywrxvf",
            "score": 0,
            "text": "Majority also thinks angels are real. This whole globalization scheme is shambling along and falling apart. China was shutting down favorites wholesale for winter Olympics and also weren't producing enough energy to meet demand because CCP put price controls on electricity but not the ever increasing price of coal. It's so bad that China is walking back its green projects. \n\nAdd to all that our stupidly shipping everything through like two major ports and then not expanding them or hiring more workers for more shifts. Because of course the dock workers union don't want that and Biden is their dementia patient n chief shill.",
            "title_similarity": "0.6229407",
            "sentiment_compound": -0.8547
        },
        {
            "id": "hywseqd",
            "score": 0,
            "text": "Recognize** I mean the majority of US voters are correct and I’m glad we’re not falling for their bullshit anymore",
            "title_similarity": "0.48706067",
            "sentiment_compound": -0.0915
        },
        {
            "id": "hywsikm",
            "score": 0,
            "text": "it's weird how companies weren't charging the prices that made them absolutely the most profit in all those years of low inflation then they all of the sudden realized that they should be trying to make as much money as possible and it caused inflation.",
            "title_similarity": "0.7196512",
            "sentiment_compound": 0.1672
        },
        {
            "id": "hywstan",
            "score": 0,
            "text": "Then you polled a slew of morons.",
            "title_similarity": "0.5325468",
            "sentiment_compound": -0.3182
        },
        {
            "id": "hywuedh",
            "score": 0,
            "text": "I’m sure the GOP is somehow trying to blame THE LIBS for this too \n\n🤷🏼‍♂️\n\nHow’s that citizens united thingy working for ya?",
            "title_similarity": "0.64687407",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hywuq7g",
            "score": 0,
            "text": "Print money = inflation.  And wages did go up according to the party in charge because they've been bragging about it.",
            "title_similarity": "0.6636939",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hyww1i0",
            "score": 0,
            "text": "Mainstream Reddit is such simplistic low-level trolling. It's like the corporations, maaan! *Bong rip*\n\nNevermind our own government basically printed $18,000 per American citizen during COVID. No, couldn't be! Nothing to do with it!\n\n\"It's like the corporations man! They don't want you to know the truth! They tried to make weed illegal man!\" *Bong rip*",
            "title_similarity": "0.7365856",
            "sentiment_compound": 0.5641
        },
        {
            "id": "hyx2k4n",
            "score": 0,
            "text": "Man, if only we could get back to the last 20 years of low inflation when all corporations were run totally altruistically and without greed…",
            "title_similarity": "0.595724",
            "sentiment_compound": -0.2732
        },
        {
            "id": "hyx3jp8",
            "score": 0,
            "text": "But.. but…. Commies!!!",
            "title_similarity": "0.14218473",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyx3kv2",
            "score": 0,
            "text": "MSM spout Government’s propaganda, anything to deflect from the chaos and crisis Biden’s Presidency has brought to many Americans, so no surprise there.",
            "title_similarity": "0.6983175",
            "sentiment_compound": -0.8892
        },
        {
            "id": "hyxp1h3",
            "score": 0,
            "text": "New Poll Shows Majority of US Finds Biden Sexy and Virile!",
            "title_similarity": "0.4282983",
            "sentiment_compound": 0.5707
        },
        {
            "id": "hyxshkv",
            "score": 0,
            "text": "Inflation is due to money being printed\n\nMore supply decrease the value of the currency\n\nThis isn’t rocket science",
            "title_similarity": "0.6787242",
            "sentiment_compound": 0.34
        },
        {
            "id": "hyyevq6",
            "score": 0,
            "text": "Well they’re wrong.",
            "title_similarity": "0.11670336",
            "sentiment_compound": -0.25
        },
        {
            "id": "hyv2ime",
            "score": 21,
            "text": "That’s good news. The democrats need to hammer the message that record profits come at a cost. You cannot say inflation is the problem of people asking for a higher wage while boasting record quarterlies.",
            "title_similarity": "0.6464311",
            "sentiment_compound": 0.4767
        },
        {
            "id": "hyv63x8",
            "score": 21,
            "text": "In other news: water is wet.",
            "title_similarity": "0.13285959",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyusat0",
            "score": 51,
            "text": "This survey feels a little biased.  The question wasn't phrased as a yes or no, but rather:\n\n\"The price increases are due to corporations taking advantage of the pandemic\"\n\nOR\n\n\"Price increases are due to the government overspending.\"\n\nUnsurpsiingly, a large majority of Democrats agreed with the first choice, and e large majority of Republicans agreed with the second.\n\nThe problem is these two statements aren't contradicting each other in the slightest.  The government can be overspending AND corporates could be profiteering.  Or neither could be happening.  Phrasing it as one or the other is very strange.",
            "title_similarity": "0.74505365",
            "sentiment_compound": 0.3818
        },
        {
            "id": "hyuuyt8",
            "score": 18,
            "text": "Great. Now we just need to figure out how to make the corporations less greedy like they were in 2020 (1.23% inflation) or 2019 (1.91%)! \n\nWhat a joke...",
            "title_similarity": "0.6743883",
            "sentiment_compound": 0.7787
        },
        {
            "id": "hyv7b32",
            "score": 4,
            "text": "No shit! Just in...the sky is blue. Like wtf. Quit talking about it, and fix it!",
            "title_similarity": "0.1553127",
            "sentiment_compound": 0.2978
        },
        {
            "id": "hyv182q",
            "score": 21,
            "text": "I blame lack of economics education.",
            "title_similarity": "0.47150826",
            "sentiment_compound": -0.5719
        },
        {
            "id": "hyullhr",
            "score": -11,
            "text": "White land owning males rule!",
            "title_similarity": "0.26791993",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyv33xi",
            "score": 7,
            "text": "They without a doubt faked shortages to drive up costs. Small business owners have told me they have not had an issue getting their products. Us Government dumped a lots of cash into the economy to help real people. Big business how can we get as much of this cash as we can.",
            "title_similarity": "0.6869954",
            "sentiment_compound": 0.1306
        },
        {
            "id": "hyv3c1w",
            "score": 5,
            "text": "All these companies are having record profits.   There is S much gouging as inflation",
            "title_similarity": "0.6576524",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hyv5yzv",
            "score": 6,
            "text": "Does anyone actually think that polls reflect actual reality?",
            "title_similarity": "0.30033386",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyv6pdm",
            "score": 5,
            "text": "Duh",
            "title_similarity": "-0.056527957",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyukhla",
            "score": 305,
            "text": "Might be good news for Democrats in the Midterm",
            "title_similarity": "0.35070318",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hyuvr2h",
            "score": 1,
            "text": "OccupyWallstreet 2.0?",
            "title_similarity": "0.16820978",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyv24c5",
            "score": 1,
            "text": "Well... Yeah.",
            "title_similarity": "-0.08299283",
            "sentiment_compound": 0.5106
        },
        {
            "id": "hyv38cw",
            "score": -1,
            "text": "Trying so hard to cover up a failed presidential campaign. It’s actually sad.",
            "title_similarity": "0.53733706",
            "sentiment_compound": -0.796
        },
        {
            "id": "hyv4ad8",
            "score": 1,
            "text": "[deleted]",
            "title_similarity": "0.14869753"
        },
        {
            "id": "hyv4f15",
            "score": 1,
            "text": "Supply chain issues caused inflation in limited areas. Corporate on large scale took news of inflation as excuse to gouge customers. The government needs to step in a play referee, but they  have already been bought off by the corporation, so they aren't to step in.",
            "title_similarity": "0.7374352",
            "sentiment_compound": 0.1027
        },
        {
            "id": "hyv53yv",
            "score": 1,
            "text": "Companies makes profits that outpace inflation, sounds like blame is being put in the right place.",
            "title_similarity": "0.6167923",
            "sentiment_compound": 0.4588
        },
        {
            "id": "hyv5m65",
            "score": -1,
            "text": "WHEN HAS CORPORATE NOT BEEN IN PROFIT? INFLATION TAKE IT AS PUNISHMENT FOR NOT COMPLYING WITH THE COVID-19 AGENDA",
            "title_similarity": "0.7351817",
            "sentiment_compound": -0.6814
        },
        {
            "id": "hyv5rj9",
            "score": -1,
            "text": "Amazingly, for once, the polled majority got it right. Almost hard to believe. The fact that corporations are posting record profits (in roughly the same time scale as the new high for inflation) says a lot. They of course continue to blame supply issues for why they have to raise prices, but they continue to cover up the fact THEY are causing the issues. \n\nAnd it got swept under the rug in the name of big business. The stories were reported and then quickly hushed up and ignored. Shipping containers are sitting idle and collecting dust while overseas suppliers are begging to send goods.. but corporations are only sending back a trickle of those containers. No containers, no goods. And the state-side corporations (Walmart, etc) have realized if they just hold them until they NEED the goods, they can jack up our prices and drive down their own. Warehouses overseas are overstocked; prices for corporations are DOWN. Supplies are UP. Yet we're \"suffering supply chain issues\" and \"inflation\".. all while big business is posting record profits? Sounds like the majority smelled the bullshit finally and called it for what it is.",
            "title_similarity": "0.7770896",
            "sentiment_compound": -0.7559
        },
        {
            "id": "hyv71tf",
            "score": 1,
            "text": "The very thing people in this thread are accusing corporations of doing (hoarding money) actually causes deflation. Less money circulating. The effects of inflation are reflected in the market prices (aka corporations). There's an issue with increasing costs of living and not enough increase in wages, but it is completely disjoint from this topic.\n\nThis is why democracy is a mistake.",
            "title_similarity": "0.7981588",
            "sentiment_compound": -0.6035
        },
        {
            "id": "hyv816r",
            "score": 1,
            "text": "Well the majority of Americans are dumber then bricks.",
            "title_similarity": "0.61039865",
            "sentiment_compound": -0.1027
        },
        {
            "id": "hyv83oq",
            "score": 1,
            "text": "Wow, we really really a better public education system.",
            "title_similarity": "0.25877",
            "sentiment_compound": 0.8043
        },
        {
            "id": "hyv8lpz",
            "score": 1,
            "text": "Yeah I mean this just isn’t accurate. Just because something sounds good to a complete layman doesn’t make it true",
            "title_similarity": "0.31012332",
            "sentiment_compound": 0.7845
        },
        {
            "id": "hyv98bk",
            "score": 1,
            "text": "Then the majority of US voters are even dumber than I have them credit for",
            "title_similarity": "0.6552237",
            "sentiment_compound": 0.0258
        },
        {
            "id": "hyv98ye",
            "score": 1,
            "text": "Please ignore the $6T printed… please forget the lockdowns, please forget we had a break down in the supply chain and international relations, please don’t think…",
            "title_similarity": "0.57601273",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hyvap4v",
            "score": -1,
            "text": "Corporate profiteering??!!??\n\nHow about the fact that 45% of all American money in existence was printed in the last 12 months.. You can thank Potatoe Joe for the inflation!!",
            "title_similarity": "0.686643",
            "sentiment_compound": 0.6159
        },
        {
            "id": "hyvavf9",
            "score": 1,
            "text": "As an investor, this is ridiculous. Inflation comes from too much demand for goods partially due to all the the money injected into the economy, and also from the higher cost of inputs (everything used to make everything + labor + energy). The system feeds on itself until it's resolved, often/usually by raising interest rates and causing a recession. Not Biden's fault, not even Trump's fault.",
            "title_similarity": "0.7538212",
            "sentiment_compound": 0.5448
        },
        {
            "id": "hyvb1yz",
            "score": 1,
            "text": "That’s an alarming amount of economic illiteracy",
            "title_similarity": "0.5960147",
            "sentiment_compound": -0.5267
        },
        {
            "id": "hyvc1me",
            "score": 1,
            "text": "That’s bc people are fucking stupid.  Inflation is caused by an increase in the money supply competing for the same amount of goods and service.  We have had and massive increase in the money supply but this time it was coupled with a decrease in goods and service bc of COvID so it was the worse of both situations.",
            "title_similarity": "0.73249257",
            "sentiment_compound": -0.6365
        },
        {
            "id": "hyvcm8d",
            "score": 1,
            "text": "Hi everyone. Did everyone forget about two years ago when the Democrats raised the minimum wage? That was the beginning of inflation… all the new employees cost more.. plus having to give raises to the employees already working. So… with that said… I believe they deserved the raise. Please do not complain that your food costs more even though the workers got a three dollar raise. You should pull your own weight.. that is not corporate America putting the screws to you.. they just passing the cost to you from the raise in wages.",
            "title_similarity": "0.6888364",
            "sentiment_compound": 0.1306
        },
        {
            "id": "hyvd43g",
            "score": 1,
            "text": "No its almost like giving away 1400 for free to each American independent american citizen every few months will cause the value of the dollar to decrease lol",
            "title_similarity": "0.69323313",
            "sentiment_compound": 0.8634
        },
        {
            "id": "hyvdnzs",
            "score": 1,
            "text": "Majority of US voters have always been complete buffoons",
            "title_similarity": "0.42287013",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyvdzo8",
            "score": 1,
            "text": "This is Political Propaganda.",
            "title_similarity": "0.3599471",
            "sentiment_compound": -0.25
        },
        {
            "id": "hyveev5",
            "score": 1,
            "text": "And most Americans don’t have an understanding of economics or how the money supply works. Sure companies raising prices is contributing, so is supply and demand bottle necks and not to mention the 10 trillion in stimulus both Trump and Biden signed.",
            "title_similarity": "0.76184535",
            "sentiment_compound": 0.2023
        },
        {
            "id": "hyvex35",
            "score": 1,
            "text": "Nope.",
            "title_similarity": "-0.040581092",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyvf59i",
            "score": 1,
            "text": "Funny how people seem to forget the government gave everyone thousands of dollars without raising taxes for it.",
            "title_similarity": "0.6914413",
            "sentiment_compound": 0.25
        },
        {
            "id": "hyvf5jb",
            "score": 1,
            "text": "This is dumb. The broad, overpowering influences by the executive and legislative branches is what caused this. And the applies to both R and D parties and both Biden and Trump. People on Reddit refuse to believe it but increasing the debt limit be 2-3T$ for COVID legislation will have consequences. Keeping interest rates at record lows for over 3 years has consequences. Nothing is free. And this is no judgment on whether it was the right or wrong thing to do in response to COVID. I am just stating that it’s not just “big bad scary corporate baddies”",
            "title_similarity": "0.6276331",
            "sentiment_compound": -0.9243
        },
        {
            "id": "hyvf5uk",
            "score": 1,
            "text": "That would be because, contrary to the impression you get from the Q-Anon loudmouths, the majority of this country is actually NOT skull crushingly stupid. We can see the “record profits” Wall Street news and then look at the rising prices and shrinking package size while surviving on our never, ever rising wages and make the correct and obvious connections.",
            "title_similarity": "0.74215674",
            "sentiment_compound": 0.7074
        },
        {
            "id": "hyvf9jp",
            "score": 1,
            "text": "I blame the fact we printed off 1/4 of our cash supply is the past 2 years lol",
            "title_similarity": "0.61894953",
            "sentiment_compound": 0.1027
        },
        {
            "id": "hyvfcwn",
            "score": 1,
            "text": "Yeah it had nothing to do with our dipshit politicians printing trillions of dollars out of thin air. What did you think was going to happen? All of these forced shortages.",
            "title_similarity": "0.6176105",
            "sentiment_compound": -0.6705
        },
        {
            "id": "hyvfj0q",
            "score": 1,
            "text": "Majority of US voters are wrong. It has been caused by reckless currency creation by the Treasury department and the US Federal Reserve.",
            "title_similarity": "0.8451907",
            "sentiment_compound": -0.4404
        },
        {
            "id": "hyvfkmc",
            "score": 1,
            "text": "Yeah def not the trillions of dollars the government minted in the past 24 months",
            "title_similarity": "0.50967115",
            "sentiment_compound": 0.296
        },
        {
            "id": "hyvihcr",
            "score": 1,
            "text": "Headline improvement idea: \n\nMajority of US voters who participated in this poll are made of stupid and do not understand the simple concept of supply and demand.",
            "title_similarity": "0.7472962",
            "sentiment_compound": -0.2263
        },
        {
            "id": "hyviloa",
            "score": -1,
            "text": "I think you mean Former VP. Biden",
            "title_similarity": "0.31539387",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyvinnr",
            "score": 1,
            "text": "That’s not how inflation works.",
            "title_similarity": "0.2389802",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyvj12l",
            "score": 1,
            "text": "I blame the fact that over 70% of the U.S.’s currency in circulation has been printed in the past year under Joe Biden",
            "title_similarity": "0.6210162",
            "sentiment_compound": -0.34
        },
        {
            "id": "hyvjqc3",
            "score": -1,
            "text": "Inflation is a monetary effect, all this comments and article are disinformed. I don't care being downvoted but evidence has shown that inflation is driven by supply and demand of a given currency.\n\nJust ask Venezuela, Argentina, Brazil, Mexico in the 80s, Zimbabwe, etc. Denying that is either naïve or politically motivated. If you are not an expert in this area, please refrain yourself of commenting or having an opinion before reading peer reviewed articles and not just opinions based on polls. Remember, the truth is not democratic.",
            "title_similarity": "0.628727",
            "sentiment_compound": 0.6412
        },
        {
            "id": "hyvjror",
            "score": -1,
            "text": "That’s cool. Too bad it’s wrong, but that’s cool.",
            "title_similarity": "0.09569426",
            "sentiment_compound": 0.0772
        },
        {
            "id": "hyvjsqi",
            "score": 1,
            "text": "I love seeing a 1450 person poll be considered as a good sample size. Also most people here don’t understand how businesses operates. I urge you all to go look at Kroger’s margins. They are razor thin. So if prices are raised, it isn’t because they had a choice.",
            "title_similarity": "0.640478",
            "sentiment_compound": 0.7964
        },
        {
            "id": "hyvk3o2",
            "score": 1,
            "text": "Hot take.. our society’s obsession with consumerism is just as much to blame",
            "title_similarity": "0.65931636",
            "sentiment_compound": -0.5859
        },
        {
            "id": "hyvk5au",
            "score": 1,
            "text": "Polll shows us voters does not understand the concept of inflation",
            "title_similarity": "0.60388714",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyvlmcp",
            "score": 1,
            "text": "Dear dumdums,\n\nInflation means an increase in money supply. \n\nInflation happens when government borrows money from the bank to pay for socialism and war.\n\nIf you already forgot, government just borrowed ***trillions*** to stimulus their way out of the war on Covid.\n\nAnd not just USA did this, ***all*** the governments did.\n\nThis is where inflation comes from.\n\nNot from businesses raising prices, but from the central banking system and the government parasites feeding on the bankers' teat.",
            "title_similarity": "0.7480309",
            "sentiment_compound": -0.3919
        },
        {
            "id": "hyvludo",
            "score": 1,
            "text": "That’s not true \nAnyone with a brain knows inflation is caused by printing money",
            "title_similarity": "0.618813",
            "sentiment_compound": -0.3252
        },
        {
            "id": "hyvmc95",
            "score": 1,
            "text": "Just shows that a majority of US voters don’t know any more about how inflation works than they did about electing Biden.",
            "title_similarity": "0.74343383",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyvmcy1",
            "score": 1,
            "text": "Its almost like Capitalism is a failed system...",
            "title_similarity": "0.5543127",
            "sentiment_compound": -0.2716
        },
        {
            "id": "hyvmwpb",
            "score": 1,
            "text": "Majority of US voters recognize objective reality, that's why the gop always loses the popular vote.",
            "title_similarity": "0.74383587",
            "sentiment_compound": 0.128
        },
        {
            "id": "hyvn6q0",
            "score": 1,
            "text": "Majority of US voters couldn’t find their ass with two hands. Corporate profiteering is a variable, but the bigger picture is much more complicated and more tied to fed policy.",
            "title_similarity": "0.78652537",
            "sentiment_compound": -0.3716
        },
        {
            "id": "hyvn6t9",
            "score": 1,
            "text": "Inflation was the smokescreen to raise profits. It was the federal bank printing a shitload of extra notes creating the fake stock market and economy",
            "title_similarity": "0.77665436",
            "sentiment_compound": 0.25
        },
        {
            "id": "hyvnkfl",
            "score": 1,
            "text": "They’ve been printing money like crazy since the too big to fail Great Recession. Ramped up even more with covid and stimulus. If you add trillions of dollars to the money supply, prices go up with or without corporate profiteering.",
            "title_similarity": "0.71185696",
            "sentiment_compound": -0.167
        },
        {
            "id": "hyvnmjc",
            "score": 1,
            "text": "A targeted poll, disinformation.  You can't inject trillions of dollars and expect no inflation hike.",
            "title_similarity": "0.49958986",
            "sentiment_compound": -0.296
        },
        {
            "id": "hyvnz25",
            "score": 1,
            "text": "I'm sure it had nothing to do with adding trillions of dollars to the money supply all at once. Corporate profiteering.. yeah that's it.",
            "title_similarity": "0.584997",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hyvp4pu",
            "score": 1,
            "text": "Ok so the reason why we’re dealing with all this isn’t because of big business it’s because government interference in the free market system. As Ronald Reagan one said the nine scariest works to form a sentence are I’m from the government and I’m here to help. No mater what it is government ruins everything it puts it’s hands on and is proven by history",
            "title_similarity": "0.6965935",
            "sentiment_compound": 0.5267
        },
        {
            "id": "hyvq344",
            "score": -1,
            "text": "Bad headline, should have been, \"Poll Shows Majority of US Voters Don't Understand Basic Economics\"",
            "title_similarity": "0.724701",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hyvr91s",
            "score": 1,
            "text": "Blame FED for printing money like there’s no tommorow.",
            "title_similarity": "0.63815963",
            "sentiment_compound": -0.2732
        },
        {
            "id": "hyvrl97",
            "score": 1,
            "text": "Do people not realize that the cause of inflation is due to the Federal Reserve printing trillions of dollars?",
            "title_similarity": "0.7249124",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyvsidu",
            "score": 1,
            "text": "Gas prices and stimulus checks are what did us in. Corporations are the after math profiting. The huge spending bills the US has done over the last few years hasn't helped.",
            "title_similarity": "0.7428271",
            "sentiment_compound": 0.5994
        },
        {
            "id": "hyvspqx",
            "score": 1,
            "text": "Lol and the majority of US voters would be wrong.",
            "title_similarity": "0.60179985",
            "sentiment_compound": -0.0772
        },
        {
            "id": "hyvsvg7",
            "score": 1,
            "text": "Does no one think that it might actually have something to do with the fact that our national budget was like 7 trillion last year?  \n  \n(Edit: I’m not saying corporations aren’t an issue)",
            "title_similarity": "0.48588324",
            "sentiment_compound": 0.0772
        },
        {
            "id": "hyvt0ka",
            "score": 1,
            "text": "Gee, that doesn't reflect the army of rightwing economic \"experts\" I meet on reddit who are sure it's Biden's fault.",
            "title_similarity": "0.6419455",
            "sentiment_compound": -0.1027
        },
        {
            "id": "hyvtmsv",
            "score": 1,
            "text": "Yeah, it's definitely not the fact that the fed created 80% of all usd in circulation in the past 22 months.",
            "title_similarity": "0.5762117",
            "sentiment_compound": 0.7096
        },
        {
            "id": "hyvtt20",
            "score": 1,
            "text": "Inflation couldn’t have anything to do with the federal reserve printing something like 30% of the total money supply in just the last two years.\n\nIts definitely greeedy corporations woooo 👻",
            "title_similarity": "0.5615644",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hyvtwzh",
            "score": 1,
            "text": "People, ungodly amounts of money printing done by your central banks is what’s creating inflation. Corporations need to protect their bottom lines so the cost of inflation is passed down to the people/consumers. Central banks are the cause of inflation, not corporations.",
            "title_similarity": "0.78332317",
            "sentiment_compound": 0.5859
        },
        {
            "id": "hyvuani",
            "score": 1,
            "text": "Totally has nothing to do with the 7 to 8 trillion dollars the fed has pumped into the system since the beginning of the pandemic. But yes blame the corporations. I mean they are part of the problem but they're not the only problem.",
            "title_similarity": "0.6751573",
            "sentiment_compound": -0.0549
        },
        {
            "id": "hyvuvds",
            "score": 1,
            "text": "This is the worst propaganda I’ve ever seen. And some of the worst display of economic illiteracy",
            "title_similarity": "0.5824603",
            "sentiment_compound": -0.9201
        },
        {
            "id": "hyvxeg8",
            "score": 1,
            "text": "That explanation doesn’t make sense at all. Corporations didn’t magically get more greedy in the last two years. They weren’t intentionally just leaving money on the table before.",
            "title_similarity": "0.55092406",
            "sentiment_compound": -0.3804
        },
        {
            "id": "hyw2wcr",
            "score": 1,
            "text": "Printing money is causing inflation",
            "title_similarity": "0.6431736",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyw39fg",
            "score": 1,
            "text": "Hmm, not the trillions of dollars of money being spent and printed by the government right?",
            "title_similarity": "0.66296124",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyw7bmq",
            "score": -1,
            "text": "This is verifiably false. The main reason for the inflation is the Feds printing money non-stop for the last few years. \n\nAlso, the way inflation is calculated is entirely transparent and known, you can look it up.",
            "title_similarity": "0.693339",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyw8wv2",
            "score": -1,
            "text": "But not biden lol",
            "title_similarity": "0.009125466",
            "sentiment_compound": -0.4585
        },
        {
            "id": "hyw8xh5",
            "score": -1,
            "text": "A majority of US voters believe word for word what Elizabeth Warren said was the cause for inflation? Weird…",
            "title_similarity": "0.83081186",
            "sentiment_compound": 0.0
        },
        {
            "id": "hywbxnc",
            "score": -1,
            "text": "Certainly not the people elected to run this country. That just wouldn't make any sense!",
            "title_similarity": "0.3149444",
            "sentiment_compound": 0.4003
        },
        {
            "id": "hywegjv",
            "score": 1,
            "text": "It has nothing to do with huge government deficits or the Federal Reserve though.",
            "title_similarity": "0.3462797",
            "sentiment_compound": 0.3182
        },
        {
            "id": "hywgrq0",
            "score": 1,
            "text": "Profiteering time now there’s not only war profiteering, but pandemic profiteering",
            "title_similarity": "0.5688771",
            "sentiment_compound": 0.0245
        },
        {
            "id": "hywh4q3",
            "score": 1,
            "text": "Poll shows majority of US voters don't understand macro economics 101.  Fixed that headline for you.",
            "title_similarity": "0.8028178",
            "sentiment_compound": 0.0
        },
        {
            "id": "hywhf1d",
            "score": -1,
            "text": "What else would you blame? And you can’t say the president",
            "title_similarity": "0.43357995",
            "sentiment_compound": -0.34
        },
        {
            "id": "hywi08u",
            "score": 1,
            "text": "GET THE F OUTTA HERE.. how dumb are y’all ?",
            "title_similarity": "0.29490304",
            "sentiment_compound": -0.5106
        },
        {
            "id": "hywii6n",
            "score": -1,
            "text": "But they don’t blame the BILLIONS of dollars that are injected into our economy every month?\n\nEdit for downvoters: just b/c the majority believe that dosent mean it’s true",
            "title_similarity": "0.7695626",
            "sentiment_compound": 0.1531
        },
        {
            "id": "hywipsu",
            "score": -1,
            "text": "That’s because most people are stupid.",
            "title_similarity": "0.5031254",
            "sentiment_compound": -0.5667
        },
        {
            "id": "hywjvwd",
            "score": -1,
            "text": "“Conducted by Data for Progress and released by the Groundwork Collaborative…”\n\nSo basically the majority of progressives blame  corporate profiteering.\n\nThe rest of us understand the impact of the pandemic on the supply chain and the overall workforce.\n\nNever mind what the Fed has done over the past year.",
            "title_similarity": "0.8273037",
            "sentiment_compound": -0.0516
        },
        {
            "id": "hywk09d",
            "score": 1,
            "text": "\"Poll shows Majority of US voters are, in fact, not fucking idiots\"",
            "title_similarity": "0.51512766",
            "sentiment_compound": 0.0
        },
        {
            "id": "hywlkh0",
            "score": -1,
            "text": "Joe. Biden.",
            "title_similarity": "0.1129688",
            "sentiment_compound": 0.0
        },
        {
            "id": "hywmtqa",
            "score": -1,
            "text": "Couldn’t have anything to do with that moron crooked Joe closing the door on US energy independence or the governments printing of more dollars could it?  Blame those nasty job creators.  People are simply ignorant. SMH",
            "title_similarity": "0.6248426",
            "sentiment_compound": -0.9049
        },
        {
            "id": "hywnllz",
            "score": -1,
            "text": "A majority of Americans would also prohibit the teaching of Arabic numerals. \n\nLast time I checked the majority of Americans didn’t have an economics degree",
            "title_similarity": "0.5760968",
            "sentiment_compound": 0.0
        },
        {
            "id": "hywnlsf",
            "score": -1,
            "text": "Well it’s definitely good people think this, it’s just inaccurate right?",
            "title_similarity": "0.23568362",
            "sentiment_compound": 0.7717
        },
        {
            "id": "hywonc9",
            "score": -1,
            "text": "Majority of Americans are also pretty dumb. Not surprised.",
            "title_similarity": "0.5212233",
            "sentiment_compound": -0.194
        },
        {
            "id": "hywopmp",
            "score": -1,
            "text": "Sad how truly ignorant & uninformed people are",
            "title_similarity": "0.2860575",
            "sentiment_compound": -0.3182
        },
        {
            "id": "hywq148",
            "score": -1,
            "text": "Ah yes, printing money has nothing to do with this.",
            "title_similarity": "0.19609031",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hywq504",
            "score": 1,
            "text": "80% of US dollars in existence were printed in the last 22 months.",
            "title_similarity": "0.47844166",
            "sentiment_compound": 0.0
        },
        {
            "id": "hywrdml",
            "score": 1,
            "text": "Poll shows majority of US Voters aren’t paying attention—it’s the policy of the govt and central bank that’s primarily causing inflation.",
            "title_similarity": "0.8560188",
            "sentiment_compound": 0.0
        },
        {
            "id": "hywrk2j",
            "score": 1,
            "text": "They would be incorrect",
            "title_similarity": "0.11401945",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyws8mc",
            "score": 1,
            "text": "> Poll Shows Majority of US Voters Blame Corporate Profiteering for Inflation\n\nAnd the ones who don't blame Corporate Profiteering are busy voluntarily taking Cattle laxatives and injecting bleach into their arms.  So there's that.",
            "title_similarity": "0.76701844",
            "sentiment_compound": -0.1331
        },
        {
            "id": "hywv296",
            "score": -1,
            "text": "That’s not how inflation works. Inflation comes from having an unbacked currency that gets printed endlessly. \n\nGold standard/bitcoin standard needs to be reinstated/implemented.\n\nFYI there is a difference between money and currency. \n\nGold is money. \nUSD is currency.",
            "title_similarity": "0.61202",
            "sentiment_compound": 0.368
        },
        {
            "id": "hywx2qk",
            "score": -1,
            "text": "Stop punishing small business owners because you hate Jeff Bezos.",
            "title_similarity": "0.5721177",
            "sentiment_compound": -0.8591
        },
        {
            "id": "hyynnuv",
            "score": -1,
            "text": "wrong",
            "title_similarity": "0.10317166",
            "sentiment_compound": -0.4767
        },
        {
            "id": "hyvazmn",
            "score": 192,
            "text": "That’s because it is profiteering. These major companies see natural inflation as an excuse to jack up their prices to “Compensate” for the new expenses, and never lower the prices back down. Corporations only give a damn about their bottom line and profit margins and frankly if anyone claimed otherwise I’d call them a liar.",
            "title_similarity": "0.74443686",
            "sentiment_compound": 0.0649
        },
        {
            "id": "hyv3rpa",
            "score": 7,
            "text": "Oil industry/real estate/used car market are the prime offenders if you look at the CPI index",
            "title_similarity": "0.70694876",
            "sentiment_compound": -0.3612
        },
        {
            "id": "hyv7ptb",
            "score": 7,
            "text": "Poll Shows Majority of US Voters Correctly Blame Cause of Inflation for Inflation",
            "title_similarity": "0.8928001",
            "sentiment_compound": -0.34
        },
        {
            "id": "hyuls0h",
            "score": 660,
            "text": "I blame the wealthy for the majority of our problems. Raise minimum wage and they feel that the entire corporate structure deserves higher wages. Then they look at their bottom line & adjust costs to make that same profit. Then... They'll use that the next time people want to raise minimum wage to say \"see, that didn't work\".\n\nI believe that's called a \"catch 22\".",
            "title_similarity": "0.77787983",
            "sentiment_compound": 0.1531
        },
        {
            "id": "hyv6r18",
            "score": 8,
            "text": "Yeah, the record profits gave it away…",
            "title_similarity": "0.45548677",
            "sentiment_compound": 0.6249
        },
        {
            "id": "hyuopo3",
            "score": -2,
            "text": "Will the majority of voters vote that way?",
            "title_similarity": "0.45907784",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyv3j10",
            "score": 2,
            "text": "but but but it's the immigrants!!! no it's the lazy millennials!!! no it's the libs!!! LETS GO BRANDON!! it's everyone but the billionaires!!!",
            "title_similarity": "0.5961914",
            "sentiment_compound": -0.8755
        },
        {
            "id": "hyv6jq6",
            "score": -2,
            "text": "I blame the federal government.",
            "title_similarity": "0.53608334",
            "sentiment_compound": -0.34
        },
        {
            "id": "hyv6r1u",
            "score": -2,
            "text": "It's Totally not all the money printing we did. Yes capitalism bad government good",
            "title_similarity": "0.69218504",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hyv6wol",
            "score": -2,
            "text": "The lack of people's understanding of economics is appalling, while corporations are not going to lose money their profit percentage is pretty consistent but they make a convenient boogieman for Democrats (and some Republicans).  While the corporations had very little to do with the rise in prices (meaning they are just passing increased costs along to the consumer as always) any corporate greed will show when things settle down and some items will remain high.  Those are the ones you need to be concerned about but for now the blame is pretty much all on the backs of insane spending and horrible policy decisions.",
            "title_similarity": "0.6445161",
            "sentiment_compound": -0.845
        },
        {
            "id": "hyv6xhn",
            "score": -2,
            "text": "Big meat, big grocery, big you name it, Elizabeth Warren will sell it to you as the bane of your existence in exchange for political relevance.  \n\nOn a serious note, it's a bit sad but perhaps expected such efforts work. Ain't it funny how the corporations just decided to turn greedy after all this time!",
            "title_similarity": "0.6249727",
            "sentiment_compound": -0.8201
        },
        {
            "id": "hyv7a87",
            "score": -2,
            "text": "BIDENS FAULT. #facts",
            "title_similarity": "0.2954718",
            "sentiment_compound": -0.5319
        },
        {
            "id": "hyv7dqr",
            "score": 2,
            "text": "Because it’s pretty blatantly obvious",
            "title_similarity": "0.041920394",
            "sentiment_compound": 0.4939
        },
        {
            "id": "hyv7eer",
            "score": -2,
            "text": "Yeah corporations such as Pfizer ,Moderna and Johnson and Johnson",
            "title_similarity": "0.3956516",
            "sentiment_compound": 0.296
        },
        {
            "id": "hyv7u2b",
            "score": 2,
            "text": "Anecdotally I can prove they are right . In Mexico where the government owns the gas and oil supply prices are exactly the same as they were a few years ago. The difference is profits by the energy companies and gas stations.   due to Putin, some spike in oil-gas prices is acceptable and understandable, but those who blame Joe Biden ae 100% wrong. They should be blaming Texas oil companies. and the politicians in their pockets like Abbott and Cruz.",
            "title_similarity": "0.64492285",
            "sentiment_compound": -0.7311
        },
        {
            "id": "hyv8lkc",
            "score": 2,
            "text": "Sure, greedy boogeymen...It couldn’t be because our govt printed almost half of the money in circulation in the past 18 months 🤦🏼‍♂️🤡",
            "title_similarity": "0.68624336",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyv99m4",
            "score": 2,
            "text": "We aren’t blind",
            "title_similarity": "-0.09411029",
            "sentiment_compound": -0.4019
        },
        {
            "id": "hyv99p9",
            "score": 2,
            "text": "So the American electorate is smarter than corporations think.",
            "title_similarity": "0.5482936",
            "sentiment_compound": 0.4588
        },
        {
            "id": "hyvcy6w",
            "score": 2,
            "text": "Why are they talking about, it was obviously the welfare queen.",
            "title_similarity": "0.3664201",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyvjqqt",
            "score": 2,
            "text": "Exactly, companies can't claim inflation while also claiming record profits.",
            "title_similarity": "0.5392465",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hyw03pe",
            "score": 2,
            "text": "Well then apparently a majority of US Voters are buying the lie they are being fed by an incompetent administration.\n\nThe money supply of the US dollar increased FIVE-FOLD in the past 2 years. That's what's causing inflation, and that's why companies are having to raise prices. The dollar is literally less valuable than it's ever been. Take some basic economics courses.\n\nSource: https://www.federalreserve.gov/datadownload/Chart.aspx?rel=H6&series=798e2796917702a5f8423426ba7e6b42&lastobs=&from=&to=&filetype=csv&label=include&layout=seriescolumn&type=package&pp=Download",
            "title_similarity": "0.7817464",
            "sentiment_compound": 0.4417
        },
        {
            "id": "hyw43lu",
            "score": 2,
            "text": "Nothing to do with stimulus checks",
            "title_similarity": "0.07038598",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyw4bor",
            "score": 2,
            "text": "Majority of US Voters are beyond ignorant. EndTheFed.",
            "title_similarity": "0.61345804",
            "sentiment_compound": -0.2732
        },
        {
            "id": "hyw50kg",
            "score": 2,
            "text": "Blue hair? Didn’t expect anything else.",
            "title_similarity": "0.011005399",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyw7siq",
            "score": -2,
            "text": "So the printing of USD and \"covid checks\" had nothing to do with it??",
            "title_similarity": "0.34709942",
            "sentiment_compound": 0.0
        },
        {
            "id": "hywbwnz",
            "score": -2,
            "text": "Propaganda works",
            "title_similarity": "0.21190912",
            "sentiment_compound": -0.25
        },
        {
            "id": "hywby2p",
            "score": -2,
            "text": "They actually need to learn what causes inflation.",
            "title_similarity": "0.41989553",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyweayd",
            "score": 2,
            "text": "Majority of US voters don’t know shit about how money works.",
            "title_similarity": "0.64373267",
            "sentiment_compound": -0.5574
        },
        {
            "id": "hywewns",
            "score": 2,
            "text": "That’s not how inflations works…",
            "title_similarity": "0.22844319",
            "sentiment_compound": 0.0
        },
        {
            "id": "hywf9fs",
            "score": -2,
            "text": "More like our incompetent administration…",
            "title_similarity": "0.39296886",
            "sentiment_compound": -0.1458
        },
        {
            "id": "hywfonk",
            "score": -2,
            "text": "And what is the explanation as to why corporate profiteering increased so dramatically after Biden took office?",
            "title_similarity": "0.6719084",
            "sentiment_compound": 0.128
        },
        {
            "id": "hywg5sa",
            "score": 2,
            "text": "When will the American people stand up to these corporations?",
            "title_similarity": "0.533199",
            "sentiment_compound": 0.0
        },
        {
            "id": "hywg6t2",
            "score": 2,
            "text": "Good! people are paying attention!",
            "title_similarity": "-0.005921657",
            "sentiment_compound": 0.5399
        },
        {
            "id": "hywgk67",
            "score": 2,
            "text": "The majority of US voters are correct in this case.",
            "title_similarity": "0.3892641",
            "sentiment_compound": 0.0
        },
        {
            "id": "hywhr8o",
            "score": 2,
            "text": "Corporate GREED. It’s never enough profit for those rich pricks. All these major companies have so many executives and CEOs making millions, but they pay the people that actually do the work Pennies.",
            "title_similarity": "0.7587681",
            "sentiment_compound": -0.3959
        },
        {
            "id": "hywiecn",
            "score": -2,
            "text": "Voters also don’t understand basic economics. It’s crazy and awful how uneducated most of this country is :(",
            "title_similarity": "0.56756985",
            "sentiment_compound": -0.8074
        },
        {
            "id": "hywka9j",
            "score": -2,
            "text": "Wrong. Its due to biden",
            "title_similarity": "0.29487717",
            "sentiment_compound": -0.4767
        },
        {
            "id": "hywnkyt",
            "score": -2,
            "text": "No understanding of how inflation works",
            "title_similarity": "0.33352515",
            "sentiment_compound": -0.296
        },
        {
            "id": "hywr60y",
            "score": 2,
            "text": "Couldn’t have anything to do with all the fake money printed for the stimulus",
            "title_similarity": "0.4261618",
            "sentiment_compound": -0.4767
        },
        {
            "id": "hyxy2sz",
            "score": -2,
            "text": "Blame Biden",
            "title_similarity": "0.33510497",
            "sentiment_compound": -0.34
        },
        {
            "id": "hyv97ti",
            "score": 24,
            "text": "They have record profit margins. Oh the price of my supplies increased by $1, guess I'll charge people $2 more to offset that cost to me...lol...they are still paying it...$5?\n\nStill paying it? lol\n\nHey sorry we're charging so much it's y'know...shortages...lol\n\nGod I missed my calling as an asshole CEO screwing everyone over 80's style while doing blow off of a chimpanzee's ass.",
            "title_similarity": "0.65523124",
            "sentiment_compound": 0.3313
        },
        {
            "id": "hyv5ga7",
            "score": 2,
            "text": "Yeah..",
            "title_similarity": "-0.08014263",
            "sentiment_compound": 0.296
        },
        {
            "id": "hyv624g",
            "score": 3,
            "text": "And and not no one gonna do shit about it. Sucks to suck .....",
            "title_similarity": "0.14321983",
            "sentiment_compound": -0.7971
        },
        {
            "id": "hyv6688",
            "score": 4,
            "text": "A majority of US voters are idiots.  No wonder.",
            "title_similarity": "0.6979777",
            "sentiment_compound": -0.296
        },
        {
            "id": "hyv7dmb",
            "score": 2,
            "text": "Unfettered capitalism.",
            "title_similarity": "0.4536473",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyv87dj",
            "score": -3,
            "text": "Well that’s just patently false, this is why corporations treat people the way they do",
            "title_similarity": "0.6175221",
            "sentiment_compound": 0.5859
        },
        {
            "id": "hyv8xov",
            "score": 4,
            "text": "Free money plus 0% interest rates is begging for inflation. I’m good with that policy at the time (due to Covid) but we probably should’ve picked it back up soon. Interest rates are going to steadily climb to help combat but it feels we’re way behind. Is there corporate profiteering in the meantime? Sure. That’s because there’s the space for it. Is that the cause? Probably not the main one but I imagine it contributes. Like it or not, we’re going to be in the Wild West for a year or two until we can hit market equilibrium again.",
            "title_similarity": "0.6225295",
            "sentiment_compound": 0.935
        },
        {
            "id": "hyvcn3o",
            "score": 3,
            "text": "It also shows that the majority of US Voters have no idea how the economy actually works and/or don't work a job where they see what is happening on a daily basis. A good example is I work in sales. It is currently taking multiple extra weeks or months to get things right now for a multitude of reasons. This costs these companies money to not be able to pump out the products they need to at the rate they were previously selling at. In order to circumvent all of the added cost that DOES trickle down from the VERY beginning of the supply chain, IE, those mining/harvesting the materials and factories mixing/making them until it gets into the hands of the consumer, adds up. EVERYONE along the entire supply chain has to pay more, and they're all going to increase their price to make up for it until it gets to the consumer. Increasing Chinese TARIFFs didnt help.\n\nThen you also have historically low interest rates. High interest rates keeps inflation down, while low makes it speed up so it balances out. Then you have the trillions of dollars that was shoved into the economy instead of letting it run it's own course naturally. Essentially it was a perfect storm all thanks to COVID and a few things that preceded it.\n\nAt the end of the day though, \"Corporate profiteering\" if an easy way to say, \"Im still paying for it with the price increase instead of saying no and keeping my money or using it more wisely elsewhere.\" This is the same exact reason why going to a university is so expensive. If youre going to keep giving them money, they have no incentive to lower the price. Your wallet speaks louder than your words.",
            "title_similarity": "0.6895797",
            "sentiment_compound": 0.9235
        },
        {
            "id": "hyvd1ow",
            "score": 3,
            "text": "Not printing 40% of all dollars in existence in the last 2 years? Do people even know what inflation is? You could argue that almost all the stimulus that contained  said dollars went to corporations and that is reprehensible and should be called out.",
            "title_similarity": "0.8105657",
            "sentiment_compound": -0.4137
        },
        {
            "id": "hyveuza",
            "score": 4,
            "text": "Majority of US voters are economically illiterate. 🤷🏻‍♂️",
            "title_similarity": "0.6466116",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyvf0dl",
            "score": 3,
            "text": "Once again proving most US voters know very little about economics.",
            "title_similarity": "0.6073563",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyvfe64",
            "score": 3,
            "text": "“Poll shows majority of US voters don’t understand the economy.” There, I fixed it.",
            "title_similarity": "0.77416015",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyvfgq9",
            "score": 2,
            "text": "And they’re in other polls show that 90% of people are uninformed voters so there you go",
            "title_similarity": "0.7006961",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyvfmur",
            "score": 2,
            "text": "That doesn’t mean they’re right. How many of those polled have ever taken an economic course and understand how inflation works?",
            "title_similarity": "0.6961452",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyw0ttv",
            "score": 3,
            "text": "coincidentally, poll shows the majority of Americans don't understand economics",
            "title_similarity": "0.68731976",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyw3i13",
            "score": 3,
            "text": "80% of all US dollars in existence were printed in the last 22 months (from $4 trillion in January 2020 to $20 trillion in October 2021)\n\nI will never understand how people have such strong feelings about important issues that effect everyone without so much as a modicum of understanding.",
            "title_similarity": "0.600011",
            "sentiment_compound": 0.6249
        },
        {
            "id": "hyw3mai",
            "score": 4,
            "text": "and not the government for printing all that extra money ...",
            "title_similarity": "0.48560247",
            "sentiment_compound": 0.0
        },
        {
            "id": "hywbn9a",
            "score": -3,
            "text": "That’s not how it works 🤣",
            "title_similarity": "0.059597608",
            "sentiment_compound": 0.4939
        },
        {
            "id": "hywiud3",
            "score": -3,
            "text": "Mostly the lazy youth",
            "title_similarity": "0.19025263",
            "sentiment_compound": -0.3612
        },
        {
            "id": "hywlexh",
            "score": -4,
            "text": "Majority of US voters are idiots. More at 11.",
            "title_similarity": "0.66039956",
            "sentiment_compound": 0.0
        },
        {
            "id": "hywntgy",
            "score": -4,
            "text": "This is the direct result of Biden’s disastrous policies and a totally incompetent administration!",
            "title_similarity": "0.48014733",
            "sentiment_compound": -0.8217
        },
        {
            "id": "hywq8es",
            "score": -3,
            "text": "This is a lie. The federal government printed over $6T in the last 24 months. There are supply shortages and lazy workers who are demanding more pay for the same unskilled labor. Additionally, energy prices are are on the rise because the current administration intentionally decreased the supply (e.g. Keystone Pipeline shutdown). These are the real reasons for inflation.",
            "title_similarity": "0.7208674",
            "sentiment_compound": -0.5563
        },
        {
            "id": "hyv08ks",
            "score": 5,
            "text": "Geez ya think",
            "title_similarity": "0.061427183",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyv6djm",
            "score": 4,
            "text": "\"Even though we had record profits again this year, our costs are going up a little. So we are going to pass those costs into our customers.\" Then gives CEO 40mil bonus.",
            "title_similarity": "0.59317887",
            "sentiment_compound": 0.7506
        },
        {
            "id": "hyvkdhm",
            "score": 5,
            "text": " The corporations own Congress.  End of discussion.",
            "title_similarity": "0.5198698",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyv7t5a",
            "score": 88,
            "text": "Yea no shit. In the past 10 years whenever there was a price increase with the excuse of some problem or uncertainty, the prices would never go down again once that problem or uncertainty was over. Same goes for inflation. Prices increase more than inflation, yet it's still inflation's fault. And wages don't increase the same amount.\n\n&#x200B;\n\nBig companies are literally driving people that used to be able to manage into poverty because of their price increases, yet governments turn a blind eye like it's a normal thing to do...",
            "title_similarity": "0.69984925",
            "sentiment_compound": -0.8604
        },
        {
            "id": "hyv741v",
            "score": 5,
            "text": "And they'd be correct.",
            "title_similarity": "-0.05182436",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyvd9rv",
            "score": 5,
            "text": "Polls show majority of US voters have tenuous grasp on basic economics.",
            "title_similarity": "0.7191335",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyvfnr0",
            "score": 5,
            "text": "The comments in here are embarrassing. Inflation is real. Corporations have record profits because of price increases. Prices have had to increase because there was too much demand and caused prices to increase.   \n\n\nSee shipping container shortage, chip shortage, foam shortages etc. We had stimulated artificial demand across the worlds economies to get through Covid which put a serious strain on supply chain and slowly seeing the price increases tickle into the world (eg inflation)",
            "title_similarity": "0.688413",
            "sentiment_compound": -0.0772
        },
        {
            "id": "hyv7fxn",
            "score": 19,
            "text": "\"large corporations are taking advantage of the pandemic to raise prices unfairly on consumers and increase profits.\"\n\nThis has nothing to do with baseline inflation and it's insanely intellectually dishonest to imply that it's in any way indicative that a person believes that this is where the blame lies with our increased inflation.",
            "title_similarity": "0.6975808",
            "sentiment_compound": 0.2023
        },
        {
            "id": "hyv0hwg",
            "score": 1630,
            "text": "I am becoming increasingly disillusioned with polling that asks these kinds of questions. You can basically get a majority of Americans to agree to any premise as long as you get to blame a boogeyman for it. Doesn't mean they will vote like it.",
            "title_similarity": "0.685498",
            "sentiment_compound": -0.0772
        },
        {
            "id": "hyv0zlr",
            "score": 5,
            "text": "Gas prices go up, they say they have to charge more for bread. Gas prices go down, bread prices stay the same then go up again on the next round from the last hike. It's actually \"jacking\" action.",
            "title_similarity": "0.5991112",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyv5vwr",
            "score": 7,
            "text": "I mean, does it really matter what the common American believes is the economic problem? I want to know what is the actual cause for inflation, not just have a vote on it.",
            "title_similarity": "0.6820192",
            "sentiment_compound": -0.2516
        },
        {
            "id": "hyv6tdr",
            "score": 8,
            "text": "According to Fox News and the GOP, this is all Biden's fault.",
            "title_similarity": "0.55137014",
            "sentiment_compound": -0.4019
        },
        {
            "id": "hyvjlu0",
            "score": 5,
            "text": "That's because the inflation has been caused by corporate profiteering",
            "title_similarity": "0.75303555",
            "sentiment_compound": -0.1531
        },
        {
            "id": "hyvjlvw",
            "score": 6,
            "text": "So we’ve realized supply chain shortages as BS. Good.",
            "title_similarity": "0.43187082",
            "sentiment_compound": 0.3182
        },
        {
            "id": "hyukmx1",
            "score": -7,
            "text": "While not exactly true, this doesn’t bode well for big businesses everywhere. Or are we at the point where it really doesn’t matter?",
            "title_similarity": "0.45798495",
            "sentiment_compound": 0.0378
        },
        {
            "id": "hywaxai",
            "score": -7,
            "text": "I feel so much fatigue over Biden that wouldn't mind if Trump was permanently instated as president.",
            "title_similarity": "0.5727991",
            "sentiment_compound": -0.3134
        },
        {
            "id": "hyv6xhe",
            "score": 473,
            "text": "The System was never designed to benefit everyone. It was designed by and for the rich and powerful at the top of the pyramid, who only care about themselves and the status quo of power, profit, and control.",
            "title_similarity": "0.5801437",
            "sentiment_compound": 0.8961
        },
        {
            "id": "hywgz5f",
            "score": 15,
            "text": "[deleted]",
            "title_similarity": "0.14869753"
        },
        {
            "id": "hyun39e",
            "score": 657,
            "text": "The rest just run around putting stickers on gas pumps",
            "title_similarity": "0.31262815",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyv8m1g",
            "score": 58,
            "text": "As someone who lives on a beef farm; the rising meat costs are not leading to more money for farmers. We need it, our costs are going up, but the animals are selling for the same price.",
            "title_similarity": "0.45657665",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyumn9e",
            "score": 8721,
            "text": "Funny how corporations always use inflation as an excuse to raise prices but never to raise wages.",
            "title_similarity": "0.64515567",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hyuwoh6",
            "score": 1,
            "text": "Because it is responsible for it. Along with all those trillions that were printed off and given to them.",
            "title_similarity": "0.4157501",
            "sentiment_compound": 0.3182
        },
        {
            "id": "hyv37jo",
            "score": 1,
            "text": "Neat.  So?",
            "title_similarity": "-0.04917955",
            "sentiment_compound": 0.4588
        },
        {
            "id": "hyv41du",
            "score": 1,
            "text": "Well, I'm not sure how accurate this perception actually is. But either way, it's interesting. \n\nE.g., it's funny how Republicans are 51 - 40 blaming companies when asked about \"corps taking advantage\" versus \"have no choice but to raise prices,\" but when they have a chance to blame the government in the next question, they're 61 - 30 saying it's the fault of the government lol. \n\nAlso, what does \"crack down on large corporations that raise prices unfairly\" mean to people? Like do they want the government to set prices or what? I always thought Americans would be totally against that.",
            "title_similarity": "0.7578618",
            "sentiment_compound": 0.7564
        },
        {
            "id": "hyv49m8",
            "score": 1,
            "text": "So if people blame corporations, why do they also blame the President?  This is not an issue he has any power to directly fix.",
            "title_similarity": "0.5741138",
            "sentiment_compound": -0.6204
        },
        {
            "id": "hyv4nbs",
            "score": 1,
            "text": "I mean its the pandemic too but yeah corporate profiteering for sure too",
            "title_similarity": "0.71579695",
            "sentiment_compound": 0.5927
        },
        {
            "id": "hyv4vd9",
            "score": 1,
            "text": "So are we going to do anything about it",
            "title_similarity": "-0.014488032",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyv51td",
            "score": 1,
            "text": "I'd kind of given up hope on the idea, but wouldn't it be great if Americans became too smart for this shit?",
            "title_similarity": "0.40943432",
            "sentiment_compound": -0.7042
        },
        {
            "id": "hyv5ivq",
            "score": 2,
            "text": "If corporations are people.. then corporations can be considered a danger to themselves and to others. They should be forced to undergo mental health examinations, starting at the top!\n\nIn some states it's commonly referred to as a \"mental inquisition\".",
            "title_similarity": "0.6131575",
            "sentiment_compound": -0.7959
        },
        {
            "id": "hyv5ljo",
            "score": 2,
            "text": "News media shows that, since they’re also corporate, that can’t be it. It must be millennials Vs Boomers, and wage increases, and the pandemic reducing…something.",
            "title_similarity": "0.76119167",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyv5nap",
            "score": 1,
            "text": "Sorry I’m late. What I miss?",
            "title_similarity": "0.25904596",
            "sentiment_compound": -0.2263
        },
        {
            "id": "hyv5p9z",
            "score": 2,
            "text": "It’s just true",
            "title_similarity": "-0.06034577",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hyv5pp6",
            "score": 1,
            "text": "Inflation is real but they hide other price hikes inside their inflation price hikes. In other words inflation would be lower than it is. How do you say record profits immediately after blaming high wages and shipping costs? Lmao",
            "title_similarity": "0.71507823",
            "sentiment_compound": 0.2617
        },
        {
            "id": "hyv6998",
            "score": 2,
            "text": "Yeah that tracks.",
            "title_similarity": "-0.0351158",
            "sentiment_compound": 0.296
        },
        {
            "id": "hyv6c8b",
            "score": 1,
            "text": "I mean.. it’s pretty obvious that’s the case.",
            "title_similarity": "0.0050721904",
            "sentiment_compound": 0.4939
        },
        {
            "id": "hyv6ddw",
            "score": 1,
            "text": ">Just 29% of voters believe the narrative—advanced by lavishly compensated company executives—that \"large corporations have no choice but to raise prices in response to rising costs,\" the poll found.\n\nFunny how it is always around 30% of the country that has the minority opinion.",
            "title_similarity": "0.7578018",
            "sentiment_compound": 0.5023
        },
        {
            "id": "hyv6n3f",
            "score": 1,
            "text": "https://youtu.be/4KVaNKq_zkc",
            "title_similarity": "0.14988339",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyv6ryi",
            "score": 1,
            "text": "Cool so which corporate board are we guillotining first?",
            "title_similarity": "0.49388638",
            "sentiment_compound": 0.3182
        },
        {
            "id": "hyv70rq",
            "score": 2,
            "text": "You needed a poll to figure that out?",
            "title_similarity": "0.30352414",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyv71wz",
            "score": 2,
            "text": "Straight greed.",
            "title_similarity": "0.19162121",
            "sentiment_compound": -0.2023
        },
        {
            "id": "hyv72a4",
            "score": 2,
            "text": "Because that's exactly what is causing it!",
            "title_similarity": "0.12444435",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyv7376",
            "score": 1,
            "text": "You can find poll to say it's depends on how it's done.",
            "title_similarity": "0.28625277",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyv79fm",
            "score": 2,
            "text": "Huh no shit.",
            "title_similarity": "-0.06263393",
            "sentiment_compound": 0.4449
        },
        {
            "id": "hyv7cvf",
            "score": 8,
            "text": "And nothing will be done",
            "title_similarity": "-0.0059198737",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyv7fuw",
            "score": 1,
            "text": "I'm honestly surprised at this one",
            "title_similarity": "0.11684702",
            "sentiment_compound": 0.5994
        },
        {
            "id": "hyv7gsh",
            "score": 1,
            "text": "Not exactly surprising.",
            "title_similarity": "-0.00064629223",
            "sentiment_compound": -0.2057
        },
        {
            "id": "hyv7h02",
            "score": 2,
            "text": "And so we should. Grocery stores saw profits soar during the pandemic and now they are gouging their customers out of greed!",
            "title_similarity": "0.6860082",
            "sentiment_compound": 0.126
        },
        {
            "id": "hyv7lby",
            "score": 1,
            "text": "The Corpratocracy built by the rich and politicians feeds off the exploitation of the masses.",
            "title_similarity": "0.7353623",
            "sentiment_compound": 0.5574
        },
        {
            "id": "hyv7ly7",
            "score": 1,
            "text": "Polls show the big orange red thing in the sky might be causing the heat.",
            "title_similarity": "0.49012336",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyv7sbk",
            "score": 1,
            "text": "Lol you can point directly at the political pressure on the fed to cut rates in 2017-2018 though, because that’s what forced unneeded free money into the system…",
            "title_similarity": "0.6439321",
            "sentiment_compound": -0.0516
        },
        {
            "id": "hyv7sg4",
            "score": 1,
            "text": " Pretty much!",
            "title_similarity": "-0.037839334",
            "sentiment_compound": 0.5411
        },
        {
            "id": "hyv7x6m",
            "score": 2,
            "text": "No shit?",
            "title_similarity": "-0.062478907",
            "sentiment_compound": 0.4449
        },
        {
            "id": "hyv7ypd",
            "score": 1,
            "text": "Corporate executives are the real enemy to capitalism.\n\nThey are slaves to greed and monopolizing.",
            "title_similarity": "0.7140939",
            "sentiment_compound": -0.7717
        },
        {
            "id": "hyv7zd6",
            "score": 2,
            "text": "We're not stupid,  we know.",
            "title_similarity": "-0.04796813",
            "sentiment_compound": 0.4168
        },
        {
            "id": "hyv8980",
            "score": 2,
            "text": "Walt Disney would be rolling in his grave.\n\nHe set out to make a park that anyone could enjoy. Equally.  That’s eroded over the years (some are more equal than others) but Disney used the pandemic to remove annual passes, make you pay extra (and pay extra extra in some cases) to have any chance of getting on a ride, admitted to making portion sizes smaller, *and* increased the prices of food, citing shortages.  The list goes on. Higher prices for less.\n\nAs a baker charging $8-9 for a pretzel is insane. Making it smaller, then increasing the cost to $10-11 extends beyond any change in the economy. \n\nIt’s just greed. \n\nThe problem is Disney has been posting record visits and record sales and their CEO is getting jerked off by investors.\n\nIt is, in large part, corporate greed.  We all have to stop giving them money.",
            "title_similarity": "0.60896015",
            "sentiment_compound": -0.9136
        },
        {
            "id": "hyv8h1g",
            "score": 2,
            "text": "Because that’s exactly what it is.",
            "title_similarity": "-0.042668168",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyv8hno",
            "score": 2,
            "text": "How the fuck are people just realizing this now lol",
            "title_similarity": "0.23853537",
            "sentiment_compound": -0.1779
        },
        {
            "id": "hyv8l2y",
            "score": 2,
            "text": "And rightly so!",
            "title_similarity": "-0.043162383",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyv8s5o",
            "score": 1,
            "text": "Gas is $5 a gallon where I live and There are like 3 refineries within 20 miles of me :/",
            "title_similarity": "0.43982148",
            "sentiment_compound": 0.0258
        },
        {
            "id": "hyv8swq",
            "score": 2,
            "text": "Well… who the fk else would it be?\n\nThe rich get richer and the poor get poorer",
            "title_similarity": "0.6351405",
            "sentiment_compound": 0.34
        },
        {
            "id": "hyv8szx",
            "score": 2,
            "text": "I'd agree too, but I never was asked to poll. Funny how normal citizens don't get asked these things. I also have seen declines in wages, despite increases in responsibilities at work. \"Absolutely no raise in the foreseeable future\" was the response from corporate, who is located in Norway, we are a US locates site. Funny how Norway gets a month off around July/ August...yet we only get 2 week off total, which includes sick days...",
            "title_similarity": "0.5649317",
            "sentiment_compound": 0.0938
        },
        {
            "id": "hyv8tc8",
            "score": 2,
            "text": "Not only that but companies use the economy as an excuse to take away benefits and pay. Then when things go back to normal don’t give them back",
            "title_similarity": "0.7149935",
            "sentiment_compound": 0.5023
        },
        {
            "id": "hyv921w",
            "score": 1,
            "text": "Hummm where you at? Everyone on Twitter is blaming Biden.",
            "title_similarity": "0.52148056",
            "sentiment_compound": -0.4939
        },
        {
            "id": "hyv96j1",
            "score": 1,
            "text": "Obviously. Inflation is just massive collusion.",
            "title_similarity": "0.6363175",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyv9iiy",
            "score": 2,
            "text": "Umm yea it’s true",
            "title_similarity": "-0.04279838",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hyv9kzn",
            "score": 1,
            "text": "Corporations should not own legislatures but they do. This is why Thomas Jefferson hated the Federalists.",
            "title_similarity": "0.59254265",
            "sentiment_compound": -0.7783
        },
        {
            "id": "hyv9lvx",
            "score": 2,
            "text": "It’s not just corporate profiteering. It’s low corporate tax rates, low progressive tax rates, and no wealth tax.\n\nWhy?\n\nShort explanation? It’s cheap to make more money than you need to.\n\nLong explanation. Without a penalty for hoarding profit, everything is effectively a zero sum game. I take from you to have more. With a higher set of taxes that only affect the rich, maximizing effective profit involves sharing the wealth.",
            "title_similarity": "0.6066079",
            "sentiment_compound": 0.9575
        },
        {
            "id": "hyv9pai",
            "score": 1,
            "text": "Looks like it's a good time to peg wages to inflation",
            "title_similarity": "0.5166439",
            "sentiment_compound": 0.6597
        },
        {
            "id": "hyv9pll",
            "score": 1,
            "text": "Where is the lie tho?",
            "title_similarity": "0.19799554",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyv9vm3",
            "score": 1,
            "text": "Everyone is watching Ukraine taking on a world superpower, we as people should use that as encouragement to take on corrupt government and the corporations that own them, either the play by the peoples rules or get the hell beaten out of them",
            "title_similarity": "0.60962063",
            "sentiment_compound": -0.4939
        },
        {
            "id": "hyv9wlk",
            "score": 1,
            "text": "I mean it definitely has something to do with it but so does the massive amount of money printed in the last couple years",
            "title_similarity": "0.50385654",
            "sentiment_compound": 0.2144
        },
        {
            "id": "hyv9ylo",
            "score": 1,
            "text": "Look I'm all for telling corporations who drive up prices to fuck right off but what this poll (and the comments here) actually show is that most Americans are morons who don't understand what inflation means and should take a basic economics class. The inflation we are seeing is caused by the absurdly immense amount of money printed and injected into the economy over the last several years by the fed.",
            "title_similarity": "0.84278107",
            "sentiment_compound": -0.6804
        },
        {
            "id": "hyva0rj",
            "score": 1,
            "text": "It's not. It's very much supply chain issues that are the majority of the inflation. Corporate profiteering is a factor but a small one, relative to supply chain.\n\nsource: work in manufacturing. Shipping costs are 3x or 4x higher than normal, shortages are driving up costs, labor costs have increased a lot, etc.",
            "title_similarity": "0.75762975",
            "sentiment_compound": 0.1154
        },
        {
            "id": "hyva1up",
            "score": 1,
            "text": "Record corporate profits can't happen if external forces are increasing the cost to produce good and services. \n\nIt's a companies raising prices due to the perception of inflation. \n\nIt's just another massive transfer of wealth to the top.",
            "title_similarity": "0.71996915",
            "sentiment_compound": 0.8689
        },
        {
            "id": "hyva36a",
            "score": 1,
            "text": "Poll shows corporate profiteers don't give a shit",
            "title_similarity": "0.6129732",
            "sentiment_compound": 0.5305
        },
        {
            "id": "hyva3z2",
            "score": 1,
            "text": "Ya got that right.",
            "title_similarity": "-0.043537464",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyva54b",
            "score": 1,
            "text": "When costs go up on corporations they raise prices to maintain the same profit margin. Things like transportation, employee benefits, regulations, cost of goods, etc all effect the consumer price. Less typical is profiteering or gouging. We have laws against this.",
            "title_similarity": "0.68688524",
            "sentiment_compound": 0.7693
        },
        {
            "id": "hyva5p5",
            "score": 1,
            "text": "That seems like such a millennial response. I literally have no idea what causes inflation but I can guarantee you it’s not as simple as corporate greed.",
            "title_similarity": "0.61930406",
            "sentiment_compound": -0.2263
        },
        {
            "id": "hyva7i2",
            "score": 1,
            "text": "Stock market fuck ups as well",
            "title_similarity": "0.57210296",
            "sentiment_compound": -0.34
        },
        {
            "id": "hyva813",
            "score": 1,
            "text": "We need a return of the trust-busting.  Biden, put on your Teddy Roosevelt hat and make it happen",
            "title_similarity": "0.3157233",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyvaaaz",
            "score": 1,
            "text": "Price hikes are generally half that of profits in most cooperations. \n\nPure profiteering.",
            "title_similarity": "0.7297673",
            "sentiment_compound": 0.2585
        },
        {
            "id": "hyvaab2",
            "score": 1,
            "text": "When dealing with the other % Please remember it’s best to say things like “wow can’t believe the price of x. I bet we can make some money off that stock cause there balance sheet looks amazing and look at those profits they posted, let’s see what that its worth….and hope for a logical adult",
            "title_similarity": "0.677979",
            "sentiment_compound": 0.9559
        },
        {
            "id": "hyvafgw",
            "score": 2,
            "text": "Dechra Phycox Soft Chews Joint Supplement for Dogs went up over 23 dollars in a under a year. I could understand a few dollars inflation after the years we've had but 23 more dollars out of left field... just highway robbery. It's no wonder people think a lot of the inflation if corporate greed.",
            "title_similarity": "0.66305506",
            "sentiment_compound": -0.7469
        },
        {
            "id": "hyvagpl",
            "score": 1,
            "text": "Correctly*",
            "title_similarity": "-0.025200382",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyvalaf",
            "score": 1,
            "text": "Class war now!",
            "title_similarity": "0.3526579",
            "sentiment_compound": -0.636
        },
        {
            "id": "hyvaltg",
            "score": 2,
            "text": "And they would be correct. My whole industries’ prices are going up next year, and I’ve been told the reason is, “we can”",
            "title_similarity": "0.43984863",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyvamzq",
            "score": 2,
            "text": "Bullshit. The majority of Americans blame Biden right now because they are ignorant about how inflation works and he’s in charge.",
            "title_similarity": "0.75110936",
            "sentiment_compound": -0.8074
        },
        {
            "id": "hyvans9",
            "score": 1,
            "text": "Blame Jerome Powell for experimenting with a new fed strategy in real time",
            "title_similarity": "0.48878",
            "sentiment_compound": -0.34
        },
        {
            "id": "hyvaobw",
            "score": 1,
            "text": "0% interest rates leading to higher housing prices\n+ labor shortage leading to higher wages \n+ disrupted supply chain leading to shortage of goods \n+ \"get mine\" greed \n= inflation\n\nCorporate profiteering is a part of the equation.  But if it were that alone, other corporations would undercut their competitor.  There is a supply vs demand imbalance right now.",
            "title_similarity": "0.76818913",
            "sentiment_compound": -0.5994
        },
        {
            "id": "hyvaoll",
            "score": 2,
            "text": "That's good because that is one of the main reasons such things happen.",
            "title_similarity": "0.17170343",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hyvaq4o",
            "score": 1,
            "text": "The funny thing is even the White House’s economists are torn on this talking point.  They are very leery of blaming corporations because corps will front run inflation to maintain there some profit in the inflated state. \n\nhttps://www.washingtonpost.com/us-policy/2022/02/17/white-house-inflation-corporations/",
            "title_similarity": "0.76186836",
            "sentiment_compound": 0.0865
        },
        {
            "id": "hyvaqn9",
            "score": 1,
            "text": "Here’s a better headline- Pole shows majority of US voters blame corporate profiteering for inflation- THEY WOULD BE RIGHT",
            "title_similarity": "0.9033908",
            "sentiment_compound": -0.0258
        },
        {
            "id": "hyvaqr4",
            "score": 1,
            "text": "Duh.",
            "title_similarity": "-0.038640954",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyvarvx",
            "score": 1,
            "text": "How dare we blame those responsible",
            "title_similarity": "0.3711601",
            "sentiment_compound": -0.0258
        },
        {
            "id": "hyvb2jm",
            "score": 1,
            "text": "Fucking duh?\n\nEdit: Its my fault, I leave a  light on all night. And a fan. Sorry. Sorry, for my Canadian friends ,eh.",
            "title_similarity": "0.40939766",
            "sentiment_compound": 0.2263
        },
        {
            "id": "hyvb3s5",
            "score": 1,
            "text": "Who’s gonna tell em?",
            "title_similarity": "0.039627448",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyvb4yh",
            "score": 1,
            "text": "ThE fEdErAl ReSeRvE iS iNnOcEnT.",
            "title_similarity": "0.23377228",
            "sentiment_compound": 0.34
        },
        {
            "id": "hyvb5yn",
            "score": 1,
            "text": "How come I never get included in these “polls”",
            "title_similarity": "0.27759963",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyvb7f9",
            "score": 1,
            "text": "Opinion polls measure the public’s satisfaction with its ignorance - not my quote\n\n Throwing all that cash in to a situation where profiteering was already off the charts may have not helped especially since very little got to those who needed it",
            "title_similarity": "0.57992077",
            "sentiment_compound": -0.0516
        },
        {
            "id": "hyvb8a9",
            "score": 2,
            "text": "No shit",
            "title_similarity": "-0.06254359",
            "sentiment_compound": 0.4449
        },
        {
            "id": "hyvbbv1",
            "score": 1,
            "text": "Uh. So it has nothing to do with the trillions of dollars printed over the past two years?",
            "title_similarity": "0.4274232",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyvbcg7",
            "score": 1,
            "text": "About time",
            "title_similarity": "-0.036490005",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyvbcp2",
            "score": 1,
            "text": "Excellent understanding of supply and demand.",
            "title_similarity": "0.15030953",
            "sentiment_compound": 0.4939
        },
        {
            "id": "hyvbi61",
            "score": 2,
            "text": "This is because the American people have finally awoken to the obvious truth that corporations with the help of our government have exponentially increased their power, wealth, and greed to such an extent that the 99% have become nothing more than cattle to them!",
            "title_similarity": "0.6113227",
            "sentiment_compound": 0.784
        },
        {
            "id": "hyvbivp",
            "score": 1,
            "text": "We all know that Volcker destroyed corporate greed, but then after Covid it suddenly resurfaced 😳",
            "title_similarity": "0.69812775",
            "sentiment_compound": -0.4497
        },
        {
            "id": "hyvbj46",
            "score": 1,
            "text": "Mild shock.\nAnd each year is a record-profits year for the biggest ones.",
            "title_similarity": "0.5666467",
            "sentiment_compound": -0.3818
        },
        {
            "id": "hyvblsh",
            "score": 1,
            "text": "No, corporations are good. Look at Facebook and twitter and CNN and Fox news. Without those corporations charging for their services how would we know what we think?",
            "title_similarity": "0.5585034",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hyvbpla",
            "score": 1,
            "text": "Well, when they all report historically high profits….",
            "title_similarity": "0.46726906",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hyvbtuj",
            "score": 1,
            "text": "Poll shows majority of Americans have no idea how the economy works.",
            "title_similarity": "0.7312597",
            "sentiment_compound": -0.296
        },
        {
            "id": "hyvbuae",
            "score": 1,
            "text": "In capitalism every opportunity is taken advantage by big corporations",
            "title_similarity": "0.5761776",
            "sentiment_compound": 0.5859
        },
        {
            "id": "hyvbx7s",
            "score": 1,
            "text": "[deleted]",
            "title_similarity": "0.14869753"
        },
        {
            "id": "hyvbydy",
            "score": 1,
            "text": "Disney.",
            "title_similarity": "0.061871186",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyvbyhb",
            "score": 1,
            "text": "Whilst corporations are capitalizing...the Fed printing trillions over the last two years and artificially keeping interest rates low are to blame.  Don't get me wrong, the corporations are effing us over by increasing profits without increasing wages but because it all starts with the Fed and the manipulation of the market.",
            "title_similarity": "0.7980253",
            "sentiment_compound": -0.0831
        },
        {
            "id": "hyvbzri",
            "score": 1,
            "text": "I’ve never heard of this pollster.",
            "title_similarity": "0.16551748",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyvc18v",
            "score": 1,
            "text": "Big Legume, Big Oat and Big Soy would never do this. Say begone to Big subsidized dairy and meat and hello no cholesterol alternatives. Reduce the risk of having a widow maker",
            "title_similarity": "0.45456094",
            "sentiment_compound": -0.5106
        },
        {
            "id": "hyvc1kj",
            "score": 1,
            "text": "No shit",
            "title_similarity": "-0.06254359",
            "sentiment_compound": 0.4449
        },
        {
            "id": "hyvc2l7",
            "score": 1,
            "text": "In a system where profits MUST increase every year, artificial inflation is a part of the business model.",
            "title_similarity": "0.6715958",
            "sentiment_compound": 0.6369
        },
        {
            "id": "hyvc3rr",
            "score": 2,
            "text": "It’s that but also the fact that the government just printed like $4 trillion or something. Hmmm where else have they just printed a lot of money?? We just print million dollar bills and then everyone can be a millionaire",
            "title_similarity": "0.696802",
            "sentiment_compound": 0.5588
        },
        {
            "id": "hyvc47o",
            "score": 1,
            "text": "But,but,but the newstation owned by a corporation is telling me otherwise?!?!",
            "title_similarity": "0.5648693",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyvc6s4",
            "score": 1,
            "text": "There were record breaking profits this past year in the US economy and corporate America has the audacity to tell us there's a labor shortage and record inflation. I just took a 2% raise today, which in reality means I took a 5-8% paycut compared to last year.",
            "title_similarity": "0.6694749",
            "sentiment_compound": 0.2263
        },
        {
            "id": "hyvc9vo",
            "score": 1,
            "text": "I'm no economist... but when a widget costs $1 to make and sells for $2, then all a sudden it costs $1 to make but sells for $10.... that's not inflation. That's price gouging.",
            "title_similarity": "0.5751661",
            "sentiment_compound": -0.1531
        },
        {
            "id": "hyvcarf",
            "score": 1,
            "text": "They are laying the blame in the correct spots as well. The reserve banks bailed out corporations, corporations bought their own stock back. Then we have PPP which was a scheme to send American wealth to all the business owners in America while everyone else got 2k or less. We also had the reserve bank doing STRANGE things on the open market. Surprisingly the crowd is almost right on here.",
            "title_similarity": "0.7827331",
            "sentiment_compound": 0.3751
        },
        {
            "id": "hyvcglh",
            "score": 1,
            "text": "So when you flood the system with money like we have over the last two years it devalues the currency and makes prices increase…..and also corporate profiteering…definitely that too.",
            "title_similarity": "0.76241994",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hyvcgsj",
            "score": 1,
            "text": "nothing to do with all that freshly printed c19 money...",
            "title_similarity": "0.35607576",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyvchh5",
            "score": 1,
            "text": "Let’s not forget about the fed of course",
            "title_similarity": "0.3334488",
            "sentiment_compound": 0.1695
        },
        {
            "id": "hyvci8r",
            "score": 1,
            "text": "Which is oddly accurate. Rare for most of these polls.",
            "title_similarity": "0.29065135",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyvcl7v",
            "score": 1,
            "text": "But the guy at the gas station said it was “Brandon’s fault” 🙄🙄🙄",
            "title_similarity": "0.51856947",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyvcm6d",
            "score": 1,
            "text": "There's no connection whatsoever to the sudden rise in interest rates and companies reporting record profits year over year \n\n/s",
            "title_similarity": "0.59532475",
            "sentiment_compound": 0.5719
        },
        {
            "id": "hyvcnpi",
            "score": 1,
            "text": "ive just stopped buying things, dont have the money too any longer",
            "title_similarity": "0.39765394",
            "sentiment_compound": -0.2263
        },
        {
            "id": "hyvcpre",
            "score": 2,
            "text": "Yeah, no shit. I just read a NY Times article about how corporations were \"bragging about record profits\" right now, despite inflation. They're just capitalizing on it. These people only care about money and would let you starve to squeeze an extra percentage point on their balance sheet.",
            "title_similarity": "0.7594701",
            "sentiment_compound": 0.8087
        },
        {
            "id": "hyvcqbs",
            "score": 1,
            "text": "But no blame on the egregious spending in congress? \n\nYeah, and you wonder why our political system is so astronomically messed up.\n\nAlso, absolute fucking LOL to the armchair economists in this thread.",
            "title_similarity": "0.7357317",
            "sentiment_compound": 0.795
        },
        {
            "id": "hyvcqj7",
            "score": 1,
            "text": "If this is accurate, then I applaud it.  Finally some sense is coming into the voters heads. \n\nBut, I have doubt it will translate at the polls.",
            "title_similarity": "0.37740853",
            "sentiment_compound": -0.3071
        },
        {
            "id": "hyvcr4j",
            "score": 1,
            "text": "Fed just needs to print more money. That’ll stop inflation.",
            "title_similarity": "0.51260066",
            "sentiment_compound": -0.3535
        },
        {
            "id": "hyvcrgr",
            "score": 1,
            "text": "Poll finds even the dumb are right once in a while.",
            "title_similarity": "0.37285215",
            "sentiment_compound": -0.5106
        },
        {
            "id": "hyvctf4",
            "score": 1,
            "text": "So, is the country going to apologize to Joy Behar for pointing this out long ago?",
            "title_similarity": "0.50054955",
            "sentiment_compound": 0.6369
        },
        {
            "id": "hyvctyo",
            "score": 1,
            "text": "Not saying it isnt a big factor but our recent spending has certainly contributed.",
            "title_similarity": "0.31321436",
            "sentiment_compound": 0.4767
        },
        {
            "id": "hyvcuj4",
            "score": 1,
            "text": "Nonono we’re not “blaming them”. We KNOW it’s them. We want justice.",
            "title_similarity": "0.17866546",
            "sentiment_compound": 0.5719
        },
        {
            "id": "hyvcv8g",
            "score": 1,
            "text": "Well we're certainly not going to blame it on ourselves.",
            "title_similarity": "0.10110805",
            "sentiment_compound": 0.6742
        },
        {
            "id": "hyvcvvd",
            "score": 1,
            "text": "[This is true](https://cdn.discordapp.com/attachments/446834571674386434/948067670312493066/unknown.png)",
            "title_similarity": "0.16330194",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyvcwbt",
            "score": 1,
            "text": "Really? It's the corporations?\n\nThat's funny for some reason people keep telling me that it's the caravans of illegal immigrants, or China, or Biden... I wonder why no one ever gets on the podium and blames the corporations....\n\n/s",
            "title_similarity": "0.6643866",
            "sentiment_compound": -0.7149
        },
        {
            "id": "hyvcwxv",
            "score": 1,
            "text": "Fuck Joe Biden",
            "title_similarity": "0.27612036",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hyvcxb8",
            "score": 1,
            "text": "No shit. We’ll then turn around and a portion of the majority will vote in the same people to office for yet another term",
            "title_similarity": "0.436606",
            "sentiment_compound": 0.4449
        },
        {
            "id": "hyvd0pg",
            "score": 2,
            "text": "Record profits! \n\nSorry we have to raise prices and lower wages in these trying times.",
            "title_similarity": "0.65289253",
            "sentiment_compound": 0.1759
        },
        {
            "id": "hyvd471",
            "score": 1,
            "text": "What gave it away?  Was it all the companies posting record profits?  Cuz that was my first clue....",
            "title_similarity": "0.62749267",
            "sentiment_compound": 0.504
        },
        {
            "id": "hyvd5cg",
            "score": 1,
            "text": "\"Supply chain issues\"",
            "title_similarity": "0.23298335",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyvd7ki",
            "score": 1,
            "text": "In other news, water is wet.",
            "title_similarity": "0.151414",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyvd8jx",
            "score": 1,
            "text": "Only 80% of voters?  So 20% of our country is simply blind to reality?  Thats a far lower number than I expected since 48% of the country voted for Trump.",
            "title_similarity": "0.6735053",
            "sentiment_compound": -0.6072
        },
        {
            "id": "hyvd9up",
            "score": 1,
            "text": "Walmart is guilty of that. Don’t speak for the brand or the company. I’m there to collect a paycheck and leave",
            "title_similarity": "0.5020949",
            "sentiment_compound": -0.4588
        },
        {
            "id": "hyvdav2",
            "score": 1,
            "text": "Polls also show we will have more of the same until the feudalism takes another different form",
            "title_similarity": "0.33702958",
            "sentiment_compound": -0.2263
        },
        {
            "id": "hyvdfzr",
            "score": 1,
            "text": "Then the majority don’t know what they are talking about! What is even the point of this?\n\n“Most people think the sky is purple, poll shows”\n\nOk... it’s not",
            "title_similarity": "0.48363313",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyvdhky",
            "score": 1,
            "text": "capitalism is a system built on greed thats going to die a violent death",
            "title_similarity": "0.63594764",
            "sentiment_compound": -0.9371
        },
        {
            "id": "hyvdhtw",
            "score": 1,
            "text": "Holy shit I definitely know the price of a gallon of milk in a whole lot of different places after breezing through dozens of comments!",
            "title_similarity": "0.4405302",
            "sentiment_compound": -0.2942
        },
        {
            "id": "hyvdlqw",
            "score": 1,
            "text": "And they would be right",
            "title_similarity": "-0.064408764",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyvdm6a",
            "score": 1,
            "text": "I agree with this Publix super market change has just run prices up to crazy levels because they knew they could drive higher prices during covid while people weren’t eating out as much.. now they prices are parked at this insanely artificial level",
            "title_similarity": "0.67481387",
            "sentiment_compound": 0.6124
        },
        {
            "id": "hyvdnpl",
            "score": 2,
            "text": "The worst part is that regular people ALL notice it, and we support legislation that could reign in price gouging, yet our representatives do little to nothing to fix things. There’s the outcast politicians (ie Bernie Sanders, AOC) who notice we are screaming for corporations to be reigned in for all our benefits, but a majority of them toe the line with keeping status quo (and of course getting big donations from lobbying groups and companies)",
            "title_similarity": "0.69091153",
            "sentiment_compound": -0.2846
        },
        {
            "id": "hyvdq2e",
            "score": 1,
            "text": "Would that be the same 60% that has 48% representation in the Senate?",
            "title_similarity": "0.39083242",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyvdqpx",
            "score": 2,
            "text": "I sell appliances, and there are some higher end brands that enforce pricing minimums. Several of them have had 3 prices increases in the last 6 months.",
            "title_similarity": "0.52627516",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyvdxva",
            "score": 1,
            "text": "Most Americans are correct in this.",
            "title_similarity": "0.2979939",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyve1pd",
            "score": 2,
            "text": "Good to know people are getting smarter!  Maybe we can be even smarter and not vote for either of the two stupid parties!!",
            "title_similarity": "0.3907272",
            "sentiment_compound": 0.8433
        },
        {
            "id": "hyve1w4",
            "score": 2,
            "text": "Just paid $4.10/gal and $65 to fill up my gas tank. While the companies that are giving me this fuel walk away with billions of dollars.",
            "title_similarity": "0.6849305",
            "sentiment_compound": 0.34
        },
        {
            "id": "hyve4v9",
            "score": 1,
            "text": "BREAKING NEWS: The color red is red",
            "title_similarity": "0.48206058",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyve5l8",
            "score": 2,
            "text": "Corporate greed and the gullibility of consumers who let themselves and their purchasing be controlled by Madison Avenue telling us what we absolutely need to feel good about ourselves, to impress others, to matter. We used to call it keeping up with the Joneses, a made-up family that never existed. $200 for a pair of sneakers that you just must have because some athlete promotes them? $300 Levis? A $50,000 car because your class reunion is next week? Out of control inflation is just as much our fault as it is the fault of corporations and CEO's.",
            "title_similarity": "0.6938337",
            "sentiment_compound": -0.4479
        },
        {
            "id": "hyve989",
            "score": 1,
            "text": "They don't blame the banks?  What the fuck are they learning in school there?",
            "title_similarity": "0.3826495",
            "sentiment_compound": -0.4261
        },
        {
            "id": "hyve9ze",
            "score": 1,
            "text": "I am sure US politicians will do a lot about corporate profiteering ^being ^noticeable now.",
            "title_similarity": "0.64917445",
            "sentiment_compound": 0.1779
        },
        {
            "id": "hyveae3",
            "score": 1,
            "text": "Green hair big red flag",
            "title_similarity": "0.20883381",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyvebfc",
            "score": 1,
            "text": "Y’all will still buy anything they put out anyway.",
            "title_similarity": "0.20956269",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyvebg2",
            "score": 1,
            "text": "Is this new? Greed is the word.",
            "title_similarity": "0.4355753",
            "sentiment_compound": -0.4019
        },
        {
            "id": "hyvec0d",
            "score": 1,
            "text": "Lol, that's not how inflation works, you sillies.",
            "title_similarity": "0.33678094",
            "sentiment_compound": 0.5574
        },
        {
            "id": "hyvee1c",
            "score": 1,
            "text": "So inflation is caused by printing more money, right? So wouldn't increases in corporate tax and billionaire tax bring more money into circulation?",
            "title_similarity": "0.69966656",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyveeq4",
            "score": 2,
            "text": "Haha no they don’t.",
            "title_similarity": "-0.04652592",
            "sentiment_compound": 0.2023
        },
        {
            "id": "hyvefpc",
            "score": 2,
            "text": "Good. They're right.",
            "title_similarity": "-0.06682488",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hyvejmg",
            "score": 1,
            "text": "Where are all the douchebags that keep putting “I did this” stickers all over everything?",
            "title_similarity": "0.49146172",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyvelah",
            "score": 2,
            "text": "When max profits are being made and they are not “trickling down”, yeah, not a far stretch to call bullsh*t on that.",
            "title_similarity": "0.41108596",
            "sentiment_compound": 0.2528
        },
        {
            "id": "hyvelh9",
            "score": 1,
            "text": "Correct\n\nHealthcare",
            "title_similarity": "0.0035163425",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyvepdd",
            "score": 1,
            "text": "Holy shit, it's not often that the majority are right about this sort of thing until a few years after the studies come out.",
            "title_similarity": "0.35183802",
            "sentiment_compound": -0.5574
        },
        {
            "id": "hyvesj4",
            "score": 1,
            "text": "The reality shows this anyway. They've made record profits yet still raise the prices on stuff that wouldn't even need to be. Without regulations passing, things won't be stable forever.",
            "title_similarity": "0.5657451",
            "sentiment_compound": 0.2528
        },
        {
            "id": "hyveswy",
            "score": 1,
            "text": "Reality strikes again!!! And I would have gotten away with it too!! If it wasn't for you meddling reality!!.... Who we kidding they totally getting away with it.",
            "title_similarity": "0.40679854",
            "sentiment_compound": -0.5053
        },
        {
            "id": "hyveu5q",
            "score": 1,
            "text": "Well now, this is news.  \n\nPeople believing the truth.",
            "title_similarity": "0.24223286",
            "sentiment_compound": 0.5267
        },
        {
            "id": "hyvew7d",
            "score": 1,
            "text": "That’s not what the question says.",
            "title_similarity": "0.022649188",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyvf2tx",
            "score": 1,
            "text": "Because it is. It is a cash grab 100%. Wait until they find out Citadel the biggest market maker in U.S. stocks has 87% of their portfolio in derivatives. Literally a gamble. The most since 2008. They will make billions on a market crash caused by them because they are also a hedge fund. Imagine supplying a market while also betting on one. All those 401k plans will be dramatically reduced to ash while they get rich. Biggest pump and dump coming ever. Markets will either burn to the ground from here or hit all time highs then burn. Either way the working force will pay for all these bad bets while institutions get rich. You ain't seen nothing yet.",
            "title_similarity": "0.7541083",
            "sentiment_compound": -0.25
        },
        {
            "id": "hyvf4hh",
            "score": 1,
            "text": "I mean technically, yes?  I have a hard time believing though that most people know how politicians are essentially just working for corporations, and still have the gall to say it's just the corporations responsible.",
            "title_similarity": "0.6944622",
            "sentiment_compound": 0.5574
        },
        {
            "id": "hyvf994",
            "score": 1,
            "text": "Didn’t need a poll to know that",
            "title_similarity": "0.06336069",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyvfad8",
            "score": 1,
            "text": "I don’t like inflation either, but this is what happens in a capitalistic society.  The bottom line is what investors tell corporations look at and our government supports that.",
            "title_similarity": "0.6624689",
            "sentiment_compound": 0.6124
        },
        {
            "id": "hyvfaqf",
            "score": 1,
            "text": "They would be right….",
            "title_similarity": "-0.054288477",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyvff3c",
            "score": 1,
            "text": "As for what’s in it for us.",
            "title_similarity": "0.04149883",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyvfl5e",
            "score": 2,
            "text": "I mean, we know it's not because they increased the quality of their products or are paying their employees a fair wage with benefits. So, yeah, purely for profit is basically the only other option.",
            "title_similarity": "0.52518886",
            "sentiment_compound": 0.8159
        },
        {
            "id": "hyvflty",
            "score": 1,
            "text": "Hahah bring it to an election, and your moronic poll will be rejected by normal people. \n\nCorporations equal evil. They don't understand inflation.\n\nWhat about middle sized employers who want to grow, and provide affordable prices challenging large retailers?\n\nThe only reason they want to grow is because they are oppressive, and can't understand basic economics. Not because they want to hire the unemployed, or open spots to those who would advance from it.\n\nTypical progressive socialist idiots.\n\nBring the comments.",
            "title_similarity": "0.69956064",
            "sentiment_compound": -0.9205
        },
        {
            "id": "hyvfm8b",
            "score": 1,
            "text": "So what are we going to do?",
            "title_similarity": "-0.042246412",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyvfpce",
            "score": 1,
            "text": "Well that’s because it’s true.",
            "title_similarity": "-0.01146486",
            "sentiment_compound": 0.5994
        },
        {
            "id": "hyvfqm9",
            "score": 1,
            "text": "This isn't true though. The economy is an eco system. Just look at the wage inflation data. \n\nThese topics do not help the conversation. Frankly, people should be less involved in these conversations. It would be better for America if everyone wasn't talking about politics, the economy, and everything else as if they actually know.\n\nPeople who spend their lives on this still know full well \"the economy\" is a complex adaptive system, and we have little more than best guesses on how things will work out.",
            "title_similarity": "0.64945656",
            "sentiment_compound": 0.6833
        },
        {
            "id": "hyvfr3o",
            "score": 1,
            "text": "The US has blocked potatoes from Canada to the US due to some issue. So you think potatoes are cheaper within Canada for say potato chips. Nope, in January two bags used to be $7, now $8. 2 twelve packs of diet coke, regular $10, now $11. 12% increase on a market item we are flush with, fuck off.",
            "title_similarity": "0.6289426",
            "sentiment_compound": -0.5106
        },
        {
            "id": "hyvfrrc",
            "score": 1,
            "text": "Btw Ace Hardware increased its profits by almost 70% over the past two years",
            "title_similarity": "0.4406414",
            "sentiment_compound": 0.6124
        },
        {
            "id": "hyvfu73",
            "score": 1,
            "text": "Inflation isn’t just from government and corporate choices. With the pandemic, multiple natural disasters, and climate change, there really is less supply of everything. Now add a war between major powers to the mix and the scarcity will make prices rise even higher.",
            "title_similarity": "0.7198305",
            "sentiment_compound": -0.7184
        },
        {
            "id": "hyvfvkg",
            "score": 1,
            "text": "If the market will bear it, they will charge it.",
            "title_similarity": "0.42423105",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyvfwpo",
            "score": 1,
            "text": "Graham Stephan just posted a YouTube video detailing his coffee company’s costs rising, pretty insightful to our current situation.",
            "title_similarity": "0.51172",
            "sentiment_compound": 0.4939
        },
        {
            "id": "hyvg0q1",
            "score": 1,
            "text": "We should be getting Mr. Mom right now. But instead we get a widespread collection of Gordon Gekkos from every angle.",
            "title_similarity": "0.3936159",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyvg1ab",
            "score": 1,
            "text": "People are smart",
            "title_similarity": "0.0420732",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hyvg7l1",
            "score": 1,
            "text": "Absolutely right.  Don’t forget about Oil and Gas producers.  They are not pumping to capacity, they are making profits off our backs.",
            "title_similarity": "0.6185007",
            "sentiment_compound": 0.1372
        },
        {
            "id": "hyvg83h",
            "score": 1,
            "text": "Is Inflation caused by corporations for being greedier  (Spolier alert they were always greedy)\n\nOr is it caused by the government handing out money while productivity was lowered.  Leading to the classic case of more money chasing less goods and services.",
            "title_similarity": "0.804942",
            "sentiment_compound": -0.5574
        },
        {
            "id": "hyvg8c6",
            "score": 1,
            "text": "The Biden Administration has known about corporate price gouging for months. Biden needs to call a press conference and call it out.",
            "title_similarity": "0.6042788",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyvgahm",
            "score": 1,
            "text": "They aren’t wrong",
            "title_similarity": "-0.08607133",
            "sentiment_compound": -0.4767
        },
        {
            "id": "hyvgari",
            "score": 1,
            "text": "100% polling taken from the town of Nincompoop.",
            "title_similarity": "0.37787598",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyvgck5",
            "score": 1,
            "text": "“Poll Shows Majority of US Voters Recognize the Obvious”. Fixed it",
            "title_similarity": "0.5543647",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyvgcnb",
            "score": 1,
            "text": "Funny how corporate media will never report on it.",
            "title_similarity": "0.2901261",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hyvge8b",
            "score": 1,
            "text": "It's funny how people understand the concept of Bitcoin and why it's value is related to the fact you can't just print more.\n\nYet somehow printing money isn't viewed as why money is devalued",
            "title_similarity": "0.5122446",
            "sentiment_compound": 0.6486
        },
        {
            "id": "hyvgeb3",
            "score": 1,
            "text": "Most Americans are idiots",
            "title_similarity": "0.56259084",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyvgemf",
            "score": 1,
            "text": "The Great state of Texas, USA is forecasting an additional $3.5B in tax revenue from oil & gas attribute to price increases\n\nCorporations aren't the only entities hitting record numbers.",
            "title_similarity": "0.63808113",
            "sentiment_compound": 0.6249
        },
        {
            "id": "hyvgey2",
            "score": 3,
            "text": "Well then the majority of US voters are wrong because that’s not the core reason for it.",
            "title_similarity": "0.56331885",
            "sentiment_compound": -0.25
        },
        {
            "id": "hyvgfpz",
            "score": 3,
            "text": "Idiots abound.",
            "title_similarity": "0.30439526",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyvgfse",
            "score": 1,
            "text": "Anyone else on here with a degree in economics?  I’d love to chat with someone who understands economic principles.  It’s so rare on this sub.",
            "title_similarity": "0.4195456",
            "sentiment_compound": 0.6369
        },
        {
            "id": "hyvghi5",
            "score": 2,
            "text": "Could've read, \"Poll Shows Truth.\"",
            "title_similarity": "0.2585536",
            "sentiment_compound": 0.3182
        },
        {
            "id": "hyvgiou",
            "score": 1,
            "text": "In other news, majority of U.S. Voters blame rain clouds for increased precipitation.",
            "title_similarity": "0.75976694",
            "sentiment_compound": -0.0772
        },
        {
            "id": "hyvgqxn",
            "score": 1,
            "text": "Ok, but isn’t that the reason?",
            "title_similarity": "0.06258784",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyvgtox",
            "score": 1,
            "text": "The gaslighting is working.",
            "title_similarity": "0.12406575",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyvgu6t",
            "score": 1,
            "text": "Shocker….majority of US voters aren’t very bright!",
            "title_similarity": "0.54289937",
            "sentiment_compound": 0.54
        },
        {
            "id": "hyvgvmx",
            "score": 1,
            "text": "so tired of these polls that ask 600 people in new york and call it “the majority of Americans” talk to anyone on the street and they won’t be able to explain what inflation is",
            "title_similarity": "0.64325964",
            "sentiment_compound": -0.4927
        },
        {
            "id": "hyvgxwx",
            "score": 1,
            "text": "Majority of Americans are incorrect.",
            "title_similarity": "0.5337578",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyvgye7",
            "score": 1,
            "text": "Well... Yes.\n\nInflation shouldn't be a thing.",
            "title_similarity": "0.28663772",
            "sentiment_compound": 0.5859
        },
        {
            "id": "hyvgywi",
            "score": 1,
            "text": "Well it certainly ain't the trickle-downs",
            "title_similarity": "0.053146426",
            "sentiment_compound": 0.5423
        },
        {
            "id": "hyvgyzl",
            "score": 2,
            "text": "That is so typical of the gouging, greed, and gluttony of the wealthy Oligarchs that take advantage of the middle and poor classes all the while not paying their fair share of taxes. But more disgusting is the fact that a huge portion of the middle class and poor vote for politicians that have their hands in their pockets.",
            "title_similarity": "0.7756231",
            "sentiment_compound": -0.8303
        },
        {
            "id": "hyvgzb5",
            "score": 1,
            "text": "ITT: people with a tenuous grasp of basic economics",
            "title_similarity": "0.3937595",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyvh0bi",
            "score": 1,
            "text": "Majority of voters are smart ? No way I call bologna",
            "title_similarity": "0.49403",
            "sentiment_compound": 0.128
        },
        {
            "id": "hyvh166",
            "score": 1,
            "text": "So the world shutting down and production stopping didn’t impact the supply at all? Governments printing record amounts of money didn’t have anything to do with inflation?",
            "title_similarity": "0.46381465",
            "sentiment_compound": -0.2406
        },
        {
            "id": "hyvh23x",
            "score": 1,
            "text": "Not printing shit loads of bills?",
            "title_similarity": "0.46353638",
            "sentiment_compound": 0.4449
        },
        {
            "id": "hyvh541",
            "score": 1,
            "text": "Majority of people are fucking dumb. like embarrassingly so.",
            "title_similarity": "0.48372754",
            "sentiment_compound": -0.5829
        },
        {
            "id": "hyvh5el",
            "score": 1,
            "text": "Duh!!!",
            "title_similarity": "-0.007826277",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyvha7j",
            "score": 1,
            "text": "Title should be : \"Majority of US Voters *Have Figured Out* Corporate Profiteering is to Blame for Inflation.\"",
            "title_similarity": "0.9390584",
            "sentiment_compound": -0.4588
        },
        {
            "id": "hyvhc4s",
            "score": 1,
            "text": "Poll shows the floor is made of floor",
            "title_similarity": "0.19309555",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyvhdzk",
            "score": 1,
            "text": "Because they are paying attention.",
            "title_similarity": "-0.03937236",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyvhfz7",
            "score": 1,
            "text": "People who didn't vote on poll. NO SHIT",
            "title_similarity": "0.2654503",
            "sentiment_compound": 0.4449
        },
        {
            "id": "hyvhigv",
            "score": 1,
            "text": "Besides necessities stop fucking buying shit. We can blame corporations all we we want but we are still the dumbasses buying new cars & houses, dumb amounts of junk food and soda. You get my point. I give it maybe 5 more years and the middle class won’t even exist anymore. Hardly does now, just the rich and the poor.",
            "title_similarity": "0.6792456",
            "sentiment_compound": -0.8068
        },
        {
            "id": "hyvhj98",
            "score": 1,
            "text": "Yea I bet it’s just the corporate CEOs trying to keep there million dollar paychecks the same.",
            "title_similarity": "0.63835293",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyvhjht",
            "score": 1,
            "text": "Bullshit, this inflation is due to governments high spending. Corporations are profiting off it too, but this is a policy matter.",
            "title_similarity": "0.7237537",
            "sentiment_compound": -0.1154
        },
        {
            "id": "hyvhjxd",
            "score": 1,
            "text": "Duh. Bernie has been saying it for years.",
            "title_similarity": "0.15196857",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyvho12",
            "score": 1,
            "text": "Citadel and other scumbag hedge funds who went on a shorting spree without getting caught until last year are the ones to blame",
            "title_similarity": "0.6426817",
            "sentiment_compound": -0.765
        },
        {
            "id": "hyvhpdx",
            "score": 1,
            "text": "Prices go up but they don't go down.",
            "title_similarity": "0.17627591",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyvhs64",
            "score": 2,
            "text": "Repeal the Trump tax cuts",
            "title_similarity": "0.5907941",
            "sentiment_compound": -0.296
        },
        {
            "id": "hyvhwng",
            "score": 1,
            "text": "I don’t really trust majority of Americans opinions. Sure it’s good to know when running a campaign. But I feel like inflation is way more to deal with Covid shutting down trade and factories and supply chains for a long time.",
            "title_similarity": "0.75043404",
            "sentiment_compound": 0.799
        },
        {
            "id": "hyvhy8s",
            "score": 1,
            "text": "Who would ever look at all of the evidence of corporate greed and profiteering and come to that conclusion? They need to pull themselves up by their bootstraps!",
            "title_similarity": "0.66032463",
            "sentiment_compound": -0.5562
        },
        {
            "id": "hyvi08i",
            "score": 1,
            "text": "Sad because inflation us usually caused byomey supply,  ak goverment monetary policies. Still hate the corrupted governments bailing out the huge companies. 😒",
            "title_similarity": "0.74251235",
            "sentiment_compound": -0.6705
        },
        {
            "id": "hyvi12y",
            "score": 1,
            "text": "A deceitful society would try to blame the consumer for living in it. How do we make greed boring?",
            "title_similarity": "0.64536023",
            "sentiment_compound": -0.8519
        },
        {
            "id": "hyvi1hk",
            "score": 1,
            "text": "There must be some collusion going on to keep those prices high, and corporate can do it because any trace of small business competition was eradicated by lockdowns that didn't apply to large corporations.",
            "title_similarity": "0.64757097",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyvi1yz",
            "score": 1,
            "text": "Can someone explain to me why it’s not all the extra money that’s been printed out over the last year or two?",
            "title_similarity": "0.5197857",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyvi2v0",
            "score": 1,
            "text": "No fucking shit",
            "title_similarity": "-0.025329156",
            "sentiment_compound": 0.254
        },
        {
            "id": "hyvi3op",
            "score": 1,
            "text": "Or the fact that we printed Trillions of dollars from thin air might have something to do with it.",
            "title_similarity": "0.5896283",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyvibeg",
            "score": 2,
            "text": "I find it hilarious that people who sell PS5s for extra money are demonized but corporations aren't",
            "title_similarity": "0.57732224",
            "sentiment_compound": 0.2144
        },
        {
            "id": "hyvids6",
            "score": 2,
            "text": "Higher prices without higher profits is inflation.\nHigher prices with higher profits is anticompetitive corrupt opportunistic bullshit.",
            "title_similarity": "0.6081263",
            "sentiment_compound": -0.5277
        },
        {
            "id": "hyvih9c",
            "score": 1,
            "text": "Same old story: Government gets blamed for inflation.\nGovernment blames corporations rather than solving the problem.\nProblem #1 reduce gas prices: open up the Keystone pipeline.",
            "title_similarity": "0.750065",
            "sentiment_compound": -0.8316
        },
        {
            "id": "hyvikk1",
            "score": 2,
            "text": "I remember when I learned about this as a kid. There was a fire at a gasoline processing plant where I lived, huge news. On the news for months. The prices in my area skyrocketed like crazy. Then I would be bored and read the paper before First period and it came out it was the diesel plant that had a fire, very little property damage was done and most of the loss was diesel, yet gas prices for non-diesel gasolines by $0.60 in the early 2000’s for months.",
            "title_similarity": "0.6079933",
            "sentiment_compound": -0.85
        },
        {
            "id": "hyvis6t",
            "score": 1,
            "text": "i dunno man, my CrapBook feed is nothing but ppl blaming gas and food prices on Biden.",
            "title_similarity": "0.6199689",
            "sentiment_compound": 0.5334
        },
        {
            "id": "hyviw3u",
            "score": 1,
            "text": "They are not wrong. (I typically vote right, think lib, and support left)",
            "title_similarity": "0.22275516",
            "sentiment_compound": 0.6433
        },
        {
            "id": "hyvixrz",
            "score": 1,
            "text": "This just in: most people agree that Moon is not on Earth.",
            "title_similarity": "0.44106486",
            "sentiment_compound": 0.4173
        },
        {
            "id": "hyvj1bh",
            "score": 2,
            "text": "They would be correct!!!!",
            "title_similarity": "-0.03682085",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyvj7h4",
            "score": 1,
            "text": "This appears to be a new narrative trending",
            "title_similarity": "0.095982626",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyvjdgm",
            "score": 1,
            "text": "Where are these \"majorities\" because anyone I randomly talk to about it never says this.  Always president or whatever.",
            "title_similarity": "0.38991305",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyvjeyn",
            "score": 2,
            "text": "Corporations are doing what their designed to do, profit. Let's not forget Citizens United allowed corporations and unions to dump unlimited amounts of money into politics. Paving the way to remove policy for the people. It's the FED that's printing all the money with a fiat currency. Screwing anyone with financial literacy who have actually saved their money. But bail out anyone who mismanaged their finances, this is the way. No accountability. This is just the blame game. Don't read this stupid article, cuz it's just pointing the finger at the wrong problem.",
            "title_similarity": "0.77094865",
            "sentiment_compound": -0.963
        },
        {
            "id": "hyvjnll",
            "score": 3,
            "text": "They should be subjected to anti price gouging laws.",
            "title_similarity": "0.38042468",
            "sentiment_compound": -0.3182
        },
        {
            "id": "hyvjx8g",
            "score": 9,
            "text": "Good.  The corporations have always exaggerated times of crisis to make mass profits.",
            "title_similarity": "0.68149877",
            "sentiment_compound": 0.0772
        },
        {
            "id": "hyvk9no",
            "score": 3,
            "text": "Minuscule poll run by an interest group. The functional equivalent to DuPont running a poll about the safety of chemicals.",
            "title_similarity": "0.5421098",
            "sentiment_compound": 0.7003
        },
        {
            "id": "hyvksol",
            "score": 2,
            "text": "That's a fact due to monopoly and oligopoly power.",
            "title_similarity": "0.36091965",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyvkv4y",
            "score": 1,
            "text": "Profits in the billions and raisins prices is not inflation.",
            "title_similarity": "0.35842174",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hyvkxcl",
            "score": 1,
            "text": "Thank god",
            "title_similarity": "-0.014959171",
            "sentiment_compound": 0.5574
        },
        {
            "id": "hyvkxf8",
            "score": 1,
            "text": "Obviously. Even political profiteering is just as bad.",
            "title_similarity": "0.59710014",
            "sentiment_compound": -0.6249
        },
        {
            "id": "hyvkyh1",
            "score": 1,
            "text": "Who else would we blame?",
            "title_similarity": "0.23451582",
            "sentiment_compound": -0.34
        },
        {
            "id": "hyvl00w",
            "score": 1,
            "text": "The explanation that involves corporations suddenly only caring about profits in 2021 doesn't hold much water for me.\n\nOf course they try to maximize their revenue, that's their job. The question is why are they able to raise prices now but weren't before?",
            "title_similarity": "0.62938637",
            "sentiment_compound": 0.4678
        },
        {
            "id": "hyvl072",
            "score": 1,
            "text": "Restart the key stone xl pipeline, MIGHT help with unemployment and INFLATION",
            "title_similarity": "0.596336",
            "sentiment_compound": -0.0516
        },
        {
            "id": "hyvl4rc",
            "score": 1,
            "text": "You think? Sherwin Williams has a \"COVID surcharge\" listed right on the receipt. lol",
            "title_similarity": "0.44329518",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hyvl53f",
            "score": 1,
            "text": "I don’t understand this… so corporations just suddenly got greedy circa September 2021 which is now causing inflation..?",
            "title_similarity": "0.68140346",
            "sentiment_compound": -0.3182
        },
        {
            "id": "hyvl7dn",
            "score": 1,
            "text": "I do",
            "title_similarity": "-0.09361479",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyvl8jo",
            "score": 1,
            "text": "Tbh half of Americans voted for Trump twice... So not really polling an intelligent group of people.\nNot saying that it isn't the reason, just saying that the poll is flawed from the outset",
            "title_similarity": "0.6769753",
            "sentiment_compound": 0.0422
        },
        {
            "id": "hyvlekw",
            "score": 1,
            "text": "Um, yeah we blame them, it's their fault.",
            "title_similarity": "0.4153168",
            "sentiment_compound": -0.4404
        },
        {
            "id": "hyvll6z",
            "score": 1,
            "text": "Home Insurance prices went up with more deductible and same coverage, when it’s been literally free money for insurers in many areas. Its just pure corporate greed.",
            "title_similarity": "0.6574111",
            "sentiment_compound": 0.1531
        },
        {
            "id": "hyvllqt",
            "score": 1,
            "text": "ITT - people calling other people stupid while citing a ridiculously wide range of “printed % of all currency” numbers. I’ll try to keep a running total. \n\nFirst round\n\n20%, 35%, 40%, “over 50%”, 65%, 70%, 80%, and my personal favorite “Over 80% of all currency ever printed”.",
            "title_similarity": "0.66567403",
            "sentiment_compound": -0.4215
        },
        {
            "id": "hyvlml6",
            "score": 1,
            "text": "Profiteering is simply boardroom greed and a small part of the overall problem.\n\nIt’s when an actual government incentivises the behavior (for a larger cut from the taxes) that things become bad for the little guy.\n\nThe government likes the guise of competition that gouges you in parallel for perhaps a few dollars less.\n\nIt’s a shitty, corrupt system that has complete disregard for the quality of life.",
            "title_similarity": "0.7549391",
            "sentiment_compound": -0.9222
        },
        {
            "id": "hyvlo4c",
            "score": 1,
            "text": "Doy",
            "title_similarity": "-0.05690709",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyvlstj",
            "score": 1,
            "text": "Why this year, then? Corporate profit is insane every year. But all of the sudden NOW it’s causing record inflation? What am I missing here? What’s different this time around? \n\nThere must be other factors, no?",
            "title_similarity": "0.7448302",
            "sentiment_compound": -0.5661
        },
        {
            "id": "hyvlu9r",
            "score": 2,
            "text": "Was the poll done on r/politics",
            "title_similarity": "0.44060427",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyvm080",
            "score": 1,
            "text": "Blame?",
            "title_similarity": "0.2366372",
            "sentiment_compound": -0.34
        },
        {
            "id": "hyvm4z1",
            "score": 1,
            "text": "No shit we didn’t need Charts for that",
            "title_similarity": "0.069123335",
            "sentiment_compound": 0.4449
        },
        {
            "id": "hyvmo1f",
            "score": 1,
            "text": "Supply and demand",
            "title_similarity": "0.14278512",
            "sentiment_compound": -0.128
        },
        {
            "id": "hyvmr4e",
            "score": 1,
            "text": "That’s a fact. Washington based billionaires cashed out their stock to avoid a pittance of a 3% tax on stock for the already wealthy and flooded the market with cash and now worthless stock…",
            "title_similarity": "0.7271127",
            "sentiment_compound": -0.3818
        },
        {
            "id": "hyvnaog",
            "score": 2,
            "text": "Right. It has to be the corporations, not all the excess money that got printed over the last couple of years.",
            "title_similarity": "0.6003126",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyvnkxe",
            "score": 2,
            "text": "Most voters are wrong.",
            "title_similarity": "0.5129255",
            "sentiment_compound": -0.5209
        },
        {
            "id": "hyvnnxl",
            "score": 1,
            "text": "That’s because it is the cause of inflation.",
            "title_similarity": "0.59896386",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyvo8lj",
            "score": 1,
            "text": "That's only because half the country is split between blaming Biden or Obama.",
            "title_similarity": "0.73243546",
            "sentiment_compound": -0.4939
        },
        {
            "id": "hyvob9d",
            "score": 1,
            "text": "Right they are.",
            "title_similarity": "-0.07156637",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyvof0n",
            "score": 1,
            "text": "The entire premise of capitalism is \"whatever the market will bear\". \n\nUm, yeah.",
            "title_similarity": "0.4146629",
            "sentiment_compound": 0.296
        },
        {
            "id": "hyvogll",
            "score": 2,
            "text": "Again letting the government get away with causing problems and offering solutions.",
            "title_similarity": "0.42570844",
            "sentiment_compound": -0.25
        },
        {
            "id": "hyvorx6",
            "score": 2,
            "text": "It's not fair to put all the blame on corporations - political corruption and flat out money laundering contributed too.",
            "title_similarity": "0.73000956",
            "sentiment_compound": -0.5207
        },
        {
            "id": "hyvounk",
            "score": 2,
            "text": "Corporations are partly to blame for this mess that we are in.  But the current administration and the loads of policy makers in Washington who are in bed with these corporations are also to blame.",
            "title_similarity": "0.6858252",
            "sentiment_compound": -0.6609
        },
        {
            "id": "hyvp7rf",
            "score": 1,
            "text": "Gov be selling out too",
            "title_similarity": "0.35715038",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyvpbhu",
            "score": 1,
            "text": "How they had record profits and still increased everything...",
            "title_similarity": "0.3490337",
            "sentiment_compound": 0.6124
        },
        {
            "id": "hyvpblf",
            "score": 1,
            "text": "See I thought this whole time it was bidens fault /s",
            "title_similarity": "0.39357135",
            "sentiment_compound": -0.4019
        },
        {
            "id": "hyvpc12",
            "score": 2,
            "text": "More like supply chain issues mixed with bad policy",
            "title_similarity": "0.4545127",
            "sentiment_compound": -0.1796
        },
        {
            "id": "hyvpezm",
            "score": 1,
            "text": "Prices aren't high because of corporate greed. They are high because of supply chain issues and not enough supply of goods. \n\nFor example, gloves, let's say shipping prices are up 0.05  cents (it's more than that) and I require 20 different items to create gloves. because of the increase in shipping prices my overall product cost $1 more, so I pass that on to my customers.\n\nMy customer, another business that uses gloves and boxes which for this example are also $1 more. This increases the cost for the business to $2 more than before. This keeps going until the final products cost 30-40% more when they reach the consumer.\n\nThis is one of the biggest reasons for the increase in prices and because of more demand as more people had money to spend due to stimis and fewer people were working to produce that demand. This caused a chain reaction that raised the prices to what they are now.",
            "title_similarity": "0.6733321",
            "sentiment_compound": 0.2665
        },
        {
            "id": "hyvpfq6",
            "score": 1,
            "text": "It's not surprising that so many people are blaming corporate profiteering for inflation. After all, it's undeniable that profits are at an all-time high, while wages are stagnant. But it's not just corporations that are to blame – the government is also responsible. The Fed has been keeping interest rates artificially low for years, which has led to rampant speculation and asset bubbles. This is what's really causing inflation, and it's time for the government to get serious about reigning in the big banks and Wall Street.",
            "title_similarity": "0.8020902",
            "sentiment_compound": 0.675
        },
        {
            "id": "hyvpga6",
            "score": 1,
            "text": "This title is incorrect. The study doesn’t say a majority blames corporate profiteering “for inflation”. It says the opposite. 94% of the people polled said government spending was a cause of inflation “at least a little bit”. https://www.filesforprogress.org/decks/2022/2/dfp_groundwork_inflation_message_test_feb22_deck.pdf",
            "title_similarity": "0.7754823",
            "sentiment_compound": -0.5106
        },
        {
            "id": "hyvpicq",
            "score": 1,
            "text": "fed test balloon before the wednesday meeting?\n\ngetting their excuses out early?\n\nwe will wait for the higher-than-expected inflation numbers on wednesday.",
            "title_similarity": "0.5069137",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyvpw13",
            "score": 1,
            "text": "bilked & milked of family fortunes & life force",
            "title_similarity": "0.46536154",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyvpw2d",
            "score": 1,
            "text": "\nPolls measure opinions, not facts",
            "title_similarity": "0.2415944",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyvpz0k",
            "score": 1,
            "text": "Oh whaaaat are the giant corporations the bad guys??",
            "title_similarity": "0.66469246",
            "sentiment_compound": -0.594
        },
        {
            "id": "hyvq1kf",
            "score": 1,
            "text": "Its the federal reserve. Look at the M2 money supply please",
            "title_similarity": "0.46846896",
            "sentiment_compound": 0.3182
        },
        {
            "id": "hyvq6ww",
            "score": 1,
            "text": "It’s just capitalism, that’s all. It’s all about making money over anything else. That’s how capitalism works, if you don’t like it come up with an alternative system",
            "title_similarity": "0.6093187",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hyvq7mc",
            "score": 1,
            "text": "It's so damn obvious, you'd have to be in an oubliette to miss it.",
            "title_similarity": "0.25120854",
            "sentiment_compound": -0.5563
        },
        {
            "id": "hyvqas0",
            "score": 2,
            "text": "You’re an idiot if you think this *isn’t* the largest contributor.",
            "title_similarity": "0.46774",
            "sentiment_compound": -0.5106
        },
        {
            "id": "hyvqu4w",
            "score": 1,
            "text": "It’s true",
            "title_similarity": "-0.05685611",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hyvqvxw",
            "score": 2,
            "text": "Yep. And im tired of seeing biden stickers with the slogan \"i did that\" and tbh were probably seeing the after math of trump bieng too late when calling covid a serious issue. I think its more than politics. The higher ups in wallstreet have been playing games with our economy and making ungodly amounts of money off of it.",
            "title_similarity": "0.7289752",
            "sentiment_compound": -0.0516
        },
        {
            "id": "hyvr1x7",
            "score": 1,
            "text": "That's because most of us know it's fucking shit stained corps greed.",
            "title_similarity": "0.66838485",
            "sentiment_compound": -0.7645
        },
        {
            "id": "hyvr27h",
            "score": 1,
            "text": "Well, duh",
            "title_similarity": "-0.05971004",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hyvr9b0",
            "score": 1,
            "text": "Man, almost like corporate greed is directly responsible or something.\n\nI mean imagine if massive companies like Starbucks were reporting more profit than ever before but raising their prices anyway?\n\nOh they are? At least they’re not quashing unions- oh that too.",
            "title_similarity": "0.73543",
            "sentiment_compound": 0.5778
        },
        {
            "id": "hyvrask",
            "score": 3,
            "text": "Most voters don’t know the definition of inflation. And even people who do know the definition have a hard time understanding distribution curves. \n\nI’ll break it down. Inflation most definitely happened. The money supply was expanded dramatically for the reasons we know (military spending, social programs, and pandemic relief). The problem is people are accepting the BS propaganda that the expansion of the money supply benefited regular people. It did in a small way, temporarily, but the vast majority of wealth generated was transferred to the top 10%. \n\nMost people live check to check. The weekly infusions of stimulus and unemployment cash are all spent. But after it was spent by the original recipients, where did it land? Back in the hands of the landlords and corporations; benefitting the already rich, and already politically powerful. \n\nNow that the spigot is running dry, they are raising prices on everything in hopes that their profits continue to increase. \n\nModern day inflation has little to do with modern day consumer prices, because the wealth that was created was not distributed to most people. The wealth was simply handed over to the already-haves. \n\nCorporate profiteering is absolutely taking place, but that has to do with shareholder primacy. Corporations are obligated by law to act in the interest of their shareholders above and beyond all other interests. It’s simply unacceptable for a corporation to make the same profits year after year. Shareholders want profits to increase every year. Those profits are not distributed to employees.\n\nSo, there is inflation, and there is corporate profiteering, but one is not the cause of the other. \n\nIt can be argued that modern monetary policies that caused the expansion of the money supply (inflation) are highly correlated to the profiteering we see with corporations, but it’s virtually impossible to draw a causal relationship without sounding like a conspiracy theorist.",
            "title_similarity": "0.76311535",
            "sentiment_compound": 0.9927
        },
        {
            "id": "hyvrdun",
            "score": 1,
            "text": "This should be 90% of voters…",
            "title_similarity": "0.46021932",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyvrl71",
            "score": 2,
            "text": "Interesting poll result considering US Voters didn't vote Bernie in",
            "title_similarity": "0.44250676",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hyvrpm5",
            "score": 1,
            "text": "It’s about tome. This gives me hope.",
            "title_similarity": "0.11938964",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hyvrpnw",
            "score": 1,
            "text": "Well that’s partially it.  Yay America for our population getting part of the picture!",
            "title_similarity": "0.5316143",
            "sentiment_compound": 0.6996
        },
        {
            "id": "hyvrqw4",
            "score": 1,
            "text": "I blame corporate profiteering for every environmental problem on Earth",
            "title_similarity": "0.6962239",
            "sentiment_compound": -0.6908
        },
        {
            "id": "hyvrxyp",
            "score": 1,
            "text": "The oligarchies created from the mergers and acquisitions of the Trump years finally have an excuse of \"supply chain issues\" to exercise their market power.",
            "title_similarity": "0.5980661",
            "sentiment_compound": 0.3182
        },
        {
            "id": "hyvrzco",
            "score": 1,
            "text": "Now, I may not be a smart man, but………. Isn’t this obvious?",
            "title_similarity": "0.2722739",
            "sentiment_compound": -0.3089
        },
        {
            "id": "hyvs1eu",
            "score": 1,
            "text": "The right enemy identified.",
            "title_similarity": "0.2577381",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hyvsjr1",
            "score": 1,
            "text": "science shows these views to be accurate",
            "title_similarity": "0.09526272",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyvsqg7",
            "score": 2,
            "text": "You can’t be so dense to try and take the blame off of politicians for this. Amazing.",
            "title_similarity": "0.50193286",
            "sentiment_compound": 0.4767
        },
        {
            "id": "hyvssu7",
            "score": 1,
            "text": "Don't forget the Fed, which has few purposes, one of which is preventing inflation. In less than two years, they created more money out of thin air than has ever even existed, and gave almost all of it to Wall Street.",
            "title_similarity": "0.63884825",
            "sentiment_compound": 0.3749
        },
        {
            "id": "hyvsuzv",
            "score": 1,
            "text": "Change \"blames\" to \"knows\", it's been plain as day that corporate ticks have embedded themselves on our political system and have drained us of our representation to hijack our government for their own profit, damn the consequences.",
            "title_similarity": "0.7337803",
            "sentiment_compound": -0.6124
        },
        {
            "id": "hyvsvb6",
            "score": 1,
            "text": "I remember how much propane was when I use to work at a gas station. We had this nice big propane tank outside to fill customers tanks and I realized we were charging them 6x the price we pay for it. But my paycheck was still minimum and I still had to work 10 hours a day. I left that job after a few months but to see how much the corporations try to save money and profit off americans while charging massive prices is just disgusting. Not to mention the gas prices right now. We are technically payting 4x much as the gas station companies pay right now. Yet the guy behind the glass taking your money is paid minimum.",
            "title_similarity": "0.64015007",
            "sentiment_compound": 0.596
        },
        {
            "id": "hyvt0ve",
            "score": 1,
            "text": "Glad that people have an accurate view of the situation.\n\nWe need antitrust, we need unions and we need them 20 years ago.",
            "title_similarity": "0.48639575",
            "sentiment_compound": 0.4588
        },
        {
            "id": "hyvt1m8",
            "score": 1,
            "text": "Um… because that’s the truth?",
            "title_similarity": "0.03210188",
            "sentiment_compound": 0.3182
        },
        {
            "id": "hyvt3sl",
            "score": 1,
            "text": "It doesn’t matter. They will still vote for corporate friendly politicians.",
            "title_similarity": "0.36075032",
            "sentiment_compound": 0.5106
        },
        {
            "id": "hyvt83w",
            "score": 2,
            "text": "It is a good thing they have all the power and can divide everyone into groups of stupid beliefs and ideologies to keep everyone hating each other instead of realizing they are the problem.",
            "title_similarity": "0.5375576",
            "sentiment_compound": -0.7579
        },
        {
            "id": "hyvte34",
            "score": 1,
            "text": "Id argue it's the government stimulating billions to save those companies from crashing",
            "title_similarity": "0.6978158",
            "sentiment_compound": 0.5719
        },
        {
            "id": "hyvtkq0",
            "score": 2,
            "text": "Duh corporations have been making record profits for 50 years. Their profiteering is directly to blame for the over pricing we see today, if it wasn’t for their profiteering 7% inflation wouldn’t be hurting the average person today.",
            "title_similarity": "0.697155",
            "sentiment_compound": -0.5267
        },
        {
            "id": "hyvtlv4",
            "score": 1,
            "text": "it's not wages... profits are at record highs\n\nit's economics, not rocket science",
            "title_similarity": "0.527199",
            "sentiment_compound": -0.3412
        },
        {
            "id": "hyvtlwz",
            "score": 1,
            "text": "So when prices go down we should thank corporations? Got cha",
            "title_similarity": "0.6325989",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hyvtsap",
            "score": 1,
            "text": "Agree!",
            "title_similarity": "-0.036263958",
            "sentiment_compound": 0.4199
        },
        {
            "id": "hyvu2nu",
            "score": 2,
            "text": "Well with the number of times I’ve seen people on Reddit confuse rising revenue with rising profits I’m not shocked.",
            "title_similarity": "0.61320174",
            "sentiment_compound": 0.6555
        },
        {
            "id": "hyvu9w1",
            "score": 2,
            "text": "At the point it’s blatantly obvious they’re price gouging and they’re not even trying to hide it.",
            "title_similarity": "0.3724355",
            "sentiment_compound": -0.1779
        },
        {
            "id": "hyvv099",
            "score": 1,
            "text": "Honestly... I'm not entirely sure why inflation shot up so high when profits, actual profits, seem to have gone up so much last year. Maybe I just don't understand. Did the cost of raw materials go up? If not then... Why are things suddenly more expensive?",
            "title_similarity": "0.6693077",
            "sentiment_compound": 0.8044
        },
        {
            "id": "hyvvdpr",
            "score": 1,
            "text": "Which is funny because it’s also the reason",
            "title_similarity": "0.12401288",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hyvvjfh",
            "score": 1,
            "text": "Wall St. greed and the Feds unstoppable printer.",
            "title_similarity": "0.6018357",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hyvvkq0",
            "score": 1,
            "text": "Profits merely unpaid wages; What do you think happens to a society that produces more than what it is allowed to consume? What happens when labor reclaims all it creates?",
            "title_similarity": "0.67955434",
            "sentiment_compound": 0.6553
        },
        {
            "id": "hyvwb1w",
            "score": 2,
            "text": "Majority of my neighbors in California blame Biden.",
            "title_similarity": "0.6584251",
            "sentiment_compound": -0.34
        },
        {
            "id": "hyvwcji",
            "score": 2,
            "text": "Call this travesty what it is:\n\nCapitalists capitalizing.",
            "title_similarity": "0.5619328",
            "sentiment_compound": -0.5719
        },
        {
            "id": "hyvwhvq",
            "score": 1,
            "text": "Because it’s true.",
            "title_similarity": "-0.053228837",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hyvwmj3",
            "score": 2,
            "text": "Almost like consolidating markets kills competitive balance",
            "title_similarity": "0.5799539",
            "sentiment_compound": -0.1513
        },
        {
            "id": "hyvwvqz",
            "score": 1,
            "text": "The reason for inflation goes back to the Global Financial Crisis, bewilderingly massive decades long quantitative easing and the insanely large retirement funds moving out of stocks and into real estate and pushing house prices up 3 fold",
            "title_similarity": "0.6980258",
            "sentiment_compound": -0.4767
        },
        {
            "id": "hyvxc92",
            "score": 2,
            "text": "Let’s not forget the other contributing factor; THE PEOPLE REPRESENTING US ARE FUCKING DINOSAURS!\n\nSeriously, how the hell these 70-80 year olds keep getting elected to office is absolutely BAFFLING. Not only are they so out of touch because of their age, a majority are career politicians who have held office for 10, 20, 30 years…. They have NO IDEA what the common person struggles with because they’re so far removed from the Shit that the average American has to deal with.",
            "title_similarity": "0.5811294",
            "sentiment_compound": -0.8092
        },
        {
            "id": "hyvy7to",
            "score": 2,
            "text": "That would show the average American intelligence regarding the economy… delusional they are. But I’m sure they’ll just ask Daddy Dearest to arm up the printers- it’s fine.",
            "title_similarity": "0.6834974",
            "sentiment_compound": 0.9022
        },
        {
            "id": "hyvyyh0",
            "score": 3,
            "text": "Polls show a majority of US voters didn’t pass economy 101!",
            "title_similarity": "0.7585557",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyvz4pe",
            "score": 1,
            "text": "If the duck quacks",
            "title_similarity": "0.25686422",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyvz9ed",
            "score": 3,
            "text": "They are taking advantage of inflation not causing it. Still vile sure but we shouldn't be going around speeding economic ignorance.",
            "title_similarity": "0.45986658",
            "sentiment_compound": -0.5647
        },
        {
            "id": "hyvzdh8",
            "score": 1,
            "text": "It ain’t inflation if companies are making more than ever. There’s a word for that.",
            "title_similarity": "0.40246618",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyvzg0x",
            "score": 1,
            "text": "As a small business this is true larger companies are inflating prices. It’s easy to see look at scrap metal prices the material costs really haven’t changed",
            "title_similarity": "0.5333972",
            "sentiment_compound": 0.6908
        },
        {
            "id": "hyvzkta",
            "score": 1,
            "text": "Ayup. If they’re not responsible for it the certainty are exploiting it",
            "title_similarity": "0.2643686",
            "sentiment_compound": -0.4333
        },
        {
            "id": "hyvzvrp",
            "score": 1,
            "text": "And in other news the sky is blue and the grass is green",
            "title_similarity": "0.031366467",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyw04p9",
            "score": 1,
            "text": "What is going on in the world. Americans now waking up about their exploitation aswell?",
            "title_similarity": "0.60095745",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyw0kr3",
            "score": 2,
            "text": "Everyone should be required to read 1984 and then come back to the table to discuss.",
            "title_similarity": "0.40631407",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyw113d",
            "score": 1,
            "text": "Rare to see Americans so well informed.",
            "title_similarity": "0.33712342",
            "sentiment_compound": 0.4101
        },
        {
            "id": "hyw11mq",
            "score": 2,
            "text": "Inflation is there to keep the economy going. Its an intentional feature of the monetary system, the idea being that saving money should be inefficient because the whole point of money is to exchange it for goods and services.\n\nYou can disagree with that stance, but it's not some kind of conspiracy or anything, literally the official policy in most Western nations.",
            "title_similarity": "0.60357744",
            "sentiment_compound": -0.7808
        },
        {
            "id": "hyw1gk3",
            "score": 1,
            "text": "Because we can literally follow the money.",
            "title_similarity": "0.34948584",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyw1j36",
            "score": 1,
            "text": "That's not what the poll says at all... Misleading headline. \n\nWhat the majority said is that corporations are using the pandemic to raise prices and that contributes to inflation, not that it's completely responsible for it.\n\nOh, nm. Didn't see what sub I was in right away. Of course it's fake. Carry on.",
            "title_similarity": "0.76844156",
            "sentiment_compound": -0.4951
        },
        {
            "id": "hyw1slv",
            "score": 2,
            "text": "Blaming the sun for sunlight too right??\n\nMedia propaganda framing is pathetic.",
            "title_similarity": "0.4707441",
            "sentiment_compound": -0.8504
        },
        {
            "id": "hyw1w0j",
            "score": 2,
            "text": "It's interesting to note how many US voters are economically illiterate.",
            "title_similarity": "0.694102",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hyw2faq",
            "score": 1,
            "text": "Notice how all of the fast food places and other minimum wage jobs have raised their starting pays? They always could’ve afforded it just chose not too.",
            "title_similarity": "0.51998717",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyw2oca",
            "score": 2,
            "text": "Poll shows Majority of US voters have no idea how finance works",
            "title_similarity": "0.728518",
            "sentiment_compound": -0.296
        },
        {
            "id": "hyw2uxi",
            "score": 1,
            "text": "and rightly so!",
            "title_similarity": "-0.043162383",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyw2ycy",
            "score": 1,
            "text": "What else could it be???",
            "title_similarity": "-0.03503365",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyw3bb9",
            "score": 3,
            "text": "The average person is ignorant, yes.",
            "title_similarity": "0.3063103",
            "sentiment_compound": 0.1531
        },
        {
            "id": "hyw44vy",
            "score": 2,
            "text": "Poll Shows Majority of US Voters Failed First Year Econ",
            "title_similarity": "0.6980393",
            "sentiment_compound": -0.5106
        },
        {
            "id": "hyw48t3",
            "score": 1,
            "text": "Blame Corporate profiteering for everything",
            "title_similarity": "0.7296837",
            "sentiment_compound": -0.4588
        },
        {
            "id": "hyw4iwc",
            "score": 3,
            "text": "Poll shows: Media and propaganda influenced by US Oligarchs convinced almost 20%  of US Voters that their unhinged greed is not the cause of current inflation.",
            "title_similarity": "0.77027583",
            "sentiment_compound": -0.25
        },
        {
            "id": "hyw4zy7",
            "score": 1,
            "text": "First thing it said was the survey found that 80% of voters want the federal government to \"crack down on large corporations that raise prices unfairly.\"I thought it was about the big corps causing inflation cos they made Bukoo Bucks cos we had to stay at home?  \n\n\nAnd what large corps raised prices unfairly?",
            "title_similarity": "0.774931",
            "sentiment_compound": 0.168
        },
        {
            "id": "hyw5dsh",
            "score": 3,
            "text": "it's less blame and more acknowledge the reality of whats happening, we have the numbers, we know they're making record high profits.",
            "title_similarity": "0.4472857",
            "sentiment_compound": 0.2006
        },
        {
            "id": "hyw5pb7",
            "score": 1,
            "text": "it's almost like it's 90% of the actual reason inflation exists",
            "title_similarity": "0.6020404",
            "sentiment_compound": 0.2975
        },
        {
            "id": "hyw5rw4",
            "score": 1,
            "text": "I'm sorry is there some other reason?",
            "title_similarity": "0.08354844",
            "sentiment_compound": -0.0772
        },
        {
            "id": "hyw6198",
            "score": 1,
            "text": "1400 people surveyed... 300 some million Americans, though... I'll admit I don't understand statistics. Be nice if people actually felt this way.",
            "title_similarity": "0.565104",
            "sentiment_compound": 0.5574
        },
        {
            "id": "hyw693g",
            "score": 2,
            "text": "This is where Biden can capitalize and announce a task force to review price gauging aggressively.",
            "title_similarity": "0.4156623",
            "sentiment_compound": -0.3182
        },
        {
            "id": "hyw6dg0",
            "score": 2,
            "text": "Capitalism is just one huge pyramid scheme",
            "title_similarity": "0.53475904",
            "sentiment_compound": 0.3182
        },
        {
            "id": "hyw6wkm",
            "score": 5,
            "text": "Not to say companies aren't taking advantage, but as someone who works in supply chain people have no idea how fucked the system got over the last two years and will remind fucked for the next year.\n\nWhen shipping costs are up 700% on top of inventory issues, raw material issues, and ripple affects from past manufacturing shutdowns  it's not exactly surprising that prices are sky rocketing.\n\nI'm normally the first to call out corporate greed but what's going on right now is complicated.",
            "title_similarity": "0.69949985",
            "sentiment_compound": -0.968
        },
        {
            "id": "hyw7io8",
            "score": 2,
            "text": "Its pretty obvious",
            "title_similarity": "-0.045429118",
            "sentiment_compound": 0.4939
        },
        {
            "id": "hyw7q5p",
            "score": 2,
            "text": "100% of the smart people do",
            "title_similarity": "0.32330602",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hyw7ws1",
            "score": 1,
            "text": "But but but I thought it was because of the stimulus!",
            "title_similarity": "0.1753797",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyw81cu",
            "score": 8,
            "text": "Somebodys getting rich and it definitely aint the working class and poor",
            "title_similarity": "0.58647454",
            "sentiment_compound": 0.4939
        },
        {
            "id": "hyw85iy",
            "score": 1,
            "text": "Big pharma is a big problem again. Thank fuck.",
            "title_similarity": "0.47133297",
            "sentiment_compound": -0.5719
        },
        {
            "id": "hyw8yxo",
            "score": 2,
            "text": "I'm so happy everyone is woke now. Fuck the rich.",
            "title_similarity": "0.33123735",
            "sentiment_compound": 0.624
        },
        {
            "id": "hywaai4",
            "score": 2,
            "text": "And yet, half of Republicans still think Biden is to blame 🤷‍♀️",
            "title_similarity": "0.7036921",
            "sentiment_compound": -0.34
        },
        {
            "id": "hywar42",
            "score": 3,
            "text": "Glad to hear some people know who the real enemy is.",
            "title_similarity": "0.29316097",
            "sentiment_compound": -0.128
        },
        {
            "id": "hywavfm",
            "score": 1,
            "text": "Honestly, I feel way too dumb to understand what that means.",
            "title_similarity": "0.16117957",
            "sentiment_compound": -0.0772
        },
        {
            "id": "hywb3it",
            "score": 2,
            "text": "When you think about it, we’re to blame as well for allowing it. Think about Walmart. The workers there could just NOT raise the prices. Sure they’ll get fired but then the next workers don’t raise them either. You think someone from corporate is gonna show up and do it? Nope and they can’t make you raise it either. They lose enough money from stores being closed they’ll give in and keep normal prices. We allow it to happen, every time.",
            "title_similarity": "0.6368984",
            "sentiment_compound": -0.4588
        },
        {
            "id": "hywbb84",
            "score": 2,
            "text": "Yea. And they are very rare to lower prices later i “ inflation” comes down",
            "title_similarity": "0.4989071",
            "sentiment_compound": -0.3535
        },
        {
            "id": "hywbv28",
            "score": 5,
            "text": "Supposedly Ford is going to crack down on dealers marking up new Broncos, still see many of them for sale for 99k online with a retail of 60k. I don’t have an issue with a person selling theirs for a profit but dealers shouldn’t be doing this.",
            "title_similarity": "0.61272055",
            "sentiment_compound": 0.2382
        },
        {
            "id": "hywcjmi",
            "score": 2,
            "text": "Yay, we're not completely brain dead!",
            "title_similarity": "0.05165706",
            "sentiment_compound": 0.8095
        },
        {
            "id": "hywczk7",
            "score": 2,
            "text": "There are so many reasons pushing inflation up (mainly the fact that we printed trillions, upon trillions of dollars since 2020). \n\nCorporate profiteering is one reason that is feeding into inflation out of many. I’d say its top 5.",
            "title_similarity": "0.7117615",
            "sentiment_compound": 0.0516
        },
        {
            "id": "hywczlw",
            "score": 2,
            "text": "I don’t know. Record profits and lower wages usually means increased price in my bizzaro economics",
            "title_similarity": "0.660613",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hywdqh9",
            "score": 1,
            "text": "It's time to pay up porky.",
            "title_similarity": "0.38208586",
            "sentiment_compound": -0.1027
        },
        {
            "id": "hywdxu2",
            "score": 1,
            "text": "but when do we ride against them brothers",
            "title_similarity": "0.3106795",
            "sentiment_compound": 0.0
        },
        {
            "id": "hywf0r1",
            "score": 1,
            "text": "*rightfully blame",
            "title_similarity": "0.27242458",
            "sentiment_compound": -0.34
        },
        {
            "id": "hywfoso",
            "score": 3,
            "text": "Corporations look to each other to justify inadequate wages using BS benchmark studies whose outcomes are predetermined.  But price increases will be as big and as often as needed.",
            "title_similarity": "0.6986333",
            "sentiment_compound": -0.2144
        },
        {
            "id": "hywi88k",
            "score": 1,
            "text": "Not just the US but the entire world.",
            "title_similarity": "0.24321753",
            "sentiment_compound": 0.0
        },
        {
            "id": "hywi91q",
            "score": 2,
            "text": "Advertising at its core is a self sufficient agent of propaganda. If we need not buy 6 types of one thing and replace them with another 10 every few days, months, years or one with a slightly different colour and shape then the levying of all the prices on these items need not exist. Competition and variation may remain to give the consumer the choice of the best manufactured goods. But with advertising the judge of whose goods are the best is always the manufacturers. Conversely if a company could only build one new machine or product say every 2 years and was responsible for the maintenance, replacement parts and support of every product it sold for its governed ‘lifetime’ regardless of when it was sold and there was an act that said every new machine must have an increased lifetime then the one before it… One might start to find a fair value market where perhaps consumers deemed the fairness and value of a product.",
            "title_similarity": "0.5531133",
            "sentiment_compound": 0.9781
        },
        {
            "id": "hywi9lp",
            "score": 5,
            "text": "Good, the truth is out there. Also, *greed (not profiteering).",
            "title_similarity": "0.31235904",
            "sentiment_compound": 0.4486
        },
        {
            "id": "hywir79",
            "score": 11,
            "text": "People realize corporations are robbing us blind? That's a great step. First step is admitting there is a problem after all.",
            "title_similarity": "0.63498604",
            "sentiment_compound": -0.0772
        },
        {
            "id": "hywit9v",
            "score": 3,
            "text": "Let's not forget their politicians they bought so that they could get away with this.",
            "title_similarity": "0.5931249",
            "sentiment_compound": 0.1695
        },
        {
            "id": "hywiyjm",
            "score": 2,
            "text": "Corporate profiteering is their job. The shareholders demand it. You want corporations to not do this then out some controls on the stock market.  The blame is on the the major shareholders.",
            "title_similarity": "0.75095266",
            "sentiment_compound": -0.4939
        },
        {
            "id": "hywj15m",
            "score": 3,
            "text": "“Poll shows US voters believe the truth”\n\nWell that’s a first",
            "title_similarity": "0.37162173",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hywj2eb",
            "score": 2,
            "text": "Yep!",
            "title_similarity": "-0.050662257",
            "sentiment_compound": 0.3595
        },
        {
            "id": "hywj3w2",
            "score": 3,
            "text": "These corporate scumbags need to be stopped!!!!",
            "title_similarity": "0.5467088",
            "sentiment_compound": -0.471
        },
        {
            "id": "hywjkim",
            "score": 1,
            "text": "Or",
            "title_similarity": "-0.06515727",
            "sentiment_compound": 0.0
        },
        {
            "id": "hywjmzv",
            "score": 1,
            "text": "Wtf is \"Corporate Profiteering\" \n\nIs that like... running a company?",
            "title_similarity": "0.6320423",
            "sentiment_compound": -0.4404
        },
        {
            "id": "hywjsgg",
            "score": 1,
            "text": "And this shows a majority of US voters don’t understand how economics work. The moves by the US Fed have had a far higher impact than corporate profiteering",
            "title_similarity": "0.81693745",
            "sentiment_compound": -0.1531
        },
        {
            "id": "hywjt3b",
            "score": 2,
            "text": "I might have bought that it was the wage increases if so many places hadn't recorded record profits.   I feel bad for small businesses because the economy is hurting them while places like walmart have been fucking us for dacades and now it's looking like the super corporations will be the only ones left one day.  Yeah Walmart may pay $20/hr but this business is the kind of place that feels no guilt or pity for hiring a worker and scheduling on call for 2 shifts in a month.  It's the kind of place where people are disposable and the employers will lie and say you'll work close to full time in one breath and then have you work 24 hours three weeks later.",
            "title_similarity": "0.7378297",
            "sentiment_compound": 0.6249
        },
        {
            "id": "hywk6dw",
            "score": 1,
            "text": "profit over people…",
            "title_similarity": "0.48127985",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hywklt7",
            "score": 1,
            "text": "I get the game of people wanting to directly track a path for these things but it’s just basic principles driven by so many forces.  We printed a bunch of money.. we get inflation.  The economy is just a sponge soaking up that money and it spits out the expected results in a variety of ways. Inflation is one of those.",
            "title_similarity": "0.72038305",
            "sentiment_compound": 0.0
        },
        {
            "id": "hywl7r7",
            "score": 1,
            "text": "lol how else does inflation happen? the man up top will always need more..",
            "title_similarity": "0.46950963",
            "sentiment_compound": 0.5574
        },
        {
            "id": "hywlda1",
            "score": 1,
            "text": "Bad title. Majority of people polled said they want to crack down on corporation making large profits.",
            "title_similarity": "0.8346383",
            "sentiment_compound": -0.0772
        },
        {
            "id": "hywljrh",
            "score": 2,
            "text": "I mean, they're not wrong are they? The big corps tend to like a steady profit & if it ever dips, they raise prices and shrink sizes",
            "title_similarity": "0.6141088",
            "sentiment_compound": 0.7878
        },
        {
            "id": "hywlo6j",
            "score": 2,
            "text": "They did build an army of uneducated rednecks to defend them",
            "title_similarity": "0.4822489",
            "sentiment_compound": 0.0
        },
        {
            "id": "hywlprm",
            "score": 1,
            "text": "It’s called gouging!",
            "title_similarity": "0.14379376",
            "sentiment_compound": 0.0
        },
        {
            "id": "hywlz9l",
            "score": 1,
            "text": "They keep us embroiled in a culture war so we don’t wake up to the class war.",
            "title_similarity": "0.44792894",
            "sentiment_compound": -0.8316
        },
        {
            "id": "hywlzcx",
            "score": 1,
            "text": "I have never heard of this argument",
            "title_similarity": "0.087886505",
            "sentiment_compound": -0.4357
        },
        {
            "id": "hywm82w",
            "score": 2,
            "text": "Corporations AND the politicians they own.",
            "title_similarity": "0.5785809",
            "sentiment_compound": 0.0
        },
        {
            "id": "hywmckm",
            "score": 1,
            "text": "hah, I like they way they pretend the news is somehow not entirely 100% sponsored by corporate money\n\nthe last news corps to make money were the tv ones and even they needed advertising, in the age of commercial less streaming their now completely dependent on corporations for revenue.",
            "title_similarity": "0.6945424",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hywmhnt",
            "score": 1,
            "text": "I think it’s time we humans across the world affected by inflation and stagnant wages, while corporations record profits, to dine n’ dash, bump the energy bills, mortgage repayments and loan repayments. If we all decide to keep our shit but don’t pay for it the companies will have to rethink their game plan.",
            "title_similarity": "0.78120875",
            "sentiment_compound": -0.1779
        },
        {
            "id": "hywmlwv",
            "score": 1,
            "text": "No doi",
            "title_similarity": "-0.021420535",
            "sentiment_compound": -0.296
        },
        {
            "id": "hywmp9o",
            "score": 1,
            "text": "Should be all because it is them.",
            "title_similarity": "0.0494465",
            "sentiment_compound": 0.0
        },
        {
            "id": "hywmrnp",
            "score": 3,
            "text": "I wanna call this situation “scamflation” where business use price increases in some sectors to justify price gouging across the board",
            "title_similarity": "0.70071775",
            "sentiment_compound": 0.0
        },
        {
            "id": "hywmuv9",
            "score": 1,
            "text": "The cope is hard with this one.",
            "title_similarity": "0.14166348",
            "sentiment_compound": -0.1027
        },
        {
            "id": "hywnsw7",
            "score": 3,
            "text": "When CEO incomes rose more than 900% and yours less than 5% in the same time frame, who else are you going to blame?  the \"dEmOcRaTs\"??",
            "title_similarity": "0.6810821",
            "sentiment_compound": -0.4479
        },
        {
            "id": "hywo0z4",
            "score": 3,
            "text": "Wait…are you telling me that prices going up while simultaneously these companies report record profits means that inflation is largely caused by their own greed? Color me surprised!",
            "title_similarity": "0.77879167",
            "sentiment_compound": 0.3382
        },
        {
            "id": "hywo1n5",
            "score": 1,
            "text": "What ever gave them that idea?",
            "title_similarity": "0.03144694",
            "sentiment_compound": 0.0
        },
        {
            "id": "hywoc3w",
            "score": 1,
            "text": "I wonder what other effects corporate profiteering may have had…",
            "title_similarity": "0.5471133",
            "sentiment_compound": -0.1531
        },
        {
            "id": "hywoe81",
            "score": 1,
            "text": "The fed is to blame for inflation. They increased the money supply by over 30% in two years.",
            "title_similarity": "0.6841526",
            "sentiment_compound": -0.0772
        },
        {
            "id": "hywp2rp",
            "score": 2,
            "text": "This is the way.",
            "title_similarity": "-0.10659848",
            "sentiment_compound": 0.0
        },
        {
            "id": "hywp9v5",
            "score": 1,
            "text": "[deleted]",
            "title_similarity": "0.14869753"
        },
        {
            "id": "hywphpx",
            "score": 2,
            "text": "All you have to do is look at their margins. If their margins are going up then they're totally profiting from inflation, if their margins are not going up that means they're just charging you enough to offset the increase in their costs.",
            "title_similarity": "0.6582731",
            "sentiment_compound": 0.6361
        },
        {
            "id": "hywpmnf",
            "score": 1,
            "text": "I find it hard to believe one could cherry-pick enough survey respondents who lack the awareness that the costs of fuel and electricity are embedded into everything we all pay for.  And that things of a highly processed nature sometimes suffer a several times multiplying effect for the cost of energy contained within them.  \n\nObviously, the generation of content to agree with whichever narrative the signer of the author's paycheck desires, consumes as much fuel as a nice, long overdue, email to mom.  For just a bit more, a long overdue phone call to grandma. \n\nI'm just grateful to know that the corporate profiteering organizations I have been a part of are so greedy that they understand what a huge windfall can be made by undercutting the price of their competition.  Especially in the age when a price comparison is as close as a consumer's mobile device.  Maybe those surveyed are wealthy enough to fall into the class of elites who don't ever make a purchasing decision based on price?\n\nDo the profits gained from a forced government vaccine program count in those survey results?  Should we count the profits gained by politicians who invest in \"Green Energy\" then do everything within their power to raise the cost of energy to those they serve?   \n\nOn the other hand, those surveyed might also be that same group with failing scores on a simple test for critical thinking?  How nice to live in an age where that no longer matters.  A simple \"search\" on Google will provide anyone in doubt with the \"correct\" information to put their mind at ease.   \n\nSince it's on the interweb it must be true!  ... right?",
            "title_similarity": "0.6386004",
            "sentiment_compound": 0.9467
        },
        {
            "id": "hywpsue",
            "score": 1,
            "text": "Oreos went from $2.99 a pack to $4.99 a pack. Corporate greed.",
            "title_similarity": "0.75960094",
            "sentiment_compound": -0.4019
        },
        {
            "id": "hywpw3v",
            "score": 1,
            "text": "Capitalism loves this fucking trick, companies will use any excuse to jack prices.",
            "title_similarity": "0.56081825",
            "sentiment_compound": 0.5434
        },
        {
            "id": "hywpzib",
            "score": 1,
            "text": "Impressive. A majority of Americans believe the factual truth.",
            "title_similarity": "0.47985518",
            "sentiment_compound": 0.6808
        },
        {
            "id": "hywq9tp",
            "score": 1,
            "text": "Not News Folks.  COVID and it's danger made millionaires billionaires.  Now should anyone give a damn about relieving them of some of \"our\" hard paid cash, and tax them so we can re-build our nation and educate our kids?  Advantaging them should not be allowed to be a great profit.  Taxes, taxes, taxes.",
            "title_similarity": "0.7262809",
            "sentiment_compound": 0.6808
        },
        {
            "id": "hywqqan",
            "score": 2,
            "text": "I'm sure printing (In the last year and a half) 40% of all the money that has ever been printed in America has nothing to do with it 🙄",
            "title_similarity": "0.57478535",
            "sentiment_compound": 0.3182
        },
        {
            "id": "hywr539",
            "score": 1,
            "text": "I like how most of you who live in a first world country seem to not have a goddamn idea of what inflation is and its consequences. Come to Argentina and live here for just a year with our currency and wages and tell me if it really is corporate profiteering.",
            "title_similarity": "0.69594663",
            "sentiment_compound": 0.4923
        },
        {
            "id": "hywrk4z",
            "score": 1,
            "text": "This thread discussion is encouraging.  People seem to understand that the real root of the problems is too much money, too much liquidity, and too much stimulus.  Corporations don't cause inflation.  Inflation is caused by much larger macro forces like the Federal Reserve and the US govt.  This article is a trash fringe piece when public knows it is because of government policies themselves causing the problem.  It's always easier to try to deflect blame to those evil corporations than to admit that govt policies are the fundamental reasons for exploding inflation.",
            "title_similarity": "0.7118236",
            "sentiment_compound": -0.4019
        },
        {
            "id": "hywroa0",
            "score": 1,
            "text": "Higher prices can cause some inflation. Real inflation is caused by an increase in the money supply - the amount of money in use. When the Federal Reserve turns on the printer and increases the money supply by 40% in two years, you can expect inflation to occur.\n\nSource: \n\n[The economics of money, banking and financial markets / Frederic S. Mishkin](http://www.google.com/url?sa=t&rct=j&q=&esrc=s&source=web&cd=&cad=rja&uact=8&ved=2ahUKEwijwpGFg6X2AhVDIUQIHXQMAMMQFnoECAUQAQ&url=http%3A%2F%2Fbibliotheque.pssfp.net%2Flivres%2FTHE_ECONOMICS_OF_MONEYS_BAMKING_AND_FINANCIAL_MARKETS.pdf&usg=AOvVaw35j0zRqPGZuFp99GE4QO4Z)\n\nPage 666 (Seriously, page 666)\n\nPage 702 has a great TL;DR\n\nIn the aggregate demand and supply analysis of Chapter 24, you learned that other factors besides changes in the money supply (such as fiscal policy and supply shocks) can affect the aggregate demand and supply curves. Doesnt this suggest that these other factors can generate persistent high inflation? The answer, surprisingly, is no.",
            "title_similarity": "0.68980944",
            "sentiment_compound": 0.5661
        },
        {
            "id": "hyws7tq",
            "score": 2,
            "text": "And this is why democracy is a terrible idea, because a majority of people are stupid af. We’ve been printing money like crazy for the last two years, it’s an easy recipe for massive inflation.",
            "title_similarity": "0.76587135",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hyws9eb",
            "score": 2,
            "text": "Corporations can't cause inflation. All this poll does is show that people dont know the first thing about economics,which makes sense as it's not a particularly intuitive field.\n\nI also love how the media changed from 'it's supply chain' to 'it's greed' without missing a beat and no one seemed to care -- they just went with it.",
            "title_similarity": "0.54838383",
            "sentiment_compound": 0.6584
        },
        {
            "id": "hywse22",
            "score": 1,
            "text": "Public school failure really biting this country in the ass.",
            "title_similarity": "0.5252563",
            "sentiment_compound": -0.7783
        },
        {
            "id": "hywsl1s",
            "score": 2,
            "text": "Yes. Because printing ~40% of all USD in circulation in a few years time definitely didn't cause it...!",
            "title_similarity": "0.5660036",
            "sentiment_compound": 0.69
        },
        {
            "id": "hywsno4",
            "score": 1,
            "text": "corporations: YEAH, BUT WHAT CAN U FKING GONNA DO ABOUT IT?",
            "title_similarity": "0.4304212",
            "sentiment_compound": 0.2421
        },
        {
            "id": "hywso76",
            "score": 1,
            "text": "Corporations are greedy fucks by design, but look at the federal govt and the federal reserve for the cause of inflation.  People should look into the principals of sound money and realize fiat is basically trash.",
            "title_similarity": "0.7963957",
            "sentiment_compound": -0.4019
        },
        {
            "id": "hywt6n1",
            "score": 2,
            "text": "I've been sayimg this to people who are always like 'thanks Biden' um no.... big companies that made, for example, 6 billion dollars in 2018 made like 7billion in 2019, 12billion in 2020, 11billion in 2021, and decided they absolutely can't go back to their 'tragic' pre-pandemic profits and are like 'how can we use this as an opportunity to get back up to 12 billion, and go beyond?' so they blame inflation, which yes costs of things and difficulty shipping exist, but the biggest companies that run the USA and other countries refuse to just go back to earning a 'measly' 6-8billion in profits and instead pass the costs of their profits onto us while crying 'woe is me' like they are in any danger of going out of business.\n\nSuck it up buttercup you only get a 1mil bonus this year instead of a 3mil, wah wah.",
            "title_similarity": "0.70079625",
            "sentiment_compound": 0.2408
        },
        {
            "id": "hywtb9y",
            "score": 1,
            "text": "*Surprised pikachu face*",
            "title_similarity": "0.33717543",
            "sentiment_compound": 0.2263
        },
        {
            "id": "hywtqqe",
            "score": 1,
            "text": "In my mind it’s all part of the plan. We will go into a recession/depression soon and they are milking every last dime they can before that happens. Then when we are in a depression, prices might drop some, but they will STILL be making a profit. Then if any smaller companies start to loose profit they will be gobbled up as acquisitions from the bigger conglomerates. This is how we have HUGE corporations that own hundreds of not thousands of other small companies. Everyone needs to shop small, shop local. The problem with that, is shopping small and local is EXPENSIVE, so most people HAVE to shop at the big chains to be able to afford to live. And so the vicious cycle continues.",
            "title_similarity": "0.7332473",
            "sentiment_compound": -0.0818
        },
        {
            "id": "hywu4a9",
            "score": 2,
            "text": "We simply cannot keep interest rates at rock bottom levels, print trillions in stimulus cash and mail checks to people's doorsteps without causing massive inflation. \n\nThe US government was never designed or intended to prop up businesses or individuals. More thumb pressing to tilt the scales will only create a bigger backlash once the stimulus is removed. \n\nYou can't buy your way to prosperity and business that keep seeing operating cost and tax increases will always respond by raising prices on consumers. It's simple cause and effect.",
            "title_similarity": "0.6436082",
            "sentiment_compound": -0.0976
        },
        {
            "id": "hywu7q3",
            "score": 1,
            "text": "That is a no brainer",
            "title_similarity": "0.024234025",
            "sentiment_compound": -0.296
        },
        {
            "id": "hywucg7",
            "score": 1,
            "text": "Maybe cuz more than half of America's classes are the working cass",
            "title_similarity": "0.6307063",
            "sentiment_compound": 0.0
        },
        {
            "id": "hywuio0",
            "score": 2,
            "text": "So poll shows majority of Americans don't understand their financial system yet",
            "title_similarity": "0.71988666",
            "sentiment_compound": 0.0
        },
        {
            "id": "hywvoas",
            "score": 1,
            "text": "Well, a lot of people are idiots.",
            "title_similarity": "0.38080728",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hywvvw6",
            "score": 1,
            "text": "So Covid lock downs and people demanding (and getting) higher wages had nothing to do with it.",
            "title_similarity": "0.44033962",
            "sentiment_compound": -0.2263
        },
        {
            "id": "hyww0pc",
            "score": 1,
            "text": "If knowing is half the battle, then what is next??",
            "title_similarity": "0.32503107",
            "sentiment_compound": -0.4515
        },
        {
            "id": "hyww9wy",
            "score": 1,
            "text": "Great! Now what do we DO about it?",
            "title_similarity": "-0.009015987",
            "sentiment_compound": 0.6588
        },
        {
            "id": "hywwocc",
            "score": 1,
            "text": "commondreams.org\n\nSo, only leftist websites are white-listed for \"balanced Info\"?\n\nColor me surprised.",
            "title_similarity": "0.5113726",
            "sentiment_compound": 0.2263
        },
        {
            "id": "hywwpzv",
            "score": 1,
            "text": "I'm noticing many products are increasing in price by 20%, not the 5-7% of inflation. Some of them are also shrinking in volume.",
            "title_similarity": "0.5851393",
            "sentiment_compound": 0.0
        },
        {
            "id": "hywwq4r",
            "score": 1,
            "text": "This is the Federal Reserve's fault, much like many things in the U.S. today. These independent global banking institutions and their greed ruin the lives of people globally at a stroke of a pen.",
            "title_similarity": "0.6962329",
            "sentiment_compound": -0.7717
        },
        {
            "id": "hywwuk8",
            "score": 1,
            "text": "Duh.  When companies like Amazon have record profits and then raise the price of Prime while Bezos and company are incredibly rich there is a problem.",
            "title_similarity": "0.6761824",
            "sentiment_compound": 0.807
        },
        {
            "id": "hywwv1e",
            "score": 1,
            "text": "Maybe that trucker convoy ought to reroute and protest the true enemy of freedom, or whatever cliche phrase gets them focused on bringing attention to corporate profiteering.",
            "title_similarity": "0.63865626",
            "sentiment_compound": 0.5423
        },
        {
            "id": "hywwveh",
            "score": 1,
            "text": "Are you guys serious? Look how much money we printed off in the past 2 years….\n\nThat’s the reason…?\n\nhttps://www.google.com/amp/s/www.nasdaq.com/articles/money-printing-and-inflation%253A-covid-cryptocurrencies-and-more%3Famp",
            "title_similarity": "0.6549003",
            "sentiment_compound": -0.168
        },
        {
            "id": "hywwy72",
            "score": 2,
            "text": "Tax the rich",
            "title_similarity": "0.66134995",
            "sentiment_compound": 0.5574
        },
        {
            "id": "hywx4zt",
            "score": 1,
            "text": "When you serve shareholders vs humanity you lose.",
            "title_similarity": "0.57563114",
            "sentiment_compound": -0.4019
        },
        {
            "id": "hywxkh5",
            "score": 1,
            "text": "Duh.",
            "title_similarity": "-0.038640954",
            "sentiment_compound": 0.0
        },
        {
            "id": "hywxrqm",
            "score": 1,
            "text": "Poll shows a majority of us voters are fucking dumber than anyone one thought possible",
            "title_similarity": "0.7207423",
            "sentiment_compound": -0.4201
        },
        {
            "id": "hywy4cy",
            "score": 1,
            "text": "I feel a Revolutionary War coming. British Profiteering was one of the reasons the US Revolution begun.",
            "title_similarity": "0.54653084",
            "sentiment_compound": -0.6705
        },
        {
            "id": "hywyp3s",
            "score": 1,
            "text": "Corporate profits can't be at record highs with supposed record increases to their costs. \n\nThere is clearly price fixing in all markets for goods and services and the labor market. \n\nThis can only happen because almost all US markets are controlled by monopolies, cartels, or monopsonies. \n\nTime to start trust busting like Teddy Roosevelt if we want to tackle inflation and wage deflation.",
            "title_similarity": "0.7640203",
            "sentiment_compound": 0.8934
        },
        {
            "id": "hywysml",
            "score": 1,
            "text": "when they learn that so called inflation is because all the emision their Federal Reserve did during the pandemic, they will understand the principles of inflation.",
            "title_similarity": "0.691594",
            "sentiment_compound": 0.0
        },
        {
            "id": "hywytyw",
            "score": 1,
            "text": "Well, no duh!  Prices are rising (a lot) and the majority of American voters aren't making more money.  Well, that money is going SOMEWHERE, and it isn't to us.  Who does that leave as the recipients?",
            "title_similarity": "0.77940047",
            "sentiment_compound": 0.3336
        },
        {
            "id": "hywza9r",
            "score": 1,
            "text": "Water is wet....",
            "title_similarity": "-0.023619197",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyx03e0",
            "score": 1,
            "text": "It finally happened! The general public got something right for once!",
            "title_similarity": "0.16157553",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyx03t1",
            "score": 1,
            "text": "The story says “The survey found that 80% of voters want the federal government to \"crack down on large corporations that raise prices unfairly.\"”\nThat’s different from blaming them for it. \nMost of the inflation is from monetary policy—pumping $ into the economy—raising wage floor—supply chain fail leading to supply/demand price increases.",
            "title_similarity": "0.8625009",
            "sentiment_compound": -0.7506
        },
        {
            "id": "hyx04te",
            "score": 1,
            "text": "  \nI would love to see the wording of the questions in that poll.   \n\n\nI read the number of democrats not running for reelection for US congress and wow I think they know who voters are going to blame.",
            "title_similarity": "0.5947064",
            "sentiment_compound": 0.7845
        },
        {
            "id": "hyx1qva",
            "score": 1,
            "text": "So, we can vote on causes now instead of studying what’s actually happening?    Rising cost of labor, supply chain shortages because of pandemic reduced workforce’s driving up demand….  Yea none of that; it’s clearly profit hungry corporations….  Got it",
            "title_similarity": "0.7567795",
            "sentiment_compound": 0.6124
        },
        {
            "id": "hyx41uu",
            "score": 1,
            "text": "In part, there’s obviously more reasons. What I wish folks would stop doing is placing full responsibility on the president and look at all the factors.",
            "title_similarity": "0.5398901",
            "sentiment_compound": 0.128
        },
        {
            "id": "hyx6jyp",
            "score": 2,
            "text": "Poll shows majority of US voters are actually paying attention for once!!",
            "title_similarity": "0.49635014",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyx78y4",
            "score": 1,
            "text": "His name is Charlie Munger and he was the first  to raise prices. I hope the dirt is warmer to him than me.",
            "title_similarity": "0.5249723",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hyx7xec",
            "score": 1,
            "text": "Blame corporations for lack of any response to greenhouse effect,  tax breaks slanted to the wealthiest, corruption of representatives, greed driven inflation,  pollution of environment, toxic substance exposure.....",
            "title_similarity": "0.7502927",
            "sentiment_compound": -0.4939
        },
        {
            "id": "hyx9964",
            "score": 2,
            "text": "If your company profits are getting larger, you are not being negatively impacted by inflation. You're just profiteering.",
            "title_similarity": "0.5003724",
            "sentiment_compound": 0.3182
        },
        {
            "id": "hyxdbpy",
            "score": 2,
            "text": "Not surprised, this country was founded on that principle",
            "title_similarity": "0.10989723",
            "sentiment_compound": -0.1695
        },
        {
            "id": "hyxf13s",
            "score": 1,
            "text": "Alternative title: Poll Shows Majority of US Voters not as easily fooled as some thought.",
            "title_similarity": "0.59002376",
            "sentiment_compound": 0.0382
        },
        {
            "id": "hyxfukn",
            "score": 1,
            "text": "As. They. Should.     Stop listening to Faux News",
            "title_similarity": "0.33688122",
            "sentiment_compound": -0.296
        },
        {
            "id": "hyxi74y",
            "score": 1,
            "text": "All set in motion when the fed lowered rates to zero. The interest rate should never be zero.",
            "title_similarity": "0.4156102",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hyxifhb",
            "score": 1,
            "text": "You can ask polls to get the results you want.  How about Biden cutting oil independence.  Higher fuel prices to truck items drives up costs too.  How about vaccine mandates creating a supply line crisis (supply and demand).  How about stop turning a political blinds eye?  How about government over spending devalues the dollar (build back worse Biden).",
            "title_similarity": "0.6914022",
            "sentiment_compound": -0.836
        },
        {
            "id": "hyxktc2",
            "score": 1,
            "text": "If wages go up 5% and inflation 7%, then it’s not the wages…",
            "title_similarity": "0.5375732",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyxmqq4",
            "score": 1,
            "text": "Well the people being polled are pretty stupid then . It’s not like maximizing profit didn’t exist before 2021 or that countries without profiteering didn’t experience inflation",
            "title_similarity": "0.61327845",
            "sentiment_compound": -0.2896
        },
        {
            "id": "hyxo4w4",
            "score": 1,
            "text": "Yes do corporations take advantage of inflation and raises prices higher than need? They absolutely do but you have to be crazy to not get that spending and printing more money than we have ever before causes the inflation… the rest is just price gouging.",
            "title_similarity": "0.74604315",
            "sentiment_compound": -0.1901
        },
        {
            "id": "hyxqe9o",
            "score": 1,
            "text": "America is really broke because politicians who represent all of us, on both sides of the aisle  have continued to spend and print money out of thin air. Its madness.  Inflation happens when the money you have is worth less and the dollar is worth less as each day goes by.  We owe an unbelievable debt of $30 trillion, yet like a drunkard  on a spending spree, we  continue  to ignore the sign posts, all along the way, that warned us of an impending day coming when we'd be forced to   pay the piper.  For a brief moment in 2010 Obama and Congress passed a budget that cut spending across the board. It was a start that got shot down when the economy began to improve and we decided to turn the music up full blast and dance. The party and drunken dancing just goes on, but the crisis in Europe will force the issue we've all been avoiding for so long. The music is about to stop",
            "title_similarity": "0.7815441",
            "sentiment_compound": -0.9382
        },
        {
            "id": "hyxr3tb",
            "score": 1,
            "text": "So the several trillion dollars the Fed printed in 2020 to 2021 is pure coincidence.",
            "title_similarity": "0.4911826",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyxrlfm",
            "score": 1,
            "text": "Duh. They knew once the pandemic was mostly over, the demands for all goods would be high. So, this is capitalism greed at it's worst",
            "title_similarity": "0.70202273",
            "sentiment_compound": -0.7783
        },
        {
            "id": "hyxs4xn",
            "score": 1,
            "text": "As they should",
            "title_similarity": "-0.06979661",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyxt2di",
            "score": 1,
            "text": "The more interesting thing is that once the war comes, the first people to escape must be the super rich, haha",
            "title_similarity": "0.63882864",
            "sentiment_compound": 0.8832
        },
        {
            "id": "hyxw2z6",
            "score": 2,
            "text": "Absolutely, record billions in profits due to high demands, followed by higher prices for goods and services and paid for by the availability of money from government pandemic relief funds. The rich get richer while the economy is feeling the pinch. That is capitalism in the good ole USA.",
            "title_similarity": "0.7108804",
            "sentiment_compound": 0.9468
        },
        {
            "id": "hyxxirg",
            "score": 1,
            "text": "Late-stage capitalism working as intended.\n\nThis is fucking depressing...",
            "title_similarity": "0.48795116",
            "sentiment_compound": -0.4391
        },
        {
            "id": "hyxxvb5",
            "score": 1,
            "text": "Ive seen rumors of $24/hr for target employees but the wording implies that will be for only some so hope thats not the case",
            "title_similarity": "0.5448382",
            "sentiment_compound": 0.7279
        },
        {
            "id": "hyxzqry",
            "score": 2,
            "text": "Confused the word “blame” for “realize”.",
            "title_similarity": "0.3717677",
            "sentiment_compound": -0.3182
        },
        {
            "id": "hyy38fi",
            "score": 1,
            "text": "Finally Americans are waking up.",
            "title_similarity": "0.2622606",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyy4vek",
            "score": 1,
            "text": "That same poll shows how clueless US voters are.",
            "title_similarity": "0.5472516",
            "sentiment_compound": -0.3612
        },
        {
            "id": "hyy5ouf",
            "score": 3,
            "text": "Every company I have joined in the last twenty years is owned by investment firms. They sell companies and buy them ,with no regard for human life.",
            "title_similarity": "0.6242329",
            "sentiment_compound": -0.296
        },
        {
            "id": "hyy5z96",
            "score": 1,
            "text": "Poll shows majority of US voters blame corporate profiteering for inflation. \n\nThis just in… Majority of US voters don’t know left from right and can’t point out Australia on a map. I wouldn’t take a public opinion poll on a complicated topic like inflation as evidence. Most of these people probably still think the dollars pegged to gold.",
            "title_similarity": "0.83365715",
            "sentiment_compound": -0.128
        },
        {
            "id": "hyy7cxj",
            "score": 1,
            "text": "Its good to know that people actually know where inflation comes from....Human Greed",
            "title_similarity": "0.60103625",
            "sentiment_compound": 0.0516
        },
        {
            "id": "hyy97m0",
            "score": 1,
            "text": "That's exactly what occurred especially after Trump's 0 tax cut for corporations and the upper 1% and yet Congress who has the Dem Majority has not reversed it.",
            "title_similarity": "0.64213276",
            "sentiment_compound": -0.2732
        },
        {
            "id": "hyyaawg",
            "score": 1,
            "text": "Yea , what’s new ?",
            "title_similarity": "0.008055953",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyye20l",
            "score": 1,
            "text": "I agree. We've had inflation for years. Prices went up bit by bit.\n\nHowever, the pandemic created so-called \"shortages,\" and greedy manufacturers  jumped on this opportunity to raise prices.  \n[Greedy Corporations are to Blame](https://www.commondreams.org/views/2021/12/03/money-hungry-corporations-blame-inflation?utm_term=AO&utm_campaign=Daily%20Newsletter&utm_content=email&utm_source=Daily%20Newsletter&utm_medium=Email)",
            "title_similarity": "0.73915833",
            "sentiment_compound": 0.3716
        },
        {
            "id": "hyyg43o",
            "score": 1,
            "text": "Have we grown an IQ in the last few days?",
            "title_similarity": "0.3074336",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyyyeat",
            "score": 1,
            "text": "Lets also not forget that politicians on both sides of the isle are in bed with certain corporations.\n\nThe big donors any candidate has is something you should always look at before even reading what their platform is or even their voting history on any bills at the state or federal level. Those donors are the ones they're far more likely to listen to than their own party or the demands of the people.",
            "title_similarity": "0.65208966",
            "sentiment_compound": 0.6669
        },
        {
            "id": "hyzat5i",
            "score": 2,
            "text": "How dare those corporations print more cash",
            "title_similarity": "0.6678088",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyzcor1",
            "score": 2,
            "text": "Polls show the majority of people don’t understand economics",
            "title_similarity": "0.6615834",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyzgskc",
            "score": 1,
            "text": "Shows how little people know.\n\nShows how little people know about their own economy (Basic Civics)\n\nCut oil production and you raise the price of fuel.  Raise fuel costs and EVERYTHING goes up. It costs farmers more to grow.  It costs processors more to process the food you eat and building materials. Raise fuel costs and it costs more to transport EVERYTHING. Throw in government Lock-Downs and Lock-Outs, and Demand rises WAY over Supply.\n\nNOW, pay people \"NOT\" TO WORK!  Wages go up from the growers, through the Raw Material Producers, through the processers, through the manufacturers, through the Distributors, through the Transportation Companies, through the Retailers....\n\nAdd in the ports in California, which can't keep up with the 120 Container Ships sitting out in its own harbors (due to CA's \"added on\" lock-downs and labor regulations) and you choke off Imports, (the Supply is THERE but can't be unloaded increasing DEMAND), then add in  the rise in transportation and labor cost (mentioned above) PLUS THE FACT that the ship owners have increased freight charges on containers from $2000 per container (pre-pandemic) to $20,000 per container (because California \"WILL NOT\" unload their containers to free up their ships, and **Viola**!!  **YOU HAVE INFLATION**!! OUT OF COTROL!!  **DUE TO THE GOVERNMENT**!!\n\nNow... If you want to talk COPORATE PROFITEERING!!  Look to the Pharmaceutical Companies to which \"The Government is paying\" EXORBITANT  (unregulated) RATES for GUARANTINED \"SALES\" OF VACCINES (NOT YET PRODUCED), ....while you are STILL PAYING TO MUCH FOR prescription drugs, (which \"the Government\" says is the FIRST THING ON THEIR AGENDA to \"lower\").",
            "title_similarity": "0.6857065",
            "sentiment_compound": -0.8002
        },
        {
            "id": "hyzk5u3",
            "score": 2,
            "text": "Well, it’s a two-step.\n\nStep 1. Corporate profiteering makes communities poor and individuals rich.\n\nStep 2. Instead of redistributing the wealth, we create more money for the poor communities: creating inflation.\n\nRepublicans point to the second step as the fault, instead of tackling the root cause.",
            "title_similarity": "0.75942135",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hyzqrwr",
            "score": 1,
            "text": "Cuz, yeah, duh.  Capitalism is unsustainable.",
            "title_similarity": "0.45628548",
            "sentiment_compound": 0.296
        },
        {
            "id": "hyzrdh9",
            "score": 1,
            "text": "It's excessive and ridiculous at this point.",
            "title_similarity": "0.204791",
            "sentiment_compound": -0.3612
        },
        {
            "id": "hyzyddk",
            "score": 1,
            "text": "Wow.  I know corps are out to profit. But when the entire supply chain to the consumer breaks down. Everyone pays more.",
            "title_similarity": "0.75616467",
            "sentiment_compound": 0.5187
        },
        {
            "id": "hz0ikxz",
            "score": 1,
            "text": "what else could it be. \n\nif the cost of making goods is not going up, but the prices being charged is sky rocketing, there is no other answer.",
            "title_similarity": "0.51648915",
            "sentiment_compound": -0.6124
        },
        {
            "id": "hz0nse7",
            "score": 1,
            "text": "I uh… never took this poll…",
            "title_similarity": "0.13536692",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz18sqt",
            "score": 1,
            "text": "This is pertinent not just for the U.S. \nin the U.K. our energy providers profits literally doubled while they successfully lobbied for the removal of the consumer protection cap on price increases.\n\nI like to call it Granny Freezing.",
            "title_similarity": "0.7051612",
            "sentiment_compound": 0.8519
        },
        {
            "id": "hz23hjt",
            "score": 2,
            "text": "That some fake BS right there. All polls blame Biden Admin. Stop gaslighting.",
            "title_similarity": "0.616014",
            "sentiment_compound": -0.7717
        },
        {
            "id": "hz2fw86",
            "score": 1,
            "text": "This inflation shit is due to mass amounts of money pumped into circulation because of Covid. It’s so easy to target “corporate greed”. If you take a look at the money that’s been injected it balances out with the price increases. I mean target in California is now paying 16.50 an hour. Bruh I remember back in 2013 when In N Out was paying 11.25 for level 1 and that shit was a prized job… When have humans not prized “profits”. Even during the bartering system, way back when, people have always trade to trade goods at the best price. That’s literally an innate human reaction. Like honestly, either we be happy with an entire market collapse like the Great Depression or we go along with the price increase of products. Shits going to suck for us millennials but to blame “corporate greed” is such an easy scapegoat.",
            "title_similarity": "0.7221091",
            "sentiment_compound": 0.1237
        },
        {
            "id": "hz4mlrd",
            "score": 1,
            "text": "Bull not even Americans are that stupid",
            "title_similarity": "0.39398295",
            "sentiment_compound": -0.5267
        },
        {
            "id": "hzcaz0k",
            "score": 1,
            "text": "Didn't the US government print billions of dollars overnight?",
            "title_similarity": "0.6318744",
            "sentiment_compound": 0.0
        },
        {
            "id": "hzo9uux",
            "score": 1,
            "text": "The US printed 3x our circulation 8n the last year.    Corporations or not, inflation is coming.",
            "title_similarity": "0.68358016",
            "sentiment_compound": 0.0
        },
        {
            "id": "hzp7up4",
            "score": 1,
            "text": "my friend - we try to have 99% of stock filled, now we have 50 - 70%, everything is hard to get and expensive\n\nOh is that hurting your business?\n\nNo we have the highest profits we have ever had\n\nOk?",
            "title_similarity": "0.63255197",
            "sentiment_compound": 0.2869
        },
        {
            "id": "hzrhcwe",
            "score": 2,
            "text": "So nice people have FINALLY noticed that goods don't have sentient price-tags that automatically inflate when they detect higher wages. Next big step will be to recognize that a  \"Corporation\" can't DO diddly-squat and it's the ACTUAL PEOPLE *running* the Corporation that pollute our water, poison our food and redistribute our income and wealth. Perhaps folks will eventually tumble to the fact from about 1934 until 1974, 96 cents for every dollar of additional productivity workers created wound up in the workers' pay and benefits and the only thing that changed was the Top Marginal Rate that had kept the ones dividing the profits form simply keeping it all for themselves, which has been the case SINCE the mid-70's.",
            "title_similarity": "0.6834567",
            "sentiment_compound": 0.7501
        },
        {
            "id": "hzsvhup",
            "score": 1,
            "text": "Could some crayon-eating apes help with DD on oil company profits from pre-Covid to now?  \n\nThis feels definitely like price gouging making up for two bad years.",
            "title_similarity": "0.65850115",
            "sentiment_compound": 0.743
        },
        {
            "id": "hzynn11",
            "score": 2,
            "text": "The majority of US voters don't understand economics",
            "title_similarity": "0.5848577",
            "sentiment_compound": 0.0
        },
        {
            "id": "i0hhmlo",
            "score": 1,
            "text": "It’s the partnership between big business and the government. It’s called fascism. The government allows its allies to win in return for edicts and the imposition of rules to the people at the direction of the government. But, the government gets to claim that they didn’t do any of this stuff. Also, if you for one second don’t think that printing money and runaway spending isn’t mostly to blame, then your in denial. Term limits.",
            "title_similarity": "0.7150464",
            "sentiment_compound": -0.1779
        },
        {
            "id": "i0zla25",
            "score": 1,
            "text": "Eh I’d say maybe under Trump. But Biden wouldn’t allow this.",
            "title_similarity": "0.31190485",
            "sentiment_compound": 0.3291
        },
        {
            "id": "i20gxud",
            "score": 1,
            "text": "They have fed off the PPP trough and they do not want anyone to turn off the spigot that feeds them.",
            "title_similarity": "0.31186685",
            "sentiment_compound": -0.0572
        },
        {
            "id": "i2jd5xq",
            "score": 1,
            "text": "THIS HEADLINE IS PURE UNADULTERATED BULLSHIT YHE MAJORITY IN AMERICA KNOW INFLATION IS A DIRECT RESULT OF THIS MORONIC PRESIDENT BIDEN OVERHEATING A HOT BALANCED TRUMP ECONOMY WITH 3.5 TRILLION DOLLARS IN PAPER DOLLARS WITH NO PRODUCTIVITY TO BACK IT UP CREATING A MESS WITH CHEAP DEVALUED PILES OF CASH TOSSED INTO THE ECONOMY TOTALLY DESTABILIZING THE STEADY PRODUCTIVE GROWTH OF THE AMERICAN ECONOMY AND PARALELL CORRESPONDING h GROWTH IN THE VALUE OF THE DOLLAR\nBIDEN IS A FUCK UP  HE IS WN EXAMPLE OF THE SWAMP PREZ TRUMP WAS ABOUT TO PERMANENTLY  EXTRACT.   WITH THE HELP OF 5,000 SECRET SEALED INDICTMENTS THE SWAMP WAS GOING TO DRAIN LEAVING THE BIDENS AMONG THE MANY THOUSANDS OF ELECTED AND NONELECTED BUREAUCRATS FINDING. THEIR CORRUPTED  ASSES FLEEING TO SAFE GROUND SOMEWHERE AROUND TIERA DEL FUEGO  … you know the southernmost populated tip of South America .., or Gitmo ..,\nAnd of course out of the American federal government  maybe we will give these corrupt worthless holier than thou mentality’ .gov worker bees  a choice of the tip South  America Gitmo or your local federal prison  when it’s all over  that right! Th swamp will get drained scrubbed and new fresh water with constitutional fish and reptiles frolicking in a fresh new America brothers!\nNuff said Ross A.\nIN TRUMP WE TRUST",
            "title_similarity": "0.728797",
            "sentiment_compound": -0.4725
        }
    ]
}