{
    "Zelensky urges Biden to say something ‘strong’ and ‘useful’ in State of the Union speech: ‘I’m not in a movie, I’m not iconic’\n": [
        {
            "id": "hyxo15d",
            "score": 1,
            "text": "\nAs a reminder, this subreddit [is for civil discussion.](/r/politics/wiki/index#wiki_be_civil)\n\nIn general, be courteous to others. Debate/discuss/argue the merits of ideas, don't attack people. Personal insults, shill or troll accusations, hate speech, any suggestion or support of harm, violence, or death, and other rule violations can result in a permanent ban. \n\nIf you see comments in violation of our rules, please report them.\n\n For those who have questions regarding any media outlets being posted on this subreddit, please click [here](https://www.reddit.com/r/politics/wiki/approveddomainslist) to review our details as to our approved domains list and outlet criteria.\n \n **Special announcement:**\n \n r/politics is currently accepting new moderator applications.  If you want to help make this community a better place, consider [applying here today](https://www.reddit.com/r/politics/comments/sskg6a/rpolitics_is_looking_for_more_moderators/)!\n\n***\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/politics) if you have any questions or concerns.*",
            "title_similarity": "0.59477985",
            "sentiment_compound": -0.3895
        },
        {
            "id": "hyy2qg4",
            "score": 40,
            "text": "Zelensky should be commended for his defiance of Russia and bravery in staying in Kyiv when he’s Target #1 of Russian forces.  \n\nWith that said, the tone he repeatedly takes with the US is getting on my nerves.  Just weeks ago, he was telling the world and berating the US  that it was unnecessarily creating panic by saying Russian invasion of  Ukraine was imminent.  Turns out the US was right. US has stood ready to evacuate Zelensky if needed and he dismissed that with a “I need ammunition, not a ride”.  What about saying instead “thanks but I want to stand with Ukrainian soldiers to defend our home?“. Since the Russian invasion, the US has imposed crippling sanctions on Russia, sent monetary aid and intelligence to Ukraine but Zelensky wants Biden to say something “useful” in his State of the Union address?  So what of all the things the US has done so far?  Not useful at all?\n\nLook I get that he and his country are in a desperate situation but he needs to quit trying to belittle and order the US around.  Ukraine is not a NATO member or part of any military alliance with the US so the US is not obligated to go in with military action in its defense.  The US is trying navigate a complicated situation without triggering a world war that can result in nuclear winter worldwide.  Wisecracking and sarcasm from Zelensky is completely unhelpful in this situation.",
            "title_similarity": "0.52415454",
            "sentiment_compound": -0.9172
        },
        {
            "id": "hyywbh1",
            "score": -7,
            "text": "I wish people would do their own research on Zelensky. This guy isn’t who you think he is. 99% of you had never heard of this guy until a week ago. It’s pathetic how many people will drop everything to worship a guy without even questioning the narrative. What a time to be alive 🤮",
            "title_similarity": "0.52486193",
            "sentiment_compound": 0.2491
        },
        {
            "id": "hyy0eky",
            "score": -7,
            "text": "[deleted]",
            "title_similarity": "0.35716873"
        },
        {
            "id": "hyywmrp",
            "score": 1,
            "text": "Shit, we are just happy if he completes a sentence.",
            "title_similarity": "0.24712607",
            "sentiment_compound": 0.1027
        },
        {
            "id": "hyyqmsk",
            "score": -5,
            "text": "So many here kept mentioning Trump. You all miss him? \n\nJoe’s in the office btw. Do something to show the world USA lead the free world.",
            "title_similarity": "0.5056205",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hyytf5g",
            "score": -1,
            "text": "Zelensky could not have picked two words that less accurately describe Joe.",
            "title_similarity": "0.52179587",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyyy0x8",
            "score": -1,
            "text": "Cmon man you know the uhhh I have hairy legs mannn who shit my pants??",
            "title_similarity": "0.28140545",
            "sentiment_compound": -0.6072
        },
        {
            "id": "hyy0ggk",
            "score": -1,
            "text": "Good advice for all our old, grifting, out-of-touch politicians.",
            "title_similarity": "0.49089193",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hyy6jou",
            "score": 1,
            "text": "Dude shouldn’t put himself down like that he’s become iconic over the past few days I’d say",
            "title_similarity": "0.5546628",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hyz1ybg",
            "score": 3,
            "text": "Zelensky tells Biden that he needs to show stronger support.\n\nRedditors in comment section: TRUMP TRUMP TRUMP…..you guys have got to be kidding me 😂",
            "title_similarity": "0.6451965",
            "sentiment_compound": 0.8225
        },
        {
            "id": "hz00fu5",
            "score": 0,
            "text": "Reddit really loves to idolize random people",
            "title_similarity": "0.28174424",
            "sentiment_compound": 0.6115
        },
        {
            "id": "hyy0sl5",
            "score": 10,
            "text": "This man makes me believe, now more than ever, that we should have age limits for every political office.",
            "title_similarity": "0.51879454",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyynxug",
            "score": -9,
            "text": "We still talking about trump? Jesus.",
            "title_similarity": "0.5342391",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyytpb6",
            "score": -5,
            "text": "Has anyone actually heard Biden ever say anything useful or strong? Not really his forte.",
            "title_similarity": "0.6081581",
            "sentiment_compound": 0.7351
        },
        {
            "id": "hyysv31",
            "score": -1,
            "text": "If I were Biden, I would be offended thatthis guy is trying to tell me what to say in my state of the union.",
            "title_similarity": "0.5688918",
            "sentiment_compound": -0.25
        },
        {
            "id": "hyzv5zj",
            "score": -1,
            "text": "And biden should cancel student debt & move cannabis to schedule 2.",
            "title_similarity": "0.4851513",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hyyrfm4",
            "score": -5,
            "text": "He won’t, he can barely read a teleprompter. If there is something strong and iconic on there, he’ll stutter his way through it and add random pauses to the middle of the sentence.",
            "title_similarity": "0.70874834",
            "sentiment_compound": 0.3818
        },
        {
            "id": "hyyvxzz",
            "score": -10,
            "text": "Y’all keep talking about trump but refuse to realize our current leader is a complete pushover and failure. Trump wasn’t good either but quit talking about the past and realize how terrible we are now.",
            "title_similarity": "0.57528365",
            "sentiment_compound": -0.8201
        },
        {
            "id": "hyxt2xc",
            "score": 20,
            "text": "At this point we should just get Zelenskyy to make the address with Biden being the guy in the background playing the hype man by just nodding in agreement and going \"yeah, yeah\".",
            "title_similarity": "0.43281615",
            "sentiment_compound": 0.8126
        },
        {
            "id": "hyygitq",
            "score": 0,
            "text": "Biden looks out for America and NATO.",
            "title_similarity": "0.4100983",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyynxc9",
            "score": 0,
            "text": "Wasn't he a tv star in ukraine?",
            "title_similarity": "0.33743447",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz0d4o8",
            "score": 0,
            "text": "Wtf else does he expect from the US..?? This isn’t our war or our problem..",
            "title_similarity": "0.71851337",
            "sentiment_compound": -0.8948
        },
        {
            "id": "hyzz6v9",
            "score": -2,
            "text": "Well he just called them “Iranians” so there’s that",
            "title_similarity": "0.4481398",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hz0545o",
            "score": -2,
            "text": "Spoiler alert. He didn’t.",
            "title_similarity": "0.56617653",
            "sentiment_compound": 0.296
        },
        {
            "id": "hyy841o",
            "score": -2,
            "text": "My heart aches for the people of Ukraine. Putin must be stopped, this just can not stand. It’s dangerous precedent if he gets away with this. Where does it stop?",
            "title_similarity": "0.49134707",
            "sentiment_compound": 0.3927
        },
        {
            "id": "hyyn3a3",
            "score": -3,
            "text": "ITT:\n\n>yeah but he is iconic tho\n\n.\n\n>hes being humble, is what good leader does\n\nThat being said, the writing for this season is fucking excellent. \n\nBut seriously. There's not anyone I can even think of to compare Zelensky to. He is truly taking leadership to a new level. Iconic is an understatement. I'd say 'definitive'. He's not Iconic, he's definitive of leadership.",
            "title_similarity": "0.63221335",
            "sentiment_compound": 0.9238
        },
        {
            "id": "hyz0ms2",
            "score": -2,
            "text": "He's a fucking international hero and the most interesting man of my generation",
            "title_similarity": "0.3079502",
            "sentiment_compound": 0.7828
        },
        {
            "id": "hz01p7f",
            "score": 1,
            "text": "Well. Biden saying Ukrainians can win fighting with Molotov cocktails and their bare hands basically wasnt what he was likely looking for",
            "title_similarity": "0.51793396",
            "sentiment_compound": 0.5267
        },
        {
            "id": "hz07sek",
            "score": 0,
            "text": "Truly sorry President Zelensky. Joe gave you nothing tonight and the EU gave you applause…tragic. Can’t imagine how you feel.\n\nMay god bless you and your countrymen",
            "title_similarity": "0.54622054",
            "sentiment_compound": 0.7579
        },
        {
            "id": "hyyk2wa",
            "score": -6,
            "text": "If Ukraine is allowed to fall while we applaud their courage and wave, that's the end of western credibility as an ally. It's basically giving Russia and China Carte Blanche to start invading neighbours knowing the rest of the world is scared into impotence. And that will affect who those other countries align with.",
            "title_similarity": "0.5114955",
            "sentiment_compound": 0.6908
        },
        {
            "id": "hyzk6g4",
            "score": -3,
            "text": "This address might be too close to his bedtime. Hopefully his meds were taken later today. We need words from a real leader right now. Ugh if only he was not handicapped.",
            "title_similarity": "0.49635753",
            "sentiment_compound": -0.0258
        },
        {
            "id": "hz0jniw",
            "score": -2,
            "text": "Biden has handled this situation very well imo. But he is an old fuck... and I dont expect shit out of old fuck other than shit their diaper.  That said it could be worse....",
            "title_similarity": "0.49076983",
            "sentiment_compound": -0.9429
        },
        {
            "id": "hyy4cfl",
            "score": -13,
            "text": "Can we steal him from Ukraine and put him in charge here plz",
            "title_similarity": "0.38546485",
            "sentiment_compound": -0.4404
        },
        {
            "id": "hyynw66",
            "score": -5,
            "text": "Biden needs to get up there and say the US oil industry is back in business and Canada will be resuming the pipeline. He can also remove some sanctions on Venezuela .",
            "title_similarity": "0.4884953",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyywxxn",
            "score": -4,
            "text": "You must not know our president all he will do is ramble about nonsense and leave your country to die",
            "title_similarity": "0.50283456",
            "sentiment_compound": -0.7783
        },
        {
            "id": "hyymh9s",
            "score": 1,
            "text": "This man is fighting a war and for the survival of his own country. He needs help, he doesn’t need decorated words, he needs support for his people.",
            "title_similarity": "0.5536066",
            "sentiment_compound": -0.25
        },
        {
            "id": "hyynyir",
            "score": 2,
            "text": "This is a big demand. Don’t get me wrong, Zelenskyy stepped up since Russia invaded, but let’s not forget how much he played middle of the road in the weeks leading up to the invasion as well as in 2019 when Trump withheld aid from Ukraine.\n\nYou can’t expect others to go to bat for you when you have a history of undermining them.",
            "title_similarity": "0.48623008",
            "sentiment_compound": 0.2957
        },
        {
            "id": "hyzwnjh",
            "score": 2,
            "text": "Watching this after some of Zelenskyy’s recent speeches and scanning it for something “strong” is like trying to taste the spice in mild sauce at Taco Bell after eating a ghost pepper",
            "title_similarity": "0.31329888",
            "sentiment_compound": 0.0516
        },
        {
            "id": "hyzyc0c",
            "score": 1,
            "text": "The state of the union is all performative bull***.All those companies they are talking about legislating against all line the pockets of every single person in that room. They don’t want to change the system, their benefiting from it. ALL of them even the young guard.",
            "title_similarity": "0.47591555",
            "sentiment_compound": 0.0772
        },
        {
            "id": "hyz031a",
            "score": 0,
            "text": "Pressure on for Biden then…. Gulp",
            "title_similarity": "0.3125861",
            "sentiment_compound": -0.296
        },
        {
            "id": "hyzhr79",
            "score": 0,
            "text": "Come on, man.",
            "title_similarity": "0.32875326",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyzo8mq",
            "score": 0,
            "text": "Me too Zelensky, me too...",
            "title_similarity": "0.28821263",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz0as0k",
            "score": 0,
            "text": "Say something useful instead of your normal speach",
            "title_similarity": "0.45926404",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hz1fqq2",
            "score": 0,
            "text": "Instead he said “guess what? No Russian planes in American airspace” 🙄",
            "title_similarity": "0.69885594",
            "sentiment_compound": -0.296
        },
        {
            "id": "hyypnia",
            "score": 21,
            "text": "I got a question why the fuck are we still talking about trump? Every post I read about Ukraine constantly yammers on about trump. Stfu, he’s irrelevant.",
            "title_similarity": "0.49494344",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hz06tcf",
            "score": -7,
            "text": "Welp, he called you guys Iranian's.... No hope from the dipshit.",
            "title_similarity": "0.6249664",
            "sentiment_compound": -0.6711
        },
        {
            "id": "hyyqiw3",
            "score": -7,
            "text": "Good luck with that, guy can’t even walk up stairs , why would he say anything ?",
            "title_similarity": "0.64467853",
            "sentiment_compound": 0.7096
        },
        {
            "id": "hyzvmfa",
            "score": -5,
            "text": "Biden just doesn’t have the toughness. I agree the last president was a joke. But, I kind of want someone who will at least act tough. Just hard to take 80+ year old presidents serious.",
            "title_similarity": "0.64724123",
            "sentiment_compound": -0.138
        },
        {
            "id": "hyzhjf6",
            "score": -4,
            "text": "I hope he can keep up with the teleprompter.",
            "title_similarity": "0.41987935",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hyzvivb",
            "score": 2,
            "text": "All they have to do is join nato. The U.S. has made it pretty clear we defend all NATO countries.",
            "title_similarity": "0.45450896",
            "sentiment_compound": 0.7906
        },
        {
            "id": "hyzax0s",
            "score": -2,
            "text": "Here is a hot take. Post is about Zelenski asking Biden to make a strong statement in his speech.\n\nEveryone in the comments is circle jerking about how much they hate Trump to distract from the fact nobody is expecting Biden to even make sense during his state of the union address tonight but no one wants to admit Biden just isn’t mentally there anymore.\n\nThe whatabout Trumpism is deafening when the post has nothing to do with him.",
            "title_similarity": "0.60661346",
            "sentiment_compound": -0.6369
        },
        {
            "id": "hz02vrz",
            "score": -4,
            "text": "And he didn’t",
            "title_similarity": "0.42948925",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyy67q3",
            "score": -16,
            "text": "Biden isn't going to do shit. He'll give a half-assed \"You'll regret these sanctions\" comment and then he'll probably ramble about how good the economy is",
            "title_similarity": "0.64967084",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hyyc292",
            "score": 15,
            "text": "I think Biden should stick to the state of the US in the State of the Union. Something about fighting fascism within the very country he's leading.",
            "title_similarity": "0.5494894",
            "sentiment_compound": -0.3612
        },
        {
            "id": "hyy6pi9",
            "score": -6,
            "text": "We’re hoping he says something useful as well…odds are he won’t",
            "title_similarity": "0.5594162",
            "sentiment_compound": 0.6908
        },
        {
            "id": "hyxoxbm",
            "score": 70,
            "text": "Has anything ever been said at a state of the union that could be described as \"useful?\"",
            "title_similarity": "0.5229",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hyywn9p",
            "score": -3,
            "text": "[deleted]",
            "title_similarity": "0.35716873"
        },
        {
            "id": "hyywt4q",
            "score": -2,
            "text": "Sorry dude, you don’t have enough natural resources to raid so America will just watch from the sidelines, I heard they sent Putin a really angry email though so that should help.",
            "title_similarity": "0.5972676",
            "sentiment_compound": 0.1458
        },
        {
            "id": "hz06wiv",
            "score": -3,
            "text": "Doesn’t appear he got what he asked for",
            "title_similarity": "0.536937",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz08yjh",
            "score": -3,
            "text": "Sorry bro but as a product of the fucking assholes that destroyed latinamerica since forever specially since the beginning of the 1900s, as long as you have something that this country needs or wants you’re fuck, but they would be the once invading you no one would fucking shit aka Yemen, Palestine, UEA, Irak, Iran, Afghanistan, Vietnam, ETC!! Putin is an asshole no doubt about that but this country is not a your friend just don’t trust in anyone, don’t soooo naive!!!",
            "title_similarity": "0.5890262",
            "sentiment_compound": -0.9788
        },
        {
            "id": "hyylayv",
            "score": -1,
            "text": "That green jacket he’s been seen wearing is becoming iconic",
            "title_similarity": "0.29130095",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyyut9m",
            "score": -1,
            "text": "“My fellow Americans, I am pleased to tell you today that I’ve signed legislation that will outlaw Russia forever. We begin bombing in five minutes.”",
            "title_similarity": "0.3837409",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hyz517u",
            "score": -1,
            "text": "Biden: we’re thinking about maybe doing something if something else happens in a month",
            "title_similarity": "0.36161262",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz02svd",
            "score": 1,
            "text": "Pull their pants down Zelly! Yhis is right, russia is US'd sworn enemy. This is the spark they needed to crush the old USSR ghosts  once and for all.",
            "title_similarity": "0.43643296",
            "sentiment_compound": -0.5411
        },
        {
            "id": "hz036lb",
            "score": 1,
            "text": "Intelligence information such as satellite images will be very helpful. Or it was shared already?",
            "title_similarity": "0.3025306",
            "sentiment_compound": 0.8221
        },
        {
            "id": "hz1tlvy",
            "score": -1,
            "text": "Can we trade presidents? I’m loving Ukraine’s and someone thinking the United States got dooped.. we elected someone form americas got talent enough",
            "title_similarity": "0.43606827",
            "sentiment_compound": 0.8591
        },
        {
            "id": "hz1yihb",
            "score": -1,
            "text": "Biden said absolutely nothing important just wasted resources",
            "title_similarity": "0.60956335",
            "sentiment_compound": 0.192
        },
        {
            "id": "hz20iv1",
            "score": -1,
            "text": "He failed",
            "title_similarity": "0.3740554",
            "sentiment_compound": -0.5106
        },
        {
            "id": "hyyw2kg",
            "score": -6,
            "text": "If he expects Joe Biden of all people to stay something strong……. then he is in a movie",
            "title_similarity": "0.57439166",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyyf7pr",
            "score": -8,
            "text": "How about the USA says YES to NATO for Ukraine.  Fuck Putin.",
            "title_similarity": "0.48988107",
            "sentiment_compound": -0.0173
        },
        {
            "id": "hyyxc1u",
            "score": -7,
            "text": "Sorry Zelensky.  All the democrats are capable of are pointless platitudes",
            "title_similarity": "0.5687683",
            "sentiment_compound": 0.3182
        },
        {
            "id": "hyzmzzf",
            "score": -7,
            "text": "“Strong” and “useful” are two words that should never be uttered in the same sentence as Joe Biden",
            "title_similarity": "0.77968293",
            "sentiment_compound": 0.0772
        },
        {
            "id": "hyxojul",
            "score": -24,
            "text": "[deleted]",
            "title_similarity": "0.35716873"
        },
        {
            "id": "hyyqelh",
            "score": 26,
            "text": "Ukrainians are suffering terribly as Russian forces invade and brutalize their country without just cause. As Americans, beyond sending our thoughts, prayers, and support, we should also use this moment to reflect on our own history and conduct on the world stage — past, present, and future.\n\n**(1) Americans should stop threatening each other with civil war and focus on building a better future together.**\n\nFirst, our recent ghastly disunity and bickering over comparably small differences is, in short, completely insane. Particularly in light of the fact that we risk damaging or overturning nearly 300 years of liberal democratic tradition, our world leadership, and our excellent economy and living standards. We should work together to build a better future, instead of threatening our neighbors with strife, civil unrest, and open warfare. American’s are all passengers on the same boat, which if sufficiently damaged by our disunity, will cause discomfort and suffering for us all. It simply makes not sense to engage in our current brand of hyper divisive politics.\n\n**(2) America needs to set a better example for other nations to follow on the global stage.**\n\nSecond, Putin’s unspeakable conduct in Ukraine is, in a way, a fun house mirror for our own past conduct on the global stage. Yes, American military rules of engagement are generally far more regulated and moral compare to Russia’s past and present policies. But, America too has a long history of invading other nations on paper thin justification. Be it Iraq or Panama or the secret prisons where we lock up both the world’s worst criminals and, in some cases, innocent civilians. All of this gives strongmen like Putin an excuse for their egregious excesses. America can do better, and we have a responsibility to the future to do better.\n\n**(3) America needs to participate in, and strengthen support for, a global dispute resolution system.**\n\nFinally, it has been ten thousand years since we emerged from caves with clubs, arrows, and torches. It is well past time for nations to resolve their differences through strive and bloodshed. We built the UN and numerous internal tribunals for countries to settle their differences in the courtroom instead of the battlefield. In order for these forums to gain legitimacy, America must participate in these forums, acknowledge their authority, and champion their longterm success. This is the only way we will go from a people that resolve differences through violence to a people that resolve differences through words.",
            "title_similarity": "0.5262412",
            "sentiment_compound": 0.9504
        },
        {
            "id": "hz08a00",
            "score": -4,
            "text": "Didn’t say fuck. So disappointed from Biden. Heard a bunch of bullshit employment numbers and something about bridges. Watched Nancy fuck with her dentures all night.",
            "title_similarity": "0.41130668",
            "sentiment_compound": -0.9412
        },
        {
            "id": "hz0e0oe",
            "score": 5,
            "text": "Annnddd...... He did not.",
            "title_similarity": "0.49794927",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyylv3t",
            "score": -3,
            "text": "Wouldn't hold my breath",
            "title_similarity": "0.51902497",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyyzzde",
            "score": -2,
            "text": ">useful\n\nOuch",
            "title_similarity": "0.2734264",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hyz36ba",
            "score": -3,
            "text": "Is everyone in the west just going to let Ukraine get destroyed? I’m so sick with worry for these poor people.",
            "title_similarity": "0.324212",
            "sentiment_compound": -0.9195
        },
        {
            "id": "hyz9fg2",
            "score": -2,
            "text": "Sorry but tonight will be about spinning every story to where biden and his admin are the heroes. He will say how tough they are being on Russia while still buying their oil.",
            "title_similarity": "0.43109542",
            "sentiment_compound": 0.5499
        },
        {
            "id": "hyzjg46",
            "score": -3,
            "text": "Biden: No.\n\nI don't foresee him saying anything productive about Ukraine.",
            "title_similarity": "0.6360501",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyzk0mk",
            "score": -2,
            "text": "Strong,  Useful and Biden. Im in tears",
            "title_similarity": "0.3181728",
            "sentiment_compound": 0.6486
        },
        {
            "id": "hz03d3a",
            "score": -2,
            "text": "Nope: 'Murica",
            "title_similarity": "0.48222542",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz0ctxl",
            "score": 1,
            "text": "State of the union is done. His final remark has me puzzled. \"Bless our troops, let's go get him.\" Go get who?? I'm really curious 🤨",
            "title_similarity": "0.59348786",
            "sentiment_compound": 0.6191
        },
        {
            "id": "hz0l6mx",
            "score": 2,
            "text": "You know DAMN well the CIA and MI6 are boots on the ground covertly all over key points in Ukriane. Russia stands no chance against the West when they're just way to good at what they do.",
            "title_similarity": "0.51144904",
            "sentiment_compound": -0.0446
        },
        {
            "id": "hyyt270",
            "score": 9,
            "text": "This whole situation is just reinforcing to me that we absolutely need to elect Jon Stewart as POTUS ASAP.",
            "title_similarity": "0.48658496",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyy1cjf",
            "score": -13,
            "text": "Biden: \"Ukraine is iconic, they are resourceful. They have a strong leader. This isnt a movie folks ok. My Build Back better program would help millions of middle class Americans from day 1.\"",
            "title_similarity": "0.46012497",
            "sentiment_compound": 0.836
        },
        {
            "id": "hyyl9od",
            "score": 3,
            "text": "Why only the US and not any other country?",
            "title_similarity": "0.5750192",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyyt9sb",
            "score": 4,
            "text": "Zelensky pressuring Biden to do more and say more honestly is starting to get to be a bit much. \n\nI get it— he’s in a hard spot, and all of Ukraine is desperate. But Biden (and the US) is in a delicate spot— as much as we might want to help, I think everyone would agree that in the long run, it would be much more damaging than not.",
            "title_similarity": "0.49941328",
            "sentiment_compound": 0.3087
        },
        {
            "id": "hyyw3y5",
            "score": -3,
            "text": "Maybe ask the vice president, biden seems to struggle, barely standing on his own feet.",
            "title_similarity": "0.6046345",
            "sentiment_compound": -0.3182
        },
        {
            "id": "hyyxtzp",
            "score": 3,
            "text": "All I hope to hear from Biden is that he is going to finally grow a sack and do something for America. I assume he is still POTUS, right? Forgiving student loans, laying groundwork for a national health care system, jobs program, anything.... that would be strong.",
            "title_similarity": "0.520638",
            "sentiment_compound": 0.9062
        },
        {
            "id": "hyzh880",
            "score": -2,
            "text": "Zelensky also told Biden to stop buying 500,000 barrels of oil from Putin every single day but Biden couldn't hear that request over the sound of the waves at his Delaware beach house he was at all weekend.",
            "title_similarity": "0.39169592",
            "sentiment_compound": -0.1531
        },
        {
            "id": "hyzh8z6",
            "score": -3,
            "text": "Can't wait to hear this senor citizen garble nonsense and read teleprompter for a full 5 minutes.",
            "title_similarity": "0.23299924",
            "sentiment_compound": -0.4019
        },
        {
            "id": "hyzseya",
            "score": -3,
            "text": "Broooo the guyyy can barely breathe",
            "title_similarity": "0.33722842",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz059ck",
            "score": 3,
            "text": "“Go get em” how’s that?",
            "title_similarity": "0.3850135",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz05c9n",
            "score": -3,
            "text": "Let's hope not. I don't want to go to war. Leave the US out of it. Life is too good over here to ruin it.",
            "title_similarity": "0.69281757",
            "sentiment_compound": -0.4471
        },
        {
            "id": "hz1z7tt",
            "score": -2,
            "text": "Biden doesn't know Iran from Ukraine. He looks like someone's confused great grandpa up there.",
            "title_similarity": "0.5989628",
            "sentiment_compound": 0.6486
        },
        {
            "id": "hyyb1p6",
            "score": 6,
            "text": "We should start a campaign to get Zelensky as the Times person of the year. After this ends though.",
            "title_similarity": "0.4798513",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz020xt",
            "score": 7,
            "text": "This is funny coming from the guy downplaying \"possible Russian invasion\". Didn't Biden warn everyone yet when the invasion came All of Europe 😲. Including this Mr. Zelnsky.",
            "title_similarity": "0.5423589",
            "sentiment_compound": 0.7
        },
        {
            "id": "hyy606h",
            "score": 45,
            "text": "I'll have to disagree with him on that last one about him not being iconic, to be honest. He takes that Robin Williams Man of the Year movie, brings it to real life, and upstages it several times over, and is currently getting shot at willingly to do it. That man is going to be a fucking comic book hero by the end of this, if he isn't already. Give Putin Hell, lads.",
            "title_similarity": "0.5265931",
            "sentiment_compound": -0.0094
        },
        {
            "id": "hyy7nj0",
            "score": 8,
            "text": "He may not be in a movie but this mofo is iconic.",
            "title_similarity": "0.58508444",
            "sentiment_compound": -0.7579
        },
        {
            "id": "hz06uwh",
            "score": -8,
            "text": "Probably not gonna happen...you know, with him being a fucking half wit...",
            "title_similarity": "0.5162678",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz0eluw",
            "score": 8,
            "text": "Biden can't - this would give Putin exactly what he wants.  Equal footing with the USA and they're not.  \n\n\nI don't like him, but he got this right, McCain said, \"Russia is a gas station, run by the mafia, masquerading as a country\"",
            "title_similarity": "0.5893556",
            "sentiment_compound": 0.1055
        },
        {
            "id": "hyyfdw9",
            "score": -4,
            "text": "Putin is slaughtering Ukrainian civilians and possibly using illegal weapons as we speak, he is unhinged and must be stopped. Even if CIA has to be involved in a special operation, I think the entire world aproves a regime change now.",
            "title_similarity": "0.4010605",
            "sentiment_compound": -0.6908
        },
        {
            "id": "hyyhd9l",
            "score": 0,
            "text": "But also don’t say something obvious either because it might cause panic",
            "title_similarity": "0.5557571",
            "sentiment_compound": -0.6652
        },
        {
            "id": "hyyhpn0",
            "score": 5,
            "text": "His voice is in a movie. Let every child in the world know that Putin is trying to kill Paddigton",
            "title_similarity": "0.31537792",
            "sentiment_compound": -0.6908
        },
        {
            "id": "hyyjccv",
            "score": 0,
            "text": "Iconic.",
            "title_similarity": "0.3111593",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyymxnk",
            "score": 0,
            "text": "Yeah, Ukraine seems to be the US the US portrays themselves to be.. where are you, police of the world? Time to take a stance",
            "title_similarity": "0.46114832",
            "sentiment_compound": 0.296
        },
        {
            "id": "hyyn3f7",
            "score": 0,
            "text": "\"i'm not a icon!\" Wow how humble....what an icon.",
            "title_similarity": "0.621716",
            "sentiment_compound": -0.521
        },
        {
            "id": "hyyorke",
            "score": 0,
            "text": "Strong and useful eh lol. Like what, Putin it's been said a million times but this time it's being said strongly and usefully \"stop being a big meany head or else\"",
            "title_similarity": "0.5907539",
            "sentiment_compound": 0.8519
        },
        {
            "id": "hyyoz5l",
            "score": 0,
            "text": "There will be movies about him and the Ukrainian fight against Russia.\n\nAnd a Sabaton song.",
            "title_similarity": "0.3900996",
            "sentiment_compound": -0.3818
        },
        {
            "id": "hyyp14c",
            "score": 0,
            "text": "Saying what needs to be said.  What a fucking leader.",
            "title_similarity": "0.4692703",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyys45a",
            "score": 0,
            "text": "He will be spoken about for generations",
            "title_similarity": "0.22246343",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyysxva",
            "score": 0,
            "text": "The hell does that even mean lol? Is this a translation thing?",
            "title_similarity": "0.43591934",
            "sentiment_compound": -0.4871
        },
        {
            "id": "hyyt02z",
            "score": 0,
            "text": "Superman",
            "title_similarity": "0.2958181",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyytu4i",
            "score": -4,
            "text": "good luck with that idiot doing much more than mumbling incoherently",
            "title_similarity": "0.4072614",
            "sentiment_compound": 0.3818
        },
        {
            "id": "hyyv81a",
            "score": 0,
            "text": "Ballerrr",
            "title_similarity": "0.24204639",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyyxwki",
            "score": 0,
            "text": "Bro should do an OnlyFans so we can crush on him and fund his efforts at the same time. He’s only a shirtless flex and a few foot pics away from funding more fighter jets.",
            "title_similarity": "0.6192876",
            "sentiment_compound": 0.0076
        },
        {
            "id": "hyyzbhl",
            "score": 0,
            "text": "That's asking alot..",
            "title_similarity": "0.3175966",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyz0v60",
            "score": 0,
            "text": "Only words?",
            "title_similarity": "0.4266823",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyz0ym8",
            "score": 0,
            "text": "Well he is going to have to be happy with just platitudes.",
            "title_similarity": "0.3801562",
            "sentiment_compound": 0.7003
        },
        {
            "id": "hyz7jy6",
            "score": 0,
            "text": "dang I think we should put in place another sanction and wait a few months until Ukraine is taken over to see if they worked",
            "title_similarity": "0.4042483",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyz88pl",
            "score": 0,
            "text": "I don’t think Biden should say anything. Sanctions speak for themselves.",
            "title_similarity": "0.73045564",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyz9ocw",
            "score": -3,
            "text": "[deleted]",
            "title_similarity": "0.35716873"
        },
        {
            "id": "hyzax77",
            "score": 4,
            "text": "Biden was nothing more than a way out of Trump. Don’t expect shit from him. On the flip side, if Trump was still president he would totally be having the US backing Russia.",
            "title_similarity": "0.6180415",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hyzc7mf",
            "score": 0,
            "text": "Yeah I would like to hear our president say something like we’re not buying any more Russian oil and make up for that oil will reopen the keystone pipeline\nOK I don’t know who did it but somebody down voted the idea of stop buying gas from Russia wow",
            "title_similarity": "0.61409605",
            "sentiment_compound": 0.816
        },
        {
            "id": "hyze4g8",
            "score": 0,
            "text": "I don’t think he’s ever seen a SOTU. Like most things in government, it could best be handled with an email.",
            "title_similarity": "0.6020956",
            "sentiment_compound": 0.7717
        },
        {
            "id": "hyzfy51",
            "score": 0,
            "text": "It’s time for the US and a Coalition force stop Putin.",
            "title_similarity": "0.49914718",
            "sentiment_compound": -0.296
        },
        {
            "id": "hyzh2xc",
            "score": 0,
            "text": "We need you as president..",
            "title_similarity": "0.50019336",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyzhcza",
            "score": -5,
            "text": "As a liberal in America I doubt Bidan is capable of saying anything string or useful. He's just another unwise old man in our government who is disconnected from the world and the way things are.\n\nIt is sad and shameful but true.",
            "title_similarity": "0.60046387",
            "sentiment_compound": 0.3716
        },
        {
            "id": "hyzhva5",
            "score": 0,
            "text": "I only have to scroll for 0.000002 seconds to find someone huffing and puffing about Trump in something that has nothing to do with him.",
            "title_similarity": "0.64335185",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyzkkxn",
            "score": 0,
            "text": "Goddamn it, can WE vote for him in 2024?",
            "title_similarity": "0.47858208",
            "sentiment_compound": -0.4767
        },
        {
            "id": "hyzmdve",
            "score": 0,
            "text": "Corn Pop!",
            "title_similarity": "0.26859647",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyznu4d",
            "score": 0,
            "text": "Give them anything they want!!!",
            "title_similarity": "0.23383294",
            "sentiment_compound": 0.2905
        },
        {
            "id": "hyzobxp",
            "score": 0,
            "text": "Little does Zelensky understand, the SOTU is essentially now an overly hyper media product far more than it is anything useful.",
            "title_similarity": "0.5024724",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hyzp2qk",
            "score": 0,
            "text": "Well, you're not in a movie at least.",
            "title_similarity": "0.57435656",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hyzu0a8",
            "score": 0,
            "text": "Funnily enough, zelensky is a former actor. Just FYI.",
            "title_similarity": "0.4215733",
            "sentiment_compound": 0.6633
        },
        {
            "id": "hyzujl4",
            "score": 0,
            "text": "Looks like biden can't get away with just saying he's a hero",
            "title_similarity": "0.65565526",
            "sentiment_compound": 0.7269
        },
        {
            "id": "hyzwk0c",
            "score": 0,
            "text": "He’s asking a lot….",
            "title_similarity": "0.25901267",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz057j0",
            "score": -3,
            "text": "Sorry brah! We let you down.",
            "title_similarity": "0.42644036",
            "sentiment_compound": -0.1511
        },
        {
            "id": "hz0gw7u",
            "score": -4,
            "text": "Lol he didn’t say anything at all",
            "title_similarity": "0.40336573",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hyydq34",
            "score": -9,
            "text": "Zelensky himself should give the SOTU address. He is the leader of the free world at this point.",
            "title_similarity": "0.5139735",
            "sentiment_compound": 0.5106
        },
        {
            "id": "hyykf0t",
            "score": 31,
            "text": "We had a President who was not able to reliably open and close an umbrella. Everybody is an icon by comparison.",
            "title_similarity": "0.6293817",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyycl43",
            "score": 10,
            "text": "Paddington is a movie",
            "title_similarity": "0.33363533",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz03g1e",
            "score": -9,
            "text": "Biden doesn’t ever say anything useful and is a broken record.",
            "title_similarity": "0.5084846",
            "sentiment_compound": -0.0516
        },
        {
            "id": "hyynrcn",
            "score": 4,
            "text": "Biden just needs to state the truth:  Putin has LOST.  Putin is putting shame on his country, killing his own people and killing his brothers in Ukraine.  He’s committing unforgivable acts and worsening the Russian economy.  Even if Putin wins this war, he has already LOST.  Russians used to have pride in their country and people… but Putin is killing that pride.  Putin is putting shame on his people.  If Russians support the pointless killing of innocent people, soon it will be shameful to be a Russian.  Russian pride will be equal to Nazi pride.  Shameful and embarrassing.",
            "title_similarity": "0.38112518",
            "sentiment_compound": -0.9772
        },
        {
            "id": "hyyrwbq",
            "score": 6,
            "text": "It really does irk me how Zelensky has been put on such a pedestal, people making movie style posters of him, painting him as some super hero. No question, he is a good man, fighting for what is right and backing up his words with action - but that's what *every* man should aspire to ffs - we shouldn't abnormalize this kind of behavior....",
            "title_similarity": "0.5143888",
            "sentiment_compound": -0.4215
        },
        {
            "id": "hz005e1",
            "score": 5,
            "text": "Unfortunately Biden didn’t say much about Ukraine except its people are strong and Russia has felt economic strain due to a unified world.",
            "title_similarity": "0.5256896",
            "sentiment_compound": 0.5106
        },
        {
            "id": "hyy4jhg",
            "score": -18,
            "text": "Let's go america. Stop this genocide. Enforce a no-fly zone over Ukraine.",
            "title_similarity": "0.52978384",
            "sentiment_compound": -0.296
        },
        {
            "id": "hyy9udx",
            "score": -25,
            "text": "[deleted]",
            "title_similarity": "0.35716873"
        },
        {
            "id": "hyyq3mj",
            "score": -6,
            "text": "Honestly, we'd settle for something coherent from  Biden.",
            "title_similarity": "0.47711313",
            "sentiment_compound": 0.4588
        },
        {
            "id": "hyz0fuo",
            "score": 7,
            "text": "So why isn’t the EU sending their armies to sort out Russia.\n\nUSA is miles away. \n\nThis is happening on the front doorstep of EU and is likely to spill out into neighbouring countries (it already is with refugees).\n\nShouldn’t the EU attempt to stop the issue (Russia) - rather than just dealing with it as it happens?!",
            "title_similarity": "0.5679506",
            "sentiment_compound": -0.3595
        },
        {
            "id": "hyzhque",
            "score": -4,
            "text": "Too bad biden is weak and a fool",
            "title_similarity": "0.43232363",
            "sentiment_compound": -0.8519
        },
        {
            "id": "hz0887g",
            "score": -6,
            "text": "Good luck, we've been waiting for him just to have a coherent thought for over a year now.",
            "title_similarity": "0.36601976",
            "sentiment_compound": 0.7096
        },
        {
            "id": "hyyhymb",
            "score": -1,
            "text": "Vvggàe",
            "title_similarity": "0.31990945",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyyjx9m",
            "score": -1,
            "text": "Zellensky defines courage and leadership.",
            "title_similarity": "0.38436162",
            "sentiment_compound": 0.4939
        },
        {
            "id": "hyyopoi",
            "score": 1,
            "text": "He’s such a baller. Damn.",
            "title_similarity": "0.24175815",
            "sentiment_compound": -0.4019
        },
        {
            "id": "hyypda6",
            "score": 1,
            "text": "Zelensky is so humble. His country is lucky to have him as a leader. This is how leaders should behave. My hope is that Zelensky and Ukraine survive this invasion from Russia and now Belarus. \n\nIt is sad that Ukraine is having to fight this war alone while Putin holds the world hostage with the threat of using nukes. Putin is evil. He is killing civilians and children. And anyone who supports Putin (Trump) is also evil and has blood on their hands.",
            "title_similarity": "0.40322688",
            "sentiment_compound": -0.971
        },
        {
            "id": "hyypl97",
            "score": 1,
            "text": "What can he say?  Other than thoughts and prayers, here's some weapons.  Good luck.\n\nAnything other than that is escalating towards nuclear holocaust.\n\nOur only hope at this point is the Russian military and citizens defying orders and overthrowing leadership.",
            "title_similarity": "0.51602036",
            "sentiment_compound": 0.7096
        },
        {
            "id": "hyyq9fv",
            "score": 1,
            "text": "Little does he know that we’ll be watching some Hollywood movie about all this years from now.",
            "title_similarity": "0.39362007",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyyrn5w",
            "score": -1,
            "text": "When he's finished with Puti & Co. Zelenskyy can come to the US and take care of 95% of our politicians.",
            "title_similarity": "0.25407767",
            "sentiment_compound": 0.4939
        },
        {
            "id": "hyythav",
            "score": -1,
            "text": "the amount of people wanting to start WWIII is too damn high",
            "title_similarity": "0.356585",
            "sentiment_compound": -0.4019
        },
        {
            "id": "hyyw18k",
            "score": -1,
            "text": "I wish we had a President with the character of Zelensky",
            "title_similarity": "0.5954405",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hyywcgu",
            "score": -1,
            "text": "No fly zone!",
            "title_similarity": "0.55140233",
            "sentiment_compound": -0.3595
        },
        {
            "id": "hyywfd7",
            "score": -1,
            "text": "1 - we get involved in a war, \n\n2 - people die, \n\n3 - it doesn't turn out how we hoped, \n\n4 - we withdraw\n\n5 - people become more isolationist\n\n6 - a bad guy somewhere else does bad guy stuff\n\n7 - politicians feel pressured to \"stand up for what's right and kick bad guy's ass!\"\n\nskip back to step 1",
            "title_similarity": "0.45571077",
            "sentiment_compound": -0.9657
        },
        {
            "id": "hyyxbnr",
            "score": 1,
            "text": "The government needs to waive passport requirements for travel for veterans going to ukraine",
            "title_similarity": "0.5082127",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyyxbtp",
            "score": 1,
            "text": "Time to set shoulder to shoulder with Ukraine. Let’s take the fight to Putin.",
            "title_similarity": "0.45314318",
            "sentiment_compound": -0.3818
        },
        {
            "id": "hyyxfvj",
            "score": 1,
            "text": "Yes-I agree with President Z and was just posting the very same suggestion to President Biden. Republicans support of monsters like Putin and Trump is treasonous!",
            "title_similarity": "0.50452864",
            "sentiment_compound": 0.5093
        },
        {
            "id": "hyyzmmh",
            "score": 1,
            "text": "Yes you are Big Z.\n\nYes you are.",
            "title_similarity": "0.25945783",
            "sentiment_compound": 0.6597
        },
        {
            "id": "hyz0e8t",
            "score": 1,
            "text": "Can I vote for this man for US president because I sure want to.",
            "title_similarity": "0.43395048",
            "sentiment_compound": 0.3818
        },
        {
            "id": "hyz0gc4",
            "score": 1,
            "text": "Mr. President Biden, please help Ukrainians, thanks !!!",
            "title_similarity": "0.3042243",
            "sentiment_compound": 0.8306
        },
        {
            "id": "hyz0z4c",
            "score": -1,
            "text": "Haha wishful thinking.",
            "title_similarity": "0.33960736",
            "sentiment_compound": 0.4588
        },
        {
            "id": "hyz11bx",
            "score": -1,
            "text": "Good luck with that one lmao",
            "title_similarity": "0.2541661",
            "sentiment_compound": 0.8689
        },
        {
            "id": "hyz1ocs",
            "score": -1,
            "text": "Narrator:  he did not",
            "title_similarity": "0.53161",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyz1wd3",
            "score": -1,
            "text": "Welp. Good luck with that.",
            "title_similarity": "0.24370374",
            "sentiment_compound": 0.7096
        },
        {
            "id": "hyz2p2q",
            "score": -1,
            "text": "Look, I voted for Biden, but \"strong\" and \"useful\" are not words I ever associated with him.",
            "title_similarity": "0.75997204",
            "sentiment_compound": 0.8519
        },
        {
            "id": "hyz2yx2",
            "score": -1,
            "text": "Biden hasn’t said anything strong or useful in a long long time.",
            "title_similarity": "0.46054995",
            "sentiment_compound": 0.7351
        },
        {
            "id": "hyz3a9a",
            "score": -1,
            "text": "Don’t count on it and hope for a miracle.\n\nThe guy and his cabinet utterly incompetent & worse, arrogant. Feckless leadership",
            "title_similarity": "0.52098495",
            "sentiment_compound": -0.5034
        },
        {
            "id": "hyz40fw",
            "score": 1,
            "text": "The SOTU needs to be about the US, not Ukraine. I’m all for helping Ukraine, and we should continue to provide aid. That being said, let’s not forget there are problems at home.",
            "title_similarity": "0.57954097",
            "sentiment_compound": 0.0428
        },
        {
            "id": "hyz4s6p",
            "score": -1,
            "text": "Does he know cause uhh the guys not all there.",
            "title_similarity": "0.47727662",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyz56ts",
            "score": -1,
            "text": "Good luck with that. Biden didn’t even have strong words during Jan 6th. He can barely stay awake.",
            "title_similarity": "0.48929435",
            "sentiment_compound": 0.8481
        },
        {
            "id": "hyz5qxx",
            "score": -1,
            "text": "Good fucking luck Zelelensky !     Biden is a PUSSY & the world knows it 🐱🐱🐱🐱🐱🐱🐱🐱🐱🐱🐱",
            "title_similarity": "0.3295946",
            "sentiment_compound": 0.7569
        },
        {
            "id": "hyz5uj4",
            "score": -1,
            "text": "That might be asking for a bit much… Maybe we go for something like “coherent” or “Not too embarrassing”  I’ll gladly take either",
            "title_similarity": "0.49102187",
            "sentiment_compound": 0.5994
        },
        {
            "id": "hyz6bja",
            "score": -1,
            "text": "Bro, Biden actually led thousands of \"essential\" worker \"heroes\" to the slaughter in his *own* country. What makes you think that he will do anything for you?",
            "title_similarity": "0.32096517",
            "sentiment_compound": 0.5106
        },
        {
            "id": "hyz6jwv",
            "score": -1,
            "text": "Like him I have been saying WTF!!! every time Biden has opened his mouth about the obvious Russian build-up and threat. I mean it was so laid back it was almost like he was saying 'oh yeah we know and don't really care' The lack of interest on numerous occasions could be tantamount to implied permission it was so weak.\n\nEdit: Don't get me wrong, I admire the guy, but I think his publicly available opinion to this build up was too cautious, and his dialogue surrounding the seriousness of the issue much too vague and noncommittal.",
            "title_similarity": "0.570735",
            "sentiment_compound": -0.6845
        },
        {
            "id": "hyz6pwz",
            "score": -1,
            "text": "Let’s send some Americans over for more wars! They love wars!",
            "title_similarity": "0.37524152",
            "sentiment_compound": -0.5593
        },
        {
            "id": "hyz7eez",
            "score": -1,
            "text": "Biden is incapable of saying anything strong or useful or we would have heard it sometime in the past 30 years from him... (to clarify I hate all presidents equally, they all do an awful job, some more than others)",
            "title_similarity": "0.52031875",
            "sentiment_compound": -0.4767
        },
        {
            "id": "hyz8oal",
            "score": -1,
            "text": "Biden say something strong and useful?? Lol, when has that happened in this term",
            "title_similarity": "0.48563117",
            "sentiment_compound": 0.8541
        },
        {
            "id": "hyz8ue9",
            "score": -1,
            "text": "Good luck getting him to do anything. We've been trying for nearing 2 years.",
            "title_similarity": "0.2966954",
            "sentiment_compound": 0.7096
        },
        {
            "id": "hyz93s7",
            "score": 1,
            "text": "“I’m not iconic” - says the most iconic man of our time.",
            "title_similarity": "0.68355346",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyz98sw",
            "score": -1,
            "text": "Lol cmon man",
            "title_similarity": "0.2632954",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hyzaqpy",
            "score": -1,
            "text": "Let's trade Biden for Zelensky that ballsy mf would shape American up right.",
            "title_similarity": "0.5034774",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyzbcgu",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.36520636"
        },
        {
            "id": "hyzcel1",
            "score": -1,
            "text": "Lmao at least even he is aware how the \"he's a badass\" narrative is cringy at most to anyone with at least 1 brain cell.\n\nYes we hate Russia, yes we stand with the Ukrainian people, but what's with the weird \"emotional\" propaganda?\n\nIt's war, no one is badass. \n\nAnd why is everyone pretending as if the US and Ukraine did no provocation at all? Like 1.5 weeks before the war, it was literally a discussion point of everyone and all over the bigger news media. NATO/Ukraine and Russia both failed to de-escalate. It's not like NATO/Ukraine are 100% guilt-free... but people act like it (and Biden is pretending like it), which makes me think that there are also obviously US Propaganda bots just as the Russian ones... Or people just get influenced easily I guess.\n\nDon't get me wrong, I'm not defending Russias/Putins actions at all... I'm just sick of all the misinformation and lack of rationality, as if everything is black and white.\n\nI understand that war can be emotional, but losing all rationality makes the war worse.",
            "title_similarity": "0.5501621",
            "sentiment_compound": -0.9879
        },
        {
            "id": "hyzcpuf",
            "score": -1,
            "text": "Just read the headline and can’t stop laughing!!",
            "title_similarity": "0.18844819",
            "sentiment_compound": 0.3786
        },
        {
            "id": "hyzcq4m",
            "score": -1,
            "text": "Lol but he's acting like he is",
            "title_similarity": "0.32846206",
            "sentiment_compound": 0.631
        },
        {
            "id": "hyzde0g",
            "score": -1,
            "text": "Can we swap them out?",
            "title_similarity": "0.28962612",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyzdp0e",
            "score": 1,
            "text": "Biden appearing competent and saying something strong?  Good luck with that. Ukrainian we support you. God bless Zelensky.",
            "title_similarity": "0.3022929",
            "sentiment_compound": 0.9524
        },
        {
            "id": "hyze46w",
            "score": 1,
            "text": "Lmao. As if he could ever do that. You've got the wrong President for that.",
            "title_similarity": "0.6569893",
            "sentiment_compound": 0.2023
        },
        {
            "id": "hyzeafb",
            "score": 1,
            "text": "He would if he could speak properly and remember what he’s doing. But he’s too inept at this point",
            "title_similarity": "0.5417436",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyzgpx6",
            "score": 1,
            "text": "Children are losing their lives in their homes.  What more death and devastation does a Democratic nation need to allow, before we react to these crimes.  We are all a part of a world that can survive without people like the Putins and his backers like the Trumps.  People in Russia are being fed the opinions of a racist, anti-democratic Putin sympathizer.  Feeds of the Tucker Carlsons \"opinions\" are bad for America and are being broadcasted to Putin followers all over the world.  This is not news Tucker, this is feeding the beast so it can get bigger and more powerful.  Try just reporting the News, no opinions.  It will save lives.",
            "title_similarity": "0.47324818",
            "sentiment_compound": -0.8995
        },
        {
            "id": "hyzlohr",
            "score": -1,
            "text": "Don’t get your hopes up",
            "title_similarity": "0.5453838",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hyzlohy",
            "score": -1,
            "text": "There is nothing Biden can say ..",
            "title_similarity": "0.5533372",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyzpdo8",
            "score": 1,
            "text": "Or better yet, *do* something strong and useful.",
            "title_similarity": "0.35927233",
            "sentiment_compound": 0.8442
        },
        {
            "id": "hyzpixr",
            "score": 1,
            "text": "Good job world. Everyone who can stop this is twitting and wasting every second. \nIs everyone on a dare challenge to see how far this goes? Are we keeping this snowball growing as it rolls down the hill to see how big it gets? Civilians, children! are being merciless murdered on the streets right now.. one day this will become a fcking avalanche that will affect us all.. by the looks of it, we already went past the point of no return towards a fucking catastrophe.",
            "title_similarity": "0.31689197",
            "sentiment_compound": -0.9177
        },
        {
            "id": "hyzzpft",
            "score": -1,
            "text": "We all wish that",
            "title_similarity": "0.23172915",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hz016og",
            "score": -1,
            "text": "Ha. Good luck with that",
            "title_similarity": "0.22009817",
            "sentiment_compound": 0.7096
        },
        {
            "id": "hz07bw7",
            "score": 1,
            "text": "Well this aged well…",
            "title_similarity": "0.21067238",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hz09gxe",
            "score": -1,
            "text": "He is the main star of a comedy.",
            "title_similarity": "0.31471676",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hz0c3oq",
            "score": -1,
            "text": "Is he calling Biden stupid? Lol",
            "title_similarity": "0.4967438",
            "sentiment_compound": -0.1531
        },
        {
            "id": "hz0eix6",
            "score": 1,
            "text": "Hillary called him a clown so it sucks that Biden is forced to go with that. I see him as a hero.",
            "title_similarity": "0.48962268",
            "sentiment_compound": -0.2911
        },
        {
            "id": "hz0i7zj",
            "score": 1,
            "text": "I love the part where the former actor and comedian says, “I’m not in a movie” Hahaha.",
            "title_similarity": "0.6339377",
            "sentiment_compound": 0.886
        },
        {
            "id": "hz0l0cu",
            "score": 1,
            "text": "America with all this firepower yet helpless to render aid in a forceful way. Stay strong Ukraine!",
            "title_similarity": "0.61518514",
            "sentiment_compound": 0.1511
        },
        {
            "id": "hyyqv5c",
            "score": 7,
            "text": "Zelensky is the man that Trump’s supporters think Trump is.",
            "title_similarity": "0.46799374",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hyyvq9v",
            "score": -7,
            "text": "Biden isn't even strong enough to stay awake come on now.",
            "title_similarity": "0.43670213",
            "sentiment_compound": -0.4023
        },
        {
            "id": "hz0655j",
            "score": -8,
            "text": "[deleted]",
            "title_similarity": "0.35716873"
        },
        {
            "id": "hyyrkk4",
            "score": -8,
            "text": "Can we Trade Biden and Caramel for this guy?",
            "title_similarity": "0.29874438",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyyrwrg",
            "score": -8,
            "text": "Strong and useful, 2 words that have never been used to describe Joe Biden",
            "title_similarity": "0.6578566",
            "sentiment_compound": 0.7351
        },
        {
            "id": "hyyxoid",
            "score": -8,
            "text": "Spoiler alert, he won’t because he has dementia",
            "title_similarity": "0.6469028",
            "sentiment_compound": 0.296
        },
        {
            "id": "hyyy4uu",
            "score": -8,
            "text": "Lol Biden isn't strong... besides it's whatever the elites want him to say.",
            "title_similarity": "0.6953864",
            "sentiment_compound": 0.1022
        },
        {
            "id": "hz0dxit",
            "score": -7,
            "text": "[removed]",
            "title_similarity": "0.36520636"
        },
        {
            "id": "hyyepfj",
            "score": -8,
            "text": "Zelensky needs to chill out. He was wrong about our warnings of an imprnding invadion and Biden is doing all he can to asdist Ukraine short of starting WW3. Do STFU",
            "title_similarity": "0.5905163",
            "sentiment_compound": -0.6486
        },
        {
            "id": "hyys4wa",
            "score": -9,
            "text": "He knows that Biden is going to just read whatever babble his puppet master writes - I'm amazed there even will be a state of the union speech - not sure how good it will be when Biden forgets where he is in the middle of it.",
            "title_similarity": "0.5163426",
            "sentiment_compound": -0.0433
        },
        {
            "id": "hz01tbf",
            "score": -8,
            "text": "US backslapping at doing nothing is sickening.  \n\nI'm a huge Biden defende, but thus appeasement strategy is a fatal mistake now that the attack of a week ago happened.\n\nVowing to be tough in other countries but \"not Ukraine\" is another permission slip for Putin's latest of numerous slaughters.  \n\nThis will age terribly as the thousands of innocent Ukrainian civilian bodies stack up this week.  \n\nPutin took meaningless appeasement off the table a week ago.  The lines have just been crossed, they've been demolished.  \n\nThe children he murdered yesterday, today and the ones tomorrow don't care about meaningless fine print in NATO and EU application forms.  Those children won't be brought back to life or have their faces and organs and limbed restored by hollow apologism and cowardly appeasement.",
            "title_similarity": "0.43283617",
            "sentiment_compound": -0.9761
        },
        {
            "id": "hz0i4vc",
            "score": -10,
            "text": "Lmao Biden say something strong. Lol that made me laugh. He always sounds like he's half asleep when he's on stage talking. \n\nI hope he says something strong and useful too. But I don't know if they could dose him with enough Adderall and not risk his health.\n\n\nEdit: just checking back in to say I was wrong. Biden said it best. Russia will NEVER capture the hearts and souls of the Uranian people! Stay strong Uran.",
            "title_similarity": "0.57373595",
            "sentiment_compound": 0.9481
        },
        {
            "id": "hyy2jkn",
            "score": -2,
            "text": "I mean I was in a movie about being the president of Ukraine",
            "title_similarity": "0.3374368",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyyl2md",
            "score": -2,
            "text": "Maybe he will tell Sean Penn to zip it",
            "title_similarity": "0.36126643",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyym54m",
            "score": -2,
            "text": "Uhh..",
            "title_similarity": "0.20460306",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyyoywn",
            "score": 2,
            "text": "Better president than the last 5 o 6 US presidents.",
            "title_similarity": "0.30372214",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hyyprip",
            "score": 2,
            "text": "Well done sir . Let’s pray 🙏 for peace ☮️",
            "title_similarity": "0.3895635",
            "sentiment_compound": 0.886
        },
        {
            "id": "hyyqkrw",
            "score": 2,
            "text": "This aint Kurt Russell. This be Rambo.",
            "title_similarity": "0.5937843",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyyqzcc",
            "score": -2,
            "text": "Knowing Biden he will say: \" a pipe wrench, man!!\"",
            "title_similarity": "0.34614578",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyyu9rh",
            "score": 2,
            "text": "Fuck me what a badass man they have leading Ukraine. Everything he says just makes you root for him even harder",
            "title_similarity": "0.3352307",
            "sentiment_compound": -0.2732
        },
        {
            "id": "hyyuke7",
            "score": 2,
            "text": "I hope he lives through this",
            "title_similarity": "0.32937294",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hyyza7k",
            "score": -2,
            "text": "Tbh waiting for Biden to say something strong and useful like when he's going to forgive student loans and not talk out of his ass.",
            "title_similarity": "0.58944976",
            "sentiment_compound": 0.743
        },
        {
            "id": "hyz0a0g",
            "score": 2,
            "text": "That man has balls of pure Ukranium",
            "title_similarity": "0.3449877",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyz0m9x",
            "score": 2,
            "text": "It's been a while since a US president said anything that was both strong and useful at the same time.  Make it happen Biden, the world is watching.",
            "title_similarity": "0.5287007",
            "sentiment_compound": 0.7351
        },
        {
            "id": "hyz0na5",
            "score": -2,
            "text": "Prediction: Biden will emotionlessly read from a teleprompter and manage to tell us nothing we don't already know.\n\nBut I hope I'm wrong.",
            "title_similarity": "0.6592493",
            "sentiment_compound": -0.0772
        },
        {
            "id": "hyz0r6k",
            "score": 2,
            "text": "\"If you don't support President Zelensky and the Ukraine, you ain't black\"",
            "title_similarity": "0.58837044",
            "sentiment_compound": -0.3089
        },
        {
            "id": "hyz1g5f",
            "score": -2,
            "text": "Biden is an empty bag of words.  The left will say he \"gave his strongest statement yet\" on Ukraine and the right will mock him.  Independents will understand he said nothing of value.",
            "title_similarity": "0.673274",
            "sentiment_compound": -0.409
        },
        {
            "id": "hyz2nnk",
            "score": -2,
            "text": "Biden say something useful? Lmao",
            "title_similarity": "0.38191727",
            "sentiment_compound": 0.7783
        },
        {
            "id": "hyz2vcb",
            "score": -2,
            "text": "he better help them with OUR money or Mr Z will spill the beans on HUNTER !!! this is gonna get crazy soon",
            "title_similarity": "0.41572624",
            "sentiment_compound": 0.6219
        },
        {
            "id": "hyz2vft",
            "score": -2,
            "text": "Biden is lucky for the Ukraine situation (as sad as it is) because he has nothing else to talk about except for the infrastructure bill. I bet his poll numbers go up for the first time.",
            "title_similarity": "0.4522514",
            "sentiment_compound": -0.0772
        },
        {
            "id": "hyz36nx",
            "score": -2,
            "text": "When other world leaders have to tell you what to say because you can’t but they don’t realize you have dementia and will mess it up anyway.",
            "title_similarity": "0.59851325",
            "sentiment_compound": -0.5023
        },
        {
            "id": "hyz4tsj",
            "score": -2,
            "text": "Biden won’t he’s a gutless turd and has a birdbrain for a vp!! They’re both useless. Stay strong Ukraine!!",
            "title_similarity": "0.5935717",
            "sentiment_compound": 0.3956
        },
        {
            "id": "hyz72pk",
            "score": 2,
            "text": "Strong and useful like: “I’m canceling student debt”",
            "title_similarity": "0.5077647",
            "sentiment_compound": 0.8271
        },
        {
            "id": "hyz9qaz",
            "score": 2,
            "text": "We’ve all been waiting a while for that. (Disappointed Dem here.)",
            "title_similarity": "0.3897655",
            "sentiment_compound": -0.4767
        },
        {
            "id": "hyzaa86",
            "score": -2,
            "text": "https://en.m.wikipedia.org/wiki/Corruption_in_Ukraine",
            "title_similarity": "0.29630578",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyzc7uw",
            "score": 2,
            "text": "If the message isn't get the fuck out of Ukraine and deal with your sanctions until Putin is dead or we are coming to Ukraine it isn't enough.",
            "title_similarity": "0.50497085",
            "sentiment_compound": -0.3506
        },
        {
            "id": "hyzeh9x",
            "score": 2,
            "text": "Funny. I keep seeing on politics that Biden has been doing good or saved his presidency because of how he has reacted to this. Yet when asked what it is he has done so powerful I can’t seem to find an answer",
            "title_similarity": "0.50364614",
            "sentiment_compound": 0.9045
        },
        {
            "id": "hyzxjb6",
            "score": -2,
            "text": "Please, Tell us about Cornpop again",
            "title_similarity": "0.33296037",
            "sentiment_compound": 0.3182
        },
        {
            "id": "hz06t45",
            "score": 2,
            "text": "I think he just did.",
            "title_similarity": "0.29176348",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz08o2w",
            "score": -2,
            "text": "Perhaps another Corn Pop anecdote will do the trick!",
            "title_similarity": "0.28004432",
            "sentiment_compound": -0.126
        },
        {
            "id": "hz08o8q",
            "score": 2,
            "text": "He gets hotter every day, I swear.\n\nBut… if it goes to his head he could cross the hubris line.\n\nUntil then… *tosses panties in solidarity*",
            "title_similarity": "0.36165494",
            "sentiment_compound": 0.25
        },
        {
            "id": "hz0edok",
            "score": 2,
            "text": "Refresh to new comments rather than best gives me hope",
            "title_similarity": "0.53737724",
            "sentiment_compound": 0.7964
        },
        {
            "id": "hz0essq",
            "score": 2,
            "text": "Anyone else going to see phish this summer?",
            "title_similarity": "0.28402808",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz2hd21",
            "score": -2,
            "text": "YEAH, You’re in a comedy sitcom series that’s about to air in the UK while you’re supposedly fighting n “defending your Country” Globalist Elites at it again!!! What a coincidence. You do this n we’ll do that. Rotten Puppet",
            "title_similarity": "0.4616937",
            "sentiment_compound": -0.3056
        },
        {
            "id": "hyyo5ch",
            "score": -10,
            "text": "Forget that Z. The old man’s not sticking his neck out further than what it takes to use your situation to cover his on going crap.",
            "title_similarity": "0.680668",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hyyqov2",
            "score": 9,
            "text": "The amount of pride this guy feels about himself and is country will never be matched. \n\nTake note Trump:You can’t buy your way to lie to yourself for this feeling. \n\nThis is the world respect Trump has been wanting his whole life. He’s got to be so pissed someone else is getting it. I bet when asked about Zelensky he talks down on him out of jealousy.",
            "title_similarity": "0.5157724",
            "sentiment_compound": -0.3697
        },
        {
            "id": "hz074m1",
            "score": -10,
            "text": "I urge Biden to say a full, coherent sentence.",
            "title_similarity": "0.4439114",
            "sentiment_compound": 0.0772
        },
        {
            "id": "hyyhqnu",
            "score": -11,
            "text": "Bien saying something strong and useful. That’s funny",
            "title_similarity": "0.3072129",
            "sentiment_compound": 0.8442
        },
        {
            "id": "hz04bvd",
            "score": -11,
            "text": "We're lucky if he can even form a single coherent sentence.",
            "title_similarity": "0.3727046",
            "sentiment_compound": 0.4767
        },
        {
            "id": "hz0fj89",
            "score": -10,
            "text": "Biden ain’t got it folks. He’s a fuckin idiot that fooled all of you. God have mercy",
            "title_similarity": "0.4182096",
            "sentiment_compound": -0.4323
        },
        {
            "id": "hyydu31",
            "score": 3,
            "text": "Putin is on drugs it’s clear",
            "title_similarity": "0.35784394",
            "sentiment_compound": 0.3818
        },
        {
            "id": "hyynai6",
            "score": 3,
            "text": "Nobody likes war or the damage it brings about. In a perfect world we would stop it all. That being said, intervening here has a lot of consequences for the US. Those require careful consideration, discussion, and a democratic process. Unless it’s an emergency, the president alone should not being the sole determining factor for our actions. One of the largest determining factors, especially for whether it is an emergency or not, is whether we have a formal alliance or binding rules of an organization (such as NATO) requiring us to act. Since we do not have that with Ukraine, Zelensky needs to stop being aggressive with his demands. I get that he is doing what he needs to in order to help his country, but demanding of our president to circumvent those discussions and deliberations, and put little thought into the harm it will do to US citizens, is absurd. It’s unfortunate this invasion has begun so fast, but we should not rush to make a decision that could start a war with a nuclear power on behalf of a country we have no agreement to defend. Let our processes and democracy play out and if we are able to help in a way that doesn’t hurt (or at least reasonably protects) US citizens I hope we do. Everybody would love to be rid of Putin",
            "title_similarity": "0.6638031",
            "sentiment_compound": -0.8748
        },
        {
            "id": "hyys1j7",
            "score": 3,
            "text": "How many different ways can he beg the world for help?  \n\nHow shocked would we be, the US, if an aggressor nation attacked us and we didn’t get foreign military assistance if and when requested. \n\nI can’t imagine a much bigger aggressor attempting to exterminate me in front of the world without good reason and everyone watching it happen. \n\nI have no clue what will happen. No one really does. I can imagine different scenarios. One is in which the ending is bad for Ukraine’s government and people. I hope I’m way off.",
            "title_similarity": "0.5622843",
            "sentiment_compound": -0.8911
        },
        {
            "id": "hyyz83a",
            "score": -3,
            "text": "It would be nice if Biden would be useful. The US response has lagged even Germany’s.",
            "title_similarity": "0.47765914",
            "sentiment_compound": 0.5423
        },
        {
            "id": "hyyzae3",
            "score": -2,
            "text": "I’d love it if Biden actually did something for once.",
            "title_similarity": "0.36638403",
            "sentiment_compound": 0.6369
        },
        {
            "id": "hyyzil0",
            "score": 3,
            "text": "Zelensky was warned for months as Russia built up on his border and he cracked jokes and said the US was wrong instead. So, I think the US knows it's not a movie.",
            "title_similarity": "0.53229076",
            "sentiment_compound": -0.4939
        },
        {
            "id": "hyz04ps",
            "score": 3,
            "text": "No matter what Biden says republicans are going to blame him for everything. Truths is Trump is responsible for so much of what is going on now. 4 yrs of Trump has so much consequences.",
            "title_similarity": "0.4399962",
            "sentiment_compound": 0.3871
        },
        {
            "id": "hyz3a1v",
            "score": -3,
            "text": "Biden can’t string an intelligent sentence together FFS",
            "title_similarity": "0.5338255",
            "sentiment_compound": -0.3034
        },
        {
            "id": "hyz6nal",
            "score": -3,
            "text": "Hey man, get in line!  American citizens are waiting for him to say something strong and useful as well 🤣\n\nMaybe we should just start with something coherent lol.",
            "title_similarity": "0.58267653",
            "sentiment_compound": 0.9273
        },
        {
            "id": "hyz6o53",
            "score": -3,
            "text": "Don't hold your breath Zelensky. Biden is as weak as they come.",
            "title_similarity": "0.6094033",
            "sentiment_compound": -0.4404
        },
        {
            "id": "hyz72e6",
            "score": -3,
            "text": "Sleepy joe 😴",
            "title_similarity": "0.3384297",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyzbu7e",
            "score": -3,
            "text": "I’m afraid if he’s holding his breath on Biden saying something “strong” “useful” then he might be in trouble.",
            "title_similarity": "0.58191484",
            "sentiment_compound": -0.4019
        },
        {
            "id": "hyzhbqk",
            "score": -2,
            "text": "He’s sleeping",
            "title_similarity": "0.24400109",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyzhghz",
            "score": 3,
            "text": "Dumb question but why can’t we send Ukraine more than just RPGs, Javelin’s, and stingers? Why can’t we send them a few A10s or larger missiles to completely wreck that convoy?",
            "title_similarity": "0.46455944",
            "sentiment_compound": -0.7782
        },
        {
            "id": "hyzj84u",
            "score": 3,
            "text": "He is doing what an amazing leader does. Something someone like me from the US , WILL NEVER SEE \n\nSLAVA UKRAINE",
            "title_similarity": "0.63620317",
            "sentiment_compound": 0.743
        },
        {
            "id": "hyzjtcw",
            "score": 3,
            "text": "Man, the Russian Trolls are out in force tonight. If they aren’t actually Russian, they are treasonous Americans.  Fake patriots. If they had been alive during World War 2, they would have shit on President Roosevelt for being weak and not providing adequate defenses to protect the fleet in Pearl Harbor.  These are very trying times for America and we need to rally support for our president.",
            "title_similarity": "0.51876974",
            "sentiment_compound": -0.9097
        },
        {
            "id": "hz006ki",
            "score": 3,
            "text": "Biden needs to go all-out with sanctions then offer to lift all of them if, and only if, Putin fully withdraws from Ukraine. Putin's regime has already shown it does not give a fuck about words, only actions. \n\nI don't know if it will save Ukraine tbh, because the realist in me knows their military situation is dire. But if our response is some half ass shit that only lasts a few months, Russia will just keep invading places... they already took Crimea before this. Election interference, launching soft invasions of \"separatists\" in other countries, threatening nuclear armageddon every other day... Putin has to be stopped. Start the economic stranglehold now and don't let up until we have at least new leadership in Russia.",
            "title_similarity": "0.57746994",
            "sentiment_compound": -0.9483
        },
        {
            "id": "hyyuq98",
            "score": 75,
            "text": "Zelensky is the type of leader that Trump thinks he is in his own mind.",
            "title_similarity": "0.56171465",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyxyt9c",
            "score": 491,
            "text": "I can't tell if the \"Russia is going to win\" Reddit comments are from edge lords or Russian propaganda bots. Slava Ukraini! 💙🇺🇦💛",
            "title_similarity": "0.5398363",
            "sentiment_compound": 0.807
        },
        {
            "id": "hyyyidk",
            "score": 27,
            "text": "I admire Zelensky a great deal but there's only so much the U.S. can do for Ukraine without starting a nuclear war with Russia and I'm pretty sure we've done most or all of it. There's not much room left for the U.S. to tighten screws.\n\nEDIT: To be clear, I'm talking strictly in terms of sanctions or military aid because that's what I assumed Zelensky to be referring to here. Humanitarian aid is something that is always valuable and there's no such thing as doing too much.",
            "title_similarity": "0.5848594",
            "sentiment_compound": 0.8294
        },
        {
            "id": "hyyncb1",
            "score": -13,
            "text": "Biden will completely and utterly stumble though his speech, just like he always does.",
            "title_similarity": "0.42789206",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hyztci1",
            "score": -11,
            "text": "The words “Biden” “strong” and “useful” just don’t go together. In any scenario... likely will be a disaster.",
            "title_similarity": "0.6917051",
            "sentiment_compound": -0.6249
        },
        {
            "id": "hyzzk3a",
            "score": -13,
            "text": "Problem is our President Biden isn’t strong. We all know this here in America",
            "title_similarity": "0.6098292",
            "sentiment_compound": 0.1531
        },
        {
            "id": "hz05gzb",
            "score": -14,
            "text": "Biden failed.",
            "title_similarity": "0.4338668",
            "sentiment_compound": -0.5106
        },
        {
            "id": "hyxxns1",
            "score": 219,
            "text": "I'm gonna say the dude is iconic.",
            "title_similarity": "0.40261146",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyyr99h",
            "score": 4,
            "text": "Don’t actions speak louder that words? Biden’s doing everything imaginable to help the Ukrainian people",
            "title_similarity": "0.4563022",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hyyv9et",
            "score": -5,
            "text": "Strong and useful are not words I would use to describe Joe Biden.",
            "title_similarity": "0.7793846",
            "sentiment_compound": 0.7351
        },
        {
            "id": "hyyvj3y",
            "score": -4,
            "text": "Dunno how heroic this is. Dude is starting to beg Biden for shelter under NATO, it isn't a good look internationally even at this moment.\n\nIf he had better instincts he would put on the independence mantle and save his plea for humanitarian cause.\n\nIt won't be popular to realize this, but the tug of war he is in would be better served by an independent stance.",
            "title_similarity": "0.66189927",
            "sentiment_compound": 0.1232
        },
        {
            "id": "hyz0tfi",
            "score": -4,
            "text": "Biden is a very weak president. I'm not a trump supporter or a republicans. But the world knows this.",
            "title_similarity": "0.71758986",
            "sentiment_compound": -0.3619
        },
        {
            "id": "hyz82oz",
            "score": -3,
            "text": "Came here to see how creative Biden supporter can get to defend his sorry lack of leadership",
            "title_similarity": "0.6589846",
            "sentiment_compound": 0.34
        },
        {
            "id": "hyza7n4",
            "score": -3,
            "text": "[deleted]",
            "title_similarity": "0.35716873"
        },
        {
            "id": "hyzcgjz",
            "score": -4,
            "text": "[deleted]",
            "title_similarity": "0.35716873"
        },
        {
            "id": "hyzelgj",
            "score": -4,
            "text": "Yeah…. We all know Biden couldn’t say anything “strong” or “useful” if he was paid to",
            "title_similarity": "0.7284773",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyzgns2",
            "score": -4,
            "text": "Biden is going to talk about sanctions because he’s a gutless coward who is hanging the Ukraine out to dry, it’s going to be pure bs and propaganda, not worth it, watch a movie instead.",
            "title_similarity": "0.46623942",
            "sentiment_compound": -0.6874
        },
        {
            "id": "hyzh3u4",
            "score": -5,
            "text": "We’ve been asking to say something useful for 14 months",
            "title_similarity": "0.30216765",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hyzi9ap",
            "score": -4,
            "text": "Does Biden know who Zelensky is?",
            "title_similarity": "0.3536796",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyzi9vq",
            "score": -4,
            "text": "Umm ummm ummm cough syrup...said Biden",
            "title_similarity": "0.3013679",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyzixtr",
            "score": -4,
            "text": "Biden can barely say anything at all lol",
            "title_similarity": "0.42041093",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hyznb1l",
            "score": -4,
            "text": "The USA is looking for a new president. We need someone strong and useful like Zelensky.",
            "title_similarity": "0.5848892",
            "sentiment_compound": 0.8271
        },
        {
            "id": "hz1r8c3",
            "score": -3,
            "text": "Unfortunately Biden struggled to read a teleprompter let alone formulate his own thoughts.",
            "title_similarity": "0.5498956",
            "sentiment_compound": -0.7003
        },
        {
            "id": "hyymhct",
            "score": -13,
            "text": "He won’t say anything because he is a clown he’s not even the president he’s just playing a role as a result of a “fake election “",
            "title_similarity": "0.57259053",
            "sentiment_compound": 0.2023
        },
        {
            "id": "hz059yx",
            "score": -16,
            "text": "This did not even have to age to not be well.  That was the most disconnected Union speech I’ve ever heard. And Nancy in the background. So much cringe. Not sure how r/politics can spin that but I’ll have some popcorn ready watching my downvotes and your spin.",
            "title_similarity": "0.5100388",
            "sentiment_compound": 0.3318
        },
        {
            "id": "hyytzl1",
            "score": 7,
            "text": "One problem with the article's pitch is that American efforts relating to this war have been effective precisely because they have *not* been heavy handed.  Biden helped set the stage with intelligence etc. but the most effective action and most direct confrontation has come from Ukraine's European allies.",
            "title_similarity": "0.4897253",
            "sentiment_compound": 0.1679
        },
        {
            "id": "hyz880k",
            "score": -6,
            "text": "Biden is a puppet",
            "title_similarity": "0.27401823",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyzn6a9",
            "score": -5,
            "text": "Biden’s just sitting on the sidelines throwing fire at the situation. He doesn’t care about Ukrainians any more than he cares about poor and working class Americans, or anybody else for that matter. But the US ruling class is desperate to *not* be seen as an empire in decline, and a prolonged, bloody conflict gives them a bad guy to point to. Ukraine is caught in the middle of two groups who don’t give a fuck about them",
            "title_similarity": "0.50415254",
            "sentiment_compound": -0.9624
        },
        {
            "id": "hyznaft",
            "score": -4,
            "text": "Maybe Biden should urge him back to arrest the racist Ukrainians not letting Africans evacuate because they’re black.",
            "title_similarity": "0.40717277",
            "sentiment_compound": -0.7506
        },
        {
            "id": "hz04knj",
            "score": -5,
            "text": "Biden is a dove.   Lip service doesn't matter if Zelensky is dead when Biden wakes up tomorrow.",
            "title_similarity": "0.53996825",
            "sentiment_compound": -0.6569
        },
        {
            "id": "hyxwscg",
            "score": 126,
            "text": "Russia’s opponents are fighting a 21st Century war, squeezing the money, turning the enemy on itself. \n\nGround troops puts you on Putin’s turf and emboldens his escalation, he’s working from a Stalinist playbook, one that works for controlling his own nation but not taking control of another. \n\nIt’s horrible for the Ukrainians forced to face this, but intervention is only going to make things worse for everyone.",
            "title_similarity": "0.4393432",
            "sentiment_compound": -0.9604
        },
        {
            "id": "hyykffp",
            "score": -7,
            "text": "Useful, hilarious.",
            "title_similarity": "0.17766361",
            "sentiment_compound": 0.6808
        },
        {
            "id": "hyyp9j5",
            "score": -6,
            "text": "Does he know who the president is?",
            "title_similarity": "0.4129709",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyysfyu",
            "score": -7,
            "text": "Good luck with that. Trump definitely would have that speech covered.",
            "title_similarity": "0.43944955",
            "sentiment_compound": 0.8225
        },
        {
            "id": "hyzhee9",
            "score": -5,
            "text": "Biden “strong and useful” that movie will definitely be a comedy",
            "title_similarity": "0.37794912",
            "sentiment_compound": 0.6369
        },
        {
            "id": "hyzw5km",
            "score": 19,
            "text": "Biden is killing it",
            "title_similarity": "0.25436738",
            "sentiment_compound": -0.6597
        },
        {
            "id": "hyyiwej",
            "score": -21,
            "text": "I doubt kiddy sniffer biden even knows the difference between Ukraine and UK. He probably thinks the former is the UK in winter because of all the wet weather.",
            "title_similarity": "0.46805906",
            "sentiment_compound": -0.3612
        },
        {
            "id": "hyyj730",
            "score": -24,
            "text": "Lol say what you want, this wouldn’t have happened under trump. Biden is so decrepit he probably doesn’t even remember who Russia invaded. Come on man!",
            "title_similarity": "0.6742803",
            "sentiment_compound": 0.5255
        },
        {
            "id": "hyyji07",
            "score": -25,
            "text": "Biden won’t. He’s the worst President America has ever had.",
            "title_similarity": "0.617306",
            "sentiment_compound": -0.6249
        },
        {
            "id": "hyypahy",
            "score": -7,
            "text": "Talk is cheap.  So how about doing something real too, like stop buying oil from Russia now, something we would not have needed to do in the first place if Biden had not impeded our own oil industry.",
            "title_similarity": "0.5744581",
            "sentiment_compound": 0.0772
        },
        {
            "id": "hyyxck1",
            "score": -5,
            "text": "[removed]",
            "title_similarity": "0.36520636"
        },
        {
            "id": "hyzco9e",
            "score": -7,
            "text": "Let’s just hope Biden is coherent for once",
            "title_similarity": "0.45148295",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hyzl1vd",
            "score": -7,
            "text": "That’s asking an extremely difficult thing for Biden to do, I hope he doesn’t poop his pants when he’s speaking.",
            "title_similarity": "0.6042048",
            "sentiment_compound": 0.0276
        },
        {
            "id": "hyyp1o9",
            "score": -9,
            "text": "Yea the big guy needs to speak before he throws you under the bus like he has.",
            "title_similarity": "0.44788563",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hyyvr4a",
            "score": -6,
            "text": "But he is an actor. That's why the US put him there. He just needs to act. Can't expect others to do that for him.",
            "title_similarity": "0.54388833",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyyzb32",
            "score": -9,
            "text": "https://youtu.be/C-2hkPMuAyE\nThese are the people you are supporting, just know that you will not be looked upon in good light in the coming years",
            "title_similarity": "0.6378149",
            "sentiment_compound": 0.7003
        },
        {
            "id": "hyyb5iv",
            "score": -9,
            "text": "Don't worry! I'm sure the speech will be amaaaazing! You know the thing? That thing? Come on man!!!!",
            "title_similarity": "0.55013585",
            "sentiment_compound": 0.4537
        },
        {
            "id": "hyyquei",
            "score": -9,
            "text": "BIDENS going to say “ cornpop was a bad guy (confused look) arraarrrahhhawwwwa… straight razor?",
            "title_similarity": "0.46887594",
            "sentiment_compound": -0.5994
        },
        {
            "id": "hyyzwcl",
            "score": -8,
            "text": "[deleted]",
            "title_similarity": "0.35716873"
        },
        {
            "id": "hyypoto",
            "score": 135,
            "text": "Notice how the actual badasses never have to tell you how badass they are?   \n\nTrump, who claims this never would have happened if he were still president because he is such a tough guy, hid out in a bunker because there were some protesters outside the White House.  Zelensky on the other hand…",
            "title_similarity": "0.55880606",
            "sentiment_compound": -0.1027
        },
        {
            "id": "hyzbvek",
            "score": 12,
            "text": "Joe isn't perfect but i appreciate his humility after years of the annoying bravado and over-confidence squatting in the Oval.",
            "title_similarity": "0.38026482",
            "sentiment_compound": -0.2498
        },
        {
            "id": "hyzoyv2",
            "score": -12,
            "text": "Even he knows Biden is a dumb mf. Let’s go Brandon!",
            "title_similarity": "0.5598809",
            "sentiment_compound": -0.5562
        },
        {
            "id": "hyzyzxg",
            "score": -13,
            "text": "Biden won’t say anything. He hasn’t closed American airspace, he decimated the US in terms of energy production, closing our pipelines at the same time as lifting sanctions on Nordstream 2 and we buy 640,000 barrels a day from Russia. Not only did he ensure that the US is dependent in part on Russian oil, but he undercut the efforts to get the EU off of Russian oil by having the US be a net energy exporter. He gave Putin the keys to this car and allowed him to take this deadly joyride.",
            "title_similarity": "0.5202544",
            "sentiment_compound": 0.7684
        },
        {
            "id": "hyxrj05",
            "score": 1904,
            "text": "The US is not going to war with Russia. That would be the last thing the world wants. I think Biden has been handling this well but there's only so much we can do.",
            "title_similarity": "0.70091707",
            "sentiment_compound": 0.4138
        },
        {
            "id": "hyynp10",
            "score": -15,
            "text": "Something fishy about all of this. I’m not pro Russia but this all seems very planned. I pay attention to the media and can tell when they’re drumming up their war machine again. The rushed pull out from Afghanistan, Zelenskyy being an actor etc.. all seems too coincidental. Why does NATO need to be in Ukraine?? what if Russia had a massive military and nuclear base in Mexico… pretty sure USA would be pissed. Why can’t the West leave Russia alone? Ukraine is not worth WW3. Why the Double standards?? Didn’t NATO and USA invade Iraq and Afghanistan? I don’t remember Russia getting involved???",
            "title_similarity": "0.6008959",
            "sentiment_compound": -0.9128
        },
        {
            "id": "hyzt11l",
            "score": -13,
            "text": "Biden is a weak moron …",
            "title_similarity": "0.46250817",
            "sentiment_compound": -0.7269
        },
        {
            "id": "hz0d5dh",
            "score": -16,
            "text": "Zelensky just cares about the cameras on him, it’s pretty clear at this point",
            "title_similarity": "0.38784772",
            "sentiment_compound": 0.8316
        },
        {
            "id": "hyz21wu",
            "score": 18,
            "text": "It must be very strange. The US could stop the death of a European democracy. But doing so could plunge the rest of Europe into war. The responsible thing appears to be to let Russia strangle itself on sanctions and go back to bread lines. On the other hand it would be very nice to not have a mad man loose in Europe for the first time ever. And it's entirely doable, provided the world doesn't explode.",
            "title_similarity": "0.50953907",
            "sentiment_compound": 0.4469
        },
        {
            "id": "hyymws5",
            "score": 27,
            "text": "I fully understand the seriousness of what Big Z is saying but:\n\n1. You were.\n\n2. You are.",
            "title_similarity": "0.3792236",
            "sentiment_compound": -0.0598
        },
        {
            "id": "hyxsrtz",
            "score": 3573,
            "text": "The SOTU tonight will be the most important one perhaps in my lifetime. The entire free world has unified in support of Ukraine. Putin over played his hand and put himself in a terrible position. Russia's economy, Ukrainian lives, and the future strength of allied support are on the line. \n\nBiden needs to show admiration for the fight Ukraine is putting up, gratitude for the international response, commitment to continue, but most critically/difficultly Biden needs to provide Putin an exit ramp. Some vision for a realistic end needs to be present. Biden must resist the political urge to gloat. Biden shouldn't go for the cheap headline catching brag because Putin might respond punitively against the Ukrainian people. Humility towards Ukraine and our allies with finger pointing towards a solution for Russia. Biden needs to let Zelensky continue being the badass. Biden needs to be the sober diplomat.",
            "title_similarity": "0.5400665",
            "sentiment_compound": 0.9638
        },
        {
            "id": "hyy7jzb",
            "score": 1064,
            "text": "Truthfully, no matter how Biden addresses this war during his speech, every Republican/conservative is still going to hate him and claim Trump would have magically avoided this war. People will keep complaining about gas, but gas will keep rising as long as the companies think they can take advantage of people. Biden should explain that prices will rise unless gas companies decide to do the right thing and don’t take advantage of private citizens for something they didn’t do",
            "title_similarity": "0.57922655",
            "sentiment_compound": -0.4874
        },
        {
            "id": "hyxw1q5",
            "score": 12211,
            "text": "> Asked by CNN about his transformation from comic actor to world-famous wartime leader, Zelensky responded: \"It's very serious, it's not a movie ... I'm not iconic, I think Ukraine is iconic.\"\n\n\nThis. This is a leader. Could you imagine Trump refusing to be hailed as a hero? Real leaders are humble and put the country before themselves. Zelensky is a real leader and everyone should strive to be as good as him.",
            "title_similarity": "0.69833434",
            "sentiment_compound": 0.6258
        },
        {
            "id": "hyyq74t",
            "score": 663,
            "text": "So, serious question: can anybody clarify exactly what type of sentiment he’s hoping for? I mean obviously he wants support, but have they specifically asked for anything yet?\n\nI don’t mean this negatively, I’m just having a hard time sorting through all of this news.",
            "title_similarity": "0.60766125",
            "sentiment_compound": 0.3313
        },
        {
            "id": "hyyy3qh",
            "score": 139,
            "text": "“I’m not in the movie” a lot of people on the internet would do well to remember this.",
            "title_similarity": "0.4744293",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hyxp3lk",
            "score": 5292,
            "text": "Also: Russia’s move towards Kyiv 'stalled as troops running out of food’",
            "title_similarity": "0.48241466",
            "sentiment_compound": -0.2023
        },
        {
            "id": "hyye9ra",
            "score": 1,
            "text": "I love this dude.",
            "title_similarity": "0.1885403",
            "sentiment_compound": 0.6369
        },
        {
            "id": "hyyemrq",
            "score": 1,
            "text": "He won’t be a hero, he’ll be a legend!",
            "title_similarity": "0.70172596",
            "sentiment_compound": 0.5983
        },
        {
            "id": "hyylwto",
            "score": 1,
            "text": "The world is watching and this man understands the assignment",
            "title_similarity": "0.2089546",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyymae7",
            "score": 1,
            "text": ">I’m not in a movie, I’m not iconic’\n\nlol I feel bad for laugh XD but that was good",
            "title_similarity": "0.69256914",
            "sentiment_compound": 0.7185
        },
        {
            "id": "hyymv18",
            "score": 1,
            "text": "Interestingly enough, he has actually been in like a dozen movies.",
            "title_similarity": "0.13577697",
            "sentiment_compound": 0.6369
        },
        {
            "id": "hyyoa5a",
            "score": 1,
            "text": "Oh [he has alright….he has.](https://vinnews.com/2022/02/25/flashback-biden-gives-putin-list-of-critical-targets-not-to-attack/)",
            "title_similarity": "0.6241002",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyypytu",
            "score": 1,
            "text": "when did biden become iconic?",
            "title_similarity": "0.41976398",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyyq8wp",
            "score": 2,
            "text": "I hope he makes it out of this.",
            "title_similarity": "0.37628275",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hyyqxf1",
            "score": 1,
            "text": "Volodymyr \"John I don't want it Snow\" Zelenskyy",
            "title_similarity": "0.71301055",
            "sentiment_compound": -0.0572
        },
        {
            "id": "hyyr4h1",
            "score": 1,
            "text": "Do you think WW3 and nukes can come soon ?",
            "title_similarity": "0.4066453",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyyr8sq",
            "score": 1,
            "text": "[I am not the Messiah!](https://www.youtube.com/watch?v=4HB7zqP9QNo)",
            "title_similarity": "0.6713633",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyysfcu",
            "score": 1,
            "text": "At what point do other countries seriously consider attacking Russia or at least going to Ukraine to protect citizens and infrastructure?",
            "title_similarity": "0.49350718",
            "sentiment_compound": -0.2732
        },
        {
            "id": "hyysh80",
            "score": 2,
            "text": "Someone who is willing to put his life on the line.",
            "title_similarity": "0.43941584",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyyt2h8",
            "score": 1,
            "text": "My bets are that he will avoid the subject like the plague.",
            "title_similarity": "0.62772715",
            "sentiment_compound": 0.0772
        },
        {
            "id": "hyyt6tf",
            "score": 1,
            "text": "What a guy",
            "title_similarity": "0.25247094",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyyt8m5",
            "score": 1,
            "text": "Does anyone get the feeling that Putin  thinks that the moment crushes the Ukraine, not as easy as he thought, everything will go back to normal?",
            "title_similarity": "0.46457273",
            "sentiment_compound": -0.5867
        },
        {
            "id": "hyytcrq",
            "score": 2,
            "text": "Have to be strong while not tipping into a nuclear war",
            "title_similarity": "0.66991234",
            "sentiment_compound": -0.1531
        },
        {
            "id": "hyyv0yf",
            "score": 1,
            "text": "I find it interesting that during the 2000's Republicans were pro military intervention. Recent polls conducted show something like 90% of Republicans opposed to intervention, whereas this pro-democrat thread seems to suggest Biden should be increasing military support for Ukraine. I know support doesn't equal intervention, but it still is interesting.",
            "title_similarity": "0.5212937",
            "sentiment_compound": 0.8338
        },
        {
            "id": "hyyv7wn",
            "score": 1,
            "text": "Dude understands his audience.",
            "title_similarity": "0.1773526",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyyv94f",
            "score": 1,
            "text": "Useful as in, don't say anything about what got us into this mess. Just say putin bad, Ukraine good, let Ukraine join the EU and hope nuclear war doesn't ensue",
            "title_similarity": "0.62155944",
            "sentiment_compound": -0.0964
        },
        {
            "id": "hyyvdx9",
            "score": 1,
            "text": "It would be refreshing for him to say inflation due to energy is going to get worse, not better. And we have to be patient, tighten our belts while supply chains come back on line and new ones spin up. We're going to be the world leader in producing natural gas this year. Don't think folks realize we are spinning up fast",
            "title_similarity": "0.48592275",
            "sentiment_compound": -0.2278
        },
        {
            "id": "hyyvu40",
            "score": 2,
            "text": "Hes talking about the 600 reddit posts a day with clips of his old movies or his head photoshopped onto an apache helicopter.",
            "title_similarity": "0.18039012",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyyvuzz",
            "score": 2,
            "text": "He picked a great day to offer a 5 million ruble reward to stop fighting. The ruble is worth less than 1 cent now",
            "title_similarity": "0.37972113",
            "sentiment_compound": 0.7184
        },
        {
            "id": "hyyvxp9",
            "score": 1,
            "text": "Dude needs a siege mustache",
            "title_similarity": "0.43161637",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyywksj",
            "score": 2,
            "text": "I think Putin is waiting for what Biden says in the SOTU before he bombs Kyiv! He strong for Ukraine, democracy and freedom!",
            "title_similarity": "0.4595849",
            "sentiment_compound": 0.8436
        },
        {
            "id": "hyywlpn",
            "score": 2,
            "text": "I think Putin is waiting for what Biden says in the SOTU before he bombs Kyiv! He strong for Ukraine, democracy and freedom!",
            "title_similarity": "0.4595849",
            "sentiment_compound": 0.8436
        },
        {
            "id": "hyyyfg8",
            "score": 2,
            "text": "Damn! That is some big dig energy this president is showing right now.",
            "title_similarity": "0.38696316",
            "sentiment_compound": -0.2244
        },
        {
            "id": "hyyz00x",
            "score": 31,
            "text": "I don't even know what we expect Biden to really do right now. As it stands right now, the damage from the sanctions isn't enough to get an acceptable deal. It would be like (forgive the not perfect metaphor it's all I can come up with atm) asking a python to negotiate with a deer when it's only halfway strangled. We played the sanction card and all we can do now is wait and give Ukraine as many resources as we can to help them stay in the fight, while physically staying out of it to prevent WWIII. Maybe in a week there will be something to do.",
            "title_similarity": "0.5306368",
            "sentiment_compound": -0.2955
        },
        {
            "id": "hyyzfd3",
            "score": 1,
            "text": "Vlad Pute was a bad dude…",
            "title_similarity": "0.3431038",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hyz0qbw",
            "score": 1,
            "text": "> I'm not in a movie, I'm not iconic\n\nThis is exactly the kind of thing an icon would say",
            "title_similarity": "0.77629834",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyz10un",
            "score": 2,
            "text": "Charlie Hebdo magazine cover tomorrow:  \nhttps://twitter.com/EuromaidanPR/status/1498786477853089792",
            "title_similarity": "0.41643125",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyz1899",
            "score": 2,
            "text": ">\tAsked by CNN about his transformation from comic actor to world-famous wartime leader, Zelensky responded: “It’s very serious, it’s not a movie … I’m not iconic, I think Ukraine is iconic\n\nAmerican media is unbelievable. Everything is a game to them. What a stupid question. Like this is even in the most remote corner of his mind right now. \n\nMaYbE If hE WiNs hE’Ll gO To dIsNeY WoRLd",
            "title_similarity": "0.67139983",
            "sentiment_compound": 0.4601
        },
        {
            "id": "hyz19g2",
            "score": 1,
            "text": "When you look up Maximum Dong, we need his picture to appear. When you look up GOAT politician, we need his picture to appear!",
            "title_similarity": "0.4848615",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyz1af3",
            "score": 2,
            "text": "I understand why he's trying but Biden is never going to impose any red line beyond NATO borders. At most he'll just offer more weapons.",
            "title_similarity": "0.6889534",
            "sentiment_compound": -0.4511
        },
        {
            "id": "hyz1kd2",
            "score": 1,
            "text": "He needs to just focus. And just be empathetic Joe but strong at the same time. Not a bad time to unite somewhat",
            "title_similarity": "0.5565727",
            "sentiment_compound": 0.8772
        },
        {
            "id": "hyz1xji",
            "score": 2,
            "text": "> President Biden will call out President Putin directly tonight in his State of the Union address, saying, \"He rejected efforts at diplomacy. He thought the West and NATO wouldn’t respond. And, he thought he could divide us here at home. Putin was wrong. We were ready.\"\n\nhttps://twitter.com/kaitlancollins/status/1498788288307552256?s=21",
            "title_similarity": "0.640625",
            "sentiment_compound": -0.5994
        },
        {
            "id": "hyz2xy2",
            "score": 1,
            "text": "Strong agree",
            "title_similarity": "0.25229353",
            "sentiment_compound": 0.7003
        },
        {
            "id": "hyz30sr",
            "score": 1,
            "text": "Any person living in a western country right now should be pressuring their government in any way they can think of to close the air space above Ukraine. If that starts WW3, then I’ll be the first to volunteer, but letting Ukraine just get bombed into dust will only lead to Putin making more and more aggressive moves against more and more countries, until he’s at your doorstep, and you’re making TikToks begging the world to help. Let’s save Ukraine, and never go down that path in the first place. The world could have Putin in front of a tribunal next week if we only stepped up to the plate.",
            "title_similarity": "0.5021626",
            "sentiment_compound": 0.6614
        },
        {
            "id": "hyz3129",
            "score": 1,
            "text": "He must have ment that commit in jest, cause Biden has said any thing strong, much less useful since he entered politics….",
            "title_similarity": "0.66314065",
            "sentiment_compound": 0.7968
        },
        {
            "id": "hyz33ll",
            "score": 1,
            "text": "We need something that says “we got you but we can’t swing until we get swung upon”",
            "title_similarity": "0.6376405",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyz3501",
            "score": 2,
            "text": "State of the unions are summations, agenda setting, and getting everyone the same page. Even if you don't agree with him it still forces you to deal with it. It forces opponents to talk about things they probably don't want to talk about and fucks with their own narrative. When it comes to the elephant i the room projecting strength and stopping just shy of telling Putin to go fuck himself doesn't mean war. I suspect he is going to be in lock step with the international community and isn't going to be overly aggressive. Because in truth we simply can't be. It's not out of cowardice it's out of responsibility. Unless Russia makes it so we have no other choice but to beat the fuck out of them.",
            "title_similarity": "0.6571439",
            "sentiment_compound": -0.8528
        },
        {
            "id": "hyz35lc",
            "score": 1,
            "text": "Fucking based",
            "title_similarity": "0.36544463",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyz372x",
            "score": 2,
            "text": "A guy who voiced Paddington sticking it to Putin is pretty iconic to be fair.",
            "title_similarity": "0.47751057",
            "sentiment_compound": 0.6705
        },
        {
            "id": "hyz3lrk",
            "score": 2,
            "text": "An American president saying something strong and useful? What does Zelensky think, America is full of leaders like him? An American president saying something useful and sticking by it will be the day corporations stop owning the people or to say when pigs fly.",
            "title_similarity": "0.5424167",
            "sentiment_compound": 0.8677
        },
        {
            "id": "hyz3sb6",
            "score": 2,
            "text": "What’s a point of talking “strong” and “useful” when more than 1/2 of people will be sitting there are spineless old fuck millionaires ?",
            "title_similarity": "0.49358612",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hyz410y",
            "score": 1,
            "text": "This very well might be one of the most important and well documented speeches in modern history, if not all of history.",
            "title_similarity": "0.42736512",
            "sentiment_compound": 0.705
        },
        {
            "id": "hyz43rl",
            "score": 1,
            "text": "Russia is gonna invade Moldova next",
            "title_similarity": "0.33058336",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyz490d",
            "score": 1,
            "text": "Yeah cause Biden is going to say something strong and useful tonight, he used to be so articulate about 30 years ago but don’t have too much hope now",
            "title_similarity": "0.48133016",
            "sentiment_compound": 0.8201
        },
        {
            "id": "hyz4m4h",
            "score": 1,
            "text": "What are the odds Putin pulls a Putin and pushes Kyiv during the State of the Union?",
            "title_similarity": "0.4414417",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyz4paf",
            "score": 1,
            "text": "Don't hold your breath, Biden won't do shit.",
            "title_similarity": "0.62987494",
            "sentiment_compound": 0.4449
        },
        {
            "id": "hyz4vj7",
            "score": 2,
            "text": "Can Biden do that? Say something Strong or useful?",
            "title_similarity": "0.45609304",
            "sentiment_compound": 0.7622
        },
        {
            "id": "hyz4vry",
            "score": 1,
            "text": "He's going to be disappointed.",
            "title_similarity": "0.346383",
            "sentiment_compound": -0.4767
        },
        {
            "id": "hyz5cqc",
            "score": 1,
            "text": "Biden is waging economic war against Russia. Words will be like throwing gas on the fire and reinforce Putin’s propaganda to his own people that the US is the bad guy in all this. Actions speak louder than words.",
            "title_similarity": "0.43224657",
            "sentiment_compound": -0.8519
        },
        {
            "id": "hyz5j6n",
            "score": 1,
            "text": "Picturing a speechwriter in DC frantically trying to rewrite this section of the SotU right now.",
            "title_similarity": "0.42181528",
            "sentiment_compound": -0.34
        },
        {
            "id": "hyz5r18",
            "score": 1,
            "text": "This man. He is literally doing everything you would want someone in his position to do and the world is gonna let his country fall to avoid stepping on toes. Fucking out putin in his God damn place already.",
            "title_similarity": "0.46292067",
            "sentiment_compound": -0.3612
        },
        {
            "id": "hyz5uec",
            "score": 1,
            "text": "NATO need to stop being frightened and take the lead here; get a no fly zone in place. If Putin is gonna push the big red button, he’ll do it anyway unless he gets exactly what he wants!",
            "title_similarity": "0.59938836",
            "sentiment_compound": -0.7644
        },
        {
            "id": "hyz5x4s",
            "score": 2,
            "text": "The Budapest Memorandum, which was in 94, dictates that we should already be there defending Ukraine.  Ukraine gave up their position as the 3rd biggest nuclear power under the premise that America would protect them from Russia and, like virtually every agreement we sign, we ignored it once it became inconvenient/unprofitable.  \n\nUkraine should have known better than to trust us.",
            "title_similarity": "0.6619959",
            "sentiment_compound": 0.9042
        },
        {
            "id": "hyz6bgf",
            "score": 2,
            "text": "I'm ready to go and help these people fight and kill Putain. I want to cut off his head and put it on the front porch of Mar-0a-Lago along with all the scalps I take from Russia. marco said that the Coward in chief was just kidding when he called putain a genius, BULL SHIT. Marco needs to pull his ignorant head out of Cadet bone spurs ass, it's not a good look.",
            "title_similarity": "0.38511366",
            "sentiment_compound": -0.9574
        },
        {
            "id": "hyz6e86",
            "score": 1,
            "text": "Can I just point out how solid that dude looks in army green? It’s definitely his color.",
            "title_similarity": "0.45724055",
            "sentiment_compound": 0.5106
        },
        {
            "id": "hyz6gip",
            "score": 1,
            "text": "Hero",
            "title_similarity": "0.31986925",
            "sentiment_compound": 0.5574
        },
        {
            "id": "hyz6hz9",
            "score": 1,
            "text": "I hope zelensky has left Kiyv. They are surrounding that city for a reason.",
            "title_similarity": "0.5277914",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hyz6ohx",
            "score": 1,
            "text": "He’s right 100%. A lot of Americans sitting back watching this like a movie, totally romanticized. Say something meaningful & have action behind it.",
            "title_similarity": "0.29822916",
            "sentiment_compound": 0.7482
        },
        {
            "id": "hyz6zf1",
            "score": 4,
            "text": "Everyone in the comment section that is saying we need to intervene needs to understand the situation. If we intervene, tell me where does the escalation stop? MAD that is where. I have friends stuck in Kyiv and making molotov cocktails, and I think a no fly zone or troops = escalation is the worst idea possible. And don’t think that Putin won’t do it, dude sits at a table 50ft from anyone, there is no humanity left in him. The west has provided what was asked…weapons. Ukrainians are strong and will fight like demons. I have sent all my crypto to the army to support them, you should too. So everyone who is advocating escalation take a look around you and the world and imagine it all burnt to hell and dead for 50 years. Besides if the west joined it would be a propaganda bonanza. Russia can now play the savior from invaders role.",
            "title_similarity": "0.4652351",
            "sentiment_compound": -0.9445
        },
        {
            "id": "hyz7bwq",
            "score": 2,
            "text": "While he's not iconic, he has epic balls of steel.  \n\nAnd while I like Biden well enough as far as people go, I hope he's not expecting anything useful out of him.  He's honestly just a filler to get us away from Trump and hopefully to the next half decent guy.",
            "title_similarity": "0.6127087",
            "sentiment_compound": 0.8688
        },
        {
            "id": "hyz7hk8",
            "score": 1,
            "text": "First mistake is thinking anything biden says will have an effect on putin lmfaoo",
            "title_similarity": "0.6186118",
            "sentiment_compound": -0.34
        },
        {
            "id": "hyz7khj",
            "score": 1,
            "text": "The U.S. Congress has the power to declare war, not the President, and Biden is certainly not going to start a war in his SOTU address.\n\nIf the American people wants America to go to war with Russia they can petition their representatives.",
            "title_similarity": "0.702692",
            "sentiment_compound": -0.8834
        },
        {
            "id": "hyz7sj4",
            "score": 1,
            "text": "Anyone know if they are close enough to use one of those mini nukes?\nCould be a couple of those trucks in the convoy",
            "title_similarity": "0.3218782",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyz81oo",
            "score": 1,
            "text": "I mean, Biden’s administration has been key in leading efforts in terms of intelligence gathering and communicating, leading sanctions, giving funding, etc",
            "title_similarity": "0.3703884",
            "sentiment_compound": 0.6705
        },
        {
            "id": "hyz85ah",
            "score": 1,
            "text": "Oh brother",
            "title_similarity": "0.33575904",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyz8ygo",
            "score": 2,
            "text": "Breaks my heart, he might die, and the world has so few men in high position with real valor and with real courage.",
            "title_similarity": "0.49257332",
            "sentiment_compound": 0.5423
        },
        {
            "id": "hyz9ay0",
            "score": 2,
            "text": "It will be interesting to see how much of the speech is dominated by Russia and this conflict.  It seems like it may have been better serving to have a speech on the conflict in front of Congress in addition to the State of the Union.  It deserves it's full attention but should not make it so that other issues at home are not covered.  It will be a challenge to put this all into one.",
            "title_similarity": "0.55227697",
            "sentiment_compound": 0.369
        },
        {
            "id": "hyz9uv8",
            "score": 1,
            "text": "If Putin gets everything he wants… then what? Russia is sanctioned for eternity?",
            "title_similarity": "0.40817472",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyza3sx",
            "score": 2,
            "text": "Absolute shame the free world is sitting back letting this happen. Sanctions don’t work.",
            "title_similarity": "0.5708604",
            "sentiment_compound": 0.0516
        },
        {
            "id": "hyza6pp",
            "score": 1,
            "text": "I’m really glad Volodymyr Zelenskyy sees through the weird, very sudden fangirling over him. Dude’s a pretty good guy, seems to be doing his best under the circumstances, but the idolization goes a little far.",
            "title_similarity": "0.39792192",
            "sentiment_compound": 0.7541
        },
        {
            "id": "hyzagtl",
            "score": 1,
            "text": "[deleted]",
            "title_similarity": "0.35716873"
        },
        {
            "id": "hyzaom5",
            "score": 2,
            "text": "The thing that makes me so sad is that nearly the entire world wants Ukraine to emerge victorious, and Ukraine is doing a hell of a good job considering, but everyday may be the end of Ukraine. Russia is so powerful and no one is willing/able to wipe out a tyrant and so they continue to take. When will it stop?\n\nFuck Russia.",
            "title_similarity": "0.50660026",
            "sentiment_compound": -0.8468
        },
        {
            "id": "hyzaxtx",
            "score": 2,
            "text": "What else will Biden say besides Russia is in the wrong, heavy sanctions are being imposed, and we support Ukraine but won’t get involved in the fight?",
            "title_similarity": "0.60500115",
            "sentiment_compound": -0.5789
        },
        {
            "id": "hyzbfys",
            "score": 2,
            "text": "What an iconic thing to say though",
            "title_similarity": "0.39344478",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyzbh5t",
            "score": 2,
            "text": "Let’s make sure this upvote total far-exceeds the year— 2017 is this marker, keep this going stronger (upvote!!) for Ukraine!!",
            "title_similarity": "0.43287396",
            "sentiment_compound": 0.7243
        },
        {
            "id": "hyzby51",
            "score": 2,
            "text": "Well done",
            "title_similarity": "0.179459",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hyzc8xd",
            "score": 2,
            "text": "It seems to me they would be a little more organized they’re running out of food running out of fuel now they’re saying they’re purposely punching holes in the gas tank and running out of gas, it looks like to me they don’t wanna fight but they have to because Putin is making them fight.",
            "title_similarity": "0.4739886",
            "sentiment_compound": -0.5346
        },
        {
            "id": "hyzcom6",
            "score": 4,
            "text": "Could you imagine if trump was giving the SOTU",
            "title_similarity": "0.45241323",
            "sentiment_compound": 0.34
        },
        {
            "id": "hyzcou9",
            "score": 2,
            "text": "As an American, this is hilariously accurate. We will however get a movie script speech",
            "title_similarity": "0.44369328",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyzdega",
            "score": 4,
            "text": "Can we swap them out?",
            "title_similarity": "0.28962612",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyzdre0",
            "score": 1,
            "text": "The irony is this line could be straight out of a movie.",
            "title_similarity": "0.38931376",
            "sentiment_compound": 0.1779
        },
        {
            "id": "hyzdw07",
            "score": 2,
            "text": "In my eyes that man is a hero who is giving his all.",
            "title_similarity": "0.34466928",
            "sentiment_compound": 0.7184
        },
        {
            "id": "hyze70a",
            "score": 1,
            "text": "As an American, I am hoping for this too. I really want Biden to put forward more assistance. I know we’re assisting. I mean, Javelin missiles are an American product being used for defense in Ukraine, so I assume we’re in on this pipeline of weaponry at some point. That being said, I want Biden to project our American allegiance to NATO and Ukraine. Putin needs to be put in his place.",
            "title_similarity": "0.50640625",
            "sentiment_compound": 0.5095
        },
        {
            "id": "hyze9vc",
            "score": 1,
            "text": "To any Biden speech writers \"Scruffy the Janitor says war might be declared.\"",
            "title_similarity": "0.4872114",
            "sentiment_compound": -0.5994
        },
        {
            "id": "hyzei06",
            "score": 1,
            "text": "Finally, someone said it.",
            "title_similarity": "0.2556057",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyzei8n",
            "score": 1,
            "text": "I would like to nominate Zelenskyy as President of the World.",
            "title_similarity": "0.43350345",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hyzepe8",
            "score": 1,
            "text": "This is what having a non-politician in office should've been.",
            "title_similarity": "0.67664856",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyzeqk7",
            "score": 1,
            "text": "I agree whole heartedly and Zelensky is someone I truly look up to. Unfortunately being a leader and setting the example don’t make money so the others could care less 😞",
            "title_similarity": "0.56145257",
            "sentiment_compound": 0.5256
        },
        {
            "id": "hyzf9ii",
            "score": 1,
            "text": "crazy what a leader can be if he isn't a puppet for corporate interests. maybe the US will have one in in my lifespan.",
            "title_similarity": "0.543419",
            "sentiment_compound": -0.1027
        },
        {
            "id": "hyzfacn",
            "score": 1,
            "text": "There is a non-zero chance that Putin will detonate a nuke during the SOTU. Which is nuts. Maybe just a test, but still—a chance.",
            "title_similarity": "0.6249755",
            "sentiment_compound": 0.3291
        },
        {
            "id": "hyzggrm",
            "score": 1,
            "text": "That’s something someone iconic would say …",
            "title_similarity": "0.3427562",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyzgkk8",
            "score": 2,
            "text": "He sounds like he's about to insult Putin's mother by next week. \n\nBut in honesty, I feel like US is the last country that should say or do something strong against Russia.",
            "title_similarity": "0.5463839",
            "sentiment_compound": 0.9118
        },
        {
            "id": "hyzgozs",
            "score": 2,
            "text": "We’ll hear a lot about “unity” while every country sort of just lets Ukraine get worked. We’ll continue to avoid what could possibly be the assassination of a Head of State because Putin told us to and shook his nukes at everyone. \n\nIdiots will still put anti-Biden stickers on gas pumps with literally zero understanding how energy prices work and high-five about it for half the year. They’ll find some new grievance to move on to now that even the CDC is telling folks to drop masks, and it will be just as infantile. \n\nNothing meaningful ever comes out of the State of the Union. We all just continue to treat it like a major deal. It’s just another speech that won’t win over partisans while a country burns. \n\n/rant.",
            "title_similarity": "0.55306756",
            "sentiment_compound": -0.6075
        },
        {
            "id": "hyzgpok",
            "score": 1,
            "text": "That says everything- I’m not in a movie 😓😥🤬🥺",
            "title_similarity": "0.67062163",
            "sentiment_compound": 0.1154
        },
        {
            "id": "hyzi17w",
            "score": 1,
            "text": "The main country that they rely on their spoken word is America. I'm kinda proud of that but I'd rather we started sending more than just ammunition and supplies. Support from all nations in NATO against Russia is priority. Even if nukes are a threat we need to stand for Ukraine and their rights to their independence and freedom.",
            "title_similarity": "0.5888572",
            "sentiment_compound": 0.7686
        },
        {
            "id": "hyzi1g9",
            "score": 3,
            "text": "It time the US and coalition forces stop Putin. He is committing crimes against humanity.",
            "title_similarity": "0.42774332",
            "sentiment_compound": -0.2263
        },
        {
            "id": "hyzi9m9",
            "score": 2,
            "text": "This dude's legend grows daily!",
            "title_similarity": "0.21054338",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyzit16",
            "score": 1,
            "text": "He technically *is* in Paddington. Just sayin'...",
            "title_similarity": "0.40269107",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyzj87d",
            "score": 3,
            "text": "I'm really passionate about this Ukraine conflict. Spent over a year there in 2019 training the Ukraine  troops. Have a lot I could advise on and could help with military tactics, but I have no Karma, and the bots are blocking me. Go get them Russians Ukraine & Biden, and Eff Trump.",
            "title_similarity": "0.4403866",
            "sentiment_compound": -0.5652
        },
        {
            "id": "hyzjzcc",
            "score": 1,
            "text": "Hope more people see these types of posts of what’s going on right now. The convoy stall only opens up for more things like this.\n\nhttps://www.reddit.com/r/PublicFreakout/comments/t4ien4/this_is_kharkiv_nowsaveukrainefuck_russia/?utm_source=share&utm_medium=ios_app&utm_name=iossmf",
            "title_similarity": "0.5044509",
            "sentiment_compound": 0.5965
        },
        {
            "id": "hyzk06t",
            "score": 2,
            "text": ">I'm not iconic\n\nSadly, it's not up to him. As the old saying goes, some people are born great, some people achieve greatness, and some people have greatness thrust upon them.",
            "title_similarity": "0.6139958",
            "sentiment_compound": 0.753
        },
        {
            "id": "hyzkwhv",
            "score": 3,
            "text": "When is US going to deal with Russian puppets & traitors in the Republican Party? That is what I am the most interested in.",
            "title_similarity": "0.45430008",
            "sentiment_compound": 0.6901
        },
        {
            "id": "hyzlqmf",
            "score": 1,
            "text": "It's iconic that this man does not realize he is iconic",
            "title_similarity": "0.5631262",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyzlw3i",
            "score": 3,
            "text": "Russian State Media ACCIDENTALLY ran an article declaring victory in Ukraine, and discussing the real, long term motives for the invasion:\n\nhttps://youtu.be/WWIYfKWSAxw\n\nEnglish translation:\n\nhttps://mil.in.ua/en/news/brave-new-world-of-putin-an-article-by-the-propaganda-publication-ria-novosti-which-was-to-be-published-after-the-occupation-of-ukraine/",
            "title_similarity": "0.47115606",
            "sentiment_compound": -0.4824
        },
        {
            "id": "hyzm2q9",
            "score": 3,
            "text": "This guy is a real leader. Legend.",
            "title_similarity": "0.3271311",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyzm70t",
            "score": 1,
            "text": "Offering piroshki is against the Geneva convention grin.  If they put pastries under my nose I’d surrender 🤗",
            "title_similarity": "0.60910803",
            "sentiment_compound": 0.7096
        },
        {
            "id": "hyzn3sj",
            "score": 1,
            "text": "Just hope this ends soon!",
            "title_similarity": "0.39285737",
            "sentiment_compound": 0.4926
        },
        {
            "id": "hyzoduf",
            "score": 2,
            "text": "People in the comments treating him as iconic, when he specifically says he isn't be like:\n\nhttps://youtu.be/rW8fDw8VzKI",
            "title_similarity": "0.6960603",
            "sentiment_compound": -0.2755
        },
        {
            "id": "hyzozsg",
            "score": 3,
            "text": "Unfortunately, the Battle for Ukraine is a conflict that cannot be settled by war between two nuclear superpowers.  The USA will support Ukraine and its allies, however, and so where there is hope there can be victory.",
            "title_similarity": "0.61840767",
            "sentiment_compound": -0.6808
        },
        {
            "id": "hyzp5mv",
            "score": 2,
            "text": "Oh sh\\*t, Zelensky knows reddit's onto him.",
            "title_similarity": "0.36938873",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyzqb68",
            "score": 2,
            "text": "We just need to get the NATO countries together and bomb the living crap out of that convoy. Obviously Putin isn't as much of a military genius as Trump thinks he is. He's got his convoy out there like sitting ducks. We need to end this shit before he makes any more progress in Ukraine. Sanctions are fine but the only thing this jerk understands is firepower. He's bluffing with the nukes.",
            "title_similarity": "0.52344424",
            "sentiment_compound": -0.7143
        },
        {
            "id": "hyzqsec",
            "score": 2,
            "text": "Watch now - [https://www.whitehouse.gov/state-of-the-union-2022/](https://www.whitehouse.gov/state-of-the-union-2022/)",
            "title_similarity": "0.45269668",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyzruag",
            "score": 2,
            "text": "He should get the Nobel prize for peace",
            "title_similarity": "0.38145593",
            "sentiment_compound": 0.7783
        },
        {
            "id": "hyzsrhk",
            "score": 1,
            "text": "Paddington bear disaagrees about the movie part",
            "title_similarity": "0.57792497",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyzt3oa",
            "score": 5,
            "text": "Iconic or not, he is single-handedly making me pay attention to world politics.",
            "title_similarity": "0.5570271",
            "sentiment_compound": -0.1027
        },
        {
            "id": "hyzt5ek",
            "score": 2,
            "text": "Like “ a nuclear war is good for everyone”",
            "title_similarity": "0.38601077",
            "sentiment_compound": 0.128
        },
        {
            "id": "hyztajq",
            "score": 2,
            "text": "President Zelenskyy is an icon and a leader that every country needs!!",
            "title_similarity": "0.3742273",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyzu299",
            "score": 1,
            "text": "peace for UKRAINE",
            "title_similarity": "0.24923229",
            "sentiment_compound": 0.5423
        },
        {
            "id": "hyzvduk",
            "score": 1,
            "text": "Dude is frigin legendary and he thinks he's not iconic. Glory to Ukraine! Glory to heroes!",
            "title_similarity": "0.61412126",
            "sentiment_compound": 0.674
        },
        {
            "id": "hyzw962",
            "score": 1,
            "text": "Good luck with that",
            "title_similarity": "0.20195273",
            "sentiment_compound": 0.7096
        },
        {
            "id": "hyzwv7a",
            "score": 3,
            "text": "I need ammo not praise!",
            "title_similarity": "0.6513686",
            "sentiment_compound": -0.4966
        },
        {
            "id": "hyzxfqb",
            "score": 1,
            "text": "Zelensky: No, I’m not a hero. It’s the teachers!",
            "title_similarity": "0.68149805",
            "sentiment_compound": -0.4966
        },
        {
            "id": "hyzxn3b",
            "score": 5,
            "text": "Nothing wrong with what he said but I think he should have leaned into the hero thing it would have been good for morale and keep support going.  Similar to how our former leaders were all placed on pedestals (Washington)",
            "title_similarity": "0.5901794",
            "sentiment_compound": 0.9334
        },
        {
            "id": "hyzxsbc",
            "score": 3,
            "text": "where are the humble genuine leaders like this around the world!!",
            "title_similarity": "0.377398",
            "sentiment_compound": 0.4738
        },
        {
            "id": "hz0034m",
            "score": 2,
            "text": "You are the President of the Democracy right now. Respect doesn’t even do it justice.",
            "title_similarity": "0.6463599",
            "sentiment_compound": 0.7579
        },
        {
            "id": "hz00foi",
            "score": 26,
            "text": "Zelensky needs to give himself a bit more credit, I think he’s pretty iconic.  The line “the fight is here.  I need ammunition, not a ride.” sounds like it came from an action movie.",
            "title_similarity": "0.68325305",
            "sentiment_compound": 0.7178
        },
        {
            "id": "hz01088",
            "score": 1,
            "text": "Forgive Biden, he’s used to deal with the GOP",
            "title_similarity": "0.4196005",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hz01jud",
            "score": 1,
            "text": "He’s decent.",
            "title_similarity": "0.20945264",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz0238e",
            "score": 1,
            "text": "A bad movie produce somewhere:\" what a movie-worthy and iconic thing to say!\"",
            "title_similarity": "0.48427504",
            "sentiment_compound": -0.5848
        },
        {
            "id": "hz02l6s",
            "score": 2,
            "text": "This dude is too real",
            "title_similarity": "0.38513535",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz0302i",
            "score": 10,
            "text": "He ended with “Go get him”",
            "title_similarity": "0.38465858",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz042gk",
            "score": 8,
            "text": "Wouldn’t it be cool if Zeldnzky and Putin could just resolve this by having a dance off?",
            "title_similarity": "0.41323823",
            "sentiment_compound": 0.5994
        },
        {
            "id": "hz05cmz",
            "score": 2,
            "text": "Bullshit, he is too iconic!",
            "title_similarity": "0.46983284",
            "sentiment_compound": -0.6239
        },
        {
            "id": "hz05pim",
            "score": 5,
            "text": "I also saw a video of a Ukrainian citizen/soldier showing rations carried by the Russian army that was captured. It was 7 years expired!",
            "title_similarity": "0.25964478",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz06lb6",
            "score": 1,
            "text": "Zelensky just droppin dimes on other leaders!",
            "title_similarity": "0.40811765",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz08gfq",
            "score": 2,
            "text": "When they make a movie about this, They better not have someone wink at the screen when he says that.",
            "title_similarity": "0.6325638",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hz0aytm",
            "score": 8,
            "text": "I don’t think a lot of people noticed it but Biden did state he was deploying troops to NATO countries surrounding Ukraine. Even if war with Russia was on the table we wouldn’t announce it until we were fully positioned. My ex was part of the initial invasion of Iraq and they were waiting in Kuwait for months, well before there were any votes or the general public had it on their radar. And that wasn’t a country that could retaliate on our citizens. If it we did enter into direct conflict with Russia, the worst thing would be to use anything less than overwhelming force. Right now Putin is attacking land he intends to occupy and incorporate into his own country. He would have significantly less qualms at causing lasting damage to an country an ocean away.",
            "title_similarity": "0.5835247",
            "sentiment_compound": -0.9705
        },
        {
            "id": "hz0dmw0",
            "score": 2,
            "text": "But you **are** iconic, my friend.",
            "title_similarity": "0.3888275",
            "sentiment_compound": 0.6486
        },
        {
            "id": "hz0f0oa",
            "score": 4,
            "text": "Slava Ukraini from Taiwan",
            "title_similarity": "0.41784132",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz0gkje",
            "score": 3,
            "text": "\"I'm not iconic\" \nIconic words from the most iconic man of the 20's",
            "title_similarity": "0.5633535",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz0hq2i",
            "score": 4,
            "text": "Zelensky: I’m not the messiah\n\nEveryone: HE IS THE MESSIAH!",
            "title_similarity": "0.6659837",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz0hu0q",
            "score": 2,
            "text": "I was in fox new comment sections recently. Putin seems to have done the unthinkable - both left and right have nice things to say about Zelensky.",
            "title_similarity": "0.45815104",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hz0irmu",
            "score": 3,
            "text": "I’d have to disagree with him , he’s a modern icon.",
            "title_similarity": "0.6341115",
            "sentiment_compound": -0.3818
        },
        {
            "id": "hz0is64",
            "score": 1,
            "text": "Wow",
            "title_similarity": "0.13490856",
            "sentiment_compound": 0.5859
        },
        {
            "id": "hz0jvmz",
            "score": 1,
            "text": "America has big leverage, but why is this needed  ? Europe has the the power to end this….",
            "title_similarity": "0.4606764",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz0ronb",
            "score": 1,
            "text": "The vodka is strong but the meat is rancid.",
            "title_similarity": "0.26256895",
            "sentiment_compound": -0.5574
        },
        {
            "id": "hz1bxea",
            "score": 1,
            "text": "There was a post of cross radio chatter between Russian and Ukrainian forces on a different sub.",
            "title_similarity": "0.28998166",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz1fzhy",
            "score": 1,
            "text": "Biden ended his speech with \"go get him\". Would be really wild if we learned that this was the greenlight for a surgical strike to take out Putin.",
            "title_similarity": "0.47703958",
            "sentiment_compound": -0.128
        },
        {
            "id": "hz1iipk",
            "score": 1,
            "text": "“Don’t be sorry ho, be helpful.” Kat Williams as money mike.",
            "title_similarity": "0.38760895",
            "sentiment_compound": -0.0772
        },
        {
            "id": "hz1snl0",
            "score": 1,
            "text": "The most iconic guy … claims he isn’t iconic .. we stan a humble leader.",
            "title_similarity": "0.66793483",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz20mrq",
            "score": 1,
            "text": "Exactly.  US and EU talk a LOT but aside from sanctions which have had no real impact on billionaires, they do NOTHING.",
            "title_similarity": "0.56967896",
            "sentiment_compound": -0.4215
        },
        {
            "id": "hz31y3w",
            "score": 1,
            "text": "Western media is good at making things up to change your mind about things, this could be one of them where they tell you Russians are running out of things",
            "title_similarity": "0.46654522",
            "sentiment_compound": 0.4404
        }
    ]
}