{
    "House Passes Bill to Limit Cost of Insulin to $35 a Month\n": [
        {
            "id": "i2x15ru",
            "score": 1,
            "text": "\nAs a reminder, this subreddit [is for civil discussion.](/r/politics/wiki/index#wiki_be_civil)\n\nIn general, be courteous to others. Debate/discuss/argue the merits of ideas, don't attack people. Personal insults, shill or troll accusations, hate speech, any suggestion or support of harm, violence, or death, and other rule violations can result in a permanent ban. \n\nIf you see comments in violation of our rules, please report them.\n\n For those who have questions regarding any media outlets being posted on this subreddit, please click [here](https://www.reddit.com/r/politics/wiki/approveddomainslist) to review our details as to our approved domains list and outlet criteria.\n \n **Special announcement:**\n \n r/politics is currently accepting new moderator applications.  If you want to help make this community a better place, consider [applying here today](https://www.reddit.com/r/politics/comments/sskg6a/rpolitics_is_looking_for_more_moderators/)!\n\n***\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/politics) if you have any questions or concerns.*",
            "title_similarity": "0.30069765",
            "sentiment_compound": -0.3895
        },
        {
            "id": "i2x7z1m",
            "score": -8,
            "text": "Still $35 too much…",
            "title_similarity": "0.49068913",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2x8emn",
            "score": -4,
            "text": "It's still $35 too high...",
            "title_similarity": "0.5205877",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2xt1gc",
            "score": 6,
            "text": "Or you know, relax the regulations that only allows two companies to produce it.",
            "title_similarity": "0.36309975",
            "sentiment_compound": 0.4404
        },
        {
            "id": "i2xf98t",
            "score": 15,
            "text": "With zero Republican votes.",
            "title_similarity": "0.208483",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2x4bgs",
            "score": 19,
            "text": "That's $35 too much. Taxes already pay for meds, just gets stolen by greedsters.",
            "title_similarity": "0.6484377",
            "sentiment_compound": -0.5574
        },
        {
            "id": "i2xc7nj",
            "score": 12,
            "text": "Half-assed half-measures. Just cover it 100% and call it a day.",
            "title_similarity": "0.30681342",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2xv4ae",
            "score": -16,
            "text": "It’s fun that none of us actually read the article as it’s behind a pay wall. But I’ll debate anyway. It’s limiting the insurance companies max copay. So they’re making your insurance company pay the bill. Where do they get their money from? Premiums. 🤔 hmm",
            "title_similarity": "0.48479277",
            "sentiment_compound": 0.09
        },
        {
            "id": "i2xl9fa",
            "score": 0,
            "text": "SoCiALisM!!!!",
            "title_similarity": "0.056623235",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2ykfcm",
            "score": -2,
            "text": "This will just increase insurance premiums and doesn't fix anything. The pharmaceutical companies won't be affected. We need to cap the actual price, not the co-pay.",
            "title_similarity": "0.35193557",
            "sentiment_compound": 0.4106
        },
        {
            "id": "i2xdy3v",
            "score": -70,
            "text": "Didn’t trump already do that?",
            "title_similarity": "0.055813666",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2xj46b",
            "score": 10,
            "text": "Putting a band aid on an arterial bleed",
            "title_similarity": "0.2219779",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2y20t7",
            "score": 3,
            "text": "Haven’t seen this on the thread yet, but to be clear, this bill doesn’t address the issue of insulin affordability. Almost all of the type1 diabetics who ration insulin and die don’t have insurance. This bill does nothing for them. Pharma loves this bill because it doesn’t lower the LIST price. Until the list price gets lowered or Biden enacts federal price capping (he won’t, he’s been in the pocket of pharma for decades) the problem won’t go away. But that won’t stop the democrats from declaring the insulin crisis solved and taking a victory lap!",
            "title_similarity": "0.5807116",
            "sentiment_compound": -0.902
        },
        {
            "id": "i2yehrr",
            "score": -19,
            "text": "Didn't Trump do this already but Biden delayed it? So he's taking credit and getting praised for something that he delayed.",
            "title_similarity": "0.20414373",
            "sentiment_compound": 0.6592
        },
        {
            "id": "i2y436m",
            "score": 0,
            "text": "Great! Now set a home rent cap to one third of minimum wage as well as high fines for keeping homes empty for extended periods of time.",
            "title_similarity": "0.6833511",
            "sentiment_compound": 0.69
        },
        {
            "id": "i2y547w",
            "score": 0,
            "text": "[deleted]",
            "title_similarity": "0.030619297"
        },
        {
            "id": "i2yay7r",
            "score": 0,
            "text": "Good news for sure.\n\nNow, its not like pharma companies will stop billing 700$ for a vial anyway. we pay 35$ out of our own pocket. fine with that. who pays the rest?",
            "title_similarity": "0.77116966",
            "sentiment_compound": 0.316
        },
        {
            "id": "i2x7wfg",
            "score": 44,
            "text": "Fuck off. It should be free.",
            "title_similarity": "-0.08287385",
            "sentiment_compound": -0.0516
        },
        {
            "id": "i2ybl9w",
            "score": -14,
            "text": "Here’s something for all of the hundreds of you pushing your lame agenda in this comments… I’m not even going to reveal my political alignment, I just wanted to prove a point that government officials do things out of self interest. Republicans vote against this bill when Biden is in office but take a peek at this:\n\nhttps://nypost.com/2020/05/26/trump-cuts-cost-of-insulin-for-medicare-enrollees-to-35-a-month/\n\nSo my advice would be stop pointing fingers at your least favorite political party and realize that the federal government doesn’t have anyones best interest in mind, they just want to make themselves look good and the other side look bad.",
            "title_similarity": "0.6587208",
            "sentiment_compound": 0.8393
        },
        {
            "id": "i2y0at3",
            "score": 1,
            "text": "law written by Big Pharma so instead of getting all the insulin you need for $35 you only get $35 worth of insulin total and die!\n\n/s",
            "title_similarity": "0.83007324",
            "sentiment_compound": -0.553
        },
        {
            "id": "i2xkard",
            "score": 1,
            "text": "Why do I see Joe Manchin standing in the way of this in the Senate",
            "title_similarity": "0.3648119",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2xlrqt",
            "score": 1,
            "text": "Waiting to hear what dumb garbage comes out of Joe Manchin’s mouth about this. Should be a real gem.",
            "title_similarity": "0.12731567",
            "sentiment_compound": -0.5106
        },
        {
            "id": "i2y71ii",
            "score": 1,
            "text": "Call me when it's enacted.  Anything short of that is shitty false optimism.",
            "title_similarity": "0.12287611",
            "sentiment_compound": -0.0258
        },
        {
            "id": "i2x4zlr",
            "score": -21,
            "text": "Good. Now if only we could put together some health promoting policies that prevent more people from needing insulin in the first place.",
            "title_similarity": "0.43874294",
            "sentiment_compound": 0.6705
        },
        {
            "id": "i2x9b5x",
            "score": 17,
            "text": "Get fucked Republican law makers. Higher premiums? Little late to worry about that. Our medical system is a sick joke. \n\n\"Republicans have largely opposed the measure and refer to the bill as \"government priced fixing\" that could lead to higher premiums for customers and exorbitant costs for insurers.\"",
            "title_similarity": "0.43702167",
            "sentiment_compound": -0.8456
        },
        {
            "id": "i2xi2iz",
            "score": 17,
            "text": "My old coworker insists that Trump already lowered insulin prices despite the evil democrats. \n\nMy old coworker is also a bitter conspiracy nut.",
            "title_similarity": "0.53379583",
            "sentiment_compound": -0.4912
        },
        {
            "id": "i2xrbou",
            "score": 15,
            "text": "Republicans are trash",
            "title_similarity": "0.14285137",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2y13p3",
            "score": -11,
            "text": "Didn’t president trump cap the price of insulin during he’s presidency, which president Biden removed during his first 3 months in office?",
            "title_similarity": "0.7534616",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2y2aq8",
            "score": 4,
            "text": "Joe Manchin just can’t see how this is fair to his daughter.",
            "title_similarity": "0.17625807",
            "sentiment_compound": 0.3182
        },
        {
            "id": "i2xyz7u",
            "score": -9,
            "text": "Can we charge more for people with type 2 diabetes?",
            "title_similarity": "0.5257974",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2xz13n",
            "score": -40,
            "text": "Trump did the same thing but hey let’s forget that LMAO",
            "title_similarity": "0.14937627",
            "sentiment_compound": 0.7269
        },
        {
            "id": "i2yy9ba",
            "score": -5,
            "text": "So trump does an executive order for this then Biden takes it away because trump bad and a year later pretends this is some new legislation",
            "title_similarity": "0.5407474",
            "sentiment_compound": -0.5994
        },
        {
            "id": "i2y2wjc",
            "score": 2,
            "text": "Can’t wait until we have free healthcare…. In about 30 years…..",
            "title_similarity": "0.501868",
            "sentiment_compound": 0.5106
        },
        {
            "id": "i2y2y5n",
            "score": 3,
            "text": "What if you don’t have $35?  Seriously, I’ve missed Doctors appointments over a $4 copay. Make that shit free!",
            "title_similarity": "0.7534168",
            "sentiment_compound": -0.5411
        },
        {
            "id": "i2yom02",
            "score": 2,
            "text": "Maby y'all should read the bill instead of blindly blasting those who voted against it. House Finance Committee cost prediction is 2billion a year to the private sector, is tied to the upcoming cannabis bill, and does not blanket cap all Insulin prices, just what certain plans can charge their customers for them, also increases Medicare/Medicaid spending. The bill literally does not effect what the drug manufacturers charge for insulin! Just shifts the cost to the insurance companies wich inturn will raise premiums to compensate for the estimated 2billion dollar loss.\n\nNot saying it is a bad bill. Just saying maby practice what you preach and use some critical thinking skills be for screaming RED BAD like some ignorant child.",
            "title_similarity": "0.699836",
            "sentiment_compound": -0.914
        },
        {
            "id": "i2ytd40",
            "score": 2,
            "text": "Not a single Republican voted for this. Every Democrat did.\n\nTell me again how both sides are the same....",
            "title_similarity": "0.4208023",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2xij0k",
            "score": -31,
            "text": "Price controls only lead to shortages. This is a bandaid that probably won't work\n\nEdit: what everyone is missing from this gop line of attack is that this isn't price fixing because they law changes what insurance covers, not the manufacturers of insulin. That makes more sense. Disappointed that's not clearly described in the story. That's not the price of insulin, it's what patients pay. Huge difference.",
            "title_similarity": "0.44759065",
            "sentiment_compound": -0.8637
        },
        {
            "id": "i2xsyt3",
            "score": -2,
            "text": "The only reason it’s going to be so cheap is because bill gates, in conjunction with the Clintons and big pharma, is going to fill the insulin with his 5G mind control nano bots. \n\nBrave republicans who believe in freedom and the right of free enterprise to charge whatever they desire for life saving medications, do not partake of this socialist insulin! It is a ploy to get those who did not take the devils needle into their arms! Rise up, all you wolves and lions! Rise up and die of diabetes to own the libs!",
            "title_similarity": "0.53445643",
            "sentiment_compound": 0.9308
        },
        {
            "id": "i2y1li6",
            "score": 8,
            "text": "\"While the bill would lower costs for many individual patients who take insulin, it would do nothing to reduce the prices paid to the companies that make it. Instead, insurance companies would simply pay a larger share of the price.\"\n\nSo you'll pay for it with higher insurance and if you're uninsured,  you're still screwed. \n\nThis is such a misleading headline.  It's a useless turd of a bill.",
            "title_similarity": "0.4684602",
            "sentiment_compound": -0.8683
        },
        {
            "id": "i2ydm78",
            "score": -8,
            "text": "Wait so trump did this then it was vetoed when Biden took office, so they did it again? I mean good on them but like wow that’s pretty narcissistic.",
            "title_similarity": "0.39143398",
            "sentiment_compound": 0.9403
        },
        {
            "id": "i2xb75y",
            "score": 0,
            "text": "Do Xarelto next!",
            "title_similarity": "-0.026812308",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2xb9ij",
            "score": 4,
            "text": "I wish it was a bill to restrict all prescription drugs to cost be no more than 30$ ….",
            "title_similarity": "0.62562853",
            "sentiment_compound": -0.2732
        },
        {
            "id": "i2xmxeg",
            "score": 0,
            "text": "With Medicare For All, it would be free, along with the rest of your healthcare.",
            "title_similarity": "0.22352628",
            "sentiment_compound": 0.5106
        },
        {
            "id": "i2xq13e",
            "score": 0,
            "text": "It would be weird if some streptozotocin found it's way into their veins.",
            "title_similarity": "0.22629017",
            "sentiment_compound": -0.1779
        },
        {
            "id": "i2xqdfb",
            "score": 0,
            "text": "Now do Cosentyx.",
            "title_similarity": "-0.002178453",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2xsueg",
            "score": 0,
            "text": "Sen. Sinema and Manchin, as well as the rest of the Republicans, wont let this get through the Senate unmolested.",
            "title_similarity": "0.33532393",
            "sentiment_compound": 0.2732
        },
        {
            "id": "i2xtbk6",
            "score": 0,
            "text": "Manchin is so excited to kill this bill I bet",
            "title_similarity": "0.2024211",
            "sentiment_compound": -0.4305
        },
        {
            "id": "i2xu4u7",
            "score": 0,
            "text": "Good news. Now dismantle FDA which is in bed with drugs manufacturers who will block this bill like many other passed by Congress.",
            "title_similarity": "0.4705572",
            "sentiment_compound": 0.3612
        },
        {
            "id": "i2xuzlj",
            "score": 0,
            "text": "Is this happening because they think a [cure for Type 1 diabetes](https://www.cnbc.com/video/2022/03/26/why-stem-cells-may-be-the-answer-to-curing-type-1-diabetes.html) is getting close anyway? That such a cure would make insulin almost unneeded anyway? Could such behavior actually happen?",
            "title_similarity": "0.5052278",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2xvju8",
            "score": 0,
            "text": "If it passes is it going to reduce availability? Drug companies might not want to produce it so the government might have to step in and provide the companies with the money lost by consumers, which isn’t even bad, just a reality.",
            "title_similarity": "0.43777576",
            "sentiment_compound": -0.7203
        },
        {
            "id": "i2xw97f",
            "score": 0,
            "text": "now onto president Manchin",
            "title_similarity": "0.18092787",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2xwb5c",
            "score": 0,
            "text": "Manchin and Sinema bout to slap this to kingdom come, y’all gonna need some dirt to ram this through.",
            "title_similarity": "0.13516062",
            "sentiment_compound": -0.2023
        },
        {
            "id": "i2xx0h5",
            "score": 0,
            "text": "This just in from Manchin: “no.”",
            "title_similarity": "0.038352985",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2xx1l5",
            "score": 0,
            "text": "Can’t wait for the senate to kill it for no reason.\n\nManchin will absolutely kill this.",
            "title_similarity": "0.34804255",
            "sentiment_compound": -0.9168
        },
        {
            "id": "i2xx8a5",
            "score": 0,
            "text": "Now do all medicine?",
            "title_similarity": "0.19647941",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2xxpdz",
            "score": 0,
            "text": "I am happy for the people that need their insulin but can they limit the rent?😭😭😭",
            "title_similarity": "0.3846425",
            "sentiment_compound": -0.9022
        },
        {
            "id": "i2xymem",
            "score": 0,
            "text": "Is that per pill or for the whole?",
            "title_similarity": "0.14128749",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2xyy61",
            "score": 0,
            "text": "Go lower",
            "title_similarity": "0.020115657",
            "sentiment_compound": -0.296
        },
        {
            "id": "i2xz4dz",
            "score": 0,
            "text": "[deleted]",
            "title_similarity": "0.030619297"
        },
        {
            "id": "i2xzfdr",
            "score": 0,
            "text": "Good.Now reimburse everyone that has been getting gouged for years the difference",
            "title_similarity": "0.43587723",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2y00ve",
            "score": 0,
            "text": "You can and ought to get it for free.",
            "title_similarity": "-0.05358149",
            "sentiment_compound": 0.5106
        },
        {
            "id": "i2y0udi",
            "score": 0,
            "text": "Still too expensive",
            "title_similarity": "0.09228982",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2y1a6k",
            "score": 0,
            "text": "Wait didn't President Trump do this first in 2018? Made it so you could be charged more than $35 a month for Insulin? Why did they remove it just rto ready it?",
            "title_similarity": "0.84901816",
            "sentiment_compound": 0.3049
        },
        {
            "id": "i2y1cgd",
            "score": 0,
            "text": "I work for a rather large pharmacy benefits management company. Diabetic calls are the most depressing thing. Some people legitimately have to decide if they are going to eat or get their meds. Ed calls are the most hilarious, only because basically no plan covers them, but good rx bypasses their insurance and requires no PA, and is usually sully cheaper",
            "title_similarity": "0.5070995",
            "sentiment_compound": 0.3182
        },
        {
            "id": "i2y1ke8",
            "score": 0,
            "text": "Don't worry -- they'll make up the difference by raising the price of everything else.",
            "title_similarity": "0.22916253",
            "sentiment_compound": 0.3412
        },
        {
            "id": "i2y2ymt",
            "score": 0,
            "text": "Yaaaawwwnnnn",
            "title_similarity": "-0.1160208",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2y3nd0",
            "score": 0,
            "text": "Honestly we shouldn’t be celebrating this. This is just how things should be. This should be the expectation.",
            "title_similarity": "0.003539184",
            "sentiment_compound": 0.7717
        },
        {
            "id": "i2y3u6j",
            "score": 0,
            "text": "A step in the right direction, but frankly it should be free. As a person without any chronic illness, all medication should be covered by our taxes, the countrybcould certainly afford it. It's well past time our taxes were spent on us rather than another bomber or another battleship.",
            "title_similarity": "0.38941535",
            "sentiment_compound": 0.9175
        },
        {
            "id": "i2y4cpv",
            "score": 0,
            "text": "What's the difference between this and when Trump did it?",
            "title_similarity": "0.18809316",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2y4h20",
            "score": 0,
            "text": "Where is the profits , PROFITS , who cares a damn if you die , PROFITS PROFITS PROFITS PROFITS PROFITSour business mates are selling you shit food to make you diabetic and we want our PROFITS PROFITS \nITS THE AMERICAN WAY HA HAVHA HA \nanything else is communism ! !!",
            "title_similarity": "0.4479673",
            "sentiment_compound": 0.9827
        },
        {
            "id": "i2y4ra1",
            "score": 0,
            "text": "Its not like insulin is the only medication where pharmaceutical companies are gouging americans.",
            "title_similarity": "0.47180063",
            "sentiment_compound": -0.2755
        },
        {
            "id": "i2y4vth",
            "score": 0,
            "text": "How does this fit into the concept of a free economy, where supply and demand are left to determine prices?\n\nTicketmaster can set concert tickets anywhere they want.\n\nCan the government set a maximum ticket price?\n\nI prefer that the government organize their own insulin supply, then sell it through the U.S. Post Office. Free checking accounts through the U.S. Post Office would be great too, zero fees, zero penalties.",
            "title_similarity": "0.4862969",
            "sentiment_compound": 0.9292
        },
        {
            "id": "i2y832h",
            "score": 0,
            "text": "Congress only cares about keeping power.   Everything else is just fodder, including Americans.",
            "title_similarity": "0.31732476",
            "sentiment_compound": 0.4588
        },
        {
            "id": "i2y8rwx",
            "score": 0,
            "text": "Happy April Fools!",
            "title_similarity": "0.108123235",
            "sentiment_compound": 0.2003
        },
        {
            "id": "i2ya1we",
            "score": 0,
            "text": "Pointless, won’t pass in the fascist-occupied Senate.",
            "title_similarity": "0.29650563",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2ya4nw",
            "score": 0,
            "text": "And it'll die in the Senate because Manchin and Sinema have pharma donors. Unless they magically grow a soul",
            "title_similarity": "0.5207201",
            "sentiment_compound": -0.5994
        },
        {
            "id": "i2yasll",
            "score": 0,
            "text": "reminder that they could have done this sooner but chose not to",
            "title_similarity": "0.069434926",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2yc853",
            "score": 0,
            "text": "Great, but keep in mind Insulin was just a good example within all the problems in US healthcare. They just fixed the example…",
            "title_similarity": "0.37523702",
            "sentiment_compound": 0.431
        },
        {
            "id": "i2ydavm",
            "score": 0,
            "text": "It's up to President Manchin and VP Sinema.",
            "title_similarity": "0.26085892",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2ydzn4",
            "score": 0,
            "text": "Don’t get your hopes up.  Manchin and Sinema will kill it in the Senate",
            "title_similarity": "0.39362773",
            "sentiment_compound": -0.4404
        },
        {
            "id": "i2yef03",
            "score": 0,
            "text": "It's FREE in every other developed country. 35 dollars deserves a LOL.",
            "title_similarity": "0.47504684",
            "sentiment_compound": 0.8208
        },
        {
            "id": "i2yeilt",
            "score": 0,
            "text": "Great, now do the rest of healthcare",
            "title_similarity": "0.11516846",
            "sentiment_compound": 0.6249
        },
        {
            "id": "i2yeukl",
            "score": 0,
            "text": "As a diabetic what does this mean to me? Does this mean both my insulins will now be 35$ for both or 35$ for each? In that case I'll just stick to Walmarts brand for 25$ each.",
            "title_similarity": "0.76454794",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2yf2y2",
            "score": 0,
            "text": "Sinema and Manchin eagerly await this in the Senate so they can dash the hopes of millions again /s",
            "title_similarity": "0.39823592",
            "sentiment_compound": 0.7003
        },
        {
            "id": "i2yf3r3",
            "score": 0,
            "text": "They’ll find a way round it",
            "title_similarity": "-0.07702276",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2yhr07",
            "score": 0,
            "text": "Will never pass. This is just another exercise by one side to make it look like they're actively trying to do something, safe in the knowledge it won't survive insuring they get votes \"because they tried\" and their corporate backers remain pleased.",
            "title_similarity": "0.3117861",
            "sentiment_compound": 0.8625
        },
        {
            "id": "i2yjghk",
            "score": 0,
            "text": "Just eat your daily kale 🥬... hmm... suddenly I wonder if it’s actually cheaper in the US.",
            "title_similarity": "0.53147495",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2ykstu",
            "score": 0,
            "text": "“The bill that passed the House on Thursday would not improve the affordability of insulin for people who lack health insurance.” 🙄",
            "title_similarity": "0.6580769",
            "sentiment_compound": -0.5727
        },
        {
            "id": "i2ylv3k",
            "score": 0,
            "text": "Also maybe refund those people who been overpaying for years?",
            "title_similarity": "0.45459905",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2ym0f7",
            "score": 0,
            "text": "April Fools!",
            "title_similarity": "0.19484258",
            "sentiment_compound": -0.5411
        },
        {
            "id": "i2ym2r2",
            "score": 0,
            "text": "Well, let's see if Joe Fuck-My-Constituents Manchin and Kirsten I-Am-Bi-So-Not-A-Monster Cinema are willing to vote for an overwhelmingly popular bill that everyone is supports.  I wont hold my breath.",
            "title_similarity": "0.38638464",
            "sentiment_compound": 0.7096
        },
        {
            "id": "i2yn79g",
            "score": 0,
            "text": "April fools jk jk",
            "title_similarity": "0.28830117",
            "sentiment_compound": -0.1027
        },
        {
            "id": "i2yo78h",
            "score": 0,
            "text": "Doesn’t this hurt Manchins kid or something?  Can’t see it surviving the final vote, or the next Republican President.",
            "title_similarity": "0.44885916",
            "sentiment_compound": -0.296
        },
        {
            "id": "i2yoaay",
            "score": 0,
            "text": "House passes bill to limit CO-PAY to $35. Insurance rates will rise.",
            "title_similarity": "0.8172121",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2yogbx",
            "score": 0,
            "text": "It doesn't matter it won't pass. This world wants me to blow it up from decades of personal grifts. FUCK IT ALL.",
            "title_similarity": "0.39114237",
            "sentiment_compound": -0.6494
        },
        {
            "id": "i2ypfzp",
            "score": 0,
            "text": "Next post, senate doesn’t manage to pass bill because Manuchin can’t take the Pharma dick, which is next to the oil lobby dick, and the gun lobby dick, and war lobby dick, out his ass to give Americans some relief.",
            "title_similarity": "0.52359426",
            "sentiment_compound": -0.9618
        },
        {
            "id": "i2yrn5m",
            "score": 0,
            "text": "Rand Paul - Insulin isn't expensive enough. Dr Fauci lies.\n\nJoe Manchin - For no reason I am opposed to this.\n\nKristen Sinema - What Joe said.\n\nBernie - Make it free\n\nTrump - If I were still President, which I am, people are telling me, I would ask Putin who I know very very well to investigate Hunter Biden and the use of Burnie phones, a word I have never used or hear of, I think it is something Sleepy Joe invented. Also insulin is very important. Nobody knows more about drug prices than I do. There are good insulin prices on both sides of the drug industry.",
            "title_similarity": "0.4874158",
            "sentiment_compound": 0.7153
        },
        {
            "id": "i2ysc3x",
            "score": 0,
            "text": "Fat chance passing the Senate.  Fuck you Manchimp and Sinenema. Hope you both enjoy the big pharma money.",
            "title_similarity": "0.48767304",
            "sentiment_compound": 0.5574
        },
        {
            "id": "i2yu1ep",
            "score": 0,
            "text": "Manchins daughter profits from insulin prices….this won’t pass the senate",
            "title_similarity": "0.5859237",
            "sentiment_compound": 0.4404
        },
        {
            "id": "i2yuw4l",
            "score": 0,
            "text": "Can’t wait to find out what reason Supreme Overlord Manchin will use to kill this one",
            "title_similarity": "0.29809475",
            "sentiment_compound": -0.2732
        },
        {
            "id": "i2yuy3k",
            "score": 0,
            "text": "Now do Asthma Inhalers. We spend almost $500 on inhalers every 3 months",
            "title_similarity": "0.7117125",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2yv3v3",
            "score": 0,
            "text": "In other news the cost of syringes went up to $90 each.",
            "title_similarity": "0.6486593",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2yvu52",
            "score": 0,
            "text": "So what is insulin defined as? Regular insulin? Synthetic meal time insulins like aspart/lispro? The other kinds mid range semi-aynthetic ones like NPH? Or the even more synthetic ones like glargine, degludec?\n\nAre these flavors all included in the bill?",
            "title_similarity": "0.4465192",
            "sentiment_compound": 0.8282
        },
        {
            "id": "i2yw0pb",
            "score": 0,
            "text": "Now do estrogen and testosterone for my Trans fellows",
            "title_similarity": "0.18734343",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2ywjb4",
            "score": 0,
            "text": "Is there a backpay scheme for those who have paid far too much for too long? The diabetics I mean",
            "title_similarity": "0.4858045",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2yx7dk",
            "score": 0,
            "text": "Sinema and Manchin will kill it with fire in the senate.",
            "title_similarity": "0.37710032",
            "sentiment_compound": -0.7964
        },
        {
            "id": "i2yy096",
            "score": 0,
            "text": "April fools!",
            "title_similarity": "0.19484258",
            "sentiment_compound": -0.5411
        },
        {
            "id": "i2yzbxv",
            "score": 0,
            "text": "So since this doesn't cover anyone without insurance,  does that mean since capping for those insured that the price for uninsured well go up drastically?",
            "title_similarity": "0.460119",
            "sentiment_compound": 0.2732
        },
        {
            "id": "i2z0bi6",
            "score": 0,
            "text": "April fools?",
            "title_similarity": "0.23842892",
            "sentiment_compound": -0.4939
        },
        {
            "id": "i2z0gu1",
            "score": 0,
            "text": "Now do EpiPen.",
            "title_similarity": "0.105878055",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2z0oxq",
            "score": 0,
            "text": "Now epi",
            "title_similarity": "-0.024011277",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2z6xz6",
            "score": 0,
            "text": "How blatantly can you misstreat your own citizens, im baffled at the level of greed.\n\nCattle is treated with more care than humans at this scale.",
            "title_similarity": "0.2621265",
            "sentiment_compound": 0.2006
        },
        {
            "id": "i2z759m",
            "score": 0,
            "text": "First world country….",
            "title_similarity": "0.11782494",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2z76al",
            "score": 0,
            "text": "I am sure this will spur new innovation in insulin...... \n\nHope you like what we have now, its not getting better from here on.",
            "title_similarity": "0.2857176",
            "sentiment_compound": 0.7842
        },
        {
            "id": "i2z7e2v",
            "score": 0,
            "text": "April Fools!",
            "title_similarity": "0.19484258",
            "sentiment_compound": -0.5411
        },
        {
            "id": "i2z7xdp",
            "score": 0,
            "text": "Should be free.",
            "title_similarity": "-0.14968294",
            "sentiment_compound": 0.5106
        },
        {
            "id": "i2zbgza",
            "score": 0,
            "text": "Fucking finally",
            "title_similarity": "-0.08579567",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2zbs9s",
            "score": 0,
            "text": "April Fools!",
            "title_similarity": "0.19484258",
            "sentiment_compound": -0.5411
        },
        {
            "id": "i2zc8zu",
            "score": 0,
            "text": "YES YES YES! I’m really happy to be reading this.",
            "title_similarity": "-0.115364335",
            "sentiment_compound": 0.9391
        },
        {
            "id": "i2zcey7",
            "score": 0,
            "text": "Took forever…",
            "title_similarity": "0.10334443",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2zcfi5",
            "score": 0,
            "text": "Waiting for all the non-diabetic republicans trying to educate us🙏",
            "title_similarity": "0.33751026",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2zhq19",
            "score": 0,
            "text": "Pretty cool since They are the reason the price is sky high. You remember when Trump lowered the price the. BIDEN reversed that? Yeah Pepperidge farm remembers",
            "title_similarity": "0.4402879",
            "sentiment_compound": 0.7351
        },
        {
            "id": "i2zkv4g",
            "score": 0,
            "text": "Democrats* in the house pass bill...",
            "title_similarity": "0.5614841",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2zmkkj",
            "score": 0,
            "text": "We had this under Trump and Biden stopped it.",
            "title_similarity": "0.25883996",
            "sentiment_compound": -0.2263
        },
        {
            "id": "i2zmmr2",
            "score": 0,
            "text": "Trump had a bill that made insulin completely covered for anyone making up to 350% the federal poverty line. Biden rescinded it, saying it would create administrative work to track what 350% is. Then this bill is passed, and no Republicans voted for it (even though it's spiritually similar.) \n\nI am utterly and completely disgusted by our two partisan government. The hypocrisy HAS to end.",
            "title_similarity": "0.706689",
            "sentiment_compound": -0.8104
        },
        {
            "id": "i2zmzrl",
            "score": 0,
            "text": "Trump did this and Biden froze it in his first week of office. Now he’s doing it himself to try and look like the good guy. Are people actually falling for this shit?",
            "title_similarity": "0.5445068",
            "sentiment_compound": 0.0516
        },
        {
            "id": "i30anqp",
            "score": 0,
            "text": "Cool, so my insurance premiums go up so Fatty McDiabeetus doesn’t have to put down his liter of cola.   God forbid we ever hold irresponsible people responsible for themselves.  \n\nInsulin for Type-I, have it be $35 paid by Big Pharma.  Type-II gfy",
            "title_similarity": "0.7313075",
            "sentiment_compound": 0.128
        },
        {
            "id": "i30i6ad",
            "score": 0,
            "text": "So is this because the government is going to negotiate pricing and forcing drug manufacturers to produce at that cost, or are they just subsidizing the cost by paying the insurance providers for it? Resulting in rising drug prices and the growth of the parasite insurance industry. If it's the latter, I'm not surprised the Democrats passed it.",
            "title_similarity": "0.5111728",
            "sentiment_compound": 0.2344
        },
        {
            "id": "i30iy7r",
            "score": 0,
            "text": "Insulin wouldn't have become so expensive if it weren't for Medicare and Medicaid.",
            "title_similarity": "0.37769496",
            "sentiment_compound": 0.0
        },
        {
            "id": "i30n9ys",
            "score": 0,
            "text": "Not that this law is a bad thing, but price regulations aren't a good solution to a problem.  Ideally a law should fix the market imbalance that caused the issue.\n\nReversing George W. Bushes Medicare reform law banning Medicare, Medicaid, and the VA from negotiating orders would go a long way.",
            "title_similarity": "0.34921145",
            "sentiment_compound": -0.7685
        },
        {
            "id": "i30y6qc",
            "score": 0,
            "text": "Honest question: \nis this the same bill that Trump had started and Biden had frozen when offices switched? (A bunch of bills that were being processed were put on hold while changing presidents) I remember the debate with Trump saying he made insulin “as cheap as water” but took a beating on social media of all the people that it clearly wasn’t as cheap as water. Just wondering if it’s the same bill that is finally being looked at again or has it had some major changes from Trumps original one? Thanks in advance!",
            "title_similarity": "0.5931643",
            "sentiment_compound": 0.8463
        },
        {
            "id": "i30y79c",
            "score": 0,
            "text": "Honest question: \nis this the same bill that Trump had started and Biden had frozen when offices switched? (A bunch of bills that were being processed were put on hold while changing presidents) I remember the debate with Trump saying he made insulin “as cheap as water” but took a beating on social media of all the people that it clearly wasn’t as cheap as water. Just wondering if it’s the same bill that is finally being looked at again or has it had some major changes from Trumps original one? Thanks in advance!",
            "title_similarity": "0.5931643",
            "sentiment_compound": 0.8463
        },
        {
            "id": "i312tmp",
            "score": 0,
            "text": "Why didn't Obamacare lower or control the price of insulin?",
            "title_similarity": "0.5466972",
            "sentiment_compound": 0.2235
        },
        {
            "id": "i31bpiy",
            "score": 0,
            "text": "April fools",
            "title_similarity": "0.2466728",
            "sentiment_compound": -0.4939
        },
        {
            "id": "i31djuo",
            "score": 0,
            "text": "For those with insurance",
            "title_similarity": "-0.015601506",
            "sentiment_compound": 0.0
        },
        {
            "id": "i3bawoq",
            "score": 0,
            "text": "So many economically irresponsible people in the comments, my fking gosh. The future of insulin research in this country will forever take an assbeating if dems got their way.",
            "title_similarity": "0.3907351",
            "sentiment_compound": -0.4877
        },
        {
            "id": "i3vg2aq",
            "score": 0,
            "text": "Thanks trump for starting this movement",
            "title_similarity": "0.100989334",
            "sentiment_compound": 0.4404
        },
        {
            "id": "i2xr42c",
            "score": -32,
            "text": "Price fixing. Always works real well. Glad we learn from history. “Why is there a shortage of insulin?” This time it’s different! 🤔",
            "title_similarity": "0.3982497",
            "sentiment_compound": 0.5255
        },
        {
            "id": "i2ydiga",
            "score": -10,
            "text": "This comment section speaks for itself. Trump did this and Biden removed it and re added so he could take credit for it",
            "title_similarity": "0.25031564",
            "sentiment_compound": 0.3818
        },
        {
            "id": "i2yc47x",
            "score": -6,
            "text": "I don't get it? Why did Biden cancel the EO Trump made, which did this exact thing, only for the party do to it this way?  Is it all just political theater, using people's health to score points and win votes?  Pretty crappy IMHO",
            "title_similarity": "0.40781534",
            "sentiment_compound": 0.6848
        },
        {
            "id": "i2yog3e",
            "score": -5,
            "text": "Didn't trump do this already and Biden reverse it?",
            "title_similarity": "0.21494198",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2y3omm",
            "score": -20,
            "text": "Hey but, nobody stop drinking sodas and eating like shit 👍🏼okay👍🏼",
            "title_similarity": "0.21924537",
            "sentiment_compound": -0.6652
        },
        {
            "id": "i2x8lxr",
            "score": -6,
            "text": "[deleted]",
            "title_similarity": "0.030619297"
        },
        {
            "id": "i2xcl5m",
            "score": 1,
            "text": "Finally some good fucking news.",
            "title_similarity": "-0.112119965",
            "sentiment_compound": 0.4404
        },
        {
            "id": "i2xf9sd",
            "score": 1,
            "text": "Cool. Think bigger and do a whole formulary page next.",
            "title_similarity": "0.12836784",
            "sentiment_compound": 0.3182
        },
        {
            "id": "i2xh044",
            "score": -1,
            "text": "[deleted]",
            "title_similarity": "0.030619297"
        },
        {
            "id": "i2xr9ys",
            "score": 1,
            "text": "Joe Manchin’s daughter isn’t going to like this!",
            "title_similarity": "0.19782054",
            "sentiment_compound": 0.4199
        },
        {
            "id": "i2xuvqi",
            "score": 1,
            "text": "Can’t wait for Sinema and Manchin to be totally “moderate” about this",
            "title_similarity": "0.125449",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2xwl4r",
            "score": -1,
            "text": "This is cool and all but it's both hilarious and sad that we're now passing laws for individual drugs rather than fixing health care.\n\nBy signing this bill you're essentially signing the death of single payer health care.\n\nThe biggest argument was ballooning costs of drugs and insulin affects millions, so by signing this bill you help them out but you knee cap everyone else that needs help but doesn't need insulin.",
            "title_similarity": "0.55643237",
            "sentiment_compound": 0.7992
        },
        {
            "id": "i2xy7xr",
            "score": 1,
            "text": "Let’s take a guess who will vote against this.",
            "title_similarity": "0.24948797",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2xz9a1",
            "score": 1,
            "text": "Great - now do the rest",
            "title_similarity": "-0.10487726",
            "sentiment_compound": 0.6249
        },
        {
            "id": "i2y1fxd",
            "score": 1,
            "text": "Epi-pen next???",
            "title_similarity": "0.12919366",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2y1usi",
            "score": 1,
            "text": "It should be free.",
            "title_similarity": "-0.14870201",
            "sentiment_compound": 0.5106
        },
        {
            "id": "i2y21f7",
            "score": 1,
            "text": "What's the catch here?",
            "title_similarity": "-0.0674901",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2y3ox3",
            "score": 1,
            "text": "The Establishment politicians vote against it, then just blame Biden or trump and agree in the end that socialism is the real reason 😂.",
            "title_similarity": "0.41586277",
            "sentiment_compound": 0.4588
        },
        {
            "id": "i2y54g3",
            "score": -1,
            "text": "Bernie will always prevail",
            "title_similarity": "-0.06682524",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2y59ru",
            "score": 1,
            "text": "Refund people who got fucked, justice right ?",
            "title_similarity": "0.2337682",
            "sentiment_compound": -0.25
        },
        {
            "id": "i2y5niw",
            "score": 1,
            "text": "Ooh, ooh, do epi pens next",
            "title_similarity": "0.13439924",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2y7fsh",
            "score": 1,
            "text": "So edicational system fails to educate you on proper eating habits, the food industry makes you diabetic, then the big pharma makes you poor with obscene costs of medication? That sounds a bit evil.",
            "title_similarity": "0.45783386",
            "sentiment_compound": -0.9367
        },
        {
            "id": "i2y9kl3",
            "score": -1,
            "text": "WWJMD?  (What would Joe Manchin Do?)\n\nProbably whatever Sinema does. \n\nWhich is probably what Mitch tells them to do. \n\nWhich is usually whatever hurts the most people in the worst way. \n\n(I’m waiting for the “but that’s not how it works” comment lol).",
            "title_similarity": "0.34380615",
            "sentiment_compound": -0.6966
        },
        {
            "id": "i2ybjh7",
            "score": -1,
            "text": "Just wondering not from us but if this bill was put forward by reps would majority of Dems vote against it just because it's a rep bill? Do both parties vote against each others bills especially ones like this insulin one just because they're different parties? Like let's say Dems said we didn't see at the time but we need it now and they tried to put through a bill that is word for word the same bill that reps failed to get passed a few years ago would reps vote against it just because Dems are behind even though it's their bill?",
            "title_similarity": "0.5265558",
            "sentiment_compound": 0.8781
        },
        {
            "id": "i2yciif",
            "score": 1,
            "text": "Huh? How about other all the drugs. Why just insulin?",
            "title_similarity": "0.32029307",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2yct9x",
            "score": 1,
            "text": "Good.  Now work on Crohns meds.  $23k every week before insurance. $2k a week after.",
            "title_similarity": "0.7442823",
            "sentiment_compound": 0.4404
        },
        {
            "id": "i2ycxdg",
            "score": 1,
            "text": "Excellent legislation! This is such good news for a lot of Americans! Maybe the House and Senate need positive feedback.",
            "title_similarity": "0.17824274",
            "sentiment_compound": 0.8953
        },
        {
            "id": "i2yg47z",
            "score": 1,
            "text": "Sweet , next albuterol!",
            "title_similarity": "0.09064373",
            "sentiment_compound": 0.5093
        },
        {
            "id": "i2yh4a6",
            "score": 1,
            "text": "Wait it isn’t free?",
            "title_similarity": "-0.0605947",
            "sentiment_compound": 0.5106
        },
        {
            "id": "i2yhha5",
            "score": 1,
            "text": "$35 is still too much for life saving medication that has to be taken for life!\n\nFor contrast, any prescription costs £9.35 no matter what the medication is. If you're below an income threshold, you don't pay anything. \n\nYou're also exempt for the following reasons:\n\nare 60 or over\n\nare under 16\n\nare 16 to 18 and in full-time education\n\nare pregnant or have had a baby in the previous 12 months and have a valid maternity exemption certificate (MatEx)\n\nhave a specified medical condition and have a valid medical exemption certificate (MedEx)\n\nhave a continuing physical disability that prevents you going out without help from another person and have a valid medical exemption certificate (MedEx)\n\nhold a valid war pension exemption certificate and the prescription is for your accepted disability\n\nare an NHS inpatient\n\nIf you are eligible to pay, you can pay a flat yearly fee of £108 or £9 a month and you get unlimited prescriptions. \n\n\nThe health crisis in America is totally fucked, and very preventable",
            "title_similarity": "0.67912",
            "sentiment_compound": -0.9328
        },
        {
            "id": "i2yunji",
            "score": -1,
            "text": "This is great news for people who need it, but really seems more of a low hanging feel good PR stunt versus the overall reform that is needed.",
            "title_similarity": "0.12542577",
            "sentiment_compound": 0.5195
        },
        {
            "id": "i2yvls1",
            "score": 1,
            "text": "Awesome now do everything",
            "title_similarity": "-0.1210588",
            "sentiment_compound": 0.6249
        },
        {
            "id": "i2yxuqp",
            "score": 1,
            "text": "So which r in the senate is gonna filibuster this?",
            "title_similarity": "0.4439586",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2yy7um",
            "score": -1,
            "text": "This will be wildly unpopular but people that eat themselves into type 2 diabetes shouldn’t get discounted insulin. Type 1 or people that age into type 2 only. Spend less money on food and buy your own damn insulin.",
            "title_similarity": "0.52287924",
            "sentiment_compound": -0.5023
        },
        {
            "id": "i2yz8g5",
            "score": -1,
            "text": "Wasn't this in the same vein as what Trump did, cost wise? They all loved it then. \n\nI can't remember why Biden pumped the breaks on Trump's plan, can anyone with a better understanding explain it to me like I'm 5? Thanks.",
            "title_similarity": "0.3265987",
            "sentiment_compound": 0.9399
        },
        {
            "id": "i2z2bdb",
            "score": 1,
            "text": "Nobody should be allowed to profit off of somebody else's pain.",
            "title_similarity": "0.089077406",
            "sentiment_compound": -0.1027
        },
        {
            "id": "i2z2ubk",
            "score": 1,
            "text": "Should be free\n\nThat's still around 5 times the cost it make it\n\nYou shouldn't charge people for being born different, I had a similar sting this month having to pay 118 quid for my glasses because I dared to be born with shit eyes",
            "title_similarity": "0.61071575",
            "sentiment_compound": -0.1779
        },
        {
            "id": "i2z4bnn",
            "score": -1,
            "text": "The bill caps cost-sharing for a month's supply of insulin starting in 2023 at whichever amount is lower: $35, or 25% of a plan's negotiated price, according to the bill's text. The bill does not lower the overall price of insulin; it would likely shift more of the cost onto insurers and employers. \n\nSo we are just playing spread the pain. And we wonder why anyone would not vote for this bill. More smoke and mirrors by the democrats.\n\n[Story link](https://abcnews-go-com.cdn.ampproject.org/v/s/abcnews.go.com/amp/Politics/house-votes-cap-cost-insulin-35-heads-senate/story?amp_js_v=a6&amp_gsa=1&id=83798272&usqp=mq331AQKKAFQArABIIACAw%3D%3D#aoh=16488153422258&referrer=https%3A%2F%2Fwww.google.com&amp_tf=From%20%251%24s&ampshare=https%3A%2F%2Fabcnews.go.com%2FPolitics%2Fhouse-votes-cap-cost-insulin-35-heads-senate%2Fstory%3Fid%3D83798272)",
            "title_similarity": "0.8114609",
            "sentiment_compound": -0.4238
        },
        {
            "id": "i2z7y0p",
            "score": 1,
            "text": "Still more expensive than in most countries.",
            "title_similarity": "0.20195363",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2zd5yq",
            "score": 1,
            "text": "Hate to break it to you, but both parties do not want this to pass (at least significant members in both parties). Yes, Republicans will largely stand against it (anti-business), but Democrats have their own donors to make happy as well. It's easy to vote YES on something knowing it will never actually pass.  \nDemocrats know that it has no chance of making it through the Senate (since they will not remove the 60-vote requirement, which they could do), so they have an opportunity to look like the good guys while secretly reassuring their donors nothing will change.  \nJust ask yourself, why aren't there any laws to cap insulin at the state level where Democrats hold wide super majorities? (same with single payer healthcare, free college, etc... )  \nCalifornia - 31D/9R, 59D/19R  \nHawaii - 24D/1R, 47D/4R  \nIllinois - 41D/18R, 73D/45R  \nMassachusetts - 37D/9R, 129D/30R  \nRhode Island - 33D/5R, 65D/10R  \n(many more)  \nI am neither a Democrat or Republican, but see the hypocrisy in both parties. Democrats largely only support legislation that doesn't cost the government or their donors large amounts to money (LGBTQ issues, immigration, etc...). Republicans are the same, but it's a lot easier to hide with a platform that mostly doesn't require spending money (at least not on individual people)",
            "title_similarity": "0.3753444",
            "sentiment_compound": 0.9956
        },
        {
            "id": "i2zdm0w",
            "score": -1,
            "text": "Boy if only there was a president that did something similar not too long ago.....",
            "title_similarity": "0.3452201",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2zg3xn",
            "score": 1,
            "text": "Insulin already costs less than $35 a month.\n\nhttps://www.lilly.com/resources/diabetes-solution-center",
            "title_similarity": "0.74201477",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2zz6l1",
            "score": -1,
            "text": "To all of you who didn’t already know. Trump made insulin affordable via an executive order during his presidency and Biden revoked.  SO DO NOT GIVE THESE PEOPLE CREDIT FOR SOMETHING THAT WAS ALREADY IN PLACE BEFORE.",
            "title_similarity": "0.5431204",
            "sentiment_compound": 0.516
        },
        {
            "id": "i30y8uv",
            "score": 1,
            "text": "Honest question: \nis this the same bill that Trump had started and Biden had frozen when offices switched? (A bunch of bills that were being processed were put on hold while changing presidents) I remember the debate with Trump saying he made insulin “as cheap as water” but took a beating on social media of all the people that it clearly wasn’t as cheap as water. Just wondering if it’s the same bill that is finally being looked at again or has it had some major changes from Trumps original one? Thanks in advance!",
            "title_similarity": "0.5931643",
            "sentiment_compound": 0.8463
        },
        {
            "id": "i2x1qis",
            "score": 35,
            "text": "This is amazing.  Progress!\n\nEdit: down voting myself.",
            "title_similarity": "0.08287759",
            "sentiment_compound": 0.784
        },
        {
            "id": "i2y5exn",
            "score": -14,
            "text": "Reinstating what Trump did eh?",
            "title_similarity": "0.14062507",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2xp61q",
            "score": 9,
            "text": "Machin will kill the senate bill.",
            "title_similarity": "0.40909547",
            "sentiment_compound": -0.6908
        },
        {
            "id": "i2xod6k",
            "score": -2,
            "text": "Lady Sinema will not stand for this.",
            "title_similarity": "0.05001084",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2xuv5p",
            "score": 2,
            "text": "What escapes me is that Republican voters who need or know someone who needs insulin will still vote Republican this year despite **only 10 Republicans voting for it.**\n\nI don’t get how someone can continue to complain about things then vote in the people that cause your complaints. Enjoy happily paying extreme costs for medicine because you keep voting in politicians that make you pay extreme costs.",
            "title_similarity": "0.5510211",
            "sentiment_compound": 0.4019
        },
        {
            "id": "i2y0wde",
            "score": 2,
            "text": "I'm so happy for this bandaid they have given us. Do we have to go line by line down health care to fix it. Can we get a ambulance rides capped at 100",
            "title_similarity": "0.4315933",
            "sentiment_compound": 0.8016
        },
        {
            "id": "i2y2yzp",
            "score": 2,
            "text": "Finally some **progressive policies** getting votes (or at least lip service).",
            "title_similarity": "0.29145426",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2y3be2",
            "score": 2,
            "text": "What is the actual phrasing of this.\n\nDoes this mean that *every* single insulin sold in the US must be under $35/month.\n\nOr does it mean any company that is selling insluin must have one available for under $35/month.\n\nOr does it mean that a pharmacy is required to stock atleast one insluin under $35/month.\n\nThere are like a good half dozen to dozen formulations of insulin.  Nobody just uses the straight stuff because the new stuff either controls your BGL better or is easier to use.  \n\nYou can already get the cheap insulin at Walmart (Humalin or Novalin) and it *works*...but not for everyone.\n\nSome diabetics only respond well to certain formulations or brands.",
            "title_similarity": "0.74490094",
            "sentiment_compound": 0.9349
        },
        {
            "id": "i2y52fw",
            "score": 2,
            "text": "Republicans really want to live in the dark ages",
            "title_similarity": "0.28506094",
            "sentiment_compound": 0.1513
        },
        {
            "id": "i2y5bey",
            "score": 2,
            "text": "This scam is protected by politicians and the pharma companies that own them.",
            "title_similarity": "0.33276206",
            "sentiment_compound": -0.2023
        },
        {
            "id": "i2y73uf",
            "score": 2,
            "text": "Cool now limit the cost of our rent please",
            "title_similarity": "0.25986645",
            "sentiment_compound": 0.5574
        },
        {
            "id": "i2y8agn",
            "score": 2,
            "text": "No thanks to the Republicans.\n\nHey how come after the civil war we no longer had Confederates but after jan 6 we still have Republicans?",
            "title_similarity": "0.45264643",
            "sentiment_compound": -0.5794
        },
        {
            "id": "i2ybn3a",
            "score": -2,
            "text": "It amazes me that more ppl don’t just buy insulin on the black market. Bodybuilders have been getting it for years",
            "title_similarity": "0.47669813",
            "sentiment_compound": 0.4939
        },
        {
            "id": "i2ybt90",
            "score": -2,
            "text": "How is this going to work so can anyone buy it at like a Walmart? Cos I know a lot of people in bodybuilding go through an excessive amount of insulin and I think they should have to pay a premium for it",
            "title_similarity": "0.51733017",
            "sentiment_compound": 0.2732
        },
        {
            "id": "i2zfmo7",
            "score": -2,
            "text": "I remember when Trump did this and then Biden canceled it.",
            "title_similarity": "0.30574596",
            "sentiment_compound": 0.0
        },
        {
            "id": "i30q6l5",
            "score": 2,
            "text": "Copays people they are talking about copays",
            "title_similarity": "0.11886791",
            "sentiment_compound": 0.0
        },
        {
            "id": "i32uqnt",
            "score": -2,
            "text": "Ok, and so do you want to put multiple companies out of business and never have the development of a new kind of insulin again? Correct me if I'm wrong, but it costs money for R and D. No one sits around trying to invent new insulins, spending millions/billions to do it, to turn around and go bankrupt when they can't repay their bills if 35 per is all that can be charged. Life isn't this simple. You can't just say \"It is decreed that the price shall be x from now on, muh lurd\", doesn't work like that. Kill the suppliers of insulin and you won't have any insulin at all or you'll have schitty short acting insulin if you prefer that instead I guess, where you stab yourself like 20 times a day.",
            "title_similarity": "0.631668",
            "sentiment_compound": -0.9745
        },
        {
            "id": "i2xdeib",
            "score": -12,
            "text": "Next is gas prices",
            "title_similarity": "0.25790244",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2y96k9",
            "score": 3,
            "text": "Too late for a buddy of mine. 38 years old, wife and two kids, dead due to lack of insulin. It's a goddamn shame and disgrace.",
            "title_similarity": "0.5059784",
            "sentiment_compound": -0.9432
        },
        {
            "id": "i2yb5e8",
            "score": -3,
            "text": "I'm sure there's literally nothing else in the bill whatsoever that could possibly be objectionable. There is simply no other explanation other than those evil Republicans hating people with diabetes.",
            "title_similarity": "0.28691858",
            "sentiment_compound": -0.8225
        },
        {
            "id": "i2ybvct",
            "score": -4,
            "text": "L bill!",
            "title_similarity": "0.026690025",
            "sentiment_compound": 0.6155
        },
        {
            "id": "i2yfyig",
            "score": 3,
            "text": "Wait! What!?\n\nYou guys have to pay for your Insulin? Wow! What are you. A third world country?\n\nRegards; Norway and Sweden.",
            "title_similarity": "0.5580054",
            "sentiment_compound": 0.7018
        },
        {
            "id": "i2xrmbl",
            "score": 121,
            "text": "This is a subsidy for big pharma. \n\nPharma still gets paid the full price by Insurance companies, and this gets passed into the premiums and deductibles. \n\nInstead, we need patent reform so we can have Generic Insulin. Insulin is complex enough that patent owners can tweak the product and extend the patent under current law. This scam is protected by politicians and the pharma companies that own them.",
            "title_similarity": "0.5159093",
            "sentiment_compound": -0.1962
        },
        {
            "id": "i2yfp2v",
            "score": -12,
            "text": "Everything democrats have done has damaged the economy. Another L for the braindeads (dems)",
            "title_similarity": "0.45249033",
            "sentiment_compound": 0.2103
        },
        {
            "id": "i2x5ukz",
            "score": 336,
            "text": "[This is way past due, considering that insulin was developed in 1920 and released by the discoverers into the public domain.](https://www.vox.com/2019/4/3/18293950/why-is-insulin-so-expensive)",
            "title_similarity": "0.54020476",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2xaasi",
            "score": -3,
            "text": "It passed the House with lots of bipartisan support, and the Senate is 50% blue with a blue president and Vice President. Does that mean it’s basically guaranteed to get passed into law?",
            "title_similarity": "0.50143075",
            "sentiment_compound": 0.4019
        },
        {
            "id": "i2xu9ca",
            "score": 4,
            "text": "193 Republicans voted against it but they're going to brag about it passing to their constituents and get away with it because conservative voters are the stupidest creatures on the planet.",
            "title_similarity": "0.4488321",
            "sentiment_compound": -0.6808
        },
        {
            "id": "i2y216f",
            "score": 4,
            "text": "And when it fails in the senate thanks to piece of shit republicans, let’s hope those it impacts actually stop voting for them.",
            "title_similarity": "0.498285",
            "sentiment_compound": -0.4215
        },
        {
            "id": "i2ybmxm",
            "score": -5,
            "text": "Why not do that with all things? Why not one dollar?",
            "title_similarity": "0.31146234",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2yr09u",
            "score": -5,
            "text": "Oh, look at that, the government redid something they undid last year",
            "title_similarity": "0.5740269",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2ytlg4",
            "score": -4,
            "text": "Trump had already done this, and it was Biden who reversed this move. It was never about lowering the price.",
            "title_similarity": "0.2164557",
            "sentiment_compound": 0.1877
        },
        {
            "id": "i2yuax1",
            "score": -4,
            "text": "[deleted]",
            "title_similarity": "0.030619297"
        },
        {
            "id": "i2y2obj",
            "score": 16,
            "text": "A bill that only addresses insulin costs. No pork spending. No crazy riders. Just insulin costs. A bill so short you could scan it in two minutes.",
            "title_similarity": "0.6139783",
            "sentiment_compound": -0.0423
        },
        {
            "id": "i2y6g13",
            "score": -4,
            "text": "I'm glad this got passed but most type 2 diabetes Americans wouldn't need insulin it they lived a healthier lifestyle and lost weight.",
            "title_similarity": "0.3896996",
            "sentiment_compound": -0.2382
        },
        {
            "id": "i2y7se8",
            "score": 5,
            "text": "I've got genuinely excellent insurance, and yet the out-of-pocket for my last insulin refill was $750.\n\nNo generics, and a market held captive by the necessity of metabolism...",
            "title_similarity": "0.62746054",
            "sentiment_compound": 0.3612
        },
        {
            "id": "i2yeq8f",
            "score": -5,
            "text": "Price controls will lead to less availability of insulin, and lower quality. This isn’t good although it seems good.  But this is a bandaid on a bigger issue. \n\nI’d love for insulin to be cheap, even free. But we need more companies making insulin to lower the price. Not a price control",
            "title_similarity": "0.41982862",
            "sentiment_compound": 0.8945
        },
        {
            "id": "i2xhvpa",
            "score": 17,
            "text": "In the greatest country in the world, this is news.",
            "title_similarity": "0.1033251",
            "sentiment_compound": 0.6369
        },
        {
            "id": "i2xlvte",
            "score": 38,
            "text": "Huh. /r/Conservative is silent about this. Weird. Wonder why….",
            "title_similarity": "0.121879846",
            "sentiment_compound": -0.2204
        },
        {
            "id": "i2y6bsr",
            "score": -7,
            "text": "Remember this? https://www.policymed.com/2021/10/biden-administration-rescinds-trump-administration-insulin-pricing-rule.html",
            "title_similarity": "0.39866722",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2y9zti",
            "score": -5,
            "text": "Nice. Now I can take hgh and insulin and reach 300lbs.",
            "title_similarity": "0.4895063",
            "sentiment_compound": 0.4404
        },
        {
            "id": "i2yi0na",
            "score": -5,
            "text": "Nothing is free, someone pays for it. If it’s insurance companies then the insured pay for it through premiums. If you hit the manufactures too hard they will simply stop or limit production. It’s doesn’t matter if it’s cheap if it’s not available.",
            "title_similarity": "0.3728994",
            "sentiment_compound": -0.681
        },
        {
            "id": "i2yr05e",
            "score": -6,
            "text": "Just a reminder that the previous administration did this, and biden ended it on his first day",
            "title_similarity": "0.42016494",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2xs89w",
            "score": 6,
            "text": "It will never pass the senate because too many senators are in the pocket of big pharma. I would literally bet serious money on this.",
            "title_similarity": "0.51760834",
            "sentiment_compound": -0.0772
        },
        {
            "id": "i2xtcsv",
            "score": -7,
            "text": "Why can’t we do the same for the price of a gallon of gas?",
            "title_similarity": "0.36347336",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2y1v4v",
            "score": -7,
            "text": "October, 2021: [Biden Administration Rescinds Trump Administration Insulin Pricing Rule](https://www.policymed.com/2021/10/biden-administration-rescinds-trump-administration-insulin-pricing-rule.html)",
            "title_similarity": "0.52087796",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2y5cod",
            "score": 8,
            "text": "Remember. Canadians left this unpatented so it could be widely available. It’s American greed that fucked y’all over.",
            "title_similarity": "0.27825403",
            "sentiment_compound": -0.7964
        },
        {
            "id": "i2yb3s2",
            "score": -7,
            "text": "Didn't Trump enact this while in office? And didn't Biden immediately strike it down when he came into office? Or am I getting something wrong here?",
            "title_similarity": "0.37219936",
            "sentiment_compound": -0.5057
        },
        {
            "id": "i2y2qfl",
            "score": -7,
            "text": "Isn’t that the one Biden removed after Trump passed it?",
            "title_similarity": "0.33728242",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2y93mv",
            "score": -9,
            "text": "In other words. If it costs more than $35 to produce and sell a months worth of insulin, it’s no longer profitable and won’t be produced or sold. Assuming you need 6 vials a month, that’s a cap of $5.83 per vial. If it costs more than that to produce and sell then selling insulin will no longer be profitable. There are certainly types of insulin that cost pennies to produce. But there are also more modern and advanced types of insulin that likely cost more than $6 a vial and will no longer be able to sell their product. Furthermore, I can easily see a future where the increasing inflation makes it impossible for any insulin to be sold if there’s a cap on the price.",
            "title_similarity": "0.65655744",
            "sentiment_compound": 0.5256
        },
        {
            "id": "i2yaxxv",
            "score": 8,
            "text": "Meanwhile literally in any other country: insulin is free for those who need it.",
            "title_similarity": "0.2550881",
            "sentiment_compound": 0.5106
        },
        {
            "id": "i2x394a",
            "score": 157,
            "text": "I remember President Biden talking about this during the state of the union address. Glad to see some of the things he was talking about moving forward",
            "title_similarity": "0.25745207",
            "sentiment_compound": 0.4588
        },
        {
            "id": "i2xzolt",
            "score": -10,
            "text": "I bet it’s going to destroy the quality and cause more issues in the long run. Just watch 10 years later",
            "title_similarity": "0.38921487",
            "sentiment_compound": -0.5423
        },
        {
            "id": "i2y7esz",
            "score": -9,
            "text": "I hate how politicians play with people's lives for politics,  this was already done during the trump administration and biden got rid of it so they can play politics",
            "title_similarity": "0.3948877",
            "sentiment_compound": 0.0935
        },
        {
            "id": "i2y1s2z",
            "score": -12,
            "text": "Pretty sure trump already did this. And then Biden repealed it.",
            "title_similarity": "0.30055335",
            "sentiment_compound": 0.6705
        },
        {
            "id": "i2y2awl",
            "score": -13,
            "text": "Impressive (but predicable) that the commenters don’t know that this was done in the previous term and then reversed by the current president.",
            "title_similarity": "0.39566088",
            "sentiment_compound": 0.2846
        },
        {
            "id": "i2y7avt",
            "score": -12,
            "text": "Trump already did this. Boring.",
            "title_similarity": "0.13112006",
            "sentiment_compound": -0.3869
        },
        {
            "id": "i2yb3sl",
            "score": -12,
            "text": "Trump already did this 😂",
            "title_similarity": "0.13612802",
            "sentiment_compound": 0.4404
        },
        {
            "id": "i2yboi2",
            "score": -12,
            "text": "Capitalism was pretty cool while it lasted. Next stop, communism.",
            "title_similarity": "0.16162802",
            "sentiment_compound": 0.5106
        },
        {
            "id": "i2ycvz5",
            "score": -12,
            "text": "This enables diabetes and morbid obesity.\n\nI don’t care how you spin this, there will be an unintended consequence of even more fatties walking (riding) around because there will be even fewer consequences for eating your life away.",
            "title_similarity": "0.38183326",
            "sentiment_compound": 0.4939
        },
        {
            "id": "i2xmh0y",
            "score": -12,
            "text": "70's era price controls are back? Yet no national rent control policy?",
            "title_similarity": "0.47755226",
            "sentiment_compound": -0.3736
        },
        {
            "id": "i2xtnih",
            "score": 194,
            "text": "No one in this thread seems to have noticed this little detail:\n\n\"While the bill would lower costs for many individual patients who take insulin, it would do nothing to reduce the prices paid to the companies that make it. Instead, insurance companies would simply pay a larger share of the price.\"",
            "title_similarity": "0.44516638",
            "sentiment_compound": -0.3818
        },
        {
            "id": "i2y8luo",
            "score": 17,
            "text": "193 Republicans voted against?! Really an embarrassment to the country.",
            "title_similarity": "0.3952454",
            "sentiment_compound": -0.5378
        },
        {
            "id": "i2xjlpo",
            "score": 360,
            "text": "Interesting that r/conservative seems more obsessed with some Disney boycott bullshit than their party selling them out yet again.",
            "title_similarity": "0.3029697",
            "sentiment_compound": -0.4005
        },
        {
            "id": "i2xq6uv",
            "score": 17,
            "text": "However, most Republicans voted against it because it reduces the blood money profits of the filthy rich.   They would rather see Americans die.  Who the hell votes for these scumbags!  Wake up!",
            "title_similarity": "0.4694425",
            "sentiment_compound": -0.555
        },
        {
            "id": "i2xr7h7",
            "score": 55,
            "text": "*for people with insurance",
            "title_similarity": "0.10171804",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2x2lnv",
            "score": 777,
            "text": "Don’t worry Manchin will make sure it doesn’t pass the senate",
            "title_similarity": "0.3933278",
            "sentiment_compound": -0.1531
        },
        {
            "id": "i2x4hi0",
            "score": 425,
            "text": "Did it already pass the Senate? Seems unlikely they would.",
            "title_similarity": "0.337789",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2xfc6f",
            "score": 532,
            "text": "Just posted this to r/conservative with no cues as to who voted against it to see what’ll happen lol\n\nEdit: mods won’t allow it to go up lol",
            "title_similarity": "0.38479945",
            "sentiment_compound": 0.6486
        },
        {
            "id": "i2x3fuj",
            "score": 2452,
            "text": "Wow is this the world liberals want to live in? Idk about the rest of you but I won't sleep easy until I know my grandmother spends at least half her social security money on medicine. USA! USA!",
            "title_similarity": "0.68281126",
            "sentiment_compound": -0.1638
        },
        {
            "id": "i2x7ij1",
            "score": 4486,
            "text": ">The House approved the bill Thursday by a vote of 232-193, with 12 Republicans joining all Democrats in support. [source](https://abcnews.go.com/Politics/house-votes-cap-cost-insulin-35-heads-senate/story?id=83798272)\n\nThink about that for just a second… Only 12 republicans in the house voted for this bill. Only 12! \n\nBoth parties are not the same",
            "title_similarity": "0.6509868",
            "sentiment_compound": 0.8172
        },
        {
            "id": "i2x3n27",
            "score": 2140,
            "text": "R: \"I'm pro life, just not diabetic lives\"",
            "title_similarity": "0.08192533",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2x175g",
            "score": 12612,
            "text": "193 Republicans voted against it.",
            "title_similarity": "0.41105884",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2xtn5a",
            "score": 2946,
            "text": ">**cost of production for a vial of human insulin is between $2.28 and $3.42**, while the production cost for a vial of most analog insulins is between $3.69 and $6.16\n\nhttps://www.businessinsider.com/insulin-prices-could-be-much-lower-and-drug-makers-would-still-make-healthy-profits-2018-9",
            "title_similarity": "0.6417047",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2x6j1e",
            "score": 1,
            "text": "I wonder if this is just regular insulin or NPH? Surely it is not any sort of brand name insulin right?",
            "title_similarity": "0.22490123",
            "sentiment_compound": 0.504
        },
        {
            "id": "i2xcaxc",
            "score": 1,
            "text": "*slams desk*\n\nThank you!",
            "title_similarity": "0.16503692",
            "sentiment_compound": 0.4199
        },
        {
            "id": "i2xnaf6",
            "score": 1,
            "text": "I remember when this popped up a few years ago too, my friend who has a diabetic kid mentioned that the insulin that the bill makes cost only 35 bucks isn't even used in humans anymore.\n\nDoes anyone else know any more about it?",
            "title_similarity": "0.7571465",
            "sentiment_compound": 0.4939
        },
        {
            "id": "i2xp4kl",
            "score": 1,
            "text": "Well there’s a good idea that took WAY TO LONG TO FIGURE OUT",
            "title_similarity": "0.08231494",
            "sentiment_compound": 0.6124
        },
        {
            "id": "i2xq294",
            "score": 1,
            "text": "can someone help me understand (please no jokes) why this would be opposed?",
            "title_similarity": "0.073459625",
            "sentiment_compound": 0.504
        },
        {
            "id": "i2xqrnb",
            "score": 1,
            "text": "Awesome!!!",
            "title_similarity": "-0.1998402",
            "sentiment_compound": 0.7163
        },
        {
            "id": "i2xrmts",
            "score": 4,
            "text": "it’s an understatement to say i’m not a fan of trump, [but didn’t he propose the same?](https://estes.house.gov/uploadedfiles/lowering-medicare-insulin-prices.pdf)\n\ni know it was temporarily halted by new admin. is this the same or something different?\n\nedit: thanks for those who answered! new bill is inclusive (applies to everyone) while trump’s had contingencies!",
            "title_similarity": "0.46682382",
            "sentiment_compound": 0.65
        },
        {
            "id": "i2xro1e",
            "score": 1,
            "text": "I’ve always thought that if we can’t get universal healthcare we need to heavily regulate the cost of medical services and medication.",
            "title_similarity": "0.39603275",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2xsdy1",
            "score": 2,
            "text": "This is going to be so important seeing as new data shows that COVID is linked to greater rates of diabetes: \n\nhttps://www.nature.com/articles/d41586-022-00912-y",
            "title_similarity": "0.36653763",
            "sentiment_compound": 0.5949
        },
        {
            "id": "i2xsf6y",
            "score": 2,
            "text": "Good policy and good politics being done by democrats!  It’s just a start, but this is what starting looks like",
            "title_similarity": "0.289766",
            "sentiment_compound": 0.7537
        },
        {
            "id": "i2xsufb",
            "score": 1,
            "text": "“If money is the root of evil, then the Right is the fertilizer.”",
            "title_similarity": "0.18397088",
            "sentiment_compound": -0.6597
        },
        {
            "id": "i2xsyxj",
            "score": 1,
            "text": "Haven't read the bill, but is there something in there about repaying those who required insulin while these greedy fucks were stacking paper and paying dividends (yes, active/passive investors are also to blame)?  Is there something in there about acts of contrition to those who died for want of enough money to live?  \n\nI know.  I know.  It would establish a legal precedent for reparations.  \n\nGood.",
            "title_similarity": "0.4816378",
            "sentiment_compound": -0.782
        },
        {
            "id": "i2xt3dc",
            "score": 2,
            "text": "I am not a democrat but this is awesome news.",
            "title_similarity": "3.7918799e-06",
            "sentiment_compound": 0.7684
        },
        {
            "id": "i2xtpuz",
            "score": 1,
            "text": "I have a diabetic parent, close friend, and a diabetic cat.  No one should be struggling to pay for insulin, especially my cat.  He doesn’t earn much.",
            "title_similarity": "0.4545408",
            "sentiment_compound": -0.296
        },
        {
            "id": "i2xum1w",
            "score": 2,
            "text": "My brother spends like $450 every 2 weeks for his insulin and meds associated with his diabetes type 1. I pray this works out. Also fuck those 192 republican assholes who obviously don't give a shit about the people they're supposed to serve.",
            "title_similarity": "0.71231055",
            "sentiment_compound": -0.1471
        },
        {
            "id": "i2xvh1v",
            "score": 1,
            "text": "No where near enough but okay",
            "title_similarity": "-0.11870607",
            "sentiment_compound": 0.1901
        },
        {
            "id": "i2xvq91",
            "score": 1,
            "text": "Meaningless, Emperor Palpatine will kill this bill in the Senate.",
            "title_similarity": "0.41684884",
            "sentiment_compound": -0.8225
        },
        {
            "id": "i2xvs0w",
            "score": 1,
            "text": "Curious if they will ever release the total amount of people who have died because they cant afford their insulin\\meds.",
            "title_similarity": "0.600647",
            "sentiment_compound": -0.3182
        },
        {
            "id": "i2xw086",
            "score": 3,
            "text": "And these stupid old farts keep voting for Republicans because The GOP convinced them that the *Democrats* are going to install death panels in Medicare to decide who lives or dies when in fact *the Republicans are the death panel*.",
            "title_similarity": "0.55250525",
            "sentiment_compound": -0.8591
        },
        {
            "id": "i2xw4uz",
            "score": 1,
            "text": "baby steps :(",
            "title_similarity": "0.0015053488",
            "sentiment_compound": -0.4404
        },
        {
            "id": "i2xw9rq",
            "score": 1,
            "text": "Wow, politicians being human beings, hell must have froze over.",
            "title_similarity": "0.28223023",
            "sentiment_compound": -0.2023
        },
        {
            "id": "i2xwfea",
            "score": 1,
            "text": "It's only limiting out of pocket expensive, nice, but it is one drug of thousands that have this issue.",
            "title_similarity": "0.4548354",
            "sentiment_compound": 0.2263
        },
        {
            "id": "i2xwhdn",
            "score": 1,
            "text": "Even $35 a month is sorta dumb because for people around or below poverty line (which is A LOT of people in the USA almost 40 million) $35 is a lot",
            "title_similarity": "0.69886774",
            "sentiment_compound": -0.7436
        },
        {
            "id": "i2xwjp8",
            "score": 6,
            "text": "193 republicans voted against it. Tell me again how republicans aren't evil. They show you over and over how little they fucking care about the public. 31% of the 30 million diabetic  Americans take Insulin, that shows you how little these guys fucking care. Their entire existences are paid for by big pharma.   \n\n\nThis will die in the senate, and millions will be crushed under the weight of drugs that cost fucking PENNIES to make.",
            "title_similarity": "0.69406074",
            "sentiment_compound": 0.5482
        },
        {
            "id": "i2xwuui",
            "score": 1,
            "text": "Do you pay for insulin in America?\nWho can't pay dies?",
            "title_similarity": "0.60610825",
            "sentiment_compound": -0.119
        },
        {
            "id": "i2xwyd5",
            "score": 2,
            "text": "At least it’s a step in the right direction",
            "title_similarity": "-0.14513731",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2xwzxd",
            "score": 1,
            "text": "Let’s remove their pancreases and see how much they think insulin should cost",
            "title_similarity": "0.5363979",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2xx6d1",
            "score": 2,
            "text": "Now do the senate",
            "title_similarity": "0.27450335",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2xxa8h",
            "score": 3,
            "text": "There was a story of a life saving drug in china for chanced if I remember correctly. People had to pay their life savings and more for it because a big Parma group sold it for that much. Meanwhile Chinese citizens r were smuggling it from India I believe to treat friends and others. They were being arrested for it. When the governments higher ops finally found out what was going on they limited pricing asap. This was a movie based on real events fact check me I might be wrong.\n\n\nFound an article talking about it. Issue was made pubic 2015 wide spread media attention. Chinese movie made about arrest and what they had to do to smuggle to drug and give it to fellow patients to live.  Government took action within 2 years. I’m not praising China but America we need to admit we have issues I can’t call anywhere else home and by god getting older really opened my eyes to a lot of shiiit\n\nhttps://www.weforum.org/agenda/2018/07/price-of-cancer-drugs-in-china-set-to-drop-following-hit-film/",
            "title_similarity": "0.5097188",
            "sentiment_compound": -0.3559
        },
        {
            "id": "i2xxbp7",
            "score": 1,
            "text": "Wanna bet senate republicans are gonna filibuster this to nothingness?",
            "title_similarity": "0.47430086",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2xxkz5",
            "score": 1,
            "text": "Price caps have trouble, manufacturers will immediately start with the crocodile tears about how this makes them supply it at a loss, independent of whether that is true.\n\nWe need a public sector supplier, or at least for the govt to set up a fresh batch of private sector competitors.",
            "title_similarity": "0.4343812",
            "sentiment_compound": -0.2023
        },
        {
            "id": "i2xxqyv",
            "score": 1,
            "text": "Is this bill only for insulin or is pork added?  It would just blow my mind that someone would vote against it, but then again politics as usual pet projects are added.",
            "title_similarity": "0.5112692",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2xxrmo",
            "score": 1,
            "text": "Other than being partisan was there any additions to the bill that would make the Republicans not vote for this? I just can’t understand why anyone would object to this.",
            "title_similarity": "0.23241943",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2xxxmo",
            "score": 1,
            "text": "Rs are straight up hostile to the population of America, how are they even a party?",
            "title_similarity": "0.3173993",
            "sentiment_compound": 0.25
        },
        {
            "id": "i2xy26w",
            "score": 1,
            "text": "Remember how their constituents think the reason for the pandemic was to make pharmaceutical companies billions of dollars. One way to stop that would be to limit the cost of pharmaceuticals. So much for stopping the pharmaceutical companies.",
            "title_similarity": "0.56636083",
            "sentiment_compound": -0.4703
        },
        {
            "id": "i2xyaq4",
            "score": 2,
            "text": "What is the argument to NOT vote for this bill though..? I'm genuinely curious why some people don't want insulin be cheaper.",
            "title_similarity": "0.4043492",
            "sentiment_compound": -0.1083
        },
        {
            "id": "i2xydv2",
            "score": 2,
            "text": "YES! Idk if it needs to be lower or not but at least this should prevent people from going bankrupt trying to live",
            "title_similarity": "0.28690487",
            "sentiment_compound": -0.6834
        },
        {
            "id": "i2xyk6e",
            "score": 1,
            "text": "The cost of living with diabetes isn’t just insulin. The bill should cap how much can be charged out of pocket for medical treatments.\n\nJust having free insulin isn’t enough to keep a diabetic alive.\n\nMinimum you need:\n- to test you sugar so either a cgm device like a dexcom or a meter and test strips, both really since the strips back up the cgm. Without knowing your level you’d od and die from an injection or a lack thereof\n\n- you need to see a doctor and have blood work done at least every 3 months to make sure you don’t die\n\n- the insulin needs a delivery system, so if you inject with pens you need to take 2 kinds of insulin and the pens use needle caps. (Pens just stopped being covered by my insurance) so without pens you need needles or a pump, and pump supplies like cartridges.\n\n- if you make any money at all you don’t qualify for Medicaid then you need insurance which has premiums and copays that Add Up\n\n- if any of this malfunctions in the many ways it can, or if your broken body fails to thrive under the stress of a chronic illness, you need hospital visits which if you have insurance still costs a fortune\n\nWhen diabetics go broke its not just insulin",
            "title_similarity": "0.67450154",
            "sentiment_compound": -0.93
        },
        {
            "id": "i2xysu6",
            "score": 3,
            "text": "As someone who has depended on insulin to stay alive for the past 36 years, a big fuck you to those 193 Republicans",
            "title_similarity": "0.6450412",
            "sentiment_compound": -0.2263
        },
        {
            "id": "i2xywpr",
            "score": 1,
            "text": "Can't wait for them to demand 4-5 years worth of monthly payments upfront, nice loophole.",
            "title_similarity": "0.57073456",
            "sentiment_compound": 0.4939
        },
        {
            "id": "i2xyxh3",
            "score": 1,
            "text": "Wait, they can vote for bills that limit the costs of specific things? What about housing? What about public transportation? What about health insurance? This seems like one of those checks-many-boxes-but-doesn't-accomplish-anything-substantial-but-makes-those-who-criticize-it-in-any-way-look-stupid bills.",
            "title_similarity": "0.42586756",
            "sentiment_compound": 0.5362
        },
        {
            "id": "i2xz2sl",
            "score": 1,
            "text": ">Other parts of the broader bill would expand health insurance coverage, extending insulin coverage to diabetes patients who are uninsured. The bill that passed the House on Thursday would not improve the affordability of insulin for people who lack health insurance.\n\nI hope people read the article and realize this. I'm seeing a lot of people with the sentiment that it's an \"insulin for all\" type deal. When it really isn't the case. You still need insurance. They'll still only cover certain insulins. You'll still need a part D plan if you're on Medicare.\n\nLike it's a step in the right direction. But as a pharmacy tech who deals with Medicare daily regarding getting authorization forms for testing supplies, insulin, etc. this seems like more fanfare to generate goodwill.\n\nAgain it's a good step but if you don't have insurance it really doesn't help you. That's the main problem, the lack of healthcare for all.",
            "title_similarity": "0.63313884",
            "sentiment_compound": -0.0406
        },
        {
            "id": "i2xzdkd",
            "score": 1,
            "text": "Don’t worry. Mitch will fuck this up too.",
            "title_similarity": "0.11510412",
            "sentiment_compound": -0.7506
        },
        {
            "id": "i2xzkoo",
            "score": 3,
            "text": "This lifesaving drug is used by children and adults.  They can't live without it. 193 Republicans voted NAY. Despicable and ass backwards.  They claim to be so concerned about inflation and drug costs. But vote \"Nay.\" I am blessed to not be diabetic but I have friends and family who are.  One family has a 6 year old son with Type 1 since he was 4 years old.",
            "title_similarity": "0.54700667",
            "sentiment_compound": 0.85
        },
        {
            "id": "i2xzlsr",
            "score": 26,
            "text": ">The bill attracted unanimous support from Democrats who voted, as well as from 12 Republicans, making it a rare piece of bipartisan policy legislation.\n\nThat's 12 Republicans. Out of hundreds. For a bill pretty much everyone wants. That should be upsetting.",
            "title_similarity": "0.41154924",
            "sentiment_compound": 0.7717
        },
        {
            "id": "i2xzpxf",
            "score": 3,
            "text": "I am not diabetic but thank fuck. My heart breaks when every time I hear a story about a person or family that can’t afford this life saving medicine.",
            "title_similarity": "0.42987072",
            "sentiment_compound": -0.1568
        },
        {
            "id": "i2xzq0e",
            "score": 2,
            "text": "Now to watch it die in the Senate, as always",
            "title_similarity": "0.44944632",
            "sentiment_compound": -0.5994
        },
        {
            "id": "i2xzr30",
            "score": 2,
            "text": "Great, wish my dead Grandmother could have benefited from this, while she had type 2 her whole life. (to the best of my memory, she passed recently.)",
            "title_similarity": "0.41351566",
            "sentiment_compound": 0.7717
        },
        {
            "id": "i2xzrmd",
            "score": 1,
            "text": "Those damn communist",
            "title_similarity": "0.10938287",
            "sentiment_compound": -0.4019
        },
        {
            "id": "i2xzs59",
            "score": 1,
            "text": "That will literally save lives .\nPeople have committed shocked cuz they can’t afford insulin",
            "title_similarity": "0.47184226",
            "sentiment_compound": 0.4588
        },
        {
            "id": "i2xzsge",
            "score": 1,
            "text": "Thank-you for being a valued customer of the diabetes rewards points now we would like to offer you $35 a month deal for for insulin",
            "title_similarity": "0.70176077",
            "sentiment_compound": 0.8176
        },
        {
            "id": "i2xzwqq",
            "score": 3,
            "text": "\"While the bill would lower costs for many individual patients who take insulin, it would do nothing to reduce the prices paid to the companies that make it. Instead, insurance companies would simply pay a larger share of the price.\"\n\nWell shuckee-darn, would be a shame if those insurance companies had to pay out from all the millions of profit they rake in",
            "title_similarity": "0.5331305",
            "sentiment_compound": 0.0258
        },
        {
            "id": "i2y05hd",
            "score": 2,
            "text": "Never happen. Republicans just don't seem to realize that their party doesn't care about them, unless they're a shareholder.",
            "title_similarity": "0.31551412",
            "sentiment_compound": 0.0186
        },
        {
            "id": "i2y0hfc",
            "score": 2,
            "text": "Holy shit, that was like our number one way to belittle you guys. \nNow you have a democratic government and you are just going to remove the death penalty for being poor?",
            "title_similarity": "0.45978683",
            "sentiment_compound": -0.9287
        },
        {
            "id": "i2y0uqh",
            "score": 2,
            "text": "Good luck in the Senate.. they'll find some reason not to pass it.",
            "title_similarity": "0.3837089",
            "sentiment_compound": 0.7096
        },
        {
            "id": "i2y14j5",
            "score": 2,
            "text": "Good luck little bill!",
            "title_similarity": "-0.06744719",
            "sentiment_compound": 0.7345
        },
        {
            "id": "i2y15ny",
            "score": 1,
            "text": "I sometimes wonder what would happen if someone were to copy paste suppressed headlines like these in r/conservative.",
            "title_similarity": "0.29950702",
            "sentiment_compound": 0.3612
        },
        {
            "id": "i2y185n",
            "score": 1,
            "text": "April fools?? /S",
            "title_similarity": "0.28521496",
            "sentiment_compound": -0.5514
        },
        {
            "id": "i2y18tq",
            "score": 2,
            "text": "Here comes Joe Manchin et al to fuck it all up…",
            "title_similarity": "0.17495614",
            "sentiment_compound": -0.5423
        },
        {
            "id": "i2y1d2i",
            "score": 2,
            "text": "How can you vote against this?",
            "title_similarity": "0.17287779",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2y1ee4",
            "score": 1,
            "text": "About time.. it's frustrating that it took so long, but it is nice to see progress//",
            "title_similarity": "0.09604124",
            "sentiment_compound": 0.7543
        },
        {
            "id": "i2y1fp9",
            "score": 1,
            "text": "For once go for the majority of people",
            "title_similarity": "0.12540016",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2y1hj5",
            "score": 1,
            "text": "It's fucking insulin. It's among the first drugs we manufactured en masse. It should be fucking free. Fuck congress, and fuck pharmaceutical companies.",
            "title_similarity": "0.45289448",
            "sentiment_compound": -0.5698
        },
        {
            "id": "i2y1iis",
            "score": 1,
            "text": "Maybe a small pebble will start a larger avalanche?  We can only hope, but if history tells me anything, it will have to be government regulation, some kind of profit for politicians voting on the legislation (not necessarily monetary, maybe a combo of funds), or enough social pressure that they don't have a choice - they can't ignore it and they can't vote against the people because they know there would be riots all across the nation.",
            "title_similarity": "0.4460922",
            "sentiment_compound": -0.0579
        },
        {
            "id": "i2y1iz6",
            "score": 1,
            "text": "RIP everyone who died because they couldn’t do this sooner. F*ck this world",
            "title_similarity": "0.24918392",
            "sentiment_compound": -0.5574
        },
        {
            "id": "i2y1oe9",
            "score": 2,
            "text": "Yeah but does this include all varieties of insulin? Probably not. People who have been diabetic for a long time usually can't just use humalog.",
            "title_similarity": "0.49658656",
            "sentiment_compound": 0.1531
        },
        {
            "id": "i2y262g",
            "score": 2,
            "text": "This is probably going to help more people than any other law this decade.",
            "title_similarity": "0.2671494",
            "sentiment_compound": 0.4019
        },
        {
            "id": "i2y2925",
            "score": 3,
            "text": "This is great unless it gets blocked in the senate.",
            "title_similarity": "0.37998068",
            "sentiment_compound": 0.4588
        },
        {
            "id": "i2y2a2z",
            "score": 2,
            "text": "Let people live. Make it cheap!",
            "title_similarity": "0.100572884",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2y2ar0",
            "score": 22,
            "text": "Or remove the patents allowing for an insulin oligopoly to exist instead of adding extra laws to solve something created by laws.",
            "title_similarity": "0.4166208",
            "sentiment_compound": 0.4215
        },
        {
            "id": "i2y2dow",
            "score": 1,
            "text": "Martin and Ben S. Look cousins",
            "title_similarity": "0.24106938",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2y2e64",
            "score": 2,
            "text": "I am so impressed that this FINALLY happened .  A huge victory!!",
            "title_similarity": "-0.10820598",
            "sentiment_compound": 0.783
        },
        {
            "id": "i2y2g2m",
            "score": 3,
            "text": "[dies in senate because America]",
            "title_similarity": "0.5189102",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2y2msx",
            "score": 6,
            "text": "Been a type 1 diabetic since I was 4 years old, gonna be turning 25 this year.  Is this actually real?!?  This would be so amazing and a real game changer for me and so many others",
            "title_similarity": "0.5791794",
            "sentiment_compound": 0.7592
        },
        {
            "id": "i2y2n16",
            "score": 5,
            "text": "This is where the free market has gotten us.",
            "title_similarity": "0.00033649802",
            "sentiment_compound": 0.5106
        },
        {
            "id": "i2y2wy5",
            "score": 3,
            "text": "It'll be fillibustered.",
            "title_similarity": "0.08706374",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2y3150",
            "score": 5,
            "text": "Capitalism in most industries has monopolization and unethical business practices baked into it",
            "title_similarity": "0.20784023",
            "sentiment_compound": -0.5106
        },
        {
            "id": "i2y33op",
            "score": 32,
            "text": "now can they please do that for epi pens so i dont have to be terrified where some asshole hid sunflower seeds.",
            "title_similarity": "0.23271081",
            "sentiment_compound": -0.4767
        },
        {
            "id": "i2y38v0",
            "score": 1,
            "text": "Such good news",
            "title_similarity": "-0.19819842",
            "sentiment_compound": 0.4404
        },
        {
            "id": "i2y3a7j",
            "score": 1,
            "text": "Still so wrong on so many levels that diabetics (and other people with chronic illnesses) should have to pay to survive. It’s health discrimination.",
            "title_similarity": "0.3049074",
            "sentiment_compound": -0.7902
        },
        {
            "id": "i2y3ccl",
            "score": 1,
            "text": "I had to buy people grade insulin (it's for my cat) for the first time ever recently and holy shit it's expensive. And soon as you tell a pharmacy it's for a pet, none of the discounts work. And trying to use my health insurance is wildly illegal I'm sure. So I wonder, would this work for my cat?",
            "title_similarity": "0.55200636",
            "sentiment_compound": -0.7096
        },
        {
            "id": "i2y3ec6",
            "score": 5,
            "text": "I buy insulin for my diabetic cat in Canada.  I don't even need a prescription. $35/vial. For him that lasts months.",
            "title_similarity": "0.7149558",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2y3q8p",
            "score": 3,
            "text": "Text of the bill https://www.congress.gov/bill/117th-congress/house-bill/6833/text?r=14&s=1",
            "title_similarity": "0.38975173",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2y408p",
            "score": 1,
            "text": "there are a lot of diabetic republicans",
            "title_similarity": "0.30596358",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2y4192",
            "score": 14,
            "text": "This would have saved my dad's life.",
            "title_similarity": "0.15810291",
            "sentiment_compound": 0.4215
        },
        {
            "id": "i2y48k2",
            "score": 2,
            "text": "What's the reasoning behind their voting against this bill?",
            "title_similarity": "0.36984187",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2y49bg",
            "score": 1,
            "text": "In the Uk all diabetic treatment and medicine is free.",
            "title_similarity": "0.31156275",
            "sentiment_compound": 0.5106
        },
        {
            "id": "i2y4avv",
            "score": 1,
            "text": "How much does it cost in the USA usually?",
            "title_similarity": "0.3558704",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2y4eu8",
            "score": 2,
            "text": "That’s 35 bucks too high. Imagine putting a price on living",
            "title_similarity": "0.59225494",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2y4g6b",
            "score": 2,
            "text": "I will be genuinely surprised if republicans or conservative democrats don't kill it in the Senate.",
            "title_similarity": "0.4706868",
            "sentiment_compound": 0.6846
        },
        {
            "id": "i2y4jgm",
            "score": 1,
            "text": "Sometimes, profits aren't everything.",
            "title_similarity": "-0.0011940189",
            "sentiment_compound": 0.4404
        },
        {
            "id": "i2y4nfg",
            "score": 2,
            "text": "Still has to pass congress",
            "title_similarity": "0.29792684",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2y4nmx",
            "score": 3,
            "text": "This is only a cap for those who are already insured. The uninsured who are rationing insulin will be 100% unaffected by this bill. As always our congresspeople are eager to kick those who are already down.",
            "title_similarity": "0.4845205",
            "sentiment_compound": 0.3612
        },
        {
            "id": "i2y4obj",
            "score": 2,
            "text": "But what about the Senate?",
            "title_similarity": "0.27452216",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2y4r15",
            "score": 22,
            "text": "Democrats* pass bill to limit cost of insulin to $35 a month",
            "title_similarity": "0.966305",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2y4tf7",
            "score": 1,
            "text": "How about fine then for back profits",
            "title_similarity": "0.15431184",
            "sentiment_compound": 0.5719
        },
        {
            "id": "i2y4vyy",
            "score": 3,
            "text": "I can't wait to hear Manchins excuses this time.",
            "title_similarity": "0.08447926",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2y4zon",
            "score": 3,
            "text": "I am a type 1 diabetic. My insulin is around 700 dollars before insurance. This is a medicine I need to survive.",
            "title_similarity": "0.7010075",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2y50sy",
            "score": 2,
            "text": "Finally, something positive in the news. Hopefully, the Senate passes it, too.",
            "title_similarity": "0.25190645",
            "sentiment_compound": 0.743
        },
        {
            "id": "i2y52cz",
            "score": 1,
            "text": "Can someone please show me where to find the list of votes yay or nay?",
            "title_similarity": "0.21948464",
            "sentiment_compound": 0.6908
        },
        {
            "id": "i2y57r8",
            "score": 1,
            "text": "Now, they should do it like sweden. We have a thing roughly translated to \"yearly high cost protection\". First 120 dollars we spend is msrp. From 120 to 229, we get 50% off. If we pay over 580 on a year, the rest is free.\n\nIf sweden can do it, so can usa.\n\nAtleast that",
            "title_similarity": "0.63759875",
            "sentiment_compound": 0.6597
        },
        {
            "id": "i2y5jxh",
            "score": 2,
            "text": "This is fantastic.",
            "title_similarity": "-0.21554354",
            "sentiment_compound": 0.5574
        },
        {
            "id": "i2y5uc4",
            "score": 1,
            "text": "I knew of someone who died because he could no longer afford his insulin.",
            "title_similarity": "0.51867235",
            "sentiment_compound": -0.7003
        },
        {
            "id": "i2y5w3y",
            "score": 1,
            "text": "This iscomplicated",
            "title_similarity": "-0.11322724",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2y6anq",
            "score": 2,
            "text": "I’m guessing the senate will not let this go through.",
            "title_similarity": "0.27871132",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2y6iqp",
            "score": 2,
            "text": "Is anyone else just waiting for the bad news? This is America after all",
            "title_similarity": "0.22197564",
            "sentiment_compound": -0.5423
        },
        {
            "id": "i2y6ox7",
            "score": 3,
            "text": "But will the senators who have been lobbied show themselves",
            "title_similarity": "0.32549524",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2y6qtb",
            "score": 1,
            "text": "Fuck yeah!",
            "title_similarity": "-0.11911833",
            "sentiment_compound": -0.3802
        },
        {
            "id": "i2y6tko",
            "score": 2,
            "text": "Work of Devil this is. \n\nFeed humans volumes of sugar in everything as its addictive and thus,  profitable for corporate world.\n\nConsequently Humans become incapable of being productive for corporate greed due to various illnesses. \n\nIt costs more to treat humans, So, Instead suck the last dollars out of them by price gauging the only life saving drug there is, Insulin. \n\nWelcome to Greedy Capitalism 101.\n\n[https://www.youtube.com/watch?v=nxyxcTZccsE](https://www.youtube.com/watch?v=nxyxcTZccsE)",
            "title_similarity": "0.46856984",
            "sentiment_compound": -0.8619
        },
        {
            "id": "i2y6uxr",
            "score": 2,
            "text": "Can someone explain any of the reasons that some of the 193 republicans who voted against it gave? I’m genuinely curious what the could have said to justify it.",
            "title_similarity": "0.37071386",
            "sentiment_compound": 0.3182
        },
        {
            "id": "i2y7197",
            "score": 2,
            "text": "And somehow republican politicians will convince poor white Americans and other types of conservatives that this is against their best interests",
            "title_similarity": "0.384893",
            "sentiment_compound": 0.6249
        },
        {
            "id": "i2y74ne",
            "score": 2,
            "text": "Watch the republicans scream about the free market.",
            "title_similarity": "0.31166506",
            "sentiment_compound": 0.1531
        },
        {
            "id": "i2y775y",
            "score": 2,
            "text": "Insulin isn’t the only thing that diabetics need to have a good quality of life. They need the equipment that delivers the insulin and that stuff is way less technological than iPhones but cost 3x as much. Just having cheap insulin is not going to help 100%. But damn is it important. If we can’t pass something like this, then the system is just unfixable.",
            "title_similarity": "0.43977576",
            "sentiment_compound": -0.0096
        },
        {
            "id": "i2y7ot5",
            "score": 3,
            "text": "Holy fuck politicians do something good for once?",
            "title_similarity": "0.21153136",
            "sentiment_compound": -0.1531
        },
        {
            "id": "i2y7wpe",
            "score": 9,
            "text": "I literally don’t understand how someone can say at a meeting at a pharma Corp “let’s jack the prices to the point where we are killing people”\n\nThese people are actually sociopaths",
            "title_similarity": "0.36127067",
            "sentiment_compound": -0.6597
        },
        {
            "id": "i2y853v",
            "score": 1,
            "text": "Based? Like the only decent news and it’s like basic shit.",
            "title_similarity": "0.11068909",
            "sentiment_compound": 0.1027
        },
        {
            "id": "i2y87k5",
            "score": 1,
            "text": "For pets as well?",
            "title_similarity": "-0.03879602",
            "sentiment_compound": 0.2732
        },
        {
            "id": "i2y94aw",
            "score": 1,
            "text": "Best news in some time",
            "title_similarity": "0.030909847",
            "sentiment_compound": 0.6369
        },
        {
            "id": "i2y9a35",
            "score": 1,
            "text": "What are the supposedly \"valid\" arguments to not lower the cost?",
            "title_similarity": "0.092818074",
            "sentiment_compound": -0.2052
        },
        {
            "id": "i2ya1m1",
            "score": 1,
            "text": "Libertarian/Capitalist here.\n\nThe prices on these life-saving treatments are egregious, and you can't prop up capitalism if everyone is dead. It's a symbiotic circle for the survival of the economy.\n\nOn its face, I say go for it.",
            "title_similarity": "0.43663004",
            "sentiment_compound": -0.6486
        },
        {
            "id": "i2ya3je",
            "score": 3,
            "text": "Be nice if it passed the senate but I have my doubts. If only bombs and fighter jets were diabetic",
            "title_similarity": "0.48150477",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2ya5dg",
            "score": 1,
            "text": "This is great news! Way past due.",
            "title_similarity": "-0.013462141",
            "sentiment_compound": 0.6588
        },
        {
            "id": "i2yacj6",
            "score": 5,
            "text": "Now name and shame the people who voted against it.",
            "title_similarity": "0.33894685",
            "sentiment_compound": -0.4767
        },
        {
            "id": "i2yaixc",
            "score": 3,
            "text": "As a diabetic, I spend $115 per month on insulin with Insurance. This would be game changing. For the folks who want to shoot this down because it doesn’t punish pharmaceutical companies enough, who cares!\n\nFor comparison, I would get the same brand of insulin shipped to me by my family in Egypt for $25...",
            "title_similarity": "0.7511885",
            "sentiment_compound": -0.4199
        },
        {
            "id": "i2yarmz",
            "score": 3,
            "text": "How sad is our country that we need a law to protect us from the wealthy? Shouldn't there be laws against rigging the price for food, medicine, water, air, and shelter? How do you sleep at night knowing someone died for no other reason than your greed? The law should also limit the pay of Pharmaceutical executives too.",
            "title_similarity": "0.49568617",
            "sentiment_compound": -0.8146
        },
        {
            "id": "i2yaw0x",
            "score": 2,
            "text": "Me living in a country where everything health related is free, but in rare cases you need to pay a small amount: *WHAT?*",
            "title_similarity": "0.2928704",
            "sentiment_compound": 0.1406
        },
        {
            "id": "i2yayaj",
            "score": 1,
            "text": "I just read an interesting article about this, trying to find some line of reasoning or justification on the GOPs side To make it make sense. I didn't walk away from the article with that, the reasons cited smelled like bullshit to me, however I did get a perspective on the bill that I didn't have beforehand. Apparently this only places a cap on our out of pocket, but it doesn't change how much money big pharmaceutical companies are charging for the insulin? So, we're going to spend 35 dollars, but our insurance is going to pay for the rest of the original cost. . . Which will eventually lead to higher monthly premiums? I still think multi million dollar insurance companies should foot that bill certainly and it didn't mention to what degree premiums may rise. But . . . It does beg the question, why the hell don't we cap the percentage profit that MANUFACTURERS can reap from life saving insulin?\n\n[article](https://www.google.com/amp/s/www.politico.com/news/2022/03/31/house-passes-insulin-bill-00022073%3f_amp=true)\n\nThe article, if you're interested. I don't know anything about the biases or validity of politico",
            "title_similarity": "0.6336916",
            "sentiment_compound": 0.7343
        },
        {
            "id": "i2yb1xr",
            "score": 1,
            "text": "What reasoning did Republicans give on why they voted against it?",
            "title_similarity": "0.37310955",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2ybmen",
            "score": 8,
            "text": "We are the only country that does NOT negotiate pricing with Big Pharma, yet other countries get cheaper med cost when drug are manufacture in the US. I just do not understand this at all.",
            "title_similarity": "0.43594992",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2ybmk1",
            "score": 1,
            "text": "Huge! We need to stomp corporate pricing. Its such a fucking ripoff.",
            "title_similarity": "0.2885748",
            "sentiment_compound": 0.3802
        },
        {
            "id": "i2yc5sy",
            "score": 3,
            "text": "What I find most interesting is that this doesn't change the price of insulin itself just the amount that the prescribed individual has to pay. The company can still charge whatever they want for the insulin but the insurance company or uninsured individual cannot be charged more than $35 or 25% of the negotiated price, whichever is lower. So the company is still getting their money... That seems so fucked up to me. Cost next to nothing to make but have profit margins so insane that it is hard to fathom. I know this would never have Republican support but why not just cap the actual price of the insulin itself? Real question not assuming it's as feasible or as easy as the words being typed into Reddit lol",
            "title_similarity": "0.556916",
            "sentiment_compound": -0.7155
        },
        {
            "id": "i2ycb0g",
            "score": 2,
            "text": "House with most Republicans voting against the legislation.",
            "title_similarity": "0.5156774",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2ychax",
            "score": 4,
            "text": "Should be free",
            "title_similarity": "-0.15913893",
            "sentiment_compound": 0.5106
        },
        {
            "id": "i2ycndn",
            "score": 1,
            "text": "Is this an april fools? Did USA just vote pass a bill that acually helps a majority of its citizens?",
            "title_similarity": "0.5734515",
            "sentiment_compound": -0.2406
        },
        {
            "id": "i2ycrz3",
            "score": 1,
            "text": "Republicans: No deal! \n\n*should it pass despite their marauding*\n\n“We’re so glad to get this passed. You’re welcome.”",
            "title_similarity": "0.14813377",
            "sentiment_compound": 0.4512
        },
        {
            "id": "i2ycsoa",
            "score": 3,
            "text": "Rephrase… Democrats pass bill",
            "title_similarity": "0.41838276",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2yd9vh",
            "score": 1,
            "text": "The price to live",
            "title_similarity": "0.14732638",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2yde06",
            "score": 1,
            "text": "Basically we’ll see everybody’s true colors as far as the people’s health",
            "title_similarity": "0.090454414",
            "sentiment_compound": 0.4215
        },
        {
            "id": "i2ydsl7",
            "score": 1,
            "text": "We're there any things piggybacked on this bill?",
            "title_similarity": "0.23439279",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2ye906",
            "score": 1,
            "text": "This is good!",
            "title_similarity": "-0.2608128",
            "sentiment_compound": 0.4926
        },
        {
            "id": "i2yep0a",
            "score": 2,
            "text": "\"We all share the goal of reducing the cost of insulin,” said Representative Cathy McMorris Rodgers of Washington, the top Republican on the House Energy and Commerce Committee. “This bill, however, is not the right answer\"\n\nSo let's vote against even this starting move that would help 30 million Americans. Jesus",
            "title_similarity": "0.68136054",
            "sentiment_compound": 0.7783
        },
        {
            "id": "i2yet0e",
            "score": 1,
            "text": "About blody time but still to damn high",
            "title_similarity": "0.13090426",
            "sentiment_compound": -0.5499
        },
        {
            "id": "i2yetfl",
            "score": 2,
            "text": "House Democrats pass bill to limit cost of life saving insulin to $35 a month...fixed\n\nAll the House Republicans voted against making life-saving affordable for Americans.",
            "title_similarity": "0.88970137",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2yexvh",
            "score": 1,
            "text": "What a damn shame....The party of \"God,\" right? What a crock of shit. This world is never going to get any better no matter what. There's no difference between the statue of liberty and the pyramids in Egypt, we're nearly all slaves. Only thing keeping me going is knowing one day I'll be able to rest forever and permanently be exempt from any of this for the rest of existence.",
            "title_similarity": "0.33879268",
            "sentiment_compound": 0.4453
        },
        {
            "id": "i2yf1xr",
            "score": 1,
            "text": "Yay now time to watch it die in the senate... I dont even get why this is news, you can pass a million things in the house but it doesn't mean shit cause the senate will just vote along party lines and you can literally tell if something is gonna pass by just looking at how many Dems and Republicans there are in the senate. What a fucking joke.",
            "title_similarity": "0.53489435",
            "sentiment_compound": 0.8866
        },
        {
            "id": "i2yf253",
            "score": 1,
            "text": "No, they limited the copay. Insulin can still cost $1000 a month without insurance",
            "title_similarity": "0.70576525",
            "sentiment_compound": -0.2263
        },
        {
            "id": "i2yf9qe",
            "score": 2,
            "text": "No chance this passes lol. This country is rotten",
            "title_similarity": "0.061961565",
            "sentiment_compound": -0.3049
        },
        {
            "id": "i2yfenh",
            "score": 1,
            "text": "As a type 1 diabetic, this is the best news ive ever heard",
            "title_similarity": "0.32468987",
            "sentiment_compound": 0.6369
        },
        {
            "id": "i2yfev9",
            "score": 2,
            "text": "We'll see how pro-life the GOP Senators truly are.",
            "title_similarity": "0.26636633",
            "sentiment_compound": 0.4404
        },
        {
            "id": "i2yfncn",
            "score": 1,
            "text": "Man this would be perfect",
            "title_similarity": "-0.1781294",
            "sentiment_compound": 0.5719
        },
        {
            "id": "i2yftau",
            "score": 1,
            "text": "As a minimum?",
            "title_similarity": "-0.051794782",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2yftbe",
            "score": 2,
            "text": "If you are diabetic, or have any medical problem, and you vote for republicans: you know what you are. I don't have to say it, because apparently you can get banned from reddit for saying \\~meaaan wooords\\~\\~\\~",
            "title_similarity": "0.47383708",
            "sentiment_compound": -0.6908
        },
        {
            "id": "i2yfxlo",
            "score": 3,
            "text": "192  Republicans voted against it!",
            "title_similarity": "0.42462474",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2yfy28",
            "score": 2,
            "text": "Am I missing something here? Limiting the price is the best thing to do, why would republicans vote against this? Why do they keep voting against undeniably good ideas? The only things I can think of is that democrats keep putting something else in these bills that republicans are extremely against (idc to read the bills myself tbh), republicans are just against anything democrats do (likely), or $$$ up their asses (even more likely)",
            "title_similarity": "0.46814314",
            "sentiment_compound": 0.7536
        },
        {
            "id": "i2yggqc",
            "score": 1,
            "text": "So the pharma corpos are gonna lose money? Thats devastating",
            "title_similarity": "0.40419015",
            "sentiment_compound": -0.7906
        },
        {
            "id": "i2ygjw5",
            "score": 5,
            "text": "\"house\" should say \"democrats\" as 193 republicans voted against people having affordable medication so they won't die",
            "title_similarity": "0.5503416",
            "sentiment_compound": 0.5283
        },
        {
            "id": "i2ygl5s",
            "score": 1,
            "text": "Only for it to die in the senate",
            "title_similarity": "0.46489033",
            "sentiment_compound": -0.5994
        },
        {
            "id": "i2ygpv0",
            "score": 1,
            "text": "Republicans:  “April fools!”",
            "title_similarity": "0.32774246",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2ygral",
            "score": 3,
            "text": "A wonderful friend of mine who was a brilliant singer and songwriter died because he couldn't afford insulin. Fuck everyone who voted against this.",
            "title_similarity": "0.46224526",
            "sentiment_compound": 0.8735
        },
        {
            "id": "i2ygse7",
            "score": 2,
            "text": "It’s not gonna pass in the senate and republicans are going to say, “we didn’t vote for it because the price was not low enough.” Just to try to make people think they’re the good guys.",
            "title_similarity": "0.39587086",
            "sentiment_compound": 0.5739
        },
        {
            "id": "i2yguwx",
            "score": 1,
            "text": "Does this cap the price companies can charge for insulin or how much customers can pay for insulin?\n\nIf it's the former, then wouldn't this just result in higher premiums for everyone as insurance companies push the price increase onto customers?",
            "title_similarity": "0.53683996",
            "sentiment_compound": 0.3094
        },
        {
            "id": "i2ygyz7",
            "score": 2,
            "text": "Not American and the article site is ass, does this mean that it is law now and all states have to comply or does it have to go through more processes?",
            "title_similarity": "0.27124947",
            "sentiment_compound": -0.5423
        },
        {
            "id": "i2yhsy2",
            "score": 1,
            "text": "about god damn time, did the murder party get a bit boring??",
            "title_similarity": "0.43963173",
            "sentiment_compound": -0.7399
        },
        {
            "id": "i2yhtpb",
            "score": 1,
            "text": "https://telegr.im/+ZFRnItoS3MdjM2Vh",
            "title_similarity": "0.12951101",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2yhw2f",
            "score": 1,
            "text": "Eu citizen here, is this okay or it costs too much anyway?",
            "title_similarity": "0.2847311",
            "sentiment_compound": 0.2789
        },
        {
            "id": "i2yi41i",
            "score": 2,
            "text": "Will it pass the Senate though?\n\nMore importantly, will the voters punish the politicians who voted against it?",
            "title_similarity": "0.5005993",
            "sentiment_compound": -0.2885
        },
        {
            "id": "i2yihyj",
            "score": 2,
            "text": "All those republicans that voted No ,against this bill isn’t Shocking",
            "title_similarity": "0.35619244",
            "sentiment_compound": -0.5994
        },
        {
            "id": "i2yiji0",
            "score": 2,
            "text": "Now lets do inhalers. Also fuck the people who voted against this",
            "title_similarity": "0.39359605",
            "sentiment_compound": -0.5423
        },
        {
            "id": "i2yip5q",
            "score": 2,
            "text": "Now let's make infusion sites, reservoirs, glucose monitors and transmitters equally as affordable",
            "title_similarity": "0.16745546",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2yiuew",
            "score": 4,
            "text": "daily reminder republicans are anti american",
            "title_similarity": "0.3632015",
            "sentiment_compound": -0.3182
        },
        {
            "id": "i2ykgj9",
            "score": 1,
            "text": "The problem with the US government is that the senate can actually take this bill, gut it, and repurpose it because it passed in the house, and vice versa.",
            "title_similarity": "0.47497174",
            "sentiment_compound": -0.4019
        },
        {
            "id": "i2ykp24",
            "score": 1,
            "text": "If we could just pass a form of single payer to phase in. In both chambers ...",
            "title_similarity": "0.2919491",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2yksul",
            "score": 1,
            "text": "approximately how much it used to be ?",
            "title_similarity": "0.06799285",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2yl7dt",
            "score": 1,
            "text": "Ok, ok now what?? Come on , keep it going…gotta do something else now……..gotta get things passed.",
            "title_similarity": "0.08354976",
            "sentiment_compound": 0.3736
        },
        {
            "id": "i2yldws",
            "score": 1,
            "text": "This makes too much sense.... DENIED",
            "title_similarity": "-0.11794811",
            "sentiment_compound": -0.5622
        },
        {
            "id": "i2ym03v",
            "score": 1,
            "text": "Very slow clap?",
            "title_similarity": "0.01231362",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2ym2b9",
            "score": 1,
            "text": "Stuff like this is why I can’t fathom why lower/middle class vote Republican when Democrats passed it.",
            "title_similarity": "0.45365378",
            "sentiment_compound": 0.3612
        },
        {
            "id": "i2ym4te",
            "score": 1,
            "text": "Will never pass the Senate.",
            "title_similarity": "0.28582966",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2ym5za",
            "score": 1,
            "text": "https://youtu.be/tblvX4wdf5w",
            "title_similarity": "0.13040885",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2ymk96",
            "score": 1,
            "text": "America’s medical care really needs some work holy fuck. Any other developed country will either give you insulin for free or charge you pennies for it.",
            "title_similarity": "0.5002794",
            "sentiment_compound": 0.4588
        },
        {
            "id": "i2yniqp",
            "score": 1,
            "text": "That sounds fantastic. We should have the government limit the prices of food too.\n\n🤡",
            "title_similarity": "0.51208663",
            "sentiment_compound": 0.5574
        },
        {
            "id": "i2ynnn9",
            "score": 1,
            "text": "Some good news",
            "title_similarity": "-0.16422656",
            "sentiment_compound": 0.4404
        },
        {
            "id": "i2yo6pp",
            "score": 1,
            "text": "What else is in the bill?",
            "title_similarity": "0.11157132",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2yoido",
            "score": 1,
            "text": "About fucking time.",
            "title_similarity": "0.014745692",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2yop3e",
            "score": 1,
            "text": "I read it as jiz. Nasty republicans",
            "title_similarity": "0.23144254",
            "sentiment_compound": -0.5574
        },
        {
            "id": "i2ypcu8",
            "score": 1,
            "text": "I looked and surprisingly r/conservative is in favour of this",
            "title_similarity": "0.11293477",
            "sentiment_compound": 0.6249
        },
        {
            "id": "i2yq9fp",
            "score": 1,
            "text": "Hope it passes. \nIn the meantime, stop eating anything sweet.",
            "title_similarity": "0.21418503",
            "sentiment_compound": 0.5719
        },
        {
            "id": "i2yqbdg",
            "score": 1,
            "text": "I really just want to say here that one of the sweetest girls I know is a diabetic, and to think that she had to pay so ungodly much just to live is beyond me. She is a *literal* ray of sunshine and is always smiling and asking people if they’re okay. Thank goodness for this.",
            "title_similarity": "0.31158525",
            "sentiment_compound": 0.9149
        },
        {
            "id": "i2yqkm8",
            "score": 1,
            "text": "Single Payer. Congress is greedy and not working for the American people. Why just this one drug? Single Payer would reduce costs across the board, and stop letting private insurance companies game the system for higher profits. No more making profits off of people's mortality. Enough is enough.",
            "title_similarity": "0.45844486",
            "sentiment_compound": 0.0972
        },
        {
            "id": "i2yqsr0",
            "score": 1,
            "text": "This is a win for the people, should be free, but this is an overall win.",
            "title_similarity": "0.047671482",
            "sentiment_compound": 0.8674
        },
        {
            "id": "i2yqwde",
            "score": 3,
            "text": "DO NOT EVER FORGET THAT 193 REPUBLICANS VOTED AGAINST THIS. LET THE WORLD KNOW",
            "title_similarity": "0.4027431",
            "sentiment_compound": 0.2979
        },
        {
            "id": "i2yqwdu",
            "score": 1,
            "text": "What price is this coming down from? Limiting to 35 dollars, these companies are still going to be making a lot of money.",
            "title_similarity": "0.63835144",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2yr1o9",
            "score": 1,
            "text": "When does it get signed into law? Oh, never? Thanks Senate!",
            "title_similarity": "0.45565617",
            "sentiment_compound": -0.4692
        },
        {
            "id": "i2yrb3p",
            "score": 1,
            "text": "So the biggest economy can't afford giving people free insulin? I don't understand.\n\nIn many EU countries you are getting it for free, I mean some people need it the same way all of us need water.",
            "title_similarity": "0.55084413",
            "sentiment_compound": 0.6771
        },
        {
            "id": "i2yri9u",
            "score": 2,
            "text": "*democrats passed",
            "title_similarity": "0.29082966",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2yrori",
            "score": 1,
            "text": "So will insurance premiums go up just to cover this? Seems like it could be a wash if you have to pay higher insurance cost.",
            "title_similarity": "0.34066522",
            "sentiment_compound": 0.2732
        },
        {
            "id": "i2yrr5q",
            "score": 1,
            "text": "\"Nah, just kidding, April fools!\" - Republica  reps",
            "title_similarity": "0.27890274",
            "sentiment_compound": -0.5411
        },
        {
            "id": "i2yrvrt",
            "score": 1,
            "text": "Too bad it won’t gain any traction in the senate.",
            "title_similarity": "0.30610824",
            "sentiment_compound": -0.0258
        },
        {
            "id": "i2yrw90",
            "score": 1,
            "text": "Democrats pass bill with ZeRo help from Republicunts.",
            "title_similarity": "0.4355756",
            "sentiment_compound": 0.4019
        },
        {
            "id": "i2ys019",
            "score": 1,
            "text": "But how will the Big Pharma CEOs pay for their private jets and mistresses?\n\nWon't anyone think of the Big Pharma CEOs?!!!",
            "title_similarity": "0.5138658",
            "sentiment_compound": -0.4284
        },
        {
            "id": "i2ys6km",
            "score": 1,
            "text": "This is obviously America  we do it different.",
            "title_similarity": "0.12484824",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2ystam",
            "score": 1,
            "text": "Let the messaging bills begin! I’m surprised it’s taken this long. We need to have the House continue to pass the most popular parts of BBB and show the country how the Republicans in the Senate shoot them down. Let them fight their culture wars but billboards need to go up around the nation showing how awful their policy positions are.",
            "title_similarity": "0.4791774",
            "sentiment_compound": -0.7647
        },
        {
            "id": "i2yt048",
            "score": 1,
            "text": "Right after my dad dies from diabetes related complications at 55. Cool. God Ble$$ America. 💀",
            "title_similarity": "0.7303242",
            "sentiment_compound": 0.5267
        },
        {
            "id": "i2yt5he",
            "score": 1,
            "text": "Absolutely appalling.  How else is big pharma gonna rape the poor now.  I will lose so much sleep knowing that the rich will have to suffer through this.  Makes me puke.",
            "title_similarity": "0.36317858",
            "sentiment_compound": -0.9485
        },
        {
            "id": "i2ytxyc",
            "score": 1,
            "text": "As an Australian looking from the outside, I can't believe how much pharmaceutical companies are fucking Americans over. It's absolutely absurd how much critical pharmaceuticals can cost even with insurance",
            "title_similarity": "0.38727412",
            "sentiment_compound": -0.3182
        },
        {
            "id": "i2yu0uq",
            "score": 2,
            "text": "It's utterly crazy that at this point people don't realize govt caused this so cannot fix it, remove the ip/patent laws causing the problem don't try to have govts impose more laws with unintended consequences that don't work, to try and fix the problems they caused in the first place... We live in a clown world run by imbeciles and sociopaths known as politicians",
            "title_similarity": "0.27316537",
            "sentiment_compound": -0.8516
        },
        {
            "id": "i2yucll",
            "score": 1,
            "text": "Insufficient amount its less than happy meal price in Mcdonald",
            "title_similarity": "0.30643934",
            "sentiment_compound": 0.5302
        },
        {
            "id": "i2yujyf",
            "score": 1,
            "text": "Many lower middle class republicans need this insulin pricing but will still vote for a republican that is actively trying to kill them.",
            "title_similarity": "0.5077009",
            "sentiment_compound": -0.7351
        },
        {
            "id": "i2yukpp",
            "score": 1,
            "text": "Wow, america catching up to Europe with insulin cost like that....stupid this had to be a bill",
            "title_similarity": "0.51505387",
            "sentiment_compound": 0.743
        },
        {
            "id": "i2yumh5",
            "score": 1,
            "text": "This is good, very good.\n\nEdit.  I started reading the article if it only helps 1 in 5 Americans with diabetes then its a tiny start that does not do much.  Yes it helps the poor but do people think middle class is rich?",
            "title_similarity": "0.5847469",
            "sentiment_compound": 0.8346
        },
        {
            "id": "i2yvtis",
            "score": 1,
            "text": "Ending patents would do that and the same for many other medicines and tech",
            "title_similarity": "0.33187845",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2yvtwo",
            "score": 1,
            "text": "Thought I was going to be Rick Roll’d when I tapped the link 😂",
            "title_similarity": "0.2735076",
            "sentiment_compound": 0.4404
        },
        {
            "id": "i2yvv7e",
            "score": 2,
            "text": "It’s simple; they justify voting against this by saying that with insurance, the cost is already at or below that. Which essentially means that without insurance, you are being punished with insane price margins. Why do they do this? Because the insurance companies pay our politicians to do this. It’s the same with health care as well. Blatant corruption.",
            "title_similarity": "0.48745912",
            "sentiment_compound": -0.2023
        },
        {
            "id": "i2yvyvk",
            "score": 1,
            "text": "This is the only path to affordable health care. I believe in capitalism but the greed of these companies with something so vital to many people is outrageous. Keep going Congress.",
            "title_similarity": "0.39929107",
            "sentiment_compound": -0.3921
        },
        {
            "id": "i2ywlet",
            "score": 1,
            "text": "That took way to long",
            "title_similarity": "0.03372614",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2ywn6n",
            "score": 1,
            "text": "This will die in the Senate.  Mitch McConnell wants people mourning preventable deaths that he can try to blame on Joe Biden.  And Republicans love Mitch for it.  Because they're evil and deserve nothing but the suffering they willfully inflict on others.",
            "title_similarity": "0.39343688",
            "sentiment_compound": -0.2189
        },
        {
            "id": "i2ywpfz",
            "score": 1,
            "text": "The solution is to outlaw grey markets. If not all grey markets, then pharmaceutical grey markets. Let the rest of the world pay their fair share.",
            "title_similarity": "0.41660494",
            "sentiment_compound": 0.686
        },
        {
            "id": "i2ywpkj",
            "score": 2,
            "text": "Schematic and list of how they [voted](https://www.govtrack.us/congress/votes/117-2022/h102). BTW, Fuck you Tim Walberg.",
            "title_similarity": "0.4780121",
            "sentiment_compound": -0.5423
        },
        {
            "id": "i2yx764",
            "score": 1,
            "text": "Oh no I'm sorry we've checked your test results and it turns you now need Insu*like*&trade;.",
            "title_similarity": "0.36665866",
            "sentiment_compound": -0.2448
        },
        {
            "id": "i2yxbx0",
            "score": 1,
            "text": "Senate rejects it in 3…2…1…",
            "title_similarity": "0.4029459",
            "sentiment_compound": -0.4939
        },
        {
            "id": "i2yxhb1",
            "score": 2,
            "text": "If these things pass, Joe Biden’s legacy will be passing bills that everybody wants",
            "title_similarity": "0.3373459",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2yxmlj",
            "score": 1,
            "text": "How many republicans voted against this?",
            "title_similarity": "0.4401236",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2yxoii",
            "score": 1,
            "text": "It’s unbelievable how it took this long to make a life saving drug affordable to the public. Humans suck",
            "title_similarity": "0.30916616",
            "sentiment_compound": -0.2732
        },
        {
            "id": "i2yxtay",
            "score": 1,
            "text": "what kind of ghoul would vote against something like this",
            "title_similarity": "0.24023984",
            "sentiment_compound": 0.3612
        },
        {
            "id": "i2yy0yj",
            "score": 1,
            "text": "What company would produce or sell the new version with the new injector of insulin in america then? \n\nKeep in mind, we in europe use the old patentfree version of insulin, this is why its so cheap.",
            "title_similarity": "0.4078184",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2yybnb",
            "score": 2,
            "text": "Even more than permanent daylight saving time, this should have unanimous passage in the Senate. I doubt it will.",
            "title_similarity": "0.40450186",
            "sentiment_compound": -0.3612
        },
        {
            "id": "i2yz78t",
            "score": 2,
            "text": "What if instead of doing that for one drug/illness we do it for the entire system?",
            "title_similarity": "0.30165693",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2yz9ff",
            "score": 1,
            "text": "There's a lot of money to be made from keeping you sick",
            "title_similarity": "0.30971813",
            "sentiment_compound": -0.5106
        },
        {
            "id": "i2yzka9",
            "score": 2,
            "text": "House democrats*",
            "title_similarity": "0.34321386",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2yzm77",
            "score": 2,
            "text": "GOP will kill it in the senate",
            "title_similarity": "0.42975944",
            "sentiment_compound": -0.6908
        },
        {
            "id": "i2yzug3",
            "score": 1,
            "text": "You would think republicans would want their constituents to get their insulin so they can stay alive and keep voting for them but idk",
            "title_similarity": "0.44600323",
            "sentiment_compound": 0.09
        },
        {
            "id": "i2z003v",
            "score": 1,
            "text": "As someone getting their booster in the morning, please just tell me what’s the answer! Which one should I get?",
            "title_similarity": "0.24270412",
            "sentiment_compound": 0.3802
        },
        {
            "id": "i2z0hnm",
            "score": 1,
            "text": "It won't pass the senate",
            "title_similarity": "0.2697399",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2z0kie",
            "score": 1,
            "text": "Talk about taking a complex and deeply rooted systemic problem with our health care and propping a piece of plywood over it.",
            "title_similarity": "0.3181969",
            "sentiment_compound": 0.0609
        },
        {
            "id": "i2z0mmc",
            "score": 3,
            "text": "Arkansas is in the top 10 of states with the highest rates of diabetes. And all of our (R) reps voted against it. I guarantee I won't hear anybody bitching about it either. \n\nNow Hunter Biden's business deals, I'm sure I'll hear about that today.",
            "title_similarity": "0.56610197",
            "sentiment_compound": 0.7108
        },
        {
            "id": "i2z0phj",
            "score": 1,
            "text": "Damn how hard is to vote this? It is a clear choice… your people, your voters but I guess they prefer they supporters and lobbyists. I don’t know if can call US a democracy with this as example.",
            "title_similarity": "0.3233766",
            "sentiment_compound": 0.5574
        },
        {
            "id": "i2z0sgr",
            "score": 1,
            "text": "Fuck yes",
            "title_similarity": "-0.120430194",
            "sentiment_compound": -0.2023
        },
        {
            "id": "i2z0txd",
            "score": 1,
            "text": "Why do you pay for it if you have health insurance? What do you pay that for?",
            "title_similarity": "0.35518527",
            "sentiment_compound": -0.2869
        },
        {
            "id": "i2z13f3",
            "score": 1,
            "text": "People don't run for political office to work \"for the people.\"\n\nThey run for office so they can get paid by corporations to vote AGAINST legislation like this.",
            "title_similarity": "0.5210027",
            "sentiment_compound": 0.3612
        },
        {
            "id": "i2z16i8",
            "score": 1,
            "text": "Wow, we’ll soon be back to where it was a while ago under Trump",
            "title_similarity": "0.17276338",
            "sentiment_compound": 0.5859
        },
        {
            "id": "i2z19d8",
            "score": 1,
            "text": "Inaccurate headline. Democrats pass bill. Republicans don’t give one shit about people with Diabetes",
            "title_similarity": "0.49292988",
            "sentiment_compound": -0.5574
        },
        {
            "id": "i2z1acn",
            "score": 2,
            "text": "In Mexico one vial costs as little as 5 dollars for the generic ones. The fancy ones cost around 15 dollars",
            "title_similarity": "0.6064341",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2z1azk",
            "score": 1,
            "text": "This caps only insured patients costs.... and forces the insurance companies to pay the difference. \n\nThis is not the home run you all think it is. Our country is fucked when we all read headlines.",
            "title_similarity": "0.4419185",
            "sentiment_compound": -0.7003
        },
        {
            "id": "i2z1f20",
            "score": 1,
            "text": "This is sickening. Fuck republicans.",
            "title_similarity": "0.08707337",
            "sentiment_compound": -0.7845
        },
        {
            "id": "i2z1ia1",
            "score": 1,
            "text": "Own 193 Republicans with this one little trick!\n\nInsurance carriers HATE this!",
            "title_similarity": "0.2925591",
            "sentiment_compound": -0.7117
        },
        {
            "id": "i2z1msd",
            "score": 1,
            "text": "“April fools, haha we got our citizens so good”",
            "title_similarity": "0.1927557",
            "sentiment_compound": -0.0516
        },
        {
            "id": "i2z1mv3",
            "score": 1,
            "text": "Twist! The price doesn’t change, diabetics will only be allowed to purchase $35 worth of insulin, then figure out how to stretch it across the month",
            "title_similarity": "0.79186296",
            "sentiment_compound": 0.2942
        },
        {
            "id": "i2z1qrc",
            "score": 1,
            "text": "In walk sinema and manchin to stop it. For whatever reason they stop stuff..",
            "title_similarity": "0.23618358",
            "sentiment_compound": -0.5267
        },
        {
            "id": "i2z1s28",
            "score": 1,
            "text": "Does this also apply to people who are uninsured? THAT would be a game changer.",
            "title_similarity": "0.12734896",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2z1ua5",
            "score": 1,
            "text": "Question, how will this affect insulin for animals?",
            "title_similarity": "0.31648576",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2z20of",
            "score": 2,
            "text": "r/conservative 3 mental gymnastic routines and a punch in the head away from taking credit for this.",
            "title_similarity": "0.25522307",
            "sentiment_compound": 0.3818
        },
        {
            "id": "i2z2fj4",
            "score": 2,
            "text": "(For people with insurance)",
            "title_similarity": "0.047230467",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2z2kqq",
            "score": 2,
            "text": "It doesn't actually help the price for the uninsured who suffer the most from these prices.",
            "title_similarity": "0.18576494",
            "sentiment_compound": -0.6964
        },
        {
            "id": "i2z2mhg",
            "score": 2,
            "text": "*for those on insurance\n\nYet another way that bosses in the US can threaten your life if you refuse to be exploited.",
            "title_similarity": "0.3709327",
            "sentiment_compound": -0.7783
        },
        {
            "id": "i2z2ucy",
            "score": 2,
            "text": "And Just Like That…\n\n\nI’m sure the Senate will make this dicey",
            "title_similarity": "0.26404607",
            "sentiment_compound": 0.5859
        },
        {
            "id": "i2z2vgn",
            "score": 1,
            "text": "Seems like a step in the right direction!",
            "title_similarity": "-0.14330404",
            "sentiment_compound": 0.4199
        },
        {
            "id": "i2z37f4",
            "score": 1,
            "text": "Wow!",
            "title_similarity": "-0.20612091",
            "sentiment_compound": 0.6239
        },
        {
            "id": "i2z37rx",
            "score": 3,
            "text": "This means nothing to me until it’s signed into law",
            "title_similarity": "0.2208789",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2z39v4",
            "score": 2,
            "text": "Can’t wait to hear why Manchin and Sinema block it in the Senate.",
            "title_similarity": "0.4863417",
            "sentiment_compound": -0.4404
        },
        {
            "id": "i2z3shk",
            "score": 3,
            "text": "It is so incredibly *fucked* that, if this passes, this is seen as a good price for something that people literally need to not die. Often through no fault of their own.\n$35 is still a hefty monthly subscription.\n\nI live in Wales, where we don't pay for prescriptions at all. \n\nEven in England, you only pay £9.35 for a prescription. But you can pay for a Prescription Prepayment Certificate (PPC) if you need multiple prescriptions a month and you save money that way (a 12 month certificate is only £108.10).",
            "title_similarity": "0.6412506",
            "sentiment_compound": 0.6502
        },
        {
            "id": "i2z3zjj",
            "score": 2,
            "text": "That's nice. 193 Republicans voted against it and it will more than likely die in the Senate",
            "title_similarity": "0.5671822",
            "sentiment_compound": -0.3321
        },
        {
            "id": "i2z42zc",
            "score": 1,
            "text": "Unfortunately, I have to ask… is this an April Fools joke?",
            "title_similarity": "0.2528293",
            "sentiment_compound": -0.5267
        },
        {
            "id": "i2z460n",
            "score": 1,
            "text": "I’m betting now Manchin will be the one to filibuster this one.",
            "title_similarity": "0.20888335",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2z498d",
            "score": 1,
            "text": "So now I can do my blood test since the doctor worries I might have diabetes.",
            "title_similarity": "0.46538666",
            "sentiment_compound": -0.4215
        },
        {
            "id": "i2z4ls8",
            "score": 1,
            "text": "Inner thoughts while writing the bill \"how do we...make a miniscule change that doesn't impact the human sacrifice for the genocidal health insurance industry, I mean... they still have to feed on something...oh!!! 35 dollar insulin that will pass the cost onto the inusrance holder through higher premiums! I LOVE this idea! Let's pass it and act like inuslin is the only thing holding type 1 diabetics financially hostage! YES!!!\"",
            "title_similarity": "0.6923748",
            "sentiment_compound": 0.9191
        },
        {
            "id": "i2z4vf3",
            "score": 1,
            "text": "Now, let’s see how it’s gutted in the Senate, if it even passes. \n\nAs stated before, 193 Republicans voted against it. I honestly, can’t imagine any reason that would be >.>",
            "title_similarity": "0.51658297",
            "sentiment_compound": 0.4588
        },
        {
            "id": "i2z4xiz",
            "score": 1,
            "text": " all it did was take like 2 decades nice 👍",
            "title_similarity": "0.42281085",
            "sentiment_compound": 0.6486
        },
        {
            "id": "i2z54r4",
            "score": 1,
            "text": "A day late and a few dollars short for a lot of people and that’s if it even gets pushed over the finish line. Trash ass government.",
            "title_similarity": "0.5006054",
            "sentiment_compound": -0.5423
        },
        {
            "id": "i2z5hm6",
            "score": 1,
            "text": "And now it will die in the Senate, because the Senate's only purpose is to limit democracy.",
            "title_similarity": "0.44994694",
            "sentiment_compound": -0.5994
        },
        {
            "id": "i2z5q32",
            "score": 1,
            "text": "Holy crap! Yes!!!! Now do other insanely over priced price gouged drugs!!",
            "title_similarity": "0.21051532",
            "sentiment_compound": 0.3111
        },
        {
            "id": "i2z5vsm",
            "score": 1,
            "text": "Not american, but why would the republicans vote against it? \n\nWon't the people they serve kick off?",
            "title_similarity": "0.38754",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2z5yiq",
            "score": 1,
            "text": "The caps on medicine are great and I welcome the change of it gets passed, but I think that we need to look at all the other medical supplies that diabetics need.  \n\nWhat about the testing strips, the Dexcom patches and receivers and transmitters? What about the patches and tubes for pumps? Kqik pen needles for those who don’t have a pump yet? \n\nI would love to see caps on all of the other medical supplies I need to live with diabetes. I spend close to 50$ anyways on insulin, but nearly $270 for my monthly medical supplies, on top of my insurance premiums.",
            "title_similarity": "0.60693353",
            "sentiment_compound": 0.92
        },
        {
            "id": "i2z6158",
            "score": 1,
            "text": "This is the worst April fool’s post :( /s",
            "title_similarity": "0.33196658",
            "sentiment_compound": -0.7906
        },
        {
            "id": "i2z67c4",
            "score": 1,
            "text": "House disincentivizes production of insulin, news at 10:00.",
            "title_similarity": "0.6717931",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2z6a1r",
            "score": 1,
            "text": "and all Republicans voted against it?",
            "title_similarity": "0.40500557",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2z6cn2",
            "score": 1,
            "text": "You know then they will just start charging out the ass for needles and other stuff diabetics need. Its not just the insulin itself that's required.",
            "title_similarity": "0.41657087",
            "sentiment_compound": -0.5423
        },
        {
            "id": "i2z6g5b",
            "score": 1,
            "text": "Still too high, but I guess it's a start.",
            "title_similarity": "0.046091452",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2z6loj",
            "score": 1,
            "text": "I don’t understand why it was raised. Seems crazy to have to repeat this.",
            "title_similarity": "0.041279692",
            "sentiment_compound": -0.34
        },
        {
            "id": "i2z6neg",
            "score": 1,
            "text": "Unfortunately, this law is really just hiding the costs. And could actually make it easier for companies to raise the price of insulin. It doesn’t lower the price to 35$, it only caps the amount the person can pay at $35 and has the insurance company pay for the rest. This will most likely have the opposite effect of what’s intended and raise insulin prices on uninsured people. And with costs to insurance companies going up, they will probably just raise their premium.\n\nThe insulin crisis in 100% caused by no one standing up to greedy pharmaceutical companies, and it needs to be stopped, but this bill most likely will not end it and could make it worse.",
            "title_similarity": "0.66863257",
            "sentiment_compound": -0.8988
        },
        {
            "id": "i2z6y7h",
            "score": 1,
            "text": "Still expensive but affordable not thanks to the majority of Republicans who voted against.",
            "title_similarity": "0.37848708",
            "sentiment_compound": -0.4782
        },
        {
            "id": "i2z736q",
            "score": 1,
            "text": "Good. Trump had started the process before he was out and 46 rescinded that work",
            "title_similarity": "0.37855566",
            "sentiment_compound": 0.4404
        },
        {
            "id": "i2z78z3",
            "score": 1,
            "text": "Meanwhile, my insulin pump supplies and the rest of my type 1 diabetes related shit top out at nearly 500 a month even after insurance.",
            "title_similarity": "0.6866302",
            "sentiment_compound": -0.4215
        },
        {
            "id": "i2z7f9z",
            "score": 1,
            "text": "What was the vote split?",
            "title_similarity": "0.19911858",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2z7ph3",
            "score": 3,
            "text": "So they aren’t capping how much the pharma sells it for. They’re forcing insurance to pay the difference. But not limiting the insurance companies from increasing your premiums?",
            "title_similarity": "0.4529842",
            "sentiment_compound": -0.0516
        },
        {
            "id": "i2z82bm",
            "score": 1,
            "text": "Great now do every other medication.",
            "title_similarity": "0.1497764",
            "sentiment_compound": 0.6249
        },
        {
            "id": "i2z8el2",
            "score": 1,
            "text": "It’s funny that Republicans voted against it, but statistically Republicans usually are more prone to diabetes. They wanted to fuck themselves over.",
            "title_similarity": "0.46307006",
            "sentiment_compound": -0.5859
        },
        {
            "id": "i2z8ji0",
            "score": 1,
            "text": "Is there a reason they set a hard limit to the cost? Wouldn’t it be better to set it in terms of percentages where the cost of the product can only have 100% markup or something? It seems like the arbitrary 35 dollars is good now but that in the future it will need to be raised in accord with inflation.",
            "title_similarity": "0.6183958",
            "sentiment_compound": 0.5873
        },
        {
            "id": "i2z8mfc",
            "score": 1,
            "text": "This is a dumb law…. It doesn’t change the price of insulin",
            "title_similarity": "0.26558253",
            "sentiment_compound": -0.5106
        },
        {
            "id": "i2z8nm4",
            "score": 1,
            "text": "This doesn’t actually lower the cost of insulin. Insurance companies are responsible for paying the difference, so now insurance companies are going to be raising their insurance prices. Always a small bandaid over a larger wound",
            "title_similarity": "0.47440583",
            "sentiment_compound": 0.0258
        },
        {
            "id": "i2z9ajd",
            "score": 1,
            "text": "Or just move to Australia, it’s free down here.",
            "title_similarity": "0.07076449",
            "sentiment_compound": 0.5106
        },
        {
            "id": "i2z9dra",
            "score": 1,
            "text": "Manchin definitely won't be happy with this.",
            "title_similarity": "0.045397773",
            "sentiment_compound": -0.0767
        },
        {
            "id": "i2z9et2",
            "score": 2,
            "text": "My father had diabetes and I remember many conversations trying to figure out how he was going to cover his 3000 dollar insulin bill each month. It was heartbreaking. He even had insurance but because it was pre-existing insurance barely helped. I wish he was alive to see this. It would of made him so happy.",
            "title_similarity": "0.67191863",
            "sentiment_compound": 0.9212
        },
        {
            "id": "i2z9twh",
            "score": 5,
            "text": "Have you tried picking up your diabetes by the bootstraps and not having it anymore? \n\n\nIf it actually passes it’s going to help people in states with the highest rates of diabetes, and those states are the ones that vote republican.  \n\nYet again, the red-staters will hate on the dems but will benefit the most from their policies.",
            "title_similarity": "0.50727916",
            "sentiment_compound": 0.5423
        },
        {
            "id": "i2z9vax",
            "score": 2,
            "text": "One concern from reading the article- it said the insurance companies would be paying the difference in cost/sell. The companies who make the insulin will still be paid the same amount. So what’s stopping the insurance companies from raising their costs to counter this?\n\n(Note that I think the bill is a step in the right direction. This is just something I noticed and wanted to bring up)",
            "title_similarity": "0.49469388",
            "sentiment_compound": -0.2212
        },
        {
            "id": "i2za9nr",
            "score": 3,
            "text": "It won't make it. Republicans won't let it. After all, if it goes through a, big pharma won't be able to bribe them with as much money anymore. Fuck you Sinema and Manchin.",
            "title_similarity": "0.39051303",
            "sentiment_compound": -0.6486
        },
        {
            "id": "i2zabdw",
            "score": 1,
            "text": "193 repubs said no",
            "title_similarity": "0.0486337",
            "sentiment_compound": -0.296
        },
        {
            "id": "i2zapit",
            "score": 2,
            "text": "I hear Republican spin on it is it doesn’t actually lower prices, just kicks it back to insurance companies and employers. Ok fine, so where’s the Republican idea to fix it without the issues? See that’s one of their biggest problems. They oppose things because they don’t fix every single aspect of an issue but present zero alternatives so nothing happens. They’re purely oppositional with no answers.",
            "title_similarity": "0.36041248",
            "sentiment_compound": -0.564
        },
        {
            "id": "i2zb3d9",
            "score": 1,
            "text": "So what happens if/when companies just stop making insulin? Will they pass a law to require companies to make insulin at a loss? Governments have been historically horrible at keeping price controls realistic.",
            "title_similarity": "0.58837724",
            "sentiment_compound": -0.8105
        },
        {
            "id": "i2zb3fm",
            "score": 2,
            "text": "Don’t stop there America. \nMaybe move onto Epi pens next",
            "title_similarity": "0.2639789",
            "sentiment_compound": -0.296
        },
        {
            "id": "i2zb4f1",
            "score": 1,
            "text": "Can’t wait for senator Sinema to make a strong stand against diabetics before the midterm election",
            "title_similarity": "0.6565013",
            "sentiment_compound": 0.5106
        },
        {
            "id": "i2zb7m9",
            "score": 1,
            "text": "This is pathetic",
            "title_similarity": "-0.11918181",
            "sentiment_compound": -0.5719
        },
        {
            "id": "i2zb883",
            "score": 2,
            "text": "Socialism for the old, capitalism for the young.",
            "title_similarity": "0.22879803",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2zbd13",
            "score": 1,
            "text": "Ok so from my understanding it didn't lower the price of the Insulin exactly. It just makes the insurance company pay for the rest of it. So what's to keep the insurance company from raising its prices to offset the cost? Not trying to be snarky just wondering. Is it actually a win in the long run",
            "title_similarity": "0.4163052",
            "sentiment_compound": 0.7571
        },
        {
            "id": "i2zbdfo",
            "score": 1,
            "text": "This is good, of course, but what is the underlying problem that caused the issue? I know there are patents on new iterations of insulin production or something but that can't be insulin specific. \n\nIn addition to this, they should update patent law so this doesn't happen for other things.",
            "title_similarity": "0.3013302",
            "sentiment_compound": -0.3818
        },
        {
            "id": "i2zbuz4",
            "score": 1,
            "text": "When you actually read the article, I get why there's not 100% support and why it'll probably not go through the Senate. This basically puts all the burden on the insurance companies (Don't get me wrong, I hate them) and none on the actual pharmaceutical companies. \n\nI'm curious about the broader bill that is being worked in the Senate right now.",
            "title_similarity": "0.57125425",
            "sentiment_compound": -0.6129
        },
        {
            "id": "i2zbvsn",
            "score": 2,
            "text": "All diabetics need to KNOW who votes against this! Lots of Republican diabetics.",
            "title_similarity": "0.4009623",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2zc0me",
            "score": 2,
            "text": "\"The bill attracted unanimous support from Democrats who voted, as well as from 12 Republicans, making it a rare piece of bipartisan policy legislation.\"\n\nFucking 12 republicans.  God forbid they vote on something that helps keep people alive.",
            "title_similarity": "0.3963856",
            "sentiment_compound": 0.8971
        },
        {
            "id": "i2zc2ms",
            "score": 1,
            "text": "Imagine what nothing beneficial the republicans would do if they had control of things?",
            "title_similarity": "0.19659784",
            "sentiment_compound": -0.3412
        },
        {
            "id": "i2zcj8r",
            "score": 1,
            "text": "\nWelp, looks like other drug costs are about to go up.",
            "title_similarity": "0.20268649",
            "sentiment_compound": 0.3612
        },
        {
            "id": "i2zclco",
            "score": 1,
            "text": "Woulda been nice to have this last year when my type 1 brother was still alive",
            "title_similarity": "0.3275053",
            "sentiment_compound": 0.6597
        },
        {
            "id": "i2zcore",
            "score": 3,
            "text": "Then the republicans in the Senate killed it.\n\nRepublicans only care about their God, Money.",
            "title_similarity": "0.4843619",
            "sentiment_compound": -0.0516
        },
        {
            "id": "i2zcz8s",
            "score": 2,
            "text": "They limited copays, which aren’t the same thing as a cap on costs. Insurers are likely to make up the difference in their profits elsewhere with changes to insurance plan costs.",
            "title_similarity": "0.35861444",
            "sentiment_compound": 0.25
        },
        {
            "id": "i2zczrf",
            "score": 1,
            "text": "Why can’t I just make my own insulin",
            "title_similarity": "0.3013385",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2zd4oo",
            "score": 1,
            "text": "So now that they've passed the House it goes to the Senate where it's dead on the floor. Let's focus on things that can actually be done, like ruining our economy. Politicians are good at that.",
            "title_similarity": "0.52426",
            "sentiment_compound": -0.2263
        },
        {
            "id": "i2zdtk6",
            "score": 1,
            "text": "Nothing for the uninsured🤷‍♀️",
            "title_similarity": "0.07191871",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2zduqb",
            "score": 2,
            "text": "If you're diabetic and vote republican you deserve to ration your insulin and die on your couch at the age of 34",
            "title_similarity": "0.64157754",
            "sentiment_compound": -0.5994
        },
        {
            "id": "i2zdxuz",
            "score": 1,
            "text": "God bless",
            "title_similarity": "-0.17025365",
            "sentiment_compound": 0.5994
        },
        {
            "id": "i2ze0qi",
            "score": 1,
            "text": "Years overdue. 👏",
            "title_similarity": "0.22405066",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2ze0xs",
            "score": 1,
            "text": "*house democrats",
            "title_similarity": "0.34102",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2ze1hc",
            "score": 1,
            "text": "It’s funny because it already was then Joe Biden got rid of that 😅",
            "title_similarity": "0.27569318",
            "sentiment_compound": 0.6597
        },
        {
            "id": "i2zegj3",
            "score": 1,
            "text": "And just like that insulin is now in limited supply",
            "title_similarity": "0.2564415",
            "sentiment_compound": 0.1531
        },
        {
            "id": "i2zeph1",
            "score": 2,
            "text": "Obv some of those House members just voted to pass it because they knew it had a yacht’s chance in an oil spill to pass in the Senate.",
            "title_similarity": "0.5064149",
            "sentiment_compound": 0.25
        },
        {
            "id": "i2zew3i",
            "score": 5,
            "text": "Please. My cat needs his insulin and it’s $115 per bottle. 😿",
            "title_similarity": "0.6964558",
            "sentiment_compound": -0.2023
        },
        {
            "id": "i2zf332",
            "score": 1,
            "text": "I pay 40 a month (and it requires pre approval) my prior insurance covered it completely considering it’s a PREVENTATIVE measure required to live. If my husband did not take insulin the insurance company and us would pay a LOT more in medical bills (or he would die).",
            "title_similarity": "0.7051946",
            "sentiment_compound": -0.3818
        },
        {
            "id": "i2zf58r",
            "score": 6,
            "text": "It’s honestly fucking stupid that this is even $35 it should be $0",
            "title_similarity": "0.47030222",
            "sentiment_compound": -0.1761
        },
        {
            "id": "i2zf9bn",
            "score": 1,
            "text": "Cool we can keep drinking coke",
            "title_similarity": "0.06395106",
            "sentiment_compound": 0.3182
        },
        {
            "id": "i2zfjpr",
            "score": 3,
            "text": "Thank goodness. It's so cheap to make, yet pharm was ripping off the people that needed it to live, for greed. \nNow, let's get the cancer drugs fixed. My chemo was $1700.00 for 21 pills, and I had to have a special propitiatory pharm supply it.\nThe profit made off medications is unreal.",
            "title_similarity": "0.52336824",
            "sentiment_compound": 0.4588
        },
        {
            "id": "i2zfsjf",
            "score": 2,
            "text": "One step closer, still gotta pay to live though",
            "title_similarity": "0.13536802",
            "sentiment_compound": -0.1027
        },
        {
            "id": "i2zg0km",
            "score": 2,
            "text": "All I see from this is that their premiums go up on top of paying $35 bucks a month....",
            "title_similarity": "0.7202575",
            "sentiment_compound": 0.2023
        },
        {
            "id": "i2zg1sp",
            "score": 5,
            "text": "The fact that this is even a conversation is so goddamn stupid.\n\nDo people have health insurance?\n\nWhat is the point of health insurance? To cover necessary medical expenses by bundling them into a manageable and predictable expense that's spread out over the population. (I know, I know, the real point is to buy administrators a new yacht, but this is what the point is SUPPOSED TO BE.)\n\nSo why the fuck is it relevant how much it costs to buy a bottle of insulin? Just fucking give it to whoever needs it. Duh. Just like the Covid vaccines. We're covered. Give it to us.\n\nAnd on a slightly tangential note, make sure everyone is included because healthcare is a right, not a privilege.",
            "title_similarity": "0.50901294",
            "sentiment_compound": -0.7897
        },
        {
            "id": "i2zg9pv",
            "score": 1,
            "text": "Pog if true",
            "title_similarity": "-0.018144961",
            "sentiment_compound": 0.4215
        },
        {
            "id": "i2zg9wm",
            "score": 1,
            "text": "Why not all prescriptions?  Why just one specific one?",
            "title_similarity": "0.17738388",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2zgikc",
            "score": 1,
            "text": "Why stop at insulin?",
            "title_similarity": "0.2728566",
            "sentiment_compound": -0.296
        },
        {
            "id": "i2zgt5j",
            "score": 2,
            "text": "My brother pays $8.00 a vial for regular insulin for his diabetic dog. I’m telling you, this just isn’t right. There is an untapped market for anyone who can find a way to fake diabetes in domestic pets in the US.",
            "title_similarity": "0.68841815",
            "sentiment_compound": -0.4767
        },
        {
            "id": "i2zgwv4",
            "score": 1,
            "text": "Finally a good bill",
            "title_similarity": "-0.026899647",
            "sentiment_compound": 0.4404
        },
        {
            "id": "i2zh60v",
            "score": 1,
            "text": "April Fools….",
            "title_similarity": "0.25154424",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2zhgl6",
            "score": 1,
            "text": "*Sen. Manchin entered chat*",
            "title_similarity": "0.085241765",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2zhhnf",
            "score": 2,
            "text": "And it'll go die in the Senate. \n\nHave we all not seen this movie a hundred times?",
            "title_similarity": "0.5411198",
            "sentiment_compound": -0.5994
        },
        {
            "id": "i2zhlwr",
            "score": 1,
            "text": "Reminder that the vast majority of Republicans voted against this. To all you Republicans, your political party is trash.",
            "title_similarity": "0.4344457",
            "sentiment_compound": 0.4019
        },
        {
            "id": "i2zhrtn",
            "score": 1,
            "text": "Is it possible for biden to force this through?",
            "title_similarity": "0.03344282",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2zhsxq",
            "score": 1,
            "text": "So the cost of insulin might go down, But my wife is on an insulin pump all that will happen is the medical equipment price will increase to make up the difference in the price gouging",
            "title_similarity": "0.58853483",
            "sentiment_compound": 0.4497
        },
        {
            "id": "i2zi471",
            "score": 1,
            "text": "I look forward to this dying in the senate",
            "title_similarity": "0.3738634",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2zi4r0",
            "score": 1,
            "text": "I look forward to this dying in the senate",
            "title_similarity": "0.3738634",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2zi8nv",
            "score": 1,
            "text": "Please don’t be April fools. 🤞🏼",
            "title_similarity": "0.12761374",
            "sentiment_compound": -0.2263
        },
        {
            "id": "i2ziabd",
            "score": 1,
            "text": "it is a shame that this bill had to even be done. biden ripped up trumps legislation that capped the price of prescription drugs. then the dens do this and all of reddit screams to the heavens that the dems have done something finally",
            "title_similarity": "0.45556957",
            "sentiment_compound": -0.3818
        },
        {
            "id": "i2zib2z",
            "score": 1,
            "text": "Finally the ghost of the guy who invented it can rest.",
            "title_similarity": "0.1380645",
            "sentiment_compound": -0.3182
        },
        {
            "id": "i2zicil",
            "score": 1,
            "text": "Which insulin?",
            "title_similarity": "0.16195554",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2zj00d",
            "score": 1,
            "text": "The reason republicans voted against this bill is because it still makes those who can’t afford insurance to be left without an easy way for insulin.\n\nMy wife was born diabetic. She has to pay out of pocket because insurance is higher then insulin costs. \n\nThis bill will insure insurance to be even higher because they now have to cover the cost of insulin for more people. \n\n\nInsurance will raise price on the back end and charge people who need insurance even more to cover the cost of covering insulin. \n\n\nMaybe let’s actually pass a bill lowering insulin costs. Meaning basing a bill banning pharmaceutical and insurance companies from grudging prices. \n\nIt costs like 5 dollars to make a vial of insulin it really should be 5 to 10 dollars for a vial for anyone and everyone who needs it.",
            "title_similarity": "0.6084553",
            "sentiment_compound": -0.3195
        },
        {
            "id": "i2zj4ly",
            "score": 1,
            "text": "That’s great. I am happy to hear it. If you guys are taking request can we get asthma meds next.",
            "title_similarity": "0.1874383",
            "sentiment_compound": 0.8316
        },
        {
            "id": "i2zjklo",
            "score": 1,
            "text": "The real problem with this bill is that it doesn't 'cap' the insulin prices. It makes it so that if you have insurance you only pay up to $35. The pharmaceutical companies can still charge whatever they want to the insurance companies (which will raise your premiums) and the same for the uninsured.\r  \n\r  \n\r  \n\r  \n[https://www.congress.gov/bill/117th-congress/house-bill/6833/text?r=1&s=1](https://www.congress.gov/bill/117th-congress/house-bill/6833/text?r=1&s=1) \r  \n\r  \nSEC. 2799A–11. REQUIREMENTS WITH RESPECT TO COST-SHARING FOR CERTAIN INSULIN PRODUCTS.\r  \n\r  \n“(a) In General.—For plan years beginning on or after January 1, 2023, a group health plan or health insurance issuer offering group or individual health insurance coverage shall provide coverage of selected insulin products, and with respect to such products, shall not—\r  \n\r  \n“(1) apply any deductible; or\r  \n\r  \n“(2) impose any cost-sharing in excess of the lesser of, per 30-day supply—\r  \n\r  \n“(A) $35; or\r  \n\r  \n“(B) the amount equal to 25 percent of the negotiated price of the selected insulin product net of all price concessions received by or on behalf of the plan or coverage, including price concessions received by or on behalf of third-party entities providing services to the plan or coverage, such as pharmacy benefit management services.",
            "title_similarity": "0.74270374",
            "sentiment_compound": 0.8452
        },
        {
            "id": "i2zk1qr",
            "score": 2,
            "text": "Only 12 republicans, and all the democrats of the house voted to limit the cost of insulin to $35 a month.\n\nThere I fixed the headline for you.",
            "title_similarity": "0.8523793",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2zk9f3",
            "score": 1,
            "text": "\"Bipartisan support\"\n12 Republicans voted for it.\nFuck the GOP.",
            "title_similarity": "0.49876946",
            "sentiment_compound": -0.2023
        },
        {
            "id": "i2zkac6",
            "score": 2,
            "text": "When I was on a HDHP, I paid over $1900 for 7 vials of Novolog (roughly a 3 month supply).  Now I pay a much higher premium for a copay plan, but the numbers work out to be around the same cost.  I’m a type 1 diabetic, so not a whole hell of a lot I can do to get around it.\n\nEli Lilly and Novo nordisk need to be reigned in.  There is an absolute, inelastic demand for their product, which means they can charge as much as they want unless they are reigned in by regulation.  This is where free markets fall short, and why we need some intervention.",
            "title_similarity": "0.67188907",
            "sentiment_compound": 0.8734
        },
        {
            "id": "i2zkgaj",
            "score": 2,
            "text": "While I feel like this is a step in the right direction for T1 diabetics, it bothers me so much that people, especially politicians HAVE NO CLUE  what they’re talking about or why this is so important. \nThe article says “diabetes is on the rise.” Yes, T2 is on the rise and that doesn’t usually require insulin to keep them alive. T1 is an autoimmune disease, which can affect newborns even. Insulin is needed daily for basal (background) and bolus(before each meal and to correct highs). This can come out to as many as 5-8 injections per day…possibly more if the patient is brittle. Without insulin, you die, period, potentially within a day if you’re already running high. DKA is dangerous and deadly. There’s no way to stop that other than insulin. There are poor people that have to starve themselves for days, weeks, to ration insulin, which can also cause DKA or other awful symptoms. \nInsulin isn’t like a blood pressure medication that can be skipped and still remain alive. Without it, you die. PERIOD! \nIt shouldn’t cost a fortune for a medication you literally need to stay alive each day! \nDiabetes is too profitable, more so than cancer or other diseases! It’s disgusting that pharmaceutical companies price gouge life sustaining drugs! Absolutely disgusting!!!",
            "title_similarity": "0.59690934",
            "sentiment_compound": -0.8966
        },
        {
            "id": "i2zkqya",
            "score": 1,
            "text": "Big Daddy Government interfering in the private sector again.  Enough is enough.",
            "title_similarity": "0.3808381",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2zl38r",
            "score": 1,
            "text": "Can we think about the medical industry!! How will the c-suites afford their 5th summer home if we cut the price of insulin. What’s next? Medical services that don’t put people into crippling medical debt!? No sir, that’s not the America our parents envisioned.",
            "title_similarity": "0.65411174",
            "sentiment_compound": -0.7927
        },
        {
            "id": "i2zl65y",
            "score": 1,
            "text": "April fools?",
            "title_similarity": "0.23842892",
            "sentiment_compound": -0.4939
        },
        {
            "id": "i2zl7bm",
            "score": 1,
            "text": "Just window dressing. Drug companies & insurers will still rake in massive profits. This does not control/regulate what can be paid to the drug companies for insulin. This only determines how it is paid for. This only further serves to sweep problems under the rug & shows how inept congressional members can be.\n\nIf anything, prices will increase at a higher rate since the end customer will have a price cap. Drug companies & insurers will make more money since taxpayers & premiums will cover the costs. Price increases will be more hidden, which only helps those companies.",
            "title_similarity": "0.47432476",
            "sentiment_compound": 0.6249
        },
        {
            "id": "i2zlffo",
            "score": 1,
            "text": "It’s about fucking time. Life saving drugs should never be so expensive that it makes someone choose between bankruptcy or death. Why is this even a thing? Fuck.",
            "title_similarity": "0.43245727",
            "sentiment_compound": -0.8126
        },
        {
            "id": "i2zlm7j",
            "score": 1,
            "text": "If this passes I completely suspect some shady shortages happening.  Republicans will blame the bill and democrats.",
            "title_similarity": "0.38737452",
            "sentiment_compound": -0.6697
        },
        {
            "id": "i2zmbrb",
            "score": 1,
            "text": "Bruh this is also only about the Copay that goes into insulin. Read the article and do your research",
            "title_similarity": "0.4374838",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2zmd4j",
            "score": 1,
            "text": "That's nauseating",
            "title_similarity": "-0.06361004",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2zmg8e",
            "score": 1,
            "text": "This doesn’t put a cap on it, it just changes the amount insurance companies pay for it. \n\nWouldn’t that raise the price of insurance?",
            "title_similarity": "0.3401352",
            "sentiment_compound": -0.1027
        },
        {
            "id": "i2zmhbc",
            "score": 2,
            "text": "Let this be a reminder that both parties are not the same and that it is extremely important to hold on to the majority in the House and expand it in the Senate to make Manchin and Sinema irrelevant to make sure things like this get passed. Giving up is not an option.",
            "title_similarity": "0.43063432",
            "sentiment_compound": 0.9061
        },
        {
            "id": "i2zmtd4",
            "score": 2,
            "text": "This is the meat of the article and broader issue:\n\n“ …and allow the government to negotiate directly on the price of some drugs used by Medicare patients, while also limiting insulin co-payments.”\n\nI can understand (though mostly disagree) why some would oppose the gov’t intervening in the costing of consumer goods, but the fact that the government is legally disallowed from negotiating drug prices with manufacturers is insanity. \n\nThe single largest purchaser of healthcare (our government) in the country can’t leverage it’s buying power because….????????? \n\nSome bought and paid for politicians decades ago got paid off by insurance/drug companies so now we deal with this shitty law they passed? Insanity.",
            "title_similarity": "0.5523695",
            "sentiment_compound": -0.9622
        },
        {
            "id": "i2zmusa",
            "score": 2,
            "text": "What is the end game here for republicans? Any conservatives here that can explain?",
            "title_similarity": "0.3392131",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2zn7bo",
            "score": 1,
            "text": "Can the house pass a bill to limit the cost of fuel?",
            "title_similarity": "0.6020006",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2zneox",
            "score": 1,
            "text": "Everyone celebrating keep in mind it still needs to pass the senate and they hope that Biden signs it The fight ain’t over yet",
            "title_similarity": "0.44050384",
            "sentiment_compound": 0.6124
        },
        {
            "id": "i2znjcd",
            "score": 1,
            "text": "Took away the cost limit just so they could bring it back..",
            "title_similarity": "0.24419773",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2zo0za",
            "score": 1,
            "text": "Awesome, can we get the same thing for albuterol?",
            "title_similarity": "0.19972241",
            "sentiment_compound": 0.6249
        },
        {
            "id": "i2zo2cp",
            "score": 1,
            "text": "From what I understand, this caps the price of COPAYS not the actual price of insulin.",
            "title_similarity": "0.39029914",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2zo4o5",
            "score": 1,
            "text": "Oh Congress finally decided to do something reasonably good for regular people for once? How magnanimous. Let's see if the Senate bothers to do the same. Shit's always getting past the House, the Senate are the ones fucking it up.",
            "title_similarity": "0.43832868",
            "sentiment_compound": 0.2732
        },
        {
            "id": "i2zoe94",
            "score": 1,
            "text": "This is great but there is absolutely no way President Manchin or VP Senima allow this to go through.",
            "title_similarity": "0.17244194",
            "sentiment_compound": 0.1681
        },
        {
            "id": "i2zoi9y",
            "score": 1,
            "text": "Is there any difference between this bill and the executive order Trump made?",
            "title_similarity": "0.28850788",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2zp45s",
            "score": 1,
            "text": "Enter Kodak !",
            "title_similarity": "0.16604754",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2zprp4",
            "score": 1,
            "text": "Better, but not great.",
            "title_similarity": "-0.01974412",
            "sentiment_compound": -0.5409
        },
        {
            "id": "i2zqb16",
            "score": 2,
            "text": "Now do test strips too",
            "title_similarity": "0.052916307",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2zql43",
            "score": 1,
            "text": "Senate: How dare you be diabetic\n\n*Buries the bill",
            "title_similarity": "0.4773844",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2zqlo9",
            "score": 1,
            "text": "Senate: How dare you be diabetic\n\n*Buries the bill",
            "title_similarity": "0.4773844",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2zqntd",
            "score": 1,
            "text": "Syringes go up to 100x the price of normal in response to the squeeze",
            "title_similarity": "0.5245014",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2zqqbn",
            "score": 1,
            "text": "“April Fools!” - The House",
            "title_similarity": "0.3434125",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2zqu66",
            "score": 1,
            "text": "This is only a cap for those who have insurance and a copay. This isn’t in general. This is a terrible bill that still fails to address the issue.",
            "title_similarity": "0.23379622",
            "sentiment_compound": -0.7096
        },
        {
            "id": "i2zr7qi",
            "score": 1,
            "text": "Shit should just be free",
            "title_similarity": "-0.10940318",
            "sentiment_compound": -0.0772
        },
        {
            "id": "i2zrg4d",
            "score": 1,
            "text": "Needs to be almost free for type 1, type 2 idc about. Fix your eating habits.",
            "title_similarity": "0.30020076",
            "sentiment_compound": 0.4601
        },
        {
            "id": "i2zrvdb",
            "score": 1,
            "text": "I dont understand democrats \nThese bs half measures just piss off both sides\n\nIf you're gonna fix the pharmaceutical price gouging,  go all in \n\nSetting a limit that still encourages price gouging while pretending you're doing all you can do is why polls have them losing in the midterms",
            "title_similarity": "0.54267347",
            "sentiment_compound": -0.25
        },
        {
            "id": "i2zsdl4",
            "score": 1,
            "text": " LOVE when the house passes a good bill!! \n\nTo bad NONE of them make it past the senate",
            "title_similarity": "0.4243259",
            "sentiment_compound": 0.7111
        },
        {
            "id": "i2zt2qn",
            "score": 1,
            "text": "Price controls never work…..If this passes within a year there will be substantial shortages in the supply!  The quality will drop, black market (Chinese) versions will come out…..hurting people w diabetes more than the cost.  Price controls are lazy solutions by dumb govt leftists.",
            "title_similarity": "0.53136176",
            "sentiment_compound": -0.7424
        },
        {
            "id": "i2zt5wi",
            "score": 1,
            "text": "What I do is I sign up for insulin research studies and make big pharma pay ME for using their insulin and they usually supply me with dexcom and all the supplies needed while in the study.   The diabetic medical staff has learned that diabetics use the same pen top over and over and that the lancets that come with the glucometer is all we need.   They try to give those away at the end of a study.   But that's how I make diabetes affordable.",
            "title_similarity": "0.6291066",
            "sentiment_compound": 0.0516
        },
        {
            "id": "i2zt7nx",
            "score": 1,
            "text": "What I do is I sign up for insulin research studies and make big pharma pay ME for using their insulin and they usually supply me with dexcom and all the supplies needed while in the study.   The diabetic medical staff has learned that diabetics use the same pen top over and over and that the lancets that come with the glucometer is all we need.   They try to give those away at the end of a study.   But that's how I make diabetes affordable.",
            "title_similarity": "0.6291066",
            "sentiment_compound": 0.0516
        },
        {
            "id": "i2ztcm9",
            "score": 1,
            "text": "It won't get past the senate, April Fools!",
            "title_similarity": "0.38468587",
            "sentiment_compound": -0.5411
        },
        {
            "id": "i2ztd4o",
            "score": 1,
            "text": "Not American but if this headline is as straightforward as it reads and comes too fruition… amazingly good news that from what I believe is long overdue and will be such a welcome relief for many. Fingers crossed for those that need it.\nIts subsidised and extremely cheap in comparison in Australia. As it should be.",
            "title_similarity": "0.17970702",
            "sentiment_compound": 0.9252
        },
        {
            "id": "i2zteg9",
            "score": 1,
            "text": "Hmm maybe just let the govenrment negotiate pricing for all drugs instead.",
            "title_similarity": "0.33319324",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2zto13",
            "score": 1,
            "text": "Ok, if I have no money, they're willing to let me die?",
            "title_similarity": "0.32689273",
            "sentiment_compound": -0.7269
        },
        {
            "id": "i2ztoop",
            "score": 1,
            "text": "This is the co-pay cap- not the total cost of insulin.",
            "title_similarity": "0.40097558",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2zu54y",
            "score": 1,
            "text": "Finally",
            "title_similarity": "-0.1129608",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2zv1g9",
            "score": 1,
            "text": "It's a slippery slope for Republicans because next thing you know, boom, ALL healthcare might be affordable and we can't have that.",
            "title_similarity": "0.3535613",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2zv2v1",
            "score": 1,
            "text": "Finally some good news",
            "title_similarity": "-0.1504766",
            "sentiment_compound": 0.4404
        },
        {
            "id": "i2zvgos",
            "score": 1,
            "text": "nice to see good news for my home country, hopefully it passes",
            "title_similarity": "0.00746765",
            "sentiment_compound": 0.8126
        },
        {
            "id": "i2zvjrc",
            "score": 1,
            "text": "All drugs should be affordable with insurance.",
            "title_similarity": "0.116256475",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2zvlkg",
            "score": 1,
            "text": "friendly reminder this could’ve been here since the trump presidency but no, congress needed to be belligerent",
            "title_similarity": "0.35103774",
            "sentiment_compound": 0.2732
        },
        {
            "id": "i2zvn39",
            "score": 2,
            "text": "The headline should read “193 Republicans voted against an insulin price cap.”",
            "title_similarity": "0.6311457",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2zvowl",
            "score": 2,
            "text": "And only for those with insurance, if I read correctly. Our government is actively anti-the people.",
            "title_similarity": "0.35329446",
            "sentiment_compound": 0.3182
        },
        {
            "id": "i2zvp6i",
            "score": 2,
            "text": "This should be free. Since the patent was sold for $1. I do not believe this is what Banting wanted to happen to insulin",
            "title_similarity": "0.5336013",
            "sentiment_compound": 0.5106
        },
        {
            "id": "i2zvxlc",
            "score": 2,
            "text": "If you go to r/ conser-vative and see this post, you can see all of their heads exploding by trying to reason out why this is a bad thing. It's sad how badly they want to be abused by their republican overlords.",
            "title_similarity": "0.28619573",
            "sentiment_compound": -0.9136
        },
        {
            "id": "i2zvy9i",
            "score": 1,
            "text": "Oh wow look at us, movin on up. It’s almost like we have empathy.",
            "title_similarity": "0.0051623704",
            "sentiment_compound": 0.719
        },
        {
            "id": "i2zwcwp",
            "score": 2,
            "text": "I don’t understand how there’s not an across the board law about not being able to charge more than 10x the cost or something. Literally a 1,000% profit is more than almost any other industry makes. I feel like this bits and pieces approach is more a way to satiate voters rather than actually enact meaningful change. (Although I’m happy for all diabetics whose lives will change if this passes)",
            "title_similarity": "0.5214768",
            "sentiment_compound": 0.886
        },
        {
            "id": "i2zx7gy",
            "score": 2,
            "text": "“The bill attracted unanimous support from Democrats who voted, as well as from 12 Republicans, making it a rare piece of bipartisan policy legislation”\n\nWow. \n\n12R’s. That says a lot about politics in the us.",
            "title_similarity": "0.38611484",
            "sentiment_compound": 0.886
        },
        {
            "id": "i300zdg",
            "score": 2,
            "text": "This would be incredible, as I was just diagnosed with type 1 yesterday.",
            "title_similarity": "0.3795877",
            "sentiment_compound": 0.0
        },
        {
            "id": "i301stw",
            "score": 1,
            "text": "I'm not naive about this at all, but this is actually a bill where I wonder how Republicans who vote against it can manage to evade consequences from an angry electorate. *A lot* of people rely on insulin, and even with the low intelligence/applied ignorance of most Americans, how do you continue to support a lawmaker who wouldn't take this small step in helping you *actually fucking live?!?!*",
            "title_similarity": "0.49437016",
            "sentiment_compound": -0.6744
        },
        {
            "id": "i301vlz",
            "score": 1,
            "text": "It’s likely that if this ever becomes a thing, the vials might cost $35 but the easier to carry and use pens will still cost $100s for the proprietary delivery system. \n\nStill that’s better than what it is now.",
            "title_similarity": "0.64314747",
            "sentiment_compound": 0.8201
        },
        {
            "id": "i302gtz",
            "score": 1,
            "text": "Do gasoline and fuel oil next.",
            "title_similarity": "0.18583788",
            "sentiment_compound": 0.0
        },
        {
            "id": "i302xdc",
            "score": 1,
            "text": "April fools",
            "title_similarity": "0.2466728",
            "sentiment_compound": -0.4939
        },
        {
            "id": "i3043yv",
            "score": 1,
            "text": "I pay $60 for a 3 month supply... hopefully this doesn’t raise my cost",
            "title_similarity": "0.7227587",
            "sentiment_compound": 0.3182
        },
        {
            "id": "i304mxj",
            "score": 1,
            "text": "...except that capping what the end user pays, forces insurance companies to pay the additional amounts, and ends up pushing up premiums...for the end user. 3 Companies producing insulin? Sounds like the makings of price fixing. How about tax incentives for more companies to make insulin? Pure competition drives prices down...",
            "title_similarity": "0.6066824",
            "sentiment_compound": 0.5803
        },
        {
            "id": "i304rrx",
            "score": 1,
            "text": "This is fine but what about all the other drugs that we're getting gouged on? So silly to single out a single drug. Of course Congress doesn't want to tackle the bigger problem because it's an industry that gives them billions of dollars in lobbying money. Or can you say bribes?",
            "title_similarity": "0.4540604",
            "sentiment_compound": -0.5508
        },
        {
            "id": "i306kj1",
            "score": 1,
            "text": "Democrats in House pass it despite mass Republican opposition. Fixed it",
            "title_similarity": "0.4696609",
            "sentiment_compound": 0.0
        },
        {
            "id": "i309ocy",
            "score": 1,
            "text": "should be free 🤷🏼‍♀️",
            "title_similarity": "-0.06919639",
            "sentiment_compound": 0.5106
        },
        {
            "id": "i30adyl",
            "score": 1,
            "text": "This is capping copays, not actual cost.\n\nFor profit medicine is an unethical, inefficient joke.",
            "title_similarity": "0.15901938",
            "sentiment_compound": 0.2023
        },
        {
            "id": "i30b5bx",
            "score": 1,
            "text": "Sadly it won’t get past the senate.",
            "title_similarity": "0.28772774",
            "sentiment_compound": -0.4215
        },
        {
            "id": "i30ccd9",
            "score": 1,
            "text": "why do so many americans need insulin?",
            "title_similarity": "0.45927262",
            "sentiment_compound": 0.0
        },
        {
            "id": "i30cwy2",
            "score": 1,
            "text": "Reinventing the wheel.\n\nThis was already a done deal in Trump’s presidency.\n\nThe potato undid it on day one.\n\nNow it’s being redone.",
            "title_similarity": "0.49397337",
            "sentiment_compound": 0.0
        },
        {
            "id": "i30d0lh",
            "score": 1,
            "text": "Ok now do my Vyvanse. Not as critical as Insulin but highway robbery for something I need to do my job.",
            "title_similarity": "0.33625245",
            "sentiment_compound": 0.2688
        },
        {
            "id": "i30eg2l",
            "score": 1,
            "text": "Now it dies in the Senate. These are despicable corrupt bastards and this shit needs to end.",
            "title_similarity": "0.333155",
            "sentiment_compound": -0.8225
        },
        {
            "id": "i30g6ay",
            "score": 1,
            "text": "When the GOP fucks the entire country on this I'm ready for a civil war. The United States government doesn't work for its citizens. I can't be friends with Republicans anymore. It's coming to a head.",
            "title_similarity": "0.3917958",
            "sentiment_compound": -0.6433
        },
        {
            "id": "i30g6un",
            "score": 1,
            "text": "Free in England",
            "title_similarity": "0.0075304937",
            "sentiment_compound": 0.5106
        },
        {
            "id": "i30golj",
            "score": 1,
            "text": "For those that are saying that those who voted for Trump should get to pay lower gas prices while people that voted for Biden should pay current gas prices, to make things fair then, if you voted for Trump you should have to pay the same price for Insulin as before and if you voted for Biden you get the $35 a month cost",
            "title_similarity": "0.78441495",
            "sentiment_compound": -0.2732
        },
        {
            "id": "i30h5t1",
            "score": 1,
            "text": "Now they need to do it for all life saving treatments",
            "title_similarity": "0.21864939",
            "sentiment_compound": 0.0
        },
        {
            "id": "i30hg0n",
            "score": 1,
            "text": "this was already done with trump you dumb mf and biden changed it when he got in now he switched it back y’all are blind left are bunch of snakes and liars",
            "title_similarity": "0.3217214",
            "sentiment_compound": -0.8555
        },
        {
            "id": "i30irb8",
            "score": 1,
            "text": "Good job, now pass the **Permanent Daylight Savings bill (that the Senate already passed)** so we can actually get something to the President's desk to be signed.",
            "title_similarity": "0.5254736",
            "sentiment_compound": 0.4404
        },
        {
            "id": "i30n335",
            "score": 1,
            "text": "400 to 500 a vial of humalog if we didn't have the insurance we do.. This is amazing news!",
            "title_similarity": "0.4143508",
            "sentiment_compound": 0.6239
        },
        {
            "id": "i30u77l",
            "score": 1,
            "text": "What's to stop insurance from just not covering expensive types of insulin?",
            "title_similarity": "0.38077486",
            "sentiment_compound": -0.296
        },
        {
            "id": "i30uhpo",
            "score": 2,
            "text": "Good. Now stop poisoning our affordable food supply with high fructose corn syrup, and make organic vegetables more affordable so people can, like, not get diabeetus.",
            "title_similarity": "0.45129627",
            "sentiment_compound": -0.0865
        },
        {
            "id": "i30xmpz",
            "score": 2,
            "text": "All the republicans in unison “you shall not pass”",
            "title_similarity": "0.23800226",
            "sentiment_compound": 0.0
        },
        {
            "id": "i30xnb3",
            "score": 2,
            "text": "All the republicans in unison “you shall not pass”",
            "title_similarity": "0.23800226",
            "sentiment_compound": 0.0
        },
        {
            "id": "i30xo5f",
            "score": 2,
            "text": "All the republicans in unison “you shall not pass”",
            "title_similarity": "0.23800226",
            "sentiment_compound": 0.0
        },
        {
            "id": "i310obl",
            "score": 1,
            "text": "“Thanks for reading the Times.” But you didn’t let me read the Times. All I read was your pay wall. Thimk about it! So I read the comments,  and thank my fellow readers.",
            "title_similarity": "0.4198684",
            "sentiment_compound": 0.4482
        },
        {
            "id": "i312wka",
            "score": 1,
            "text": "Wow they are actually doing something good. Is not the best deal but is better than nothing. \nWith democrat having the house and senate this should pass like flying colors. \nUnless some people in congress are lobbied by big pharma to not pass this which I can see happening.",
            "title_similarity": "0.45539272",
            "sentiment_compound": 0.8506
        },
        {
            "id": "i312x30",
            "score": 1,
            "text": "Wow they are actually doing something good. Is not the best deal but is better than nothing. \nWith democrat having the house and senate this should pass like flying colors. \nUnless some people in congress are lobbied by big pharma to not pass this which I can see happening.",
            "title_similarity": "0.45539272",
            "sentiment_compound": 0.8506
        },
        {
            "id": "i313xm4",
            "score": 1,
            "text": "Pass that shit!",
            "title_similarity": "-0.1204077",
            "sentiment_compound": -0.5983
        },
        {
            "id": "i31g0pt",
            "score": 1,
            "text": "Why did they vote against it?",
            "title_similarity": "0.25507465",
            "sentiment_compound": 0.0
        },
        {
            "id": "i31gg3l",
            "score": 1,
            "text": "Whether you are Capitalist or Communist you should not be making massive profits from the suffering of your people. Imagine how much greater The US could have been if they didn't financially destroy the middle and lower class with medical and education costs!",
            "title_similarity": "0.4128543",
            "sentiment_compound": 0.501
        },
        {
            "id": "i31guv2",
            "score": 1,
            "text": "Does this bill also include limits on which insurance companies can increase premiums for diabetics?",
            "title_similarity": "0.48092586",
            "sentiment_compound": 0.3182
        },
        {
            "id": "i31k06d",
            "score": 2,
            "text": "No it’s supposed to be free",
            "title_similarity": "-0.100526765",
            "sentiment_compound": 0.2732
        },
        {
            "id": "i31mr98",
            "score": 1,
            "text": "It’s cute that we think the senate will pass it",
            "title_similarity": "0.20813906",
            "sentiment_compound": 0.4588
        },
        {
            "id": "i31ngb0",
            "score": 1,
            "text": "Bout fucking time",
            "title_similarity": "0.03635039",
            "sentiment_compound": 0.0
        },
        {
            "id": "i31ymu4",
            "score": 3,
            "text": "The GQP is a death cult.",
            "title_similarity": "0.28641215",
            "sentiment_compound": -0.5994
        },
        {
            "id": "i325478",
            "score": 5,
            "text": "Why the fuck do they describe Joe Manchin as a centrist holdout? The man is a right wing obstructionist who consistently sides with Republicans every time it really matters. You've got to really drink the corporate Kool-aid to ever describe that guy as centrist.",
            "title_similarity": "0.42388725",
            "sentiment_compound": -0.4779
        },
        {
            "id": "i326ys9",
            "score": 1,
            "text": "Finally a win for the American people",
            "title_similarity": "0.09859082",
            "sentiment_compound": 0.5859
        },
        {
            "id": "i32pvnt",
            "score": 1,
            "text": "Wouldn't a % be better than amount?",
            "title_similarity": "0.17257452",
            "sentiment_compound": 0.4404
        },
        {
            "id": "i33r90o",
            "score": 1,
            "text": "Dear Americans, welcome to the civilized developped world. What took you so long?",
            "title_similarity": "0.24297136",
            "sentiment_compound": 0.6808
        },
        {
            "id": "i364gz4",
            "score": 1,
            "text": "These life saver medications should be no copay, no insurance, cost sharing. The medications for pre diabetics and diabetics should be free.",
            "title_similarity": "0.27667338",
            "sentiment_compound": 0.6992
        },
        {
            "id": "i369foy",
            "score": 1,
            "text": "Insulina should be free for those in need .",
            "title_similarity": "0.120725416",
            "sentiment_compound": 0.5106
        },
        {
            "id": "i36scsc",
            "score": 1,
            "text": "Just take grounded cinnamon and shake it on your tongue that automatically reduces the glucose in your sugar.",
            "title_similarity": "0.3595606",
            "sentiment_compound": -0.1779
        },
        {
            "id": "i3au1zf",
            "score": 1,
            "text": "It doesn’t, it lowers the cost of co-pays.",
            "title_similarity": "0.21612315",
            "sentiment_compound": -0.128
        },
        {
            "id": "i3cbtnp",
            "score": 2,
            "text": "I am sure I am going to get hate on this. First I agree, it should be the cost of a generic. <$10. \n\nBut why are they subbing an addendum to another bill under this bill?\n\nSEC. 5. MEDICARE IMPROVEMENT FUND.\n\nSection 1898(b)(1) of the Social Security Act (42 U.S.C. 1395iii(b)(1)), as amended by section 313 of division P of the Consolidated Appropriations Act, 2022, is amended by striking “$5,000,000” and inserting “$9,046,500,000”.\n\nA lot politicians vote No because of these riders. Why can’t an act/bill be dedicated what it is trying to solve. Both sides do it. Both are guilty. We lose.",
            "title_similarity": "0.61875945",
            "sentiment_compound": 0.6597
        },
        {
            "id": "i3gdmrn",
            "score": 1,
            "text": "Wait I don’t even see a counterpoint to this. How can an indiscriminate disease (?) decide how your financial life will look. Who looks at that and says “yeah that’s fair”",
            "title_similarity": "0.30303916",
            "sentiment_compound": 0.0
        },
        {
            "id": "i3i58fb",
            "score": 2,
            "text": "Whatever happened to Trump taking it to Big Pharma? I mean I know he wouldnt do shit cause he’s a demagogue, but did he atleast try to pretend for his base?",
            "title_similarity": "0.33777946",
            "sentiment_compound": 0.1833
        },
        {
            "id": "i3mbwz2",
            "score": 2,
            "text": "My wife's been a type one since she was a child im pretty dam sure she knows what and what not to use. 30+ years as a type ONE not type TWO",
            "title_similarity": "0.4713641",
            "sentiment_compound": 0.6705
        },
        {
            "id": "i3onmhu",
            "score": 2,
            "text": "I had a coworker up until yesterday (I quit that job) who was extremely right wing. Fit in well with the rest of my department, one of whom said she loves Trump “because he pisses people off”. She was the type to share a meme of Trump’s face put over Will Smith slapping Chris Rock, who of course was a stand in for Biden, not understanding when it was pointed out that it just didn’t make sense at all on the surface. She would constantly complain about how the democrats are ruining this county and that they are all evil. She also has diabetes and spends a fortune on insulin. I still hope this bill passes the senate, and I’ll be happy for her if it does, even if she’ll be mad about the “socialism” of it.",
            "title_similarity": "0.43283087",
            "sentiment_compound": 0.4336
        },
        {
            "id": "i3q8pqv",
            "score": 1,
            "text": "Great now all the kids are going to want to get diabetes",
            "title_similarity": "0.39645663",
            "sentiment_compound": 0.6597
        },
        {
            "id": "i45w4sn",
            "score": 1,
            "text": "Sure, but only if you have insurance that covers it. And best believe plans that cover insulin will increase next year while many plans will start to exclude it. This is a terrible solution to a serious problem. A true solution would be to publicize the creation of it, allowing multiple companies to make it and prevent insurance companies from limiting consumer choices.",
            "title_similarity": "0.5723808",
            "sentiment_compound": 0.9062
        },
        {
            "id": "i49bqka",
            "score": 1,
            "text": "Word on the street….Mr. Trump is running on a campaign promise to raise the price of insulin to $100 per, and republican diabetics are ecstatic!",
            "title_similarity": "0.5986009",
            "sentiment_compound": 0.7088
        },
        {
            "id": "i4bqtjo",
            "score": 1,
            "text": "35 dollars per month for people on insurance, otherwise its still 1000.",
            "title_similarity": "0.7291276",
            "sentiment_compound": 0.0
        }
    ]
}