{
    "The Supreme Court Says You Can Sue Cops Who Frame You on False Charges\n": [
        {
            "id": "i4a1nfr",
            "score": 1,
            "text": "\nAs a reminder, this subreddit [is for civil discussion.](/r/politics/wiki/index#wiki_be_civil)\n\nIn general, be courteous to others. Debate/discuss/argue the merits of ideas, don't attack people. Personal insults, shill or troll accusations, hate speech, any suggestion or support of harm, violence, or death, and other rule violations can result in a permanent ban. \n\nIf you see comments in violation of our rules, please report them.\n\n For those who have questions regarding any media outlets being posted on this subreddit, please click [here](https://www.reddit.com/r/politics/wiki/approveddomainslist) to review our details as to our approved domains list and outlet criteria.\n \n **Special announcement:**\n \n r/politics is currently accepting new moderator applications.  If you want to help make this community a better place, consider [applying here today](https://www.reddit.com/r/politics/comments/sskg6a/rpolitics_is_looking_for_more_moderators/)!\n\n***\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/politics) if you have any questions or concerns.*",
            "title_similarity": "0.5730494",
            "sentiment_compound": -0.3895
        },
        {
            "id": "i4apuy8",
            "score": -1,
            "text": "I still don't think the court is gonna overturn any of Roe despite technically being conservative now but I'm open to being wrong.",
            "title_similarity": "0.33181155",
            "sentiment_compound": -0.631
        },
        {
            "id": "i4asyvk",
            "score": 2,
            "text": "Unfortunately cops are still immune from prosecution………\n\n\nPolice, legally, cannot be held personally liable for constitutional violations. As a provision of § 1983, Qualified immunity is a judicially created doctrine that shields government officials from being held personally liable for constitutional violations—like the right to be free from excessive police force—for money damages under federal law so long as the officials did not violate “clearly established” law.",
            "title_similarity": "0.5692016",
            "sentiment_compound": 0.2091
        },
        {
            "id": "i4c2ere",
            "score": 0,
            "text": "Another tax on the poor?",
            "title_similarity": "0.39898932",
            "sentiment_compound": -0.4767
        },
        {
            "id": "i4anaxu",
            "score": 2,
            "text": "Wait, thats not already a thing? Leader of the free world my ass",
            "title_similarity": "0.291421",
            "sentiment_compound": -0.0516
        },
        {
            "id": "i4ahgb2",
            "score": 7,
            "text": "r/nottheonion\n\nr/aboringdystopia\n\nI fucking hate this place",
            "title_similarity": "0.2867008",
            "sentiment_compound": -0.6115
        },
        {
            "id": "i4a6h75",
            "score": -3,
            "text": "Why was it even necessary to discuss this? Smh",
            "title_similarity": "0.22287475",
            "sentiment_compound": -0.3869
        },
        {
            "id": "i4amo0f",
            "score": -4,
            "text": "Can the cops sue you if you falsely claim they framed you on false charges ?   that is a risk you have to know before you go through with this.",
            "title_similarity": "0.79583436",
            "sentiment_compound": -0.4939
        },
        {
            "id": "i4agbe1",
            "score": -4,
            "text": "But we can’t call up Republicans on real charges. \n\nThis law right here is what we should be able to apply when these crazy people try to impeach Joe Biden hours into his presidency. You’re free to do it, but when it fails because even if you think he’s a criminal that simply hasn’t been enough time, you get tossed in jail",
            "title_similarity": "0.7021974",
            "sentiment_compound": -0.8625
        },
        {
            "id": "i4amm4i",
            "score": 4,
            "text": "The police get all the protection from the state they could possibly imagine, yet we are supposed to feel sorry for them?",
            "title_similarity": "0.6109688",
            "sentiment_compound": -0.0772
        },
        {
            "id": "i4aiae0",
            "score": 11,
            "text": "Kavannaugh has surprised me on a few decisions, I must say.\n\nI wish conservative justices weren't so hell bent on abortion rights because some of their opinions are spot on. Gorsuch has surprised me on a few decisions as well. They really do take the view of the framers in terms of freedom.\n\nHopefully at some point they point their gaze at privacy rights. Privacy is the biggest fight of the 21st century.",
            "title_similarity": "0.48131984",
            "sentiment_compound": 0.9477
        },
        {
            "id": "i4blmm4",
            "score": -4,
            "text": "Good pass this on the Jan 6 committe and Whitmore kidnapping hoax",
            "title_similarity": "0.6298377",
            "sentiment_compound": 0.2023
        },
        {
            "id": "i4ccl9q",
            "score": 1,
            "text": "Cops who frame people should suffer the death penalty.",
            "title_similarity": "0.6901516",
            "sentiment_compound": -0.886
        },
        {
            "id": "i4aeskq",
            "score": -17,
            "text": "[removed]",
            "title_similarity": "0.11027013"
        },
        {
            "id": "i4baoux",
            "score": -3,
            "text": "This headline is complete clickbait. This case has nothing to do with being “framed by the police”:\n \n>Thompson’s sister-in-law, who apparently suffered from a mental illness, called 911 to report that Thompson was sexually abusing the baby. When Emergency Medical Technicians arrived, Thompson denied that anyone had called 911. When the EMTs returned with four police officers, Thompson told them that they could not enter without a warrant. The police nonetheless entered and handcuffed Thompson. EMTs took the baby to the hospital where medical professionals examined her and found no signs of abuse. Meanwhile, Thompson was arrested and charged with obstructing governmental administration and resisting arrest. He was detained for two days before being released.\n \nPrevious to this case, some lower courts held in order to sue the police for a violation of your rights, you must show the criminal prosecution ended not merely without a conviction, but also with some affirmative indication of your innocence. The Supreme Court simply eliminated the requirement to show evidence of your innocence to bring a lawsuit against the police.",
            "title_similarity": "0.5947952",
            "sentiment_compound": -0.8608
        },
        {
            "id": "i4bq52t",
            "score": -3,
            "text": "Thanks to Justice Kavanaugh!",
            "title_similarity": "0.3631669",
            "sentiment_compound": 0.7644
        },
        {
            "id": "i4bun37",
            "score": -3,
            "text": "Do not upvote this anti-journalistic, faux-Libertarian click factory.",
            "title_similarity": "0.37503743",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4b85ni",
            "score": -8,
            "text": "Too bad people can't sue politicians that continuously smear their names with lies like Sanders or Warren",
            "title_similarity": "0.59063",
            "sentiment_compound": -0.743
        },
        {
            "id": "i4a8cbk",
            "score": 0,
            "text": "Did it, though, headline? Did it really? And, even if it did, will it functionally work how we want it to?",
            "title_similarity": "0.36147815",
            "sentiment_compound": 0.212
        },
        {
            "id": "i4aja0j",
            "score": 0,
            "text": "No shit. Also in the news, sky blue, water wet. Jesus...",
            "title_similarity": "0.20000142",
            "sentiment_compound": 0.4449
        },
        {
            "id": "i4b4f3u",
            "score": -4,
            "text": "Even after yet another fair-mined decision, people are STILL going to claim that the court is loaded in favor of conservative ideals due to the people who nominated them.",
            "title_similarity": "0.460217",
            "sentiment_compound": 0.5423
        },
        {
            "id": "i4czyi0",
            "score": 0,
            "text": "What is happening in this thread? It’s always been illegal to violate someone’s 4th amendment rights. This isn’t new news.",
            "title_similarity": "0.29437095",
            "sentiment_compound": -0.7783
        },
        {
            "id": "i4az0ck",
            "score": -10,
            "text": "Lol sue them for what? They don't have jack shit to pay you with. Police in the US are crazy under paid. You get what you pay for I guess?",
            "title_similarity": "0.6343212",
            "sentiment_compound": 0.4374
        },
        {
            "id": "i4a72cd",
            "score": 5,
            "text": "When it comes to suits people get preoccupied with the dollar amounts. The idea that a person receives mine they didn't 'earn' is often seen as a worse thing than the crime committed against that person. \n\nThe money is meant to change behavior. The penalties need to be high enough to make cities and Police Departments re-think how they are conducting themselves. Focus on the person who receives payment through the lens of that person winning a type of lottery or whatever is the wrong perspective.",
            "title_similarity": "0.6156373",
            "sentiment_compound": -0.6369
        },
        {
            "id": "i4agdzi",
            "score": 5,
            "text": "Those cops who do that should have double the same consequences they were trying to cause you to face. And be forever stripped of the ability to work in law enforcement or any public office for life. \n\nThis is just pure evil.",
            "title_similarity": "0.5914173",
            "sentiment_compound": -0.4767
        },
        {
            "id": "i4aww9q",
            "score": 5,
            "text": "Too bad you can’t, ya know, sue them for killing absolutely innocent people for the crime of say, walking while black (Elijah McClain) Driving while black and having a wide nose and a legal gun that you report to the officer (Philandro Castile) Sleeping while black (Breonna Taylor)",
            "title_similarity": "0.6097827",
            "sentiment_compound": -0.8911
        },
        {
            "id": "i4anrgt",
            "score": 1,
            "text": "It’s called bill of rights",
            "title_similarity": "0.18900195",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4bsr31",
            "score": 1,
            "text": "1. This shows Police is not going to train their cops better  to apprehend perpetrators properly.\n\n2. Police carry immunity anyway so, the chances of you winning are slim anyway.\n\n3. Let’s say you do manage to file one lawsuit against one police, who’s to say that tomorrow another cop won’t harass you? Will you keep on filing lawsuits against them?\n\n4. Let’s say you file the lawsuit properly, you’re still going to financially bleed, waste your precious time in making trips to courts and lawyers and what have you. Cases take a long time before something conclusive or something of substance surfaces to be judged. Most likely, your cases will outlive you. So, would you honestly want your family to inherit that lawsuit after you’re gone? Or rather when you’re alive, do you really want to put your family through that?",
            "title_similarity": "0.65804404",
            "sentiment_compound": 0.7878
        },
        {
            "id": "i4d7h6c",
            "score": 1,
            "text": "They’re still cool with cops that execute people for the hell of it though",
            "title_similarity": "0.5677283",
            "sentiment_compound": -0.5106
        },
        {
            "id": "i4dhwso",
            "score": 1,
            "text": "Brett Kavanaugh: ACAB?",
            "title_similarity": "0.20600398",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4amwlz",
            "score": 2,
            "text": "For fear of being sued, now the Castle Rock vs. Gonzales case from earlier in the 2000's where cops are not Constitutionally required to respond to a call (even in a life or death situation), may cause police to second guess them showing to calls where they may end up getting sued despite it being a 100% legit situation that someone is doing something wrong.  Maybe that's good, maybe bad...",
            "title_similarity": "0.60183674",
            "sentiment_compound": -0.8957
        },
        {
            "id": "i4arubs",
            "score": 2,
            "text": "In New Mexico you can already do that.\n\nWe got rid of qualified immunity last year.",
            "title_similarity": "0.41412798",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4bjjlp",
            "score": 2,
            "text": "No need. They will investigate themselves.",
            "title_similarity": "0.21736202",
            "sentiment_compound": -0.296
        },
        {
            "id": "i4cqboa",
            "score": -2,
            "text": "Is anyone else having an issue with reddit? I keep trying to post a comment in a chat with people with common sense but thilen it redirects me to thread full of idi.....see it did it again.",
            "title_similarity": "0.4714253",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4aqzub",
            "score": 3,
            "text": "Sure, you can sue, but you probably won't win.",
            "title_similarity": "0.41933447",
            "sentiment_compound": -0.5358
        },
        {
            "id": "i4afmv5",
            "score": 12,
            "text": "Think they mean. \"Nothing is going to change other than suing a cop directly instead of the department. The cops union though is going to still defend them as usual so good luck!\".",
            "title_similarity": "0.56455946",
            "sentiment_compound": 0.7361
        },
        {
            "id": "i4ck9qc",
            "score": 4,
            "text": "They should get double the max punishment they were framing for. If they frame you for a max 10 year prison sentence crime, they should serve 20 minimum in a maximum security prison. It’s ridiculous that it’s not already a law.",
            "title_similarity": "0.4259446",
            "sentiment_compound": -0.9201
        },
        {
            "id": "i4a444k",
            "score": 173,
            "text": "At the very least i should be able to sue cops with the same level of entitlement that big corps use to get to sue everyone all the time. \n\nbillionaires sue even when they lose the bid on a contract\n\nthe entire bar system is designed to artificially inflate prices by limiting the number of available lawyers cause billionaires to be the ones who get to sue whenever\n\nmeanwhile us peasants just received the right to sue specifically if they frame us for a crime\n\ngreat fucking job",
            "title_similarity": "0.73055047",
            "sentiment_compound": -0.2023
        },
        {
            "id": "i4a24h3",
            "score": 409,
            "text": "Wow, and people wonder why there is a movement called defund the police.\n\nGood on the Supreme Court for at least getting this right",
            "title_similarity": "0.72112226",
            "sentiment_compound": 0.8834
        },
        {
            "id": "i4aqy4j",
            "score": 7,
            "text": "Colorado got rid of qualified immunity for regular cops. However. The state didn't for the state patrol, and now you see them everywhere. i got a false charge, even went to jail, and i had it dropped in court. The state patrol was found to have violated 4 of my civil rights and 2 of my constitutional rights. Including lying on the form, but i couldn't sue them into oblivion because of that qi bs. Some of these loop holes between state and federal laws got to be reformed. I want to get paid!",
            "title_similarity": "0.66071856",
            "sentiment_compound": -0.501
        },
        {
            "id": "i4acvnf",
            "score": 8,
            "text": "I was quite literally framed. back around 2016 a cop lied and doing so put me in jail. Put me through hell that I'm still recovering from mentally. Can I sue this cop now?",
            "title_similarity": "0.69004256",
            "sentiment_compound": -0.802
        },
        {
            "id": "i4a3urq",
            "score": 103,
            "text": "Sadly they’ll still find a way to walk away scott free and make your life even more miserable. \nWe need some real accountability for cops.",
            "title_similarity": "0.6690722",
            "sentiment_compound": -0.4576
        },
        {
            "id": "i4a44ln",
            "score": 371,
            "text": "It was a 6-3 ruling and the ones who voted against were:\n\nAlito, Thomas and Gorsuch.\n\nYou can be sure that Thomas is 100% going with whatever hurts democracy and little people. Alito the same 90%.\n\nGorsuch  -- signals that the non-rich are in for a miserable time with him.",
            "title_similarity": "0.45351052",
            "sentiment_compound": -0.6124
        },
        {
            "id": "i4adjfz",
            "score": 18,
            "text": "They need to end qualified immunity.  Without this, this ruling is mostly toothless.",
            "title_similarity": "0.38561147",
            "sentiment_compound": -0.34
        },
        {
            "id": "i4a9ej9",
            "score": 1219,
            "text": "So the lady in Texas who was just arrested and charged with murder for having a stillborn child can go after Greg Abbott and all the cops that arrested her, right?",
            "title_similarity": "0.6209965",
            "sentiment_compound": -0.9136
        },
        {
            "id": "i4a3p2k",
            "score": 73,
            "text": "Oh wow! Look out boys, when you shoot us and falsely charge us for stabbing a baby or something, you are SO going to get suspended with pay for a month! You just wait!",
            "title_similarity": "0.5589745",
            "sentiment_compound": -0.4545
        },
        {
            "id": "i4a6tcr",
            "score": 659,
            "text": "Lol complete bullshit. It doesn't do anything to overcome qualified immunity which is the real hurdle to suing the cops.",
            "title_similarity": "0.4937221",
            "sentiment_compound": -0.4767
        },
        {
            "id": "i4a2ml1",
            "score": 4513,
            "text": "Sadly also, from the article:\n\n> Whether Thompson will actually get to bring his suit before a jury is still far from guaranteed. He will have to convince the 2nd Circuit that cops lacked probable cause to arrest him, and he will have to overcome qualified immunity, the legal doctrine that shields state and local government actors from federal civil liability if there is no court precedent outlining the alleged misbehavior with a sort of crystalline exactitude. (An example: Two cops in Fresno, California, were shielded from a lawsuit after allegedly stealing $225,000 during the execution of a search warrant, because the plaintiffs could find no court ruling on the books that said stealing under such circumstances violates the Constitution.)",
            "title_similarity": "0.6880553",
            "sentiment_compound": -0.9612
        },
        {
            "id": "i4af6tk",
            "score": 3057,
            "text": "Shouldn’t framing innocent people be, like, a prosecutable offence by default?",
            "title_similarity": "0.6337878",
            "sentiment_compound": 0.4019
        },
        {
            "id": "i4a4q75",
            "score": 5,
            "text": "I should hope so",
            "title_similarity": "0.047874797",
            "sentiment_compound": 0.4404
        },
        {
            "id": "i4a5g5e",
            "score": 2,
            "text": "Let the lawsuits roll!!",
            "title_similarity": "0.5458654",
            "sentiment_compound": -0.2924
        },
        {
            "id": "i4a6yw1",
            "score": 9,
            "text": "I hope you have a lot of money for that lawyer.. poor people are still at a disadvantage when it comes to this. America, it’s about keeping the poor, poor and dragging down a few more every week",
            "title_similarity": "0.41613698",
            "sentiment_compound": -0.8481
        },
        {
            "id": "i4aac2u",
            "score": 12,
            "text": "If you have tons of money for a good lawyer and the cops haven't destroyed any evidence to prove their wrong doing great otherwise business as usual.",
            "title_similarity": "0.52518076",
            "sentiment_compound": 0.7599
        },
        {
            "id": "i4ab4x2",
            "score": 1,
            "text": "Surprise?",
            "title_similarity": "0.17687851",
            "sentiment_compound": 0.2732
        },
        {
            "id": "i4abucg",
            "score": 1,
            "text": "The fact that you “couldn’t” before is criminal.",
            "title_similarity": "0.47599941",
            "sentiment_compound": -0.5267
        },
        {
            "id": "i4ad2ur",
            "score": 1,
            "text": "so wait, if you sue the police and win, do the tax payers still foot the bill?",
            "title_similarity": "0.7498947",
            "sentiment_compound": 0.5859
        },
        {
            "id": "i4adjxk",
            "score": 1,
            "text": "Quite right, if it’s deliberate. \n\nIf they make a genuine mistake then no, but of course, any “framing” and other wrongdoing must be accountable in the same way as anyone else",
            "title_similarity": "0.52177465",
            "sentiment_compound": -0.1779
        },
        {
            "id": "i4adluy",
            "score": 1,
            "text": "I'm truly surprised this isn't something you can do... Y'know, defend your freedom from lies",
            "title_similarity": "0.38248327",
            "sentiment_compound": 0.7351
        },
        {
            "id": "i4adtfy",
            "score": 2,
            "text": "Oh, well thanks Supreme Court that's awfully big of you.",
            "title_similarity": "0.30874732",
            "sentiment_compound": 0.8225
        },
        {
            "id": "i4adxt5",
            "score": 2,
            "text": "“Now, we didn’t say you would actually win the case, but by all means sue and go into debt with lawyer fees.”",
            "title_similarity": "0.59211004",
            "sentiment_compound": -0.2144
        },
        {
            "id": "i4ae3ll",
            "score": 15,
            "text": "Why should I have to? Why is there no governing authority that will hold police accountable for falsely accusing people of crimes for their own benefit?",
            "title_similarity": "0.60464454",
            "sentiment_compound": -0.1235
        },
        {
            "id": "i4ae9pb",
            "score": 2,
            "text": "Wow, it took this long to realize that?",
            "title_similarity": "0.07142228",
            "sentiment_compound": 0.5859
        },
        {
            "id": "i4aez6q",
            "score": 1,
            "text": "The fact that this was even up for debate is telling...",
            "title_similarity": "0.24171431",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4aez9d",
            "score": 11,
            "text": "It is a fairly specific ruling and not unexpected.  It is one of those “I thought it was always the case” kind of things.  \n\nBasically, the Court said that it is not a requirement for these types of cases to be allowed to proceed that a judge or jury actually find the now plaintiff to have been “not guilty” in a criminal case.   In very very few cases do you get a trial resulting in a not guilty verdict.   In the vast majority of instances a decision is made long before a trial that a criminal case should be dismissed.  This ruling confirms that in such situations a person could bring a civil action even though they never went trial.\n\nMind you - that does not mean people who are arrested and charged with a crime swill now have a cause of action to sue if the charges are later dropped.  Far from it.  But, it does mean that they are not precluded from suing.",
            "title_similarity": "0.52477115",
            "sentiment_compound": -0.7171
        },
        {
            "id": "i4ag85w",
            "score": 3,
            "text": "good to know",
            "title_similarity": "0.025810136",
            "sentiment_compound": 0.4404
        },
        {
            "id": "i4agc2j",
            "score": 4,
            "text": "So ridiculous that the supreme court even needs to say this.",
            "title_similarity": "0.46290898",
            "sentiment_compound": 0.204
        },
        {
            "id": "i4aggr6",
            "score": 3,
            "text": "Doesn't mean shit if we can't attack their pockets",
            "title_similarity": "0.34203652",
            "sentiment_compound": 0.6681
        },
        {
            "id": "i4agy03",
            "score": 2,
            "text": "So in the unlikely case where a civilian wins a law suit against a cop, it isn’t personal right? It is a law suit against the police department, not individuals? The game is rigged, because police departments are publicly funded institutions, right? Winning a law suit is just taking our (the people’s) money from ourselves. Correct me if I’m wrong please.",
            "title_similarity": "0.70448524",
            "sentiment_compound": 0.6531
        },
        {
            "id": "i4ah5ju",
            "score": 2,
            "text": "And by \"sue cops\" i'm assuming it means \"sue the population of the city/town that they work in,\" right?",
            "title_similarity": "0.7182392",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4ai08w",
            "score": 6,
            "text": ">\nYet when Thompson attempted to sue the officers involved, he was barred by the U.S. Court of Appeals for the 2nd Circuit: In order to bring such a suit, victims were required to prove that false charges were dropped because the defendants in question had affirmatively proven their innocence.\n\nThis changes the standard to get into a court room.  It does absolutely nothing if the defendant claims qualified immunity.",
            "title_similarity": "0.6864951",
            "sentiment_compound": -0.2023
        },
        {
            "id": "i4ai3nc",
            "score": 89,
            "text": "For those who haven't read:\n\nThe justices that concurred:\n\n* Kavanaugh\n* Roberts\n* Breyer\n* Sotomayor\n* Kagan\n* Barett\n\n\nDissented:\n\n* Alito\n* Thomas\n* Gorsuch",
            "title_similarity": "0.46177465",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4ai5un",
            "score": 3,
            "text": "Good luck",
            "title_similarity": "-0.00488838",
            "sentiment_compound": 0.7096
        },
        {
            "id": "i4ajhzf",
            "score": 2,
            "text": "No one should be immune to the law!",
            "title_similarity": "0.34924868",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4ajwu4",
            "score": 2,
            "text": "If you have five years of your life and fifty thousand dollars to spend on costs, sure you can",
            "title_similarity": "0.19151668",
            "sentiment_compound": 0.3182
        },
        {
            "id": "i4akdy7",
            "score": 2,
            "text": "Oh my god wasn't this a given ?",
            "title_similarity": "0.14826691",
            "sentiment_compound": 0.2732
        },
        {
            "id": "i4aki3w",
            "score": 3,
            "text": "Who is going to cover the bill for the cops, tax payers?",
            "title_similarity": "0.57619095",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4akuoz",
            "score": 1,
            "text": "Well I guess we're about to defund the police ourselves.",
            "title_similarity": "0.62484443",
            "sentiment_compound": 0.2732
        },
        {
            "id": "i4akvic",
            "score": 3,
            "text": "It’s about time. You know how many lives were destroyed from false accusations, being framed, and/or wrongfully arrested? Everyone should be held accountable for their crimes especially the police. If you give police the same punishment or even a more harsh punishment for committing crimes, criminals would than begin to fear the judicial system once more.",
            "title_similarity": "0.72848797",
            "sentiment_compound": -0.9752
        },
        {
            "id": "i4al30l",
            "score": 2,
            "text": "I hope this brings real change! We need to be harder on bad cops!",
            "title_similarity": "0.57669264",
            "sentiment_compound": -0.2924
        },
        {
            "id": "i4al99n",
            "score": 6,
            "text": "That’s cool. How about you just make it illegal to falsify charges?",
            "title_similarity": "0.5219788",
            "sentiment_compound": -0.7506
        },
        {
            "id": "i4alcl0",
            "score": 9,
            "text": "The seizure of money happens all the time. Cops just say they believe the money you have was gained by illegal means and seize it. You need to hire a lawyer and fight the case in court to get your money back. Across the U.S., law enforcement uses a process called civil forfeiture to take property without charging people with a crime. I know it sounds crazy to drive around with $20,000 but you're not breaking the law and if you get stopped by the cops and they search the car or you and find the money you can bet it's going to get taken",
            "title_similarity": "0.742386",
            "sentiment_compound": -0.765
        },
        {
            "id": "i4aliub",
            "score": 6,
            "text": "So cops are just on the streets able to do as they please and no one can really stop them unless by chance a cop did something so bad in the past that a judge could not look the other way.",
            "title_similarity": "0.5030289",
            "sentiment_compound": -0.7081
        },
        {
            "id": "i4almip",
            "score": 1,
            "text": "I’m sorry this question had to go to the Supreme Court. Why is this even a question at all?",
            "title_similarity": "0.480214",
            "sentiment_compound": 0.5106
        },
        {
            "id": "i4alv1a",
            "score": 1,
            "text": "[deleted]",
            "title_similarity": "0.14283061"
        },
        {
            "id": "i4amaai",
            "score": 1,
            "text": "A broken clock...",
            "title_similarity": "0.15096965",
            "sentiment_compound": -0.4767
        },
        {
            "id": "i4amiba",
            "score": 1,
            "text": "should be civil lawsuits. personally targeting. No hiding behind unions.",
            "title_similarity": "0.58765745",
            "sentiment_compound": 0.0742
        },
        {
            "id": "i4amkjh",
            "score": 1,
            "text": "Cool. How do you do that? Sounds like a technicality that is harder to do in principal.",
            "title_similarity": "0.35144022",
            "sentiment_compound": 0.5859
        },
        {
            "id": "i4amsza",
            "score": 2,
            "text": "could..... could we not before?",
            "title_similarity": "0.20122665",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4amwle",
            "score": 3,
            "text": "How this wasn’t a thing before is beyond me. Better late than never I guess. Wow",
            "title_similarity": "0.20848459",
            "sentiment_compound": -0.0444
        },
        {
            "id": "i4amy06",
            "score": 2,
            "text": "No shit",
            "title_similarity": "-0.022442415",
            "sentiment_compound": 0.4449
        },
        {
            "id": "i4an2n9",
            "score": 2,
            "text": "What’s the Statute of limitations?",
            "title_similarity": "0.27647486",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4an4vx",
            "score": 5,
            "text": "This needs saying by the Supreme Court????????",
            "title_similarity": "0.4461022",
            "sentiment_compound": 0.6767
        },
        {
            "id": "i4an7me",
            "score": 2,
            "text": "Regardless,  individuals who are falsely advised generally don't have the financial means to sue",
            "title_similarity": "0.24462497",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4anc15",
            "score": 3,
            "text": "\"golly gee that sure is mighty generous of you Justices..\"",
            "title_similarity": "0.23623078",
            "sentiment_compound": 0.6808
        },
        {
            "id": "i4anjzm",
            "score": 3,
            "text": "could..... could we not before?",
            "title_similarity": "0.20122667",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4anoaa",
            "score": 3,
            "text": "Sounds like they have got this one right at long last !\n\nThe previous state was clearly bonkers..",
            "title_similarity": "0.2462095",
            "sentiment_compound": 0.6696
        },
        {
            "id": "i4anusr",
            "score": 1,
            "text": "Congress already decided this with the civil rights act of 1871. However, 3 years after the passage of the 1964 civil rights act, the supreme court decided to override congresses constitutional authority and created a legal principle called \"qualified immunity\" that protected police from being held accountable.\n\n>The Civil Rights Act of 1871 is a federal statute, numbered 42 U.S.C. § 1983, that allows people to sue the government for civil rights violations. It applies when someone acting \"under color of\" state-level or local law has deprived a person of rights created by the U.S. Constitution or federal statutes\n\n---\n\n>In Pierson v. Ray (1967), the Supreme Court first justified the need for qualified immunity from civil rights violation lawsuits for law enforcement officers by arguing that \"[a] policeman’s lot is not so unhappy that he must choose between being charged with dereliction of duty if he does not arrest when he had probable cause, and being punished with damages if he does.\n\nThe 1967 ruling and subsequent rulings have more or less nullified the protections and recourse granted to Americans by Congress with the passage of the 1871 civil rights act.",
            "title_similarity": "0.64143884",
            "sentiment_compound": 0.3761
        },
        {
            "id": "i4anv7m",
            "score": 4,
            "text": "How is this actively getting downvoted?",
            "title_similarity": "0.28304788",
            "sentiment_compound": 0.3869
        },
        {
            "id": "i4anxnq",
            "score": 2,
            "text": "They won’t be criminally liable, but yeah you can sue them on your own dime.",
            "title_similarity": "0.47968298",
            "sentiment_compound": 0.4215
        },
        {
            "id": "i4ao0tr",
            "score": 2,
            "text": "Doesn’t say how each judge voted…anyone have that breakdown please?",
            "title_similarity": "0.41581768",
            "sentiment_compound": 0.3182
        },
        {
            "id": "i4ao0wl",
            "score": 2,
            "text": "TIL one American can't sue another American for trying to illegally frame them.",
            "title_similarity": "0.5699146",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4ao233",
            "score": 5,
            "text": "Lol yeah because we all know that the justice system holds police accountable……/s",
            "title_similarity": "0.5346131",
            "sentiment_compound": 0.8126
        },
        {
            "id": "i4aobra",
            "score": 2,
            "text": "I never understood why it’s ok for the cops to lie to you in the interrogation room. \n\n“Your friend sold you out for some KFC and a reduce sentence fess up or will blah blah blah trumped up charges.”",
            "title_similarity": "0.7016947",
            "sentiment_compound": 0.5423
        },
        {
            "id": "i4aoesj",
            "score": 3,
            "text": "Halleluja 🙌🏽",
            "title_similarity": "0.062378943",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4aoetk",
            "score": 1,
            "text": "enix",
            "title_similarity": "0.14005151",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4aoo58",
            "score": 3,
            "text": "I don’t think anyone’s main concern is a suit brought against a cop like this more than why a cop like this is allowed to keep their job and face no legal repercussions.",
            "title_similarity": "0.49890628",
            "sentiment_compound": 0.5618
        },
        {
            "id": "i4aow6x",
            "score": 3,
            "text": "About time",
            "title_similarity": "-0.04078513",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4ap696",
            "score": 2,
            "text": "About time - all cops are bad.",
            "title_similarity": "0.46897492",
            "sentiment_compound": -0.5423
        },
        {
            "id": "i4ap7fx",
            "score": 3,
            "text": "You won’t win at all but thanks for clicking",
            "title_similarity": "0.22040033",
            "sentiment_compound": 0.7391
        },
        {
            "id": "i4ap83n",
            "score": 2,
            "text": "ofc Police get all the protection from state",
            "title_similarity": "0.47900218",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4ap8wm",
            "score": 2,
            "text": "That’s good news. It happens more than the general public realizes.",
            "title_similarity": "0.25077572",
            "sentiment_compound": 0.4404
        },
        {
            "id": "i4apjcd",
            "score": 3,
            "text": "Somehow the 4th amendment just doesn’t matter anymore :(",
            "title_similarity": "0.1578238",
            "sentiment_compound": -0.4215
        },
        {
            "id": "i4apky0",
            "score": 2,
            "text": "So, we're a Police State now???  They can do anything and there's no consequences?",
            "title_similarity": "0.37980503",
            "sentiment_compound": -0.4871
        },
        {
            "id": "i4appvf",
            "score": 2,
            "text": "And what if judges work for the police?",
            "title_similarity": "0.70600706",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4apypl",
            "score": 3,
            "text": "RuH Roh!",
            "title_similarity": "0.12365943",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4aq4g2",
            "score": 3,
            "text": "Good!",
            "title_similarity": "-0.009052856",
            "sentiment_compound": 0.4926
        },
        {
            "id": "i4aq6q5",
            "score": 3,
            "text": "Yeah bro this is like staying you can also sue a big pharmacy or big oil etc. Come on guys. Saying something and being able to do it is whole different ball game.",
            "title_similarity": "0.5565604",
            "sentiment_compound": 0.5719
        },
        {
            "id": "i4aqd0n",
            "score": 2,
            "text": "No shit???",
            "title_similarity": "-0.0036761453",
            "sentiment_compound": 0.5368
        },
        {
            "id": "i4aqev8",
            "score": 2,
            "text": "Sue tax payers, not the cops.",
            "title_similarity": "0.59505576",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4aqgn1",
            "score": 2,
            "text": "The insanity is so clear to see, that they would even need to rule this is shameful. Glad they did but it demonstrates how far we have to go to establish good cops as the rule rather than the exception.\n\nAnd some won’t recognize the clear organized corruption when it smacks them in the face",
            "title_similarity": "0.6302084",
            "sentiment_compound": 0.7748
        },
        {
            "id": "i4aqhtj",
            "score": 2,
            "text": "Finally at least some of qualified immunity crumbles.",
            "title_similarity": "0.25500157",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4aqp8z",
            "score": 2,
            "text": "does this also apply to cops who confiscate your property wrongfully thinking it’s involved with illegal activity ?",
            "title_similarity": "0.70604616",
            "sentiment_compound": -0.5574
        },
        {
            "id": "i4aqpz5",
            "score": 2,
            "text": "Why was this even questioned?",
            "title_similarity": "0.15952717",
            "sentiment_compound": -0.1027
        },
        {
            "id": "i4aqvks",
            "score": 2,
            "text": "Yeah no shit didn’t need the Supreme Court to tell me that",
            "title_similarity": "0.3083751",
            "sentiment_compound": 0.8282
        },
        {
            "id": "i4aqvkv",
            "score": 3,
            "text": "So theoretically OJ could sue Mark Furhman?",
            "title_similarity": "0.54703885",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4aqvqj",
            "score": 3,
            "text": "Can you also sue military leaders for implementing Non Judicial Punishment with the appearance of impropriety?",
            "title_similarity": "0.69644403",
            "sentiment_compound": -0.4939
        },
        {
            "id": "i4ar564",
            "score": 10,
            "text": "Qualified immunity and civil forfeiture are cancers on our constitution \n\nBoth should be revoked",
            "title_similarity": "0.5603149",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4arnnj",
            "score": 3,
            "text": "It should be ILLEGAL for cops to frame you on false charges",
            "title_similarity": "0.5494144",
            "sentiment_compound": -0.7531
        },
        {
            "id": "i4arno1",
            "score": 2,
            "text": "Good!! if they can ruin your life by lying, they should be held accountable",
            "title_similarity": "0.6099712",
            "sentiment_compound": -0.7081
        },
        {
            "id": "i4arpuf",
            "score": 1,
            "text": "The US Supreme Court has a compromised majority. As long as we have this group, any \"victory\" for democracy that you hear about from them will be extremely thin or non existent when you actually read into it.",
            "title_similarity": "0.47908825",
            "sentiment_compound": 0.5574
        },
        {
            "id": "i4as2vb",
            "score": 2,
            "text": "The law is a joke. Judges that believe in its inherent legitimacy are nothing more than fools.",
            "title_similarity": "0.52924216",
            "sentiment_compound": 0.6167
        },
        {
            "id": "i4as2vc",
            "score": 2,
            "text": "If you have a police report that is filed without proper investigation then you don't have a right to sue the police. \n\nIt's a terrible law but it's the law.\n\nThat's all I know, I'll never get a good answer out of anyone in Washington.",
            "title_similarity": "0.5350256",
            "sentiment_compound": -0.6321
        },
        {
            "id": "i4ascdr",
            "score": 2,
            "text": "The Supreme Court will be very busy!!!",
            "title_similarity": "0.3425617",
            "sentiment_compound": 0.6679
        },
        {
            "id": "i4asjwj",
            "score": 2,
            "text": "I wonder if the statute of limitations has expired on Det. Mark Fuhrman planting evidence",
            "title_similarity": "0.59034336",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4ass2n",
            "score": 2,
            "text": "This is going to make it harder for cops to do their job! /s",
            "title_similarity": "0.5362578",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4asu3z",
            "score": 2,
            "text": "I called the court about a warrant they told me that I am able to pay it forward a couple of months a couple of months A cop found a broken tail light on my car and said I didn't pay my warrant and sent me to jail what do I do",
            "title_similarity": "0.6059259",
            "sentiment_compound": -0.4946
        },
        {
            "id": "i4asw3u",
            "score": 2,
            "text": "Yeah but we'll pay for it and they won't get in trouble.",
            "title_similarity": "0.2917292",
            "sentiment_compound": 0.438
        },
        {
            "id": "i4atcqz",
            "score": 3,
            "text": "TIL you couldn’t already do this.",
            "title_similarity": "0.20473401",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4atgb7",
            "score": 2,
            "text": "If cops were liable for every case of lying on a police report that they commit, there would be lovely chaos. Too bad it'd never happen.",
            "title_similarity": "0.6284466",
            "sentiment_compound": -0.6808
        },
        {
            "id": "i4atjzc",
            "score": 2,
            "text": "Is this retroactive? I have a lovely case a couple of years old that I beat the charges.",
            "title_similarity": "0.5459498",
            "sentiment_compound": 0.4019
        },
        {
            "id": "i4atrxw",
            "score": 2,
            "text": "(If you can afford the lawyer fees…)",
            "title_similarity": "0.50488293",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4atuw1",
            "score": 2,
            "text": "I think it should be a criminal, not a civil, matter.",
            "title_similarity": "0.5172818",
            "sentiment_compound": -0.5383
        },
        {
            "id": "i4atyb8",
            "score": 2,
            "text": "Supreme Court of where? Chad?",
            "title_similarity": "0.29932582",
            "sentiment_compound": 0.6072
        },
        {
            "id": "i4au45d",
            "score": 2,
            "text": "Why was this even in question?",
            "title_similarity": "0.14439918",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4au62u",
            "score": 2,
            "text": "So kind of you!",
            "title_similarity": "0.060062747",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4au8e7",
            "score": 6,
            "text": "Add judges and prosecutors to that and you can resemble a 1st world country, the US.",
            "title_similarity": "0.5318757",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4auj39",
            "score": 2,
            "text": "As much as this looks like a good change, nothing will actually change until the money comes from the police themselves, rather than the public purse.",
            "title_similarity": "0.5029337",
            "sentiment_compound": 0.6597
        },
        {
            "id": "i4aulhv",
            "score": 2,
            "text": "Man, American justice is kind of a joke...",
            "title_similarity": "0.42826772",
            "sentiment_compound": 0.6808
        },
        {
            "id": "i4auoko",
            "score": 2,
            "text": "Bringing forth what should have been.",
            "title_similarity": "0.1378153",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4av04e",
            "score": 2,
            "text": "Wait… this wasn’t a law before?",
            "title_similarity": "0.16472387",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4aveci",
            "score": 3,
            "text": "1. Individual cops should suffer individual consequences for such acts that are deemed malicious in nature or willfully negligent of their duties.\n\n2. Police Unions should be responsible for any damages/losses incurred by the department when an innocent party faces/faced charges and/or incarceration under bad evidence or false pretenses.\n\n3. Officers who are malicious/negligent should face a minimum penalty of garnishment of wages to be paid to victims SEPARATE from any class action funds; in addition to this a termination of their employment and/or incarceration. If you were to plant evidence that is false imprisonment and is a form of slavery which I would consider an act of treachery against someone’s rights thus punishable by death/life-in-prison with any earned benefits being awarded to the victim and their family (in event victim is deceased).",
            "title_similarity": "0.7487211",
            "sentiment_compound": -0.9274
        },
        {
            "id": "i4avi11",
            "score": 2,
            "text": "Individually?  Or sue the taxpayers in the general area?",
            "title_similarity": "0.61736566",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4avlc7",
            "score": 2,
            "text": "Was that really illegal before?",
            "title_similarity": "0.34927207",
            "sentiment_compound": -0.5984
        },
        {
            "id": "i4avmvp",
            "score": 2,
            "text": "Imagine living in a country where this issue needs to be decided by the supreme court, and thinking you have freedom",
            "title_similarity": "0.5043498",
            "sentiment_compound": 0.8316
        },
        {
            "id": "i4awbtl",
            "score": 2,
            "text": "OK and who is going to enforce this ruling?",
            "title_similarity": "0.32540494",
            "sentiment_compound": 0.4466
        },
        {
            "id": "i4awcq0",
            "score": 2,
            "text": "This.... Is surprising.",
            "title_similarity": "0.09619737",
            "sentiment_compound": 0.2732
        },
        {
            "id": "i4awoq8",
            "score": 3,
            "text": "Ah yes... the broken judicial system which takes care of its own and does “internal investigations” and lets cold blooded killers resign with pension...",
            "title_similarity": "0.6880973",
            "sentiment_compound": -0.5994
        },
        {
            "id": "i4ax2ag",
            "score": 3,
            "text": "But having the resources to prove it?",
            "title_similarity": "0.23567754",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4ax4ex",
            "score": 3,
            "text": "To be honest I thought you could do this anyway if you were able to prove that law enforcement framed you?  Couldn’t the people responsible be arrested for doing something like this?",
            "title_similarity": "0.78841263",
            "sentiment_compound": 0.6553
        },
        {
            "id": "i4axhz5",
            "score": 1,
            "text": "Good fucking luck lol",
            "title_similarity": "0.10395772",
            "sentiment_compound": 0.8508
        },
        {
            "id": "i4ay2ln",
            "score": 3,
            "text": "I just want to irritate this to any person who might read it.\n\nDO NOT EVER SAY ANYTHING TO THE POLICE.\n\nI was brought in twice over false allegations of a horrific crime. One time it was just a fabricated story, the second time they just brought me in for questioning and it was a completely different person.\n\nIf the police come and ask you to come to the station, and you go down be prepared for the worst conversation you will ever have in your life. I live for conversation, like I love talking to people. I cried when I left both times.\n\nThey will try to get you to admit guilt, they will make you repeat yourself over and over and over and over and I said it four times because it's what you're in for. And if you change a single word in your story, they'll pick it up and try to make you admit guilt again. It's fucked beyond fucked. And this will go on for hours.  \n\n\nIf you did wrong, they know it. Admit it. If you are just an innocent person and decide to speak, be prepared for the word games and manipulation that is going to be thrown at you. It's insane and there is no way to prepare for it. The second time I was asked about stuff I gave them my phone and the password to all of my applications. That's when they went, \"Oh...I think he's telling the truth.\".\n\nI left my wife and was dealing with alcohol addiction and they literally said, \"Wow, sounds like you've been through a lot. That's why you did this isn't it?\".\n\nDo not talk to the police.",
            "title_similarity": "0.66446257",
            "sentiment_compound": -0.9501
        },
        {
            "id": "i4ay6xz",
            "score": 2,
            "text": "Woot woot! That’s the sound of tha gavel",
            "title_similarity": "0.31729454",
            "sentiment_compound": 0.7088
        },
        {
            "id": "i4ayi55",
            "score": 2,
            "text": "What DA will determine false charges on the side of the cops if that is the case?\n\nNot guilty?  Well, lost that one.  False charges?  That's up to YOU to prove with your lawyers.  Good luck.",
            "title_similarity": "0.7958209",
            "sentiment_compound": 0.6927
        },
        {
            "id": "i4aykgy",
            "score": 2,
            "text": "Was this not already a thing…",
            "title_similarity": "0.08641553",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4az0zb",
            "score": 2,
            "text": "standby to standby.",
            "title_similarity": "0.10682528",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4az9bp",
            "score": 2,
            "text": "Why wasn’t this done before",
            "title_similarity": "0.15889704",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4b04ow",
            "score": 2,
            "text": "Sounds fair",
            "title_similarity": "0.03868349",
            "sentiment_compound": 0.3182
        },
        {
            "id": "i4b0975",
            "score": 2,
            "text": "Uh, yeah.",
            "title_similarity": "-0.043344673",
            "sentiment_compound": 0.296
        },
        {
            "id": "i4b0fr5",
            "score": 2,
            "text": "I support this, deliberate falsification of evidence is a bad faith act and utterly contrary to the appropriate purpose of a society policing itself. The protections needed for officers of the law to do their duty do not overlap at all with protecting people who frame the innocent.",
            "title_similarity": "0.5702397",
            "sentiment_compound": 0.5267
        },
        {
            "id": "i4b0pnp",
            "score": 2,
            "text": "I am still sickened that sueing is the only firm of accountability. The only people who lose when the police department loses a lawsuit are the tax payers who find the department. There is still no accountability for the officers or the precinct that houses them. So unbelievablely fucked up.",
            "title_similarity": "0.5610793",
            "sentiment_compound": -0.9458
        },
        {
            "id": "i4b0xuz",
            "score": 2,
            "text": "Hmmm people couldn’t before?",
            "title_similarity": "0.15786782",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4b1bbs",
            "score": 2,
            "text": "This won't ever be abused",
            "title_similarity": "0.0797414",
            "sentiment_compound": 0.4023
        },
        {
            "id": "i4b1bdl",
            "score": 2,
            "text": "When justice and common sense cross paths, you wonder why their opponents maintain power without further examination.",
            "title_similarity": "0.58597124",
            "sentiment_compound": 0.5267
        },
        {
            "id": "i4b1e59",
            "score": 2,
            "text": "In other news, crime is now illegal",
            "title_similarity": "0.47699797",
            "sentiment_compound": -0.7964
        },
        {
            "id": "i4b1o8w",
            "score": 3,
            "text": "Is this retroactive? I got a charge from like 20 years ago that I'd love to collect on...",
            "title_similarity": "0.25554907",
            "sentiment_compound": 0.7717
        },
        {
            "id": "i4b1vh9",
            "score": 3,
            "text": "Qualified immunity is a huge part of the reason why cops keep killing innocent black people. Want to know how to put a huge dent in that problem? It’s as simple as holding these cops responsible and sending them to prison the same way you would do with any other murderer.",
            "title_similarity": "0.7408147",
            "sentiment_compound": -0.8126
        },
        {
            "id": "i4b227r",
            "score": 2,
            "text": "Don't we have a separate civil service system for the commoners?",
            "title_similarity": "0.39426902",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4b2rz6",
            "score": 2,
            "text": "Does this work retroactively? Because some cities are about to go bankrupt if that is the case",
            "title_similarity": "0.50619555",
            "sentiment_compound": -0.5574
        },
        {
            "id": "i4b3553",
            "score": 2,
            "text": "the supreme court rules that murder is now ILLEGAL",
            "title_similarity": "0.6136627",
            "sentiment_compound": -0.7531
        },
        {
            "id": "i4b3m2e",
            "score": 2,
            "text": "Still doesnt get rid of qualified immunity, so none of these cops in the case highlighted, or in the future are going to actually get sued.",
            "title_similarity": "0.39071015",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4b3o2f",
            "score": 2,
            "text": "amazing you couldn’t already do that",
            "title_similarity": "0.08972253",
            "sentiment_compound": 0.5859
        },
        {
            "id": "i4b3rtc",
            "score": 2,
            "text": "I thought that was already a thing",
            "title_similarity": "0.07006148",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4b4akh",
            "score": 2,
            "text": "Cops, or the department?",
            "title_similarity": "0.5344462",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4b4bc0",
            "score": 2,
            "text": "The difference between \"can\" and \"able to\".",
            "title_similarity": "0.15707564",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4b4v42",
            "score": 3,
            "text": "Qualified immunity is fascist bullshit.",
            "title_similarity": "0.42577463",
            "sentiment_compound": -0.8126
        },
        {
            "id": "i4b52gg",
            "score": 2,
            "text": "so biden is going to be president during the largest drop in crime in US history? interesting...",
            "title_similarity": "0.43600047",
            "sentiment_compound": -0.4404
        },
        {
            "id": "i4b5epj",
            "score": 2,
            "text": "The South side of Chicago will become more wealthy than Martha’s vineyards in the coming years with this ruling.",
            "title_similarity": "0.29959553",
            "sentiment_compound": 0.4201
        },
        {
            "id": "i4b5fya",
            "score": 2,
            "text": "this really had to go to the fucking supreme court.... wow",
            "title_similarity": "0.43303508",
            "sentiment_compound": 0.8384
        },
        {
            "id": "i4b61jw",
            "score": 2,
            "text": "Thomas dissented. Typical conservatives that side with the government over the individual.",
            "title_similarity": "0.39257485",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4b6ewi",
            "score": 2,
            "text": "But qualified immunity",
            "title_similarity": "0.22595567",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4b6zh4",
            "score": 2,
            "text": "And this needed to be decided by the SC?!?",
            "title_similarity": "0.2699747",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4b73bo",
            "score": 2,
            "text": "Had a cop charge me with all the weed in the car so it would amount to a felony even though it came from different people's pockets. I wonder if this qualifies.  My lawyer took my 3k and laughed at me.",
            "title_similarity": "0.65502673",
            "sentiment_compound": -0.128
        },
        {
            "id": "i4b73il",
            "score": 2,
            "text": "Finally.",
            "title_similarity": "-0.04147658",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4b740z",
            "score": 2,
            "text": "Gee. Thanks Supreme Court. I am so thankful that you’d give me such a basic right in law. Never mind the fact that proving you have been framed likely won’t even happen in your lifetime. You know. After you have spent 50 years in prison.",
            "title_similarity": "0.4060889",
            "sentiment_compound": 0.8377
        },
        {
            "id": "i4b79vk",
            "score": 2,
            "text": "This headline is a joke, everyone has always been able to sue cops who frame people on false charges.  The decision is notable for other reasons, but the headline is completely misleading.",
            "title_similarity": "0.7206954",
            "sentiment_compound": -0.6046
        },
        {
            "id": "i4b7nhs",
            "score": 2,
            "text": "Now can we take that money out of the pensions of the police instead of our taxes? That'd be great",
            "title_similarity": "0.54558194",
            "sentiment_compound": 0.6249
        },
        {
            "id": "i4b7qzd",
            "score": 2,
            "text": "Best be coming from the cops pocket and not the taxpayer",
            "title_similarity": "0.51964116",
            "sentiment_compound": 0.6369
        },
        {
            "id": "i4b84hh",
            "score": 2,
            "text": "Does it matter? Since the cops and department aren’t the ones paying the fines and the tax payers getting stuck with the bill, this won’t stop them.",
            "title_similarity": "0.4846442",
            "sentiment_compound": -0.4767
        },
        {
            "id": "i4b8crl",
            "score": 2,
            "text": "👏🏾👏🏾👏🏾👏🏾I APPLAUD THIS IF TRUE!! Go after that Police Pension, Estate money, Insurance Money!!  ALL THEM LYING KILLING COPS NEED TO BE BROKE!!",
            "title_similarity": "0.682871",
            "sentiment_compound": -0.8272
        },
        {
            "id": "i4b8s6p",
            "score": 2,
            "text": "Of course you can sue cops that frame you on false charges. The challenge comes from convincing the courts that.",
            "title_similarity": "0.9229369",
            "sentiment_compound": 0.2263
        },
        {
            "id": "i4b950b",
            "score": 2,
            "text": "What about FBI?",
            "title_similarity": "0.4555953",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4b97lw",
            "score": 3,
            "text": "No more planting drugs in person’s car. /s",
            "title_similarity": "0.44862363",
            "sentiment_compound": -0.296
        },
        {
            "id": "i4b997t",
            "score": 2,
            "text": "What a novel concept!",
            "title_similarity": "0.14932169",
            "sentiment_compound": 0.3802
        },
        {
            "id": "i4b9hae",
            "score": 3,
            "text": "This just became a law??? WTF!!!!",
            "title_similarity": "0.3346023",
            "sentiment_compound": -0.8042
        },
        {
            "id": "i4b9igc",
            "score": 2,
            "text": "So this is a new thing in the US, huh?",
            "title_similarity": "0.27564913",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4b9lgr",
            "score": 2,
            "text": "Even capitol police?",
            "title_similarity": "0.44655576",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4b9w1c",
            "score": 2,
            "text": "I was actually falsely arrested before! I was at home and they knocked on the door, when I answered they told me I was under arrest. I asked them multiple times why I was being arrested and they would not answer me, I kept telling them I knew I had not done anything but of course they didn’t care a bit.\n\nWhen we finally got to the police station I told them I knew I shouldn’t be there that there had to be a mistake somewhere, but no one would listen. I had to go through the whole booking process and sit there for six hours before I was told that it was a mistake and that they were “sorry”.  I was around 22 and completely upset, and was scared I would actually be stuck in jail for no reason at all, but at least they were sorry!",
            "title_similarity": "0.49481586",
            "sentiment_compound": -0.9703
        },
        {
            "id": "i4ba4ts",
            "score": 3,
            "text": "Any police officer, or officer of the Court, who provides false testimony or false evidence in a criminal matter, shall be convicted of falsifying a crime and sentenced to the maximum permissible sentence for the crime in which they are attempting to falsify.\n\nYou falsify the crime? You do the time.",
            "title_similarity": "0.7917234",
            "sentiment_compound": -0.9618
        },
        {
            "id": "i4baef4",
            "score": 2,
            "text": "Why was that even a question?",
            "title_similarity": "0.124775454",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4bafu1",
            "score": 2,
            "text": "But the charges are real, only the evidence and testimony were faked.",
            "title_similarity": "0.5247908",
            "sentiment_compound": -0.3919
        },
        {
            "id": "i4bakv2",
            "score": 2,
            "text": "You couldn't before? Yuck",
            "title_similarity": "0.16920486",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4batwp",
            "score": 2,
            "text": "And yes, to be clear, until this ruling it was not possible to sue a cop for intentionally framing you. Now can we eliminate qualified immunity?",
            "title_similarity": "0.58090097",
            "sentiment_compound": 0.6486
        },
        {
            "id": "i4bbqzh",
            "score": 9,
            "text": "At 20 I was D1 scholarship athlete. I was wrongly charged as a felon for “assault with intent to harm on a police office”. It derailed my life.\nAfter spending a year on conditional,probation as I went through the legal system I finally got better council. It was Felony assault with intent to harm because the off-duty officer broke his hand punching me in the face. Ruined my life for about 10yrs.\nAll I got was a life lesson in resilience as compensation.",
            "title_similarity": "0.5932083",
            "sentiment_compound": -0.9501
        },
        {
            "id": "i4bcy6j",
            "score": 3,
            "text": "So? It’s not the cops paying the money it’s department, aka tax dollars. Then the cop will just go back into the streets",
            "title_similarity": "0.53900766",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4bdquf",
            "score": 8,
            "text": "So that Texas lady who got charged with fucking murder for an abortion has a really good case right now.",
            "title_similarity": "0.5378891",
            "sentiment_compound": -0.5574
        },
        {
            "id": "i4be57b",
            "score": 2,
            "text": "This is excellent news!",
            "title_similarity": "0.060538985",
            "sentiment_compound": 0.6114
        },
        {
            "id": "i4be8h1",
            "score": 5,
            "text": "You mean the police can't ruin innocent people's lives with complete impunity? How will they ever be able to do their jobs?\n\n/s",
            "title_similarity": "0.6124592",
            "sentiment_compound": 0.3391
        },
        {
            "id": "i4bek62",
            "score": 3,
            "text": "That it takes the most senior court in the land to determine this....sheesh.\n\nI wonder if anyone will actually attempt it.",
            "title_similarity": "0.3387862",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4berv2",
            "score": 2,
            "text": "[r/nottheonion](https://www.reddit.com/r/nottheonion/)",
            "title_similarity": "0.3111043",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4bfc8p",
            "score": 4,
            "text": "So you can sue them but they still get paid leave? The problem was how institutions favor police and allow individuals to get away with brutality and abuse without having to worry about losing their job, let alone going to jail. I don’t see how the ability to sue would help that.",
            "title_similarity": "0.64678",
            "sentiment_compound": -0.8196
        },
        {
            "id": "i4bfpym",
            "score": 3,
            "text": "> Whether Thompson will actually get to bring his suit before a jury is still far from guaranteed. He will have to convince the 2nd Circuit that cops lacked probable cause to arrest him, and he will have to overcome qualified immunity, the legal doctrine that shields state and local government actors from federal civil liability if there is no court precedent outlining the alleged misbehavior with a sort of crystalline exactitude.\n\nImportant paragraph.",
            "title_similarity": "0.67773366",
            "sentiment_compound": -0.2732
        },
        {
            "id": "i4bfvbm",
            "score": 2,
            "text": "... was that not possible before? Why wouldn't that already be a thing?",
            "title_similarity": "0.17798465",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4bg9in",
            "score": 2,
            "text": "Didn’t realize this was in question, but it fucking figures.",
            "title_similarity": "0.2587061",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4bgf8t",
            "score": 2,
            "text": "Good",
            "title_similarity": "-0.0046938267",
            "sentiment_compound": 0.4404
        },
        {
            "id": "i4bh3sc",
            "score": 2,
            "text": "Ppl as np",
            "title_similarity": "0.12556884",
            "sentiment_compound": 0.34
        },
        {
            "id": "i4bh4dt",
            "score": 2,
            "text": "SURE SUE AWAY. Doesn't mean you'll win shit though. Considering the number of police that have been found guilty of murder over the last 40 years (it's practically zero)",
            "title_similarity": "0.47983885",
            "sentiment_compound": -0.8965
        },
        {
            "id": "i4biq8f",
            "score": 3,
            "text": "It's about time! Right now the law let's them get away with murder",
            "title_similarity": "0.65536726",
            "sentiment_compound": -0.7177
        },
        {
            "id": "i4bjkm7",
            "score": 2,
            "text": "No sh!t !",
            "title_similarity": "0.025639253",
            "sentiment_compound": -0.4184
        },
        {
            "id": "i4bjlqy",
            "score": 3,
            "text": "YOU COULDNT DO THAT BEFORE WHAT THE fuck you K",
            "title_similarity": "0.21774527",
            "sentiment_compound": -0.5423
        },
        {
            "id": "i4bk18v",
            "score": 2,
            "text": "Seems fair.",
            "title_similarity": "0.009415811",
            "sentiment_compound": 0.3182
        },
        {
            "id": "i4bk6tz",
            "score": 2,
            "text": "Haha, looks like the majority of the LAPD would need some good lawyers. 😂 Even back-tracking, too.",
            "title_similarity": "0.53811514",
            "sentiment_compound": 0.8834
        },
        {
            "id": "i4bk7hu",
            "score": 2,
            "text": "In America, you can sue literally anyone for anything. It's up to a judge to decide if the case holds any weight.. for those who don't believe me, flip it over to judge Judy",
            "title_similarity": "0.6894038",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4bkk5l",
            "score": 1,
            "text": "[deleted]",
            "title_similarity": "0.14283061"
        },
        {
            "id": "i4bl39d",
            "score": 2,
            "text": "You CAN sue them, doesn't mean its actually going to go anywhere unless you've got enough money in the first place.",
            "title_similarity": "0.47680545",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4bl6vu",
            "score": 2,
            "text": "So, to clarify, it took going to the highest court of the most powerful nation on earth to decide that someone can sue a person that commits felony fraud against you with the intention of imprisoning you?\n\nThis fucking country.",
            "title_similarity": "0.7458547",
            "sentiment_compound": -0.6258
        },
        {
            "id": "i4bnqq2",
            "score": 1,
            "text": "\"Can\" looks like it's doing a *lot* of heavy lifting in this headline.",
            "title_similarity": "0.35119486",
            "sentiment_compound": 0.3612
        },
        {
            "id": "i4bo09t",
            "score": 2,
            "text": "Oh that’s not a thing already???? \n\nDamn",
            "title_similarity": "0.05439533",
            "sentiment_compound": -0.5661
        },
        {
            "id": "i4bo24u",
            "score": 2,
            "text": "That’s a huge development. I’m sure states will race to cap damages.",
            "title_similarity": "0.4869912",
            "sentiment_compound": 0.1779
        },
        {
            "id": "i4bowat",
            "score": 2,
            "text": "The article probably doesn't say that if you have no money you have no rights",
            "title_similarity": "0.25508276",
            "sentiment_compound": -0.5267
        },
        {
            "id": "i4bpgzy",
            "score": 2,
            "text": "The fact that the Supreme Court even had to rule on this is the tragedy here. Being free from false charges should be a given.",
            "title_similarity": "0.58066434",
            "sentiment_compound": 0.1027
        },
        {
            "id": "i4bplb2",
            "score": 2,
            "text": "It’s 2022, 276 years after the beginning of this country, and we’re just coming to this conclusion now?!",
            "title_similarity": "0.13442916",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4bpnq2",
            "score": 2,
            "text": "This is a fantastic step in the right direction",
            "title_similarity": "0.066732496",
            "sentiment_compound": 0.5574
        },
        {
            "id": "i4bppvm",
            "score": 2,
            "text": "Well I’m glad we had to waste a bunch of time and money on something so fucking obvious.",
            "title_similarity": "0.40160036",
            "sentiment_compound": 0.3182
        },
        {
            "id": "i4br7y0",
            "score": 2,
            "text": "Well, the freedom is starting to get loud again. Nothing like the screech of the falcon to let you know America is resurfacing.",
            "title_similarity": "0.31203622",
            "sentiment_compound": 0.6358
        },
        {
            "id": "i4br8lk",
            "score": 4,
            "text": "I can’t believe people say we live in a democracy with a straight face. \n\n* best case scenario: All you have to do is pony up legal fees, which is precisely the thing that you don’t have if you’re The most vulnerable demographic",
            "title_similarity": "0.5669904",
            "sentiment_compound": 0.6605
        },
        {
            "id": "i4brbku",
            "score": 2,
            "text": "So does the mean the cops have to pay personally or is it still coming out of taxes and no-one in charge actually faces any penalty? Crappy governments love doling out multi-million dollar settlements, since it is never their money personally.",
            "title_similarity": "0.5103392",
            "sentiment_compound": -0.4215
        },
        {
            "id": "i4brgix",
            "score": 2,
            "text": "Republicans are gonna be seething",
            "title_similarity": "0.34808975",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4bsfbu",
            "score": 2,
            "text": "I couldn't before?",
            "title_similarity": "0.14171831",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4bsjee",
            "score": 2,
            "text": "Fucking _Kavanaugh_ wrote this opinion?!",
            "title_similarity": "0.37115437",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4bslxp",
            "score": 2,
            "text": "When I'm God-Emperor of America there's going to a huge division of the FBI that exists solely to do shit to federal judges that those judges have said is permissible.\n\nI'm sorry, Justice Roberts, but there's no clearly established case law that says that cops can't fill your house with tonnato sauce.\n\n*next day*\n\nI'm sorry, Justice Roberts, there's no clearly established case law that says cops can't pump your basement full of puttanesca sauce.\n\n*next day*\n\nI'm sorry, Justice Roberts, there's never been a case that clearly established that cops can't paint all your walls with a souplike homogenate made from processing mice through a Polytron.",
            "title_similarity": "0.57490396",
            "sentiment_compound": 0.8164
        },
        {
            "id": "i4bt09v",
            "score": 2,
            "text": "For some reason, I’m really surprised by this decision",
            "title_similarity": "0.16650613",
            "sentiment_compound": 0.2944
        },
        {
            "id": "i4bt1kj",
            "score": 2,
            "text": "Hey they got one right",
            "title_similarity": "0.042659797",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4btc8r",
            "score": 1,
            "text": "As they should be sued…but The craziest part is that tax payer money/ budgeting is where the money comes from when these suits are settled…so this doesn’t seem to solve the root problem or deter it from occurring in the future.",
            "title_similarity": "0.56245476",
            "sentiment_compound": -0.2732
        },
        {
            "id": "i4btchc",
            "score": 1,
            "text": "Black Americans are about to be rich af 🤣",
            "title_similarity": "0.24984235",
            "sentiment_compound": 0.7783
        },
        {
            "id": "i4btf9x",
            "score": 1,
            "text": "thats fair...\nat least one can sue who ever is been discriminate dealing with issues related to racism",
            "title_similarity": "0.6212543",
            "sentiment_compound": -0.4215
        },
        {
            "id": "i4btrdr",
            "score": 1,
            "text": "We need a SC decision to protect ourselves from false charges? Epic.",
            "title_similarity": "0.57646143",
            "sentiment_compound": 0.128
        },
        {
            "id": "i4btyp8",
            "score": 1,
            "text": "Looking forward to Julian Assange getting his day in court.",
            "title_similarity": "0.41721666",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4bv3hf",
            "score": 2,
            "text": "The most annoying thing when you read about some criminal cases is when they charge you with resisting arrest and no other charge.  So basically the copy stopped you, he thought you were rude, and then beat you up while arresting you for nothing.",
            "title_similarity": "0.7032262",
            "sentiment_compound": -0.9312
        },
        {
            "id": "i4bvake",
            "score": 2,
            "text": "Sure, now find me a judge who would ever rule in favor of someone accusing a cop of misconduct.",
            "title_similarity": "0.7937646",
            "sentiment_compound": 0.5106
        },
        {
            "id": "i4bvbvd",
            "score": 2,
            "text": "Well since this is in America you can already sue anyone for anything at any time sooo….",
            "title_similarity": "0.493913",
            "sentiment_compound": 0.2732
        },
        {
            "id": "i4bvcuy",
            "score": 1,
            "text": "The question is will there be consequences for those that frame on false charges. Justice system seems to side more with the police than the people.",
            "title_similarity": "0.66706157",
            "sentiment_compound": 0.3182
        },
        {
            "id": "i4bvw50",
            "score": 1,
            "text": "We couldn't do this before ?",
            "title_similarity": "0.16870156",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4bvwz4",
            "score": 1,
            "text": "Nice you have permission now dear Americans, I really envy you, really... Not.",
            "title_similarity": "0.24070168",
            "sentiment_compound": 0.4601
        },
        {
            "id": "i4bw0eh",
            "score": 1,
            "text": "What’s the of point suing a  single cop when you can sue the whole precinct?",
            "title_similarity": "0.80380124",
            "sentiment_compound": -0.2732
        },
        {
            "id": "i4bw5pt",
            "score": 1,
            "text": "Crazy that this was articulated in 2022 and not say, 1777",
            "title_similarity": "0.17231855",
            "sentiment_compound": -0.34
        },
        {
            "id": "i4bwi0r",
            "score": 1,
            "text": "You can sue anyone for anything, doesn’t mean you’ll win or even be taken serious.",
            "title_similarity": "0.4968939",
            "sentiment_compound": 0.5423
        },
        {
            "id": "i4bwxye",
            "score": 2,
            "text": "Im one for the blue line, however I am very happy that this law has been passed. I didn’t even know that this wasn’t a law in the US, but its a W, because now cops can be far better trusted to protect the public.",
            "title_similarity": "0.37662375",
            "sentiment_compound": 0.9312
        },
        {
            "id": "i4bwy8r",
            "score": 7,
            "text": "The most fucked up thing from that article:\n\n>An example: Two cops in Fresno, California, were shielded from a lawsuit after allegedly stealing $225,000 during the execution of a search warrant, because the plaintiffs could find no court ruling on the books that said stealing under such circumstances violates the Constitution.\n\nSo basically all things are legal until a legal precedent says is not?",
            "title_similarity": "0.6175636",
            "sentiment_compound": -0.9552
        },
        {
            "id": "i4bx76t",
            "score": 1,
            "text": "Uh finally!",
            "title_similarity": "-0.033144075",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4bxysb",
            "score": 1,
            "text": "Lol this is hilarious well of course…",
            "title_similarity": "0.16720745",
            "sentiment_compound": 0.765
        },
        {
            "id": "i4bygno",
            "score": 2,
            "text": "Qualified immunity still a thing? Cool, let me know when it’s not.",
            "title_similarity": "0.2837144",
            "sentiment_compound": 0.3182
        },
        {
            "id": "i4bz9cb",
            "score": 2,
            "text": "No shit",
            "title_similarity": "-0.022442415",
            "sentiment_compound": 0.4449
        },
        {
            "id": "i4bz9uc",
            "score": 2,
            "text": "This is a good step except it’s still the taxpayers footing the bill of the lawsuit",
            "title_similarity": "0.47636807",
            "sentiment_compound": 0.25
        },
        {
            "id": "i4bzpoq",
            "score": 2,
            "text": "USA, welcome to the 21st century.",
            "title_similarity": "0.14306638",
            "sentiment_compound": 0.4588
        },
        {
            "id": "i4bzq40",
            "score": 2,
            "text": "Fuck the police. Pack of violent criminals at best.",
            "title_similarity": "0.6131104",
            "sentiment_compound": -0.7845
        },
        {
            "id": "i4c0plz",
            "score": 2,
            "text": "All Cops Are Bastards. They should be sued for being bastards.",
            "title_similarity": "0.6088873",
            "sentiment_compound": -0.8402
        },
        {
            "id": "i4c0z40",
            "score": 2,
            "text": "I may not know the backstop to this one since I have been enjoying the overwhelming privilege of living in the non-US western world, but to me it seems kind of sketchy that the US need their highest court to say you can persecute police officers committing crimes",
            "title_similarity": "0.6513195",
            "sentiment_compound": -0.1901
        },
        {
            "id": "i4c12np",
            "score": 2,
            "text": "Good, I wish the government in the UK would allot that. When the police fuck in the UK, the police force pays the compensation, with taxpayers money. If the police officers knew that they could be sued, as an individual, then there would be less cover ups and less corruption.",
            "title_similarity": "0.600934",
            "sentiment_compound": 0.2732
        },
        {
            "id": "i4c2764",
            "score": 3,
            "text": "Jesus, we had to bring this to the Supreme Court?  And they had to vote on it?",
            "title_similarity": "0.55418915",
            "sentiment_compound": 0.6072
        },
        {
            "id": "i4c281a",
            "score": 3,
            "text": "Hold on just a second.\n\nYou’re telling me all those times the police sprinkled a little cocaine around the crime scene… that was illegal?!",
            "title_similarity": "0.6773293",
            "sentiment_compound": -0.8122
        },
        {
            "id": "i4c3ugk",
            "score": 3,
            "text": "In other news, crime is illegal",
            "title_similarity": "0.48088717",
            "sentiment_compound": -0.7964
        },
        {
            "id": "i4c4407",
            "score": 6,
            "text": "In case anyone needs a reminder,  ALWAYS have a litigation lawyer's number in your phone. Look for one that's a known bulldog that hates cops. Those guys are absolutely HATED by the cop unions and they crush cops' financial lives. \nThose lawyers love suing crooked/lying cops. If you can't prosecute cops, you can still sue them into the dirt. Make them bleed $$$ until the end of time. Think of child support...but forever...and it all goes into your pocket or your favorite charity.\nHit them where it hurts!",
            "title_similarity": "0.6688775",
            "sentiment_compound": -0.7059
        },
        {
            "id": "i4c4cxu",
            "score": 5,
            "text": "Now all u have to do is be able to prove it.",
            "title_similarity": "0.24859174",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4c4mvb",
            "score": 3,
            "text": "r/nottheonion   \n\n\nI mean...",
            "title_similarity": "0.13991271",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4c5b93",
            "score": 3,
            "text": "\"Good thing we don't believe in false charges.\"\n\n-The police",
            "title_similarity": "0.4370785",
            "sentiment_compound": 0.2023
        },
        {
            "id": "i4c7k5x",
            "score": 6,
            "text": "We needed the Supreme Court to figure this out???",
            "title_similarity": "0.4775246",
            "sentiment_compound": 0.6298
        },
        {
            "id": "i4c82ot",
            "score": 3,
            "text": "Part of the problem is some departments set arrest quotas.",
            "title_similarity": "0.5426429",
            "sentiment_compound": -0.6249
        },
        {
            "id": "i4c90b4",
            "score": 4,
            "text": "Yeah, but local court says: \"Ha-ha-ha. Go fuck yourself!\"",
            "title_similarity": "0.66273975",
            "sentiment_compound": -0.6643
        },
        {
            "id": "i4cb61k",
            "score": 3,
            "text": "Thanks for the update, (t)reason.com",
            "title_similarity": "0.24358487",
            "sentiment_compound": 0.4404
        },
        {
            "id": "i4cb6qw",
            "score": 3,
            "text": "People being executed with false evidence.",
            "title_similarity": "0.65991914",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4cdm9k",
            "score": 3,
            "text": "*\"I felt a great disturbance in the Force, as if millions of* ***bootlickers*** *suddenly cried out in terror and were suddenly silenced.\"*",
            "title_similarity": "0.48351324",
            "sentiment_compound": -0.5423
        },
        {
            "id": "i4cdsgd",
            "score": 3,
            "text": "Well I would hope so",
            "title_similarity": "0.03654234",
            "sentiment_compound": 0.6124
        },
        {
            "id": "i4cemtn",
            "score": 3,
            "text": "And all the reps are going, \"SUPREME COURT IS CORRUPT.\"",
            "title_similarity": "0.7089462",
            "sentiment_compound": 0.6523
        },
        {
            "id": "i4cf257",
            "score": 3,
            "text": "Wait, you couldn’t before?",
            "title_similarity": "0.14845872",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4cf3sg",
            "score": 6,
            "text": "Bet you dollars to donuts, if anyone even TRIES to do this, the cops will begin harassing and intimidating the person and their family.  Nothing but a bunch of fucking thugs.",
            "title_similarity": "0.64985096",
            "sentiment_compound": -0.4939
        },
        {
            "id": "i4cg92w",
            "score": 6,
            "text": "Now do prosecutors who withhold evidence",
            "title_similarity": "0.5946736",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4cgwdi",
            "score": 3,
            "text": "key word here \"says\". When it comes to it, you will lose every suit.",
            "title_similarity": "0.38478786",
            "sentiment_compound": -0.4019
        },
        {
            "id": "i4chg8r",
            "score": 3,
            "text": "Wait, this wasn’t a thing before?",
            "title_similarity": "0.055012483",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4chry8",
            "score": 3,
            "text": "It is sad that it’s not considered common sense.",
            "title_similarity": "0.19743252",
            "sentiment_compound": -0.4767
        },
        {
            "id": "i4cic9o",
            "score": 3,
            "text": "Weird we needed the Supreme Court to tell us that.",
            "title_similarity": "0.5130962",
            "sentiment_compound": 0.4404
        },
        {
            "id": "i4cjlhz",
            "score": 4,
            "text": "I would rather sue the police pension since that’s where the money is.  Plus it would enact change by ensuring compliance with the laws they are sworn to protect",
            "title_similarity": "0.6471929",
            "sentiment_compound": 0.5719
        },
        {
            "id": "i4cjmlk",
            "score": 2,
            "text": "Good luck",
            "title_similarity": "-0.00488838",
            "sentiment_compound": 0.7096
        },
        {
            "id": "i4cl5lf",
            "score": 2,
            "text": "You can try, justice system always finds a way",
            "title_similarity": "0.3399251",
            "sentiment_compound": 0.5267
        },
        {
            "id": "i4clxtc",
            "score": 3,
            "text": "Sue them and take the money out of their pension fund. Once they pass that, I bet you every cop will walk a straight line and the ones that don’t will be ratted out.",
            "title_similarity": "0.6702959",
            "sentiment_compound": 0.2263
        },
        {
            "id": "i4cn30o",
            "score": 3,
            "text": "Nice, now they will just shoot me",
            "title_similarity": "0.48749423",
            "sentiment_compound": 0.1027
        },
        {
            "id": "i4ctdiu",
            "score": 2,
            "text": "And you -can-  fly on a private jet any where in the world. But can -you- though?",
            "title_similarity": "0.2254889",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4ctl22",
            "score": 2,
            "text": "Generally you get what you play for!",
            "title_similarity": "0.15357342",
            "sentiment_compound": 0.4003
        },
        {
            "id": "i4ctwy8",
            "score": 3,
            "text": "Now only if they said that civil asset forfeiture was also unconstitutional and ended the practice entirely... you know, because it is.",
            "title_similarity": "0.5499402",
            "sentiment_compound": 0.3612
        },
        {
            "id": "i4cundl",
            "score": 3,
            "text": "What's the statue of limitations? Lmfao courts are about to be sooo busy",
            "title_similarity": "0.39988703",
            "sentiment_compound": 0.5423
        },
        {
            "id": "i4cuod3",
            "score": 3,
            "text": "About goddamn time.",
            "title_similarity": "0.008329488",
            "sentiment_compound": -0.4767
        },
        {
            "id": "i4cw7jr",
            "score": 3,
            "text": "You can sue anybody over anything, question is will you win.",
            "title_similarity": "0.51222885",
            "sentiment_compound": 0.5859
        },
        {
            "id": "i4cwopz",
            "score": 3,
            "text": "The problem is, how are you going to get a lawsuit together if you’re in jail/prison? And how is the verdict going to change if you were already framed to begin with?",
            "title_similarity": "0.65886235",
            "sentiment_compound": -0.5204
        },
        {
            "id": "i4cx4f0",
            "score": 2,
            "text": "Wasn’t this just, you know, standard?",
            "title_similarity": "0.068205",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4cyn7g",
            "score": 3,
            "text": "Wow. So many upvotes for a story from a radical right wing big website. /s\n\nPathetic.",
            "title_similarity": "0.4545166",
            "sentiment_compound": 0.0258
        },
        {
            "id": "i4cyt6d",
            "score": 2,
            "text": "Oof. A complex area of law being reduced to a truism. You could always sue an officer for fabricating evidence, the issue resolved by the court was the standard by which is had to be proved to survive summary judgment.",
            "title_similarity": "0.6968309",
            "sentiment_compound": 0.1779
        },
        {
            "id": "i4czge7",
            "score": 3,
            "text": "Really? We needed the Supreme Court to tell us this?",
            "title_similarity": "0.50265324",
            "sentiment_compound": 0.6072
        },
        {
            "id": "i4d0000",
            "score": 2,
            "text": "Good. Hopefully this applies to the FBI.",
            "title_similarity": "0.3835745",
            "sentiment_compound": 0.6808
        },
        {
            "id": "i4d0v46",
            "score": 2,
            "text": "Will the cop have to pay or the department use tax dollars",
            "title_similarity": "0.54751664",
            "sentiment_compound": -0.1027
        },
        {
            "id": "i4d1ceb",
            "score": 2,
            "text": "That's good, but why was suing cops who framed you on false charges not legally feasible in the first place? Makes me wonder what other offenses cops are legally immune from.",
            "title_similarity": "0.6950971",
            "sentiment_compound": -0.5638
        },
        {
            "id": "i4d3li0",
            "score": 3,
            "text": "Based",
            "title_similarity": "0.003128402",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4d4zgy",
            "score": 2,
            "text": "Why should the general tax payer be on the hook for bad police. They should have to carry their own insurance and liability. Sure would make a lot of them watch what and how they do things. Not all cops are bad, but the 5 percent taint the whole batch.",
            "title_similarity": "0.60979307",
            "sentiment_compound": -0.5023
        },
        {
            "id": "i4d57mx",
            "score": 2,
            "text": "Then the cop will claim “qualified immunity” because framing innocent people is part of their job as long as they smile when they do it.",
            "title_similarity": "0.6805234",
            "sentiment_compound": 0.5994
        },
        {
            "id": "i4d5ikc",
            "score": 2,
            "text": "This is gonna a shit show. It was already a thing before hand. Something completely capable of being resolved by current laws. Just like other things that keep cropping up. The true problem is lawyers and old precedents (and some laws) from decades and centuries ago. Though it is true some laws are bad just in principle. But if you ever look at the laws you'll see alot that are ridiculous and often ignored. Heck. There's a law in a place I've been that is still on the books that no one can have free range chickens! Guess how many people have them. \n\nDozens. And how many are fined or jailed? None.",
            "title_similarity": "0.5316834",
            "sentiment_compound": -0.648
        },
        {
            "id": "i4d5nj1",
            "score": 3,
            "text": "Cool, now let's do politicians.",
            "title_similarity": "0.39136901",
            "sentiment_compound": 0.3182
        },
        {
            "id": "i4d6ksz",
            "score": 1,
            "text": "Wait. Can you sue the officers personally? Or sue the police department (the legal fees of which are paix by the taxpayers)??",
            "title_similarity": "0.75095606",
            "sentiment_compound": 0.2593
        },
        {
            "id": "i4d6li3",
            "score": 2,
            "text": "Law enforcement should be held to a higher standard than the average citizen. Committing a crime via abusing your position as an enforcer of the law should be met with the same punishment, if not, a more severe punishment than that of a civilian.",
            "title_similarity": "0.5728947",
            "sentiment_compound": -0.888
        },
        {
            "id": "i4daw1c",
            "score": 2,
            "text": "That’s nice but it’s rarely practical, even if possible.  I was charged fraudulently, proved it in court, had every judge in the courthouse sign my case dismissal to send a message, the prosecutor quit his job and my arrest was expunged.  The local news picked it up too.\n\nFirst: most of the cops are smart enough to leave themselves an out via qualified immunity.  In my case the lying cop gave his statement to another cop who then filed the affidavit based on the lying cop being an informant.  So the cop that wrote the affidavit can claim qualified immunity because his informant was law enforcement and he had reasons to trust him.  The lying cop wasn’t swearing to anything under threat of perjury, so he’s safe too.\n\nQualified immunity means that fraudulently charged people have less than 50% chance to start with.  Case law is in favor of the cops in every US district.  A lawyer will want a retainer.  Those retainers averaged $50k in my case.  Damages would almost certainly be limited to my actual losses: $15k in defense attorney fees.  So I could have sued: that would have cost me $50k to get a 50/50 chance at winning $15k.  No attorney felt that any punitive damages would be possible.  Eastern District of Virginia but I hear it applies most places.  I then tried the ACLU (nope) and the FBI Civil Rights Division (nope).  I finally filed a complaint with Internal Affairs (Fairfax County) and they interviewed me and informed me of “no action” after six months.\n\nThe cop who wrote the affidavit was transferred to a better department (sort of a lateral promotion) and given a statewide award the next year.  The lying cop “informant” was promoted.",
            "title_similarity": "0.76173633",
            "sentiment_compound": -0.954
        },
        {
            "id": "i4dcz3g",
            "score": 3,
            "text": "Now make the cops actually pay for it instead of the tax payers or nothing is gonna change",
            "title_similarity": "0.66278243",
            "sentiment_compound": -0.1027
        },
        {
            "id": "i4degp0",
            "score": 2,
            "text": "Everyone should share this to make it widely known - hopefully if they know everyone knows, they’ll be less likely to do it",
            "title_similarity": "0.35429177",
            "sentiment_compound": 0.5994
        },
        {
            "id": "i4dm12t",
            "score": 1,
            "text": "It’s crazy that this even needs to be said.",
            "title_similarity": "0.20494667",
            "sentiment_compound": -0.34
        },
        {
            "id": "i4drio5",
            "score": 1,
            "text": "Duh?",
            "title_similarity": "0.03613185",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4drpa7",
            "score": 1,
            "text": "This must be so rare that what is the point? To foster the illusion that police framing people is common? Seems like everyone and their grandmother on youtube wants to ambush cops with their smartphone cameras.",
            "title_similarity": "0.6162047",
            "sentiment_compound": 0.4329
        },
        {
            "id": "i4dv7w9",
            "score": 1,
            "text": "But you can't sue them if they break into the wrong home, in the middle of the night while  waking you out of a deep sleep, and killing you as you are defend it, your family and yourself.",
            "title_similarity": "0.55718255",
            "sentiment_compound": -0.9052
        },
        {
            "id": "i4dygqp",
            "score": 1,
            "text": "You couldnt before?!?",
            "title_similarity": "0.13874432",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4e3p1o",
            "score": 1,
            "text": "About time! Hold them responsible!",
            "title_similarity": "0.14490795",
            "sentiment_compound": 0.4374
        },
        {
            "id": "i4eb0fc",
            "score": 1,
            "text": "Great. Now do civil asset forfeiture",
            "title_similarity": "0.3510635",
            "sentiment_compound": 0.765
        },
        {
            "id": "i4echs6",
            "score": 1,
            "text": "Ya gotta know too, there are some real morons for cops out that there are pissed about this.",
            "title_similarity": "0.6005945",
            "sentiment_compound": -0.7579
        },
        {
            "id": "i4elzvi",
            "score": 1,
            "text": "We needed the Supreme Court for that??",
            "title_similarity": "0.45268762",
            "sentiment_compound": 0.6072
        },
        {
            "id": "i4eot1p",
            "score": 1,
            "text": "Wait... You couldn't do that before?",
            "title_similarity": "0.14821117",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4eqdk9",
            "score": 3,
            "text": "I'm not a cop hater and we do need them but the crap that they get away with you and me would go to prison they need oversight",
            "title_similarity": "0.56660676",
            "sentiment_compound": -0.8011
        },
        {
            "id": "i4eqmh7",
            "score": 1,
            "text": "You know the big part of what they do that irritates the hell out of me all they got to do is say they was in fear for my life and they can kill someone but if we say we are in fear for our life we will go to prison and be executed",
            "title_similarity": "0.59070706",
            "sentiment_compound": -0.9542
        },
        {
            "id": "i4eqmsz",
            "score": 2,
            "text": "Lol! Good luck with that. The Supreme Court is a joke basket full of clowns.",
            "title_similarity": "0.43555158",
            "sentiment_compound": 0.9299
        },
        {
            "id": "i4ey5pb",
            "score": 1,
            "text": "In Florida there is an abundance of sheriffs and deputies. One almost ran me over at a public park and when I shook my head he stopped and told me he was responding to a call and didn't say sorry or anything like that. They like to hang out at a public park where there are tennis courts and milfs.",
            "title_similarity": "0.4311433",
            "sentiment_compound": 0.4445
        },
        {
            "id": "i4f3k6i",
            "score": 1,
            "text": "Yea if you have endless time and money",
            "title_similarity": "0.1250188",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4f5max",
            "score": 1,
            "text": "This is a good step, but I see cops making sure that they kill the people who they are framing instead of arresting them, to avoid the lawsuit and hide behind qualified immunity. \n\nJust sprinkle some crack on them and call it a day.",
            "title_similarity": "0.715434",
            "sentiment_compound": -0.8705
        },
        {
            "id": "i664gt9",
            "score": 2,
            "text": "A shame we needed SCOTUS to tell us this but good I guess ?",
            "title_similarity": "0.41867286",
            "sentiment_compound": 0.4215
        },
        {
            "id": "i6tmkyk",
            "score": 1,
            "text": "Great! Now if only these justices allow everyday people to sue politicians who pass executive orders that allow criminals out of prison that later rape or mug or kill you! No qualified immunity for these insane politicians who do things to harm the citizens! Tax payers would be off the hook for millions of dollars to defend the fools who caused great harm! Please get behind this people! Call your senator or house representative! Today",
            "title_similarity": "0.72368264",
            "sentiment_compound": -0.9655
        },
        {
            "id": "i6tnhlv",
            "score": 1,
            "text": "If a policeman mis leads a criminal into admitting they are guilty of a crime! We call that a win win situation! Why? It saves tons of OUR Taxpayor Money! And it gets a Criminal off the streets! We be all for that! Clint Eastwood and the World Call it True Justice! Smile for the camera",
            "title_similarity": "0.61972845",
            "sentiment_compound": 0.6562
        },
        {
            "id": "i862tli",
            "score": 1,
            "text": "That’s a nice step in the right direction. \n\nIt’s nowhere near enough considering cops deserve jail time just for taking the job, but it’s nice.",
            "title_similarity": "0.49564564",
            "sentiment_compound": 0.6808
        },
        {
            "id": "i898yj3",
            "score": 1,
            "text": "Back the blue, till it happens to you.",
            "title_similarity": "0.23920703",
            "sentiment_compound": 0.0
        }
    ]
}