{
    "Complaint filed in Florida to ban Bible as “too woke” | The book contains several \"prohibited topics\" - including incest, bestiality, progressive social programs, and the repercussions of slavery.\n": [
        {
            "id": "i6553sk",
            "score": 1,
            "text": "\nAs a reminder, this subreddit [is for civil discussion.](/r/politics/wiki/index#wiki_be_civil)\n\nIn general, be courteous to others. Debate/discuss/argue the merits of ideas, don't attack people. Personal insults, shill or troll accusations, hate speech, any suggestion or support of harm, violence, or death, and other rule violations can result in a permanent ban. \n\nIf you see comments in violation of our rules, please report them.\n\n For those who have questions regarding any media outlets being posted on this subreddit, please click [here](https://www.reddit.com/r/politics/wiki/approveddomainslist) to review our details as to our approved domains list and outlet criteria.\n \n **Special announcement:**\n \n r/politics is currently accepting new moderator applications.  If you want to help make this community a better place, consider [applying here today](https://www.reddit.com/r/politics/comments/sskg6a/rpolitics_is_looking_for_more_moderators/)!\n\n***\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/politics) if you have any questions or concerns.*",
            "title_similarity": "0.59294593",
            "sentiment_compound": -0.3895
        },
        {
            "id": "i6635ox",
            "score": -10,
            "text": "[removed]",
            "title_similarity": "0.26404864"
        },
        {
            "id": "i664arz",
            "score": 3,
            "text": "Bibles are in public school libraries? I don't recall when I was in grade school.",
            "title_similarity": "0.37410957",
            "sentiment_compound": 0.0
        },
        {
            "id": "i65p7ix",
            "score": -51,
            "text": "I met a homeless guy in DC recently. He is trained in a trade and could have gotten work, but chose to be unemployed instead. Walks around talking about peace and love, screaming at businesses and business owners, vandalizing marketplaces. Wears beaten up, shaggy clothing and really needs a shower, toothbrush and mouthwash, shave, and haircut. Seems pretty hopeless about his future. He does seem to love his Mom, but his relationship with his Dad is complex, to say the least.\n\nGoes by Jesus, so I guess he's Latinx.",
            "title_similarity": "0.600382",
            "sentiment_compound": 0.9109
        },
        {
            "id": "i66933m",
            "score": 5,
            "text": "If anyone actually read the goddamned bible they would understand they are all actively working against the most basic message of: \"Love thy Neighbor as thyself.\"\n\nThat's literally it, and that's not just Christianity. It applies to literally all of human to human interaction.\n\nFunny how no one seems to focus on that aspect.\n\nFuck the rest of any religious texts. That is the ONLY one that matters.",
            "title_similarity": "0.6249908",
            "sentiment_compound": 0.25
        },
        {
            "id": "i65mulx",
            "score": 1,
            "text": "“And, as is often the case with banned books, I ask your agency lay flame to that giant stack of fiction in a pyre worthy of a Viking sendoff.”\n\no7",
            "title_similarity": "0.60601854",
            "sentiment_compound": -0.0258
        },
        {
            "id": "i65ure4",
            "score": -14,
            "text": "Seconded. It’s already banned in public schools anyway.",
            "title_similarity": "0.5527096",
            "sentiment_compound": -0.4588
        },
        {
            "id": "i65si1e",
            "score": -9,
            "text": "But the Bible isn't taught in public schools?",
            "title_similarity": "0.5343187",
            "sentiment_compound": 0.0
        },
        {
            "id": "i65xnsk",
            "score": 4,
            "text": "Ban that shit off the face of the earth",
            "title_similarity": "0.3885811",
            "sentiment_compound": -0.802
        },
        {
            "id": "i65x4xi",
            "score": -13,
            "text": "Burn them along with the other books. /s\nWhat is happening in this world???",
            "title_similarity": "0.54789865",
            "sentiment_compound": 0.0
        },
        {
            "id": "i65t7c0",
            "score": -35,
            "text": "Now include the Koran and Torah too.",
            "title_similarity": "0.30284858",
            "sentiment_compound": 0.0
        },
        {
            "id": "i65uuho",
            "score": 19,
            "text": "They label something \"woke\" without actually knowing what that means. Why? because every time you try to explain to them or have a conversation they don't want to hear it.",
            "title_similarity": "0.5263343",
            "sentiment_compound": -0.0572
        },
        {
            "id": "i65p0ky",
            "score": -6,
            "text": "What public school in Florida teaches the bible as part of required classwork?\n\nPublic schools shouldn't be teaching this under any circumstance.",
            "title_similarity": "0.7120601",
            "sentiment_compound": 0.0
        },
        {
            "id": "i66a3ka",
            "score": -1,
            "text": "He should have started with the Koran, Torah and the Mormon verses, then popped out his surprise star of the night! \n\nIt’s the BIBLE!",
            "title_similarity": "0.55180424",
            "sentiment_compound": 0.3987
        },
        {
            "id": "i66erfv",
            "score": 0,
            "text": "If this fails in the Florida courts why not bring complaints against other texts that may be considered too “woke”. For example take the MLK I Have a Dream speech and file a complaint against it. If the complaint is upheld it makes the republicans look super racist. If the complaint is denied then they look like hypocrites (not that they care but you get the point).",
            "title_similarity": "0.7756336",
            "sentiment_compound": -0.5625
        },
        {
            "id": "i673nzn",
            "score": 0,
            "text": "For those interested in censorship, of course the Bible will eventually be banned. \n\nCensorship never serves to protect people, it's always intended to try and dumb people down by killing intelligent dialogue.",
            "title_similarity": "0.6653405",
            "sentiment_compound": -0.8011
        },
        {
            "id": "i7kwpp4",
            "score": 0,
            "text": "More tit for tat!!! It's ok dems keep it up! November is coming and you're going to pay. I never used to be this way but division will likely never change moving forward. Cynical perhaps but at 56 years old I see what I see.",
            "title_similarity": "0.44920197",
            "sentiment_compound": -0.6331
        },
        {
            "id": "i65yyuz",
            "score": 11,
            "text": "I was under the impression the Bible and all religious text not being allowed in schools was already policy.",
            "title_similarity": "0.649627",
            "sentiment_compound": 0.2263
        },
        {
            "id": "i662p9c",
            "score": 9,
            "text": "That's a bit unfair, the Bible is pretty much okay with slavery as long as you're not beating them too bad. Would hardly call that repercussions.",
            "title_similarity": "0.51143014",
            "sentiment_compound": -0.7022
        },
        {
            "id": "i689kdt",
            "score": -2,
            "text": "slap the fucker up side the heaf with the good book",
            "title_similarity": "0.47519287",
            "sentiment_compound": -0.2023
        },
        {
            "id": "i68b0vf",
            "score": -3,
            "text": "The greatest feat that Satan has pulled off is to convince the world that he doesn’t exist. And the teeny-boppers think now that they have anything to say worth listening to. Pfft!",
            "title_similarity": "0.56410694",
            "sentiment_compound": 0.8122
        },
        {
            "id": "i65xeq5",
            "score": -59,
            "text": "Lol from lgbtnation",
            "title_similarity": "0.31772786",
            "sentiment_compound": 0.4215
        },
        {
            "id": "i66ryyl",
            "score": 1,
            "text": "Is there any real legal backing to this or is the activist just talking out loud? Would love to see this backfire in conservative faces.",
            "title_similarity": "0.53094804",
            "sentiment_compound": 0.7003
        },
        {
            "id": "i6784rp",
            "score": 1,
            "text": "As a Christian I support this person turning their law back on them. Go him",
            "title_similarity": "0.42486838",
            "sentiment_compound": 0.4019
        },
        {
            "id": "i67ytc2",
            "score": -1,
            "text": "I can’t stand anyone who reads the Bible. You need to wake up anymore it’s insulting to keep this lie going when churches make millions and let those around them starve",
            "title_similarity": "0.61273676",
            "sentiment_compound": -0.7269
        },
        {
            "id": "i684v60",
            "score": 1,
            "text": "Conservative/ libertarian here. I absolutely love this. Separation of church and state! I hate when republicans use the Bible as a political argument.",
            "title_similarity": "0.6340101",
            "sentiment_compound": 0.1243
        },
        {
            "id": "i65xk63",
            "score": -15,
            "text": "This is as brilliant as Ukraine registering the resting place of the Moskva as a Ukrainian Heritage Site. Will it do shit legally? Nope. \n\nDoes it make a damn good point? And some good political theater?\n\nI mean I personally think so. \n\nAhhh the “woke bible”.  \n\nI mean I assume Jesus was “woke” but I’m sure he wouldn’t like the term. \n\nI’m a millennial so yeah, that’s our bad.",
            "title_similarity": "0.63431895",
            "sentiment_compound": 0.7986
        },
        {
            "id": "i65z0wo",
            "score": 2,
            "text": "Not to mention the Bible is pro cancelling BBQ culture!",
            "title_similarity": "0.662832",
            "sentiment_compound": -0.2714
        },
        {
            "id": "i67n3jm",
            "score": -4,
            "text": "I’m not religious I think non religious schools shouldn’t have any religious books, nor do I want my 1st grader learning about sex. At that age should be learning what needs to be learned. Math, English, Science and Reading way more important than being taught about someone having two moms or dads and how it happens. That type of stuff should be left up to the parents not schools. This goes for religion, sex and anything else that is outside of what should be taught in school.",
            "title_similarity": "0.56766975",
            "sentiment_compound": 0.2194
        },
        {
            "id": "i65jhld",
            "score": -42,
            "text": "I trust Jesus OVER the clowns who use his name to become millionaires and brainwash the people to hate others…",
            "title_similarity": "0.39792702",
            "sentiment_compound": -0.1027
        },
        {
            "id": "i65we1x",
            "score": 19,
            "text": "Flashback to when the Oklahoma governor stopped *all* national guard marriages because gays were allowed to marry in the military.\n\nRight-wingers just hate their nose so much.",
            "title_similarity": "0.60488194",
            "sentiment_compound": -0.6808
        },
        {
            "id": "i67ac6a",
            "score": -4,
            "text": "Never forget jesus is a made up character to controll the poor. Only fools believe in religion.",
            "title_similarity": "0.5052483",
            "sentiment_compound": -0.6842
        },
        {
            "id": "i89r0h7",
            "score": -2,
            "text": "I'm amazed at how distorted the liberal thinking is in here. I see complaints about Christian beliefs that are almost completely situational and are definitely outliers, and opinions about how conservatives are uncaring and hold values different from Christian values... it's funny how someone can make these assumptions and categorize an entire group of people and then complain when someone else categorizes their beliefs by their lifestyle. \n\nI'll tell you what the argument will be: the biblical stories are ones of caution and warning, an attempt to lead one down the narrow path; they restrict the behaviors described. \n\nI await the negative comments and the deluge of down votes when I awake in the morning.",
            "title_similarity": "0.69838274",
            "sentiment_compound": -0.5423
        },
        {
            "id": "i655oyd",
            "score": 7,
            "text": "Yep, as Stu from *Rugrats* best put it:\n\nhttps://youtu.be/FknVhsZgASE?t=11",
            "title_similarity": "0.30155432",
            "sentiment_compound": 0.7506
        },
        {
            "id": "i659yp9",
            "score": 40,
            "text": "[removed]",
            "title_similarity": "0.26404864"
        },
        {
            "id": "i6612vj",
            "score": 0,
            "text": "Someone should read Trumps biography and find ways to get that banned too.",
            "title_similarity": "0.5798035",
            "sentiment_compound": -0.4588
        },
        {
            "id": "i669wlm",
            "score": 0,
            "text": "Do they teach the Bible in public schools?",
            "title_similarity": "0.39563304",
            "sentiment_compound": 0.0
        },
        {
            "id": "i66crzl",
            "score": 0,
            "text": "No, I have not actually read the Bible. Have you read any of the books you've been trying to ban?",
            "title_similarity": "0.639923",
            "sentiment_compound": -0.5574
        },
        {
            "id": "i66dr62",
            "score": 0,
            "text": "To all who were raised with the bible and felt ostracized by it, or those feel strongly against the bible for being homophobic, please look at videos from PHD Dan McClellan. He’s an expert in Jewish studies and translation of the bible. He works with the mormons and actively defends lgbtq people from inaccurate hatful dogma. An interesting man who can help educate many family members lost in dogmatic belief. Please hear him out if u have any interest what so ever\nMuch love to all, especially the good 🏳️‍🌈 folk out there for being patient with those yet to be understanding \n [here’s a video that’s a perfect example](https://vm.tiktok.com/ZMLpH7mM3/)",
            "title_similarity": "0.58710283",
            "sentiment_compound": 0.9762
        },
        {
            "id": "i66f6ai",
            "score": 0,
            "text": "Didn't expect such a wide response, tbh.",
            "title_similarity": "0.3278019",
            "sentiment_compound": 0.0
        },
        {
            "id": "i66io7k",
            "score": 0,
            "text": "is this iconoclasm?",
            "title_similarity": "0.3574021",
            "sentiment_compound": 0.0
        },
        {
            "id": "i66orcf",
            "score": -3,
            "text": "Isn't the bible already just as \"banned\" as any of these other books? Separation of church and state and all that?",
            "title_similarity": "0.7193927",
            "sentiment_compound": -0.5204
        },
        {
            "id": "i6792ls",
            "score": 0,
            "text": "Timothy 1 10 specifically bans the American form of man stealing slavery.",
            "title_similarity": "0.7067225",
            "sentiment_compound": -0.8591
        },
        {
            "id": "i679x5k",
            "score": 0,
            "text": "https://telegr.im/+ZFRnItoS3MdjM2Vh",
            "title_similarity": "0.2748846",
            "sentiment_compound": 0.0
        },
        {
            "id": "i67h1yb",
            "score": 0,
            "text": "That website is gay",
            "title_similarity": "0.25059092",
            "sentiment_compound": 0.0
        },
        {
            "id": "i67lu2w",
            "score": 0,
            "text": "imagine A 3000 year old book being ahead of its time and it being a problem.",
            "title_similarity": "0.23071826",
            "sentiment_compound": -0.4019
        },
        {
            "id": "i67ohvg",
            "score": 0,
            "text": "Have to laugh at this as it sounds like a joke. Who was the complainant?",
            "title_similarity": "0.3382591",
            "sentiment_compound": 0.765
        },
        {
            "id": "i67yxn6",
            "score": 0,
            "text": "This is a good thing that he did. \n\nTill so far it was just Muslim religion was bad, Islam teaches violence , does not want any other god to be present... Etc etc. And how the whole world was on  *Islam is bad*. \n\nBut , I am realising , \nNo matter your religion,  Muslim or Christian or any other, there are good things as well as bad things in the book. \n\nThe books were valid for the period that  they were in. Now they need to be taken with \"guidelines\" or like a reference manual rather than literally. Try to understand why it was said when it was said and within what context.\n\n\nBring it on I would say.\n\nIf we look at fanatic religion nutheads, he probably needs protection and security for the rest of his life.",
            "title_similarity": "0.614528",
            "sentiment_compound": 0.5152
        },
        {
            "id": "i6860hq",
            "score": -4,
            "text": "[deleted]",
            "title_similarity": "0.27479658"
        },
        {
            "id": "i689nra",
            "score": 0,
            "text": "What happens when you do not educate your populus? Look at Ruzzia for examples.",
            "title_similarity": "0.5630753",
            "sentiment_compound": 0.0
        },
        {
            "id": "i68hpv5",
            "score": 0,
            "text": "Just to make sure, wokeness is against incest right?",
            "title_similarity": "0.39283997",
            "sentiment_compound": 0.3182
        },
        {
            "id": "i68r4y6",
            "score": 0,
            "text": "Banning a religious book would get shot down under the first amendment.",
            "title_similarity": "0.6803808",
            "sentiment_compound": 0.0
        },
        {
            "id": "i69wwb1",
            "score": 0,
            "text": "Lol, good luck with that, passing a law regarding the practice of religion. Which is expressly prohibited. Also, are churches teaching that to children? I’m pretty sure no. Just as I’m sure that repercussions of slavery, and blaming the current generation of whites for slavery are two totally different things.",
            "title_similarity": "0.80191123",
            "sentiment_compound": 0.1779
        },
        {
            "id": "i69xeph",
            "score": 0,
            "text": "And not Quran?",
            "title_similarity": "0.3147403",
            "sentiment_compound": 0.0
        },
        {
            "id": "i78rusg",
            "score": 0,
            "text": "I can see that many here have a general knowledge of historical records but many also lack specific understanding of them. The first thing I suppose I would ask of many is this. Do you believe the historical records as they are written and translated to us in English? If the answer is no then it doesn't make much sense to use it in any sort or rhetoric or defense. If you do believe it them then let us reason together. The law of Moses was like any other law we have today. Surely no one would argue that it is ok to commit murder. So, part of the law of Moses we are all in agreement. The debates of capital punishments and abortions abound in both the law of Moses and today's laws. It is necessary to understand that the law is not perfect. We assume that those who followed after God also obeyed and followed after his will. We see in the historical record, for example, that King David committed adultery with Betsheba and had her husband killed. Many might assume that it must have been ok. But further reading explains how God punished him for it. What we have today is people that both want to refuse God and also want to escape consequences. They hide behind the law or their own belief system but in the end we all will die and the truth will be revealed to all. No one can escape the end. So the question is not whether abortion is right or wrong according to the law, but rather is it right or wrong according to God. The historical records are full of  things that mankind has allowed. That does not necessarily mean that it was the right thing to do. Again I speak to those who at least believe in the historical records. If not there is really no conversation to be had about them. Making something legal does not make it right. If tomorrow the legislation made murder legal for one day it would still be wrong to someone who held a higher moral code than the law. Jesus was the type of person that held a higher moral code that the law of Moses. We should strive to be more like him.",
            "title_similarity": "0.5600376",
            "sentiment_compound": -0.9864
        },
        {
            "id": "i78z4q6",
            "score": 0,
            "text": "My favorite book ❤️",
            "title_similarity": "0.19264126",
            "sentiment_compound": 0.4588
        },
        {
            "id": "i7a991l",
            "score": 0,
            "text": "Hypocrisy....both on the left and right. Dems want to ban Jesus but praise/push the devil...Right want to allow \"freedom\" but not allow abortion. I don't agree with any of it. However abortion does cause \"harm\" to another human so it should follow the constitution.",
            "title_similarity": "0.7164848",
            "sentiment_compound": -0.2415
        },
        {
            "id": "i7bxn53",
            "score": 0,
            "text": "Maybe ban this guy from the U.S. \n\nIf that is what he saw in the Bible then this guy is as stupid as they come.  \n\nIf that is what you understood from the Bible then ether you read it very wrong or you had a horrible pastor. Go back to reading comprehension in the 8th grade and try again…\n\nPlus if you think that’s bad wait until you read this satanist bullshit. Those people need serious help.",
            "title_similarity": "0.7240973",
            "sentiment_compound": -0.9628
        },
        {
            "id": "i7ip0ng",
            "score": 0,
            "text": "Funny thing is Florida is full of people who love Jesus and me included IDC if Dems have to suffer cause Florida is red get fucked you stupid libs you will lose in the end just saying",
            "title_similarity": "0.7014066",
            "sentiment_compound": -0.7845
        },
        {
            "id": "i7wb9rz",
            "score": 0,
            "text": "Banned from what ? It has been banned from public schools a long time ago. So there is really no point to this.",
            "title_similarity": "0.53738874",
            "sentiment_compound": -0.8173
        },
        {
            "id": "i7xakgz",
            "score": 0,
            "text": "The US has had legalized abortion for 50 years. We will never be free of Abortion again, some states will keep abortions legal.\n\nNo one is going to make birth control illegal. The “trigger bill” is aimed solely at birth control that is effective AFTER conception. True preventative birth control will still be readily available.\n\nA lot of people solely support the Biblical definition of marriage as between one man and one woman.",
            "title_similarity": "0.53684443",
            "sentiment_compound": 0.1526
        },
        {
            "id": "i831y13",
            "score": 0,
            "text": "Bible has been banned from being taught in schools for decades tho. Typical liberals.",
            "title_similarity": "0.62835264",
            "sentiment_compound": -0.4588
        },
        {
            "id": "i663gzv",
            "score": -21,
            "text": "Wow, some people are really just stupid. The Bible is already banned from being taught in Public Schools unless in a world religions class",
            "title_similarity": "0.6856743",
            "sentiment_compound": -0.4364
        },
        {
            "id": "i66b5z4",
            "score": -18,
            "text": "Everyone here forgot about the first Amendment apparently",
            "title_similarity": "0.46308643",
            "sentiment_compound": 0.0
        },
        {
            "id": "i65rgbh",
            "score": -53,
            "text": "\"Right, so that's \"The Bible\" critiqued: who's ready for \"The Qu'ran\"?\"",
            "title_similarity": "0.53537464",
            "sentiment_compound": 0.3612
        },
        {
            "id": "i684jkj",
            "score": -4,
            "text": "You can’t ban the Bible it’s the Bible",
            "title_similarity": "0.49059823",
            "sentiment_compound": -0.5574
        },
        {
            "id": "i65qcw7",
            "score": -20,
            "text": "Fight fire with fire everyone burns",
            "title_similarity": "0.25271684",
            "sentiment_compound": -0.7506
        },
        {
            "id": "i65c09y",
            "score": 26,
            "text": "And dare I say it, *communism!* (gasp!).\n\n Acts 2:44\n\nIt never seems to occur to these guys that the laws they make will eventually be used against *them*. Wait until the voting laws designed to restrict voting by minorities starts getting used against rural white conservatives. A few arrests for voting irregularities in rural Idaho should put things into a new perspective.",
            "title_similarity": "0.60658056",
            "sentiment_compound": -0.7256
        },
        {
            "id": "i665uta",
            "score": -25,
            "text": "Lol they don’t even teach the Bible in School! So ban something they don’t teach? They didn’t even teach the Bible or make any references to it when I was in school lol",
            "title_similarity": "0.548492",
            "sentiment_compound": -0.0793
        },
        {
            "id": "i65x49h",
            "score": -6,
            "text": "[deleted]",
            "title_similarity": "0.27479658"
        },
        {
            "id": "i66pdgs",
            "score": -5,
            "text": "When I used the term \"Satan\" I was referring to whichever asshole Florida fascist filed this. Not sure why I'm being downvoted.",
            "title_similarity": "0.74349385",
            "sentiment_compound": -0.6769
        },
        {
            "id": "i6647uj",
            "score": -13,
            "text": "Both should be banned. Separation of church and state and children learning about sexuality in kindergarten.",
            "title_similarity": "0.65586627",
            "sentiment_compound": -0.4588
        },
        {
            "id": "i65wgls",
            "score": 1,
            "text": "Fuck yeah Chaz, let em’ have it!",
            "title_similarity": "0.21582349",
            "sentiment_compound": -0.3802
        },
        {
            "id": "i66f1md",
            "score": 1,
            "text": "Bring it to the Supreme Court",
            "title_similarity": "0.15120652",
            "sentiment_compound": 0.5574
        },
        {
            "id": "i66vxjx",
            "score": -1,
            "text": "I don't remember the bible being taught in schools tho",
            "title_similarity": "0.52535933",
            "sentiment_compound": 0.0
        },
        {
            "id": "i66w7pp",
            "score": -1,
            "text": "Bunch of fruit cakes",
            "title_similarity": "0.06088431",
            "sentiment_compound": 0.0
        },
        {
            "id": "i66wquu",
            "score": -1,
            "text": "Given how extremely poorly Floridian self proclaimed “Christians” behave I have no sympathy for them. Of course this complaint won’t get anywhere since any of the judges are appointed by Trump or even without his appointments many judges are fundies in Florida.",
            "title_similarity": "0.7209333",
            "sentiment_compound": -0.5588
        },
        {
            "id": "i66zog9",
            "score": -1,
            "text": "I'm not sure if this is a valid point, are we teaching the Bible in school?",
            "title_similarity": "0.48546526",
            "sentiment_compound": -0.2411
        },
        {
            "id": "i66zznf",
            "score": -1,
            "text": "The Bible shouldn’t be read in public school, but then you have to ban all religious books.",
            "title_similarity": "0.69293904",
            "sentiment_compound": -0.7096
        },
        {
            "id": "i674xff",
            "score": -1,
            "text": "What",
            "title_similarity": "0.01847345",
            "sentiment_compound": 0.0
        },
        {
            "id": "i67p8kr",
            "score": -1,
            "text": "Headlines missing something. Click bait",
            "title_similarity": "0.45212257",
            "sentiment_compound": -0.296
        },
        {
            "id": "i67yk6o",
            "score": -1,
            "text": "Ban the Constitution while you are at it…",
            "title_similarity": "0.53086066",
            "sentiment_compound": -0.5574
        },
        {
            "id": "i67ypfo",
            "score": -1,
            "text": "Nahh, bibles fine",
            "title_similarity": "0.1326227",
            "sentiment_compound": 0.2023
        },
        {
            "id": "i68ckru",
            "score": 1,
            "text": "Is someone forcing it on K-3 children?",
            "title_similarity": "0.35783666",
            "sentiment_compound": 0.0
        },
        {
            "id": "i68knkb",
            "score": -1,
            "text": "get a few more left leaning judges on SCOTUS, so that when this lawsuit makes its way there, removal will be deemed appropriate based on Florida's law.\n\nWhy didn't anyone see this coming.",
            "title_similarity": "0.6864648",
            "sentiment_compound": -0.2789
        },
        {
            "id": "i6pzc9c",
            "score": -1,
            "text": "Ban the Bible?  Literally the dumbest thing you can do.",
            "title_similarity": "0.5739116",
            "sentiment_compound": -0.7845
        },
        {
            "id": "i85yuk3",
            "score": -1,
            "text": "I'm a Christian and this thread section has me rolling",
            "title_similarity": "0.4180166",
            "sentiment_compound": 0.0
        },
        {
            "id": "i88pjv2",
            "score": 1,
            "text": "Lol Merrica, the 'supposedly' greatest country on this planet.. Give it a year and it will be Red on Blue all over again. \n\nFrom an 'outside perspective' I'm PROUD to NOT be an American. When the biggest peev is the Bible vs Liberal values, at a time when all you read about is mass shootings, how every hillbilly and their mum/sister needs to carry a shotgun and let's re write the entire history of a country (granted not just America). Priorities need to be sorted, you guys are just going to burn yourselves to the ground... ill bring the marshmallows.",
            "title_similarity": "0.60118484",
            "sentiment_compound": 0.9141
        },
        {
            "id": "i65cjob",
            "score": -52,
            "text": "Becareful of what you ask for...truth has two sides...we want laws that respect all sides/choice... not laws that inflict the beliefs of some 'unto' others...beauty of a real democracy...we can coexist.",
            "title_similarity": "0.40612346",
            "sentiment_compound": 0.5267
        },
        {
            "id": "i66g6f9",
            "score": -9,
            "text": "This would be a really big reverse uno card gotcha! moment, but they don’t really teach the Bible in schools and haven’t in a while.",
            "title_similarity": "0.5881542",
            "sentiment_compound": 0.0
        },
        {
            "id": "i66xi1a",
            "score": -7,
            "text": "But Bible does not teach about incest or people that are different in this way. Basically considering chaz's logic is that every book that contains such words should be prohibited which is totally wrong and stupid. He either missed the point by a mile either being just anti-christian.",
            "title_similarity": "0.6714548",
            "sentiment_compound": -0.9244
        },
        {
            "id": "i65tyi1",
            "score": -22,
            "text": "[deleted]",
            "title_similarity": "0.27479658"
        },
        {
            "id": "i65qb96",
            "score": -80,
            "text": " Mute point. It’s already banned to read the Bible or pray in public schools.",
            "title_similarity": "0.6192875",
            "sentiment_compound": -0.1779
        },
        {
            "id": "i65n55w",
            "score": 9,
            "text": "They find out Jesus is a black man",
            "title_similarity": "0.47372085",
            "sentiment_compound": 0.0
        },
        {
            "id": "i65swz1",
            "score": -35,
            "text": "…. Thats not what “woke” means…",
            "title_similarity": "0.3094069",
            "sentiment_compound": 0.0
        },
        {
            "id": "i672kra",
            "score": -8,
            "text": "Yes, comparing the old books in The Bible to nonsense like \"math is whiteness.\" Totally the same thing.",
            "title_similarity": "0.41675386",
            "sentiment_compound": 0.3612
        },
        {
            "id": "i65hee3",
            "score": -2,
            "text": "Progressive social programs lol",
            "title_similarity": "0.06717415",
            "sentiment_compound": 0.4215
        },
        {
            "id": "i661sv9",
            "score": 2,
            "text": "I’m in complete agreement, minimally, banned is fine, but gathered and rail gunned at the Governor at hypersonic speeds is much better use for them",
            "title_similarity": "0.31752896",
            "sentiment_compound": 0.6542
        },
        {
            "id": "i666g20",
            "score": -2,
            "text": "I tend not to wear a 'mask', btw, freedom of speech is welcome here..",
            "title_similarity": "0.37538064",
            "sentiment_compound": 0.802
        },
        {
            "id": "i66cspm",
            "score": -2,
            "text": "Ehh.. idk, I say tread light with trying to counter conservatives by going at religion... conservatives arent the only ones that are Christians..",
            "title_similarity": "0.54052645",
            "sentiment_compound": -0.1027
        },
        {
            "id": "i66dllg",
            "score": -2,
            "text": "I am not sure that this complaint against the bible will work.",
            "title_similarity": "0.5067177",
            "sentiment_compound": -0.4874
        },
        {
            "id": "i66q0qr",
            "score": -2,
            "text": "Can anyone answer a couple questions I have on this?\n\n1.) does the Republican “woke” bill outright ban books in schools or just ban schools from requiring them in the curriculum? Can students read these books on their own time at the school? \n\n2.) is it legal to require reading the Bible in the school curriculum in public schools in Florida ? \n\nRead a couple articles and didn’t get a clear answer on this any help appreciated ! And might have a couple follow up questions",
            "title_similarity": "0.7580044",
            "sentiment_compound": 0.4857
        },
        {
            "id": "i66uz4o",
            "score": -2,
            "text": "by that logic, shouldnt they ban every religious text or is that too offensive to “other cultures?”",
            "title_similarity": "0.63501984",
            "sentiment_compound": -0.0196
        },
        {
            "id": "i66wi0g",
            "score": 2,
            "text": "Conservative here with my popcorn and loving it.. Watching all this bullshit.",
            "title_similarity": "0.21908267",
            "sentiment_compound": -0.1531
        },
        {
            "id": "i66x5hi",
            "score": 2,
            "text": "the fantasy scenario of people who do this kind of thing:\n\n*desantis sees the complaint, realizes the error of his ways, and changes his views due to this clever trick*\n\nwhat will actually happen\n\n*complaint thrown in trash*",
            "title_similarity": "0.46048588",
            "sentiment_compound": -0.4215
        },
        {
            "id": "i673owk",
            "score": -2,
            "text": "Uga buga",
            "title_similarity": "0.15993315",
            "sentiment_compound": 0.0
        },
        {
            "id": "i67936i",
            "score": -2,
            "text": "[deleted]",
            "title_similarity": "0.27479658"
        },
        {
            "id": "i67b08z",
            "score": -2,
            "text": "This is so worn out.",
            "title_similarity": "0.2516318",
            "sentiment_compound": -0.4341
        },
        {
            "id": "i67clps",
            "score": -2,
            "text": "Where does beastiality happen in the Bible",
            "title_similarity": "0.57960445",
            "sentiment_compound": 0.0
        },
        {
            "id": "i67eq4k",
            "score": -2,
            "text": "I agree the Bible shouldn't be in public schools and no specific religion should be promoted in public school. However it is far from woke, and was written during a much different time in history. You can't use today's lens and apply it to the bible.",
            "title_similarity": "0.6521489",
            "sentiment_compound": 0.4767
        },
        {
            "id": "i67rx8s",
            "score": -2,
            "text": "What the heck even is the point of politics at this point, wasting time on dumb shit like this.",
            "title_similarity": "0.4613285",
            "sentiment_compound": -0.7964
        },
        {
            "id": "i68kel0",
            "score": -2,
            "text": "Can we cancel earth next?",
            "title_similarity": "0.35145718",
            "sentiment_compound": -0.25
        },
        {
            "id": "i693m38",
            "score": -2,
            "text": "Jesus Christ is the most recent reincarnation of a story that has been told and re-told long before the ancient Egyptians .\nHere are the commonalities of all these retold stories \nBorn in the 25 of December \nBorn of a virgin\nThrough miracles healed the sick \nWas crucified\nRose  from the dead 3 days later \nHad 12 disciples .\nThere are more and they all relate to ancient cultures views the position of the stars in the night sky . \nIt’s from the documentary zeitgeist .",
            "title_similarity": "0.47575974",
            "sentiment_compound": -0.8225
        },
        {
            "id": "i6973z6",
            "score": -2,
            "text": "As a Christian, we are called to submit to our governing authorities. Regardless of if it was Nero, Trump, Biden, Obama, Hitler. As long as they don't tell us/command us to contradict what the Bible says, we are supposed submit to whoever it is. Regardless of persecution and the silencing of what we believe.",
            "title_similarity": "0.6067798",
            "sentiment_compound": -0.4215
        },
        {
            "id": "i65y3up",
            "score": -12,
            "text": "How about we don’t push a liberal or conservative agenda and just focus on the education part.",
            "title_similarity": "0.40678456",
            "sentiment_compound": 0.0
        },
        {
            "id": "i66kg0f",
            "score": -10,
            "text": "...[and there the left says the right lacks nuance](https://i.imgur.com/AEhrfx5.png)...",
            "title_similarity": "0.47796732",
            "sentiment_compound": 0.0
        },
        {
            "id": "i65xkqf",
            "score": -37,
            "text": "I’m not getting my news from a site called LBGTNATION lmao",
            "title_similarity": "0.54291016",
            "sentiment_compound": 0.5994
        },
        {
            "id": "i668zts",
            "score": -3,
            "text": "Serious question.. are these kids in public school actually having bible study classes like that??",
            "title_similarity": "0.42732584",
            "sentiment_compound": 0.3736
        },
        {
            "id": "i669h52",
            "score": -3,
            "text": "The only religion not banned is Buddhism.",
            "title_similarity": "0.1725652",
            "sentiment_compound": 0.357
        },
        {
            "id": "i66az0d",
            "score": -3,
            "text": "I like cheess",
            "title_similarity": "-0.0077778995",
            "sentiment_compound": 0.3612
        },
        {
            "id": "i66azy1",
            "score": 3,
            "text": "Conservatives aren't thinking about hypocrisy because they plan on using selective enforcement to keep the burden off themselves and on things they find objectionable.\n\nTo which I'd respond: Cool. They should have the opportunity to try it and find out how stupid it is, since all other means of learning have failed.",
            "title_similarity": "0.50404465",
            "sentiment_compound": -0.6705
        },
        {
            "id": "i66dqmj",
            "score": -4,
            "text": "Wish I could support this lol",
            "title_similarity": "0.32504308",
            "sentiment_compound": 0.8248
        },
        {
            "id": "i66dyih",
            "score": 3,
            "text": "FINALLY some anti-wokeness I can get behind",
            "title_similarity": "0.30228743",
            "sentiment_compound": 0.0
        },
        {
            "id": "i66e0z5",
            "score": 2,
            "text": "This is funny as fuck",
            "title_similarity": "0.11089201",
            "sentiment_compound": -0.1531
        },
        {
            "id": "i66ejgw",
            "score": -4,
            "text": "This headline actually made me say \"what the actual fuck\" out loud.",
            "title_similarity": "0.3021003",
            "sentiment_compound": -0.5423
        },
        {
            "id": "i66n5qj",
            "score": 3,
            "text": "LOVE THIS\n\nSorry to just post that but, this is seriously amazing on many levels. Would be better if it was an actual lawsuit though and the person behind it had a bunch of money to see it go very far.",
            "title_similarity": "0.30055374",
            "sentiment_compound": 0.8579
        },
        {
            "id": "i66tfbw",
            "score": -2,
            "text": "So can we post Bayblon Bee in r/politics now?",
            "title_similarity": "0.44072753",
            "sentiment_compound": 0.0
        },
        {
            "id": "i66v20t",
            "score": -2,
            "text": "[deleted]",
            "title_similarity": "0.27479658"
        },
        {
            "id": "i66w1h0",
            "score": -2,
            "text": "This isn’t a legit news source.",
            "title_similarity": "0.34280282",
            "sentiment_compound": 0.0
        },
        {
            "id": "i66x5ty",
            "score": -3,
            "text": "As well as violence towards children (although that’s because it’s misinterpreted) in biblical times a “rod” was a measure of length, being about 3 feet, usually refers to fabric. So when they say “spare the rod” it literally means to spare the rules, or to make sure your children have limits. It’s important to familiarise yourself with biblical words before beating your kids with a stick. Have you ever heard of Jesus putting children over his knee and hitting them with a stick? Just idiot self proclaimed dumb so called Christian’s trying to justify lazy, abusive parenting.",
            "title_similarity": "0.68596536",
            "sentiment_compound": -0.9552
        },
        {
            "id": "i671qmy",
            "score": 3,
            "text": "I don’t know why but I read the guy’s shirt as “THRUST JESUS”. I’m going to burn in hell as expected",
            "title_similarity": "0.57414544",
            "sentiment_compound": -0.8126
        },
        {
            "id": "i6735e3",
            "score": 3,
            "text": "Hahaha! Don't forget about the part where loans shouldn't charge interest!",
            "title_similarity": "0.40063053",
            "sentiment_compound": 0.522
        },
        {
            "id": "i6779fx",
            "score": 5,
            "text": "You think conservatives would want to ban the bible. The characters are all darker than they would allow to vote",
            "title_similarity": "0.69242954",
            "sentiment_compound": -0.34
        },
        {
            "id": "i67r0a0",
            "score": -4,
            "text": "This is absolutely stupid in an uncountable number of ways. \n\nIt is a book of History as much as anything else, and that history is real\n\nWe do not van the discussion of murder and rape in regard to the Holocaust or the discussion of slavery in regard to European conquest.\n\nAlso, this would not only violate the Constitution, but also spark revolution.\n\nThere is a large difference between teaching the history of something and propagating the wrongful beliefs of the abusers.",
            "title_similarity": "0.6217138",
            "sentiment_compound": -0.9106
        },
        {
            "id": "i67tadl",
            "score": -3,
            "text": "damn is a book really hurting you’re feelings? grow the fuck up.",
            "title_similarity": "0.6017411",
            "sentiment_compound": -0.8479
        },
        {
            "id": "i68clx2",
            "score": -4,
            "text": "Quran says hi from distance.....",
            "title_similarity": "0.2828485",
            "sentiment_compound": 0.0
        },
        {
            "id": "i68rspp",
            "score": -3,
            "text": "Florida (and the rest of the USA), it would be good for you to just ‘Grow Up’. This entire country was Founded On God...!!!",
            "title_similarity": "0.48608476",
            "sentiment_compound": 0.7074
        },
        {
            "id": "i68vw07",
            "score": -3,
            "text": "Y make it a religious matter now...\nU believe in it follow it \nDon't believe then live by ur own way \nThat's it......",
            "title_similarity": "0.41033232",
            "sentiment_compound": 0.0258
        },
        {
            "id": "i89r2c1",
            "score": -2,
            "text": "But it is ok to talk kindergarten children that they can become a girl or boy. Dumbasses, hiding in the dark but there will come a day of judgement when your WOKE bullshit will not save you. You can spend lots of time with Satan, wondering, if I had just...",
            "title_similarity": "0.61404383",
            "sentiment_compound": -0.8639
        },
        {
            "id": "i661nmy",
            "score": -11,
            "text": "Can't ban the Bible without banning the Torah. Chaz Stevens confirmed for anti-semite",
            "title_similarity": "0.6691541",
            "sentiment_compound": 0.4449
        },
        {
            "id": "i666g5y",
            "score": -13,
            "text": "Hm, technically you can't since it falls under the constitutional right to religion.",
            "title_similarity": "0.4747169",
            "sentiment_compound": 0.0
        },
        {
            "id": "i66er5o",
            "score": -11,
            "text": "Yes, you're very clever. How is that going to change anything in Florida? How does proving to Republicans how smart we liberals are in any way protect people of color and the queer community? When has that done anything but temporarily make us feel superior?",
            "title_similarity": "0.5015289",
            "sentiment_compound": 0.8987
        },
        {
            "id": "i66xrql",
            "score": -12,
            "text": "I'm uh... I'm confused. Are they saying the Bible is bad? because that's uh, not true. It's actually good. I've read it. It is very clearly against incest and bestiality, or is the problem that it is against said things? real quick I (obviously) am against incest, bestiality, and slavery, just thought I had to say that before a person with green hair tries to gaslight me while still living on their parent's car insurance.\n\nEdit: I have learned never to voice what I know on the internet. Also don't just copy-paste things, both comments are word for word, except a little bit)",
            "title_similarity": "0.73297286",
            "sentiment_compound": -0.8779
        },
        {
            "id": "i65t838",
            "score": -27,
            "text": "When your actions are purely antagonistic what’s your real goal?",
            "title_similarity": "0.38648635",
            "sentiment_compound": -0.4576
        },
        {
            "id": "i65wym3",
            "score": -14,
            "text": "The name Chaz should be a red flag from any perspective on this topic.",
            "title_similarity": "0.41276497",
            "sentiment_compound": 0.0
        },
        {
            "id": "i65yhaf",
            "score": -11,
            "text": "In what capacity is the Bible in school and is Stevens trying to eliminate it? Obviously the Bible isn’t taught in public school, nor is it available in public school libraries. What am I missing here? I’d say both sides are right, none of these things should be taught to public school students.",
            "title_similarity": "0.66006047",
            "sentiment_compound": -0.3736
        },
        {
            "id": "i66g4wq",
            "score": -13,
            "text": "The Bible isn’t taught in public schools. Try again, groomer.",
            "title_similarity": "0.64990807",
            "sentiment_compound": 0.0
        },
        {
            "id": "i65wf4j",
            "score": 16,
            "text": "The Bible is a groomer how to guide for pedos. You got 100+ year old dudes marrying 10yr olds.",
            "title_similarity": "0.3793277",
            "sentiment_compound": 0.0
        },
        {
            "id": "i65wj9i",
            "score": 4,
            "text": "Isn't the bible full of sodomites as well? Don't want your kids reading that and getting ideas!",
            "title_similarity": "0.65707666",
            "sentiment_compound": 0.2892
        },
        {
            "id": "i65ywkf",
            "score": -5,
            "text": "I have a question. If we banning the bible for this reason, are we going after the Torah? Quran? Veda? Tripitaka? They all express the same views. Can’t ban one without the rest. I ain’t no religious nut bar BUT we can’t go round persecuting one and not the rest, it’s treading on knives and acting like you won’t get stabbed.",
            "title_similarity": "0.7156283",
            "sentiment_compound": -0.8276
        },
        {
            "id": "i65zdvk",
            "score": -5,
            "text": "jfc this comment thread is filled to the brim with idiots that couldn't be bothered to read past the title",
            "title_similarity": "0.47992784",
            "sentiment_compound": 0.2411
        },
        {
            "id": "i662ax4",
            "score": -4,
            "text": "[deleted]",
            "title_similarity": "0.27479658"
        },
        {
            "id": "i66bt5t",
            "score": -3,
            "text": "Strangely quiet about twitter here.",
            "title_similarity": "0.25694317",
            "sentiment_compound": -0.296
        },
        {
            "id": "i66e9kf",
            "score": -3,
            "text": "So they think the Bible is <checks notes> too Christian for Christians?",
            "title_similarity": "0.5484703",
            "sentiment_compound": 0.0
        },
        {
            "id": "i66jzno",
            "score": -5,
            "text": "It talks about avoiding those things. It’s very different from the zoophiles and the white supremacists justifying those topics.",
            "title_similarity": "0.6309247",
            "sentiment_compound": -0.5267
        },
        {
            "id": "i66kalu",
            "score": -4,
            "text": "Sounds as if Hitlers is alive and well in Florida!",
            "title_similarity": "0.26333725",
            "sentiment_compound": 0.6114
        },
        {
            "id": "i66l1kp",
            "score": -4,
            "text": "Woke idiots are no different than “Christians”\n\nThey just wear different uniforms.\n\nAll of them are fools.",
            "title_similarity": "0.51031554",
            "sentiment_compound": -0.6597
        },
        {
            "id": "i66lk6v",
            "score": -4,
            "text": "People having common sense,will be looking around right while realising about what the actual fuck is happening in this world.Bible containing these topics is prohibited like how? These religious books be it any the Holy Quran the bible they teach you way of life,they tell you whats wrong and whats right.The amount of crazy shit happening in this world nothing should be prohibited it should be talked about discarded and not accepting society.People creating so many problems each day with even the bible not deemed good in their eyes.Some boundries have to be made to avoid further disaster.",
            "title_similarity": "0.68489176",
            "sentiment_compound": -0.9782
        },
        {
            "id": "i66lsb7",
            "score": -3,
            "text": "Seeing as how banning books always just shines a spotlight on them and leads to them being read and devoured more than ever, I’m cool with this.",
            "title_similarity": "0.44636312",
            "sentiment_compound": 0.3182
        },
        {
            "id": "i66qiim",
            "score": -5,
            "text": "How fucking stupid. Fuck it, lets ban learning in a public forum.",
            "title_similarity": "0.5168369",
            "sentiment_compound": -0.9016
        },
        {
            "id": "i66r2j5",
            "score": -4,
            "text": "[deleted]",
            "title_similarity": "0.27479658"
        },
        {
            "id": "i66syc4",
            "score": -3,
            "text": "Petty",
            "title_similarity": "0.1686739",
            "sentiment_compound": -0.2023
        },
        {
            "id": "i66yxc7",
            "score": 4,
            "text": "Honestly, the Bible is the most destructive book on earth.",
            "title_similarity": "0.5252831",
            "sentiment_compound": -0.3167
        },
        {
            "id": "i6787kp",
            "score": -6,
            "text": "Libs can’t meme.",
            "title_similarity": "0.39312088",
            "sentiment_compound": 0.0
        },
        {
            "id": "i67fkue",
            "score": -3,
            "text": "Well that’s quite the reach. Y’all are morons lol",
            "title_similarity": "0.33806553",
            "sentiment_compound": 0.4549
        },
        {
            "id": "i681e4y",
            "score": -4,
            "text": "lgbt weirdos admit incest, bestiality are woke",
            "title_similarity": "0.59853137",
            "sentiment_compound": -0.0772
        },
        {
            "id": "i65x0w3",
            "score": -15,
            "text": "This is different though they don’t teach the Bible in school.",
            "title_similarity": "0.55971557",
            "sentiment_compound": 0.0
        },
        {
            "id": "i65rrob",
            "score": -30,
            "text": "Bible isn’t taught in school though.",
            "title_similarity": "0.5298194",
            "sentiment_compound": 0.0
        },
        {
            "id": "i65ta88",
            "score": -14,
            "text": "So incest is woke now … I see I see",
            "title_similarity": "0.38175023",
            "sentiment_compound": 0.0
        },
        {
            "id": "i65sn40",
            "score": 6,
            "text": "Aren't religious texts already banned from being taught at public schools?",
            "title_similarity": "0.5894825",
            "sentiment_compound": -0.4588
        },
        {
            "id": "i6627le",
            "score": -7,
            "text": "Are the schools teaching incest, bestiality from the Bible?",
            "title_similarity": "0.63236606",
            "sentiment_compound": 0.0
        },
        {
            "id": "i669u49",
            "score": -5,
            "text": "Lgbtq lol",
            "title_similarity": "0.2578758",
            "sentiment_compound": 0.4215
        },
        {
            "id": "i66baef",
            "score": -4,
            "text": "Needs to be ignored",
            "title_similarity": "0.42403066",
            "sentiment_compound": -0.3182
        },
        {
            "id": "i66dfu9",
            "score": -5,
            "text": "Is this then being done for all religious texts? Not a bible thumper just pointing out the obvious here. P.S. please don’t talk to kids about gender identity before they truly even know what gender is, thanks.",
            "title_similarity": "0.62553275",
            "sentiment_compound": 0.7964
        },
        {
            "id": "i66dsx7",
            "score": -6,
            "text": "I’m fine banning woke crap and religious nonsense.",
            "title_similarity": "0.42154384",
            "sentiment_compound": -0.5423
        },
        {
            "id": "i66ec62",
            "score": -5,
            "text": "In most places it is already illegal to have Bible's in schools.\n\nI strongly believe that a taxpayer funded local institution, like schools or libraries, should be democratized and the community should have the power to restrict content they pay to have in these places.\n\nI am fine if the community rallies together to ban certain works from schools especially. The Bible, Quran, atheist cookbook, porn, Mein Kampf, etc.\n\nIf the community does not want to fund the placement of certain works in their taxpayer local institutions they should have the right to dictate what cannot be there.\n\nEdit:\nI guess I made some Christians, Muslims, anarchists, and facists mad.",
            "title_similarity": "0.73048997",
            "sentiment_compound": -0.7203
        },
        {
            "id": "i66felf",
            "score": -5,
            "text": "Try doing that with other Holy texts.... see how far that gets you",
            "title_similarity": "0.38378602",
            "sentiment_compound": 0.0
        },
        {
            "id": "i66ft5v",
            "score": -6,
            "text": "Isn’t the bible already banned in public schools? What is this hoping to accomplish?",
            "title_similarity": "0.66268444",
            "sentiment_compound": 0.5283
        },
        {
            "id": "i66owvn",
            "score": -6,
            "text": "Books aren't being banned from the schools. They are being 'banned' from the curriculum. The Bible already isn't taught at public school. Your kids are more than welcome to bring math textbooks from home if they want.",
            "title_similarity": "0.55375195",
            "sentiment_compound": 0.4693
        },
        {
            "id": "i68y6kn",
            "score": -5,
            "text": "Should ban gay and trans too then.  I find that weird but I'm not complaining.  More woke dummycrsts",
            "title_similarity": "0.6006999",
            "sentiment_compound": -0.193
        },
        {
            "id": "i65fpwc",
            "score": 17,
            "text": "This is absolutely hilarious!! Book banning thrown back in the Bible thumper’s faces. \nPlease make this successful!",
            "title_similarity": "0.575706",
            "sentiment_compound": 0.8741
        },
        {
            "id": "i660dag",
            "score": -18,
            "text": "its ironic that attacking the bible ultimately leads you to it huh? you should read it sometime",
            "title_similarity": "0.59264314",
            "sentiment_compound": -0.5423
        },
        {
            "id": "i65umkt",
            "score": -31,
            "text": "So I guess there goes \"In God We Trust\". \n\nI guess the USD will become a worthless collectors item when de-dollarization happens. \n\nThe US is pretty FU when the Bible gets banned. What next, Winnie the Pooh.",
            "title_similarity": "0.67527974",
            "sentiment_compound": -0.5766
        },
        {
            "id": "i65qcu0",
            "score": 5,
            "text": "Any holy book should be left out of any publicly funded schools. Want to include the bible in your schooling? Go to a christian school.",
            "title_similarity": "0.6534059",
            "sentiment_compound": 0.0772
        },
        {
            "id": "i65upr1",
            "score": 6,
            "text": "This will just reveal more obvious Republican hypocrisy and projection, but nothing else will change.\n\nMaybe just maybe it gets them to edit the Bible to their benefit not ban it.",
            "title_similarity": "0.52847755",
            "sentiment_compound": 0.8354
        },
        {
            "id": "i65xp7d",
            "score": -5,
            "text": "Are bibles used as Textbooks in Florida from K-3?",
            "title_similarity": "0.5382318",
            "sentiment_compound": 0.0
        },
        {
            "id": "i65yaop",
            "score": -7,
            "text": "Yes... a clever lawyer, reading the law closely and filing a strategic legal suit is all it's going to take America to save it from DeSantis!\n\nWhat a fucking farce this subreddit is.\n\nI'm also sure that, any day now, Donnie Trump is going to end up in prison for all the crimes he committed, right, r/politics?",
            "title_similarity": "0.526121",
            "sentiment_compound": 0.7782
        },
        {
            "id": "i6617vf",
            "score": -8,
            "text": "fuck censorship",
            "title_similarity": "0.4014465",
            "sentiment_compound": -0.5423
        },
        {
            "id": "i662rav",
            "score": -7,
            "text": "The bible isn’t part of school anyways just like lgbtq stuff, the bible and lgbtq can be taught at home by parents not teachers there are christian schools for the purpose of bible study but normal schools dont enforce this",
            "title_similarity": "0.6050042",
            "sentiment_compound": 0.1901
        },
        {
            "id": "i669i0c",
            "score": -4,
            "text": "The whining on both sides is so monotonous.",
            "title_similarity": "0.38538408",
            "sentiment_compound": -0.2263
        },
        {
            "id": "i66dc7o",
            "score": -6,
            "text": "Bullshit",
            "title_similarity": "0.2637729",
            "sentiment_compound": -0.5859
        },
        {
            "id": "i66eboe",
            "score": -7,
            "text": "Florida Democrats are too busy seeking social media back pats to realize that a lot of Democrats are Christians. In particular the folks that helped Obama win Florida are very Christian.",
            "title_similarity": "0.62057555",
            "sentiment_compound": 0.5859
        },
        {
            "id": "i66g4rf",
            "score": -8,
            "text": "The 1st amendment allows free speech a court decision or legislation can not ban the constitution or the book in which it is founded on. However Disney's  special privilege can be revoked.",
            "title_similarity": "0.5032109",
            "sentiment_compound": 0.8866
        },
        {
            "id": "i66g89r",
            "score": -8,
            "text": "Ah yes, I too love to bash Christianity for no other reason other than because I'm too stupid to understand any of it - redditor",
            "title_similarity": "0.5483632",
            "sentiment_compound": 0.3182
        },
        {
            "id": "i66gjgv",
            "score": -6,
            "text": "But critical race theory is ok.  Lol. What a fucking joke",
            "title_similarity": "0.32563242",
            "sentiment_compound": 0.611
        },
        {
            "id": "i66p9cl",
            "score": -6,
            "text": "Ah so the move to “fight” the tyrants new rules stopping teachers from sexualizing children that aren’t theirs is to cancel god. This is going to work for sure!",
            "title_similarity": "0.58557844",
            "sentiment_compound": 0.2714
        },
        {
            "id": "i67oy2e",
            "score": -7,
            "text": "Unlike Woke people, it doesn’t condone incest, bestiality, etc",
            "title_similarity": "0.3496849",
            "sentiment_compound": 0.0
        },
        {
            "id": "i680vb0",
            "score": -7,
            "text": "This weak post rellentlessly over and over again is the grooming + atheism + youth kids =How to create the downfall generation. Congratulations all you soros fans out there.",
            "title_similarity": "0.5119655",
            "sentiment_compound": 0.4767
        },
        {
            "id": "i685o9i",
            "score": -5,
            "text": "Except the Bible built successful civilizations which is more than any all inclusive woke viewpoints have ever done.",
            "title_similarity": "0.23639514",
            "sentiment_compound": 0.5859
        },
        {
            "id": "i65rjb0",
            "score": -54,
            "text": "I get the point they're trying to make, but it's pretty eye-roll.  Nobody is going to ban the book that is the cornerstone of western civilization.",
            "title_similarity": "0.46880028",
            "sentiment_compound": -0.1531
        },
        {
            "id": "i661n6z",
            "score": -22,
            "text": "source: lgbtq nation\n\nlmao\n\nThis sub has no standards anymore when it comes to sources, anything is acceptable.",
            "title_similarity": "0.48355",
            "sentiment_compound": 0.6124
        },
        {
            "id": "i65qrpr",
            "score": -82,
            "text": "Another great example of the left trying to twist the Bible to their agenda.",
            "title_similarity": "0.5625413",
            "sentiment_compound": 0.6249
        },
        {
            "id": "i65s1hj",
            "score": 8,
            "text": "Awesome. I have waited for years for the worm to turn and now the atheists get to have their day in court.",
            "title_similarity": "0.44269896",
            "sentiment_compound": 0.6249
        },
        {
            "id": "i660y1f",
            "score": -5,
            "text": "0 to s%:\" ¥--  xxz,XXZ, IO,IO,9 ZA sac  d-×",
            "title_similarity": "0.2552852",
            "sentiment_compound": 0.0
        },
        {
            "id": "i6623r6",
            "score": -8,
            "text": "I didn't realize that they used the bible as a math textbook",
            "title_similarity": "0.44717914",
            "sentiment_compound": 0.0
        },
        {
            "id": "i663loi",
            "score": -8,
            "text": "Apples to oranges",
            "title_similarity": "0.13322616",
            "sentiment_compound": 0.0
        },
        {
            "id": "i663w2c",
            "score": -7,
            "text": "News flash…you don’t need to read what you don’t like…",
            "title_similarity": "0.3873937",
            "sentiment_compound": 0.0
        },
        {
            "id": "i665iq0",
            "score": -8,
            "text": "Wow reddit first was all about banning the bible, now somebody actually wants to ban it and now it conforms to most of reddits beliefs and ideas like progressive social programs and is also \"too woke\". I love whoever dictates the hive mind machine reddit\n\nNo front",
            "title_similarity": "0.65967554",
            "sentiment_compound": 0.6908
        },
        {
            "id": "i66c00b",
            "score": -7,
            "text": "Yay let's ban books. It's okay if they do it too",
            "title_similarity": "0.45522958",
            "sentiment_compound": 0.1779
        },
        {
            "id": "i66dqu8",
            "score": -8,
            "text": "This is definitely sad news, besides the fact that it would be contradictory for the American democracy to infringe on religious freedom, I also don’t see how any of the criticisms made are actually legitimate.",
            "title_similarity": "0.6228835",
            "sentiment_compound": 0.128
        },
        {
            "id": "i66fghm",
            "score": -8,
            "text": "Ban LGBTQ Nation",
            "title_similarity": "0.5126374",
            "sentiment_compound": -0.5574
        },
        {
            "id": "i65tj45",
            "score": -8,
            "text": "[deleted]",
            "title_similarity": "0.27479658"
        },
        {
            "id": "i66nchy",
            "score": -8,
            "text": "[deleted]",
            "title_similarity": "0.27479658"
        },
        {
            "id": "i68unpm",
            "score": -9,
            "text": "Christians are incredibly nice people.  Not sure why Democrats continually persecute and harass and discriminate against them….baby murder is super important to some I guess…\n\nAmerica was founded and built by European Christians. \n\nLeftists have been brainwashed to hate America.",
            "title_similarity": "0.5553144",
            "sentiment_compound": -0.8346
        },
        {
            "id": "i65ufqu",
            "score": -30,
            "text": "Where does the Bible promote these things though?",
            "title_similarity": "0.42048064",
            "sentiment_compound": 0.3818
        },
        {
            "id": "i65tx44",
            "score": 9,
            "text": "It’s almost as if you can manipulate passages and take them out of the Bible to justify *both* ultra-right wing and socialist ideas to fit a narrative. \n\nNah, no one has done that in history, ever.",
            "title_similarity": "0.6588552",
            "sentiment_compound": -0.0258
        },
        {
            "id": "i65wlfk",
            "score": -7,
            "text": "Because 4 year olds might be confused about their sexuality",
            "title_similarity": "0.39193517",
            "sentiment_compound": -0.3182
        },
        {
            "id": "i65zbmt",
            "score": -9,
            "text": "But….you already can’t teach the Bible in school",
            "title_similarity": "0.5923193",
            "sentiment_compound": 0.0
        },
        {
            "id": "i661hmo",
            "score": -8,
            "text": "You’re not allowed to teach the Bible in public schools already though.",
            "title_similarity": "0.6133919",
            "sentiment_compound": 0.0
        },
        {
            "id": "i65tibj",
            "score": -49,
            "text": "Downvote me if you want, but I’m completely against this. I am a Christian however I do believe we should leave LGBTQ alone. And the fact that the Bible has all of that stuff that people label as evil was in there because it was evil. They were lessons being taught. People just use these as excuses to get rid of Christians a lot of times and I’m frankly tired of it. Let Christians have their beliefs and let other people have theirs. I don’t care if people think Christianity is “evil” because it is against some things or has some sections in the Bible, just leave us alone with our religion.\n\nWhew. Never really had that much of a rant before.",
            "title_similarity": "0.71656054",
            "sentiment_compound": -0.9694
        },
        {
            "id": "i664vht",
            "score": -10,
            "text": "The bibles been out too long to call it woke, the dude who filed the complaint is clearly an idiot, I'm sure next hell say dial up internet is woke, and telegrams are too woke, cave paintings are too woke, like honestly dudes got no point in his argument, show me something that is as old as the first printed bible or even scribe copied bibles that states the values and beliefs of what Florida is banning...",
            "title_similarity": "0.780979",
            "sentiment_compound": -0.3818
        },
        {
            "id": "i66awg4",
            "score": -11,
            "text": "I don't get why people are obsessed with Christianity and Republicans. You can ban the bible from public school , I went to public school and not once did I encounter the bible. Even out history books had no mention of Christianity outside of historical fact like the crusades. \n\nChristians will still send their kids to bible school or ccd and they will learn that way. That is the way it should be, parents should decide what their children are learning.\n\n&#x200B;\n\nIf your upset because you wanted to normalize speaking to children about sex well you might want to go and get some help with that.  \n\nWe are in the correction time. For the last decade or so  the left has pushed so far past boundaries that everything is rubber banding back. Twitter has fallen , Local and state governments are fighting back about indoctrinating children  and we are entering a time when things will become more conservative. It's what happened as a result of the PC cycle of previous decades",
            "title_similarity": "0.6482018",
            "sentiment_compound": -0.802
        },
        {
            "id": "i6704l3",
            "score": -9,
            "text": "I swear the US was built from the foundation of religion. \n\nWhether you're religious or not these religious books helped shape our society and in a sense stopped the barbaric nonsense we could've done. It teaches good and bad in a different way and it's something that isn't just read but makes you think critically. \n\nThe fact that 'activists' can determine what MY kid can't read and read is sad. Unfortunately, we leave our kids to the school system as some of us have to work etc and often difficult to monitor our kids and what they are learning.  The new wokeness these people in general are trying to push is making the general public drive away. Look at Netflix and it's plethora of lazy woke content. Look at sport- people switching off because of the political and social ideologies that plague these shows. \n\nIf we brought someone from the early 2000s even before back to life- they would be in shock horror. \n\nWhat pissed me off is that my kids school is teaching about a number of genders. I want my kid to know what science is. I don't want him confused. If you think like a human there are 2 genders. And a small anomaly that are intersex and genuine trans people. Trans people back in my cou try are people who were treated with utmost respect plus they weren't like anyone. But now anyone can be trans because of 'confusion ', and no one talks about the sucides and regrets after transition surgery - it's all censored.\n\nIf you noticed these people are pushing out so much sexulization I have ever seen. These people are preaching human indecency and degeneracy.",
            "title_similarity": "0.58044887",
            "sentiment_compound": -0.9872
        },
        {
            "id": "i65z41a",
            "score": -12,
            "text": "That’s why I love the Bible. It challenges everyone no matter what background/politics/agenda. It will and has existed for so long and in many mediums too. We can e on Mars and still have sd cards of it. It will never leave humanities side.",
            "title_similarity": "0.361498",
            "sentiment_compound": 0.6782
        },
        {
            "id": "i65zxbh",
            "score": -9,
            "text": "Both topics should be banned. There should be no conservative or liberal topics being taught in school.",
            "title_similarity": "0.57956827",
            "sentiment_compound": -0.6369
        },
        {
            "id": "i663a6d",
            "score": -13,
            "text": "Ahhh somehow, somehow, teaching children white people are bad and men can be women is akin to a book that’s lasted thousands of years. Makes sense.",
            "title_similarity": "0.5508359",
            "sentiment_compound": -0.5423
        },
        {
            "id": "i66bv17",
            "score": -14,
            "text": "This isn't witty at all. Doesn't even make sense to apply that argument to a spiritual text. SMH everyone is going braindead.",
            "title_similarity": "0.5779021",
            "sentiment_compound": -0.6739
        },
        {
            "id": "i66w3n6",
            "score": -14,
            "text": "Trump 2024!!!",
            "title_similarity": "0.18499233",
            "sentiment_compound": 0.0
        },
        {
            "id": "i65pzyo",
            "score": -69,
            "text": "Wow they think they’re so fucking clever with this but fail to realize this is not even remotely similar to the bills passed because the Bible is not taught in school",
            "title_similarity": "0.56173503",
            "sentiment_compound": -0.265
        },
        {
            "id": "i65r29x",
            "score": -42,
            "text": "This would violate the first amendment protections for religious freedom",
            "title_similarity": "0.57214403",
            "sentiment_compound": 0.25
        },
        {
            "id": "i6561ff",
            "score": 77,
            "text": "Surely the conservatives in charge of this program will apply one of their famous “single standards” in their good faith campaign to protect children from whatever they’re lying about doing.",
            "title_similarity": "0.5036515",
            "sentiment_compound": 0.7783
        },
        {
            "id": "i659dhb",
            "score": 151,
            "text": "“Christians are being persecuted!!” Comments incoming in 5..4..3..2..1…",
            "title_similarity": "0.6145158",
            "sentiment_compound": 0.0
        },
        {
            "id": "i656tz0",
            "score": 125,
            "text": "Anybody think of \"Fahrenheit 451\"?",
            "title_similarity": "0.2993372",
            "sentiment_compound": 0.0
        },
        {
            "id": "i65vyn9",
            "score": -19,
            "text": "This is just about the dumbest nothing burger of a political statement I have ever seen, the bible isn't taught in Florida public schools and private schools can teach whatever they want whether it's the Bible, Quran, the Torah, the Satanic verses, ect. There's also no serious push by conservatives to teach the bible in public schools.",
            "title_similarity": "0.67760754",
            "sentiment_compound": -0.4172
        },
        {
            "id": "i659n49",
            "score": 23,
            "text": "But that law was just to ban books we don't like....\n\nD'oh",
            "title_similarity": "0.64111",
            "sentiment_compound": -0.8208
        },
        {
            "id": "i65rmuz",
            "score": -22,
            "text": "~~Complaint~~ Satan filed a complaint in Florida to ban Bible as “too woke” | The book contains several \"prohibited topics\" - including incest, bestiality, progressive social programs, and the repercussions of slavery.\n\nFixed it.",
            "title_similarity": "0.96259445",
            "sentiment_compound": -0.9153
        },
        {
            "id": "i65wukp",
            "score": -24,
            "text": "[removed]",
            "title_similarity": "0.26404864"
        },
        {
            "id": "i65v09r",
            "score": -27,
            "text": "This is so lame.\n\nThis was predicted in the Bible. Go-figure.",
            "title_similarity": "0.5037885",
            "sentiment_compound": -0.5598
        },
        {
            "id": "i658zrg",
            "score": 218,
            "text": "Awesome, purge every religious text from all religious from the public school system.",
            "title_similarity": "0.50553024",
            "sentiment_compound": 0.6249
        },
        {
            "id": "i657nsk",
            "score": 549,
            "text": "Yep. Can concur. Would not feel safe letting my children read this, nor attend a certain church which seems to groom their young children for pedophilia",
            "title_similarity": "0.6345532",
            "sentiment_compound": -0.2547
        },
        {
            "id": "i65qz2d",
            "score": 42,
            "text": "I don’t give a shit about comments or karma or anything. Here’s the deal coming from a straight white guy. Hey LGBTQ people, good on you for wanting equal rights. I’ll be right there next to you fighting for it. That people think you deserve less is ridiculous. You’re not asking for more, you’re asking for EQUAL. That’s what I don’t understand from the GOP. They fucking view you as less than, not equal. It blows my mind. Anyone read any of the Bible? It’s absolutely insane!",
            "title_similarity": "0.5985424",
            "sentiment_compound": -0.7787
        },
        {
            "id": "i65ttbv",
            "score": -46,
            "text": "The Bible isnt taught in school. Liberals just keep getting dumber and dumber",
            "title_similarity": "0.6227619",
            "sentiment_compound": -0.6124
        },
        {
            "id": "i65qn7l",
            "score": -56,
            "text": "Doesn't matter what your philosophy or motives are, banning a book that has sold more copies than any other by a hilariously large margin is laughable.\n\nI get the point this idea is trying to make, but it's the equivalent to a child reacting to rules they don't like with petty corner cases to be annoying.",
            "title_similarity": "0.48576203",
            "sentiment_compound": -0.6444
        },
        {
            "id": "i65caoe",
            "score": 241,
            "text": "Knowing right wingers, they’ll thank people for reminding them about these passages and work to remove them from the Bible entirely.\n\nProblem solved!",
            "title_similarity": "0.5092664",
            "sentiment_compound": 0.2908
        },
        {
            "id": "i656llm",
            "score": 898,
            "text": "The Don’t Say Gay law is going to bite conservatives pretty hard. It’s pretty easy to turn it around from the narrow intent and make it an instrument of wokeness.",
            "title_similarity": "0.45525658",
            "sentiment_compound": 0.836
        },
        {
            "id": "i65p9qe",
            "score": -69,
            "text": "[removed]",
            "title_similarity": "0.26404864"
        },
        {
            "id": "i65djbk",
            "score": 211,
            "text": "Plus math. Don't forget the math. All that loaves and fishes stuff.",
            "title_similarity": "0.24858932",
            "sentiment_compound": 0.1695
        },
        {
            "id": "i6570wb",
            "score": 1289,
            "text": "“The state Board of Education announced last week that it will reject 71% of elementary school math textbooks and 41% of textbooks for all grades.”  [71% of math books].  Florida GOP is hoping citizens don’t, or can’t, put 2 and 2 together that they’re nuts.",
            "title_similarity": "0.6901368",
            "sentiment_compound": -0.296
        },
        {
            "id": "i65l8ab",
            "score": 412,
            "text": "The New Testament is based around the idea of a teenager who was pregnant by somebody else marrying a 20-30 yr old man, who transports her across state and international borders to seek refugee status and give birth to an “anchor baby” while hiding from the border patrol, and starting a new life as illegal immigrants under an assumed identity. \n\nAnd then that kid grows up and becomes “woke” snd disrespects, elders, pastors, politicians, law enforcement while he preaches socialism and anti capitalism ideas. Eventually executed by the state for thought crimes and challenging power structures.\n\nEdit: added a conclusion.",
            "title_similarity": "0.58477575",
            "sentiment_compound": -0.7579
        },
        {
            "id": "i65iccq",
            "score": 490,
            "text": "As a member of the Binarian religion, I take offense to any math book that teaches my kids about any numbers other than 0 and 1. These are the only true numbers, and all others are heretical.",
            "title_similarity": "0.62045354",
            "sentiment_compound": 0.2023
        },
        {
            "id": "i657nr4",
            "score": 1583,
            "text": "It's not even malicious compliance. It's just compliance.",
            "title_similarity": "0.092943795",
            "sentiment_compound": 0.0
        },
        {
            "id": "i65709w",
            "score": 7798,
            "text": "This is what we need more of really. Take matters into your own hands and start opposing these bills with actions like this. You have to counter the organized conservative side with organized action too.",
            "title_similarity": "0.5583749",
            "sentiment_compound": 0.4364
        },
        {
            "id": "i65azy0",
            "score": 5539,
            "text": "I hear it’s full of socialist ideas like healing the sick and feeding the hungry.",
            "title_similarity": "0.33735526",
            "sentiment_compound": -0.2023
        },
        {
            "id": "i65nz9o",
            "score": 1169,
            "text": "Doesn't the Bible feature a story about two chicks getting their own father drunk so they could rape him and get pregnant?\n\n I've seen more wholesome content on Pornhub, for fuck sake!",
            "title_similarity": "0.5450315",
            "sentiment_compound": -0.9033
        },
        {
            "id": "i65c2rt",
            "score": 6526,
            "text": "Jesus was a lot more woke than conservatives are willing to acknowledge.",
            "title_similarity": "0.3396143",
            "sentiment_compound": 0.0
        },
        {
            "id": "i65gpk9",
            "score": 12608,
            "text": ">Activist Chaz Stevens has filed a complaint with eight school districts in Florida challenging the Bible’s place in schools after Gov. Ron DeSantis (R) and GOP state legislators passed a “Stop WOKE Act” meant to keep “prohibited topics” like racism and LGBTQ issues out of the classroom.  \nStevens cites examples directly from the tome to prove that the Bible is too “woke” to be available to young students.  \n>  \n>\\[...\\]Stevens, an atheist, is turning the tables on Bible-beating conservatives who touted the law. Listing multiple examples of “prohibited content,” Stevens backed up his assertions with chapter and verse.  \n“With the constant concerns about teaching Critical Race Theory, should we not take stock of the Bible’s position on slavery? I am concerned our young white students will read such passages and wake up to civilization’s sordid past,” he wrote in his complaint.",
            "title_similarity": "0.8471718",
            "sentiment_compound": -0.9118
        },
        {
            "id": "i659gza",
            "score": 254,
            "text": ">progressive social programs\n\nSpicy. The extremists are going to be insulted to hear the complete and utter *slander* that their republican jesus was a socialist!!!",
            "title_similarity": "0.55017984",
            "sentiment_compound": -0.6341
        },
        {
            "id": "i659pvv",
            "score": 21,
            "text": "It is rather vulgar isn’t it",
            "title_similarity": "0.24628487",
            "sentiment_compound": 0.0
        },
        {
            "id": "i65bg2e",
            "score": 3,
            "text": "hilarious",
            "title_similarity": "0.03687966",
            "sentiment_compound": 0.4019
        },
        {
            "id": "i65bqzc",
            "score": 2,
            "text": "Yes!!",
            "title_similarity": "-0.08912012",
            "sentiment_compound": 0.508
        },
        {
            "id": "i65cvw8",
            "score": 59,
            "text": "Florida badly needs a don’t say Jesus bill.",
            "title_similarity": "0.76867664",
            "sentiment_compound": -0.4767
        },
        {
            "id": "i65cwov",
            "score": 5,
            "text": "Now someone has to file to ban the Koran and Torah. Then see which ones are banned.\nOh, by the way, when the time comes to ban the Bible, it will be republicans.",
            "title_similarity": "0.64441276",
            "sentiment_compound": -0.8807
        },
        {
            "id": "i65d42f",
            "score": 10,
            "text": "Yep ban it or quit banning what you want.",
            "title_similarity": "0.48421824",
            "sentiment_compound": -0.2732
        },
        {
            "id": "i65d9h1",
            "score": 11,
            "text": "Jesus was the ultimate woker. Ban him. Moses, too.",
            "title_similarity": "0.52487695",
            "sentiment_compound": -0.5574
        },
        {
            "id": "i65dlqy",
            "score": 37,
            "text": ">repercussions of slavery\n\nOh boy time to whip out the Haggadah.",
            "title_similarity": "0.64938205",
            "sentiment_compound": -0.7003
        },
        {
            "id": "i65dmlk",
            "score": 14,
            "text": "this. This is brilliant.",
            "title_similarity": "-0.09794602",
            "sentiment_compound": 0.5859
        },
        {
            "id": "i65dn0a",
            "score": 5,
            "text": "Not to mention abortion.",
            "title_similarity": "0.38793528",
            "sentiment_compound": 0.0
        },
        {
            "id": "i65el4n",
            "score": 1,
            "text": "Yesss",
            "title_similarity": "-0.07649329",
            "sentiment_compound": 0.0
        },
        {
            "id": "i65fcw9",
            "score": 1,
            "text": "Well played",
            "title_similarity": "-0.06566964",
            "sentiment_compound": 0.5423
        },
        {
            "id": "i65fkz2",
            "score": 2,
            "text": "As a catholic, they have a point.",
            "title_similarity": "0.13691235",
            "sentiment_compound": 0.0
        },
        {
            "id": "i65gepg",
            "score": 1,
            "text": "This is golden!  lol",
            "title_similarity": "-0.02202734",
            "sentiment_compound": 0.4753
        },
        {
            "id": "i65gixb",
            "score": 2,
            "text": "Right out of the movie Waterboy. The scene with Kathy Bates, “School is the devil” appears to be the entire GOP at this moment.  But this is part of a much larger history of Republicans trying to destroy public education.",
            "title_similarity": "0.6771364",
            "sentiment_compound": -0.6956
        },
        {
            "id": "i65gl2f",
            "score": 1,
            "text": "Love it.",
            "title_similarity": "-0.04943528",
            "sentiment_compound": 0.6369
        },
        {
            "id": "i65gvza",
            "score": 16,
            "text": "Literally the definition of indoctrination:  “to imbue with a usually partisan or sectarian opinion, point of view, or principle.”  The word specifically applies to political or religious beliefs.",
            "title_similarity": "0.51316154",
            "sentiment_compound": 0.0
        },
        {
            "id": "i65h2hx",
            "score": 1,
            "text": "Get em",
            "title_similarity": "-3.723055e-05",
            "sentiment_compound": 0.0
        },
        {
            "id": "i65hhr0",
            "score": 2,
            "text": "Brilliant!",
            "title_similarity": "-0.09059924",
            "sentiment_compound": 0.6239
        },
        {
            "id": "i65hqeo",
            "score": 2,
            "text": "Do it please do it",
            "title_similarity": "-0.009745985",
            "sentiment_compound": 0.3182
        },
        {
            "id": "i65hsq2",
            "score": 9,
            "text": "It even includes abortion in Numbers 5 11-31.",
            "title_similarity": "0.35287833",
            "sentiment_compound": 0.0
        },
        {
            "id": "i65i3ba",
            "score": 2,
            "text": "What can I say except fuck around and find out. You cant ban books you dont like by giving bs reasons cause guess what? People will use your logic to ban your books. Republicans need to chill",
            "title_similarity": "0.6659088",
            "sentiment_compound": -0.8086
        },
        {
            "id": "i65iio9",
            "score": 7,
            "text": "Yes, the most woke book before woke became a silly dumb word for threatening old beliefs with open ideas. First item on the list to separate from education and laws.",
            "title_similarity": "0.65678525",
            "sentiment_compound": -0.5994
        },
        {
            "id": "i65j1f5",
            "score": 1,
            "text": "Touché",
            "title_similarity": "0.010117553",
            "sentiment_compound": 0.0
        },
        {
            "id": "i65jk39",
            "score": 3,
            "text": "Lmao. __THIS__ all day long. 😂",
            "title_similarity": "0.106221005",
            "sentiment_compound": 0.7783
        },
        {
            "id": "i65k6bx",
            "score": 4,
            "text": "I love it .  I love it. I love it.    The Bible is woke as well!\n\n&#x200B;\n\nWhat are Republicans going to say about that, huh.",
            "title_similarity": "0.3032563",
            "sentiment_compound": 0.9432
        },
        {
            "id": "i65knoe",
            "score": 2,
            "text": "And unicorns.  Don’t forget the unicorns.  My orthodox Jewish friend told me they were on Noah’s Ark.",
            "title_similarity": "0.34599477",
            "sentiment_compound": 0.3182
        },
        {
            "id": "i65kvb5",
            "score": 1,
            "text": "This is the way.",
            "title_similarity": "-0.06058952",
            "sentiment_compound": 0.0
        },
        {
            "id": "i65m066",
            "score": 10,
            "text": "Check fucking mate lmfaoo",
            "title_similarity": "0.32989338",
            "sentiment_compound": 0.0
        },
        {
            "id": "i65mh85",
            "score": 1,
            "text": "Good",
            "title_similarity": "-0.079513155",
            "sentiment_compound": 0.4404
        },
        {
            "id": "i65mn63",
            "score": 6,
            "text": "It should be banned because, as a jew, it might make me feel guilty for killing Jesus.",
            "title_similarity": "0.65128005",
            "sentiment_compound": -0.8807
        },
        {
            "id": "i65ng6z",
            "score": 2,
            "text": "You can cite all the passages where Jesus said to be good to everyone as being 'too woke' if you wanted to.",
            "title_similarity": "0.39065224",
            "sentiment_compound": 0.4404
        },
        {
            "id": "i65nkyq",
            "score": 9,
            "text": "Do republicans ever actually think shit thru before starting dumb ass stunts like banning books? \n\nDid no one raise an eyebrow EVER? ANYWHERE? Nobody once said, “hey, they might come for the Bible if we start, yanno, BURNING BOOKS?”",
            "title_similarity": "0.63658154",
            "sentiment_compound": -0.9013
        },
        {
            "id": "i65nlki",
            "score": 2,
            "text": "And how to do an abortion.",
            "title_similarity": "0.37969208",
            "sentiment_compound": 0.0
        },
        {
            "id": "i65nn4m",
            "score": 4,
            "text": "It's as if Christians forgot about the New Testament.",
            "title_similarity": "0.50650716",
            "sentiment_compound": 0.0
        },
        {
            "id": "i65nva9",
            "score": 1,
            "text": "This is the way",
            "title_similarity": "-0.05759836",
            "sentiment_compound": 0.0
        },
        {
            "id": "i65o4vv",
            "score": 2,
            "text": "Also anti free enterprise",
            "title_similarity": "0.46407628",
            "sentiment_compound": 0.25
        },
        {
            "id": "i65o8ad",
            "score": 2,
            "text": "This complaint is poorly written. There are far more explicit and disturbing verses that could be cited.",
            "title_similarity": "0.507718",
            "sentiment_compound": -0.6969
        },
        {
            "id": "i65oa7n",
            "score": 1,
            "text": "This was literally an episode of \"Dr. Quinn, Medicine Woman.\"",
            "title_similarity": "0.30900615",
            "sentiment_compound": 0.0
        },
        {
            "id": "i65ofm0",
            "score": 1,
            "text": ":) excellent stuff",
            "title_similarity": "-0.057736114",
            "sentiment_compound": 0.7717
        },
        {
            "id": "i65ojij",
            "score": 2,
            "text": "It's also got religiously inspired violence against bankers, directions straight from the mouth of God to pay your taxes without complaint, and instructions on DIY abortions.",
            "title_similarity": "0.61931044",
            "sentiment_compound": 0.3794
        },
        {
            "id": "i65onb4",
            "score": 8,
            "text": "Ah, the old fight fire with fire approach. The Satanic Temple has been doing this for a while now. I'd love to see the movement grow (fighting the fascist agenda, I mean).",
            "title_similarity": "0.4889228",
            "sentiment_compound": -0.8074
        },
        {
            "id": "i65onbj",
            "score": 2,
            "text": "The irony is rich with irony.",
            "title_similarity": "0.16418746",
            "sentiment_compound": 0.4939
        },
        {
            "id": "i65oorp",
            "score": 46,
            "text": "This is going to impact the way conservatives pretend to read the bible",
            "title_similarity": "0.48393026",
            "sentiment_compound": -0.1027
        },
        {
            "id": "i65ot1h",
            "score": 3,
            "text": "And the Virgin Mary, my gosh! Is she a female? male? So much gender confusion.  And angels, with no genitals?  Whats up with that?  I don't want my kids to get confused. Lets burn this book.",
            "title_similarity": "0.61995924",
            "sentiment_compound": -0.8145
        },
        {
            "id": "i65oytq",
            "score": 3,
            "text": "Everything conservatives do always comes back and bites them in the ass and I find it hilarious. Truly the dumbest specimens in the world.",
            "title_similarity": "0.4608572",
            "sentiment_compound": -0.296
        },
        {
            "id": "i65p4in",
            "score": 1,
            "text": "Great idea. Fight fire with fire.",
            "title_similarity": "0.18770686",
            "sentiment_compound": -0.3182
        },
        {
            "id": "i65p6gz",
            "score": 4,
            "text": "... and ritualised abortion...in Numbers.",
            "title_similarity": "0.39545116",
            "sentiment_compound": 0.0
        },
        {
            "id": "i65p932",
            "score": 3,
            "text": "Burn all fiction!",
            "title_similarity": "0.47021416",
            "sentiment_compound": 0.0
        },
        {
            "id": "i65pd18",
            "score": 5,
            "text": "Just wait until banks/payday loans/credit cards notice the rules set in the Bible around usury.",
            "title_similarity": "0.5429883",
            "sentiment_compound": 0.0
        },
        {
            "id": "i65pjnc",
            "score": 3,
            "text": "THis iS an AttAck oN chRistianity! ThE wOrld Is TuRniNg wiCkEd!",
            "title_similarity": "0.55146694",
            "sentiment_compound": -0.7955
        },
        {
            "id": "i65pn6s",
            "score": 2,
            "text": "What about Lot. Male angels visit his home, a crowd gathers and demands he give the men over to them to rape them. Lot is all, \"no, they are my guests, but I'll give you my daughters to rape instead\"",
            "title_similarity": "0.49850082",
            "sentiment_compound": -0.886
        },
        {
            "id": "i65pqjy",
            "score": 1,
            "text": "No a good decision, after all.",
            "title_similarity": "0.3375839",
            "sentiment_compound": -0.5583
        },
        {
            "id": "i65psb6",
            "score": 3,
            "text": "Unfortunately these things operate on a double standard, and the people running the game will just reject this.",
            "title_similarity": "0.5291989",
            "sentiment_compound": -0.6249
        },
        {
            "id": "i65pwkb",
            "score": 3,
            "text": "Headlines like this make me feel all warm and toasty inside",
            "title_similarity": "-0.009585664",
            "sentiment_compound": 0.5267
        },
        {
            "id": "i65q1dh",
            "score": 6,
            "text": "Turnabout is fair play. Your move conservatives.",
            "title_similarity": "0.21206217",
            "sentiment_compound": 0.5719
        },
        {
            "id": "i65q8ue",
            "score": 12,
            "text": "[deleted]",
            "title_similarity": "0.27479658"
        },
        {
            "id": "i65qif9",
            "score": 2,
            "text": "Can we just not ban any books kthanks?",
            "title_similarity": "0.48980194",
            "sentiment_compound": 0.4449
        },
        {
            "id": "i65qmk4",
            "score": 2,
            "text": "Awesome! Can’t wait to see them back step and trip.",
            "title_similarity": "0.2035344",
            "sentiment_compound": 0.6588
        },
        {
            "id": "i65qnhd",
            "score": 3,
            "text": "ah, the satanist route",
            "title_similarity": "0.43921822",
            "sentiment_compound": 0.0
        },
        {
            "id": "i65qq6i",
            "score": 2,
            "text": "I saw this coming. \n\nStupid fucks",
            "title_similarity": "0.20280528",
            "sentiment_compound": -0.7579
        },
        {
            "id": "i65qvrj",
            "score": 5,
            "text": "Uno reverse!",
            "title_similarity": "0.17642978",
            "sentiment_compound": 0.0
        },
        {
            "id": "i65r63y",
            "score": 22,
            "text": "Hypocritical isn’t it. But then, that does seem to be a major theme of Christianity.",
            "title_similarity": "0.45850638",
            "sentiment_compound": -0.25
        },
        {
            "id": "i65r6e3",
            "score": 5,
            "text": "It is very progressive and promotes socialism.",
            "title_similarity": "0.068048164",
            "sentiment_compound": 0.3947
        },
        {
            "id": "i65r8sk",
            "score": 2,
            "text": "Every day it looks more like Maggie Thatcher had the right idea when it came to completley economically abandoning cultural backwaters.",
            "title_similarity": "0.34990346",
            "sentiment_compound": 0.0498
        },
        {
            "id": "i65ra0p",
            "score": 3,
            "text": "Nelson Muntz, points: “Ha Ha!”",
            "title_similarity": "0.22291386",
            "sentiment_compound": 0.0
        },
        {
            "id": "i65re74",
            "score": 1,
            "text": "Jesus fucking Christ.....",
            "title_similarity": "0.25694537",
            "sentiment_compound": 0.0
        },
        {
            "id": "i65rfnz",
            "score": 1,
            "text": "Numbers 5, 11-31",
            "title_similarity": "0.14922358",
            "sentiment_compound": 0.0
        },
        {
            "id": "i65rfyf",
            "score": 2,
            "text": "Honestly, conservative people won't care *that* much. They'll be teaching the bible at home. Their kids will not be missing what they consider the proper info. Their true goal is to make alternate points of view inaccessible to kids i.e. get it out of the library so their kids only have access to what momma hillbilly wants them to see and the ignorance continues for another generation.",
            "title_similarity": "0.57684803",
            "sentiment_compound": 0.3736
        },
        {
            "id": "i65rphx",
            "score": 71,
            "text": "It also contains [instructions on how to perform an abortion](https://en.wikipedia.org/wiki/Ordeal_of_the_bitter_water?wprov=sfti1)",
            "title_similarity": "0.5451247",
            "sentiment_compound": 0.0
        },
        {
            "id": "i65rs7y",
            "score": 19,
            "text": "DeSantis: No, not like that.",
            "title_similarity": "0.30375206",
            "sentiment_compound": -0.2755
        },
        {
            "id": "i65rt8k",
            "score": 4,
            "text": "They were talking about banning porn from the internet in the 90s until somebody pointed out that the transcripts from Bill Clinton's impeachment hearings constituted porn under their own bill and would get senate.gov banned. This might be just what the founders ordered.",
            "title_similarity": "0.68225074",
            "sentiment_compound": -0.4588
        },
        {
            "id": "i65rxcd",
            "score": 6,
            "text": "Remember: Jesus was trying to tell us to create a classless, moneyless, stateless society.",
            "title_similarity": "0.5608485",
            "sentiment_compound": 0.2732
        },
        {
            "id": "i65rz1k",
            "score": 1,
            "text": "[deleted]",
            "title_similarity": "0.27479658"
        },
        {
            "id": "i65rz7p",
            "score": 2,
            "text": "Repercussions of slavery… \n\nTime to open up a US history book",
            "title_similarity": "0.60834026",
            "sentiment_compound": 0.0
        },
        {
            "id": "i65s0w2",
            "score": 2,
            "text": "Yiiis",
            "title_similarity": "0.043426473",
            "sentiment_compound": 0.0
        },
        {
            "id": "i65s2qm",
            "score": 2,
            "text": "What go around come around, kid.",
            "title_similarity": "0.080195084",
            "sentiment_compound": 0.0
        },
        {
            "id": "i65s4tf",
            "score": 7,
            "text": "Fair is fair, ban away.",
            "title_similarity": "0.17773578",
            "sentiment_compound": 0.0
        },
        {
            "id": "i65s7xi",
            "score": 2,
            "text": "I think in honour of this ultimate \"chad\" move, we should rename all future chad moves as Chaz moves.\n\nThoughts?",
            "title_similarity": "0.39210916",
            "sentiment_compound": 0.5719
        },
        {
            "id": "i65saow",
            "score": 2,
            "text": "Nothing makes me happier than seeing people reverse UNO conservative bullshit like this.",
            "title_similarity": "0.36097187",
            "sentiment_compound": -0.6219
        },
        {
            "id": "i65scrx",
            "score": 3,
            "text": "Well, Trump’s got the hanging around with prostitutes part down. Too bad that’s the only part.",
            "title_similarity": "0.56062424",
            "sentiment_compound": -0.34
        },
        {
            "id": "i65sfjt",
            "score": 6,
            "text": "Tear down the Statue of Liberty. The poem written on the plaque is far too woke.",
            "title_similarity": "0.5913369",
            "sentiment_compound": 0.5267
        },
        {
            "id": "i65sgif",
            "score": 2,
            "text": "I’m glad something’s being done about this wokeism",
            "title_similarity": "0.08507624",
            "sentiment_compound": 0.4588
        },
        {
            "id": "i65siok",
            "score": 2,
            "text": "I wish we could go the other way and just not ban shit at all, make everything available. If someone's insane and looking for an excuse to do harm, they'll find it somehow. But I'd still rather live in a world where I can freely read both Mein Kampf, The Bible, and every banned LGBT book at my leisure.",
            "title_similarity": "0.6454998",
            "sentiment_compound": 0.1714
        },
        {
            "id": "i65slq7",
            "score": 6,
            "text": "And THIS ladies and gentlemen, is, and always HAS BEEN, the way to defeat craziness, with the pettiness to turn their inane arguments against them.",
            "title_similarity": "0.40225962",
            "sentiment_compound": -0.8074
        },
        {
            "id": "i65sn70",
            "score": 5,
            "text": "r/leopardsatemyface moment",
            "title_similarity": "0.3681044",
            "sentiment_compound": 0.0
        },
        {
            "id": "i65stqk",
            "score": 2,
            "text": "A total ooof moment right there",
            "title_similarity": "0.07220511",
            "sentiment_compound": 0.0
        },
        {
            "id": "i65sv31",
            "score": 5,
            "text": "It’s come full circle",
            "title_similarity": "-0.0071740914",
            "sentiment_compound": 0.0
        },
        {
            "id": "i65szu4",
            "score": 53,
            "text": "Finally some positive news from FL.   \n  \nI've pretty much decided FL is a state I won't visit again until this current government is gone.",
            "title_similarity": "0.4772564",
            "sentiment_compound": 0.7783
        },
        {
            "id": "i65tf4a",
            "score": 11,
            "text": "It also has a man standing up for prostitutes.\n\nI don't want muh children learning from immoral men like that. Hmmppff!!",
            "title_similarity": "0.5435473",
            "sentiment_compound": -0.3195
        },
        {
            "id": "i65tfvt",
            "score": 9,
            "text": "It references homosexuality so it should be banned already under the don’t say gay bill",
            "title_similarity": "0.65062964",
            "sentiment_compound": -0.4588
        },
        {
            "id": "i65tgvp",
            "score": 2,
            "text": "I understand that this is a good way to shove conservative logic back onto themselves, but weren't bibles already prohibited from being taught in public schools?",
            "title_similarity": "0.66464686",
            "sentiment_compound": 0.2382
        },
        {
            "id": "i65trju",
            "score": 11,
            "text": "This is a book that references horse cum, incest, and it implies virtue in offering up your own kids to save the puckerhole of a strange and beautiful man. \n\nPeople hand them out to kids at street corners.  \n\nI mean if that’s ok in our society then really anything goes.",
            "title_similarity": "0.5178446",
            "sentiment_compound": 0.926
        },
        {
            "id": "i65ttek",
            "score": 3,
            "text": "If Conservatives are gonna be dicks then why not?",
            "title_similarity": "0.46632951",
            "sentiment_compound": 0.0
        },
        {
            "id": "i65u6q9",
            "score": 2,
            "text": "The religious christian right deserves a kick in the balls.  This is a great start.",
            "title_similarity": "0.27271512",
            "sentiment_compound": 0.6249
        },
        {
            "id": "i65u7oq",
            "score": 2,
            "text": "Child murder also.",
            "title_similarity": "0.41252407",
            "sentiment_compound": -0.6908
        },
        {
            "id": "i65u7qg",
            "score": 3,
            "text": "The Onion must be so frustrated lately.",
            "title_similarity": "0.43395078",
            "sentiment_compound": -0.656
        },
        {
            "id": "i65u9kt",
            "score": 4,
            "text": "I assumed this was the general purpose of these controversial bills, to encite rage on both left and right sides and have schools constantly battling these issues in court until they run out of money and are shut down/privatized.",
            "title_similarity": "0.59203887",
            "sentiment_compound": -0.7579
        },
        {
            "id": "i65uapg",
            "score": 3,
            "text": "Wow did they finally force a way for evangelicals to read the bible? \"Look, I'm just following the law and right here in Ephesians 4....\"",
            "title_similarity": "0.5100605",
            "sentiment_compound": 0.5859
        },
        {
            "id": "i65uc1f",
            "score": 3,
            "text": "They don’t read it anyways. I remember a college display that was giving out cookies, so I listened to their spiel. It “changed her life” and I said that’s cool, how do you personally deal with all of the violence?  She said “oh is it violent? I mean, I know Cain killed Abel…” wt, this chick just told me this boom changed her LIFE and she hadn’t even read it.",
            "title_similarity": "0.615412",
            "sentiment_compound": -0.8796
        },
        {
            "id": "i65ucyj",
            "score": 4,
            "text": "Lol Christians are such a joke. God's punchline.",
            "title_similarity": "0.46045882",
            "sentiment_compound": 0.6124
        },
        {
            "id": "i65ugd2",
            "score": 2,
            "text": "I've been waiting for this.",
            "title_similarity": "0.13062927",
            "sentiment_compound": 0.0
        },
        {
            "id": "i65ugye",
            "score": 5,
            "text": "The concept of original sin be having kids feeling really bad about being born human.",
            "title_similarity": "0.5708567",
            "sentiment_compound": -0.6801
        },
        {
            "id": "i65uidi",
            "score": 1,
            "text": "Nice, the classic “Porky’s 2” defense.",
            "title_similarity": "0.33134228",
            "sentiment_compound": 0.5106
        },
        {
            "id": "i65uipi",
            "score": 3,
            "text": "based",
            "title_similarity": "-0.0074102795",
            "sentiment_compound": 0.0
        },
        {
            "id": "i65uoin",
            "score": 9,
            "text": "The ACLU is annoying at times \n\nBut every once in a while, they bring up a really good point \n\nThis is one of them\n\nKeep it up",
            "title_similarity": "0.29762104",
            "sentiment_compound": 0.533
        },
        {
            "id": "i65upjb",
            "score": 5,
            "text": "Stage public readings of the naughty parts",
            "title_similarity": "0.36261892",
            "sentiment_compound": 0.0
        },
        {
            "id": "i65uql0",
            "score": 2,
            "text": "I love this",
            "title_similarity": "-0.06372465",
            "sentiment_compound": 0.6369
        },
        {
            "id": "i65urjm",
            "score": 12,
            "text": "I’m Christian and this is definitely a fair response but honestly we just need to stop banning books altogether",
            "title_similarity": "0.5379003",
            "sentiment_compound": 0.5719
        },
        {
            "id": "i65uvld",
            "score": 2,
            "text": "Dose actual people really care about this who knows",
            "title_similarity": "0.08861358",
            "sentiment_compound": 0.5413
        },
        {
            "id": "i65ux3g",
            "score": 20,
            "text": "Honestly, I hate to see it come to this. We shouldn't need to talk about \"banning\" books of religion in modern society. But at some point you need to push back with the same logic. \n\nAND, we all knew this would be the conclusion of that law.",
            "title_similarity": "0.5926277",
            "sentiment_compound": -0.09
        },
        {
            "id": "i65uxxm",
            "score": 19,
            "text": "Jesus Christ was antifa and a socialist!",
            "title_similarity": "0.44348437",
            "sentiment_compound": 0.0
        },
        {
            "id": "i65uyik",
            "score": 3,
            "text": "Beastiality is super woke, bruh",
            "title_similarity": "0.30442977",
            "sentiment_compound": 0.5994
        },
        {
            "id": "i65v1kc",
            "score": 5,
            "text": "Amen",
            "title_similarity": "0.0005308986",
            "sentiment_compound": 0.0
        },
        {
            "id": "i65v3ld",
            "score": 5,
            "text": "Yup, my first thought is if I was a teacher I would remove all gender.  No one is allowed to say Mr. Or Mrs., him or her, everything is gender neutral.  I would call students by their last names.",
            "title_similarity": "0.586398",
            "sentiment_compound": -0.296
        },
        {
            "id": "i65v7wd",
            "score": 6,
            "text": "The right couldn’t leave it alone… so now they get some of their own medicine.",
            "title_similarity": "0.43780923",
            "sentiment_compound": -0.0516
        },
        {
            "id": "i65vak1",
            "score": 8,
            "text": "There also needs a lawsuit around abortion. Like, by preventing an abortion you are financially liable for the pregnancy and the child.",
            "title_similarity": "0.59370303",
            "sentiment_compound": 0.128
        },
        {
            "id": "i65vf3f",
            "score": 1,
            "text": "I have been waiting for this. YES!",
            "title_similarity": "0.09750789",
            "sentiment_compound": 0.6523
        },
        {
            "id": "i65vg8d",
            "score": 1,
            "text": "No touch-backs!!!!",
            "title_similarity": "0.27919334",
            "sentiment_compound": -0.5216
        },
        {
            "id": "i65vine",
            "score": 1,
            "text": "Goose meet gander",
            "title_similarity": "0.16595203",
            "sentiment_compound": 0.0
        },
        {
            "id": "i65vkri",
            "score": 2,
            "text": "Of course they are unlikely to actually ban the book despite the merits of the case given the law they passed oh, since the intent and language of the law was quite purposefully vague in order to allow completely unequal application of it\n\nIf only there were some kind of a legal Theory to describe these kinds of laws and this kind of lawmaking",
            "title_similarity": "0.5522801",
            "sentiment_compound": -0.7801
        },
        {
            "id": "i65vn3a",
            "score": 2,
            "text": "There's also numbers for the verses and chapters. As a white person, these numbers make me uncomfortable and therefore should be banned",
            "title_similarity": "0.60329545",
            "sentiment_compound": -0.6808
        },
        {
            "id": "i65vn5d",
            "score": 1,
            "text": "Makes sense to me.",
            "title_similarity": "-0.06671398",
            "sentiment_compound": 0.0
        },
        {
            "id": "i65vnv0",
            "score": 1,
            "text": "Isn't it already forbidden to teach the Bible in public schools?",
            "title_similarity": "0.6404382",
            "sentiment_compound": 0.3252
        },
        {
            "id": "i65vsph",
            "score": 2,
            "text": " r/nottheonion",
            "title_similarity": "0.22691487",
            "sentiment_compound": 0.0
        },
        {
            "id": "i65vvvw",
            "score": 3,
            "text": "Been waiting for the door to swing back the other way.",
            "title_similarity": "0.38421434",
            "sentiment_compound": 0.0
        },
        {
            "id": "i65vw4i",
            "score": 2,
            "text": "Not to mention it’s bullshit.",
            "title_similarity": "0.33873183",
            "sentiment_compound": -0.5859
        },
        {
            "id": "i65w2t0",
            "score": 3,
            "text": "genius",
            "title_similarity": "-0.058527865",
            "sentiment_compound": 0.0
        },
        {
            "id": "i65w3ek",
            "score": 3,
            "text": "You know.....if a kid took the bible seriously and gouged their eye out for looking at someone lustfully, how would they( the bible people) proceed. Your everything book told your kid to do it. Is it suddenly wrong to follow the bible or is it an act of faith?\n\nWhen Beavis and Butthead was going on, Beavis couldn't mention fire for years after someone set their house on fire after claiming they learned from watching that show. Really makes me think.",
            "title_similarity": "0.65180403",
            "sentiment_compound": -0.3322
        },
        {
            "id": "i65w8i1",
            "score": 2,
            "text": "Shocked the bible isn't banned already.",
            "title_similarity": "0.34574142",
            "sentiment_compound": 0.0464
        },
        {
            "id": "i65wasi",
            "score": 2,
            "text": "Desantis brain right now “well, well, well, if it isn’t the consequences of my actions coming back to bite me! \n🤣",
            "title_similarity": "0.4619928",
            "sentiment_compound": 0.7712
        },
        {
            "id": "i65wcqz",
            "score": 2,
            "text": "About time.",
            "title_similarity": "-0.06974301",
            "sentiment_compound": 0.0
        },
        {
            "id": "i65wjkf",
            "score": 2,
            "text": "This is going to backfire. I know everyone thinks this is a really clever way to show how ridiculous these laws are, but the only thing that anyone on the right is going to hear is \"Did you see that those crazy liberals are trying to ban the bible?!\" It will be used against Democrats. I guarantee it.",
            "title_similarity": "0.6713189",
            "sentiment_compound": -0.7503
        },
        {
            "id": "i65wmtu",
            "score": 1,
            "text": "Wouldn’t this go against freedom of religion?",
            "title_similarity": "0.49329185",
            "sentiment_compound": 0.6369
        },
        {
            "id": "i65wq3h",
            "score": 2,
            "text": "Omg yes please",
            "title_similarity": "-0.0432389",
            "sentiment_compound": 0.6124
        },
        {
            "id": "i65wq84",
            "score": 2,
            "text": "Serves them right.",
            "title_similarity": "-0.070332736",
            "sentiment_compound": 0.0
        },
        {
            "id": "i65ws3s",
            "score": 2,
            "text": "This is hilarious.",
            "title_similarity": "0.07350242",
            "sentiment_compound": 0.4019
        },
        {
            "id": "i65wsur",
            "score": 1,
            "text": "dont forget the second half is all one big scree for some hippie dude that hates profits and greed. dude literally whiped some poor ~~grifters~~ shopkeepers. they of course rightfully put him to death for threatening their corporate interests. /s",
            "title_similarity": "0.54290617",
            "sentiment_compound": -0.8869
        },
        {
            "id": "i65wucr",
            "score": 1,
            "text": "Brilliant move. Logical mirroring is the best way to expose a hypocritical / disingenuous argument.",
            "title_similarity": "0.26750427",
            "sentiment_compound": 0.4404
        },
        {
            "id": "i65wues",
            "score": 1,
            "text": "Is the bible part of the curriculum?",
            "title_similarity": "0.35328406",
            "sentiment_compound": 0.0
        },
        {
            "id": "i65wukt",
            "score": 1,
            "text": "The coddling of the American mind.",
            "title_similarity": "0.2864773",
            "sentiment_compound": 0.0
        },
        {
            "id": "i65wvkn",
            "score": 1,
            "text": "The Bible is pro abortion. Do texasnext",
            "title_similarity": "0.5034877",
            "sentiment_compound": 0.0
        },
        {
            "id": "i65wwdn",
            "score": 1,
            "text": "Is this how book of Eli starts?",
            "title_similarity": "0.23041444",
            "sentiment_compound": 0.0
        },
        {
            "id": "i65wxfc",
            "score": 1,
            "text": "its not actually antiwoke to avoid topics like incest and bestiality\nIts just called being sheltered. Ultimate irony",
            "title_similarity": "0.5131564",
            "sentiment_compound": 0.0258
        },
        {
            "id": "i65wyem",
            "score": 1,
            "text": "The bible already doesn’t have a place in schools?",
            "title_similarity": "0.51240826",
            "sentiment_compound": 0.0
        },
        {
            "id": "i65x3pm",
            "score": 2,
            "text": "The satanic Bible has none of these proving he's really the one we should follow. Praise Satan",
            "title_similarity": "0.59390336",
            "sentiment_compound": 0.5574
        },
        {
            "id": "i65xa5h",
            "score": 1,
            "text": "Brilliant.",
            "title_similarity": "-0.106699854",
            "sentiment_compound": 0.5859
        },
        {
            "id": "i65xfid",
            "score": 1,
            "text": "Serj. Does it have a boat launch?",
            "title_similarity": "0.24371478",
            "sentiment_compound": 0.0
        },
        {
            "id": "i65xnit",
            "score": 3,
            "text": "I love this game that is being playing. If the Bible gets a pass then all it takes is for someone to write a book as “religious text” to also receive the same exemption. And if not they sue.",
            "title_similarity": "0.49914384",
            "sentiment_compound": 0.7184
        },
        {
            "id": "i65xqxh",
            "score": 1,
            "text": "Yea I was kinda wondering about that book.  All its \"stories\" and \"magic\" and stuff.",
            "title_similarity": "0.44264337",
            "sentiment_compound": 0.0
        },
        {
            "id": "i65xw46",
            "score": 2,
            "text": "Oh, I thought this was based on the Don't Say Gay law, but this is instead based on the \"Stop Woke Act\"...\n\nLet's see how the Bible scores:\n\n       51         1. Members of one race, color, sex, or national origin are\n       52  morally superior to members of another race, color, sex, or\n       53  national origin.\n\nWell, yeah. There's the whole chosen people thing... that would certainly count.\n\n       54         2. An individual, by virtue of his or her race, color, sex,\n       55  or national origin, is inherently racist, sexist, or oppressive,\n       56  whether consciously or unconsciously.\n       57         3. An individual’s moral character or status as either\n       58  privileged or oppressed is necessarily determined by his or her\n       59  race, color, sex, or national origin.\n       60         4. Members of one race, color, sex, or national origin\n       61  cannot and should not attempt to treat others without respect to\n       62  race, color, sex, or national origin.\n       63         5. An individual, by virtue of his or her race, color, sex,\n       64  or national origin, bears responsibility for, or should be\n       65  discriminated against or receive adverse treatment because of,\n       66  actions committed in the past by other members of the same race,\n       67  color, sex, or national origin.\n\n\"No Ammonite or Moabite may enter the assembly of the Lord. Even to the tenth generation, none of them may enter the assembly of the Lord forever\"\n\nDeuteronomy 23:3\n\n       74         8. Such virtues as merit, excellence, hard work, fairness,\n       75  neutrality, objectivity, and racial colorblindness are racist or\n       76  sexist, or were created by members of a particular race, color,\n       77  sex, or national origin to oppress members of another race,\n       78  color, sex, or national origin.\n\n\"Do not be yoked together with unbelievers. For what do righteousness and wickedness have in common? Or what fellowship can light have with darkness?\"\n\n2 Corinthians 6:14",
            "title_similarity": "0.6593219",
            "sentiment_compound": 0.7609
        },
        {
            "id": "i65xx8l",
            "score": 1,
            "text": "Anyone know if he has a go fund me?",
            "title_similarity": "0.23145954",
            "sentiment_compound": 0.0
        },
        {
            "id": "i65y43x",
            "score": 3,
            "text": "Republicans hate this one trick!",
            "title_similarity": "0.48807728",
            "sentiment_compound": -0.636
        },
        {
            "id": "i65y4ay",
            "score": 1,
            "text": "I don't know but seems to me \"Religion\", per se, has been the catalyst for too much division in this world? Its a shame.",
            "title_similarity": "0.6069248",
            "sentiment_compound": -0.631
        },
        {
            "id": "i65y4ol",
            "score": 1,
            "text": "Yes! I fucking love this.",
            "title_similarity": "-0.011661583",
            "sentiment_compound": 0.8169
        },
        {
            "id": "i65y6lg",
            "score": 1,
            "text": "just say that the bible is critical race theory \n\nthey won't know because they don't read books",
            "title_similarity": "0.65193355",
            "sentiment_compound": -0.3182
        },
        {
            "id": "i65y773",
            "score": 1,
            "text": "Well played my friend.",
            "title_similarity": "-0.0063299723",
            "sentiment_compound": 0.7717
        },
        {
            "id": "i65y985",
            "score": 1,
            "text": "Thanks 4 the support!",
            "title_similarity": "0.035652697",
            "sentiment_compound": 0.7088
        },
        {
            "id": "i65y9hk",
            "score": 1,
            "text": "What is progressive social programs?",
            "title_similarity": "0.08535822",
            "sentiment_compound": 0.0
        },
        {
            "id": "i65yabd",
            "score": 1,
            "text": "See I'm all for this but I'm 99% sure the bible is already banned in schools, public schools specifically. Separation of church and state and whatever. Are there actually bibles in Florida schools? If so that's its own problem.",
            "title_similarity": "0.7740886",
            "sentiment_compound": -0.6808
        },
        {
            "id": "i65ybjn",
            "score": 1,
            "text": "This ban should be nationwide. If they’re down with banning books this should be the first to go",
            "title_similarity": "0.51580894",
            "sentiment_compound": -0.5574
        },
        {
            "id": "i65yg8t",
            "score": 1,
            "text": "Right on Brother 🙏🏿",
            "title_similarity": "0.14130893",
            "sentiment_compound": 0.0
        },
        {
            "id": "i65yjez",
            "score": 1,
            "text": "There’s a a lot of “quotations” in this article and is very biased…I didn’t get my answer until literally the last paragraph smh",
            "title_similarity": "0.5283557",
            "sentiment_compound": -0.3182
        },
        {
            "id": "i65ykkh",
            "score": 3,
            "text": "The whole feeding and clothing the poor is something modern day \"Christians\" don't like.being reminded of.",
            "title_similarity": "0.6010314",
            "sentiment_compound": -0.4767
        },
        {
            "id": "i65yl0n",
            "score": 3,
            "text": "To those suggesting it won't succeed - it's already succeeded. \n\nThey either have to abide by the complaint and remove the Bible from schools, or they'll have to expose themselves as controlling a narrative instead of actually giving a fuck about their constituents (in this case, children).",
            "title_similarity": "0.696329",
            "sentiment_compound": -0.5759
        },
        {
            "id": "i65yqlg",
            "score": 1,
            "text": "“And, as is often the case with banned books, I ask your agency lay flame to that giant stack of fiction in a pyre worthy of a Viking sendoff.”\n\nGet this man a crown and a bridge to live under, for he is the king of trolls.\n\nEdit: to be clear I fully support this dude and am not questioning the legitimacy or importance of what he's doing.",
            "title_similarity": "0.46861666",
            "sentiment_compound": 0.8068
        },
        {
            "id": "i65yvhu",
            "score": 8,
            "text": "As funny as this is, it won't do anything, republicans will just ignore it and if it somehow does go through republicans will just claim freedom of religion to protect the book. However if there was a \"woke\" religion and claimed the newly passed law infringed on said religion's rights...",
            "title_similarity": "0.641385",
            "sentiment_compound": 0.802
        },
        {
            "id": "i65z6np",
            "score": 1,
            "text": "Good luck with that.",
            "title_similarity": "-0.039364874",
            "sentiment_compound": 0.7096
        },
        {
            "id": "i65z98q",
            "score": 8,
            "text": "They like to go on about \"indoctrination of children\" someone should challenge the pledge, and bringing children to church.",
            "title_similarity": "0.47859922",
            "sentiment_compound": 0.4215
        },
        {
            "id": "i65zema",
            "score": 6,
            "text": "I’m a middle school English teacher. I once saw a group of 8th grade boys reading the Bible and snickering. There really is a ton of stuff in there that has no place in a classroom. Far worse than the things they’re actually banning. \n\nAnd I say that as a Christian.",
            "title_similarity": "0.6017895",
            "sentiment_compound": -0.6486
        },
        {
            "id": "i65zf2z",
            "score": 2,
            "text": "Not to mention abortion instructions",
            "title_similarity": "0.44647026",
            "sentiment_compound": 0.0
        },
        {
            "id": "i65zgbc",
            "score": 4,
            "text": "The bible mentions sexually explicit acts and gay people. Religious schools and Sunday schools read the bible to children. \n\n&#x200B;\n\nTime to start suing the shit out of every single one of them!",
            "title_similarity": "0.61641806",
            "sentiment_compound": 0.4926
        },
        {
            "id": "i65zgkn",
            "score": 7,
            "text": "Fucking brilliant, how can I support this as a Florida resident?",
            "title_similarity": "0.39495778",
            "sentiment_compound": 0.7778
        },
        {
            "id": "i65zlw6",
            "score": 6,
            "text": "Reminds me of when Swedes were calling in sick to work cos they felt gay because it was still classed as an illness",
            "title_similarity": "0.55270326",
            "sentiment_compound": -0.7184
        },
        {
            "id": "i65zopp",
            "score": 2,
            "text": "Stevens also writes in his request. “And, as is often the case with banned books, I ask your agency lay flame to that giant stack of fiction in a pyre worthy of a Viking sendoff.”",
            "title_similarity": "0.6121818",
            "sentiment_compound": -0.0258
        },
        {
            "id": "i65zozm",
            "score": 7,
            "text": "Do the heartbeat bills next: pregnant women driving alone should be able to use a 2+ car pool lane.",
            "title_similarity": "0.42183793",
            "sentiment_compound": -0.25
        },
        {
            "id": "i65zzb4",
            "score": 2,
            "text": "That is/was one of the reasons for public vs. private schools—the separation of Church and State.  The Bible has no place in Public school discussions.  Likewise, private schools should not be impacted by teaching what they want, and explaining 2 moms or dads to a 1st grader.",
            "title_similarity": "0.66835076",
            "sentiment_compound": -0.2263
        },
        {
            "id": "i6603vm",
            "score": 2,
            "text": "Bible Burning! Now that's a fire to roast a Mallow on! \n\n\nCool to seethe tables flip!\n\n\nChaz says Hold my Beer!",
            "title_similarity": "0.44451457",
            "sentiment_compound": -0.3111
        },
        {
            "id": "i6608nq",
            "score": 3,
            "text": "This reminds me of the Michigan Republican Legislature that passed a law that they could put a nativity on the Capitol lawn.  Then the Sanitanist put up a display next to it...due to the fact the law had to be vague and inclusive....They repealed it faster than they passed it.\n\nThink and be careful what you wish for.",
            "title_similarity": "0.594452",
            "sentiment_compound": 0.4404
        },
        {
            "id": "i660bvm",
            "score": 4,
            "text": "No problem banning that from schools. Go right ahead.",
            "title_similarity": "0.32985115",
            "sentiment_compound": 0.3089
        },
        {
            "id": "i660d08",
            "score": 1,
            "text": "I’m in Florida. How do I sign on to this?",
            "title_similarity": "0.42247653",
            "sentiment_compound": 0.0
        },
        {
            "id": "i660f2o",
            "score": 1,
            "text": "As a Christian, this is funny. I can't believe they passed a 'woke act'. I wanna hear what they have to say to this.",
            "title_similarity": "0.4469483",
            "sentiment_compound": 0.4404
        },
        {
            "id": "i660gi2",
            "score": 2,
            "text": "my favorite chapter is the one where the Son of the king of a neighboring tribe gets a Jones for an Israelite babe, and his daddy negotiates a deal with the Israelites to allow intermarriage. All the tribe has to do is get all the men circumcised. \n\nSo thanks to one pubertal adolescent, the whole tribe gets circumcised on the same day, and that afternoon the Israelites all show up and murder them while their dicks are still bleeding.  \n\nHavah nagila!",
            "title_similarity": "0.52332205",
            "sentiment_compound": 0.4995
        },
        {
            "id": "i660gid",
            "score": 2,
            "text": "It is full of incest and odd violent behavior. Maybe let's promote facts instead of story tales",
            "title_similarity": "0.59296674",
            "sentiment_compound": -0.5574
        },
        {
            "id": "i660m55",
            "score": 1,
            "text": "Annoyingly it's probably a good idea for some of those Christians to read the Bible for the first time.",
            "title_similarity": "0.42996582",
            "sentiment_compound": 0.4404
        },
        {
            "id": "i660om2",
            "score": 3,
            "text": "The church of satanism needs to require youth teachings to be available for lgbt, sexual health, race etc.  so when they ban the books they can sue.",
            "title_similarity": "0.7512016",
            "sentiment_compound": -0.5945
        },
        {
            "id": "i660pn7",
            "score": 1,
            "text": "I like this kind of trolling 😆",
            "title_similarity": "0.0982985",
            "sentiment_compound": 0.6124
        },
        {
            "id": "i660yri",
            "score": 1,
            "text": "Oh whoa - we should also add that the bible endorses slavery under specific terms.",
            "title_similarity": "0.6112044",
            "sentiment_compound": -0.5267
        },
        {
            "id": "i66111m",
            "score": 1,
            "text": "This is awesome!  It's funny how many people use the Bible as a justification for all sorts of things when they clearly have no idea whats between its covers.",
            "title_similarity": "0.5509702",
            "sentiment_compound": 0.8313
        },
        {
            "id": "i66114d",
            "score": 2,
            "text": "Don't forget all the gendering it teaches, and it starts in the first chapter!",
            "title_similarity": "0.22083336",
            "sentiment_compound": 0.2401
        },
        {
            "id": "i6612w4",
            "score": 1,
            "text": "Once we tie the legal system up *against* the Bible, because it literally violates many of the rules that have been enshrined into law, the sooner the battle will try to carve out exceptions to said book.",
            "title_similarity": "0.7188799",
            "sentiment_compound": -0.6597
        },
        {
            "id": "i6616ip",
            "score": 1,
            "text": "Math and science books are now religious texts. This is a fun game!",
            "title_similarity": "0.3194597",
            "sentiment_compound": 0.5562
        },
        {
            "id": "i6618ht",
            "score": 1,
            "text": "The Bible already isn’t read in schools.",
            "title_similarity": "0.5603576",
            "sentiment_compound": 0.0
        },
        {
            "id": "i6619aj",
            "score": 2,
            "text": "I love reactive lawsuits haha. \n\nIn all seriousness, it will never happen. I mean, have you SEEN Florida? It’s a red state, and republicans never see their hypocrisy.",
            "title_similarity": "0.5604459",
            "sentiment_compound": 0.7506
        },
        {
            "id": "i6619m5",
            "score": 2,
            "text": "Huh?",
            "title_similarity": "-0.044223137",
            "sentiment_compound": 0.0
        },
        {
            "id": "i661bap",
            "score": 1,
            "text": "This could backfire in an awkward way if they agree to keep the bible out of schools for the wrong reasons.",
            "title_similarity": "0.6825355",
            "sentiment_compound": -0.296
        },
        {
            "id": "i661csj",
            "score": 3,
            "text": "DeSantis: \"Wait. That's not what I meant.\"\n\nDeSantis, later: \"The bible isn't meant to be taken literally.\"\n\nDeSantis, even later, fingers in ears: \"La la la la la\"",
            "title_similarity": "0.60737956",
            "sentiment_compound": 0.0
        },
        {
            "id": "i661e1e",
            "score": 1,
            "text": "What is a complete waste of money, Alex.",
            "title_similarity": "0.388219",
            "sentiment_compound": -0.4215
        },
        {
            "id": "i661iqb",
            "score": 1,
            "text": "This is it. As a Floridian, I’m all for this.",
            "title_similarity": "0.123285115",
            "sentiment_compound": 0.0
        },
        {
            "id": "i661li1",
            "score": 1,
            "text": "wowed i o i i is",
            "title_similarity": "-0.04727224",
            "sentiment_compound": 0.5574
        },
        {
            "id": "i661tt1",
            "score": 1,
            "text": "Grabs popcorn...",
            "title_similarity": "0.06782864",
            "sentiment_compound": 0.0
        },
        {
            "id": "i661x0j",
            "score": 2,
            "text": "Just teach History, ALL OF IT. Not just the bits we want but every mistake every race of every continent mankind ever made. Good and Bad. Maybe then we can enter tomorrow with a better mind and more sound judgement. History will include Religion, all Religion's and it will expand on the good, the bad and the ugly.",
            "title_similarity": "0.57490206",
            "sentiment_compound": -0.5267
        },
        {
            "id": "i6622hp",
            "score": 3,
            "text": "Yes, let’s out-crazy the crazy",
            "title_similarity": "0.34630162",
            "sentiment_compound": 0.0772
        },
        {
            "id": "i662787",
            "score": 1,
            "text": "Sadly, ppl who ban books are probably too dumb to have the self awareness...",
            "title_similarity": "0.55483735",
            "sentiment_compound": -0.8658
        },
        {
            "id": "i662ax7",
            "score": 1,
            "text": "Should group books together, the Bible, Qur'an, the Bhagavad Gita (moral discussion over whether war is right or wrong, dangerous idea - and Gita is neither a he or she, so there's that).",
            "title_similarity": "0.6871933",
            "sentiment_compound": -0.8779
        },
        {
            "id": "i662emh",
            "score": 3,
            "text": "I absolutely love this. The so-called 'religious right' must be sputtering in absolute frustration over this since they can't deny any of it.",
            "title_similarity": "0.36856616",
            "sentiment_compound": 0.5313
        },
        {
            "id": "i662kou",
            "score": 1,
            "text": "Mmmm where do these people pick up their W’s?",
            "title_similarity": "0.25035694",
            "sentiment_compound": 0.0
        },
        {
            "id": "i662n8i",
            "score": 4,
            "text": "Wasn't slavery legal in the Bible? I'm curious but don't care enough to look for myself...",
            "title_similarity": "0.6756636",
            "sentiment_compound": -0.1459
        },
        {
            "id": "i662u39",
            "score": 1,
            "text": "Awesome. I was waiting for this. Also waiting for the complaint that Euro-Centric textbooks are hurting POC feelings.",
            "title_similarity": "0.5099787",
            "sentiment_compound": 0.0516
        },
        {
            "id": "i662v4m",
            "score": 2,
            "text": "Florida man cancels the bible",
            "title_similarity": "0.6636646",
            "sentiment_compound": -0.2263
        },
        {
            "id": "i662w2b",
            "score": 1,
            "text": "I know separation of church and state does not apply to politics since personal religious beliefs are allowed but that seems hypocritical because people are making life changing policies for the masses based off of their personal religious believes. Kinda bullshit if you ask me!",
            "title_similarity": "0.63635707",
            "sentiment_compound": -0.8765
        },
        {
            "id": "i662yki",
            "score": 1,
            "text": "Funny! \nThey should do it for as many things as they can",
            "title_similarity": "0.16226529",
            "sentiment_compound": 0.4926
        },
        {
            "id": "i662yu7",
            "score": 1,
            "text": "This is awesome.  I’ve always hated how Christian’s could never remember all the topics being taught from it",
            "title_similarity": "0.55867887",
            "sentiment_compound": -0.0258
        },
        {
            "id": "i6630z5",
            "score": 1,
            "text": "As a Christian (who actually reads the bible), this is exciting news. I haven’t seen any discussion about what the Bible is actually about. It’s not a midterm paper weighing in favor of theocracy. It’s a set of codes people ought to live by to take care of one another and vice versa. Jesus came into town and said “I’m your lord” and the people agreed. If you can believe it, the landlords of the time were not too happy. As a matter of fact the “civilized” courts of the time and Pilate nailed him to a board whilst Jesus, effectively a hobo revolutionary, spread a message of solidarity with neighbors and peaceful assembly. Tired of seeing the texts manipulated. Ironic that, it’s the atheist who brought the gospel to light. Even if you don’t believe in a higher power, these ideas of ethics, care, and acceptance live on beyond any nonsense theological set of premises. What freaks me out is how they came up with it in the desert with nothing over the span of 4500 years.. Truly a testament to the good striving heart of many humans. Anyway Chaz, Youre a badass regardless of faith. Keep it up👍",
            "title_similarity": "0.644915",
            "sentiment_compound": 0.9796
        },
        {
            "id": "i663aat",
            "score": 1,
            "text": "Great idea, doesn't work cuz of doublethink though",
            "title_similarity": "0.40182585",
            "sentiment_compound": 0.6249
        },
        {
            "id": "i663b6j",
            "score": 1,
            "text": "Waiting for the \"no...*not like that!!*\" from the conservatives in 3...2...1...",
            "title_similarity": "0.4572283",
            "sentiment_compound": 0.4738
        },
        {
            "id": "i663cya",
            "score": 1,
            "text": "Considering the existence of the [Conservative Bible Project](https://rationalwiki.org/wiki/Conservapedia:The_Conservative_Bible_Project) and *[The Liberty Amendments](https://www.theguardian.com/commentisfree/2013/sep/04/mark-levin-originalist-fantasy)* - both admissions that the Constitution and Bible aren't what conservative think they are - I was expecting something serious rather than an atheist stress testing \"Stop WOKE\".",
            "title_similarity": "0.6429526",
            "sentiment_compound": -0.2263
        },
        {
            "id": "i663fao",
            "score": 3,
            "text": "Jesus was a hippy. He did things like help the sick and protected “impure” women and preached against hypocrisy- John 8:1-11 for example. His entire teaching was based in loving your neighbor no matter what. It’s a damn shame that a man recorded as being charitable and forgiving is now being used to justify discrimination and judgement.",
            "title_similarity": "0.59203196",
            "sentiment_compound": 0.8139
        },
        {
            "id": "i663fd4",
            "score": 1,
            "text": "Love it! Go forth!",
            "title_similarity": "-0.001002979",
            "sentiment_compound": 0.6988
        },
        {
            "id": "i663izw",
            "score": 1,
            "text": "I don’t understand why people aren’t suing Ted Cruz’s family. It’s not impossible that they went to Mexico to help with have secret abortions.",
            "title_similarity": "0.49445885",
            "sentiment_compound": 0.1531
        },
        {
            "id": "i663jbs",
            "score": 1,
            "text": "Banning books is the same as burning books in my opinion. The Nazi regime used this method. Keep them ignorant and compliant.",
            "title_similarity": "0.5364219",
            "sentiment_compound": -0.2732
        },
        {
            "id": "i663psf",
            "score": 1,
            "text": "I love this so much",
            "title_similarity": "-0.028765857",
            "sentiment_compound": 0.6369
        },
        {
            "id": "i663u7e",
            "score": 1,
            "text": "These people don’t realize that they would literally send Jesus to the same fate that lead to this whole stupid mess in the first place. Conservatives would hate Jesus…. They really gotta get this blonde hair blue eye crap out of their head.",
            "title_similarity": "0.64816445",
            "sentiment_compound": -0.9042
        },
        {
            "id": "i663wda",
            "score": 2,
            "text": "America is nothing if not entertaining.",
            "title_similarity": "0.33564654",
            "sentiment_compound": 0.2594
        },
        {
            "id": "i663wp8",
            "score": 4,
            "text": "I mean, shouldn't that be banned across the country regardless of Florida's laws? Religion has absolutely no place in education, except maybe to learn about the history of the religion",
            "title_similarity": "0.74624527",
            "sentiment_compound": -0.0034
        },
        {
            "id": "i66432y",
            "score": 1,
            "text": "I mean… they got a point.",
            "title_similarity": "0.028144054",
            "sentiment_compound": 0.0
        },
        {
            "id": "i664izj",
            "score": 1,
            "text": "Beat them at their own game, yes I Love it.  It's hilarious that its the republicans using the government to tell people what to do what what to say.  The party of \"less government\" huh?",
            "title_similarity": "0.42695856",
            "sentiment_compound": 0.9062
        },
        {
            "id": "i664jqk",
            "score": 1,
            "text": "This is so freaking funny",
            "title_similarity": "0.06590901",
            "sentiment_compound": -0.1123
        },
        {
            "id": "i664mdo",
            "score": 1,
            "text": "Reframe the bible as progressive to get conservatives to dislike it? \n\nBrilliant",
            "title_similarity": "0.4916587",
            "sentiment_compound": 0.296
        },
        {
            "id": "i664nng",
            "score": 1,
            "text": "Amen",
            "title_similarity": "0.0005308986",
            "sentiment_compound": 0.0
        },
        {
            "id": "i664qh6",
            "score": 1,
            "text": "I'm curious how Reddit decides which posts we can see thumbs up on the comments?",
            "title_similarity": "0.34319752",
            "sentiment_compound": 0.3182
        },
        {
            "id": "i664rzj",
            "score": 2,
            "text": "This is fantastic. If we are banning material because of “prohibited topics”, then it’s only fair that we ban the Bible too. I mean, how many sensitive subjects are in there? Let’s see…there are genocides and murder, rape, plenty of laws that result in the death penalty, criminalization of some free speech and thought, and more. If that’s the case, I say we ban it. If not, burn it with the rest of the books they ban. Again, it’s only fair.",
            "title_similarity": "0.72579896",
            "sentiment_compound": -0.9559
        },
        {
            "id": "i6651dp",
            "score": 1,
            "text": "This is tooo fabulous",
            "title_similarity": "-0.04028272",
            "sentiment_compound": 0.5267
        },
        {
            "id": "i6654al",
            "score": 1,
            "text": "God I would love to see what the radical false christian right would say to defend this",
            "title_similarity": "0.5269692",
            "sentiment_compound": 0.743
        },
        {
            "id": "i6657mf",
            "score": 1,
            "text": "Get them to call out their own hypocrisy or to admit they don’t actually follow the Bible.",
            "title_similarity": "0.64183074",
            "sentiment_compound": 0.2023
        },
        {
            "id": "i6658vs",
            "score": 1,
            "text": "Oh wow much own.",
            "title_similarity": "0.0660846",
            "sentiment_compound": 0.5859
        },
        {
            "id": "i665a8z",
            "score": 1,
            "text": "Can we just saw off Florida, bugs bunny style?",
            "title_similarity": "0.53788304",
            "sentiment_compound": 0.0
        },
        {
            "id": "i665fzz",
            "score": 1,
            "text": "There is math in there too.  Time to ban that pronto!",
            "title_similarity": "0.45157367",
            "sentiment_compound": -0.5983
        },
        {
            "id": "i665hgd",
            "score": 1,
            "text": "It may be time to do it...",
            "title_similarity": "0.12817445",
            "sentiment_compound": 0.0
        },
        {
            "id": "i665mvq",
            "score": 1,
            "text": "hell yeah, get them.  the zombies won’t understand but the law’s the law",
            "title_similarity": "0.5701411",
            "sentiment_compound": -0.296
        },
        {
            "id": "i665z9x",
            "score": 1,
            "text": "Dont forget rape. It indeed condones rape.",
            "title_similarity": "0.41722083",
            "sentiment_compound": -0.0762
        },
        {
            "id": "i666572",
            "score": 1,
            "text": ">\tMay this water that brings a curse enter your body so that your abdomen swells or your womb miscarries.”\n\nNumbers 11:22.",
            "title_similarity": "0.584887",
            "sentiment_compound": -0.5423
        },
        {
            "id": "i6667dq",
            "score": 1,
            "text": "Is it not to play to some element of their 'constituency'?",
            "title_similarity": "0.35991588",
            "sentiment_compound": -0.2584
        },
        {
            "id": "i6669mi",
            "score": 1,
            "text": "lol I've been waiting for this to happen",
            "title_similarity": "0.20590726",
            "sentiment_compound": 0.4215
        },
        {
            "id": "i666a2p",
            "score": 1,
            "text": "Brilliant.",
            "title_similarity": "-0.106699854",
            "sentiment_compound": 0.5859
        },
        {
            "id": "i666bes",
            "score": 1,
            "text": "Why do we always forget sodomy...",
            "title_similarity": "0.51460934",
            "sentiment_compound": -0.2263
        },
        {
            "id": "i666e1b",
            "score": 3,
            "text": "The real book for groomers.",
            "title_similarity": "0.19828671",
            "sentiment_compound": 0.0
        },
        {
            "id": "i666gjv",
            "score": 1,
            "text": "Some people just can't believe and accept the way things really are.",
            "title_similarity": "0.36389863",
            "sentiment_compound": -0.2924
        },
        {
            "id": "i666gtf",
            "score": 1,
            "text": "What even is Florida anymore?",
            "title_similarity": "0.41485417",
            "sentiment_compound": 0.0
        },
        {
            "id": "i666kbb",
            "score": 3,
            "text": "So how many people are going to read this, completely miss the point, and then immediately cry about \"liberals\" trying to censor the Bible?\n\nEven when hypocrisy is put under a spotlight millions of people still lack the ability to see it.  Hell, Trump was a walking contradiction against everything right wingers claimed they stood for and they still voted for him.  \n\nNo amount of logical arguments will ever get them to change their minds. They simply aren't capable. Hypocrisy is their natural state.",
            "title_similarity": "0.6658864",
            "sentiment_compound": -0.953
        },
        {
            "id": "i666ltt",
            "score": 2,
            "text": "wow that's really woke. But Christians probably don't even read it anyway.",
            "title_similarity": "0.4934167",
            "sentiment_compound": 0.34
        },
        {
            "id": "i666r8z",
            "score": 1,
            "text": "There is a major difference between illustrating the reality of human depravity and endorsing it.",
            "title_similarity": "0.4185422",
            "sentiment_compound": 0.0
        },
        {
            "id": "i666rg3",
            "score": 3,
            "text": "Might as well ban the bible completely.  How many christians ever bother to read it anyway?",
            "title_similarity": "0.6433927",
            "sentiment_compound": -0.5994
        },
        {
            "id": "i666vof",
            "score": 1,
            "text": "Holy Shit!",
            "title_similarity": "0.123145476",
            "sentiment_compound": -0.5983
        },
        {
            "id": "i667ddo",
            "score": 1,
            "text": "Wow.  I bet this will happen because Republicans hate to be hypocrites.  /s",
            "title_similarity": "0.45692015",
            "sentiment_compound": 0.0258
        },
        {
            "id": "i667gx0",
            "score": 1,
            "text": "Fun fact. God killed more people in the Bible then Satan. 🔥",
            "title_similarity": "0.46790314",
            "sentiment_compound": -0.3612
        },
        {
            "id": "i667i8g",
            "score": 1,
            "text": "Fuckin beautiful... Did someone do this? Yeah I only read the headline wtf was crazy excited by the simple brilliance",
            "title_similarity": "0.2841413",
            "sentiment_compound": 0.7778
        },
        {
            "id": "i667o4p",
            "score": 1,
            "text": "Satanic Temple lawyers have entered the chat.",
            "title_similarity": "0.49034405",
            "sentiment_compound": 0.0
        },
        {
            "id": "i667pvo",
            "score": 1,
            "text": "Brilliant. This is the way to combat Florida's bullshit legislation.",
            "title_similarity": "0.5331861",
            "sentiment_compound": -0.34
        },
        {
            "id": "i667s6h",
            "score": 2,
            "text": "they shouldn’t teach the bible in school. i support this cause",
            "title_similarity": "0.5899573",
            "sentiment_compound": 0.4019
        },
        {
            "id": "i667sig",
            "score": 2,
            "text": "Plus, the second half of the book has a *profoundly* anti-Italian and anti-Semitic  point of view.  It makes me uncomfortable, [and since that is now the legal standard in Florida](https://www.cnn.com/2022/01/19/us/florida-education-critical-race-theory-bill/index.html), and even though I am not either Italian or Jewish and am only performatively outraged, it needs to go away to spare my feelings.",
            "title_similarity": "0.79794544",
            "sentiment_compound": -0.6808
        },
        {
            "id": "i667yc2",
            "score": 2,
            "text": "I’m gonna get my popcorn",
            "title_similarity": "0.15928371",
            "sentiment_compound": 0.0
        },
        {
            "id": "i667zbt",
            "score": 1,
            "text": "Yes, ban them all. Trump's next genius move...",
            "title_similarity": "0.4365359",
            "sentiment_compound": -0.2263
        },
        {
            "id": "i668436",
            "score": 1,
            "text": "Religion is a cult. The only difference in a religion versus a cult is the dude that knew it was all bullshit is dead in a religion",
            "title_similarity": "0.5306395",
            "sentiment_compound": -0.8442
        },
        {
            "id": "i6684ye",
            "score": 1,
            "text": "Lol!!!!",
            "title_similarity": "0.10786143",
            "sentiment_compound": 0.6083
        },
        {
            "id": "i668k6d",
            "score": 1,
            "text": "Im sure this wlll offend the overly paranoid white Trump loving  Christians.",
            "title_similarity": "0.48378497",
            "sentiment_compound": 0.4588
        },
        {
            "id": "i668l0j",
            "score": 1,
            "text": "So, I'm a bit confused at how this law works. Is this guy's petition something that, given the right resources on the Petitioner's side, and stubbornness on the part of the School District/FL Dept. of Ed., stands any chance of getting elevated to SCOTUS or even actual Florida courts?",
            "title_similarity": "0.7102275",
            "sentiment_compound": -0.34
        },
        {
            "id": "i668ofe",
            "score": 1,
            "text": "https://i.imgur.com/OQJwpoR.jpg",
            "title_similarity": "0.18302652",
            "sentiment_compound": 0.0
        },
        {
            "id": "i668peb",
            "score": 1,
            "text": "“Prohibited topics such as progressive social programs” lmao",
            "title_similarity": "0.5855338",
            "sentiment_compound": 0.5994
        },
        {
            "id": "i668x5f",
            "score": 1,
            "text": "That's the first book to ban from schools",
            "title_similarity": "0.4846508",
            "sentiment_compound": -0.5574
        },
        {
            "id": "i668xsc",
            "score": 1,
            "text": "How is this on topic for r/politics when [https://www.washingtonpost.com/national-security/2022/04/25/trump-held-contempt-james/](https://www.washingtonpost.com/national-security/2022/04/25/trump-held-contempt-james/) is being removed as off topic?",
            "title_similarity": "0.5297321",
            "sentiment_compound": 0.0
        },
        {
            "id": "i668yij",
            "score": 2,
            "text": "Ban it. Jesus pushes the socialist agenda. He is grooming our precious children to become reviled communists",
            "title_similarity": "0.50668085",
            "sentiment_compound": 0.0258
        },
        {
            "id": "i669906",
            "score": 2,
            "text": "You a ray of sunshine in the darkness :)",
            "title_similarity": "0.21258254",
            "sentiment_compound": 0.6369
        },
        {
            "id": "i669975",
            "score": 2,
            "text": "I absolutely love this",
            "title_similarity": "-0.05591802",
            "sentiment_compound": 0.6697
        },
        {
            "id": "i669cu1",
            "score": 2,
            "text": "Parts of The Bible are featured in the sample list of texts section of the brand new BEST Florida state standards.\n\n2 Samuel and the book of Psalms. 10th and 11th grade.",
            "title_similarity": "0.551844",
            "sentiment_compound": 0.7125
        },
        {
            "id": "i669j9s",
            "score": 3,
            "text": "Fire with fire. \n\nToo long we’ve been the peacekeepers while they shat all over us with culture war cuntery",
            "title_similarity": "0.549374",
            "sentiment_compound": -0.7269
        },
        {
            "id": "i669se7",
            "score": 4,
            "text": "The collection of stories in this book are so gruesome, perhaps it is all the sex and gore that appeals to so many. And what is it with all the burning of sacrificial meat?",
            "title_similarity": "0.54081",
            "sentiment_compound": 0.0
        },
        {
            "id": "i66a27t",
            "score": 2,
            "text": "r/LeopardsAteMyFace",
            "title_similarity": "0.37260705",
            "sentiment_compound": 0.0
        },
        {
            "id": "i66a3ou",
            "score": 3,
            "text": "As an atheist, Florida just sucks",
            "title_similarity": "0.573498",
            "sentiment_compound": -0.3612
        },
        {
            "id": "i66a8xj",
            "score": 2,
            "text": "Ironic Atheism.",
            "title_similarity": "0.31420815",
            "sentiment_compound": -0.128
        },
        {
            "id": "i66aavn",
            "score": 2,
            "text": "Ohhhh...this is good. Lemme get the popcorn.",
            "title_similarity": "0.15399185",
            "sentiment_compound": 0.4404
        },
        {
            "id": "i66abtp",
            "score": 2,
            "text": "Certainly shouldn't be used as a book for teaching kids!",
            "title_similarity": "0.52386034",
            "sentiment_compound": 0.4003
        },
        {
            "id": "i66adg2",
            "score": 2,
            "text": "Also mentions straight relationships (against the law to teach in schools), and \"non-traditional\" marriage, with plural spouses and concubines! Fucking hippie free love fest in this disgusting book!!",
            "title_similarity": "0.6348661",
            "sentiment_compound": 0.7794
        },
        {
            "id": "i66agn4",
            "score": 3,
            "text": "Republicans would ban teaching the Emancipation Proclamation if they could",
            "title_similarity": "0.6653779",
            "sentiment_compound": -0.5574
        },
        {
            "id": "i66ahig",
            "score": 2,
            "text": "Biblical Jesus was so woke, but I feel like this is only going to give them the opportunity to switch to their right wing bible where they removed all of this type of stuff.",
            "title_similarity": "0.6221393",
            "sentiment_compound": 0.7876
        },
        {
            "id": "i66ak0m",
            "score": 2,
            "text": "Kinda mind blowing lowkey",
            "title_similarity": "0.30079263",
            "sentiment_compound": 0.0
        },
        {
            "id": "i66am4v",
            "score": 5,
            "text": "As a Catholic, I really hope they do ban it",
            "title_similarity": "0.39423877",
            "sentiment_compound": -0.1045
        },
        {
            "id": "i66an2g",
            "score": 3,
            "text": "It’s about time. The Bible has always given me nightmares",
            "title_similarity": "0.58486",
            "sentiment_compound": 0.0
        },
        {
            "id": "i66azfe",
            "score": 4,
            "text": "Not just the *repercussions* of slavery, BUT also detailed descriptions of *how* to beat slaves close to death. Pure evil… we have to protect the kids from this book. \n\n“When a man strikes his male or female slave with a rod so hard that the slave dies under his hand, he shall be punished.  If, however, the slave survives for a day or two, he is not to be punished, since the slave is his own property.” (Exodus 21:20-21 NAB)",
            "title_similarity": "0.6837138",
            "sentiment_compound": -0.7833
        },
        {
            "id": "i66b49r",
            "score": 4,
            "text": "Lol more tips and tricks about how to make slavery more efficient",
            "title_similarity": "0.39708596",
            "sentiment_compound": -0.1706
        },
        {
            "id": "i66b4vi",
            "score": 4,
            "text": "You have to remember though Bible Thumpers never actually read the Bible they just hold it up high and act like they know everything from it.",
            "title_similarity": "0.53544015",
            "sentiment_compound": 0.3612
        },
        {
            "id": "i66beao",
            "score": 2,
            "text": "This was inevitable and it’s somewhat entertaining for those of us lucky enough to not live in Florida.  One wonders what the politicians are really afraid of when they start banning books and the discussion of ideas.",
            "title_similarity": "0.64211464",
            "sentiment_compound": 0.6605
        },
        {
            "id": "i66buey",
            "score": 1,
            "text": ":4dlaugh:",
            "title_similarity": "0.16811699",
            "sentiment_compound": 0.0
        },
        {
            "id": "i66bz07",
            "score": 3,
            "text": "“”If they’re gonna ban books, then the whole library should be in play. My hope — and it’s a longshot — is that they will apply their own standards to themselves and ban the Bible,” Stevens told the Miami New Times.”\n\nDamn straight.",
            "title_similarity": "0.7499347",
            "sentiment_compound": -0.5719
        },
        {
            "id": "i66c83f",
            "score": 2,
            "text": "r/maliciouscompliance",
            "title_similarity": "0.34300455",
            "sentiment_compound": 0.0
        },
        {
            "id": "i66cjw7",
            "score": 5,
            "text": "Fair is fair.",
            "title_similarity": "4.453957e-05",
            "sentiment_compound": 0.5574
        },
        {
            "id": "i66cll0",
            "score": 2,
            "text": "For what it's worth, most Christians have never read the Bible.",
            "title_similarity": "0.5557358",
            "sentiment_compound": 0.2263
        },
        {
            "id": "i66csa6",
            "score": 2,
            "text": "Fucking all for this",
            "title_similarity": "0.20651487",
            "sentiment_compound": 0.0
        },
        {
            "id": "i66d1na",
            "score": 4,
            "text": "Seems like a pretty legitimate complaint that would be successful if we did not live under Christian Sharia law",
            "title_similarity": "0.46442828",
            "sentiment_compound": 0.8074
        },
        {
            "id": "i66d2lb",
            "score": 2,
            "text": "The Bible shouldn't be in a school library anyway. Separation clause.\n\nMaybe in a HS library as a work of literature.\n\nIt has no place in an ES or MS library.",
            "title_similarity": "0.654247",
            "sentiment_compound": -0.296
        },
        {
            "id": "i66dmqp",
            "score": 2,
            "text": "They’ve come full circle! They hate themselves!",
            "title_similarity": "0.3850354",
            "sentiment_compound": -0.6467
        },
        {
            "id": "i66drk3",
            "score": 2,
            "text": "Yet, here I am, teaching high honors biology to 15/16 yr olds and I can't link a video to their genetics notes because it's about sex linked genes, like color blindness, because the description has the word \"sex\" in it. One of my students blurted out \"Are you fucking kidding me?!\" Then caught himself and quickly started apologizing, to which I reminded him to find a better way of expressing his frustration but didn't write him up because I said the same thing when I realized why the link wouldn't play on their school Chromebooks an hour earlier during my prep period.",
            "title_similarity": "0.6159482",
            "sentiment_compound": 0.1863
        },
        {
            "id": "i66dv2j",
            "score": 2,
            "text": "Ban that shit!",
            "title_similarity": "0.3163397",
            "sentiment_compound": -0.8172
        },
        {
            "id": "i66e70m",
            "score": 2,
            "text": "The \"buy-bull\" is a book of propaganda, designed to keep the masses dumb and obedient, while maintaining the rich and powerful in their position.  The most devastating instrument devised to assure Humanity's mutual destruction.  Vile fucking book.",
            "title_similarity": "0.5752777",
            "sentiment_compound": -0.8718
        },
        {
            "id": "i66el1v",
            "score": 2,
            "text": "You got served",
            "title_similarity": "-0.011410708",
            "sentiment_compound": 0.0
        },
        {
            "id": "i66elb6",
            "score": 2,
            "text": "This is fun! *Getting my popcorn ready*",
            "title_similarity": "0.1250427",
            "sentiment_compound": 0.7263
        },
        {
            "id": "i66esnm",
            "score": 6,
            "text": "“Brown guy from a foreign land wants to redistribute wealth”",
            "title_similarity": "0.38154715",
            "sentiment_compound": 0.0
        },
        {
            "id": "i66f4pc",
            "score": 2,
            "text": "How the tide has turned 😂",
            "title_similarity": "0.19402002",
            "sentiment_compound": 0.4404
        },
        {
            "id": "i66f8fx",
            "score": 2,
            "text": "Chef's kiss.",
            "title_similarity": "0.15067814",
            "sentiment_compound": 0.4215
        },
        {
            "id": "i66f9z6",
            "score": 2,
            "text": "One of my friends and I would always put the Bible into the fiction section at our school library. This puts that to shame. At the same time can we also ban the Quran for promotion of pedophilia and while we’re at it let’s ban the Torah too.",
            "title_similarity": "0.6985797",
            "sentiment_compound": -0.802
        },
        {
            "id": "i66fbko",
            "score": 2,
            "text": "Rape, forcible sodomy, trafficking, drug use, child murder, gay porn, crimes against humanity/genocide, aliens, filicide, using the jawbone of an ass as a weapon...",
            "title_similarity": "0.55442107",
            "sentiment_compound": -0.9442
        },
        {
            "id": "i66fwl6",
            "score": 2,
            "text": "I'm down for this. The Bible told me I couldn't be an adulterer.  Commies",
            "title_similarity": "0.63633645",
            "sentiment_compound": 0.0
        },
        {
            "id": "i66fy4c",
            "score": 2,
            "text": "This should be a good education for all those self-righteous Christians who never actually read the full-text Bible.",
            "title_similarity": "0.53130543",
            "sentiment_compound": 0.4404
        },
        {
            "id": "i66g1ri",
            "score": 1,
            "text": "Well and really this was the first punch back that a lot of Democrats across the country were daydreaming of and wanted to do, we always want to use their own new stupid laws AGAINST them to show how stupid it is, I'm just glad someone said it outloud.\n\nIt's already quite difficult to talk about the Bible and religion in public schools, so really the whole CRT thing could be a revenge plot against the nation and against the government because we already took their Jesus out of the school libraries and so now they're coming for our stories, lessons and public figures of \"equity, inclusion, acceptance and civic understanding\".\n\nThey are fascists. This is what fascists do, they control and whitewash information to control the populace. This is how they've always operated, this is why they hate books, history, concepts of education and acadamia because the more you know, the less you want to vote republican 😕. Their solution...... \"defund, decay and destroy knowledge, information and education\"",
            "title_similarity": "0.6705638",
            "sentiment_compound": -0.9514
        },
        {
            "id": "i66g23v",
            "score": 1,
            "text": "I went to a Catholic High School starting in 1969. Religion was a daily class. On Tuesday's we sat in class and read the Bible silently to ourselves. One day I read Leviticus 18:23, \"Neither shalt thou lie with any beast to defile thyself therewith: neither shall any woman stand before a beast to lie down thereto: it is confusion.\" Until that moment I had no idea that bestiality existed.",
            "title_similarity": "0.533288",
            "sentiment_compound": -0.5267
        },
        {
            "id": "i66gc0x",
            "score": 1,
            "text": "This is quite an amazing move actually. I’d like to see the day the bible is outlawed  in the interest of children. \n\nI’m actually looking forward to upvoting this in r/NotTheOnion should Chaz Stevens find success. \n\nEdited: grammar stuff",
            "title_similarity": "0.6142206",
            "sentiment_compound": 0.9228
        },
        {
            "id": "i66gf27",
            "score": 1,
            "text": "Imagine being religous in 2022",
            "title_similarity": "0.112663284",
            "sentiment_compound": 0.0
        },
        {
            "id": "i66gl5p",
            "score": 1,
            "text": "Oh boy culture war go brrrr",
            "title_similarity": "0.41990083",
            "sentiment_compound": -0.5994
        },
        {
            "id": "i66glae",
            "score": 2,
            "text": "Anyone else just bothered by the fact the word woke is used in a bill and a court complaint?",
            "title_similarity": "0.510001",
            "sentiment_compound": -0.5423
        },
        {
            "id": "i66gmx7",
            "score": 1,
            "text": ">progressive social programs\n\nThe horror.",
            "title_similarity": "0.33766362",
            "sentiment_compound": -0.5719
        },
        {
            "id": "i66gvg8",
            "score": 1,
            "text": "I’m not religious, I hate religion honestly, it’s a stupid concept. However, this seems like a petty move, the bible is an optional book you can pick up. Not forced on k-5 kids as part of their curriculum.",
            "title_similarity": "0.6407384",
            "sentiment_compound": 0.6983
        },
        {
            "id": "i66gvqs",
            "score": 1,
            "text": "Is the Bible even taught in public schools beyond something along the lines of “the Bible is a book, it’s Christian” and the historical context? I’ll answer that too - no.",
            "title_similarity": "0.60642743",
            "sentiment_compound": 0.0
        },
        {
            "id": "i66h1z9",
            "score": 1,
            "text": "I just learned these zealots are deeply concerned about the sexual orientation of muppets. Finally we discover which plush children’s characters the GOP thinks it’s ok to bang.",
            "title_similarity": "0.5440763",
            "sentiment_compound": 0.1027
        },
        {
            "id": "i66h2um",
            "score": 1,
            "text": "Playing for keeps",
            "title_similarity": "0.12984207",
            "sentiment_compound": 0.2023
        },
        {
            "id": "i66h33b",
            "score": 1,
            "text": "Yea I bet who ever listed all that was really worried... About the last part",
            "title_similarity": "0.39951608",
            "sentiment_compound": -0.3597
        },
        {
            "id": "i66h57n",
            "score": 2,
            "text": ">71% of elementary school math textbooks\n\nHow the crap is math woke??",
            "title_similarity": "0.2894771",
            "sentiment_compound": -0.4515
        },
        {
            "id": "i66h8l2",
            "score": 1,
            "text": "There is a god",
            "title_similarity": "0.06379016",
            "sentiment_compound": 0.2732
        },
        {
            "id": "i66h9j1",
            "score": 3,
            "text": "Where's my fucking popcorn!? Let's do this.",
            "title_similarity": "0.28168067",
            "sentiment_compound": 0.0
        },
        {
            "id": "i66hai8",
            "score": 3,
            "text": "Jesus, after reading the article, and seeing the nonsense being perpetuated in Florida (rejecting [over 50% of MATH books](https://www.nbcnews.com/news/us-news/florida-rejects-54-math-books-saying-contain-critical-race-theory-rcna24842) plus many other text books, due to the books in question violating the new statutes regarding CRT) it blows my mind that the Boomer generation (who are well aware of [book burning events by Nazis, and many others)](https://en.m.wikipedia.org/wiki/List_of_book-burning_incidents)) are behaving this way.\n\n\nI despair for the human race. \n\n\n[The fact that so many People lack introspection and empathy in the modern world leaves me dumbstruck.](https://m.youtube.com/watch?v=Whqws6PSgY0)\n\nEdit:\nGonna take another break from tracking political issues for a while....again.",
            "title_similarity": "0.78554285",
            "sentiment_compound": -0.8993
        },
        {
            "id": "i66hfyp",
            "score": 1,
            "text": "Ironic, brilliant when dumb Met dumber",
            "title_similarity": "0.16271943",
            "sentiment_compound": -0.3612
        },
        {
            "id": "i66hkrb",
            "score": 1,
            "text": "Also, there's the communism in the Book of Acts.",
            "title_similarity": "0.37242633",
            "sentiment_compound": 0.0
        },
        {
            "id": "i66homo",
            "score": 1,
            "text": "An eye for an eye leaves the whole world blind.\n\nIt's satisfying to get revenge but it's a mistake.",
            "title_similarity": "0.49503738",
            "sentiment_compound": -0.631
        },
        {
            "id": "i66howf",
            "score": 1,
            "text": "No book should be banned - no matter how idiotic it is.",
            "title_similarity": "0.4725693",
            "sentiment_compound": -0.8349
        },
        {
            "id": "i66hrhf",
            "score": 1,
            "text": "I didn’t grow up in Florida; is the Bible taught in public schools there?  It definitely was not taught at the public schools I attended in California…",
            "title_similarity": "0.60588443",
            "sentiment_compound": 0.4019
        },
        {
            "id": "i66hsnl",
            "score": 2,
            "text": "This is generally how these sorts of laws get overturned: use them against the people they're supposed to benefit.",
            "title_similarity": "0.53829247",
            "sentiment_compound": 0.4588
        },
        {
            "id": "i66hvns",
            "score": 1,
            "text": "Good, ban that religious bullshit",
            "title_similarity": "0.40439573",
            "sentiment_compound": -0.6705
        },
        {
            "id": "i66hysi",
            "score": 1,
            "text": "[Ha!](https://i.imgur.com/vyFa1oU.gifv)\n\nThe jokes on them...neither of the \"prohibited topics\" are talked about as a **good thing**, just sayin'.",
            "title_similarity": "0.40303555",
            "sentiment_compound": 0.636
        },
        {
            "id": "i66i1tj",
            "score": 3,
            "text": "We are (and have been) getting to the point where America is one giant divided quagmire of two countries, one is a Christofascist far-right xenophobic cesspool with very limited civil liberties, the other is a slightly better but still dystopian land of academics, moderates and closeted conservative democrats.  And in the middle of this is a people who are just struggling to make the rent.",
            "title_similarity": "0.59185076",
            "sentiment_compound": -0.2985
        },
        {
            "id": "i66i32b",
            "score": 3,
            "text": "The Old Testament is full of socialism in the first few books… they specifically say that debt is wiped out every 7 years",
            "title_similarity": "0.39838302",
            "sentiment_compound": -0.3612
        },
        {
            "id": "i66i4yf",
            "score": 3,
            "text": "Well the Bible is not an age appropriate book for those under highschool. It’s pushing it in highschool. I agree.",
            "title_similarity": "0.5945667",
            "sentiment_compound": 0.5574
        },
        {
            "id": "i66i6bn",
            "score": 2,
            "text": "I read that shit, it’s wild. Certainly shouldn’t be read the children. I wouldn’t want to read it to adults. Racist, homophonic, misogynistic. It could be written for the police of course.",
            "title_similarity": "0.69802064",
            "sentiment_compound": -0.7096
        },
        {
            "id": "i66iez9",
            "score": 2,
            "text": "Wouldn't you be living a life following the Bible if you followed the lifestyle of Sodom and Gamorrah",
            "title_similarity": "0.5427827",
            "sentiment_compound": 0.0
        },
        {
            "id": "i66iw9b",
            "score": 2,
            "text": "Lmao Florida’s fucked",
            "title_similarity": "0.557408",
            "sentiment_compound": -0.128
        },
        {
            "id": "i66ix1r",
            "score": 1,
            "text": "It sure does. But you know the q nuts when they found out it’s the republicans who are pedophiles they changed their tune.",
            "title_similarity": "0.51288676",
            "sentiment_compound": -0.3182
        },
        {
            "id": "i66ixc3",
            "score": 2,
            "text": "I wish the democratic party as a whole were as sassy as atheists.  We'd have gotten a lot more done in the last 15 years as a country.",
            "title_similarity": "0.4900459",
            "sentiment_compound": 0.6597
        },
        {
            "id": "i66ixvp",
            "score": 1,
            "text": "Fuck yes!",
            "title_similarity": "0.026775185",
            "sentiment_compound": -0.2714
        },
        {
            "id": "i66j3d3",
            "score": 2,
            "text": "Someone should take all of the naughty passages from the Bible and put them in a separate book and see how long before it is banned.",
            "title_similarity": "0.6862289",
            "sentiment_compound": -0.4588
        },
        {
            "id": "i66je02",
            "score": 2,
            "text": "That complaint was shit, I wish someone would submit a well written one next time!",
            "title_similarity": "0.46673396",
            "sentiment_compound": -0.3164
        },
        {
            "id": "i66jsq0",
            "score": 2,
            "text": "I’m pretty sure this won’t do anything but I pray to the giant Flying Spaghetti Monster that it does",
            "title_similarity": "0.5040785",
            "sentiment_compound": 0.6908
        },
        {
            "id": "i66jvvu",
            "score": 1,
            "text": "Why is Florida trying to be edgy and controversial?\n\nI get the whole complaint; but nobody advocates about these things: no longer does an angry man flood the world because nobody gave two-shits about him. \n\nNo longer does one stab a brother because envy. No longer will Egyptians throw babies over the river Nile. I’m not a Christian, but there is a reason we should address these issues and stop censoring materials: To progress as human beings and be able to prevent mistakes from happening again, it’s not the book that’s the problem. It’s whiney, homophobic oligarchy lawmakers who’s trying to make people ignorant is. You know the type of countries who keeps people ignorant: Russia, North Korea, China. For a land that is free they seem to “restrict” expressions. \nAt the end of the day these things don’t matter: Why? 1st amendment. The government can’t force you or the people to keep quiet. Consider I’m from the UK and is calling out on the lawmaker bull should be embarrassing for them for failing the people and what it means to be part of the “United States.”\n\n-UK citizen",
            "title_similarity": "0.71419424",
            "sentiment_compound": -0.9901
        },
        {
            "id": "i66jxd7",
            "score": 1,
            "text": "Eh, im a Christian in florida and I’m fine with it. It’s academics not Sunday school lmao",
            "title_similarity": "0.54455906",
            "sentiment_compound": -0.3283
        },
        {
            "id": "i66jxp3",
            "score": 1,
            "text": "Low this. Where can I donate?",
            "title_similarity": "0.27340895",
            "sentiment_compound": -0.2732
        },
        {
            "id": "i66jzjv",
            "score": 1,
            "text": "Great! Keep this out of there too!",
            "title_similarity": "0.276517",
            "sentiment_compound": 0.6892
        },
        {
            "id": "i66k2qe",
            "score": 4,
            "text": "Having read Leviticus, fucking animals and being fucked by them must have been more common back then.\n\nThat said; doesn’t this kind of prove conservatives right in that gay marriage was the precursor to inter-species marriage that we all laughed about.\n\nFucking animals is animal abuse. There’s nothing woke about it.",
            "title_similarity": "0.58965814",
            "sentiment_compound": -0.765
        },
        {
            "id": "i66k5gl",
            "score": 3,
            "text": "😆 Hail Satan",
            "title_similarity": "0.4195783",
            "sentiment_compound": 0.4215
        },
        {
            "id": "i66k63o",
            "score": 3,
            "text": "You'll have to ban the quran too, see how well that goes down",
            "title_similarity": "0.619807",
            "sentiment_compound": -0.3612
        },
        {
            "id": "i66kf4y",
            "score": 4,
            "text": "These stupid republicans have no clue!  Wake up- these kids are so much smarter than these political idiots. They know about sex - they know about being gay and they know so much more. They know the games these politicians are playing.",
            "title_similarity": "0.36848542",
            "sentiment_compound": -0.2056
        },
        {
            "id": "i66klay",
            "score": 1,
            "text": "Ban bans",
            "title_similarity": "0.40683472",
            "sentiment_compound": -0.5574
        },
        {
            "id": "i66kls4",
            "score": 1,
            "text": "My biggest issue with America as a whole is how we claim a separation between Church and State...but allow states to make as many laws as possible reflecting Church values. \n\n....And the beacon of the Church is a book that frankly is \"wild\", to state the least. \n\nJust doesn't feel like a fair fight if that makes sense. Just give me pure separation.",
            "title_similarity": "0.71378845",
            "sentiment_compound": 0.2937
        },
        {
            "id": "i66kvjy",
            "score": 2,
            "text": "Can you believe this Jesus fellow, love for your neighbors and compassion for the poor. Don’t get me on the anti rich propaganda and hanging out with thieves and prostitutes. Sound like a bad influence to me.",
            "title_similarity": "0.58864886",
            "sentiment_compound": 0.0258
        },
        {
            "id": "i66kzhh",
            "score": 2,
            "text": "Woke from the dead",
            "title_similarity": "0.22752103",
            "sentiment_compound": -0.6486
        },
        {
            "id": "i66l2pb",
            "score": 2,
            "text": "He is absolutely, hilariously, correct.  Most of the other banned books are tame compared with the Bible, which should have been on the top of the list of banned books.  If any books were to be banned at all, they should start with the Bible and fight about that book first.  By all means, yes, let's get an open discussion started about what is actually in the Bible.",
            "title_similarity": "0.6717171",
            "sentiment_compound": -0.7964
        },
        {
            "id": "i66l343",
            "score": 4,
            "text": "Yes. There is more evil in that book than any book they have banned.",
            "title_similarity": "0.5139988",
            "sentiment_compound": -0.7178
        },
        {
            "id": "i66l3sx",
            "score": 2,
            "text": "Hahaha. This is hilarious. Screw every book of propaganda.",
            "title_similarity": "0.46804118",
            "sentiment_compound": 0.5994
        },
        {
            "id": "i66l6ax",
            "score": 2,
            "text": "Haha",
            "title_similarity": "-0.017366715",
            "sentiment_compound": 0.4588
        },
        {
            "id": "i66l9fl",
            "score": 4,
            "text": "I still can’t believe that Desantis is allowed to reject 71% math textbooks but not be able to point to a single example to support your decision\n\nAnd I’m sure the new suppliers of textbooks will conveniently have some sort of personal connection to Desantis or the Florida GOP",
            "title_similarity": "0.6727485",
            "sentiment_compound": 0.6858
        },
        {
            "id": "i66le1f",
            "score": 2,
            "text": "It'll just fuel their persecution fantasy",
            "title_similarity": "0.342892",
            "sentiment_compound": 0.0
        },
        {
            "id": "i66lino",
            "score": 2,
            "text": "It’s best not to ban any book because your book will get banned before you know it.",
            "title_similarity": "0.566236",
            "sentiment_compound": 0.6278
        },
        {
            "id": "i66liss",
            "score": 3,
            "text": "On Easter my mom brought up “you know the Bible has really graphic and violent stuff that kids can read” she was saying this as a positive thing. I said “it should be banned from school libraries”. I got a lot of nervous laughter from my family and a quick change of the subject.",
            "title_similarity": "0.62855226",
            "sentiment_compound": -0.3535
        },
        {
            "id": "i66lofb",
            "score": 1,
            "text": "No dammit! I want kids to learn that you can turn into salt!",
            "title_similarity": "0.46115562",
            "sentiment_compound": -0.3578
        },
        {
            "id": "i66lq61",
            "score": 4,
            "text": "The sordid deeds outlined in that book - the sodomites, the adultery....pearl-clutchingly abhorrent!!",
            "title_similarity": "0.631632",
            "sentiment_compound": -0.6892
        },
        {
            "id": "i66lt6k",
            "score": 2,
            "text": "Yesss!!!! Fuck off you religious weirdos.",
            "title_similarity": "0.45868838",
            "sentiment_compound": -0.7762
        },
        {
            "id": "i66lx2u",
            "score": 2,
            "text": "This is how you do it, don't get mad, don't give up, fight back.  Two can always play the game.",
            "title_similarity": "0.23742478",
            "sentiment_compound": 0.7361
        },
        {
            "id": "i66lz72",
            "score": 2,
            "text": "This makes my day.",
            "title_similarity": "0.016935274",
            "sentiment_compound": 0.0
        },
        {
            "id": "i66m31u",
            "score": 3,
            "text": "Your terms are acceptable, church and state should be separate regardless",
            "title_similarity": "0.37807986",
            "sentiment_compound": 0.3182
        },
        {
            "id": "i66ma0t",
            "score": 1,
            "text": "Some years ago my son was driving his under ten year olds to school.. One of them called another , “Gay”. Sean asked “Do you guys know what that means?”  For the next ten minutes he got a very detailed explaination of the word, the people and the acts.. he decided never to ask them anything ever again.",
            "title_similarity": "0.47757325",
            "sentiment_compound": 0.0
        },
        {
            "id": "i66mig4",
            "score": 3,
            "text": "This is the best response to DeSatans bullshittery.",
            "title_similarity": "0.2230528",
            "sentiment_compound": 0.6369
        },
        {
            "id": "i66mko0",
            "score": 2,
            "text": "I’m not very religious.but I believe when Armageddon comes Florida will be one of the very first places that will be destroyed!ps…I live in Florida smfh!!!",
            "title_similarity": "0.7355179",
            "sentiment_compound": 0.0
        },
        {
            "id": "i66mkpb",
            "score": 5,
            "text": "Jesus is from the tribe of Judah.\n\nJudah: 15 When Judah saw her, he thought she was a prostitute, for she had covered her face. 16 Not realizing that she was his daughter-in-law, he went over to her by the roadside and said, “Come now, let me sleep with you.”\n\nHoly crap the guy is having sex with his daughter in law what in the pornhub is this?\n\nIs this the type of filth you want your kids learning about?",
            "title_similarity": "0.57272303",
            "sentiment_compound": -0.3939
        },
        {
            "id": "i66mva0",
            "score": 1,
            "text": "Anytime a Republican/Conservative starts blabbering about the Bible supporting his/her beliefs, I always like to bring up this quote: \n\n\"*Come now, you rich people, weep and wail for the miseries that are coming to you. Your riches have rotted, and your clothes are moth-eaten. Your gold and silver have rusted, and their rust will be evidence against you, and it will eat your flesh like fire. You have laid up treasurer during the last days. Listen! The wages of the laborers who mowed your fields, which you kept back by fraud, cry out, and the cries of the harvesters have reached the ears of the Lord of hosts. You have lived on the earth in luxury and in pleasure; you have nourished your hearts in a day of slaughter. You have condemned and murdered the righteous one, who does not resist you* (James 5: 1-6, NRSVue).\"",
            "title_similarity": "0.6087347",
            "sentiment_compound": -0.4926
        },
        {
            "id": "i66n3l7",
            "score": 10,
            "text": "Bring in The Satanic Temple. They used the establishment clause of the 1st Amendment to help get rid of the 10 Commandments from the Oklahoma capital. They are a smart bunch who know how to use the law against religious tyrants.",
            "title_similarity": "0.5506295",
            "sentiment_compound": 0.6597
        },
        {
            "id": "i66ncg3",
            "score": 1,
            "text": "Death Santis: \"Not like that!\"",
            "title_similarity": "0.389736",
            "sentiment_compound": -0.7432
        },
        {
            "id": "i66nhzx",
            "score": 3,
            "text": "If someone didn't do it, it's most likely the Satanic Temple eventually would have",
            "title_similarity": "0.49379078",
            "sentiment_compound": 0.0
        },
        {
            "id": "i66nkbl",
            "score": 2,
            "text": "Bible's thoughts on each:\n\nincest - \"thats cringe, dont do that\"   \n\n\nbestiality - \"that's cringe, dont do that\"   \n\n\nprogressive social programs - \\*insert Jesus here\\*   \n\n\nslavery - \\*insert paul's letters being one of the first to humanize slaves\\*\n\n  \nYou're right, it is too woke for them.",
            "title_similarity": "0.6962573",
            "sentiment_compound": -0.7003
        },
        {
            "id": "i66nmrp",
            "score": 1,
            "text": "Good argument. I don't want any religious ideas covered in elementary school any more than I want identity politics or sexuality.",
            "title_similarity": "0.5780879",
            "sentiment_compound": 0.1881
        },
        {
            "id": "i66nw6z",
            "score": 3,
            "text": "As great as this is, the judge just will strike it down as they are themselves most likely bible thumping conservatives.",
            "title_similarity": "0.51950943",
            "sentiment_compound": 0.5574
        },
        {
            "id": "i66og1h",
            "score": 5,
            "text": "I'm not Christian but from what I understand, Christ was woke AF.",
            "title_similarity": "0.4822787",
            "sentiment_compound": 0.0
        },
        {
            "id": "i66oill",
            "score": 1,
            "text": "Well. Well. Well. How the turn tables.",
            "title_similarity": "0.10695122",
            "sentiment_compound": 0.6486
        },
        {
            "id": "i66p447",
            "score": 6,
            "text": "Now this is getting interesting",
            "title_similarity": "-0.025190804",
            "sentiment_compound": 0.4019
        },
        {
            "id": "i66p8ds",
            "score": 1,
            "text": "If I don't see it, it's not there",
            "title_similarity": "0.2684173",
            "sentiment_compound": 0.0
        },
        {
            "id": "i66plo7",
            "score": 3,
            "text": "I live in FL and would love to help with this",
            "title_similarity": "0.2258017",
            "sentiment_compound": 0.7845
        },
        {
            "id": "i66py1l",
            "score": 1,
            "text": "Conservatives won't care. This is all about power for them. They don't give a shit about moral or logical consistency.",
            "title_similarity": "0.45405823",
            "sentiment_compound": 0.0762
        },
        {
            "id": "i66qdgj",
            "score": 2,
            "text": "I love it!",
            "title_similarity": "-0.053708404",
            "sentiment_compound": 0.6696
        },
        {
            "id": "i66qqki",
            "score": 6,
            "text": "If Jesus came back, republicans would most definitely accuse him of being a woke commie.",
            "title_similarity": "0.5500674",
            "sentiment_compound": 0.2298
        },
        {
            "id": "i66r3h2",
            "score": 2,
            "text": "Honestly all for this. Religion should be separated from school and government",
            "title_similarity": "0.5623567",
            "sentiment_compound": 0.4588
        },
        {
            "id": "i66r7fe",
            "score": 2,
            "text": "That’s a pretty optimistic goal",
            "title_similarity": "-0.041341994",
            "sentiment_compound": 0.6705
        },
        {
            "id": "i66r90n",
            "score": 1,
            "text": "Delicious",
            "title_similarity": "-0.038272053",
            "sentiment_compound": 0.5719
        },
        {
            "id": "i66rgty",
            "score": 2,
            "text": "This kind of thing has been tried once in a while across the country, but this book always gets a pass.  Maybe things might be different this time.  Would be nice to see.",
            "title_similarity": "0.44654638",
            "sentiment_compound": 0.5719
        },
        {
            "id": "i66rl1m",
            "score": 4,
            "text": "After the ruling allowing the Bible to remain in classrooms for any reason, frame every banned book or teaching in the same exact light afterwards, and make sure to press the case to have the Koran in every classroom for the exact reasons the Bible is going to be given a pass.",
            "title_similarity": "0.5105871",
            "sentiment_compound": -0.1779
        },
        {
            "id": "i66rnzn",
            "score": 1,
            "text": "Thank God for Mis-Florida",
            "title_similarity": "0.42705977",
            "sentiment_compound": 0.5574
        },
        {
            "id": "i66smva",
            "score": 1,
            "text": "This is the best idea ever and I’m mad for not thinking of it first. The Bible is a horror show. \n\nImagine my 12 year old self asking my parents about Deuteronomy 23:1  \n\nSon: Dad, why would a man’s testicles be crushed and have their penis cut off? \n\nDad: well son, a funny thing about the Bible is, that it’s better to not regret something that you have done then to regret having done it. And when you see your mother tell her Satan, Satan, Satan.",
            "title_similarity": "0.629302",
            "sentiment_compound": -0.0433
        },
        {
            "id": "i66t468",
            "score": 1,
            "text": "Anyone reading this thread should pick up the book *American Cosmic*.\n\nThere may be something to this whole religion thing. But people like Mr. DeSantis definitely arent getting into whatever golden Gates await us, if that's even how it works....\n\nJames, one of the people featured in the book has come out as Garry Nolan, a Standford professor, and Tim Taylor is still someone yet to reveal him/her self, but Garry has revealed Tim is in fact a real person.\n\nThe book itself is pretty crazy from what hear.",
            "title_similarity": "0.6846261",
            "sentiment_compound": 0.8625
        },
        {
            "id": "i66t7oq",
            "score": 1,
            "text": "I am laughing like drax right now.",
            "title_similarity": "0.039682653",
            "sentiment_compound": 0.6908
        },
        {
            "id": "i66t9j4",
            "score": 1,
            "text": "Why tf not 🙄",
            "title_similarity": "0.25419173",
            "sentiment_compound": 0.0
        },
        {
            "id": "i66tpqw",
            "score": 1,
            "text": "This guy thinks they're following the law. They're not. They'll shoot this down while banning the books they want banned without thinking twice.",
            "title_similarity": "0.5856064",
            "sentiment_compound": -0.169
        },
        {
            "id": "i66tx50",
            "score": 1,
            "text": "pontius pilate = thin blue line",
            "title_similarity": "0.31457502",
            "sentiment_compound": 0.0
        },
        {
            "id": "i66u1pv",
            "score": 1,
            "text": "Nice.",
            "title_similarity": "-0.0801946",
            "sentiment_compound": 0.4215
        },
        {
            "id": "i66u32a",
            "score": 1,
            "text": "Lmao! The Bible isn’t even an American book.",
            "title_similarity": "0.5280267",
            "sentiment_compound": 0.636
        },
        {
            "id": "i66u6fk",
            "score": 2,
            "text": "And how about that love thy neighbour shit? just way too damn nice!",
            "title_similarity": "0.29286325",
            "sentiment_compound": 0.2481
        },
        {
            "id": "i66umh5",
            "score": 1,
            "text": "I mean the Bible comes off as anti-capitalist and anti-wealth at times.",
            "title_similarity": "0.56408304",
            "sentiment_compound": 0.0
        },
        {
            "id": "i66upvz",
            "score": 1,
            "text": "As a pastafarian i take offense from anyone who eats pasta. He boiled for our sins. How dare anyone desecrate his sweet sweet noodley  appendages… The church of the flyings spaghetti monster wont forget.",
            "title_similarity": "0.58385104",
            "sentiment_compound": 0.3952
        },
        {
            "id": "i66upz7",
            "score": 1,
            "text": "Will this include all religious texts that include those topics?",
            "title_similarity": "0.28332943",
            "sentiment_compound": 0.0
        },
        {
            "id": "i66uyu6",
            "score": 1,
            "text": "Not to mention it talks about being gay. Which is a no no in Florida.",
            "title_similarity": "0.583633",
            "sentiment_compound": 0.2235
        },
        {
            "id": "i66uzls",
            "score": 1,
            "text": "Ban churches too please",
            "title_similarity": "0.49714023",
            "sentiment_compound": -0.3182
        },
        {
            "id": "i66v0gm",
            "score": 1,
            "text": "Don't forget the Bible promotes abortion.",
            "title_similarity": "0.45778334",
            "sentiment_compound": 0.4707
        },
        {
            "id": "i66v5pp",
            "score": 1,
            "text": "Ban the Bible, ban the Quran, ban the Book of Mormon, ban all those books of the Bible that were removed because they didn’t align with what they want you to believe",
            "title_similarity": "0.6847357",
            "sentiment_compound": -0.9337
        },
        {
            "id": "i66v9qy",
            "score": 3,
            "text": "fun as this gotcha is, one of these days people are going to have to realize the gop isn't arguing in good faith, nor are their judges.  Trying to beat them at their own game generally doesn't work.",
            "title_similarity": "0.48422018",
            "sentiment_compound": 0.733
        },
        {
            "id": "i66vc49",
            "score": 3,
            "text": "Shouldn't the Bible be banned under Don't Say Gay?",
            "title_similarity": "0.67784655",
            "sentiment_compound": -0.4588
        },
        {
            "id": "i66vg0t",
            "score": 2,
            "text": "Mfs can dish it but they sure don’t like the taste when it’s handed back to them",
            "title_similarity": "0.53477776",
            "sentiment_compound": 0.7351
        },
        {
            "id": "i66vm1j",
            "score": 2,
            "text": "Never change florida, never change",
            "title_similarity": "0.3051921",
            "sentiment_compound": 0.0
        },
        {
            "id": "i66vmfi",
            "score": 5,
            "text": "I’m in the process of listening to the Bible.  I’m only 5 books into the Old Testament and it’s honestly shocking what’s in this thing. Incest, genocide, polygamy, racial purity themes, animal sacrifice. And that’s just what I’ve read so far….",
            "title_similarity": "0.5826827",
            "sentiment_compound": 0.0772
        },
        {
            "id": "i66vtzw",
            "score": 1,
            "text": "Woke???  I like watching people be dumb as hell.",
            "title_similarity": "0.2994365",
            "sentiment_compound": -0.787
        },
        {
            "id": "i66w050",
            "score": 1,
            "text": "Well played!",
            "title_similarity": "-0.047277167",
            "sentiment_compound": 0.5848
        },
        {
            "id": "i66w8tb",
            "score": 2,
            "text": "This some uno reverse card shit",
            "title_similarity": "0.38172072",
            "sentiment_compound": -0.5574
        },
        {
            "id": "i66wtdk",
            "score": 1,
            "text": "Those likes though \"66.6k\".lol",
            "title_similarity": "0.20937967",
            "sentiment_compound": 0.4215
        },
        {
            "id": "i66ww2a",
            "score": 3,
            "text": "These lawsuits should be flooding in. Super low hanging fruit.",
            "title_similarity": "0.49155053",
            "sentiment_compound": 0.296
        },
        {
            "id": "i66x5nc",
            "score": 7,
            "text": "The Bible literally condones slavery lol",
            "title_similarity": "0.5978371",
            "sentiment_compound": -0.4588
        },
        {
            "id": "i66x7iw",
            "score": 1,
            "text": "This law should be challenged in court as a violation of the first amendment on the federal level so an appellate court can rule that this bullshit law is a violation of the first amendment for especially state/government employees which teachers and schools are.",
            "title_similarity": "0.6420216",
            "sentiment_compound": -0.9062
        },
        {
            "id": "i66y4sa",
            "score": 2,
            "text": "TIL the Bible is CRT!",
            "title_similarity": "0.39486843",
            "sentiment_compound": 0.0
        },
        {
            "id": "i66yt77",
            "score": 2,
            "text": "I mean, fair is fair",
            "title_similarity": "0.017925223",
            "sentiment_compound": 0.5574
        },
        {
            "id": "i66zn6n",
            "score": 1,
            "text": "Mmm yeah the command to love everyone sounds a lot like critical race theory to me.",
            "title_similarity": "0.28430146",
            "sentiment_compound": 0.765
        },
        {
            "id": "i6706z6",
            "score": 1,
            "text": "It also contains cannibalism",
            "title_similarity": "0.37885982",
            "sentiment_compound": 0.0
        },
        {
            "id": "i670g66",
            "score": 1,
            "text": "I’m down for banning the Bible from schools\n\nI think most would support that but I don’t live in flyover country so might be out of touch.",
            "title_similarity": "0.6904038",
            "sentiment_compound": 0.2475
        },
        {
            "id": "i670m8w",
            "score": 1,
            "text": "About god damn time",
            "title_similarity": "0.031408235",
            "sentiment_compound": -0.1531
        },
        {
            "id": "i670nw3",
            "score": 3,
            "text": "The Bible advocates for Communism, not sure why conservatives like it so much. Oh right, they skip that whole section of Acts.",
            "title_similarity": "0.59077775",
            "sentiment_compound": 0.1376
        },
        {
            "id": "i670vh5",
            "score": 1,
            "text": "Bible: Don’t judge people based on their actions.\nPeople: Well I don’t agree so it doesn’t count.",
            "title_similarity": "0.5619384",
            "sentiment_compound": 0.5574
        },
        {
            "id": "i670xls",
            "score": 1,
            "text": "Uh, the Bible most definitely SANCTIONS slavery. I don’t remember the part where it talks about any repercussions (unless they’re referring to the section on how hard you can beat them with a rod).",
            "title_similarity": "0.76624",
            "sentiment_compound": -0.5378
        },
        {
            "id": "i6719r7",
            "score": 2,
            "text": "I want it banned everywhere. It's pure filth.",
            "title_similarity": "0.5327414",
            "sentiment_compound": -0.4019
        },
        {
            "id": "i671zmx",
            "score": 2,
            "text": "The Bible is too woke. it needs to be banned",
            "title_similarity": "0.676254",
            "sentiment_compound": -0.4588
        },
        {
            "id": "i67255c",
            "score": 1,
            "text": "It also contains anti-conservative rhetoric like ‘love one another’ and ‘don’t judge people as that is reserved for God only’. So surprised Fl hasn’t banned it ages ago.",
            "title_similarity": "0.6155556",
            "sentiment_compound": 0.4201
        },
        {
            "id": "i672elv",
            "score": 1,
            "text": "I embrace the mystical essence of purity even as a mystical it’s a difficult concept to adapt to wholesomeness as empirical understanding of all energy what ever form. Completely above academia in the-traditional roles. I am normally the one that just smiles. \nFar above traditional academia it’s a comprehension. Teach economics.",
            "title_similarity": "0.4025002",
            "sentiment_compound": 0.6124
        },
        {
            "id": "i67320c",
            "score": 1,
            "text": "Couple with this with \"Don't Say Gay\" is the government infringing on our Constitutional right to free speech!  We should be able to say \"gay\" all we want!",
            "title_similarity": "0.6182188",
            "sentiment_compound": 0.6351
        },
        {
            "id": "i673cng",
            "score": 4,
            "text": "The Bible is Fair game…or is that not convenient Desantis to your agenda?!",
            "title_similarity": "0.40601325",
            "sentiment_compound": 0.3802
        },
        {
            "id": "i673cxr",
            "score": 2,
            "text": "mother of fucking god, this is that good shit.\n\nmore of this- aggressively.",
            "title_similarity": "0.18353993",
            "sentiment_compound": -0.3097
        },
        {
            "id": "i673eax",
            "score": 3,
            "text": "The Bible doesn’t need to be banned, nobody reads it. Actually it should be required reading, only then would people be like WTF.",
            "title_similarity": "0.55590963",
            "sentiment_compound": -0.7213
        },
        {
            "id": "i673i7b",
            "score": 2,
            "text": "Here we go.",
            "title_similarity": "-0.024845265",
            "sentiment_compound": 0.0
        },
        {
            "id": "i673uxq",
            "score": 4,
            "text": "Evolution is the next GQP culture war. Bet on it.",
            "title_similarity": "0.43648118",
            "sentiment_compound": -0.5994
        },
        {
            "id": "i6742q3",
            "score": 2,
            "text": "This kinda move only works if they're committed to enforcing the law equally and consistently - literally the opposite of the GOP platform and ethos. \n\nScores points for \"they're hypocrites\" but the government of Florida is not about to be less hypocritical as a result.",
            "title_similarity": "0.55285734",
            "sentiment_compound": -0.4607
        },
        {
            "id": "i674i3i",
            "score": 2,
            "text": "I’m a libertarian that’s hated by both sides but well done. I get the purpose of this but the Bible really is trash.",
            "title_similarity": "0.6513294",
            "sentiment_compound": 0.128
        },
        {
            "id": "i674rg2",
            "score": 3,
            "text": "My grade nine teacher , who was a nun, told us all that bestiality was a sin.   \nNone of us had ever even heard of it before and she starts explaining it to us.  I have never forgotten that, and that was 40 years ago.  I could have done without that knowledge, so let's do it.  Let's ban the bible",
            "title_similarity": "0.6042303",
            "sentiment_compound": -0.7604
        },
        {
            "id": "i675lji",
            "score": 1,
            "text": "I don't know what else to say other than ... LMFAO\n\nOn one hand, it's the Bible, which many people love, and on the other, they're not wrong....",
            "title_similarity": "0.3977845",
            "sentiment_compound": 0.9347
        },
        {
            "id": "i675xxb",
            "score": 1,
            "text": "Okay I could get behind this",
            "title_similarity": "0.034644727",
            "sentiment_compound": 0.2263
        },
        {
            "id": "i6760dy",
            "score": 1,
            "text": "Dont forget all the talk of demons and devils. How un-catholic!",
            "title_similarity": "0.5383999",
            "sentiment_compound": -0.5149
        },
        {
            "id": "i6762r3",
            "score": 2,
            "text": "Marge Greene (R) says anyone who doesn't believe in Creationism is a groomer.",
            "title_similarity": "0.53568304",
            "sentiment_compound": -0.1326
        },
        {
            "id": "i6763mp",
            "score": 2,
            "text": "Not only that, it specifically says Jesus was the first being to split the son from the father and the son from his nature and redden the virgin white pillar.  If you decipher the matrix it is either homosexuality or an atomic warhead.",
            "title_similarity": "0.5734427",
            "sentiment_compound": 0.0
        },
        {
            "id": "i676bhm",
            "score": 2,
            "text": "Well it’s about time, if only this was globally",
            "title_similarity": "0.1097297",
            "sentiment_compound": 0.2732
        },
        {
            "id": "i6774cb",
            "score": 3,
            "text": "Jesus traveled from place to place (illegal alien) and proclaimed himself to be king of the Jews (treason) and God (blasphemy), believed that the rich should give their money to the poor (communism/socialism), and created very high demand products from thin air (market manipulation). \n\nHe was also Jewish and was born in Levantine Arabia (multi-cultural woke bullshit/foreigner). Not to mention he didn’t speak a single word of English! He didn’t wear modern clothes, opting instead for a tunic (informal attire/slob), and allegedly evaded the death penalty (prison escapee/criminal). Not to mention the whole Mary Magdalene thing (which would probably be considered pimping in modern America)\n\nIf anyone were to be hated by modern day conservatives and other right wingers, it would be Jesus (the guy most of them claim to worship as their primary deity).\n\nTl;dr According to the Bible, Jesus has done pretty much the exact opposite to what republicans call “Christian values”, because they’re very silly and dumb",
            "title_similarity": "0.6231323",
            "sentiment_compound": -0.9604
        },
        {
            "id": "i677duy",
            "score": 1,
            "text": "Fight fire with fire. Fighting stupidity with fire too, just like the inquisition did.",
            "title_similarity": "0.42052665",
            "sentiment_compound": -0.9169
        },
        {
            "id": "i6783q1",
            "score": 1,
            "text": "No, not like that!",
            "title_similarity": "0.24777515",
            "sentiment_compound": -0.3404
        },
        {
            "id": "i678808",
            "score": 1,
            "text": "This is fun and all, but can you beat them at their own game? They just stoop lower every time. So low and to such despicable levels that it’s tactically impossible to keep up.",
            "title_similarity": "0.47767276",
            "sentiment_compound": -0.6442
        },
        {
            "id": "i678llo",
            "score": 1,
            "text": "Finally",
            "title_similarity": "-0.05131814",
            "sentiment_compound": 0.0
        },
        {
            "id": "i6792i2",
            "score": 1,
            "text": "Hell to the yeah",
            "title_similarity": "0.2533641",
            "sentiment_compound": -0.5267
        },
        {
            "id": "i67977n",
            "score": 4,
            "text": "It’s honestly infuriating how hypocritical right wing evangelical Christian’s are when it comes to Jesus. They worship a guy who they have nothing in common with.",
            "title_similarity": "0.595738",
            "sentiment_compound": -0.296
        },
        {
            "id": "i6799or",
            "score": 2,
            "text": "If a math book can’t do it why can a random book about the man in the sky",
            "title_similarity": "0.40721196",
            "sentiment_compound": 0.0
        },
        {
            "id": "i679toy",
            "score": 1,
            "text": "Wow",
            "title_similarity": "-0.04980006",
            "sentiment_compound": 0.5859
        },
        {
            "id": "i679y1c",
            "score": 3,
            "text": "It’s a shame the dude had to be incredibly snarky for no reason.  This seems like a completely reasonable request under the new law and should’ve been treated seriously.",
            "title_similarity": "0.4358433",
            "sentiment_compound": -0.5809
        },
        {
            "id": "i679zxu",
            "score": 2,
            "text": "Let’s ban it globally ¯\\ _(ツ)_/¯",
            "title_similarity": "0.45161435",
            "sentiment_compound": -0.5574
        },
        {
            "id": "i67af98",
            "score": 1,
            "text": "And also the encouragement and acceptance of slavery",
            "title_similarity": "0.40157336",
            "sentiment_compound": 0.0
        },
        {
            "id": "i67ak4m",
            "score": 1,
            "text": "Hehehe… the new culture wars are rife with some absurd shit… and some clever shit.",
            "title_similarity": "0.44804066",
            "sentiment_compound": -0.6369
        },
        {
            "id": "i67am0v",
            "score": 1,
            "text": "I remember at my public high school, my history teacher had to teach us about creationism because we had just learned about Evolution lol someone had to do a presentation about Jesus lol",
            "title_similarity": "0.5106976",
            "sentiment_compound": 0.743
        },
        {
            "id": "i67amp1",
            "score": 4,
            "text": "They aren’t going to ban it. The idea of hypocrisy is well beyond this group.",
            "title_similarity": "0.40411612",
            "sentiment_compound": -0.3612
        },
        {
            "id": "i67bfb6",
            "score": 1,
            "text": "Why don't you ban some bittches.",
            "title_similarity": "0.48837763",
            "sentiment_compound": 0.4449
        },
        {
            "id": "i67bp1d",
            "score": 1,
            "text": "The American Christian Taliban will have an answer for this,  just wait.  Our ancestors came to avoid religious persecution, seems like some of us have forgotten this, one of the rights guaranteed to us in the constitution.  So they write laws, and think it does not apply to themselves.  Seems like the Christian Taliban is populated by arrogant idiots.",
            "title_similarity": "0.6776785",
            "sentiment_compound": -0.3182
        },
        {
            "id": "i67c04x",
            "score": 1,
            "text": "That's all folks\nHave a great PC world",
            "title_similarity": "0.07972607",
            "sentiment_compound": 0.6249
        },
        {
            "id": "i67cvny",
            "score": 1,
            "text": "Christ now their own media is “woke”? oh my God",
            "title_similarity": "0.36641747",
            "sentiment_compound": 0.2732
        },
        {
            "id": "i67d6qs",
            "score": 1,
            "text": "Take that, bible-thumping hypocrites.",
            "title_similarity": "0.48335692",
            "sentiment_compound": 0.0
        },
        {
            "id": "i67dw8t",
            "score": 2,
            "text": "Whoever organized this is my true hero. Truly. You are the shit.",
            "title_similarity": "0.20028421",
            "sentiment_compound": 0.9231
        },
        {
            "id": "i67ecg7",
            "score": 2,
            "text": "Lol, this is some master level leopard eating face",
            "title_similarity": "0.34898168",
            "sentiment_compound": 0.4215
        },
        {
            "id": "i67eswf",
            "score": 1,
            "text": "Wasn’t Jesus the first Woke One?   He’d be banned in FL if he were around today!",
            "title_similarity": "0.6681028",
            "sentiment_compound": -0.5093
        },
        {
            "id": "i67f1ou",
            "score": 1,
            "text": "Based",
            "title_similarity": "-0.0074102795",
            "sentiment_compound": 0.0
        },
        {
            "id": "i67fp5p",
            "score": 1,
            "text": "Ban that shit",
            "title_similarity": "0.32386982",
            "sentiment_compound": -0.802
        },
        {
            "id": "i67fz9o",
            "score": 1,
            "text": "Now THIS is something.",
            "title_similarity": "-0.06475161",
            "sentiment_compound": 0.0
        },
        {
            "id": "i67gdzm",
            "score": 1,
            "text": "This has to be a plant. They never actually read it",
            "title_similarity": "0.40902016",
            "sentiment_compound": 0.0
        },
        {
            "id": "i67geyg",
            "score": 1,
            "text": "I thought it said \"insect beastiality\".  That'd be a new chapter for me.",
            "title_similarity": "0.43053457",
            "sentiment_compound": 0.0
        },
        {
            "id": "i67gnbg",
            "score": 1,
            "text": "[Chaz Stevens is a Douchebag](https://twitter.com/thetweetofjab/status/1518746107869908993?s=21&t=5Z20ACekrFBS3MiGQSPPtQ)",
            "title_similarity": "0.51271343",
            "sentiment_compound": 0.0
        },
        {
            "id": "i67gpmj",
            "score": 1,
            "text": "Banning the bible is the complete opposite of woke lol. It's common sense to do so.",
            "title_similarity": "0.56173396",
            "sentiment_compound": 0.4215
        },
        {
            "id": "i67httl",
            "score": 1,
            "text": "Jesus was woke",
            "title_similarity": "0.14193758",
            "sentiment_compound": 0.0
        },
        {
            "id": "i67i028",
            "score": 1,
            "text": "This should really \"wake\" people to the total hypocrisy of those whom claim to \"represent\" the people. \nMost politicians will claim, state, or otherwise profess thier belief in the \"Almighty\" - but, thier actions, the \"fruit of thier labor\", is beyond rotting corruption and is clearly in direct opposition to what is written in scripture - ANY \"spiritual scripture\".\n\nThis corruption is on BOTH sides of the isle. Politicians, in general, only care about one thing - themselves. Everything they do, everything they say, is well planned out to better line thier pockets and fatten thier back accounts. \nThey care NOT for the \"average\" person that they claim to \"represent\". History has prove this to be true.",
            "title_similarity": "0.5758606",
            "sentiment_compound": 0.9731
        },
        {
            "id": "i67i7pt",
            "score": 1,
            "text": "and veganism\n\n*gasp*",
            "title_similarity": "0.41115203",
            "sentiment_compound": 0.0
        },
        {
            "id": "i67ia2s",
            "score": 3,
            "text": "it should be banned or at least moved to the Fiction section in the library",
            "title_similarity": "0.55398554",
            "sentiment_compound": -0.4588
        },
        {
            "id": "i67ivr8",
            "score": 1,
            "text": "I thought you couldn’t have a bible in a public school?",
            "title_similarity": "0.5540786",
            "sentiment_compound": 0.0
        },
        {
            "id": "i67jzm7",
            "score": 2,
            "text": "Reverse Uno",
            "title_similarity": "0.1851596",
            "sentiment_compound": 0.0
        },
        {
            "id": "i67k34p",
            "score": 1,
            "text": "As a Christian I still find this funny because it's absolutely true.  Of course, I haven't seen a bible in a classroom or anything being taught from it in my entire life in any classroom and that's just fine.  I don't think we should be pursuing ANY religion in school, that's something personal and unnecessary for the masses.  You know, just like knowing where somebody else puts their pee pee, I don't care or need to know this information should be a goal.  Is it really so difficult to teach basic reading and writing and maybe not worry about pushing social reform at such a young age?",
            "title_similarity": "0.56346583",
            "sentiment_compound": 0.7146
        },
        {
            "id": "i67kfqq",
            "score": 2,
            "text": "Ban that filth",
            "title_similarity": "0.3760364",
            "sentiment_compound": -0.5574
        },
        {
            "id": "i67ku14",
            "score": 6,
            "text": "This will be very interesting to watch how it unfolds. Cause by Florida’s very own law, this guy has them dead to rights. It’s irrefutable.",
            "title_similarity": "0.68836504",
            "sentiment_compound": -0.3197
        },
        {
            "id": "i67liwl",
            "score": 1,
            "text": "Jesus woke me",
            "title_similarity": "0.2130464",
            "sentiment_compound": 0.0
        },
        {
            "id": "i67luz3",
            "score": 1,
            "text": "Thank God for atheists",
            "title_similarity": "0.32558793",
            "sentiment_compound": 0.5574
        },
        {
            "id": "i67m6d7",
            "score": 2,
            "text": "\"Dems trying to ban the Bible\"\n\nThat's all they'll hear.",
            "title_similarity": "0.67713904",
            "sentiment_compound": -0.5574
        },
        {
            "id": "i67ml9d",
            "score": 2,
            "text": "I want to see them ban that. Florida would implode in a gatornator",
            "title_similarity": "0.73735356",
            "sentiment_compound": -0.5106
        },
        {
            "id": "i67nem2",
            "score": 2,
            "text": "Break out that Ezekiel 23:20 on em",
            "title_similarity": "0.32481235",
            "sentiment_compound": 0.0
        },
        {
            "id": "i67nosq",
            "score": 4,
            "text": "I’m all for banning the book that helped people justify slavery, rape, torture, misogyny, racism and so much more.",
            "title_similarity": "0.7452808",
            "sentiment_compound": -0.9612
        },
        {
            "id": "i67pvpw",
            "score": 2,
            "text": "The coup de grace would be to get this to extend to private Christian schools that receive government funding",
            "title_similarity": "0.4232639",
            "sentiment_compound": 0.5423
        },
        {
            "id": "i67qf48",
            "score": 3,
            "text": "This is fighting fire with fire. I love it!",
            "title_similarity": "0.16162923",
            "sentiment_compound": -0.3382
        },
        {
            "id": "i67qfrp",
            "score": 2,
            "text": "Would love to see this succeed...",
            "title_similarity": "0.016289476",
            "sentiment_compound": 0.8381
        },
        {
            "id": "i67qpon",
            "score": 1,
            "text": "Ok but what’s wrong with a little incest?",
            "title_similarity": "0.5001623",
            "sentiment_compound": -0.5499
        },
        {
            "id": "i67rmte",
            "score": 1,
            "text": "What Would Woke Jesus Do?",
            "title_similarity": "0.32302922",
            "sentiment_compound": 0.0
        },
        {
            "id": "i67s0xh",
            "score": 2,
            "text": "This isn't a very new concept. Recent lists are mostly gay / trans books, but about five years ago, the Bible was the [sixth most challenged or banned book.](https://www.latimes.com/books/jacketcopy/la-et-jc-bible-top-10-challenged-books-2015-20160411-20160411-snap-htmlstory.html) It's not that people are against religion; they just don't want teachers having any overt displays of it in the classroom.",
            "title_similarity": "0.66297567",
            "sentiment_compound": -0.7762
        },
        {
            "id": "i67siby",
            "score": 2,
            "text": "Oh my God! This is amazing!",
            "title_similarity": "-0.024501685",
            "sentiment_compound": 0.7568
        },
        {
            "id": "i67sugc",
            "score": 3,
            "text": "it hurt itself in its own confusion!",
            "title_similarity": "0.39176047",
            "sentiment_compound": -0.7088
        },
        {
            "id": "i67syc5",
            "score": 1,
            "text": "Just curious….for those that have read the Bible, does it really mention those topics?  If so, what does it actually say?",
            "title_similarity": "0.4427579",
            "sentiment_compound": 0.0
        },
        {
            "id": "i67t7cy",
            "score": 2,
            "text": "Dude I just totally woke up",
            "title_similarity": "0.09095248",
            "sentiment_compound": 0.0
        },
        {
            "id": "i67tprw",
            "score": 2,
            "text": "This is the only time I’ve contemplated buying an award.",
            "title_similarity": "0.22721374",
            "sentiment_compound": 0.5423
        },
        {
            "id": "i67ulsy",
            "score": 1,
            "text": "It also depicts how to give a woman an abortion. Numbers 5",
            "title_similarity": "0.42682832",
            "sentiment_compound": 0.0
        },
        {
            "id": "i67vbcw",
            "score": 1,
            "text": "It’s like liberals are real close to getting it but get stuck up on the worst Christians. Stick with the social programs part and caring for the poor to poke holes in the faith of Christians and conservatives. Then you’ll see them really squirm. This is just gonna make them say these people don’t know anything about the reigion",
            "title_similarity": "0.6809343",
            "sentiment_compound": -0.5499
        },
        {
            "id": "i67vigi",
            "score": 1,
            "text": "Good luck.",
            "title_similarity": "-0.046697088",
            "sentiment_compound": 0.7096
        },
        {
            "id": "i67vkq7",
            "score": 1,
            "text": "Is the Bible taught in\nPublic s schools?? Required reading ??",
            "title_similarity": "0.42615363",
            "sentiment_compound": 0.0
        },
        {
            "id": "i67vox3",
            "score": 1,
            "text": "You can’t take the Bible away! Floridians like their Bibles like they like their guns…in school with their children.",
            "title_similarity": "0.40820163",
            "sentiment_compound": 0.7777
        },
        {
            "id": "i67vzy7",
            "score": 1,
            "text": "Freedom of the press: 😢",
            "title_similarity": "0.21360558",
            "sentiment_compound": 0.2732
        },
        {
            "id": "i67wsm9",
            "score": 1,
            "text": "If conservatives could read, this would make them very upset. I live for the day the Bible is deemed vile, fiction bullshit.",
            "title_similarity": "0.67846525",
            "sentiment_compound": -0.8955
        },
        {
            "id": "i67wzie",
            "score": 1,
            "text": "But wait; we see those stories every day on the news, movies, and soap operas?!",
            "title_similarity": "0.23583123",
            "sentiment_compound": 0.0
        },
        {
            "id": "i67xatn",
            "score": 1,
            "text": "Remember that part in East of Eden where the Chinese servant explains why it's just easier to speak pigeon language? That book would be banned by their standards.",
            "title_similarity": "0.58474755",
            "sentiment_compound": -0.0516
        },
        {
            "id": "i67xlhp",
            "score": 1,
            "text": "This is really a smart move to force people to think harder. Sadly, I doubt it will have any positive impact in bringing folks to shared viewpoints that help anyone. People find millions of ways to justify their biases. Prizing unity at the cost of one’s own beliefs, preferences or biases is nearly impossible.",
            "title_similarity": "0.457889",
            "sentiment_compound": 0.749
        },
        {
            "id": "i67z742",
            "score": 1,
            "text": "I’m not even Christian and I can hear the devil laughing through this act.",
            "title_similarity": "0.48455736",
            "sentiment_compound": -0.296
        },
        {
            "id": "i67zbre",
            "score": 1,
            "text": "I can see a lot of this action by conservative floridians being done in the name of Christianity to fight what they believe to be evil influences. \nBut Jesus Christ himself, in his most famous sermon, said to \"resist not evil and turn the other cheek.\" Matthew 5:39\nJesus Christ is saying to be a good and meek person and God will fight all of those battles for them. Banning all of these books is literally un-Christian.",
            "title_similarity": "0.668737",
            "sentiment_compound": 0.2439
        },
        {
            "id": "i67zn09",
            "score": 1,
            "text": "r/leopardsatemyface",
            "title_similarity": "0.372607",
            "sentiment_compound": 0.0
        },
        {
            "id": "i67zstp",
            "score": 1,
            "text": "https://www.amazon.com/Random-Word-search-Zachriah-Van-buskirk/dp/B09Y5PR9FL/ref=mp_s_a_1_1?crid=2EDHEI77QW938&keywords=zachriah+van+buskirk&qid=1650943296&sprefix=zachriah+%2Caps%2C288&sr=8-1#",
            "title_similarity": "0.45582497",
            "sentiment_compound": 0.0
        },
        {
            "id": "i680ytd",
            "score": 1,
            "text": "Good",
            "title_similarity": "-0.079513155",
            "sentiment_compound": 0.4404
        },
        {
            "id": "i681awe",
            "score": 2,
            "text": "Fucking finally!  This is the kind of shit we need to be doing all over the place with this right wing bullshit. Their ideology is so full of contradiction we need to start putting them into Sophie's choice situations with their nonsense and make them pick which of this shit they are going to do.",
            "title_similarity": "0.5689342",
            "sentiment_compound": -0.9531
        },
        {
            "id": "i681h30",
            "score": 1,
            "text": "What's good for the goose is good for the gander",
            "title_similarity": "0.20547906",
            "sentiment_compound": 0.7003
        },
        {
            "id": "i6824a5",
            "score": 1,
            "text": "*laughs in homer simpsons voice*",
            "title_similarity": "0.20855518",
            "sentiment_compound": 0.4939
        },
        {
            "id": "i682bd4",
            "score": 1,
            "text": "I’m not sure I understand how those laws work. Aren’t they clearly defined as to what constitutes violations, and have clearly demarcated penalties?  \n\nSo how can they be ignored if a book fits within the violations, from a legal point of view?\n\nI appreciate that people are saying that there’s some degree of arbitrariness involved. I just can’t work out how a law can be passed and then ignored by the legal system.",
            "title_similarity": "0.6345372",
            "sentiment_compound": -0.5606
        },
        {
            "id": "i682pm6",
            "score": 2,
            "text": "Good. That book is evil.",
            "title_similarity": "0.41250193",
            "sentiment_compound": -0.3612
        },
        {
            "id": "i685m06",
            "score": 3,
            "text": "So you can’t learn about real shit your grandfathers did but you can continue to teach about shit that was written about by word of mouth 500 years after albino Jesus walked the earth? Gotcha! Next crazy person please!",
            "title_similarity": "0.6620549",
            "sentiment_compound": -0.8374
        },
        {
            "id": "i686c3z",
            "score": 1,
            "text": "That last one is the kicker there ain’t it",
            "title_similarity": "0.21299839",
            "sentiment_compound": 0.0
        },
        {
            "id": "i686j7h",
            "score": 1,
            "text": "Not american... but isnt the bible like... already not allowed in schools? Like... isnt this already a thing? Lol.",
            "title_similarity": "0.59188354",
            "sentiment_compound": 0.6853
        },
        {
            "id": "i68948k",
            "score": 5,
            "text": "Let us not forget about how the Bible describes how and when an abortion should be performed (Numbers 5:11-31).",
            "title_similarity": "0.4971993",
            "sentiment_compound": 0.1695
        },
        {
            "id": "i689ms2",
            "score": 2,
            "text": "Wow the tables have turned",
            "title_similarity": "0.04560045",
            "sentiment_compound": 0.5859
        },
        {
            "id": "i68apq6",
            "score": 1,
            "text": "Oh shit they figured out how to read the Bible!",
            "title_similarity": "0.3579424",
            "sentiment_compound": -0.5983
        },
        {
            "id": "i68b0g4",
            "score": 2,
            "text": "I’m not going to say if it should be banned or not banned.\n\nI just believe it should be held to the same standard as any other works - whatever they may be in Florida.",
            "title_similarity": "0.46810967",
            "sentiment_compound": -0.1331
        },
        {
            "id": "i68bhj1",
            "score": 1,
            "text": "I'm sure they will view it critically with sound reasoning to decide. Oh wait, this is Florida. They will say it is fine and if anything, there should be more bibles.",
            "title_similarity": "0.5125681",
            "sentiment_compound": 0.4767
        },
        {
            "id": "i68c4mf",
            "score": 2,
            "text": "Pretty sure Sunday school is where the Bible belongs..",
            "title_similarity": "0.35889566",
            "sentiment_compound": 0.6705
        },
        {
            "id": "i68dugv",
            "score": 2,
            "text": "Wth is going on in Florida? Got too much good stuff?",
            "title_similarity": "0.4454081",
            "sentiment_compound": -0.2168
        },
        {
            "id": "i68ezpb",
            "score": 4,
            "text": "Shouldn't the Bible already not be in the classroom in public schools?",
            "title_similarity": "0.52248883",
            "sentiment_compound": 0.0
        },
        {
            "id": "i68gfpi",
            "score": 2,
            "text": "This is just fantastic.",
            "title_similarity": "-0.067585886",
            "sentiment_compound": 0.5574
        },
        {
            "id": "i68iuvi",
            "score": 5,
            "text": "Ban all public messages and displays of ANY religion. It’s a huge portion of any bullshit that’s ever occurred anywhere, any place, any time.",
            "title_similarity": "0.5709268",
            "sentiment_compound": -0.7269
        },
        {
            "id": "i68jcu2",
            "score": 3,
            "text": "Ban the fucking thing",
            "title_similarity": "0.40176994",
            "sentiment_compound": -0.5574
        },
        {
            "id": "i68kw63",
            "score": 2,
            "text": "Chad move",
            "title_similarity": "0.14922567",
            "sentiment_compound": 0.0
        },
        {
            "id": "i68l2ds",
            "score": 5,
            "text": "Can't believe it took this long for someone to do it",
            "title_similarity": "0.12919524",
            "sentiment_compound": 0.0
        },
        {
            "id": "i68m6ej",
            "score": 5,
            "text": "Not just the repercussions of slavery but the exact way to TREAT one’s slave including torture. That’s right, your holy book has instructions on how to keep and BEAT your slave. Truly disgusting. Ban this terrible book!",
            "title_similarity": "0.7048456",
            "sentiment_compound": -0.9402
        },
        {
            "id": "i68nb6a",
            "score": 5,
            "text": "I mean, they should ban the Bible from public schools because of separation of church and state.",
            "title_similarity": "0.6831287",
            "sentiment_compound": -0.5574
        },
        {
            "id": "i68p3yk",
            "score": 1,
            "text": "*laughs in Ron DeSantis*",
            "title_similarity": "0.16554792",
            "sentiment_compound": 0.4939
        },
        {
            "id": "i68qfej",
            "score": 1,
            "text": "https://youtu.be/BKgC1De8_kU",
            "title_similarity": "0.16797222",
            "sentiment_compound": 0.0
        },
        {
            "id": "i68qicf",
            "score": 5,
            "text": "When I quote passages from the Bible to refute their bs, I’m told frequently either “it’s not to be taken literally” or “we don’t abide by those passages”. Lol",
            "title_similarity": "0.6610364",
            "sentiment_compound": 0.4215
        },
        {
            "id": "i68razy",
            "score": 1,
            "text": "Well played, suh.",
            "title_similarity": "-0.012088307",
            "sentiment_compound": 0.5423
        },
        {
            "id": "i68rbho",
            "score": 1,
            "text": "fuck the Bible. in the ass.",
            "title_similarity": "0.5217811",
            "sentiment_compound": -0.7906
        },
        {
            "id": "i68rbsa",
            "score": 1,
            "text": "Krishna=Allah=Budhha=supreme one=lord>jesus",
            "title_similarity": "0.27373916",
            "sentiment_compound": 0.0
        },
        {
            "id": "i68tfn0",
            "score": 2,
            "text": "I feel like America is banning the wrong shit.",
            "title_similarity": "0.49481308",
            "sentiment_compound": -0.6369
        },
        {
            "id": "i68vc31",
            "score": 2,
            "text": "Big ooof",
            "title_similarity": "0.0520494",
            "sentiment_compound": 0.0
        },
        {
            "id": "i68vni1",
            "score": 3,
            "text": "Slavery uprisings and lots of graphic sex. Gay and straight sex. Biblical times were full of begotten and sex, with all kinds of things.",
            "title_similarity": "0.5436858",
            "sentiment_compound": -0.5994
        },
        {
            "id": "i68w623",
            "score": 2,
            "text": "Just use it as the standard. If the bible mentions and talks about it, then so can the rest of us. It's the standard for 'reasonable' debate.",
            "title_similarity": "0.4117635",
            "sentiment_compound": 0.0
        },
        {
            "id": "i68xs5a",
            "score": 4,
            "text": "I was waiting for someone to do this… I said this right after the book banning started here in Florida… If you take it literally like so many people do the Bible is full of all those things DeSantis says he doesn’t want children exposed to… Particularly in the Old Testament there are some horrific scenes…",
            "title_similarity": "0.8470359",
            "sentiment_compound": -0.4404
        },
        {
            "id": "i68yre1",
            "score": 1,
            "text": "Amen",
            "title_similarity": "0.0005308986",
            "sentiment_compound": 0.0
        },
        {
            "id": "i68z2fq",
            "score": 1,
            "text": "As a normally conservative voter, I support this message.",
            "title_similarity": "0.19716793",
            "sentiment_compound": 0.4019
        },
        {
            "id": "i6906c3",
            "score": 3,
            "text": "Can we just ban make believe for adults all together? The bible, Fox news, etc...",
            "title_similarity": "0.6309147",
            "sentiment_compound": -0.5574
        },
        {
            "id": "i690rsq",
            "score": 3,
            "text": "This is going to do one thing and one thing only; make the bigoted zealots announce their is a war on Christianity.\n\nThey caused this, but they won’t acknowledge it.",
            "title_similarity": "0.64164215",
            "sentiment_compound": -0.431
        },
        {
            "id": "i6915fb",
            "score": 2,
            "text": "I’m in Florida and would love to also do this. How do I file a complaint",
            "title_similarity": "0.4969695",
            "sentiment_compound": 0.4588
        },
        {
            "id": "i692pwu",
            "score": 1,
            "text": "Start reading a modern English translation of songs of Solomon in court. “7:3 Your breasts are like two fawns, twins of a gazelle. Treasury of Scripture Your two breasts are like two young roes that are twins, which feed among the lilies.” And the like. It’s all erotic love poetry right in the OT.",
            "title_similarity": "0.4740812",
            "sentiment_compound": 0.91
        },
        {
            "id": "i6962r1",
            "score": 4,
            "text": "It’s so funny how they NEVER focus on these parts but sure as hell use it to tell me why my being gay is a “sin”",
            "title_similarity": "0.559173",
            "sentiment_compound": -0.5193
        },
        {
            "id": "i696t84",
            "score": 2,
            "text": "Amen",
            "title_similarity": "0.0005308986",
            "sentiment_compound": 0.0
        },
        {
            "id": "i6983lb",
            "score": 1,
            "text": "These mfs getting outta hand SMFH",
            "title_similarity": "0.36456504",
            "sentiment_compound": 0.4939
        },
        {
            "id": "i699h7f",
            "score": 1,
            "text": "I thought us knowing about/understanding the repercussions of our actions was a good thing… you know so we know why we f@?$/! Up\n\nNone the less 1 to 10 religions are probably bs so ok Florida let them rebel flags fly… right?",
            "title_similarity": "0.5824096",
            "sentiment_compound": 0.7021
        },
        {
            "id": "i69a9o8",
            "score": 2,
            "text": "You reap what you sow!  Great job GQP",
            "title_similarity": "0.12029904",
            "sentiment_compound": 0.6588
        },
        {
            "id": "i69b8sb",
            "score": 5,
            "text": "Not to mention : the Bible is used as a tool to make Jews feel bad about the death of Jesus. So it should definitely be banned.",
            "title_similarity": "0.6794437",
            "sentiment_compound": -0.8144
        },
        {
            "id": "i69ce8a",
            "score": 1,
            "text": "Remember when we didn’t have to hear from these people and they’d just submit petitions and complaints to your local school board that never went anywhere? What happened to that America",
            "title_similarity": "0.5519914",
            "sentiment_compound": -0.4019
        },
        {
            "id": "i69en83",
            "score": 1,
            "text": "r/nottheonion",
            "title_similarity": "0.22691487",
            "sentiment_compound": 0.0
        },
        {
            "id": "i69fot1",
            "score": 2,
            "text": "Uno reverse",
            "title_similarity": "0.13881311",
            "sentiment_compound": 0.0
        },
        {
            "id": "i69g43d",
            "score": 2,
            "text": "2 can play this game!",
            "title_similarity": "0.041901067",
            "sentiment_compound": 0.4003
        },
        {
            "id": "i69nvis",
            "score": 2,
            "text": "As an atheist who can’t stand this woke shit, I’m pulling out the popcorn.",
            "title_similarity": "0.5035088",
            "sentiment_compound": -0.5574
        },
        {
            "id": "i69p6v9",
            "score": 1,
            "text": "Are we talking about banning the bible in schools, or in general?  I thought they were already banned in schools due to separation of church and state.",
            "title_similarity": "0.6958943",
            "sentiment_compound": -0.4588
        },
        {
            "id": "i69sa0r",
            "score": 1,
            "text": "Their next step is to ban education because it allows free thinking and the spread of ideologies.",
            "title_similarity": "0.46766415",
            "sentiment_compound": -0.0772
        },
        {
            "id": "i69u5j9",
            "score": 3,
            "text": "As a Catholic, I say the Bible should be banned. If Florida wants to make ridiculous laws banning books and other media because they are \"too woke\" or it hurts their snowflake feelings then the law has to be applied fairly even if they don't like it.",
            "title_similarity": "0.77222383",
            "sentiment_compound": -0.8661
        },
        {
            "id": "i69zqkf",
            "score": 2,
            "text": "Not to mention abortion methods!",
            "title_similarity": "0.4619978",
            "sentiment_compound": 0.0
        },
        {
            "id": "i6a2jxy",
            "score": 1,
            "text": "There's an ad running here, on TV that is pro Jesus. The tag line is \"Jesus gets us\". It's simple and shows kindness being done. So there is a group who really are trying to counter all these \"so called Christians\".",
            "title_similarity": "0.5302682",
            "sentiment_compound": 0.4588
        },
        {
            "id": "i6a3u5r",
            "score": 3,
            "text": "I love this so much.  Those morons don’t think past knee jerk…lol to them",
            "title_similarity": "0.31303287",
            "sentiment_compound": 0.3892
        },
        {
            "id": "i6as1z6",
            "score": 1,
            "text": "My hero lol",
            "title_similarity": "0.19133979",
            "sentiment_compound": 0.7506
        },
        {
            "id": "i6axo0m",
            "score": 1,
            "text": "I don’t remember the Bible being forced into the minds of students at every public school. This is an incredibly stupid take",
            "title_similarity": "0.58190656",
            "sentiment_compound": -0.7713
        },
        {
            "id": "i6aya20",
            "score": 1,
            "text": "It's Florida, no surprise there kek",
            "title_similarity": "0.3385175",
            "sentiment_compound": -0.2057
        },
        {
            "id": "i6b1d7v",
            "score": 1,
            "text": "That's crazy BUT this is the USA and ppl do have the right to voice their opinion.",
            "title_similarity": "0.3411259",
            "sentiment_compound": -0.1779
        },
        {
            "id": "i6bbw9l",
            "score": 1,
            "text": "Hell, that’s nothing. Wait until you read the Koran.",
            "title_similarity": "0.45721966",
            "sentiment_compound": -0.6808
        },
        {
            "id": "i6bp30o",
            "score": 2,
            "text": "As Ann Rice says, \" nothing has the power of a burnt book\". If you restrict these students from learning something they'll learn it on the streets.  Their curiosity is peaked at something forbidden",
            "title_similarity": "0.66021967",
            "sentiment_compound": -0.6597
        },
        {
            "id": "i6bxgni",
            "score": 1,
            "text": "I love it!!! Tit for tat…",
            "title_similarity": "0.124621175",
            "sentiment_compound": 0.7249
        },
        {
            "id": "i6cjc08",
            "score": 1,
            "text": "For all the comments I read about being gay or hating in gays.\n\nBelieve what you want. Love what and whom you want. I'm not gay and was conceived by a father with a penis and a mother with a vagina. I don't care about what people think, but that's how we all got here....male sperm and a female egg. \n\nI don't brag about being straight and for sure I do not promote the gay movement.  I teach my children  that if you are born with one part or the other then that's what you are period. A penis to penis and vagina to vagina does not create actual life. So not sure the gay thing will help sustain all life.\n\nHeck even the animals in this planet are not that delusional.\n\nI don't care what anyone says. Next time try and plug your sweeper into another sweeper or an outlet into another outlet. ( Doesn't work without the opposite connection.)\n\nI can say what I want. Like we all should.\nWhy is your right to speech okay to offend or revoke my right of speech. It isn't. \n\nTake care and God Bless 😗",
            "title_similarity": "0.5502237",
            "sentiment_compound": 0.8887
        },
        {
            "id": "i6efyor",
            "score": 1,
            "text": "If 'dont say gay' will make gays disappear will 'dont say asshole' make DeSantis disappear?",
            "title_similarity": "0.5515729",
            "sentiment_compound": -0.4215
        },
        {
            "id": "i6er0nn",
            "score": 2,
            "text": "Literally the definition of indoctrination:  “to imbue with a usually partisan or sectarian opinion, point of view, or principle.”  The word specifically applies to political or religious beliefs.",
            "title_similarity": "0.51316154",
            "sentiment_compound": 0.0
        },
        {
            "id": "i6eueat",
            "score": 1,
            "text": "The problem with his point is state and church are already separated. Where as the bill he is protesting is trying to separate sexual discussions with young children by people who are not their parents in state run facilities. It’s not the same since the Bible is not allowed to be part of state school curriculum or state  sanctioned facility. Which is why the bill was passed in the first place. In all his actions actually supporting the passing of the bill he is trying to protest.",
            "title_similarity": "0.72250354",
            "sentiment_compound": -0.5574
        },
        {
            "id": "i6fzp32",
            "score": 1,
            "text": "The bible shouldn’t be taught in school. Separation of church and state is important. This is coming from a GOP conservative who’s also Mormon… don’t understand the comparison a few people have made between this and their anti-grooming bill they passed and this.",
            "title_similarity": "0.6904715",
            "sentiment_compound": 0.2023
        },
        {
            "id": "i6gkrqj",
            "score": 1,
            "text": "Judges Ch.19 is incredibly graphic.",
            "title_similarity": "0.3970595",
            "sentiment_compound": 0.0
        },
        {
            "id": "i6h7n4i",
            "score": 1,
            "text": "Governor DeSantis: Ban wokeness and socialism from our schools!\n\nBible: “And all the believers were together and had all things in common; and they would sell their property and possessions and share them with all, to the extent that anyone had need.” (Acts‬ ‭2:44-45‬)\n\nGovernor DeSantis: *angry and confused babbling*",
            "title_similarity": "0.5818961",
            "sentiment_compound": -0.807
        },
        {
            "id": "i6hljr3",
            "score": 1,
            "text": "I mean...they're obviously correct here.  The bible clearly falls into the category of the kind of books they're trying to ban.  But cognitive dissonance doesn't work on republicans.  They're steadfastly immune to it.\n\nSo this unless this is just trolling (in which case, A+ my dude) it's a waste of time because it won't go anywhere or give anyone even a moment's pause.",
            "title_similarity": "0.5983772",
            "sentiment_compound": -0.3291
        },
        {
            "id": "i6ikqqm",
            "score": 1,
            "text": "The ridiculousness gets worse. This is hilarious. These woke people need to wake up",
            "title_similarity": "0.43298316",
            "sentiment_compound": -0.3612
        },
        {
            "id": "i6kubeq",
            "score": 1,
            "text": "Finally a good post on this sub.",
            "title_similarity": "0.10268818",
            "sentiment_compound": 0.4404
        },
        {
            "id": "i6n7fja",
            "score": 1,
            "text": "Let's face it, evangelical Christians heard the Devil's temptations in the wilderness and said \"hell yes\" to every single one of them, then created a set of policies based on the list of things that Jesus said would land a person in the eternal fire.    The God of the Bible destroys countries led by people who behave this way.",
            "title_similarity": "0.6375854",
            "sentiment_compound": -0.7003
        },
        {
            "id": "i6nimd5",
            "score": 1,
            "text": "Hey, it's a Julia Sweeney clapter bit rom the 90s.",
            "title_similarity": "0.30518228",
            "sentiment_compound": 0.0
        },
        {
            "id": "i6nml7g",
            "score": 1,
            "text": "The Bible never condemns slavery. The Bible takes slavery for granted. Another misguided lib.",
            "title_similarity": "0.59630483",
            "sentiment_compound": 0.4047
        },
        {
            "id": "i6qlo80",
            "score": 1,
            "text": "Ah, the old fight fire with fire approach. The Satanic Temple has been doing this for a while now. I'd love to see the movement grow (fighting the fascist agenda, I mean).",
            "title_similarity": "0.4889228",
            "sentiment_compound": -0.8074
        },
        {
            "id": "i6rah5b",
            "score": 1,
            "text": "And unicorns.  Don’t forget the unicorns.  My orthodox Jewish friend told me they were on Noah’s Ark.",
            "title_similarity": "0.34599477",
            "sentiment_compound": 0.3182
        },
        {
            "id": "i6s34oo",
            "score": 2,
            "text": "DeSantis: No, not like that.",
            "title_similarity": "0.30375206",
            "sentiment_compound": -0.2755
        },
        {
            "id": "i6tohku",
            "score": 1,
            "text": "This complaint is poorly written. There are far more explicit and disturbing verses that could be cited.",
            "title_similarity": "0.507718",
            "sentiment_compound": -0.6969
        },
        {
            "id": "i6u4sez",
            "score": 1,
            "text": "What can I say except fuck around and find out. You cant ban books you dont like by giving bs reasons cause guess what? People will use your logic to ban your books. Republicans need to chill",
            "title_similarity": "0.6659088",
            "sentiment_compound": -0.8086
        },
        {
            "id": "i6vrfsg",
            "score": 1,
            "text": "I for one am excited to see this play out and the hyGOPricy that the right will exude",
            "title_similarity": "0.11663436",
            "sentiment_compound": 0.631
        },
        {
            "id": "i6xumt5",
            "score": 1,
            "text": "For all of you pedophiles and groomers your time is coming to an end \nSTOP SPREADING EVIL",
            "title_similarity": "0.42244634",
            "sentiment_compound": -0.8429
        },
        {
            "id": "i6z8c4t",
            "score": 1,
            "text": "Pointless saying anything to any of you. You will soon see where things like this lead you. Indoctrinated nation leads to the fall of many!",
            "title_similarity": "0.5205742",
            "sentiment_compound": 0.3382
        },
        {
            "id": "i6zkz23",
            "score": 1,
            "text": "Full disclosure: I am Roman Catholic. By choice. And not a cafeteria Catholic, either. I legit believe everything the Church teaches. \n\nNow, my thoughts on the matter. \n\nI agree that the Bible should not be taught in public schools from a religious perspective. NO holy book should be taught in public schools from a religious perspective. Not only do you have a violation of the separation of Church and State, but there's an issue with versions. \n\nAnd that's actually why Bible readings and prayers got removed from public school in the first place. Catholic parents didn't want the King James Bible read to their children. They wanted the Douay-Rheims. After all, the KJV (and all other Protestant editions) are missing part of the OT. \n\nSo there was a fight over that. \n\nAnd any time you bring ANY text book into a school setting, you have to pick which edition? And with holy books, it's just a bad idea all around to even try to teach any of them from a religious perspective outside of the parochial setting to which they belong. \n\nAnd in elementary school, the kids aren't ready for it outside of a religious perspective. \n\nBut come middle school, one of the things that has to be taught is how certain faiths have had an impact on world history. (In my state, these are GLEs 3B for grades 6-12 in social studies. In grades 6-8, the focus is on before 1450. In 9-12 the focus is on 1450 and after.)\n\nAnd there is nothing wrong with using excerpts from multiple religious texts, in my humble opinion, to help show what life was like during these particular time periods and how faith really did influence life and vise-versa. And yes, that means all of the bad as well as the good. \n\nFurther, there is nothing wrong, again in my humble opinion, in studying multiple religious texts from a literary perspective. The Bible is often used for this simply because of the sheer number of genres within (poetry, creation story, ancient law, ancient biography, epistles, and apocalyptica, which was a very popular literary genre at one time), but we can and should utilize multiple stories from multiple cultures, and in multiple forms in order to reach learners of multiple learning styles. \n\nBut ffs, make sure the teachers are well trained in all the actual facts and not biased, because I had a world history teacher in high school (may she rest in peace) who was very biased against Muslims purely over what a minority do, when in fact the ones I've met have all been wonderful people. \n\nSorry. Rant over.",
            "title_similarity": "0.6287868",
            "sentiment_compound": 0.9771
        },
        {
            "id": "i70pzsj",
            "score": 1,
            "text": "\"Because he's an atheist, he is wrong and evil...\"\n\n\\- Every Christian in America",
            "title_similarity": "0.5872388",
            "sentiment_compound": -0.8176
        },
        {
            "id": "i74jv5n",
            "score": 1,
            "text": "Reddit is full of beastial ped Ilk. This community is so disgusting....",
            "title_similarity": "0.5238324",
            "sentiment_compound": -0.656
        },
        {
            "id": "i75nasd",
            "score": 1,
            "text": "Heeee!!!",
            "title_similarity": "0.10453777",
            "sentiment_compound": 0.0
        },
        {
            "id": "i76rzm1",
            "score": 1,
            "text": "How the table turns",
            "title_similarity": "0.04508023",
            "sentiment_compound": 0.0
        },
        {
            "id": "i7715tf",
            "score": 1,
            "text": "What place does the Bible currently have in Florida schools that even makes this relevant?",
            "title_similarity": "0.61054665",
            "sentiment_compound": 0.0
        },
        {
            "id": "i7a9o5y",
            "score": 1,
            "text": "Both need to calm down and let people practice what they want...schools should be about learning fundamental ABC 123 B.S. and keep politics of both kinds free. Teachers should not sway children one way or another.",
            "title_similarity": "0.54524785",
            "sentiment_compound": 0.6808
        },
        {
            "id": "i7bt884",
            "score": 2,
            "text": "Out of all the books out there that they want to ban the Bible makes them all look like pre K children books.",
            "title_similarity": "0.65842116",
            "sentiment_compound": -0.2023
        },
        {
            "id": "i7eqts7",
            "score": 1,
            "text": "the bibble",
            "title_similarity": "0.18228881",
            "sentiment_compound": 0.0
        },
        {
            "id": "i7fvtzy",
            "score": 1,
            "text": "Sombody never read history",
            "title_similarity": "0.43423116",
            "sentiment_compound": 0.0
        },
        {
            "id": "i7i0ikg",
            "score": 1,
            "text": "You all need Jesus",
            "title_similarity": "0.34264216",
            "sentiment_compound": 0.0
        },
        {
            "id": "i7iak8c",
            "score": 1,
            "text": "Im so lost with this....",
            "title_similarity": "0.3416648",
            "sentiment_compound": -0.3804
        },
        {
            "id": "i7iir27",
            "score": 1,
            "text": "Speaking in the defense of the Most Miss-iNterpreted book entitled (Holy Bible )\n\nConsider that some of the stories youll find are merely HISTORICAL events and bad choices people made through history and its recorded in the book in order to advise people like you and me from doing the same mistakes over …\nSo i advise you make sure you really know who you standing against because you may rip bad consequences from bad choices when making irresponsible based on other peoples opinions or even based in the lack of info or even collected info from the wrong source … God bless us all and deliver us from the real enemies …",
            "title_similarity": "0.6924803",
            "sentiment_compound": -0.9175
        },
        {
            "id": "i7iv8ne",
            "score": 1,
            "text": "Is Gov Ron DeSantis running for president on the  anti-woke platform?  Is that platform actually popular enough to get elected?",
            "title_similarity": "0.40201366",
            "sentiment_compound": 0.4871
        },
        {
            "id": "i7l4649",
            "score": 1,
            "text": "I thought there was already a separation of church and state",
            "title_similarity": "0.52509755",
            "sentiment_compound": 0.0
        },
        {
            "id": "i7n3g4i",
            "score": 1,
            "text": "Ain’t no way 💀",
            "title_similarity": "0.16647005",
            "sentiment_compound": -0.296
        },
        {
            "id": "i7ng6iw",
            "score": 1,
            "text": "This would be funny if the people that believe that the Don't Say Bill knew it was ridiculous and no i am not talking about the politicians i am taking about the voters that believe that the Don't Say Gay i wish they knew it was ridiculous.",
            "title_similarity": "0.54145575",
            "sentiment_compound": -0.1531
        },
        {
            "id": "i7nu5sw",
            "score": 2,
            "text": "OMG .  A 9 year old little girl isn't  developed enough to carry a baby. These darn Zealots don't  care if she or the baby lives it's  all about control over women. Then when I heard that Missouri  has already made birth control illegal I lost it. The Medical examiner of that State got all women's menstrual cycles to track when they can get pregnant. It's like was he going to follow them around in case they get pregnant and stop them from having an abortion? I know a few people who are pro life but they say it's not their business to stop them from having an abortion. This isn't  going to stop at abortion. What angers me the most is Trump is a pro choice Atheist who sold out to the Evangelicals. He is laughing at them. This is a dark time for our Country",
            "title_similarity": "0.6448984",
            "sentiment_compound": -0.684
        },
        {
            "id": "i7nzz42",
            "score": 1,
            "text": "I'm sure last week there was total carnage and massive amounts of damage to a peaceful city because of the other book,, Christians are just to Christian, saying that its probably best that way otherwise earth would be on fire 24/7",
            "title_similarity": "0.5823976",
            "sentiment_compound": 0.6249
        },
        {
            "id": "i7ocd9i",
            "score": 2,
            "text": "If anything the Bible is sleeping. Not at all woke. That sh*t is the dream journal of a mad man on death row.",
            "title_similarity": "0.53585505",
            "sentiment_compound": -0.7269
        },
        {
            "id": "i7q9jne",
            "score": 1,
            "text": "Iin my OPINION that’s too much",
            "title_similarity": "0.18761042",
            "sentiment_compound": 0.0
        },
        {
            "id": "i7qp5gs",
            "score": 1,
            "text": "I’m gonna spend my Saturday night circle jerking in this sub.",
            "title_similarity": "0.42679036",
            "sentiment_compound": 0.0
        },
        {
            "id": "i7quurq",
            "score": 1,
            "text": "The sheer amount of willfull ignorance in this discussion is truly kind blowing and at t same time saddening. \nFor one the person who filed this and all those that support him are ignorant to the actual teachings in the Bible. Because you fear it will show you the err of your ways you refuse to read it.\nNext the completely false propaganda being spewed about the entirely falsely called \"don't say gay\" bill. The bill literally does not say gay anywhere in it. The bill bans the teaching of, \"ALL FORMS OF SEXUALITY AND SEXUAL DISCUSSION OUTSIDE OF APPROVED SEXUAL HEALTH TEACHING\" Which no parent nor same person should object to. No kid in school should be being told the sexuality of their teachers and residually not their sexual relationships and activities.",
            "title_similarity": "0.6907077",
            "sentiment_compound": -0.6537
        },
        {
            "id": "i7qvjag",
            "score": 2,
            "text": "I don't want children reading the bible in public school, religion is a private matter and the state shouldn't be indoctrinating children into religious belief. \n\nThat being said, right wing/religious indoctrination in public schools is a myth, public schools are overtly left-wing and inculcate left wing beliefs into their pupils. I want that to stop, and I'm delighted that my state is taking action against it.",
            "title_similarity": "0.67645466",
            "sentiment_compound": 0.4207
        },
        {
            "id": "i7r6j5j",
            "score": 1,
            "text": "It’s funny cause all of you are proving the biblical prophecies. This nation is doomed",
            "title_similarity": "0.6047724",
            "sentiment_compound": -0.3182
        },
        {
            "id": "i7rjzb7",
            "score": 1,
            "text": "The bible shall never be banned anywhere that can be obtained",
            "title_similarity": "0.4060058",
            "sentiment_compound": 0.357
        },
        {
            "id": "i7sestw",
            "score": 1,
            "text": "All hail Florida Man! 😂",
            "title_similarity": "0.37057763",
            "sentiment_compound": 0.5411
        },
        {
            "id": "i7t4n7k",
            "score": 1,
            "text": "I like where Jesus whips the urserers",
            "title_similarity": "0.28240624",
            "sentiment_compound": 0.3612
        },
        {
            "id": "i7tnekr",
            "score": 1,
            "text": "Everyone is so quick in today's society to remove this, ban that, that you are repeating the past. Can not see 30-35 years ago when prayer and other things now ban were in school you didn't hear about this student brought a gun to school and killed a bunch of students or stabbings in school. It's okay for children to play volant video games, get online and see all kinds of crap not really appropriate, but a book is filled with to many controversial issues is not appropriate. The country is now filled with to many things being censored or changed we aren't using the past as away to teach tolerance, acceptance of others and their beliefs, and showing an evolution of our humanity. Instead we are sliding backwards in so many thing a woman's right to choose, removing historical land marks, altering what parts of our history children should and should not learn, it saddens me to see us repeating the history we try to hide.",
            "title_similarity": "0.60867774",
            "sentiment_compound": 0.0603
        },
        {
            "id": "i7u1jvw",
            "score": 1,
            "text": "The libs will continue to do the devil's work",
            "title_similarity": "0.39564896",
            "sentiment_compound": 0.0
        },
        {
            "id": "i7um558",
            "score": 1,
            "text": "Interesting point - probably can’t expect much in the way of consistency",
            "title_similarity": "0.29549634",
            "sentiment_compound": 0.4019
        },
        {
            "id": "i7v2zpa",
            "score": 1,
            "text": "And here are multiple studies showing you're wrong\n\nhttps://www.npr.org/sections/thetwo-way/2010/02/abstinenceonly_education_works.html#:~:text=Two%20years%20after%20completing%20the,only%20programs%20are%20not%20effective\n\nhttps://c-fam.org/friday_fax/abstinence-education-works-condoms-dont-new-teen-pregnancy-data/\n\nhttps://www.nytimes.com/2010/02/03/education/03abstinence.html",
            "title_similarity": "0.61786103",
            "sentiment_compound": -0.4767
        },
        {
            "id": "i7wko9r",
            "score": 3,
            "text": "I can’t fucking stand republicans. The whole lot of them are POS",
            "title_similarity": "0.48497337",
            "sentiment_compound": 0.0
        },
        {
            "id": "i7xjyq9",
            "score": 2,
            "text": "Honestly I know he is doing this to make a point but it isn't a bad idea. There are so many things in there that children shouldn't be reading. Around 5th grade I read the whole thing cover to cover and was asking everyone if they knew about the part where the two daughters get their Dad drunk to have sex with him. 😂 I read a lot of things I really shouldn't have and everyone was just like, \"Its so nice how advanced she is for her age!\" #neurodivergent",
            "title_similarity": "0.5342742",
            "sentiment_compound": 0.9524
        },
        {
            "id": "i7xvdr5",
            "score": 1,
            "text": "File it. Make them spend $ to defend against it.  I myself am really curious about when a Jewish woman goes for an abortion. What happens then?  Are we to deny her freedom of religion?  JDL?  Hope you all are on this",
            "title_similarity": "0.60761845",
            "sentiment_compound": 0.8331
        },
        {
            "id": "i7xvney",
            "score": 1,
            "text": "Jam the courts. Can’t wait. Anyone I’m thinking I’d applying for disability since I can no longer control my body?   Any ideas?",
            "title_similarity": "0.60424954",
            "sentiment_compound": -0.3736
        },
        {
            "id": "i80xq24",
            "score": 1,
            "text": "A lot of groomers in this thread.",
            "title_similarity": "0.1501782",
            "sentiment_compound": 0.0
        },
        {
            "id": "i81dp1w",
            "score": 1,
            "text": "It starts with banning Bibles, then we'll be banning Christianity, then condemning Christians to death, then comes the one world religion, which is deceptively pretty on the outside but secretly sinister on the inside. You give these people an inch and they take a mile. There's no such thing as \"woke\" or \"too woke\". Knowledge is power and banning Knowledge even if it covers sensitive topics is a VERY BAD idea and allowing this to commence will only have a negative outcome.",
            "title_similarity": "0.69529235",
            "sentiment_compound": -0.9748
        },
        {
            "id": "i84o13j",
            "score": 1,
            "text": "Where do I sign",
            "title_similarity": "0.12960526",
            "sentiment_compound": 0.0
        },
        {
            "id": "i85xxei",
            "score": 1,
            "text": "True human nature will become inevitability apparent soon.",
            "title_similarity": "0.08401573",
            "sentiment_compound": 0.4215
        },
        {
            "id": "i885fgv",
            "score": 1,
            "text": "Public schools shouldn’t be teaching religion anyways, your terms are acceptable",
            "title_similarity": "0.4637289",
            "sentiment_compound": 0.3182
        },
        {
            "id": "i8bm5uy",
            "score": 2,
            "text": "Can someone just trade with Spain? We give Florida back in return for a paella.",
            "title_similarity": "0.45669264",
            "sentiment_compound": 0.0
        },
        {
            "id": "i8e0w2r",
            "score": 1,
            "text": "Is this real? I’m not religious however there is something weird with banning or removing books. Same with the Dr. S ones",
            "title_similarity": "0.6354379",
            "sentiment_compound": -0.1779
        },
        {
            "id": "i8e8v4u",
            "score": 1,
            "text": "We can only hope. If we kept the original version “god” wrote and people didn’t rewrite it 1000 times. I don’t think anyone would look at it the same way.",
            "title_similarity": "0.5264845",
            "sentiment_compound": 0.6369
        },
        {
            "id": "i8ed0t3",
            "score": 1,
            "text": "Nice bait",
            "title_similarity": "0.043334007",
            "sentiment_compound": 0.4215
        },
        {
            "id": "i8ee4v7",
            "score": 1,
            "text": "Good luck with that",
            "title_similarity": "-0.050143957",
            "sentiment_compound": 0.7096
        },
        {
            "id": "i8f1cqu",
            "score": 1,
            "text": "This is so backwards. The Bible is taught at home or at church, not at school.",
            "title_similarity": "0.49265295",
            "sentiment_compound": 0.0
        },
        {
            "id": "i8ibncn",
            "score": 1,
            "text": "Okay let’s ban the Quran first then we can talk about the Bible.",
            "title_similarity": "0.62363863",
            "sentiment_compound": -0.4019
        },
        {
            "id": "i8j559o",
            "score": 1,
            "text": "I thought religion was already banned in schools so im not really sure what is to gain of this. But ok keep being mad at my state i guess.",
            "title_similarity": "0.6771887",
            "sentiment_compound": -0.6236
        },
        {
            "id": "i8jrxfe",
            "score": 1,
            "text": "Y’all definitely need Jesus",
            "title_similarity": "0.33108595",
            "sentiment_compound": 0.4019
        }
    ]
}