{
    "TIL that James K. Polk is the only US president who pledged to serve only one term during his campaign. He was known for fulfilling all his major promises and died 3 months after his term ended, making his retirement the shortest. He is also the only speaker of the house to be elected as president.\n": [
        {
            "id": "guzdjei",
            "score": 28,
            "text": "Guys Polk help lead us towards the path of civil war. While he did help expand territory in the U.S (through a costly and deadly war with Mexico), his actions furthered the divide between slave states and free states and Polk was a staunch supporter of slavery.\n\nYou guys really need to stop praising him as much as you are. He was certainly a competent  president, but his actions led to many atrocities throughout the U.S. He is not and should not be viewed as one of our better presidents. He was one of the more deplorable people to hold the office.",
            "title_similarity": "0.46580148",
            "sentiment_compound": 0.6973
        },
        {
            "id": "guzgpmg",
            "score": 13,
            "text": "The amount of people on this thread saying more people should be like Polk is terrifying. Manifest Destiny was genocide. Are we really applauding him for killing and displacing so many indigenous people that he retired early?",
            "title_similarity": "0.38437647",
            "sentiment_compound": -0.4951
        },
        {
            "id": "guznf0d",
            "score": -1,
            "text": "also stole half of mexico",
            "title_similarity": "0.33817136",
            "sentiment_compound": 0.0
        },
        {
            "id": "guzo03o",
            "score": -2,
            "text": "The president of “manifest destiny”.  Absolutely horrible imperialist and war criminal.",
            "title_similarity": "0.35535675",
            "sentiment_compound": -0.902
        },
        {
            "id": "guzpzoi",
            "score": -1,
            "text": "People praising president polk for being a pro slaver and starting a war to steal land from a weaker nation are probably the same sort that made up the domestic terrorists at the capital on Jan 6.",
            "title_similarity": "0.40281242",
            "sentiment_compound": -0.891
        },
        {
            "id": "guz2vb8",
            "score": 95,
            "text": "One of those promises being stealing land from Mexico to expand US slave territory. So certainly fulfilled his promises, but also made the Civil War inevitable by ensuring slavery a continued path to profit (stealing new territory to make new slave friendly land and states)",
            "title_similarity": "0.30678892",
            "sentiment_compound": -0.6489
        },
        {
            "id": "guz6jaj",
            "score": -9,
            "text": "Technically is Biden the second then?  Pretty sure he said he doesn't intend to run for another term.",
            "title_similarity": "0.43017596",
            "sentiment_compound": 0.6705
        },
        {
            "id": "guzz3lp",
            "score": 1,
            "text": "You mean the racist bastard who stole half of Mexico based on a giant lie to the American people?  \n\n\nWhat a fuckin role model.",
            "title_similarity": "0.365633",
            "sentiment_compound": -0.8176
        },
        {
            "id": "guzbubg",
            "score": -1,
            "text": "Good guy Polk. Did his job and then just died. No need to insider trade when you're fucking dead. We need more politicians like this",
            "title_similarity": "0.5849836",
            "sentiment_compound": -0.6922
        },
        {
            "id": "guzhmgd",
            "score": -2,
            "text": "Polk is the GOAT president",
            "title_similarity": "0.37337607",
            "sentiment_compound": 0.0
        },
        {
            "id": "guzab8p",
            "score": 7,
            "text": "Fake news. Rutherford B. Hayes pledged to only serve one term during the 1876 campaign. This is widely known in history.",
            "title_similarity": "0.73169565",
            "sentiment_compound": -0.4767
        },
        {
            "id": "guzsbq8",
            "score": -1,
            "text": "In 2020 Biden said he would only serve one term. He has since walked that back.",
            "title_similarity": "0.6148193",
            "sentiment_compound": 0.0
        },
        {
            "id": "guzk1kc",
            "score": 2,
            "text": "All of his campaign promises were intended to expand slavery.",
            "title_similarity": "0.32472086",
            "sentiment_compound": -0.2263
        },
        {
            "id": "guzi123",
            "score": -3,
            "text": "Hasn't Biden said he is only seeking 1 term?",
            "title_similarity": "0.49745592",
            "sentiment_compound": 0.0
        },
        {
            "id": "guz27ka",
            "score": 1,
            "text": "That is what a politician should do",
            "title_similarity": "0.075819895",
            "sentiment_compound": 0.0
        },
        {
            "id": "guzmtpd",
            "score": 1,
            "text": "Polk has always been one of my favs. Not necessarily from a policy perspective, but he did what he said he was going to do and I can respect that. It's so weird to me that he did quite a bit and yet isnt studied very heavily in school.",
            "title_similarity": "0.56981456",
            "sentiment_compound": 0.3156
        },
        {
            "id": "guzmxls",
            "score": 1,
            "text": "I forgot, was he the one who was \"really close friends with this one dude, we swear they were just friends, we swear\" or was that another guy.",
            "title_similarity": "0.381728",
            "sentiment_compound": 0.7251
        },
        {
            "id": "guzojel",
            "score": -1,
            "text": "This is literally my favorite president. The only thing here I didn’t know is that he died so soon after his term ended. Thank you",
            "title_similarity": "0.67577666",
            "sentiment_compound": 0.2263
        },
        {
            "id": "gv0ivc2",
            "score": 1,
            "text": "[deleted]",
            "title_similarity": "0.06382948"
        },
        {
            "id": "guzk4z2",
            "score": 7,
            "text": "Polk was also a pretty awful guy even by the standards of the time\n\nSaying this as a guy who has read his personal writings including his diary and correspondences",
            "title_similarity": "0.44084516",
            "sentiment_compound": 0.0516
        },
        {
            "id": "gv03bmx",
            "score": 4,
            "text": "Praising Polk like he did something great. He was a president who kowtowed to southern slavers. His leadership in the Mexican war was the result of great generals for America and poorly disciplined troops for Mexico. Polk tried to send Santa Ana, the guy who massacred everyone at the Alamo, to be a US envoy to Mexico to prevent the war and instead Santa Ana was arrested and Polks generals were thrust into conflict unprepared. But American generals prevailed and Polk got all that territory. He was more of a lucky president if anything.",
            "title_similarity": "0.5194155",
            "sentiment_compound": 0.6854
        },
        {
            "id": "guzq8yo",
            "score": 49,
            "text": "He also started the Mexican-American War by stationing US soldiers on disputed territory between Texas and Mexico to instigate a skirmish and have American soldiers killed on (disputed) American soil. Swell guy.",
            "title_similarity": "0.39040652",
            "sentiment_compound": -0.9217
        },
        {
            "id": "guzgc29",
            "score": 5,
            "text": "Most underrated president ive always said",
            "title_similarity": "0.50680804",
            "sentiment_compound": 0.0
        },
        {
            "id": "guz65ou",
            "score": 75,
            "text": "For anyone wondering why America isn't a parliamentary style democracy\n\n*This guy just did manifest destiny in 1 term and y'all want us to have all our leaders follow the path he did but even faster!?*",
            "title_similarity": "0.56460726",
            "sentiment_compound": 0.1134
        },
        {
            "id": "guz8vzj",
            "score": -3,
            "text": "Today i learned we had a president named Polk",
            "title_similarity": "0.40487385",
            "sentiment_compound": 0.0
        },
        {
            "id": "guzodf1",
            "score": 0,
            "text": "Sounds like a perfect president. Does one term, does what he says he will do, then promply dies as to not be a burden. The world could be such a better place if our leaders followed his mayfly-like example.",
            "title_similarity": "0.55528766",
            "sentiment_compound": 0.8887
        },
        {
            "id": "guzqavh",
            "score": 0,
            "text": "The shortest retirement not counting those who died in office and never gotnone",
            "title_similarity": "0.66252124",
            "sentiment_compound": -0.5574
        },
        {
            "id": "guzsmpi",
            "score": 0,
            "text": "He was also a horrible person who used the racist dogma of manifest destiny to justify westward expansion and illegal wars against indigenous states.",
            "title_similarity": "0.27609298",
            "sentiment_compound": -0.9403
        },
        {
            "id": "guzv5ie",
            "score": 0,
            "text": "He also oversaw a genocide in California...",
            "title_similarity": "0.3107608",
            "sentiment_compound": 0.0
        },
        {
            "id": "guzw73w",
            "score": 0,
            "text": "Imagine if he made mean tweets",
            "title_similarity": "0.18125269",
            "sentiment_compound": 0.0
        },
        {
            "id": "guzwefb",
            "score": 0,
            "text": "He may have Biden join him. Biden also says he's only going for one term, right?",
            "title_similarity": "0.47137165",
            "sentiment_compound": 0.296
        },
        {
            "id": "guzx45l",
            "score": 0,
            "text": "Actually, though he would later break it, Teddy Roosevelt promised to only serve one term during his 1904 campaign.",
            "title_similarity": "0.6556655",
            "sentiment_compound": 0.3612
        },
        {
            "id": "guzz8lr",
            "score": 0,
            "text": "Didn't this guy follow Madison's lead and wage another illegal war under false pretenses, further pushing America into the war mongering country it is - completely against the founding father's constitutional intent to prevent just that?",
            "title_similarity": "0.34744406",
            "sentiment_compound": -0.9201
        },
        {
            "id": "gv07du7",
            "score": 0,
            "text": "One of two, him and Boehner, who was President 2001-2005.",
            "title_similarity": "0.46272355",
            "sentiment_compound": 0.0
        },
        {
            "id": "gv0c7y9",
            "score": 0,
            "text": "Original comment deleted as I have no clue how it was posted. Found it in my post history...",
            "title_similarity": "0.42983714",
            "sentiment_compound": 0.0258
        },
        {
            "id": "gv0oyt8",
            "score": 0,
            "text": "I mean, when your goal is to start a war so you can steal half of Mexico",
            "title_similarity": "0.25478953",
            "sentiment_compound": -0.8107
        },
        {
            "id": "gv0q78c",
            "score": 0,
            "text": "Trump still has about two days to break that \"shortest retirement\" record.",
            "title_similarity": "0.6882382",
            "sentiment_compound": 0.0
        },
        {
            "id": "gv1ppzz",
            "score": 0,
            "text": "Old shit\n\nDoesn't matter about history when the current selection is a fucking joke. Making a complete mockery of the political system.\n\nWho gives a shit about the great things when a simple thing such as human rights and skin colour is so hard to fucking grasp.\n\nJust as an outsider the world looks at America with absolute shame. Its easy to make fun but first and foremost we feel a collective emotional sigh when America is spoken.\n\nThey have lost all moral highground and destroyed any plan for global unity. Happily giving China the moral keys while Europe looks in shame at the state of things.\n\nIt's bad here but at least we don't make judgements based on skin colour since the majority of the population are immigrants",
            "title_similarity": "0.45102176",
            "sentiment_compound": -0.733
        },
        {
            "id": "guz3e6o",
            "score": 5,
            "text": "He also had 6 toes on his left foot",
            "title_similarity": "0.2093694",
            "sentiment_compound": 0.0
        },
        {
            "id": "guza9wm",
            "score": -5,
            "text": "Sounds like a really great man.",
            "title_similarity": "0.11499396",
            "sentiment_compound": 0.7841
        },
        {
            "id": "guzds5k",
            "score": 5,
            "text": "He also promised to run for once term to begin with so he didn’t just decide not run because he was ill.",
            "title_similarity": "0.49117073",
            "sentiment_compound": -0.0772
        },
        {
            "id": "guzsh6i",
            "score": 66,
            "text": "He definitely did a good job of laying out concrete goals and accomplishing them, but it’s important to also remember the broader context. The dude was really into slavery. He owned many slaves on his plantation, and he even bought more while he was president. Of course, his excuse was that it wasn’t *the president* who was buying slaves (he knew that would have been politically toxic), but a private citizen who owned a plantation business. Sound kind of like a certain recent president? He also laid off a lot of the White House staff and replaced them with his own slaves because he didn’t want to pay them.\n\nHis greatest accomplishment was territorial expansion, but he achieved that by intentionally starting a war as a land-grab opportunity. That  war and expansion also teed up the Civil War; slavery and “states’ rights” were issues that Polk consistently swept under the rug. Never mind that it was already one of the biggest issues affecting American politics and society at the time...meh, I don’t wanna deal with that.\n\nI’m not going to purely praise or condemn Polk, but the same standard applied to him as a great president could also be applied to Trump. He said he was going to cut corporate taxes, and he did. He said he was going to pack the judiciary, and he did. He said he was going to cut environmental and financial regulation, and he did. It’s possible to achieve all your goals, but those goals could be either noble or shitty.",
            "title_similarity": "0.49135083",
            "sentiment_compound": -0.912
        },
        {
            "id": "gv00ud4",
            "score": 12,
            "text": "Did you know that President Polk was short (five foot eight) and his wife, Sarah, had the presidential them, “Hail to the Chief” written so that everyone in the room would know that the president of the United States was entering. \nThen again President Polk was also a big believer in manifest destiny and his grave is famously haunted.",
            "title_similarity": "0.66817427",
            "sentiment_compound": -0.4404
        },
        {
            "id": "guz9qzl",
            "score": 1,
            "text": "I was born in and still live in the town where Polk lived. I drive by his house regularly",
            "title_similarity": "0.34431106",
            "sentiment_compound": 0.0
        },
        {
            "id": "guzdgga",
            "score": 1,
            "text": "Cholera’s a bitch. Glad for modern water sanitation.",
            "title_similarity": "0.31222337",
            "sentiment_compound": -0.2023
        },
        {
            "id": "guzhbdy",
            "score": 1,
            "text": "yet precious few have mourned the passing of",
            "title_similarity": "0.43754125",
            "sentiment_compound": 0.34
        },
        {
            "id": "guzrz8u",
            "score": 1,
            "text": "I wish this upon the Orange beast",
            "title_similarity": "0.044487145",
            "sentiment_compound": 0.4019
        },
        {
            "id": "guzson5",
            "score": 1,
            "text": "Best president ever",
            "title_similarity": "0.46442896",
            "sentiment_compound": 0.6369
        },
        {
            "id": "guzud5i",
            "score": 1,
            "text": "Are we celebrating Polk?  Didn't he invade Mexico, try to take all of Mexico, and put Trist in prison when he didn't; 1 term was enough.",
            "title_similarity": "0.52235484",
            "sentiment_compound": 0.1027
        },
        {
            "id": "guzydnx",
            "score": 1,
            "text": "Fun Fact: Polka dots wall paper was invented by him",
            "title_similarity": "0.3008402",
            "sentiment_compound": 0.5106
        },
        {
            "id": "gv01x85",
            "score": 1,
            "text": "My favorite President.",
            "title_similarity": "0.3476158",
            "sentiment_compound": 0.4588
        },
        {
            "id": "gv03baq",
            "score": 1,
            "text": ">[Polk] died 3 months after his term ended, making his retirement the shortest\n\nI believe that William Harrison has him beat by at least 4 years",
            "title_similarity": "0.7800622",
            "sentiment_compound": -0.5574
        },
        {
            "id": "gv079ra",
            "score": 1,
            "text": "And it took until Obama until another president would fulfill all his major campaign promises.",
            "title_similarity": "0.5357745",
            "sentiment_compound": 0.6983
        },
        {
            "id": "gv0c4ie",
            "score": -1,
            "text": "Our most evil president yet.",
            "title_similarity": "0.3746625",
            "sentiment_compound": -0.6901
        },
        {
            "id": "gv0cbs6",
            "score": 1,
            "text": "While this is true, a lot of the works pledges, promises and accomplishments were stripped away right away because people HATED the way he got stuff done. Imagine how Trump was doing what he could to strip most things Obama got done in his tenure. So he was accomplished, but did it in such a way that his legacy is diminished and his wife spent the last decades of her life making sure people knew her husband did good work and kinda fell on deaf ears. \n\nAlso They Might Be Giants song James K Polk slaps.",
            "title_similarity": "0.62510556",
            "sentiment_compound": 0.8232
        },
        {
            "id": "gv0gih6",
            "score": 1,
            "text": "As a descendant of polk i say fuck yea fam",
            "title_similarity": "0.28340298",
            "sentiment_compound": -0.5423
        },
        {
            "id": "gv0phdc",
            "score": 1,
            "text": "You make James Polk seem like a good thing.",
            "title_similarity": "0.17129384",
            "sentiment_compound": 0.6597
        },
        {
            "id": "gv0w4tu",
            "score": 1,
            "text": "Quite possibly the actual best US president.",
            "title_similarity": "0.41920426",
            "sentiment_compound": 0.6369
        },
        {
            "id": "gv137t1",
            "score": -1,
            "text": "What a horribly tragic day when people are romanticizing the Presidency of such an awful human being.",
            "title_similarity": "0.34172928",
            "sentiment_compound": -0.802
        },
        {
            "id": "gv1593k",
            "score": 1,
            "text": "He might have been a racist, imperialist bastard, but he got shit done - historians, probably",
            "title_similarity": "0.3258255",
            "sentiment_compound": -0.8641
        },
        {
            "id": "gv1slfw",
            "score": 1,
            "text": "Teddy Roosevelt did something similar. He basically served two terms, but his first term was more so adhering to McKinley's agenda, as McKinley was assassinated early and Roosevelt took over. He was elected in 1904 and didn't run again having accomplished what he wanted in this term. His predesessor, Taft, screwed things up in his eyes. Because the Republican party (the party progressives affiliated with in those days) would not nominate someone other than a sitting president, he ran against Taft with the Bull-moose party. This split progressives from the Republican party handing the presidency to the democrats and in many ways beginning the phenomenon where the two parties have basically switched position today compared to back then.",
            "title_similarity": "0.64586526",
            "sentiment_compound": 0.9538
        },
        {
            "id": "guz2m5c",
            "score": 7,
            "text": "[deleted]",
            "title_similarity": "0.06382948"
        },
        {
            "id": "guzrptk",
            "score": 2,
            "text": "The greatest of the \"lesser known\" presidents",
            "title_similarity": "0.44809803",
            "sentiment_compound": 0.6369
        },
        {
            "id": "guzndb0",
            "score": 70,
            "text": "He also stuck a load of soldiers on the border with Mexico, waited for them to start even the slightest animosity and then used it as an excuse to invade Mexico and take more land.",
            "title_similarity": "0.32563192",
            "sentiment_compound": -0.5574
        },
        {
            "id": "guyyh42",
            "score": 232,
            "text": "That was a time when men were made of steel and boats made of wood.",
            "title_similarity": "0.18489666",
            "sentiment_compound": 0.0
        },
        {
            "id": "guzxjge",
            "score": 4,
            "text": "[\"Napoleon of the Stuuuuuump!\"](https://youtu.be/StTiCU_fqCg)",
            "title_similarity": "0.2607701",
            "sentiment_compound": 0.0
        },
        {
            "id": "gv095x3",
            "score": 4,
            "text": "Another Great American Hero, Al Bundy attended James K Polk High School. He once scored 4 touchdowns in a single game.",
            "title_similarity": "0.68387556",
            "sentiment_compound": 0.8271
        },
        {
            "id": "gv0k1c9",
            "score": -3,
            "text": "Didn't Biden do the same thing tho?",
            "title_similarity": "0.12383775",
            "sentiment_compound": 0.0
        },
        {
            "id": "guzdbk2",
            "score": 228,
            "text": "Shortest retirement is actually shared 8 ways between William Henry Harrison, Zachary Taylor, Abraham Lincoln, James Garfield, William McKinley, Warren Harding, Franklin Delano Roosevelt, and John Fitzgerald Kennedy.",
            "title_similarity": "0.51174563",
            "sentiment_compound": 0.34
        },
        {
            "id": "guzqbcu",
            "score": 3,
            "text": "Pulled Polk",
            "title_similarity": "0.053706404",
            "sentiment_compound": 0.0
        },
        {
            "id": "guzr6bf",
            "score": 6,
            "text": "One of the best Presidents.  Deserves far more attention than he gets.",
            "title_similarity": "0.38939643",
            "sentiment_compound": 0.6369
        },
        {
            "id": "guzxojd",
            "score": -4,
            "text": "Didn't Biden say he would only do 1 term?",
            "title_similarity": "0.46543878",
            "sentiment_compound": 0.0
        },
        {
            "id": "guzvkgh",
            "score": -6,
            "text": "[removed]",
            "title_similarity": "0.018226085"
        },
        {
            "id": "guzzi3d",
            "score": 8,
            "text": "I’m related to this guy. He is my Great Great Great Great Great Grandmothers nephew. His middle name was Knox and that was his mother and my 5xGreat Grandmothers last name.",
            "title_similarity": "0.4570432",
            "sentiment_compound": 0.9702
        },
        {
            "id": "guzss7g",
            "score": 12,
            "text": "Rutherford B. Hayes also pledged in the 1876 campaign to serve only one term and did so.  Hayes is notable for ending Reconstruction which many historians argue was a mistake, but a mistake that would be hard not to make given the will to continue Reconstruction was evaporating in the north.  Therefore, Hayes is not fondly remembered as an effective executive like Polk, but in many ways, Hayes pledged to do just about nothing (some civil service reform he promised and did do as well) and kept his promise so I'd argue Polk wasn't the only one.  Hayes was the first of the late 19th century presidents who really let the corrupt Congress and corporations as the Gilded Age got underway take control rather than the presidency.  \n\n\nIt's also important to remember that one of Polk's campaign promises was fulfilling Manifest Destiny by gaining California.  Polk therefore waged an aggressive war of conquest (The Mexican-American War) for land acquisition, something very much frowned upon internationally today ever since WWII, but alas, historical context should be considered.  \n\n\nIn essence, Polk was successful for his time and his goals, but some of his goals today would be abhorrent.  It's important to remember the long-lasting devastation of indigenous peoples made possible by manifest destiny.",
            "title_similarity": "0.6967252",
            "sentiment_compound": -0.7489
        },
        {
            "id": "guzg1ic",
            "score": 14,
            "text": "And was turned into a fantastic song by They Might Be Giants.",
            "title_similarity": "0.14088783",
            "sentiment_compound": 0.5574
        },
        {
            "id": "guz76wi",
            "score": 554,
            "text": "There was a documentary on the US presidents I watched a while back and after watching it, hes my second favorite president behind teddy. Dude got shit done and left, just solid.",
            "title_similarity": "0.66428506",
            "sentiment_compound": -0.0
        },
        {
            "id": "guz2zqj",
            "score": 12,
            "text": "https://m.youtube.com/watch?v=StTiCU_fqCg",
            "title_similarity": "0.11783496",
            "sentiment_compound": 0.0
        },
        {
            "id": "guzegzu",
            "score": 66,
            "text": "President Polk, best remembered for being business up front and party in the back.",
            "title_similarity": "0.45158663",
            "sentiment_compound": 0.7845
        },
        {
            "id": "guyzby5",
            "score": 1932,
            "text": "I actually went to Polk high school. There was a guy on our football team that scored four touchdowns in one game.",
            "title_similarity": "0.58774614",
            "sentiment_compound": 0.0
        },
        {
            "id": "guzu3q2",
            "score": 40,
            "text": "\"“With a soldier the flag is paramount . . . I know the struggle with my conscience during the Mexican War. I have never altogether forgiven myself for going into that. I had very strong opinions on the subject. I do not think there was ever a more wicked war than that waged by the United States on Mexico. I thought so at the time, when I was a youngster, only I had not moral courage enough to resign. I had taken an oath to serve eight years, unless sooner discharged, and I considered my supreme duty was to my flag. I had a horror of the Mexican War, and I have always believed that it was on our part most unjust. The wickedness was not in the way our soldiers conducted it, but in the conduct of our government in declaring war. The troops behaved well in Mexico, and the government acted handsomely about the peace. We had no claim on Mexico. Texas had no claim beyond the Nueces River, and yet we pushed on to the Rio Grande and crossed it. I am always ashamed of my country when I think of that invasion.”\n\n~ Ulysses S. Grant to journalist John Russell Young (1879), quoted by Young in Around the World with General Grant (Baltimore: John Hopkins University Press, 2002), 376-377\"",
            "title_similarity": "0.5537592",
            "sentiment_compound": -0.8827
        },
        {
            "id": "guyyuum",
            "score": 326,
            "text": "In 1844, the Democrats were split...🎶",
            "title_similarity": "0.31409714",
            "sentiment_compound": 0.0
        },
        {
            "id": "guz1sxu",
            "score": 1393,
            "text": "Had the best Nickelodeon middle school named after him",
            "title_similarity": "0.44058424",
            "sentiment_compound": 0.6369
        },
        {
            "id": "guz1sdc",
            "score": 936,
            "text": "The Napoleon of the stump!",
            "title_similarity": "0.25537905",
            "sentiment_compound": 0.0
        },
        {
            "id": "guz7l8g",
            "score": 311,
            "text": "Presidential speedrun.",
            "title_similarity": "0.25249252",
            "sentiment_compound": 0.0
        },
        {
            "id": "guzhhaa",
            "score": 2816,
            "text": "Fun Fact: Polk was a total workaholic. During White House social functions the music had to stop when he entered the room, and he worked on Sundays because he called taking the day off an \"unprofitable use of time.\"\n\nHe was the first President to be photographed in office. He did this rather than have his portrait painted, not because of the cool technology, but because it was a lot faster and he could get back to work.",
            "title_similarity": "0.58913815",
            "sentiment_compound": 0.296
        },
        {
            "id": "guz47du",
            "score": 4050,
            "text": "More information from the article linked by OP:\n\n>With a slender victory in the popular vote, but with a greater victory in the Electoral College (170–105), Polk proceeded to implement his campaign promises. He presided over a country whose population had doubled every twenty years since the American Revolution and which had reached demographic parity with Great Britain. Polk's tenure saw continued technological improvements, including the continued expansion of railroads and increased use of the telegraph. These improved communications and growing demographics increasingly made the United States into a strong military power, while also stoking expansionism. However, sectional divisions remained and became worse during his tenure.\n\n>Polk set four clearly defined goals for his administration:\n\n>Reestablish the Independent Treasury System – the Whigs had abolished the one created under Van Buren.\n\n>Reduce tariffs.\n\n>Acquire some or all of the Oregon Country.\n\n>Acquire California and its harbors from Mexico.\n\n>While his domestic aims represented continuity with past Democratic policies, successful completion of Polk's foreign policy goals would represent the first major American territorial gains since the Adams–Onís Treaty of 1819.",
            "title_similarity": "0.4863456",
            "sentiment_compound": 0.9934
        },
        {
            "id": "guzon6t",
            "score": 840,
            "text": "I did a report on this guy, he apparently had no life outside the presidency besides what his wife planned for him",
            "title_similarity": "0.7037454",
            "sentiment_compound": -0.296
        },
        {
            "id": "guzfqsi",
            "score": 6976,
            "text": "...and since I'd achieved all my goals as President in one term, there was no need for a second. The end.",
            "title_similarity": "0.62456274",
            "sentiment_compound": -0.296
        },
        {
            "id": "guzb3b0",
            "score": 1,
            "text": "Isn't that the mofo from ghost busters 2?",
            "title_similarity": "0.28788057",
            "sentiment_compound": 0.122
        },
        {
            "id": "guzgwr9",
            "score": 1,
            "text": "Actually Teddy Roosevelt promised to only serve one term when he ran for election in his own right in 1904. I think that counts, sort of.",
            "title_similarity": "0.6948394",
            "sentiment_compound": 0.3612
        },
        {
            "id": "guzhbyt",
            "score": 1,
            "text": "I did a tour of his old house when I was a kid. Don't remember anything about him because I was like 8 and didn't want to spend my vacation touring an old, dead president's home.",
            "title_similarity": "0.56510395",
            "sentiment_compound": -0.4628
        },
        {
            "id": "guzhrq2",
            "score": 1,
            "text": "My work is done\n\nDies",
            "title_similarity": "0.25106803",
            "sentiment_compound": 0.0
        },
        {
            "id": "guzitmm",
            "score": 2,
            "text": "I duuno, I'd say Lincoln and JFK's retirements were shorter..",
            "title_similarity": "0.42898667",
            "sentiment_compound": 0.0
        },
        {
            "id": "guzjorp",
            "score": 1,
            "text": "You would think that more speakers of the house were going to be president. One seem oddly low.",
            "title_similarity": "0.40680552",
            "sentiment_compound": -0.2732
        },
        {
            "id": "guzjuaw",
            "score": 1,
            "text": "All his life has lead to this moment",
            "title_similarity": "0.3135472",
            "sentiment_compound": 0.0
        },
        {
            "id": "guzlhjd",
            "score": 1,
            "text": "The only president with a mullet?",
            "title_similarity": "0.64934546",
            "sentiment_compound": 0.0
        },
        {
            "id": "guzlzu8",
            "score": 217,
            "text": "“And since I’d achieved all of my goals as President in one term there was no need for a second.”",
            "title_similarity": "0.60011494",
            "sentiment_compound": -0.296
        },
        {
            "id": "guznu52",
            "score": 1,
            "text": "He was a dark horse candidate.",
            "title_similarity": "0.13622414",
            "sentiment_compound": 0.0
        },
        {
            "id": "guzoi73",
            "score": 1,
            "text": "> He is also the only speaker of the house to be elected as president.\n\nCarefully worded to exclude former speaker Gerald Ford.",
            "title_similarity": "0.7936218",
            "sentiment_compound": -0.1027
        },
        {
            "id": "guzojvn",
            "score": 1,
            "text": "The K in his name stands for Knox (according to my father, i never fact checked i don't think)",
            "title_similarity": "0.51711464",
            "sentiment_compound": 0.0
        },
        {
            "id": "guzom4n",
            "score": 1,
            "text": "Really good president except for the pro-slavery parts",
            "title_similarity": "0.41891152",
            "sentiment_compound": 0.4927
        },
        {
            "id": "guzotou",
            "score": 1,
            "text": "Well. I can think of a president or two with shorter retirements....",
            "title_similarity": "0.3949972",
            "sentiment_compound": 0.2732
        },
        {
            "id": "guzp2tu",
            "score": 1,
            "text": "Thought Teddy did same thing?",
            "title_similarity": "0.081488885",
            "sentiment_compound": 0.0
        },
        {
            "id": "guzp6d6",
            "score": 1,
            "text": "Everything I know about Polk is from They Might Be Giants",
            "title_similarity": "0.34546012",
            "sentiment_compound": 0.0
        },
        {
            "id": "guzp72j",
            "score": 1,
            "text": "\" In four short years he met his every goal  \nHe seized the whole southwest from Mexico  \nMade sure the tariffs fell  \nAnd made the English sell the Oregon territory  \nHe built an independent treasury  \nHaving done all this he sought no second term  \nBut precious few have mourned the passing of  \nMister James K. Polk, our eleventh president  \nYoung Hickory, Napoleon of the Stump\"  \n\n\nJames K. Polk - They Might Be Giants",
            "title_similarity": "0.72849727",
            "sentiment_compound": 0.5499
        },
        {
            "id": "guzp8q6",
            "score": 1,
            "text": "I learned all I need to know about number 11 from They Might Be Giants (including the fact that he was the eleventh President)",
            "title_similarity": "0.5144558",
            "sentiment_compound": 0.0772
        },
        {
            "id": "guzpaxo",
            "score": 2,
            "text": "True, Polk got stuff done and left, which is a pretty good standard that feels all too rare anymore.\n\nHe did also kinda, sorta, maybe instigate a war under false pretexts to seize land... nothing's ever simple is it?",
            "title_similarity": "0.49915847",
            "sentiment_compound": 0.6124
        },
        {
            "id": "guzpfw8",
            "score": 1,
            "text": "Wow.",
            "title_similarity": "-0.14244914",
            "sentiment_compound": 0.5859
        },
        {
            "id": "guzpkfx",
            "score": 1,
            "text": "Lots of presidents/ their family members back then got sick/died during office or soon after. That Washington DC water did a lot of people in",
            "title_similarity": "0.49691582",
            "sentiment_compound": 0.0
        },
        {
            "id": "guzpl8g",
            "score": 1,
            "text": "TIL an American president rocked a mullet. Co",
            "title_similarity": "0.39170837",
            "sentiment_compound": 0.0
        },
        {
            "id": "guzpw46",
            "score": 2,
            "text": "That's not entirely true. Rutherford B. Hayes also made and kept a one term promise.",
            "title_similarity": "0.4637257",
            "sentiment_compound": -0.0641
        },
        {
            "id": "guzpzad",
            "score": 1,
            "text": "Ive often thought about how likely it is that biden is the next dead ex president.",
            "title_similarity": "0.5208142",
            "sentiment_compound": -0.6486
        },
        {
            "id": "guzq3zq",
            "score": 1,
            "text": "Did he have much resistance or was it more of a situation where he knew he'd only have the one term, so he focused on his plans instead of being like \"ehh, I'll get to it later\"?",
            "title_similarity": "0.2947697",
            "sentiment_compound": 0.6573
        },
        {
            "id": "guzq5zw",
            "score": 1,
            "text": "Great They Might Be Giants song.",
            "title_similarity": "0.12432193",
            "sentiment_compound": 0.6249
        },
        {
            "id": "guzqdhu",
            "score": 1,
            "text": "I’m related to Polk",
            "title_similarity": "0.14666642",
            "sentiment_compound": 0.0
        },
        {
            "id": "guzqe9r",
            "score": 1,
            "text": "Mans really went \"my work here is done\" and croaked lmaoooo",
            "title_similarity": "0.27396196",
            "sentiment_compound": 0.0
        },
        {
            "id": "guzqia6",
            "score": 1,
            "text": "https://youtu.be/StTiCU_fqCg",
            "title_similarity": "0.023789942",
            "sentiment_compound": 0.0
        },
        {
            "id": "guzqmx3",
            "score": 1,
            "text": "I’m pretty sure Rutherford Hayes also promised to serve only one term. Maybe he did do so only after the election because it was so contentious?",
            "title_similarity": "0.64892125",
            "sentiment_compound": 0.629
        },
        {
            "id": "guzqnh1",
            "score": 1,
            "text": "James 'The Adonis' Polk, many believed Polk to possess supernatural powers, such as the ability to understand the Indian languages.",
            "title_similarity": "0.3021884",
            "sentiment_compound": 0.3182
        },
        {
            "id": "guzqsxh",
            "score": 1,
            "text": "Everything I know about him I learned from They Might Be Giants.",
            "title_similarity": "0.3818807",
            "sentiment_compound": 0.0
        },
        {
            "id": "guzqxkg",
            "score": 1,
            "text": "was he a fuckin titan shifter",
            "title_similarity": "0.28322366",
            "sentiment_compound": 0.0
        },
        {
            "id": "guzqy00",
            "score": 1,
            "text": "IIRC he was also called one of the \"most boring presidents\" because he and his wife didn't drink/dance/play cards, etc.",
            "title_similarity": "0.6010281",
            "sentiment_compound": -0.3804
        },
        {
            "id": "guzr29q",
            "score": 1,
            "text": "Man how shit is it that a politician can be known for following through on their word",
            "title_similarity": "0.39469332",
            "sentiment_compound": -0.5574
        },
        {
            "id": "guzr513",
            "score": 1,
            "text": "The fact that more people are siding with Polk than are siding with Thoreau is a sad indictment of the current zeitgeist.",
            "title_similarity": "0.46609202",
            "sentiment_compound": -0.4767
        },
        {
            "id": "guzrhsq",
            "score": 1,
            "text": "This is the only one I remember him and Taft just because Mr burns mom dated him.",
            "title_similarity": "0.6971172",
            "sentiment_compound": 0.0
        },
        {
            "id": "guzriaq",
            "score": 1,
            "text": "Sounds like the best, or at least most effective, president",
            "title_similarity": "0.32530743",
            "sentiment_compound": 0.8777
        },
        {
            "id": "guzrk2t",
            "score": 1,
            "text": "He’s also the only president (besides trump) to not have any pets.",
            "title_similarity": "0.7043543",
            "sentiment_compound": 0.0
        },
        {
            "id": "guzrkgz",
            "score": 1,
            "text": "Biden should have done this. We all know he won’t serve two terms.",
            "title_similarity": "0.46750337",
            "sentiment_compound": 0.0
        },
        {
            "id": "guzrlqn",
            "score": 1,
            "text": "For a guy the vast majority of Americans have no idea who he is, Polk was extremely influential in the expansion of America.",
            "title_similarity": "0.5405514",
            "sentiment_compound": 0.2484
        },
        {
            "id": "guzrvpx",
            "score": 1,
            "text": "Didn’t Biden pledge that too?",
            "title_similarity": "0.1628113",
            "sentiment_compound": 0.0
        },
        {
            "id": "guzrw5p",
            "score": 1,
            "text": "He was also a virulent racist and an aggressive expansionist piece of shit.",
            "title_similarity": "0.18183169",
            "sentiment_compound": -0.9169
        },
        {
            "id": "guzs3rv",
            "score": 1,
            "text": "And he makes great dots.",
            "title_similarity": "0.06073369",
            "sentiment_compound": 0.6249
        },
        {
            "id": "guzsajr",
            "score": 1,
            "text": "Speaker of the House is actually an incredibly powerful job, and running for president and losing could fatally wound your ability to carry it out, as it requires you to be a quite popular leader in your party, and to work with the guy who beat you regularly, which would draw constant attention to your defeat. It isn't surprising few people make that transition.\n\nEdit: The last Speaker to run for president I can find in a quick google search is Newt Gingrich, who ran 13 years after he was forced to resign as Speaker due to bungling Clinton's impeachment. His career as speaker was already done, and thus he wasn't risking it by running for president.\n\nEdit again: Looking at the last few, Pelosi would not risk her seat as current speaker to run, and is getting too old to run. Ryan and Boehner both lost control of their party in the House when it went further right than they were willing to, and neither could garner the broad party support necessary to become president now, and they both know it. I don't know too much about Hastert, but if he was going to run he probably would have already.",
            "title_similarity": "0.6852427",
            "sentiment_compound": 0.2201
        },
        {
            "id": "guzsbdx",
            "score": 1,
            "text": "Thats my uncle",
            "title_similarity": "0.22706181",
            "sentiment_compound": 0.0
        },
        {
            "id": "guzsj88",
            "score": 1,
            "text": "\"For myself,\" Ulysses S. Grant wrote later about the United States war against Mexico, \"I was bitterly opposed to the measure, and to this day regard the war, which resulted, as one of the most unjust ever waged by a stronger against a weaker nation.\"",
            "title_similarity": "0.4882291",
            "sentiment_compound": -0.8858
        },
        {
            "id": "guzsqn1",
            "score": 1,
            "text": "it's really interesting to me that he came off looking good in later times despite his imperialist war of aggression against mexico",
            "title_similarity": "0.31956035",
            "sentiment_compound": 0.7807
        },
        {
            "id": "guzsv93",
            "score": 1,
            "text": "There were like 11 presidents in a row who only served one term and Polk was in the middle of that stretch",
            "title_similarity": "0.68226874",
            "sentiment_compound": 0.3612
        },
        {
            "id": "guzsvl0",
            "score": 2,
            "text": "See They Might Be Giants.",
            "title_similarity": "0.09143791",
            "sentiment_compound": 0.0
        },
        {
            "id": "guzt7h9",
            "score": 1,
            "text": "Might have been asked (for that I am sorry).\n\nBut did Polk know he was sick? And that’s why he served only one term?\n\nHonestly I don’t know, I feel this could be a good question.",
            "title_similarity": "0.5392103",
            "sentiment_compound": 0.5588
        },
        {
            "id": "guztaya",
            "score": 1,
            "text": "T. Roosevelt also promised not to seek reelection after a term and a half. He took over McKinley's term and then served a full term after that. \n\nLater he regretted not seeking a second full term and would run again over a decade later.",
            "title_similarity": "0.64151025",
            "sentiment_compound": -0.0258
        },
        {
            "id": "guztdp6",
            "score": 1,
            "text": "TIL 2014 was 9 years ago...",
            "title_similarity": "0.20788793",
            "sentiment_compound": 0.0
        },
        {
            "id": "guzu474",
            "score": 1,
            "text": "......having done all this he sought no second term......",
            "title_similarity": "0.43118134",
            "sentiment_compound": -0.296
        },
        {
            "id": "guzusr5",
            "score": 5,
            "text": "Achievement #2\n\n“ He provoked a war with Mexico in an attempt to expand the nation and succeeded in doing so, as it resulted in Mexico's cession of nearly all the American Southwest.”\n\nReddit moment",
            "title_similarity": "0.36573154",
            "sentiment_compound": -0.2263
        },
        {
            "id": "guzv1px",
            "score": 1,
            "text": "Ctrl F for the fact that he owned slaves in the white house...\n\nEdit:  huh.  No one knew this?  \n\nhttps://www.whitehousehistory.org/the-enslaved-households-of-james-k-polk#:~:text=Polk%20maintained%20a%20different%20public,their%20families%20while%20in%20office.",
            "title_similarity": "0.4980416",
            "sentiment_compound": -0.296
        },
        {
            "id": "guzv7dq",
            "score": 3,
            "text": "Why write about James K. Polk when you can sing about him?\n\nThey Might Be Giants - James K. Polk  \n[https://www.youtube.com/watch?v=H9SvJMZs5Rs](https://www.youtube.com/watch?v=H9SvJMZs5Rs)",
            "title_similarity": "0.3544879",
            "sentiment_compound": 0.0
        },
        {
            "id": "guzvfc0",
            "score": 1,
            "text": "Knew a guy in elementary with the same last name. Always swore and bragged about being his descendant. Last time I checked he was slaying the ladies",
            "title_similarity": "0.44871992",
            "sentiment_compound": 0.0
        },
        {
            "id": "guzvxxc",
            "score": 3,
            "text": "I also think that it's hilarious that Franklin pierce evoked James Polk's memory when he ran for president 8 years after Polk with the slogan \"we Polk'd you in '44 and we will Pierce you in' 52\"😂",
            "title_similarity": "0.5898719",
            "sentiment_compound": 0.6808
        },
        {
            "id": "guzw2s8",
            "score": 1,
            "text": "For integrity he could actually go down as a pretty good president, if his major accomplishment, taking California and New Mexico, wasn’t built on blood.",
            "title_similarity": "0.50951266",
            "sentiment_compound": 0.8271
        },
        {
            "id": "guzwa0f",
            "score": 1,
            "text": "People like to Polk fun, but if you Polk around through history, something something Polk",
            "title_similarity": "0.22671796",
            "sentiment_compound": 0.4404
        },
        {
            "id": "guzwtre",
            "score": 1,
            "text": "Learned everything I needed to know about him from a TMBG song",
            "title_similarity": "0.33678037",
            "sentiment_compound": 0.0
        },
        {
            "id": "guzx1ta",
            "score": 1,
            "text": "Everything I know about James K Polk I learned from They Might Be Giants : https://youtu.be/H9SvJMZs5Rs",
            "title_similarity": "0.41574663",
            "sentiment_compound": 0.0
        },
        {
            "id": "guzx4r6",
            "score": 2,
            "text": "James Polk had the Best Canadian Beer League Hockey Hair ever.",
            "title_similarity": "0.5163397",
            "sentiment_compound": 0.6369
        },
        {
            "id": "guzxck9",
            "score": 1,
            "text": "I thought Lyndon B. Johnson also did the same exact thing when he was sworn in.",
            "title_similarity": "0.43838537",
            "sentiment_compound": 0.0
        },
        {
            "id": "guzxg00",
            "score": 1,
            "text": "An honest politician?  They sure don't make them like they used to.",
            "title_similarity": "0.3885457",
            "sentiment_compound": 0.5408
        },
        {
            "id": "guzxrcn",
            "score": 1,
            "text": "I’m related to him and I didn’t even know that. Wow!",
            "title_similarity": "0.2928008",
            "sentiment_compound": 0.6239
        },
        {
            "id": "guzxzzh",
            "score": 1,
            "text": "America’s most interesting President.",
            "title_similarity": "0.33406726",
            "sentiment_compound": 0.4576
        },
        {
            "id": "guzyaio",
            "score": 2,
            "text": "FUN FACT : The Polka dance is named after him",
            "title_similarity": "0.25997674",
            "sentiment_compound": 0.6166
        },
        {
            "id": "guzyazi",
            "score": 2,
            "text": "He said 54-40 or fight. The border ended up at the 49th. I understand the actual pledge was a bit of a bluff and a bargaining tactic, but nonetheless. We didn't get the land that's now much of western Canada, and we didn't go to war with the British Empire. So not quite every campaign promise.",
            "title_similarity": "0.503595",
            "sentiment_compound": 0.776
        },
        {
            "id": "guzybg6",
            "score": 3,
            "text": "Perhaps he just realized that his health wouldn't permit a second term, or might not even allow a full first term.",
            "title_similarity": "0.39961833",
            "sentiment_compound": -0.1695
        },
        {
            "id": "guzyixg",
            "score": 1,
            "text": "Fun fact: when he won the elections The headlines read: \"POLK wins at the POLLS",
            "title_similarity": "0.4710026",
            "sentiment_compound": 0.8934
        },
        {
            "id": "guzym19",
            "score": 1,
            "text": "Fun Fact: He was in Polkahontas was his daughter",
            "title_similarity": "0.30804402",
            "sentiment_compound": 0.5106
        },
        {
            "id": "guzynlp",
            "score": 1,
            "text": "Fun Fact my fun facts are not facts",
            "title_similarity": "0.18967104",
            "sentiment_compound": 0.765
        },
        {
            "id": "guzyxl3",
            "score": 1,
            "text": "100% President speedrun",
            "title_similarity": "0.4169302",
            "sentiment_compound": 0.0
        },
        {
            "id": "guzyz15",
            "score": 1,
            "text": "Presidential speed run.",
            "title_similarity": "0.23894654",
            "sentiment_compound": 0.0
        },
        {
            "id": "guzz6st",
            "score": 1,
            "text": "Before he was moved to the state capitol grounds he was interred at the old Nashville city cemetery.",
            "title_similarity": "0.38423878",
            "sentiment_compound": 0.0
        },
        {
            "id": "guzz85c",
            "score": 1,
            "text": "Checkout “A Country of Vast Designs: James K. Polk, the Mexican War and the Conquest of the American Continent” by Robert Merry.  A good biography of him and his presidency.",
            "title_similarity": "0.34663802",
            "sentiment_compound": 0.3612
        },
        {
            "id": "guzzakq",
            "score": 1,
            "text": "damn speedrun",
            "title_similarity": "0.11937476",
            "sentiment_compound": -0.4019
        },
        {
            "id": "gv008eg",
            "score": 4,
            "text": "Not true. Rutherford Hayes pledged to serve one term and honoured it as well.",
            "title_similarity": "0.4507153",
            "sentiment_compound": 0.453
        },
        {
            "id": "gv00al7",
            "score": 1,
            "text": "We need more presidents like that.",
            "title_similarity": "0.1757145",
            "sentiment_compound": 0.4173
        },
        {
            "id": "gv00bb9",
            "score": 2,
            "text": "Just because I always have to link this video whenever my favorite president pops up...\n\n\nhttps://youtu.be/H9SvJMZs5Rs",
            "title_similarity": "0.43539122",
            "sentiment_compound": 0.4588
        },
        {
            "id": "gv018wq",
            "score": 2,
            "text": "They don’t make em like that anymore",
            "title_similarity": "0.0874746",
            "sentiment_compound": 0.3612
        },
        {
            "id": "gv01jus",
            "score": 2,
            "text": "George Washington is known as *The Man Who Refused to be King* because he didn't want to be president after the Revolutionary War. King Henry called him *The greatest man who ever lived* after Washington stepped down from his presidency after 2 terms.",
            "title_similarity": "0.71138364",
            "sentiment_compound": -0.2783
        },
        {
            "id": "gv01p6w",
            "score": 6,
            "text": "When you beat the game but don't want to go into New Game +",
            "title_similarity": "0.29886568",
            "sentiment_compound": -0.0857
        },
        {
            "id": "gv02gnz",
            "score": 1,
            "text": "Cincinnatus reborn, damn.",
            "title_similarity": "0.14351213",
            "sentiment_compound": -0.4019
        },
        {
            "id": "gv02vuq",
            "score": 1,
            "text": "I believe you meant to call him by his full title, President James \"the Adonis\" Polk.",
            "title_similarity": "0.41541162",
            "sentiment_compound": 0.0
        },
        {
            "id": "gv02wgj",
            "score": 2,
            "text": "Tmbg taught me this. https://youtu.be/H9SvJMZs5Rs",
            "title_similarity": "0.15681885",
            "sentiment_compound": 0.0
        },
        {
            "id": "gv02xjg",
            "score": 3,
            "text": "If Polk had a second term Canada will be called Super North Dakota",
            "title_similarity": "0.36652896",
            "sentiment_compound": 0.5994
        },
        {
            "id": "gv03o5z",
            "score": 1,
            "text": "Had a roommate in college who was a history major. He was CONVINCED Polk was the best President of all time. I tried arguing with him once, but quickly realized engineers aren’t well-equipped to argue politics with a history major.",
            "title_similarity": "0.67215914",
            "sentiment_compound": -0.0391
        },
        {
            "id": "gv04500",
            "score": 1,
            "text": "Wasn’t Lincoln’s retirement shorter?",
            "title_similarity": "0.2617049",
            "sentiment_compound": 0.0
        },
        {
            "id": "gv04cmp",
            "score": 1,
            "text": "Having done all this, he sought no second term.",
            "title_similarity": "0.45491242",
            "sentiment_compound": -0.296
        },
        {
            "id": "gv04tdg",
            "score": 7,
            "text": "He also had a middle school named after him on a great nickelodeon show.",
            "title_similarity": "0.34734237",
            "sentiment_compound": 0.6249
        },
        {
            "id": "gv05sje",
            "score": 2,
            "text": "I thought Biden pledged to only have one term?  I could be wrong on that, but just bringing it up because of the title statement.  I didn’t realize that was even uncommon.  Now-a-days if I was president, I wouldn’t even want two terms.",
            "title_similarity": "0.5962292",
            "sentiment_compound": -0.1531
        },
        {
            "id": "gv0604q",
            "score": 1,
            "text": "Henry Clay is in shambles.",
            "title_similarity": "0.2144794",
            "sentiment_compound": 0.0
        },
        {
            "id": "gv06e8y",
            "score": 2,
            "text": "They Might Be Giants has an amazing educational song about him.",
            "title_similarity": "0.2626755",
            "sentiment_compound": 0.5859
        },
        {
            "id": "gv06gus",
            "score": 2,
            "text": "Young Hiiickory, Napoleon of the stummmp (thanks TMBG)",
            "title_similarity": "0.2692082",
            "sentiment_compound": 0.4404
        },
        {
            "id": "gv06rih",
            "score": 1,
            "text": "In 1884...",
            "title_similarity": "0.1397467",
            "sentiment_compound": 0.0
        },
        {
            "id": "gv07ceo",
            "score": 1,
            "text": "With few exceptions (like Mr. Polk), politicians stay in government until they die.",
            "title_similarity": "0.67293704",
            "sentiment_compound": -0.34
        },
        {
            "id": "gv07od0",
            "score": 1,
            "text": "Fuck Polk",
            "title_similarity": "0.13488045",
            "sentiment_compound": -0.5423
        },
        {
            "id": "gv07s6p",
            "score": 3,
            "text": "Doctors hate him! Serve only one term with this simple trick!",
            "title_similarity": "0.51560974",
            "sentiment_compound": -0.6688
        },
        {
            "id": "gv07yyq",
            "score": 2,
            "text": "\"They Might be Giants\" taught me that. Great song.",
            "title_similarity": "0.22152895",
            "sentiment_compound": 0.6249
        },
        {
            "id": "gv07zv0",
            "score": 1,
            "text": "My time to :(",
            "title_similarity": "-0.019478403",
            "sentiment_compound": -0.4404
        },
        {
            "id": "gv086ub",
            "score": 2,
            "text": "> pledged to serve only one term\n> known for fulfilling all his major promises\n>died 3 months after his term ended\n\nr/technicallythetruth",
            "title_similarity": "0.84409",
            "sentiment_compound": -0.2466
        },
        {
            "id": "gv08u77",
            "score": 1,
            "text": "As a Tennessean, proud of our least bad president!",
            "title_similarity": "0.49130756",
            "sentiment_compound": 0.7385
        },
        {
            "id": "gv08yp8",
            "score": 1,
            "text": "The dark horse president. Remember it like it was yesterday",
            "title_similarity": "0.4452667",
            "sentiment_compound": 0.3612
        },
        {
            "id": "gv0935b",
            "score": 1,
            "text": "Fifty-four forty or fight! (In fact it was not 51’40, nor was there a fight.)",
            "title_similarity": "0.39865327",
            "sentiment_compound": -0.6696
        },
        {
            "id": "gv09u8w",
            "score": 1,
            "text": ">He was known for fulfilling all his major promises\n\nHe knew that you either died a hero, or lived long enough to see yourself become the villain.",
            "title_similarity": "0.49120572",
            "sentiment_compound": -0.1796
        },
        {
            "id": "gv09zev",
            "score": 1,
            "text": "I always get Polk and Buchanan mixed up which is a shame since Polk was pretty solid but Buchanan is a genuine contender for worst president in US history.",
            "title_similarity": "0.62779886",
            "sentiment_compound": -0.6757
        },
        {
            "id": "gv0d3h4",
            "score": 1,
            "text": "They don't make them like they used to.",
            "title_similarity": "0.08862383",
            "sentiment_compound": -0.2755
        },
        {
            "id": "gv0dffy",
            "score": 5,
            "text": "Not hard to accomplish your major goals as POTUS when you're an ardent Manifest Destiny proponent and Anglosaxonist just like most of your predecessors and political partisans, as well as a good portion of the population.\n\nNowadays, due to political tribalism, you can't even pass a law that can benefit at least 80% of the population without the opposing party's consent.",
            "title_similarity": "0.6227927",
            "sentiment_compound": 0.9093
        },
        {
            "id": "gv0dn5u",
            "score": 1,
            "text": "I love his speakers",
            "title_similarity": "0.08590635",
            "sentiment_compound": 0.6369
        },
        {
            "id": "gv0e1v1",
            "score": 1,
            "text": "So was Polk speaker and the president at the same time? Is that possible?",
            "title_similarity": "0.3102989",
            "sentiment_compound": 0.0
        },
        {
            "id": "gv0e6fd",
            "score": 1,
            "text": "Favorite president",
            "title_similarity": "0.3007908",
            "sentiment_compound": 0.4588
        },
        {
            "id": "gv0e8mi",
            "score": 1,
            "text": "In San Francisco, there is a Polk St. In chinese it literally means \" go broke and hit the street\" .",
            "title_similarity": "0.34690785",
            "sentiment_compound": -0.4215
        },
        {
            "id": "gv0eagf",
            "score": 1,
            "text": "Didn't Joe Biden pledge to only serve 1 term?  I swear during his campaign he said he was not running again in 2024.....",
            "title_similarity": "0.68022466",
            "sentiment_compound": -0.0516
        },
        {
            "id": "gv0ejvt",
            "score": 3,
            "text": "Also started the Mexican-American War but whateva",
            "title_similarity": "0.19839348",
            "sentiment_compound": -0.3506
        },
        {
            "id": "gv0fq9h",
            "score": 2,
            "text": "He's also the only president to score four touchdowns in a single football game. \n\nAt a school named after him! With all players wearing cleats that he had sold to them in his shoe store!!!",
            "title_similarity": "0.68373847",
            "sentiment_compound": 0.0
        },
        {
            "id": "gv0g1ao",
            "score": 1,
            "text": "Hayes ran on a pledge for one term as well",
            "title_similarity": "0.4263296",
            "sentiment_compound": 0.2732
        },
        {
            "id": "gv0g2tk",
            "score": 3,
            "text": "Worth noting that he engineered a war against Mexico as part of the Manifest Destiny ideal of the period. Abraham Lincoln, who I believe was a lawyer at the time, criticized the war as being unjust and based on fabrications.",
            "title_similarity": "0.3520468",
            "sentiment_compound": -0.8519
        },
        {
            "id": "gv0gm2s",
            "score": 1,
            "text": "This was also the name of the school in Neds Declassified",
            "title_similarity": "0.20967853",
            "sentiment_compound": 0.0
        },
        {
            "id": "gv0gs3b",
            "score": 1,
            "text": "My favorite president",
            "title_similarity": "0.35529214",
            "sentiment_compound": 0.4588
        },
        {
            "id": "gv0hdhy",
            "score": 2,
            "text": "And is one of my favourite They Might Be Giants songs. I’m no American, but I learned a lot about him from it.",
            "title_similarity": "0.42536157",
            "sentiment_compound": -0.1531
        },
        {
            "id": "gv0hf88",
            "score": 1,
            "text": "This makes me think about the tweet talking about the guy who got hired, immediately fixed a few bugs that had been bothering him as a user, and then turned in his two weeks notice.",
            "title_similarity": "0.5186026",
            "sentiment_compound": -0.3818
        },
        {
            "id": "gv0hnko",
            "score": 1,
            "text": "His private residence before he was elected is located down the road from me in my hometown of Columbia, TN. It is currently a well maintained museum with many great exhibits. His family was very active in local politics in Maury County and owned some beautiful antebellum homes which are still standing in the county.",
            "title_similarity": "0.5344398",
            "sentiment_compound": 0.92
        },
        {
            "id": "gv0hpyt",
            "score": 2,
            "text": "Napoleon of the stump!",
            "title_similarity": "0.24663323",
            "sentiment_compound": 0.0
        },
        {
            "id": "gv0ihvh",
            "score": 1,
            "text": "A distant relative... only saying that because of reddit anon. Not a great one unfortunately.",
            "title_similarity": "0.37512597",
            "sentiment_compound": -0.6902
        },
        {
            "id": "gv0jg9o",
            "score": 1,
            "text": "Yo can we get another president like this?",
            "title_similarity": "0.27042878",
            "sentiment_compound": 0.3612
        },
        {
            "id": "gv0k412",
            "score": 1,
            "text": "North Carolina, represent! Woo!   \nYou may now return to your regularly scheduled insanity.",
            "title_similarity": "0.21626344",
            "sentiment_compound": -0.2924
        },
        {
            "id": "gv0k57p",
            "score": 1,
            "text": "This sounds like a Jeopardy clue.",
            "title_similarity": "0.06730907",
            "sentiment_compound": -0.1531
        },
        {
            "id": "gv0kw3a",
            "score": 1,
            "text": "He lead so Ned could go to school and give us our much needed survival tips",
            "title_similarity": "0.29868507",
            "sentiment_compound": 0.0
        },
        {
            "id": "gv0l3h9",
            "score": 1,
            "text": "I thought Biden said he’d only serve one term?",
            "title_similarity": "0.4859297",
            "sentiment_compound": 0.0
        },
        {
            "id": "gv0n8yn",
            "score": 1,
            "text": "Sweet God if ever we needed that again, it’s with jopedo.",
            "title_similarity": "0.28235954",
            "sentiment_compound": 0.6249
        },
        {
            "id": "gv0nr57",
            "score": 2,
            "text": "Polk became president as a fluke. There were two extremely popular democratic candidates, so when the vote was cast, those two popular candidates split the votes, and coincidentally Polk ended up with more votes by a slim margin. Because of this and other situations like it, now we have one delegate for each party when we cast our final votes for president.\n\nThe people weren't happy about it. He was an extremely unpopular president at the time, but looking back, he's an absolutely admiral man.",
            "title_similarity": "0.62337124",
            "sentiment_compound": 0.7868
        },
        {
            "id": "gv0o6f1",
            "score": 3,
            "text": "I'm hoping that he will remain the only President to have ever been Speaker for a while yet, as Pelosi as president would be awful",
            "title_similarity": "0.73231584",
            "sentiment_compound": -0.0516
        },
        {
            "id": "gv0oj19",
            "score": 1,
            "text": "What about TR? He said that he would only confine himself to one elected term",
            "title_similarity": "0.53309953",
            "sentiment_compound": 0.0
        },
        {
            "id": "gv0oro2",
            "score": 1,
            "text": "If you are not careful and you say James K Polk three times in a Minnesota theater, he appears.\n\nSkip to 4:30\nhttps://podcasts.apple.com/us/podcast/wits-apm-podcasts/id568160601?i=1000335742946\n\nAnd invade Mexico.",
            "title_similarity": "0.49015856",
            "sentiment_compound": -0.1139
        },
        {
            "id": "gv0ow9j",
            "score": 1,
            "text": "Technically this is false. James K. Polk ran on the platform of \"54-40 or fight!\" He made a deal below the latitude line and we did not fight. Although a great deal by all measures, it still did not live up to his promise of 54-40.",
            "title_similarity": "0.5143356",
            "sentiment_compound": 0.7412
        },
        {
            "id": "gv0pyqd",
            "score": 1,
            "text": "Yep speaker of the house and majority whip are usually not super popular as they’re always teetering the negotiation lines so one getting to the White House is remarkable.",
            "title_similarity": "0.60190094",
            "sentiment_compound": 0.0829
        },
        {
            "id": "gv0q57h",
            "score": 2,
            "text": "In four short years, he met his every goal",
            "title_similarity": "0.476811",
            "sentiment_compound": 0.0
        },
        {
            "id": "gv0qgrl",
            "score": 1,
            "text": "There were two portraits of him at the James K. Polk home and museum. They were side-by-side and one of them was was done post-Presidency, and it showed. I remember thinking that he looked like Skeletor in that post-Presidency portrait. That job took everything out of him.",
            "title_similarity": "0.5691791",
            "sentiment_compound": 0.3612
        },
        {
            "id": "gv0qj28",
            "score": 1,
            "text": "TIL Polk had a super sweet skullet",
            "title_similarity": "0.22493742",
            "sentiment_compound": 0.7845
        },
        {
            "id": "gv0qsgu",
            "score": 2,
            "text": "In four short years he met his every goal. He seized the whole southwest from Mexico. Made sure the tariffs fell, and made the English sell the Oregon territory. He built an independent treasury.",
            "title_similarity": "0.63026536",
            "sentiment_compound": 0.4767
        },
        {
            "id": "gv0qu69",
            "score": 1,
            "text": "Another fun fact - James K  Polk was born in Pineville, NC, now a suburb on the southern side of Charlotte along the border of South Carolina.",
            "title_similarity": "0.325044",
            "sentiment_compound": 0.5106
        },
        {
            "id": "gv0qzfr",
            "score": 1,
            "text": "William Henry Harrison was the second Best president change my mind",
            "title_similarity": "0.62471926",
            "sentiment_compound": 0.6369
        },
        {
            "id": "gv0rcpf",
            "score": 1,
            "text": "trump got fucking elected. fuck. that four years seemed like eight.",
            "title_similarity": "0.49988532",
            "sentiment_compound": -0.3134
        },
        {
            "id": "gv0ri4q",
            "score": 1,
            "text": "**Interesting trivia to piggyback on that...President James K. Polk's VP George Miflin Dallas was the FIRST person of Jamaican heritage to serve as VPOTUS, thereby making current VP Kamala Harris the second person of Jamaican Heritage to serve as VP.   George Dallas' father Alexander Dallas (who served as Secretary of the Treasury under Pres Madison) was born in Kingston, Jamaica.**   \n\n\n[https://en.wikipedia.org/wiki/George\\_M.\\_Dallas](https://en.wikipedia.org/wiki/George_M._Dallas)",
            "title_similarity": "0.5458538",
            "sentiment_compound": 0.5423
        },
        {
            "id": "gv0rnxt",
            "score": 2,
            "text": "You should listen to more They Might Be Giants. They do a whole song entitled James K.Polk. It's pretty awesome.",
            "title_similarity": "0.29517514",
            "sentiment_compound": 0.8555
        },
        {
            "id": "gv0rqai",
            "score": 1,
            "text": "Does anyone here listen to Very Presidential podcast? If you think stuff like this is interesting, you’d love it!",
            "title_similarity": "0.31776088",
            "sentiment_compound": 0.8655
        },
        {
            "id": "gv0s2v2",
            "score": 1,
            "text": "One of his grandsons died last year at 95.",
            "title_similarity": "0.55444825",
            "sentiment_compound": -0.5574
        },
        {
            "id": "gv0s3pt",
            "score": 2,
            "text": "They Might Be Giants did a great song on him.",
            "title_similarity": "0.20311564",
            "sentiment_compound": 0.6249
        },
        {
            "id": "gv0s8t5",
            "score": 1,
            "text": "What about TR?",
            "title_similarity": "-0.07155208",
            "sentiment_compound": 0.0
        },
        {
            "id": "gv0s9hl",
            "score": 1,
            "text": "The last time we had a one-term president that chose not to run for re-election was Rutherford Hayes",
            "title_similarity": "0.6824987",
            "sentiment_compound": 0.0
        },
        {
            "id": "gv0sond",
            "score": 1,
            "text": "He was manifest destiny, in all its terrors and riches.",
            "title_similarity": "0.23077798",
            "sentiment_compound": -0.0516
        },
        {
            "id": "gv0t5g8",
            "score": 1,
            "text": "From my hometown!! And yep.",
            "title_similarity": "0.13281849",
            "sentiment_compound": 0.4184
        },
        {
            "id": "gv0t8aj",
            "score": 1,
            "text": "He is the only Speaker to become President and only two Speakers have become Vice President (Schuyler Colfax to Grant and John Nance Garner to FDR).",
            "title_similarity": "0.768973",
            "sentiment_compound": 0.3612
        },
        {
            "id": "gv0t8pc",
            "score": 1,
            "text": "Poooooolllllkkkk salllad",
            "title_similarity": "0.030127998",
            "sentiment_compound": 0.0
        },
        {
            "id": "gv0tba4",
            "score": 1,
            "text": "Yep, and he sent arms and munitions to white illegal American immigrants in Mexico to start an insurrection against Mexicans and provoked a war with the aims of murdering tens of thousands of Mexicans and stealing their lands.",
            "title_similarity": "0.3094808",
            "sentiment_compound": -0.9468
        },
        {
            "id": "gv0tds9",
            "score": 1,
            "text": "Everyones saying good things about him.\n\nHe was a protege of Andrew Jackson, though.\n\nSo, tell me, how did he fuck over the indigenous peoples?",
            "title_similarity": "0.46018243",
            "sentiment_compound": -0.1531
        },
        {
            "id": "gv0teaq",
            "score": 1,
            "text": "Tar Heel!",
            "title_similarity": "0.0680597",
            "sentiment_compound": 0.0
        },
        {
            "id": "gv0tsn3",
            "score": 1,
            "text": "Dang what a efficient ass dude.",
            "title_similarity": "0.13707426",
            "sentiment_compound": -0.1779
        },
        {
            "id": "gv0u0fc",
            "score": 2,
            "text": "I see OP is also a fan of They Might Be Giants.",
            "title_similarity": "0.17298147",
            "sentiment_compound": 0.3182
        },
        {
            "id": "gv0upmn",
            "score": 3,
            "text": "Bow out while high on success, not mooch off the public purse like Bitch McCONnell and the rest of the Grand QAnon Party",
            "title_similarity": "0.36975092",
            "sentiment_compound": 0.854
        },
        {
            "id": "gv0uwhm",
            "score": 1,
            "text": "Calvin Coolidge and Lyndon B Johnson both chose to not run for a second term, but...it was not a part of a campaign commitment.",
            "title_similarity": "0.45127526",
            "sentiment_compound": 0.3818
        },
        {
            "id": "gv0ux7o",
            "score": 1,
            "text": "He is also infamously known for provoking the Mexican-American War. He sent troops across the Rio Grande to provoke the Mexican Army. He succeeded in his Endeavor. Thousands died but we gained a third of Mexico as our own",
            "title_similarity": "0.52268916",
            "sentiment_compound": -0.1779
        },
        {
            "id": "gv0v66u",
            "score": 1,
            "text": "Apparently he worked constantly and didn't believe a President should take a vacation.",
            "title_similarity": "0.5182475",
            "sentiment_compound": 0.0
        },
        {
            "id": "gv0vay8",
            "score": 1,
            "text": "Nancy Pelosi will be the next",
            "title_similarity": "0.09377295",
            "sentiment_compound": 0.0
        },
        {
            "id": "gv0vgj4",
            "score": 1,
            "text": "Ohhh...if praying for the death of Lord Farquad would only work...\n\n&#x200B;\n\nThe gods do not help those who do not 'help themselves'.",
            "title_similarity": "0.4389879",
            "sentiment_compound": -0.711
        },
        {
            "id": "gv0vvl5",
            "score": 1,
            "text": "Polk was most plausibly an alien.",
            "title_similarity": "0.23091611",
            "sentiment_compound": 0.0
        },
        {
            "id": "gv0w2wk",
            "score": 1,
            "text": "And they say you can't find an honest politician",
            "title_similarity": "0.2995021",
            "sentiment_compound": -0.4023
        },
        {
            "id": "gv0w5wy",
            "score": 2,
            "text": "I mean... this always comes up and is never accurate. Polk’s campaign slogan was “54 40 or Fight!” I don’t remember America owning most of British Columbia... I also don’t remember us fighting for it.\n\nPolk=great president. He also didn’t fulfill his biggest promise.",
            "title_similarity": "0.62327653",
            "sentiment_compound": 0.4574
        },
        {
            "id": "gv0w72b",
            "score": 2,
            "text": "Thank you, They Might Be Giants, for teaching me about this.\nhttps://youtu.be/H9SvJMZs5Rs",
            "title_similarity": "0.21997246",
            "sentiment_compound": 0.3612
        },
        {
            "id": "gv0w7um",
            "score": 1,
            "text": "And then in the late 1960's, at a Chicago High School in Polk's name, Al Bundy scored 4 touchdowns in a single game",
            "title_similarity": "0.62789893",
            "sentiment_compound": 0.0
        },
        {
            "id": "gv0wgb6",
            "score": 1,
            "text": "Calvin Coolidge did something similar I believe Calvin was a smart man who warned about government overreach and he was right. 100 years later he was spot on",
            "title_similarity": "0.52523124",
            "sentiment_compound": 0.1531
        },
        {
            "id": "gv0x4ea",
            "score": 1,
            "text": "> **making his retirement the shortest.** \n\nThat's a nice way of putting he died the soonest after he stopped being president.",
            "title_similarity": "0.6440027",
            "sentiment_compound": -0.4019
        },
        {
            "id": "gv0x8en",
            "score": 2,
            "text": "Sounds like Polkpaganda to me. /s",
            "title_similarity": "0.100602925",
            "sentiment_compound": 0.3612
        },
        {
            "id": "gv0xlfu",
            "score": 2,
            "text": "Other James Polk fact: \n\nThere are two presidents to share a birthday: James Polk (11th President) and Warren Harding (29th President), both of whose birthdays fall on the 2nd of November. \n\nThat’s it. That’s the only thing I remember learning about him in school.",
            "title_similarity": "0.670929",
            "sentiment_compound": 0.296
        },
        {
            "id": "gv0yn6z",
            "score": 1,
            "text": "I’ve never liked the idea of more-than-one terms",
            "title_similarity": "0.2699014",
            "sentiment_compound": -0.3252
        },
        {
            "id": "gv0z83l",
            "score": 1,
            "text": "Retirement was the shortest? JFK and Lincoln?",
            "title_similarity": "0.52472043",
            "sentiment_compound": 0.0
        },
        {
            "id": "gv0z8fk",
            "score": 1,
            "text": "I’ve always liked Polk; though I feel like Clay would’ve been the better President. He unconstitutionally annexed Texas (as Jefferson had done with Louisiana, but at least Jefferson negotiated a deal with France) and got us into a war with Mexico. He also staged an incident at the border to justify a war with Mexico. He was good and did a few great things in his four years, but imo the negative things he did override his achievements, like the independent treasury.",
            "title_similarity": "0.537123",
            "sentiment_compound": 0.2023
        },
        {
            "id": "gv0zf1e",
            "score": 1,
            "text": "He also had a hard on for annexing native land and shoved us into a war with Mexico we didn't need to be in. But arguably, the USA would not be what it is geographically without him.",
            "title_similarity": "0.39901677",
            "sentiment_compound": -0.631
        },
        {
            "id": "gv0zrbz",
            "score": 1,
            "text": "\"A great president. Said what he intended to do and did it.\" \n\n\\-- Harry Truman on James K. Polk",
            "title_similarity": "0.43579233",
            "sentiment_compound": 0.6249
        },
        {
            "id": "gv0zsni",
            "score": 1,
            "text": "Polk has always been my favorite president. Ask my 11th grade teacher.",
            "title_similarity": "0.58342564",
            "sentiment_compound": 0.4588
        },
        {
            "id": "gv10dgl",
            "score": 1,
            "text": "Didn’t Biden also say he would only serve one term?",
            "title_similarity": "0.46553445",
            "sentiment_compound": 0.0
        },
        {
            "id": "gv119t6",
            "score": 1,
            "text": "I remember him from Ned's Declassified School Survival Guide",
            "title_similarity": "0.345197",
            "sentiment_compound": 0.0
        },
        {
            "id": "gv11l3l",
            "score": 1,
            "text": "Interesting about the speaker to president part. I guess since that's an equal position to president in the constitution, if maybe more volatile as it depends on a majority every two years, there's a lot to gamble if they ran for president. I'm guessing most senators wait for an election where they're not up for re-election as a senator to run for president (there's only 7 states where they can run for both)",
            "title_similarity": "0.7073741",
            "sentiment_compound": 0.4019
        },
        {
            "id": "gv12k82",
            "score": 1,
            "text": "He came. He polked. He conquered. \n\n^He ^is ^James ^K. ^Polk ^and ^he ^is ^inevitable.",
            "title_similarity": "0.28717494",
            "sentiment_compound": 0.0
        },
        {
            "id": "gv12nlv",
            "score": 1,
            "text": "He also violently stole almost half of Mexico’s sovereign territory",
            "title_similarity": "0.3992201",
            "sentiment_compound": -0.5859
        },
        {
            "id": "gv12udn",
            "score": 1,
            "text": "My name is James Polk.  My name is James Polk.  There are 0 things I haven't done, so don't you wait, don't you wait.",
            "title_similarity": "0.44150782",
            "sentiment_compound": 0.0
        },
        {
            "id": "gv12ytd",
            "score": 1,
            "text": "#fuck the federal reserve",
            "title_similarity": "0.28566575",
            "sentiment_compound": -0.5423
        },
        {
            "id": "gv134xq",
            "score": 2,
            "text": "In 1844 the democrats were split.....",
            "title_similarity": "0.29942364",
            "sentiment_compound": 0.0
        },
        {
            "id": "gv139r5",
            "score": 5,
            "text": "In 1844, the Democrats were split\nThe three nominees for the presidential candidate\nWere Martin Van Buren, a former president and an abolitionist\nJames Buchanan, a moderate\nLouis Cass, a general and expansionist\nFrom Nashville came a dark horse riding up\nHe was James K. Polk, Napoleon of the Stump\n\nAustere, severe, he held few people dear\nHis oratory filled his foes with fear\nThe factions soon agreed\nHe's just the man we need\nTo bring about victory\nFulfill our manifest destiny\nAnd annex the land the Mexicans command\nAnd when the votes were cast the winner was\nMister James K. Polk, Napoleon of the Stump\n\nIn four short years he met his every goal\nHe seized the whole southwest from Mexico\nMade sure the tariffs fell\nAnd made the English sell the Oregon territory\nHe built an independent treasury\nHaving done all this he sought no second term\nBut precious few have mourned the passing of\nMister James K. Polk, our eleventh president\nYoung Hickory, Napoleon of the Stump\n\nTMBJ",
            "title_similarity": "0.5759507",
            "sentiment_compound": 0.6542
        },
        {
            "id": "gv13j1q",
            "score": 2,
            "text": "Ned's Declassified, anyone....",
            "title_similarity": "0.3149522",
            "sentiment_compound": 0.0
        },
        {
            "id": "gv13qky",
            "score": 1,
            "text": "Polk and I share the same alma mater- always thought that was cool. (UNC)",
            "title_similarity": "0.2994117",
            "sentiment_compound": 0.5423
        },
        {
            "id": "gv13tko",
            "score": 1,
            "text": "He also invented the polka dot.",
            "title_similarity": "0.23495358",
            "sentiment_compound": 0.0
        },
        {
            "id": "gv141yo",
            "score": 1,
            "text": "President Polk and I share the same birthday 187 years apart. \nI know only I care about that but I can't see his name without thinking about that fact.",
            "title_similarity": "0.6675636",
            "sentiment_compound": 0.0387
        },
        {
            "id": "gv15tvz",
            "score": 1,
            "text": "Was Polk a hopeful president? Like did everyone think he was gonna fuck shit up in a positive way",
            "title_similarity": "0.46483356",
            "sentiment_compound": 0.3182
        },
        {
            "id": "gv15ztn",
            "score": 1,
            "text": "This dude was a serious piece of shit",
            "title_similarity": "0.16153575",
            "sentiment_compound": -0.5994
        },
        {
            "id": "gv164qd",
            "score": 2,
            "text": "His TMBG song is great",
            "title_similarity": "0.17310306",
            "sentiment_compound": 0.6249
        },
        {
            "id": "gv17r4c",
            "score": 1,
            "text": "I've always been very proud that I'm related to him. His wife is my (many great) aunt.",
            "title_similarity": "0.36745062",
            "sentiment_compound": 0.8173
        },
        {
            "id": "gv17vlx",
            "score": 1,
            "text": "I believe Rutherford B. Hayes and James Garfield honored a campaign pledge not to seek a second term (well, Garfield was assassinated). TR promised to only serve two (so the Republicans took Roosevelt's advice and nominated Taft). But Taft was a huge disappointment to TR, who wanted to run for a third term (to continue his progressive agenda, and as a \"fuck you\" to his former best friend). He considered his two-term promise to be the biggest mistake he ever made",
            "title_similarity": "0.69185674",
            "sentiment_compound": 0.8126
        },
        {
            "id": "gv180px",
            "score": 2,
            "text": "President Manifest Destiny",
            "title_similarity": "0.24988732",
            "sentiment_compound": 0.0
        },
        {
            "id": "gv186ad",
            "score": 1,
            "text": "Didn’t Theodore Roosevelt also serve only one term after a pledge of not to seek re-election?",
            "title_similarity": "0.6170392",
            "sentiment_compound": 0.0
        },
        {
            "id": "gv18bxh",
            "score": 1,
            "text": "My US history teacher in high school used to refer to Polk as one of the Cream Cheese Presidents. Basically one of several presidents “schmeared” in between some heavy hitters. No offense Polk, but you’ll forever be labeled as such for me.",
            "title_similarity": "0.5091311",
            "sentiment_compound": 0.0951
        },
        {
            "id": "gv19flq",
            "score": 2,
            "text": "Cue the song....",
            "title_similarity": "-0.05323664",
            "sentiment_compound": 0.0
        },
        {
            "id": "gv1bqth",
            "score": 1,
            "text": "Trump still has 2 weeks to beat him.",
            "title_similarity": "0.6307953",
            "sentiment_compound": 0.0
        },
        {
            "id": "gv1d2r9",
            "score": 1,
            "text": "Not looking to fight... people bringing up that Mexico had land “stolen,”... why do you believe Mexico had a stronger claim to the territory than the United States?",
            "title_similarity": "0.354366",
            "sentiment_compound": 0.7639
        },
        {
            "id": "gv1d6xe",
            "score": 1,
            "text": "I did a report on James Polk in elementary school. All I remember is that he was a one term president, and he was the one responsible for installing gas lights in the White House. At the time I believe I thought that was his biggest accomplishment. My mind is not been changed.",
            "title_similarity": "0.7124044",
            "sentiment_compound": 0.3182
        },
        {
            "id": "gv1dqqm",
            "score": 2,
            "text": "Honestly I feel this is Bidens goal. But well see.",
            "title_similarity": "0.05862213",
            "sentiment_compound": 0.5647
        },
        {
            "id": "gv1f7yw",
            "score": 1,
            "text": "I voted for him.",
            "title_similarity": "0.21574362",
            "sentiment_compound": 0.0
        },
        {
            "id": "gv1gy6o",
            "score": 2,
            "text": "“Nailed it. I’m out”",
            "title_similarity": "0.128714",
            "sentiment_compound": 0.0
        },
        {
            "id": "gv1hf4f",
            "score": 1,
            "text": "\"54° 40' or Fight!\"\n\nHow in the hell is this not the top comment?",
            "title_similarity": "0.291848",
            "sentiment_compound": -0.8436
        },
        {
            "id": "gv1hi66",
            "score": 2,
            "text": "Also had a middle school named after him in Ned’s Declassified School Survival guide.",
            "title_similarity": "0.40480018",
            "sentiment_compound": 0.0
        },
        {
            "id": "gv1hnd3",
            "score": 1,
            "text": "Traitor enablist",
            "title_similarity": "0.10376326",
            "sentiment_compound": 0.0
        },
        {
            "id": "gv1htk4",
            "score": 1,
            "text": "Quick. Efficient. To the point.",
            "title_similarity": "-0.030484699",
            "sentiment_compound": 0.4215
        },
        {
            "id": "gv1i27n",
            "score": 1,
            "text": "Rutherford b Hayes? Pretty sure he pledged to be a one term president and kept his word.",
            "title_similarity": "0.6561521",
            "sentiment_compound": 0.6705
        },
        {
            "id": "gv1iy2r",
            "score": 1,
            "text": "Rutherford Hayes ran on a one term pledge.",
            "title_similarity": "0.5525641",
            "sentiment_compound": 0.0
        },
        {
            "id": "gv1jo58",
            "score": 2,
            "text": "So he spent his time being president instead of spending his time trying to get reelected?",
            "title_similarity": "0.440995",
            "sentiment_compound": 0.0
        },
        {
            "id": "gv1jwkb",
            "score": 1,
            "text": "Did anyone else also learn this from Crazy Ex-Girlfriend",
            "title_similarity": "0.29745638",
            "sentiment_compound": -0.34
        },
        {
            "id": "gv1k93x",
            "score": 1,
            "text": "A president that held his promises? If fucking only these days.",
            "title_similarity": "0.50663406",
            "sentiment_compound": 0.3818
        },
        {
            "id": "gv1kll4",
            "score": 1,
            "text": "No, I think JFK's retirement was the shortest.",
            "title_similarity": "0.56958115",
            "sentiment_compound": 0.0
        },
        {
            "id": "gv1kwj3",
            "score": 1,
            "text": "And carried out the Trail of Tears",
            "title_similarity": "0.0751386",
            "sentiment_compound": -0.2263
        },
        {
            "id": "gv1lymx",
            "score": 5,
            "text": "THIS WILL GET BURIED INDER THOUSANDS BUT HOPEFULLY SOMEONE SEES IT IM 13 AND I AM THE GREAT GREAT etc. NEICE OF JAMES K POLK",
            "title_similarity": "0.53239083",
            "sentiment_compound": 0.9688
        },
        {
            "id": "gv1megq",
            "score": 1,
            "text": "It's like beating all the quests, and the end is free roam mode.",
            "title_similarity": "0.3638452",
            "sentiment_compound": 0.4215
        },
        {
            "id": "gv1mwyl",
            "score": 1,
            "text": "Coolidge and hayes also 1 termers",
            "title_similarity": "0.38695538",
            "sentiment_compound": 0.0
        },
        {
            "id": "gv1namw",
            "score": 1,
            "text": "When the innkeeper in one New York village got the newspaper off the stagecoach, he announced to the assembled citizens: \"The great and glorious Democratic party has nominated for President ... \" ( Looking down to read the name) \" James K. Polk.  Who the hell is James K. Polk?\"",
            "title_similarity": "0.5294986",
            "sentiment_compound": 0.7506
        },
        {
            "id": "gv1r8kc",
            "score": 1,
            "text": "Well, he had a High School named after him in Chicago, where the legendary Al Bundy scored Four touchdowns in ONE Game!",
            "title_similarity": "0.54973847",
            "sentiment_compound": 0.3382
        },
        {
            "id": "gv1rj0f",
            "score": 1,
            "text": "He looks like right hard Scottish bastard, I’d trust him to keep his word.",
            "title_similarity": "0.38614208",
            "sentiment_compound": 0.2263
        },
        {
            "id": "gv1u55c",
            "score": 1,
            "text": "I know all about him thanks to They Might Be Giants.",
            "title_similarity": "0.25371337",
            "sentiment_compound": 0.4404
        },
        {
            "id": "gv21ftc",
            "score": 1,
            "text": "I heavily dislike Polk.",
            "title_similarity": "0.21225138",
            "sentiment_compound": -0.3818
        },
        {
            "id": "gv22jcg",
            "score": 2,
            "text": "In a technical sense there are presidents with shorter retirements.\n\nLike Abraham Lincoln, John F. Kennedy, Franklin D. Roosevelt, etc.",
            "title_similarity": "0.4899323",
            "sentiment_compound": 0.3612
        },
        {
            "id": "gv22jry",
            "score": 1,
            "text": "I am related to that jerk.",
            "title_similarity": "0.16814427",
            "sentiment_compound": -0.34
        },
        {
            "id": "gv22tq2",
            "score": 3,
            "text": "And after all this he had a high school named after him but not just any high-school it was the one where Al bundy from the class of 66 scored 4 touch downs in one game to win the City championship against Andrew Johnson High go panthers!",
            "title_similarity": "0.6190981",
            "sentiment_compound": 0.8845
        },
        {
            "id": "gv24szp",
            "score": 1,
            "text": "I had to check the last claim and there have been some close calls. James A. Garfield had run for the speaker of the house but lost and Newt Gingrich ran for the president but lost. \n\nAnd I can’t bear that James K. Polk resembles Khan from Star Trek II very much.",
            "title_similarity": "0.60253596",
            "sentiment_compound": -0.7096
        },
        {
            "id": "gv2bl6h",
            "score": 2,
            "text": "Didn't Al Bundy play football for the school named in his honour.",
            "title_similarity": "0.46507663",
            "sentiment_compound": 0.3948
        },
        {
            "id": "gv2ez42",
            "score": 1,
            "text": "[https://tenor.com/view/gif-21224296](https://tenor.com/view/gif-21224296)",
            "title_similarity": "0.16448553",
            "sentiment_compound": 0.0
        },
        {
            "id": "gv2gs1v",
            "score": 1,
            "text": "Found out that I’m related to the guy…….somewhere out there",
            "title_similarity": "0.19109425",
            "sentiment_compound": 0.0
        },
        {
            "id": "gv2udij",
            "score": 2,
            "text": "Neds Declassified School Survival Guide. First thing that goes through my head when thinking of him.",
            "title_similarity": "0.41090694",
            "sentiment_compound": 0.0
        },
        {
            "id": "gv7nrlq",
            "score": 1,
            "text": "Also the Prez who made the mullet work.",
            "title_similarity": "0.18716875",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvsdox7",
            "score": 2,
            "text": "A slaveholder who inherited everything from him father, a Jacksonian and his political presidential accomplishments completed as a result of what can only be accurately described as American imperialism by our annexation of Texas and the California territory. Ya, he was a swell fella.",
            "title_similarity": "0.5262151",
            "sentiment_compound": 0.0
        }
    ]
}