{
    "TIL The Lord of the Rings films originally would have been released by Disney via Miramax but they chose not to fund it due to costs. They let New Line Cinema have it on the condition they pay $10M in \"turnaround\" costs. The LOTR trilogy will later on gross over $2.9B at the global box office.\n": [
        {
            "id": "gwefazi",
            "score": 0,
            "text": "And they aren't even good movies. 🤷",
            "title_similarity": "0.27818927",
            "sentiment_compound": -0.3412
        },
        {
            "id": "gwadjev",
            "score": 52,
            "text": "I'm glad they passed on the movies but I wish Disney would have built a middle earth park like they built the Wizarding world of Harry Potter.",
            "title_similarity": "0.68189055",
            "sentiment_compound": 0.8316
        },
        {
            "id": "gwb413j",
            "score": 4,
            "text": "Thank God it hasn't been done by Disney they turn into shit everything they touch , like marvel universe or star wars !",
            "title_similarity": "0.6040586",
            "sentiment_compound": 0.2481
        },
        {
            "id": "gwb20j2",
            "score": 3,
            "text": "Thank the Valar, could you imagine if Disney had the LotR... Would be 20 movies by now sure, but all PC trash, filled with Mary Sues...",
            "title_similarity": "0.6845894",
            "sentiment_compound": 0.34
        },
        {
            "id": "gwaqlc6",
            "score": 1,
            "text": "Annnnnnd Disney have made 10 times that in the time since those movies were released. \n\nThey don't care lol.",
            "title_similarity": "0.732473",
            "sentiment_compound": -0.6072
        },
        {
            "id": "gwbj1di",
            "score": -1,
            "text": "I hate the LOTR movies for the same reasons why I hate the Harry Potter movies. The best parts of the books that made the series exciting for me were not filmed or were cut out.",
            "title_similarity": "0.6213836",
            "sentiment_compound": -0.2732
        },
        {
            "id": "gwajsna",
            "score": 10,
            "text": "Thank god. Disney is poison to anything artistic (not including Pixar)",
            "title_similarity": "0.5134182",
            "sentiment_compound": 0.0258
        },
        {
            "id": "gwaefrp",
            "score": 0,
            "text": "Whoops",
            "title_similarity": "-0.15823203",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwb232w",
            "score": 0,
            "text": "If they released the trilogy in imax, I think it'd make another 3 billion at least.",
            "title_similarity": "0.59767014",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwb3p0a",
            "score": 0,
            "text": "This was also 2.9 bil before it was just 2.9 bil",
            "title_similarity": "0.31680685",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwb4qx7",
            "score": 0,
            "text": "Disney might be the most short sighted company on the planet.",
            "title_similarity": "0.547415",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwbbfb7",
            "score": 0,
            "text": "Good fuck Disney, already ruined one franchise... And I like how its too expensive for them but if you want to go ahead and film it were going to need you to pay us 10 million. Drop in the bucket tho.",
            "title_similarity": "0.77738166",
            "sentiment_compound": -0.5267
        },
        {
            "id": "gwbcu0y",
            "score": 0,
            "text": "r/TILSTU: Today I Learned Something Totally Useless.",
            "title_similarity": "0.24907525",
            "sentiment_compound": -0.4754
        },
        {
            "id": "gwe2rkw",
            "score": 0,
            "text": "Stupid people will watch anything.",
            "title_similarity": "0.2035546",
            "sentiment_compound": -0.5267
        },
        {
            "id": "gwekh0f",
            "score": 0,
            "text": "We would have a land and rides at parks by now. Sad in that sense, but screw the big D.",
            "title_similarity": "0.5443412",
            "sentiment_compound": -0.3919
        },
        {
            "id": "gwbd3no",
            "score": -8,
            "text": "[deleted]",
            "title_similarity": "0.010753773"
        },
        {
            "id": "gwatyi5",
            "score": 1,
            "text": "And I still watch the trilogy probably 8 times a year. I went to all three in theatres recently too.",
            "title_similarity": "0.42814815",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwaw7rv",
            "score": -1,
            "text": "I Sauron with that",
            "title_similarity": "-0.14904621",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwb061a",
            "score": 1,
            "text": "and yet the tolkien family has basically never been paid a dime and been continually told that the franchise doesnt make any money.\n\nNew Line Cinema has been railroading the tokien family out of their rightful money for many many years now, and nothing has ever been done about it.",
            "title_similarity": "0.554809",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwb2kgv",
            "score": 1,
            "text": "Fuuck Disney",
            "title_similarity": "0.22142999",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwb2m2z",
            "score": 1,
            "text": "Don't worry, according to New line cinema, lord of the rings trilogy was a massive financial failure and cost them hundreds of millions. So really new line was looking out for Disney and Miramax",
            "title_similarity": "0.74395734",
            "sentiment_compound": -0.2249
        },
        {
            "id": "gwb3tub",
            "score": 1,
            "text": "The LOTR was a huge risk. Filming three movies at the same time, but not knowing if the first one would be a hit. That's some 300 million dollar heartburn. Although I enjoyed the films, I'm still appalled to this day by Peter Jackson's reliance on frame-cutting slow motion in the action scenes. It's so friggin bad.\n\nI wonder if James Cameron's little Avatar experiment will fare as well as LOTR.",
            "title_similarity": "0.7225958",
            "sentiment_compound": -0.5279
        },
        {
            "id": "gwb3u38",
            "score": -1,
            "text": "Thank goodness Disney’s grubby, moldy, lice-laden hands weren’t on this franchise.\n\nThey would have turned it into a 30-movie Universe and attempted to make every serious situation humorous defeating the emotional impacts it could have potentially had.\n\nThat said, I do enjoy Marvel.",
            "title_similarity": "0.69115263",
            "sentiment_compound": 0.8957
        },
        {
            "id": "gwb7kdp",
            "score": 1,
            "text": "On the other hand 10 mil for doing jack shit ain't a bad deal either.",
            "title_similarity": "0.5302532",
            "sentiment_compound": 0.3506
        },
        {
            "id": "gwb9d6y",
            "score": 1,
            "text": "Disney would'nt have produced what we have now. They would've destroyed it like they did Star Wars.",
            "title_similarity": "0.6659695",
            "sentiment_compound": -0.6486
        },
        {
            "id": "gwba2fc",
            "score": 1,
            "text": "That picture is from the much shittier Hobbit movies",
            "title_similarity": "0.4909313",
            "sentiment_compound": -0.4767
        },
        {
            "id": "gwbk6s8",
            "score": -1,
            "text": "I really don't get why these movies are so popular. I tried to watch them once but was so bored I couldn't even get through the first one",
            "title_similarity": "0.6158916",
            "sentiment_compound": -0.319
        },
        {
            "id": "gwbm19h",
            "score": 1,
            "text": "Probably a good thing. Imagine if Disney held on to the release... they would have insisted that Favreau direct The Hobbit movies.",
            "title_similarity": "0.63483834",
            "sentiment_compound": 0.4404
        },
        {
            "id": "gwbrdm1",
            "score": -1,
            "text": "all i see is disney making $10 million instead of gambling on that snooze-fest of a movie series",
            "title_similarity": "0.8185837",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwcwy1u",
            "score": -1,
            "text": "I fell asleep during these movies",
            "title_similarity": "0.3258763",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwe0np3",
            "score": 1,
            "text": "The best thing that could ever happen, otherwise we'd be watching \"Lord of the Rings 14⅓ - the trouser snake of Pipin\" these days.",
            "title_similarity": "0.47014448",
            "sentiment_compound": 0.6369
        },
        {
            "id": "gwig3u5",
            "score": 1,
            "text": "Nick Cage as Aragorn. Tom Cruise as Aragorn. *shudders",
            "title_similarity": "0.249606",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwakt6j",
            "score": 2,
            "text": "Thank the gods for that!",
            "title_similarity": "0.028703641",
            "sentiment_compound": 0.4199
        },
        {
            "id": "gwax2jp",
            "score": 2,
            "text": "not that i expect much from the hollywood reporter but it's funny that in an article about the lord of the rings movies they use a photo from the hobbit movies.",
            "title_similarity": "0.6930543",
            "sentiment_compound": 0.5927
        },
        {
            "id": "gwb1qtn",
            "score": 2,
            "text": "In today's episode of \"Disney clearly has no fucking idea what it's doing, but is still somehow massively profitable\"...",
            "title_similarity": "0.60266244",
            "sentiment_compound": 0.6249
        },
        {
            "id": "gwb2bok",
            "score": 2,
            "text": "I am SOOOOO fucking glad that Jizney didn't have a hand in the OG LOTR movies.",
            "title_similarity": "0.5687102",
            "sentiment_compound": 0.1692
        },
        {
            "id": "gwb44kx",
            "score": -2,
            "text": "Disney would of ruined it like the ruin everything. They need to stick to kids movies and even those they fuck up",
            "title_similarity": "0.60604495",
            "sentiment_compound": -0.836
        },
        {
            "id": "gwb84z8",
            "score": 2,
            "text": "The Lord of the Rings movie trilogy was pretty ground breaking because it really established that movie audience would knowingly be willing to wait years to see a complete story play out.",
            "title_similarity": "0.6948493",
            "sentiment_compound": 0.6808
        },
        {
            "id": "gwajb10",
            "score": 21,
            "text": "Fuck Disney",
            "title_similarity": "0.30352503",
            "sentiment_compound": -0.5423
        },
        {
            "id": "gwauwho",
            "score": 5,
            "text": "I feel like disney is made up of those who purchased DOGE at 42¢",
            "title_similarity": "0.50710154",
            "sentiment_compound": 0.3612
        },
        {
            "id": "gwapzfz",
            "score": 17,
            "text": "Disney sitting atop a pile of money: \"Oh no! Anyway\"",
            "title_similarity": "0.47329956",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwatm09",
            "score": 6,
            "text": "...and due to accounting practices, none\nof these films made a profit..",
            "title_similarity": "0.54908544",
            "sentiment_compound": 0.4404
        },
        {
            "id": "gwb7su2",
            "score": 7,
            "text": "IMO it's a holy quintilogy of things we will likely never see again put into film\n\n* Beloved source material with good story\n\n* Capable director undergoing a labor of love\n\n* Studio that gave the project the time and money needed\n\n* (relatively) Faithful to the source with an emphasis on practical effects\n\n* Christopher Lee",
            "title_similarity": "0.56149536",
            "sentiment_compound": 0.9423
        },
        {
            "id": "gwan6v4",
            "score": 24,
            "text": "How? I thought he explicitly forbid Disney from being involved in any movie?\n\nhttps://insidethemagic.net/2021/02/tolkien-despised-walt-disney-al1/",
            "title_similarity": "0.54707104",
            "sentiment_compound": -0.3939
        },
        {
            "id": "gwaudxd",
            "score": 40,
            "text": "[deleted]",
            "title_similarity": "0.010753773"
        },
        {
            "id": "gwawbuc",
            "score": 40,
            "text": "Everyone always looks at these articles and points to the missed opportunities, hindsight, yada yada. Same with \"Yahoo passed up the opportunity to buy Google for 1M in 1998\" or \"Blockbuster scoffed at the offer to buy Netflix for $50M in 2000\". LOTR was successful BECAUSE Disney didn't do it. Google was successful because Yahoo didn't run it. Netflix was successful because Blockbuster didn't run it. They weren't missed opportunities that cost them billions in profit.",
            "title_similarity": "0.77426493",
            "sentiment_compound": 0.9776
        },
        {
            "id": "gwat5ti",
            "score": 28,
            "text": "Fuck disney. The world got lucky that new line Cinema was able to grab up Lord of the rings.",
            "title_similarity": "0.5767157",
            "sentiment_compound": -0.1779
        },
        {
            "id": "gwajncm",
            "score": 119,
            "text": "Thank God Disney didn't fuck it up.",
            "title_similarity": "0.35464227",
            "sentiment_compound": 0.7543
        },
        {
            "id": "gwaudw0",
            "score": 11,
            "text": "Didn't Tolkien's family hate Disney and refused to do any business with them?",
            "title_similarity": "0.5054848",
            "sentiment_compound": 0.2018
        },
        {
            "id": "gwaqpve",
            "score": 73,
            "text": "I can understand Disney's reasoning though: How could a franchise featuring whimsical, imaginary characters make any money??",
            "title_similarity": "0.5548017",
            "sentiment_compound": 0.168
        },
        {
            "id": "gwatz6p",
            "score": 75,
            "text": "I didn’t know anything about Lord of the Rings when I saw the first one in theaters. I was a video game nerd obsessed with Everquest. I went with my best friend to the theater and when it ended we were so pissed. We didn’t know it was a trilogy and we loved it so much we would have sat there for 9 hours if they played the other two movies. \n\nLegolas in the first movie is the reason I always play as archers in video games",
            "title_similarity": "0.70930934",
            "sentiment_compound": 0.7804
        },
        {
            "id": "gwadn58",
            "score": 273,
            "text": "Jokes on them, turns out these movies have never made a profit.\n\n(According to the studio, anyway)",
            "title_similarity": "0.5635679",
            "sentiment_compound": -0.1043
        },
        {
            "id": "gwap0rf",
            "score": 218,
            "text": "And everyone tried not paying the Tolkien estate on grounds there was no profit to divide.",
            "title_similarity": "0.5584772",
            "sentiment_compound": -0.3412
        },
        {
            "id": "gwainzf",
            "score": 170,
            "text": "Peter Jackson giving the story on getting LOTR off the ground:  \n\n[https://youtu.be/-ggVDYcvNxg?t=503](https://youtu.be/-ggVDYcvNxg?t=503)",
            "title_similarity": "0.3577689",
            "sentiment_compound": 0.4137
        },
        {
            "id": "gwaushe",
            "score": 197,
            "text": "It seems mind blowing now, but back then it was a mostly unproven director trying to make what was thought to be an impossible adaptation. Jackson's largest film to that point was \"The Frighteners\" which barely broke even at the box office. (Budget = $26 million, Box office = $29.3 million) The LOTR property has a [LONG](https://en.wikipedia.org/wiki/Middle-earth_in_film) history of some very big people trying to make in into a film with little luck over the decades. \n\nThis was a huge gamble to any studio that took it on. Just be thankful that New Line did, so we got the masterpiece we now have.",
            "title_similarity": "0.7131196",
            "sentiment_compound": 0.9428
        },
        {
            "id": "gwalk49",
            "score": 476,
            "text": "Disney could have produced the Harry Potter movies, too, but they scoffed, didn't think they'd make enough of a profit.",
            "title_similarity": "0.71427065",
            "sentiment_compound": 0.5927
        },
        {
            "id": "gwaf7sf",
            "score": 1394,
            "text": "J. R. R. Tolkien despised Disney so it worked out for the best.",
            "title_similarity": "0.5632628",
            "sentiment_compound": 0.3612
        },
        {
            "id": "gwaiwbb",
            "score": 5165,
            "text": "I believe Miramax wanted to make it a single movie while the filmmakers wanted to make it 2, but then New Line was like “Uh, there’s three books. It should be three movies.”\n\nEdit: Okay, apparently the filmmakers wanted 3, Miramax agreed on 2, then changed their mind to 1, then they pitched it to New Line as 2 but New Line said 3.",
            "title_similarity": "0.64027786",
            "sentiment_compound": 0.8047
        },
        {
            "id": "gwajhf4",
            "score": 110,
            "text": "Miramax! I thought they only made classy films like 'The Piano'.",
            "title_similarity": "0.5648286",
            "sentiment_compound": 0.69
        },
        {
            "id": "gwaclfu",
            "score": 4128,
            "text": "I mean, some of the techniques they used in the films were so new and groundbreaking, that they taught themselves how to do it as they were filming/editing.\n\nIt could have easily been a total fucking disaster had certain things had not worked out they way they expected. Gollum’s animation being a prime example.",
            "title_similarity": "0.60586876",
            "sentiment_compound": -0.2282
        },
        {
            "id": "gwab4rb",
            "score": 1080,
            "text": "Here’s an excerpt from the article:\n\n> **After failing to persuade Miramax's parent, The Walt Disney Co., to fund a two-picture version, they agreed to let Jackson set it up at New Line -- on the condition that New Line pay them $10 million in \"turnaround\" costs and a slice of the backend.** As part of the deal, Miramax and the Weinsteins also were granted 5 percent of first-dollar gross from any future Hobbit film, with the company and the brothers dividing that 5 percent. Miramax's new owners, a consortium of investors led by Colony Capital, also will benefit with roughly 2.5 percent of Hobbit's profits.",
            "title_similarity": "0.8947646",
            "sentiment_compound": 0.296
        },
        {
            "id": "gwam502",
            "score": 2734,
            "text": "The thing I love the most about what led to the creation of LOTR is that it was one of the largest undertakings financially and physically in cinematic history and they put the creator of Brain Dead at the helm.  I like to think they saw what Peter Jackson was able to do with the (to this day) unrivaled level and quality of gore and were like \"have at it\".",
            "title_similarity": "0.572793",
            "sentiment_compound": 0.7184
        },
        {
            "id": "gwajmxh",
            "score": 9534,
            "text": "In a similar vein, Sean Connery was offered 14% of the revenue to play Gandalf. He turned it down because he read the script and said he didn't understand it.",
            "title_similarity": "0.7359061",
            "sentiment_compound": 0.34
        },
        {
            "id": "gwaosr8",
            "score": 1,
            "text": "Kinda dope that Weinstein took an L on this one",
            "title_similarity": "0.21077415",
            "sentiment_compound": 0.5766
        },
        {
            "id": "gwap4qb",
            "score": 1,
            "text": "Hindsight's a bitch.",
            "title_similarity": "0.16255596",
            "sentiment_compound": -0.5859
        },
        {
            "id": "gwaqgpg",
            "score": 1,
            "text": "r/wellthatsucks",
            "title_similarity": "-0.026216727",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwas8pj",
            "score": 1,
            "text": "The best movies in history",
            "title_similarity": "0.38640204",
            "sentiment_compound": 0.6369
        },
        {
            "id": "gwasoo0",
            "score": 1,
            "text": "They chose TO NOT*",
            "title_similarity": "0.14503783",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwat4i0",
            "score": 1,
            "text": "lol pwned",
            "title_similarity": "-0.059013013",
            "sentiment_compound": 0.4215
        },
        {
            "id": "gwathd8",
            "score": 1,
            "text": "LOTR kids series. It makes me shudder.",
            "title_similarity": "0.22079203",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwauluf",
            "score": 2,
            "text": "\"Lord of the Rings films\"\nPosts picture of The Hobbit...",
            "title_similarity": "0.41134635",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwaumxx",
            "score": 1,
            "text": "The studio still claimed it didn't make a profit though, just to screw the people who actually made the movie or if their share. \n\nHollywood accounting is next level.",
            "title_similarity": "0.6773599",
            "sentiment_compound": -0.1546
        },
        {
            "id": "gwauxka",
            "score": 255,
            "text": "...and according to their accountants, the trilogy was an abysmal failure that  lost money.",
            "title_similarity": "0.5116332",
            "sentiment_compound": -0.6808
        },
        {
            "id": "gwav3jf",
            "score": 2,
            "text": "It's safe to say they effed up...",
            "title_similarity": "-0.005000975",
            "sentiment_compound": 0.4404
        },
        {
            "id": "gwavpxv",
            "score": 6,
            "text": "Thank god. Disney would have ruined it.",
            "title_similarity": "0.45464623",
            "sentiment_compound": 0.128
        },
        {
            "id": "gwavuls",
            "score": 2,
            "text": "Disney getting screwed is the best kind of fact IMO",
            "title_similarity": "0.4023909",
            "sentiment_compound": 0.25
        },
        {
            "id": "gwaw227",
            "score": 1,
            "text": "This is kind of like the [Sony buying Marvel's characters for $25 million](https://screenrant.com/marvel-mcu-sony-movie-characters-rights-own-spiderman/#:~:text=Sony%20Missed%20ANOTHER%20Opportunity%20To%20Own%20The%20MCU&text=%22Looking%20to%20get%20as%20many,studios%20for%20%2425%20million.%22) situation where in our eyes today, this decision seems so dumb and such a huge mistake.  There was no guarantee it was going to be the smash hit that it turned into.  Sounds like the plans that Disney/Miramax were considering didn't look anything like the trilogy we ended up getting, so I'm more than okay with this.",
            "title_similarity": "0.68691516",
            "sentiment_compound": -0.3195
        },
        {
            "id": "gwawskh",
            "score": 1,
            "text": "Not sure if Disney would have let that go if Bob Iger had already been CEO back then. Considering all the intellectual property Disney gobbled up with Iger at the helm.",
            "title_similarity": "0.608251",
            "sentiment_compound": 0.3265
        },
        {
            "id": "gwawtz5",
            "score": 1,
            "text": "Is it just me or is the title of this post really hard to read.",
            "title_similarity": "0.26019818",
            "sentiment_compound": -0.1761
        },
        {
            "id": "gwawurm",
            "score": 5,
            "text": "Glad Disney didn't get its dirty fingers on LoTR.",
            "title_similarity": "0.5354794",
            "sentiment_compound": 0.6604
        },
        {
            "id": "gwawyf0",
            "score": 3,
            "text": "I’m pretty glad about that in all honesty, I wouldn’t want Disney to have a single finger in lotr.",
            "title_similarity": "0.50441724",
            "sentiment_compound": 0.8658
        },
        {
            "id": "gwawztl",
            "score": 1,
            "text": "Got saved from a “Produced by Harvey Weinstein” credit.",
            "title_similarity": "0.41990918",
            "sentiment_compound": 0.6597
        },
        {
            "id": "gwax2dr",
            "score": 5,
            "text": "[deleted]",
            "title_similarity": "0.010753773"
        },
        {
            "id": "gwax95y",
            "score": 2,
            "text": "And I am very happy it worked out this way. I love those movies and the books so much.",
            "title_similarity": "0.25812358",
            "sentiment_compound": 0.8479
        },
        {
            "id": "gwaxbda",
            "score": 2,
            "text": "Harvey Weinstein had a few Fingers in that franchise",
            "title_similarity": "0.3157751",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwaxq63",
            "score": 5,
            "text": "Their greed is the only thing that protected Tolkien from their greed.",
            "title_similarity": "0.4261533",
            "sentiment_compound": -0.3612
        },
        {
            "id": "gway2l3",
            "score": 1,
            "text": "I'd imagine Disney also got some backend in addition to reimbursement for costs, as is standard.",
            "title_similarity": "0.5888107",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwayd2k",
            "score": 3,
            "text": "One of my first thoughts after watching the Extended edition of Fellowship recently is that you could quite organically cut the film in two near enough the middle, call it Part 1 and Part 2, and get away with it. Light editing around the cut to remind people of what happened in Part 1 and you're basically done. This is the same for all three films, ~1hr 40 to 2hr \"parts\" using the extra material in the extended edition and possibly a few pickup shots to re-explain plot. I shudder to think at what Hollywood would try if they were going to do it today.",
            "title_similarity": "0.670902",
            "sentiment_compound": -0.539
        },
        {
            "id": "gwaygxs",
            "score": 2,
            "text": "If Disney had released the films they would have screwed it up... Just like they do on all that's book to film movies",
            "title_similarity": "0.69126415",
            "sentiment_compound": -0.1779
        },
        {
            "id": "gwayh7p",
            "score": 1,
            "text": "One of the best English movie I have seen",
            "title_similarity": "0.33763033",
            "sentiment_compound": 0.6369
        },
        {
            "id": "gwayk05",
            "score": 1,
            "text": "Adjusted for inflation, the total is $4.5B.",
            "title_similarity": "0.39811924",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwayn5f",
            "score": 1,
            "text": "At least they made 10 million hahahahahhaha",
            "title_similarity": "0.3661034",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwaypvr",
            "score": 6,
            "text": "Inflation from 2001 to 2021 turns $2.9 billion into $4.3 billion. 2003 to 2021 turns it into 'only' $4.1 billion.\n\nThat's within about half a billion of what the Disney Star Wars trilogy grossed worldwide, $4.46 billion worldwide gross and adjusted to about $4.6 billion in 2021.",
            "title_similarity": "0.6572797",
            "sentiment_compound": -0.7964
        },
        {
            "id": "gwaz46z",
            "score": 1,
            "text": "Imagine Gandalf greeting you at Disneyland.",
            "title_similarity": "0.37187397",
            "sentiment_compound": 0.3818
        },
        {
            "id": "gwazahv",
            "score": 1,
            "text": "\"Fool of a Mouse!\"\n\n- Gandalf, probably.",
            "title_similarity": "0.31714115",
            "sentiment_compound": -0.4926
        },
        {
            "id": "gwazb5p",
            "score": 1,
            "text": "Suck it Disney",
            "title_similarity": "0.21700709",
            "sentiment_compound": -0.4404
        },
        {
            "id": "gwazdyg",
            "score": 1,
            "text": "I'm so glad disney didn't grab my boy!",
            "title_similarity": "0.501904",
            "sentiment_compound": 0.5551
        },
        {
            "id": "gwazhju",
            "score": 1,
            "text": "Saved. But I don't know how to look for bookmarks on reddit. So here's a comment.",
            "title_similarity": "0.5218559",
            "sentiment_compound": 0.2263
        },
        {
            "id": "gwazj8r",
            "score": 1,
            "text": "Thank god they didn't let Disney wipe their ass on it",
            "title_similarity": "0.4771619",
            "sentiment_compound": 0.0258
        },
        {
            "id": "gwazk7h",
            "score": 1,
            "text": "I’d say Disney fucked that one up, but they have multi billion dollar franchises in marvel and Star Wars... so, nobody is crying at Disney over spilled milk",
            "title_similarity": "0.7040286",
            "sentiment_compound": -0.8422
        },
        {
            "id": "gwazkp2",
            "score": 1,
            "text": "Lesson to be learned: Sometimes even the top PROFESSIONALS in the world can’t spot a banger idea when literally that’s their only job. \n\nSo don’t let someone discourage you if you have a dream that you really believe could be huge but the people around you can’t see it and don’t believe in it yet like you do!",
            "title_similarity": "0.5399246",
            "sentiment_compound": 0.636
        },
        {
            "id": "gwazv34",
            "score": 4,
            "text": "I've heard this once or twice before, but Tolkien hated Walt Disney, the company, and everything it stood for. I wouldn't be surprised if he had it written into his will that Disney would never be allowed to use his stories.",
            "title_similarity": "0.6340829",
            "sentiment_compound": -0.8316
        },
        {
            "id": "gwazwgt",
            "score": 1,
            "text": "20 year old news wow",
            "title_similarity": "0.31541964",
            "sentiment_compound": 0.5859
        },
        {
            "id": "gwazyyu",
            "score": 1,
            "text": "Good thing they didn't pass on Marvel lol",
            "title_similarity": "0.309466",
            "sentiment_compound": 0.5216
        },
        {
            "id": "gwb07cv",
            "score": 17,
            "text": "Worth noting this was, at the time, probably a wise decision by Disney. LotR was an ultra nerdy and by pop culture standards ancient franchise with little hope of mainstream success in a cinema landscape where fantasy movies had largely been relegated to goofy and over the top disasters.",
            "title_similarity": "0.6567952",
            "sentiment_compound": 0.8078
        },
        {
            "id": "gwb07uu",
            "score": 1,
            "text": "Well… I think Disney came out ok after that.",
            "title_similarity": "0.35861802",
            "sentiment_compound": 0.296
        },
        {
            "id": "gwb0gc4",
            "score": 3,
            "text": "Considering Tolkien's hate for Disney's works, I'm happy it never happened and would hate it if Disney ever acquired any of the Professor's works. Nothing personal against Disney, I love a lot of their movies but Tolkien's wishes should be respected.",
            "title_similarity": "0.60953116",
            "sentiment_compound": 0.743
        },
        {
            "id": "gwb0hz8",
            "score": 2,
            "text": "Oh dear, I hope Disney will be alright...",
            "title_similarity": "0.3106514",
            "sentiment_compound": 0.7579
        },
        {
            "id": "gwb0jgi",
            "score": 2,
            "text": "I heard Harvey Weinstein on Howard Stern in 2014 taking about how they going to court over this.",
            "title_similarity": "0.40766555",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwb0p5n",
            "score": 1,
            "text": "Regrets, I’ve had a few...",
            "title_similarity": "0.09741457",
            "sentiment_compound": -0.3612
        },
        {
            "id": "gwb0pkq",
            "score": 1,
            "text": "I'd just like to add that Tolkien himself absolutely hated Disney.",
            "title_similarity": "0.43385965",
            "sentiment_compound": -0.4576
        },
        {
            "id": "gwb0tob",
            "score": 1,
            "text": "There’s a really good post on this whole hobbit debate done by u/lookatnum that compares the words per run time of each movie. The hobbit movies suck. [[OC] Lord of the Rings vs. The Hobbit: Movie run time per 10K words of source material](https://i.reddit.com/r/dataisbeautiful/comments/i6izoc/oc_lord_of_the_rings_vs_the_hobbit_movie_run_time/)",
            "title_similarity": "0.7243712",
            "sentiment_compound": 0.0754
        },
        {
            "id": "gwb12g5",
            "score": 1,
            "text": "Some executive definitely got a talking to.",
            "title_similarity": "0.05700389",
            "sentiment_compound": 0.4019
        },
        {
            "id": "gwb1595",
            "score": 3,
            "text": "I bet the board of directors of Disney got a few million dollar bonus that year. Even when they fuck up they get paid, must be nice.",
            "title_similarity": "0.7117694",
            "sentiment_compound": 0.4215
        },
        {
            "id": "gwb1hxz",
            "score": 2,
            "text": "The Mouse will get them eventually",
            "title_similarity": "0.20529005",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwb1luk",
            "score": 2,
            "text": "Ha! Fuck Disney!",
            "title_similarity": "0.26678267",
            "sentiment_compound": -0.6229
        },
        {
            "id": "gwb1odd",
            "score": 1,
            "text": "OOOOOF\n\nThis is almost as bad as some of the choices that Star Wars actors made about their pay. \n\nThey could either:\n\nA) Take a flat fee, or\n\nB) Take a small percentage of the earnings from the movie. \n\nSince no one really thought that Star Wars would be successful most chose the flat fee. But others took the percentage. I think Alec Guinness agreed to something like 0.5% of the profits. \n\nIt ended up with MASSIVE discrepancy of earnings from the movie. For example, James Earl Jones was payed $7,000 for voicing Darth Vader in the first movie whereas Alec Guinness and his estate have earned over $100 MILLION to date.",
            "title_similarity": "0.8066592",
            "sentiment_compound": 0.6848
        },
        {
            "id": "gwb1wrw",
            "score": 1,
            "text": "God can you imagine the lack of violence and blood if it was Disney",
            "title_similarity": "0.5169793",
            "sentiment_compound": -0.6486
        },
        {
            "id": "gwb1xw9",
            "score": 1,
            "text": "Is nobody going to point out that this picture is from the Hobbit trilogy?",
            "title_similarity": "0.4476286",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwb28el",
            "score": 1,
            "text": "“Turn around...everyone now and then I get a little bit lonely ...”",
            "title_similarity": "0.13700493",
            "sentiment_compound": -0.3008
        },
        {
            "id": "gwb2ike",
            "score": 1,
            "text": "So there",
            "title_similarity": "-0.22947893",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwb2lw9",
            "score": 1,
            "text": "Is this why Disney committed so hard to Marvel? Losing out on, at the time, the second highest grossing film/film series of all time, because they didn’t want to front the money? That would make a lot of sense.",
            "title_similarity": "0.781315",
            "sentiment_compound": 0.2634
        },
        {
            "id": "gwb2wnz",
            "score": 1,
            "text": "I read somewhere (no sauce) that Tolkien hated Disney and swore not to let them get his stories.",
            "title_similarity": "0.51981944",
            "sentiment_compound": -0.6369
        },
        {
            "id": "gwb326l",
            "score": 2,
            "text": "Thank god - they would have fucked it up like Star Wars.",
            "title_similarity": "0.4858142",
            "sentiment_compound": -0.4404
        },
        {
            "id": "gwb35yf",
            "score": 1,
            "text": "Thank god that never happened",
            "title_similarity": "0.173591",
            "sentiment_compound": 0.5574
        },
        {
            "id": "gwb3nve",
            "score": 2,
            "text": "Good move, Disney.",
            "title_similarity": "0.17293711",
            "sentiment_compound": 0.4404
        },
        {
            "id": "gwb47os",
            "score": 8,
            "text": "The trilogy transcends money and profit. It will be a timeless memory for people for generations to come",
            "title_similarity": "0.39190507",
            "sentiment_compound": 0.4404
        },
        {
            "id": "gwb4geq",
            "score": 1,
            "text": "That photo is from The Hobbit not Lord Of The Rings",
            "title_similarity": "0.38037044",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwb4it3",
            "score": 1,
            "text": "Billion dollar mistakes.",
            "title_similarity": "0.35450858",
            "sentiment_compound": -0.3612
        },
        {
            "id": "gwb4nwq",
            "score": 1,
            "text": "Miramax? I thought they only made classy flicks like The Piano and The Crying Game?",
            "title_similarity": "0.5005958",
            "sentiment_compound": 0.3939
        },
        {
            "id": "gwb4r9x",
            "score": 2,
            "text": "In every single way, the stars aligned for this film trilogy. If there is a God, He’s a Lord of the Rings fan.",
            "title_similarity": "0.4778731",
            "sentiment_compound": 0.5267
        },
        {
            "id": "gwb4sww",
            "score": 1,
            "text": "It's only the greatest trilogy ever made.",
            "title_similarity": "0.3416309",
            "sentiment_compound": 0.6369
        },
        {
            "id": "gwb4t2y",
            "score": 1,
            "text": "New Line Cinemas..... the house that Freddy Built.",
            "title_similarity": "0.29726115",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwb4ttp",
            "score": 1,
            "text": "Eh",
            "title_similarity": "-0.23827207",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwb4xo7",
            "score": 1,
            "text": "Should have taken a percentage. Poor poor Disney, am I right?",
            "title_similarity": "0.52764803",
            "sentiment_compound": -0.7351
        },
        {
            "id": "gwb55y2",
            "score": 1,
            "text": "Are you telling me we could’ve had a lord of the rings land at Disney world?!",
            "title_similarity": "0.47947255",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwb5a3j",
            "score": 1,
            "text": "Imagine if Donald duck and Aragon met each other",
            "title_similarity": "0.34012437",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwb5sox",
            "score": 1,
            "text": "Any loss for Disney is a plus in my book. Fuck Disney from the bottom of my heart.",
            "title_similarity": "0.5738788",
            "sentiment_compound": -0.1531
        },
        {
            "id": "gwb5v67",
            "score": 1,
            "text": "Wasn’t this also back when most studios didn’t like the idea of a trilogy because of the cost? I remember an interview that Peter Jackson did where he said most of the studios wanted to condense them into one movie but he wanted it to be the trilogy.",
            "title_similarity": "0.70878357",
            "sentiment_compound": 0.222
        },
        {
            "id": "gwb5wei",
            "score": 1,
            "text": "In fairness though, I feel like there are a lot of movie rights that mainstream companies sell off because they don't think it's profitable?  Maybe I'm wrong, but every once in awhile they will make a mistake and sell the rights to a movie that hits it big time.",
            "title_similarity": "0.73786086",
            "sentiment_compound": -0.6253
        },
        {
            "id": "gwb5wyt",
            "score": 1,
            "text": "Let's 👏 stop 👏 caring 👏 about 👏 billionaires",
            "title_similarity": "0.4584908",
            "sentiment_compound": 0.25
        },
        {
            "id": "gwb5zbz",
            "score": 1,
            "text": "Disney: “and I took that personally.”\n\nWent on to buy Lucas Film and Marvel.\n\nAn even bigger mistake for Disney was blowing a deal on the Harry Potter franchise. So much so that they even tried buying scholastic I believe after the first movies success.",
            "title_similarity": "0.7414769",
            "sentiment_compound": 0.6249
        },
        {
            "id": "gwb60kw",
            "score": 2,
            "text": "I’m so glad these movies were not Disney.",
            "title_similarity": "0.5034063",
            "sentiment_compound": 0.5095
        },
        {
            "id": "gwb64ny",
            "score": 1,
            "text": "Tolkien actually put in his testament that his works may never be used by Disney",
            "title_similarity": "0.57641304",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwb68vl",
            "score": 1,
            "text": "I’m glad the stupid Disney didn’t take over. I hate how itv ruins franchises for the sake of cultural appropriation and pg-13. Disney sucks.",
            "title_similarity": "0.5793346",
            "sentiment_compound": -0.8591
        },
        {
            "id": "gwb692e",
            "score": 1,
            "text": "Didn't Tolkien say that Disney would never produce any of his work?",
            "title_similarity": "0.50468385",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwb6934",
            "score": 2,
            "text": "Thank goodness for that too. Miramax only wanted two films. It was New Line who decided to make three like the books",
            "title_similarity": "0.56825536",
            "sentiment_compound": 0.7906
        },
        {
            "id": "gwb6c2c",
            "score": 1,
            "text": "Disney would’ve ruined it",
            "title_similarity": "0.45482802",
            "sentiment_compound": -0.4767
        },
        {
            "id": "gwb6dnp",
            "score": 1,
            "text": "Didn’t Tolkien refuse Disney the rights to any of his work for all time?",
            "title_similarity": "0.5575794",
            "sentiment_compound": -0.296
        },
        {
            "id": "gwb6njg",
            "score": 1,
            "text": "Hope someone got fired over that shitty business decision.",
            "title_similarity": "0.42111725",
            "sentiment_compound": -0.6486
        },
        {
            "id": "gwb732f",
            "score": 1,
            "text": "Disney having nothing to do with it is one of the best things to ever happen to those movies.",
            "title_similarity": "0.5392957",
            "sentiment_compound": 0.6369
        },
        {
            "id": "gwb74vj",
            "score": 1,
            "text": "shitty movie detail: harvey weinstein is a disney prince",
            "title_similarity": "0.50389826",
            "sentiment_compound": -0.5574
        },
        {
            "id": "gwb75qu",
            "score": 1,
            "text": "\"hey guys, we don't want to make this movie because it doesn't seem worth it, but we want YOU guys to make it, also you have to pay us.\"\n\n\nAm I the only one who doesn't understand this?",
            "title_similarity": "0.6050721",
            "sentiment_compound": -0.1516
        },
        {
            "id": "gwb77v2",
            "score": 1,
            "text": "When I see things like \"they demanded ten million and missed out on a cool billion\", I always wonder about the person who made the decisions.\n\nDo they get a raise for getting ten million dollars for no work at all, or do they get fired ten years later for making the wrong decision in the fullness of time?\n\nOr is them just the breaks and they keep looking forward?",
            "title_similarity": "0.74173033",
            "sentiment_compound": -0.8205
        },
        {
            "id": "gwb78c7",
            "score": 4,
            "text": "[removed]",
            "title_similarity": "-0.01972133"
        },
        {
            "id": "gwb79d2",
            "score": 1,
            "text": "What's turnaround costs?",
            "title_similarity": "0.1736541",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwb7coc",
            "score": 1,
            "text": "He was in my movie 'Lord of the Schwing' but he didn't like doing the sex scene with the Ballsrog.",
            "title_similarity": "0.6069567",
            "sentiment_compound": -0.395
        },
        {
            "id": "gwb7gqt",
            "score": 2,
            "text": "It's one of many examples where a mountain of highly educated and intelligent people made a market call that ended up wrong.\n\nThis does not mean that educated and intelligent people are wrong generally or even most of the time.  It just means that on a particular issue they gambled wrong when they (probably) reasonably believed the odds were strongly on their side.  And that makes it a fun story, but not something to live or invest by.",
            "title_similarity": "0.5717175",
            "sentiment_compound": 0.1734
        },
        {
            "id": "gwb7lp6",
            "score": 2,
            "text": "If Disney would have taken over I’m sure we would have like 26 spin-offs on Disney+ by now",
            "title_similarity": "0.5678816",
            "sentiment_compound": 0.5859
        },
        {
            "id": "gwb88w5",
            "score": 1,
            "text": "Poor Disney, however will they recover.",
            "title_similarity": "0.46250284",
            "sentiment_compound": -0.4767
        },
        {
            "id": "gwb8cnb",
            "score": 5,
            "text": "Tbh thank god disney didn't get their hands on it, it probably would have resemble the hobbit but with worse forced humor and so many cute tiny goblins for plushies that half the screen would be constantly covered. not that that was disney back in the early 2000s but lets face it they drive franchises into the ground. its what disney does.",
            "title_similarity": "0.7066965",
            "sentiment_compound": 0.0561
        },
        {
            "id": "gwb8o27",
            "score": 3,
            "text": "And New Line Cinema still managed to go bankrupt after having made them. The Mouse always wins",
            "title_similarity": "0.5211183",
            "sentiment_compound": 0.0258
        },
        {
            "id": "gwb8xyo",
            "score": 1,
            "text": "Too bad for Disney. They could’ve really been something. /s",
            "title_similarity": "0.46848154",
            "sentiment_compound": -0.5423
        },
        {
            "id": "gwb91bh",
            "score": 2,
            "text": "Hah suck it disney",
            "title_similarity": "0.23823193",
            "sentiment_compound": -0.4404
        },
        {
            "id": "gwb9d76",
            "score": 2,
            "text": "That and Tolkien loathed disney.  He made sure they would never be able to touch his work in any capacity",
            "title_similarity": "0.44383225",
            "sentiment_compound": -0.2023
        },
        {
            "id": "gwb9db0",
            "score": 1,
            "text": "Take that rat !!!",
            "title_similarity": "0.07365866",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwb9g2j",
            "score": 1,
            "text": "Thank fuck they turned it down. There is a god 🙌",
            "title_similarity": "0.27041084",
            "sentiment_compound": 0.0258
        },
        {
            "id": "gwb9g8a",
            "score": 2,
            "text": "Thank fuck they turned it down. There is a god 🙌",
            "title_similarity": "0.27041084",
            "sentiment_compound": 0.0258
        },
        {
            "id": "gwb9ng4",
            "score": 1,
            "text": "& jackson kept the weinstein bros. at arms length because he knew the deal.",
            "title_similarity": "0.3537509",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwb9nsg",
            "score": 1,
            "text": "Letting LOTR slip through his fingers was one of the screw ups that leads to the ouster of Michael Eisner.",
            "title_similarity": "0.40733075",
            "sentiment_compound": -0.1027
        },
        {
            "id": "gwb9qt2",
            "score": 1,
            "text": "Cue Nelson from The Simpsons laughning while pointing at the mouse.",
            "title_similarity": "0.27533808",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwb9rh5",
            "score": 3,
            "text": "You would think after Star Wars, Titanic and Avatar that some \"genius\" in movies would figure it out.",
            "title_similarity": "0.5301869",
            "sentiment_compound": -0.5574
        },
        {
            "id": "gwb9s32",
            "score": 2,
            "text": "Thank god Disney didn’t get their claws into it",
            "title_similarity": "0.47058046",
            "sentiment_compound": 0.5574
        },
        {
            "id": "gwb9tcz",
            "score": 1,
            "text": ">names company after parents\n\n>company is now synonymous with the worst publicly exposed rapist in Hollywood",
            "title_similarity": "0.45911258",
            "sentiment_compound": -0.8834
        },
        {
            "id": "gwba0y1",
            "score": 1,
            "text": "Oops",
            "title_similarity": "-0.15690884",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwba2i2",
            "score": 2,
            "text": "Coulda shoulda woulda",
            "title_similarity": "0.023536846",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwba5r4",
            "score": 2,
            "text": "The mouse probably beat some poor soul to death for this sliparoo.",
            "title_similarity": "0.44127065",
            "sentiment_compound": -0.7906
        },
        {
            "id": "gwbag11",
            "score": 2,
            "text": "Honestly it wouldn't have been as good if it was done by Disney.",
            "title_similarity": "0.55326223",
            "sentiment_compound": 0.7096
        },
        {
            "id": "gwbahye",
            "score": 1,
            "text": "Fine with me, Disney has too much money.",
            "title_similarity": "0.4975655",
            "sentiment_compound": 0.2023
        },
        {
            "id": "gwbansp",
            "score": 1,
            "text": "I read through this whole article thinking there’s going to be a new Hobbit movie soon and wondering why there’s no mention of HW being in jail... until I realized it’s from 2013.",
            "title_similarity": "0.6408491",
            "sentiment_compound": -0.296
        },
        {
            "id": "gwbar5w",
            "score": 1,
            "text": "That’s not even a screen shot from The Lord of the Rings, that’s from The Hobbit.",
            "title_similarity": "0.3993862",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwbasu8",
            "score": 1,
            "text": "This is The Hobbit",
            "title_similarity": "0.15344088",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwbb9lj",
            "score": 1,
            "text": "Just finished d reading all three books so celebrated by watching Return of the King last night",
            "title_similarity": "0.43229407",
            "sentiment_compound": 0.6948
        },
        {
            "id": "gwbbg3s",
            "score": 2,
            "text": "What a distant world Disney execs live in where they can turn down a movie and still make $10M from it.",
            "title_similarity": "0.7926022",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwbbj4t",
            "score": 1,
            "text": "Well I guess Disney probably doesn't need that extra $2.9B",
            "title_similarity": "0.68968266",
            "sentiment_compound": 0.2732
        },
        {
            "id": "gwbbmc0",
            "score": 1,
            "text": "And they still claimed in court that the films weren't profitable.",
            "title_similarity": "0.4243957",
            "sentiment_compound": -0.3412
        },
        {
            "id": "gwbbtl7",
            "score": 1,
            "text": "God forbid they waste money on the rights to some old book when they could infinitely milk franchises that last forever like Star Wars and the Simpsons",
            "title_similarity": "0.7097",
            "sentiment_compound": -0.6249
        },
        {
            "id": "gwbbyh5",
            "score": 1,
            "text": "The picture is of the hobbit and the thread is about lord of the rings.",
            "title_similarity": "0.39266378",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwbc1mt",
            "score": 1,
            "text": "NLC Accountants:  What are you talking about?? it Grossed Nothing!",
            "title_similarity": "0.40028834",
            "sentiment_compound": -0.2621
        },
        {
            "id": "gwbclfn",
            "score": 9,
            "text": "After the way Disney handled Star Wars I’m kinda thankful they missed out on LoTR.",
            "title_similarity": "0.6468943",
            "sentiment_compound": -0.2799
        },
        {
            "id": "gwbcm2u",
            "score": 1,
            "text": "So thats why the Weinstein’s are credited as producers…",
            "title_similarity": "0.28109965",
            "sentiment_compound": 0.3612
        },
        {
            "id": "gwbcmod",
            "score": 1,
            "text": "When the Fellowship of the Ring came out, I didn't have high expectations for it. I have been a fan of high fantasy books since childhood, but, with few exceptions, fantasy movies were usually awful. I was completely amazed at how well these were done, and absolutely loved them!",
            "title_similarity": "0.5754865",
            "sentiment_compound": 0.9026
        },
        {
            "id": "gwbcppm",
            "score": 1,
            "text": "Yet they still pay the CEO and other top Executives many millions of dollars yearly..plus huge multi $$$$ bonuses 🤔",
            "title_similarity": "0.50412464",
            "sentiment_compound": 0.743
        },
        {
            "id": "gwbcrlb",
            "score": 1,
            "text": "Lindsay Ellis has a great YouTube trilogy series on The Hobbit and one of the videos talks about how the LOTR series had just one/two studios that they owed money to, and the Hobbit series had 5 studios, hence why they stretched that series into 3 movies.",
            "title_similarity": "0.6268954",
            "sentiment_compound": 0.6249
        },
        {
            "id": "gwbcsdq",
            "score": 1,
            "text": "Okay, but could you imagine what would have happened if Disney got its grubby hands all over LOTR?",
            "title_similarity": "0.48559988",
            "sentiment_compound": 0.1154
        },
        {
            "id": "gwbd4fv",
            "score": 1,
            "text": "I would say Disney has learned from its mistakes",
            "title_similarity": "0.40665653",
            "sentiment_compound": -0.3612
        },
        {
            "id": "gwbd4vu",
            "score": 2,
            "text": "Which makes me wonder why they changed the “recipe” for hobbit. The lord of the rings was a such a beautiful and captivating movie precisely because they used cgi sparingly(compared to the hobbit) the massive army’s of actors in orc makeup, the urakai makeup, the huge legions of horses and men and elves. It felt so real, than the hobbit just went and decided cgi was the way to go and ruined what could have been a perfect saga",
            "title_similarity": "0.6611339",
            "sentiment_compound": 0.7783
        },
        {
            "id": "gwbd6zj",
            "score": 1,
            "text": "Why is the screenshot of The Hobbit?",
            "title_similarity": "0.32996333",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwbd9hw",
            "score": 11,
            "text": "I always imagined that the Miramax executive who made that decision was later led out the back door, shot and buried in a shallow grave. ;-)\n\nThe first movie paid for the whole trilogy and already made a profit. Part 2 and 3 was just free stacks of money.\n\nAnd it wasn't hard to predict that any decent LOTR production would be a success. It had an existing fan base spanning several generations.",
            "title_similarity": "0.70706135",
            "sentiment_compound": 0.8978
        },
        {
            "id": "gwbd9z9",
            "score": 2,
            "text": "As much as I love Disney, I can’t imagine a scenario where LOTR comes out better. Whenever they decide to remake it, if I’m alive, the original cast will never be topped, it’s as if they all were born for those roles",
            "title_similarity": "0.6351527",
            "sentiment_compound": 0.9001
        },
        {
            "id": "gwbdb73",
            "score": 1,
            "text": "Personally, I think that there is a little too much fantasy. I like The Chronicles of Narnia better. I think it is more \"realistic.\"",
            "title_similarity": "0.38748747",
            "sentiment_compound": 0.6597
        },
        {
            "id": "gwbdbi8",
            "score": 1,
            "text": "Thank god there's at least one successful franchise that's safe from Disnification.",
            "title_similarity": "0.28718373",
            "sentiment_compound": 0.8834
        },
        {
            "id": "gwbdcvd",
            "score": 2,
            "text": "Good. Fuck Disney",
            "title_similarity": "0.22637975",
            "sentiment_compound": -0.1531
        },
        {
            "id": "gwbdfyy",
            "score": 3,
            "text": "That would have been against Tolkien’s wishes when they first talked about making an animated movie, he writes about it in his letters “nothing Disney”",
            "title_similarity": "0.67645955",
            "sentiment_compound": 0.1531
        },
        {
            "id": "gwbdl9q",
            "score": 2,
            "text": "Disney would have made the trilogy shit.",
            "title_similarity": "0.55518055",
            "sentiment_compound": -0.5574
        },
        {
            "id": "gwbdor0",
            "score": 1,
            "text": "LOTR produced by Kathleen Kennedy. Turns out Frodo is the love-child of Galadriel and Arwen...",
            "title_similarity": "0.26445907",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwbdyly",
            "score": 1,
            "text": "Disney was smart because apparently the lord of the rings movies were huge financial losses for New Line. Gotta love Hollywood accounting.",
            "title_similarity": "0.7185021",
            "sentiment_compound": 0.7579
        },
        {
            "id": "gwbdyr5",
            "score": 1,
            "text": "Whoops.",
            "title_similarity": "-0.13408974",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwbe275",
            "score": 1,
            "text": "Stupid mouse",
            "title_similarity": "0.14552045",
            "sentiment_compound": -0.5267
        },
        {
            "id": "gwbe50i",
            "score": 1,
            "text": "Disney made the right decision at the time. Peter Jackson didnt have anything big on his filmography and he wanted to film an epic trilogy concurrently. LotR is a sword and sorcery high fantasy story and that genre didnt typically do well at the box office. It was a huge gamble. There was a good chance that at least one movie wasnt going to perform well, if not all, and it could have sunk the whole trilogy.\n\nNobody could have predicted during development how successful it was going to be.",
            "title_similarity": "0.77410686",
            "sentiment_compound": 0.883
        },
        {
            "id": "gwbe91x",
            "score": 1,
            "text": "They sure Gollum'd that one",
            "title_similarity": "-0.024242403",
            "sentiment_compound": 0.3182
        },
        {
            "id": "gwbef93",
            "score": 6,
            "text": "\"People just don't like Fantasy or Sci-Fi movies! We need more buddy-cop movies and outrageous young adult comedies! - Somebody at Miramax arguing with Disney in 2000 presumably",
            "title_similarity": "0.73000515",
            "sentiment_compound": -0.7179
        },
        {
            "id": "gwbegp0",
            "score": 1,
            "text": "Hi",
            "title_similarity": "-0.20689611",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwbehfy",
            "score": 1,
            "text": "If Disney has this, would they have still bought Marvel down the line?\n\nWould we have had the same production team?",
            "title_similarity": "0.6529397",
            "sentiment_compound": 0.4871
        },
        {
            "id": "gwbexoz",
            "score": 3,
            "text": "\"Will\" later on? Can you read the future? Jesus Christmas sort your tenses out.",
            "title_similarity": "0.42796904",
            "sentiment_compound": -0.3094
        },
        {
            "id": "gwbf62h",
            "score": 3,
            "text": "To be fair Disney prob would have fuckes it up like they do with most things",
            "title_similarity": "0.47139114",
            "sentiment_compound": 0.5859
        },
        {
            "id": "gwbfccl",
            "score": 1,
            "text": "2.9B for a whole trilogy looks almost quaint after the last few years of mega-blockbuster monsters like Avatar, Avengers and Star Wars…",
            "title_similarity": "0.6080668",
            "sentiment_compound": 0.3612
        },
        {
            "id": "gwbfeyl",
            "score": 1,
            "text": "I wonder if they got fired?",
            "title_similarity": "0.2120556",
            "sentiment_compound": -0.5574
        },
        {
            "id": "gwbfjtf",
            "score": 1,
            "text": "Didn't these films basically save New Line from folding? I recall some article around release of the first film that described some executive weeping with relief after screening it in advance.",
            "title_similarity": "0.611296",
            "sentiment_compound": 0.5267
        },
        {
            "id": "gwbfl0a",
            "score": 1,
            "text": "And if I know anything about movie box offices, they were only BARELY able to pay back 10 million.",
            "title_similarity": "0.71710247",
            "sentiment_compound": -0.2013
        },
        {
            "id": "gwbg2qi",
            "score": 2,
            "text": "WB has Pinky and the Brain.",
            "title_similarity": "0.12521762",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwbg6l3",
            "score": 1,
            "text": "m",
            "title_similarity": "-0.19837569",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwbgzsu",
            "score": 1,
            "text": "good, Tom Bombadil wouldve made the disney cut along with those lame musical scenes",
            "title_similarity": "0.59282374",
            "sentiment_compound": -0.25
        },
        {
            "id": "gwbh0gt",
            "score": 1,
            "text": "r/LOTRMemes intensifies",
            "title_similarity": "-0.0024936702",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwbh3wi",
            "score": 1,
            "text": "So *that's* why Disney are so strapped for cash!",
            "title_similarity": "0.53205645",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwbh4r1",
            "score": 1,
            "text": "Reminds me of how the studios gave George Lucas all the merchandising rights in exchange for a big pay cut. One of the worst deals ever on the studios part, great deal for Lucas",
            "title_similarity": "0.6671991",
            "sentiment_compound": -0.3612
        },
        {
            "id": "gwbhoan",
            "score": 1,
            "text": "Disney’s response: jeremyclarkohnoanyway.jpg",
            "title_similarity": "0.34949023",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwbhzmu",
            "score": 1,
            "text": "Fudge Disney.",
            "title_similarity": "0.25901055",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwbif09",
            "score": 1,
            "text": "Guess we won’t ever get the Shire at Disneyland",
            "title_similarity": "0.48614228",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwbj5yj",
            "score": 1,
            "text": "That guy got so fired",
            "title_similarity": "0.16597873",
            "sentiment_compound": -0.6825
        },
        {
            "id": "gwbj87r",
            "score": 2,
            "text": "That trilogy is going to continue printing money for decades. It doesn't have any cultural reference to age it, and even its special effects have aged well in a way that is essentially unique for movies of their generation. I really think the trilogy is going to have legs comparable to movies like Lawrence of Arabia, A Clockwork Orange, or Casablanca.",
            "title_similarity": "0.71901757",
            "sentiment_compound": 0.743
        },
        {
            "id": "gwbjeik",
            "score": 1,
            "text": "Same is true with Disney and Harry Potter",
            "title_similarity": "0.2411075",
            "sentiment_compound": 0.4215
        },
        {
            "id": "gwbjkvf",
            "score": 2,
            "text": "Tolkien is said to have no let Disney have the rights to Ring stories as he wanted it to be for adults as well as younger fans and thought Disney would ruin it.",
            "title_similarity": "0.6671594",
            "sentiment_compound": -0.5994
        },
        {
            "id": "gwbjpk7",
            "score": 1,
            "text": "Miramax also got 5% of gross with 2.5% of that directly to the Weinstein bros. With a gross of 2.9B that’s about 72.5 million or 36.25 per brother for a property they passed on so I don’t think they were too upset.",
            "title_similarity": "0.69177514",
            "sentiment_compound": -0.8316
        },
        {
            "id": "gwbjwqi",
            "score": 1,
            "text": "I mean it was pretty pricey for a genre that never really made that kind of money before LOTR. Especially funding the full trilogy before seeing how successful the first movie will be.",
            "title_similarity": "0.70870113",
            "sentiment_compound": 0.7906
        },
        {
            "id": "gwbk1w3",
            "score": 1,
            "text": "I have a feeling that disney’s executive meddling would have ruined the movies",
            "title_similarity": "0.5727554",
            "sentiment_compound": -0.3818
        },
        {
            "id": "gwbkbrh",
            "score": 1,
            "text": "Thanks for your good work done ✅",
            "title_similarity": "0.05775322",
            "sentiment_compound": 0.7003
        },
        {
            "id": "gwbkce8",
            "score": 1,
            "text": "Elijah Wood would have been a fine Disney Princess...",
            "title_similarity": "0.3591834",
            "sentiment_compound": 0.2023
        },
        {
            "id": "gwbkhbw",
            "score": 1,
            "text": "In one of the Spider-Man NWH timelines, Disney owns LOTR, Marvel, Star Wars, Fox, Sony, and they’re close to having all infinity stones.",
            "title_similarity": "0.4918486",
            "sentiment_compound": -0.2023
        },
        {
            "id": "gwbkhw7",
            "score": 1,
            "text": "According to the book DisneyWar losing LOTR, Lizzie McGuire, and the chance of losing Pixar were contributing reasons to the ousting of Eisner.",
            "title_similarity": "0.6118109",
            "sentiment_compound": -0.4939
        },
        {
            "id": "gwbl14c",
            "score": 1,
            "text": "Meh, it'll be a Disney property regardless, when they acquire Warner Brothers some day.",
            "title_similarity": "0.5188949",
            "sentiment_compound": -0.0772
        },
        {
            "id": "gwbl9i0",
            "score": 1,
            "text": "It still costs a fucking shit ton of money to make those movies. Peter Jackson must have had some sales pitch to get that production made.",
            "title_similarity": "0.70092326",
            "sentiment_compound": -0.5984
        },
        {
            "id": "gwbltx0",
            "score": 2,
            "text": "Thank god Disney didn’t take it and ruin it like everything else they touch",
            "title_similarity": "0.5703234",
            "sentiment_compound": 0.3182
        },
        {
            "id": "gwblwh3",
            "score": 1,
            "text": "And I bet they are still saying it was produced at loss",
            "title_similarity": "0.15876245",
            "sentiment_compound": -0.3182
        },
        {
            "id": "gwblww6",
            "score": 1,
            "text": "the article starts by saying next time you go to lunch have harvey weinstein pick up the tab... ya that's what i'll be worried about if i'm out to lunch with harvey... the tab..",
            "title_similarity": "0.4976399",
            "sentiment_compound": -0.296
        },
        {
            "id": "gwbmdno",
            "score": 3,
            "text": "I wonder what Tolkien would have thought of the films being released by Disney.  Hmm..",
            "title_similarity": "0.5828048",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwbmp3j",
            "score": 1,
            "text": "There's a great video series of interviews with Jackson and all of the crew that filmed LOTR, on YT. Miramax offered Jackson funds for two movies, and when things were grinding to a halt (because shaving off one entire movie from the script was an enormous endeavour) New Line said they would like to have a chat with Jackson's team. They had to nail a contract for three movies, since Miramax already was offering a duology.\n\nReally interesting stuff, it gives an incredible insight into how things developed into what we know today.",
            "title_similarity": "0.6734048",
            "sentiment_compound": 0.8622
        },
        {
            "id": "gwbmycg",
            "score": 1,
            "text": "Haha.  F you disney",
            "title_similarity": "0.22275038",
            "sentiment_compound": 0.4588
        },
        {
            "id": "gwbne83",
            "score": 1,
            "text": "Somebody do the math! How much did it cost em?",
            "title_similarity": "0.3352443",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwbnn6h",
            "score": 1,
            "text": "Imagine a Middle Earth area at Disneyland though.",
            "title_similarity": "0.39521912",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwbnr13",
            "score": 1,
            "text": "So glad this epic trilogy wasn’t ruined by Disney",
            "title_similarity": "0.47383082",
            "sentiment_compound": 0.0498
        },
        {
            "id": "gwbntos",
            "score": 1,
            "text": "You mean I could've been watching LOTR on fucking Disney+? Fuck",
            "title_similarity": "0.5586386",
            "sentiment_compound": -0.5829
        },
        {
            "id": "gwbo77g",
            "score": 1,
            "text": "Dodged a bullet there.. Disney would have ruined it..",
            "title_similarity": "0.5204077",
            "sentiment_compound": -0.4767
        },
        {
            "id": "gwbo84w",
            "score": 1,
            "text": "Yet this is a scene from The Hobbit",
            "title_similarity": "0.19243623",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwbocb6",
            "score": 1,
            "text": "Good! Disney is too much a behemoth without.",
            "title_similarity": "0.44824615",
            "sentiment_compound": 0.4926
        },
        {
            "id": "gwbom9y",
            "score": 1,
            "text": "[Lindsay Ellis has a good little series of videos](https://youtube.com/playlist?list=PLJGOq3JclTH9wzYgtCfo8QwXPj51NaPRD) on the LOTR trilogy I love rewatching from time to time",
            "title_similarity": "0.31508464",
            "sentiment_compound": 0.7964
        },
        {
            "id": "gwboxiw",
            "score": 1,
            "text": "Three of the best movies ever made, too.\n\nMy pre-teen years are studded with memories of reading the books and then watching the movies. It was a wonderful light during shitty childhood years.",
            "title_similarity": "0.50482714",
            "sentiment_compound": 0.6486
        },
        {
            "id": "gwbpf1u",
            "score": 1,
            "text": "Nearly bankrupted New Line.  There studio’s existence became dependent on the success of LoTR.",
            "title_similarity": "0.51989436",
            "sentiment_compound": 0.5719
        },
        {
            "id": "gwbpsyh",
            "score": 1,
            "text": "To be fair... They took a huge gamble on LOTR. What other big fantasy sword and sorcery epics were released before it? Well, in 1999 there was Beowulf starring Christopher Lambert. Which failed horribly. \n\nSo yeah, hindsight is fantastic. But Peter Jackson had hardly proven himself. Yeah, he'd made The Frighteners (1996) but that was a much smaller production. Only about 1/3 the budget for Fellowship. They had no idea he'd knock it out the park like he did. \n\nEven going back now and looking at how worried people were about the movies being loyal to the source material, I even remember seeing it in Cinema's and other people who didn't know about the books getting really upset that the film didn't have an ending.",
            "title_similarity": "0.7892041",
            "sentiment_compound": 0.6263
        },
        {
            "id": "gwbq46i",
            "score": 1,
            "text": "So...\n\nWas Scott Norwood making these decisions?",
            "title_similarity": "0.10237652",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwbqqj1",
            "score": 1,
            "text": "Good Disney don’t need it",
            "title_similarity": "0.36678892",
            "sentiment_compound": 0.4404
        },
        {
            "id": "gwbr497",
            "score": 1,
            "text": "I'm glad Disney got fucked, it doesn't happen enough.",
            "title_similarity": "0.5017763",
            "sentiment_compound": -0.34
        },
        {
            "id": "gwbr9ab",
            "score": 2,
            "text": "And subsequently, Disney bought both marvel and star wars. Sounds like they learned a lesson about nerd money.",
            "title_similarity": "0.668682",
            "sentiment_compound": -0.128
        },
        {
            "id": "gwbrl1r",
            "score": 1,
            "text": "For reference, Fellowship came out one year after the Dungeons and Dragons movie.",
            "title_similarity": "0.5677234",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwbroxs",
            "score": 2,
            "text": "Disney would have ruined the fuck out of it",
            "title_similarity": "0.50179464",
            "sentiment_compound": -0.765
        },
        {
            "id": "gwbrvte",
            "score": 1,
            "text": "Tolkien was actually deeply opposed to Disney ever adapting his work. He hated the Disney fantasy films like Cinderella or Snow White.",
            "title_similarity": "0.54823166",
            "sentiment_compound": -0.4019
        },
        {
            "id": "gwbs9vm",
            "score": 1,
            "text": "Interesting",
            "title_similarity": "-0.14186665",
            "sentiment_compound": 0.4019
        },
        {
            "id": "gwbshrs",
            "score": 1,
            "text": "I think harvey weinstein just wasn't into frodo",
            "title_similarity": "0.35667193",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwbss27",
            "score": 2,
            "text": "Hahahahaha fuck you Miramax and fuck Harvey Weinstein.",
            "title_similarity": "0.33755946",
            "sentiment_compound": -0.7906
        },
        {
            "id": "gwbssp9",
            "score": 1,
            "text": "Good thing. I am tired of Disney taking up all the sci fi franchises",
            "title_similarity": "0.55036616",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwbsym5",
            "score": 2,
            "text": "That thumbnail is from the hobbit.",
            "title_similarity": "0.33760962",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwbtip3",
            "score": 1,
            "text": "And that ladies and gentlemen is what is referred to as \n\n\n\n“Roads Go Ever On",
            "title_similarity": "-0.0032722196",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwbtq1c",
            "score": 3,
            "text": "I think Disney was too focused on their Air Buddies movies at this time.",
            "title_similarity": "0.6094164",
            "sentiment_compound": 0.3818
        },
        {
            "id": "gwbu365",
            "score": 2,
            "text": "Poor Disney",
            "title_similarity": "0.2612977",
            "sentiment_compound": -0.4767
        },
        {
            "id": "gwburmw",
            "score": 1,
            "text": "Who bought the original Lord of the Rings, the cartoon version from 1978 which was proper scary in a pre-CGI world?",
            "title_similarity": "0.5896338",
            "sentiment_compound": -0.2263
        },
        {
            "id": "gwbuz8s",
            "score": 1,
            "text": "I’m glad, I bet if Disney was on charge they wouldn’t be the same movies we love and know now.",
            "title_similarity": "0.63622713",
            "sentiment_compound": 0.802
        },
        {
            "id": "gwbv0ld",
            "score": 2,
            "text": "This will always go down in history as Weinstein’s second biggest fuck up",
            "title_similarity": "0.43986934",
            "sentiment_compound": -0.5423
        },
        {
            "id": "gwbvfhg",
            "score": 1,
            "text": "Man I wish my money \"mistakes\" netted me 10 million.",
            "title_similarity": "0.6412328",
            "sentiment_compound": 0.0516
        },
        {
            "id": "gwbvtuy",
            "score": 3,
            "text": "Also, Harvey Weinstein demanded that they take their planned two movies and condense the entire trilogy into a single film, which Peter Jackson balked at. New Line went in the opposite direction, asking for an entire trilogy.",
            "title_similarity": "0.70108473",
            "sentiment_compound": -0.2263
        },
        {
            "id": "gwbvy6i",
            "score": 1,
            "text": "Ez clap",
            "title_similarity": "-0.056563508",
            "sentiment_compound": 0.3612
        },
        {
            "id": "gwbvzm9",
            "score": 1,
            "text": "just imagine the rides at Disney parks we could have gotten",
            "title_similarity": "0.3563466",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwbw03d",
            "score": 2,
            "text": "It would have sucked if this happened.",
            "title_similarity": "0.24663225",
            "sentiment_compound": -0.4588
        },
        {
            "id": "gwbw2rx",
            "score": 3,
            "text": "Also that Tolkien specifically stated he didn't want Disney touching any of his work for filming. He despises them. [http://tolkiengateway.net/wiki/The\\_Walt\\_Disney\\_Company](http://tolkiengateway.net/wiki/The_Walt_Disney_Company)",
            "title_similarity": "0.55222017",
            "sentiment_compound": -0.4976
        },
        {
            "id": "gwbwdp3",
            "score": 3,
            "text": "Good. Tolkien hated Disney.",
            "title_similarity": "0.3760956",
            "sentiment_compound": -0.3182
        },
        {
            "id": "gwbwhkl",
            "score": 2,
            "text": "Such a shame. Tiny little company like Disney could have really used that revenue",
            "title_similarity": "0.55731773",
            "sentiment_compound": -0.2212
        },
        {
            "id": "gwbwivn",
            "score": 6,
            "text": "I wonder if this is why Disney went balls out with the Marvel and Star Wars acquisitions",
            "title_similarity": "0.60173124",
            "sentiment_compound": -0.2023
        },
        {
            "id": "gwbwlht",
            "score": 2,
            "text": "Disney is printing money, I’m sure they don’t give a fuck. And if they really cared they would just go buy it.",
            "title_similarity": "0.66281813",
            "sentiment_compound": 0.2247
        },
        {
            "id": "gwbwsy8",
            "score": 8,
            "text": "It wouldn’t have been the same movie – Disney would’ve had their fingers all over the script\n\nit would have been unrecognizable",
            "title_similarity": "0.63920397",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwbwzqk",
            "score": 1,
            "text": "Yikes that's crazy",
            "title_similarity": "-0.030898608",
            "sentiment_compound": -0.34
        },
        {
            "id": "gwbx8zv",
            "score": 1,
            "text": "Ian would have played a great dumbledore",
            "title_similarity": "0.29020655",
            "sentiment_compound": 0.7579
        },
        {
            "id": "gwbxs3g",
            "score": 3,
            "text": "An article about the LOTR trilogy that has a picture from The Hobbit as its cover.... smh....",
            "title_similarity": "0.3849487",
            "sentiment_compound": -0.3182
        },
        {
            "id": "gwby26b",
            "score": 1,
            "text": "And Disney never recovered....",
            "title_similarity": "0.33505163",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwby8em",
            "score": 3,
            "text": "i'm glad , disney is just a conveyor belt of movies, devoid of creativity - they would've probably negatively interfered with peter jackson's vision.",
            "title_similarity": "0.6028408",
            "sentiment_compound": 0.765
        },
        {
            "id": "gwby9j0",
            "score": 1,
            "text": "Let's be grateful that we never got a Beatles adaptation of this movie.",
            "title_similarity": "0.5651937",
            "sentiment_compound": 0.4588
        },
        {
            "id": "gwbyguu",
            "score": 1,
            "text": "But how much money did they save by not funding box-office duds?  Looking at the flop that was *Dungeons and Dragons* in 2000, maybe the decision wasn't necessarily so bad.",
            "title_similarity": "0.76559424",
            "sentiment_compound": -0.7216
        },
        {
            "id": "gwbyhgv",
            "score": 2,
            "text": "I hate that it was a trilogy. Studios were still so obsessed back then with being able to turn a trilogy, mostly due to the success of Star Wars and The Godfather. They could have made a dozen movies out of all the content that wasn't included. Hell how many Fast movies are we up to now?",
            "title_similarity": "0.7068294",
            "sentiment_compound": -0.2908
        },
        {
            "id": "gwbzfey",
            "score": 1,
            "text": "Good! Fuck Disney",
            "title_similarity": "0.24037321",
            "sentiment_compound": -0.2244
        },
        {
            "id": "gwc0i5z",
            "score": 1,
            "text": "Eeeeevreybody made money on LOTR.\n\nExcept the actors.",
            "title_similarity": "0.4641077",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwc0ik1",
            "score": 1,
            "text": "Thank God. Disney would've ruined it.",
            "title_similarity": "0.45639378",
            "sentiment_compound": 0.128
        },
        {
            "id": "gwc1ba0",
            "score": 1,
            "text": "I'm glad it worked out the way it did. Disney influence would have ruined it.",
            "title_similarity": "0.4390282",
            "sentiment_compound": -0.0258
        },
        {
            "id": "gwc1dnw",
            "score": 1,
            "text": "I always tease my wife who loves LOTR but isn't into horror films when the New Line Cinema logo pops up I'm always like \"There it is the house that Freddy built.. ya know if it wasn't for Nightmare on Elm St. this film wouldn't exist so your welcome.\"",
            "title_similarity": "0.6442498",
            "sentiment_compound": 0.9241
        },
        {
            "id": "gwc1zzm",
            "score": 1,
            "text": "The bean counters strike again. Film at 11.",
            "title_similarity": "0.41110986",
            "sentiment_compound": -0.128
        },
        {
            "id": "gwc2h55",
            "score": 1,
            "text": "It's because they were high quality. Not really Disney's MO",
            "title_similarity": "0.42454576",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwc2wco",
            "score": 1,
            "text": "Imagine Middle-Earth at the theme parks. Damn",
            "title_similarity": "0.35731307",
            "sentiment_compound": -0.4019
        },
        {
            "id": "gwc33yn",
            "score": 1,
            "text": "Nice hobbit photo for LOTR",
            "title_similarity": "0.27107388",
            "sentiment_compound": 0.4215
        },
        {
            "id": "gwc3do0",
            "score": 1,
            "text": "Should be under r/facepalm.  Mickey Mouse doing it to be exact.  I mean they must be feeling pretty Goofy about this.  \n\n*putting on jacket and walking out door*",
            "title_similarity": "0.41514045",
            "sentiment_compound": 0.5719
        },
        {
            "id": "gwc3gcp",
            "score": 1,
            "text": "thank god Disney didnt get that IP, they would have ruined it for sure.",
            "title_similarity": "0.5567107",
            "sentiment_compound": 0.4215
        },
        {
            "id": "gwc3lso",
            "score": 2,
            "text": "I'm glad Disney didn't touch lotr. Look at what they did to Star Wars.",
            "title_similarity": "0.6460445",
            "sentiment_compound": -0.1531
        },
        {
            "id": "gwc42ax",
            "score": 1,
            "text": "O nos Disney doesn't own everything that sucks",
            "title_similarity": "0.40422085",
            "sentiment_compound": -0.3612
        },
        {
            "id": "gwc4azf",
            "score": 1,
            "text": "Damn that first sentence is cringe town",
            "title_similarity": "0.22202104",
            "sentiment_compound": -0.34
        },
        {
            "id": "gwc6xw7",
            "score": 1,
            "text": "OK why the pic is from Hobbit though?",
            "title_similarity": "0.32610583",
            "sentiment_compound": 0.4466
        },
        {
            "id": "gwc7emq",
            "score": 1,
            "text": "Oops",
            "title_similarity": "-0.15690884",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwc7izk",
            "score": 1,
            "text": "This is misleading though.  The LOTR produced & distributed by NLC grossed over $2.9B.  Who knows what the Disney version would have grossed.",
            "title_similarity": "0.7496328",
            "sentiment_compound": -0.5423
        },
        {
            "id": "gwc7k0q",
            "score": 1,
            "text": "Nice",
            "title_similarity": "-0.133546",
            "sentiment_compound": 0.4215
        },
        {
            "id": "gwc7vxk",
            "score": 1,
            "text": "To Balrog: my cut hash improved your voish..\"",
            "title_similarity": "0.2855971",
            "sentiment_compound": 0.25
        },
        {
            "id": "gwc7vzy",
            "score": 1,
            "text": "I'm so glad Disney didn't get their hands on it.",
            "title_similarity": "0.5042721",
            "sentiment_compound": 0.5095
        },
        {
            "id": "gwc83ky",
            "score": 1,
            "text": "Thank God Disney didn't release it.",
            "title_similarity": "0.44001427",
            "sentiment_compound": 0.5574
        },
        {
            "id": "gwc8lh1",
            "score": 1,
            "text": "And Disney never recovered from it financially.",
            "title_similarity": "0.46127325",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwc8t7q",
            "score": 1,
            "text": "Yeah yeah and if you had bought a back in time b you would have made c. Were always smarter back while having all the information.",
            "title_similarity": "0.47535673",
            "sentiment_compound": 0.7506
        },
        {
            "id": "gwcads3",
            "score": 1,
            "text": "Tolkien also insisted in his will that under no circumstances was Disney to be allowed to do anything to his books. He really didn't like Disney. So I think there may have been issues with his estate if Disney were involved",
            "title_similarity": "0.6320739",
            "sentiment_compound": -0.5556
        },
        {
            "id": "gwcaiwx",
            "score": 1,
            "text": "No one's going to point out that the thumbnail is from The Hobbit?",
            "title_similarity": "0.431807",
            "sentiment_compound": -0.296
        },
        {
            "id": "gwcb6tk",
            "score": 1,
            "text": "Damn. What happened to the company that passed? Has disney bounced back from this blunder?",
            "title_similarity": "0.54079694",
            "sentiment_compound": -0.4696
        },
        {
            "id": "gwcbzlk",
            "score": 2,
            "text": "I've bought the dvds, the extended dvds, the extended blurays and now that I have a 4k TV, I will pick up the extended 4k because apparently they're STUNNING.\n\nI regret nothing 😍",
            "title_similarity": "0.49610054",
            "sentiment_compound": -0.2375
        },
        {
            "id": "gwcc6cn",
            "score": 1,
            "text": "Sounds like Disney made 10 million to do nothing. Not a bad deal",
            "title_similarity": "0.6461458",
            "sentiment_compound": 0.0338
        },
        {
            "id": "gwccp3b",
            "score": 1,
            "text": "Haha fuck Disney",
            "title_similarity": "0.2869139",
            "sentiment_compound": -0.128
        },
        {
            "id": "gwccyh4",
            "score": 1,
            "text": "\"the best 10 million we've ever spent\"\n\nnew line cinema, probably.",
            "title_similarity": "0.6317202",
            "sentiment_compound": 0.6369
        },
        {
            "id": "gwce36f",
            "score": 1,
            "text": "It still got the Disney treatment by return of the king.",
            "title_similarity": "0.32270598",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwce4sr",
            "score": 1,
            "text": "...Film would later go on the be the most expensive human endeavor to make me bored.",
            "title_similarity": "0.5127348",
            "sentiment_compound": -0.2732
        },
        {
            "id": "gwcg0j3",
            "score": 1,
            "text": "Haha fuck you disney",
            "title_similarity": "0.27032295",
            "sentiment_compound": -0.128
        },
        {
            "id": "gwcg5fv",
            "score": 1,
            "text": "Will never happen to any IP ever again",
            "title_similarity": "0.28456846",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwcgfqc",
            "score": 1,
            "text": "Disney is so stupid sometimes, lol\n\nWon’t fund LOTR but goes all on crappy filmsm",
            "title_similarity": "0.60559887",
            "sentiment_compound": -0.7616
        },
        {
            "id": "gwcgljo",
            "score": 1,
            "text": "They’re not stealing jobs they’re stealing money from tax paying citizens figure it out idiot",
            "title_similarity": "0.53274703",
            "sentiment_compound": -0.6126
        },
        {
            "id": "gwcgufd",
            "score": 1,
            "text": "Disney would have ruined it somehow and it would have made 4b.",
            "title_similarity": "0.5640604",
            "sentiment_compound": -0.4767
        },
        {
            "id": "gwch53r",
            "score": 1,
            "text": "Good. If disney got their hands on it, we'd be buried in an onslaught of crappy spin offs and prequels that they'd load with fan service at every turn.",
            "title_similarity": "0.55395675",
            "sentiment_compound": 0.1531
        },
        {
            "id": "gwchh76",
            "score": 1,
            "text": "Disney afterward: Mistakes were made.\n\n&#x200B;\n\nDisney before the mcu: You want money for what now? Ha ha..we're not gonna \\*remembers the lord of the rings\\*....ok so i'mma just sign you a blank check.",
            "title_similarity": "0.6944434",
            "sentiment_compound": 0.0516
        },
        {
            "id": "gwchkhs",
            "score": 1,
            "text": "I’m glad Disney turn down the trilogy, The lord of the rings wouldn’t be such a masterpiece if it wasn’t for Peter Jackson",
            "title_similarity": "0.709908",
            "sentiment_compound": 0.7964
        },
        {
            "id": "gwchpyx",
            "score": 1,
            "text": "Who would have known that arguably the most popular and successful \"High Fantasy\" books ever written would be blockbuster movies? I mean it was shocking they did so well so I can understand why Disney/Miramax bailed (is a sarcasm tag really needed?).",
            "title_similarity": "0.71514016",
            "sentiment_compound": 0.8611
        },
        {
            "id": "gwci4vd",
            "score": 1,
            "text": "I can't imagine the theme park rides and TV shows Disney would've churned out with the Lord of the Rings IP",
            "title_similarity": "0.6295147",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwci7sv",
            "score": 1,
            "text": "Harvey Weinstein was at Miramax!",
            "title_similarity": "0.32625395",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwcicve",
            "score": 1,
            "text": "Disney = degenerate losers",
            "title_similarity": "0.35538074",
            "sentiment_compound": -0.5267
        },
        {
            "id": "gwcjcyz",
            "score": 1,
            "text": "And OP would eventually learn basic English grammar.",
            "title_similarity": "0.26234502",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwckeg9",
            "score": 1,
            "text": "Disney is literally one of the worst can't fail companies in existence, but everyone keeps riding the train! All aboard! They're also pretty much a monopoly, but ain't no one saying shit. Too busy counting money, I guess.",
            "title_similarity": "0.61998713",
            "sentiment_compound": 0.2122
        },
        {
            "id": "gwclbdd",
            "score": 1,
            "text": "One of my only good childhood memories came from going to theaters to watch lotr. Something that may be a thing in the past in 10-20 years time (going to a movie theater).",
            "title_similarity": "0.6170124",
            "sentiment_compound": 0.4404
        },
        {
            "id": "gwclk56",
            "score": 1,
            "text": "What does \"turnaround\" mean in this context?  \n ^^Sorry, ^^english ^^isn't ^^my ^^first ^^language",
            "title_similarity": "0.31805786",
            "sentiment_compound": -0.0772
        },
        {
            "id": "gwcmf41",
            "score": 1,
            "text": "What is turnaround costs? How can Disney who doesn’t want a movie get someone else to pay them for a movie that isn’t theirs to sell?",
            "title_similarity": "0.757643",
            "sentiment_compound": -0.1179
        },
        {
            "id": "gwcna3s",
            "score": 1,
            "text": "Didn’t they film all the movies at once to save on cost….",
            "title_similarity": "0.6563159",
            "sentiment_compound": 0.4939
        },
        {
            "id": "gwcnkir",
            "score": 1,
            "text": "Man... Disney could’ve done great things with it...",
            "title_similarity": "0.3983858",
            "sentiment_compound": 0.6249
        },
        {
            "id": "gwco1n9",
            "score": 1,
            "text": "haha classic!",
            "title_similarity": "0.0076314136",
            "sentiment_compound": 0.5093
        },
        {
            "id": "gwcpavv",
            "score": 1,
            "text": "Not to mention merch...",
            "title_similarity": "0.15463692",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwcpvhf",
            "score": 1,
            "text": "I'm disappointed that there's an image from the hobbit movie, those were an embarrassment to the original trilogy",
            "title_similarity": "0.5378332",
            "sentiment_compound": -0.5719
        },
        {
            "id": "gwcr8z3",
            "score": 1,
            "text": "Ha ha, up yours Disney!",
            "title_similarity": "0.20353134",
            "sentiment_compound": 0.4003
        },
        {
            "id": "gwcslx1",
            "score": 1,
            "text": "Disney is antiquated, they used to take some risks in the past, nowadays it’s about following the recipe. They’re lucky to have gotten $10m from passing on the LOTR franchise to Miramax.",
            "title_similarity": "0.8507741",
            "sentiment_compound": 0.1779
        },
        {
            "id": "gwct3ab",
            "score": 1,
            "text": "Good. F them greedy suits who care more about the money then the actual art.",
            "title_similarity": "0.45112574",
            "sentiment_compound": 0.5859
        },
        {
            "id": "gwcugt1",
            "score": 1,
            "text": "Luckily for you, You can watch The Black Cauldron.",
            "title_similarity": "0.13871904",
            "sentiment_compound": 0.5106
        },
        {
            "id": "gwcx5xl",
            "score": 1,
            "text": "Big oof",
            "title_similarity": "-0.031674262",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwcx9e8",
            "score": 1,
            "text": "Damn, what ever will Disney do????",
            "title_similarity": "0.39085713",
            "sentiment_compound": -0.5661
        },
        {
            "id": "gwcxn0b",
            "score": 1,
            "text": "Proof that Disney isn't perfect.  I like it.",
            "title_similarity": "0.31063664",
            "sentiment_compound": -0.6259
        },
        {
            "id": "gwcxpyy",
            "score": 2,
            "text": "Pretty sure Tolkien forbade Disney from having anything to do with the film rights. You don't piss off the Proff.",
            "title_similarity": "0.5458655",
            "sentiment_compound": 0.7755
        },
        {
            "id": "gwcy5a9",
            "score": 2,
            "text": "$5 says the accountants claim it didn’t make a profit when it comes to royalties.",
            "title_similarity": "0.5873732",
            "sentiment_compound": 0.4404
        },
        {
            "id": "gwcywec",
            "score": 1,
            "text": "More this weekend, they running the lord of the rings on cinemas here, I'ma watch it on the big screen finally",
            "title_similarity": "0.5825129",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwcywgk",
            "score": 2,
            "text": "The thing about being an investor is that sometimes you pass on opportunities because they are risky. Disney bank more winners than losers, but occasionally they’ll pass on something that wins.\n\nWhat we don’t hear much of are the failures and non starters that they passed on.\n\nI mean look at where New Line is now.",
            "title_similarity": "0.6363313",
            "sentiment_compound": 0.3214
        },
        {
            "id": "gwcz2i8",
            "score": 2,
            "text": "I thought jrr Tolkien stated in his last will that Disney should never be allowed to make LOTR movies",
            "title_similarity": "0.60577273",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwd0asl",
            "score": 1,
            "text": "Z",
            "title_similarity": "-0.12838101",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwd3pdt",
            "score": 1,
            "text": "Disney would of ruined it by reshoots, pore oversight and China editing what they don't like.",
            "title_similarity": "0.6199294",
            "sentiment_compound": -0.6381
        },
        {
            "id": "gwd3wgx",
            "score": 3,
            "text": "Don’t forget how the greedy shills at New Line Cinema tried to block Peter Jackson from doing a routine audit of the returns on LOTR, in the process trying to dupe him out of $100m that he was owed.",
            "title_similarity": "0.7259084",
            "sentiment_compound": -0.8225
        },
        {
            "id": "gwd4jqd",
            "score": 1,
            "text": "I can see it now - LOTR Disney-style. That would have sucked so much.",
            "title_similarity": "0.41115355",
            "sentiment_compound": -0.4588
        },
        {
            "id": "gwd63ka",
            "score": 1,
            "text": "Thank god!",
            "title_similarity": "-0.08772504",
            "sentiment_compound": 0.5983
        },
        {
            "id": "gwd8yek",
            "score": 1,
            "text": "Revenue well deserved. Those movies are timeless epic masterpieces which will always be appreciated.",
            "title_similarity": "0.32140625",
            "sentiment_compound": 0.836
        },
        {
            "id": "gwd9bzp",
            "score": 2,
            "text": "Iirc, Tolkien wrote it into his will that Disney may never be allowed to acquire his content, making this TIL not true.",
            "title_similarity": "0.600974",
            "sentiment_compound": -0.3252
        },
        {
            "id": "gwdb9lx",
            "score": 3,
            "text": "As we learned from Harry Shearer’s lawsuit, Hollywood accounting is pretty much bullshit from the ground up. They make it up as they go along, exclusively to benefit themselves.",
            "title_similarity": "0.6220683",
            "sentiment_compound": 0.128
        },
        {
            "id": "gwdbaa8",
            "score": 1,
            "text": "...fuck Disney...",
            "title_similarity": "0.27567506",
            "sentiment_compound": -0.5423
        },
        {
            "id": "gwdccoy",
            "score": 1,
            "text": "Very good",
            "title_similarity": "-0.099115916",
            "sentiment_compound": 0.4927
        },
        {
            "id": "gwddyt4",
            "score": 2,
            "text": "And each LoTR movie budget was around 95mil, absolutely nuts how amazing they did with so little compared to other big blockbusters",
            "title_similarity": "0.6424543",
            "sentiment_compound": 0.355
        },
        {
            "id": "gwdjt2j",
            "score": 2,
            "text": "Tolkien hated Walt Disney, so it's a good thing Disney didn't get their greedy paws on it.",
            "title_similarity": "0.58088636",
            "sentiment_compound": -0.0192
        },
        {
            "id": "gwdjunp",
            "score": 2,
            "text": "And now I need to watch it again",
            "title_similarity": "0.081316985",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwdnkjh",
            "score": 2,
            "text": "The stars that had to align for these movies leaves me in awe at the amount of dumb luck that made my favorite Trilogy of all time.",
            "title_similarity": "0.5385264",
            "sentiment_compound": 0.4019
        },
        {
            "id": "gwe34uj",
            "score": 2,
            "text": "It’s still one of my best movies.",
            "title_similarity": "0.2670991",
            "sentiment_compound": 0.6369
        },
        {
            "id": "gwejcmb",
            "score": 1,
            "text": "Well, it wouldn't have been film**s** under Miramax, they wanted it all in one film. When Jackson pitched two films (knowing that even that would be a pretty condensed version) they said no, that'll cost too much, and told him to check with other producers. New Line bought it, said \"well, it's three books, so why isn't it three films?\" and the rest is history.",
            "title_similarity": "0.7474105",
            "sentiment_compound": 0.7506
        },
        {
            "id": "gwejshg",
            "score": 1,
            "text": "I remember that tolkien didnt want disney to have right to his work?",
            "title_similarity": "0.572585",
            "sentiment_compound": -0.0572
        },
        {
            "id": "gwet3th",
            "score": 1,
            "text": "I work for Disney Sometimes....They Are Just a Bunch of Progresist Useless Losers Full of Mental Issues....Nothing Else....",
            "title_similarity": "0.45801812",
            "sentiment_compound": -0.7351
        },
        {
            "id": "gwf88ft",
            "score": 1,
            "text": "We could have had a Lord of the Rings world at a park by now?",
            "title_similarity": "0.40817648",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwmgqp8",
            "score": 1,
            "text": "ITT: people not only saying somehow everything they don't like about something Disney had a hand in would have applied to that version of the trilogy but doing so based on even current patterns as if it would have been made in the 2020s and not the early 00s (e.g. this was a time when the MCU wasn't a thing, Disney wouldn't have turned that three-installment story into a megafranchise)",
            "title_similarity": "0.7647475",
            "sentiment_compound": 0.1393
        },
        {
            "id": "gyqjjj2",
            "score": 1,
            "text": "I wonder who got fired for that fuck up ,anybody at DIZNEY know ? Please reply , better use a burner phone.",
            "title_similarity": "0.4746505",
            "sentiment_compound": -0.4404
        }
    ]
}