{
    "TIL that the north star is 4000 times brighter than our sun. The light we see when we look at the north star was generated in the year 1587, and it has been traveling through space for 434 years to reach us.\n": [
        {
            "id": "gxv00y1",
            "score": 0,
            "text": "If it's really that much brighter than the sun why can I look directly at it workout out being blinded but not the sun? Checkmate science.",
            "title_similarity": "0.35244662",
            "sentiment_compound": 0.2339
        },
        {
            "id": "gxv2yeb",
            "score": 0,
            "text": "Another fun fact.... Maybe the north star already exploded, but we haven't seen it yet.",
            "title_similarity": "0.5249673",
            "sentiment_compound": 0.2846
        },
        {
            "id": "gxv24k4",
            "score": -13,
            "text": "You could have just said it’s 434 light years away.",
            "title_similarity": "0.5953207",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxv74ko",
            "score": -2,
            "text": "Most stars you see are dead now just you are seeing the light that took countless years to get here.",
            "title_similarity": "0.6154822",
            "sentiment_compound": -0.6486
        },
        {
            "id": "gxul867",
            "score": 3,
            "text": "[“Stars” Hum](https://youtu.be/tIG2hRt-yec)",
            "title_similarity": "0.40776342",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxuo402",
            "score": 2,
            "text": "I think this calls for a thank you.",
            "title_similarity": "0.0067195455",
            "sentiment_compound": 0.3612
        },
        {
            "id": "gxvgy0z",
            "score": -2,
            "text": "I mean... you can make this kind of \"TIL\" about any star on the night sky really. Is it that noteworthy?",
            "title_similarity": "0.52427506",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxv76k1",
            "score": 1,
            "text": "so at that time it wouldn't have \"Existed\" and then one day when people looked up at the sky the north star was suddenly there?",
            "title_similarity": "0.5928838",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxv7qbu",
            "score": -4,
            "text": "TIL? I learned that in high school...",
            "title_similarity": "0.3537203",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxuoxju",
            "score": 2,
            "text": "That’s a long trip just to travel to a big rock 🥴",
            "title_similarity": "0.40444782",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxuxa3b",
            "score": 5,
            "text": "The North star was not always the 'north' star and eventually it will move (or the Earth will) out of the North?",
            "title_similarity": "0.5058302",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxv7u6w",
            "score": 4,
            "text": "And from the lights perspective the travel time was instantaneous.\n\nIf you could visit the north star in a ship travelling at the speed of light you would arrive back at Earth in  year 2889 but you wouldn't have aged at all.",
            "title_similarity": "0.7254299",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxvbnd7",
            "score": 0,
            "text": "I believe in science. I just find it amazing we all hear this and just accept it. Believing in science takes faith. Just believing light travled 434 years and now I am seeing it, is a wild concept.",
            "title_similarity": "0.455702",
            "sentiment_compound": 0.8481
        },
        {
            "id": "gxvhmyl",
            "score": 0,
            "text": "A simpler time... light from 2021 is gonna suck",
            "title_similarity": "0.21097901",
            "sentiment_compound": -0.4404
        },
        {
            "id": "gxvihx9",
            "score": 0,
            "text": "I thought the north star was the star the 3 wise men followed to party with baby jesus?",
            "title_similarity": "0.5197914",
            "sentiment_compound": 0.7003
        },
        {
            "id": "gxvl03a",
            "score": 0,
            "text": "And from the lights perspective, it was instant.",
            "title_similarity": "0.2937349",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxvmtbi",
            "score": 0,
            "text": "“HEAR YE, HEAR YE! DOTH MOTHER KNOW YOU WHERETH HER DRAP—wtf is that sunlight over there?” — some monk with a tonsure haircut",
            "title_similarity": "0.18156117",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxvuugs",
            "score": 0,
            "text": "Its also not a single star, its a trinary system.",
            "title_similarity": "0.27620605",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxw8upl",
            "score": 0,
            "text": "Or\nOr\nOr...\nIt's a light in the sky and unless someone has been there you don't know how far it is",
            "title_similarity": "0.3351714",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxwjn2l",
            "score": 0,
            "text": "How could they know that",
            "title_similarity": "0.06156775",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxx1q1q",
            "score": 0,
            "text": "so?",
            "title_similarity": "-0.007294057",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxx6hlb",
            "score": 0,
            "text": "Downvote the replies that don't align with you were taught.",
            "title_similarity": "0.013656845",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxxno72",
            "score": 0,
            "text": "Grats on passing fourth grade!",
            "title_similarity": "0.37451303",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxyadhj",
            "score": 0,
            "text": "So in theory, if you are at the north star rn with a really good telescope, you can see whata going on on earth in 1587",
            "title_similarity": "0.6778978",
            "sentiment_compound": 0.4927
        },
        {
            "id": "gxukydx",
            "score": 15,
            "text": "The people who were alive when that light was generated......are already dead.",
            "title_similarity": "0.29085654",
            "sentiment_compound": -0.4019
        },
        {
            "id": "gxuqax2",
            "score": 18,
            "text": "some people don't think it be like it is, but it do",
            "title_similarity": "0.0327485",
            "sentiment_compound": 0.1901
        },
        {
            "id": "gxvg3td",
            "score": 1,
            "text": "How can anything be 4000 times brighter than our sun? That doesn’t begin to make sense.",
            "title_similarity": "0.63089967",
            "sentiment_compound": 0.3818
        },
        {
            "id": "gxvltto",
            "score": 1,
            "text": "The North Star is brighter than the sun, just not 4,000x. People who don’t know science tend to exaggerate numbers without knowing the importance.",
            "title_similarity": "0.50980484",
            "sentiment_compound": -0.0284
        },
        {
            "id": "gxvv6ug",
            "score": -1,
            "text": "This is a weirdly inaccurate statement. The light from the star is not all from 1587... that just happens to be 434 years ago. Its just 434 lightyears away.\n\nA more accurate statement would be that if we could zoom in with Hubble and take a photo then we would actually be taking a photo of that star as it looked in 1587. Next year it would be a photo of how it looked 434 years ago still so 1588. Either way it would be a photo of the past. Relativity is fascinating.",
            "title_similarity": "0.6718619",
            "sentiment_compound": 0.3182
        },
        {
            "id": "gxvx88o",
            "score": 1,
            "text": "I'm terrified that someone didn't know about how light works, and that this has 40k upvotes, and that all judging by the comments, our education systems are fucking terrible.",
            "title_similarity": "0.3800925",
            "sentiment_compound": -0.8122
        },
        {
            "id": "gxwmat0",
            "score": -1,
            "text": "That’s it?",
            "title_similarity": "-0.0087125935",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxws3y4",
            "score": 1,
            "text": "Light doesn't experience time, it has no mass. It moves at c through spatial dimensions but 0 through time.\n\nIt would be more accurate to say that we've been waiting 434 years to see it.",
            "title_similarity": "0.51580536",
            "sentiment_compound": -0.1531
        },
        {
            "id": "gxv3k86",
            "score": -7,
            "text": "No!  It takes light 100,000 years to make it from the core of our sun where the light is generated (by product of nuclear fusion), to the surface of the sun.  Then it takes eight minutes to reach Earth.  \n\nThe core plasma is so dense (to photons) that a photon of light traveling in a random path with a *slight* pressure directed outwards to travel the 430,000 mile radius of the sun; it takes 100,000 years to make that journey. \n\nI do not know enough about EM propagation in other stars to give you an accurate time of how \"old\" the light from the North Star is, i.e. the amount of time it took from the fusion event that made the energy to the photon leaving the star's surface. But it is is orders of magnitude bigger then 434 years.",
            "title_similarity": "0.7718456",
            "sentiment_compound": 0.1125
        },
        {
            "id": "gxuzt67",
            "score": 25,
            "text": "We used to believe that stars were souls of our ancestors. Now we know we are looking at ancestors of stars.",
            "title_similarity": "0.5826266",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxv6mx9",
            "score": -2,
            "text": "It is close to meaningless to speak of the time at a distant star.  There is no unified \"time\" that exists at both earth and a distant location.",
            "title_similarity": "0.42947856",
            "sentiment_compound": -0.6229
        },
        {
            "id": "gxv9opz",
            "score": -2,
            "text": "Meaning the North Star could already have disappeared and we wouldn't know until year 2455. \n\n&#x200B;\n\nInsane",
            "title_similarity": "0.5576389",
            "sentiment_compound": -0.5574
        },
        {
            "id": "gxvaaj3",
            "score": -2,
            "text": "This is utterly useless information that has no pressing social consequences on our collective humanity.",
            "title_similarity": "0.084116936",
            "sentiment_compound": -0.6478
        },
        {
            "id": "gxvjaag",
            "score": 2,
            "text": "Actually we don’t know the speed of light one way. What is known is the round trip speed \n\nhttps://en.m.wikipedia.org/wiki/One-way_speed_of_light\n\nhttps://m.youtube.com/watch?v=pTn6Ewhb27k",
            "title_similarity": "0.5051587",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxvjt7z",
            "score": -2,
            "text": "says who?",
            "title_similarity": "-0.036680937",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxvku84",
            "score": 2,
            "text": "There is enough room in space for everyone.\n\nWe just need to learn how to get along long enough to get there.",
            "title_similarity": "0.24134636",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxvnyco",
            "score": 2,
            "text": "So people before 1587 were shit outta luck?",
            "title_similarity": "0.3724205",
            "sentiment_compound": -0.1531
        },
        {
            "id": "gxvonlq",
            "score": 2,
            "text": "I believe you mean 4000 times more luminous. \n\nBrightness is a function of distance and luminosity.",
            "title_similarity": "0.717284",
            "sentiment_compound": 0.4364
        },
        {
            "id": "gxwrnxj",
            "score": -2,
            "text": "We're stuck under the firammet we've never left our atmosphere the sun and moon are not 920000000 miles and 238000 from earth there right above us you ever seen sunlight beams or rays of sunshine coming from right above the clouds that's because those beams or rays shoot out from the source of the light if the sun was 92000000 miles from us you would not see the rays coming out from a specific point of origin it would just be a illuminated glow of some sort you don't even have to have a GED to be giving common sense from god but the shit everyone's blowing in ear other ears in these threads is embarrassing if you really want to sound smart like you're trying to sound in these threads you some common sense",
            "title_similarity": "0.5938122",
            "sentiment_compound": 0.138
        },
        {
            "id": "gxuwvej",
            "score": -10,
            "text": "[deleted]",
            "title_similarity": "-0.034155466"
        },
        {
            "id": "gxw812l",
            "score": 3,
            "text": "*Actually,* **we don't know that.**\n\nDon't get me wrong, the distance is probably correct, but you cannot calculate the time that light took to arrive here. That is because we don't know what the speed of light is when comming from the North Star towards Earth.\n\n\nAt this point, you might be quite confused.\n\nTurns out, we don't know what the speed of light is in *any* particular direction, because *no one actually measured the speed of light in one direction*.\n\n\nAt this point, you're probably even getting a bit angry, because everybody knows that the speed of light is 299792458 m/s, so wtf am I even talking about...\n\n\nWell, turns out, that's actually *the average speed of light* measured in two opposite directions, because it's the only way we can experimentally determine the speed of light.\n\n\nFor all we know, the speed of light could be 98% of average speed of light in one direction, and 102% of C in the other direction. In the most extreme case, it could be half the speed of light in one direction, and *instantaneous* in the opposite direction. **We could not tell.**\n\n\nBut, coming back to our example, this means that the light coming from the North Star could be from 868 years ago (instead of 434), or maybe, it could from 0 years ago. The light coming towards us could be instantaneous, meaning we could actually be seeing the North Star *in real time*. The thing is, even if we managed to comunicate with an intelligent lifeform on the North Star (that somehow survives on a massive star) it would take 868 years for us to hear the answer. Even if we lived forever and had all the time to chat, it would be impossible to understand what the speed of light is in any direction, meaning we (or they) don't know how old are the messages that we (or they) receive. This completely ruins our idea of simultaneity. What is *now* for us could be *now* for them, or it could be *now* for us and *434 years ago* for them, it really depends on the speed of light.\n\n\nIf you have 19 minutes to spend on a very well thought video on this subject by youtuber Veritasium (featuring SmarterEveryDay), [here is the link to the video.](https://youtu.be/pTn6Ewhb27k)",
            "title_similarity": "0.48885107",
            "sentiment_compound": -0.8863
        },
        {
            "id": "gxwqfuq",
            "score": -4,
            "text": "[removed]",
            "title_similarity": "-0.06370722"
        },
        {
            "id": "gxuubkt",
            "score": 55,
            "text": "How big is it's fist though.",
            "title_similarity": "0.24473405",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxui5np",
            "score": 41,
            "text": "Huh, now this is interesting",
            "title_similarity": "0.07186103",
            "sentiment_compound": 0.4019
        },
        {
            "id": "gxv92bl",
            "score": 62,
            "text": "[deleted]",
            "title_similarity": "-0.034155466"
        },
        {
            "id": "gxv6vsi",
            "score": 6,
            "text": "\\* It left the surface of Polaris in 1587. \n\nIt takes like 10,000 years for a photon generated in the core of our sun to stop boinking around long enough and reach the surface. So it's probably much longer for a more massive star like Polaris.",
            "title_similarity": "0.76994526",
            "sentiment_compound": 0.4877
        },
        {
            "id": "gxvaoox",
            "score": 7,
            "text": "Omae wa mou... shindeiru",
            "title_similarity": "0.056638993",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxv4gde",
            "score": 8,
            "text": "It didn’t make the Kessel Run in 12 parsecs ?",
            "title_similarity": "0.43172178",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxvhsx8",
            "score": 77,
            "text": "Proxima Centauri is the nearest star to the sun at 4.25 light years.  If you see it tonight, think over the fact that Trump had been in office less than a month when that light was generated.\n\nRigel, the brightest point in Orion (left knee) is 861 light years.  The light you see tonight was new when the Crusades  were ongoing.  The Normans had taken England just a century before.\n\nThe largest individual object that is readily visible to the aided eye is the Pistol Star, a hypergiant in the Pistol Nebula, near the center of the Milky Way, 26,000 or so light years away.  Our Paleolithic ancestors had figured out how to make clothes out of plant materials.  That light was new when *cloth* was still being prototyped.\n\nThe Andromeda Galaxy is 2.5 million light years away.  In the right conditions, it can be seen with the naked eye.  Our proto-human ancestors couldn't yet consistently make stone tools or utilize fire when light you see now was new.\n\nPuts it into perspective and should generate awe.  Or aw, shit.  But should generate some feeling somewhere.",
            "title_similarity": "0.8024273",
            "sentiment_compound": 0.0644
        },
        {
            "id": "gxv14yz",
            "score": 11,
            "text": "Space is a scary place",
            "title_similarity": "0.19812652",
            "sentiment_compound": -0.4939
        },
        {
            "id": "gxuq513",
            "score": 667,
            "text": "`...and has been traveling through space for 434 years...`\n\n[Or has it?](https://phys.org/news/2011-10-light-speed.html)",
            "title_similarity": "0.81547207",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxuxi5c",
            "score": 212,
            "text": "Only a little related to this post, but a common misconception about Polaris (the North Star) is that it’s the brightest star in the sky. I hear that said a lot when people are talking about it. \n\nIt is definitely not the brightest star in the sky, it’s actually quite small and dim compared to many others. It’s only notable because it doesn’t appear to move more than a couple of degrees in the sky, not because of its brightness.",
            "title_similarity": "0.48635542",
            "sentiment_compound": 0.845
        },
        {
            "id": "gxvb1yi",
            "score": 14,
            "text": "A kind of adjacent fun fact, because the french king Louis XIV adopted the sun as a symbol and called himself \"the Sun King\", the Swedish royalties starting with Karl XI have used the north star as a symbol for the Swedish monarchy. It was a way of showing themselves as greater than France because the sun is only up during the day whereas the north star is always visible.",
            "title_similarity": "0.5528984",
            "sentiment_compound": 0.7003
        },
        {
            "id": "gxuw8mn",
            "score": 1653,
            "text": "Fun fact, photons generated by stars can be trapped for thousands of years inside the star before they can escape. So that light is much, much older than that. It only got away 434 years ago.",
            "title_similarity": "0.8130027",
            "sentiment_compound": 0.1531
        },
        {
            "id": "gxuiw2y",
            "score": 23,
            "text": "That was an interesting article, I like how it described some of the former north stars. I knew about Thuban, but not Kochab.  Some things to look for this summer in the sky.",
            "title_similarity": "0.49781656",
            "sentiment_compound": 0.3818
        },
        {
            "id": "gxv6eme",
            "score": 27,
            "text": "So you're saying if light was generated from the North Star in the year 2021, it would only hit earth by 2455, and by that time,  we'd already be dead?",
            "title_similarity": "0.61978745",
            "sentiment_compound": -0.6486
        },
        {
            "id": "gxv0jcd",
            "score": 35,
            "text": "And in 1587, Queen Elizabeth I was Queen of England and Mary, Queen of Scots was executed.",
            "title_similarity": "0.32990003",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxv38zf",
            "score": 479,
            "text": "The 1580s were 440 years ago? I was just about to graduate highschool in 1581. I feel so old! 😭",
            "title_similarity": "0.57960355",
            "sentiment_compound": -0.5655
        },
        {
            "id": "gxvdyow",
            "score": 125,
            "text": "My favorite thing to tease my brain with is the fact that Betelgeuse could have exploded in a Supernova 500 years ago and we still haven’t seen it because the light from that explosion hasn’t reached us yet.\n\nAnd that when we finally *do* see it explode, it’s not happening in real time-it’s an event that happened around the year 1500 . Crazy",
            "title_similarity": "0.619887",
            "sentiment_compound": -0.0772
        },
        {
            "id": "gxut09z",
            "score": 1251,
            "text": "Just wait until someone posts a synopsis of the latest kurzgesagt video on the limits of humanity.  94% of the stars in our current observable universe can never be reached by humans because the stars are now moving away from us faster than the speed of light due to the expansion of space in the universe.",
            "title_similarity": "0.71192896",
            "sentiment_compound": -0.0762
        },
        {
            "id": "gxv169h",
            "score": 92,
            "text": "We all know the power of the Fist of the North Star",
            "title_similarity": "0.43776384",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxuq4ma",
            "score": 6265,
            "text": "Considering it takes 8 minutes for light to get from our sun to Earth that's crazy.",
            "title_similarity": "0.5556346",
            "sentiment_compound": -0.34
        },
        {
            "id": "gxv691v",
            "score": 544,
            "text": "I think one of the most amazing creations of humanity is having the ability of taking something that doesn't mean anything to our caveman brains and somehow conceptualizing it into a manner that we can kind of understand.\n\nLike to say, \"Proxima Centauri is the closest star to our solar system at 40,208,000,000,000 km away. 40 trillion, 2 hundred and 8 billion km\"\n\nLike conceptually, you think \"Oh wow, 40 trillion, that's far.\" but that number is so unfathomably large that it doesn't like ***mean*** anything to our minds. So we come up with the concept of the \"Light Year\" 4.243 years moving at 300,000 km/sec. The fact that you can kind of wrap your mind around that, is just astounding",
            "title_similarity": "0.69638497",
            "sentiment_compound": 0.889
        },
        {
            "id": "gxv650a",
            "score": 5000,
            "text": "The closest star to the sun is Proxima Centauri. Its light takes a little over 4 years to get here. If Voyager 1, the thus-far furthest out man-made object, was traveling in the correct direction to get to Proxima Centauri, it would take it over 70,000 years to get there.",
            "title_similarity": "0.75703454",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxusd1g",
            "score": 1,
            "text": "UY Scuti is the largest star that's been found yet. Compared to our solar system, it extends further than the revolution of Mars.",
            "title_similarity": "0.70358264",
            "sentiment_compound": 0.128
        },
        {
            "id": "gxuspnb",
            "score": 1,
            "text": "4000 times brighter is an image I can't even imagine",
            "title_similarity": "0.6068243",
            "sentiment_compound": 0.3818
        },
        {
            "id": "gxuzcte",
            "score": 1,
            "text": "And the north state is actually a binary pair",
            "title_similarity": "0.3281603",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxv1aai",
            "score": 1,
            "text": "What is the magnitude of dispersion over that scale?",
            "title_similarity": "0.22295757",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxv2bmh",
            "score": 1,
            "text": "Duh.",
            "title_similarity": "-0.033898298",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxv2qqf",
            "score": 1,
            "text": "Yet the photons do not experience time. Theory of relativity is wild stuff",
            "title_similarity": "0.29712477",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxv2u2d",
            "score": 1,
            "text": "Whoa",
            "title_similarity": "0.040981077",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxv30pn",
            "score": 4,
            "text": "Man this, combined with the recent kurzgesagt video makes me both happy and empty on the inside. On one hand, I can see billions and trillions of beautiful stars, but on the other hand, there will eventually be a time where our galaxy' stars are the only ones we can see.",
            "title_similarity": "0.56160355",
            "sentiment_compound": 0.8689
        },
        {
            "id": "gxv3g33",
            "score": 1,
            "text": "So the North Star is Space's equivalent to Kenshiro?",
            "title_similarity": "0.6440484",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxv44m8",
            "score": 3,
            "text": "Medieval starlight",
            "title_similarity": "0.4298832",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxv4rdi",
            "score": 1,
            "text": "NFW",
            "title_similarity": "0.033799622",
            "sentiment_compound": -0.5267
        },
        {
            "id": "gxv54zh",
            "score": 1,
            "text": "This is the only year you can upvote this.",
            "title_similarity": "0.27118167",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxv56s9",
            "score": 1,
            "text": "You are the universe observing itself",
            "title_similarity": "0.3357833",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxv5dz3",
            "score": 1,
            "text": "Space stuff is never “x is twice as z as y”. It’s always by thousands at least and I feel like it’s a bit showy, me.",
            "title_similarity": "0.62097895",
            "sentiment_compound": 0.3612
        },
        {
            "id": "gxv64qa",
            "score": 3,
            "text": "It amazes me that centuries ago, when everything was much different, when the whole world was different, a star generated light that we are now seeing. We don't know if it's dead, and the fact that the light it's generating right now will be seen centuries later is just amazing. Say some light or an \"image\" if some sort, hypothetically, got to that star. They would be seeing something from whenever the \"image\" was released, a couple centuries ago. Maybe the reason we don't know about aliens is because whatever \"signal\" they produce or anything of that sort (if they exist) will only reach us centuries later.",
            "title_similarity": "0.72008204",
            "sentiment_compound": 0.4215
        },
        {
            "id": "gxv693q",
            "score": 1,
            "text": "Saw the word \"North Star\" and for a second I thought I was in r/titanfall.",
            "title_similarity": "0.6054057",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxv6bgu",
            "score": 1,
            "text": "Pfft rerun lights /s",
            "title_similarity": "0.23464191",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxv6p6k",
            "score": 1,
            "text": "what happens when the light hits us?",
            "title_similarity": "0.2435028",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxv6uv7",
            "score": 3,
            "text": "So here’s a weird fact the North Star could have blown up right now but we wouldn’t know for another 434 years",
            "title_similarity": "0.6505395",
            "sentiment_compound": -0.1235
        },
        {
            "id": "gxv79y9",
            "score": 1,
            "text": "For the universe, we're all moving imperceptibly slow.",
            "title_similarity": "0.20996124",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxv7q5e",
            "score": 1,
            "text": "So I imagine that the \"goldilocks \" is much further on such a bright star",
            "title_similarity": "0.4968351",
            "sentiment_compound": 0.4404
        },
        {
            "id": "gxv81pz",
            "score": 1,
            "text": "All so that it can reflect of nearby surfaces and into our eyes in an instant. Crazy how insignificant we are.",
            "title_similarity": "0.1862742",
            "sentiment_compound": -0.5859
        },
        {
            "id": "gxv8a6b",
            "score": 1,
            "text": "That star could explode today, and we wouldn't know for another 434 years. Amazing.",
            "title_similarity": "0.71907765",
            "sentiment_compound": 0.5859
        },
        {
            "id": "gxv8oni",
            "score": 1,
            "text": "Damn, that's awesome!",
            "title_similarity": "0.18241274",
            "sentiment_compound": 0.4003
        },
        {
            "id": "gxv8umu",
            "score": 1,
            "text": "Can't wait to see this reposted next year with the numbers not changed.",
            "title_similarity": "0.40596986",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxv8uuv",
            "score": 1,
            "text": "Serious question: Is there a way we can tell if a star (that we're still receiving light from) has burned out millenia ago?",
            "title_similarity": "0.50626075",
            "sentiment_compound": -0.0772
        },
        {
            "id": "gxv93jz",
            "score": 1,
            "text": "On a cosmological scale, that isn't all that bright, that far away or that long ago. It's basically just another mote of dust next door.",
            "title_similarity": "0.47931767",
            "sentiment_compound": -0.3412
        },
        {
            "id": "gxv95os",
            "score": 1,
            "text": "Hokuto Shinken is invincible.",
            "title_similarity": "0.31687284",
            "sentiment_compound": 0.4939
        },
        {
            "id": "gxv9k2r",
            "score": 1,
            "text": "This kinda fucked me up into a time vs distance discussion",
            "title_similarity": "0.17690346",
            "sentiment_compound": -0.6258
        },
        {
            "id": "gxv9l7d",
            "score": 1,
            "text": "A great way to think of stargazing is going outside and being simultaneously bombarded by billions of infinitesimally small doses of astral radiation",
            "title_similarity": "0.5454203",
            "sentiment_compound": 0.6249
        },
        {
            "id": "gxv9mj3",
            "score": 1,
            "text": "The universe is just one giant EDM laser light show.",
            "title_similarity": "0.43482524",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxv9x4k",
            "score": 1,
            "text": "And when does it stop?",
            "title_similarity": "-0.0030188523",
            "sentiment_compound": -0.296
        },
        {
            "id": "gxv9xii",
            "score": 1,
            "text": "Two stars or a multiple star system?",
            "title_similarity": "0.39225763",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxva14s",
            "score": 1,
            "text": "so, this also high*lights* the fact that the north star is THAT far away from us",
            "title_similarity": "0.46026325",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxvacri",
            "score": 1,
            "text": "The north star is not one star but 5 stars orbiting each other.",
            "title_similarity": "0.5253641",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxvae4d",
            "score": 1,
            "text": "The light shining from that star was generated when the 1st English baby was born in the New World, in Roanoke Colony (Virginia Dare).",
            "title_similarity": "0.5598648",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxvai0v",
            "score": 1,
            "text": "Cassiopeia is the most distant individual star visible to the unaided eye at 4000 light years away.\n\nThe Milky Way is 105,700 light years across, meaning we've only been able to see what was around us in the last couple 100 years.",
            "title_similarity": "0.7611345",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxvamyx",
            "score": 1,
            "text": "I never have any words for this kind of stuff, it just boggles my mind.",
            "title_similarity": "0.13875043",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxvarnr",
            "score": 1,
            "text": "Stuck in the 80's",
            "title_similarity": "0.24342625",
            "sentiment_compound": -0.25
        },
        {
            "id": "gxvavb2",
            "score": 1,
            "text": "This means that, most(?) of the stars we see in the night sky tonight, tomorrow or even in our lifetime, has already been pre-determined. In a way, it's so weird.",
            "title_similarity": "0.5988919",
            "sentiment_compound": -0.3052
        },
        {
            "id": "gxvb1tp",
            "score": 1,
            "text": "Does it work for Amazon?\nSimilar delivery times.",
            "title_similarity": "0.1990531",
            "sentiment_compound": 0.1779
        },
        {
            "id": "gxvb5iv",
            "score": 1,
            "text": "This breaks my brain",
            "title_similarity": "0.12579319",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxvb63e",
            "score": 1,
            "text": "If you ask the photons, they’d probably say we’re exaggerating and that it took them no time at all to get here",
            "title_similarity": "0.31622368",
            "sentiment_compound": -0.4404
        },
        {
            "id": "gxvb7iu",
            "score": 1,
            "text": "Nice fact: The axis of earth rotation is precessing with a period of about 26,000 years. If you go back or forwards in time a few thousand years, the north pole Star will be Thuban.",
            "title_similarity": "0.69129217",
            "sentiment_compound": 0.4215
        },
        {
            "id": "gxvbfz9",
            "score": 1,
            "text": "From our reference it has been traveling for 434 years,   for the light itself it's instantaneous.",
            "title_similarity": "0.7419852",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxvbjqw",
            "score": 1,
            "text": "We look at planets via Radio telescope yes?\n\nWould a hubble like telescope ever have enough definition to look at the surface of a planet?  Obviously the target is not only usually orbiting a star but Rotating.   So i could understand the limitations of it.   But wouldn't that be a form of time travel?",
            "title_similarity": "0.55900323",
            "sentiment_compound": 0.4836
        },
        {
            "id": "gxvbovo",
            "score": 1,
            "text": "no it hasnt",
            "title_similarity": "-0.0018966869",
            "sentiment_compound": -0.296
        },
        {
            "id": "gxvc0d9",
            "score": 1,
            "text": "From the perspective of the light, it took no time at all.",
            "title_similarity": "0.17468761",
            "sentiment_compound": -0.296
        },
        {
            "id": "gxvc2gn",
            "score": 3,
            "text": "434 years our time. Instantaneous for the light. Relativity gives my headache a headache",
            "title_similarity": "0.607836",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxvc5y7",
            "score": 2,
            "text": "I am always awestruck when I am looking at a star. The photon has been traveling through space for thousands or even millions of years and it's journey ended with me.",
            "title_similarity": "0.7944789",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxvcg8f",
            "score": 1,
            "text": "TIFrigginL very cool indeed",
            "title_similarity": "0.11990094",
            "sentiment_compound": 0.3804
        },
        {
            "id": "gxvco2k",
            "score": 1,
            "text": "2000 years ago, it wasn't the north star as it wasn't aligned with north. Thousands of years from now, it won't be the north star either",
            "title_similarity": "0.5712124",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxvcrkl",
            "score": 2,
            "text": "So 434 years as we have experienced, but the light itself would have not experienced the same time due to time dilation... which i don't understand... fun.",
            "title_similarity": "0.5459603",
            "sentiment_compound": -0.5504
        },
        {
            "id": "gxvctmg",
            "score": 1,
            "text": "Yes, that's how space and the speed of light work.",
            "title_similarity": "0.45528546",
            "sentiment_compound": 0.4019
        },
        {
            "id": "gxvcxme",
            "score": 1,
            "text": "This is a very cool TIL. Now I feel like a time traveler!",
            "title_similarity": "0.38075435",
            "sentiment_compound": 0.6581
        },
        {
            "id": "gxvd15e",
            "score": 1,
            "text": "TIL the North Star is 434 light years away",
            "title_similarity": "0.68275285",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxvd55d",
            "score": 1,
            "text": "Or maybe it got here instantly - we don't know because we can't measure it.",
            "title_similarity": "0.26769707",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxvd6qr",
            "score": 3,
            "text": "There is no universal clock and light does not experience time. From our point of view the light was created just now.",
            "title_similarity": "0.33477128",
            "sentiment_compound": -0.0516
        },
        {
            "id": "gxvd6wl",
            "score": 15,
            "text": ">First of all, the North Star (that dot that earthlings currently see in  the night sky when looking North) is not actually a single star. The  North Star, also called Polaris, is a multiple star system which  actually consists of five different stars. Three of these stars are   \nrelatively close to each other and are in orbit around each other. The  two others are very distant from these first three, and just appear at  the same point in the sky by random chance because they lie on the same  line of sight from earth. If viewed from another galaxy, these two other stars would not line up and would not appear to be a part of the main  Polaris system. The brightest star of the main system is a supergiant,  and the other two stars are smaller and orbit around it.\n\n[Source](https://wtamu.edu/~cbaird/sq/2013/07/24/what-keeps-the-north-star-stuck-at-exactly-north/)",
            "title_similarity": "0.61307025",
            "sentiment_compound": 0.7184
        },
        {
            "id": "gxvd6yc",
            "score": 2,
            "text": "If anyone could entertain this idea...is it possible that some 2000 years ago the North Star had some sort of solar flare or change in light to where it would appear brighter in our sky? Asking for 3 friends.",
            "title_similarity": "0.7461776",
            "sentiment_compound": 0.7906
        },
        {
            "id": "gxvdemx",
            "score": 1,
            "text": "So, *We're looking back in time*,son.",
            "title_similarity": "0.27545887",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxvdm8u",
            "score": 1,
            "text": "**What happen when it reach to earth ?**",
            "title_similarity": "0.40622902",
            "sentiment_compound": 0.0258
        },
        {
            "id": "gxvdmyx",
            "score": 1,
            "text": "Does it mean when we see stars at the sky we are literally looking at the past?",
            "title_similarity": "0.51682854",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxvdynk",
            "score": 1,
            "text": "Or 133.065 parsecs.",
            "title_similarity": "0.46954814",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxve0k4",
            "score": 1,
            "text": "The north star is actually a different galaxy right?",
            "title_similarity": "0.50546205",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxve1nw",
            "score": 3,
            "text": "Bro imagine being on the north star and watching Earth and just seeing the renaissance",
            "title_similarity": "0.6027722",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxve3kz",
            "score": 2,
            "text": "Really puts it in perspective how fast the millennium falcon travels",
            "title_similarity": "0.48568094",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxve64y",
            "score": 3,
            "text": "\"All we see of stars are their old photographs.\" -Dr. Jon Osterman",
            "title_similarity": "0.4194738",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxve7rp",
            "score": 2,
            "text": "From the perspective of the light, it was instant.",
            "title_similarity": "0.29414186",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxvejgh",
            "score": 2,
            "text": "The photons in that light were created millions of years before that, were bouncing around randomly inside the star, and finally ejected. The chances of any of those photons hitting your retina so you can see the star in the sky are so astronomically remote that it might as well be considered impossible.",
            "title_similarity": "0.6818836",
            "sentiment_compound": 0.5994
        },
        {
            "id": "gxvetav",
            "score": 1,
            "text": "Wack",
            "title_similarity": "0.025525814",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxvev52",
            "score": 4,
            "text": "“...and it has been traveling through space for 434 years to reach us regarding our cars extended warranty.”",
            "title_similarity": "0.78325236",
            "sentiment_compound": 0.0258
        },
        {
            "id": "gxvf0j1",
            "score": 1,
            "text": "Well this post isn't going to age well.",
            "title_similarity": "0.09799087",
            "sentiment_compound": 0.4939
        },
        {
            "id": "gxvf1t6",
            "score": 1,
            "text": "The fact it can be proven is insane.",
            "title_similarity": "0.110258415",
            "sentiment_compound": -0.4019
        },
        {
            "id": "gxvfd7w",
            "score": 1,
            "text": "So your saying it's NOT a hole in the dome?",
            "title_similarity": "0.16726424",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxvflnv",
            "score": 1,
            "text": "*“When the light that kisses the back of her eyes were birthed, her ancestors were not yet born. How many human lives have ended in the time it took that light to reach her? How many people have loved only to have lost? How countless, the hopes that have died.”*\n- The Illuminae Files",
            "title_similarity": "0.4706771",
            "sentiment_compound": 0.8466
        },
        {
            "id": "gxvg104",
            "score": 1,
            "text": "Other fun fact: from the perspective of the photon, travel from any one point in space to another is instantaneous. Assuming Einstein's theory of relativity is correct, anyway.",
            "title_similarity": "0.5445883",
            "sentiment_compound": 0.5106
        },
        {
            "id": "gxvg1xz",
            "score": 1,
            "text": "So we are in the future.",
            "title_similarity": "0.1787771",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxvg9ek",
            "score": 1,
            "text": "so it wasnt there before 1587?",
            "title_similarity": "0.3121776",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxvgfsx",
            "score": 1,
            "text": "We are at the beginning of the end of the universe. Almost every star you see in the nightsky is most likely dead or dying by the time we see the light. The rate that new stars are formed (obviously our best guesses with some science thrown in) is reducing more and more. \n\nIts crazy to think that we as a species wont explore 5% of the universe and by the time we might have the technical know how to go further it'll be to late because the universe will be dying and shrinking.",
            "title_similarity": "0.5161138",
            "sentiment_compound": -0.469
        },
        {
            "id": "gxvgha6",
            "score": 1,
            "text": "That’s a long ass time wasted on travel to finally shine its light on my sorry ass.",
            "title_similarity": "0.38151634",
            "sentiment_compound": -0.8885
        },
        {
            "id": "gxvglta",
            "score": 1,
            "text": "Fun fact, Polaris is only the current north star.  It changes over time.  It'll be correct for a few hundred years so no worries about learning a new one.  \n\nAlso, there's a South star for the southern hemisphere.  It's not as good as Polaris though.",
            "title_similarity": "0.5444732",
            "sentiment_compound": 0.5955
        },
        {
            "id": "gxvgmq2",
            "score": 1,
            "text": "More ~~blind~~ mind blowing to me -   \n\nPhotons are continuously leaving Polaris basically in all directions. You consider one snapshot of that, all these photons leaving at once, expanding out, like dots drawn on a balloon being blown up, until it's a balloon 434 light years in radius, *2.37 million square light years in surface area*, and yet, you can take a *one square centimeter* cross section of that balloon and there's enough photons in *that*, that a rudimentary sensor like your eye connected to your monkey brain can more or less determine the source.",
            "title_similarity": "0.6437986",
            "sentiment_compound": 0.2516
        },
        {
            "id": "gxvgoss",
            "score": 1,
            "text": "Mind blown.",
            "title_similarity": "0.122545466",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxvgrpe",
            "score": 1,
            "text": "I feel so insignificant when we start talking distance in light years. It’s truly awe inspiring just how vast the universe is.",
            "title_similarity": "0.5294111",
            "sentiment_compound": 0.3785
        },
        {
            "id": "gxvgvvp",
            "score": 1,
            "text": "Dhruv tara :)",
            "title_similarity": "0.11115405",
            "sentiment_compound": 0.4588
        },
        {
            "id": "gxvgzh7",
            "score": 1,
            "text": "[deleted]",
            "title_similarity": "-0.034155443"
        },
        {
            "id": "gxvh043",
            "score": 1,
            "text": "And yet I still navigate by it.",
            "title_similarity": "0.09525037",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxvi5hl",
            "score": 1,
            "text": "How did it know we would be here?",
            "title_similarity": "0.12329413",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxvi5xj",
            "score": 1,
            "text": "Imagine traveling all that time and landing on earth lol",
            "title_similarity": "0.5929103",
            "sentiment_compound": 0.4215
        },
        {
            "id": "gxvilhd",
            "score": 1,
            "text": "Makes me wonder, are there any stars that’s light has recently reached us? As in are there any new stars observed in recent years?",
            "title_similarity": "0.58768207",
            "sentiment_compound": 0.1926
        },
        {
            "id": "gxviy6i",
            "score": 2,
            "text": "Does that mean a planet closer to that star could use our sun as their \"North Star\"?",
            "title_similarity": "0.5891464",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxviz05",
            "score": 2,
            "text": "Beyond what we can \"see\" there is presumed to be more that mankind will never sense or experience.  We just can't get there to even glimpse, what might be beyond.",
            "title_similarity": "0.19980606",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxvja2i",
            "score": 1,
            "text": "Yes, that's how the speed of light works.",
            "title_similarity": "0.27276868",
            "sentiment_compound": 0.4019
        },
        {
            "id": "gxvk4sg",
            "score": 2,
            "text": "So how do we know if it's still there?",
            "title_similarity": "0.06773953",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxvk4v4",
            "score": 1,
            "text": "So 434 years ago there was \"no\" North Star?",
            "title_similarity": "0.5902195",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxvkc71",
            "score": 2,
            "text": "Wouldn't it suck if you flew through space for 434 years just to slam into some stupid planet with morons inhabiting it?",
            "title_similarity": "0.64628637",
            "sentiment_compound": -0.709
        },
        {
            "id": "gxvkdfr",
            "score": 3,
            "text": "A rough napkin calculation tells me this star is 434 light years away.",
            "title_similarity": "0.604514",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxvkeie",
            "score": 1,
            "text": "Oh, I always thought the North Star was Jupiter",
            "title_similarity": "0.63794184",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxvkois",
            "score": 1,
            "text": "It also takes about two seconds for the thugs to realize that they are already dead when hit with the fist of the north star.",
            "title_similarity": "0.48585364",
            "sentiment_compound": -0.6486
        },
        {
            "id": "gxvkwjo",
            "score": 2,
            "text": "So weird question. If you were to somehow get a camera or something over there that could record live and it could zoom like crazy. Could you in theory watch society in the 16th century if you pointed the camera at earth?",
            "title_similarity": "0.50127554",
            "sentiment_compound": -0.2247
        },
        {
            "id": "gxvkxb2",
            "score": 1,
            "text": "Nani!?",
            "title_similarity": "0.13973664",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxvl739",
            "score": 1,
            "text": "Whoa. That's fucking crazy",
            "title_similarity": "0.09034641",
            "sentiment_compound": -0.4005
        },
        {
            "id": "gxvl978",
            "score": 1,
            "text": "\"let the past guide you\" takes on a really different light in this way",
            "title_similarity": "0.12118726",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxvlbw4",
            "score": 2,
            "text": "So, am I the only one who thought this had something to do with titanfall?",
            "title_similarity": "0.38871422",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxvlf06",
            "score": 1,
            "text": "You'll have to be faster than that, sun. Speed is life.",
            "title_similarity": "0.3152059",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxvlnj3",
            "score": 1,
            "text": "As the South Star fades the North Star shines brighter.",
            "title_similarity": "0.38065714",
            "sentiment_compound": 0.3818
        },
        {
            "id": "gxvlq0o",
            "score": 3,
            "text": "There's a famous poem in romanian literature from 1886 about this:\n>Unto The Star (La steaua) by Mihai Eminescu\n\n>'Tis such a long way to the star\n\n>Rising above our shore\n\n>It took its light to come so far\n\n>Thousands of years and more.\n\n.\n\n>It may have long died on its way\n\n>Into the distant blue\n\n>And only now appears its ray\n\n>To shine for us as true.\n\n.\n\n>We see its icon slowly rise\n\n>And climb the canopy;\n\n>It lived when still unknown to eyes,\n\n>We see what ceased to be.\n\n.\n\n>And so it is when yearning love\n\n>Dies into depth of night:\n\n>Extinct its flame, still glows above\n\n>And haunts us with its light.",
            "title_similarity": "0.56770587",
            "sentiment_compound": 0.4404
        },
        {
            "id": "gxvmefe",
            "score": 2,
            "text": "Doesnt it also mean that the North Star could have died and we are just not seeing it yet, or any star for that matter besides our sun",
            "title_similarity": "0.46353546",
            "sentiment_compound": -0.5423
        },
        {
            "id": "gxvmgdg",
            "score": 1,
            "text": "Starlight star bright...",
            "title_similarity": "0.39352795",
            "sentiment_compound": 0.4404
        },
        {
            "id": "gxvmtkw",
            "score": 1,
            "text": "1580 was my favorite decade.",
            "title_similarity": "0.35107842",
            "sentiment_compound": 0.4588
        },
        {
            "id": "gxvmwao",
            "score": 2,
            "text": "Now THAT is a fun fact.",
            "title_similarity": "0.09098242",
            "sentiment_compound": 0.5106
        },
        {
            "id": "gxvnd0b",
            "score": 1,
            "text": "Stupid question, but does that mean it's 434 lightyears away? If not, what's the conversion?",
            "title_similarity": "0.5787609",
            "sentiment_compound": -0.3736
        },
        {
            "id": "gxvnlcd",
            "score": 1,
            "text": "Yeah",
            "title_similarity": "0.020904558",
            "sentiment_compound": 0.296
        },
        {
            "id": "gxvnn0b",
            "score": 2,
            "text": "and yet those photons somehow don't experience time because they're going at the speed of light. still haven't wrapped my head around that one.",
            "title_similarity": "0.37285078",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxvnnvl",
            "score": 1,
            "text": "smells different too",
            "title_similarity": "0.03667263",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxvogqp",
            "score": 1,
            "text": "It does blow the mind on the vastness and wonder of space. Wonder if it pulled over and took a pit stop?\n\n\\-are we there yet are we there yet",
            "title_similarity": "0.5232892",
            "sentiment_compound": -0.296
        },
        {
            "id": "gxvomoo",
            "score": 1,
            "text": "Where?",
            "title_similarity": "-0.05303428",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxvonpa",
            "score": 2,
            "text": "The North Star is Polaris and I bet most Redditors have never seen it due to light pollution. Polaris is in the constellation Ursa Minor, the little bear, also called the Little Dipper. Many folks mistake the Pleiades for the lil dipper, but they will never find North that way.",
            "title_similarity": "0.5079817",
            "sentiment_compound": -0.1779
        },
        {
            "id": "gxvopff",
            "score": 1,
            "text": "I love how gazing into deep space is basically a time machine",
            "title_similarity": "0.5562979",
            "sentiment_compound": 0.6369
        },
        {
            "id": "gxvopml",
            "score": 1,
            "text": "And then it lands on my dick when I’m stargazing nude",
            "title_similarity": "0.25329614",
            "sentiment_compound": -0.5106
        },
        {
            "id": "gxvouik",
            "score": 1,
            "text": "only from our perspective- to the light itself, its journey is instantaneous.",
            "title_similarity": "0.34714758",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxvoyv2",
            "score": 1,
            "text": "So it's theoretically possible it died in the same year as Mary Stuart and we are about to notice.",
            "title_similarity": "0.40016788",
            "sentiment_compound": -0.5574
        },
        {
            "id": "gxvp04p",
            "score": 1,
            "text": "Fun fact there are an infinite number of stars that are brighter than the sun. The light from most stars other than the ones in the Andromeda galaxy take hundreds of thousands or millions of years to reach earth.",
            "title_similarity": "0.7820804",
            "sentiment_compound": 0.743
        },
        {
            "id": "gxvp2hy",
            "score": 1,
            "text": "All my homies like the 1580’s",
            "title_similarity": "0.37356782",
            "sentiment_compound": 0.3612
        },
        {
            "id": "gxvp40x",
            "score": 1,
            "text": "I find it so sad that humanity is technically advanced enough to observe the universe but unable to reach anything of great interest outside our own little solar system (ginormous to us) within a reasonable amount of time, and without harm from cosmic radiation. Most likely, we never will be able to 😢",
            "title_similarity": "0.5244343",
            "sentiment_compound": 0.8566
        },
        {
            "id": "gxvp510",
            "score": 1,
            "text": "So for all we know, the North Star may not even exist right now?",
            "title_similarity": "0.39841068",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxvpp1h",
            "score": 1,
            "text": "omae wa mou shindeiru",
            "title_similarity": "0.051324658",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxvppix",
            "score": 2,
            "text": "How many light years is that though?",
            "title_similarity": "0.48445135",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxvpv78",
            "score": 1,
            "text": "Hokoto Shinken the best",
            "title_similarity": "0.17541057",
            "sentiment_compound": 0.6369
        },
        {
            "id": "gxvq1f0",
            "score": 1,
            "text": "man the north star is as persistent as one of those car warranty callers lol",
            "title_similarity": "0.43038225",
            "sentiment_compound": 0.4215
        },
        {
            "id": "gxvq3xu",
            "score": 1,
            "text": "This is true for any star. All the stars you see at night are either a) close to us in terms of light-years or b) unusually bright. The most common stars are red dwarfs, which can’t be seen with the naked eye. And it’s quite possible that some of the stars or other deep-sky objects we see don’t exist anymore given how long the light takes to reach us.",
            "title_similarity": "0.6918355",
            "sentiment_compound": 0.7264
        },
        {
            "id": "gxvqj3i",
            "score": 1,
            "text": "That is truly crazy. Wow!",
            "title_similarity": "0.13272181",
            "sentiment_compound": 0.68
        },
        {
            "id": "gxvqpt4",
            "score": 1,
            "text": "So if the north star were to die right now, we'd get to know of it only after 434 years?\n\nMindblowing!",
            "title_similarity": "0.6198471",
            "sentiment_compound": -0.636
        },
        {
            "id": "gxvqq0h",
            "score": 1,
            "text": "And yet, I still can't tell for sure if I've ever managed to look at deliberately or not.",
            "title_similarity": "0.23277904",
            "sentiment_compound": -0.2411
        },
        {
            "id": "gxvqqe3",
            "score": 1,
            "text": "Meanwhile Aliens on North Star planet 10 are watching the Spanish armada get wrecked through telescopes.",
            "title_similarity": "0.53874755",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxvqr91",
            "score": 1,
            "text": "If the other galaxies and stars are moving away faster than the speed of light, is it safe to say that WE ... are also moving faster than the speed of light??\n\nAnother question; Nothing is faster than the speed of light. This is always from just a fixed point correct?",
            "title_similarity": "0.5995527",
            "sentiment_compound": 0.533
        },
        {
            "id": "gxvqrtc",
            "score": 1,
            "text": "\\*was brighter.  We can't say for sure it didn't burn out or go super nova 433 years ago",
            "title_similarity": "0.65284306",
            "sentiment_compound": 0.6745
        },
        {
            "id": "gxvr3r7",
            "score": 1,
            "text": "If we can surpass the speed of light we could look back at the past in real time if we develop a magnifying glass strong enough to see through it.",
            "title_similarity": "0.43732792",
            "sentiment_compound": 0.5106
        },
        {
            "id": "gxvrac1",
            "score": 2,
            "text": "How do you measure the level of brightness in order to compare the sun and another star?",
            "title_similarity": "0.32971594",
            "sentiment_compound": 0.3818
        },
        {
            "id": "gxvrbeq",
            "score": 1,
            "text": "How did people figure out how far away it was?",
            "title_similarity": "0.20597364",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxvrg20",
            "score": 2,
            "text": "Fun fact: When you see a star, you aren't seeing the \"disk\" of the star,like you would with our sun. Instead,stars are \"pointlike\" sources of light, meaning that they're essentially less than a pixel wide, even at the highest magnification. The only reason they're visible at all is that they put out so much light that it essentially fills up the pixel, and even pours over a little bit due to how imperfect our eyes and telescopes are. That's why brighter stars loom bigger.\n\nMost of the stuff we know about stars isn't from directly observing them, but is instead from what we can theorize from the properties and fluctuations of those 1 pixels of light.\n\nWe can tell the composition of stars by looking at the spectrum of light, but the stuff we theorize about structures is mostly from the fluctuations of light. Stuff like pulsars, exoplanets, binary systems, etc are all based on how the light fluctuates between stars.\n\n\nRecently though, we've been able to take *direct* pictures if close stars, and even get picture of pointlike exoplanets, which is a really amazing thing. Here'a a wikipedia article of photos of actually imaged stars:\n\n\nhttps://en.m.wikipedia.org/wiki/List_of_stars_with_resolved_images\n\nGiven all this, it just makes that black hole image from a while ago much more amazing, since it was millions of times farther away than anythjng else we've directlt imaged.",
            "title_similarity": "0.48257762",
            "sentiment_compound": 0.9576
        },
        {
            "id": "gxvrkzh",
            "score": 1,
            "text": "It's 434 years since the light left the surface, but some photons can actually bounce around inside a star for thousands of years before making it to the surface because of how densely packed atoms are inside it.",
            "title_similarity": "0.82680774",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxvrqak",
            "score": 1,
            "text": "Huh, I wonder what they used to navigate before 1587.",
            "title_similarity": "0.31486124",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxvrzpd",
            "score": 1,
            "text": "Can someone please dumb it down for me? Let’s take the sun for example. It takes 8 minutes for the light from the sun to reach earth. Does that mean that if there’s a massive explosion on the sun, it’ll take us 8 minutes to realize?",
            "title_similarity": "0.56505215",
            "sentiment_compound": -0.3094
        },
        {
            "id": "gxvs10j",
            "score": 1,
            "text": "The light was actually generated long before that, it just took until 1587 for it to reach the surface of the North Star. Once released from the fusion in a stars core, photons can and do take upwards of hundreds of thousands of years to make it out of the star, with light from our sun taking an estimated 200,000 years.",
            "title_similarity": "0.81266767",
            "sentiment_compound": 0.0258
        },
        {
            "id": "gxvs9hw",
            "score": 1,
            "text": "No wonder flat earthers exist. The thought of this breaks the brain and is just unfathomable. It’s almost easier to accept the conspiracy theories lol.",
            "title_similarity": "0.28422827",
            "sentiment_compound": 0.2601
        },
        {
            "id": "gxvslpr",
            "score": 1,
            "text": "Everyone is mixing up time for the observer versus time for the traveller. The traveller moving at the speed of light (100%) experiences no time. Photons don’t experience time. But to the observer, they clearly have a speed and travel a certain distance over a period of time.\n\nThus, to the observer, you can not travel faster than the speed of light. The paradox is, if you could go 99.999% of the speed of light, you would experience such little time that it would *feel* like you travelled further in less time.\n\nIt’s all… relative ;)",
            "title_similarity": "0.56479764",
            "sentiment_compound": 0.8625
        },
        {
            "id": "gxvsp03",
            "score": 1,
            "text": "Wait so does that mean if we were suuuper far from the planet we can kinda see the past ?",
            "title_similarity": "0.38714242",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxvsrq1",
            "score": 1,
            "text": "That’s assuming the speed of light is the same in all directions.",
            "title_similarity": "0.26899987",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxvsy9h",
            "score": 1,
            "text": "I will never understand concepts like this - just the thought makes my brain short out....",
            "title_similarity": "0.152868",
            "sentiment_compound": -0.2755
        },
        {
            "id": "gxvteom",
            "score": 1,
            "text": "Imagine all the people who bought stars for their redneck girlfriends and not know it’s burned out already.  The light is still traveling.",
            "title_similarity": "0.45280093",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxvtqjv",
            "score": 1,
            "text": "So hypothetically speaking, does that mean if we were on the north star today and look back at Earth. We would see people living their lives in 1587?",
            "title_similarity": "0.6634486",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxvu20l",
            "score": 1,
            "text": "Well, if what Veritasium mentioned in his lightspeed video is true, then we actually don't know when the light was generated. I love that bit of info, because it means we've only ever been able to measure lightspeed on a *round trip*. Never one way.\n\nWe can estimate it, and it seems to work, but we don't have true confirmation.",
            "title_similarity": "0.46852013",
            "sentiment_compound": 0.2621
        },
        {
            "id": "gxvu35i",
            "score": 1,
            "text": "Speed of light, my ass!",
            "title_similarity": "0.35100394",
            "sentiment_compound": -0.5848
        },
        {
            "id": "gxvu9fd",
            "score": 1,
            "text": "thats just a tough one to believe. cuz like its there. im looking at it. its right there. wouldnt the planets be blurry? at that? theres no milky way anymore cuz too much light pollution",
            "title_similarity": "0.3367007",
            "sentiment_compound": -0.2406
        },
        {
            "id": "gxvucyo",
            "score": 1,
            "text": "Does that mean the north star is going to kill us ?",
            "title_similarity": "0.38775927",
            "sentiment_compound": -0.6908
        },
        {
            "id": "gxvuixk",
            "score": 2,
            "text": "I prefer the dog star. It's brighter and more dog like than the north star.",
            "title_similarity": "0.31793413",
            "sentiment_compound": 0.6573
        },
        {
            "id": "gxvuz0l",
            "score": 1,
            "text": "The pistol star is about 1.5 million times as luminous as the sun, and the eta carinae star system is about 5 million times as luminous as the sun.",
            "title_similarity": "0.6255292",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxvvbp4",
            "score": 1,
            "text": "I have crossed oceans of time to find you.",
            "title_similarity": "0.39595836",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxvvk0q",
            "score": 1,
            "text": "dam that's crazy",
            "title_similarity": "0.057685405",
            "sentiment_compound": -0.34
        },
        {
            "id": "gxvvvkk",
            "score": 1,
            "text": "That blows my mind that that star has only been visible since 1587.   That seems unreal.",
            "title_similarity": "0.49959415",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxvvwdr",
            "score": 1,
            "text": "So, if that star suddenly went out, we would still see it's light for another 400 years?  \n\n\nHoly shit.",
            "title_similarity": "0.68682873",
            "sentiment_compound": -0.5574
        },
        {
            "id": "gxvvyik",
            "score": 1,
            "text": "I think I remembering learning from Brian Greene or Neil Degrass Tyson that there’s these little machines that we will shoot out toward Proxima Centauri that can travel 1/5th the speed of light and that will get there in around 30 years but that we still don’t have a way to stop them when they do arrive to that solar system...I fucken want to be alive when we find life in space 😭😭",
            "title_similarity": "0.69197994",
            "sentiment_compound": -0.8381
        },
        {
            "id": "gxvwba0",
            "score": 1,
            "text": "So William Shakespeare could have been looking up at the North Star in 1587 when the light that we see now left it.",
            "title_similarity": "0.56092286",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxvwv6z",
            "score": 2,
            "text": "So awesome and mind blowing.",
            "title_similarity": "0.2133157",
            "sentiment_compound": 0.659
        },
        {
            "id": "gxvx1wu",
            "score": 1,
            "text": "Now feel bad for your the light that could have finally touched earth after 434 years only to be stopped by you, but now it's your shadow there.",
            "title_similarity": "0.4382999",
            "sentiment_compound": -0.4019
        },
        {
            "id": "gxvx9b0",
            "score": 1,
            "text": "It's also a binary star system",
            "title_similarity": "0.34502476",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxvxevd",
            "score": 1,
            "text": "Hmmm I’m going to need your source.  According to my math the year was 1584... did you factor in dark matter?",
            "title_similarity": "0.4898324",
            "sentiment_compound": 0.0258
        },
        {
            "id": "gxvxld4",
            "score": 2,
            "text": "no one will see this but the question i always have when i see facts like this is - what about the light from our sun? is there some planet billions of years in the future that's only just now seeing the light from our long dead sun? And if so, are reflections of each of us included in that light? Like...frozen, dead, light ghosts?",
            "title_similarity": "0.65699375",
            "sentiment_compound": -0.9218
        },
        {
            "id": "gxvxlpk",
            "score": 1,
            "text": "It's much much MUCH longer than 434 years to reach us. The specific photons we see from that star are actually in the magnitude of a few thousand or a few million years just to escape the hell that is the north star, it spends 10-10000x longer in the star than it does traveling to your puny eyeballs!",
            "title_similarity": "0.7774004",
            "sentiment_compound": -0.6239
        },
        {
            "id": "gxvxukm",
            "score": 1,
            "text": "Can someone make an app that shows you what year you’re seeing for every star?",
            "title_similarity": "0.5063445",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxvxysh",
            "score": 2,
            "text": "... I TRAVELED 434 YEARS TO GIVE YOU MY LIGHT!",
            "title_similarity": "0.66853124",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxvyorn",
            "score": 1,
            "text": "Have fun.\n\nhttps://youtu.be/uzkD5SeuwzM",
            "title_similarity": "0.1395795",
            "sentiment_compound": 0.5106
        },
        {
            "id": "gxvyqy1",
            "score": 1,
            "text": "I still cant comprehend how stars we see are 'dead'.",
            "title_similarity": "0.38207233",
            "sentiment_compound": -0.6486
        },
        {
            "id": "gxvyuth",
            "score": 1,
            "text": "Every star is very far away. None of them can be seen \"as they are right now\". Even the light of the Sun is 8 minutes old.",
            "title_similarity": "0.48189914",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxvyya0",
            "score": 2,
            "text": "Fun fact: What we see today is Polaris as it was 434 years ago. For all we know Polaris might not even be there anymore. It could've gone supernova centuries ago and we would have no way of knowing until it's light reached Earth 434 years later (I actually remember reading somewhere that it **couldn't** ever go supernova, but that's beside the point).",
            "title_similarity": "0.6694142",
            "sentiment_compound": 0.1901
        },
        {
            "id": "gxvzd2u",
            "score": 1,
            "text": "Everything you see looks like it used to.",
            "title_similarity": "0.21627614",
            "sentiment_compound": 0.3612
        },
        {
            "id": "gxvzh15",
            "score": 2,
            "text": "Ye Olde Photons.",
            "title_similarity": "0.30522528",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxvzq6x",
            "score": 2,
            "text": "Yeah :) when we look at stars we are looking at the past. I think about this a lot. It means time exists differently than we conceive of normally.",
            "title_similarity": "0.5298419",
            "sentiment_compound": 0.6369
        },
        {
            "id": "gxvzq7g",
            "score": 1,
            "text": "Insane!",
            "title_similarity": "0.09566367",
            "sentiment_compound": -0.4574
        },
        {
            "id": "gxvzzk2",
            "score": 1,
            "text": "Until next year !",
            "title_similarity": "0.29403707",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxw0uau",
            "score": 1,
            "text": "To get an understanding of the size of our galaxy you should try to play Elite Dangerous",
            "title_similarity": "0.34180492",
            "sentiment_compound": -0.1779
        },
        {
            "id": "gxw0zvk",
            "score": 1,
            "text": "323 years, new studies say.",
            "title_similarity": "0.44632724",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxw11lr",
            "score": 1,
            "text": "Saying what \"year\" light left another celestial body doesnt really make sense in the grand scheme of things as time is not fixed in the universe and is relative. From lights point of view, it travelled instantly from that star to us. It travelled that whole path instantaneously so both points happened at the same time to it. You could say from our perspective that it was 434 years ago, but again, which frame of reference is correct? BOTH.\n\nIt is useless to compare times between objects at such distances as time isnt universally constant.",
            "title_similarity": "0.5906947",
            "sentiment_compound": -0.4019
        },
        {
            "id": "gxw13zy",
            "score": 1,
            "text": "Polaris is also not the North Star permanently.  3,000ya the North Star was Thuban.  In about 10,000 years it will be Vega.",
            "title_similarity": "0.6479796",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxw146w",
            "score": 1,
            "text": "I remember reading recently that the light is actually a lot older than that as it takes a long time, much longer, to escape from the star itself before it hits highway speeds and comes to us",
            "title_similarity": "0.63462174",
            "sentiment_compound": 0.1779
        },
        {
            "id": "gxw14mg",
            "score": 1,
            "text": "Does this take into account the expansion of the universe?",
            "title_similarity": "0.50306743",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxw1pbe",
            "score": 1,
            "text": "I'm just a dumb ol welder, but shouldn't \"we\" ,as in the human race be alot more concerned with fixing the problems here on earth instead spending effort on these kind of things? Feel free to roast me for being simple minded, but I see many more pressing issues right here on good ol planet earth that need addressing.",
            "title_similarity": "0.2971925",
            "sentiment_compound": 0.5574
        },
        {
            "id": "gxw1rn9",
            "score": 1,
            "text": "That's cool information.",
            "title_similarity": "0.040056996",
            "sentiment_compound": 0.3182
        },
        {
            "id": "gxw263r",
            "score": 1,
            "text": "[deleted]",
            "title_similarity": "-0.034155443"
        },
        {
            "id": "gxw2fm4",
            "score": 1,
            "text": "The stars we see might not even be there anymore.",
            "title_similarity": "0.39046606",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxw2yuc",
            "score": 1,
            "text": "Time dilation and whatnot hurts my mind. Like it's insane to think that when you're looking up at the night sky, you're literally looking hundreds of years into the past and not what's happening right now.",
            "title_similarity": "0.5468478",
            "sentiment_compound": -0.5106
        },
        {
            "id": "gxw37n5",
            "score": 1,
            "text": "I will just mention that the one direction speed of light is still not confirmed to be 3x10^8. So its just the round trip light speed that’s c. The light from the star could very well be reaching instantaneously or c/2 or anywhere between them.",
            "title_similarity": "0.6110824",
            "sentiment_compound": 0.5356
        },
        {
            "id": "gxw39g3",
            "score": 1,
            "text": "So is it possible that it could've burned out like 200 years ago and we still wouldn't know in our lifetime? Though I'm assuming we have other ways of knowing",
            "title_similarity": "0.4273032",
            "sentiment_compound": 0.3612
        },
        {
            "id": "gxw3h1v",
            "score": 1,
            "text": "I feel like a lot of people on here just went on a Kurzgesagt binge",
            "title_similarity": "0.32637775",
            "sentiment_compound": 0.3612
        },
        {
            "id": "gxw3n7e",
            "score": 1,
            "text": "Does that star cause heat? If not, how can we destroy the sun?",
            "title_similarity": "0.4374134",
            "sentiment_compound": -0.594
        },
        {
            "id": "gxw4aic",
            "score": 1,
            "text": "Thanks for that, never thought more of that star, just pointed north.  Watch night time long exposure and everthing else moves but the north star, because of our rotation, not theirs.  I know they are all moving because of the big bang, it's sheldons fault.  What I was getting at, are those like voyager things, moving away from us or are we following it?  (Yeah, I heard about something called google, ha)",
            "title_similarity": "0.5630449",
            "sentiment_compound": 0.5346
        },
        {
            "id": "gxw4k4i",
            "score": 1,
            "text": "Halo?! 343, 434?",
            "title_similarity": "0.3725048",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxw4mqe",
            "score": 1,
            "text": "So hard to fathom",
            "title_similarity": "0.072100624",
            "sentiment_compound": -0.1761
        },
        {
            "id": "gxw50uo",
            "score": 2,
            "text": "Ye olde light",
            "title_similarity": "0.18463323",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxw5377",
            "score": 1,
            "text": "We are so insignificant.",
            "title_similarity": "-0.017387804",
            "sentiment_compound": -0.4795
        },
        {
            "id": "gxw5diw",
            "score": 1,
            "text": "So I'm seeing some old ass Galileo light??? Ew!!!!",
            "title_similarity": "0.5037805",
            "sentiment_compound": -0.7358
        },
        {
            "id": "gxw61q0",
            "score": 1,
            "text": "It's been said by someone way smarter than myself that we are looking at ghosts when we look up at the stars.",
            "title_similarity": "0.5657165",
            "sentiment_compound": 0.4588
        },
        {
            "id": "gxw6atp",
            "score": 1,
            "text": "I love astronomy *so* much.",
            "title_similarity": "0.4141016",
            "sentiment_compound": 0.6369
        },
        {
            "id": "gxw7egy",
            "score": 1,
            "text": "According to astronomy, when you wish upon a star You're a million years too late. \n\nIts already dead. \n\nJust like your dreams.",
            "title_similarity": "0.54583436",
            "sentiment_compound": 0.3818
        },
        {
            "id": "gxw7o0l",
            "score": 1,
            "text": "[deleted]",
            "title_similarity": "-0.034155466"
        },
        {
            "id": "gxw859l",
            "score": 1,
            "text": "Am i the onşy one that read \"star was\" as \"star wars\"?",
            "title_similarity": "0.4783323",
            "sentiment_compound": -0.5574
        },
        {
            "id": "gxw87py",
            "score": 1,
            "text": "Makes us really wonder how little we know about our universe. We haven't even explored most of our oceans and the fact that there's trillions of stars and planets and maybe even life on them which would take us generations to find is really amazing.",
            "title_similarity": "0.6394018",
            "sentiment_compound": 0.624
        },
        {
            "id": "gxw8zw4",
            "score": 1,
            "text": "RadioMeter should work.",
            "title_similarity": "0.16451952",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxw9bgq",
            "score": 1,
            "text": "Amazing",
            "title_similarity": "0.14113893",
            "sentiment_compound": 0.5859
        },
        {
            "id": "gxw9iws",
            "score": 1,
            "text": "Wait so does that mean the star in the Bible is theoretically a different star",
            "title_similarity": "0.44803476",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxw9pir",
            "score": 1,
            "text": "Shh, don't tell that to us/Hindus! We already did lot of astrological predictions based on the positions / patterns of these stars! For example determining how compatible a girl can be with you, or if you need to destroy mosques etc!",
            "title_similarity": "0.4485401",
            "sentiment_compound": -0.6571
        },
        {
            "id": "gxw9ppz",
            "score": 2,
            "text": "The photon took 434 years to reach us once it escaped the star’s corona. Photons are *generated* at the star’s core and take over 100,000 years to get to the surface.",
            "title_similarity": "0.81380147",
            "sentiment_compound": 0.0258
        },
        {
            "id": "gxw9t41",
            "score": 1,
            "text": "So you can say...we are looking back in time.",
            "title_similarity": "0.27087045",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxw9xnk",
            "score": 1,
            "text": "That’s a cool fact to tell a girl while star gazing on a romantic date",
            "title_similarity": "0.27502307",
            "sentiment_compound": 0.6124
        },
        {
            "id": "gxwa01p",
            "score": 1,
            "text": "So the North Star could have died ages ago and we still wouldn’t know?",
            "title_similarity": "0.48983204",
            "sentiment_compound": -0.5574
        },
        {
            "id": "gxwa9gy",
            "score": 1,
            "text": "hold up, let me go take a bong rip then read this article.",
            "title_similarity": "0.23617768",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxwalay",
            "score": 2,
            "text": "From the perspective of light, it hasn't traveled any amount of time at all.\n\nI think. I dunno.",
            "title_similarity": "0.22467522",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxwam0t",
            "score": 1,
            "text": "434 years!? And I thought UPS was bad.",
            "title_similarity": "0.32635868",
            "sentiment_compound": -0.5848
        },
        {
            "id": "gxwareu",
            "score": 1,
            "text": "Ken is the true fist of the North Star",
            "title_similarity": "0.4064381",
            "sentiment_compound": 0.4215
        },
        {
            "id": "gxwazxf",
            "score": 1,
            "text": "Honest question-\nIs it fair to think of these things using our time scale?\nSomething about the mention of 1587 felt off, and I can't shake the feeling that it's because of relativity...\nThe problem is that I'm incapable of understanding how I come to the conclusions I do, and so would love to see more opinions and perspectives on this :)",
            "title_similarity": "0.28225785",
            "sentiment_compound": 0.8565
        },
        {
            "id": "gxwb6eq",
            "score": 2,
            "text": "So if an alien from there is looking at us through a super awesome telescope, they’d see a bunch of conquistadores. Pilgrims weren’t even a thing yet.",
            "title_similarity": "0.564106",
            "sentiment_compound": 0.8402
        },
        {
            "id": "gxwb6sk",
            "score": 1,
            "text": "So wishing upon a star is 400 (or many more) years in the making",
            "title_similarity": "0.7232561",
            "sentiment_compound": 0.2944
        },
        {
            "id": "gxwbhif",
            "score": 1,
            "text": "has a visible star ever burnt out in our history?",
            "title_similarity": "0.58020705",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxwc34m",
            "score": 1,
            "text": "Imagine if it exploded 433 years ago. 2022 would have an interesting night sky.",
            "title_similarity": "0.60930395",
            "sentiment_compound": 0.4019
        },
        {
            "id": "gxwc6gx",
            "score": 1,
            "text": "USE THE TARDIGANS!!",
            "title_similarity": "0.17036396",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxwccn4",
            "score": 1,
            "text": "So if one day it goes out, does it have any effect on us? Or we’re just like, “cool, it died 434 years ago, noted.”",
            "title_similarity": "0.45136482",
            "sentiment_compound": -0.2732
        },
        {
            "id": "gxwcdkf",
            "score": 1,
            "text": "Yet if you were riding on one of those photos, no time would pass from your perspective, I believe",
            "title_similarity": "0.2565841",
            "sentiment_compound": -0.296
        },
        {
            "id": "gxwcs90",
            "score": 1,
            "text": "This is technically incorrect. Fotons are generated in the core of the star and can take thousands of years to even reach the surface of the star",
            "title_similarity": "0.7232619",
            "sentiment_compound": 0.0258
        },
        {
            "id": "gxwcypw",
            "score": 1,
            "text": "I'm kind of salty that we live at least several hundreds years, if not more, behind interstellar travel. I wish I could see the day.",
            "title_similarity": "0.65919447",
            "sentiment_compound": 0.4019
        },
        {
            "id": "gxwdb7a",
            "score": 1,
            "text": "Here's an interesting tidbit. Nearly all the stars we see at night, are now so far away from us that we're only receiving their light and location from where they used to be billions of years ago.  In a billion years, the Night Sky will be very different, because the Universe is expanding that much faster now, we can really only estimate that those stars are long dead.",
            "title_similarity": "0.701332",
            "sentiment_compound": -0.3818
        },
        {
            "id": "gxwdmju",
            "score": 1,
            "text": "That's how long it takes me to get a coffee at McDonald's",
            "title_similarity": "0.3925317",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxwdrni",
            "score": 1,
            "text": "Ok I get that the light appeared in the past \n\nBut whenever we watch space travel shows where the travelers go the speed of light...their time is different than our time. They age differently \n\nSo does that play a part when figuring out the age of the light ?  Ugh this hurts my head",
            "title_similarity": "0.649704",
            "sentiment_compound": -0.6749
        },
        {
            "id": "gxwen3y",
            "score": 2,
            "text": "Is the travel of lignt not common knowledge already? Wtf",
            "title_similarity": "0.20946032",
            "sentiment_compound": -0.5859
        },
        {
            "id": "gxwfry1",
            "score": 1,
            "text": "In theory yes, but....we only know the two way \"average\" speed of light using a mirror.  Theoretically it is correct to say the way to the mirror could be c/2 and the way back could be instantaneous. \n\nThe light we see could be \"now\" light.  It may depend on the direction light travels...Kind of mind blowing, but yes, it is correct to say we haven't ever proven the one way speed of light...",
            "title_similarity": "0.3637352",
            "sentiment_compound": 0.6597
        },
        {
            "id": "gxwfwuu",
            "score": 1,
            "text": "Serious question. How do we know this information? Is it a fact based theory?",
            "title_similarity": "0.19912839",
            "sentiment_compound": -0.168
        },
        {
            "id": "gxwgynh",
            "score": 1,
            "text": "What a try-hard.",
            "title_similarity": "0.07062017",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxwhxdq",
            "score": 1,
            "text": "For all we know it's not there anymore.",
            "title_similarity": "0.06376584",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxwi1ft",
            "score": 1,
            "text": "So what is the distance between my eyes and where I’m seeing the light? So when I look at the sun are you saying I’m only seeing the light that left 8 seconds ago? Or even the moon? Am I not looking at the moon?",
            "title_similarity": "0.5525905",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxwiatu",
            "score": 1,
            "text": "i learned this in school. it’s pretty cool once you look into other stars",
            "title_similarity": "0.35550478",
            "sentiment_compound": 0.6705
        },
        {
            "id": "gxwieo1",
            "score": 1,
            "text": "But the one way speed of light has never been measured!  \n\n\nFor all we know, from Polaris to us, the speed is infinite.",
            "title_similarity": "0.50068223",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxwim4o",
            "score": 1,
            "text": "Fun fact. The photon is created in the core of the star and could take 100000 years to reach the surface on average. Then it takes a short trip to your eyeball.",
            "title_similarity": "0.7567079",
            "sentiment_compound": 0.6597
        },
        {
            "id": "gxwj4kx",
            "score": 2,
            "text": "And you see your shadow proves that in the last few feet of that long, amazing, travel that now you have blocked it from reaching it's final destination!",
            "title_similarity": "0.37715626",
            "sentiment_compound": 0.5848
        },
        {
            "id": "gxwj86i",
            "score": 1,
            "text": "I now call it the CM Punk star, it's my headcanon.",
            "title_similarity": "0.29091424",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxwjbdl",
            "score": 1,
            "text": "It’s when I hear stats like this that makes me start to question how soon we’ll learn to travel in time.",
            "title_similarity": "0.3699646",
            "sentiment_compound": 0.3612
        },
        {
            "id": "gxwkctu",
            "score": 2,
            "text": "Imagine it’s disappointment when it gets here.",
            "title_similarity": "0.02921568",
            "sentiment_compound": -0.5106
        },
        {
            "id": "gxwkopi",
            "score": 2,
            "text": "From the perspective of the photons coming from the north star, they were created at the same instant they reached our eyes.",
            "title_similarity": "0.6332454",
            "sentiment_compound": 0.34
        },
        {
            "id": "gxwkwjf",
            "score": 2,
            "text": "I think that’s my new calendar. Not the current year, or in additional to the current year what year am I seeing in the stars.",
            "title_similarity": "0.5353828",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxwnl6x",
            "score": 1,
            "text": "Where did the number 4000 come from? Backing it out using published absolute magnitudes, and from apparent magnitudes combined with distance, yields about 2400? The article doesn't cite any sources.",
            "title_similarity": "0.5066681",
            "sentiment_compound": 0.1926
        },
        {
            "id": "gxwnxad",
            "score": 3,
            "text": "Another interesting bit of info. More than half the stars (suns) we see have already burned out. It just takes so long for the light to get here.",
            "title_similarity": "0.65294355",
            "sentiment_compound": 0.4019
        },
        {
            "id": "gxwoobn",
            "score": 1,
            "text": "Is it likely we will ever be able to teleport or fly to these places quickly ?",
            "title_similarity": "0.46240434",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxwozwx",
            "score": 1,
            "text": "The creator is that which created V'Ger.",
            "title_similarity": "0.27508533",
            "sentiment_compound": 0.25
        },
        {
            "id": "gxwpo1s",
            "score": 1,
            "text": "I have always loved the idea that when star gazing we are literally looking into the past. I can't remember if it was the Cosmos that did a bit on it.",
            "title_similarity": "0.6124189",
            "sentiment_compound": 0.5994
        },
        {
            "id": "gxwq2wj",
            "score": 1,
            "text": "That’s wild!",
            "title_similarity": "0.08430074",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxwqkmv",
            "score": 3,
            "text": "1587+434=2021. You're welcome.",
            "title_similarity": "0.23111302",
            "sentiment_compound": 0.4588
        },
        {
            "id": "gxwr4vw",
            "score": 1,
            "text": "Neat!",
            "title_similarity": "0.029643554",
            "sentiment_compound": 0.5093
        },
        {
            "id": "gxwrro1",
            "score": 1,
            "text": "How is it brighter than our sun? As in it's luminosity is technically brighter than our sun's?",
            "title_similarity": "0.4605282",
            "sentiment_compound": 0.6767
        },
        {
            "id": "gxwrrx5",
            "score": 1,
            "text": "My average dude brain finds wonder in the fact that that means stories involving the North Star date back further than that.",
            "title_similarity": "0.52970135",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxwrstx",
            "score": 1,
            "text": "Probably trying to tell us about an extended auto warranty",
            "title_similarity": "0.25325102",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxws3d3",
            "score": 1,
            "text": "Dude, NFW, belief is the obstacle to knowledge, nice try!",
            "title_similarity": "0.12239665",
            "sentiment_compound": -0.628
        },
        {
            "id": "gxwshv1",
            "score": 1,
            "text": "It seems that light speed isn't as fast as we once thought it was",
            "title_similarity": "0.2783741",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxwsp3n",
            "score": 1,
            "text": "Wait for jwst homie :)",
            "title_similarity": "0.10405726",
            "sentiment_compound": 0.4588
        },
        {
            "id": "gxwt8zt",
            "score": 2,
            "text": "For all we know the North Star blew up 200 years ago.  We just won't know for another 234 years.",
            "title_similarity": "0.6570021",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxwte2h",
            "score": 2,
            "text": "That is how I believe in time travel. You can't interact with it, but you also can't change it. Imagine looking at earth with a telescope from another galaxy, but you see the middle ages only because that light is all you can see so far.",
            "title_similarity": "0.47293752",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxwv0iu",
            "score": 1,
            "text": "You are already dead.",
            "title_similarity": "0.07868768",
            "sentiment_compound": -0.6486
        },
        {
            "id": "gxwvuar",
            "score": 2,
            "text": "Meaning if it suddenly disappeared today, we wouldn't  know about it until 2455.",
            "title_similarity": "0.31062055",
            "sentiment_compound": -0.2263
        },
        {
            "id": "gxwvyw5",
            "score": 1,
            "text": "This has been one of the things that has fascinated me most about space and time.",
            "title_similarity": "0.44112644",
            "sentiment_compound": 0.4767
        },
        {
            "id": "gxwxdij",
            "score": 1,
            "text": "And it goes dark tomorrow",
            "title_similarity": "0.25056478",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxwxv3e",
            "score": 2,
            "text": "It's crazy that 434 light years is nothing, cosmologically, but it's just within that golden band of far enough to be impressive without being too far to comprehend.",
            "title_similarity": "0.5558209",
            "sentiment_compound": 0.5789
        },
        {
            "id": "gxwxz26",
            "score": 2,
            "text": "Very interesting space is so fascinating",
            "title_similarity": "0.23954572",
            "sentiment_compound": 0.8168
        },
        {
            "id": "gxwyfdm",
            "score": 1,
            "text": "What's crazier is that if you were somehow riding on the light the journey would seem instantaneous.",
            "title_similarity": "0.38128304",
            "sentiment_compound": -0.0258
        },
        {
            "id": "gxx01s6",
            "score": 1,
            "text": "If I teleported to the north star, would I be able to see our sun?",
            "title_similarity": "0.60859835",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxx0ghz",
            "score": 1,
            "text": "Great, now I want to play Elite dangerous.....",
            "title_similarity": "0.15800048",
            "sentiment_compound": 0.5719
        },
        {
            "id": "gxx3cpn",
            "score": 1,
            "text": "So does that mean that the sun is 4000x closer to us then the north star ??",
            "title_similarity": "0.7460265",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxx4d2b",
            "score": 1,
            "text": "Space and time are irrevocably linked because the speed of light is finite.",
            "title_similarity": "0.39443344",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxx5fz6",
            "score": 2,
            "text": "And by the time it reaches you, you are already dead.",
            "title_similarity": "0.1542187",
            "sentiment_compound": -0.6249
        },
        {
            "id": "gxx7ckr",
            "score": 2,
            "text": "434 is not a lot. Most of the light arriving to earth has been travelling for millions of years.  Some even billions.",
            "title_similarity": "0.676918",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxx7w66",
            "score": 1,
            "text": "Your literally looking into the past when you look up into the sky. If there was a civilization on a planet, orbiting a star that you can see, they have likely died off by now.",
            "title_similarity": "0.60839033",
            "sentiment_compound": -0.5574
        },
        {
            "id": "gxx869p",
            "score": 1,
            "text": "In what scale is the brightness...? It doesn't go up linearly with temperature right...? Is it logarithmic...?\n\nThis may be a stupid question but searching the relation between brightness (luminance) and temperature gave me bizarre results such as black and grey bodies or brightness in terms of color... So yeah.",
            "title_similarity": "0.26176253",
            "sentiment_compound": 0.8438
        },
        {
            "id": "gxxa0iv",
            "score": 1,
            "text": "Everything  we look at not in our solar system  is light  years away. We are looking at these planets and systems as they were thousands  or millions  of years ago. Just the same if some intelligent  life is looking  at earth the same way. They see a planet  of molten rock. Why come this way. To say we see a potential  habital  planet is bs. That maybe was the case then but by the time we see it , it could be gone.",
            "title_similarity": "0.6782173",
            "sentiment_compound": 0.25
        },
        {
            "id": "gxxb4p5",
            "score": 1,
            "text": "If its brighter, shouldn't it get here faster? /S",
            "title_similarity": "0.28190288",
            "sentiment_compound": 0.3818
        },
        {
            "id": "gxxb71m",
            "score": 1,
            "text": "So what I don’t get is, it actually is outside of time. Light years is actually a measure of distance not time. So if we see the light, wouldn’t it be in the present still not the past like I hear so often. I know scientists even say that what we see is so far in the past, but if the light is traveling outside of time, wouldn’t the lightyears be irrelevant to actual time how we observe it? Any scientists on here wanna help me out with this. Not concurring with me, unless I’m right and that’s cool, but help me understand in general how this works.",
            "title_similarity": "0.4535392",
            "sentiment_compound": 0.8589
        },
        {
            "id": "gxxbb2p",
            "score": 1,
            "text": "Absolute versus apparent magnitude.",
            "title_similarity": "0.16506639",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxxch5a",
            "score": 1,
            "text": "If North Star dies we wouldn’t know for 434 years then?",
            "title_similarity": "0.5535015",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxxdqgv",
            "score": 3,
            "text": "Astronomer here. \n\n**Fun facts:** the North Star's name is Polaris ([Wikipedia](https://en.wikipedia.org/wiki/Polaris)), and is the largest of *three* stars in its system.\n\nIn Julias Caesar by William Shakespeare, Caesar says, \n\n\"But I am constant as the Northern Star,  \nOf whose true fixed and resting quality  \nThere is no fellow in the firmament.  \nThe skies are painted with unnumbered sparks;  \nThey are all fire and every one doth shine;  \nBut there’s but one in all doth hold his place.\"\n\nIn fact, Polaris is a Cepheid variable star (its brightness changes over regular time intervals) and Earth's rotation axis isn't perfectly aligned with it, so it actually wobbles when you zoom in — just like all the other stars. More than that: it hasn't always been the closest star to the celestial north pole. Due to the precession of Earth's rotation axis, other stars were closer, and it was only in the early medieval period that Polaris moved close to the celestial north pole.",
            "title_similarity": "0.6954955",
            "sentiment_compound": 0.2612
        },
        {
            "id": "gxxe1ku",
            "score": 2,
            "text": "For the light itself, it was but an instant.",
            "title_similarity": "0.28791147",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxxgmd9",
            "score": 1,
            "text": "Yeah but how long does it take a photon to make it to the surface of Polaris to begin its interstellar journey?",
            "title_similarity": "0.6544939",
            "sentiment_compound": 0.1531
        },
        {
            "id": "gxxh0eq",
            "score": 3,
            "text": "Also, the North Star is NOT the brightest star in the sky.",
            "title_similarity": "0.41299856",
            "sentiment_compound": -0.4973
        },
        {
            "id": "gxxhjnn",
            "score": 2,
            "text": "Vintage star light",
            "title_similarity": "0.36077368",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxxii89",
            "score": 1,
            "text": "#WHY IS THIS SUB ALWAYS USING SUCH OLD ARTICLES??? YOU WERE GROWING SPACE.COM AND WENT INTO THE FUCKING ARCHIVES???\n\nThe North Star: Polaris\nBy Joe Rao almost 4 years ago",
            "title_similarity": "0.69514364",
            "sentiment_compound": 0.5256
        },
        {
            "id": "gxxiuox",
            "score": 1,
            "text": "So for the current north star, I'm an unexistent object..",
            "title_similarity": "0.29601973",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxxjgnw",
            "score": 2,
            "text": "theoretically.\n\n&#x200B;\n\ni mean the speed of light could be instantaneous based on the direction it is going. we would never know either.",
            "title_similarity": "0.42439327",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxxk2im",
            "score": 1,
            "text": "What in the world? That is just mind blowing.",
            "title_similarity": "0.097679816",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxxkxfc",
            "score": 1,
            "text": "Light traveling in the cheap seats been re-breathing farts the whole time",
            "title_similarity": "0.34812826",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxxlgkg",
            "score": 2,
            "text": "Facts like this screw w my head",
            "title_similarity": "0.09161763",
            "sentiment_compound": 0.25
        },
        {
            "id": "gxxlz24",
            "score": 2,
            "text": "For all you know, half the stars you see have burned out and you’re just looking at their residual light.",
            "title_similarity": "0.49994743",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxxmkrx",
            "score": 1,
            "text": "The great North Star with its steady light\nO’er land and sea, a beacon bright\nAlaska’s flag to Alaskans dear\nA simple flag of the last frontier",
            "title_similarity": "0.4874904",
            "sentiment_compound": 0.8625
        },
        {
            "id": "gxxmm9r",
            "score": 1,
            "text": "ive never seen the north star. is it bright comparatively to others when u look in da sky?",
            "title_similarity": "0.57819736",
            "sentiment_compound": 0.4404
        },
        {
            "id": "gxxmzak",
            "score": 2,
            "text": "How does one obtain this information? AKA how do we know? \n\nIt totally can be or is true, but how do we know for sure?",
            "title_similarity": "0.22827794",
            "sentiment_compound": 0.6586
        },
        {
            "id": "gxxp1lb",
            "score": 1,
            "text": "So, if I were somehow 4000 times further away from this star than we are from the sun, would it be just as bright? I doubt that’s how it works, just wondering.",
            "title_similarity": "0.69527024",
            "sentiment_compound": 0.1027
        },
        {
            "id": "gxxqiji",
            "score": 1,
            "text": "Man I’m really dumb.",
            "title_similarity": "0.021652415",
            "sentiment_compound": -0.5563
        },
        {
            "id": "gxxrmg4",
            "score": 1,
            "text": "Real question here:\nHow tf do we see the same exact stars each night? Like all night long. Aren’t we spinning and rotating?",
            "title_similarity": "0.62519634",
            "sentiment_compound": 0.4329
        },
        {
            "id": "gxxrofd",
            "score": 2,
            "text": "Even more mind boggling, the photons were generated in the core of that star thousands of years ago and has spent millenia moving around inside the star before making its way to the surface to finally be emitted, a journey which is only the most infinitesimal fraction of the distance it will travel to earth",
            "title_similarity": "0.7888328",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxxtgm1",
            "score": 1,
            "text": "Acccccctuslly…. The photon probably came into being like 1,000,000 years before it left the surface of the North Star and then travelled since 1587….\n\nNDT would school your ass.",
            "title_similarity": "0.7450188",
            "sentiment_compound": -0.25
        },
        {
            "id": "gxxtjvo",
            "score": 1,
            "text": "Dog spelled backwards is goD",
            "title_similarity": "0.15077446",
            "sentiment_compound": 0.2732
        },
        {
            "id": "gxxumst",
            "score": 1,
            "text": "That's why I don't believe in astrology. It's fun but nah.",
            "title_similarity": "0.16765895",
            "sentiment_compound": 0.1406
        },
        {
            "id": "gxxumwu",
            "score": 4,
            "text": "Not to be *that guy*, but here goes.\n\nThe light we see from the North Star was generated over 100,000 years ago. It escaped the surface of the star in 1587.\n\nIt takes a single photon 100,000 years to make it from the center of our sun to the surface. The North Star is almost 6 times more massive than our sun, so it would take much longer for a photon to escape.\n\nhttps://www.abc.net.au/science/articles/2012/04/24/3483573.htm",
            "title_similarity": "0.80353284",
            "sentiment_compound": 0.2617
        },
        {
            "id": "gxxv36d",
            "score": 1,
            "text": "All this stuff is fascinating.",
            "title_similarity": "0.16357636",
            "sentiment_compound": 0.5423
        },
        {
            "id": "gxxw6zk",
            "score": 1,
            "text": "I wonder why you can’t see it during they day like the sun",
            "title_similarity": "0.2140529",
            "sentiment_compound": 0.3612
        },
        {
            "id": "gxxwaol",
            "score": 1,
            "text": "It’s cool as fuck we’re sort of watching time travel all the time",
            "title_similarity": "0.4685559",
            "sentiment_compound": -0.296
        },
        {
            "id": "gxxxe4q",
            "score": 1,
            "text": "Gives a new meaning to the phrase \"You are already dead\"",
            "title_similarity": "0.16595346",
            "sentiment_compound": -0.6486
        },
        {
            "id": "gxxy4tb",
            "score": 2,
            "text": "Mary queen of Scots was beheaded when the light was generated in 1587.",
            "title_similarity": "0.32361358",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxxyfc7",
            "score": 3,
            "text": "Man shit like this is what makes my head hurts out of curiosity and for not being able to understand it....",
            "title_similarity": "0.10323085",
            "sentiment_compound": -0.6369
        },
        {
            "id": "gxxz9l5",
            "score": 1,
            "text": "That’s not how time works though. There’s just a single “now.”\n\nFor it to with the way described requires something called retro-causality, which is as absurd as it sounds.",
            "title_similarity": "0.20558766",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxxzv78",
            "score": 1,
            "text": "u/giger1998",
            "title_similarity": "0.17245775",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxy0hsf",
            "score": 1,
            "text": "so basically we are stuck on our solar system. just like when the bus service is cancelled in heavy snow? \n\nme: we need a new way.... \njeff: life finds a way.",
            "title_similarity": "0.42191315",
            "sentiment_compound": -0.128
        },
        {
            "id": "gxy0ner",
            "score": 1,
            "text": "Also it’s actually 3 stars",
            "title_similarity": "0.3645652",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxy4nr6",
            "score": 1,
            "text": "That's some crazy shit.",
            "title_similarity": "0.11272145",
            "sentiment_compound": -0.7184
        },
        {
            "id": "gxy5kuc",
            "score": 1,
            "text": "Now that is dedication.",
            "title_similarity": "0.06522305",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxy8m6r",
            "score": 1,
            "text": "So connect a brain to the lightsail and send it off to narrate. Just wake up the brain with a jolt when in system",
            "title_similarity": "0.3607152",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxy8s7r",
            "score": 1,
            "text": "So next year will we be getting light from 1588? Is that how it works ?",
            "title_similarity": "0.4622097",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxy9ptg",
            "score": 1,
            "text": "So, if the star exploded 100 years ago, we won't know for over 300 more years",
            "title_similarity": "0.6872343",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxyebu5",
            "score": 1,
            "text": "this is the coolest thing ive ever learned on reddit",
            "title_similarity": "0.43271312",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxzh6zw",
            "score": 1,
            "text": "What about the Penelope star?",
            "title_similarity": "0.2706221",
            "sentiment_compound": 0.0
        },
        {
            "id": "gy1bjz1",
            "score": 2,
            "text": "So the North Star could have \"gone out\" and we wouldn't know?",
            "title_similarity": "0.38236055",
            "sentiment_compound": 0.0
        },
        {
            "id": "gy9cjze",
            "score": 1,
            "text": "It’s also not just one star, but a [triple star system](https://www.google.be/amp/s/www.universetoday.com/11259/the-north-star-is-really-three-stars/amp/)",
            "title_similarity": "0.6279123",
            "sentiment_compound": 0.0
        },
        {
            "id": "gyf06ch",
            "score": 1,
            "text": "I really love space and  astronomy etc..but I just don't understand this concept.",
            "title_similarity": "0.41578013",
            "sentiment_compound": 0.6697
        },
        {
            "id": "gzxj61u",
            "score": 1,
            "text": "That light travel information always blows my\nMind. How what we see in the sky is many years old. If not many million years old.",
            "title_similarity": "0.7099191",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz6j4mq",
            "score": 1,
            "text": "In fact, the North Star—also called Polaris—is 30 percent closer to our solar system than previously thought, at about 323 light-years away, according to an international team who studied the star's light output.",
            "title_similarity": "0.77605987",
            "sentiment_compound": 0.0
        }
    ]
}