{
    "TIL that the Venus flytrap naturally grows in very few areas in the Carolinas, so park rangers have to keep most of their grow sites a secret to keep them safe from poachers.\n": [
        {
            "id": "gzvig3j",
            "score": 2,
            "text": "As if you can't get them from Walmart for like 5 bucks. Or the internet.",
            "title_similarity": "0.4560793",
            "sentiment_compound": 0.3612
        },
        {
            "id": "gzvtay0",
            "score": 2,
            "text": "Humans are cancer. We gather around and deplete an otherwise functional system until it is utterly destroyed; but not before metastasizing to the next one.",
            "title_similarity": "0.33815965",
            "sentiment_compound": -0.6055
        },
        {
            "id": "gzw8hz5",
            "score": 0,
            "text": "Park Rangers, the government, and so on are obsessed with stopping poachers from taking these plants from their natural habitat. If you take even a few and are caught then you face huge fines and even jail time.\n\n***But*** if you bought up land in the area and bulldozed over the sites then you're totally fine.\n\nThe biggest threat to the flytraps now aren't scary Black people selling plants on the black market for a small profit to survive but developers who can freely raze their natural habitat for a profit.\n\nThere's a great article on this where someone did a ride-along with poachers and details just how developing is proceeding but Black people born and raised there, from families generations back, are being told they have no right to their own backyard. But anytime I try to find it I'm just met with warnings about poaching.\n\nNo warnings about developing a sprawl on a natural habitat.",
            "title_similarity": "0.6437766",
            "sentiment_compound": 0.9736
        },
        {
            "id": "gzw5evk",
            "score": 0,
            "text": "[deleted]",
            "title_similarity": "0.07246603"
        },
        {
            "id": "gzwftvl",
            "score": 0,
            "text": "They sell them at Lowe's just go buy them.",
            "title_similarity": "0.25505176",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzvxbj4",
            "score": 1,
            "text": "Including the fact that they aren't in the Carolinas. Sorry to the poachers of this is confusing but it seems to be that the same sort of person that would poach plants is going to believe someone said on the internet. Now if you can't tell that I may or may not be a ranger trying to mislead you (or not) then your are exactly the type of person this comment was written for. Hint: they actually do grow in the Carolinas (or do they? this is the internet, I could be lying, (or I may not be)). Happy hunting",
            "title_similarity": "0.66062444",
            "sentiment_compound": -0.8806
        },
        {
            "id": "gzvm4rn",
            "score": -5,
            "text": "Huge black market for Venus fly traps. Iirc, they're indigenous to only a few places on earth.",
            "title_similarity": "0.6695974",
            "sentiment_compound": 0.3182
        },
        {
            "id": "gzxbf88",
            "score": 0,
            "text": "They grow other places too. This is silly.",
            "title_similarity": "0.2813945",
            "sentiment_compound": 0.0258
        },
        {
            "id": "gzxdetp",
            "score": 0,
            "text": "Why would they be in danger of poachers, it seems they are readily available to buy",
            "title_similarity": "0.31029704",
            "sentiment_compound": -0.5267
        },
        {
            "id": "gzxhezd",
            "score": 0,
            "text": "Poachers? They sell them at home depot. I don't think they are even expensive.",
            "title_similarity": "0.4899147",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzvqweo",
            "score": 10,
            "text": "They grow wild in Ohio because someone threw out a plant they bought. And then planted in a park. Dumbass. Anyone who’d like to have a free huge one pm me.  The rangers at the park have told me personally they appreciate visitors removing them because of the spread and the fact that they aren’t indigenous. Like on the edge of the civilization and amish country.",
            "title_similarity": "0.66770077",
            "sentiment_compound": 0.8271
        },
        {
            "id": "gzwejag",
            "score": -4,
            "text": "Is poacher the correct term, somehow I feel like someone who illegally kills animals should be classified different than someone who picks a plant.",
            "title_similarity": "0.5107661",
            "sentiment_compound": -0.25
        },
        {
            "id": "gzvkx93",
            "score": 1,
            "text": "We've always been able to buy them in gardening stores on pots? We lived in Southern Virginia, however.",
            "title_similarity": "0.4951536",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzvsc81",
            "score": -1,
            "text": "So is it safe to assume that all of those little ones you see at the grocery store with little kits are probably at least cloned from stolen plants\n\nEdit: I'll never understand reddit's need to downvote genuine questions",
            "title_similarity": "0.6429031",
            "sentiment_compound": -0.0094
        },
        {
            "id": "gzw32qz",
            "score": 1,
            "text": "Your daily reminder that people are fucking awful.",
            "title_similarity": "0.1793153",
            "sentiment_compound": -0.5095
        },
        {
            "id": "gzwdx4z",
            "score": 1,
            "text": "When I was in the Marine Corps we were doing some training out in the woods around Camp Lejeune area and I remember seeing them all over the place. At the time I thought that was really cool because I had no idea they grew freely in NC before that. They seemed to be pretty prevalent in that particular area.",
            "title_similarity": "0.54522604",
            "sentiment_compound": 0.7574
        },
        {
            "id": "gzwni2r",
            "score": -1,
            "text": ",",
            "title_similarity": "-0.2560276",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzwnoog",
            "score": -1,
            "text": ",",
            "title_similarity": "-0.2560276",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzwnooo",
            "score": -1,
            "text": ",",
            "title_similarity": "-0.2560276",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzxz01q",
            "score": 1,
            "text": "I'm sorry... They grow where?!?!?! You mean to tell me these little shops of horror don't grow exclusively in some forbidden virgin stretch of rainforest deep in uncharted Brazil?!?! \n\nDo you mean. To tell me. That they grow in the same state that invented MINI GOLF?!?!?!?!",
            "title_similarity": "0.61448354",
            "sentiment_compound": -0.8646
        },
        {
            "id": "gzvoxp0",
            "score": 10,
            "text": "If you were to eat one, would it be vegan?",
            "title_similarity": "0.3877191",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzvmrtq",
            "score": 2,
            "text": "I kind of want one, are they a lot of work?",
            "title_similarity": "-0.0063536726",
            "sentiment_compound": 0.0018
        },
        {
            "id": "gzvq077",
            "score": 2,
            "text": "There’s a Criminal podcast episode on this. Crazy there’s a black market for a plant.\n\nEdit: for a plant that doesn’t cause any sort of high for humans.",
            "title_similarity": "0.5977634",
            "sentiment_compound": -0.7311
        },
        {
            "id": "gzvu3ya",
            "score": 2,
            "text": "/r/savagegarden",
            "title_similarity": "0.035121888",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzvuck7",
            "score": -2,
            "text": "Remember that when you see someone with one growing as a novelty in their house.",
            "title_similarity": "0.17392468",
            "sentiment_compound": 0.1779
        },
        {
            "id": "gzw5g1q",
            "score": 2,
            "text": "There's so much miss information In this post it's insane",
            "title_similarity": "0.2899323",
            "sentiment_compound": -0.5542
        },
        {
            "id": "gzvrbyy",
            "score": 2,
            "text": "https://www.springfieldnewssun.com/news/national/north-carolina-man-charged-with-poaching-venus-flytraps/RmErLY7NmealbXeSmp6eeN/",
            "title_similarity": "0.45388526",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzvfwyo",
            "score": 73,
            "text": "Ohhh, wait, so they're not actually grown on Venus? Damn it...",
            "title_similarity": "0.45146886",
            "sentiment_compound": -0.4019
        },
        {
            "id": "gzvpoxv",
            "score": 4,
            "text": "Which is dumb because they’re like 3 dollars at wal mart...",
            "title_similarity": "0.3716039",
            "sentiment_compound": -0.2023
        },
        {
            "id": "gzvw9nj",
            "score": -4,
            "text": "Why is the human species so pathetic? Can’t even let flowers grow where they’re supposed to, gotta find a way to profit",
            "title_similarity": "0.5723027",
            "sentiment_compound": -0.4294
        },
        {
            "id": "gzvij01",
            "score": 46,
            "text": "Oh wow I thought they were a South American plant",
            "title_similarity": "0.15201533",
            "sentiment_compound": 0.5859
        },
        {
            "id": "gzvrrka",
            "score": 7,
            "text": "If you want a fucking Venus fly trap buy one from\nA local nursery. I hate people",
            "title_similarity": "0.6231221",
            "sentiment_compound": -0.7152
        },
        {
            "id": "gzvujv5",
            "score": 11,
            "text": "TIL Venus fly traps naturally grow in the Carolinas.",
            "title_similarity": "0.5564148",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzvvqtl",
            "score": 15,
            "text": "TIL that Venus Flytraps are endemic to the Carolinas in the US! Wow!\n\nBeen hearing about them all my life and just assumed they were from the Amazon or Madagascar or Thailand or something!",
            "title_similarity": "0.54769206",
            "sentiment_compound": 0.7488
        },
        {
            "id": "gzvm1y1",
            "score": 28,
            "text": "Well, now the entirety of reddit know where to find them?\n/s",
            "title_similarity": "0.06388438",
            "sentiment_compound": 0.2732
        },
        {
            "id": "gzvcd16",
            "score": 2204,
            "text": "Are you sure it isn't to keep poachers safe from the horde mother?",
            "title_similarity": "0.52935404",
            "sentiment_compound": 0.6369
        },
        {
            "id": "gzvca9s",
            "score": 1085,
            "text": "Check out this Criminal episode on this very subject:\n\nhttps://thisiscriminal.com/episode-five-dropping-like-flies-4-24-2014/",
            "title_similarity": "0.29801896",
            "sentiment_compound": -0.6124
        },
        {
            "id": "gzvhyfk",
            "score": 5971,
            "text": "I saw Venus Flytraps sold in my local Aldi, and wondered if they are able to breed them captively, and if so what prevents them from repopulating them in their ranges with captive bred plants.\n\nI read about Venus Fly Traps being in danger in National Geographic a long time ago it's an ongoing problem.  People also use them medicinally for stuff.",
            "title_similarity": "0.7329297",
            "sentiment_compound": -0.6728
        },
        {
            "id": "gzvh2gs",
            "score": 1089,
            "text": "TIL, there are poachers for Venus fly traps",
            "title_similarity": "0.48289314",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzvkre0",
            "score": 257,
            "text": "Wilmington, NC has an awesome little park of Venus fly traps and pitcher plants. Pretty cool little area.",
            "title_similarity": "0.54989684",
            "sentiment_compound": 0.8625
        },
        {
            "id": "gzvig9a",
            "score": 1722,
            "text": "I've found a few on some property I have near there. They seemed to have died though.  Weren't there the year after, or since. Not that I've looked very hard",
            "title_similarity": "0.5060415",
            "sentiment_compound": -0.6478
        },
        {
            "id": "gzvjues",
            "score": 379,
            "text": "TIL: There are plant poachers.",
            "title_similarity": "0.2687847",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzvlajx",
            "score": 67,
            "text": "[deleted]",
            "title_similarity": "0.07246606"
        },
        {
            "id": "gzvmrq4",
            "score": 15,
            "text": "Any tips for a first time vft owner?",
            "title_similarity": "0.26110715",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzvnm1q",
            "score": 6,
            "text": "The Criminal podcast has a great episode on the black market for Venus flytraps.",
            "title_similarity": "0.45234656",
            "sentiment_compound": 0.1779
        },
        {
            "id": "gzvo41o",
            "score": 37,
            "text": "This guy has a great video about these little guys. His whole channel “Crime pays but Botany doesn’t” is entertaining if you want to learn about plants https://youtu.be/5_ymw2NUElU",
            "title_similarity": "0.5861906",
            "sentiment_compound": 0.7814
        },
        {
            "id": "gzvoedz",
            "score": 81,
            "text": "I didn't even know they were native to my area!",
            "title_similarity": "0.3119357",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzvog2z",
            "score": 8,
            "text": "We have cameras everywhere in the preserves too",
            "title_similarity": "0.19631138",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzvpfc4",
            "score": 15,
            "text": "I just bought a starter set from Lowes not too long ago. I've become a gardener this year of sorts.",
            "title_similarity": "0.33617336",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzvpnsm",
            "score": 11,
            "text": "Ahh so it’s in the park. Thank you.",
            "title_similarity": "0.14849272",
            "sentiment_compound": 0.3612
        },
        {
            "id": "gzvqmzu",
            "score": 7,
            "text": "Way to give away the secret!!",
            "title_similarity": "0.123892814",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzvqp2c",
            "score": 32,
            "text": "Ft Bragg has a couple of large patches of Venus Flytraps. Oddly enough the Army is--as anyone who's served on large Army posts knows--very serious about keeping the environment in non-training areas as pristine as possible. Yes there is sometimes ordinance lying around from decades back. I believe when Ft Ord on Cali was stood-down much of the area still contained rare plants that are almost extinct in other parts of the state.",
            "title_similarity": "0.7177043",
            "sentiment_compound": -0.25
        },
        {
            "id": "gzvqrmt",
            "score": 14,
            "text": "Pardon my ignorance but is there an animal that eats Venus fly traps?",
            "title_similarity": "0.573967",
            "sentiment_compound": -0.0258
        },
        {
            "id": "gzvrgff",
            "score": 1,
            "text": "Can confirm. I saw wild flytraps on a camping trip with my Scout troop in the late 70's. There were flytraps in the scrub forest behind the latrine trench. I even tried feeding them bits of meat from my sandwich. I remember the name of the place and the highway we turned off of to get there, but I probably couldn't find it again if my life depended on it.",
            "title_similarity": "0.6096833",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzvrmjs",
            "score": 2,
            "text": "Wow they don't grow on Venus but the Carolinas!? I've been lied to my entire life",
            "title_similarity": "0.661308",
            "sentiment_compound": -0.3164
        },
        {
            "id": "gzvrt36",
            "score": 7,
            "text": "Yeah the bog garden down the road tried growing them and they would all be gone the second they sprouted. The weird thing is you can buy seeds anywhere for super cheap. Even the NC Zoo has trouble keeping them.",
            "title_similarity": "0.74038976",
            "sentiment_compound": 0.5267
        },
        {
            "id": "gzvrzpi",
            "score": 1,
            "text": "I listened to a podcast a few years ago (can’t remember which one) about flytrap poachers. It was really interesting. Never knew that was a thing and I’m from NC",
            "title_similarity": "0.54350984",
            "sentiment_compound": 0.4576
        },
        {
            "id": "gzvs3pf",
            "score": 1,
            "text": "TIL people poach plants",
            "title_similarity": "0.28101248",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzvs5wz",
            "score": 1,
            "text": "Used to be plenty of it growing in the [Green Swamp](https://en.m.wikipedia.org/wiki/Green_Swamp_(North_Carolina\\)), til they drained it for a subdivision.",
            "title_similarity": "0.46930784",
            "sentiment_compound": -0.2023
        },
        {
            "id": "gzvs6z4",
            "score": 5,
            "text": "I was blown away when I learned they’re native to only parts of the Carolinas. Growing up and looking at pictures of those I always assumed they were more tropical, like a plant you’d find in the Amazon.",
            "title_similarity": "0.6083479",
            "sentiment_compound": 0.6344
        },
        {
            "id": "gzvsio6",
            "score": 1,
            "text": "And poachers safe from Venus flytraps?",
            "title_similarity": "0.61183137",
            "sentiment_compound": 0.4404
        },
        {
            "id": "gzvsn1z",
            "score": 2,
            "text": "Does it smell while it’s decomposing the bugs?",
            "title_similarity": "0.38781267",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzvsn7p",
            "score": 3,
            "text": "On a relates note about endangered plants and poachers, we lost the last stand of Big Bend Peyote in the wild to poachers last year and is now classified as extinct in the wild. Fucked thing is it was even actually a wild patch, it was a native American peyote garden that was probably a couple of hundred years old. They dug the whole thing up to steal it and deny anyone the possibility of it regrowing like if you just cut the button off the roots.",
            "title_similarity": "0.64324534",
            "sentiment_compound": -0.8979
        },
        {
            "id": "gzvsnd6",
            "score": 1,
            "text": "I’ve buddy rushed all over these things in Camp lejuene... that and cacti... that place sucked...",
            "title_similarity": "0.36601147",
            "sentiment_compound": -0.4588
        },
        {
            "id": "gzvstk4",
            "score": 2,
            "text": "I dated a girl that came from Hertford, in Perquimans county. Her parents lived on the Albemarle sound. I remember visiting them once and her father showing me a spot, at their house, where Venus flytraps grew. It was cool seeing them in a natural setting.",
            "title_similarity": "0.5616604",
            "sentiment_compound": 0.5859
        },
        {
            "id": "gzvt5om",
            "score": 20,
            "text": "They grow naturally a few miles from my house and it's a felony to take em.",
            "title_similarity": "0.6420288",
            "sentiment_compound": -0.5423
        },
        {
            "id": "gzvt7pd",
            "score": 2,
            "text": "There are a shitload of them in woods bay park near where i used to live.",
            "title_similarity": "0.34372103",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzvt8pc",
            "score": 3,
            "text": "There’s an interesting podcast episode about [Venus Fly Traps from Criminal](https://thisiscriminal.com/episode-five-dropping-like-flies-4-24-2014/).",
            "title_similarity": "0.4515584",
            "sentiment_compound": 0.4019
        },
        {
            "id": "gzvtjja",
            "score": 2,
            "text": "Makes sense why my Amazon ordered Venus fly trap cane from NC. TIL as well",
            "title_similarity": "0.48157394",
            "sentiment_compound": 0.128
        },
        {
            "id": "gzvu1x6",
            "score": 3,
            "text": "I know two locations where sundews grow, and since they are likely to be taken by unscrupulous collectors if the locations became public, I keep these locations a secret. They're not endangered, but they're a lovely natural feature that I'd hate to see destroyed.",
            "title_similarity": "0.7281617",
            "sentiment_compound": -0.2263
        },
        {
            "id": "gzvu4qq",
            "score": 2,
            "text": "This is the same for the Ghost Orchid in Florida. \n\n\n“Experts at University of Florida Extension estimate that there are only about 2,000 ghost orchid plants growing wild in Florida, although recent data suggests there may be significantly more.”",
            "title_similarity": "0.6038471",
            "sentiment_compound": -0.4404
        },
        {
            "id": "gzvua55",
            "score": 2,
            "text": "you’d wonder what they put in the water to cause such wild plants to grow and then realize their natural range is centered just a few miles north of Myrtle Beach",
            "title_similarity": "0.51348656",
            "sentiment_compound": 0.3612
        },
        {
            "id": "gzvud0y",
            "score": 1,
            "text": "Fun fact, the vast majority of what they eat are beetles and ground-dwelling insects. They don’t eat flies nearly as often.",
            "title_similarity": "0.54099125",
            "sentiment_compound": 0.5106
        },
        {
            "id": "gzvuee9",
            "score": 2,
            "text": "[deleted]",
            "title_similarity": "0.07246603"
        },
        {
            "id": "gzvulon",
            "score": 1,
            "text": "Venus fly traps can also count to at least 3.",
            "title_similarity": "0.3504984",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzvunqi",
            "score": 3,
            "text": "IIRC carnivory evolves in plants that are in places with poor quality soil with low nitrogen levels and phosphorus so they consume small animals to make up that loss.",
            "title_similarity": "0.5803379",
            "sentiment_compound": -0.7579
        },
        {
            "id": "gzvuqr1",
            "score": 1,
            "text": "Downvoting so poachers less likely to see.",
            "title_similarity": "0.4599704",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzvuu11",
            "score": 1,
            "text": "I had no idea they’re local!  I’m going to have to grow some now lol",
            "title_similarity": "0.33292392",
            "sentiment_compound": 0.2244
        },
        {
            "id": "gzvv2bn",
            "score": 3,
            "text": "Fuckin poachers lmao",
            "title_similarity": "0.21474785",
            "sentiment_compound": 0.6344
        },
        {
            "id": "gzvvd37",
            "score": 1,
            "text": "That's pretty cool tbh",
            "title_similarity": "-0.05219228",
            "sentiment_compound": 0.6705
        },
        {
            "id": "gzvvly3",
            "score": 3,
            "text": "True. Lived very close to one of the state parks where you could find those and pitcher plants.",
            "title_similarity": "0.2860362",
            "sentiment_compound": 0.4215
        },
        {
            "id": "gzvvw43",
            "score": 2,
            "text": "Sucks that people do that, but I've always wondered if that info is subject to a FOIA request.",
            "title_similarity": "0.4508771",
            "sentiment_compound": -0.1901
        },
        {
            "id": "gzvw0so",
            "score": 2,
            "text": "I thought they were native to Walmart.",
            "title_similarity": "0.31936222",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzvw1t7",
            "score": 2,
            "text": "There’s a podcast I think criminal cover this story,it’s super interesting like there’s a whole black market for real Venus flytraps and the mafia is involve in it.",
            "title_similarity": "0.4694262",
            "sentiment_compound": 0.6908
        },
        {
            "id": "gzvwfem",
            "score": 2,
            "text": "[deleted]",
            "title_similarity": "0.07246606"
        },
        {
            "id": "gzvwg41",
            "score": 4,
            "text": "I know it’s really dumb but I’ve never thought of them growing naturally. Boggles my mind",
            "title_similarity": "0.5199758",
            "sentiment_compound": -0.0635
        },
        {
            "id": "gzvwg62",
            "score": 2,
            "text": "I grew up with venus flytraps in my backyard. We learned early on that you shouldn’t mess with them but they were really cool to watch grow.",
            "title_similarity": "0.7185825",
            "sentiment_compound": 0.3898
        },
        {
            "id": "gzvwgzy",
            "score": 2,
            "text": "I want to have a garden of these near my house.",
            "title_similarity": "0.23971191",
            "sentiment_compound": 0.0772
        },
        {
            "id": "gzvwp99",
            "score": 2,
            "text": "Also belongs in r/interestingasfuck",
            "title_similarity": "-0.04342353",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzvwqbl",
            "score": 1,
            "text": "Why do poachers ruin everything?",
            "title_similarity": "0.29227954",
            "sentiment_compound": -0.5859
        },
        {
            "id": "gzvwqyc",
            "score": 2,
            "text": "Canadian Maritimer here. We also have two carnivorous plants native to here, the Sundew, and the Pitcher Plant. Although not as dramatic at the flytrap, they're equally as cool, and just as deadly (to bugs). They also grow in abundance, and can be readily found in any bog, of which we have many.",
            "title_similarity": "0.5746496",
            "sentiment_compound": 0.3182
        },
        {
            "id": "gzvwr89",
            "score": 1,
            "text": "And Instagramers!",
            "title_similarity": "0.053958092",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzvwv1s",
            "score": 2,
            "text": "How much profit is there in this poaching scheme, really?\n\nSeems pretty entry level.",
            "title_similarity": "0.22217563",
            "sentiment_compound": 0.749
        },
        {
            "id": "gzvx479",
            "score": 1,
            "text": "[David Attenboro voice] The flies however.... are truly fucked.",
            "title_similarity": "0.27768487",
            "sentiment_compound": -0.3612
        },
        {
            "id": "gzvxoo2",
            "score": 3,
            "text": "This is mostly true, but what the article also fails to mention is that because Dionaea muscipula only grows in bogs and marshes, it does not crop up in the same locations season to season. The varying water depths their habitat faces means that you may not find them in the same spot as they were the previous year and they can appear and disappear sporadically, making their current actual location hard to track.",
            "title_similarity": "0.7246644",
            "sentiment_compound": -0.6956
        },
        {
            "id": "gzvxw1z",
            "score": 1,
            "text": "Yup. I went to a local state park hiking trail hoping to see some but I couldn’t find any",
            "title_similarity": "0.65249085",
            "sentiment_compound": 0.2263
        },
        {
            "id": "gzvy62g",
            "score": 3,
            "text": "[deleted]",
            "title_similarity": "0.07246606"
        },
        {
            "id": "gzvy63k",
            "score": 2,
            "text": "The world needs more Venus flytraps.",
            "title_similarity": "0.37602425",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzvy8x1",
            "score": 1,
            "text": "Imagine how weird of a person a Venus fly trap poacher must be lol",
            "title_similarity": "0.4297496",
            "sentiment_compound": -0.0516
        },
        {
            "id": "gzvygy8",
            "score": 1,
            "text": "Venus Flytraps still get most of their food through photosynthesis and not eating flies.",
            "title_similarity": "0.7176205",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzvyhk4",
            "score": 1,
            "text": "Can't they just take a cutting and grow their own?",
            "title_similarity": "0.3674443",
            "sentiment_compound": -0.128
        },
        {
            "id": "gzvyk3l",
            "score": 1,
            "text": "To find a Venus Flytrap, just tune into WKRP in Cincinnaaatiiiiiiiiiiiiiii",
            "title_similarity": "0.39334422",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzvz1ob",
            "score": 1,
            "text": "The article doesnt mention where???",
            "title_similarity": "0.29778916",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzvz6vh",
            "score": 2,
            "text": "This is correct. Over at /r/SavageGarden youre not supposed to put the location if you’re posting pics of carnivorous plants in the wild.",
            "title_similarity": "0.67544687",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzvzdm8",
            "score": 1,
            "text": "My great aunt from South Carolina got me a Venus Flytrap when I was a kid, they grew right next to her house. I just sat there poking it with a pen for hours.",
            "title_similarity": "0.5158623",
            "sentiment_compound": 0.6249
        },
        {
            "id": "gzvzoi4",
            "score": 2,
            "text": "Really? I saw them all over the place in the Green Swamp Reserve and not a ranger in sight.",
            "title_similarity": "0.60298294",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzvzsjs",
            "score": 2,
            "text": "TIL that plant poachers existed. When I hear poacher I normally think of animal poachers",
            "title_similarity": "0.47281122",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzvzswf",
            "score": 3,
            "text": "It's sad that they can't be taught to eat poachers.",
            "title_similarity": "0.56276447",
            "sentiment_compound": -0.4767
        },
        {
            "id": "gzvzuhj",
            "score": 1,
            "text": "They grow wild in my parents yard on the coast of NC.",
            "title_similarity": "0.44741654",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzw06i4",
            "score": 2,
            "text": "The meteorite that carried them here also landed in a secret location.",
            "title_similarity": "0.48493433",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzw07o4",
            "score": 2,
            "text": "I learned this when I was in the Marines and stationed at Camp Lejeuene. I managed to stumble across a few in the woods during a field op",
            "title_similarity": "0.46744484",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzw0c3f",
            "score": 1,
            "text": "Carolina people: \"Say what now? I wanna go find one!\"",
            "title_similarity": "0.10983993",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzw0duz",
            "score": 1,
            "text": "the podcast Criminal did a really interesting episode about this",
            "title_similarity": "0.2216693",
            "sentiment_compound": -0.1045
        },
        {
            "id": "gzw0enq",
            "score": 1,
            "text": "It's worded like a dare. Like how they pretend they hide the location of the world's tallest tree and I still found it. Guess I know what to do if I'm in the carolinas",
            "title_similarity": "0.4975104",
            "sentiment_compound": 0.4404
        },
        {
            "id": "gzw0p11",
            "score": 2,
            "text": "The carolinas have a few rarities. Largest high quality quartz deposits in the world. The hiddennite emerald , possums , fly traps, hillbillies and parrot heads",
            "title_similarity": "0.3684762",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzw0qhm",
            "score": 1,
            "text": "Live in that area. There’s some parks that straight up advertise the location.",
            "title_similarity": "0.20911878",
            "sentiment_compound": 0.2263
        },
        {
            "id": "gzw0w58",
            "score": 1,
            "text": "Where do they grow?",
            "title_similarity": "0.08590227",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzw1a6v",
            "score": 1,
            "text": "Wait... poachers? Can someone explain? I have iq 0",
            "title_similarity": "0.22515681",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzw1all",
            "score": 1,
            "text": "They can be found in the Green Swamp Ecological Preserve in Brunswick County, although not without about a mile of hiking through pine savannah & a few pockets of thick pocosin brush. They make you work for it if you wanna see them in their natural element, but it’s worth it.",
            "title_similarity": "0.5015406",
            "sentiment_compound": 0.4767
        },
        {
            "id": "gzw1jum",
            "score": 1,
            "text": "I just bought a mess of Venus Flytraps for my grandson. The local grocery store had them for sale.",
            "title_similarity": "0.5755495",
            "sentiment_compound": -0.3612
        },
        {
            "id": "gzw1mux",
            "score": 2,
            "text": "Can confirm Carolina beach state park has them growing in the wild",
            "title_similarity": "0.37178448",
            "sentiment_compound": 0.1779
        },
        {
            "id": "gzw1nim",
            "score": 1,
            "text": "There are other carnivorous plants that grow wild in the Carolinas that you can see! I asked a wildlife refuge near the outer banks where to see wild yellow pitchers and they were able to point me to a spot where they grow like crazy.",
            "title_similarity": "0.60619843",
            "sentiment_compound": 0.1007
        },
        {
            "id": "gzw1pdn",
            "score": 2,
            "text": "This is a good way to keep the secret",
            "title_similarity": "0.2586801",
            "sentiment_compound": 0.4404
        },
        {
            "id": "gzw1tzz",
            "score": 1,
            "text": "I've found them in the wild while exploring some parks when I went to school in NC. Really is amazing to see them just growing inconspicuously among the pines and such",
            "title_similarity": "0.5740348",
            "sentiment_compound": 0.6983
        },
        {
            "id": "gzw1u0u",
            "score": 1,
            "text": "Do these available in garden centers? I guess those work for mosquitoes or bugs control ;)",
            "title_similarity": "0.5171792",
            "sentiment_compound": 0.2263
        },
        {
            "id": "gzw1u94",
            "score": 1,
            "text": "The reason they grow in the areas they do (and why they don't grow other places) is the acidic soil, which is also why they are carnivorous. \n\nThey are fascinating plants, definitely worth reading about. They are also pretty finnicky, so don't get one unless you have done a lot of research and know how to properly care for it.",
            "title_similarity": "0.59774727",
            "sentiment_compound": 0.926
        },
        {
            "id": "gzw1wib",
            "score": 1,
            "text": "People can’t grow their own shit??",
            "title_similarity": "0.40992543",
            "sentiment_compound": -0.6072
        },
        {
            "id": "gzw1xjc",
            "score": 1,
            "text": "Why don't they uhhh... Give them seeds?",
            "title_similarity": "0.26684391",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzw226c",
            "score": 1,
            "text": "oh gosh! there was something about it the other day. like the flowers grow way up high or something so it doesnt starve itself to death.",
            "title_similarity": "0.35509828",
            "sentiment_compound": 0.1435
        },
        {
            "id": "gzw2dfz",
            "score": 3,
            "text": "That's why you don't ask the park rangers for their location. You go to someone with a particular interest in seeing the plants gone. Talk to a fly.",
            "title_similarity": "0.6600344",
            "sentiment_compound": 0.4588
        },
        {
            "id": "gzw39v8",
            "score": 1,
            "text": "NC here. If you visit Wilmington, Dirty Myrtle or anywhere near the Carolina coast, they’re actually easy to spot and are around if you venture into wooded areas. \n\nMy brother and I used to “feed them” whenever we’d visit family near the coast. \n\nThey’re everywhere if you care to look hard enough.",
            "title_similarity": "0.5557069",
            "sentiment_compound": 0.4215
        },
        {
            "id": "gzw3ljc",
            "score": 2,
            "text": "Who the fuck steals a plant? Marijuana makes sense but a Flytrap, whoever these poachers are that steal plants need to get their priorities strait if they think stealing a fucking plant is a viable life choice.",
            "title_similarity": "0.5814936",
            "sentiment_compound": -0.9294
        },
        {
            "id": "gzw3pnc",
            "score": 2,
            "text": "Same with pitcher plant bogs in Georgia, but bogs also have to be protected from wild boar wallowing",
            "title_similarity": "0.6283541",
            "sentiment_compound": 0.5927
        },
        {
            "id": "gzw3uh6",
            "score": 2,
            "text": "Wtf, naturally grows in the Carolinas? I thought they were tropical that grew in South America.",
            "title_similarity": "0.3846958",
            "sentiment_compound": -0.5859
        },
        {
            "id": "gzw45h4",
            "score": 23,
            "text": "I still don't understand why people poach Venus fly traps. They are the most available carnivorous plant in US. You can literally walk down to any Lowes or Home depot and they sell them in the shitty death cubes. Who is buying poached VFTs?",
            "title_similarity": "0.67730796",
            "sentiment_compound": -0.8176
        },
        {
            "id": "gzw465n",
            "score": 3,
            "text": "[California Carnivores](https://www.californiacarnivores.com/) is a good source.",
            "title_similarity": "0.24090493",
            "sentiment_compound": 0.4404
        },
        {
            "id": "gzw4g57",
            "score": 1,
            "text": "My school, UNCC has a few of them in our greenhouse. They are oddly pretty for a carnivorous plant.\nWe also have a few corpse flowers. We named one Rotney The Magnifiscent. I saw him on the last day of bloom, and he was indeed magnificent, but with surprisingly little scent.",
            "title_similarity": "0.6245876",
            "sentiment_compound": 0.6124
        },
        {
            "id": "gzw4str",
            "score": 1,
            "text": "I grew up near an area where they naturally grew (along with other insect eating plants)\n\nAs a kid I thought these things were normal and prevalent.",
            "title_similarity": "0.47047055",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzw4urz",
            "score": 2,
            "text": "Humans...anything for money. Poachers makes them sound like non threatening breakfast enthusiast 🤣",
            "title_similarity": "0.3595345",
            "sentiment_compound": 0.5859
        },
        {
            "id": "gzw4zg9",
            "score": 2,
            "text": "My dream is to set an army of them in the front of my yard to kill wasps",
            "title_similarity": "0.4391291",
            "sentiment_compound": -0.5719
        },
        {
            "id": "gzw530q",
            "score": 4,
            "text": "Unfortunately they are draining a lot of the bogs in the areas around Myrtle Beach and up to Wilmington, prime area for these things, to make way for more endless development.",
            "title_similarity": "0.4125548",
            "sentiment_compound": -0.34
        },
        {
            "id": "gzw596i",
            "score": 2,
            "text": "Don't these plants have very specific environmental requirements? I would think it'd be hard to poach something if you don't have the proper environment to care for it.. and if you did have the environment they're not illegal why not just breed them and sell them in a nursery instead?",
            "title_similarity": "0.6277256",
            "sentiment_compound": 0.7256
        },
        {
            "id": "gzw5fbo",
            "score": 1,
            "text": "Can we make Africa's \"shoot poachers on sight\"-policy a universal law?",
            "title_similarity": "0.30873704",
            "sentiment_compound": -0.34
        },
        {
            "id": "gzw5oea",
            "score": 1,
            "text": "The podcast Criminal had a great episode about a crime ring in North Carolina that stole fly traps. Worth a listen: https://thisiscriminal.com/episode-five-dropping-like-flies-4-24-2014/",
            "title_similarity": "0.4396987",
            "sentiment_compound": -0.2263
        },
        {
            "id": "gzw5pju",
            "score": 2,
            "text": "I’m a little confused here. Why poach these plants when you can buy them relatively cheap at any plant store?",
            "title_similarity": "0.57896316",
            "sentiment_compound": -0.2516
        },
        {
            "id": "gzw5xrf",
            "score": 1,
            "text": "Today I learned that people poach Venus fly traps",
            "title_similarity": "0.5106142",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzw6l20",
            "score": 1,
            "text": "I'm now imagining a crooked park ranger being paid off by the plant black market to reveal the secret hidy holes.",
            "title_similarity": "0.5410714",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzw6wwk",
            "score": 1,
            "text": "I live in SW NC and am able to keep them in my yard, along with many other carnivorous plants. My favorite is Jack In The Pulpit.",
            "title_similarity": "0.42024958",
            "sentiment_compound": 0.4588
        },
        {
            "id": "gzw77if",
            "score": 1,
            "text": "They have a Venus fly trap trail that you can walk and see them. Not very secret. I have walked it with my nephew's almost every year.",
            "title_similarity": "0.5470439",
            "sentiment_compound": -0.3182
        },
        {
            "id": "gzw793v",
            "score": 1,
            "text": "They grow very easily (potted, on window sills and such) on the west coast. The world’s largest carnivorous plant greenhouse, California Carnivores, is located in Northern California.",
            "title_similarity": "0.35264412",
            "sentiment_compound": 0.4005
        },
        {
            "id": "gzw7r5g",
            "score": 2,
            "text": "I saw them last weekend. They have one in public that show people in a high traffic area. Apparently the rest are only swamp areas that are difficult to get to which also adds to why they are so difficult to grow.\n\n[Venus Fly Trap with a bonus Pitcher Plant. Both are carnivorous and native to North Carolina.](http://imgur.com/gallery/nyLdm60)",
            "title_similarity": "0.6713656",
            "sentiment_compound": -0.5486
        },
        {
            "id": "gzw7s9i",
            "score": 1,
            "text": "People poach Venus Fly Traps?",
            "title_similarity": "0.45731837",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzw86t1",
            "score": 1,
            "text": "Need to surround my house with these to catch mosquitos.",
            "title_similarity": "0.46418083",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzw8h30",
            "score": 2,
            "text": "Got it narrowed down to the Carolinas...",
            "title_similarity": "0.11920423",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzw8vdx",
            "score": 3,
            "text": "I had a venus flytrap when I was a kid, but it died because I thought it was hungry and I gave it a tiny bit of a mcdonald's hamburger.",
            "title_similarity": "0.5686617",
            "sentiment_compound": -0.7096
        },
        {
            "id": "gzw96nx",
            "score": 3,
            "text": "Why can't we have nice things? This right here.",
            "title_similarity": "0.15600474",
            "sentiment_compound": -0.3252
        },
        {
            "id": "gzw9c8g",
            "score": 3,
            "text": "But.... Why do people go collect them in the wild? Why not grow them or just buy from a garden store?",
            "title_similarity": "0.5674274",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzwadlj",
            "score": 1,
            "text": "Why poach them?  \nYou can buy them in every gardening market here.",
            "title_similarity": "0.3489477",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzwahqh",
            "score": 2,
            "text": "I visited Flytrap Trail (NC) a couple of months ago! Very cool place. They grow right next to two other carnivorous species: pitcher plants and sundews. [Here are some pics I took. ](https://imgur.com/gallery/hZLRjgB)",
            "title_similarity": "0.50719804",
            "sentiment_compound": 0.4376
        },
        {
            "id": "gzwapbe",
            "score": 2,
            "text": "If the conditions are right, Flytraps will grow like weeds, same as Pitcher Plants, and the right conditions are just distilled water in a self watering pot with non-fertilized peat and full sun (outdoors all the time).\nIf anyone is interested in buying these plants, check out https://www.californiacarnivores.com/ or https://www.petflytrap.com/ both nurseries ship worldwide.",
            "title_similarity": "0.6231676",
            "sentiment_compound": 0.6369
        },
        {
            "id": "gzwb6iu",
            "score": 14,
            "text": "[I’ve been to one.](https://m.imgur.com/a/vzkUl)",
            "title_similarity": "0.039263736",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzwb8bc",
            "score": 1,
            "text": "*to keep poachers safe from them.",
            "title_similarity": "0.5021939",
            "sentiment_compound": 0.4404
        },
        {
            "id": "gzwbts0",
            "score": 2,
            "text": "Gee I thought they only came from like South America in the rainforest or something. No idea they grew here",
            "title_similarity": "0.5444441",
            "sentiment_compound": 0.0772
        },
        {
            "id": "gzwc7mc",
            "score": 1,
            "text": "Yeah people think its because of the demand for this fucking carnivora supplement famously advertised on christian radio",
            "title_similarity": "0.35802794",
            "sentiment_compound": 0.1779
        },
        {
            "id": "gzwcaaq",
            "score": 2,
            "text": "I grew up with a guy who is a superintendent at one of those parks in Columbus County. Anytime I ask where the fly traps are he says “that part is under water, you can’t collect here anyways.”",
            "title_similarity": "0.6985595",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzwcck4",
            "score": 3,
            "text": "They grow somewhat commonly in geographic features known as \"Carolina Bays\" which are large oval depressions in the landscape of unusual and indeterminate origin. Very interesting features and a modern unsolved mystery as to their origins.",
            "title_similarity": "0.2901946",
            "sentiment_compound": -0.0534
        },
        {
            "id": "gzwcyij",
            "score": 1,
            "text": "I don't know how true this actually is. I lived in NC for a while and we regularly went to one of the state parks that had a Venus fly trap trail where you had the possibility of seeing one but you had to look for it. It was part of the fun but it wasn't a secret that they were there.",
            "title_similarity": "0.6919078",
            "sentiment_compound": 0.4826
        },
        {
            "id": "gzwdsil",
            "score": 1,
            "text": "TIL Venus fly traps are native to the Carolinas, not rainforests.",
            "title_similarity": "0.60826766",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzwdvhq",
            "score": 2,
            "text": "My 5 year old wants one of these very badly.",
            "title_similarity": "0.16924515",
            "sentiment_compound": -0.5256
        },
        {
            "id": "gzween9",
            "score": 1,
            "text": "People who've actually managed to keep a store bought healthy looking Venus fly-trap alive, whats your secret? I've been trying for fifteen years to keep one alive, less sun, more water, less sun, less water, more sun, more water, more sun, less water. It doesn't matter, they are dead within a week or two. Longest that lasted was a month after looking dead, coming back, and finally dying.",
            "title_similarity": "0.60507715",
            "sentiment_compound": -0.4164
        },
        {
            "id": "gzweoy7",
            "score": 1,
            "text": "There is an interesting podcast episode of Criminal that covers the poachin industry of fly traps.",
            "title_similarity": "0.42492318",
            "sentiment_compound": -0.1779
        },
        {
            "id": "gzwf223",
            "score": 1,
            "text": "I live down the road from these natural fly traps.  It's a big time felony if you're caught poaching them.  We also have the carnivorous pitcher plants in the same area.",
            "title_similarity": "0.6654713",
            "sentiment_compound": -0.25
        },
        {
            "id": "gzwgde1",
            "score": 1,
            "text": "Sounds like Axolotls, which only exist in like 2 lakes in Mexico and are threatened but somehow they make their way into fish tanks around the world.",
            "title_similarity": "0.53687775",
            "sentiment_compound": 0.128
        },
        {
            "id": "gzwgnjp",
            "score": 1,
            "text": "They cost like $5 at Walmart why would anyone poach them",
            "title_similarity": "0.4274188",
            "sentiment_compound": 0.3612
        },
        {
            "id": "gzwh4nh",
            "score": 1,
            "text": "Why poach them when they are cheap and available from garden stores?",
            "title_similarity": "0.4770704",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzwheyd",
            "score": 2,
            "text": "And here I thought they were only native to Venus!\n\nYou learn something new everyday!",
            "title_similarity": "0.40433222",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzwhg3u",
            "score": 4,
            "text": "Poaching of rare plants is an issue in general. If you take pictures of rare plants and post them online remove whatever geolocation tag is on the picture to prevent people from finding and poaching the plants.",
            "title_similarity": "0.67103314",
            "sentiment_compound": 0.0258
        },
        {
            "id": "gzwhj40",
            "score": 1,
            "text": "r/savagegarden",
            "title_similarity": "0.026518289",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzwhpne",
            "score": 1,
            "text": "Poaching is a much better option than boiling, it keeps em tender",
            "title_similarity": "0.3095615",
            "sentiment_compound": 0.4404
        },
        {
            "id": "gzwi6uj",
            "score": 1,
            "text": "Interesting thing to poach",
            "title_similarity": "-0.0043070987",
            "sentiment_compound": 0.4019
        },
        {
            "id": "gzwi8op",
            "score": 2,
            "text": "you can find em in power line corridors all over the carolinas.",
            "title_similarity": "0.25522932",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzwixw4",
            "score": 1,
            "text": "They’re also known to occur naturally in certain parts of Cincinnati.",
            "title_similarity": "0.21575753",
            "sentiment_compound": 0.2732
        },
        {
            "id": "gzwj2g8",
            "score": 1,
            "text": "We used to have some in our yard when I was a kid",
            "title_similarity": "0.29324934",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzwjp0g",
            "score": 1,
            "text": "Why are people poaching flytraps? Just because the rarer it is the more people want it?",
            "title_similarity": "0.49767202",
            "sentiment_compound": 0.2355
        },
        {
            "id": "gzwjttb",
            "score": 1,
            "text": "I was just at a park that has them a few minutes ago. It's a pretty big deal if you mess with them.",
            "title_similarity": "0.42159098",
            "sentiment_compound": 0.1779
        },
        {
            "id": "gzwkd8y",
            "score": 1,
            "text": "Interesting. I wonder how many fistfights have taken place between a poacher and a ranger.",
            "title_similarity": "0.39449936",
            "sentiment_compound": 0.4019
        },
        {
            "id": "gzwkdw7",
            "score": 2,
            "text": "Then they take human form as DJ's in Cincinnati.",
            "title_similarity": "0.16303709",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzwknb5",
            "score": 2,
            "text": "Wow - these grew wild in my grandma’s backyard when I was a kid. The world has really changed in the last 50 years. Understatement.",
            "title_similarity": "0.41722637",
            "sentiment_compound": 0.5859
        },
        {
            "id": "gzwma7q",
            "score": 1,
            "text": "Til there are Venus Fly Trap poachers",
            "title_similarity": "0.4447959",
            "sentiment_compound": -0.3182
        },
        {
            "id": "gzwmghe",
            "score": 2,
            "text": "Man first poached eggs and now this? Do Venus flytrap even taste good?",
            "title_similarity": "0.50043035",
            "sentiment_compound": 0.504
        },
        {
            "id": "gzwmiif",
            "score": 2,
            "text": "I used to work with endangered purple mountain pitcher plants in georgia. We weren’t allowed to take pictures or post about it because poachers would steal them and sell them. What a dumb thing to do.",
            "title_similarity": "0.7643583",
            "sentiment_compound": -0.7579
        },
        {
            "id": "gzwmlrv",
            "score": 1,
            "text": "Feed the poachers to Audrey 2.",
            "title_similarity": "0.23948093",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzwmpqw",
            "score": 1,
            "text": "I have one at home for a few years and it's doing pretty well, just don't put flies in them to see them close up, it take a tremendous amount of energy for it to close up it copuld kill it..",
            "title_similarity": "0.60126543",
            "sentiment_compound": 0.2415
        },
        {
            "id": "gzwnd1b",
            "score": 1,
            "text": "Thanks for telling everyone",
            "title_similarity": "-0.0019907914",
            "sentiment_compound": 0.4404
        },
        {
            "id": "gzwnehh",
            "score": 1,
            "text": "Wow and here I thought they were from the Amazon.",
            "title_similarity": "0.10247585",
            "sentiment_compound": 0.6705
        },
        {
            "id": "gzwnqi1",
            "score": 1,
            "text": "I almost bought some today at the greenhouse.",
            "title_similarity": "0.3854543",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzwo2i2",
            "score": 1,
            "text": "Fly activists...",
            "title_similarity": "0.112224996",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzwo9q3",
            "score": 1,
            "text": "So that’s why Carnivine is a regional over there...",
            "title_similarity": "0.22266507",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzwoiqt",
            "score": 1,
            "text": "If you're interested in purchasing one. You gotta check out the Killer Plant Company. They sell giant ones online and they are sick!",
            "title_similarity": "0.4276894",
            "sentiment_compound": -0.7345
        },
        {
            "id": "gzwokef",
            "score": 1,
            "text": "Poachers?",
            "title_similarity": "0.14610276",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzwoqdq",
            "score": 1,
            "text": "What is this like reverse marijuana production or something",
            "title_similarity": "0.20354922",
            "sentiment_compound": 0.4357
        },
        {
            "id": "gzwpl54",
            "score": 2,
            "text": "We have a fairly large bog garden of fly traps, but in our climate we have to bring in into a heated garage in the winter months so it will  not freeze hard.  It has done well for several years now.",
            "title_similarity": "0.5323502",
            "sentiment_compound": 0.4352
        },
        {
            "id": "gzwpoty",
            "score": 1,
            "text": "I was on a river trip and learned that it's the same with peyote in Big Bend. Pretty neat to know it's out there like that.",
            "title_similarity": "0.2815895",
            "sentiment_compound": 0.8271
        },
        {
            "id": "gzwqpls",
            "score": 2,
            "text": "TIL people poach Venus flytraps",
            "title_similarity": "0.4833045",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzwr2ik",
            "score": 1,
            "text": "It's a cool coincidence that the Flytrap, a very unusual plant, can only be found growing around the Johnsonville impact crater area. Seeds from space?",
            "title_similarity": "0.57986677",
            "sentiment_compound": 0.4588
        },
        {
            "id": "gzwrolq",
            "score": 1,
            "text": "You can find them in many places here still",
            "title_similarity": "-0.056203194",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzwrtq5",
            "score": 5,
            "text": "What sort of spineless idiot poaches a plant? You can literally just grow them",
            "title_similarity": "0.49440044",
            "sentiment_compound": -0.5563
        },
        {
            "id": "gzwuk2j",
            "score": 1,
            "text": "They grow roughly within 50 miles of Wilmington in Carolina Bay lands, which are just as fascinating as the flytraps. They’re really not that hard to find if you know what to look for. They’re plentiful in the Green Swamp and around Lake Waccamaw. They also grow super low to the ground, so you could walk over them and not even notice.",
            "title_similarity": "0.67898256",
            "sentiment_compound": 0.782
        },
        {
            "id": "gzwuojc",
            "score": 6,
            "text": "I fucking hate poachers. There used to be a little nature trail behind my old house that my neighbor and I made. It ran beside the creek. We put a chiminea and some chairs and a bench and a sundial back there. We welcomed our neighbors to get back there and enjoy it. One day I saw this couple I'd never seen before going back into the trail with shovels and several 5 gallon buckets. They weren't back there long, maybe ten or fifteen minutes before they left. But after about an hour they returned with buckets and shovels again so I put my shoes on and went back to inquire. They were digging up all the fucking trillium... I mean ALL the trillium.",
            "title_similarity": "0.59073293",
            "sentiment_compound": 0.0781
        },
        {
            "id": "gzwv61x",
            "score": 1,
            "text": "If you live in NC, you can get a [Venus flytrap license plate.](https://www.reddit.com/r/Charlotte/comments/n4qakt/venus_flytrap_license_plate_guy_update_it_was/?utm_source=share&utm_medium=ios_app&utm_name=iossmf)",
            "title_similarity": "0.43310088",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzwvh85",
            "score": 1,
            "text": "Interesting fact, poaching or intentionally harming one in the wild is a felony as they currently only grow in 15 counties.",
            "title_similarity": "0.62417996",
            "sentiment_compound": -0.6597
        },
        {
            "id": "gzwvjwx",
            "score": 1,
            "text": "I've seen them growing in the wild in Maryland before",
            "title_similarity": "0.3487512",
            "sentiment_compound": 0.1779
        },
        {
            "id": "gzww674",
            "score": 1,
            "text": "Apologies if someone has already mentioned it, but there is a great episode of the Criminal podcast about the black market trade in these plants and accounts of fly trap heists",
            "title_similarity": "0.4876297",
            "sentiment_compound": -0.2263
        },
        {
            "id": "gzwwbtv",
            "score": 1,
            "text": "lol why poach a plant?? Lmao just grow one dude",
            "title_similarity": "0.48899612",
            "sentiment_compound": 0.7941
        },
        {
            "id": "gzwws67",
            "score": 1,
            "text": "I've come across a few very near a trail. They weren't healthy because it was relatively high spot. Only a matter of inches, but it still meant less chance of keeping the roots wet. Never saw them again, though I looked each time I was there. I'm sure they were poached.",
            "title_similarity": "0.63000804",
            "sentiment_compound": 0.5317
        },
        {
            "id": "gzwy1mz",
            "score": 1,
            "text": "I used to live in eastern NC and the shopping center was newly built and everyone told me that before it was there a bunch of Venus Fly traps used to grow there. I always thought that was a shame.   And that it was really cool I lived where there were native to but I never found one in the wild the year I was there.",
            "title_similarity": "0.70436954",
            "sentiment_compound": -0.0653
        },
        {
            "id": "gzwz4ig",
            "score": 1,
            "text": "The location of the oldest known tree is also kept a secret to protect it from vandals. I believe the trees grove is public knowledge but which tree is the oldest is kept a secret.\n\nIt would be the 2nd oldest but the 1st oldest was cut down decades ago for research purposes (they had no idea it was THE oldest until after it was cut down and examined).\n\n[https://en.wikipedia.org/wiki/Prometheus\\_(tree)](https://en.wikipedia.org/wiki/Prometheus_(tree))\n\n[https://en.wikipedia.org/wiki/Methuselah\\_(tree)](https://en.wikipedia.org/wiki/Methuselah_(tree))\n\nThe worlds tallest tree is also in California.\n\n[https://en.wikipedia.org/wiki/Hyperion\\_(tree)](https://en.wikipedia.org/wiki/Hyperion_(tree))",
            "title_similarity": "0.72169936",
            "sentiment_compound": -0.743
        },
        {
            "id": "gzwzhku",
            "score": 1,
            "text": "Seeing the irony of this post",
            "title_similarity": "-0.01782728",
            "sentiment_compound": -0.0516
        },
        {
            "id": "gzx0jey",
            "score": 1,
            "text": "I live in Newfoundland it’s our provincial\nPlant and grows wild on the bogs…",
            "title_similarity": "0.40883863",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzx13d0",
            "score": 1,
            "text": "I don’t know why but I’d be scared of the environment where Venus Flytraps are growing NATURALLY. The land itself craves flesh....",
            "title_similarity": "0.62329197",
            "sentiment_compound": -0.4215
        },
        {
            "id": "gzx1dch",
            "score": 1,
            "text": "SHUT YOUR FLYTRAP! Always had a better ring to it than Shut yer PieHole.",
            "title_similarity": "0.38465092",
            "sentiment_compound": 0.4926
        },
        {
            "id": "gzx1ws3",
            "score": 1,
            "text": "I am from said area, and I can't stand poachers. You can purchase the plants at most local garden centers, so it isn't like they aren't available elsewhere. S/o to the conservationists that have fought for wild VFT areas to be preserved!",
            "title_similarity": "0.7264037",
            "sentiment_compound": -0.608
        },
        {
            "id": "gzx20t2",
            "score": 1,
            "text": "That’s why on Pokémon go, the Pokémon Carnivine is only found in south East USA",
            "title_similarity": "0.5927594",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzx2awd",
            "score": 1,
            "text": "I can’t get mine to live barely a season wife bought one few weeks ago and it’s dying",
            "title_similarity": "0.45546",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzx2dlq",
            "score": 1,
            "text": "Parasitic plants grow in loads of places, yet everyone thinks they don't. I'm a biologist and have found tons of them in cold bogs in Belgium.",
            "title_similarity": "0.6362763",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzx2wt5",
            "score": 1,
            "text": "Spoiler alert!",
            "title_similarity": "-0.07006056",
            "sentiment_compound": 0.3595
        },
        {
            "id": "gzx2yvo",
            "score": 1,
            "text": "So, out of curiosity, are they considered vegan if one were to eat it?",
            "title_similarity": "0.46526563",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzx31zo",
            "score": 1,
            "text": "Yup.",
            "title_similarity": "-0.1794868",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzx3k69",
            "score": 1,
            "text": "Venus flytraps are by far my favorite plant",
            "title_similarity": "0.47362092",
            "sentiment_compound": 0.4588
        },
        {
            "id": "gzx3tif",
            "score": 1,
            "text": "Whoa... someone reads information from somewhere other than Wikipedia??? What a relief",
            "title_similarity": "0.28558236",
            "sentiment_compound": 0.5632
        },
        {
            "id": "gzx4ac3",
            "score": 1,
            "text": "I wanted to be a park ranger but I kept being told I don’t have the karma for it so gave up on that dream",
            "title_similarity": "0.62428224",
            "sentiment_compound": 0.3612
        },
        {
            "id": "gzx5bqh",
            "score": 1,
            "text": "Cool",
            "title_similarity": "-0.0790696",
            "sentiment_compound": 0.3182
        },
        {
            "id": "gzx5eju",
            "score": 1,
            "text": "So... What is the point of knowing where they are...?",
            "title_similarity": "0.058399417",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzx60qa",
            "score": 1,
            "text": "egg. E   s",
            "title_similarity": "-0.050279308",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzx6eyr",
            "score": 1,
            "text": "I approve of using bear traps on anybody who keep \"harvesting\" them.",
            "title_similarity": "0.3700971",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzx6n3e",
            "score": 1,
            "text": "Also pulpit plants... they grow near flytraps as well. Never crossed my mind people would poach them though.",
            "title_similarity": "0.7541219",
            "sentiment_compound": 0.2732
        },
        {
            "id": "gzx88ia",
            "score": 2,
            "text": "Many or most insectivorous plants evolved in response to being in consistently nutrient-poor conditions, e.g. bogs.  Many also have a strong intolerance to mineral content in the water and demand mineral-free water, e.g. as found in bogs.\n\nSadly, we humans have been aggressively \"draining the swamp\" for centuries, and so the habitat for bog-dwelling and most other insectivorous plants has nearly disappeared.",
            "title_similarity": "0.6196126",
            "sentiment_compound": -0.4939
        },
        {
            "id": "gzxaxf7",
            "score": 1,
            "text": "I live on the coast of NC (where they grow) Someone got went to prison on felony charges for 25 months in 2014 for stealing and selling them.",
            "title_similarity": "0.38622713",
            "sentiment_compound": -0.9118
        },
        {
            "id": "gzxb37l",
            "score": 2,
            "text": "Rangers protecting their grow sites. My how the turntables.",
            "title_similarity": "0.41055554",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzxbdzt",
            "score": 1,
            "text": "[deleted]",
            "title_similarity": "0.07246606"
        },
        {
            "id": "gzxbrx3",
            "score": 2,
            "text": "I heard they only naturally grow around a meteor site",
            "title_similarity": "0.47512648",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzxd0ey",
            "score": 1,
            "text": "It's crazy how \"wild wild west\" Cali is when it comes to their crops.",
            "title_similarity": "0.43239135",
            "sentiment_compound": -0.34
        },
        {
            "id": "gzxer4u",
            "score": 1,
            "text": "There’s a fantastic episode of Criminal(podcast) on these guys. You should give it a listen.",
            "title_similarity": "0.23342459",
            "sentiment_compound": 0.5574
        },
        {
            "id": "gzxeyy5",
            "score": 1,
            "text": "Well fuck you for outing them mate XD",
            "title_similarity": "0.20313159",
            "sentiment_compound": 0.4824
        },
        {
            "id": "gzxf29v",
            "score": 1,
            "text": "Why take them from the wild when you can buy them from almost any nursery?",
            "title_similarity": "0.50792104",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzxfahq",
            "score": 1,
            "text": "give it a few years and they will be easy to find. all the other areas will be houses or farmland. The places left....",
            "title_similarity": "0.36788744",
            "sentiment_compound": 0.4404
        },
        {
            "id": "gzxfm1f",
            "score": 1,
            "text": "I live in the Carolinas and always thought they grew in the Amazon or something. I was really surprised when I learned they grew close enough to where I live. I killed two with the horrible advice out there on the internet. \n\nYou have to be careful with “re-populating”. First, you’d have to make sure they were pure. There are a lot of variations bred for specific traits and you don’t want to introduce a hybrid into the area to compete with the real ones.\n\nAlso, it is probably more of a loss of habitat than the flowers dying off. It’s one of those things where they do really well in a certain set of circumstances. You start changing that and they all die off. \n\nThey’re very easy to propagate and I don’t know why wild ones would be in danger. Unless there are unscrupulous people who would just dig them up and sell them for a quick buck, without care for insuring there will be enough for the colony to survive.\n\nLike I said, I killed my first two through ignorance. If you want to do well at keeping them, get a book by Peter D’Amato called “The Savage Garden”. It’s great about exactly how to keep many different carnivorous plants, including how to mix the soil.\n\nThis is from memory, but should be close enough. For a VFT, get play sand and rise it multiple times. There are minerals and stuff that can kill the plants with too many nutrients. Washing it prevents this. I use a 5gal bucket and only out about 6” sand at once. Let the hose run through, flushing it as you agitate with your hands. I think he might do the same with the peat moss as well.\n\nTo pot, get a taller pot, throw some crappy sphagnum moss, the really cheap kind, at the bottom of the pot to prevent the soil washing out. Then mix about 50/50 sand and peat moss. Pot it tight, set it in a drip tray, and keep water in the tray. It’ll soak it up from the bottom and keep the soil wet. That’s it.\n\nAlso, it really needs to be outside. It needs bright sunlight, and it needs to get cold in the winter. There are notes in the book off you live in places that have extremely different conditions from where they grow.",
            "title_similarity": "0.65062666",
            "sentiment_compound": -0.7535
        },
        {
            "id": "gzxg84u",
            "score": 1,
            "text": "i got mine at walmart",
            "title_similarity": "0.22884719",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzxilsq",
            "score": 1,
            "text": "I once saw a show about park rangers trying to enforce the laws against poaching of Venus Flytraps by locals who sold them on them for decent $ I think it was on Nat Geo years and years ago.",
            "title_similarity": "0.7111914",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzxkb5c",
            "score": 1,
            "text": "The WalMart in Summerville, SC is built over scampish land that used to be a huge hotbed for Venus flytraps.",
            "title_similarity": "0.54653543",
            "sentiment_compound": 0.3182
        },
        {
            "id": "gzxlg1r",
            "score": 1,
            "text": "We are heading to one of the few places they grow wild tomorrow for a walk and let our dog swim. One of our dogs favorite places cause she loves the river.",
            "title_similarity": "0.42516094",
            "sentiment_compound": 0.7717
        },
        {
            "id": "gzxm1qm",
            "score": 1,
            "text": "I actually listened to a podcast series a while back on this specific issue.",
            "title_similarity": "0.27827102",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzxn58e",
            "score": 1,
            "text": "That's so interesting. I went on a hike and saw them growing naturally by where I live. I didn't disturb them. Now I wonder if I should hide them a bit.",
            "title_similarity": "0.47217816",
            "sentiment_compound": 0.6429
        },
        {
            "id": "gzxnlv0",
            "score": 1,
            "text": "My first “pet” was a Venus flytrap named Vinny. \nI bought it for $14 at Walgreens. \nI was young and irresponsible and I didn’t read the care instructions. \nIt died because I overfed it flies. Turns out they need the pods for photosynthesis. \nLesson learned. Poor Vinny.",
            "title_similarity": "0.6580564",
            "sentiment_compound": -0.7506
        },
        {
            "id": "gzxquef",
            "score": 1,
            "text": "I remember learning about this from a Crime Pays But Bottany Doesn't Video. If you haven't seen his channel on Youtube I highly recommend it. It's a guy with a strong Chicago accent walking around the woods and stuff teaching you about plants and swearing a lot. He also throws in the occasional rant about how humans are a blight to nature.",
            "title_similarity": "0.6783954",
            "sentiment_compound": 0.4076
        },
        {
            "id": "gzxrd1u",
            "score": 1,
            "text": "[deleted]",
            "title_similarity": "0.07246603"
        },
        {
            "id": "gzxsjia",
            "score": 1,
            "text": "This is true of many amazing things - oldest trees, rare species, archeological sites...",
            "title_similarity": "0.17974673",
            "sentiment_compound": 0.765
        },
        {
            "id": "gzxt7f7",
            "score": 1,
            "text": "Why do people poach them? I remember them being for sale at Walmart when I was a kid. Not sure if that’s still the case",
            "title_similarity": "0.42257085",
            "sentiment_compound": -0.2411
        },
        {
            "id": "gzxtyh7",
            "score": 2,
            "text": "It’s native to the US? I always assumed they were only found in the deepest Amazon or Congo or somewhere.",
            "title_similarity": "0.4403214",
            "sentiment_compound": 0.1779
        },
        {
            "id": "gzy5wiw",
            "score": 1,
            "text": "The governor of North Carolina got fed up with poachers wiping out flytraps on public land and signed new legislation to help protect them. In the past, flytrap poaching was a misdemeanor offense with a $50 \"slap on the wrist\" fine. As of December 2014, it's a class H felony offense with no limits on the fines and up to 2 years in jail.\n\nLet the wild plants be wild.",
            "title_similarity": "0.5737504",
            "sentiment_compound": -0.25
        },
        {
            "id": "gzy79yx",
            "score": 2,
            "text": "What? I bought them from a local garden shop and had it for few years. This is endangered????",
            "title_similarity": "0.47909015",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzyx3cb",
            "score": 1,
            "text": "My family went to the state park at Carolina Beach (I think it was) a few years ago, and went looking for flytraps on the small boardwalk they had there.  We were there for probably about an hour, going over the path again and again, before my daughter finally spotted a small plant about an inch or two from the ground.  The flytraps themselves were probably only about the size of a nickel?  A penny?  Something like that.  Surprisingly tiny.\n\nEdit: along that same path we also found one or two other carnivorous plants as well.  Pitcher plants, I seem to remember.",
            "title_similarity": "0.65926695",
            "sentiment_compound": 0.7319
        },
        {
            "id": "gzyybk6",
            "score": 1,
            "text": "Hey! I used to give tours at one of the parks in North Carolinsa where these are because we couldn't put them on a map and let people go look themselves. They're super cool to find out in the open.",
            "title_similarity": "0.69086325",
            "sentiment_compound": 0.7574
        },
        {
            "id": "h005h7m",
            "score": 1,
            "text": "Put a couple drops of blood in em from your finger and tickle them and they eat it up then perk up big time. Little shop of horror plant would love a full human snack.",
            "title_similarity": "0.32239807",
            "sentiment_compound": 0.1935
        },
        {
            "id": "h09xav5",
            "score": 1,
            "text": "There’s a little conservatory with a bunch of cameras in Wilmington right behind an elementary school",
            "title_similarity": "0.31329405",
            "sentiment_compound": 0.0
        }
    ]
}