{
    "TIL when former NFL safety Dave Duerson took his life he left a note that read, “Please see that my brain is given to the NFL’s brain bank.” He shot himself in the chest rather than his head so as to preserve his brain. Doctors confirmed that he was suffering from chronic traumatic encephalopathy.\n": [
        {
            "id": "h2hjsuy",
            "score": 1,
            "text": "I guess it's time for another round of check out those reports. As we sometimes get really well, thought-out reports, we like to highlight them from time to time so that the community knows we actually look at them.\n\n>1: Super common front page repost\n>1: Repost\n\nA couple of similar ones here, lets run this person's name through pushshift and see just how common of a repost this is...\n\nIn the last 12 months we get a total of.......0 other submissions about Dave Duerson. \n\nThe most recent submission about this was January 2020 and it was instantly deleted because it was a mobile link. Prior to that it was Feb 2018, but actually that was instantly deleted as well because it was behind a paywall. The most recent time this wasn't instantly deleted was Aug 2017. But yeah.. \"super common\" repost. \n\nWhat gets posted in other subs is irrelevant to our repost rules. \n\n>1: misleading\n>1: This is misinformation\n\nLet's check out the article and see if the claims made in the title are present in the article\n\n1. There is literally a picture of the suicide note in there that confirms that sentence.\n2. As for the rest of the title:\n\n>opting for a gunshot to his chest rather than his head so as to preserve his brain for future research on the neurological disease. His tragic death makes him probably the most well-known former player to date to be diagnosed with C.T.E. posthumously. \n\nSeems pretty straightforward.",
            "title_similarity": "0.488667",
            "sentiment_compound": -0.4503
        },
        {
            "id": "h2haww7",
            "score": 8,
            "text": "Shitty sport",
            "title_similarity": "0.13846926",
            "sentiment_compound": -0.5574
        },
        {
            "id": "h2hjhqy",
            "score": -9,
            "text": "[deleted]",
            "title_similarity": "0.120804265"
        },
        {
            "id": "h2hbe2a",
            "score": 1,
            "text": "I hope everyone understands why is SO FUCKED UP why the NFL played the SuperBowl on Nickelodeon now. They know that they need to start getting players and fans on-board earlier because parents are now thinking twice about letting children experience brain injury for entertainment.",
            "title_similarity": "0.6524598",
            "sentiment_compound": -0.6308
        },
        {
            "id": "h2hhwsg",
            "score": -13,
            "text": "Honestly just delete the sport out of the planet. It's dangerous, boring, and will never take off outside of USA.",
            "title_similarity": "0.39503217",
            "sentiment_compound": -0.34
        },
        {
            "id": "h2hj0lb",
            "score": -3,
            "text": "Was it worth it? Was playing a stupid archaic sport worth it?",
            "title_similarity": "0.33252084",
            "sentiment_compound": 0.1431
        },
        {
            "id": "h2hcfjr",
            "score": 3,
            "text": "Fuck the NFL. I was going to add more detail but I feel like that's enough.",
            "title_similarity": "0.5811903",
            "sentiment_compound": 0.25
        },
        {
            "id": "h2gxmfr",
            "score": -5,
            "text": "He’s from my hometown.",
            "title_similarity": "0.18874103",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2h2hif",
            "score": 4,
            "text": "didn't Joe Namath claim he reversed his CTE with something like 120-160 hyperbaric oxygen sessions?\n\nhas that been proven as a therapy?",
            "title_similarity": "0.587581",
            "sentiment_compound": 0.4329
        },
        {
            "id": "h2gvfax",
            "score": 31,
            "text": "This may account for why so many NFL players commit felonies. There was a joke about the NFL standing for the national felons league.",
            "title_similarity": "0.71088475",
            "sentiment_compound": -0.0258
        },
        {
            "id": "h2h8whd",
            "score": 2,
            "text": "Not the first. Not the last. Ever heard of Junior Seau?",
            "title_similarity": "0.17970918",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2hdplk",
            "score": -2,
            "text": "Football is a stupid “sport”",
            "title_similarity": "0.37904125",
            "sentiment_compound": -0.5267
        },
        {
            "id": "h2ho5ja",
            "score": 7,
            "text": "[removed]",
            "title_similarity": "0.050931033"
        },
        {
            "id": "h2h3kad",
            "score": -10,
            "text": "[removed]",
            "title_similarity": "0.050931033"
        },
        {
            "id": "h2hm7yr",
            "score": -2,
            "text": "Isn't it time to outlaw football as a national sport? Or if we are OK with people dying, maybe bring back gladiators?",
            "title_similarity": "0.69346",
            "sentiment_compound": 0.5095
        },
        {
            "id": "h2hdka1",
            "score": -2,
            "text": "\"Capitalism In America\"",
            "title_similarity": "0.2125569",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2he9cf",
            "score": -1,
            "text": "https://www.cchrint.org/2017/10/10/another-mass-shooting-another-psychiatric-drug/\n\nThe sleeping pill he was taking often causes suicidal ideation.",
            "title_similarity": "0.63109326",
            "sentiment_compound": -0.6705
        },
        {
            "id": "h2gp69u",
            "score": -56,
            "text": "NFL players kill themselves at a lower rate than American men in the same age bracket.",
            "title_similarity": "0.6978084",
            "sentiment_compound": -0.7845
        },
        {
            "id": "h2gzt34",
            "score": -6,
            "text": "He just wanted to be resurrected as a zombie robot linebacker.",
            "title_similarity": "0.6031811",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2h7boi",
            "score": 0,
            "text": "Hand-egg/armored rugby/american football is the only sport I can think of that I would actively oppose my child playing. Fortunately I have a few years before I have to worry about it...",
            "title_similarity": "0.5965189",
            "sentiment_compound": 0.0516
        },
        {
            "id": "h2hzgu8",
            "score": 0,
            "text": "Fuck the NFL. Actually, fuck everyone you fucks. Just Fuck you all. Humans suck asshole. 💩",
            "title_similarity": "0.5415027",
            "sentiment_compound": -0.9477
        },
        {
            "id": "h2hbm03",
            "score": -5,
            "text": "Why do we allow people to brutalize each other for sport",
            "title_similarity": "0.40721703",
            "sentiment_compound": -0.4588
        },
        {
            "id": "h2h80l0",
            "score": -6,
            "text": "Never saw Concussion huh?  Junior Seau did the same.",
            "title_similarity": "0.3939526",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2help6",
            "score": -3,
            "text": "and people make fun of me irl for not liking nor participating in sports",
            "title_similarity": "0.36267376",
            "sentiment_compound": 0.2598
        },
        {
            "id": "h2hhxoj",
            "score": -1,
            "text": "What is the NFL supposed to do for people who chose to slam their heads together for a living?",
            "title_similarity": "0.69682133",
            "sentiment_compound": -0.3818
        },
        {
            "id": "h2hmtig",
            "score": -1,
            "text": "Uncle rico used to throw a pigskin a quarter mile",
            "title_similarity": "0.47303665",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2hooac",
            "score": 1,
            "text": "Safety. That’s an ironically titled position.",
            "title_similarity": "0.106398374",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h2iooye",
            "score": 1,
            "text": "[deleted]",
            "title_similarity": "0.120804265"
        },
        {
            "id": "h2h86h5",
            "score": -10,
            "text": "just a reminder this is all a purely recreational activity.  They dont have to play, we dont have to watch, there's an endless number of other options",
            "title_similarity": "0.17811103",
            "sentiment_compound": -0.1867
        },
        {
            "id": "h2h5qeu",
            "score": 14,
            "text": "So here is my take, as someone whoes sport puts me at an increased risk of CET. \n\nNo one under the age of 16-18 should do more than the minimum contact training and sparing. But sadly at a certain point some people just need to \"bang bro\". \n\nI'm not sure id know what to do with myself without contact sports, and the pandemic has only reinforced that. \n\nPros/ people entering into that world need to be informed before they take part and the pros need good medical insurance provided and ongoing checks. But if someone wants to experience that side of life and all parties are able to understand the risks then so be it.",
            "title_similarity": "0.59967184",
            "sentiment_compound": 0.1672
        },
        {
            "id": "h2h6squ",
            "score": 3,
            "text": "Awful. It's good that now players are aware of CTE and can make the decision on if the $ is worth the possibly of dev CTE. From this point forward that's how I see it. If it were me, I'd preferably play 4-5 years even at the min salary which is close to a million I believe?",
            "title_similarity": "0.4711142",
            "sentiment_compound": 0.4939
        },
        {
            "id": "h2hhh0d",
            "score": 2,
            "text": "Former football player here. 13 recorded concussions—never mind the other ones I could play through. \n\nI think about this a lot. I’m in constant pain from my busted up spine, yawning is a terrible, sharp, angry pain. \n\nI think about popping myself often. Today, Father’s Day, was a rough one. I wonder often if I’ve got CTE. Done a lot of tests. \n\nThis stuff is real. It’s all real. Protect your head. Time to retire football.",
            "title_similarity": "0.7236314",
            "sentiment_compound": -0.8402
        },
        {
            "id": "h2hjpna",
            "score": 2,
            "text": "Stop watching the NFL",
            "title_similarity": "0.4885121",
            "sentiment_compound": -0.296
        },
        {
            "id": "h2hin23",
            "score": -10,
            "text": "[removed]",
            "title_similarity": "0.050930973"
        },
        {
            "id": "h2h63do",
            "score": -28,
            "text": "[deleted]",
            "title_similarity": "0.120804265"
        },
        {
            "id": "h2hd9bn",
            "score": 3,
            "text": "You just gotta look at older retired players to see the differences in each sport, it's scary. Hockey is brutal but everyone who's retired isnt half brain dead or only lives until 50/60s like football and boxing/MMA. Poor guys end up sounding like Ozzy Osbourne/Stallone because they're so messed up",
            "title_similarity": "0.67772245",
            "sentiment_compound": -0.205
        },
        {
            "id": "h2hdniv",
            "score": 3,
            "text": "Dan Carcillo (former NHL enforcer type) was near killing himself before he tried either mushrooms or ayahuasca to help treat his CTE. One single treatment changed his life.\n\nhttps://www.youtube.com/watch?v=rLC7e1V9UQ4\n\nSuper interesting Real Sports piece on it here. So much more needs to be learned about the brain.",
            "title_similarity": "0.75703657",
            "sentiment_compound": 0.765
        },
        {
            "id": "h2hern9",
            "score": -3,
            "text": "I'm gonna say it. American Football is the root of metal health issues in America. No other country has the same issues.",
            "title_similarity": "0.70033944",
            "sentiment_compound": -0.296
        },
        {
            "id": "h2hf7rt",
            "score": -4,
            "text": "\"Hey, do you think this sport where people literally ram their heads against each other may be causing...you know, damage to their heads? No? Okay then, move along\". \n\nHow I imagine every NFL fan to be.",
            "title_similarity": "0.66427976",
            "sentiment_compound": -0.0926
        },
        {
            "id": "h2ho4zo",
            "score": -4,
            "text": "everyone has some degree of CTE, you can get a micro concussion from standing up too fast.\n\nalways follow the money.  no one cares about cte in mma or boxing, or hockey, or basket ball, or any other sport.",
            "title_similarity": "0.5050776",
            "sentiment_compound": -0.569
        },
        {
            "id": "h2hgyii",
            "score": -8,
            "text": "[deleted]",
            "title_similarity": "0.120804265"
        },
        {
            "id": "h2hfw7j",
            "score": -7,
            "text": "I got a traumatic brain injury to my frontal lobe two years ago. I had a violent sneeze while opening my front door. I went from being perfectly fine mentally, to two months later almost taking my life. Killing myself became an obsession over night. I’d spend hours researching the most effective way to commit suicide. I didn’t go through with it because I have two small kids.\n\nIf there’s any advice I’d give to another 30 something female suffering like this, it would be to not seek out help. I’ve found the medical profession to be more like a judge, you never know if you’re going to find someone who cares and has compassion, or is going to judge you harshly, yell at you (like I’ve had), dismiss you, and overall not give a shit. I’ve found it more traumatizing looking for help, than having this injury. I think if I had been a male, doctors would have believed me. Instead, they look at me as if I’m making it up.\n\nDon’t get help! Try to deal with it as best you can, by yourself. If I could go back in time, I wouldn’t have spent so much time trying to find help",
            "title_similarity": "0.7494017",
            "sentiment_compound": 0.6125
        },
        {
            "id": "h2hbimw",
            "score": 0,
            "text": "Isnt it kind of common knowledge over the last decade or so that there is serious repercussions when playing such a physical sport. Not just concussions. But general lasting effects. \n\nIt’s a trade off for many tho. The chance to make millions upon millions of dollars in a short span. \n\nIt’s kind of like smoking. I didn’t blame people smoking in the 50s. But anyone smoking nowadays is a fool",
            "title_similarity": "0.5831306",
            "sentiment_compound": -0.3377
        },
        {
            "id": "h2hc3v0",
            "score": 0,
            "text": "For every decent state of a brain, there are billions if not trillions of bad ones, that's the nature of chaos. Do any scrambling and you'll end up worse every time practically.",
            "title_similarity": "0.45098293",
            "sentiment_compound": -0.6059
        },
        {
            "id": "h2heqp0",
            "score": 0,
            "text": "who?",
            "title_similarity": "-0.11665683",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2hm5a1",
            "score": 3,
            "text": "I sometimes wonder what activities do we engage in, which are widely considered to be socially acceptable today, that future \"woke\" generations will brand us savages for doing. Supporting football (and other high-contact sports) is at the top of my list in this thought experiment.",
            "title_similarity": "0.5191916",
            "sentiment_compound": 0.6124
        },
        {
            "id": "h2hq56u",
            "score": 0,
            "text": "Been done with this barbaric ass sport. Literally watching ppl kill each other. Then you have parents pushing their kids to play, it's disgusting. \n\nThe sport is dangerous and racist, get rid of the shit.",
            "title_similarity": "0.5743196",
            "sentiment_compound": -0.9231
        },
        {
            "id": "h2hxgcg",
            "score": 0,
            "text": "Tt8l mn. I  y82 rnn4o",
            "title_similarity": "0.105854526",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2hxhd8",
            "score": 0,
            "text": "Would the research on Dave Duerson's brain have been compromised if he had committed suicide with any drug? Would someone wanting their brain studied correctly need to die from a type of natural asphyxiation (drowning, bleeding out, hanging, etc)?",
            "title_similarity": "0.7485129",
            "sentiment_compound": -0.7319
        },
        {
            "id": "h2i0ov5",
            "score": 0,
            "text": "Getting smashed in the head is... bad for your brain.. noted.. sheesh, I never would have guessed.. /s",
            "title_similarity": "0.47617918",
            "sentiment_compound": -0.5423
        },
        {
            "id": "h2i13c6",
            "score": 0,
            "text": "What a mad man. Shot himself in the chesticle.",
            "title_similarity": "0.5668014",
            "sentiment_compound": -0.4939
        },
        {
            "id": "h2i1k1i",
            "score": 0,
            "text": "done",
            "title_similarity": "-0.14907749",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2ihwsv",
            "score": 0,
            "text": "There’s a movie called concussion starring will smith about this subject. It’s actually a very good movie.",
            "title_similarity": "0.44706655",
            "sentiment_compound": 0.4927
        },
        {
            "id": "h2ilpua",
            "score": 0,
            "text": "Duerson was the man! He suffered from serious CTE, but I bet you dollars to donuts he dished out more than he received. GO BEARS!",
            "title_similarity": "0.6148387",
            "sentiment_compound": -0.428
        },
        {
            "id": "h2h8fer",
            "score": -24,
            "text": "[deleted]",
            "title_similarity": "0.120804265"
        },
        {
            "id": "h2h5noq",
            "score": 10,
            "text": "Football fans \"we don't talk about that\"",
            "title_similarity": "0.36913884",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2h9962",
            "score": 4,
            "text": "You may say it’s their choice to play but it’s also our choice to watch. \nLet’s stop watching.",
            "title_similarity": "0.38635802",
            "sentiment_compound": -0.2732
        },
        {
            "id": "h2gx3vk",
            "score": 144,
            "text": "Wows its like a bad idea to slam your head repeatedly into something hard for years. Science is just catching up .....",
            "title_similarity": "0.509104",
            "sentiment_compound": -0.25
        },
        {
            "id": "h2h2vpu",
            "score": 32,
            "text": "I actually got to know Dave very well. I won’t say what we treated him for, but he was a patient of mine and my fathers before me.  Very bright, articulate, kind and successful gentleman, the things happening later in his life were definitely not Dave, it was the disease speaking.",
            "title_similarity": "0.5920564",
            "sentiment_compound": 0.9671
        },
        {
            "id": "h2h844a",
            "score": 12,
            "text": "I try not to judge the decisions of other parents, but there is no way on earth I would allow a child of mine to play tackle football.  It’s a terrible risk with negligible reward.  I don’t understand why parents allow it for their children.",
            "title_similarity": "0.5117073",
            "sentiment_compound": 0.5023
        },
        {
            "id": "h2hb0g4",
            "score": -1,
            "text": "The NFL has a brain bank? Why?",
            "title_similarity": "0.50755197",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2hmp8u",
            "score": 1,
            "text": "Work in a funeral home. Had a former professional football player die. It was my job to take him up to the local university hospital to get his brain scanned by the doctors there. They were very excited to get him lol",
            "title_similarity": "0.7833902",
            "sentiment_compound": -0.228
        },
        {
            "id": "h2ho5ct",
            "score": 1,
            "text": "Yet another reason not to watch football. I don’t watch it anyways, but it’s just another reason not to",
            "title_similarity": "0.40542427",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2hq72x",
            "score": -1,
            "text": "That's what you sign up for when play high contact sports. You are abusing your brain.\n\n So, you go through a decade of life hitting your head and getting concussions.... how could you possibly be surprised to end up with permanent, progressive brain damage?",
            "title_similarity": "0.65840083",
            "sentiment_compound": -0.4404
        },
        {
            "id": "h2hqkto",
            "score": -1,
            "text": "By now this should be common knowledge. This is the price for making millions a year. I have sympathy for players who didnt know the risks but not for the current millionares.",
            "title_similarity": "0.49829683",
            "sentiment_compound": 0.2862
        },
        {
            "id": "h2i07u9",
            "score": 1,
            "text": "I think it's crazy we have these huge industries around damaging sports. That makes me wonder... How are we angry at NFL? I mean, don't everybody know this kind of career is damaging to the body, and ultimately will scar you for life?\n\nOr is it some kind of poor families trying to break free of their social heritage/peer pressure, makes young people go for it, when they actually don't know, how dangerous it is?",
            "title_similarity": "0.6036088",
            "sentiment_compound": -0.8828
        },
        {
            "id": "h2ixspf",
            "score": 1,
            "text": "[deleted]",
            "title_similarity": "0.120804265"
        },
        {
            "id": "h2h6fct",
            "score": -7,
            "text": "Man who thinks he has brain trauma has brain trauma.",
            "title_similarity": "0.4484281",
            "sentiment_compound": -0.6808
        },
        {
            "id": "h2hh6ct",
            "score": -7,
            "text": "[deleted]",
            "title_similarity": "0.12080426"
        },
        {
            "id": "h2gwrvj",
            "score": 119,
            "text": "[deleted]",
            "title_similarity": "0.120804265"
        },
        {
            "id": "h2hamd5",
            "score": 2,
            "text": "the NFL is a brutal sport, I do not feel comfortable letting my children play football at any level.",
            "title_similarity": "0.49943957",
            "sentiment_compound": -0.6599
        },
        {
            "id": "h2hbh1f",
            "score": 2,
            "text": "They show this in concussion with Will Smith",
            "title_similarity": "0.48172656",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2hf62h",
            "score": 2,
            "text": "I just can't watch the NFL anymore.",
            "title_similarity": "0.41643125",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2hipj5",
            "score": 2,
            "text": "[deleted]",
            "title_similarity": "0.120804265"
        },
        {
            "id": "h2hjgvb",
            "score": -2,
            "text": "AMC AMC AMC AMC AMC",
            "title_similarity": "0.14027524",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2hkzdy",
            "score": 2,
            "text": "It boggles my mind how people still let their kids play football. I have 3 boys, and I'm 100% on board with them doing whatever they love - just not football. I've seen high schoolers not able to play again because concussions. So many NFLers and even thousands of guys who only played at lower levels will never have a good physical quality of life because football mashed their brains up.",
            "title_similarity": "0.68949544",
            "sentiment_compound": 0.52
        },
        {
            "id": "h2hniok",
            "score": 2,
            "text": "This is why I won't let my boys play football.",
            "title_similarity": "0.5257957",
            "sentiment_compound": 0.34
        },
        {
            "id": "h2hxj39",
            "score": -2,
            "text": "Almost like doing physical things that give you sudden impacts to your brain is bad for you, who would have guessed.",
            "title_similarity": "0.40500027",
            "sentiment_compound": -0.3167
        },
        {
            "id": "h2hxrja",
            "score": -2,
            "text": "[deleted]",
            "title_similarity": "0.120804265"
        },
        {
            "id": "h2ib7up",
            "score": -2,
            "text": "I dont understand. Not enough psychiatric help? What did he expect playing a game that promotes violence? Whatever you do in life there will be repercussions. You accept that when you sign the dotted line to make the millions.",
            "title_similarity": "0.5685234",
            "sentiment_compound": -0.2306
        },
        {
            "id": "h2h8z3i",
            "score": -10,
            "text": "Maybe I’m just an insensitive asshole, but at this point I think almost all NFL players are well aware of the risk of brain injury, and knowingly make that sacrifice for money, fame, and love of the game. I personally am not a football fan, and I think we need a lot more regulation on highschool level impact sports, and maybe even the social pressure of playing football in some areas, but for the NFL, I think the risk is well enough compensated.",
            "title_similarity": "0.6691141",
            "sentiment_compound": 0.5357
        },
        {
            "id": "h2h2e61",
            "score": 3,
            "text": ":(",
            "title_similarity": "-0.16504833",
            "sentiment_compound": -0.4404
        },
        {
            "id": "h2h8oee",
            "score": 3,
            "text": "Brutal tragedy and fucking baller-ass move at the same time.  boxing and football both need to go, these guys are heroes",
            "title_similarity": "0.61184216",
            "sentiment_compound": -0.7351
        },
        {
            "id": "h2h9a7m",
            "score": 3,
            "text": "I read about a college kid that had the same brain damage issues and saw these stories about professional killing themselves and asking for their brains to be examined so did the same, this needs to be addressed comprehensively immediately.",
            "title_similarity": "0.7130159",
            "sentiment_compound": -0.8225
        },
        {
            "id": "h2hb4xs",
            "score": -3,
            "text": "also when darren sharper raped those women it was cte",
            "title_similarity": "0.42359257",
            "sentiment_compound": -0.6808
        },
        {
            "id": "h2hb6qi",
            "score": 2,
            "text": "Boxers have the same problem.",
            "title_similarity": "0.2707481",
            "sentiment_compound": -0.4019
        },
        {
            "id": "h2hf7pe",
            "score": 4,
            "text": "[deleted]",
            "title_similarity": "0.120804265"
        },
        {
            "id": "h2hmjnv",
            "score": -2,
            "text": "Just not worth it for a sport no one watches anymore.",
            "title_similarity": "0.23054437",
            "sentiment_compound": -0.434
        },
        {
            "id": "h2hs8gz",
            "score": -2,
            "text": "CTE sucks but there are plenty of equally dangerous jobs out there that get paid a hell of a lot less. What we need to do is be honest about the risks and protect these guys as much as we can and allow them to make the decision themselves. It’s the lack of transparency and care that’s most reprehensible. They didn’t do enough to care for these guys after the NFL. But, this era of players is well aware of the risks by now and the money, fame, and prestige seem like a fair trade.",
            "title_similarity": "0.54383415",
            "sentiment_compound": 0.899
        },
        {
            "id": "h2i63w5",
            "score": -4,
            "text": "Is this a conspiracy theorist? Thats a horrible things to do to yourself. We really dont know\nWhat in his mind or if he did it, he was not in right mind. Maybe someone killed him.",
            "title_similarity": "0.57397103",
            "sentiment_compound": -0.9081
        },
        {
            "id": "h2h5csr",
            "score": 46,
            "text": "Most lineman are cripples after they leave the NFL. It's a horrible game, that does nothing to protect the \"minor players\" on the field. It's the reason Brett Farve looks 70, when he's only 51.",
            "title_similarity": "0.6354885",
            "sentiment_compound": -0.7081
        },
        {
            "id": "h2gyctp",
            "score": -3,
            "text": "[deleted]",
            "title_similarity": "0.120804265"
        },
        {
            "id": "h2h77n9",
            "score": 5,
            "text": "TIL the NFL has a brain bank",
            "title_similarity": "0.5092512",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2hbc7t",
            "score": 5,
            "text": "This freaks me out. I’m 36 and over the past 8 years I’ve been having increasing issues with depression and dealing with my day to day. I wish we had more info on CTE because I’ve had multiple concussions since childhood from football and skating. However when I bring it up to my doctor he brushes it off because CTE is basically un-diagnosable.",
            "title_similarity": "0.65754104",
            "sentiment_compound": -0.34
        },
        {
            "id": "h2hccwc",
            "score": 4,
            "text": "For those who don’t know what CTE is Watch the movie Concussion. It’ll show you all about this condition. \n\nImagine a jar. Put an apple in it. Pour a little bit of water so that only the “feet” of the apple is submerged (implying very less water). Then shake the jar as hard as you can. That’s what a concussion is like. NFL players have so much of that, that by the end of their run, for some of them, their brains are literally fucked.",
            "title_similarity": "0.6473763",
            "sentiment_compound": -0.577
        },
        {
            "id": "h2hcyip",
            "score": 5,
            "text": "Fuck the NFL. Treat your players as people instead of property.",
            "title_similarity": "0.5356473",
            "sentiment_compound": -0.2023
        },
        {
            "id": "h2hdid5",
            "score": 4,
            "text": "Don't let your kids play football",
            "title_similarity": "0.35505158",
            "sentiment_compound": 0.34
        },
        {
            "id": "h2hecz2",
            "score": -5,
            "text": "I'm just going through my old I'll 9.89o    😪I     ;;;,;;;*9th98;,,  <;<>988988 I 8899988j676677777776 979 08655,5,66 (7-Ele ven 7k 77 977(?<777u7 ,,,,,,,,, ,,, ,7,,,7,,,7,,(5<I 8   ,  9-El elven 8   87⁹io7.  The 9888889i888i88988i9887,8    8,",
            "title_similarity": "0.2768144",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2hkxqt",
            "score": -4,
            "text": "\n* Vv8v > YK hi oc sx u3",
            "title_similarity": "0.187717",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2hob25",
            "score": -5,
            "text": "With and are muse mouse can chats  put ass very every things think were where where what what given getting often for meet don’t just out outsiders keep queen fed  kings into hello something help a.  because bout  been used use  not now every very in thank you thieves\n  this is took tooking their then there",
            "title_similarity": "0.40937105",
            "sentiment_compound": -0.323
        },
        {
            "id": "h2iw538",
            "score": -4,
            "text": "Let me guess: Fully vaccinated as a child.",
            "title_similarity": "0.19076249",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2hbws7",
            "score": -5,
            "text": "So? Its the risk they take.... Contact sports where you constantly damage yourself seems to do this.",
            "title_similarity": "0.3687402",
            "sentiment_compound": -0.6486
        },
        {
            "id": "h2hd4sg",
            "score": -6,
            "text": "Wouldn't it be easier to go see a Dr? Are they not capable of diagnosing that sort of thing? Shooting yourself in the chest is pretty hard core.",
            "title_similarity": "0.687016",
            "sentiment_compound": -0.2677
        },
        {
            "id": "h2hetv5",
            "score": -6,
            "text": "          L      l.        8   😱",
            "title_similarity": "-0.06395078",
            "sentiment_compound": -0.2656
        },
        {
            "id": "h2hl12m",
            "score": -6,
            "text": "What is being asked?  We get it, head trauma leads to brain damage that has serious mental health consequences.  What would Dave Duerson want as a result of his donation, confirmation that brain damage occurs? More money? Better Heath care after the NFL? Not having football anymore? Using less pads and smaller helmets like in Rugby? What is the goal?",
            "title_similarity": "0.7216015",
            "sentiment_compound": -0.3142
        },
        {
            "id": "h2hbnb9",
            "score": 7,
            "text": "Anybody remember Dave Mira? Maybe you played his BMX games? He would bike without a helmet and he suffered from brain injury and he killed himself recently. Widepeposad...",
            "title_similarity": "0.7152822",
            "sentiment_compound": -0.8577
        },
        {
            "id": "h2heco8",
            "score": -7,
            "text": "Play stupid games win stupid prizes.",
            "title_similarity": "0.31632066",
            "sentiment_compound": 0.34
        },
        {
            "id": "h2i5qqb",
            "score": -8,
            "text": "[removed]",
            "title_similarity": "0.050931033"
        },
        {
            "id": "h2h8ys8",
            "score": 23,
            "text": "[deleted]",
            "title_similarity": "0.120804265"
        },
        {
            "id": "h2h0zwu",
            "score": 6,
            "text": "Damn, that is so sad. Athletes shouldnt have to risk their lives playing a game, no matter how lucrative.",
            "title_similarity": "0.38790172",
            "sentiment_compound": -0.6311
        },
        {
            "id": "h2h83si",
            "score": 6,
            "text": "My heart breaks for people suffering from this. I wish we could be more proactive in recovery but I feel helpless",
            "title_similarity": "0.4262125",
            "sentiment_compound": -0.1415
        },
        {
            "id": "h2hkuov",
            "score": 8,
            "text": "I was married to an abusive rapist, who gave me more concussions than a football team. \n\nthis is what I'll die of. \n\nFML.",
            "title_similarity": "0.68650955",
            "sentiment_compound": -0.9325
        },
        {
            "id": "h2gzt01",
            "score": -8,
            "text": "Nfl... like the American soccer thing... has a brain bank? For real brains...?",
            "title_similarity": "0.52089554",
            "sentiment_compound": 0.4329
        },
        {
            "id": "h2hc2aj",
            "score": -8,
            "text": "I’m sorry, but they get paid a pretty penny to take these risks. I’m not losing a second of sleep over it.",
            "title_similarity": "0.3251662",
            "sentiment_compound": 0.6458
        },
        {
            "id": "h2gv0au",
            "score": 291,
            "text": "My only issue with the current way of studying CTE is that the only brains examined are those from people like this who suspected they had CTE.  It makes it hard to actually determine how prevalent it is and how that compares to the general population because it hugely biases the data.",
            "title_similarity": "0.50252837",
            "sentiment_compound": 0.0516
        },
        {
            "id": "h2h2jrp",
            "score": 144,
            "text": "There's been quite a few skateboarder suicides over the years. I know a lot of dudes in skateboarding also suffer from depression and other mental disorders. I think skateboarders actually probably talk about this stuff a lot more than guys in the NFL, since skateboarding is more of a subculture. But I think the correlation between head injuries and mental disorders is severely overlooked in skateboarding. It would be a great thing for more kids to start wearing helmets, but unfortunately it's viewed as uncool. I give massive props to street skating legend Mike Vallely for taking up wearing a helmet for the last decade. There's also a newer pro skater named Andy Anderson who wears a helmet. Those two dudes are definitely setting a good example for kids. I personally have never worn a helmet, and I never will, but I'm a lost cause.",
            "title_similarity": "0.67154574",
            "sentiment_compound": 0.3781
        },
        {
            "id": "h2h8tv3",
            "score": -9,
            "text": "[deleted]",
            "title_similarity": "0.120804265"
        },
        {
            "id": "h2h9ngy",
            "score": -10,
            "text": "[deleted]",
            "title_similarity": "0.120804265"
        },
        {
            "id": "h2hi6d0",
            "score": 10,
            "text": "The NFL knew about CTE going far as back as 1998 when they did their own internal investigation.  It's all thanks to Dr. Bennett Omalu who did the autopsy of former Steeler center Mike Webster who did the brain slides that he paid out of his own pocket to do.  That got the ball rolling.  At least now the NFL can't deny that concussions don't lead to CTE eventually, but for some players like Tony Dorsett, Gene Akins (his dad) it's too late. Usually for change to actually happen people have to die to make it happen.",
            "title_similarity": "0.85033494",
            "sentiment_compound": -0.1611
        },
        {
            "id": "h2h9z4z",
            "score": 78,
            "text": "For God’s sake DON’T LET YOUR KIDS PLAY FOOTBALL.",
            "title_similarity": "0.35830918",
            "sentiment_compound": 0.4824
        },
        {
            "id": "h2h4fus",
            "score": 14,
            "text": "I wrote a paper in college about brain trauma in the NFL. It’s really fascinating and sad",
            "title_similarity": "0.7456148",
            "sentiment_compound": -0.3336
        },
        {
            "id": "h2hhv98",
            "score": 18,
            "text": "When I was in Highscool and middle school we used to get \"Dinged\" and play because we were forced by the coaches to man up or don't play. I would sometimes have trouble buttoning my dress shirt for church. I will not be letting my son play.",
            "title_similarity": "0.5072066",
            "sentiment_compound": -0.4471
        },
        {
            "id": "h2hnkdy",
            "score": 26,
            "text": "My cousins were highschool football stars. Twins. A quarterback and a runningback. Small Town heroes. I grew up listening to my family gloat about them at every holiday and family gathering since I was a child. I'm not athletic and detest football and the entire stupid promenade. Anyhow, one cousin got a full ride scholarship to play football for a Midwest team and got sacked so hard in his freshman year that he left the field on a stretcher, went into a coma, and has been epileptic ever since. He's lost much of his independence and requires drugs just to get by. They have a family now and are doing well but it was a traumatic life altering injury, and who knows what damage was done up until that moment.\n\nSmall Town football is a religion to some people. The victim's are martyred if their injuries are ever even recognized.",
            "title_similarity": "0.7062007",
            "sentiment_compound": -0.9199
        },
        {
            "id": "h2h8hrx",
            "score": 78,
            "text": "The NFL paid a lot of money to discredit scientists that discovered the link between football and CTE. It wasn't until recently that they stopped doing that, now the NFL is all \"cool\" with the research. \n\nhttps://www.ucsusa.org/resources/nfl-tried-intimidate-scientists-studying-link-between-pro-football-and-traumatic-brain",
            "title_similarity": "0.7405288",
            "sentiment_compound": 0.1027
        },
        {
            "id": "h2gwgtw",
            "score": 1805,
            "text": "Aaron Hernandez also had a pretty awful case, apparently.\n\n[https://www.theguardian.com/sport/2017/nov/09/aaron-hernandez-cte-brain-damage-photos](https://www.theguardian.com/sport/2017/nov/09/aaron-hernandez-cte-brain-damage-photos)\n\nI am not saying that this, if true, JUSTIFIES any of his behavior, but it may EXPLAIN some it. He did some awful shit.",
            "title_similarity": "0.5509925",
            "sentiment_compound": -0.836
        },
        {
            "id": "h2h20ft",
            "score": 1128,
            "text": "What is it with people with CTE that commit suicide? Do they just feel so shitty (lack of a better word) so they thought why not kill themselves? Does the CTE make them kill themselves? Can anyone provide a clearer answer on this?",
            "title_similarity": "0.6566451",
            "sentiment_compound": -0.8889
        },
        {
            "id": "h2go7ra",
            "score": 761,
            "text": "“Well we pay them a lot of money!?!?!” - The NFL probably",
            "title_similarity": "0.45472336",
            "sentiment_compound": -0.3891
        },
        {
            "id": "h2h2xcr",
            "score": 1528,
            "text": "It is really depressing because I have enjoyed a ton of sports that involve getting hit in the head. Nothing made me feel more alive than those sorts of sports.\n\nNow I have kids and its rough trying to balance the 'kids will be kids' with all this newer information about brain injuries, realizing that a lot of the times I was told to walk it off I actually had a concussion.",
            "title_similarity": "0.57910174",
            "sentiment_compound": 0.5106
        },
        {
            "id": "h2h57eu",
            "score": 262,
            "text": "Having a concussion while your brain is still recovering from a previous concussion, has been shown to often cause serious long term damage.\n\n[https://www.ncbi.nlm.nih.gov/books/NBK185336/](https://www.ncbi.nlm.nih.gov/books/NBK185336/) (trigger warning: they beat the shit out of some animals over the years to study concussions, \\_jesus\\_)",
            "title_similarity": "0.68759465",
            "sentiment_compound": -0.2263
        },
        {
            "id": "h2h72hk",
            "score": 75,
            "text": "Min/Max optimization has these men turning themselves into human freight trains to run into each other, almost surprised they walk off the field.",
            "title_similarity": "0.55056304",
            "sentiment_compound": 0.4951
        },
        {
            "id": "h2gnb5c",
            "score": 320,
            "text": "‘The final days of Dave Duerson’\n\nhttps://www.chicagotribune.com/sports/bears/ct-spt-0227-dave-duerson-final-days--20110226-story.html\n\n‘Dave Duerson had brain damage’\n\nhttps://www.espn.com/chicago/nfl/news/story?id=6465271\n\nLeague of Denial: The NFL’s Concussion Crisis\n\nhttps://youtu.be/SedClkAnclk",
            "title_similarity": "0.7298592",
            "sentiment_compound": -0.6249
        },
        {
            "id": "h2hhota",
            "score": 324,
            "text": "Did you all read the wikipedia article on CTE?\n\n>According to 2017 study on brains of deceased gridiron football players, 99% of tested brains of NFL players, 88% of CFL players, 64% of semi-professional players, 91% of college football players, and 21% of high school football players had various stages of CTE.\n\n21% of high school football players... what a fucking abomination.",
            "title_similarity": "0.72867775",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2h5f8t",
            "score": 226,
            "text": "I'd be interested in OJ's noggin. I also wonder why no attorney has tried a CTE defense.",
            "title_similarity": "0.45766032",
            "sentiment_compound": 0.25
        },
        {
            "id": "h2gz05o",
            "score": 6208,
            "text": "So everyone here already knew there was an NFL \"Brain Bank\"??? Am I totally living under a rock?!",
            "title_similarity": "0.55354893",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2hcejv",
            "score": 631,
            "text": "I got sucker punched at a bar when I was about 22/23. I was knocked unconscious and my jaw was broken. I had to go to emergency surgery and got my jaw wired shut. That was depressing in its own way not being able to eat for six weeks, but my parents have said I’ve never been quite the same person since that moment. Be it ptsd, minor brain trauma, or just being much more anxious in public. Getting hit in the head is never a good choice.",
            "title_similarity": "0.6628013",
            "sentiment_compound": -0.9393
        },
        {
            "id": "h2h7ztz",
            "score": 213,
            "text": "Junior seau shot himself in the chest as well to preserve his brain for science as well",
            "title_similarity": "0.74851435",
            "sentiment_compound": 0.4939
        },
        {
            "id": "h2h11dc",
            "score": 7187,
            "text": "There are a lot of athletes and fighters that are portrayed as being quirky or eccentric, when in reality they're suffering from brain damage.",
            "title_similarity": "0.43025917",
            "sentiment_compound": -0.7579
        },
        {
            "id": "h2gqrbf",
            "score": 10585,
            "text": "[Junior Seau did the same](https://en.m.wikipedia.org/wiki/Junior_Seau)",
            "title_similarity": "0.11521431",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2h2pib",
            "score": 658,
            "text": "How's the concussion/brain damage incidence in similar sports (Rugby, ARF) where no helmets are worn?",
            "title_similarity": "0.5749908",
            "sentiment_compound": -0.765
        },
        {
            "id": "h2h2ura",
            "score": 5,
            "text": "TIL what encephalopathy means",
            "title_similarity": "0.15889145",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2h6j2m",
            "score": 1,
            "text": "Serious Question: I took a lot of thumping and had many concussions growing up. Now I have a four or five mental disorders.\n\nAre there brain scans or something I can get?",
            "title_similarity": "0.50352037",
            "sentiment_compound": 0.1027
        },
        {
            "id": "h2h7ojq",
            "score": 1,
            "text": "[deleted]",
            "title_similarity": "0.120804265"
        },
        {
            "id": "h2h8757",
            "score": 1,
            "text": "Aaron Hernandez too I think?",
            "title_similarity": "0.15761575",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2h8adx",
            "score": 3,
            "text": "TIL the NFL has a brain bank",
            "title_similarity": "0.5092512",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2h8ogk",
            "score": 2,
            "text": "Does CTE lead to a higher rate of suicide?",
            "title_similarity": "0.4491763",
            "sentiment_compound": -0.6705
        },
        {
            "id": "h2h95pu",
            "score": 1,
            "text": "Is that not treatable?",
            "title_similarity": "-0.0021915417",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2h9ns0",
            "score": 3,
            "text": "so fucking heartbreaking",
            "title_similarity": "0.14503217",
            "sentiment_compound": -0.5531
        },
        {
            "id": "h2h9ogh",
            "score": 3,
            "text": "This pic tho",
            "title_similarity": "-0.084111474",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2h9v2p",
            "score": 4,
            "text": "Double D was one of my favorites. Such a smart, classy guy. It was heartbreaking to see what CTE did to him.",
            "title_similarity": "0.4033966",
            "sentiment_compound": 0.6597
        },
        {
            "id": "h2h9vx7",
            "score": 5,
            "text": "Junior did the same. These men gave their lives for science. Everyone should respect that.",
            "title_similarity": "0.34230143",
            "sentiment_compound": 0.4767
        },
        {
            "id": "h2ha1ah",
            "score": 74,
            "text": "I haven't seen anyone mention the movie concussion, on the effect of concussions and their long term effects on football players. And of course the NFL's denial of the situation for, well, money. Will Smith plays the doctor who eventually forces the powers that be to accept the sport's dangers. If I remember correctly this lead to a lot of new safety standards and gear.",
            "title_similarity": "0.77060163",
            "sentiment_compound": 0.6486
        },
        {
            "id": "h2hadu4",
            "score": 3,
            "text": "This is a great subject, writing my masters thesis on brain injuries in combat sports. Interesting and tragic at the same time",
            "title_similarity": "0.6362041",
            "sentiment_compound": 0.34
        },
        {
            "id": "h2hahsm",
            "score": 2,
            "text": "Tough when it happened. He played at my alma mater, Ball State. One of the few to make it in the NFL. So sad",
            "title_similarity": "0.71103215",
            "sentiment_compound": -0.4751
        },
        {
            "id": "h2hajrz",
            "score": 2,
            "text": "DD was also a smart man until TBI.\n'85 Bears!!!!",
            "title_similarity": "0.4641205",
            "sentiment_compound": 0.5951
        },
        {
            "id": "h2ham1h",
            "score": 3,
            "text": "Too bad the NFL try’s to ignore this issue constantly.",
            "title_similarity": "0.5404735",
            "sentiment_compound": -0.7184
        },
        {
            "id": "h2ham47",
            "score": 2,
            "text": "TIL nfl has a brain bank.",
            "title_similarity": "0.49788815",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2han1w",
            "score": 1,
            "text": "What does cte do to you? Is suicidal ideation a symptom of it?",
            "title_similarity": "0.46054122",
            "sentiment_compound": -0.7059
        },
        {
            "id": "h2haqj6",
            "score": 34,
            "text": "Not on topic, but that picture really is at odds with the conversation...",
            "title_similarity": "0.12749434",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2hbphj",
            "score": 1,
            "text": "So sad!",
            "title_similarity": "0.08481793",
            "sentiment_compound": -0.5697
        },
        {
            "id": "h2hbryp",
            "score": 3,
            "text": "There are so many football players and other athletes who, at 40, have the brain of an 80 year old due to CTE. It is heartbreaking. Being able to study the brain of a patient who suffered in invaluable",
            "title_similarity": "0.6398182",
            "sentiment_compound": -0.7351
        },
        {
            "id": "h2hc05h",
            "score": 1,
            "text": "The hell would the NFL do with a brain bank?",
            "title_similarity": "0.54858255",
            "sentiment_compound": -0.6808
        },
        {
            "id": "h2hc2vr",
            "score": 3,
            "text": "I remember this. Fucking sad",
            "title_similarity": "0.18560594",
            "sentiment_compound": -0.5256
        },
        {
            "id": "h2hc37e",
            "score": 2,
            "text": "Football is a dumb sport.",
            "title_similarity": "0.4039727",
            "sentiment_compound": -0.5106
        },
        {
            "id": "h2hcls6",
            "score": 2,
            "text": "Corporations care about 💰",
            "title_similarity": "0.2280719",
            "sentiment_compound": 0.4939
        },
        {
            "id": "h2hcpf3",
            "score": 1,
            "text": "https://youtu.be/QbhoxBds_rA",
            "title_similarity": "0.10398804",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2hcvna",
            "score": 1,
            "text": "There’s a documentary on Netflix about the former NFL player Aaron Hernandez. If I’m remembering correctly he killed 3 people while in the NFL which was linked to brain injuries.",
            "title_similarity": "0.8276534",
            "sentiment_compound": -0.6705
        },
        {
            "id": "h2hcy54",
            "score": 27,
            "text": "I just…can’t even imagine the sort of pain that goes into shooting yourself in the chest. I don’t even want to think about it.\n\nIf we’re just going to be frank about it…in the head, it’s lights off. In the chest, done right…it’s going to still take several dozen seconds. And those are going to be agonizing seconds.\n\nMy point is just to consider what it takes for a man to decide to suffer that, instead of just continuing to live, but also so that he can be validated about what’s going on in his own head. After he isn’t here anymore.\n\nWhole thing is just entirely fucked.",
            "title_similarity": "0.6789892",
            "sentiment_compound": -0.8987
        },
        {
            "id": "h2hd2s1",
            "score": 2,
            "text": "Aaron Hernandez hung himself.",
            "title_similarity": "0.32785678",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2hdoz0",
            "score": 6,
            "text": "Parents who let their kids play full contact football are fucking idiots.",
            "title_similarity": "0.5913849",
            "sentiment_compound": 0.34
        },
        {
            "id": "h2hdrui",
            "score": 1,
            "text": "And the corporate trolls running it are laughing about it all the way to the fucking bank. Yet people keep giving them their money..",
            "title_similarity": "0.41748357",
            "sentiment_compound": 0.6808
        },
        {
            "id": "h2hdwy8",
            "score": 28,
            "text": "I met Dave many times as a kid working in a lube shop. He let me try on his 85’ Bears SB ring which is still the highlight of my sports life. He was a kind man.",
            "title_similarity": "0.46727347",
            "sentiment_compound": 0.7003
        },
        {
            "id": "h2heiay",
            "score": 1,
            "text": "That’s not an easy way to go, either. Slow and painful.",
            "title_similarity": "0.18191835",
            "sentiment_compound": -0.6492
        },
        {
            "id": "h2hemev",
            "score": 1,
            "text": "Who would've thunk that constant trauma to the head causes damage to the brain.",
            "title_similarity": "0.52288836",
            "sentiment_compound": -0.7184
        },
        {
            "id": "h2herka",
            "score": 1,
            "text": "Didnt Aaron Hernandez have that too?",
            "title_similarity": "0.13592981",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2heu25",
            "score": 1,
            "text": "And he was a safety! Imagine a running back",
            "title_similarity": "0.28664413",
            "sentiment_compound": 0.4753
        },
        {
            "id": "h2hey8j",
            "score": 1,
            "text": "Same story. https://en.m.wikipedia.org/wiki/Junior_Seau",
            "title_similarity": "0.13286988",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2hf5vg",
            "score": 2,
            "text": "[Chronic Traumatic Encephalopathy](https://www.mayoclinic.org/diseases-conditions/chronic-traumatic-encephalopathy/symptoms-causes/syc-20370921) (CTE) is the term used to describe brain degeneration likely caused by repeated head traumas. CTE is a diagnosis made only at autopsy by studying sections of the brain.",
            "title_similarity": "0.71171933",
            "sentiment_compound": -0.7845
        },
        {
            "id": "h2hf7yn",
            "score": 5,
            "text": "Dave played in a time when the NFL was just brutal as you can see in this clip.  \n\nhttps://www.youtube.com/watch?v=bb6lFJ49_00",
            "title_similarity": "0.66590303",
            "sentiment_compound": -0.4019
        },
        {
            "id": "h2hfij9",
            "score": 4,
            "text": "CTE is also ravaging independent pro wrestling in the US… Lot of guys from across the northeast have committed suicide on the last ten or so years, many after struggling with depression, that I’ve only got to assume is tied to unprotected chair shots.",
            "title_similarity": "0.7009289",
            "sentiment_compound": -0.9081
        },
        {
            "id": "h2hfs5x",
            "score": 4,
            "text": "This is horrible and happens all the time. This concussion stuff is so damaging and no matter what payout the NFL gives people- it’s not worth it. Unfortunately all little boys want to play football. I mean I always dated a football player I get it- it’s cool. I’m not sure what I’d I’m going to let my son play when he’s older because of this, hopefully the safety improves but the violence is part of the appeal. Tragic",
            "title_similarity": "0.6858884",
            "sentiment_compound": -0.8316
        },
        {
            "id": "h2hg19l",
            "score": 2,
            "text": "Football does damage to the brain????? Whhhaaaaaaattt?????? /s",
            "title_similarity": "0.5823263",
            "sentiment_compound": -0.6322
        },
        {
            "id": "h2hgbpm",
            "score": 1,
            "text": "This explains Cole Beasley",
            "title_similarity": "0.048809126",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2hgctb",
            "score": 3,
            "text": "It's about time league's do away with extreme protective equipment. The fact that you can launch yourself at another person with nominal immediate pain is the issue.\n\nIf you're gonna hit someone, you should hurt too. It'll limit the velocity and severity of impacts.\n\nAdd to that, it should be a standing rule, if you injure an opponent, you don't return to play until they do.",
            "title_similarity": "0.5251234",
            "sentiment_compound": -0.8288
        },
        {
            "id": "h2hgmeh",
            "score": 6,
            "text": "In Australia there is a common joke that our football players (rugby league) don't wear pads and helmets like NFL therefore we are somehow tougher... but the reality is the fact that they DO wear helmets in NFL makes their head collisions faster and frequent causing their brains to slam into the inside of their skulls.  Oof.",
            "title_similarity": "0.58869284",
            "sentiment_compound": -0.5187
        },
        {
            "id": "h2hgr2h",
            "score": 2,
            "text": "I really wanted to play football when I was younger but now I’m so glad my parents didn’t let me",
            "title_similarity": "0.611669",
            "sentiment_compound": 0.7982
        },
        {
            "id": "h2hgsu8",
            "score": 2,
            "text": "Man, when u kno what is hurting u and no one can be there for you 😞",
            "title_similarity": "0.30087665",
            "sentiment_compound": -0.7906
        },
        {
            "id": "h2hgtnm",
            "score": 2,
            "text": "Remember when just a few weeks ago the NFL admitted they were paying their black players less in pension and benefits because they believed that black players were dumber than their white players?",
            "title_similarity": "0.7003795",
            "sentiment_compound": 0.128
        },
        {
            "id": "h2hh3g7",
            "score": 10,
            "text": "[Chris Benoit](https://en.wikipedia.org/wiki/Chris_Benoit_double-murder_and_suicide)",
            "title_similarity": "0.5778873",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2hhe23",
            "score": 15,
            "text": "There's speculation that Lou Gehrig, who took a number of fast-moving balls to the head in his career, may not actually have had Lou Gehrig's disease (ALS).  Research done since his death has uncovered a variant of CTE called chronic traumatic encephalomyelopathy, which, due to abnormal concentrations of certain proteins in the brain stem appears at first to be a motor neuron disease.  His remains were cremated so there's no way to know for sure, but the fact that getting hit in the head can not only produce the symptoms of CTE but also affect the entire nervous system and slowly kill you is very scary.\n\nhttps://www.ncbi.nlm.nih.gov/pmc/articles/PMC4137675/",
            "title_similarity": "0.7496293",
            "sentiment_compound": -0.9591
        },
        {
            "id": "h2hhfw3",
            "score": 1,
            "text": "RIP",
            "title_similarity": "0.041326564",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2hhgyf",
            "score": 9,
            "text": "From Wikipedia:\n\n>Chronic traumatic encephalopathy (CTE) is a neurodegenerative disease linked to repeated blows to the head. The encephalopathy symptoms can include behavioral problems, mood problems, and problems with thinking. The disease often gets worse over time and can result in dementia. It is unclear if the risk of suicide is altered.  \n>  \n>Most documented cases have occurred in athletes involved in striking-based combat sports, such as boxing, kickboxing, mixed martial arts, and Muay Thai—hence its original name dementia pugilistica (Latin for \"fistfighter's dementia\")—and contact sports such as American football, Australian rules football, professional wrestling, ice hockey, rugby, and association football (soccer), but also in semi-contact sports such as baseball and basketball. Other risk factors include being in the military, prior domestic violence, and repeated banging of the head. The exact amount of trauma required for the condition to occur is unknown, and as of 2021 definitive diagnosis can only occur at autopsy. The disease is classified as a tauopathy.\n\n^(beep boop, I'm not actually a bot, I just thought it was important for people to know if they hadn't already.)",
            "title_similarity": "0.64714277",
            "sentiment_compound": -0.9705
        },
        {
            "id": "h2hho3n",
            "score": 1,
            "text": "What do I do with this information?",
            "title_similarity": "0.03363499",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2hhucs",
            "score": 2,
            "text": "I hope this was not more painful for him, to do it on the chest than the head…  he must have been suffering so much already.",
            "title_similarity": "0.51291394",
            "sentiment_compound": 0.3448
        },
        {
            "id": "h2hiboe",
            "score": 17,
            "text": "Glad I never played it in high school. Pick any other sport to play dudes. Wrestling, basketball, golf, baseball, track and field, soccer, don't trash your body for football.",
            "title_similarity": "0.5672649",
            "sentiment_compound": 0.521
        },
        {
            "id": "h2hibp7",
            "score": 6,
            "text": "this is a massive well covered up problem that affects Multipile Football codes from Soccer Aussie rules both flavors of Rugby and US Gridiron (when i say multiple basically if there is a sport that has physical contact like these is basically a guarantee if you are one of the Unlucky ones to be targetted in your career by head high tackles and similar incidents of head injury during the course of the game. Soccer headers while integral part of the game if your genetics are not up too it you are susceptible.",
            "title_similarity": "0.57551265",
            "sentiment_compound": 0.0258
        },
        {
            "id": "h2hidxl",
            "score": 1,
            "text": "Stories like this always makes me think of one of Helen’s (?) lines from Drop The Dead Donkey. (A topical 90s newsroom comedy from England). \n\nThere’s more on the boxing debate. Apparently being bludgeoned remorselessly about the head until you lose consciousness is bad for you…",
            "title_similarity": "0.5987367",
            "sentiment_compound": -0.891
        },
        {
            "id": "h2hig9w",
            "score": 1,
            "text": "Joe Montana talks about how it hurts everyday to walk even brett favre is scared of it happening",
            "title_similarity": "0.49976057",
            "sentiment_compound": -0.7184
        },
        {
            "id": "h2high5",
            "score": 27,
            "text": "The NFL brain bank is slang, as op clarified in below comment. \n\nHe specifically requested it sent to the medical department of Boston University for study.\n\nFrom Wikipedia:\n> The Miami-Dade County medical examiner reported that Duerson died of a self-inflicted gunshot wound to the chest.[6] He sent a text message to his family saying he wanted his brain to be used for research at the Boston University School of Medicine, which is conducting research into chronic traumatic encephalopathy (CTE), a neurodegenerative disease, which can be caused by playing football.",
            "title_similarity": "0.85905236",
            "sentiment_compound": -0.7579
        },
        {
            "id": "h2hiwd2",
            "score": 1,
            "text": "RIP to the hardest hitter in the NFL.",
            "title_similarity": "0.56385094",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2hiz52",
            "score": 2,
            "text": "The XFL has implemented some changes to typical football rules to try to lessen the chance of injury.  Some people think it makes the XFL less exciting than the NFL, but if you have to watch people give themselves brain damage to enjoy your time, you’re fucked up.",
            "title_similarity": "0.6672029",
            "sentiment_compound": -0.7612
        },
        {
            "id": "h2hj3xr",
            "score": 1,
            "text": "Man combat sports are insane as well",
            "title_similarity": "0.29551512",
            "sentiment_compound": -0.4588
        },
        {
            "id": "h2hj55p",
            "score": 3,
            "text": "And the NFL has done NOTHING to stop this from happening again. Why? Money. because these men are your entertainment and they are just worthless meat to you.",
            "title_similarity": "0.5456101",
            "sentiment_compound": 0.1994
        },
        {
            "id": "h2hje0c",
            "score": 2,
            "text": "When you realize they're just another gladiator.",
            "title_similarity": "0.3001215",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2hje8m",
            "score": 2,
            "text": "Flag football is the future",
            "title_similarity": "0.2538491",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2hjnbr",
            "score": 3,
            "text": "I was watching the 30 for 30 called The ‘85 Bears, they’re all good and this one is great. \n\nAnyway Jim McMahon goes to get a CAT scan at the end and they’re talking about how the compression of the neck leads to spinal fluid that can’t drain from the brain, so it just sits there marinating in this stuff. \n\nIt was really interesting.\n\n[Link to clip](https://youtu.be/gzaPmd1D2bU)",
            "title_similarity": "0.61733663",
            "sentiment_compound": 0.8748
        },
        {
            "id": "h2hjwnz",
            "score": 4,
            "text": "Junior Seau did the same thing for the same reason.",
            "title_similarity": "0.08274457",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2hjx5z",
            "score": 4,
            "text": "Knowing what we know about football, the people who play it are ultimately victims of your leisure  \n\n\nDon't let your kids play, and find something else to watch on Sunday that doesn't break people's brains.   Turn that shit off!",
            "title_similarity": "0.57829785",
            "sentiment_compound": -0.3382
        },
        {
            "id": "h2hjyx9",
            "score": 4,
            "text": "I took enough shots to the head playing high-school football.  I can't imagine surviving a college career...let alone pro",
            "title_similarity": "0.65059566",
            "sentiment_compound": -0.2705
        },
        {
            "id": "h2hk2wa",
            "score": 1,
            "text": "Haha it's ok guys anericas favorite past time haha it dont matter haha guys",
            "title_similarity": "0.24241205",
            "sentiment_compound": 0.8246
        },
        {
            "id": "h2hk5he",
            "score": 1,
            "text": "Hate thinking of how many concussions and brain injuries I have had over the years.\n\nLuckily I'm young. If I can avoid then from here on out hopefully I don't see too many effects later in life.\n\nBut I'm sure they'll come for me someday.",
            "title_similarity": "0.5131835",
            "sentiment_compound": 0.4588
        },
        {
            "id": "h2hk62y",
            "score": 2,
            "text": "They are actually cracking down on head shots in Australia for the NRL. Albeit a little controversial for consistency I think it's a good start.",
            "title_similarity": "0.4878341",
            "sentiment_compound": 0.3384
        },
        {
            "id": "h2hkf0t",
            "score": 2,
            "text": "My boys will never play football. The more I learn about this stuff the less i enjoy the game. It’s strange knowing these guys are truly destroying themselves for money and entertainment",
            "title_similarity": "0.5555543",
            "sentiment_compound": 0.2927
        },
        {
            "id": "h2hkgv6",
            "score": 2,
            "text": "Solution? Do away with helmets and pads and they will have to play like Aussie rules or rugby.",
            "title_similarity": "0.36868995",
            "sentiment_compound": 0.7351
        },
        {
            "id": "h2hkizh",
            "score": 1,
            "text": "has no one here seen concussion?",
            "title_similarity": "0.18093687",
            "sentiment_compound": -0.296
        },
        {
            "id": "h2hksqn",
            "score": 51,
            "text": "I had two traumatic brain injuries about 6 months apart back in 2016. I’m not an athlete, didn’t suffer them during any sports. Just freak accidents. \n\nI was a teacher with two months left from getting my masters degree with plans to move on to get my doctorate. All of that vanished in the blink of an eye. I’m still suffering from those head injuries to this day and have cognitive issues prevent me from getting back to that spot in my life. I possibly could, but finding a healthcare professional who is knowledgeable about this is apparently rare where I am, plus the injuries happened while at work so I’m all on my own in terms of insurance and bills - but even then, if a doctor finds out it was a work-related injury they steer clear. \n\nAll that to say, I can no longer watch MMA (a sport I loved and had watched literally since the very first UFC). Even hockey is hard for me to watch now which is my all time favorite sport. \n\nTo think that the issues I deal with on so many different levels can be brought upon kids half my age because of a game/sport really worries me. Every single day I wake up is a complete nightmare that I can’t express. It’s absolute hell. \n\nLook out for that noggin of yours.",
            "title_similarity": "0.6253433",
            "sentiment_compound": -0.92
        },
        {
            "id": "h2hllv6",
            "score": 1,
            "text": "can someone explain what chronic traumatic encephalopathy is please",
            "title_similarity": "0.49526644",
            "sentiment_compound": -0.34
        },
        {
            "id": "h2hlmyx",
            "score": 2,
            "text": "My ex was a pro football player. He wasn't super famous but you can play him on Madden. Any way, he retired after his 4th season due to too many concussions. He now participates in the brain study research.",
            "title_similarity": "0.7795514",
            "sentiment_compound": 0.2563
        },
        {
            "id": "h2hlzhh",
            "score": 1,
            "text": "[deleted]",
            "title_similarity": "0.120804265"
        },
        {
            "id": "h2hm280",
            "score": 1,
            "text": "In the movie: Concussion.",
            "title_similarity": "0.4050994",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2hm2o5",
            "score": 1,
            "text": "Same for Junior Seau",
            "title_similarity": "0.034250494",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2hm446",
            "score": 1,
            "text": "Sad",
            "title_similarity": "0.079921365",
            "sentiment_compound": -0.4767
        },
        {
            "id": "h2hm4hk",
            "score": 1,
            "text": "8y",
            "title_similarity": "-0.14846572",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2hmb5p",
            "score": 1,
            "text": "Okay, but what is that?",
            "title_similarity": "-0.14065377",
            "sentiment_compound": 0.1154
        },
        {
            "id": "h2hmcfw",
            "score": 2,
            "text": "Goodell won't do shit. All he cares about is money.",
            "title_similarity": "0.23871219",
            "sentiment_compound": 0.7117
        },
        {
            "id": "h2hmtx0",
            "score": 1,
            "text": "Not that I'm even aware of statistics on the subject but I feel like when someone commits suicide via gunshot, it's always the head. Is head faster/painless? \n\nBasically I'm just wondering if this guy had to suffer even more because he had chosen his chest due to him wanting to preserve his brain.",
            "title_similarity": "0.80790615",
            "sentiment_compound": -0.8625
        },
        {
            "id": "h2hn8pu",
            "score": 1,
            "text": "I hope you have enjoyed your time as Mod. The reports are because this was not supposed to hit the top of front page. Reddit is curated and this is NOT part of the sponsorship plan. Good luck in your future working for free endeavors.",
            "title_similarity": "0.49887246",
            "sentiment_compound": 0.9451
        },
        {
            "id": "h2hnfx2",
            "score": 8,
            "text": "As someone who is part of the concussion settlement I will tell you that it’s a joke. Too much red tape and flaming hoops to go through just to get proper treatment. Don’t even think about any settlement money because they made that just about impossible unless you have ALS or Parkinson’s. CTE never was part of the settlement because it can’t be proven until death.",
            "title_similarity": "0.6344897",
            "sentiment_compound": -0.4019
        },
        {
            "id": "h2hnl1n",
            "score": 6,
            "text": "I played football.\nI recently had a son.\nI do not want my son playing football. \nThere are way too many other options in life",
            "title_similarity": "0.58744067",
            "sentiment_compound": 0.4548
        },
        {
            "id": "h2hnqig",
            "score": 7,
            "text": "The NFL denied concussion damage for years.\nAfter they were finally forced to pay, they made sure to use \"race norming\" tactics to deny Black players settlement money.  \nThe NFL is a truly fucked up dirty racist organization.",
            "title_similarity": "0.71131134",
            "sentiment_compound": -0.9584
        },
        {
            "id": "h2hnubz",
            "score": 3,
            "text": "Surprised its taken this long to figure out banging your head is actually bad for your health",
            "title_similarity": "0.53473264",
            "sentiment_compound": -0.3818
        },
        {
            "id": "h2hnyqr",
            "score": 3,
            "text": "My insignificant story about full contact sports:  I played Rugby for about 20 years back in the late 80's/90's/00's.  I would see players (my team and opposing) get knocked out  on the field.   We would pull 'em off and lay them on the sidelines until they woke up.  When they woke up, the 'concussion remedy' was no drinking at the after match party.   Things have changed a lot.  My son just finished 4 years of high school football but from the beginning all the players had concussion protocol helmets that had transmitters telling coaches (who had receivers) if a player got a concussion level hit.  Regardless of how the young athlete felt after the hit, they were out of the game.",
            "title_similarity": "0.74436605",
            "sentiment_compound": 0.0644
        },
        {
            "id": "h2ho23l",
            "score": 1,
            "text": "O bet science will discover that Anything that shakes the brain or has head impacts can cause cte over time.\nFootball\nBoxing\nMMA\nSoccer\nDriving race cars\nFlying Jets\nMaybe even roller-coasters?\n\nThere are tiny ridges that scrape the brain upon impacts or sudden velocity changes",
            "title_similarity": "0.58438253",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2hoak7",
            "score": 2,
            "text": "I didn’t play anything above\nHigh School Football and AA hockey. I’m 41 and want the same. I’m fucked and I know it.",
            "title_similarity": "0.5367868",
            "sentiment_compound": -0.4019
        },
        {
            "id": "h2hop4v",
            "score": 3,
            "text": "Bear down 😢",
            "title_similarity": "0.12404025",
            "sentiment_compound": -0.4767
        },
        {
            "id": "h2hovyw",
            "score": 2,
            "text": "https://concussionfoundation.org/personal-stories/legacy-stories/andrew-erker",
            "title_similarity": "0.2972539",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2hp0lq",
            "score": 1,
            "text": "TIL the NFL has a brain bank",
            "title_similarity": "0.5092512",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2hq6m5",
            "score": 1,
            "text": "Heartbreaking, no pun intended. Really feel for these guys.",
            "title_similarity": "0.36751297",
            "sentiment_compound": -0.6369
        },
        {
            "id": "h2hqpcy",
            "score": 1,
            "text": "NFL is corporate now and could care less about players safety or health.",
            "title_similarity": "0.5169219",
            "sentiment_compound": 0.6943
        },
        {
            "id": "h2hqrhc",
            "score": 1,
            "text": "“May 11, 2011”",
            "title_similarity": "-0.026769694",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2hr4b3",
            "score": 1,
            "text": "!",
            "title_similarity": "-0.17018431",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2hr5dy",
            "score": 2,
            "text": "My former classmate Paul Oliver suffered from this as well. He took his life in a similar manner",
            "title_similarity": "0.60493267",
            "sentiment_compound": -0.2732
        },
        {
            "id": "h2hrg9t",
            "score": 1,
            "text": "An NFL player suffering from CTE??? Color me shocked.",
            "title_similarity": "0.6473223",
            "sentiment_compound": -0.7131
        },
        {
            "id": "h2hrhgt",
            "score": 8,
            "text": "This is one of those weird kinds of things where I agree with my Nazi stepdad\n\nHe thinks the NFL should be abolished because Kaepernick took a knee\n\nI think it should be abolished because it literally kills its players and sometimes their loved ones\n\nProfessional sports are a fucking blight",
            "title_similarity": "0.74960417",
            "sentiment_compound": 0.296
        },
        {
            "id": "h2hrwh9",
            "score": 2,
            "text": "This is tragic. \n\nBut, I never really understood why there is sooooo much debate about this. In the boxing world, fighters have been referred to as 'punch drunk\" for over a century now. It's a well know phenomenon.",
            "title_similarity": "0.57937646",
            "sentiment_compound": -0.4118
        },
        {
            "id": "h2hs28y",
            "score": 1,
            "text": "Football is a dead sport in another 10 years prolly. Good riddance",
            "title_similarity": "0.57450926",
            "sentiment_compound": -0.34
        },
        {
            "id": "h2hs62k",
            "score": 1,
            "text": "Doesn’t the NFL have a bit of a conflict of interest here?",
            "title_similarity": "0.45597738",
            "sentiment_compound": 0.1779
        },
        {
            "id": "h2hs7g7",
            "score": 3,
            "text": "The smiling PBS crew in the thumbnail really throws me off.",
            "title_similarity": "0.40473974",
            "sentiment_compound": 0.4588
        },
        {
            "id": "h2hs7vh",
            "score": 3,
            "text": "Still amazes me they have kids playing this sport, the way it is. NFL doesn't care about their players. They know there will always be the \"next man up\", willing to destroy their body for money. It got a little bit better when CTE was in the headlines. At least people are aware now. A lot still needs to change, though.",
            "title_similarity": "0.6436091",
            "sentiment_compound": 0.1264
        },
        {
            "id": "h2hscki",
            "score": 3,
            "text": "I stopped watching football when the CTE shit really hit the fan, can't imagine going back.",
            "title_similarity": "0.63736504",
            "sentiment_compound": -0.4472
        },
        {
            "id": "h2hso22",
            "score": 7,
            "text": "It’s not just football, either. I played soccer for 15 years and had to stop in college due to multiple concussions. Back in the 90s, nobody knew about CTE and there was no concussion protocol. Apparently I had multiple CT scans following the third degree concussion that ended my career, but guess what? I can’t remember it. I can’t remember a whole year of college. The crazy thing is that now in my 40s, I slur my speech and randomly go blank. I’m a biochemist in drug development. It’s not reassuring when I start to slur or go blank, then get anxious that I’m losing my mind. \n\nJust FYI - my kid didn’t choose to play soccer, and I was thrilled.",
            "title_similarity": "0.7150018",
            "sentiment_compound": -0.2818
        },
        {
            "id": "h2hu1c8",
            "score": 2,
            "text": "TIL the nfl has a brain bank.",
            "title_similarity": "0.5157212",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2hu6br",
            "score": 2,
            "text": "In the same sort of thing, there is a truly alarming, non-zero number of veterans that chose to self-immolate in protest of VA hospitals. \n\nSo what I have to urge you to do is to not join the armed forces nor the NFL until you are taken care of.",
            "title_similarity": "0.69122124",
            "sentiment_compound": 0.461
        },
        {
            "id": "h2hug5a",
            "score": 2,
            "text": "We as a society in the United States feed our children to this “game” willingly in the slight hope of success. Even with that success comes a steep price that many ultimately cannot overcome. But hey you know the team did good and the Machine made lots of money churning through kids without health insurance.\n\nEdit: spelling",
            "title_similarity": "0.5051105",
            "sentiment_compound": 0.8785
        },
        {
            "id": "h2hui5j",
            "score": 6,
            "text": "Jay Cutler was just recently talking about how he’s feeling. How many confirmed concussions he’s had and how he knows CTE and it’s effects are coming.\n\nI can’t and don’t want to understand what that realization is like.",
            "title_similarity": "0.6844001",
            "sentiment_compound": 0.5106
        },
        {
            "id": "h2huomp",
            "score": 4,
            "text": "Name another industry with a life expectancy around 55.  It just doesn't seem right that we tolerate that.",
            "title_similarity": "0.32429582",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2husye",
            "score": 1,
            "text": "Shooting yourself in the chest is a \"better\" way to kill yourself, regardless. More likely to kill you and any accidental survival is less likely to be an insufferable nightmare.",
            "title_similarity": "0.589123",
            "sentiment_compound": -0.8428
        },
        {
            "id": "h2hvn6k",
            "score": 9,
            "text": ">\tNFL’s brain bank\n\nThat’s dystopic as fuck.",
            "title_similarity": "0.54022133",
            "sentiment_compound": -0.5423
        },
        {
            "id": "h2hw7wx",
            "score": 3,
            "text": "I've been saying for years football needs to be banned in schools excluding colleges. How is a place of learning cool with brain damage? Oh right probably because they make money off the games and care more about that. Fuck them kids amirite?",
            "title_similarity": "0.69646275",
            "sentiment_compound": -0.7026
        },
        {
            "id": "h2hwu7b",
            "score": 3,
            "text": "After Junior Seau's death,. I question many athletes strange behaviours including Aaron Hernandez Chris Benoit, OJ etc. \n\nI was never a fan of football, and considered putting my kids in MMA, but I'm not even sure about that now as some of these MMA guys do some erratic shit.",
            "title_similarity": "0.6565653",
            "sentiment_compound": -0.8927
        },
        {
            "id": "h2hxhrf",
            "score": 1,
            "text": "I n .\nJ\nYou",
            "title_similarity": "-0.0647124",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2hxku8",
            "score": 7,
            "text": "Stop watching football.",
            "title_similarity": "0.35339773",
            "sentiment_compound": -0.296
        },
        {
            "id": "h2hxnpd",
            "score": 8,
            "text": "The NFL also used race-norming to deny claims for Black players in the class action suit settlement for those suffering from CTE:\n\nhttps://www.espn.com/nfl/story/_/id/31554110/nfl-halt-race-norming-review-black-claims-1-billion-concussion-settlement",
            "title_similarity": "0.6829928",
            "sentiment_compound": -0.6705
        },
        {
            "id": "h2hxut5",
            "score": 1,
            "text": "I always planned on preserving my brain in the event I kill myself for this exact reason.",
            "title_similarity": "0.51740885",
            "sentiment_compound": -0.6908
        },
        {
            "id": "h2hy5xk",
            "score": 1,
            "text": "So Sad .",
            "title_similarity": "0.083714485",
            "sentiment_compound": -0.5256
        },
        {
            "id": "h2hyfz3",
            "score": 3,
            "text": "It helps to see our flaws as a species in the context of history sometimes. Rome was not kind to its gladiators either.\n\nThe Roman Empire never died.  Just transformed and rebranded and exported itself.",
            "title_similarity": "0.5587336",
            "sentiment_compound": 0.4114
        },
        {
            "id": "h2hze2a",
            "score": 1,
            "text": "I saw the movie, i freaked out, can't believe what NFL does to the players.",
            "title_similarity": "0.6436627",
            "sentiment_compound": -0.296
        },
        {
            "id": "h2hzp1r",
            "score": 1,
            "text": "How bout...we stop playing this sport where people bang their heads together??",
            "title_similarity": "0.42973065",
            "sentiment_compound": -0.1926
        },
        {
            "id": "h2i05fo",
            "score": 1,
            "text": "It’s unfortunate that Junior Seau is often credited or most well known for this type of decision, both donating his brain and gun shot wound to the chest. Tragic.",
            "title_similarity": "0.65819126",
            "sentiment_compound": -0.5434
        },
        {
            "id": "h2i0hlr",
            "score": 2,
            "text": "For those like me who haven't heard of CTE:\n\n\n>C.T.E. is actually a new name for a disease that was once referred to as dementia pugilistica, or more commonly called “punch-drunk syndrome” because it was found among boxers.\nResearchers now say it’s a progressive neurological illness that can be caused by repeated blows to the head, including hits that impact at the so-called sub-concussive level.",
            "title_similarity": "0.6809216",
            "sentiment_compound": -0.0516
        },
        {
            "id": "h2i138u",
            "score": 1,
            "text": "Played football since I was about 7 years old until 18. Had a handful of undiagnosed concussions — multiple times my senior year I got hit and couldn’t even see straight for about 30 seconds, also crashed a car after a game due to delayed reaction timing.\n\nStarted getting anxiety around 19 and it has only seemingly gotten worse. Also just don’t feel as sharp mentally as I did in my teenage years.\n\nWish I could get tested for CTE just to know for sure.",
            "title_similarity": "0.72389424",
            "sentiment_compound": 0.3818
        },
        {
            "id": "h2i1538",
            "score": 3,
            "text": "My grandpa played in the nfl and recently passed away from a brain tumor. He had his brain removed and shipped across the country to be studied for brain damage caused while playing football. He would tell us how he felt depressed at times, even had a suicide note written out at one point. Nfl hasn’t paid out anything to my grandparents other than the low retirement check.",
            "title_similarity": "0.83750474",
            "sentiment_compound": -0.91
        },
        {
            "id": "h2i2bn0",
            "score": 1,
            "text": "Maybe only a CTE researcher could answer this, but even if someone shot himself through the brain, could you use the tissue still to see if CTE was present?",
            "title_similarity": "0.6986836",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2i2mjt",
            "score": 2,
            "text": "Aaron Hernandez had the worst case of CTE the pathologists had ever seen.  Certainly explains his baffling violent behavior.",
            "title_similarity": "0.5751046",
            "sentiment_compound": -0.765
        },
        {
            "id": "h2i2pex",
            "score": 3,
            "text": "Junior Seau 😢",
            "title_similarity": "-0.0050826073",
            "sentiment_compound": -0.4767
        },
        {
            "id": "h2i40ba",
            "score": 2,
            "text": "Football is a meat grinder. I played for 3 years in high school and then decided I wanted to become a healthy adult and never played again. \n\nWe need to encourage our kids towards other talents. violent sports, like football, appeal to our most self destructive nature.",
            "title_similarity": "0.7162689",
            "sentiment_compound": 0.3991
        },
        {
            "id": "h2i6c1y",
            "score": 2,
            "text": "Junior Seau also did this. \nSuch a shame. He was a nice guy to me the few times I met him.",
            "title_similarity": "0.357504",
            "sentiment_compound": -0.0772
        },
        {
            "id": "h2i6d2l",
            "score": 1,
            "text": "I played rep hockey my entire childhood, and at least half of my teammates got a concussion at one point. Thankfully I was one of the lucky ones. (Unless it went undiagnosed, who knows)",
            "title_similarity": "0.59730625",
            "sentiment_compound": 0.7906
        },
        {
            "id": "h2i7tqk",
            "score": 2,
            "text": "Just like Junior Seau. RIP.",
            "title_similarity": "0.17077039",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h2i8i93",
            "score": 1,
            "text": "This article is 10 years old.",
            "title_similarity": "0.052518092",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2i8xjx",
            "score": 1,
            "text": "I had two concussions in one season while I was in high school playing football. First was during practice and completely got knocked out and 2nd was the last game of the regular season. Playing football my entire life basically from 7 years old to 18 I’m sure I’ve had my handful of concussions and just head to head trauma over the years. Definitely scary thought as I get older and I’m about to finish college",
            "title_similarity": "0.703706",
            "sentiment_compound": 0.1531
        },
        {
            "id": "h2i90gw",
            "score": 9,
            "text": "As for everyone having a hissy for over the reposts: I’ve never understood this site-wide anger towards anyone who reposts something. \n\nLike, are we all supposed to comb through every post ever made on any sub we’re in, on the off chance someone else posted it 4 years and 37 days ago? \n\nIn most cases, you’re seeing the post of someone who saw something neat and wanted to share it with you, too. Maybe jumping down their throat and berating them for not seeing it isn’t the kindest (or most logical) thing to do.\n\nJust one gal’s two cents.",
            "title_similarity": "0.5617049",
            "sentiment_compound": 0.6124
        },
        {
            "id": "h2iadng",
            "score": 12,
            "text": "If you want a daily dose of depression, look up UFC fighters who've been in the game for at least 10 years. See if you can find their earliest interview and listen to them speak. Then see if you can find their most recent interview and listen to them speak. The difference is astounding.\n\nIf they just played that sequence of before and after interviews to fighters before they decided to go pro I bet you'd have a lot fewer competitors. I can't imagine someone going into a career that he knows is likely to destroy his mind. Then again some people do.",
            "title_similarity": "0.601594",
            "sentiment_compound": -0.4767
        },
        {
            "id": "h2ic5x5",
            "score": 3,
            "text": "I actually had to write an ethics paper on CTE in football so I’m familiar with the brain bank! There was a good ted talk on it called “Can I have your brain?” that is worth checking out.",
            "title_similarity": "0.6603576",
            "sentiment_compound": 0.6239
        },
        {
            "id": "h2ic6hm",
            "score": 1,
            "text": "Okay I just have to say it... are any of us truly suprised that a sport that involves slamming your head and face into another human being while running at full speed can cause lasting brain damage? Like, sure, the NFL is fucking vile for covering up just how bad it can be, but is anyone really suprised?",
            "title_similarity": "0.68469",
            "sentiment_compound": -0.3831
        },
        {
            "id": "h2icpsa",
            "score": 2,
            "text": "That is such a strange selfless act while doing one of the most saddest things at the same time.",
            "title_similarity": "0.24707806",
            "sentiment_compound": -0.7264
        },
        {
            "id": "h2id4je",
            "score": 2,
            "text": "I’m terrified of what the inside of my head looks like. I did rugby judo and other sports with contact and I’m exforces. Ive had a minimum of 5 concussions but that number is higher if you count times Ive been concussed but not seen a medical professional. Ive noticed changes already. I turn 40 on Friday",
            "title_similarity": "0.6207069",
            "sentiment_compound": -0.0772
        },
        {
            "id": "h2ie5nz",
            "score": 2,
            "text": "Spent an hour reading comments and educating myself on this subject further. Thanks for all the kinks and facts everyone. \n\nIve had a couple bonks to the noggin and can’t help but worry, if you’re having health problems, seek help! You are loved",
            "title_similarity": "0.5221161",
            "sentiment_compound": 0.68
        },
        {
            "id": "h2ifoth",
            "score": 2,
            "text": "Congratulations u/Str33twise84 ! Your post was the top post on r/todayilearned today! (06/21/21)\n\nTop Post Counts: r/todayilearned (1) \n\n*This comment was made by a bot*",
            "title_similarity": "0.3838426",
            "sentiment_compound": 0.7955
        },
        {
            "id": "h2ifvql",
            "score": 2,
            "text": "I've heard of quite a few American football players suffering from CTE and taking their own lives like that. I read a particularly sad story on the BBC website some time ago about a young man who had played football since he was very young, through highschool and into college.\n\nHe began to show signs of CTE and after researching its effects he decided to take his own life just like this NFL player. Very sad situation for not just for him but also the other players who are suffering from this.",
            "title_similarity": "0.77638745",
            "sentiment_compound": -0.7501
        },
        {
            "id": "h2igbyl",
            "score": 11,
            "text": "One of my childhood friends killed himself a few years ago and blamed his CTE in his suicide note, saying he couldn’t stand it anymore. We had drifted apart by high school and hadn’t spoken in a decade and I still cried when I saw his last vague facebook post, and absolutely sobbed when it was confirmed what happened.\n\nWe went to a powerhouse D-1 high school, the school that literally shares its football stadium with the Pro Football Hall of Fame. He went on to play at OSU. It ruined him. Football is the background radiation of life for anyone in Canton and I hate it. I can barely stomach seeing it on TV. Fuck football.",
            "title_similarity": "0.75573444",
            "sentiment_compound": -0.9638
        },
        {
            "id": "h2igytw",
            "score": 5,
            "text": "My university took scholarships away from football players who reported concussions and made them repay football scholarships if a sport cause injury kept them from being able to play..... then my last year there they punished athletes for not reporting concussions...... \n\n\n\n\nI hate sports and shitty sports culture but Jesus christ this is ridiculous and so stupid.",
            "title_similarity": "0.7527386",
            "sentiment_compound": -0.9342
        },
        {
            "id": "h2ihscy",
            "score": 1,
            "text": "Whoop",
            "title_similarity": "-0.12565242",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2iiei2",
            "score": 1,
            "text": "Haven't read all the comments and didn't see it pop up in the ones I read, but there's a movie about this, Concussion. Will Smith plays Dr. Bennet Omalu, who discovered the link between the head beatings and the neurological problems.\nGood movie.",
            "title_similarity": "0.73995733",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h2ijqq2",
            "score": 3,
            "text": "I’ve had 3 TBIs over the years and when I die I’m absolutely donating my brain. Maybe the things learned will help future generations to not have to go through the hardships, exhaustion, frustration, and constant pain that I have to endure in this life.",
            "title_similarity": "0.63024527",
            "sentiment_compound": -0.8779
        },
        {
            "id": "h2ijvix",
            "score": 2,
            "text": "Truly an amazing gift to give. You know you want out and are going to make that happen, but choose to do so in a way that a part of your body is preserved that can help others learn and hopefully save others in the future…and make sure to dictate that in your note, making it your last will and testament. Whereas I don’t ever want anyone to get to that point and I don’t want anyone to take their life, this man (and others, according to comments) used his suicide to help other people.",
            "title_similarity": "0.6279414",
            "sentiment_compound": 0.9517
        },
        {
            "id": "h2io12b",
            "score": 1,
            "text": "I don't know how my brain managed to survive. I guess it's better to be the guy doing the hitting instead of the guy getting hit.\n\nHips are fucked! Knees click and crack",
            "title_similarity": "0.54336107",
            "sentiment_compound": -0.4199
        },
        {
            "id": "h2iobf3",
            "score": 1,
            "text": "When you see a stern man crying, you feel pain, I think he committed suicide",
            "title_similarity": "0.5962324",
            "sentiment_compound": -0.8689
        },
        {
            "id": "h2ipniy",
            "score": 1,
            "text": "Just like in hockey, fans and the desire to make money will make sure this never changes.",
            "title_similarity": "0.31917763",
            "sentiment_compound": 0.7579
        },
        {
            "id": "h2iq4sy",
            "score": 1,
            "text": "This is an extremely unsafe sport that it is impossible to create adequate safety gear for so far, from what I understand.",
            "title_similarity": "0.27088276",
            "sentiment_compound": 0.7003
        },
        {
            "id": "h2iqmb6",
            "score": 2,
            "text": "It's not worth it. What good is money gonna do you if your brain is destroyed. You only get one body. If you don't have that, you have nothing.",
            "title_similarity": "0.46388888",
            "sentiment_compound": -0.242
        },
        {
            "id": "h2itfm3",
            "score": 1,
            "text": "There was a greys anatomy episode about this",
            "title_similarity": "0.28978086",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2itpvb",
            "score": 2,
            "text": "I have been diagnosed with severe clinical depression and TBI. Lost my family just before the first lockdown ensued.  Made an attempt on my life, I have 3 daughters, two of them are young. Glad I’m still here to share their laughter and smiles.  I had a very abusive father in my younger years.  That, plus years of military service and my boxing certainty contributed.  \n\nI feel that the lack of medical attention seems to be a concentrated effort in keeping Pandora’s box closed.",
            "title_similarity": "0.73301655",
            "sentiment_compound": -0.4391
        },
        {
            "id": "h2iuqut",
            "score": 1,
            "text": "I could care about sports except for bare knuckle, do you people not care about the thrashing NFL puts their men through?",
            "title_similarity": "0.65924704",
            "sentiment_compound": 0.1461
        },
        {
            "id": "h2iuvlh",
            "score": 1,
            "text": "this whole thread was a sad and terrifying read. It's infuriating seeing people being used and abused",
            "title_similarity": "0.31549138",
            "sentiment_compound": -0.926
        },
        {
            "id": "h2iv36s",
            "score": 1,
            "text": "Didn't Junior Seau do the same thing?",
            "title_similarity": "0.18043804",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2ivgex",
            "score": 1,
            "text": "Stupid question, couldn’t they theoretically find that out when he was still alive?",
            "title_similarity": "0.34039843",
            "sentiment_compound": -0.2023
        },
        {
            "id": "h2ivqn1",
            "score": 1,
            "text": "🤙",
            "title_similarity": "-0.13690303",
            "sentiment_compound": 0.4939
        },
        {
            "id": "h2iwqe5",
            "score": 2,
            "text": "Wait until you read about how the NFL has been covering it up for decades.",
            "title_similarity": "0.5955225",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2ixjte",
            "score": 2,
            "text": "I think Junior Seau did this too.",
            "title_similarity": "0.13160495",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2iyk3r",
            "score": 2,
            "text": "When I was like 9 a kid ran up to me on the playground and got me on the back of my head with a baseball bat. I just remember standing there, a pain in my head for a split second, and next tging I knew I was on the cold ground with a bunch of kids staring at me in a circle. When I got up they all ran away and everyone ignored me. Never knew who did it and i have a weird indent in my skull that I'm now realizing in my mid 30s is probably probably from that.\n\nI have had crippling depression and many mental/brain health issues my whole life. Including severe headaches growing up and memory issues. Wondering now if this is related. Wish there was a way to find out. Makes me really sad to think my whole life has been a trainwreck of pain and suffering because of whatever dipshit did that to me in 1st or 2nd grade.",
            "title_similarity": "0.54791445",
            "sentiment_compound": -0.9617
        },
        {
            "id": "h2iyzu8",
            "score": 2,
            "text": "The million dollar question - are you done with football?\n\nHaven't watched a minute in years except maybe 10 mins when it was on at a friends house or something.",
            "title_similarity": "0.53168356",
            "sentiment_compound": 0.4767
        },
        {
            "id": "h2iz11e",
            "score": 2,
            "text": "There is a really good movie from Will Smith - Concussion.\nIt is about a forensic pathologist, who discovers that getting hits to the head is not the best interest of humans, as they are not designed to to that. \nWearing a helmet is not improving that either.\nThe movie is focusing on the NFL in particular and the backlash of the fans and the industry as a doctor discovers and tells people about the health issues the athletes have to endure.",
            "title_similarity": "0.75473166",
            "sentiment_compound": -0.6107
        },
        {
            "id": "h2j03ui",
            "score": 1,
            "text": "Bless his soul.",
            "title_similarity": "0.11498542",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h2j0nc4",
            "score": 2,
            "text": "Junior Seau did the same thing for the same reasons.",
            "title_similarity": "0.0653983",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2j2z1i",
            "score": 4,
            "text": "I first read about this in a Men's Journal story entitled [Dave Duerson: The Ferocious Life and Tragic Death of a Super Bowl Star](https://www.mensjournal.com/health-fitness/dave-duerson-the-ferocious-life-and-tragic-death-of-a-super-bowl-star-20121002/). I've been an NFL fan and a Giants fan since the first Giants Stadium was constructed in the Meadowlands, so it's been a while.\n\nThe PBS story OP linked only briefly touches on Duerson's death. I think the Men's Journal story is a lot more impactful and worth reading. It opens with this paragraph:\n\n>Dave Duerson set the scene with a hangman’s care before climbing into bed with the revolver. The former Pro Bowl safety for the Super Bowl–champion 1985 Chicago Bears drew the curtains of his beachfront Florida condo, laid a shrine of framed medals and an American flag to his father, a World War II vet, and pulled the top sheet up over his naked body, a kindness to whoever found him later. On the dining room table were notes and a typed letter that were alternately intimate and official, telling his former wife where his assets were and whom to get in touch with to settle affairs. He detailed his motives for ending his life, citing the rupture of his family and the collapse of his finances, a five-year cliff dive from multimillionaire to a man who couldn’t pay his condo fees. Mostly, though, he talked about a raft of ailments that pained and depressed him past all tolerance: starburst headaches and blurred vision, maddening craters in his short-term memory, and his helplessness getting around the towns he knew. Once a man so acute he aced his finals at Notre Dame with little study time, he found himself now having to dash down memos about what he was doing and when. Names, simple words, what he’d eaten for dinner – it was all washing out in one long wave.",
            "title_similarity": "0.76256275",
            "sentiment_compound": -0.4091
        },
        {
            "id": "h2j3lmq",
            "score": 2,
            "text": "NFL brain bank... \n\nThe smallest vault on the planet.",
            "title_similarity": "0.4385695",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2jd2do",
            "score": 1,
            "text": "Oh the rate of it in these people (professional head trauma sustainers!) is near enough 100%.\nIt’s horribly sad but unless you fundamentally change the sport so people don’t get hit in the head so much there’s not really much you can do! It’s not like you can put padding between the brain and the inside of the skull...",
            "title_similarity": "0.5913295",
            "sentiment_compound": -0.8126
        },
        {
            "id": "h2jdn8u",
            "score": 2,
            "text": "That the NFL has a brain bank to show how much damage the players endure sounds pretty messed up.",
            "title_similarity": "0.68871355",
            "sentiment_compound": -0.34
        },
        {
            "id": "h2jdtc9",
            "score": 1,
            "text": "fuck the NFL, i learned they dont even have guaranteed contracts like the NBA and MLB",
            "title_similarity": "0.5237229",
            "sentiment_compound": -0.25
        },
        {
            "id": "h2jlmro",
            "score": 3,
            "text": "Honestly this might explain a few of my problems. Played 5 years of football and 7 of rugby. Never was diagnosed but took a lot of hits to the head, among other injuries.\n\nEver since finishing high school my mental issues got worse, depression and ADHD, and then dropping out of university the first time. I've had a lot of problems with focus and memory, constantly forgetting details about people I meet.\n\nI always thought I had just gotten dumber as I got older, going from a great student to someone who couldn't focus enough to succeed.",
            "title_similarity": "0.6739806",
            "sentiment_compound": -0.6369
        },
        {
            "id": "h2k8zzy",
            "score": 3,
            "text": "A lot of people think CTE is confined to NFL players and its not. Dave Mirra, freestyle BMX legend had CTE. The documentary on his life pointed out many professional riders felt several really bad slams late in his career contributed to it. Hearing his wife talk about him sitting on the edge of the bed, not knowing were he was, what time it was or what was going on was pretty chilling and depressing.",
            "title_similarity": "0.72215915",
            "sentiment_compound": -0.5874
        },
        {
            "id": "h2kc686",
            "score": 4,
            "text": "So if yall realize this is a problem, what are YOU doing about it? Have you stopped buying tickets to games? Stopped watching the games? Quit buying team merchandise? If EVERY ONE did that, they'd get the hint and take action.",
            "title_similarity": "0.5459219",
            "sentiment_compound": -0.755
        },
        {
            "id": "h2kkgx9",
            "score": 1,
            "text": "My greatest fear for my son. His father had countless head trauma /concussions growing up and this scares me so much",
            "title_similarity": "0.6092447",
            "sentiment_compound": -0.431
        },
        {
            "id": "h2koifo",
            "score": 1,
            "text": "All for fans' entertainnent.",
            "title_similarity": "0.05143214",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2l0uun",
            "score": 3,
            "text": "Can I just say I love the moderators comment more than I love the TIL. I mean, the TIL was awesome, but the moderator's takedown of whiney reporters who will bitch about anything & everything, including easy to find facts, because they lack something deeply integral to being an adult. Learning to live with shit we don't like. That's why our politics is so jacked up. It's filled with the same whiney bitches.",
            "title_similarity": "0.49691647",
            "sentiment_compound": -0.9534
        },
        {
            "id": "h2lyrrr",
            "score": 1,
            "text": "This stuff is frightening. To know your brain will inevitably turn on you. \n\nI played baseball and was a pretty reckless kid and had a few concussions then, but once I began working with students with autism I racked them up.\n\nRecently I received 3 concussions in 4 months, 2 of them within 24 hours. After the 3rd I got the proper treatment and even had a blood clot scare but I'm on the mend. I can estimate I've had 15 total concussions and because of this I need a career change. \n\nI'm pretty worried that the damage is done but am positive about the research.",
            "title_similarity": "0.6477817",
            "sentiment_compound": -0.3291
        },
        {
            "id": "h2m90sq",
            "score": 1,
            "text": "No problem signing that contract to get paid though right? Nah",
            "title_similarity": "0.18956567",
            "sentiment_compound": 0.2163
        },
        {
            "id": "h2ox1a8",
            "score": 1,
            "text": "this is really sad 🙁",
            "title_similarity": "0.14157018",
            "sentiment_compound": -0.6969
        },
        {
            "id": "h2pst72",
            "score": 1,
            "text": "I was the 90,000 upvote 😇\nRip Aaron Hernandez #85 #81",
            "title_similarity": "0.25409454",
            "sentiment_compound": 0.4588
        },
        {
            "id": "h2wzl7e",
            "score": 1,
            "text": "I dont wish a TBI on anyone. After seeing what it did to my dad, or the people I served with in the army. Shit can and will ruin your life. My dad was never the same after his, total personality change. Same with some of my army buddies. Shit, after a few hard landings I dont remember much before I was 21.",
            "title_similarity": "0.6983496",
            "sentiment_compound": -0.9282
        },
        {
            "id": "h3r9qru",
            "score": 1,
            "text": "\nI'm",
            "title_similarity": "-0.14613044",
            "sentiment_compound": 0.0
        },
        {
            "id": "h42ozq0",
            "score": 1,
            "text": "My dad played football for many years as a lineman. From early childhood into his mid 20s. I believe he had CTE. I regret not trying to see if I could have his brain donated to science to see if he had CTE. I  don’t even know if that’s something I  could’ve even done anyway. He struggled with the symptoms for most of his life and he died very suddenly. In the shock of making his funeral arrangements it never crossed my mind to have his brain donated.",
            "title_similarity": "0.77257276",
            "sentiment_compound": -0.8885
        },
        {
            "id": "hikw4il",
            "score": 1,
            "text": "I'm starting to wonder if the \"diagnosed only after death\" part of CTE is a conspiracy, that would be quite the liability. How many of us suffering with an invisible injury everyday are expected to start our lives like this? \n\nIve read enough of the outcomes I'm 20 now dealing with crazy symptoms played running back since I was 9 I am horrified for what my future holds.",
            "title_similarity": "0.6114335",
            "sentiment_compound": -0.9458
        }
    ]
}