{
    "TIL in 1965, Arnold Schwarzenegger went AWOL in the Austrian Army (during the 1 year service required by the government) to attend a bodybuilding contest. He spent a week in military prison, but won the contest, propelling the opportunity for larger contests and, ultimately, his ticket to to America\n": [
        {
            "id": "h2uz8ir",
            "score": 0,
            "text": "[deleted]",
            "title_similarity": "-0.0953551"
        },
        {
            "id": "h2uvjhb",
            "score": 1,
            "text": "I am guessing he didn't respect the military much after what he saw 20 years earlier.",
            "title_similarity": "0.44397366",
            "sentiment_compound": -0.3724
        },
        {
            "id": "h2umoyx",
            "score": 10,
            "text": "Basically, fuck forced conscription.",
            "title_similarity": "0.18748903",
            "sentiment_compound": -0.7579
        },
        {
            "id": "h2uuf1f",
            "score": -6,
            "text": "I legit thought Austrians weren't allowed to have a standing army. I have also thought that about Germany and Japan which is probably completely untrue",
            "title_similarity": "0.39871186",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2upkm5",
            "score": 1,
            "text": "u/GovSchwarzenegger We want to hear the story!",
            "title_similarity": "0.071732186",
            "sentiment_compound": 0.1511
        },
        {
            "id": "h2vtmjc",
            "score": 1,
            "text": "My comment is not to debate the merit of required service by a country, but some people ask what freedoms Americans have that other countries don't. We abolished The Draft, and don't force citizens into servitude. Just sayin'.",
            "title_similarity": "0.35812053",
            "sentiment_compound": 0.5719
        },
        {
            "id": "h2uwo59",
            "score": -3,
            "text": "[deleted]",
            "title_similarity": "-0.0953551"
        },
        {
            "id": "h2v2t7d",
            "score": -2,
            "text": "He's a Great person and a fellow catholic 😀",
            "title_similarity": "0.039516352",
            "sentiment_compound": 0.765
        },
        {
            "id": "h2vaktr",
            "score": -2,
            "text": ">and, ultimately, his ticket to to America \n\nMaking it sound like he won the fucking lottery or something lmao",
            "title_similarity": "0.42888665",
            "sentiment_compound": 0.8779
        },
        {
            "id": "h2uztq3",
            "score": -4,
            "text": "Fuck the military worldwide",
            "title_similarity": "0.29342705",
            "sentiment_compound": -0.5423
        },
        {
            "id": "h2v5bsp",
            "score": -4,
            "text": "”A ticket to America”. Like that i something hard or even a goal for a European.",
            "title_similarity": "0.2851606",
            "sentiment_compound": 0.2732
        },
        {
            "id": "h2unead",
            "score": -1,
            "text": "[deleted]",
            "title_similarity": "-0.0953551"
        },
        {
            "id": "h2uuscn",
            "score": -1,
            "text": "Columbu (while mixing lime into the mortar): Will it melt in there?\n\nArnie: Yes, throw it in. And the chip. There is one more chip... and it needs to be destroyed also. I know now why you cry, but it is something I could never do.\n\n*Sinks into the mortar bowl*\n...\n👍",
            "title_similarity": "0.43605655",
            "sentiment_compound": -0.3182
        },
        {
            "id": "h2v1m0i",
            "score": 1,
            "text": "Back when a \"ticket to America\" was a good thing",
            "title_similarity": "0.12770522",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h2v3kbc",
            "score": 1,
            "text": "Nowadays the Austrian Army encourages Sports. If you do your sport professionally you could do your training, instead of compulsory service. Nevertheless is the Austrian army an antisemitc, broke, drunk, backwards and humiliating place to be. Especially in compulsory service.",
            "title_similarity": "0.5526264",
            "sentiment_compound": -0.5423
        },
        {
            "id": "h2v4csh",
            "score": -1,
            "text": "Notably, a criminal offence like being AWOL from military service like this nowadays would prevent a future Arnold Schwarzenegger from even visiting the USA.",
            "title_similarity": "0.4476287",
            "sentiment_compound": -0.5473
        },
        {
            "id": "h2vg2wq",
            "score": -1,
            "text": "What kind of bullshit text is this, as if one would have to flee from Austria to the USA or what? \"His ticket to America\" lol\nYou can actually just buy a ticket to America for a few hundred dollars",
            "title_similarity": "0.58394206",
            "sentiment_compound": -0.3167
        },
        {
            "id": "h2uuhl3",
            "score": -10,
            "text": "Its weird thinking Arnold and Hitler are from the same country",
            "title_similarity": "0.31144786",
            "sentiment_compound": -0.1779
        },
        {
            "id": "h2v7h1m",
            "score": -4,
            "text": "[deleted]",
            "title_similarity": "-0.0953551"
        },
        {
            "id": "h2uimj7",
            "score": -4,
            "text": "Makes you wonder huh? Bill Burr didn’t include that fact lol.",
            "title_similarity": "0.19603068",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h2v9pee",
            "score": -1,
            "text": "[deleted]",
            "title_similarity": "-0.0953551"
        },
        {
            "id": "h2vm0fa",
            "score": -2,
            "text": "Fuck the military for that. Bunch of over entitled jackasses. Drop and lick my shoe fuckin maggot.",
            "title_similarity": "0.38801283",
            "sentiment_compound": -0.8074
        },
        {
            "id": "h2v1ftg",
            "score": 3,
            "text": "Damn shame he wasn't actually born in the US (Austrian) or had 1 US parent. He may have cheated on his wife - but would have been a huge and pretty intelligent improvement on Trump. (Whos parents were German I believe)\n\nWould rather hear \"I'll be back\" from Arnie than Trump.",
            "title_similarity": "0.6085857",
            "sentiment_compound": 0.9042
        },
        {
            "id": "h2ux9vl",
            "score": 0,
            "text": "Crime always pays",
            "title_similarity": "0.17951037",
            "sentiment_compound": -0.5423
        },
        {
            "id": "h2v2bwh",
            "score": 0,
            "text": "Wtf is AWOL ?",
            "title_similarity": "-0.031812858",
            "sentiment_compound": -0.7804
        },
        {
            "id": "h2vlp6h",
            "score": 0,
            "text": "I thought going AWOL was a death sentence. Maybe during war? Im wondering about the USA.",
            "title_similarity": "0.45859474",
            "sentiment_compound": -0.8893
        },
        {
            "id": "h2ux55n",
            "score": -9,
            "text": "Meanwhile, millions are whining about how hard it is to take a class on Zoom.",
            "title_similarity": "0.50533473",
            "sentiment_compound": -0.3182
        },
        {
            "id": "h2v3ot8",
            "score": 4,
            "text": "Stories like this shine a light on the most infuriating contradictions of everyday life for people of all ages...\n\nWe all need to follow the rules, but people who always follow the rules are suckers.\n\nIt's risk vs reward I guess, but that still breaks down to knowing when you should break rules and when to follow them. Coming from a \"black or white\" family this has been a crippling problem for me my whole life.",
            "title_similarity": "0.44110072",
            "sentiment_compound": -0.7897
        },
        {
            "id": "h2uwtqd",
            "score": 1,
            "text": "war is one thing, being in shape another",
            "title_similarity": "0.1360064",
            "sentiment_compound": -0.5994
        },
        {
            "id": "h2uxxfv",
            "score": 1,
            "text": "It was at his next competition in Germany that he busted out a pose that looked like a heil Hitler.  The crowd booed.  Arnold got pissed at his 2nd place trophy and told the crowd \"you people are nothing without a strong Austrian\"",
            "title_similarity": "0.7128681",
            "sentiment_compound": -0.113
        },
        {
            "id": "h2v47at",
            "score": 1,
            "text": "And one minor mistake afrer this could have not only cost him his future career, but his immediately life thereafter.\n\nSome Countries hold required military service a big.. very huge deal.\n\nHe got off and went onto a great career and did the most he could with it all things considered.\n\nIm still not a fan of military mandatory service indoctrinating the population of the country in which you were born. I understand why its the case in some countries, but again, it really sucks that its mandatory etc.\n\n I had a friend growing up that was born in france and then after his mom married someone of US citizenship.. they all lived in the united states as a whole family.\n\nEven thought that was the case, he still was required to go back and fullfill his duty as a citizen of France and fill his required military service of 1yr, no matter what.\n\nSucked, as I lost a close friend etc.. but he went and fullfilled his duty.\n\nSorry for the misspelling etc.. im commenting from a phone and have had a bit too many alcoholic beverages.",
            "title_similarity": "0.59291476",
            "sentiment_compound": 0.8909
        },
        {
            "id": "h2v4mc1",
            "score": -1,
            "text": "Is this the \"Republicans are scum because they got out of active duty\" thread?\n\nOr is it the \"Arnold is a Nazi because he's a Republican\" thread?\n\nBecause if it's the latter, [you did it already](https://imgur.com/a/vyVQG).",
            "title_similarity": "0.56784785",
            "sentiment_compound": 0.4696
        },
        {
            "id": "h2ufj95",
            "score": 36,
            "text": "[deleted]",
            "title_similarity": "-0.09535508"
        },
        {
            "id": "h2ux0q2",
            "score": 54,
            "text": "Tf is going on in the comments. It sounds like one person with multiple Reddit accounts just posting hate comments on Arnold Schwarzenegger. The comments keep specifically referencing his affair with the maid and his child out of wedlock; and every one heavily implies he's very evil like Satan in the flesh",
            "title_similarity": "0.4855628",
            "sentiment_compound": -0.6267
        },
        {
            "id": "h2v5ld6",
            "score": -10,
            "text": "So everyone favorite 80s action hero is ACTUALLY a coward haha",
            "title_similarity": "0.46909696",
            "sentiment_compound": 0.7832
        },
        {
            "id": "h2uwhm3",
            "score": 4,
            "text": "You'll never guess what he said to his other soldiers before he went AWOL...",
            "title_similarity": "0.44846648",
            "sentiment_compound": -0.4648
        },
        {
            "id": "h2uttlb",
            "score": -34,
            "text": "Can we stop praising this clearly terrible person?  And this goes out to u/GovSchwarzenegger. His next response will be some bullshit “keep hating because Im thriving” nonsense but imagine if I kept stealing from you and that was my response.  This man used illicit drugs, cheated on his wife and had another child, lied to citizens and now reddit still thinks he is a god.  I love his movies too but also The Cosby Show. Arnold Swarzenegger is a huge piece of shit and I hope he sees this and has the courage to call me and put me in front of him in public where I will expose everything else.  Has he ever held a public forum where he was called out and answered for it? Hell no.  He waits for shit to die down and knows all the sycophants will suck up.  Fuck you fake governor and when you’re ready I am here to call you out.  The fact you won’t proves me right but again the very easy out is “why would I respond to some nobody” which also proves me right because he doesn’t see people as relevant especially when they call him out.",
            "title_similarity": "0.50455934",
            "sentiment_compound": -0.983
        },
        {
            "id": "h2uhhn3",
            "score": -32,
            "text": "Buhahahaha Austrian Army….I bet their Special Forces “specializes” in knitting and creating discount clogs for the Netherlands.\n\nWWAD…. What Would Arnie Do?!\n\n\nGet to the Choppa!!!!",
            "title_similarity": "0.53822386",
            "sentiment_compound": 0.7243
        },
        {
            "id": "h2vb39z",
            "score": -6,
            "text": "[deleted]",
            "title_similarity": "-0.09535508"
        },
        {
            "id": "h2uxo8y",
            "score": 6,
            "text": "My big brother went AWOL the day I was born, to go see me and my mom in the hospital. Never ended up getting caught. TIL, my brother is better than Arnold Schwarzenegger.",
            "title_similarity": "0.7166069",
            "sentiment_compound": -0.0343
        },
        {
            "id": "h2uq5ab",
            "score": 5,
            "text": "His story is very inspiring.  If you haven't read \"Education of a Bodybuilder\" check it out.",
            "title_similarity": "0.39417964",
            "sentiment_compound": 0.4754
        },
        {
            "id": "h2uvef2",
            "score": 8,
            "text": "It's Toto Africa not to to America, duh",
            "title_similarity": "0.09929332",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2v8npg",
            "score": 9,
            "text": "To me Arnold is the greatest human alive in terms of his life path and achievements. He started in a starving post-WW2 Austrian village and through his sheer will power, unbelievable work ethic and smart life choices became the most interesting person in the world. Like, did you know he was already a millionaire before he even started his film career (and if I recall correctly he wasn't even 30)? As in, he didn't have to do it and he would've been just fine. And he didn't even earn it through his bodybuilding career. He's just an incredible human and probably the only person I truly admire. Everything he puts his eye on, he accomplishes, I can't comprehend how someone can do it. His autobiography is super interesting and I'd advise everyone to read it. It start with him saying that if it was a movie you wouldn't believe it. And that's exactly how it is.",
            "title_similarity": "0.7199623",
            "sentiment_compound": 0.9819
        },
        {
            "id": "h2unm31",
            "score": 164,
            "text": "I think he made the right choice.\n\nDon't go AWOL. Don't sit in the brig for a week.   \nGo AWOL. Set in motion a chain of events leading to becoming a millionair, famous and Governor of California.",
            "title_similarity": "0.65782",
            "sentiment_compound": -0.1352
        },
        {
            "id": "h2ugi5f",
            "score": 36,
            "text": "Interesting he’s a pretty chill guy",
            "title_similarity": "0.058975644",
            "sentiment_compound": 0.7096
        },
        {
            "id": "h2ufe0j",
            "score": 85,
            "text": "Mac, he was a good soldier.",
            "title_similarity": "0.057263896",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h2v2y0m",
            "score": 41,
            "text": "That man signed my bachelor’s degree from the University of California. \n\nThe accreditation of educational attainment is also a celebrity memorabilia!",
            "title_similarity": "0.42920706",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2uzh60",
            "score": 44,
            "text": "When the penalty for breaking the law is less than the benefit, it becomes no more than a cost of doing business.",
            "title_similarity": "0.2323979",
            "sentiment_compound": -0.3535
        },
        {
            "id": "h2ufb7r",
            "score": 727,
            "text": "Don’t bust your ass for the job you have, bust your ass for the job you want.",
            "title_similarity": "0.23591185",
            "sentiment_compound": -0.7717
        },
        {
            "id": "h2uxf1l",
            "score": 156,
            "text": "As Arnie left for the event, he is rumoured to have shouted over his shoulder “I’ll be back!”",
            "title_similarity": "0.27389",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2v1nev",
            "score": 82,
            "text": "Furthermore, although the military had to punish him, because he won that contest, they were proud of him and allowed him to store weights in his tank to keep working out.\nYears later, Arnold actually reached out to them and managed to get his old tank shipped out to him to America, which is the one you can see in the videos of him on YouTube.",
            "title_similarity": "0.7276288",
            "sentiment_compound": 0.5859
        },
        {
            "id": "h2uybfs",
            "score": 134,
            "text": "His commanding officers were impressed by his successful performance, especially as it reflected well on the army.\n\nThey still had to be seen to punish him, so the *'punishment'* was working in the kitchen, where he had free access to as much healthy food as he could eat.",
            "title_similarity": "0.40401363",
            "sentiment_compound": 0.7976
        },
        {
            "id": "h2uonih",
            "score": 2098,
            "text": "TIL that for 51 weeks the Austrian Army was completely unstoppable.",
            "title_similarity": "0.54459935",
            "sentiment_compound": -0.2716
        },
        {
            "id": "h2upof5",
            "score": 3628,
            "text": "When I was 17 I couldn't get anyone to cover my shift at McDonalds to go to an application interview for my first choice of university and program, which I had already been accepted into the first round of applicants.\n\nI couldn't call in sick because I already asked the manager if someone could cover my shift so they knew I was looking to bail.\n\nSo I just decided to not show up. And went to the interview. Fuck if I was going to go to my shift at McDicks to miss out an opportunity of a lifetime.\n\nI obviously got reprimanded at work and had to see the owner of the particular McDonalds location I worked at. I explained my situation and he just wrote me up a warning but as I was leaving he smiled and was like \"I just want you to know that you made the right choice\"",
            "title_similarity": "0.68893695",
            "sentiment_compound": 0.8591
        },
        {
            "id": "h2uo3py",
            "score": 243,
            "text": "The book Total Recall is his life story and is worth reading.",
            "title_similarity": "0.27424413",
            "sentiment_compound": 0.2263
        },
        {
            "id": "h2unva3",
            "score": 1335,
            "text": "Guy's been hitting nothing but net for over four decades!",
            "title_similarity": "0.5207109",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2ug7n7",
            "score": 8343,
            "text": "Three years later, he was living in Venice Beach, California. Along with fellow famed bodybuilder, Franco Columbu, he opened a brick laying business that became quite successful, financially fueling other business ventures, while simultaneously becoming the most famous bodybuilder in the world.",
            "title_similarity": "0.623765",
            "sentiment_compound": 0.624
        },
        {
            "id": "h2uhqnz",
            "score": 2,
            "text": "That's DEDICATION! AWOL Arnie!!",
            "title_similarity": "0.007991092",
            "sentiment_compound": -0.6006
        },
        {
            "id": "h2ui5uk",
            "score": 34,
            "text": "I wonder what that week in military prison was like",
            "title_similarity": "0.514132",
            "sentiment_compound": -0.2023
        },
        {
            "id": "h2ulrnn",
            "score": 30,
            "text": "Didn't he also crash a tank?",
            "title_similarity": "0.27328816",
            "sentiment_compound": 0.3089
        },
        {
            "id": "h2uqugi",
            "score": 1,
            "text": "Calculated risk that paid off, I guess.",
            "title_similarity": "-0.05141512",
            "sentiment_compound": -0.2732
        },
        {
            "id": "h2uttzn",
            "score": 1,
            "text": "[He got his weight training in even while on maneuvers.](https://youtu.be/sk-RexAhHNI?t=467)",
            "title_similarity": "0.47116897",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2uv0lj",
            "score": 1,
            "text": "[deleted]",
            "title_similarity": "-0.0953551"
        },
        {
            "id": "h2uvpyb",
            "score": 1,
            "text": "#WorthIt",
            "title_similarity": "-0.13520706",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2uvuuk",
            "score": 1,
            "text": "Risk vs. Reward; he knew the risks and felt the reward was worth it.",
            "title_similarity": "0.07171029",
            "sentiment_compound": 0.7269
        },
        {
            "id": "h2uw7qn",
            "score": 1,
            "text": "There are two people that get a lifetime pass from me: Charles Barkley and Arnold. Love them both.",
            "title_similarity": "0.33263433",
            "sentiment_compound": 0.6369
        },
        {
            "id": "h2uwg9w",
            "score": 2,
            "text": "What's good for the frog is not always what's good for the scorpion",
            "title_similarity": "0.18573532",
            "sentiment_compound": 0.1265
        },
        {
            "id": "h2uwjdz",
            "score": 1,
            "text": "Is this honorable?",
            "title_similarity": "-0.18479034",
            "sentiment_compound": 0.5423
        },
        {
            "id": "h2uwo3h",
            "score": 2,
            "text": "*I'll be back*",
            "title_similarity": "-0.05256341",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2ux8fp",
            "score": 1,
            "text": "Hey heres a question that Ive kinda thought of but never thought to ask.. \n\nPardon my ignorance but\n\nIs army prison worse than normal prison? Whats the difference?",
            "title_similarity": "0.40768188",
            "sentiment_compound": -0.9404
        },
        {
            "id": "h2uxzp0",
            "score": 2,
            "text": "Totes worth it",
            "title_similarity": "-0.15139942",
            "sentiment_compound": 0.2263
        },
        {
            "id": "h2uyaoh",
            "score": 2,
            "text": "Yes, but did he accomplish anything after that first win? \n\n*winks",
            "title_similarity": "0.28732216",
            "sentiment_compound": 0.8945
        },
        {
            "id": "h2uyq9z",
            "score": 1,
            "text": "Ok",
            "title_similarity": "-0.30487442",
            "sentiment_compound": 0.296
        },
        {
            "id": "h2uyt22",
            "score": 353,
            "text": "During this time a 1977 interview in adult magazine Oui gained attention, in which Schwarzenegger discussed using substances such as marijuana.[146] Schwarzenegger is shown smoking a marijuana joint after winning Mr. Olympia in 1975 in the documentary film Pumping Iron (1977). In an interview with GQ magazine in October 2007, Schwarzenegger said, \"[Marijuana] is not a drug. It's a leaf. My drug was pumping iron, trust me.\"[147] His spokesperson later said the comment was meant to be a joke.[147]\n\n\n\nNot too long ago this was a huge controversial scandal lmao",
            "title_similarity": "0.669394",
            "sentiment_compound": 0.8957
        },
        {
            "id": "h2uyu76",
            "score": 7,
            "text": "Austrians sheer fucking will is scary.",
            "title_similarity": "0.22843784",
            "sentiment_compound": -0.5367
        },
        {
            "id": "h2uyvkf",
            "score": 1,
            "text": "In his book he said he was never punished amd was made a good example out of! The name of the book escapes me but 1st ed was ~'74",
            "title_similarity": "0.41326785",
            "sentiment_compound": 0.4993
        },
        {
            "id": "h2uywn3",
            "score": 1,
            "text": "I mean...he moved to the UK and lived there first after leaving the army.",
            "title_similarity": "0.43882072",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2uz20d",
            "score": 1,
            "text": "Good morning",
            "title_similarity": "-0.05762347",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h2uzgbx",
            "score": 1,
            "text": "Ends justifying the means",
            "title_similarity": "-0.12786764",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2uzw7k",
            "score": 2,
            "text": "Took me a while but there are 2 to’s!",
            "title_similarity": "0.18269238",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2uzz9h",
            "score": 2,
            "text": "I feel so sorry for him the way America has turned out",
            "title_similarity": "0.25459337",
            "sentiment_compound": -0.188
        },
        {
            "id": "h2v0436",
            "score": 10,
            "text": "\"you wont get anywhere without breaking some of the rules\" - ***Arnold Schwarzenegger***",
            "title_similarity": "0.30316198",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2v0a45",
            "score": 1,
            "text": "To to America and BEYOND!",
            "title_similarity": "0.011271898",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2v0gxq",
            "score": 2,
            "text": "This story would be perfect for explaining opportunity cost in ECON 101",
            "title_similarity": "0.10563983",
            "sentiment_compound": 0.7579
        },
        {
            "id": "h2v0i44",
            "score": 1,
            "text": "Successful people know when to take risks.  Only losers spend their lives playing it safe.",
            "title_similarity": "0.24062657",
            "sentiment_compound": 0.4588
        },
        {
            "id": "h2v0om6",
            "score": 1,
            "text": "Crime pays.",
            "title_similarity": "0.024035875",
            "sentiment_compound": -0.5423
        },
        {
            "id": "h2v0t3k",
            "score": 2,
            "text": "His book total recall goes through all this,. Its a good read",
            "title_similarity": "0.1486831",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h2v12om",
            "score": 2,
            "text": "He said I'll be back! and escaped the army.",
            "title_similarity": "0.30184293",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2v12p1",
            "score": 3,
            "text": "*when gambling pays off*",
            "title_similarity": "0.024661928",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2v1udi",
            "score": 11,
            "text": "Come with me if you want to lift!",
            "title_similarity": "0.06555705",
            "sentiment_compound": 0.1511
        },
        {
            "id": "h2v27zm",
            "score": 1,
            "text": "Find your bodybuilding contest and start taking risks people.",
            "title_similarity": "0.3979735",
            "sentiment_compound": -0.2732
        },
        {
            "id": "h2v2fx4",
            "score": 2,
            "text": "Fucking Chad",
            "title_similarity": "0.049672473",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2v3aye",
            "score": 2,
            "text": "Finally, some good fucking TIL.",
            "title_similarity": "0.0049222056",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h2v3cyo",
            "score": 1,
            "text": "I wonder what visa bodybuilding gets you to stay in the USA.",
            "title_similarity": "0.4480325",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2v3ixo",
            "score": 1,
            "text": "Arnold is a true icon out here",
            "title_similarity": "0.004044628",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h2v3pim",
            "score": 1,
            "text": "Fortune favors the bold.",
            "title_similarity": "0.0013405457",
            "sentiment_compound": 0.5574
        },
        {
            "id": "h2v4ah2",
            "score": 1,
            "text": "I thought he was German till now.",
            "title_similarity": "0.27512243",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2v5aia",
            "score": 1,
            "text": "He also crashed a tank too",
            "title_similarity": "0.3446254",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2v5cav",
            "score": 1,
            "text": "That's awesome he just didn't show up to work one day. Don't blame him...",
            "title_similarity": "0.33651382",
            "sentiment_compound": 0.7299
        },
        {
            "id": "h2v5ys1",
            "score": 1,
            "text": "I like the idea of having such a clear singular focus that jail time is factored into the plan.",
            "title_similarity": "0.1857861",
            "sentiment_compound": 0.6249
        },
        {
            "id": "h2v61io",
            "score": 1,
            "text": "Asked if he could remember this, Arnold had total recall",
            "title_similarity": "0.15838401",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2v75tn",
            "score": 1,
            "text": "I to to America!",
            "title_similarity": "0.08155687",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2v8950",
            "score": 1,
            "text": "so what the guy who's sentence you commuted guilty or not /u/govschwarzenegger \n\njust...coincidence it was fabian nunez's kid right",
            "title_similarity": "0.4616692",
            "sentiment_compound": -0.3612
        },
        {
            "id": "h2v8bum",
            "score": 1,
            "text": "I literally read this on page 39 of his book 'total recall' yesterday, weird. I would highly recommend it to everyone; the man has led one of the most interesting lives and it's an easy read.",
            "title_similarity": "0.5306515",
            "sentiment_compound": 0.7732
        },
        {
            "id": "h2v8e20",
            "score": 1,
            "text": "How on earth is going missing from military is only one week lockup",
            "title_similarity": "0.54002005",
            "sentiment_compound": -0.296
        },
        {
            "id": "h2v8p7o",
            "score": 1,
            "text": "Winner.",
            "title_similarity": "-0.042470276",
            "sentiment_compound": 0.5859
        },
        {
            "id": "h2v8xai",
            "score": 2,
            "text": "Before he went AWOL he told his buddies “I’ll be back”",
            "title_similarity": "0.34269089",
            "sentiment_compound": -0.4648
        },
        {
            "id": "h2v98oi",
            "score": 60,
            "text": "Schwarzenegger served in the Austrian Army in 1965 to fulfill the one year of service required at the time of all 18-year-old Austrian males. During his army service, he won the Junior Mr. Europe contest.\n\nSchwarzenegger joined a year earlier thanks to his father’s military connections, and hoped this experience would expand his horizons.\n\nArmy service set well with the young Arnold, because it fed his hunger for strength, power and control. He was underage when he was assigned to be a tank driver, and his love for tanks persists to this day. Schwarzenegger still had a couple of smudges on his record – such as crashing a jeep and sneaking out of the base – and ended up being honorably discharged in 1965.\n\nArnie wasn’t allowed to leave the base to compete in bodybuilding competitions, but that was one army rule he simply couldn’t follow. He went AWOL and hopped on a train to Stuttgart, where he won the Junior Mr. Europe contest.\n\n“Participating in the competition meant so much to me that I didn’t carefully think through the consequences. When I got to Stuttgart, I was all confused. I forgot my posing routine, I had to borrow posing trunks, but I still won!” Schwarzenegger later recalled.\n\nNeedless to say, his commanding officers weren’t happy after learning he snuck out of the base. He was stripped of his tank driving duties, and ended up being sentenced to seven days in army jail, but officers changed their tune after seeing his trophy. They let him out two or three days later, and helped him work towards his goals by creating a makeshift gym where he could train.\n\nArnold Schwarzenegger contacted the Austrian army in 1991 asking if he could have his M-47 Patton tank back. He got permission to ship the tank to the US, and he cashed out $20.000 in the process.",
            "title_similarity": "0.8611784",
            "sentiment_compound": 0.9598
        },
        {
            "id": "h2v9gkr",
            "score": 1,
            "text": "He couldn’t get to the choppa’",
            "title_similarity": "0.1355714",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2v9ij9",
            "score": 2,
            "text": "His mental toughness and determination is enviable and admirable.  I have nothing but respect for him.",
            "title_similarity": "0.19066845",
            "sentiment_compound": -0.0724
        },
        {
            "id": "h2v9k8k",
            "score": 2,
            "text": "Damn I just realized he was already 44 years old when Terminator 2 came out! I always thought he was in his 20s for that movie. Wow.",
            "title_similarity": "0.59952855",
            "sentiment_compound": 0.3382
        },
        {
            "id": "h2vabby",
            "score": 30,
            "text": "Say what you will about the old Oak, but for me he really is one of the most inspirational people to have lived in recent times. Literally self made success, saw what he wanted, worked damn hard, harder than most would and obtained what he wanted. He also used one goal to propel into the next and became the best he could at that too - used his fantastic appearance from bodybuilding to become an actor and action hero, became the best and most known action hero, used that to get into politics, reached the highest possible position for an immigrant as governor of California(pls correct me if mistaken) and so on. I also love the fact that he spent something like $250k converting his enormously gas guzzling military hummer into an electric vehicle back in the 00’s when EV tech was mad expensive and not great at the time, just so he could continue driving such a vehicle and showing that it can be done.",
            "title_similarity": "0.61629593",
            "sentiment_compound": 0.9883
        },
        {
            "id": "h2vabw6",
            "score": 1,
            "text": "Holy shit Arnold is 73 years old",
            "title_similarity": "0.22876343",
            "sentiment_compound": -0.5574
        },
        {
            "id": "h2vb6gp",
            "score": 1,
            "text": "u/govschwarzenegger, I'd like to hear this story from you!",
            "title_similarity": "0.077684686",
            "sentiment_compound": 0.4199
        },
        {
            "id": "h2vbc2z",
            "score": 1,
            "text": "Best army recruiting ever, seeing him in competition. Join the army, look like this.",
            "title_similarity": "0.6056999",
            "sentiment_compound": 0.836
        },
        {
            "id": "h2vbh8b",
            "score": 1,
            "text": "He said “he will be back”",
            "title_similarity": "-0.0015670657",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2vbjmt",
            "score": 1,
            "text": "thanks",
            "title_similarity": "-0.26341298",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h2vbk4l",
            "score": 1,
            "text": "This guy is an awesome person",
            "title_similarity": "-0.024592832",
            "sentiment_compound": 0.6249
        },
        {
            "id": "h2vbr6g",
            "score": 1,
            "text": "To make this post better it should've been submitted by the governator himself.",
            "title_similarity": "0.26103795",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h2vbs96",
            "score": 1,
            "text": "Read his autobiography. It's the best I've ever read",
            "title_similarity": "0.4240535",
            "sentiment_compound": 0.6369
        },
        {
            "id": "h2vbzzp",
            "score": 3,
            "text": "Austrian army: hey, where do you think you going?\n\n\nArnold: I'll be back!",
            "title_similarity": "0.41354397",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2vc9ae",
            "score": 1,
            "text": "His autobiography is well worth reading!",
            "title_similarity": "0.14496468",
            "sentiment_compound": 0.5093
        },
        {
            "id": "h2vcb40",
            "score": 1,
            "text": "What is happening? I have been getting lot of content about Arnold on YouTube and reddit. Is he running for president of some sorts ?",
            "title_similarity": "0.5798055",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2vdl18",
            "score": 1,
            "text": "Terminated",
            "title_similarity": "-0.0750184",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2ve076",
            "score": 1,
            "text": "And used his ridiculous muscles to break out of prison in only a week.",
            "title_similarity": "0.76204455",
            "sentiment_compound": -0.7003
        },
        {
            "id": "h2veccd",
            "score": 1,
            "text": "It's also cool that he has a huge relationship with his Mexican son born by his maid while he was still married to Maria was scandalous.\n\nAlso, his Mex son looks the most like him during the Conan years. 😁. His Keneddy children don't look like Arnold at all.",
            "title_similarity": "0.69152737",
            "sentiment_compound": 0.5971
        },
        {
            "id": "h2veqjm",
            "score": 2,
            "text": "Mandatory service…. Sounds a lot like slavery",
            "title_similarity": "0.1576216",
            "sentiment_compound": -0.4588
        },
        {
            "id": "h2vf3ig",
            "score": 1,
            "text": "“You gotta know when to hold ‘em, and know when to fold ‘em...”",
            "title_similarity": "-0.046022274",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2vfg35",
            "score": 3,
            "text": "When they let him out of the prison for that week they set him up with weight and an area to workout. They also celebrated him by touting that he won the contest to other parts of their military.",
            "title_similarity": "0.8117785",
            "sentiment_compound": 0.5267
        },
        {
            "id": "h2vh2zf",
            "score": 1,
            "text": "Surprised u/govschwarzenegger hasn’t commented tbh, he’s pretty active on Reddit",
            "title_similarity": "0.4187739",
            "sentiment_compound": 0.7783
        },
        {
            "id": "h2vh91y",
            "score": 1,
            "text": "Learned it from this sub like a month ago maybe",
            "title_similarity": "0.39313483",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h2vh997",
            "score": 1,
            "text": "And didn't his commanding officers come around to Arnold doing his bodybuilding because it was good advertising for the Army after he won? Seem to recall something like that from his book Total Recall.",
            "title_similarity": "0.6890609",
            "sentiment_compound": 0.8442
        },
        {
            "id": "h2vhj6l",
            "score": 1,
            "text": "He went to the UK first where he worked as a debt collector.",
            "title_similarity": "0.372218",
            "sentiment_compound": -0.3612
        },
        {
            "id": "h2viaku",
            "score": 1,
            "text": "One ticket to paradise.",
            "title_similarity": "-0.0016146172",
            "sentiment_compound": 0.6369
        },
        {
            "id": "h2visp5",
            "score": 2,
            "text": "Cuz he’s ballsy and he don’t take shit from anybody- unlike you! Hahhahahahaha",
            "title_similarity": "0.2178765",
            "sentiment_compound": -0.5983
        },
        {
            "id": "h2vjasr",
            "score": 1,
            "text": "yup, when he came back they even built him a gym on base.",
            "title_similarity": "0.5316064",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2vl5j1",
            "score": 1,
            "text": "Now we need a movie about this...",
            "title_similarity": "0.106607445",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2vlmdo",
            "score": 1,
            "text": "My favorite fact about his army life was when he got to drive a tank and he decided the best thing he could do was race other tank drivers. He then proceeded to drive the tank off a cliff (but won the race)",
            "title_similarity": "0.665256",
            "sentiment_compound": 0.8641
        },
        {
            "id": "h2vmb42",
            "score": 1,
            "text": "What is AWOL?",
            "title_similarity": "-0.113496155",
            "sentiment_compound": -0.4648
        },
        {
            "id": "h2vn0tt",
            "score": 1,
            "text": "I watched a documentary about him back in the 90's, he took a huge risk with that and he's lucky that he only got a week in prison.  Military USUALLY takes it very seriously.",
            "title_similarity": "0.71759987",
            "sentiment_compound": -0.3167
        },
        {
            "id": "h2vnlpn",
            "score": 3,
            "text": "Let's put another shrimp on the Barbe",
            "title_similarity": "0.1681653",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2vo301",
            "score": 3,
            "text": "The punishment is death by firing squad but the bullets couldn't pierce through his muscles, in fear of waisting all the ammo in the Austrian Army, they decided the brig was a cheaper choice.",
            "title_similarity": "0.59284735",
            "sentiment_compound": -0.8608
        },
        {
            "id": "h2vpruy",
            "score": 1,
            "text": "Ironically....He Won't Be Back...lol",
            "title_similarity": "0.028886715",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2vq70x",
            "score": 2,
            "text": "It was actually a 3 year service, because he was a tank operator, which carries a longer service term. After crashing the tank onto a wall and collapsing half a barracks building, he was prematurely discharged because they figured he was too much trouble to keep in the service.",
            "title_similarity": "0.7358714",
            "sentiment_compound": -0.5994
        },
        {
            "id": "h2vq9or",
            "score": 1,
            "text": "what did Ah-nold do in the Austrian army? He drove a tank.\n\nWhat did Ah-nold do when he got up to $100-million? He bought that tank.\n\nNot just a similar tank, or a tank that was the same model...he bought the exact tank he used to drive...\n\nThe Sultan of Brunei gets one of every new Ferrari model that is made. He has a warehouse full of them in pristine condition.\n\nWho would you rather have lunch with?",
            "title_similarity": "0.7233335",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2vqq2d",
            "score": 3,
            "text": "Been working out a long time and there's times I just don't feel like it anymore and have no motivation left. When that happens I turn on one of this guys motivationonal speeches and it gets me going.",
            "title_similarity": "0.49024966",
            "sentiment_compound": -0.4847
        },
        {
            "id": "h2vqvch",
            "score": 2,
            "text": "That dude has always kinda lived by his own code. He really made his own way, didn’t he?\n\nGotta admire the hell outta that.",
            "title_similarity": "0.25174737",
            "sentiment_compound": -0.3612
        },
        {
            "id": "h2vstx0",
            "score": 2,
            "text": "The GOAT",
            "title_similarity": "0.0006760247",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2vtj3l",
            "score": 3,
            "text": "I think it would be tough to issue him a standard military uniform",
            "title_similarity": "0.21458666",
            "sentiment_compound": -0.128
        },
        {
            "id": "h2vukdt",
            "score": 2,
            "text": "The link is to a part where Schwarzenegger does an ugly political favor to his friend, to get the son out of jail after killing someone else. Does anybody on Reddit click the link?",
            "title_similarity": "0.5914718",
            "sentiment_compound": -0.4215
        },
        {
            "id": "h2vux64",
            "score": 1,
            "text": "u/GovSchwarzenegger",
            "title_similarity": "0.003598459",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2vvfpw",
            "score": 1,
            "text": "That is definitely the plot of second or third rate eighties comedy I rented from blockbuster once.",
            "title_similarity": "0.45673475",
            "sentiment_compound": 0.8442
        },
        {
            "id": "h2vxnu5",
            "score": 1,
            "text": "He spoke about this in length in a YouTube video.  I don’t remember how I stumbled upon it.  He has a great story of his past and how he got to where he is now.",
            "title_similarity": "0.4601766",
            "sentiment_compound": 0.6249
        },
        {
            "id": "h2vyk81",
            "score": 2,
            "text": "Legend.",
            "title_similarity": "-0.062192112",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2vylvy",
            "score": 1,
            "text": "[He is still laughing at me](https://www.youtube.com/watch?v=DklAU4GNpxA&ab_channel=AnderFerreras)",
            "title_similarity": "0.19434348",
            "sentiment_compound": 0.4939
        },
        {
            "id": "h2vyryk",
            "score": 3,
            "text": "And now he's also perhaps the most famous Austrian in America, which I'd suspect has had some positive effect on tourism simply through increased awareness of the country in American's minds. So, maybe the Austrian military should thank him for going AWOL, lol.",
            "title_similarity": "0.54027116",
            "sentiment_compound": 0.6972
        },
        {
            "id": "h2w13gy",
            "score": 2,
            "text": "Also as a punishment his military supervisors put him to work in the kitchen, cleaning pots and pans and stuff. But it worked in his benefit because he had access to all the food that he wanted.",
            "title_similarity": "0.45331854",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h2w1ant",
            "score": 2,
            "text": "He was banging the house maid.poon slayer",
            "title_similarity": "0.4220509",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2w38ar",
            "score": 2,
            "text": "TIL that it's AWOL and not A-wall or something ... I'm not a native English speaker and this is the first time I see the word written. 🤷",
            "title_similarity": "0.2962242",
            "sentiment_compound": -0.4648
        },
        {
            "id": "h2w4j88",
            "score": 1,
            "text": "He also wrecked his tank - twice.",
            "title_similarity": "0.39216012",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2w4r45",
            "score": 1,
            "text": "I hope he was able to let houth some STEEEAAAAAM.",
            "title_similarity": "0.046737157",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h2w64ch",
            "score": 2,
            "text": "Mandatory service is bullshit",
            "title_similarity": "0.02676629",
            "sentiment_compound": -0.5423
        },
        {
            "id": "h2w91vs",
            "score": 1,
            "text": "An amazing human.",
            "title_similarity": "-0.1244658",
            "sentiment_compound": 0.5859
        },
        {
            "id": "h2wayq5",
            "score": 1,
            "text": "I know the Legend himself is on Reddit, so, was this a wild ruse to get him to reply?\n\nNot hating if so. I've looked up to him since I was in single digits and always put him up there as a role model and surrogate father and I've daydreamed about just saying hey to him n being cool about it many, many times.\n\nI just wanted to know if it worked?!",
            "title_similarity": "0.56083983",
            "sentiment_compound": 0.6862
        },
        {
            "id": "h2wb790",
            "score": 1,
            "text": "So if he was say 17 for army service in 1965 then he would have been 36 when he made terminator in 1984??\n\nI think op learned shite today.",
            "title_similarity": "0.64908564",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2wbwea",
            "score": 1,
            "text": "Whats the moral of the story??",
            "title_similarity": "-0.08764859",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2wczqr",
            "score": 1,
            "text": "When getting a ticket to the US actually meant something",
            "title_similarity": "0.068050705",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2wfi3y",
            "score": 1,
            "text": "Wasnt he a tanker?",
            "title_similarity": "0.11822926",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2wif4x",
            "score": 1,
            "text": "Toto Africa",
            "title_similarity": "-0.012823267",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2wigdp",
            "score": 1,
            "text": "Imagine seeing this motherfucker on the battlefield - SKYNET IS HERE!",
            "title_similarity": "0.35233188",
            "sentiment_compound": -0.8553
        },
        {
            "id": "h2wm14d",
            "score": 1,
            "text": "Just read this in Dubya's new book, Out of Many, One: Portraits of America's Immigrants. Arnold is featured.",
            "title_similarity": "0.50856864",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2wn6dk",
            "score": 1,
            "text": "when he started his business how did he get employees/ customers/ and supplies\n\nive wanted to start my own ebay business but i cant figure out this warehouse/lots stuff\n\n&#x200B;\n\nedit: i love arnold",
            "title_similarity": "0.5950945",
            "sentiment_compound": 0.7783
        },
        {
            "id": "h2wom4i",
            "score": 2,
            "text": "He also pardoned a friend's murderous son for no other reason than personal politics. Reddit loves this guy but I lost all respect for him after learning that. He's exactly as self serving as every other politician, just more charismatic.",
            "title_similarity": "0.55167735",
            "sentiment_compound": 0.2023
        },
        {
            "id": "h2wotk1",
            "score": 1,
            "text": "So… this is how he got to the choppa?",
            "title_similarity": "0.21764685",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2wqtl4",
            "score": 1,
            "text": "When asked isn’t he regretted the decision, Schwarzenegger replied: “THE HELL WIT YOU.”",
            "title_similarity": "0.22790456",
            "sentiment_compound": -0.8374
        },
        {
            "id": "h2wsr01",
            "score": 1,
            "text": "Sometimes, the wrong answer is the right one....",
            "title_similarity": "-0.071798",
            "sentiment_compound": -0.4767
        },
        {
            "id": "h2wvewg",
            "score": 1,
            "text": "So if not for that, we may have never gotten to enjoy Arnold...",
            "title_similarity": "0.21507668",
            "sentiment_compound": -0.3875
        },
        {
            "id": "h2wwpa2",
            "score": 1,
            "text": "The man is a legend. He’s an inspiration to many. I should really go to the gym….",
            "title_similarity": "0.43142295",
            "sentiment_compound": 0.5267
        },
        {
            "id": "h2wxvch",
            "score": 1,
            "text": "So skip school and work kids.",
            "title_similarity": "0.26531497",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2x7wea",
            "score": 1,
            "text": "Sargeant: I told you to work on those guns! \n\nArnold: That's what I was doing! *flexes biceps*",
            "title_similarity": "0.43910497",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2xh6tz",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "-0.14015824"
        },
        {
            "id": "h2xhya1",
            "score": 1,
            "text": "Priorities.",
            "title_similarity": "-0.25754905",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2xj66s",
            "score": 1,
            "text": "NO WAY!!!!  Lmao",
            "title_similarity": "-0.066053964",
            "sentiment_compound": -0.8046
        },
        {
            "id": "h2xl2w4",
            "score": 1,
            "text": "What a story...",
            "title_similarity": "-0.15839483",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2xm68t",
            "score": 1,
            "text": "Honestly I'm surprised the punishment was that minor. I feel like that would not be the case in America's military but admittedly I dont actually know.",
            "title_similarity": "0.25406617",
            "sentiment_compound": 0.2732
        },
        {
            "id": "h2xmec4",
            "score": 1,
            "text": "L'D",
            "title_similarity": "-0.2235763",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2xo83k",
            "score": 1,
            "text": "Running from military duty but living off of violence, boy do we have a party for you!",
            "title_similarity": "0.5660962",
            "sentiment_compound": -0.5255
        },
        {
            "id": "h2xrxij",
            "score": 1,
            "text": "https://acutabovetherest.dog",
            "title_similarity": "0.09834836",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2xs8s5",
            "score": 1,
            "text": "I read that Dr Oliver Sacks (of New Yorker and \"Awakenings\" fame, among much else) was an avid amateur bodybuilder. Venice Beach was one of his regular haunts. He was also quite the hunk, if the eye-catching cover photo on one of his memoirs is any guide.",
            "title_similarity": "0.58550715",
            "sentiment_compound": 0.4767
        },
        {
            "id": "h2xv7h7",
            "score": 1,
            "text": "To to",
            "title_similarity": "-0.22618276",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2y6m7e",
            "score": 1,
            "text": "The American Dream",
            "title_similarity": "0.11092517",
            "sentiment_compound": 0.25
        },
        {
            "id": "h2ybuh0",
            "score": 1,
            "text": "What does the \"Death of Louis Santos\" have to do with your title?",
            "title_similarity": "0.24527694",
            "sentiment_compound": -0.5994
        },
        {
            "id": "h2ygn7k",
            "score": 2,
            "text": "Yep, Arnie *really IS* an American success story - unlike others who claim to be...",
            "title_similarity": "0.31341416",
            "sentiment_compound": 0.7096
        },
        {
            "id": "h2yhjev",
            "score": 1,
            "text": "Ya he need to get out before he had his ass handed to him by emus",
            "title_similarity": "0.25909954",
            "sentiment_compound": -0.5423
        },
        {
            "id": "h38ra8p",
            "score": 1,
            "text": "Makes you wonder. A rock can get rich in Collyfawnyah...",
            "title_similarity": "0.13288777",
            "sentiment_compound": 0.5574
        },
        {
            "id": "h3bbfy5",
            "score": 1,
            "text": "Mac, he was a good soldier.",
            "title_similarity": "0.057263896",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h3ez5b1",
            "score": 1,
            "text": "Probably told himself when going awol, *I'll be back.*\n\nThen after the military prison sentence, *hasta lá vista, baby*",
            "title_similarity": "0.50169325",
            "sentiment_compound": -0.6486
        },
        {
            "id": "h3qiu9x",
            "score": 1,
            "text": "Mac, he was a good soldier.",
            "title_similarity": "0.057263896",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h42grxh",
            "score": 1,
            "text": "The moral of the story, kids, is that crime pays.  /s",
            "title_similarity": "0.16712178",
            "sentiment_compound": -0.5423
        },
        {
            "id": "h78qd9f",
            "score": 1,
            "text": "Guess some things are more important haha. The stones on this man to defy the government",
            "title_similarity": "0.37648702",
            "sentiment_compound": 0.6566
        },
        {
            "id": "hcbb4lm",
            "score": 1,
            "text": "And now here he is shitting on our freedom.",
            "title_similarity": "0.15341851",
            "sentiment_compound": 0.34
        }
    ]
}