{
    "TIL Norway hires sherpas from Nepal to build paths in the Norwegian mountains. They have completed over 300 projects, and their pay for one summer, equals 30 years of work in Nepal.\n": [
        {
            "id": "h5mp0bm",
            "score": -3,
            "text": "Liberal immigration policies benefit all societies in the long run. The only ones who lose are unskilled Western workers afraid of losing their social-security-subsidised income and competing against harder-working foreigners. If someone who doesn't speak the local language takes your job, you're just fucking trash at it.",
            "title_similarity": "0.41898614",
            "sentiment_compound": -0.3182
        },
        {
            "id": "h5mopi1",
            "score": -11,
            "text": "\"Norway undercuts their own workforce by importing temporary foreign workers willing to work for far less money\"",
            "title_similarity": "0.4087522",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5mnmpo",
            "score": 10,
            "text": "Those sherpas, in Nepal are getting absolutely fucked by the companies that set up there.  Kiwi company, English company and others, charge about 20 grand to the \"tourists\" and give a few dollars to the sherpas.  Another industry built on absolute greed but with the bonus of the sherpas being treated like slaves and risking their lives regularly.  So it is good that someone in Norway is giving them opportunity.",
            "title_similarity": "0.5904981",
            "sentiment_compound": 0.9371
        },
        {
            "id": "h5mnaq8",
            "score": -4,
            "text": "are people actually so dense? I have been to nepal many times thats just complete and utter horseshit. Whatever they make in norway its not \"30 years worth of working in nepal\".",
            "title_similarity": "0.66352046",
            "sentiment_compound": -0.1695
        },
        {
            "id": "h5nhob5",
            "score": -3,
            "text": "Do they want to come work in the US?  We will gladly pay them barely above their Nepal rates, while shaming them if they ask for more and letting those ungrateful immigrants know they should be thankful they even have a job.  And when we can outsource their work or automate it, get rid of them.",
            "title_similarity": "0.41079214",
            "sentiment_compound": 0.4588
        },
        {
            "id": "h5mcm3m",
            "score": 3,
            "text": "Homer Simpson also has experience in this area, if they're still hiring...",
            "title_similarity": "0.35481113",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5mqz2y",
            "score": -1,
            "text": "Do they hire the more experienced or lesser experienced sherpas from Everest? The concern would be is that if the most experienced Sherpas were being diverted to Norway then lesser experienced sherpas are leading a increasingly larger group up the to the summit resulting in a more dangerous trek.",
            "title_similarity": "0.5788326",
            "sentiment_compound": -0.5256
        },
        {
            "id": "h5nj8zx",
            "score": 0,
            "text": "Still minium wage in norway",
            "title_similarity": "0.47327644",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5mt1gu",
            "score": 3,
            "text": "That's the effect you want globalisation to have! Awesome!",
            "title_similarity": "0.12787846",
            "sentiment_compound": 0.717
        },
        {
            "id": "h5mwyt1",
            "score": 2,
            "text": "This is the lottery of birth in action.",
            "title_similarity": "0.08562131",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5mold0",
            "score": 7,
            "text": "Yeah i cant get the math to work, this is just simple google stats so might be wrong\n\nMost typical salary/year in nepal is 7k usd\n\nSupposedly they got 200k nok in 3 months that is about 22k usd\n\nSo probably worth it for them but its not 30 years worth\n\nIm just basing this on google and another comment though and im not that good in math\n\nSmall edit: seems the top google result is really wrong because if you make 7k you would be very rich in Nepal\n\nOn google is said the average was 10k and typical is 7k but it seems to be much lower some other sources says the minimum wage is 1.889k a year\n\n\nEdit: again another says 74usd per month is minimum so then the 30 year statments seems to be closer, but i think the sherpas that are employed to travel and build the stone stairs make more then minimum wage so for them its a good salary but not 30 years",
            "title_similarity": "0.583677",
            "sentiment_compound": -0.026
        },
        {
            "id": "h5myqdr",
            "score": 4,
            "text": "*Damn socialists gonna ruin everything!*  - M'erica prolly",
            "title_similarity": "0.15636371",
            "sentiment_compound": -0.7777
        },
        {
            "id": "h5n4z39",
            "score": 3,
            "text": "I mean, they’ve dealt with Yetis.  Trolls likely don’t bother them.",
            "title_similarity": "0.18983737",
            "sentiment_compound": -0.34
        },
        {
            "id": "h5mw9nb",
            "score": 1,
            "text": "But then they have to spend it all to live in Norway for the one summer.",
            "title_similarity": "0.5674319",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5ngwwc",
            "score": -1,
            "text": "That would be great if rich people had to carry their own shit up everest and couldn't rely on sherpas.",
            "title_similarity": "0.53527105",
            "sentiment_compound": 0.6249
        },
        {
            "id": "h5mq7sq",
            "score": -2,
            "text": "I lived in Nepal for over 10 years and am married to a Nepali and never heard this.\n\nEdit: I'm not saying it isn't true!  It's just fascinating because I hadn't heard it before. Jesus!",
            "title_similarity": "0.6314869",
            "sentiment_compound": 0.4122
        },
        {
            "id": "h5nc7vo",
            "score": -1,
            "text": "incoming alt right",
            "title_similarity": "-0.04109797",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5njhg1",
            "score": 2,
            "text": "So they are the Mexicans of the region",
            "title_similarity": "0.20335409",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5mn7ol",
            "score": 4,
            "text": "Same is the case with most of us Indians. Lot of our people immigrate to Australia, Europe or North America, work hard for a decade or two, then come back to India either to retire or to start a business. Point is to have a stress free life not working under someone.",
            "title_similarity": "0.6360278",
            "sentiment_compound": 0.0258
        },
        {
            "id": "h5n5w9y",
            "score": -3,
            "text": "Everyone is talking about remittances, but no one is mentioning just how backwards and the thinking is some of these places \n\nI worked with a group of foreigners before and they were absolutely insufferable and had the most backwards ideas on woman, other minorites, LGBT and just otherwise were not pleasant to be around.",
            "title_similarity": "0.29251942",
            "sentiment_compound": -0.7471
        },
        {
            "id": "h5ng52s",
            "score": -3,
            "text": "Calling a random Nepali porter a Sherpa is like meeting a black dude on the street and referring to him exclusively with the N word.",
            "title_similarity": "0.3762831",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h5nrjct",
            "score": -3,
            "text": "what do people think that sherpas make?\n\nA sherpa working in Nepal the Everest season makes the equivalent of what a doctor makes in a year in the US.\n\nThey are not exploited, they have the best paid profession in their country",
            "title_similarity": "0.6898765",
            "sentiment_compound": 0.7704
        },
        {
            "id": "h5mnmri",
            "score": -31,
            "text": "Let me translate that to the leftist mindset.\n\nNorway is exploiting the poor sherpas forcing them to work for starvation wages as wage slaves in Norway.",
            "title_similarity": "0.47166348",
            "sentiment_compound": -0.7184
        },
        {
            "id": "h5mtrlq",
            "score": 0,
            "text": "I want to be a sherpa. Where do I apply?",
            "title_similarity": "0.1776353",
            "sentiment_compound": 0.0772
        },
        {
            "id": "h5mzfie",
            "score": 0,
            "text": "If you need to take a breath between summer and equals you might not be a Nepalese Sherpa.",
            "title_similarity": "0.3329026",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5n477c",
            "score": 0,
            "text": "Outsourcing by any other name ….",
            "title_similarity": "0.052084792",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5n4bwv",
            "score": 0,
            "text": "But did they even think for a second how imported labour would screw over the Norwegian sherpas?",
            "title_similarity": "0.3949758",
            "sentiment_compound": -0.1531
        },
        {
            "id": "h5n5m1u",
            "score": 0,
            "text": "Maybe they should hire some Sherpas to build a more stable website.",
            "title_similarity": "0.29518846",
            "sentiment_compound": 0.3597
        },
        {
            "id": "h5nc6gt",
            "score": 0,
            "text": "It would be great watching rich turds try to climb (see also: get handheld up) Himalayan peaks without the support of these incredible people. Good to see they’re being properly compensated for their skills.",
            "title_similarity": "0.40736628",
            "sentiment_compound": 0.8631
        },
        {
            "id": "h5nqvba",
            "score": 0,
            "text": "Funny to think about: why doesn’t Nepal hire Norwegians to create paths in the Nepalese mountains?",
            "title_similarity": "0.5552041",
            "sentiment_compound": 0.6124
        },
        {
            "id": "h5nuf3b",
            "score": 0,
            "text": "Don’t want to sound bad but 30 years pay? The Norwegians are paying way over the odds. I bet they’d do they same for 10 years 🙈",
            "title_similarity": "0.63855815",
            "sentiment_compound": -0.4019
        },
        {
            "id": "h5nv0r8",
            "score": 0,
            "text": "Ah NEPAL. Where you get paid 1/30 for everything.",
            "title_similarity": "0.5885235",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5nz3b4",
            "score": 0,
            "text": "Yes Norway",
            "title_similarity": "0.14062327",
            "sentiment_compound": 0.4019
        },
        {
            "id": "h5o1ufk",
            "score": 0,
            "text": "I think this has more to do with [unequal exchange](https://youtu.be/4lDZaKjfs4E) between Nepal and Norway than really being a good thing. Like, this is great for THOSE SHERPAS, but it leaves the rest of Nepal as fucked over as before.",
            "title_similarity": "0.42335564",
            "sentiment_compound": -0.5296
        },
        {
            "id": "h5o7kpg",
            "score": 0,
            "text": "Great. They are probably the next wave of people with money who will join r/Wallstreetbets.",
            "title_similarity": "0.30774996",
            "sentiment_compound": 0.743
        },
        {
            "id": "h5oc27n",
            "score": 0,
            "text": "Isn't this the same type of thing people complain about when we have children digging for coltan in africa or people making our iphones in china",
            "title_similarity": "0.429138",
            "sentiment_compound": -0.3612
        },
        {
            "id": "h5p11eu",
            "score": 0,
            "text": "Whaa? There's mountains in Norway?",
            "title_similarity": "0.4282417",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5mmoog",
            "score": -5,
            "text": "But don't they need all that experience in Nepal to become a qualified enough Sherpa to begin with?",
            "title_similarity": "0.5167119",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5n4beq",
            "score": 5,
            "text": "Recently watched the Netflix documentary \"Sherpa\" and my respect for these guys is immense, I'm really glad they're able now to get jobs elsewhere because the tour operators exploit them horribly for everest treks\n\nAlso fuck every cunt who climbs everest in these tours",
            "title_similarity": "0.5194017",
            "sentiment_compound": -0.6258
        },
        {
            "id": "h5n4oh9",
            "score": 12,
            "text": "It's nice that they get some extra money. We also have sherpas working as guides in Jotunheimen in the summer I believe. Summer is \"off season\" for mountaineering in Nepal so it makes perfect sense for them to work here in Norway.\n\nHowever I think they're over-using the sherpa stairs. I've gone up trails that I have hiked plenty of times and that have been perfectly fine which now suddenly have rock stairs going up them. It ruins the experience of being in untouched nature by yourself sadly. The stairs usually don't help that much either, they're usually in a short section which is a bit steeper than the rest of the hike. If people can't hike a 20 meter section of 30-40% incline maybe they shouldn't go up into the high mountains.\n\nIt's a concept that seems pretty hyped up. Tourists talk about it like it's something new and shiny on the trail, but locals usually don't like it. Sadly it's part of the trend we have in Norway when people don't appreciate untouched nature and want to modify it to encourage more tourist activity. \n\nWe have the last wilderness of Europe up here and it looks like people just want to throw that away.\n\nHowever if you do have to modify it due to erosion of the trail due to traffic making it unsafe or something, then sherpa steps are much better than bolting an actual set of stairs into the mountain.",
            "title_similarity": "0.631793",
            "sentiment_compound": 0.9489
        },
        {
            "id": "h5meopj",
            "score": 1,
            "text": "Nice",
            "title_similarity": "-0.12829438",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h5mu6sc",
            "score": 1,
            "text": "Someone is bad at math.  No way they got 120 times their pay in Nepal.  A Sherpa makes $5000 (USD) a year.  So you think Norway paid them $600k?",
            "title_similarity": "0.66191137",
            "sentiment_compound": -0.7269
        },
        {
            "id": "h5n26kz",
            "score": 1,
            "text": "Are there no Norwegians who could do the work? Are they unfamiliar with mountains and mountain climbing?",
            "title_similarity": "0.48415682",
            "sentiment_compound": -0.3736
        },
        {
            "id": "h5n2k29",
            "score": -1,
            "text": "I don’t know why but this saddens me.",
            "title_similarity": "-0.023044012",
            "sentiment_compound": -0.677
        },
        {
            "id": "h5n30sj",
            "score": -1,
            "text": "c h y n a",
            "title_similarity": "-0.06636228",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5nco7e",
            "score": -1,
            "text": "So like 12 dollars?",
            "title_similarity": "0.18792595",
            "sentiment_compound": 0.4201
        },
        {
            "id": "h5nge82",
            "score": -1,
            "text": "This is untrue. I am sherpa",
            "title_similarity": "0.006166186",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5okvgw",
            "score": 1,
            "text": "I hate walking on stairs. Thanks a lot Sherpas",
            "title_similarity": "0.13637392",
            "sentiment_compound": -0.2023
        },
        {
            "id": "h5ox9vt",
            "score": -1,
            "text": "If only there was a place Americans go and work for a summer and have 30 years of pay. FUCK.",
            "title_similarity": "0.58056915",
            "sentiment_compound": -0.6841
        },
        {
            "id": "h5mvvsl",
            "score": -7,
            "text": "[removed]",
            "title_similarity": "-0.18957132"
        },
        {
            "id": "h5mn2f7",
            "score": 76,
            "text": "It bothers me to see this so let me make sure we’re clear: Sherpa is a proper noun because it is the name of a people. Sherpa is not a synonym for mountain climber or guide. They are an ethnic group.",
            "title_similarity": "0.26825905",
            "sentiment_compound": 0.4767
        },
        {
            "id": "h5moelv",
            "score": 9,
            "text": "There was a minor thread pertaining to this in the Netflix series Lilyhammer with Steve Van Zandt.",
            "title_similarity": "0.1002615",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5mwx2w",
            "score": 9,
            "text": "The US Forest Service does something similar. My retired aunt spent a season working at Glacier National Park where half of her duties were to hike paths with GPS trackers for map and trail making.",
            "title_similarity": "0.690212",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5mksvl",
            "score": 2,
            "text": "That’s proper!",
            "title_similarity": "-0.12806807",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5moqem",
            "score": 2,
            "text": "And heres us hiking down one of their trails....https://youtu.be/UjcQxNgR-mM",
            "title_similarity": "0.30595902",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5mv15r",
            "score": 2,
            "text": "How come Norway always does good stuff",
            "title_similarity": "0.3110217",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h5mx37m",
            "score": 2,
            "text": "Sherpas are the shit!",
            "title_similarity": "0.06573065",
            "sentiment_compound": 0.6476
        },
        {
            "id": "h5mxvs2",
            "score": 2,
            "text": "Weird coma placement\n\nEdit: comma*, my autocorrect is in spanish lol",
            "title_similarity": "0.17434323",
            "sentiment_compound": 0.2732
        },
        {
            "id": "h5nd85z",
            "score": -2,
            "text": "Hope it's not like their Everest trails littered with dead bodies.",
            "title_similarity": "0.3401878",
            "sentiment_compound": -0.5439
        },
        {
            "id": "h5npt3q",
            "score": -2,
            "text": "What a novel idea, I don't know why more western companies are not offshoring work to cheaper Asian labour! /s",
            "title_similarity": "0.3185075",
            "sentiment_compound": 0.3802
        },
        {
            "id": "h5ny24c",
            "score": -2,
            "text": "Why can't they do this with local architects / labour?  I bet they're paying the Nepalese below Norwegian wage rates!",
            "title_similarity": "0.5734065",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5mb20f",
            "score": 127,
            "text": "Normally, countries take advantage of their poor immigrants. Glad to see that's not always the case.",
            "title_similarity": "0.15455252",
            "sentiment_compound": 0.2263
        },
        {
            "id": "h5mnjt4",
            "score": 45,
            "text": "Sherpas are treated like slaves in Nepal by tourists. They love their job, but they sacrifice their livelihood just to make pennies. Well done Norway.",
            "title_similarity": "0.5337447",
            "sentiment_compound": 0.802
        },
        {
            "id": "h5muysd",
            "score": -4,
            "text": "Are there no Norwegians who needed work?",
            "title_similarity": "0.3572624",
            "sentiment_compound": -0.296
        },
        {
            "id": "h5mvtqd",
            "score": 3,
            "text": "So many people don’t understand cost of living isn’t the same everywhere. \n\nEven in the US. Even in the same US state. \n\nI’m middle class by US definitions. But holy crap, I can’t even imagine living in California. Ohio is so much more affordable.",
            "title_similarity": "0.42257679",
            "sentiment_compound": -0.5267
        },
        {
            "id": "h5nhuzo",
            "score": 4,
            "text": "I had some of them living upstairs from me! Lovely people personally, but they also used my alottment in the shared storage area as a spot to dry off their work clothes, water damaging a lot of the crap i couldn't bear to throw away enough that i had to throw it away",
            "title_similarity": "0.31997508",
            "sentiment_compound": -0.722
        },
        {
            "id": "h5nos7b",
            "score": -3,
            "text": "How is that not just a failure of currency exchange rates, though?",
            "title_similarity": "0.09344524",
            "sentiment_compound": 0.4023
        },
        {
            "id": "h5mg9pf",
            "score": 45,
            "text": "Their pay for one summer may equal 30 years back in Nepal but is it comparable to what Norwegians would expect to be paid?",
            "title_similarity": "0.7109005",
            "sentiment_compound": -0.0516
        },
        {
            "id": "h5n0tsz",
            "score": 4,
            "text": "It helps to remember that most of us are in the top 20% of global wealth. About a third of Americans are in the top 10%.",
            "title_similarity": "0.5446892",
            "sentiment_compound": 0.8126
        },
        {
            "id": "h5msjwg",
            "score": 5,
            "text": "The site is down now (probably reddit hugged), but i am curious what their source for \"one summer equals 30 years of work in Nepal\", and the info i can find when searching for this (from Norwegian newspaper articles and such) all agree on 1 year of nepalese pay for 1 week of work.\n\nSo either they are here working for 30 weeks, which is quite a bit more than a summer, or someone has some numbers wrong.",
            "title_similarity": "0.78953576",
            "sentiment_compound": 0.3182
        },
        {
            "id": "h5mhf1p",
            "score": -17,
            "text": "AI could have done it .",
            "title_similarity": "-0.0054557268",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5mw3xi",
            "score": -6,
            "text": "Its so stupid. Flying people over half the world to build pathways.",
            "title_similarity": "0.3392208",
            "sentiment_compound": -0.5709
        },
        {
            "id": "h5mxnoy",
            "score": 5,
            "text": "Imagine a summer internship letting you retire wealthy",
            "title_similarity": "0.39449233",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h5nvhgh",
            "score": -6,
            "text": "So they bring in illegal immigrants?",
            "title_similarity": "0.10529934",
            "sentiment_compound": -0.5574
        },
        {
            "id": "h5mvjnq",
            "score": 8,
            "text": "Hopefully this will enable them to retire from hauling rich douchebags' shit up Mount Everest.",
            "title_similarity": "0.47129035",
            "sentiment_compound": 0.4019
        },
        {
            "id": "h5p1xn0",
            "score": -7,
            "text": "In other words, Norway is paying them wayyyy too much.",
            "title_similarity": "0.29757982",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5myz2c",
            "score": 41,
            "text": "That is because of strong unions. The same in Denmark. People come here from other countries and they get the same salary as a native Dane. Not like in the gulf states were they are paid 5% of what the natives are paid.",
            "title_similarity": "0.5697013",
            "sentiment_compound": 0.2937
        },
        {
            "id": "h5mmxxf",
            "score": 10,
            "text": "If this interests you look up Gurkhas",
            "title_similarity": "0.09956406",
            "sentiment_compound": 0.25
        },
        {
            "id": "h5mf9kl",
            "score": -31,
            "text": "Silly Norwegians overpaying for labor",
            "title_similarity": "0.4089389",
            "sentiment_compound": 0.0258
        },
        {
            "id": "h5mfepb",
            "score": -32,
            "text": "[removed]",
            "title_similarity": "-0.18957132"
        },
        {
            "id": "h5moo5j",
            "score": -14,
            "text": "Exploitation",
            "title_similarity": "-0.13512686",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5ms53k",
            "score": 15,
            "text": "Reminds me of the Nepalese janitor at my old school here in Austria. We used to collect money for his neighbors back in Nepal. His son went on to become a world famous rock climber and alpinist, who unfortunately passed away a year ago or two.",
            "title_similarity": "0.70894855",
            "sentiment_compound": -0.34
        },
        {
            "id": "h5mbx8i",
            "score": 256,
            "text": "Sounds like a good deal for both ends.  I hope they pay them as much as they can beyond fair because if their uniqueness to the work,   But I'm waiting for the negative Nellies of Reddit step in and say how this is exploitation.",
            "title_similarity": "0.27178955",
            "sentiment_compound": -0.2382
        },
        {
            "id": "h5p2n4c",
            "score": 19,
            "text": "I had 3 Sherpas in Nepal on a hike with a group of 10 people.\n\nThey would wake up first and get all of our food ready, which was cooked. Then pack up after us as we started our hire until lunch. An hour goes by and we hear a rhythmic clangking noise. It's these 3 guys RUNNING  past us with 4 times the kit we do and their half our size. Tennis balls for calves! We move off the track to let them past. We arrive at lunch and it's all set up and cooked for us. Same thing again for dinner and they clean and go to bed after us. I've never seen anything so athletically amazing as this. Some people in my group, despite being healthy 20yo couldn't even carry their own pack!",
            "title_similarity": "0.6832931",
            "sentiment_compound": 0.8227
        },
        {
            "id": "h5mk080",
            "score": 49,
            "text": "Nepal produces some absolute monsters of men and women. If it’s not the Sherpas then it’s the Gurkhas.",
            "title_similarity": "0.33275792",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5mnus3",
            "score": 144,
            "text": "I worked in Australia during my study abroad for $15/hr (which was their minimum wage at the time). I came from the United states where the minimum was $6.75.  I thought I was making bank, and they thought they were getting a good deal.  It was a win for both parties involved.  \n\nTravel is a key part in opening your mind :)",
            "title_similarity": "0.5783739",
            "sentiment_compound": 0.9349
        },
        {
            "id": "h5mahou",
            "score": 1603,
            "text": "Makes sense.\n\nWhen you have a country of people who perfected living on mountains for thousands of years, they're the people to ask about mountain paths. \n\nNot saying Norwegions aren't mountainous people. I'm saying their mountains ain't shit compared to Nepal.",
            "title_similarity": "0.7324225",
            "sentiment_compound": 0.7666
        },
        {
            "id": "h5mo2tc",
            "score": 51,
            "text": "And the paths they build in Norway are fantastic. Especially Nesaksla in Åndalsnes!",
            "title_similarity": "0.43419695",
            "sentiment_compound": 0.5983
        },
        {
            "id": "h5md3wu",
            "score": 152,
            "text": "Sherpas and Ghurkas. Badass mountain men.",
            "title_similarity": "0.30316845",
            "sentiment_compound": 0.34
        },
        {
            "id": "h5ms8rl",
            "score": 90,
            "text": "The Norwegian mountains are part of the same mountain range as the Appalachian Mountains in the Eastern US. This range is over 500 million years old, predating the Atlantic Ocean, animals walking on land and fish.",
            "title_similarity": "0.53603417",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5mht14",
            "score": 934,
            "text": "Yep, As a Nepalese it's so hard to even get a job in nepal that most of the people have to go to different countries to get a job including myself. Even if you have a degree you have less chance to get a job than a guy who knows some higher-ups people. I just hope they never stop hiring sherpas.",
            "title_similarity": "0.5430454",
            "sentiment_compound": 0.703
        },
        {
            "id": "h5myvzx",
            "score": 349,
            "text": "Went on a glacier hike in Norway once. Guide was Nepalese. 10/10 would recommend. The only weird thing was that he wanted to use our camera to take picture of us every 15 seconds even though we said we were good. \n\nCould whistle through his bottom teeth too",
            "title_similarity": "0.7051078",
            "sentiment_compound": 0.5719
        },
        {
            "id": "h5mlndz",
            "score": 1515,
            "text": "I love the cross-pollination at work here. Any other good examples of innate, localized expertise being utilized in a foreign environment that benefits both parties?",
            "title_similarity": "0.16897866",
            "sentiment_compound": 0.9081
        },
        {
            "id": "h5mo6uq",
            "score": 527,
            "text": "As a Norwegian I couldn't believe Sherpa stairs was a real thing until I started researching them. They deserve every krone they get and then some...!",
            "title_similarity": "0.5947694",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5mcrht",
            "score": 14129,
            "text": "I knew a young Nepalese couple here in Australia who planned to work hard for a decade or two (I forget the exact timeframe), saving up money. They said that when they returned home they would have enough money to live well  in a big house with maids and servants and never have to work again.",
            "title_similarity": "0.6709924",
            "sentiment_compound": -0.0516
        },
        {
            "id": "h5mav46",
            "score": 12093,
            "text": "I also saw a norwegian documentary about it.\n\n- This has also opened up more job-offers from other European countries.\n\n- The were very thankful for the job, seeing how dangerous it is to climb mount everest. Living standards in their village (Kunde) went up after they returned from Norway.\n\n- They also helped build houses as well as rock-paths.\n\n- Norway also build buddhist temples, for them to feel at home while they worked here for 6 months, away from their families.",
            "title_similarity": "0.7046342",
            "sentiment_compound": 0.4576
        },
        {
            "id": "h5mnt1t",
            "score": 9,
            "text": "Imagen, working 3 summers and you are done for life",
            "title_similarity": "0.5119513",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5mocpl",
            "score": 3,
            "text": "I worked with many filipino teachers here in Vietnam who all have husband's and family in the Philipines.  They send every cent home to their families. \nHappy to read this for the Napali's.  We all deserve an opportunity like this.",
            "title_similarity": "0.5101538",
            "sentiment_compound": 0.8402
        },
        {
            "id": "h5morte",
            "score": 45,
            "text": "They have such a unique skill set in the whole world, I’m surprised you don’t see them used in other ways.",
            "title_similarity": "0.19472073",
            "sentiment_compound": 0.2263
        },
        {
            "id": "h5mqbk0",
            "score": 1,
            "text": "How do I sign up?  I'd love to work two summers and live for 60 years in Nepal.",
            "title_similarity": "0.72476375",
            "sentiment_compound": 0.6369
        },
        {
            "id": "h5mrcig",
            "score": 1,
            "text": "That sounds like the best job ever",
            "title_similarity": "0.26836652",
            "sentiment_compound": 0.7717
        },
        {
            "id": "h5mrmlo",
            "score": 1,
            "text": "What does it entail to build these paths? And how do they look when finished?",
            "title_similarity": "0.20815906",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5mrnv3",
            "score": 3,
            "text": "I wonder how many rich people would go without the sherpa guides? And what is the percentage that would die, before the sherpas were paid whatever the hell they wanted? Is being on top of Everest really that much of a status symbol, that it's worth death?",
            "title_similarity": "0.60135335",
            "sentiment_compound": -0.8243
        },
        {
            "id": "h5mrs2x",
            "score": 3,
            "text": "Can you imagine working 2 years and retiring?",
            "title_similarity": "0.5232327",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5mt393",
            "score": 1,
            "text": "Damn sherpas terk er jerbs!",
            "title_similarity": "0.057757534",
            "sentiment_compound": -0.4574
        },
        {
            "id": "h5mtqps",
            "score": 4,
            "text": "There’s also a large population of southeastern Asians who come to Scandinavia every summer to pick berries",
            "title_similarity": "0.6368209",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5mu1lu",
            "score": 1,
            "text": "i love their work! quality stairs. those that are just placed perfectly for your next step and the next.",
            "title_similarity": "0.22887899",
            "sentiment_compound": 0.8655
        },
        {
            "id": "h5multz",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "-0.18957132"
        },
        {
            "id": "h5mx2nd",
            "score": 3,
            "text": "Gettin strong r/deathstranding vibes",
            "title_similarity": "0.11792435",
            "sentiment_compound": 0.5106
        },
        {
            "id": "h5mx8gu",
            "score": 2,
            "text": "That is so awesome.",
            "title_similarity": "-0.048801698",
            "sentiment_compound": 0.7384
        },
        {
            "id": "h5mxt3h",
            "score": 2,
            "text": "Lol, se crashed the site. Send in the sherpas",
            "title_similarity": "0.15904637",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h5mxvdl",
            "score": 8,
            "text": "And the summer in Norway is only 9 days or so!!! 😉",
            "title_similarity": "0.5027747",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5my3dk",
            "score": 1,
            "text": "I love Nepal 🇳🇵",
            "title_similarity": "0.32392913",
            "sentiment_compound": 0.6369
        },
        {
            "id": "h5my6qm",
            "score": 1,
            "text": "Good",
            "title_similarity": "-0.11856349",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h5myx4t",
            "score": 28,
            "text": "We visited Lofoten a couple years back and they had just reopened the Reinebringen climb with these sherpa-built stairs. Before the stairs were installed it was pretty common for tourists to get injured and need airlifted out, and the sheer number of climbers was causing a lot of environmental damage in the form of erosion. \n\nThe stone stairs look fantastic, and make the climb to the top safe enough for a child to do it.",
            "title_similarity": "0.53598195",
            "sentiment_compound": 0.7096
        },
        {
            "id": "h5mzbax",
            "score": 1,
            "text": "Husky white guy gets to hold the sign",
            "title_similarity": "0.30042988",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5mzy92",
            "score": 2,
            "text": "Fucking awesome",
            "title_similarity": "-0.035662435",
            "sentiment_compound": 0.659
        },
        {
            "id": "h5n0lvq",
            "score": 1,
            "text": "G",
            "title_similarity": "-0.1395264",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5n0qc2",
            "score": 116,
            "text": "They did an amazing job at Preikestolen. Its a much easier hike these days than 15 years ago. Amazing work by these fantastic people",
            "title_similarity": "0.48874784",
            "sentiment_compound": 0.9325
        },
        {
            "id": "h5n0rbr",
            "score": 2,
            "text": "Waiting for the day working hard in California does the same.",
            "title_similarity": "0.33735478",
            "sentiment_compound": -0.1027
        },
        {
            "id": "h5n23ms",
            "score": 1,
            "text": "I worked with a lady from the Philippines who had pretty much paid for her family’s house and sister’s school by herself by sending money home, pretty impressive for a fast food wage, too bad she was a nightmare to work with most of the time",
            "title_similarity": "0.45816165",
            "sentiment_compound": 0.7351
        },
        {
            "id": "h5n2w5i",
            "score": 1,
            "text": "Dey took 'er jerbs!! Durka der!!",
            "title_similarity": "0.009760361",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5n30gu",
            "score": 1,
            "text": "Good on Norway for doing this. Sounds like a great thing all around.",
            "title_similarity": "0.2987083",
            "sentiment_compound": 0.8591
        },
        {
            "id": "h5n320n",
            "score": 8,
            "text": "Hurrah for Norway!! Thank you,for not exploiting workers from poor countries.",
            "title_similarity": "0.3696162",
            "sentiment_compound": 0.7176
        },
        {
            "id": "h5n33w5",
            "score": 3,
            "text": "Jeg setter stor pris på dems arbeid. Det gjør fjellturen mye enklere",
            "title_similarity": "0.1894423",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5n3v27",
            "score": 6,
            "text": "Good Norway",
            "title_similarity": "0.19004369",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h5n41iy",
            "score": 2,
            "text": "My advice? If a Sherpa offers you a milky liquid ladeled out of a bucket, be very hesitant to have a second helping.",
            "title_similarity": "0.12001524",
            "sentiment_compound": -0.024
        },
        {
            "id": "h5n4d61",
            "score": 2,
            "text": "How do I paid one of these workers to come help me build a small market garden? I would totally support this.",
            "title_similarity": "0.37088656",
            "sentiment_compound": 0.6901
        },
        {
            "id": "h5n4dop",
            "score": 2,
            "text": "They're really great paths, too. Solid, safe and perfectly in harmony with their surroundings.",
            "title_similarity": "0.10541461",
            "sentiment_compound": 0.9412
        },
        {
            "id": "h5n4h67",
            "score": 3,
            "text": "So a trip to Norway  and you get to go home and retire! What a deal",
            "title_similarity": "0.46187901",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5n4vqp",
            "score": 2,
            "text": "That last line how Nepal is poor third world country didn’t need to be there. Sherpas know their mountains - that was sufficient point.",
            "title_similarity": "0.419473",
            "sentiment_compound": -0.4767
        },
        {
            "id": "h5n68k5",
            "score": 6,
            "text": "The thing I love about this is that it's a truly meritocratic idea",
            "title_similarity": "0.07918077",
            "sentiment_compound": 0.7964
        },
        {
            "id": "h5n68p1",
            "score": 1,
            "text": "But what does 30 years of work in Nepal equal to in years in usa",
            "title_similarity": "0.68860626",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5n6jgl",
            "score": 5,
            "text": "Another reason to like Norway.",
            "title_similarity": "0.2011714",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h5n75h2",
            "score": 1,
            "text": "And TIL what Sherpas actually are and not weirdos who sell weed and licks arm pits like the one I saw on entourage.",
            "title_similarity": "0.19913423",
            "sentiment_compound": 0.5129
        },
        {
            "id": "h5n7k6f",
            "score": 1,
            "text": "Well he's set for the apocalypse.",
            "title_similarity": "0.09271182",
            "sentiment_compound": 0.2732
        },
        {
            "id": "h5n80nm",
            "score": 95,
            "text": "Nepalese people are amazing and defy what I thought was human limits. When one buys a fridge in Nepal, it is delivered by a MAN carry the fridge on his BACK and climbing a MOUNTAIN with it with … SLIPPERS\n\nThey deserve many times over the money they’re paid for what they’re capable of doing",
            "title_similarity": "0.5802248",
            "sentiment_compound": 0.7506
        },
        {
            "id": "h5n8ie3",
            "score": 1,
            "text": "Where can I sign up?",
            "title_similarity": "-0.028394148",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5n9q22",
            "score": 27,
            "text": "Here is an example of their work:  \n[https://www.youtube.com/watch?v=awn6B2UFJNQ](https://www.youtube.com/watch?v=awn6B2UFJNQ)\n\nIt's in Norwegian but the visuals speak for itself. Description in English:\n\nThe spectacular mountain Reinebringen in Lofoten has been the scene of many accidents. Last year, the money came to secure the hiking trail. But for the second year in a row, the trail builders are stuck in Nepal. This has consequences for 80 small and large hiking trails across the country.\r  \n\r  \nReinebringen is one of the most visited mountain peaks in Lofoten. In high season, over 1000 people take the trip up the Sherpa stairs daily to enjoy the view of Reine.\r  \n\r  \nThe mountain has been the scene of several accidents, some of them with fatalities.\r  \n\r  \nTo improve safety and avoid wear and tear and rubble, construction began on a Sherpa staircase in 2016.\r  \n\r  \nAccording to the plan, it will go all the way up to the top of the nearly 500 meter high mountain. But five years later, there is still a 100 meter path under the top that lacks stairs.",
            "title_similarity": "0.70764565",
            "sentiment_compound": 0.4871
        },
        {
            "id": "h5n9xob",
            "score": 1,
            "text": "Rewards people for getting outside and further encourages others to do the same",
            "title_similarity": "0.0962632",
            "sentiment_compound": 0.7184
        },
        {
            "id": "h5na55h",
            "score": 1,
            "text": "I climbed a Norwegian mountain and I remember seeing a \"Sherpas 2015\" inscription engraved in one of the stone steps. It all makes sense now.",
            "title_similarity": "0.67133045",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5nax5e",
            "score": 1,
            "text": "I’d give you an award! Thank you for this info. ⭐️",
            "title_similarity": "0.1297802",
            "sentiment_compound": 0.7424
        },
        {
            "id": "h5nb1x2",
            "score": 3,
            "text": "...annnd rip website is down from all the redditors",
            "title_similarity": "0.24626614",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5nbhs8",
            "score": 1,
            "text": "I wannna play Death Stranding now\n\n🤔",
            "title_similarity": "0.1762625",
            "sentiment_compound": -0.3612
        },
        {
            "id": "h5nbygx",
            "score": 3,
            "text": "Those Denisovan genes they inherited that help them breath better at high altitudes sure are helping them get paid. It's nice to see norwegians are paying sherpas what they're worth.",
            "title_similarity": "0.53195715",
            "sentiment_compound": 0.9153
        },
        {
            "id": "h5ncwhb",
            "score": 1,
            "text": "to be fair, my pay for one summer of work in Norway would also equal 30 years",
            "title_similarity": "0.6888492",
            "sentiment_compound": 0.2263
        },
        {
            "id": "h5ndbmo",
            "score": 14,
            "text": "Nepal is the only country in the world whose citizens serve in 2 other nations' armies (India and UK). Nepalese gurkhas are heavily recruited by both India and the British. India has several Gurkha regiments which are renowned for their bravery and battle honors. Brits also used the Gurkhas during Falklands.",
            "title_similarity": "0.62981045",
            "sentiment_compound": 0.5994
        },
        {
            "id": "h5ndghd",
            "score": 1,
            "text": "I wonder how sherpas would do in space.",
            "title_similarity": "0.110187486",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5ndm80",
            "score": 3,
            "text": "I don't know about this. In my youth, in Romania (socialist at  the time), we had a tremendous network of mountain paths, all well marked and maintained.\n\nThey were all done by volunteers, with material support (tools, paint, poles, chains, timber, etc.) provided by the government, who also produced the maps. It was something that I always felt proud of as well as a bit amazed of and grateful for.",
            "title_similarity": "0.6218632",
            "sentiment_compound": 0.9349
        },
        {
            "id": "h5ndmlu",
            "score": 1,
            "text": "Guys, I’ve decided to change my career path to a Nepalian Sherpa",
            "title_similarity": "0.33441132",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5nebx7",
            "score": 1,
            "text": "Fantastic story. Thanks for the share.",
            "title_similarity": "0.06316098",
            "sentiment_compound": 0.8271
        },
        {
            "id": "h5nedfb",
            "score": 2,
            "text": "Theres also a reverse side - labor drain, as all the sherpas will emigrate to work in europe, and inflate prices back home",
            "title_similarity": "0.4415846",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5neob6",
            "score": 1,
            "text": "Bugs Bunny taught me never to trust a sign that looks like that. Way too easy to spin it around and send me to Albuquerque",
            "title_similarity": "0.26135623",
            "sentiment_compound": 0.4015
        },
        {
            "id": "h5nfucd",
            "score": 3,
            "text": "Insane how some of them have summited Everest multiple times and they never get any love. So many people would’ve failed if it weren’t for their insane skills",
            "title_similarity": "0.5262495",
            "sentiment_compound": -0.9015
        },
        {
            "id": "h5nghup",
            "score": 1,
            "text": "That is awesome!",
            "title_similarity": "-0.05055037",
            "sentiment_compound": 0.6588
        },
        {
            "id": "h5nhkyr",
            "score": 2,
            "text": "They are also doing the same on the tallest mountain in Sweden!",
            "title_similarity": "0.48098195",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5nhu8r",
            "score": 2,
            "text": "Ohhhh, the scene in Lilyhammer with the sherpas makes more sense now",
            "title_similarity": "0.20991346",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5nikjh",
            "score": 2,
            "text": "*Sherpas\n\nThey are a people, not an occupation, so Sherpa should be capitalized.",
            "title_similarity": "0.16880798",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5nipnv",
            "score": 1,
            "text": "How does China feel about that?",
            "title_similarity": "0.10744932",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5njnao",
            "score": 2,
            "text": "I hiked Skala and it had sherpa laid stones. My buddy was telling me all about it and I was in complete awe at the work it must've taken. The hike was seriously brutal WITH the stones they laid. I cant imagine what it would have been like hauling all those stones up.",
            "title_similarity": "0.5866963",
            "sentiment_compound": -0.5106
        },
        {
            "id": "h5njs9p",
            "score": 2,
            "text": "Always bring the experts",
            "title_similarity": "0.16953371",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5nk33w",
            "score": 1,
            "text": "Gotta looove that exchange rate",
            "title_similarity": "0.04575442",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5nkpn6",
            "score": 3,
            "text": "I like this idea. Wonder if we can start a foundation to do this and have them repair and build trails in the Rocky Mountains and Sierra Nevada ranges.",
            "title_similarity": "0.48164475",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h5nkwy8",
            "score": 2,
            "text": "That's awesome",
            "title_similarity": "-0.08430621",
            "sentiment_compound": 0.6249
        },
        {
            "id": "h5nldlh",
            "score": 1,
            "text": "So they get paid about $210k?…",
            "title_similarity": "0.44952583",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5nmvwo",
            "score": 1,
            "text": "Unlikely to continue this practice after 2020/2021 pandemic",
            "title_similarity": "0.17359513",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5nn3x7",
            "score": 3,
            "text": "I think we hugged their page to death.",
            "title_similarity": "0.26627877",
            "sentiment_compound": -0.296
        },
        {
            "id": "h5nn5a3",
            "score": 2,
            "text": "Norway sounds like a good place to be.",
            "title_similarity": "0.2615886",
            "sentiment_compound": 0.6597
        },
        {
            "id": "h5nnl4y",
            "score": 3,
            "text": "Looks like we gave em the old reddit hug of death.",
            "title_similarity": "0.23017414",
            "sentiment_compound": 0.1779
        },
        {
            "id": "h5nnnhq",
            "score": 1,
            "text": "That sounds amazing",
            "title_similarity": "-0.07277884",
            "sentiment_compound": 0.5859
        },
        {
            "id": "h5nnpx6",
            "score": 1,
            "text": "That’s cool but it sucks that the Nepalese can’t get work aside from life threatening dangerous work.",
            "title_similarity": "0.34260684",
            "sentiment_compound": -0.9072
        },
        {
            "id": "h5nntf3",
            "score": 1,
            "text": "That is very cool. The Sherpas seem like friendly people with amazing strength and stamina.",
            "title_similarity": "0.17105603",
            "sentiment_compound": 0.9476
        },
        {
            "id": "h5nnybc",
            "score": 1,
            "text": "Where's the application. I'll definitely go back and work there",
            "title_similarity": "0.19921336",
            "sentiment_compound": 0.4019
        },
        {
            "id": "h5nnyxi",
            "score": 2,
            "text": "Imagine getting that work visa. It's like winning the lottery",
            "title_similarity": "0.28835607",
            "sentiment_compound": 0.7096
        },
        {
            "id": "h5nof0q",
            "score": 6,
            "text": "Not only are these paths evidence of incredibly hard/smart labour, they are also beautiful and the best aspect of these paths, in my opinion, is that the areas have been made a lot more accessible for everyone, especially for the young and old.",
            "title_similarity": "0.2752921",
            "sentiment_compound": 0.8442
        },
        {
            "id": "h5np2l9",
            "score": 1,
            "text": "Reddit HoD",
            "title_similarity": "-0.022637723",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5nprqu",
            "score": 3,
            "text": "I recently walked there on these steps, it was a more enjoyable walk then before. Then it was mostly loose stone on the path.",
            "title_similarity": "0.33034304",
            "sentiment_compound": 0.2247
        },
        {
            "id": "h5nr2g9",
            "score": 7,
            "text": "if people wounder about why pay them so well? a basic idea in at least the Nordic countries is foreign workforce should only be brought in due to there skill not the price of there labor to maintain higher stable general pay.\n\nthis is why the \"they took our job\" mentality becomes kinda broken here. as an example in sweden we had a big issue with polish truck drivers skirting EU rules to do domestic driving thus sinking the wages of truck drivers here. so laws where passed so that those drivers get paid the higher of the wages (swedens) when doing domestic transports.\n\nthat is why there wages were so high. they are hired for skill that does not exist in norway not for cheap labor.",
            "title_similarity": "0.43306595",
            "sentiment_compound": -0.0036
        },
        {
            "id": "h5nrc5r",
            "score": 1,
            "text": "Niceee",
            "title_similarity": "-0.09890252",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5nrese",
            "score": 1,
            "text": "This is true, not sure about the payment though",
            "title_similarity": "-0.01054099",
            "sentiment_compound": 0.2115
        },
        {
            "id": "h5nrgx4",
            "score": 1,
            "text": "they do great work",
            "title_similarity": "0.053365506",
            "sentiment_compound": 0.6249
        },
        {
            "id": "h5nrrue",
            "score": 2,
            "text": "TIL Sherpas in Nepal don't get paid enough.",
            "title_similarity": "0.42160797",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5nrzwz",
            "score": 1,
            "text": "Website is ded",
            "title_similarity": "0.002209384",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5nsje5",
            "score": 3,
            "text": "So the wages are 120x higher in Norway?",
            "title_similarity": "0.5163312",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5nt7kq",
            "score": 1,
            "text": "Good for them!!!! A very intelligent idea",
            "title_similarity": "0.029288642",
            "sentiment_compound": 0.8106
        },
        {
            "id": "h5nt97p",
            "score": 2,
            "text": "Access denied.",
            "title_similarity": "-0.17349002",
            "sentiment_compound": -0.4404
        },
        {
            "id": "h5ntah3",
            "score": 1,
            "text": "If you talk about hard labor, carrying those stones with the support strap on your forehead, while climbing up that kind of terrain has got to be near the top of the list. Incredible! Just imagining the Inca doing the very same thing.",
            "title_similarity": "0.50125164",
            "sentiment_compound": 0.5255
        },
        {
            "id": "h5nuc01",
            "score": 5,
            "text": "Glad Norway is giving them proper pay.",
            "title_similarity": "0.36753082",
            "sentiment_compound": 0.6124
        },
        {
            "id": "h5nuvr0",
            "score": 3,
            "text": "When outsourcing works.",
            "title_similarity": "0.009535033",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5nuzeh",
            "score": 1,
            "text": "Nice. They are also very good cooks too :)",
            "title_similarity": "0.14180298",
            "sentiment_compound": 0.8399
        },
        {
            "id": "h5nvbt9",
            "score": 1,
            "text": "Probably increased the cost in nepal and created labour shortage.",
            "title_similarity": "0.41204005",
            "sentiment_compound": 0.2732
        },
        {
            "id": "h5nvzfz",
            "score": 2,
            "text": "I love Norway 🇳🇴",
            "title_similarity": "0.34582898",
            "sentiment_compound": 0.6369
        },
        {
            "id": "h5nworz",
            "score": 1,
            "text": "Wish the GCC would take note.",
            "title_similarity": "0.0008255914",
            "sentiment_compound": 0.4019
        },
        {
            "id": "h5nxd6b",
            "score": 5,
            "text": "Wait. Hire experts to work on your projects. Pay them well, so that efforts benefit each culture and country. Pftt. Rookie efficiency. Probably don’t even speak English.",
            "title_similarity": "0.42551166",
            "sentiment_compound": 0.7553
        },
        {
            "id": "h5nxmvl",
            "score": 1,
            "text": "So theres gonna be some ballin' sherpas in Nepal when they go back home with all that money!?",
            "title_similarity": "0.5560772",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5nxua8",
            "score": 1,
            "text": "I’ve been to one of those paths in The northern part of Norway, in a small town called Mojsøen. \n\nhttps://www.visitnorway.com/listings/mosj%C3%B8en-via-ferrata-the-first-in-northern-norway/218431/",
            "title_similarity": "0.5115862",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5ny7rs",
            "score": 2,
            "text": "Sherpas are literally superhuman.",
            "title_similarity": "0.24456327",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5nzd5h",
            "score": 1,
            "text": "Norway's military already seems more competent than most. Lessons from oil wars I guess.",
            "title_similarity": "0.46227527",
            "sentiment_compound": -0.2516
        },
        {
            "id": "h5nzqf6",
            "score": 2,
            "text": "Can confirm.",
            "title_similarity": "-0.09256277",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5o0hag",
            "score": 7,
            "text": "When I worked at Amazon fulfillment centers, I had a decent sized group of Nepalese employees. Talk about some rule following, extremely hard working, constant working, good spirited, positive, and friendly people. I did find it interesting that almost all the men were equal height or shorter than the women working there.",
            "title_similarity": "0.5650857",
            "sentiment_compound": 0.9288
        },
        {
            "id": "h5o0xw4",
            "score": 2,
            "text": "There is one of paths in my hometown. I can only imagine the sherpas laughing at the mountain looking so tiny. (It’s actually just very flat, but still tall) The path is amazing, they did a great job with it",
            "title_similarity": "0.43450758",
            "sentiment_compound": 0.9319
        },
        {
            "id": "h5o21pw",
            "score": 1,
            "text": "From what ive read in local articles the pay is 9 years and not 30.",
            "title_similarity": "0.43772298",
            "sentiment_compound": -0.1027
        },
        {
            "id": "h5o25pw",
            "score": 2,
            "text": "30 years of work? The money in Nepal must be worth less than toilet paper...",
            "title_similarity": "0.49018443",
            "sentiment_compound": 0.2263
        },
        {
            "id": "h5o3dmh",
            "score": 1,
            "text": "I'm applying.",
            "title_similarity": "-0.020359095",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5o3jzx",
            "score": 1,
            "text": "They are awesome dudes as well",
            "title_similarity": "0.07576746",
            "sentiment_compound": 0.7351
        },
        {
            "id": "h5o3n2l",
            "score": 2,
            "text": "The anti-Qatar",
            "title_similarity": "-0.118949786",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5o4j6q",
            "score": 2,
            "text": "these man are too good for this world! thx to them and namaste!🥇🎰⚒",
            "title_similarity": "0.17174405",
            "sentiment_compound": 0.8436
        },
        {
            "id": "h5o4q07",
            "score": 3,
            "text": "The most impressive thing about this is that they are not milked like slaves.",
            "title_similarity": "0.07219917",
            "sentiment_compound": 0.3576
        },
        {
            "id": "h5o4yu4",
            "score": 1,
            "text": "beautiful!",
            "title_similarity": "-0.06516079",
            "sentiment_compound": 0.636
        },
        {
            "id": "h5o6pku",
            "score": 1,
            "text": "Good bring in the masters",
            "title_similarity": "-0.019115519",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h5o8xh5",
            "score": 2,
            "text": "Awesome to hear this.",
            "title_similarity": "-0.015553154",
            "sentiment_compound": 0.6249
        },
        {
            "id": "h5oc0fy",
            "score": 1,
            "text": "looks like its around 25k us$ for the season.",
            "title_similarity": "0.52656853",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h5oddj4",
            "score": 2,
            "text": "So I can retire in Nepal right now?",
            "title_similarity": "0.38534936",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5oemu5",
            "score": 1,
            "text": "I don't seem to be able to click *on an actual story*...is there one?",
            "title_similarity": "0.047969475",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5oeqmb",
            "score": 2,
            "text": "One Sherpa looked up at the mountain peak, turned to the other Sherpa and said \"Norway we can get up there!\"",
            "title_similarity": "0.60445714",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5og9x0",
            "score": 1,
            "text": "Holy Jesus, I bet they’re sending hella remittances back home lol",
            "title_similarity": "0.25152266",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h5oiqz8",
            "score": 3,
            "text": "I don't know how unpopular this opinion will be, so let me first say I respect the initiative immensely. Making hiking better and safer is always a good thing, while creating opportunities for workers. That being said, this was done in a mountain called Reinebringen, in Lofoten, Norway. The natural path was replaced with stone slabs, forming a sort of staircase up to the top. While I totally understand this descision, seing as it is one of the most popular trails in Lofoten, I deeply miss the natural path. It was exciting, with lots of twists and turns. Now it's just a boring staircase.",
            "title_similarity": "0.5030534",
            "sentiment_compound": 0.974
        },
        {
            "id": "h5oiwwy",
            "score": 2,
            "text": "Two questions:\n\nHow much would that pay equal in America and how difficult is it for an American to get a work visa for Norway?",
            "title_similarity": "0.50625503",
            "sentiment_compound": -0.4404
        },
        {
            "id": "h5omkkc",
            "score": 2,
            "text": "What a hell hole Nepal is",
            "title_similarity": "0.19411883",
            "sentiment_compound": -0.6808
        },
        {
            "id": "h5oq96z",
            "score": 1,
            "text": "30 years of work lol",
            "title_similarity": "0.5094079",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h5orn5m",
            "score": 1,
            "text": "Test",
            "title_similarity": "-0.09285115",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5otjhm",
            "score": 1,
            "text": "I’m glad :)",
            "title_similarity": "-0.07655369",
            "sentiment_compound": 0.7184
        },
        {
            "id": "h5ovwiu",
            "score": 1,
            "text": "You know why the pay in Norway is better? Norway has cash money derived from oil extraction.\nChina has money from exploitation of labor.",
            "title_similarity": "0.4078908",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h5owaux",
            "score": 5,
            "text": "But is the pay for their labor equal to what a citizen would be paid? That’s an important moral question to consider.",
            "title_similarity": "0.16540098",
            "sentiment_compound": 0.1531
        },
        {
            "id": "h5oxy44",
            "score": 1,
            "text": "Sounds like a win/win.",
            "title_similarity": "0.010296227",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h5oy4ra",
            "score": 2,
            "text": "It’s money damn well earned- the sherpas are fucking legends.",
            "title_similarity": "0.27469912",
            "sentiment_compound": -0.1531
        },
        {
            "id": "h5p0dbn",
            "score": 2,
            "text": "After climbing Sherpa steps in Norway, I more respect for Sherpas more than ever. They do some amazing work.",
            "title_similarity": "0.6010235",
            "sentiment_compound": 0.8016
        },
        {
            "id": "h5p2mky",
            "score": 1,
            "text": "Good guy Norway",
            "title_similarity": "0.24948707",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h5p3fhh",
            "score": 1,
            "text": "R",
            "title_similarity": "-0.16481718",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5p4sok",
            "score": 3,
            "text": "Website is down, good job reddit.",
            "title_similarity": "0.1219433",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h5pf2hs",
            "score": 1,
            "text": "I wonder how fucked they would be if everyone in the world was treated like ac westerner \n\n“I ain’t doing that shit for less then $70 an hour”",
            "title_similarity": "0.5115063",
            "sentiment_compound": -0.7579
        },
        {
            "id": "h5ph8n6",
            "score": 1,
            "text": "Did they take a page from Norse Myth? Do they only get the pay if they aren’t lured away by Loki in mare-shape?",
            "title_similarity": "0.41447964",
            "sentiment_compound": -0.1926
        },
        {
            "id": "h5pjake",
            "score": 1,
            "text": "I wonder what employment law and conditions applies to them",
            "title_similarity": "0.106184795",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5porp5",
            "score": 1,
            "text": "Or 1 year salary in Norway.\nOr 100 year salary of uguanda.",
            "title_similarity": "0.6817905",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5pthqq",
            "score": 1,
            "text": "It is so anoying that this stupid article doesnt have photos of the trails…",
            "title_similarity": "0.12512225",
            "sentiment_compound": -0.6124
        },
        {
            "id": "h5pzze9",
            "score": 2,
            "text": "30 years lol. That's actually some bullshit right there OP.\n~ Someone from Nepal",
            "title_similarity": "0.50190467",
            "sentiment_compound": -0.25
        },
        {
            "id": "h5q0y9u",
            "score": 1,
            "text": "I'm going to bet 30 years of sherpa money is less than 1 summer of Norwegian money. You don't make your statement this convoluted unless you're hiding something.\n\nAnd they probably pay Norwegian tax which aint cheap and they won't get any of the benefits in Nepal.\n\nThe headline should be Norway outsources labor for a fraction of the cost of domestic labor and wants to be a hero for doing so.\n\nIn other news, American businessmen illegally hire hispanics who get paid years of their countries income for a seasons worth of work. They often also pay taxes and get nothing for it.",
            "title_similarity": "0.5937232",
            "sentiment_compound": 0.6249
        },
        {
            "id": "h5q3xvi",
            "score": 1,
            "text": "Congratulations u/Prebenutsug ! Your post was the top post on r/todayilearned today! (07/18/21)\n\nTop Post Counts: r/todayilearned (1) \n\n*This comment was made by a bot*",
            "title_similarity": "0.46210128",
            "sentiment_compound": 0.7955
        },
        {
            "id": "h5q4v71",
            "score": 2,
            "text": "What they get paid in 5 months they earn in 9 years in Nepal. FYI",
            "title_similarity": "0.62644255",
            "sentiment_compound": 0.368
        },
        {
            "id": "h5q5idg",
            "score": 1,
            "text": "Yeah Norwegians are much for building transportation routes in difficult places themselves...",
            "title_similarity": "0.3934824",
            "sentiment_compound": -0.0772
        },
        {
            "id": "h5q61vu",
            "score": 1,
            "text": "Norway, Finland, and Iceland. The countries that you will never hear anything bad about because hardly anything bad happens or comes from there.",
            "title_similarity": "0.3121779",
            "sentiment_compound": -0.0955
        },
        {
            "id": "h5q87s5",
            "score": 1,
            "text": "I thought sherpas made a good living on Everest. \n\nEven more reason to scoff at that shit, the sherpas do all the work.",
            "title_similarity": "0.6036331",
            "sentiment_compound": -0.1779
        },
        {
            "id": "h5q9y3k",
            "score": 1,
            "text": "Norwegian mountains will be beautiful as much as Nepal. The paths of Nepal are incredibly beautiful.",
            "title_similarity": "0.49172038",
            "sentiment_compound": 0.8439
        },
        {
            "id": "h5qclj5",
            "score": 1,
            "text": "They are also doing the same on the tallest mountain in Sweden!",
            "title_similarity": "0.48098195",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5qcuby",
            "score": 2,
            "text": "Regarding the sherpas' pay, I remembered the phrase that reads something like \"the future is already here but unevenly distributed across the world\". Similarly, the pay is unevenly distributed. But I'm glad they are getting paid more.",
            "title_similarity": "0.35234362",
            "sentiment_compound": 0.6059
        },
        {
            "id": "h5qfs48",
            "score": 1,
            "text": "Thriving wage, nothing wrong with that",
            "title_similarity": "0.10906356",
            "sentiment_compound": 0.3724
        },
        {
            "id": "h5qj1y1",
            "score": 1,
            "text": "This is cool. I watched the documentary Sherpa recently and was really bothered by the lack of other options the Sherpas had when it came to putting themselves in danger on Everest.",
            "title_similarity": "0.49431828",
            "sentiment_compound": -0.7178
        },
        {
            "id": "h5qmaoq",
            "score": 2,
            "text": ">Nepal\n\nisn’t that where Napoleon Dynamite comes from?",
            "title_similarity": "0.35268828",
            "sentiment_compound": 0.1779
        },
        {
            "id": "h5qmj30",
            "score": 1,
            "text": "I've lived in Nepal for almost a year. They are the most compassionate people I know. Thank you!",
            "title_similarity": "0.6554242",
            "sentiment_compound": 0.7419
        },
        {
            "id": "h60ejxr",
            "score": 1,
            "text": "Yes. I found out about this while watching a super cool show filmed in 🇳🇴Norway. It’s called Lillehammer. Watch it’s hilarious 😂!",
            "title_similarity": "0.37566513",
            "sentiment_compound": 0.9299
        },
        {
            "id": "h6184yk",
            "score": 1,
            "text": "TIL I'm moving to Nepal",
            "title_similarity": "0.3951649",
            "sentiment_compound": 0.0
        },
        {
            "id": "h62zp92",
            "score": 1,
            "text": "The sheer stamina and athleticism of the Sherpa astound me.",
            "title_similarity": "0.2501719",
            "sentiment_compound": 0.5994
        },
        {
            "id": "h64g0rp",
            "score": 1,
            "text": "Britain also hires people from Nepal but instead of building paths they are given a uniform and a rifle and sent into combat with the Gurkha Brigade!",
            "title_similarity": "0.5469216",
            "sentiment_compound": -0.5255
        },
        {
            "id": "h7sgt3x",
            "score": 1,
            "text": "Eyyyyy i know this and i have been to this exact spit before",
            "title_similarity": "0.2378149",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8vkjry",
            "score": 1,
            "text": "If only immigration restrictions were lifted across the board and more people would have similar opportunities.",
            "title_similarity": "0.21505913",
            "sentiment_compound": 0.3818
        }
    ]
}