{
    "TIL Norway discovered oil in its country 40 years ago. Knowing the oil would eventually run out, they chose to invest it in a sovereign wealth fund. It is one of the most profitable funds in the world - valued at over $1.3 trillion - enough to self sustain the county for many years.\n": [
        {
            "id": "h62ouui",
            "score": -12,
            "text": "Oh Yea? Well in America we uh...invested in uh......USA!",
            "title_similarity": "0.36004373",
            "sentiment_compound": 0.3382
        },
        {
            "id": "h62v7hc",
            "score": 12,
            "text": "Farouk Al Kasim, an Iraqi immigrant, is the main reason why this happened. You won’t find that on the fund’s site though because politicians would rather take credit than properly acknowledge an immigrant",
            "title_similarity": "0.5476723",
            "sentiment_compound": 0.3818
        },
        {
            "id": "h63598d",
            "score": -7,
            "text": "Ha. Stupid socialists. They may have social wealth, ethical government, state-sponsored higher learning, universal healthcare, happier populations,  and…\n\n…wait, what was my point again?",
            "title_similarity": "0.42561358",
            "sentiment_compound": 0.7579
        },
        {
            "id": "h62x32y",
            "score": -5,
            "text": "What a terrible form of capitalism. The idea is to let 3 people horde one trillion, 100 people divide 250 billion, and the remainder is fought over by everyone else. Does no one there read Ayn Rand?",
            "title_similarity": "0.6390015",
            "sentiment_compound": -0.765
        },
        {
            "id": "h63bgda",
            "score": 0,
            "text": "Norway is a socialisf hell hole. They aren’t even allowed automatic weapons to slaughter school children with, and their prisoners are rehabilitated so they don’t have the most people per capita in the history of forever locked in cages, so they don’t even have freedumb!!",
            "title_similarity": "0.4885008",
            "sentiment_compound": -0.9078
        },
        {
            "id": "h6331vn",
            "score": -11,
            "text": "But in the US, a small number of people get extremely wealthy. That's way better because freedom, right?",
            "title_similarity": "0.48267385",
            "sentiment_compound": 0.9412
        },
        {
            "id": "h6352nz",
            "score": -4,
            "text": "In America we would just 80% to fund the military, 20% to fund a rich asshole, and then drain in dry in a year.",
            "title_similarity": "0.73956937",
            "sentiment_compound": 0.5574
        },
        {
            "id": "h639wqz",
            "score": -9,
            "text": "This can't be true.  Why just yesterday, someone on /r/republican was explaining that socialist countries like Venezuela would squander their oil rich reserves and ruin their economy.  Only greed driven capitalists could be counted on to have the best interests of everyone in mind!",
            "title_similarity": "0.68653727",
            "sentiment_compound": 0.5803
        },
        {
            "id": "h635ffr",
            "score": -14,
            "text": "This is why they can afford socialism, a small population with huuuuuuge oil money trusts. America can't replicate that.",
            "title_similarity": "0.6450989",
            "sentiment_compound": 0.4767
        },
        {
            "id": "h63c1xs",
            "score": 0,
            "text": "Norway is like the _only_ well-rounded country that got rich on oil.",
            "title_similarity": "0.7091617",
            "sentiment_compound": 0.7269
        },
        {
            "id": "h62ymuy",
            "score": 2,
            "text": "That's like 6 months of funding in the US",
            "title_similarity": "0.40454894",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h6357nr",
            "score": -2,
            "text": "This is what happens when politicians do their jobs. So I'll say it again for the dumbass conservatives in the back:\n\nGovernment is not the problem, it's our system that's the problem",
            "title_similarity": "0.55372095",
            "sentiment_compound": -0.6177
        },
        {
            "id": "h63c7zl",
            "score": -3,
            "text": "Norwegian here. The fund could’ve been sooo much bigger if it hadn’t been for the fact that we waste a ton of our oil money on other countries. Some of it is supposed to be loans, but a lot of that which we’ve given away, we never were repaid/refunded, and most likely never will get back (this for various reasons ofc). We send a lot of it to corrupt politicians, and the money also finds its way to help finance wars and other conflicts in many parts of the world (even in the US). Sadly, we’re missing a good ethical framework that could help us with distributing the oil fund's investments in better ways. Now some of it does make it to good causes, just not nearly as much as one would want and expect. \n\nEdit: I love that people are downvoting this as if I’m stating a personal opinion, when it’s actually just pure facts.",
            "title_similarity": "0.7336209",
            "sentiment_compound": 0.9398
        },
        {
            "id": "h63czwz",
            "score": 0,
            "text": "But their immigration policy is xenophobic",
            "title_similarity": "0.28683236",
            "sentiment_compound": 0.0
        },
        {
            "id": "h64fsww",
            "score": 0,
            "text": "The United States government spends a trillion dollars every 4 months. The reason the “Norway model” works so well is because their population is only 5 million people, not 330 million. \n\nThe United States has way more people than they have oil, and Norway has way more oil than they have people: enough production to provide a surplus barrel of oil to every person, every four days. \n\nThe good news is the United States labor produces more money than Norway produces in oil. The bad news is labor sitting in the ground doesn’t have any value, where as oil sitting in the ground does.\n\nThe US model is arguably far more successful than the Norway model, because the Norway model doesn’t scale.",
            "title_similarity": "0.7913004",
            "sentiment_compound": 0.9329
        },
        {
            "id": "h62r37x",
            "score": -15,
            "text": "They had oil and never got invaded by the US for democracy",
            "title_similarity": "0.43849325",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6323x6",
            "score": -16,
            "text": "When you completely ban any immigration, and become heartless bastards to the tire people who need help, it’s very easy to build wealth like they have. Kudos to them 👍",
            "title_similarity": "0.4950212",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h636czc",
            "score": -6,
            "text": "AmErIcA iS tHe GrEaTeSt cOuNtRy iN tHe wOrLd",
            "title_similarity": "0.61417913",
            "sentiment_compound": 0.6369
        },
        {
            "id": "h63hth1",
            "score": 4,
            "text": "And now they are continuing to open new oil wells against all common reasoning and against the advice of the IEA. They are pushing arctic oil drilling as much as russia and propagate the myth of 'norwegian clean oil' (surprise: it isn't clean or the cleanest). As for now, they are in the global top 10 of co2 exporters\n\nNorway will keep on getting oil well into the 2070s. It is not a green or sustainble minded country, but a rentier state much like saudi arabia or venezuela",
            "title_similarity": "0.78128445",
            "sentiment_compound": 0.7558
        },
        {
            "id": "h63505h",
            "score": -9,
            "text": "If you think America isn’t playing the long game on their resources, you may just be a fool.\n\nAt least Norway didn’t go around invading countries for the past 60 years",
            "title_similarity": "0.6575599",
            "sentiment_compound": -0.2732
        },
        {
            "id": "h639txm",
            "score": -10,
            "text": "How can other countries do all these amazingly smart things, but we can’t. America is supposed to be a leader, but we are not. We are a greedy spoiled society. I love this country, but we’re a laughing stock to the world.",
            "title_similarity": "0.5742669",
            "sentiment_compound": 0.8792
        },
        {
            "id": "h6350vt",
            "score": 0,
            "text": "And yet you always hear people say it's nazi gold, never quite understood that one...",
            "title_similarity": "0.5131082",
            "sentiment_compound": 0.0
        },
        {
            "id": "h636sob",
            "score": 2,
            "text": "Norway is the perfect example of what can happen when you don't let greed run the country..",
            "title_similarity": "0.50925136",
            "sentiment_compound": 0.7147
        },
        {
            "id": "h638egb",
            "score": -1,
            "text": "It’s almost like allowing capitalists to exploit national resources for personal gain is a fucked idea… looking at you Gina Swineheart",
            "title_similarity": "0.3989237",
            "sentiment_compound": -0.0498
        },
        {
            "id": "h638hqt",
            "score": 2,
            "text": "wow 40 years and america didn't say they need freedom.",
            "title_similarity": "0.5541393",
            "sentiment_compound": 0.8402
        },
        {
            "id": "h62pfsr",
            "score": -15,
            "text": "Doggone Socialists!",
            "title_similarity": "0.12409359",
            "sentiment_compound": 0.0
        },
        {
            "id": "h63778t",
            "score": 0,
            "text": "[deleted]",
            "title_similarity": "-0.040149488"
        },
        {
            "id": "h65jpfa",
            "score": 0,
            "text": "Once again, Norway/Scandinavia proves how much better they are then so much of the world.  🇳🇴🤘🏻💗",
            "title_similarity": "0.5312467",
            "sentiment_compound": 0.8316
        },
        {
            "id": "h65mzqv",
            "score": 0,
            "text": "Weird how everyone ignores socialism when it works and always points to countries who the US actively destabilized.",
            "title_similarity": "0.40080848",
            "sentiment_compound": -0.128
        },
        {
            "id": "h62q50i",
            "score": 117,
            "text": "They also only have 5 mm people",
            "title_similarity": "0.15631357",
            "sentiment_compound": 0.0
        },
        {
            "id": "h632l7d",
            "score": -6,
            "text": "And here America is… well over $1.3 trillion in debt… yay self sustaining lol",
            "title_similarity": "0.680832",
            "sentiment_compound": 0.8074
        },
        {
            "id": "h62vzkc",
            "score": -5,
            "text": "In the US we just get ruined wildlife and a messed up ecosystem, no paychecks.",
            "title_similarity": "0.32066798",
            "sentiment_compound": -0.7717
        },
        {
            "id": "h632c38",
            "score": 3,
            "text": "Should of whored it out to the most attractive bidder. /s",
            "title_similarity": "0.40589157",
            "sentiment_compound": -0.1548
        },
        {
            "id": "h63jaxw",
            "score": 2,
            "text": "Sad Scotland noises...",
            "title_similarity": "0.16443653",
            "sentiment_compound": -0.4767
        },
        {
            "id": "h62lcfe",
            "score": 32,
            "text": "Yet still insanely expensive to live there.   Like almost NYC (where I live)  expensive.",
            "title_similarity": "0.48958233",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h62rjaj",
            "score": -21,
            "text": "Murica, take note",
            "title_similarity": "-0.10750671",
            "sentiment_compound": 0.0
        },
        {
            "id": "h63i2tt",
            "score": 8,
            "text": ">TIL Norway discovered oil in its country 40 years ago.\n\nThis is substantially untrue.\n\nAn American company, Phillips Petroleum, discovered oil in an area called Ekofisk, almost 200 miles off the coast of Norway.\n\nBy a fluke of international law, the rights to this oil belonged to the government of Norway.\n\nWhile it must be said that the government has acted as a wise steward of the royalty money, it should also be remembered that every of that money came from the pockets of citizens of other countries — in return for _zero_ labor, investment, or physical risk on the part of any Norwegian.\n\nNorway won the biggest lottery in history, without even paying for a ticket.",
            "title_similarity": "0.8200687",
            "sentiment_compound": 0.6908
        },
        {
            "id": "h63i9w1",
            "score": 6,
            "text": "Scandinavia must have patented having genuine, competent, and uncorrupted government that works for for its citizens and not corporations/billionaires because you never see it in the wild outside of that region.",
            "title_similarity": "0.5474026",
            "sentiment_compound": 0.3182
        },
        {
            "id": "h637qt4",
            "score": 9,
            "text": "This is what happens when competent people are in charge and put the interests of the country first. Cries in American.",
            "title_similarity": "0.41663116",
            "sentiment_compound": 0.1531
        },
        {
            "id": "h636r3o",
            "score": 10,
            "text": "Norway is the best run country in the world. Convince me otherwise. \n\n\nAlso, convince me that someone corrupt won’t come into power very soon and take everyone’s money :)",
            "title_similarity": "0.714921",
            "sentiment_compound": 0.8807
        },
        {
            "id": "h63hu7c",
            "score": 4,
            "text": "It’s something scotland have wanted to do, but Westminster set us straight and wring us dry for every penny.",
            "title_similarity": "0.4756779",
            "sentiment_compound": 0.3291
        },
        {
            "id": "h63rz1p",
            "score": 2,
            "text": "If only Scotland had been independent from England when we discovered oil...",
            "title_similarity": "0.519251",
            "sentiment_compound": 0.0
        },
        {
            "id": "h63mcmt",
            "score": 1,
            "text": "Now do Venezuela",
            "title_similarity": "0.06230353",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6302l9",
            "score": 8,
            "text": "Heh. Iran tried the same thing and BP and the CIA fucked the shit out of them.",
            "title_similarity": "0.44259495",
            "sentiment_compound": -0.25
        },
        {
            "id": "h63c73t",
            "score": -6,
            "text": "OMG! Socialism is so EVIL!?\n\nWhy didn’t they hand it over to a private company instead?!\n\n/s",
            "title_similarity": "0.4646994",
            "sentiment_compound": -0.7628
        },
        {
            "id": "h62vidb",
            "score": 47,
            "text": "And, despite the source of this wealth, they have a strong commitment to sustainability heavily subsidizing electric vehicles, (about 67% of the cars on the road) which makes it extremely cost-inefficient to drive anything but a Tesla…",
            "title_similarity": "0.76066846",
            "sentiment_compound": 0.6514
        },
        {
            "id": "h62yjuh",
            "score": 1,
            "text": "Do that with social security for fucks sake",
            "title_similarity": "0.21127251",
            "sentiment_compound": -0.1779
        },
        {
            "id": "h631tar",
            "score": -2,
            "text": "Interesting fact!!\n\nIf this was how other countries modeled themselves we'd be better off but hey we all know how shit gets done greed is what powers everything man it pisses me off but not like we can do a damn thing",
            "title_similarity": "0.5076388",
            "sentiment_compound": -0.9481
        },
        {
            "id": "h63538k",
            "score": 3,
            "text": "Except since their money is mostly in kroner they have to be very careful about spending so as not to inflate their currency.",
            "title_similarity": "0.39504832",
            "sentiment_compound": 0.2247
        },
        {
            "id": "h639j37",
            "score": 1,
            "text": "They are also lucky enough to be a white European nation with oil and not a mal-developed neo-colonial society from the global south with oil.",
            "title_similarity": "0.48970357",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h62nhms",
            "score": 157,
            "text": "Did somebody say Pennsylvania teachers Union? Oh\n\nAnyway the United States NEEDS a sovereign wealth fund for its citizens. \n\nAlso important to note, Norway was able to escape a resource curse. Now I don't know much about the country but im guessing guessing had a functional economy prior or had longstanding institutions.",
            "title_similarity": "0.6954941",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h63fs8d",
            "score": 14,
            "text": "Britain had the same, but Margaret Thatcher gave it all away in tax cuts for the rich.",
            "title_similarity": "0.5564924",
            "sentiment_compound": 0.4767
        },
        {
            "id": "h636fj3",
            "score": -6,
            "text": "This is the main reason Norway is a great example of successful socialism. The state took over the oil industry. No individual person can operate an oil company in Norway.\n\nTo contrast with Venezuela, which used its nationalized oil industry to support an autocratic government, not a democratic one.",
            "title_similarity": "0.68192637",
            "sentiment_compound": 0.8555
        },
        {
            "id": "h63pzd7",
            "score": 12,
            "text": "And they can thank an Iraqi immigrant for the existence of the fund - an engineer who had seen how the British hunt for oil in Iraq had not benefited the people of Iraq, and didn't want the same fate to befall the people of Norway. You can read more about him [in this article](https://archive.md/lXaze).",
            "title_similarity": "0.6361993",
            "sentiment_compound": 0.3134
        },
        {
            "id": "h63dnnu",
            "score": -3,
            "text": "bUt tHaT's bEiNg SoCiAliST, hOw I mAkE pRoFiT???",
            "title_similarity": "0.3852518",
            "sentiment_compound": 0.6586
        },
        {
            "id": "h63gsm2",
            "score": 4,
            "text": "They're lucky The U.S. didn't have a fake reason to invade them.",
            "title_similarity": "0.34432775",
            "sentiment_compound": 0.6546
        },
        {
            "id": "h63h5hf",
            "score": 3,
            "text": "I'm a Norwegian. I'm thankful for what they did with this wealth, but I hope we can start moving to different fields. We have plenty of money to invest in other industries. \n\nConsidering we are the country with most electric vehicles per capita it makes sense we look to stopping oil and be an example of change going forward.",
            "title_similarity": "0.7216398",
            "sentiment_compound": 0.7701
        },
        {
            "id": "h62pqun",
            "score": 12,
            "text": "And now over half of new cars sold in the country are electric",
            "title_similarity": "0.5899253",
            "sentiment_compound": 0.0
        },
        {
            "id": "h62xusm",
            "score": 12,
            "text": "Sustain Norway for many years .... or the US for September.",
            "title_similarity": "0.53299487",
            "sentiment_compound": 0.0
        },
        {
            "id": "h62muuq",
            "score": -53,
            "text": "1.3 trillion that about a 1/2 of a Democrat spending bill this year alone (that don’t give regular American shit) not counting all the other bill’s",
            "title_similarity": "0.60241914",
            "sentiment_compound": -0.6808
        },
        {
            "id": "h635j2l",
            "score": 0,
            "text": "Yeah, before the oil, Norway was just another poor third world country.",
            "title_similarity": "0.59941244",
            "sentiment_compound": -0.2263
        },
        {
            "id": "h638oka",
            "score": 0,
            "text": "Meanwhile America well….\n\n\n\n We freedom oil.",
            "title_similarity": "0.4421692",
            "sentiment_compound": 0.6369
        },
        {
            "id": "h639c3n",
            "score": 0,
            "text": "Approximately 7 years does not really qualify as “many”.",
            "title_similarity": "0.23893216",
            "sentiment_compound": 0.0
        },
        {
            "id": "h63bul4",
            "score": 0,
            "text": "Yes. Social programs payed for by oil.",
            "title_similarity": "0.42736146",
            "sentiment_compound": 0.4019
        },
        {
            "id": "h63bz5k",
            "score": 0,
            "text": "Sounds like Norway needs some go Ol fashioned Freedom!",
            "title_similarity": "0.34317103",
            "sentiment_compound": 0.7901
        },
        {
            "id": "h63d2qi",
            "score": 0,
            "text": "[deleted]",
            "title_similarity": "-0.040149488"
        },
        {
            "id": "h63defw",
            "score": 0,
            "text": "The UK discovered oil, and gave it to companies who paid few taxes and made huge profits.\n\nI see someone is annoyed by facts",
            "title_similarity": "0.7213143",
            "sentiment_compound": 0.3818
        },
        {
            "id": "h63ec7c",
            "score": 0,
            "text": "ELI5? Anyone?",
            "title_similarity": "-0.0011461172",
            "sentiment_compound": 0.0
        },
        {
            "id": "h63ecr3",
            "score": 0,
            "text": "If only Venezuela invested its oil revenue wisely",
            "title_similarity": "0.5214294",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h63ep4c",
            "score": 0,
            "text": "Yeah, and they love to talk about how good they are for the environment....",
            "title_similarity": "0.22517002",
            "sentiment_compound": 0.8519
        },
        {
            "id": "h63gff3",
            "score": 0,
            "text": "Don’t mind the neoimperialism that also sustains Nordic countries. Without the global south they would collapse.",
            "title_similarity": "0.6343535",
            "sentiment_compound": -0.4939
        },
        {
            "id": "h63gvpn",
            "score": 3,
            "text": "We had the same idea in Australia but America didn’t like it and arranged to have our head of state fired",
            "title_similarity": "0.44028342",
            "sentiment_compound": -0.3919
        },
        {
            "id": "h63jtiz",
            "score": 3,
            "text": "Sounds like someone needs some freedom",
            "title_similarity": "-0.04158082",
            "sentiment_compound": 0.7717
        },
        {
            "id": "h63ma35",
            "score": 0,
            "text": "Well, yeah it’s good to invest it but it is not that much either. Germany’s Corona debt run over 1/4 of that fund.",
            "title_similarity": "0.63024545",
            "sentiment_compound": -0.0387
        },
        {
            "id": "h63u5rg",
            "score": 0,
            "text": "UK pissed away our North Sea oil- Scotland waited too long to go for independence.",
            "title_similarity": "0.6439433",
            "sentiment_compound": -0.6369
        },
        {
            "id": "h63uwhr",
            "score": 0,
            "text": "If only Alaska did the same 🤦🏻‍♂️",
            "title_similarity": "0.27048135",
            "sentiment_compound": 0.0
        },
        {
            "id": "h63ysgi",
            "score": 0,
            "text": "When they origonally found it the amount of oil was thought to be tiny. So they decided to give it all to a compaby who rejected it.",
            "title_similarity": "0.40849406",
            "sentiment_compound": -0.5106
        },
        {
            "id": "h6424tn",
            "score": 0,
            "text": "Comparing Norway's use of north sea oil vs. the UK's is worth a study in itself. In a nutshell, the UK privatized it to big oil. The government spent the windfall from it on tax breaks and making the stock market look great. Another total fucking waste which only helped boomers, that short-term profit seeking mentality is endemic in the UK and America and will be our downfall if we don't change really fast.",
            "title_similarity": "0.7660105",
            "sentiment_compound": 0.6735
        },
        {
            "id": "h644xwi",
            "score": 0,
            "text": "The UK was in the same situation but gave it all away to private people and propping up the government budget a little bit.",
            "title_similarity": "0.5073525",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6452dd",
            "score": 0,
            "text": "So like 5 times as much money as Bezos has?",
            "title_similarity": "0.39525515",
            "sentiment_compound": 0.4201
        },
        {
            "id": "h645j7q",
            "score": 0,
            "text": "People think that there's no poverty in Norway because of smart investments, but that's just a fancy way of saying they offsourced their slavery to another country.",
            "title_similarity": "0.580462",
            "sentiment_compound": -0.7183
        },
        {
            "id": "h64851f",
            "score": 0,
            "text": "Not sure how this got 10k upvotes. Norwegian Sovereign Wealth Fund is far from new. Wonder if this betrays a staggering ignorance of the world more than anything.",
            "title_similarity": "0.66433036",
            "sentiment_compound": -0.6583
        },
        {
            "id": "h6494jz",
            "score": 0,
            "text": "Kinda shows how much easier it is to manage these smaller countries... 1 trillion dollars isn't very much when running a big country... The US has a yearly gdp of 20 trillion...",
            "title_similarity": "0.61567163",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h64c8cv",
            "score": 0,
            "text": "[deleted]",
            "title_similarity": "-0.040149488"
        },
        {
            "id": "h64dqv9",
            "score": 0,
            "text": "Honest question, when the resources run out, what good is the money worth?\n\nIn other words, wouldn't it be better to just protect the resource, watch the rest of the world squander theirs, then boom yours is worth a ton of \"money\" or just intrinsic value.",
            "title_similarity": "0.5835948",
            "sentiment_compound": 0.8908
        },
        {
            "id": "h64euki",
            "score": 0,
            "text": "$1.3T can sustain the country for many years.\n\nAnd here in the US we just print those trillions like it's the Monopoly money that it is.",
            "title_similarity": "0.8013195",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h64l5ao",
            "score": 0,
            "text": "Norwegians value taking value from the workers of other countries. Shame on them",
            "title_similarity": "0.45813632",
            "sentiment_compound": 0.1779
        },
        {
            "id": "h64s7qn",
            "score": 0,
            "text": "Yea but is no human illegal",
            "title_similarity": "0.034998845",
            "sentiment_compound": 0.27
        },
        {
            "id": "h653az6",
            "score": 0,
            "text": "In Scotland we found oil 40 years ago, UK government classified a report (mccrone report) saying that in the event of independence, Scotland would have a chronic surplus of money and the currency would be best in Europe. That would pretty much humiliate the UK. \n\nUK government then privatised and squandered it, now they provide the biggest fossil fuel subsidies in europe",
            "title_similarity": "0.86567175",
            "sentiment_compound": 0.5994
        },
        {
            "id": "h6565qb",
            "score": 0,
            "text": "Sounds like commie gobbledygook",
            "title_similarity": "0.15614581",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h657cq8",
            "score": 0,
            "text": "If it was America, it would be sustained for 1 whole year.",
            "title_similarity": "0.5394578",
            "sentiment_compound": 0.0
        },
        {
            "id": "h657ts9",
            "score": 0,
            "text": "Good for them, that's legitimately awesome. Also helps explain why their politics are different from most anyone else's on the planet - most other countries don't have a $1t trust fund.",
            "title_similarity": "0.53445625",
            "sentiment_compound": 0.9169
        },
        {
            "id": "h62sdf9",
            "score": 136,
            "text": "Norway could affjord to save their money.",
            "title_similarity": "0.46983406",
            "sentiment_compound": 0.4939
        },
        {
            "id": "h636dxo",
            "score": 85,
            "text": "And it was an Iraqi guy (an immigrant to Norway) who advised Norway to do so, having seen what happens when a country comes upon sudden wealth back in Iraq.",
            "title_similarity": "0.6576842",
            "sentiment_compound": 0.4939
        },
        {
            "id": "h62w2lt",
            "score": 36,
            "text": "A rare example of a government using public funds wisely.",
            "title_similarity": "0.3679569",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h63409i",
            "score": 12,
            "text": "Yes but have you seen any Norwegian going to space in a huge dick rocket? Nope.",
            "title_similarity": "0.48314053",
            "sentiment_compound": -0.1655
        },
        {
            "id": "h62wn3h",
            "score": 6,
            "text": "Smart people. Good idea.",
            "title_similarity": "0.15051663",
            "sentiment_compound": 0.6808
        },
        {
            "id": "h62v4kc",
            "score": -1,
            "text": "123GoGoGo hey Norway Hey Ho Lets Go",
            "title_similarity": "0.32981604",
            "sentiment_compound": 0.0
        },
        {
            "id": "h62vofm",
            "score": -1,
            "text": "Richest county (sic) in the world! ARGH.",
            "title_similarity": "0.5620335",
            "sentiment_compound": 0.5707
        },
        {
            "id": "h62vu59",
            "score": -1,
            "text": "Think the year they discovered oil was in 1969.",
            "title_similarity": "0.39786664",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6317mr",
            "score": -1,
            "text": "Norway has a country??",
            "title_similarity": "0.29725456",
            "sentiment_compound": 0.0
        },
        {
            "id": "h63289x",
            "score": 1,
            "text": "many.... MANY!!!!",
            "title_similarity": "0.07214249",
            "sentiment_compound": 0.0
        },
        {
            "id": "h634i20",
            "score": -1,
            "text": "BUT I DONT UNDERSTAND WHO IS SUPPOSED TO PROFIT FOR THIS AND PAD MY POCKETS AS A CONGRESSPERSON FOR HELPING THEM PROFIT!!! what a scam!",
            "title_similarity": "0.45604295",
            "sentiment_compound": 0.8983
        },
        {
            "id": "h634sck",
            "score": 1,
            "text": "I learnt a long time ago Australia's government are self serving useless cunts and when they had an opportunity to do this for the good of the country, chose to give billions to multinationals and billionaires",
            "title_similarity": "0.67435974",
            "sentiment_compound": -0.25
        },
        {
            "id": "h634shn",
            "score": 1,
            "text": "I think I have found my FBI surveillance agent! I was (or should I say “we were”?) watching a YouTube video by Economic Raven about the Norse economy that delved into this just a few hours ago.",
            "title_similarity": "0.6146245",
            "sentiment_compound": 0.0
        },
        {
            "id": "h634vhb",
            "score": -1,
            "text": "[deleted]",
            "title_similarity": "-0.040149488"
        },
        {
            "id": "h6361kt",
            "score": 1,
            "text": "Australia wanted to do something like this - nationalizing natural resources, so the CIA stepped in and helped get the Prime Minister at the time, Gough Whitlam, thrown out of office.\n\nAs a result, Australia's natural resources were left open to private corporations.",
            "title_similarity": "0.5760563",
            "sentiment_compound": 0.7579
        },
        {
            "id": "h6361w3",
            "score": 1,
            "text": "Meanwhile in Australia we sold our mining rights off to the highest bidders and funneled our once in a lifetime wealth to a few rich foreigners, one or two rich bogan Australians, and no doubt the politicians that gave it to them. Good onya Norway, you did better than us",
            "title_similarity": "0.74245906",
            "sentiment_compound": 0.9546
        },
        {
            "id": "h6363jx",
            "score": 1,
            "text": "Yes Norway did a great job. Keep in mind their population size is about 5.6 million people and it's size is similar to California. And while race shouldn't matter. They are mostly homogenous population with a ton of natural resources.\n\nSo while Norway and similar countries do a great job. It's not because they are super people. There are other forces that help.",
            "title_similarity": "0.61337113",
            "sentiment_compound": 0.9634
        },
        {
            "id": "h636m84",
            "score": 1,
            "text": "That PBS miniseries about Norway and FDR was awesome, too.",
            "title_similarity": "0.51455843",
            "sentiment_compound": 0.6249
        },
        {
            "id": "h63774v",
            "score": 1,
            "text": "How come the US isn't regime changing Norway then? They hate state owned resources.",
            "title_similarity": "0.44270536",
            "sentiment_compound": -0.5719
        },
        {
            "id": "h63802f",
            "score": -1,
            "text": "I heard you like profitable funds... Have you heard of our Lord and Savior r/superstonk?",
            "title_similarity": "0.4464156",
            "sentiment_compound": 0.6597
        },
        {
            "id": "h63804e",
            "score": -1,
            "text": "County ? Country ? Just Norway ? How does that help anybody ? Seems like a bunch of selfish dick bags. They realize another country will just take it by force right?",
            "title_similarity": "0.48812136",
            "sentiment_compound": -0.4871
        },
        {
            "id": "h6381yh",
            "score": 1,
            "text": "Sounds like Norway needs a little freedom.",
            "title_similarity": "0.23696113",
            "sentiment_compound": 0.7512
        },
        {
            "id": "h638etn",
            "score": 1,
            "text": "Here in the US, our govt just prints money when we need it",
            "title_similarity": "0.39259094",
            "sentiment_compound": 0.0
        },
        {
            "id": "h638q9r",
            "score": 1,
            "text": "We blew through almost 7x that amount on covid relief in the US. None of us will ever be able to retire now due to the inflation it’s going to trigger.",
            "title_similarity": "0.66527814",
            "sentiment_compound": 0.4767
        },
        {
            "id": "h6395a3",
            "score": 1,
            "text": "Yes, this is for the PEOPLE, not for some perverted billionaires who already stole much from their workers",
            "title_similarity": "0.45686498",
            "sentiment_compound": 0.6757
        },
        {
            "id": "h63a6ex",
            "score": -1,
            "text": "Imagine what Iran could be if the us and uk didn’t loot from them",
            "title_similarity": "0.36407506",
            "sentiment_compound": 0.0
        },
        {
            "id": "h63b0lr",
            "score": -1,
            "text": "Another country full of white people making good plays",
            "title_similarity": "0.32997507",
            "sentiment_compound": 0.5994
        },
        {
            "id": "h63bbmq",
            "score": -1,
            "text": "Cries in Scottish",
            "title_similarity": "0.11366774",
            "sentiment_compound": -0.4019
        },
        {
            "id": "h63bwuw",
            "score": 1,
            "text": "Moving forward, they’d be even more profitable should they invest in the rock-solid growth of GameStop.",
            "title_similarity": "0.54011256",
            "sentiment_compound": 0.6997
        },
        {
            "id": "h63cqbi",
            "score": 1,
            "text": "Socialism /s",
            "title_similarity": "0.12770797",
            "sentiment_compound": 0.0
        },
        {
            "id": "h63d29w",
            "score": -1,
            "text": "We have family in Norway.  Norway, like most of Western Europe makes most countries the Americas (with the exception of Canada (with some big exceptions), Costa Rica and a few other smaller countries) look like a caveman circle jerk.\n\nPlease do not visit Norway, they have giant trolls who will devour you and your families and there is a mutant Covid-19 that makes your eyes and ears explode.  Just stay home and watch your Foxy TV.",
            "title_similarity": "0.53371716",
            "sentiment_compound": 0.5994
        },
        {
            "id": "h63d7xe",
            "score": -1,
            "text": "Meanwhile democrats b like “this is our third 1.3 trillion dollar bill this year”",
            "title_similarity": "0.7055097",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h63efbd",
            "score": -1,
            "text": "Do more research, at first they spent like drunken sailors, then realized… enter your post.",
            "title_similarity": "0.41320288",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h63eh4p",
            "score": 1,
            "text": "It's interesting isn't it? Movies portray Vikings as blood thirsty vengeful looters. Instead, they maintained hygiene, took bath, cleaned hair, wrote poetry and ruled nations. After all that they were wise enough to do the right thing. Scandinavian countries are the next level of civilization. They managed to mix socialism and capitalism the right way.",
            "title_similarity": "0.5609478",
            "sentiment_compound": 0.7003
        },
        {
            "id": "h63f51i",
            "score": -1,
            "text": "If only Scotland was able to do the same with our batch of oil from the north Sea but instead a certain southern government fucked us over",
            "title_similarity": "0.61767673",
            "sentiment_compound": -0.6652
        },
        {
            "id": "h63f76k",
            "score": -1,
            "text": "Thanks America for squashing the Germans in ww2",
            "title_similarity": "0.51067275",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h63fydq",
            "score": 1,
            "text": "Honest question is it as amazing as it sounds to live in the Scandinavian countries?",
            "title_similarity": "0.40301284",
            "sentiment_compound": 0.7964
        },
        {
            "id": "h63gfz2",
            "score": -1,
            "text": "That's nothing, not even two times the annual us military budget",
            "title_similarity": "0.4035865",
            "sentiment_compound": 0.0
        },
        {
            "id": "h63hadx",
            "score": -1,
            "text": "You have this same thing in Venezuela but they decided to do a coupe and implemented socialism that end up in hundreds of lies and the government and leaders got all the money and the ppl are so poor now",
            "title_similarity": "0.6143861",
            "sentiment_compound": -0.8803
        },
        {
            "id": "h63i4h5",
            "score": 1,
            "text": "This the part where Americans scream \"SOCIALSTS!!!!\" and/or \"COMMUNISTS!!!!\", generally used interchangeably.",
            "title_similarity": "0.23288745",
            "sentiment_compound": -0.5951
        },
        {
            "id": "h63j1br",
            "score": -1,
            "text": "This isn’t a good thing. It’s a tiny country of 6 million people holding 1% of the world’s traded assets. It makes 9% year on year which means it doubles in less than a decade. You pay into this thing, it should go away like all the hedge funds.",
            "title_similarity": "0.70765543",
            "sentiment_compound": 0.6908
        },
        {
            "id": "h63j661",
            "score": -1,
            "text": "I don’t get it. So they didn’t take the oil? How is that oil making money?",
            "title_similarity": "0.4182719",
            "sentiment_compound": 0.0
        },
        {
            "id": "h63llpd",
            "score": -1,
            "text": "So they will save the pollution until later. That is very nice of them.",
            "title_similarity": "0.293835",
            "sentiment_compound": 0.762
        },
        {
            "id": "h63me2x",
            "score": 1,
            "text": "Cries in Scottish",
            "title_similarity": "0.11366774",
            "sentiment_compound": -0.4019
        },
        {
            "id": "h63n2yw",
            "score": 1,
            "text": "The UK on the other hand chose to let it's politicians buy votes with it...(the revenue from north sea oil)",
            "title_similarity": "0.56619406",
            "sentiment_compound": 0.4939
        },
        {
            "id": "h63neq4",
            "score": 1,
            "text": "Australia tried this too. Murdoch, the USA, the CIA, the conservative party stopped it.",
            "title_similarity": "0.3574159",
            "sentiment_compound": 0.2023
        },
        {
            "id": "h63oqu4",
            "score": 1,
            "text": "*cries in Scottish*",
            "title_similarity": "0.1474011",
            "sentiment_compound": -0.4019
        },
        {
            "id": "h63ow56",
            "score": 1,
            "text": "Privatisation is the most stupid thing you can do with limited recources. Fr how can someone just own the stuff that has been in the ground for millions of years and make a profit of it, instead of the money being put to use on infrastructure, schools, etc.",
            "title_similarity": "0.6879853",
            "sentiment_compound": -0.4005
        },
        {
            "id": "h63p41h",
            "score": -1,
            "text": "still capitalism cringe",
            "title_similarity": "0.28404534",
            "sentiment_compound": 0.0
        },
        {
            "id": "h63qjsb",
            "score": 1,
            "text": "Cool, maybe they can use it to help fight climate change brought about by the burning of all that oil.",
            "title_similarity": "0.5232057",
            "sentiment_compound": 0.34
        },
        {
            "id": "h63r2ai",
            "score": 1,
            "text": "Meanwhile UK governments spent the windfall on tax cuts and handouts to get themselves reelected.\n\nThat money is all gone now.",
            "title_similarity": "0.6359868",
            "sentiment_compound": -0.296
        },
        {
            "id": "h63r65q",
            "score": 1,
            "text": "I am proud to be Norwegian :)",
            "title_similarity": "0.31596836",
            "sentiment_compound": 0.7269
        },
        {
            "id": "h63sb07",
            "score": 1,
            "text": "*cries in Scottish",
            "title_similarity": "0.15018605",
            "sentiment_compound": -0.4019
        },
        {
            "id": "h63sk38",
            "score": 1,
            "text": "Britain followed suit (thanks to Tony benn) but Thatcher sold it all to pay redundancy as she slashed through the UK government. It's almost like the right never have the best interest of the people at heart.",
            "title_similarity": "0.61696184",
            "sentiment_compound": 0.794
        },
        {
            "id": "h63sw60",
            "score": 1,
            "text": "Came to the comments hoping for more information, instead all I see is Americans and Canadians talking about themselves.",
            "title_similarity": "0.3899934",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h63t50i",
            "score": 1,
            "text": "Sounds like Norway needs some FREEDOM!",
            "title_similarity": "0.26950735",
            "sentiment_compound": 0.8283
        },
        {
            "id": "h63u525",
            "score": 1,
            "text": "Whereas in the UK, which had access to the same North Sea oil fields (the oil wasn't **in** Norway but offshore) was governed by Margaret Thatcher who, following an outdated and incorrect theory of macroeconomics, thought that the best thing to do was use the money to reduce taxes. Just as the sell-off of nationalised industries was used to keep taxes low.\n\nOnce the oil ran out and the nationalised industries had been sold off... we still had low taxes but nothing to make up the difference and that's why public services in the UK are in the horribly parlous state they are now. (Conservative 'austerity theory' since 2010 has only exacerbated what was already problematic.)",
            "title_similarity": "0.6889703",
            "sentiment_compound": -0.7876
        },
        {
            "id": "h63wjxv",
            "score": -1,
            "text": "lol wait til they find out that oil is actually renewable.",
            "title_similarity": "0.45528376",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h63wtrl",
            "score": -1,
            "text": "The exact same thing happened in Scotland about the same time but we ended up POORER. Funny that when you're governed by a parliament in England all the oil money disappears and London suddenly gets lots of new buildings. Strange. \nAlso some of our oil CANNOT be accessed as the UK dumps it's shitty old nuclear weapons on top of where it is (Clyde )\nWell done Norway for showing what a small independent nation can do if left alone to self govern. One day we will join you",
            "title_similarity": "0.66583043",
            "sentiment_compound": -0.9319
        },
        {
            "id": "h63zabo",
            "score": -1,
            "text": "So they invested the oil. OK. Is this now a fund full of oil or what did we learn today?",
            "title_similarity": "0.5518649",
            "sentiment_compound": 0.0
        },
        {
            "id": "h642t80",
            "score": 1,
            "text": "Remember when virtually any non white country did this and they instantly got a visit from the CIA? Nationalizing oil typically has that effect..",
            "title_similarity": "0.6153367",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6442h4",
            "score": 1,
            "text": "This is what socialism can look like and the benefits are clear.  Remember that when someone tries to argue it can't work.  \n\nIt doesn't always because people are flawed, but there are two options.  You can either try and hope for the best, or not try at all and have everything ripped off and sold for the bottom dollar and leave nothing for tomorrow.  There's really no difference in the outcomes between not trying at all and failing.  \n\nSo what is there to lose from attempting to make sure the rich don't rip us off?",
            "title_similarity": "0.5518619",
            "sentiment_compound": 0.8206
        },
        {
            "id": "h649dgh",
            "score": -1,
            "text": "Cool so my country can stop contributing to NATO then?",
            "title_similarity": "0.3551515",
            "sentiment_compound": 0.0258
        },
        {
            "id": "h649hqm",
            "score": 1,
            "text": "UK took a rather different path",
            "title_similarity": "0.008117847",
            "sentiment_compound": 0.0
        },
        {
            "id": "h64d9wf",
            "score": 1,
            "text": "Luckily for them, they were white enough not to need any “freedom” deliveries by the US or UK.",
            "title_similarity": "0.30790943",
            "sentiment_compound": 0.5106
        },
        {
            "id": "h64re21",
            "score": -1,
            "text": "The irony of redditors upvoting this post to r/all and still thinking Norway is an example of a successful country because of socialism",
            "title_similarity": "0.5799178",
            "sentiment_compound": 0.5574
        },
        {
            "id": "h64rrgv",
            "score": -1,
            "text": "**Alternative viewpoint:**\n\nTiny country composed of 5.3 million evil capitalists, strip their nation's oil resources (*evil capitalism*), using the technology and workforce of global oil corporations (*more evil capitalism*).\n\nThen they sell that oil on the international markets to the highest bidder (*more evil capitalism*).\n\nThat oil is then burnt or processed to produce billions of tons of climate change inducing CO2; (*more evil capitalism*) and or used to produce mountains of plastic and other petroleum goods — all contributing to more CO2 and destruction of the environment and oceans (*more evil capitalism*).\n\nThen, the resulting vast amount of money, is then loaned or invested via global banks and other financial institutions (*more evil capitalism*) with major corporations around the world (*more evil capitalism*); who then make vast profits by exploiting their workers (*more evil capitalism*).\n\nThese major corporations then use all sorts of legal and illegal schemes to avoid paying taxes (*more evil capitalism*), and avoid paying their exploited workers a fair wage (*more evil capitalism*).\n\nInstead, these evil capitalist global corporations pay vast share and profit dividends to their \"investors\" (*more evil capitalism*).\n\nThen some of these evil capitalist \"investors\" (all 5.3 million of them in Norway), use their \"profit\" to buy stuff (mainly shit that is not really necessary — *more evil capitalism*) on the international global markets (*more evil capitalism*).\n\ntl;dr: Evil capitalist Norwegians, enslave foreign workers to make stuff for them.",
            "title_similarity": "0.6478335",
            "sentiment_compound": -0.9985
        },
        {
            "id": "h64s8xc",
            "score": 1,
            "text": "$1.3 trillion could sustain America for mayyyybe a month or two. You’re adorable, Norway.",
            "title_similarity": "0.7594627",
            "sentiment_compound": 0.4939
        },
        {
            "id": "h64wzvy",
            "score": -1,
            "text": "I thought Reddit hated fossil fuels?",
            "title_similarity": "0.45167184",
            "sentiment_compound": -0.6369
        },
        {
            "id": "h651l7h",
            "score": 1,
            "text": "Compare that to the Brilliant Magaret Thatcher who decided to ditch industry based economy to services resulting in over 3 million unemployed - which she was happy to keep on welfare by using funds from North Sea Oil to pay that welfare bill. Scots are pissed because the English led parliament of Thatcher pissed away all the benefits. Yet stupidly English believe the Conservatives are masters economic management.",
            "title_similarity": "0.7145529",
            "sentiment_compound": -0.4019
        },
        {
            "id": "h658p0s",
            "score": -1,
            "text": "And boy were they excited to figure out that the earth is constantly making more oil and will likely not run out ... ever...",
            "title_similarity": "0.535631",
            "sentiment_compound": 0.34
        },
        {
            "id": "h66d2um",
            "score": 1,
            "text": "Norway doesn’t have the non-working, lazy, give it to me for free people like we have in the US. Nice job Norway!",
            "title_similarity": "0.4719696",
            "sentiment_compound": 0.75
        },
        {
            "id": "h6336ck",
            "score": 6,
            "text": "You should learn what Qaddafi was doing with Libyan oil money. Then he got killed for it and his country turned into a wasteland.",
            "title_similarity": "0.5116604",
            "sentiment_compound": -0.6705
        },
        {
            "id": "h63gvr9",
            "score": 7,
            "text": "1969 isn’t 40 years ago",
            "title_similarity": "0.24599499",
            "sentiment_compound": 0.0
        },
        {
            "id": "h62x04y",
            "score": 22,
            "text": "Do NOT let the neoliberal sub see this Margaret Thatcher fired those miners so they could learn to code",
            "title_similarity": "0.41318738",
            "sentiment_compound": -0.5574
        },
        {
            "id": "h632d9x",
            "score": 60,
            "text": "If anyone's interested [here's a brief video explaining the history of the Alaska Permanent Fund](https://www.youtube.com/watch?v=ePlAAf2b_Io). Which is what the Norwegian fund was based on",
            "title_similarity": "0.43000865",
            "sentiment_compound": 0.4019
        },
        {
            "id": "h62sbm1",
            "score": -2,
            "text": "[deleted]",
            "title_similarity": "-0.040149488"
        },
        {
            "id": "h62zb7l",
            "score": 2,
            "text": "Lol@Alberta.. \"responsible buddies\" are playing the victims now... clowns",
            "title_similarity": "0.3121384",
            "sentiment_compound": 0.2023
        },
        {
            "id": "h63447q",
            "score": 2,
            "text": "Its also funny how they kept their oil wealth, rather than being expected to let European companies have free reign over it.",
            "title_similarity": "0.46819016",
            "sentiment_compound": 0.8555
        },
        {
            "id": "h6398ul",
            "score": -2,
            "text": "Close to 1/20 of gdp of America lul nerds",
            "title_similarity": "0.5842525",
            "sentiment_compound": 0.0
        },
        {
            "id": "h63a5to",
            "score": 2,
            "text": "Or approximately one year of the American military budget.",
            "title_similarity": "0.47981778",
            "sentiment_compound": 0.0
        },
        {
            "id": "h63f3fa",
            "score": 2,
            "text": "This is a really stupid thing to do if you’re trying to make a handful of people insanely wealthy while the majority of your citizenry lives in squalor.",
            "title_similarity": "0.51649904",
            "sentiment_compound": -0.2944
        },
        {
            "id": "h63jcl1",
            "score": 2,
            "text": "The uk discovered some oil in their country too in the north sea like Norway but it squandered it.",
            "title_similarity": "0.6697793",
            "sentiment_compound": 0.1901
        },
        {
            "id": "h63q59d",
            "score": 2,
            "text": "Democratic socialism in action, hey!\n\nWho would have thought it was a good idea to invest the money into the country rather than a few oil executives pockets?",
            "title_similarity": "0.53257346",
            "sentiment_compound": 0.4926
        },
        {
            "id": "h63q87q",
            "score": 2,
            "text": "Norway holds more Apple and Microsoft shares than any other fund in the world.  Also, Norway is where the doomsday seed vault is.  Bill Gates is one of the keyholders of the Svalbard seed vault.",
            "title_similarity": "0.7061843",
            "sentiment_compound": -0.3818
        },
        {
            "id": "h63rtm3",
            "score": 2,
            "text": "The UK shared in that North Sea wealth; how is that sovereign wealth fund going?",
            "title_similarity": "0.5755912",
            "sentiment_compound": 0.8316
        },
        {
            "id": "h63vgfc",
            "score": 2,
            "text": "The Labor party when in govt in Australia tried to do this with the mining industry but idiots, the Murdoch press, “conservative” politicians, and the mining industry killed it.",
            "title_similarity": "0.54490525",
            "sentiment_compound": -0.7506
        },
        {
            "id": "h63x9du",
            "score": 2,
            "text": "And now they have an entire youth with trust funds who travel around and get paid 4k a month to attend university in someone else's country, creating people stuck in a bubble moreso than anyone else I've seen\n\nWhen im abroad studying it's always Norwegians who are insufferably unaware of others plights. Light dude not everyone was born into an oil kingdom",
            "title_similarity": "0.7405057",
            "sentiment_compound": 0.4019
        },
        {
            "id": "h64wvqt",
            "score": 2,
            "text": "[deleted]",
            "title_similarity": "-0.040149488"
        },
        {
            "id": "h650a4h",
            "score": 2,
            "text": "Ironically Alberta government advised them to do this and didn’t do it themselves.",
            "title_similarity": "0.32495883",
            "sentiment_compound": 0.0
        },
        {
            "id": "h650mlo",
            "score": 2,
            "text": "Lucky they're white or the US would have decided they need some freedom from their nationalized oil",
            "title_similarity": "0.5624167",
            "sentiment_compound": 0.7906
        },
        {
            "id": "h6540ns",
            "score": 2,
            "text": "Lol in Australia the Whitlam administration tried to do similar in the 1970’s by nationalising our mines.\n\nUSA didn’t like that and so Whitlam was overthrown in a CIA coup.",
            "title_similarity": "0.538815",
            "sentiment_compound": 0.6486
        },
        {
            "id": "h6357jv",
            "score": 210,
            "text": "Norway can thank an Iraqi man, [Farouk al-Kasim](https://www.ft.com/content/99680a04-92a0-11de-b63b-00144feabdc0), who had see what had happened to oil wealth in the middle east, for steering their oilfield development.",
            "title_similarity": "0.62843645",
            "sentiment_compound": 0.6908
        },
        {
            "id": "h635gza",
            "score": 21,
            "text": "They were lucky to have discovered liberal democracy before they discovered the oil; that made all the difference.",
            "title_similarity": "0.63845825",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h63k7et",
            "score": 3,
            "text": "I'm in Norway right now. People here are very wealthy. But the most surprising part is, they have a extremely high amount of electric cars here. Tesla's and other brands are literally everywhere",
            "title_similarity": "0.69307035",
            "sentiment_compound": 0.6106
        },
        {
            "id": "h63nlw8",
            "score": -3,
            "text": "This story is the epitome of white privilege. Any other \"brown\" country would have seen the US either meddle in its politics or just straight up invade.",
            "title_similarity": "0.49687386",
            "sentiment_compound": 0.5267
        },
        {
            "id": "h63o5za",
            "score": 4,
            "text": "How much money does it cost as stay at home father of 2, 18 and 13, for the last 18 years, and my wife who does inventory management for a PepsiCo production factory, to move out of the US and to Norway and still maintain the same standard of living? Also, have any of you even LOOKED at how hard it is to renounce US residency? I have. The US OWNS you, and will make you pay taxes, EVEN IF YOU RENOUNCE US CITIZENSHIP, because guess what? THEY OWN US.\n\nWe can't leave unless we cheat and steal, and they only ones allowed to do that, are the rich.",
            "title_similarity": "0.72900987",
            "sentiment_compound": -0.5848
        },
        {
            "id": "h63szyt",
            "score": 4,
            "text": "Or as Americans call it: socialism",
            "title_similarity": "0.26326856",
            "sentiment_compound": 0.0
        },
        {
            "id": "h64bbm2",
            "score": 3,
            "text": "Filthy Socialists, they should have subsidised a foreign company to take the oil and profits in exchange for a few jobs. Instead they got the jobs anyway, Free health, education and national wealth, sooo unfair. Why don't they let a few individuals steal it like everyone else?",
            "title_similarity": "0.56241935",
            "sentiment_compound": 0.6808
        },
        {
            "id": "h64jll3",
            "score": 2,
            "text": "Don't these idiots realize they can buy a 50 million dollar fighter jet that fires 1.5 million dollar missiles?",
            "title_similarity": "0.63231134",
            "sentiment_compound": 0.1531
        },
        {
            "id": "h6323xd",
            "score": 54,
            "text": "I believe it is big enough and Norway's population is small enough that it technically makes every Norwegian a millionaire in their currency.\n\nEDIT: 1.3 trillion USD -> 11.5 trillion NOK, with 5.4 million people you get 2.1 million NOK per Norwegian.",
            "title_similarity": "0.7392006",
            "sentiment_compound": 0.0
        },
        {
            "id": "h62u9vs",
            "score": -4,
            "text": "Until they have to buy oil……",
            "title_similarity": "0.38421145",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6302iw",
            "score": 5,
            "text": "Venezuela should've done the same.",
            "title_similarity": "0.16595133",
            "sentiment_compound": 0.0
        },
        {
            "id": "h636bvf",
            "score": 4,
            "text": "Canada tried a similar thing in the 60's/70's but through corruption and mismanagement it quickly became defunct.",
            "title_similarity": "0.5229979",
            "sentiment_compound": 0.0
        },
        {
            "id": "h63g7uv",
            "score": -3,
            "text": "Ha, that's all?  Gone and spent in 1 vote if they had our Dems in charge. Hell, they'd actually OWE $$",
            "title_similarity": "0.61324775",
            "sentiment_compound": -0.6808
        },
        {
            "id": "h641xub",
            "score": 5,
            "text": "Sucks for the 4 families that couldve been billionaires if they were more like americans.",
            "title_similarity": "0.6413449",
            "sentiment_compound": 0.0754
        },
        {
            "id": "h630uz2",
            "score": -6,
            "text": "Blood money.",
            "title_similarity": "0.14621024",
            "sentiment_compound": 0.0
        },
        {
            "id": "h636bhr",
            "score": -5,
            "text": "Americans always talk about Norway like it's some progressive Mecca. But their high standard of living is because they have enormous oil reserves, which they sold and invested in successful stocks, and then redistributed over only 5 million people.\n\nSimilarly, countries like the UK killed millions of people and stole a ton of wealth from places like India. Then they invested it in the country for several hundred years. Then they redistributed it over 66 million people (compared to the 1.36 billion people in India who they stole the wealth from in the first place). I mentioned India as an example, but many other colonized, enslaved, and genocided people around the world are in the same boat. It's no wonder that [Jamaica requested reparations last week.](https://www.reuters.com/world/africa/jamaica-plans-seek-reparations-britain-over-slavery-2021-07-12/)\n\nUltimately, there is a weird level of selfishness in Norway which uses enormous oil wealth to fund free healthcare for 5 million people, or the UK, which uses the proceeds of slavery and genocide to fund the NHS for the people of Britain. It's especially the case because there are massive restrictions on immigration so no one else can share in that pot. And to directly criticize most people on Reddit, it's why people in the richest country in the world (the US) demand a $15 minimum wage, when earning $15 an hour puts in you in the top 1% of humanity. Even though most American corporations make most of their revenue from foreign countries, Americans want to tax and redistribute their wealth exclusively to Americans while ignoring everyone else in the world. 50% of humanity lives on less than $3.25 a day. 10% of humans can't even afford a toilet. They have to poop in the street or fields. If you really care about building a better world, you'd tax yourself and billionaires and give to the billions of humans who are far poorer than you due to the violence of your ancestors (whose wealth you inherited), instead of taxing billionaires and giving to yourself.\n\nEdit: The figures I listed are already adjusted for cost of living. So 50% of humans live on the equivalent of $3.25/day in the US.",
            "title_similarity": "0.83082414",
            "sentiment_compound": 0.9456
        },
        {
            "id": "h62qwa0",
            "score": 627,
            "text": "The UKs soveriegn wealth fund after we discovered oil 40 years ago is at ... Ah.",
            "title_similarity": "0.7128915",
            "sentiment_compound": 0.4939
        },
        {
            "id": "h63gg1b",
            "score": 22,
            "text": "Small country with leaders at the time being turbo smart and pro people and country. A pattern to copy rather than critique.",
            "title_similarity": "0.40799424",
            "sentiment_compound": 0.4019
        },
        {
            "id": "h63para",
            "score": 20,
            "text": "Let’s not forget this key statement “Many companies are excluded by the fund on ethical grounds.” You don’t hear that often",
            "title_similarity": "0.52430344",
            "sentiment_compound": 0.3749
        },
        {
            "id": "h62pysy",
            "score": 1199,
            "text": "That's exactly how a developed country should behave",
            "title_similarity": "0.19230273",
            "sentiment_compound": 0.0
        },
        {
            "id": "h637g9s",
            "score": 8,
            "text": "*Alberta has left the chat*",
            "title_similarity": "0.05074407",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6331sm",
            "score": 101,
            "text": "If any of the dozens of people ITT complaining that the US doesn’t have anything like this wants to be pleasantly surprised. Look up the Texas wealth funds (Permanent School Fund and Permanent University Fund) that are worth over $100b and also control 8,500 km2 of oil fields in western Texas and fund public schools and universities. It’s not quite $1.3T, but it ain’t nothing.",
            "title_similarity": "0.73089194",
            "sentiment_compound": 0.6597
        },
        {
            "id": "h634m79",
            "score": 126,
            "text": "Norway is the successful counter example I give when people ask me what went wrong with Venezuela's oil fueled social spending ambitions.",
            "title_similarity": "0.6226201",
            "sentiment_compound": 0.1779
        },
        {
            "id": "h62ps1p",
            "score": -7,
            "text": "Which county though?",
            "title_similarity": "0.15890849",
            "sentiment_compound": 0.0
        },
        {
            "id": "h634joy",
            "score": 43,
            "text": "The book to read about it: Trillion Dollar Baby. Super interesting and easy to read.",
            "title_similarity": "0.4928565",
            "sentiment_compound": 0.8591
        },
        {
            "id": "h62yfu0",
            "score": 833,
            "text": "That's so sad. Thinking of the hardworking entrepreneurs who could be splitting that trillion between the two of them, had they not been so cruelly suppressed from their dreams 😔",
            "title_similarity": "0.5899276",
            "sentiment_compound": -0.7399
        },
        {
            "id": "h62tf1d",
            "score": 398,
            "text": "Here in Australia, we just let the mining companies do what they want, rip billions of dollars out of the ground every year and pay no tax in exchange for employing a few local workers.",
            "title_similarity": "0.6075857",
            "sentiment_compound": -0.3182
        },
        {
            "id": "h636vme",
            "score": 77,
            "text": "The Vikings always knew, you never plunder your own home",
            "title_similarity": "0.3888864",
            "sentiment_compound": 0.0
        },
        {
            "id": "h631z0u",
            "score": 316,
            "text": "This pisses me off.\n\nAs an Australian we've given away all of our resources to companies and individuals who were willing to stump up the initial investment money for pennies on the dollar.\n\nWe're one of the largest natural gas exporters in the world but you cannot buy natural gas in this country that is produced in this country for a fair price anymore. Why? \n\nBecause it sells for more OS. 25 years ago gas was practically free. Now it's unavailable and if you can get it the prices are astronomical.\n\nIron ore, our biggest export. But the economy and therefore the tax payer isn't benefiting. Gina Rinehart is. She's the one that makes all the money. The government takes home a hundred million and Gina takes a billion.\n\nOil rights are sold to Shell, BP, Ampol etc for royalties of a few cents per dollar of oil extracted. Then when the refineries have passed their shelf life the government is given the bill to dismantle them otherwise they are left to rot and pollute when the company running the individual refinery just pulls stumps and fucks off to the next score.\n\nOh and these multinationals as well as paying a tiny pittance (this relates to Norway) for the oil and gas they extract, don't pay any taxes on their earnings. \n\nWhen Norway put out tenders to develop their huge field Shell (I believe) wanted EIGHTY PERCENT OF REVENUE. \n\nNorway having been a fairly poor country up to and after WW2 knew what they were on to. They told Big Oil to suck eggs and that if they wanted *any* of the revenue, they'd have to stump up the cash and take like ten percent otherwise Norway would just nationalise the fields, borrow the money and keep the *entirety* of the oil proceeds themselves. Surprisingly oil companies did the maths and came up with the notion that something is better than nothing and took the deal. \n\nThat's how the Norges kept their money. They told Oil to go fuck itself. \n\nNot in Australia. We gave away the shop. And we'll never see that money again.",
            "title_similarity": "0.77566355",
            "sentiment_compound": -0.183
        },
        {
            "id": "h634jex",
            "score": 45,
            "text": "It says Walmart has been excluded for a long time because of breach of human and labor rights.",
            "title_similarity": "0.49095812",
            "sentiment_compound": -0.34
        },
        {
            "id": "h62l3sz",
            "score": 77,
            "text": "Ok, how does one invest in said fund ?",
            "title_similarity": "0.23225239",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6333a8",
            "score": 187,
            "text": "*Cries in Albertan*",
            "title_similarity": "0.15968326",
            "sentiment_compound": -0.4019
        },
        {
            "id": "h62r4b7",
            "score": 4795,
            "text": "Here in Canada, we had the National Energy Program started by Trudeau that nationalized Canadian oil.\n\nThe major oil companies used their political clout to get rid of it.\n\nAlberta specifically had the Heritage Trust Fund which was started before Norway started theirs. Our dirty politicians cleaned it out and left us on the hook to pay to clean up old wells their oil buddies left behind.\n\nAlberta lost potentially over a trillion dollars as a result. We could have been fat rich like Norway but we got screwed like the country rubes from There will be blood.",
            "title_similarity": "0.7250793",
            "sentiment_compound": 0.5023
        },
        {
            "id": "h63jcqu",
            "score": 227,
            "text": "Mind you, the revenue generated from this national fund has exceeded that of the oil and gas production since 2016. That is simply amazing.\nThere is also political consensus on a limit to how much can be pulled out of the fund on a yearly basis in order to protect the growth of the fund and interests of future generations. The concept is that this natural resource does not simply belong to the random generation that stumbled upon it, but should benefit also future and unborn generarions. \nThen compare with other oil rich nations where sovereigns and their families are competing in the who-has-the-most-expensive-yacht-competition... (Which brings to mind the joke about how you become a millionaire: First, start with a billion. Then buy a yacht...)",
            "title_similarity": "0.7580361",
            "sentiment_compound": 0.9592
        },
        {
            "id": "h634zny",
            "score": 370,
            "text": "North Dakota modeled our Legacy Fund after this. It’s been set up for a little over a decade and has generated $8.4 billion or so in savings.\n\nAnd of course special interest groups and the Legislature are already trying to tap into it. All we’ve spent it on so far is helping balance the state budget, with some additional spending coming on highways and critical infrastructure. \n\nThey estimate it could be in the $200 billion range by 2060 if it was just left alone.",
            "title_similarity": "0.81913674",
            "sentiment_compound": 0.5945
        },
        {
            "id": "h62xwhk",
            "score": 7642,
            "text": "Yeah I live in Canada, we discovered oil over a hundred years ago and have given almost all of the money to a few companies that aren’t based out of canada. We are run by morons.",
            "title_similarity": "0.73235863",
            "sentiment_compound": -0.0258
        },
        {
            "id": "h62nuxb",
            "score": 1890,
            "text": " Alaska’s permanent fund has a value of $80 billion",
            "title_similarity": "0.58034635",
            "sentiment_compound": 0.34
        },
        {
            "id": "h6373oc",
            "score": 7195,
            "text": "Laughing in Russian, we have it all - oil, gas, diamonds, gold, you name it, and by our Constitution it all belongs to the people of Russia while in reality it all belongs to oligarchy and Putin's friends",
            "title_similarity": "0.47954583",
            "sentiment_compound": 0.743
        },
        {
            "id": "h62w46m",
            "score": 13754,
            "text": "That was stupid they could have bought a gold plated lambo",
            "title_similarity": "0.44232327",
            "sentiment_compound": -0.5267
        },
        {
            "id": "h63aheg",
            "score": 4105,
            "text": "The real beauty of it is that they have no intention of blowing through it before dying. They are leaving a rich legacy and good foundation for next generations.",
            "title_similarity": "0.46298933",
            "sentiment_compound": 0.8442
        },
        {
            "id": "h62zslq",
            "score": 1,
            "text": "This explains why there were oil rigs in the EPCOT Norway attraction, Maelstrom. They converted it to Frozen, because real life Norway is too boring! lol!",
            "title_similarity": "0.5754228",
            "sentiment_compound": 0.6229
        },
        {
            "id": "h6300jv",
            "score": 1,
            "text": "Sustain which county?",
            "title_similarity": "0.18647464",
            "sentiment_compound": 0.0
        },
        {
            "id": "h631lf4",
            "score": 1,
            "text": "Someone just got recommend that Economic YouTube channel",
            "title_similarity": "0.40038705",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h631ml8",
            "score": 2,
            "text": "Lol Alberta you listening to this shit",
            "title_similarity": "0.11912194",
            "sentiment_compound": -0.3506
        },
        {
            "id": "h6327o9",
            "score": 1,
            "text": "Norway? No way!",
            "title_similarity": "0.13576639",
            "sentiment_compound": -0.3595
        },
        {
            "id": "h632iiz",
            "score": 1,
            "text": "Did i read this right?",
            "title_similarity": "0.010278448",
            "sentiment_compound": 0.0
        },
        {
            "id": "h632rwt",
            "score": 1,
            "text": "Alberta in tears.",
            "title_similarity": "0.09731428",
            "sentiment_compound": -0.2263
        },
        {
            "id": "h633bgw",
            "score": 2,
            "text": "Meanwhile in Malaysia… https://www.irishtimes.com/news/world/asia-pacific/1mdb-scandal-explained-a-tale-of-malaysia-s-missing-billions-1.4315604",
            "title_similarity": "0.43946546",
            "sentiment_compound": 0.0
        },
        {
            "id": "h633s3n",
            "score": 1,
            "text": "I wish my province of Alberta did this. But you know, greed and politics fucked it all up.",
            "title_similarity": "0.5001186",
            "sentiment_compound": -0.8689
        },
        {
            "id": "h634iti",
            "score": 1,
            "text": "Aaannd Australia had the same thing , but allowed an oligarchy to reap the rewards, the public got nothing",
            "title_similarity": "0.3416346",
            "sentiment_compound": 0.631
        },
        {
            "id": "h634nx1",
            "score": 1,
            "text": "The county? We're a country! \\*Angry non-american noises\\*",
            "title_similarity": "0.3263796",
            "sentiment_compound": -0.5562
        },
        {
            "id": "h634o3r",
            "score": 1,
            "text": "The whole County? That must be one hell of a mismanaged county.",
            "title_similarity": "0.39374632",
            "sentiment_compound": -0.6808
        },
        {
            "id": "h634sxz",
            "score": 1,
            "text": "The united states is the largest oil producer in the world and it drinks all of it. On the flip side texas is the state that uses the most renewable energy, selling all of of its oil. The sale of oil is almost entirely the backbone of the Texas government, Texas only has a sales and property tax (no income for persons or business).",
            "title_similarity": "0.71919394",
            "sentiment_compound": 0.6344
        },
        {
            "id": "h634xc0",
            "score": 1,
            "text": "meanwhile in Straya here take our resources at bargain rates you dictate!",
            "title_similarity": "0.23449601",
            "sentiment_compound": 0.2714
        },
        {
            "id": "h6354ca",
            "score": 4,
            "text": "Meanwhile in Australia..",
            "title_similarity": "0.005987851",
            "sentiment_compound": 0.0
        },
        {
            "id": "h635jgd",
            "score": 1,
            "text": "Meanwhile in Nauru 👀",
            "title_similarity": "0.0730993",
            "sentiment_compound": 0.0
        },
        {
            "id": "h635mq6",
            "score": 1,
            "text": "America would spend it on corporate welfare",
            "title_similarity": "0.48782617",
            "sentiment_compound": 0.0
        },
        {
            "id": "h635oxu",
            "score": 1,
            "text": "I want to hear something bad about Norway. I feel like they have government and politics figured out better than every other country from everything I read or hear, but it can't be all sunshine and rainbows.",
            "title_similarity": "0.5765866",
            "sentiment_compound": -0.4295
        },
        {
            "id": "h635vcl",
            "score": 1,
            "text": "God I wish I lived in a country that actually gave a shit about us.",
            "title_similarity": "0.38791278",
            "sentiment_compound": 0.0516
        },
        {
            "id": "h6362j3",
            "score": 2,
            "text": "Well, I filled all the stamps on my car wash card.",
            "title_similarity": "0.2453764",
            "sentiment_compound": 0.2732
        },
        {
            "id": "h63697u",
            "score": 1,
            "text": "Until we stop using oil",
            "title_similarity": "0.2127502",
            "sentiment_compound": -0.296
        },
        {
            "id": "h636bo7",
            "score": 1,
            "text": "[This](https://www.youtube.com/watch?v=hKGwGAHznFQ) video explains it and is very interesting regarding their economy as well.",
            "title_similarity": "0.41373932",
            "sentiment_compound": 0.624
        },
        {
            "id": "h636ezq",
            "score": 1,
            "text": "https://freakonomics.com/podcast/how-can-tiny-norway-afford-to-buy-so-many-teslas-a-new-freakonomics-radio-podcast/\n\nOne of the best Freakonomics podcasts I have ever heard, happened to be about this.",
            "title_similarity": "0.64432776",
            "sentiment_compound": 0.6369
        },
        {
            "id": "h636sit",
            "score": 1,
            "text": "People around the world need to rise up against the mega corporations, they are laughing in our face while they go to space. These people don’t own anything! We have allowed them to become this rich by not doing anything about their monopolizing of every industry. This is why nobody wants to work for these companies!",
            "title_similarity": "0.52637684",
            "sentiment_compound": 0.8193
        },
        {
            "id": "h636t6h",
            "score": 1,
            "text": "Wish Canada (Alberta) was smart enough to do that",
            "title_similarity": "0.37358212",
            "sentiment_compound": 0.6597
        },
        {
            "id": "h636tci",
            "score": 1,
            "text": "Meanwhile in Australia we have left this to the private sector who avoid taxes and pay a pittance foe the license to pull the resources out of the ground. Meaning, the moment the resources run out we will have nothing to show for it.",
            "title_similarity": "0.48650095",
            "sentiment_compound": -0.6705
        },
        {
            "id": "h636tfz",
            "score": 1,
            "text": "They should spend some of it on universal dental insurance.",
            "title_similarity": "0.2931763",
            "sentiment_compound": 0.0
        },
        {
            "id": "h637d19",
            "score": 1,
            "text": "wishctmalikedme",
            "title_similarity": "-0.0050305575",
            "sentiment_compound": 0.0
        },
        {
            "id": "h637h56",
            "score": 1,
            "text": "You know it's even more mind-blowing. If you live in a country that money is based off the Petro dollar. The country you are in can never really go green or cleaning up the environment when your money is backed by oil.",
            "title_similarity": "0.63932896",
            "sentiment_compound": 0.0258
        },
        {
            "id": "h637mdo",
            "score": 1,
            "text": "Hopefully my not so great country doesn’t send our trillion dollar military there to murder civilians to take it",
            "title_similarity": "0.5421997",
            "sentiment_compound": -0.7986
        },
        {
            "id": "h637mro",
            "score": 1,
            "text": "Meanwhile in the Middle East ...",
            "title_similarity": "0.10416718",
            "sentiment_compound": 0.0
        },
        {
            "id": "h637syx",
            "score": 1,
            "text": "Where is the county of Norway?",
            "title_similarity": "0.2845869",
            "sentiment_compound": 0.0
        },
        {
            "id": "h63844p",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "-0.075772576"
        },
        {
            "id": "h6385bv",
            "score": 1,
            "text": "I saw an article comparing Norway with Great Britain in how they both handled comparable oil wealth aaaaaaand no spoilers, but Britain didn’t look so hot. \n\nNow you also have a situation where other countries are always chasing the next quarter’s oil output/profit whereas Norway can choose to sell less oil if prices are weak or they have  environmental concerns. They almost certainly make more each year off their fund’s ROI than they do oil exports at this stage.",
            "title_similarity": "0.7964045",
            "sentiment_compound": 0.2169
        },
        {
            "id": "h6386pv",
            "score": 1,
            "text": "To bad the liberal party exist only to strip wealth from the country for its own (and it's friends) profit.",
            "title_similarity": "0.5291168",
            "sentiment_compound": 0.8126
        },
        {
            "id": "h6389gx",
            "score": 1,
            "text": "cries in australian",
            "title_similarity": "0.07386894",
            "sentiment_compound": -0.4019
        },
        {
            "id": "h638ajt",
            "score": 1,
            "text": "Who knew you didn’t have to just let Exxon have it?",
            "title_similarity": "0.31443432",
            "sentiment_compound": 0.0
        },
        {
            "id": "h638bad",
            "score": 2,
            "text": "I swear this gets posted every month",
            "title_similarity": "0.37502885",
            "sentiment_compound": -0.0516
        },
        {
            "id": "h638f3w",
            "score": 1,
            "text": "\"many years\"\n\nThank you; this was very informative.",
            "title_similarity": "0.37526196",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h638l89",
            "score": 1,
            "text": "Australia has a lot of resources but don’t do that just sell it cheap and tax their own citizens high prices for energy to use it.",
            "title_similarity": "0.5979504",
            "sentiment_compound": 0.3919
        },
        {
            "id": "h638ucq",
            "score": 1,
            "text": "Prospecting started in the mid 60s, and the first oil production in 1969, so it's closer to 50-55 years by now.",
            "title_similarity": "0.5876837",
            "sentiment_compound": 0.0
        },
        {
            "id": "h638ul8",
            "score": 1,
            "text": "The amazing thing is that it was an Iraqi national who set up Norway’s whole system of carefully managing its oil wealth for future generations. The Financial Tomes wrote a long piece about him in 2009: [“The Iraqi who saved Norway from oil”](https://www.google.com/amp/s/amp.ft.com/content/99680a04-92a0-11de-b63b-00144feabdc0)",
            "title_similarity": "0.776707",
            "sentiment_compound": 0.8834
        },
        {
            "id": "h638yb3",
            "score": 3,
            "text": "Not so fun fact: they based their model off the Canadian province of Alberta’s Heritage Fund. Albertan politicians wasted the entire thing.",
            "title_similarity": "0.5414203",
            "sentiment_compound": -0.7285
        },
        {
            "id": "h638zo9",
            "score": 1,
            "text": "Alberta Disliked that.",
            "title_similarity": "0.1169554",
            "sentiment_compound": -0.4019
        },
        {
            "id": "h63971d",
            "score": 1,
            "text": "*Cries in untaxed Australian ore*",
            "title_similarity": "0.18343931",
            "sentiment_compound": -0.4019
        },
        {
            "id": "h639a1w",
            "score": 1,
            "text": "Barstool Syria",
            "title_similarity": "0.11395262",
            "sentiment_compound": 0.0
        },
        {
            "id": "h639mdd",
            "score": 1,
            "text": "For all the people here saying, 'that's great but it can never happen in *my* country\"....\n\nYes it can. I imagine Norwegians may be wonderful people but they are not supermen and inherently superior to anyone else.\n\nDEMAND more of your politicians and if enough of you do so, things can get better. Things can ALWAYS get better. The best way to ensure things get worse is to give up and do nothing.",
            "title_similarity": "0.58914006",
            "sentiment_compound": 0.9814
        },
        {
            "id": "h639mdk",
            "score": 2,
            "text": "I don’t understand whats oil has to do with financial fund... could someone plz fill the blanks?\n\nEdit. Why downvoting for looking for education? This thread is literally the best place to ask this question. Or the expectation is everyone should just know it?",
            "title_similarity": "0.5126765",
            "sentiment_compound": 0.7219
        },
        {
            "id": "h639mmq",
            "score": 1,
            "text": "Australia had a chance to do this with our coal reserves. That ship has sailed now. Fuck!",
            "title_similarity": "0.52891946",
            "sentiment_compound": -0.4199
        },
        {
            "id": "h639nx8",
            "score": 1,
            "text": "That’s almost enough to fix the US infrastructure for one year.",
            "title_similarity": "0.6271775",
            "sentiment_compound": 0.0
        },
        {
            "id": "h639xka",
            "score": 1,
            "text": "Pbbb a trillion. We run a budget deficit that large every year in the US. Ugh",
            "title_similarity": "0.6651192",
            "sentiment_compound": -0.6705
        },
        {
            "id": "h63abjv",
            "score": 1,
            "text": "I thought Norway is a country, not a county.",
            "title_similarity": "0.32352382",
            "sentiment_compound": 0.0
        },
        {
            "id": "h63alwp",
            "score": 1,
            "text": "Equivalent to a lotto winner putting it all into stocks and bonds",
            "title_similarity": "0.54922974",
            "sentiment_compound": 0.5859
        },
        {
            "id": "h63aw9c",
            "score": 1,
            "text": "Wait so, did they harvest the oil? Or",
            "title_similarity": "0.32217607",
            "sentiment_compound": 0.0
        },
        {
            "id": "h63b6ob",
            "score": 1,
            "text": "But didn’t they actually mess it up the first time then learn from their mistake?",
            "title_similarity": "0.30129367",
            "sentiment_compound": -0.7469
        },
        {
            "id": "h63b6sj",
            "score": 2,
            "text": "This is the sort of things countries do when their citizens, both civilian and in government, really *do* love their country.",
            "title_similarity": "0.39281914",
            "sentiment_compound": 0.6682
        },
        {
            "id": "h63b7xf",
            "score": 1,
            "text": "But carbon man",
            "title_similarity": "0.21957524",
            "sentiment_compound": 0.0
        },
        {
            "id": "h63bage",
            "score": 1,
            "text": "[other profitable sovereign wealth funds](http://cdn.statcdn.com/Infographic/images/normal/24060.jpeg)",
            "title_similarity": "0.49126795",
            "sentiment_compound": 0.7269
        },
        {
            "id": "h63bifg",
            "score": 1,
            "text": "smarty pants norwegians",
            "title_similarity": "0.29938886",
            "sentiment_compound": 0.2732
        },
        {
            "id": "h63c2r8",
            "score": 1,
            "text": "Nice",
            "title_similarity": "-0.03543814",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h63c5tq",
            "score": 1,
            "text": "What did they do in Canada? They funded the government and bureaucracy and gave Albertans 0% sales tax…. The rest is history",
            "title_similarity": "0.6482324",
            "sentiment_compound": 0.0
        },
        {
            "id": "h63ceqr",
            "score": 1,
            "text": "Once upon a time in the promised land of Alberta. There was a king. His name was Ralph. Ralph had an abundance of oil and gas and people that knew how to extract it. When Ralph took the throne he had much debt. He knew the way to prosperity was to make sacrifices. Ralph made sacrifices. Ralph knew the resources were finite but the people would last. He made a fund for the prosperity of the people. The fund prospered. The people were happy. Ralph eliminated the debt and set the people up to prosper. Then sadly the king left and passed. His successors failed to live up to his legacy and now the people of Alberta are not so happy and prosperous...",
            "title_similarity": "0.73184735",
            "sentiment_compound": -0.6494
        },
        {
            "id": "h63cgfs",
            "score": 1,
            "text": "Nigeria are you listening?\nOf course not.",
            "title_similarity": "0.07488651",
            "sentiment_compound": 0.0
        },
        {
            "id": "h63cgw4",
            "score": 1,
            "text": "Can they give the model to the UN so we can help struggling nations (but also have our tentacles wrapped around their industries at the same time?)",
            "title_similarity": "0.45389733",
            "sentiment_compound": 0.0211
        },
        {
            "id": "h63ci1f",
            "score": 140,
            "text": "Fun fact: Norges bank is one of *the* largest stock lenders in the world.",
            "title_similarity": "0.66399026",
            "sentiment_compound": 0.5106
        },
        {
            "id": "h63ciop",
            "score": 1,
            "text": "Interestingly, they based their sovereign wealth fund on the one that Alberta set up for its oil wealth, except that Alberta pissed all theirs away.\n\nMeanwhile, the US, with the UK’s assent, overthrew the democratically elected government of Iran, for the sin of nationalising its own oil.",
            "title_similarity": "0.6552055",
            "sentiment_compound": 0.0772
        },
        {
            "id": "h63cn9g",
            "score": 1,
            "text": "Some plan for the future. Others just live for the moment, forever whinging and blaming others for their lack of foresight.",
            "title_similarity": "0.34446797",
            "sentiment_compound": -0.6705
        },
        {
            "id": "h63cpda",
            "score": 1,
            "text": "No way",
            "title_similarity": "-0.08865688",
            "sentiment_compound": -0.296
        },
        {
            "id": "h63d17h",
            "score": 1,
            "text": "Why do that when you could buy some sick fighter planes",
            "title_similarity": "0.4233327",
            "sentiment_compound": -0.4019
        },
        {
            "id": "h63d76r",
            "score": 1,
            "text": "They got the money by selling a product that ruins the planet\n\nNorway is ranked 5th in oil production per capita, behind Kuwait, Qatar, UAE, and Saudi Arabia. Not far behind UAE and Saudi, either.\n\nhttps://en.wikipedia.org/wiki/List_of_countries_by_oil_production\n\n-\n\nThey also consume large amounts of oil per capita, although that list is dominated by small island nations.",
            "title_similarity": "0.7719",
            "sentiment_compound": -0.4404
        },
        {
            "id": "h63dihc",
            "score": 1,
            "text": "It's amazing, fueling gentrification all over the world for their sustenance.",
            "title_similarity": "0.3684743",
            "sentiment_compound": 0.5859
        },
        {
            "id": "h63dqmn",
            "score": 3,
            "text": "Guess what Australia did with the money from it's mining boom?",
            "title_similarity": "0.55870795",
            "sentiment_compound": 0.0
        },
        {
            "id": "h63dxix",
            "score": 1,
            "text": "Why would they do that when 3 guys could’ve privatized it all with some friends?",
            "title_similarity": "0.4769681",
            "sentiment_compound": 0.4767
        },
        {
            "id": "h63enrl",
            "score": 1,
            "text": "The Norwegian state is, as far as I know, the single largest stakeholder of global stocks and shares. It owns around 1.5% of *all* stocks.",
            "title_similarity": "0.69203985",
            "sentiment_compound": 0.296
        },
        {
            "id": "h63enz4",
            "score": 1,
            "text": "Cries in Australian. \n\nOur Whitlam government planned (amongst other things) to nationalise our mining industry in the 1970s. The CIA overthrew it with help from a variety of cunts, including, of course, Rupert Murdoch. Trillions of dollars of wealth have left the country since, and we’ve got third world internet, intellectually gutted universities, and the worst vaccine rollout in the developed world.\n\nhttps://independentaustralia.net/politics/politics-display/john-pilger-the-forgotten-coup-against-the-most-loyal-ally,13968",
            "title_similarity": "0.69620395",
            "sentiment_compound": -0.5267
        },
        {
            "id": "h63ep5p",
            "score": 1,
            "text": "What is sovereign wealth?",
            "title_similarity": "0.24940854",
            "sentiment_compound": 0.4939
        },
        {
            "id": "h63eqlc",
            "score": 1,
            "text": "So do the Norwegians get to withdraw this money? Or what is it used for?",
            "title_similarity": "0.4550615",
            "sentiment_compound": 0.0
        },
        {
            "id": "h63etrm",
            "score": 1,
            "text": " Tt kook",
            "title_similarity": "0.024746908",
            "sentiment_compound": 0.0
        },
        {
            "id": "h63ew6d",
            "score": 1,
            "text": "In the US we have the OASDI trust funds which are worth about $2.9trillion now. The OASI fund is expected to be depleted in 2034, maybe sooner if inflation picks up. \n\nPart of the problem is that US politicians decided to raid the cooky jar and replace the assets with bonds which don't keep up with inflation. Which is the exact opposite of what the Norwegians did, they invested in productive assets. \n\nImagine what the OASDI funds could look like if it achieved a similar performance to the Norwegian fund at around 7.6%.",
            "title_similarity": "0.7810103",
            "sentiment_compound": 0.7506
        },
        {
            "id": "h63ew9l",
            "score": 1,
            "text": "[deleted]",
            "title_similarity": "-0.040149488"
        },
        {
            "id": "h63f02c",
            "score": 1,
            "text": "\"Venezuela is on line 2\"",
            "title_similarity": "0.13558373",
            "sentiment_compound": 0.0
        },
        {
            "id": "h63f36v",
            "score": 1,
            "text": "The dutch had the same situation with gas. We blew through all the moneys and the part where the gas was drilled is now having lots of earthquakes 🙈",
            "title_similarity": "0.5790825",
            "sentiment_compound": 0.0
        },
        {
            "id": "h63f7ev",
            "score": 1,
            "text": "Laughs in Petrobras.",
            "title_similarity": "0.07213666",
            "sentiment_compound": 0.4939
        },
        {
            "id": "h63f88b",
            "score": 1,
            "text": "Sometimes it really does feel like Norway is a county and not a country.",
            "title_similarity": "0.363552",
            "sentiment_compound": 0.4144
        },
        {
            "id": "h63f9q9",
            "score": 1,
            "text": "Should have bought doge coin.",
            "title_similarity": "0.2696771",
            "sentiment_compound": 0.0
        },
        {
            "id": "h63fbp6",
            "score": 1,
            "text": "Urr, but, like, socialism. Bad. Durr.",
            "title_similarity": "0.1986405",
            "sentiment_compound": -0.3612
        },
        {
            "id": "h63feem",
            "score": 1,
            "text": "This is why they are so rich.  Bc of oil.  Noted.",
            "title_similarity": "0.4833774",
            "sentiment_compound": 0.6825
        },
        {
            "id": "h63ffar",
            "score": 1,
            "text": "Meanwhile in Alberta.....",
            "title_similarity": "0.15530938",
            "sentiment_compound": 0.0
        },
        {
            "id": "h63fgbc",
            "score": 1,
            "text": "I’m pretty sure Texas found oil and hasn’t got there heads out of the ground since, this was 130 years ago. So many holes!",
            "title_similarity": "0.64459735",
            "sentiment_compound": 0.6996
        },
        {
            "id": "h63fh5z",
            "score": 1,
            "text": "Didn't they offer Sweden land for 50% of Volvo. Sweden said no then Norway found oil.",
            "title_similarity": "0.64923",
            "sentiment_compound": -0.296
        },
        {
            "id": "h63fika",
            "score": 1,
            "text": "Stönks",
            "title_similarity": "-0.0130207725",
            "sentiment_compound": 0.0
        },
        {
            "id": "h63fnj3",
            "score": 1,
            "text": "I wish so badly we had a nice fund like this in the US",
            "title_similarity": "0.4563971",
            "sentiment_compound": 0.4604
        },
        {
            "id": "h63fr9d",
            "score": 1,
            "text": "I see North Americans, Canadians, british and aussies whining. I salute you from Argentina, where we spent our resources in public football, we have over 30% inflation in last 10y (over 50% in last three), median salary is 200 dollars that you can't even buy legally, chronic deficit, 4 sovereign default in 20 years, biggest IMf loan, 45% poverty, etc",
            "title_similarity": "0.70953465",
            "sentiment_compound": -0.8018
        },
        {
            "id": "h63fvfe",
            "score": 1,
            "text": "Netherlands finds gas: cool we have more money to spend...\nI wish they would've done the same. Now we are heading to the final period of our gas here.",
            "title_similarity": "0.59372807",
            "sentiment_compound": 0.6124
        },
        {
            "id": "h63fy1t",
            "score": 6,
            "text": "Every year the Nordic countries have a top 10 happiness rate, I don't know why all countries don't adopt their ways that can.",
            "title_similarity": "0.7196306",
            "sentiment_compound": 0.597
        },
        {
            "id": "h63fydb",
            "score": 2,
            "text": "Singapore didn't have oil, but we created the 3rd largest combined sovereign wealth fund anyway.",
            "title_similarity": "0.61875224",
            "sentiment_compound": 0.7783
        },
        {
            "id": "h63g1xq",
            "score": 1,
            "text": "TIL government investing in climate change is good.",
            "title_similarity": "0.45388466",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h63g4ze",
            "score": 1,
            "text": "Awesome!",
            "title_similarity": "0.051808715",
            "sentiment_compound": 0.6588
        },
        {
            "id": "h63g6j8",
            "score": 2,
            "text": "Albuuuurta didn’t follow Norway’s path to success.",
            "title_similarity": "0.23495775",
            "sentiment_compound": 0.5719
        },
        {
            "id": "h63g7ar",
            "score": 1,
            "text": "It has a live feed so everyone can se exactly how much is in it: https://www.nbim.no/no/\nCurrently at 1 359 017 995 155 USD",
            "title_similarity": "0.38202432",
            "sentiment_compound": 0.0
        },
        {
            "id": "h63g9sp",
            "score": 3,
            "text": "Australia did the same, but instead our government folded to US pressure and let external interests drill the oil instead, almost tax free, leaving Aus with almost nothing.\nAnd now Norway is a paradise and Australia very much isn't.",
            "title_similarity": "0.5803852",
            "sentiment_compound": 0.8893
        },
        {
            "id": "h63ga03",
            "score": 1,
            "text": "Didn’t Dubai also do something similar to make a city for themselves ?",
            "title_similarity": "0.21547876",
            "sentiment_compound": 0.0
        },
        {
            "id": "h63gp8k",
            "score": 1,
            "text": "If stonks stay up",
            "title_similarity": "0.05173562",
            "sentiment_compound": 0.0
        },
        {
            "id": "h63gvyb",
            "score": 3,
            "text": "What does that mean, \"they invest in a fund\"?",
            "title_similarity": "0.26945987",
            "sentiment_compound": 0.0
        },
        {
            "id": "h63h1mp",
            "score": 2,
            "text": "Money from this fund benefits both the economy and citizens; not a bad plan…",
            "title_similarity": "0.3501258",
            "sentiment_compound": 0.6652
        },
        {
            "id": "h63h3fr",
            "score": 2,
            "text": "sigh,  imagine if every country actually did what they should, we would all be living in a utopia.",
            "title_similarity": "0.32551962",
            "sentiment_compound": 0.0258
        },
        {
            "id": "h63h4gx",
            "score": 2,
            "text": "You should read about the deal they offered Sweden.\n\nEssentially they offer Sweden half the oil fields in exchange for half of Volvo.",
            "title_similarity": "0.61146",
            "sentiment_compound": 0.0
        },
        {
            "id": "h63h5im",
            "score": 2,
            "text": "Imagine that, your country actually thinking into the future and preparing for it.\n\nMeanwhile in Australia, our governments are intent on digging up all our coal and iron and shipping it ASAP to appease rural communities, while not even committing to 0 emissions by 2050 in fear of upsetting the right wing of the party.",
            "title_similarity": "0.60571986",
            "sentiment_compound": -0.4063
        },
        {
            "id": "h63h9d3",
            "score": 1,
            "text": "By self sustain county you mean the county of Oslo? Where all the cunts live?",
            "title_similarity": "0.415393",
            "sentiment_compound": -0.644
        },
        {
            "id": "h63hbl8",
            "score": 2,
            "text": "> $1.3 trillion - enough to self sustain the country for many years.\n\nUnited States: \"Hold my budget.\"",
            "title_similarity": "0.7372296",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h63hc3v",
            "score": 2,
            "text": "Canada sold their oil to America then blames Trudeau for it",
            "title_similarity": "0.5560752",
            "sentiment_compound": -0.4019
        },
        {
            "id": "h63hetd",
            "score": 2,
            "text": "If America or any big players needed it bad enough they would freedom and democracy it out of them.",
            "title_similarity": "0.4350288",
            "sentiment_compound": 0.1779
        },
        {
            "id": "h63hhv1",
            "score": 2,
            "text": "Hold my beer... Australia let's them take all the resources, buys it back at a higher premium than other countries and gives them billions just for being around.\n\nFkn sux here.",
            "title_similarity": "0.6758565",
            "sentiment_compound": -0.3612
        },
        {
            "id": "h63hm2q",
            "score": 2,
            "text": "This is the way every country/institution should function, with a long term vision. Sadly, if this were done today, in most cases a pack of wolves would descend to plunder the resources and give most of the wealth to billionaires to build their ego rockets",
            "title_similarity": "0.6548398",
            "sentiment_compound": 0.3947
        },
        {
            "id": "h63hwed",
            "score": 1,
            "text": "Sometimes I wonder, did they travel in time to see what oil could do.\nAnd what were other countries doing when they were taking such decisions",
            "title_similarity": "0.38419986",
            "sentiment_compound": 0.0
        },
        {
            "id": "h63i60e",
            "score": 1,
            "text": "And the best part is the numbers just keep rising!",
            "title_similarity": "0.28421086",
            "sentiment_compound": 0.6696
        },
        {
            "id": "h63iayj",
            "score": 1,
            "text": "Norwegia has counties?",
            "title_similarity": "0.28010106",
            "sentiment_compound": 0.0
        },
        {
            "id": "h63ic3x",
            "score": 2,
            "text": "Great. If \"money\" would be worth anything in a global collapse. I'd rather have oil.",
            "title_similarity": "0.6196029",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h63ics3",
            "score": 2,
            "text": "And yet they love to tell developing tropical nations how much more they could do on climate.",
            "title_similarity": "0.41324234",
            "sentiment_compound": 0.6369
        },
        {
            "id": "h63ik1c",
            "score": 2,
            "text": "Norge ftw!",
            "title_similarity": "0.050878737",
            "sentiment_compound": 0.5093
        },
        {
            "id": "h63ipvn",
            "score": 1,
            "text": "! I am always giving this spiel but no one listens.\n-Calgary Alberta",
            "title_similarity": "0.34220862",
            "sentiment_compound": -0.3382
        },
        {
            "id": "h63iqxj",
            "score": 2,
            "text": "Meanwhile the Stories made sure there donors did very well out of the North Sea Oil.",
            "title_similarity": "0.60883963",
            "sentiment_compound": 0.5709
        },
        {
            "id": "h63j5yv",
            "score": 1,
            "text": "Meanwhile, in Alberta...",
            "title_similarity": "0.16697125",
            "sentiment_compound": 0.0
        },
        {
            "id": "h63j8k7",
            "score": 2,
            "text": "This is what a good contry do.\n\nIn France that could never happen",
            "title_similarity": "0.2805113",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h63ja4j",
            "score": 2,
            "text": "That sounds like the type of decisions I expected of government when I was young and naive. Wish i lived under a government that was able to look ahead and prepare for the future",
            "title_similarity": "0.4473521",
            "sentiment_compound": 0.4767
        },
        {
            "id": "h63jsps",
            "score": 2,
            "text": "Enough to self sustain the country for years. Knowong the fund will eventually run out they invested in... \n\nI mean, what will be their next plan?",
            "title_similarity": "0.69544125",
            "sentiment_compound": 0.0
        },
        {
            "id": "h63jxjb",
            "score": 1,
            "text": "The Norwegian Sovereign Wealth fund is something I find so fascinating, but the fundamental thesis is simple - this resource is valuable, but finite, and we need to let time be our ally, not our enemy.\n\nThis is why I strongly encourage people who get into OnlyFans or other types of work like that and have fast success invest that money. We've got young creators making $400,000 streaming on Twitch or doing OnlyFans stuff, if they do it right they could retire millionaires just by investing that money and never touching it.",
            "title_similarity": "0.7651832",
            "sentiment_compound": 0.98
        },
        {
            "id": "h63jzoc",
            "score": 1,
            "text": "Bigggg brain",
            "title_similarity": "0.17407091",
            "sentiment_compound": 0.0
        },
        {
            "id": "h63k22i",
            "score": 2,
            "text": "[deleted]",
            "title_similarity": "-0.040149488"
        },
        {
            "id": "h63k4c5",
            "score": 2,
            "text": "248k per citizen... Imagine if they nationalized their oil industry..",
            "title_similarity": "0.6938212",
            "sentiment_compound": 0.0
        },
        {
            "id": "h63kczl",
            "score": 2,
            "text": "In case you've ever wondered if nationalising resources works",
            "title_similarity": "0.33317256",
            "sentiment_compound": 0.0
        },
        {
            "id": "h63knta",
            "score": 1,
            "text": "Should have bought Bitcoin.losers.",
            "title_similarity": "0.3462901",
            "sentiment_compound": 0.0
        },
        {
            "id": "h63ksj3",
            "score": 2,
            "text": "Correction: the Norwegian sovereign wealth fund is the most valuable wealth fund in the world by assets.\n\nhttps://www.statista.com/statistics/276617/sovereign-wealth-funds-worldwide-based-on-assets-under-management/",
            "title_similarity": "0.7452761",
            "sentiment_compound": 0.895
        },
        {
            "id": "h63ktaj",
            "score": 1,
            "text": "So silly ?\nCoulda went to space",
            "title_similarity": "0.22067407",
            "sentiment_compound": 0.101
        },
        {
            "id": "h63kxrn",
            "score": 2,
            "text": "Aussie here - we gave ours to the billionaires and pollies who will get sweet jobs after their term.",
            "title_similarity": "0.59678185",
            "sentiment_compound": 0.4588
        },
        {
            "id": "h63l0k8",
            "score": 2,
            "text": "Right after Soviet Union collapse it was a privatization campaign in Russia- whole value of the companies to be privatized was estimated as 1400 billions of Rubles and every citizen was eligible to receive so called voucher with nominal 10000 rubles. The currency of this value after inflation and reform called denomination (once it was divided by 1000 due to inflation so high that numbers became in millions if someone wanted to buy a TV) now it’s worth ~0,12 EUR. And since it was quite new for general folk. The idea was generally good but the results- controversial. Lots of people have just exchanged those vouchers for food/cash, some “invested into private equity funds” (mostly scam). Even those who wanted to do proper investments faced different rules of the game. In one region it was possible to buy shares of the company which is now ~12 thousands euro worth and in the other - 1 thousand euro worth in current rates. So general opinion of people- it was a disaster. But given that face of that campaign still holds some lucrative official office the results were quite good for the “right” people.",
            "title_similarity": "0.7513256",
            "sentiment_compound": -0.0607
        },
        {
            "id": "h63l75g",
            "score": 2,
            "text": "Cries in Australian mining industry",
            "title_similarity": "0.3309568",
            "sentiment_compound": -0.4019
        },
        {
            "id": "h63lbxx",
            "score": 1,
            "text": "Ah yes, brunost",
            "title_similarity": "0.0034086108",
            "sentiment_compound": 0.4019
        },
        {
            "id": "h63ld3e",
            "score": 2,
            "text": "Serious question, what is the plan for the fund? It's a bunch of money which is all good and what not, but is there a plan to use it to benefit the country, or its a wait until oil runs out then decide?",
            "title_similarity": "0.6542792",
            "sentiment_compound": 0.7319
        },
        {
            "id": "h63ld3q",
            "score": 5,
            "text": "Fun fact: Norway learned this by looking at The Netherlands, who did the exact opposite, after natural gas was found. That was such a bad move, that is now well known in economic studies as “the Dutch disease”.",
            "title_similarity": "0.57714385",
            "sentiment_compound": 0.5267
        },
        {
            "id": "h63lfcx",
            "score": 2,
            "text": "What dumb dumbs, hadn't they heard about trickle down economics?",
            "title_similarity": "0.366474",
            "sentiment_compound": -0.7003
        },
        {
            "id": "h63lncq",
            "score": 2,
            "text": "*cries in Dutch*",
            "title_similarity": "0.088746116",
            "sentiment_compound": -0.4019
        },
        {
            "id": "h63lqwf",
            "score": 1,
            "text": "Why didnt they just buy jacked up trucks and large campers - Alberta",
            "title_similarity": "0.5006492",
            "sentiment_compound": 0.0
        },
        {
            "id": "h63lr3j",
            "score": 1,
            "text": "This story gets even more interesting if you read about [Farouk al-Kasim](https://www.ft.com/content/99680a04-92a0-11de-b63b-00144feabdc0).",
            "title_similarity": "0.3894776",
            "sentiment_compound": 0.4576
        },
        {
            "id": "h63lti2",
            "score": 2,
            "text": "It’s nice that they could do that and not be pillaged but foreign powers. Not that other countries benefit from destabilizing these hypothetical countries and calling it a resource curse.",
            "title_similarity": "0.3771322",
            "sentiment_compound": 0.0387
        },
        {
            "id": "h63lxe8",
            "score": 1,
            "text": "Too bad inflation exists.",
            "title_similarity": "0.27818564",
            "sentiment_compound": -0.5423
        },
        {
            "id": "h63mvzl",
            "score": 1,
            "text": "Australia should have done the same damage thing. But no, lining the pockets of a few fuckwits is more important.",
            "title_similarity": "0.38098735",
            "sentiment_compound": 0.138
        },
        {
            "id": "h63n0zo",
            "score": 2,
            "text": "Compare to what the UK did with their half of that same oil field!",
            "title_similarity": "0.5327183",
            "sentiment_compound": 0.0
        },
        {
            "id": "h63n1di",
            "score": 1,
            "text": "...Alberta on the other hand...",
            "title_similarity": "0.11705908",
            "sentiment_compound": 0.4939
        },
        {
            "id": "h63n1ha",
            "score": 1,
            "text": "big brain time",
            "title_similarity": "0.2488747",
            "sentiment_compound": 0.0
        },
        {
            "id": "h63n3fq",
            "score": 2,
            "text": "In Aus they sell it off to the lowest bidder and get charged to use our own oil.",
            "title_similarity": "0.59573996",
            "sentiment_compound": -0.5267
        },
        {
            "id": "h63najc",
            "score": 2,
            "text": "Ok cool, can we invest now?",
            "title_similarity": "0.15244386",
            "sentiment_compound": 0.5423
        },
        {
            "id": "h63nlnc",
            "score": 1,
            "text": "Just 40 years? I thought Norway was rich from oil for like forever.",
            "title_similarity": "0.8095881",
            "sentiment_compound": 0.7269
        },
        {
            "id": "h63npf8",
            "score": 2,
            "text": "It was the right thing to do.\n\nYes it led to inflation (if I remember right, a beer costs around $15-20).  Yes it led to inflation in neighboring countries.\n\nCheck the benefits though.  \n\nNeed a new road?  No problem!\nWant maternity leave? You got it!\n\nHell, the last time I was there it seemed like nobody actually had to work the entire month of August!\n\nStick that on top of being probably the most beautiful country in the northern hemisphere…. Not a bad place to be!",
            "title_similarity": "0.7560725",
            "sentiment_compound": 0.9442
        },
        {
            "id": "h63npi1",
            "score": 2,
            "text": "As an Albertan, I'm so jealous",
            "title_similarity": "0.28022763",
            "sentiment_compound": -0.5949
        },
        {
            "id": "h63nu4q",
            "score": 1,
            "text": "What good is this fund if they never spend it?",
            "title_similarity": "0.35107917",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h63nw2f",
            "score": 2,
            "text": "So... inherit immense wealth, then don't blow it on cocaine and hookers. Got it.",
            "title_similarity": "0.54258007",
            "sentiment_compound": 0.4939
        },
        {
            "id": "h63o0jk",
            "score": 2,
            "text": "It’s also not allowed to invest in fossil fuels. Furthermore, Norway is already offering its empty oil fields for CO2 storage. Since the fields kept the oil there for millions of years, chances are CO2 will stay there as well. \n\nIt’s actually quite genius - dig carbon out, burn it, capture it, put it back in the ground. And CO2 capturing should be at least partially possible in industrial plants. Not so much in cars but it’s better than nothing.",
            "title_similarity": "0.7370111",
            "sentiment_compound": 0.6597
        },
        {
            "id": "h63o2o1",
            "score": 1,
            "text": "Yup, basically every oil-rich country has done the exact same. Nothing interesting or clever about it,",
            "title_similarity": "0.46417576",
            "sentiment_compound": -0.5773
        },
        {
            "id": "h63o68r",
            "score": 1,
            "text": "Yeah, you know why they did this? Because they saw the Dutch fuck up. That was literally the reason for inspiration they gave...autch.",
            "title_similarity": "0.34170485",
            "sentiment_compound": 0.2732
        },
        {
            "id": "h63o6gg",
            "score": 1,
            "text": "Heia Norge! Vi er det beste landet å bo i!😎🇳🇴🇳🇴🇳🇴🇳🇴",
            "title_similarity": "0.22752155",
            "sentiment_compound": 0.555
        },
        {
            "id": "h63ol6b",
            "score": 1,
            "text": "Meanwhile in Germany ... Our countries head of finance advises everyone to store their money on bank accounts since funds and stocks are not good for the common person.",
            "title_similarity": "0.4799303",
            "sentiment_compound": -0.3412
        },
        {
            "id": "h63omff",
            "score": 1,
            "text": "This is what happens when your leadership isn’t corrupt as all hell and actually puts the best interest of the country ahead of their personal profits.",
            "title_similarity": "0.55495876",
            "sentiment_compound": 0.6705
        },
        {
            "id": "h63otki",
            "score": 2,
            "text": "It doesn’t hurt that there is only 6 million citizens to share the wealth around with. Probably makes a big difference.",
            "title_similarity": "0.5843296",
            "sentiment_compound": 0.25
        },
        {
            "id": "h63pdsx",
            "score": 2,
            "text": "Stonk",
            "title_similarity": "-0.017675802",
            "sentiment_compound": 0.0
        },
        {
            "id": "h63pigp",
            "score": 4,
            "text": "Selling ammo is also pretty profitable for us",
            "title_similarity": "0.44261816",
            "sentiment_compound": 0.7269
        },
        {
            "id": "h63ps4b",
            "score": 2,
            "text": "You can watch it live here: https://www.nbim.no/",
            "title_similarity": "0.08346577",
            "sentiment_compound": 0.0
        },
        {
            "id": "h63pysf",
            "score": 3,
            "text": "*Cries in Canadian* recently learned that most Canadian oil titles are held by foreign groups",
            "title_similarity": "0.47727352",
            "sentiment_compound": -0.4019
        },
        {
            "id": "h63q78u",
            "score": 2,
            "text": "Imagine the kind of place the middle east could have been if Saudi Arabia and Iraq had done this.",
            "title_similarity": "0.35057962",
            "sentiment_compound": 0.0
        },
        {
            "id": "h63q9um",
            "score": 2,
            "text": "I remember looking this up and it turns out that they have not one, but two such funds.  One is for domestic and Scandinavian countries and one is gor global companies so that if everything goes to shit elsewhere in the world they won't be affected too much\n\nScotland's oil wealth went to furnish London :(",
            "title_similarity": "0.688361",
            "sentiment_compound": -0.5837
        },
        {
            "id": "h63qa04",
            "score": 5,
            "text": "Imagine investing in the future… what’s that like?\n\n- a US citizen",
            "title_similarity": "0.3957596",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h63qd6r",
            "score": 1,
            "text": "what’s a sovereign wealth fund?",
            "title_similarity": "0.33260858",
            "sentiment_compound": 0.4939
        },
        {
            "id": "h63qmjx",
            "score": 4,
            "text": "Ireland found billions of barrels off oil off our West coast, politicians decided to give it all to the British government... This is the same government that went to the EU courts to NOT RECEIVE A €28 BILLION tax bill from Apple.",
            "title_similarity": "0.74743545",
            "sentiment_compound": 0.0
        },
        {
            "id": "h63qn4i",
            "score": 1,
            "text": "County or country?",
            "title_similarity": "0.1413442",
            "sentiment_compound": 0.0
        },
        {
            "id": "h63r2rb",
            "score": 1,
            "text": "Don’t let facts get in the way of a good post title",
            "title_similarity": "0.12437914",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h63r33b",
            "score": 2,
            "text": "Wow. A country that can make plans beyond the immidiate future. Wish the US was like that. Our politicians barely make plans past our 4 year election cycles.",
            "title_similarity": "0.70293534",
            "sentiment_compound": 0.8402
        },
        {
            "id": "h63r6i5",
            "score": 6,
            "text": "I actually did a study of this not too long ago, and one of the major concerns of Norway is their reliance on their oil fund. They are trying to push their economy away from it's two larger sources - oil and fishing - and into more manufacturing and information services.",
            "title_similarity": "0.7565802",
            "sentiment_compound": 0.0
        },
        {
            "id": "h63re3d",
            "score": 2,
            "text": "What a shame, they could have produced some real value for shareholder /s",
            "title_similarity": "0.37888646",
            "sentiment_compound": -0.1779
        },
        {
            "id": "h63rgju",
            "score": 2,
            "text": "Also interesting, they are not allowed to invest the fund in any Norwegian domestic company.  \n\nThis way the fund doesn't rely on the success (or failure) of the Norwegian economy. \n\nThey also aren't allowed to invest the fund into a certain companies that follow bad labor practices,  etc.  No walmart, cigarette companies, etc.",
            "title_similarity": "0.4342217",
            "sentiment_compound": -0.128
        },
        {
            "id": "h63rke4",
            "score": 1,
            "text": "And about 250-500 billion NOK (28-56 billion USD) has been taken out of the oil fund to support Norwegian residents and businesses since corona began",
            "title_similarity": "0.77202356",
            "sentiment_compound": 0.4019
        },
        {
            "id": "h63ryrk",
            "score": 3,
            "text": "If only more governments had this much forward thinking for the prosperity of their country",
            "title_similarity": "0.4775826",
            "sentiment_compound": 0.0
        },
        {
            "id": "h63s7li",
            "score": 2,
            "text": "It currently sits at $1.36 trillion. It passed 12 trillion Norwegian Kroner a few days ago for the first time, and you can see the real time value here: https://www.nbim.no/en/",
            "title_similarity": "0.7208847",
            "sentiment_compound": 0.34
        },
        {
            "id": "h63so1p",
            "score": 1,
            "text": "Isn't this what Venezuela tried to do before oil dropped?",
            "title_similarity": "0.37597573",
            "sentiment_compound": 0.0
        },
        {
            "id": "h63szid",
            "score": 1,
            "text": "Could'a bought some nice big bombs with that",
            "title_similarity": "0.46322054",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h63t05x",
            "score": 1,
            "text": "If that was Ireland they would've sold the mining rights of the oil to a corporation for €800k and a handful of brown envelopes with €20k in each.",
            "title_similarity": "0.7671435",
            "sentiment_compound": 0.0
        },
        {
            "id": "h63t1uu",
            "score": 1,
            "text": "If someone could explain what's sovereign wealth fund is ?",
            "title_similarity": "0.32529187",
            "sentiment_compound": 0.4939
        },
        {
            "id": "h63t5kt",
            "score": 1,
            "text": "Yeah I know.",
            "title_similarity": "-0.09905832",
            "sentiment_compound": 0.296
        },
        {
            "id": "h63texa",
            "score": 2,
            "text": "Fuck me Norway is great",
            "title_similarity": "0.3657316",
            "sentiment_compound": 0.1531
        },
        {
            "id": "h63tkkg",
            "score": 1,
            "text": "Basically the opposite of Venezuela. When they found their oil they just made it rain and threw money around like there was no tomorrow.",
            "title_similarity": "0.5532776",
            "sentiment_compound": 0.0772
        },
        {
            "id": "h63tsyn",
            "score": 1,
            "text": "Their number two got released after investigations found he have a Chinese wife who lives in China and he’s supporting her financially… really odd piece of news",
            "title_similarity": "0.5673358",
            "sentiment_compound": 0.1548
        },
        {
            "id": "h63tyo0",
            "score": 1,
            "text": "How does a country turn its own resource into a sovereign wealth fund? ELI5?",
            "title_similarity": "0.43797463",
            "sentiment_compound": 0.5514
        },
        {
            "id": "h63ugl8",
            "score": 1,
            "text": "Cries in UK.",
            "title_similarity": "0.14742148",
            "sentiment_compound": -0.4019
        },
        {
            "id": "h63ugzx",
            "score": 1,
            "text": "So was Norway the only country that basically didn't have a pandemic because they have a sovereign fund for their people asking for someone in Norway?",
            "title_similarity": "0.63956887",
            "sentiment_compound": 0.0
        },
        {
            "id": "h63ukx2",
            "score": 1,
            "text": "Australia could have done this with our iron ore resources.",
            "title_similarity": "0.45714933",
            "sentiment_compound": 0.0
        },
        {
            "id": "h63urk4",
            "score": 1,
            "text": "Scotland discovered oil a bit before that and the British government just spunked the money on utter shite",
            "title_similarity": "0.66773546",
            "sentiment_compound": 0.0
        },
        {
            "id": "h63us2q",
            "score": 1,
            "text": "Sigma Norway grindset",
            "title_similarity": "0.3232491",
            "sentiment_compound": 0.0
        },
        {
            "id": "h63veuh",
            "score": 1,
            "text": "And yet they call themselves one of the most “green” countries. Spill oil to rest.",
            "title_similarity": "0.5557093",
            "sentiment_compound": 0.0
        },
        {
            "id": "h63vkac",
            "score": 4,
            "text": "At one point (early on) Sweden declined to trade a portion of Volvo for a portion of the total of Norway's newfound oil (before they knew how much there was). Needless to say, as a Swede, I'm still disappointed in my former leaders \"wise\" decision.",
            "title_similarity": "0.64362276",
            "sentiment_compound": 0.0
        },
        {
            "id": "h63vmci",
            "score": 1,
            "text": "Put it all on red ! Pussies.",
            "title_similarity": "0.12062572",
            "sentiment_compound": 0.0
        },
        {
            "id": "h63vt8x",
            "score": 1,
            "text": "\"I INVEST AND SHARE OUR MILKSHAKE!\"",
            "title_similarity": "0.30998534",
            "sentiment_compound": 0.3595
        },
        {
            "id": "h63vvk1",
            "score": 2,
            "text": "https://www.ft.com/content/99680a04-92a0-11de-b63b-00144feabdc0\n\nNorway can thank this guy a lot for it, a top oil exec just happen to wander into their office right as they started examening oil fields.\n\nHe also pushed heavily for the Norwegian state to be involved.",
            "title_similarity": "0.7066189",
            "sentiment_compound": 0.5106
        },
        {
            "id": "h63w2ol",
            "score": 1,
            "text": "[The way the fund is managed](https://www.nbim.no/en/publications/reports/) is mind-blowing because they invest the way any individual is supposed to do (70% FTSE Globall all cap and 30% in (mostly governement) bunds)and the annual reports are one of my favourite one in global economics/finance.",
            "title_similarity": "0.7338797",
            "sentiment_compound": 0.0
        },
        {
            "id": "h63w8pm",
            "score": 1,
            "text": "You probably should have mentioned the 71% excise they have on oil extraction to make it happen.",
            "title_similarity": "0.65029883",
            "sentiment_compound": 0.0
        },
        {
            "id": "h63wdsh",
            "score": 1,
            "text": "Mostly correct but it was 60 years ago, not 40",
            "title_similarity": "0.28976065",
            "sentiment_compound": 0.0
        },
        {
            "id": "h63wim4",
            "score": 1,
            "text": "Wild what can happen when the people running your country are actually interested in running your country",
            "title_similarity": "0.38500658",
            "sentiment_compound": 0.4019
        },
        {
            "id": "h63wk7l",
            "score": 1,
            "text": "Went on a trip of the EU institutions with my EU law class from Ireland. This was in 2012, so we in Ireland were still coming to grips with the global recession, which hit Ireland quite badly. The sense of self-satisfaction amongst an equally sized group of Norwegian students that were also visiting the institutions that same day was palpable. Even the speaker (who was Belgian) had to remind them not to 'appear' too overtly arrogant in their interactions, pronouncements, assumptions and assertions. \n\nPointless anecdote, but anytime I see Norwegians talk online about their society ever since then, I do detect a decent dose of smugness. Sorry about it ..",
            "title_similarity": "0.6807337",
            "sentiment_compound": -0.8292
        },
        {
            "id": "h63wkca",
            "score": 1,
            "text": "So many electric cars. All reviewed by Bjorn Nyland lol. Crazy dude and wifey.",
            "title_similarity": "0.45472258",
            "sentiment_compound": 0.1027
        },
        {
            "id": "h63wp1r",
            "score": 1,
            "text": "There's rules to how much our government can use out of this for balancing their books too. In the year of Corona this has actually sparked some controversy. But still. The rules stand.",
            "title_similarity": "0.48291808",
            "sentiment_compound": 0.0
        },
        {
            "id": "h63wqf3",
            "score": 1,
            "text": "Australia has enough fossil fuel to sell at our current production rate for centuries to come. It’s cool and all until the only companies that have enough money to fund a mine are Chinese state owned.",
            "title_similarity": "0.7779349",
            "sentiment_compound": 0.3182
        },
        {
            "id": "h63wryl",
            "score": 1,
            "text": "Norway needs a military industrial complex.",
            "title_similarity": "0.42748272",
            "sentiment_compound": 0.0
        },
        {
            "id": "h63wtcc",
            "score": 2,
            "text": "A great example of capitalism and socialism co-existing - listen up <insert country where people have this weird view that unrestricted capitalism is great and socialism is for commies>",
            "title_similarity": "0.5166986",
            "sentiment_compound": 0.8087
        },
        {
            "id": "h63wu4r",
            "score": 1,
            "text": "For those interested, this regulates how much our government can use of this fund a given year. https://en.m.wikipedia.org/wiki/The_budgetary_rule",
            "title_similarity": "0.53451264",
            "sentiment_compound": 0.4019
        },
        {
            "id": "h63wv8l",
            "score": 2,
            "text": "Jesus, a democratic government that thinks beyond the next election? What next?",
            "title_similarity": "0.4142989",
            "sentiment_compound": 0.0
        },
        {
            "id": "h63wxlt",
            "score": 1,
            "text": "Good for norway. 80% of canadians will die in debt 😅",
            "title_similarity": "0.70812666",
            "sentiment_compound": -0.25
        },
        {
            "id": "h63xid7",
            "score": 2,
            "text": "And now they can’t touch it. It’s a money museum.",
            "title_similarity": "0.26619667",
            "sentiment_compound": 0.0
        },
        {
            "id": "h63xiej",
            "score": 2,
            "text": "Wow, they did it completely wrong. The top 5 should have pocketed all the money and then went off to some random independent island.",
            "title_similarity": "0.46672523",
            "sentiment_compound": 0.355
        },
        {
            "id": "h63xxcz",
            "score": 1,
            "text": "Can this fund be invested in or at least mirrored?",
            "title_similarity": "0.1617986",
            "sentiment_compound": 0.0
        },
        {
            "id": "h63xxw0",
            "score": 1,
            "text": "Yeah, some countries create funds for future generations, other create giant megaproject skyscrapers to make the country look advanced, whilst most of the people live in poverty.",
            "title_similarity": "0.6735475",
            "sentiment_compound": 0.4767
        },
        {
            "id": "h63ybuo",
            "score": 2,
            "text": "20 euro a pint 👍",
            "title_similarity": "0.33757576",
            "sentiment_compound": 0.0
        },
        {
            "id": "h63yf2b",
            "score": 1,
            "text": "If I'm right- another advantage of this is it somewhat offsets the effects that large natural resource exports have on appreciating the dollar. Buying foreign stocks reduces the value of the Norwegian currency helping mitigate the effects of Dutch disease...",
            "title_similarity": "0.6054276",
            "sentiment_compound": 0.875
        },
        {
            "id": "h63yn0q",
            "score": 2,
            "text": "Do Norwegian politicians argue about what to do with the fund, and how soon to do it?",
            "title_similarity": "0.5332475",
            "sentiment_compound": -0.34
        },
        {
            "id": "h63ypug",
            "score": 1,
            "text": "Venuzuela: \"they did what?\"",
            "title_similarity": "0.016556414",
            "sentiment_compound": 0.0
        },
        {
            "id": "h63z0xa",
            "score": 1,
            "text": "Wouldn’t it be cool if the fund manager YOLOd 100% of it and posted on r/wallstreetbets",
            "title_similarity": "0.5765065",
            "sentiment_compound": 0.3182
        },
        {
            "id": "h63z3ei",
            "score": 1,
            "text": "Well what really helped Norway was the fact that it's a NATO member.\n\nOther countries which tried this ended up invaded couped or something else.",
            "title_similarity": "0.5458133",
            "sentiment_compound": 0.2732
        },
        {
            "id": "h63zo3t",
            "score": 1,
            "text": "Same thing happened everywhere except instead of money for the people it went to a couple old white guys. I'm sure thier 5 family members will enjoy the GDP of a whole country.",
            "title_similarity": "0.612351",
            "sentiment_compound": 0.6705
        },
        {
            "id": "h63zoll",
            "score": 1,
            "text": "And Canada completely shit the bed with the oil sands.",
            "title_similarity": "0.45245224",
            "sentiment_compound": -0.5984
        },
        {
            "id": "h63zqa8",
            "score": 1,
            "text": "Ugh I’m gonna get downvoted to oblivion but why don’t terrorists ever seem to pick on these high-falutin’ European countries? \n\nSerious question.\n\nIIRC, part of the reason The Terrorists want Death To America is bc we live in such a gross abundance of wealth and comfort, yeah?\n\nWell, some of us are grossly, abundantly comfortable in America- about 1%, but we are constantly hearing about how happy and healthy and wealthy the majority of people in Denmark, Norway, etc are, so, why aren’t they terrorizing those countries, too? \n\nOr, do they, but that news just doesn’t make it to me, somehow?\n\nGenuinely asking, please be gentle, I have no knowledge :p",
            "title_similarity": "0.72058487",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h63zuln",
            "score": 1,
            "text": "Ah yes, 1969, also known as \"40 years ago\".",
            "title_similarity": "0.36774704",
            "sentiment_compound": 0.4019
        },
        {
            "id": "h63zuqq",
            "score": 1,
            "text": "What is a 'Sovereign Wealth Fund' ?? How does it help sustain a country?",
            "title_similarity": "0.48085502",
            "sentiment_compound": 0.7536
        },
        {
            "id": "h63zytp",
            "score": 1,
            "text": "But...that's communism!",
            "title_similarity": "0.16912033",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6408t7",
            "score": 1,
            "text": "Norway almost gave away the oil fields to sweeden in a trade for Volvo. Sweeden declined the offer. 😆",
            "title_similarity": "0.5767272",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h640bia",
            "score": 1,
            "text": "amazing",
            "title_similarity": "0.024880677",
            "sentiment_compound": 0.5859
        },
        {
            "id": "h640ef6",
            "score": 2,
            "text": "And on top, they are only allowed to spend 4% of the interest on that capital.",
            "title_similarity": "0.519348",
            "sentiment_compound": 0.5859
        },
        {
            "id": "h640fwf",
            "score": 1,
            "text": "Surely it would make more sense to have a few rich guys exploit it and then have the money trickle down ?",
            "title_similarity": "0.43790704",
            "sentiment_compound": 0.7269
        },
        {
            "id": "h640hrq",
            "score": 2,
            "text": "Don't mention finding oil...or else the US will 'invade' your country telling you they bring 'freedom' and 'democracy'  \\*kuch\\*  and steal your oil in the meantime.",
            "title_similarity": "0.46133202",
            "sentiment_compound": 0.25
        },
        {
            "id": "h640mel",
            "score": 1,
            "text": "If the global economy doesn't violently collapse.",
            "title_similarity": "0.49555016",
            "sentiment_compound": 0.6908
        },
        {
            "id": "h640oyu",
            "score": 1,
            "text": "Good luck doing the same with a population of 1,4 billion",
            "title_similarity": "0.4824426",
            "sentiment_compound": 0.7096
        },
        {
            "id": "h640rny",
            "score": 1,
            "text": "Lol many years is not a number",
            "title_similarity": "0.15736347",
            "sentiment_compound": 0.3773
        },
        {
            "id": "h6410hv",
            "score": 1,
            "text": "Norway is the gold standard in Oil discovery and natural asset wealth management but even if an Independent Scotland had made almost every mistake imaginable in Oil wealth management compared to Norway bar giving away its Oil (which is technically did as part of the Union) it would still be 500 billion richer in the worst case scenario instead Scotland in the Union shares in the UK’s macro overspend which has accumulated an eye watering 2.19 trillion pounds of debt",
            "title_similarity": "0.806349",
            "sentiment_compound": 0.7794
        },
        {
            "id": "h64140l",
            "score": 1,
            "text": "1.3 trillion divided by a population of 5 million is $260,000 for every citizen in the country.",
            "title_similarity": "0.5862709",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6419gm",
            "score": 1,
            "text": "Any Norwegian girls in the chat 😅.. let’s date? \nHahahaha",
            "title_similarity": "0.3634418",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h641d6i",
            "score": 2,
            "text": "And StatOil, Norway's national Oil&Gas company is still making big $$$$$$$$$$$'s annually.",
            "title_similarity": "0.80655056",
            "sentiment_compound": 0.0
        },
        {
            "id": "h641ljb",
            "score": 1,
            "text": "We even have a live counter.\nhttps://www.nbim.no/no/",
            "title_similarity": "0.19039899",
            "sentiment_compound": 0.0
        },
        {
            "id": "h641uvj",
            "score": 1,
            "text": "Without it, Norway would be far less prosperous. The rough nature of western Scandinavian geography makes infrastructure construction extremely expensive and agriculture… impractical. They really got lucky with their oil, and they spent it wisely. Bravo!",
            "title_similarity": "0.74463797",
            "sentiment_compound": 0.8392
        },
        {
            "id": "h6423t7",
            "score": 1,
            "text": "If you search up www.oljefondet.no, its website, you can see it go up and down millions every second\nCant find the website, it redirected to a political party bruh",
            "title_similarity": "0.610304",
            "sentiment_compound": 0.4019
        },
        {
            "id": "h6424xs",
            "score": 1,
            "text": "And all that income has made the country the only one in the world without a large national debt.",
            "title_similarity": "0.64917266",
            "sentiment_compound": -0.3612
        },
        {
            "id": "h642aad",
            "score": 1,
            "text": "Whats a sovereign wealth fund?",
            "title_similarity": "0.33971944",
            "sentiment_compound": 0.4939
        },
        {
            "id": "h642dtx",
            "score": 1,
            "text": "imagine how rich El Salvador will be if that geothermal power being converted into Bitcoins ends up working out for them..",
            "title_similarity": "0.5996187",
            "sentiment_compound": 0.5574
        },
        {
            "id": "h642e39",
            "score": 1,
            "text": "Stupid Norwegians!! Britain used he money wisely by sending a flotilla to the Falklands.",
            "title_similarity": "0.62286884",
            "sentiment_compound": -0.2924
        },
        {
            "id": "h642k28",
            "score": 1,
            "text": "America: “did you just threaten me Norway”\n*sends in troops*\n“Oooh look, oYul”",
            "title_similarity": "0.43542573",
            "sentiment_compound": -0.3818
        },
        {
            "id": "h642tde",
            "score": 1,
            "text": "Same thing happened in Scotland, but it got spiffed up the wall by a corrupt uk government. \n\nThat wealth should have benefited the whole of the UK.",
            "title_similarity": "0.58303636",
            "sentiment_compound": 0.6486
        },
        {
            "id": "h642wt2",
            "score": 2,
            "text": "To provide context, the USA’s GDP in 2021 is over $22 trillion.",
            "title_similarity": "0.595386",
            "sentiment_compound": 0.0
        },
        {
            "id": "h64396f",
            "score": 1,
            "text": "Hmm. This is good. I'm not used to reading positive news/facts",
            "title_similarity": "0.24227703",
            "sentiment_compound": 0.7579
        },
        {
            "id": "h643cnc",
            "score": 1,
            "text": "After I watched ragnarok I fell In love with Norway. I honestly wouldn’t mind living in the Nordic region.",
            "title_similarity": "0.5427859",
            "sentiment_compound": 0.802
        },
        {
            "id": "h643ctl",
            "score": 1,
            "text": "Meanwhile my country handled the oil/gas profits in such a good way they named it the [Dutch Disease](https://en.wikipedia.org/wiki/Dutch_disease)",
            "title_similarity": "0.5648825",
            "sentiment_compound": 0.7003
        },
        {
            "id": "h643mbn",
            "score": 1,
            "text": "David McWilliams did a really good podcast on this, one of the things he suggested in other countries is that everyone gets a real equal share that can be cashed in, and you could use your share as security for loans or as a deposit for a mortgage. Good way of getting money in people’s pockets and doesn’t actually cost the government anything, all taken out of profit",
            "title_similarity": "0.56078196",
            "sentiment_compound": 0.9299
        },
        {
            "id": "h6445oz",
            "score": 1,
            "text": "Dumb, obviously should have sold the rights to the oil to a private drilling company like the US then just sit back and watch that sweet trickle down economics go to work....",
            "title_similarity": "0.5662806",
            "sentiment_compound": 0.296
        },
        {
            "id": "h6449fo",
            "score": 2,
            "text": "@johnhoward SMH",
            "title_similarity": "0.12566474",
            "sentiment_compound": -0.4648
        },
        {
            "id": "h644hsz",
            "score": 2,
            "text": "Yet we pay a lot in taxes. Gas prices are more than 2$ pr litre",
            "title_similarity": "0.6146313",
            "sentiment_compound": -0.1027
        },
        {
            "id": "h644jvo",
            "score": 2,
            "text": "Why does Norway always have cool solutions to problems? How do the politicians work together like that?",
            "title_similarity": "0.5085456",
            "sentiment_compound": 0.4871
        },
        {
            "id": "h644tbt",
            "score": 1,
            "text": "Yep they nationalized their oil. Brilliant move!",
            "title_similarity": "0.50791764",
            "sentiment_compound": 0.7424
        },
        {
            "id": "h644xv4",
            "score": 1,
            "text": "See, Vikings weren’t all bad.",
            "title_similarity": "0.2248987",
            "sentiment_compound": -0.5423
        },
        {
            "id": "h6454bt",
            "score": 1,
            "text": "Can Norway adopt me",
            "title_similarity": "0.24245301",
            "sentiment_compound": 0.1779
        },
        {
            "id": "h645ek6",
            "score": 1,
            "text": "Then there’s people saying that an independent Scotland would never survive….",
            "title_similarity": "0.33483157",
            "sentiment_compound": 0.0
        },
        {
            "id": "h645i7s",
            "score": 1,
            "text": "Friendlyjordies does a great show on how instead of doing this, John Howard royally fucked Australians instead.",
            "title_similarity": "0.4205122",
            "sentiment_compound": -0.0772
        },
        {
            "id": "h645si8",
            "score": 1,
            "text": "One of the tenets of the fund is to not invest in any Norwegian companies",
            "title_similarity": "0.3785568",
            "sentiment_compound": 0.0
        },
        {
            "id": "h645zbr",
            "score": 1,
            "text": "Can someone explain this? I checked out a couple of yt videos but still clueless about this. I'm sure it would help a lot of people visiting this thread.",
            "title_similarity": "0.32140964",
            "sentiment_compound": 0.5023
        },
        {
            "id": "h6460a4",
            "score": 1,
            "text": "Oilnomics is still king",
            "title_similarity": "0.35026968",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6461et",
            "score": 1,
            "text": "While Scotland looks on and weeps at the thought of what could have been.",
            "title_similarity": "0.26033217",
            "sentiment_compound": -0.34
        },
        {
            "id": "h6467oe",
            "score": 1,
            "text": "As a Swede in Norway, I'm constantly being reminded that Sweden too had the opportunity to have a piece of said oilfields but declined",
            "title_similarity": "0.5224403",
            "sentiment_compound": 0.2263
        },
        {
            "id": "h646b1l",
            "score": 1,
            "text": "And then there's Venezuela lol",
            "title_similarity": "0.10907458",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h646cql",
            "score": 1,
            "text": "As a Norwegian, yeah that's pretty cool. But they didn't have a crystal ball in the 70s. Actually, Norway tried to make a deal with Sweden to receive half of ownership of Volvo, for a cut of half of all revenue from oil in the north sea. \n\n\nSweden declined. \n\n\nWe counter offered with 40% stake in Volvo for half of all oil revenue. \n\n\nSweden declined. \n\n\nThis has been set up over time, and we weren't at all aware of how this would play out at the time. \n\nhttps://no.m.wikipedia.org/wiki/Volvo-avtalen",
            "title_similarity": "0.7429185",
            "sentiment_compound": 0.5859
        },
        {
            "id": "h646zt9",
            "score": 2,
            "text": "Norway is a small homogenous country, of course they look out for each other. Just give it a couple of decades with mass immigration and most norwegians will turn out to be as salty as the average american.",
            "title_similarity": "0.6602423",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6473yd",
            "score": 1,
            "text": "Puts into perspective how small Norway’s population is. The US spends 1.3 trillion every quarter.",
            "title_similarity": "0.6451026",
            "sentiment_compound": 0.0
        },
        {
            "id": "h647573",
            "score": 1,
            "text": "One of the few nations of non-wankers. \nImagine this in the US ! All those fucking greed-bag lobbyists and their paid corrupt government puppets spinning their endless mumbo-jumbo redderick about \"socialism\" and how bad this is for \"freedom\" and \"free market\", just to get their hands on all that cash for no good reason at all.",
            "title_similarity": "0.5250268",
            "sentiment_compound": 0.4378
        },
        {
            "id": "h647dlx",
            "score": 1,
            "text": "The part I'm not clear on is if the major source of the wealth came from taxes or just owning the major oil companies.\n\nOften in Australia, it's claimed that we should have followed a similar path with out iron ore wealth, but it was discovered and commercialised by private companies so there was no real opportunity for the Government to own the major producers. \n\nThere are calls to tax them more highly but this is often called for by people who don't understand the interaction by state royalties and national company taxes. We already tax mineral wealth more highly than other countries but I'm not sure of Norway's comparable met taxation rate for instance.",
            "title_similarity": "0.68373203",
            "sentiment_compound": -0.1849
        },
        {
            "id": "h647fq9",
            "score": 1,
            "text": "Alberta's Government did this but the rules on its use were not set in stone and their government has now pissed away all that money. Now their industry has failed because oil from their wells is hard to process, thus not profitable, and are now blaming the rest of Canada for not having their back because the federal government is telling them to diversify their economy. Oh, and they refuse to put in a provincial sales tax to fund their government when every other province has such a tax. Oh and their provincial income taxes are flat rates that cap out instead of being % based on income brackets like the rest of the country. \n\nTL;DR Albertans don't know how to handle money and are blaming anyone else but themselves.",
            "title_similarity": "0.6497233",
            "sentiment_compound": -0.9706
        },
        {
            "id": "h647i4u",
            "score": 1,
            "text": "See, in Australia, we just blew it all on tax cuts and subsidising slumlords.",
            "title_similarity": "0.42368114",
            "sentiment_compound": -0.296
        },
        {
            "id": "h647ic3",
            "score": 1,
            "text": "Remember when Bush Jr. suggested doing this with a portion of the social security fund and then democrats and the press went off on him for wanting to murder old people?",
            "title_similarity": "0.52025926",
            "sentiment_compound": -0.5106
        },
        {
            "id": "h647ijh",
            "score": 1,
            "text": "Your mom is a profitable fund",
            "title_similarity": "0.45680997",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h647o9w",
            "score": 1,
            "text": "While my country isn't perfect.... at least we're making an effort.",
            "title_similarity": "0.2368955",
            "sentiment_compound": -0.4585
        },
        {
            "id": "h647z96",
            "score": 3,
            "text": "Another fun fact is that it was an oil engineer from Iraq that helped write the 10 laws that kept the money in the country and not being exploited by American companies.",
            "title_similarity": "0.6989788",
            "sentiment_compound": 0.6985
        },
        {
            "id": "h648bd1",
            "score": 1,
            "text": "This is only true if no war breaks out. War is really bad for business.",
            "title_similarity": "0.45239618",
            "sentiment_compound": -0.4112
        },
        {
            "id": "h648jmy",
            "score": 1,
            "text": "Socialism is bad, someday I will be a billionaire",
            "title_similarity": "0.5848402",
            "sentiment_compound": -0.5423
        },
        {
            "id": "h648jrn",
            "score": 2,
            "text": "Meanwhile, in the US, many of the government ran pension funds are pillaged for prospecting in markets the people who run them know nothing about, often losing entire generations of teachers or bus drivers their retirement",
            "title_similarity": "0.59200215",
            "sentiment_compound": 0.2924
        },
        {
            "id": "h648n52",
            "score": 1,
            "text": "Norway is the way! 🇳🇴",
            "title_similarity": "0.2921766",
            "sentiment_compound": 0.0
        },
        {
            "id": "h648n56",
            "score": 2,
            "text": "Norway: I diversify ALL my oil profits\n\nUAE: All? I only diversify most of my oil profits\n\nSaudi Arabia: I only diversify some of my profits\n\nVenezuela: You have oil profits?\n\n&#x200B;\n\nEDIT:\n\nVenezuela 2021: You have oil?",
            "title_similarity": "0.6984443",
            "sentiment_compound": 0.903
        },
        {
            "id": "h648o38",
            "score": 1,
            "text": "Thanks Thatcher.",
            "title_similarity": "0.079453625",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h648rq0",
            "score": 1,
            "text": "Bonus: Israel found natural Gas and promised to do the same - Decided to hand it over to American companies. Money all went away. The paid like $300M in 10 years of operation, all minimal taxes required by law.",
            "title_similarity": "0.78795403",
            "sentiment_compound": 0.9217
        },
        {
            "id": "h648uev",
            "score": 7,
            "text": "I used to think Norway had specific uses for their sovereign fund.  But apparently, they simply draw from it to prevent deficit spending.  Thus, Norway doesn't pay interest on debt because they have no debt.  And it doesn't actually pay for anything in specific.  Although they also have a separate and much smaller fund specifically to pay all govt. employee pensions.\n\nI found an article in Fortune magazine that explains how Norway planned to withdraw $37B USD from its fund - four times more than ever before - to pay for govt. expenditures and reduced revenue due to Covid.\n\nBear in mind that the population of Norway is only 5.3 million people.  So a sovereign fund of over $1.3T makes each and every citizen worth nearly a quarter million USD.  Revenue is highly volatile, so it's very hard to pin down how much the govt. has to spend per citizen from year to year.  Suffice to say, the record withdrawal last year represented almost $7000 USD per citizen without adding a dime to their taxes or deficit.\n\nFor perspective, in order for the USA to have a similar amount per citizen and an equivalent withdraw last year, it would need a sovereign wealth fund worth nearly $81T USD, with a withdrawal of $2.3T dollars.  The economy of the entire planet is only about $94T USD, according to google.",
            "title_similarity": "0.7228972",
            "sentiment_compound": -0.6372
        },
        {
            "id": "h648whs",
            "score": 1,
            "text": "Don't say that to wsb",
            "title_similarity": "-0.049523413",
            "sentiment_compound": 0.0
        },
        {
            "id": "h648z1o",
            "score": 2,
            "text": "Based on the comments I’m guessing that this kind of system only works when there’s virtually no government corruption",
            "title_similarity": "0.3842276",
            "sentiment_compound": -0.296
        },
        {
            "id": "h6493xs",
            "score": 1,
            "text": "And then there is alberta: \"we are going to have a sovereign wealth fund but with taxbreaks blackjack and hookers!\" and years later: they broke",
            "title_similarity": "0.6247619",
            "sentiment_compound": -0.4389
        },
        {
            "id": "h649sqj",
            "score": 1,
            "text": "That’s what happens when other countries aren’t controlling your industry and resources",
            "title_similarity": "0.3181984",
            "sentiment_compound": 0.0
        },
        {
            "id": "h649t6l",
            "score": 1,
            "text": "I hate America more and more everyday. 🙄",
            "title_similarity": "0.3651809",
            "sentiment_compound": -0.5719
        },
        {
            "id": "h64a47e",
            "score": 1,
            "text": "UK could’ve done the same but nope Thatcher and her “no such thing as society” cultism.",
            "title_similarity": "0.33641768",
            "sentiment_compound": 0.0
        },
        {
            "id": "h64a4qq",
            "score": 1,
            "text": "So this is what really pays for all their famous social programs, yes?",
            "title_similarity": "0.45987305",
            "sentiment_compound": 0.4019
        },
        {
            "id": "h64a53z",
            "score": 1,
            "text": "\nEconomics explained has an amazing video about the economy of norway. He said norway is like that dude that wins the lottery invests that money and keeps going to work. Unlike a country like venezuela. Can  I get an F in the chat for our fallen brothers",
            "title_similarity": "0.7181345",
            "sentiment_compound": 0.875
        },
        {
            "id": "h64aebe",
            "score": 1,
            "text": "Unfortunately, it has led to insidious inflation right across the whole country. So, for example, in Turkey, the price of a tall latte is £1.78. In Norway, it's $6.05. When everyone is rich, no-one is rich.",
            "title_similarity": "0.70307785",
            "sentiment_compound": 0.7003
        },
        {
            "id": "h64aeqi",
            "score": 1,
            "text": "> Many companies are excluded by the fund on ethical grounds.\n\nThis probably one of the distinctions that I think a lot of hyper capitalist cultures would’ve failed at that Norway was able to accomplish. \nToo many governments give companies the same if not more rights than its citizens where the companies can easily get subsidies and bailouts but its citizens get nothing for a global pandemic, insulin is extremely over priced, and education costs an arm and a leg.",
            "title_similarity": "0.6976185",
            "sentiment_compound": 0.2263
        },
        {
            "id": "h64ath3",
            "score": 2,
            "text": "It seems like Norway needs some American freedom!!!",
            "title_similarity": "0.38825378",
            "sentiment_compound": 0.8213
        },
        {
            "id": "h64atoo",
            "score": 1,
            "text": "Why the fuck didn’t we do this in Canada?",
            "title_similarity": "0.2295198",
            "sentiment_compound": -0.5423
        },
        {
            "id": "h64axar",
            "score": 1,
            "text": "So reddit..oil is good now?",
            "title_similarity": "0.33987194",
            "sentiment_compound": 0.4877
        },
        {
            "id": "h64b5g7",
            "score": 1,
            "text": "Looks like Norway needs some freedom 🇺🇸",
            "title_similarity": "0.29425693",
            "sentiment_compound": 0.7717
        },
        {
            "id": "h64b671",
            "score": 1,
            "text": "Dang.  That amount of money might last 3 months in the  US.",
            "title_similarity": "0.56543994",
            "sentiment_compound": 0.0
        },
        {
            "id": "h64baoz",
            "score": 1,
            "text": "A",
            "title_similarity": "-0.12405238",
            "sentiment_compound": 0.0
        },
        {
            "id": "h64bbda",
            "score": 2,
            "text": "I often refer to the Scandinavian countries as 'peak democracy'.",
            "title_similarity": "0.44689316",
            "sentiment_compound": 0.0
        },
        {
            "id": "h64bcna",
            "score": 1,
            "text": "Genius chess move. I expect nothing less from Norway.",
            "title_similarity": "0.4801609",
            "sentiment_compound": 0.0
        },
        {
            "id": "h64bxgr",
            "score": 1,
            "text": "Or if this was the U.S., 6 months?",
            "title_similarity": "0.25723016",
            "sentiment_compound": 0.0
        },
        {
            "id": "h64bymj",
            "score": 1,
            "text": "But wait, that’s Communism!! /s",
            "title_similarity": "0.21345893",
            "sentiment_compound": 0.0
        },
        {
            "id": "h64bzzy",
            "score": 1,
            "text": "Hmm how do i invest in said fund?",
            "title_similarity": "0.25902653",
            "sentiment_compound": 0.0
        },
        {
            "id": "h64c031",
            "score": 1,
            "text": "Daddy, I want a goose. Now!” — Veruca Salt",
            "title_similarity": "0.349586",
            "sentiment_compound": 0.1511
        },
        {
            "id": "h64c9vd",
            "score": 1,
            "text": "So what reddit is saying, is Im moving to Norway",
            "title_similarity": "0.3629942",
            "sentiment_compound": 0.0
        },
        {
            "id": "h64cmja",
            "score": 1,
            "text": "But if that money is in any part, shape or form invested in USD, Euro or any other fiat, or any asset that a foreign government can seize, then the value is arbitrary.\nFurther - that 1.3 trillion over 40 years is devalued by the fact that USA prints that per year to offset debt",
            "title_similarity": "0.6913184",
            "sentiment_compound": 0.4767
        },
        {
            "id": "h64cpjf",
            "score": 1,
            "text": "It’s wielded like a political and economic battering stick as well.",
            "title_similarity": "0.32447433",
            "sentiment_compound": 0.5574
        },
        {
            "id": "h64cs1l",
            "score": 1,
            "text": "More important learning is Alberta had the same opportunity and squandered it, instead lining the pockets of oil companies and lower taxes for its population. Now they are fucked.",
            "title_similarity": "0.66014993",
            "sentiment_compound": -0.4033
        },
        {
            "id": "h64cvgb",
            "score": 1,
            "text": "Australian Liberal Party on the other had said “come and take all our natural resources for next to nothing I’d you just donate to our reelection campaigns” and now Australia has zero to show for all the wealth they’ve siphoned off.",
            "title_similarity": "0.62365776",
            "sentiment_compound": 0.8126
        },
        {
            "id": "h64cwup",
            "score": 2,
            "text": "Alberta could have been Norway. Sigh",
            "title_similarity": "0.37265742",
            "sentiment_compound": 0.0258
        },
        {
            "id": "h64cx3j",
            "score": 1,
            "text": "[Thanks to one Iraqi immigrant, the story is fascinating](https://www.cbc.ca/news/canada/iraqi-farouk-al-kasim-behind-norway-oil-fund-that-is-envy-of-world-1.2604105)",
            "title_similarity": "0.6328029",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h64cz8j",
            "score": 1,
            "text": "Unlike the UK who squandered theirs under the thumb of Margret Thatcher, witch of the West.",
            "title_similarity": "0.3410319",
            "sentiment_compound": -0.3612
        },
        {
            "id": "h64d63q",
            "score": 1,
            "text": "They also have more oil per Capita in production than nearly and other developed country. And their population very much supports producing as much as they can for production. They are very aggressive in this and when you have that much money coming in, it is pretty easy to set some aside for future. \n\nThey likely could produce for another thousand years depending on future prices.",
            "title_similarity": "0.74141306",
            "sentiment_compound": 0.7897
        },
        {
            "id": "h64dpv1",
            "score": 2,
            "text": "Norway also bought stocks in pretty much every major company in Europe and USA. Even if the oil money runs out, they still have reliable income in the foreseeable future.",
            "title_similarity": "0.77441514",
            "sentiment_compound": 0.4939
        },
        {
            "id": "h64e6vg",
            "score": 1,
            "text": "Nice to not be colonized",
            "title_similarity": "0.07083945",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h64e7j9",
            "score": 1,
            "text": "Lol the us would run through that in about 61 days.",
            "title_similarity": "0.38463327",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h64e94o",
            "score": 1,
            "text": "They own all the oil and Gas rights to Ireland too. It was sold by greedy politicians for a small fee and a nice bribe. All the off shore potential",
            "title_similarity": "0.6728293",
            "sentiment_compound": -0.0772
        },
        {
            "id": "h64e9ch",
            "score": 1,
            "text": "Meanwhile Canada had more oil and we have basically nothing to show for it except thousands of abandoned wells.",
            "title_similarity": "0.6495178",
            "sentiment_compound": -0.25
        },
        {
            "id": "h64ejjr",
            "score": 1,
            "text": "Can they start by reducing the tax on booze? It’s so expensive everyone pre-games to the max (you heard me) and then goes out for one round.",
            "title_similarity": "0.67346215",
            "sentiment_compound": 0.0
        },
        {
            "id": "h64eoox",
            "score": 1,
            "text": "Ahh just like Australia’s, oh no wait we gave it all to a few billionaires and multi nationals",
            "title_similarity": "0.40289772",
            "sentiment_compound": 0.0772
        },
        {
            "id": "h64f3fb",
            "score": 1,
            "text": "Could Scotland do this? Or has everything already been sold off by the UK?",
            "title_similarity": "0.4117677",
            "sentiment_compound": 0.0
        },
        {
            "id": "h64f77l",
            "score": 2,
            "text": "Hey don't forget Bill Clinton had the US on this path until GW had to fuck it up!",
            "title_similarity": "0.4641688",
            "sentiment_compound": -0.4812
        },
        {
            "id": "h64fb6e",
            "score": 2,
            "text": "I don't understand.\n\nInvest what? The oil? Money from selling the oil to other countries?\n\nI don't know what I'm missing here.",
            "title_similarity": "0.48035616",
            "sentiment_compound": -0.4098
        },
        {
            "id": "h64fdmu",
            "score": 1,
            "text": "Scotland made a similar discovery, so england took all the money and pissed it away. Now we have record poverty rates! 😃",
            "title_similarity": "0.59666455",
            "sentiment_compound": -0.7424
        },
        {
            "id": "h64fhjm",
            "score": 1,
            "text": "Peter Lougheed is rolling in his grave.",
            "title_similarity": "0.20062459",
            "sentiment_compound": -0.3818
        },
        {
            "id": "h64fjkp",
            "score": 2,
            "text": "Aye and fucking thatcher went and wasted all ours selling off to private firms\n\nBurn in hell.",
            "title_similarity": "0.42984623",
            "sentiment_compound": -0.8316
        },
        {
            "id": "h64fktq",
            "score": 1,
            "text": "Norway has hired a philosopher as part of the group responsible for the fund's investments.",
            "title_similarity": "0.43838304",
            "sentiment_compound": 0.3182
        },
        {
            "id": "h64fls4",
            "score": 1,
            "text": "It’s almost like their government is working for interest of citizens instead of mega corporations.",
            "title_similarity": "0.4273679",
            "sentiment_compound": 0.6378
        },
        {
            "id": "h64fvjb",
            "score": 1,
            "text": "Big brain Norway",
            "title_similarity": "0.43508977",
            "sentiment_compound": 0.0
        },
        {
            "id": "h64fwfi",
            "score": 1,
            "text": "\"I felt a great disturbance in the murrican Force, as if millions of voices suddenly cried \"THATS SOCIALISM!\" out in terror and were suddenly silenced. I fear something good and sane has happened to the Norwegian people.\" ―some reddit dude, sensing the care of the Norwegian Gov.",
            "title_similarity": "0.5787714",
            "sentiment_compound": -0.2244
        },
        {
            "id": "h64fxk3",
            "score": 1,
            "text": "Sounds like the US needs to bring some freedom to Norway.",
            "title_similarity": "0.36962926",
            "sentiment_compound": 0.7717
        },
        {
            "id": "h64fxkh",
            "score": 1,
            "text": "This selflessness, this whole \"what's better for all of us\" sentiment is truly, truly rare. Kudos to Norway.",
            "title_similarity": "0.43315536",
            "sentiment_compound": 0.9001
        },
        {
            "id": "h64g25h",
            "score": 1,
            "text": "Here in Ireland we gave all ours to shell for free. Thanks politicians!",
            "title_similarity": "0.41906863",
            "sentiment_compound": 0.7574
        },
        {
            "id": "h64g25z",
            "score": 1,
            "text": "Destroying the planet by immense fracking for money. Ironic.",
            "title_similarity": "0.51429576",
            "sentiment_compound": -0.6557
        },
        {
            "id": "h64g9mt",
            "score": 1,
            "text": "They are also subsidizing electric car purchases. Sell the oil to foreign countries while use yourself as little as possible. Genious.",
            "title_similarity": "0.49683526",
            "sentiment_compound": 0.0
        },
        {
            "id": "h64g9u2",
            "score": 1,
            "text": "This is what can happen under a socialist democracy.",
            "title_similarity": "0.22986028",
            "sentiment_compound": 0.0
        },
        {
            "id": "h64gbus",
            "score": 1,
            "text": "If only we in Canada did this , to bad out country’s run by a bunch of idiots",
            "title_similarity": "0.38480926",
            "sentiment_compound": -0.5423
        },
        {
            "id": "h64gsus",
            "score": 1,
            "text": "We almost traded like half of our oil rights for a chunk of Volvo (swedish car maker) :D",
            "title_similarity": "0.61715126",
            "sentiment_compound": 0.7395
        },
        {
            "id": "h64gt14",
            "score": 1,
            "text": "I believe Dubai and UAE has also done this.",
            "title_similarity": "0.106352255",
            "sentiment_compound": 0.0
        },
        {
            "id": "h64h5bg",
            "score": 1,
            "text": "We did that too in Malaysia. 2.6 billion Ringgit (USD615 million) was siphoned out by the former Prime Minister",
            "title_similarity": "0.4834471",
            "sentiment_compound": 0.0
        },
        {
            "id": "h64h62n",
            "score": 2,
            "text": "Damn you democratic socialism!! Why do you have to be right all the time?",
            "title_similarity": "0.4023103",
            "sentiment_compound": -0.508
        },
        {
            "id": "h64h7fu",
            "score": 1,
            "text": "oh nice",
            "title_similarity": "-0.07194809",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h64hcu9",
            "score": 1,
            "text": "Meanwhile England sold all of Scotlands oil off for a quick profit, whey hey isn’t a one sided unholy Union just fun!",
            "title_similarity": "0.64908946",
            "sentiment_compound": 0.7574
        },
        {
            "id": "h64hkc7",
            "score": 1,
            "text": "how is the withdraw process is?",
            "title_similarity": "0.013597105",
            "sentiment_compound": 0.0
        },
        {
            "id": "h64hoty",
            "score": 1,
            "text": "New energy sources are on the rise",
            "title_similarity": "0.23436485",
            "sentiment_compound": 0.2732
        },
        {
            "id": "h64hxzm",
            "score": 1,
            "text": "Wow. They actually invested and saved instead of running a constant deficit? I am shocked! Shocked!",
            "title_similarity": "0.3820849",
            "sentiment_compound": 0.2225
        },
        {
            "id": "h64iahq",
            "score": 1,
            "text": "Norwegians are brilliant.  For such a small country/population.  No wonder us Canadians love the Scandanavians.",
            "title_similarity": "0.47685033",
            "sentiment_compound": 0.7783
        },
        {
            "id": "h64itya",
            "score": 1,
            "text": "Alberta had something like this, but they eliminated sales tax and blew it all, so when the oil prices crashed, so did their economy.",
            "title_similarity": "0.62017155",
            "sentiment_compound": 0.1901
        },
        {
            "id": "h64j0zw",
            "score": 2,
            "text": "Only 1.3 trillion? Biden could spend that in under a week… easy!",
            "title_similarity": "0.61143154",
            "sentiment_compound": 0.4926
        },
        {
            "id": "h64j30v",
            "score": 1,
            "text": "In other news The USA has declared war on Norway, citing suspicions of WMD's being present within the country",
            "title_similarity": "0.47610015",
            "sentiment_compound": -0.7506
        },
        {
            "id": "h64j7qz",
            "score": 3,
            "text": "And they drill 10x the US per capita",
            "title_similarity": "0.56047714",
            "sentiment_compound": 0.0
        },
        {
            "id": "h64jgwu",
            "score": 1,
            "text": "Lol stupid soshulists",
            "title_similarity": "0.090447515",
            "sentiment_compound": -0.1531
        },
        {
            "id": "h64jmw6",
            "score": 5,
            "text": "Most oil nations have a sovereign wealth fund. ADIA, QIA, PIF, etc. Norway's is def the largest but also because it is the sole recipient. Abu Dhabi and Dubai have separate ones despite being one country and Abu Dhabi actually has more than 1 itself (ADIA, ADIC, Mubadala all receive oil revenues).\n\nThis feels a bit like the 'Scandinavia does everything better' cliche. That said, Norway invests their profits into their public goods systems which drives so much return for the people that it is warranted.\n\nAnd to be clear - people in the comments are misunderstanding how this is funded / what it is. This is nothing novel or special, this is standard. The difference is how Norway spends the money, not how they handle it.",
            "title_similarity": "0.7773955",
            "sentiment_compound": 0.8136
        },
        {
            "id": "h64k7th",
            "score": 1,
            "text": "So that’s why their social programs are so good?",
            "title_similarity": "0.17224",
            "sentiment_compound": 0.5777
        },
        {
            "id": "h64kohh",
            "score": 2,
            "text": "Meanwhile the UK in a similar time frame discovered oil in waters around Scotland and decided to sell licensing to it to oil companies, limiting the money the UK got and what money it did gain through taxation was blown on short term policies to pander to Tory voters. Today Norway has a $1.3 trillion fund and the UK sits with a national debt of $3.4 trillion.",
            "title_similarity": "0.7678031",
            "sentiment_compound": 0.2263
        },
        {
            "id": "h64kwwu",
            "score": 2,
            "text": "Did a trip to Norway and was surprised how well maintained the infrastructure is even in really remote areas, like there are no humans as far as the eye can see but the roads are pristine. I was told this is at least partly due to that fund, Norwegians value access to nature so they use the fund for things that would normally require more taxes and municipal bonds.",
            "title_similarity": "0.5902971",
            "sentiment_compound": 0.6577
        },
        {
            "id": "h64m7xy",
            "score": 1,
            "text": "r/boneappletea",
            "title_similarity": "0.146639",
            "sentiment_compound": 0.0
        },
        {
            "id": "h64m9vo",
            "score": 1,
            "text": "There was a company called Statoil in Norway that made me quite a tidy sum of money on the stock market.",
            "title_similarity": "0.6387211",
            "sentiment_compound": 0.0
        },
        {
            "id": "h64mb9o",
            "score": 1,
            "text": "*frowns in Albertan*",
            "title_similarity": "0.09246743",
            "sentiment_compound": 0.0
        },
        {
            "id": "h64n7ug",
            "score": 2,
            "text": "Just think, how many Norwegians they could send to space with that money!",
            "title_similarity": "0.5875547",
            "sentiment_compound": 0.0
        },
        {
            "id": "h64ng8r",
            "score": 2,
            "text": "But wouldn't that make them socialist and the enemy?",
            "title_similarity": "0.25542748",
            "sentiment_compound": -0.6956
        },
        {
            "id": "h64nl1q",
            "score": 1,
            "text": "Thought this was common knowledge.",
            "title_similarity": "0.08437437",
            "sentiment_compound": 0.0
        },
        {
            "id": "h64nv8z",
            "score": 5,
            "text": "Btw: This fund guarantees a pension for every Norwegian who has not yet been born.",
            "title_similarity": "0.5649667",
            "sentiment_compound": 0.0
        },
        {
            "id": "h64o0sz",
            "score": 2,
            "text": "This makes me proud to descend from such forward thinking people. My Norwegian cousins have worked in low skilled jobs (warehouse work and store clerk) and live very comfortably in a nice home with a lot of vacation time.",
            "title_similarity": "0.55286723",
            "sentiment_compound": 0.7841
        },
        {
            "id": "h64okbw",
            "score": 1,
            "text": "*Fortunate Sons Intensifies*",
            "title_similarity": "0.29178703",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h64oqx3",
            "score": 1,
            "text": "Wait, so nationalizing resources is... good?",
            "title_similarity": "0.3475955",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h64osnr",
            "score": 1,
            "text": "Amateurs. Pelosi and Chuckles could blow 3 times that in a day.",
            "title_similarity": "0.53591967",
            "sentiment_compound": 0.2732
        },
        {
            "id": "h64oxxd",
            "score": 1,
            "text": "What I find very interesting is that the fund does not invest into any Norwegian businesses to diversify its risk",
            "title_similarity": "0.40315306",
            "sentiment_compound": 0.2247
        },
        {
            "id": "h64p8f9",
            "score": 1,
            "text": "They reinvest a huge chunk of the profits from the fund back into the fund itself, it’s still growing. Text book long term planning. Why can’t my country be doing things like this, they’d just spend the lot on an aircraft carrier or something",
            "title_similarity": "0.69955003",
            "sentiment_compound": 0.8126
        },
        {
            "id": "h64pvce",
            "score": 1,
            "text": "Yes we have the oil fund but we are still one of the most taxed nations on earth!!!!",
            "title_similarity": "0.7064579",
            "sentiment_compound": 0.4621
        },
        {
            "id": "h64pxjx",
            "score": 1,
            "text": "The fact that the fund holds 1.4% of global stocks and shares is mind blowing given Norway has a population of like 5.4 million.",
            "title_similarity": "0.7161083",
            "sentiment_compound": 0.5719
        },
        {
            "id": "h64pz4z",
            "score": 1,
            "text": "Get ready for US invasion",
            "title_similarity": "0.16099797",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h64q20l",
            "score": 1,
            "text": "*United States enters chat*",
            "title_similarity": "0.16397898",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h64qlh1",
            "score": 1,
            "text": "Personally, I like this script which shows a representation of the growth...\n[NIMB VALUE](https://www.nbim.no/no/)",
            "title_similarity": "0.32855827",
            "sentiment_compound": 0.6249
        },
        {
            "id": "h64qm4l",
            "score": 1,
            "text": "Then the world goes mostly away from fossil fuels leaving their fund worthless.",
            "title_similarity": "0.53262544",
            "sentiment_compound": -0.4404
        },
        {
            "id": "h64qn3l",
            "score": 1,
            "text": "Here is a short description how they invest:\n\nhttps://www.reddit.com/r/investing/comments/ni2sjd/invest_like_the_norwegian_oil_fund/?utm_source=share&utm_medium=ios_app&utm_name=iossmf",
            "title_similarity": "0.52750933",
            "sentiment_compound": 0.0
        },
        {
            "id": "h64qrv1",
            "score": 1,
            "text": "Amazing.",
            "title_similarity": "0.006168328",
            "sentiment_compound": 0.5859
        },
        {
            "id": "h64qyx0",
            "score": 1,
            "text": "Albertan here. \n\nWe had the same story. \n\nWe didn’t do any of this. \n\nWe have nothing now.",
            "title_similarity": "0.12620047",
            "sentiment_compound": 0.0
        },
        {
            "id": "h64smy3",
            "score": 1,
            "text": "this country is one the greatest energy producers and the population is small\nits very easy to do a good game when everything is working in the correct direction\n\ni see that people here make comparisons to russia\nthe russias propbpem is that it always needs to build tanks instead of wealth",
            "title_similarity": "0.6156069",
            "sentiment_compound": 0.9392
        },
        {
            "id": "h64tdn4",
            "score": 1,
            "text": "Wow someone should tell Venezuela about this approach!!",
            "title_similarity": "0.15131398",
            "sentiment_compound": 0.658
        },
        {
            "id": "h64tdz3",
            "score": 1,
            "text": "Unlike most countries that endlessly proclaim love for their people while doing little to help them (e.g. Insulin prices in the US.) Norway doesn't brag about anything and actually gives a shit about it's people. Interesting that.",
            "title_similarity": "0.47326672",
            "sentiment_compound": 0.6929
        },
        {
            "id": "h64tewx",
            "score": 2,
            "text": "The best way to keep making money forever is to start off with a bunch of money.",
            "title_similarity": "0.48193967",
            "sentiment_compound": 0.6369
        },
        {
            "id": "h64togj",
            "score": 1,
            "text": "They are big in cars with battery yet depend on fossil fuels. Doesn't add up for me.",
            "title_similarity": "0.6058109",
            "sentiment_compound": 0.0
        },
        {
            "id": "h64tsw5",
            "score": 2,
            "text": "Enough to self sustain for how long?  You’d be surprised.  Quite easily, actually.",
            "title_similarity": "0.38929993",
            "sentiment_compound": 0.5563
        },
        {
            "id": "h64uif5",
            "score": 2,
            "text": "AMC Go brrrr 🚀",
            "title_similarity": "0.17384565",
            "sentiment_compound": 0.0
        },
        {
            "id": "h64up0z",
            "score": 1,
            "text": "Alberta could have been in the same boat.",
            "title_similarity": "0.18278375",
            "sentiment_compound": 0.0
        },
        {
            "id": "h64uure",
            "score": 1,
            "text": "Laughing in nigerian stupid disjointed country",
            "title_similarity": "0.3099703",
            "sentiment_compound": -0.3612
        },
        {
            "id": "h64vhy1",
            "score": 1,
            "text": "/nextfuckinlevel",
            "title_similarity": "0.079741836",
            "sentiment_compound": 0.0
        },
        {
            "id": "h64wq6u",
            "score": 1,
            "text": "Looking at you Alberta",
            "title_similarity": "0.078714706",
            "sentiment_compound": 0.0
        },
        {
            "id": "h64wqey",
            "score": 1,
            "text": "Can a normal person also invest in this or it's a big-boys-only kind of thing?",
            "title_similarity": "0.3634495",
            "sentiment_compound": 0.0
        },
        {
            "id": "h64xaca",
            "score": 1,
            "text": "Ja, ja, ja!!!",
            "title_similarity": "0.013250737",
            "sentiment_compound": 0.0
        },
        {
            "id": "h64z53q",
            "score": 1,
            "text": "Albertans see this: *Crying in Canadian*",
            "title_similarity": "0.28505382",
            "sentiment_compound": -0.561
        },
        {
            "id": "h64zsza",
            "score": 2,
            "text": "or until the rest of the world also runs out of oil and they invade.",
            "title_similarity": "0.53664297",
            "sentiment_compound": 0.0
        },
        {
            "id": "h651d87",
            "score": 2,
            "text": "###Smart country all around.",
            "title_similarity": "0.1927767",
            "sentiment_compound": 0.4019
        },
        {
            "id": "h6529q3",
            "score": 1,
            "text": "Not only that. The trust fund is the largest in the world and is forbidden from investing into unsustainable and /or morally wrong organizations. This includes oil/gas companies. The government uses the revenue from the trust fund to partially fund themselves without actually taking money out of the fund. You really cant not like Norway.",
            "title_similarity": "0.6790523",
            "sentiment_compound": 0.4186
        },
        {
            "id": "h652mmo",
            "score": 2,
            "text": "One day, America will decide that Norway needs freedom.",
            "title_similarity": "0.4127568",
            "sentiment_compound": 0.6369
        },
        {
            "id": "h6532r3",
            "score": 1,
            "text": "See, Venezuela? This is what you do when you find a shit load of oil, not wasting it trying to make your fascist regime look like a commie utopia.",
            "title_similarity": "0.5091571",
            "sentiment_compound": -0.5334
        },
        {
            "id": "h65340l",
            "score": 1,
            "text": "Think of all the corporate tax cuts they could have given out. Shame.",
            "title_similarity": "0.5551937",
            "sentiment_compound": -0.6486
        },
        {
            "id": "h653a4d",
            "score": 1,
            "text": "Hopefully they use that money to fix the damage the oil has caused to the environment",
            "title_similarity": "0.5125362",
            "sentiment_compound": -0.128
        },
        {
            "id": "h653ai6",
            "score": 2,
            "text": "See what happens when you don't allow people to be selfish idiots in your country.",
            "title_similarity": "0.2904036",
            "sentiment_compound": -0.5812
        },
        {
            "id": "h653qyw",
            "score": 2,
            "text": "That’s just not how it’s done. You are supposed to grant exclusive rights to monopolistic companies that will use the resources to fund the acquisition of politicians to ensure the game continues as long as possible.",
            "title_similarity": "0.54459107",
            "sentiment_compound": 0.6808
        },
        {
            "id": "h6544iy",
            "score": 1,
            "text": "Every 5 or 10 years or so I see somebody post about this, and laugh. Like it's always so surprising that a country does something reasonable, responsible, and intelligent with a natural resource. I live in canada, where we are getting our country like a fucking pig for fast cash.",
            "title_similarity": "0.65785253",
            "sentiment_compound": 0.9527
        },
        {
            "id": "h654fst",
            "score": 2,
            "text": "Saudi Arabia and the UAE have been attempting to do the same thing.",
            "title_similarity": "0.14513195",
            "sentiment_compound": 0.0
        },
        {
            "id": "h654jvu",
            "score": 2,
            "text": "Meanwhile the UK blew it’s oil revenue on birds booze and bling👍",
            "title_similarity": "0.48086238",
            "sentiment_compound": 0.0
        },
        {
            "id": "h655640",
            "score": 2,
            "text": "The benefit of a forward thinking government.",
            "title_similarity": "0.260758",
            "sentiment_compound": 0.4588
        },
        {
            "id": "h655pnd",
            "score": 1,
            "text": "https://www.nbim.no/no/ \nHere you can keep up with our oilfund live.\nNext generation is gonna have it good! Hopefully they dont screw it up 👍😂",
            "title_similarity": "0.53563094",
            "sentiment_compound": 0.8437
        },
        {
            "id": "h6567m1",
            "score": 1,
            "text": "I know this for years now and I'm still wondering how it is possible that no other country do this if not with national companies, which is more a control move over strategic companies rather than truly investment purposes.\n\nIt should be great to be Norwegian and live in Norway, if it wasn't that cold and dark for 9 months a year 😅",
            "title_similarity": "0.7053063",
            "sentiment_compound": 0.8074
        },
        {
            "id": "h6567q7",
            "score": 1,
            "text": "Finally people talking about Social Wealth Funds.\nIt's not just a big sum of money that a nation has.\nIt's also investments held in industry by the people of the nation represented by the government. All people are therefore holders of the nations firms and benefit from it.\n\nI suggest everyone take a look at Matt Bruenig's work at the People's Policy Project",
            "title_similarity": "0.5738088",
            "sentiment_compound": 0.7351
        },
        {
            "id": "h656j9k",
            "score": 1,
            "text": "Meanwhile Scotlands oil was spent in London without a care in the world.",
            "title_similarity": "0.38319546",
            "sentiment_compound": -0.3875
        },
        {
            "id": "h656lr1",
            "score": 1,
            "text": "Nope. They had no choice but to save it. Spending that amount of money in a country the size of Norway would have caused runaway inflation, economic overheating (see Iran & Venezuela) and economic overreliance on the price of a single commodity. \n\nThis is why all small/ish countries with large natural resources have sovereign wealth funds. \n\nCompare with the U.K. (also hit North Sea oil in the 70s), which spent her revenues on ending her reliance on coal for electricity rather than saving it up for nothing in particular. \n\nIt’s not a case of “wise Norway”, but “what else could Norway have done?” \n\nThis is of course not to insult Norway. Love you guys and it’s cool you have all this money. But so what?",
            "title_similarity": "0.7710228",
            "sentiment_compound": 0.9798
        },
        {
            "id": "h657kb4",
            "score": 1,
            "text": "The fund itself is already used up and while it’s sizeable it will be depleted to pay people’s pensions etc.",
            "title_similarity": "0.61886823",
            "sentiment_compound": -0.1027
        },
        {
            "id": "h658847",
            "score": 3,
            "text": "Fun fact: \n\nIt wasn’t all good decisions.\nAt that time Sweden had giant industries like Volvo and cars were considered the future.\n\nNorway offered half of its entire oil to Sweden in exchange for half of Volvo.\n\nMind you that at the time, oil was still cheaper and Norway’s discovery seemed minuscule.\n\nSweden said no to such a stupid idea and here we are after so many years.",
            "title_similarity": "0.7534789",
            "sentiment_compound": 0.4767
        },
        {
            "id": "h658nft",
            "score": 1,
            "text": "and the guy who helped set all this up? An arab who saw it all go wrong at home.\n\nhttps://www.google.ch/amp/s/amp.ft.com/content/99680a04-92a0-11de-b63b-00144feabdc0",
            "title_similarity": "0.41703695",
            "sentiment_compound": -0.4767
        },
        {
            "id": "h659dao",
            "score": 2,
            "text": "Canada: “why do that when you can blow it all in a few years on hookers, blow and pickup trucks?”",
            "title_similarity": "0.57753265",
            "sentiment_compound": 0.0
        },
        {
            "id": "h65c85x",
            "score": 1,
            "text": "Good on them",
            "title_similarity": "0.02145523",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h65cbii",
            "score": 2,
            "text": "Dummies!!  Don't they know they could have exploited it and raped the environment and put that wealth in the hands of very few?!",
            "title_similarity": "0.50976634",
            "sentiment_compound": -0.7412
        },
        {
            "id": "h65d9w8",
            "score": 1,
            "text": "Very smart.",
            "title_similarity": "0.09566067",
            "sentiment_compound": 0.4576
        },
        {
            "id": "h65dl26",
            "score": 2,
            "text": "Instead, America chose to let the highest bidder harvest our natural resources, to the benefit of the 1%. \n\nThose things belonged/belong to all of us...",
            "title_similarity": "0.62777275",
            "sentiment_compound": 0.6705
        },
        {
            "id": "h65dvqv",
            "score": 1,
            "text": "*Alaska has entered the chat*",
            "title_similarity": "0.21275",
            "sentiment_compound": 0.0
        },
        {
            "id": "h65eb1k",
            "score": 1,
            "text": "1969, so 52 years ago actually",
            "title_similarity": "0.2636025",
            "sentiment_compound": 0.0
        },
        {
            "id": "h65f782",
            "score": 1,
            "text": "There is a \"resource curse.\". \n\nMost states that have major income from natural resources tend to have problems because they become dependent on that income and because it funds massive corruption.  Norway is almost unique in avoiding this.\n\nNo, if they would only stop killing whales.",
            "title_similarity": "0.6586821",
            "sentiment_compound": -0.9037
        },
        {
            "id": "h65gjob",
            "score": 1,
            "text": "Imagine Norway is a household where they inherited a valuable asset. They converted it from oil to a diverse stock portfolio which pays dividends to the household children, aka Norwegian citizens for generations to come.\n\nI hope other countries can learn through this story and emulate the NorWay.",
            "title_similarity": "0.7706829",
            "sentiment_compound": 0.8176
        },
        {
            "id": "h65gp41",
            "score": 1,
            "text": "Cries in Scottish",
            "title_similarity": "0.11366774",
            "sentiment_compound": -0.4019
        },
        {
            "id": "h65jc89",
            "score": 1,
            "text": "Norway’s dirty secret",
            "title_similarity": "0.2954579",
            "sentiment_compound": -0.4404
        },
        {
            "id": "h65k3op",
            "score": 1,
            "text": "Blyat",
            "title_similarity": "-0.0710528",
            "sentiment_compound": 0.0
        },
        {
            "id": "h65k7dj",
            "score": 2,
            "text": "1.3 trillion? That’s only like 6 freedom bombs",
            "title_similarity": "0.3987544",
            "sentiment_compound": 0.7717
        },
        {
            "id": "h65nwaz",
            "score": 2,
            "text": "I love when people point to Norway as an example of a country America should be more like ...Norway, a country that owns all their oil and has a population of five million very homogeneous people.",
            "title_similarity": "0.67305857",
            "sentiment_compound": 0.7902
        },
        {
            "id": "h65oa9x",
            "score": 1,
            "text": "*sobs in Texan*",
            "title_similarity": "0.20387879",
            "sentiment_compound": -0.5423
        },
        {
            "id": "h65rhmi",
            "score": 1,
            "text": "And a 22% income tax rate. Wow.",
            "title_similarity": "0.46816403",
            "sentiment_compound": 0.5859
        },
        {
            "id": "h65tbfs",
            "score": 2,
            "text": "The irony is that the wealth fund invests in natural resources as well -- but in other countries directly and indirectly.\n\nMeaning, Norway exploited resources in other countries instead of itself, British Empire style, and is deceptively actually not self sustainable.",
            "title_similarity": "0.5444107",
            "sentiment_compound": -0.1779
        },
        {
            "id": "h65u7j8",
            "score": 1,
            "text": "nettoppp",
            "title_similarity": "0.027713213",
            "sentiment_compound": 0.0
        },
        {
            "id": "h65war3",
            "score": 1,
            "text": "And Ireland sold its oilfields for rock bottom prices.",
            "title_similarity": "0.5805471",
            "sentiment_compound": 0.0
        },
        {
            "id": "h65wbhz",
            "score": 2,
            "text": "FYI Alberta.",
            "title_similarity": "0.09009708",
            "sentiment_compound": 0.368
        },
        {
            "id": "h65xhij",
            "score": 1,
            "text": "Looks like Norway needs American style democracy brought by the US…",
            "title_similarity": "0.45932817",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h65za9i",
            "score": 1,
            "text": "Alberta...lol",
            "title_similarity": "0.08067383",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6602ma",
            "score": 1,
            "text": "Doesnt the USA have the biggest reserve of oil on the planet? But they decided to empty the oil reserve of the middle east and south America before even starting to abuse their own?",
            "title_similarity": "0.6885699",
            "sentiment_compound": -0.8541
        },
        {
            "id": "h661pbl",
            "score": 1,
            "text": "Australia tried to do this but the US and England bugged out parliament and arranged a soft coup.",
            "title_similarity": "0.4054553",
            "sentiment_compound": 0.0
        },
        {
            "id": "h664lza",
            "score": 1,
            "text": "Oil and Wealth fund. \n\nLaughing (or rather, crying) in Canada.",
            "title_similarity": "0.45667392",
            "sentiment_compound": 0.5106
        },
        {
            "id": "h664rq2",
            "score": 1,
            "text": "Can someone explain how do you invest oil in a fund? And what is a sovereign fund?",
            "title_similarity": "0.4765283",
            "sentiment_compound": 0.0
        },
        {
            "id": "h665fyh",
            "score": 1,
            "text": "Laughs in Iran",
            "title_similarity": "0.17065577",
            "sentiment_compound": 0.4939
        },
        {
            "id": "h665iab",
            "score": 1,
            "text": "Norwegian way > Albertan way",
            "title_similarity": "0.27059403",
            "sentiment_compound": 0.0
        },
        {
            "id": "h665mkh",
            "score": 1,
            "text": "*cries in Scottish\n\nNot only do we not have a sovereign oil fund but our mostly unelected government ran up masses of debt while we were running a surplus.",
            "title_similarity": "0.6511506",
            "sentiment_compound": -0.6249
        },
        {
            "id": "h668rz2",
            "score": 1,
            "text": "ELI5: What is a sovereign wealth fund?",
            "title_similarity": "0.37107706",
            "sentiment_compound": 0.4939
        },
        {
            "id": "h66fz8u",
            "score": 4,
            "text": "It is called good governance in a real democracy, rather than the various pretenders that exist around the world where the rich control government, which in turn sells resources to either oligarchs or multi national corporations, which in turn are primarily owned by the ultra rich.\n\nNorway is to be envied by all ordinary people around the world. It has had real leadership.",
            "title_similarity": "0.6284487",
            "sentiment_compound": 0.8402
        },
        {
            "id": "h66jkev",
            "score": 1,
            "text": "This is why Norway is the happiest nation on the planet.  Money can buy happiness.",
            "title_similarity": "0.60184944",
            "sentiment_compound": 0.8316
        },
        {
            "id": "h66mvqo",
            "score": 1,
            "text": "*cries in scottish*",
            "title_similarity": "0.1474011",
            "sentiment_compound": -0.4019
        },
        {
            "id": "h66sccg",
            "score": 1,
            "text": "Australia too discovered gas a few years ago. We create a trillion dollar wealth fund for the mining and gas magnates of Australia. In the meantime, Australian's pay more for gas than most other countries.",
            "title_similarity": "0.7641318",
            "sentiment_compound": 0.5994
        },
        {
            "id": "h6774dx",
            "score": 1,
            "text": "The United States and Russia was what stopped Germany take either of them out it ww2 and Germany would control all of Europe today",
            "title_similarity": "0.53451335",
            "sentiment_compound": 0.2263
        },
        {
            "id": "h67amlf",
            "score": 1,
            "text": "Greed is natures way of stopping us from succeeding. The fattest lamb will always be the one that dies.",
            "title_similarity": "0.45408595",
            "sentiment_compound": -0.0258
        },
        {
            "id": "h67rowm",
            "score": 2,
            "text": "It’ll be all fine up until America invades them for it.",
            "title_similarity": "0.39800116",
            "sentiment_compound": 0.2023
        },
        {
            "id": "h68hw0j",
            "score": 1,
            "text": "They think ahead, unlike a lot of countries",
            "title_similarity": "0.16813305",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6ceokf",
            "score": 1,
            "text": "No doubt its a great thing they have achieved, and I guess it comes from the frugal mindset of Norway being one of Europes poorest nations prior to finding oil, but I really dont see much effort to move the economy away from oil. The economy is still highly dependendant on oil and gas taxes and dividends from Statoil/Equinor to fund a massive public sector. Instead of sitting on this money, it could be used internally to make Norway a world leader in tech, medicine, renewable energy. Instead, its used to buy apple shares and shopping streets in London. Great investments but not exactly providing something meaningful in the way of employment for future generations. Plus as the oil revenue decreases, governments will be forced to dip into it more and more until eventually its gone with nothing to show for it.",
            "title_similarity": "0.7687352",
            "sentiment_compound": 0.898
        },
        {
            "id": "h6f270h",
            "score": 1,
            "text": "Dude why am I hearing so much about how cool Norway is.",
            "title_similarity": "0.44571906",
            "sentiment_compound": 0.3182
        },
        {
            "id": "h6f4k6o",
            "score": 1,
            "text": "Only because they’ve been able to outsource their important defense costs to the United States. If they hadn’t been able to do that then they’d have to use said fund. Stuff like this is always only possible thanks to US dollars.",
            "title_similarity": "0.6280547",
            "sentiment_compound": 0.8591
        },
        {
            "id": "h6mxwbh",
            "score": 2,
            "text": "Scotland did the same thing only they gave all the money to England whos government swiftly laundered it offshore for the rich elite keeping the United Kingdom as a whole poor as fuck.",
            "title_similarity": "0.6440841",
            "sentiment_compound": 0.25
        },
        {
            "id": "h6q2iu3",
            "score": 1,
            "text": "It’s more that they saw oil destroy the Netherlands, so they wanted to make the money, but didn’t want to ruin the make up of their economy in the process.",
            "title_similarity": "0.54246986",
            "sentiment_compound": -0.7906
        },
        {
            "id": "h6rlval",
            "score": 1,
            "text": "Norway could affjord to save their money.",
            "title_similarity": "0.46983406",
            "sentiment_compound": 0.4939
        },
        {
            "id": "h6up0na",
            "score": 1,
            "text": "What happens when you invest it into a sovereign wealth fund? How does that work?",
            "title_similarity": "0.45182988",
            "sentiment_compound": 0.5514
        },
        {
            "id": "h72o4w8",
            "score": 1,
            "text": "Good thing they weren't a third world country, or a convenient coup would have resulted in a government more open to giving drilling rights to foreign petroleum companies.",
            "title_similarity": "0.56625044",
            "sentiment_compound": 0.6771
        },
        {
            "id": "h7b1us4",
            "score": 1,
            "text": "Cute thing is that they don't invest in companies who are considered bad for the planet like weapon manufacturers, tobacco or such.",
            "title_similarity": "0.4120195",
            "sentiment_compound": -0.0516
        },
        {
            "id": "h7sgwwg",
            "score": 1,
            "text": "Eyyyyy norway gang rise up",
            "title_similarity": "0.32532918",
            "sentiment_compound": 0.0
        },
        {
            "id": "h7x34sg",
            "score": 1,
            "text": "Also our great Irish government just kind of gave them all our gas and oil. Which we actually had a good bit of!\n\nOver €420 billion worth ($496 billion) and we are a nation of less than 5 million people.\n\nYou can just Google \"Ireland gives Norway oil\" haha. \nLove the Norwegians but I can't understand why our government would do that.",
            "title_similarity": "0.79503375",
            "sentiment_compound": 0.8335
        },
        {
            "id": "h8sv1eg",
            "score": 1,
            "text": "The money carefully accumulated in the Norwegian oil fund is about to be wasted on \"stock picking” by the hedge fund guy who the current government has recently  shoehorned into to run it’:\n\n[https://e24.no/boers-og-finans/i/nWLQdL/eksperter-skal-evaluere-oljefondets-aktive-forvaltning](https://e24.no/boers-og-finans/i/nWLQdL/eksperter-skal-evaluere-oljefondets-aktive-forvaltning)(Use translator to get in english)\n\nNext reveal will be that they will invest in local companies, and not coincidentally, owned by the types that \"donate\" money to the politicians. That will take it full circle to the kind of corruption of every other oil exporting country…",
            "title_similarity": "0.7205491",
            "sentiment_compound": -0.4019
        },
        {
            "id": "h94w89v",
            "score": 1,
            "text": "This is uplifting but also sad if you live in the UK. We also found North Sea oil at the same time but squandered the money.",
            "title_similarity": "0.6834432",
            "sentiment_compound": -0.631
        }
    ]
}