{
    "TIL that the details of the Manhattan Project were so secret that many workers had no idea why they did their jobs. A laundrywoman had a dedicated duty to \"hold up an instrument and listen for a clicking noise\" without knowing why. It was a Geiger counter testing the radiation levels of uniforms.\n": [
        {
            "id": "h8knljj",
            "score": 1,
            "text": "Pretty fucked up that they exposed people to radiation and didn't tell them. Good old Federal Government looking out for us citizens.",
            "title_similarity": "0.7251588",
            "sentiment_compound": -0.6002
        },
        {
            "id": "h8l0uym",
            "score": 3,
            "text": "This is why its silly when people say a \"conspiracy\" is too ridiculous because theres no way so many people could keep s secret, that someone would eventually spill the beans. But theres so many moving parts that no one person or group knows what's happening. I believe this with 9/11 and also the current drug/opiate war, and it could possibly be argued for the moon landing too. Could it be true for Covid-19 as well? 5G? It's all possible.",
            "title_similarity": "0.66017735",
            "sentiment_compound": -0.8276
        },
        {
            "id": "h8kzn7v",
            "score": 0,
            "text": "So secretive that the Soviet Union were well aware of what they were doing and tested their own Atomic bomb a few years later lolz.",
            "title_similarity": "0.6473587",
            "sentiment_compound": 0.3818
        },
        {
            "id": "h8ksr0t",
            "score": 5,
            "text": "In those days people trusted the govt and if they asked you to do something without giving you a full explanation, you would do it. Those days are thankfully gone",
            "title_similarity": "0.51067364",
            "sentiment_compound": 0.5946
        },
        {
            "id": "h8k890h",
            "score": -1,
            "text": "How did soviets find out about this project then. Who told them i wonder, which made them sent spyies. I'm curious.",
            "title_similarity": "0.56942546",
            "sentiment_compound": 0.3182
        },
        {
            "id": "h8kptly",
            "score": -8,
            "text": "“Ma’am we are trying to discern whether there are any African tribes hiding within these uniforms. It is absolutely imperative you tell us immediately if you hear clicks”",
            "title_similarity": "0.48405224",
            "sentiment_compound": -0.296
        },
        {
            "id": "h8ldovd",
            "score": 0,
            "text": "Wait until they name whats going on with this virus.",
            "title_similarity": "0.43635422",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8m4w5g",
            "score": 0,
            "text": "But everything is totally different now. No way would they ever do any other weird shit. That shit is all in the past. The vaccine is totally safe. No way would government or a pharmaceutical company say otherwise.",
            "title_similarity": "0.52721226",
            "sentiment_compound": -0.9322
        },
        {
            "id": "h8kzrj6",
            "score": -1,
            "text": "Sounds more like willful ignorance to me",
            "title_similarity": "0.2547294",
            "sentiment_compound": 0.0076
        },
        {
            "id": "h8lsin1",
            "score": 1,
            "text": "What exactly is the Manhattan Project? I've heard a few thing about it but I don't know anything past its name. Anyone have a link I can read or even a quick run down that won't take you 20+ years to write?",
            "title_similarity": "0.5691587",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8m14y6",
            "score": -1,
            "text": "And yet there is no way 9/11 could have been staged. \\~Conspiracy theorist would argue.",
            "title_similarity": "0.5151129",
            "sentiment_compound": -0.7906
        },
        {
            "id": "h8mj8uj",
            "score": 1,
            "text": "It's funny that sceptics always say this level of compartmentalization and secrecy isn't possible when it comes to conspiracies\n\nAnd no I don't have any particular conspiracy theory in mind, but the argument doesn't hold up",
            "title_similarity": "0.6155499",
            "sentiment_compound": -0.6652
        },
        {
            "id": "h8kl9fp",
            "score": 8,
            "text": "[deleted]",
            "title_similarity": "0.07905349"
        },
        {
            "id": "h8jsc8s",
            "score": 65,
            "text": "*test the contamination level of the uniforms.\n\nContamination is the poo. Radiation is the stink. She was checking for poo by measuring the stink.",
            "title_similarity": "0.63325053",
            "sentiment_compound": -0.6597
        },
        {
            "id": "h8klzq2",
            "score": -6,
            "text": "Wow. Uncle sam wants you to get sick and die",
            "title_similarity": "0.35576096",
            "sentiment_compound": -0.5267
        },
        {
            "id": "h8l3u5q",
            "score": -3,
            "text": "Umm. Could someone give a TLDR of the Manhattan Project. I feel like I've heard the name before but I have no clue as to what it actually was.",
            "title_similarity": "0.61342245",
            "sentiment_compound": -0.2617
        },
        {
            "id": "h8l58u1",
            "score": 1,
            "text": "The Manhattan project is proof that you don't need hundreds of people to be in on a conspiracy.",
            "title_similarity": "0.5356157",
            "sentiment_compound": -0.5267
        },
        {
            "id": "h8l8yk7",
            "score": 2,
            "text": "I understand why they didn't tell anyone, but I also feel like it is fucked up that these people weren't allowed to decide if they wanted to be associated with building weapons of mass fucking destruction. I know if it had been me I would feel dirty that I had even played the smallest role.",
            "title_similarity": "0.68768376",
            "sentiment_compound": -0.9427
        },
        {
            "id": "h8lkifu",
            "score": 2,
            "text": "And this is exactly why the deflection of a conspiracy having \"too many people in on it\" is baseless. Compartmentalization works.",
            "title_similarity": "0.5068964",
            "sentiment_compound": -0.5267
        },
        {
            "id": "h8ki74m",
            "score": -22,
            "text": "It's estimated 600k ppl worked on it, and the secret NEVER got out. That kinda flys in the face of the \"there's no way they could ever keep something that big a secret\" argument against most conspiracy theories.",
            "title_similarity": "0.61243343",
            "sentiment_compound": -0.8122
        },
        {
            "id": "h8ksj2v",
            "score": 19,
            "text": "The Manhattan project is a great example of why sometimes you should just do what you are told, turn your brain off and get it done. Now having said that, I would want some justification. Like if I was told to hold an instrument over a conveyer belt of identical looking bags and just put a mark on any bag that the instrument beeped at, I would want my supervisor to say something like \"Listen, I know this seems stupid but this is an important job and I can't give you any explanation other than we don't give anyone here pointless tasks. There is a point. Just do your job to the best of your ability.\"   \n\n\nAnything like that would help some people do their job, to know someone above them has put thought into it and isn't just having you do something because you are on the clock.",
            "title_similarity": "0.69718313",
            "sentiment_compound": 0.9678
        },
        {
            "id": "h8muwak",
            "score": -6,
            "text": "Almost like millions of people getting the vaxxxxine while having no idea why. 👀",
            "title_similarity": "0.45517498",
            "sentiment_compound": 0.0018
        },
        {
            "id": "h8kzyic",
            "score": 4,
            "text": "How come I'm seeing so much Manhattan Project stuff on reddit recently? What does the Russian propaganda machine want us to be thinking about today?",
            "title_similarity": "0.57708806",
            "sentiment_compound": -0.264
        },
        {
            "id": "h8lfkz8",
            "score": 4,
            "text": "My grandmother transported classified documents for the project. She had no idea what they were regarding and later assumed they chose her because no one would assume a well dressed, petite woman would be in possession of such sensitive materials.\n\nShe was horrified when she found out what was created and harbored a good deal of guilt for her small involvement.",
            "title_similarity": "0.78020895",
            "sentiment_compound": -0.4588
        },
        {
            "id": "h8k1c3n",
            "score": 33,
            "text": "I really can't fathom people not questing why they're doing the thing they do every day. Although that's scarily common in the professional world so I guess I'm the weird one.",
            "title_similarity": "0.67831224",
            "sentiment_compound": -0.1779
        },
        {
            "id": "h8kvg7f",
            "score": 0,
            "text": "*What's that clickin' noise?*\n\n- Jonly Bonly",
            "title_similarity": "0.22278398",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8kzxvg",
            "score": 0,
            "text": "[deleted]",
            "title_similarity": "0.07905349"
        },
        {
            "id": "h8l1wwb",
            "score": 0,
            "text": "And yet the Russians had the whole thing in their hands within a month LOL",
            "title_similarity": "0.2564106",
            "sentiment_compound": 0.5473
        },
        {
            "id": "h8l25uq",
            "score": 0,
            "text": "Some guy figured it out cause half of America’s leading nuclear scientists all moved to one town in new mexico",
            "title_similarity": "0.44299674",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8l2830",
            "score": 0,
            "text": "Some guy figured it out cause half of America’s leading nuclear scientists all moved to one town in new mexico",
            "title_similarity": "0.44299674",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8l3c4r",
            "score": 0,
            "text": "# But the Soviets knew all about it\n\nhttps://en.wikipedia.org/wiki/Klaus\\_Fuchs",
            "title_similarity": "0.42785323",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8m7dop",
            "score": 0,
            "text": "'the government is so stupid lol they couldn't do anything bad because someone would talk!'",
            "title_similarity": "0.5737225",
            "sentiment_compound": 0.2154
        },
        {
            "id": "h8mfj1j",
            "score": 0,
            "text": "If there’s a program that back engineers “exotic” off-world technology, it’d function the same way. \n\nLet that sink in.",
            "title_similarity": "0.3083537",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8mj4fw",
            "score": -4,
            "text": "Governments never care about anybody. As your example illustrates the laundrywoman was exposed to radiation as a test subject without even knowing she is exposed to deadly radiation. \n\nCurrently most people have no idea that they are part of an experiment. They even voluntarily participate without pay. In case you’re interested in what the experiment is I don’t mind telling you. It’s the experimental Covid vaccine, lots of people died already due to short term complications and nobody has any idea about long term effects. Most vaccines are tested over a 3 year term before being approved for general public use. What people are injected with has been tested for less than a year.",
            "title_similarity": "0.7247151",
            "sentiment_compound": -0.5417
        },
        {
            "id": "h8om8fl",
            "score": 0,
            "text": "This is exactly how they pulled off 911.",
            "title_similarity": "0.2661888",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8jrosa",
            "score": 5,
            "text": "Wow",
            "title_similarity": "-0.16261423",
            "sentiment_compound": 0.5859
        },
        {
            "id": "h8kvt0z",
            "score": -5,
            "text": "What a hilarious anecdote. It's really amazing how people just came together to solve a problem, just to annihilate hundreds of thousand of people indiscriminately in the blink of an eye.  Yes, the war was already over, but it's really important to send the right message.\n\nWholesome!",
            "title_similarity": "0.55616903",
            "sentiment_compound": 0.646
        },
        {
            "id": "h8l487k",
            "score": 4,
            "text": " the labs are still going and hiring smart people all the time, some advanced projects and rnd, they have military guard that have blocked off an entire road to civilians, they turn you around or shoot at you either or...the people that work there are paid handsomely and you should check the hiring board and the levels needed to get in, it's interesting to say the least",
            "title_similarity": "0.5929533",
            "sentiment_compound": 0.7003
        },
        {
            "id": "h8jzekv",
            "score": -38,
            "text": "Yet people think 9/11 couldn’t be an inside job or that aliens don’t exist because pOePlE cAnT keEp sEcReTs tHaT bIg!!",
            "title_similarity": "0.6534847",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8kvefl",
            "score": 1,
            "text": "Wonder how many thought “this is dumb,ill bs through my day and say I didn’t find anything”",
            "title_similarity": "0.5546076",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8l0iuj",
            "score": -1,
            "text": "Is this that Project where they teleported or something?",
            "title_similarity": "0.23475409",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8l3plx",
            "score": 1,
            "text": "but conspiracy theories aren't real because humans can't keep secrets.",
            "title_similarity": "0.56249595",
            "sentiment_compound": -0.6808
        },
        {
            "id": "h8l6ndv",
            "score": 1,
            "text": "i am shocked at how many jewish americans became soviet spies... meanwhile living here in america...\n\n&#x200B;\n\njust read about George Koval, Socar Seborer, and Theordore Hall",
            "title_similarity": "0.61471885",
            "sentiment_compound": -0.3182
        },
        {
            "id": "h8la29s",
            "score": 1,
            "text": "Was it secrecy or were they too lazy to explain the reason why people were doing what they were doing .\n\n\"Look...it's piss easy..if it starts clicking a lot. Press this button\"",
            "title_similarity": "0.58057153",
            "sentiment_compound": -0.6369
        },
        {
            "id": "h8lenxl",
            "score": 1,
            "text": "That's pretty fucked up I wonder if that laundry lady eventually suffered from the radiation",
            "title_similarity": "0.719722",
            "sentiment_compound": -0.6597
        },
        {
            "id": "h8lfmyw",
            "score": 1,
            "text": "Ah, my hometown!",
            "title_similarity": "0.013932597",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8ll0gu",
            "score": -1,
            "text": "i doubt anyone could ever do something like that ever again!",
            "title_similarity": "0.3518348",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8lvmiy",
            "score": -1,
            "text": "Scientific community working in secrecy, sounds a little conspiracy theory to me, shouldn’t it?",
            "title_similarity": "0.6243",
            "sentiment_compound": -0.4779
        },
        {
            "id": "h8lwkc1",
            "score": 1,
            "text": "But conspiracy theories where a large group of employees don't know all the facets of what they're doing are totally outlandish. Sure.",
            "title_similarity": "0.6222615",
            "sentiment_compound": -0.3032
        },
        {
            "id": "h8mgcob",
            "score": 1,
            "text": "And everyone claiming “but so many people involved couldn’t fake the moon landing”…. No one understands what secrecy is.",
            "title_similarity": "0.6373985",
            "sentiment_compound": -0.6486
        },
        {
            "id": "h8k4cop",
            "score": 36,
            "text": "Didn't the US get intelligence that the Nazis had given up on their atomic weapons program in 1942, but they kept this information from the scientists so they didn't stop their work on the Manhattan Project as well?",
            "title_similarity": "0.7139379",
            "sentiment_compound": 0.6681
        },
        {
            "id": "h8jwjkl",
            "score": -28,
            "text": "However, in the event that one of these workers was captured by the enemy, they were ordered to swallow a Tide pod before revealing any secret information.",
            "title_similarity": "0.56971043",
            "sentiment_compound": -0.5423
        },
        {
            "id": "h8k4i0f",
            "score": 30,
            "text": "Taking i have no idea what i doing to the next level. People must of had insane levels of imposter syndrome hahaa",
            "title_similarity": "0.52942526",
            "sentiment_compound": -0.5994
        },
        {
            "id": "h8l213f",
            "score": 7,
            "text": "[deleted]",
            "title_similarity": "0.07905349"
        },
        {
            "id": "h8lsqxf",
            "score": 9,
            "text": "Yeah, they built it in my home area. They hired the local uneducated hillbillies to be the guinea pigs, exposing them and their families to radiation, and cancer.\nI lost my father, brother in law, several cousins, to cancer directly related to the plants. There were numerous cases of leukemia amongst my classmates, for many years.\nDo you trust your American government? \nI don't.",
            "title_similarity": "0.62824374",
            "sentiment_compound": -0.8271
        },
        {
            "id": "h8l47ol",
            "score": 2,
            "text": "Several years ago, I was watching an episode of \"Beat the Clock\" from sometime in the early 1950s. The couple who were chosen to do the stunt had small  glass vials of **uranium** planted on them! They were put in the back pocket of the husband's and wife's of their coveralls. Then they were given Geiger counters (which, of course, were going nuts). They didn't find them within the allotted 60 seconds;  however I did look up the host, Bud Collyer (who kept a vial of uranium in his jacket pocket) later. He died of circulatory problems. I wouldn't doubt if the minute all three left the stage, their teeth started dropping out, and the couple died of the same issue later.",
            "title_similarity": "0.6344437",
            "sentiment_compound": -0.8855
        },
        {
            "id": "h8l76qj",
            "score": 2,
            "text": "[deleted]",
            "title_similarity": "0.07905349"
        },
        {
            "id": "h8lchs3",
            "score": 2,
            "text": "TIL almost every redditor had a grandmother or grandfather who unknowingly worked on the Manhattan project.",
            "title_similarity": "0.5147722",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8lchv5",
            "score": 2,
            "text": "Yeah but there could 'NEVER be a conspiracy!' ... it would leak out. \n\nlol \n\nGood luck seeing through those rose-colored glasses",
            "title_similarity": "0.4462937",
            "sentiment_compound": 0.9326
        },
        {
            "id": "h8lcn7k",
            "score": 2,
            "text": "The down side of the secrecy is that many people working with radiation were never told they were working with radiation and got sick and died and the ground and water in the area contaminated. My seach-fu is weak at the moment and I'm not finding the most famous large scale communities of Vets who were sworn to secrecy. But found that [The Radiation Exposure Compensation Act is About to Expire](https://outrider.org/nuclear-weapons/articles/radiation-exposure-compensation-act-about-expire/)",
            "title_similarity": "0.77531445",
            "sentiment_compound": -0.6597
        },
        {
            "id": "h8mnxjf",
            "score": -2,
            "text": "And you think this method of compartmentalism couldn’t be implemented for other top secret tech such as ufos? Wow Reddit.",
            "title_similarity": "0.6019087",
            "sentiment_compound": 0.6808
        },
        {
            "id": "h8mrdsu",
            "score": 2,
            "text": "That is so unethical, exposing ppl to hazardous working conditions without informing them",
            "title_similarity": "0.60885936",
            "sentiment_compound": -0.7663
        },
        {
            "id": "h8ne711",
            "score": -2,
            "text": "Were any members of the Manhattan project organization charged with war crimes and were they executed at Nuremberg?",
            "title_similarity": "0.5377029",
            "sentiment_compound": -0.6908
        },
        {
            "id": "h8nrnlt",
            "score": 2,
            "text": "But she did it. Without question. Because thats what her country asked of her. And she was proud to do it.",
            "title_similarity": "0.2754708",
            "sentiment_compound": 0.631
        },
        {
            "id": "h8l5dwi",
            "score": 3,
            "text": "My boss used to do government work in Nevada. One day, someone came over the intercom and told everyone to immediately set down their stuff and leave the facility. Take nothing, they will not be returning.\n\nTurns out the Soviets had put a geostationary satellite over the site.",
            "title_similarity": "0.58873504",
            "sentiment_compound": -0.0516
        },
        {
            "id": "h8laf6w",
            "score": 4,
            "text": "My high school accounting teacher had an interesting story about her aunt and the Manhattan Project. \n\nHer aunt was very good at mathematics and out of college her first job was some sort of assistant position for the government. They gave her pieces of proofs to solve. Never the entire problem and without context. She could tell they weren’t always related but she never knew what exactly she was really working towards. Eventually she came to work and they told her that her job was complete and that she should be proud that she helped create the atomic bomb. She was devastated and never came to grips with it. At one point she sold all of her possessions and decided to voluntarily live of the streets as a homeless person. She rejected material things and hated the government for not telling her what she was doing. I guess she felt as though they took advantage of her and that she hadn’t consented to working for the military on such a horrific weapon. Allegedly if winter nights got too bad she’d get a cheap motel room.\n\nOn the flip side a boss I had a decade later told me his step father was a physics genius (Mensa member) that worked on the Manhattan Project and was incredibly proud of it till the day he died.",
            "title_similarity": "0.7620426",
            "sentiment_compound": -0.977
        },
        {
            "id": "h8ldjxt",
            "score": 2,
            "text": "WWII Genuinely is the scariest time in history. Like fuck the war, that shit was child's play. The way that war ended and all the secrete testing behind closed doors. Shit nobody knows today since participants are all dead and shit moved to fast to record it all or we didn't want a file. Really Manhattan project is just the darkest thing humanity has done. Genocide, torture, experimentation, all are nothing compared to what the Manhattan project has the capability to unleash. It can not only end humanity, but fucking life. \n\nAnd you know what, a bit controversial after reading the comments. I 100% support their measures. I don't care if workers not knowing they were working with radiation was a concern. Yes it sucks, but the government and science was in new and dangerous territory and that info COULD NOT BE LEAKED. Imagine a world today where Hitler's army nuked NYC. Because that was the least of what was on the line.",
            "title_similarity": "0.69742143",
            "sentiment_compound": -0.9558
        },
        {
            "id": "h8l7xwy",
            "score": 4,
            "text": "Wild how many people in this thread had a relative working on the Manhattan project...\n\n/s",
            "title_similarity": "0.57459825",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8jvra8",
            "score": 88,
            "text": "The Manhattan Project involved many, many different companies. I was told a story by one of my \"aunts\" who worked for Emerson back then that she used to deliver suitcases of documents to Julius Rosenberg who would fly in by helicopter and was a relatively big deal. Aunt Rosie was know to tell whoppers though.",
            "title_similarity": "0.5846486",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8l5lxm",
            "score": 5,
            "text": "Anyone interested in this would enjoy The Making of the Atomic Bomb by Richard Rhodes.  One of the greatest science histories I’ve ever read.",
            "title_similarity": "0.4796727",
            "sentiment_compound": 0.7845
        },
        {
            "id": "h8kjl8m",
            "score": 5,
            "text": "This sounds like a post fitting for r/osha",
            "title_similarity": "0.10739139",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h8l42ny",
            "score": 6,
            "text": "This fact is really the only way large scale conspiracy theories could even be remotely possible. \n\nBut like this situation, we would find out afterward. So, if workers were unknowingly installing explosives into the World Trade Center for example, they wouldve definitely come forward after the towers fell.",
            "title_similarity": "0.63705045",
            "sentiment_compound": 0.6808
        },
        {
            "id": "h8ks8g5",
            "score": 20,
            "text": "Yeah, the government wouldnt abuse the classification system to put anyone's lives in danger...",
            "title_similarity": "0.47393844",
            "sentiment_compound": 0.2887
        },
        {
            "id": "h8kxvu2",
            "score": -9,
            "text": "Did she really not know what a Geiger counter is haha",
            "title_similarity": "0.591906",
            "sentiment_compound": 0.4588
        },
        {
            "id": "h8kyv5g",
            "score": 8,
            "text": "ITT: People who just learned what SCI means.\n\nSensitive Compartmented Information",
            "title_similarity": "0.46665603",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8lhm8a",
            "score": 10,
            "text": "Three of my four grandparents worked on the Manhattan Project. I heard so many stories growing up there. My grandmother and grandfather were not allowed to talk even to each other about anything that happened at work. My grandmother figured it out, though. She was hired for her experience with electrical engineering, and she said she realized during the job interview process what was going on because they were asking questions about nuclear physics. They were surprised she knew anything about it and brought in some MIB-looking dudes to interrogate her. When they asked how she knew this stuff, she answered, \"I read Popular Mechanics.\"",
            "title_similarity": "0.792052",
            "sentiment_compound": 0.6872
        },
        {
            "id": "h8js2q0",
            "score": 147,
            "text": "Lady holding up rods: \"My lord, this is going to be one complicated Manhattan cocktail\"",
            "title_similarity": "0.46919018",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8kflhp",
            "score": -12,
            "text": "[removed]",
            "title_similarity": "0.052087583"
        },
        {
            "id": "h8kgea0",
            "score": 14,
            "text": "Fun fact, if your from BC, the town of Trail in the Kootenays actually helped a ton with the project.",
            "title_similarity": "0.2296428",
            "sentiment_compound": 0.5106
        },
        {
            "id": "h8kt1w9",
            "score": 49,
            "text": "I've lived on Oak Ridge almost my whole life.  Shit is still stupid secretive out there! Hubby works security. We don't get to chat about his day at work EVER!",
            "title_similarity": "0.6203004",
            "sentiment_compound": -0.7339
        },
        {
            "id": "h8k9o6g",
            "score": 271,
            "text": "And despite this, information still ended up being leaked to the Soviet Union. Keeping something a secret when so many people are involved is almost impossible.",
            "title_similarity": "0.6617203",
            "sentiment_compound": -0.3182
        },
        {
            "id": "h8kjpz5",
            "score": 41,
            "text": "TIL jordan schlansky works for the manhattan program",
            "title_similarity": "0.32147354",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8kv3rs",
            "score": 177,
            "text": "My great uncle was a machinist. One day, a few guys in black suits came to the shop where he worked and asked for some specific parts. \n\nThe conversation basically went “We need these parts”.\n\n\n“No problem! What for?”\n\n“We need these parts”.\n\n“Sure. But what are they for?”\n\n“We need these parts and you’re gonna stop asking questions”.",
            "title_similarity": "0.5472621",
            "sentiment_compound": -0.4122
        },
        {
            "id": "h8l5w8v",
            "score": 44,
            "text": "That's probably quite common for companies and governments working with secrets. If you don't need to know, you won't. \n\nMy uncle worked at Polaroid, making instant photography packs. (The classic Polaroids). He described working there similar to this. Basically, a worker would be trained to operate a certain machine or process, without knowing any other details. They only knew how to do their particular slice of the process.\n\nWhen Polaroid closed down pack production, a group of employees basically bought the factory and some of the old equipment.\n\nBut there was a problem: they had to reverse-engineer the whole process, since the handful of employees knew a lot, but not everything. I.e. they knew to mix a liter of vat A with two liters of vat B, but had no clue what the actual chemicals were. Or why they performed certain steps in the process. Everything they worked on was a company secret basically. \n\nBasically, with every old employee they talked to, they found another piece of that puzzle. \n\nEventually they had enough knowledge to where they could make good packs again. Which is exactly what they do these days. The employees even bought back the Polaroid name.",
            "title_similarity": "0.65085477",
            "sentiment_compound": 0.1779
        },
        {
            "id": "h8l043b",
            "score": 195,
            "text": "My grandfather worked as a chemist at Dogpatch, which was later called Oak Ridge. After a while, he actually knew what the \"tubealloy\" they were making was,  and at one point held the entire world's supply of fissile uranium. \n\nMy grandmother was a biologist, also called down to Oak Ridge. Among her other duties, she was an informant for the ACME corporation, which was later know as the CIA.\n\nThey'd take the bus into town, and she'd always want to use the restroom at a particular clothing site. Unbeknownst to my grandfather, she was going out tye secret back door, down the stairs, and across the street  to turn in her reports. \n\nShe didn't tell him until the late 80s, when he mentioned something similar out a book he was reading. She said that's how she'd turned in her reports. He calmly set down the book, asked her, \"Anne, what reports did you have?\", and after 40 years she finally spilled the beans.",
            "title_similarity": "0.6565407",
            "sentiment_compound": 0.3818
        },
        {
            "id": "h8jtjd3",
            "score": 349,
            "text": "[removed]",
            "title_similarity": "0.052087583"
        },
        {
            "id": "h8kq8si",
            "score": 219,
            "text": "This is still pretty common.  My wife designed computer chips for a \"black project\".  They gave her the inputs to her chip and the outputs but she did not have \"mission clearance\".  That is, she was not allowed to know what the box her chip was going into was supposed to do.  She can make guesses based on her chip's function and the expertise of the other people she saw on the project but she's really not even supposed to do that.",
            "title_similarity": "0.73709244",
            "sentiment_compound": 0.2732
        },
        {
            "id": "h8kis4r",
            "score": 683,
            "text": "I've told this one before. I had a chem prof back in undergrad whose father was a very good machinist, and got called in to consult on a specific problem.\n\nAs he was in the building for consulting, he noticed the peculiar properties of one of the products they were working on, and casually asked why they were machining uranium.\n\nHe was immediately seized upon by agents, and questioned for several hours as to how he knew it was uranium. They eventually released him, but it was not for some time that he finally realized he had stumbled across part of the Manhattan Project.",
            "title_similarity": "0.74821615",
            "sentiment_compound": 0.177
        },
        {
            "id": "h8k7zsn",
            "score": 422,
            "text": "“Hold this radiation tester and check for radiation.  But you’re safe.”",
            "title_similarity": "0.47503877",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8kh90l",
            "score": 273,
            "text": "Imagine being asked what you do for a living and being on this project like \"ah yes well I hold up a pencil, place it on the table, count to 30 then immediately turn around, pick up a box that is sealed and walk it 16 steps left, set it down and stick a metal box on it that if it makes a click I have to burn the whole thing\" like, I've got a realatively uncommon job and it's hard to explain but having no clue what you are doing or why would make it so much harder",
            "title_similarity": "0.6833124",
            "sentiment_compound": 0.2263
        },
        {
            "id": "h8juuvo",
            "score": 846,
            "text": "This still goes on.  In the DoE you might be working on a project for *years*, and that project is actually a red herring only designed to see if any leaks happen from it for espionage.  There are maybe two people that know the project in its entirety, and manage sub teams of actual development as well as the red herring projects.  In the end who cares, because you are paid very well for your project even if it's never meant to do anything.",
            "title_similarity": "0.67593217",
            "sentiment_compound": 0.7574
        },
        {
            "id": "h8kqjtp",
            "score": 501,
            "text": "This was my grandfather. He was known as an expert in vulcanized rubber. One day someone he only knew as a \"government official\" came to him and said \"we need you to design a rubber seal to these exact specifications.\"\n\n\"What's it for?\" he asked.\n\n\"...we need you to design a rubber seal to these exact specifications.\"\n\nSo he shrugged and did it. It wasn't until after the bomb was dropped that he realized that that seal could only have been for ensuring nuclear fissile material was secured. He'd been part of the Project and hadn't realized it.\n\nGrampa was a notorious braggart about all his accomplishments. That's the one story he absolutely hated telling, and it took a long time for me to understand why.",
            "title_similarity": "0.64215297",
            "sentiment_compound": 0.1045
        },
        {
            "id": "h8kos5g",
            "score": 131,
            "text": "There's an interesting story told by Richard Feinman (they usually are) where he was sent from Los Alamos to inspect a storage area at an arsenal and ensure radioactive materials were stored safely. Orders had been given to store materials separate rooms in the large arsenal. Workers had followed procedure and distributed materials in separate rooms as instructed. However, nobody had realized that when materials were stacked up on either side of dividing walls, they were actually close enough to possibly become critical. Feinman had to ask a General for permission to explain to officers at the arsenal the highly secret subject of critical mass so they would avoid blowing the place up.",
            "title_similarity": "0.8069501",
            "sentiment_compound": 0.3477
        },
        {
            "id": "h8k1uud",
            "score": 1397,
            "text": "Related, my grandfather told me how he turned down a chance to work on the Manhattan project (unknowingly).  He was in the Army Corp of engineers as a chemical engineer working on nuclear materials, and they wanted him to join “something big”, but he had a family with young kids and he didn’t want to uproot them to move them to New Mexico for something he knew nothing about.  Turned out it was the Manhattan project.",
            "title_similarity": "0.69038856",
            "sentiment_compound": 0.3716
        },
        {
            "id": "h8kcqag",
            "score": 171,
            "text": "My great-grandfather worked on this (he was a university physics professor) and he knew what it was for, but he had to keep it a secret from his wife and children.  My great-aunt (who was 6 or 7 at the time) lived with him at Los Alamos, and she was told that the project was about improving radar technology.",
            "title_similarity": "0.6622345",
            "sentiment_compound": 0.5719
        },
        {
            "id": "h8kblhc",
            "score": 791,
            "text": "They used to hire people to twist a knob to keep a line on a dial in the green area. They were remote controlling centrifuges. Edit, apparently calutrons were the method of the day thanks u/restricteddata",
            "title_similarity": "0.5490322",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h8knilp",
            "score": 224,
            "text": "[deleted]",
            "title_similarity": "0.07905349"
        },
        {
            "id": "h8js0qb",
            "score": 3035,
            "text": "All of the people they hired for routine jobs (janitors, etc.) were illiterate. It was a job requirement so they couldn't accidentally see something.",
            "title_similarity": "0.69280285",
            "sentiment_compound": 0.3181
        },
        {
            "id": "h8jy4mv",
            "score": 3556,
            "text": "Sounds like my job. I’ve been doing it for almost 3 years and I still have no idea what I do.",
            "title_similarity": "0.3796512",
            "sentiment_compound": 0.0772
        },
        {
            "id": "h8kh4sd",
            "score": 243,
            "text": "Truman didn’t even know and he was VP.",
            "title_similarity": "0.41200575",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8kp0w4",
            "score": 358,
            "text": "If I remember right there was a magazine or newspaper editor that realized something was going on because a lot of physicists who were subscribed to him changed their mailing address to New Mexico",
            "title_similarity": "0.5535103",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8jxm56",
            "score": 7788,
            "text": "My grandfather was a mechanical engineer and he was working on the switches of the X-Harness for the Trinity test...had no idea. The X harness was the set of switches and detonators that simultaneously went off on the high explosive sphere surrounding the bomb core to facilitate the perfectly symmetrical implosion necessary for the whole thing to work\n\nI have a huge stack draft cards and rejections of his, he kept getting drafted into the military and he would go through the physical and then get rejected a few days later, they never told him why until way late in the war when he got a paper that said he was \"essential personnel\" and to present the paper if he were ordered to show up at the draft board\n\nE- I'll have to dig everything out and maybe make a post about it somewhere, im sure someone could suggest a good home for a post like that lol",
            "title_similarity": "0.70835584",
            "sentiment_compound": 0.8176
        },
        {
            "id": "h8klo1h",
            "score": 1666,
            "text": "Feynman toured Oak Ridge and found that this secrecy led to a lot of issues, like stacking barrels of uranium nitrate in warehouses in arrangements that could have started a dangerous subcritical fission reaction. He argued with the management that at least the workers needed to know what they were working with and basic safety procedures.",
            "title_similarity": "0.78464425",
            "sentiment_compound": -0.0772
        },
        {
            "id": "h8kft62",
            "score": 7210,
            "text": "\"Say Margaret, what do you do for a living?\"\n\n\"Hell if I know.\"\n****\n*alternatively*\n\n\"I could tell you, but then you still wouldn't know and I'd be committing treason.\"",
            "title_similarity": "0.6324464",
            "sentiment_compound": -0.7351
        },
        {
            "id": "h8kkovr",
            "score": 3174,
            "text": "I highly recommend the book “Surely you’re joking Mr Feynman”. He talks about working at Los Alamos and having to go to a factory to see why the product they were getting from there wasn’t quite right. He saw them wheeling radioactive material around in wheelbarrows. When he told them it was dangerous they all wanted to know what they were making as they hadn’t been told.",
            "title_similarity": "0.7680026",
            "sentiment_compound": 0.1513
        },
        {
            "id": "h8k23rw",
            "score": 7624,
            "text": ">One woman I interviewed, a friend of hers was convinced that Oak Ridge was doing something with urine because all she did all day was label people’s urine samples.",
            "title_similarity": "0.6167552",
            "sentiment_compound": 0.7096
        },
        {
            "id": "h8k9urd",
            "score": 1,
            "text": "\"[Expediting production](https://reddit.com/comments/p1sstn)\", anyone?",
            "title_similarity": "0.24009928",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8kfkp0",
            "score": 2,
            "text": "What a time ('twas) to be alive!",
            "title_similarity": "0.046908252",
            "sentiment_compound": 0.4389
        },
        {
            "id": "h8kiqdj",
            "score": 39,
            "text": "Tom Dowd worked on the Manhattan Project. He went on to produce records for Aretha Franklin, Lynyrd Skynyrd, Allman Brothers, Cream...tons more",
            "title_similarity": "0.48421454",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8kjw50",
            "score": 1,
            "text": "Nothing changed.",
            "title_similarity": "0.04730286",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8klolg",
            "score": 15,
            "text": "Yeah! If the box is clicking, your clock is ticking!",
            "title_similarity": "0.36418238",
            "sentiment_compound": 0.4184
        },
        {
            "id": "h8klwz7",
            "score": 26,
            "text": "My great grandfather’s construction company built a ton of the roads in New Mexico. His company was contracted to build the atomic bomb platform but was not told what it was for and to not ask any questions or tell anyone about it. I’ll have to get the full story from my mom sometime. I believe his company was called “Brown construction” out of Albuquerque.",
            "title_similarity": "0.67696214",
            "sentiment_compound": 0.1154
        },
        {
            "id": "h8krokw",
            "score": 3,
            "text": "Honestly back then I bet 90% of people wouldn't know what radiation is even if they told her.",
            "title_similarity": "0.56379765",
            "sentiment_compound": 0.4588
        },
        {
            "id": "h8krrnp",
            "score": 1,
            "text": "Exactly, a perfect type of work.  \nI don’t know what I am doing.  \nI was told you know what you are doing.  \nMy boss, said they know they know I know what I am doing.  \nI know, because I am doing things I know I am doing.  \nBut still. I don’t know why I am doing it.  \n  \nBut differences is that I get paid.  \nI work in my office.  \nI walk pass subway station.  \n“We don’t need no education”\nSays on the wall.  \n“Proverb 3:5-6”.  \nOh, tell me to submit, again.  \nI wounded, seldomly.  \nWhen will I own my time and it is my time only I can live a sec for myself?",
            "title_similarity": "0.62399006",
            "sentiment_compound": -0.1154
        },
        {
            "id": "h8ks8ez",
            "score": 22,
            "text": "I mean,  you would expect the cleaning crew to have no idea they're working on the worst weapon ever created",
            "title_similarity": "0.6703135",
            "sentiment_compound": -0.7579
        },
        {
            "id": "h8kstik",
            "score": 2,
            "text": "Still true for a wide variety of occupations",
            "title_similarity": "-0.009249378",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h8ktflb",
            "score": 1,
            "text": "The book *American Prometheus* has all kinds of cool details about daily life at Los Alamos.",
            "title_similarity": "0.37644216",
            "sentiment_compound": 0.3182
        },
        {
            "id": "h8kto1p",
            "score": 1,
            "text": "Til I'm working on the Manhattan project",
            "title_similarity": "0.3955248",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8ktvfa",
            "score": 1,
            "text": "and yet Klaus Fuchs was pipelining the important stuff to Moscow.",
            "title_similarity": "0.47918168",
            "sentiment_compound": 0.2023
        },
        {
            "id": "h8ku2sr",
            "score": 3,
            "text": "It's not just about this but it does touch on it: \"surely you're joking, Mr. Feynman!\" Is a great book filled with fun anecdotes from a truly wonderful man, and he talks a lot about the Manhattan project throughout.",
            "title_similarity": "0.4857362",
            "sentiment_compound": 0.9808
        },
        {
            "id": "h8ku36h",
            "score": 15,
            "text": "My uncle also unknowingly worked on the first atom bomb.  He was a scientist and working on one isolated piece.  Unfortunately he and that generation is gone and I can't ask them about it anymore.",
            "title_similarity": "0.64748776",
            "sentiment_compound": -0.7845
        },
        {
            "id": "h8ku7er",
            "score": 11,
            "text": "Read the title and thought of a woman holding a tuba listening for clicking noises.",
            "title_similarity": "0.40102482",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8kuf06",
            "score": 13,
            "text": "Reminds me that business consultants loved the idea of compartmentalisation and hiring specialists to eliminate middle managers to save costs and achieve more in the same amount of money.\n\nSo I worked as an advisor for an educational start up where no one had any connection to the end product.\n\nIt was a mega arena of office politics and lack of motivation.",
            "title_similarity": "0.6504244",
            "sentiment_compound": 0.7184
        },
        {
            "id": "h8kugw4",
            "score": 22,
            "text": "This was how the Death Stars (1&2) were built.",
            "title_similarity": "0.29003426",
            "sentiment_compound": -0.5994
        },
        {
            "id": "h8kuln9",
            "score": 11,
            "text": "It makes you wonder how much other dodgy shit is going on that we have no idea about because we're just \"doing our jobs\"",
            "title_similarity": "0.6317656",
            "sentiment_compound": -0.7717
        },
        {
            "id": "h8kv3rd",
            "score": 1,
            "text": "My grandfather worked on the Manhattan Project and knew exactly what he was doing.",
            "title_similarity": "0.42078215",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8kv83p",
            "score": 3,
            "text": "Need to know basis..",
            "title_similarity": "0.106664516",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8kvh6p",
            "score": 1,
            "text": "Well if it was so secret how did the Russians know???",
            "title_similarity": "0.4603044",
            "sentiment_compound": 0.3899
        },
        {
            "id": "h8kvmu0",
            "score": 2,
            "text": "You do one little job, you built a widget in saskatoon, and the next thing you know its two miles under the desert, the central component of a death machine",
            "title_similarity": "0.42462555",
            "sentiment_compound": -0.5994
        },
        {
            "id": "h8kw2bk",
            "score": 2,
            "text": " \"Its for the greater good\", means fuck you, you are expendable.",
            "title_similarity": "0.30900696",
            "sentiment_compound": 0.2263
        },
        {
            "id": "h8kw6u3",
            "score": 1,
            "text": "I remember seeing an interview with Alfred Hitchcock\n\nHe was making a movie and decided to use Uranium as the plots mcguffin. So he did some research on it and asked a physicist he knew if it was possible to make a bomb out of the stuff, he didn't get a good answer \n\nOnce the bombs dropped in Japan he knew right away",
            "title_similarity": "0.680552",
            "sentiment_compound": -0.6814
        },
        {
            "id": "h8kwa23",
            "score": 3,
            "text": "It’s not that different today, many classified projects are broken down into components and the teams compartmentalized so that the greater goal is hard if not impossible to discern.\n\nIt is how they are able to have folks without clearances work on projects.\n\nSource: Close friend who was not a U.S. citizen did both her PhD and post-Doc work at LANL.",
            "title_similarity": "0.7215843",
            "sentiment_compound": 0.3535
        },
        {
            "id": "h8kwdxv",
            "score": 1,
            "text": "My great grandmother was one of the lead electricians... She was devastated when they told her after the fact. Feelssadman.",
            "title_similarity": "0.58931535",
            "sentiment_compound": 0.0258
        },
        {
            "id": "h8kwwfd",
            "score": 1,
            "text": "It’s amazing to think about, as I don’t think there’s a way to keep that kind of large scale secrecy anymore.",
            "title_similarity": "0.3954893",
            "sentiment_compound": 0.5859
        },
        {
            "id": "h8kwy9q",
            "score": 2,
            "text": "That’s definitely unethical",
            "title_similarity": "0.25945342",
            "sentiment_compound": -0.1531
        },
        {
            "id": "h8kx9ly",
            "score": 1,
            "text": "My great grandmother was part of this in Chicago.  She worked at a factory and had a steady hand and they had her make two pieces with very particular specifications.  She later found out she was making a piece for each AB",
            "title_similarity": "0.5266644",
            "sentiment_compound": 0.8074
        },
        {
            "id": "h8kxivn",
            "score": 1,
            "text": "And yet, two totally separated identical copies of the bomb plans were hand delivered to the Soviet Union , this tells you of the power of logic and belief.",
            "title_similarity": "0.54771745",
            "sentiment_compound": 0.802
        },
        {
            "id": "h8kyj6u",
            "score": 1,
            "text": "J. Robert Oppenheimer said he didn't feel right until he'd \"gone off\" on someone in the morning and berated them, like his cup of coffee. There's a real adrenaline-rush with rage, and it gets to be addicting, so I can relate. I sometimes dream someone will come to the door, so I can verbally abuse them.",
            "title_similarity": "0.5867255",
            "sentiment_compound": -0.6486
        },
        {
            "id": "h8kyuo6",
            "score": 1,
            "text": "\"Many workers\"? The VICE PRESIDENT didn't even know about it!",
            "title_similarity": "0.5480522",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8kz410",
            "score": 1074,
            "text": "Fun fact about the Manhattan project,\n\nThey needed so much copper wire at Oak Ridge there was no way that they could be supplied with the wartime rationing, regardless of the project's AAA priority.  \n\nSo General Groves borrowed all the silver coins in Ft Knox melted them down and spun into electrical wire of pure silver (which is an even better conductor than copper) and used that wire in the Uranium enrichment cyclotrons.    \n\nAfter the war, the silver wire was melted back into bricks and returned to the Treasury Department.",
            "title_similarity": "0.67899156",
            "sentiment_compound": 0.2263
        },
        {
            "id": "h8kz4pj",
            "score": 3,
            "text": "I work in oak ridge. The first Wednesday of every month has sirens go off at noon. Very eerie knowing the past of that town.",
            "title_similarity": "0.45661908",
            "sentiment_compound": -0.4201
        },
        {
            "id": "h8kz65o",
            "score": 1,
            "text": "I lived in Oak Ridge Tennessee in which much of the Manhattan Project was done. I still have family there. If you know where to look you can see some of the old guard towers from the road. People had to have IDs to get in and out of the city for the longest time. The city really has an amazing history to it. If you ever go there there is a restaurant called The Soup Kitchen that has the best soups and the walls have lots of memorabilia from the town.",
            "title_similarity": "0.5343411",
            "sentiment_compound": 0.8505
        },
        {
            "id": "h8kzyxg",
            "score": 1,
            "text": "More reasons to believe in nuclear disarmament.",
            "title_similarity": "0.3851682",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8l04jn",
            "score": 1,
            "text": "How many people, give or take, had full understanding of the project in it's entirety and intended purpose? From every documentary I've ever watched it was never clear to me how many were fully read in, but it seemed like kind of a lot.",
            "title_similarity": "0.46951967",
            "sentiment_compound": 0.3935
        },
        {
            "id": "h8l0cjj",
            "score": 21,
            "text": "Look up Tom Dowd, legendary music producer/engineer. If I recall a quote about his work on the Manhattan Project, he basically left school to work on the project, then went back to school  forced to sit through what he called \"old science\" classes,  unable to speak to the \"new science\" he was working during this project. It was top secret.",
            "title_similarity": "0.7193061",
            "sentiment_compound": -0.296
        },
        {
            "id": "h8l0k9t",
            "score": 50,
            "text": "“Hi, honey! What did you do at work today?”\n\n*Breaks down crying*\n\n“I DON’T KNOW!”",
            "title_similarity": "0.5699917",
            "sentiment_compound": -0.5696
        },
        {
            "id": "h8l0mnj",
            "score": 1,
            "text": "A lot of manufacturing for more mundane things is this way",
            "title_similarity": "0.38826624",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8l0uam",
            "score": 1,
            "text": "I had a coworker who got a job right out of college working on instrumentation for some kind of explosive test. There are photos of him wiring up optical instruments at the Trinity site. \n\nHe said it was a cool job, they even had a plane to do beer runs for them.\n\nhttps://www.atomicheritage.org",
            "title_similarity": "0.5384925",
            "sentiment_compound": 0.3182
        },
        {
            "id": "h8l10i5",
            "score": 1,
            "text": "Later on when the scientists became aware of what they were working on they wrote a letter to congress pleading that it not be used in any populated area\n\nWeird History on YouTube did a video semi-recently about the Manhattan project it’s less than 15 mins long I highly recommend it it’s so interesting",
            "title_similarity": "0.61454713",
            "sentiment_compound": 0.6792
        },
        {
            "id": "h8l1gcn",
            "score": 1,
            "text": "My grandfather worked on the Manhattan Project in Oak Ridge. I specifically asked him about this in the early 80s (before he died). He said that the workers knew very little because the efforts were so compartmentalized. He did say that folks suspected it had something to do with nuclear energy based on the physicists on the project. And I know it might sound corny, but he also mentioned that people were vaguely aware of atomic energy from Flash Gordon. Regardless, he was clear that workers knew that the effort was to make some type of unprecedented type of weapon to stop the war.",
            "title_similarity": "0.7374984",
            "sentiment_compound": -0.7964
        },
        {
            "id": "h8l1kbs",
            "score": 7,
            "text": "I recently just visited Oak Ridge and one of the guides said that even though there were thousands and thousands of workers, only about a dozen men on site actually knew the whole scope of the project. Quite a few higher ups suspected a bomb but they didn't know for sure for a while. Most employees thought they were building a new energy source to power ships and cities.",
            "title_similarity": "0.64599454",
            "sentiment_compound": -0.3276
        },
        {
            "id": "h8l1km2",
            "score": 1,
            "text": "Like the Manhattan Project, wasn't the Cube in the film 'Cube' built and operated without anyone knowing what they were doing?",
            "title_similarity": "0.6031007",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h8l1o8d",
            "score": 5,
            "text": "The show Manhattan is excellent. It’s about the families at Los Alamos. Only two seasons.",
            "title_similarity": "0.29376203",
            "sentiment_compound": 0.5719
        },
        {
            "id": "h8l1sve",
            "score": 1,
            "text": "Someone's been watching QI",
            "title_similarity": "0.10243092",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8l20t2",
            "score": 5,
            "text": "My grandfather stamped out parts in a Detroit factory. They thought it was tank parts.",
            "title_similarity": "0.46559322",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8l2364",
            "score": 3,
            "text": "My great-grandfather was an architectural engineer who helped build the Hanford, WA site. My grandmother told me how her father was only ever in possession of the schematics necessary for that specific day of work, and how he was really confused why the building had so many right angles in its hallways. Really funny in retrospect IMO",
            "title_similarity": "0.6711285",
            "sentiment_compound": 0.1531
        },
        {
            "id": "h8l2ghd",
            "score": 11,
            "text": "My grandmother worked doing various jobs around Oak Ridge. Including working as an operator connecting lines, etc. She said that she recalled having no idea really what they were doing. She said she knew her job, but she also *knew* that there was something more to it, but none of them could figure it out. I think she knew that it was somehow science related, but at that point not necessarily military related. She said she would have to connect to \"Lab ___\" or someone might mention a scientist to be connected to, etc.\n\nShe said it finally clicked when all the operators were told to take a break, as someone important wanted to come in and say hello. She said the next thing she knew, Einstein walked in to say hello to them, made small chit chat then left. He was apparently taking a tour of the facility. She said shortly after, they were debriefed by the military that, along with the general order never to talk about their jobs to anyone outside the facilities, that they were never to mention this to anyone...\n\nShe said that it really, really all clicked when she first heard news that the bombs were dropped.",
            "title_similarity": "0.7266251",
            "sentiment_compound": 0.1531
        },
        {
            "id": "h8l2it9",
            "score": 1,
            "text": "Honestly, this makes me think of the Bob Lazaar documentary I watched recently... \n\nMakes perfect sense.",
            "title_similarity": "0.23236433",
            "sentiment_compound": 0.7717
        },
        {
            "id": "h8l2npu",
            "score": 1,
            "text": "This is what the movie series The Cube was about.",
            "title_similarity": "0.20026971",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8l2osd",
            "score": 1,
            "text": "This would make such a good concept for an Office type sitcom\n\nJust people going about their daily job, getting into petty hijinks, completely obvious to the fact that they're helping to unleash some of the most terrible weapons ever targeted at civilians",
            "title_similarity": "0.6677286",
            "sentiment_compound": -0.5059
        },
        {
            "id": "h8l2rrv",
            "score": 1,
            "text": "True story: Stalin knew about the Manhattan Project before President Truman did!\n\nSource: https://www.atomicheritage.org/profile/joseph-stalin",
            "title_similarity": "0.58713984",
            "sentiment_compound": 0.4753
        },
        {
            "id": "h8l369c",
            "score": 1,
            "text": "that seems rather irresponsible tbh",
            "title_similarity": "0.24263266",
            "sentiment_compound": -0.4404
        },
        {
            "id": "h8l3p3i",
            "score": 1,
            "text": "My wife’s great grandfather worked at oak ridge  we have some of his journals very interesting stuff",
            "title_similarity": "0.3525929",
            "sentiment_compound": 0.796
        },
        {
            "id": "h8l3vl5",
            "score": 6,
            "text": "Take the time to read “Surely you’re joking, Mr Feynman!”  He was a top physicist at the Manhattan Project, and in his down time, learned how to pick locks. Then went around stealing state secrets, leaving jokey notes. His point was all the security was a joke if people could get into locked cabinets so easily. \n\nLater in life he explored psychoactive drugs and became a damn good drummer. \n\nLook up his interviews on YouTube. Pure genius. He looks at life through the lens of, “Fuck it, it’s interesting, I don’t care what people think.”",
            "title_similarity": "0.6864804",
            "sentiment_compound": 0.9218
        },
        {
            "id": "h8l3wrr",
            "score": 1,
            "text": "“Surely You're Joking, Mr. Feynman!\"\n\nIf anyone is interested in the Manhattan Project I highly recommend reading this book. It was like being in the mind of James Bond— but a scientist.",
            "title_similarity": "0.53490996",
            "sentiment_compound": 0.6415
        },
        {
            "id": "h8l4beo",
            "score": 1,
            "text": "I used to work in Oak Ridge. Fascinating history. The children's museum there has a decent recounting of it too.",
            "title_similarity": "0.39635026",
            "sentiment_compound": 0.5423
        },
        {
            "id": "h8l4hox",
            "score": 1,
            "text": "the military didnt inform the local mayor either....they are under no obligation to tell the truth to gov or people - ever.  we fund them.   they get bigger budgets and buy more toys by scaring us with propaganda.   Want a new set of trucks, lets make out the old trucks are all faulty - get a billion dollars.   Insulin...oh hell no.   Thats not for alpha males you cant have that.",
            "title_similarity": "0.57792354",
            "sentiment_compound": -0.8925
        },
        {
            "id": "h8l4jk5",
            "score": 1,
            "text": "I think there were some people that assumed that Oak Ridge TN was a scam, because other workers in other places, they were making tanks and planes\n\nBut at Oak Ridge, large rocks came in, lots and lots of processes happened, but what left was powdered rock\n\nSo objectively, it was hard for workers to say that they were doing anything at all for the war effort. Since powdering rocks shouldn't really require this much equipment and lack of knowing what's happening.",
            "title_similarity": "0.73094726",
            "sentiment_compound": -0.9052
        },
        {
            "id": "h8l519x",
            "score": 1,
            "text": "Sometimes I wonder how compartmentalized top secret productions still are. I see the area 51 planes flying out of Vegas fairly often and don't envy the people on them.",
            "title_similarity": "0.5166338",
            "sentiment_compound": 0.3847
        },
        {
            "id": "h8l5455",
            "score": 19,
            "text": "Veritasium has a video about how Kodak detected early secret nuclear testing because their sensitive films in various facilities kept getting low-grade speckles and they could pinpoint the times they appeared.",
            "title_similarity": "0.743187",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8l5prx",
            "score": 1,
            "text": "This clip from the movie Cube comes to mind: [https://www.youtube.com/watch?v=boDgkH7Yw-0](https://www.youtube.com/watch?v=boDgkH7Yw-0)",
            "title_similarity": "0.20163018",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8l5rfh",
            "score": 1,
            "text": "Would the current equivalent be the making of a Marvel movie?",
            "title_similarity": "0.20284015",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h8l5t4t",
            "score": 43,
            "text": "It's weird to think there was a time in recent memory where Geiger counters weren't common knowledge and everyone didn't know what that ominous clicking noise immediately upon hearing it.",
            "title_similarity": "0.705258",
            "sentiment_compound": -0.4767
        },
        {
            "id": "h8l5ybu",
            "score": 3,
            "text": "Five years later, the USSR had their own atomic bomb thanks to a couple of insiders close to the project feeding them information.\n\nTell this to the \"Moon is a hoax\" crowd.",
            "title_similarity": "0.6006318",
            "sentiment_compound": -0.34
        },
        {
            "id": "h8l64jd",
            "score": 1,
            "text": "Hans Beta’s former secretary at Cornell gave me a teacup that belonged to him.  She lived in my town.  I haven’t had it tested for radiation.  Unfortunately he wasn’t in the habit of signing his teacups.",
            "title_similarity": "0.67942274",
            "sentiment_compound": -0.34
        },
        {
            "id": "h8l6qom",
            "score": 1,
            "text": "My wife's grandfather had a plumbing business in New Mexico during WWII, he was hired to do plumbing at this government facility in Los Alamos. He had no clue what they did there, something toward the war effort, he presumed.",
            "title_similarity": "0.6648761",
            "sentiment_compound": -0.7269
        },
        {
            "id": "h8l6u9w",
            "score": 2,
            "text": "Seems harsh to have someone potentially exposed to radiation without telling them",
            "title_similarity": "0.62636006",
            "sentiment_compound": -0.4939
        },
        {
            "id": "h8l6xmc",
            "score": 1,
            "text": "It wasnt too secret.  The Russians knew all about it.",
            "title_similarity": "0.35031456",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8l6z3z",
            "score": 1,
            "text": "Jobs that require clearance are the easiest\n\nBecause you don't do anything.",
            "title_similarity": "0.39000428",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h8l7abd",
            "score": 1,
            "text": "Truman didn't even know before taking the presidency after Roosevelt passed.",
            "title_similarity": "0.48809904",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8l7lb9",
            "score": 1,
            "text": "WELL MY GRANDPA … yeah I got nothing",
            "title_similarity": "0.21993779",
            "sentiment_compound": 0.6166
        },
        {
            "id": "h8l7mra",
            "score": 1,
            "text": "I have a piece of equipment from The Manhattan Project that came out of Los Alamos Labs. I look at it often and think about the environment that surrounded it when it was in use. Surreal.  \n\nEdit-[Here are some pictures.](https://imgur.com/a/8szY49e)",
            "title_similarity": "0.5439881",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8l7scw",
            "score": 1,
            "text": "It's like me being a customer at any franchise in North America, and it'll somehow make them money as long as I'm being a citizen.",
            "title_similarity": "0.33022803",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h8l7y10",
            "score": 1,
            "text": "Fly plane then pull this lever.",
            "title_similarity": "0.11534663",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8l88jr",
            "score": 11,
            "text": "This is why the argument \"the government could never keep a big thing secret\" doesn't work on me.",
            "title_similarity": "0.56005615",
            "sentiment_compound": -0.3612
        },
        {
            "id": "h8l8jik",
            "score": 2,
            "text": "Wow government is good at keeping secrets. I imagine that even with such a large group of people, still nothing slipped.",
            "title_similarity": "0.5302154",
            "sentiment_compound": 0.7717
        },
        {
            "id": "h8l9ot7",
            "score": 1,
            "text": "Very common with compartmentalized classifications.",
            "title_similarity": "0.021247033",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8l9r5w",
            "score": 12,
            "text": "Funny story about silver.\n\nUranium in nature is about 99% U-238, but...there's a tiny little bit of it that is the highly desirable U-235. Stable enough to be useable, but unstable enough that it can be split up easier. How do you separate the two? Modern day uses centrifuges, but lets go back to 1941, when they weren't really sure yet what the best thing to do would be...\n\nMost of the \"yellowcake\" Uranium oxide came from mines in the Congo, and it was delivered to Union Carbide in Buffalo New York (none of this info is classified). They converted it into Uranium hexafluoride gas for \"reasons\".\n\nIt either went to Oak Ridge Tennessee, or Hanford, Washington. Hydroelectric Dams had been built there during the depression to create jobs, and the local demand had not increased yet, so they had tons of excess electricity.\n\nSomeone figured that one way to separate the U-238 from the U-235 was to shoot it past a strong electromagnet. The slightly lighter variant would be deflected more than the heavier one, so they set up two collectors. Well, making a LOT of large powerful electromagnets was important to do quickly, but that takes a lot of copper wire.\n\nCartridge cases are made from brass, which is roughly 75% copper, and communication systems needed a lot of radios, which also take copper wire. Every tank, plane, and truck needed electric wire. So...someone realized that you could make wire out of silver.\n\nThe Roosevelt administration was already printing a LOT of paper money to pay for the sudden huge war effort, so...they called in all the silver dollars, and most people complied. The Treasury already had tons of the stuff, and they melted down the silver one-ounce coins and had it made into wire for the atomic program. \n\nThe silver dollars we have today from collectors have barely escaped, and very nice examples can be purchased for about $40 each.\n\n https://www.ebay.com/itm/124080419095",
            "title_similarity": "0.4965083",
            "sentiment_compound": 0.9304
        },
        {
            "id": "h8l9vue",
            "score": 1,
            "text": "And the soviets had multiple spies and contacts where the German and Japanese were  usually quickly caught",
            "title_similarity": "0.5383709",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8l9xft",
            "score": 3,
            "text": "One of the many ways our government shows us it cares. Only the war machine matters, never forget this.",
            "title_similarity": "0.47291797",
            "sentiment_compound": -0.0346
        },
        {
            "id": "h8la12z",
            "score": 9,
            "text": "I hear a lot of the workers there actually got depressed at the seeming fact that they weren't doing anything useful for the war effort and were just being dicked around for no purpose.",
            "title_similarity": "0.6234852",
            "sentiment_compound": -0.8958
        },
        {
            "id": "h8lb1eh",
            "score": 1,
            "text": "Lol, this is like working for apple . Most of them are not sure which product are they working on",
            "title_similarity": "0.47895142",
            "sentiment_compound": 0.5168
        },
        {
            "id": "h8lbi0t",
            "score": 3,
            "text": "This is not abnormal even today. It’s good security practice.",
            "title_similarity": "0.22652084",
            "sentiment_compound": 0.6486
        },
        {
            "id": "h8lbk9w",
            "score": 3,
            "text": "That is still very common I suspect.",
            "title_similarity": "-0.024150647",
            "sentiment_compound": -0.3535
        },
        {
            "id": "h8lbwq1",
            "score": 1,
            "text": "I live in Richland Wa where they worked on production for the bombs. This is like one of our towns favorite facts about our upstart, that nobody had any idea what they were doing.",
            "title_similarity": "0.7036519",
            "sentiment_compound": 0.6705
        },
        {
            "id": "h8lcbll",
            "score": 4,
            "text": "Oak Ridge is still pretty secretive about their stuff.  A good friend works at one of the plants doing fancy engineering stuff and I have no idea what he does.  Also, they still test the ‘oh fuck’ alarm once a week and that’s still spooky",
            "title_similarity": "0.7217977",
            "sentiment_compound": 0.6908
        },
        {
            "id": "h8lem6q",
            "score": 1,
            "text": "Not surprised. Hard place for someone naturally inquisitive",
            "title_similarity": "0.25658408",
            "sentiment_compound": 0.0849
        },
        {
            "id": "h8lf1cf",
            "score": 1,
            "text": "Sounds like the extreme sort of division of labor that we usually associate with the Nazis, like in that song about Wernher von Braun (\"where they come down, that's not my department.\")",
            "title_similarity": "0.6075879",
            "sentiment_compound": 0.6124
        },
        {
            "id": "h8lf1vq",
            "score": 5,
            "text": "The word for this is Compartmentalization. You delegate micro portions of a large project to one or two people to the point that they have no idea what they are contributing to the bigger picture.",
            "title_similarity": "0.44989175",
            "sentiment_compound": -0.296
        },
        {
            "id": "h8lf5tt",
            "score": 3,
            "text": "got to love the gov for exposing people to radition",
            "title_similarity": "0.4735437",
            "sentiment_compound": 0.4767
        },
        {
            "id": "h8lfecv",
            "score": 1,
            "text": "There can be only one H. R. Geiger.",
            "title_similarity": "0.17346957",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8lg4rl",
            "score": 1,
            "text": "Sounds like my present day government job.",
            "title_similarity": "0.21516967",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h8lg6sl",
            "score": 1,
            "text": "GA - hello, we have a job for you.\n\nMe - oh ok what is it?\n\nGA - we can't tell you that.\n\nMe - what will I be doing? \n\nGA - we can't tell you that. \n\nMe - Where is it? \n\nGA - we cant tell you that. Do you accept?\n\nMe - Absolutely.",
            "title_similarity": "0.4693894",
            "sentiment_compound": 0.6966
        },
        {
            "id": "h8lge87",
            "score": 3,
            "text": "Richard Feynman wrote about how one of his jobs was safety.  He had to look at floor plans from facilities that produced the materials to go into nuclear bombs, and because no one knew what they were for, they would just put them wherever they had space; sometimes along walls or corners that had other reactive materials on the opposite side, posing a serious hazard. At the age of 22, he had higher clearance than the facility managers, and so he had difficulty convincing them to change storage practices.",
            "title_similarity": "0.78176975",
            "sentiment_compound": 0.0865
        },
        {
            "id": "h8lgzth",
            "score": 1,
            "text": "I'm a little late to the party, but one of the best things the government did afterwards was publish the Smyth report, the history of the Manhattan project. Leslie Groves, the military head of the project, wrote in the foreword:\n\n> All pertinent scientific information which can be released to the public at this time without violating the needs of national security is contained in this volume. No requests for additional information should be made to private persons or organizations associated directly or indirectly with the project. Persons disclosing or securing additional information by any means whatsoever without authorization are subject to severe penalties under the Espionage Act.\n\nNot only did this report tell us what the Manhattan project was and what we were doing, it told everyone involved what they could or couldn't talk about.",
            "title_similarity": "0.72079873",
            "sentiment_compound": 0.9057
        },
        {
            "id": "h8lhbd8",
            "score": 1,
            "text": "Ooooooh OP, you been listening to Isaac’s podcast?",
            "title_similarity": "0.26847818",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8lhyk5",
            "score": 5,
            "text": "Hanford needed an absorbent, lint-free wipe to clean the reactor process tubes.  Turned out that Kotex feminine pads worked perfectly.  Nobody knew why a secret facility in the middle of the dessert with mostly men would need Kotex by the boxcar load.",
            "title_similarity": "0.6693163",
            "sentiment_compound": 0.7845
        },
        {
            "id": "h8li3e9",
            "score": 2,
            "text": "Colonel Sanders was the cafeteria manager for the Manhattan Project.",
            "title_similarity": "0.4150973",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8liu3h",
            "score": 3,
            "text": "Had a family friend who's father worked on the Manhattan Project. No idea if he knew what he was doing, but he died at 42 of \"old age\".",
            "title_similarity": "0.5825727",
            "sentiment_compound": -0.6597
        },
        {
            "id": "h8lj5zk",
            "score": 6,
            "text": "Yup. My grandpa was an MP stationed at Los Alamos for over a year and then he was the head MP at the Trinity site (now called White Sands Missile Range) for another several years. He was personal guard to Enrico Fermi when they left the site for supplies. Up until the night before the first detonation, he was only ever told that he was guarding \"a project that will lead to a device that will end the war and save American lives.\" This was all from late 1941 - 1945.\n\nThanks to the Manhattan Project Heritage Association (now the Atomic Heritage Foundation), my grandpa was able to donate many of his keepsakes and letters to the museum at Los Alamos and at White Sands. A photo of he and the other MPs still hangs inside the McDonald Ranch House.\nHere is a link to his profile on the Atomic Heritage Project website:\nhttps://www.atomicheritage.org/profile/marvin-davis-sr",
            "title_similarity": "0.6067866",
            "sentiment_compound": 0.296
        },
        {
            "id": "h8ljk1c",
            "score": 3,
            "text": "The DOD still operates like this.(Sort of)\n\nWith highly sensitive machinery or communication devices they contract multiple fabricators to build single or very few components. Giving only the prints for the individual components. I believe they do this with programming as well.",
            "title_similarity": "0.60124636",
            "sentiment_compound": 0.7402
        },
        {
            "id": "h8lkecc",
            "score": 3,
            "text": "Look up the Calutrons Girls. They were young women hired to work at Y-12 at Oak Ridge National Laboratory. Many were just out of high school, and were tasked with monitoring the Calutron, which was the machine that separated enriched uranium isotopes.\n\nSeated at the calutrons’ control panels, these women were responsible for monitoring the devices’ meters and adjusting the dials as needed. The Calutron Girls were given absolutely no information about the significance of what they were doing; the training they received pertained strictly to the task at hand.",
            "title_similarity": "0.7586529",
            "sentiment_compound": 0.6258
        },
        {
            "id": "h8lkjvb",
            "score": 2,
            "text": "This was literally in the comments section of the Harry Truman TIL yesterday.",
            "title_similarity": "0.38364035",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8lksoe",
            "score": 2,
            "text": "Compartmentalization? What? No way they could keep something like that a secret!",
            "title_similarity": "0.45791405",
            "sentiment_compound": 0.2387
        },
        {
            "id": "h8lla3s",
            "score": 3,
            "text": "Compartmentalization. All future wars, development and production of war materiel today.\n\nNo one person makes a weapon authorizes its use and goes somewhere to deploy / employ it. \n\nThe only people knowing full well whats behind it all are the engineers that thought it up.\n\nSo whos really responsible for Agent Orange, Depleted Uranium, White Phosphorous and Napalm.",
            "title_similarity": "0.64194167",
            "sentiment_compound": -0.7872
        },
        {
            "id": "h8lm3k7",
            "score": 1,
            "text": "3.6 roentgen, not great, not terrible. Guess I can wash them.",
            "title_similarity": "0.3124943",
            "sentiment_compound": -0.6645
        },
        {
            "id": "h8lmlia",
            "score": 1,
            "text": "My manager used to be secretive too. We’d get a new Broyhill living room set in and he’d rest his “scrotum” on it and say he’s testing the weight capacity with his “balls of steel”",
            "title_similarity": "0.5953641",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8lmm27",
            "score": 3,
            "text": "I’ve always heard that the Manhattan Project site locations were chosen in part because of a local population that had a high level of skilled laborers AND high levels of illiteracy.",
            "title_similarity": "0.5405986",
            "sentiment_compound": -0.4404
        },
        {
            "id": "h8lmy39",
            "score": 5,
            "text": "Tons of people didn't know what the hell they were doing at Oak Ridge. Just keep the dial between 2 and 10, little lady!",
            "title_similarity": "0.6109365",
            "sentiment_compound": -0.7088
        },
        {
            "id": "h8lnmjb",
            "score": 41,
            "text": "ITT: Everyone's grandparents worked on the Manhattan Project.",
            "title_similarity": "0.46295965",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8lnmra",
            "score": 2,
            "text": "People think this is so old school but if you work in the defense industry this is normal. You work on super secret stuff without knowing the end goal.",
            "title_similarity": "0.6854322",
            "sentiment_compound": 0.7964
        },
        {
            "id": "h8lnmsd",
            "score": 2,
            "text": "Mine is in the shop",
            "title_similarity": "0.22909147",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8lnubp",
            "score": 4,
            "text": "Compartmentalization allows organizations to accomplish some globe-altering shit with only a few key people knowing what the heck is actually going on.",
            "title_similarity": "0.5555789",
            "sentiment_compound": -0.2023
        },
        {
            "id": "h8lpgxp",
            "score": 1,
            "text": "It's funny that, given the times and purpose of the project, that the sign depicts a Japanese pun.\n\n\"Mizaru, kikazaru, iwazaru.\" \\(見ざる, 聞かざる, 言わざる\\)\n\nThe \"-zaru\" negative form to make it \"See not, hear not, say not.\" sounds like \"monkey\" in Japanese.",
            "title_similarity": "0.43930426",
            "sentiment_compound": -0.4423
        },
        {
            "id": "h8lqvpk",
            "score": 3,
            "text": "Reminded me of Desmond in the hatch",
            "title_similarity": "0.17510065",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8ls530",
            "score": 6,
            "text": "I grew up next to Hanford, one of the areas of the Manhattan project in Washington State. One of my neighbors was an elderly engineer who is Black. Today, he is one of the higher paid engineers and he started back at Hanford. He is incredibly intelligent, stubborn, and clever as well as very sweet. \n\nHe retired about twelve years ago, moved to Arizona with his wife. Hanford bought him a house, paid for all his groceries, meal delivery, and more for him to come back and help with the cleanup project. His wife refused to go, waited for him in Arizona. He finally got to retire two years ago, for good this time, despite the money they kept offering him.\n\nI never knew what he really did out there originally, he wouldn't talk about it. But he did talk about the cleaning project. How it was cathartic to be fixing some of the mistakes of America and making the area safer.\n\nI made him cookies often, and he loved them. One time I took them over when his wife was visiting. She was livid at him. He was diabetic and supposed to avoid sweets but never told us as he loved sweets. Had to switch to healthier snacks for him to take to work!",
            "title_similarity": "0.56890273",
            "sentiment_compound": 0.9663
        },
        {
            "id": "h8lsoaw",
            "score": 2,
            "text": "After WW2 my grandfather built atomic bombs for a while.  \nThe government had a hearing on it a few years before he died.  Even when officials told them that they were good to talk about it most of them didn't.\nNo one in my family knew anything about it prior to.  They called it \"section q classified\"  if I remember.",
            "title_similarity": "0.6896435",
            "sentiment_compound": 0.0485
        },
        {
            "id": "h8lt3dz",
            "score": 3,
            "text": "Years ago while working for a convalescent service I was transporting a patient from one hospital to another. While reviewing their medical documents for notation I kept seeing conditions I had no knowledge of and on one of the conditions it said 'secondary to employment on the Manhattan project'. It was such a 'history to home' moment for me and really opened my eyes to the (sometimes unwilling/unknown) sacrifice so many made for that bomb.",
            "title_similarity": "0.75346804",
            "sentiment_compound": -0.6597
        },
        {
            "id": "h8ltmir",
            "score": 2,
            "text": "Tom dowd and the sound of music is a great documentary that touches on this",
            "title_similarity": "0.2417318",
            "sentiment_compound": 0.6249
        },
        {
            "id": "h8lu0rx",
            "score": 1,
            "text": "My grandfather worked for Uniroyal/Union Carbide and they knew something was up with the barrels they were moving as after awhile they had people coming in to x-ray their hands for some unknown reason.\n\nFound out later that it was related to the Manhattan Project...\n\nYears later he ended up with prostate and liver cancer. As soon as he does, they yanked his golden parachute, leaving my grandmother to scramble to get things taken care of.",
            "title_similarity": "0.6857619",
            "sentiment_compound": -0.296
        },
        {
            "id": "h8lu4vo",
            "score": 2,
            "text": "Hmmmm it’s like the government employed 130,000 people to developed weapon of war that was so compartmentalized that it was kept secret from even the people creating the purified uranium. I wonder if stuff like this still goes on today",
            "title_similarity": "0.6719089",
            "sentiment_compound": 0.0258
        },
        {
            "id": "h8lu894",
            "score": 1,
            "text": "“Radiac”",
            "title_similarity": "-0.04471232",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8lubdk",
            "score": 2,
            "text": "Don't say it's impossible for conspiracy to occur when \"so many people would leak\" the info.",
            "title_similarity": "0.507403",
            "sentiment_compound": -0.7003
        },
        {
            "id": "h8lulz4",
            "score": 2,
            "text": "Hmm the fact that someone doesn’t know about how secretive government operations are....TIL that the Sun is hot and causes things on Earth to be hot as well, weird.",
            "title_similarity": "0.58039576",
            "sentiment_compound": 0.1027
        },
        {
            "id": "h8luxnx",
            "score": 1,
            "text": "Weren’t there moles inside anyway?",
            "title_similarity": "0.42754292",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8lv14d",
            "score": 2,
            "text": "Those of us who have worked there in recent decades still didn’t go by titles outside of specific rooms.\n\nNever worked on anything that was classified, although I figured out what they wanted from the overall project. Hi FBI and NSA! \n\nBtw, still get visits once a year or so to check up on things, yeah really",
            "title_similarity": "0.6427693",
            "sentiment_compound": 0.3595
        },
        {
            "id": "h8lv6wd",
            "score": 1,
            "text": "The Russians knew everything from the start - in fact the first Russian atomic bomb was an exact copy of the American one. Not so secret after all.",
            "title_similarity": "0.524729",
            "sentiment_compound": -0.4939
        },
        {
            "id": "h8lxaey",
            "score": 1,
            "text": "Trust the government",
            "title_similarity": "0.233399",
            "sentiment_compound": 0.5106
        },
        {
            "id": "h8lxcvp",
            "score": 9,
            "text": "Great grandpa worked on this (chemist) and got a medal from it. \nLiterally NO ONE in the family knew that he worked on it, let alone got a medal. Great grandma found it wrapped in an old pair of underwear or socks while cleaning out his drawers after he died",
            "title_similarity": "0.6148689",
            "sentiment_compound": 0.7825
        },
        {
            "id": "h8ly01x",
            "score": 2,
            "text": "Same thing at Camp Hanford In Washington, (they would be producing plutonium).\n\nMy Granddad was a Pipefitter and speaks of the days a pipe could come though a plywood board, hiding everything else, and he connected it to a pipe that went out another Plywood board, blocking any viewing.",
            "title_similarity": "0.65553826",
            "sentiment_compound": -0.5859
        },
        {
            "id": "h8lyn53",
            "score": 1,
            "text": "I imagine that's the kind of thing that once you learn it, it keeps you up at night.",
            "title_similarity": "0.27423286",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8lz4cx",
            "score": 2,
            "text": "There’s a story in my family of these guys in unmarked black cars and suits coming to my grandparents house. My grandpa was a welder and they said they wanted him to make something and if he tells anyone what he made he wouldn’t see his family again. He thought he made part of the shell casing of the bomb.",
            "title_similarity": "0.628934",
            "sentiment_compound": 0.6124
        },
        {
            "id": "h8lz4eh",
            "score": 3,
            "text": "Hindsight being 20/20 this is perfectly reasonable and understandable, but if I started working somewhere where everyone did a job for some unknown reason, that would be considered a major red flag.",
            "title_similarity": "0.53745186",
            "sentiment_compound": 0.3818
        },
        {
            "id": "h8lzm10",
            "score": 1,
            "text": "It's called \"Compartmentalization\", and the very reason conspiracy theories abound in such large numbers, the reason for torture and atrocities on such a large scale in the west.",
            "title_similarity": "0.5315633",
            "sentiment_compound": -0.8214
        },
        {
            "id": "h8lzsxc",
            "score": 1,
            "text": "Jim must really like his job. He always has a glow about him when he leaves work for the day.",
            "title_similarity": "0.30983865",
            "sentiment_compound": 0.4201
        },
        {
            "id": "h8m0foj",
            "score": 3,
            "text": "I’m gonna be honest, I have no idea why I do my job.",
            "title_similarity": "0.5033149",
            "sentiment_compound": 0.2732
        },
        {
            "id": "h8m0p5e",
            "score": 2,
            "text": "I worked with a woman who grew up in Los Alamos at that time.  She thought it was a normal thing to go into town using a pseudonym and be followed around by agents.  The Manhattan project was no joke.",
            "title_similarity": "0.63781863",
            "sentiment_compound": -0.2235
        },
        {
            "id": "h8m2vtb",
            "score": 1,
            "text": "As someone who lives in oak ridge (the secret city), I can confirm that the details were extremely top secret. It was around the Great Depression so people didn’t ask questions as long as they were payed. Throw in the fact they didn’t want the slightest possibility of the Axis powers finding out what they were doing, the VICE PRESIDENT wasn’t told till Roosevelt’s death and he took office. The city wasn’t even supposed to be permanent, a lot of the old houses were definitely made to last a short time, enough to get the job done",
            "title_similarity": "0.7128038",
            "sentiment_compound": 0.1513
        },
        {
            "id": "h8m2wx2",
            "score": 2,
            "text": "Think about how the Philadelphia Experiment folks felt… “speak to man melted into metal floors… tell no one”.",
            "title_similarity": "0.6464186",
            "sentiment_compound": -0.296
        },
        {
            "id": "h8m2xa3",
            "score": 1,
            "text": "My father in law worked at Oakridge enriching uranium.  He did know what it was for.  Imagine the relief finding out the war was over and at the same time learning you helped kill so many.",
            "title_similarity": "0.51949966",
            "sentiment_compound": -0.7579
        },
        {
            "id": "h8m2xyq",
            "score": 1,
            "text": "Sounds a lot like the plot to the “cube” movies",
            "title_similarity": "0.16993354",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h8m3efa",
            "score": 2,
            "text": "My grandfather was part of the physics division on the Manhattan Project. Him and my grandmother were part of the first wave of folks that moved to Los Alamos and lived there while it was a secret community. My grandmother taught calculus at the school in town. \n\nI spent my summers as a child at their home hiking and camping and exploring the canyons with them. He was a very  severe, very secretive, and very intelligent man. I wish I’d have asked him more about his work and life while he was alive, though I doubt he would’ve told me much. \n\nWe do have some good stories in the family though, from my dad and his siblings, and my grandmother.",
            "title_similarity": "0.6583816",
            "sentiment_compound": 0.7269
        },
        {
            "id": "h8m3wu6",
            "score": 1,
            "text": "People flying into work at Area 51 think they are working at Carlsbad Caverns",
            "title_similarity": "0.44427276",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8m4czf",
            "score": 1,
            "text": "I Have no idea why I do my job everyday except that I like living indoors.",
            "title_similarity": "0.4312153",
            "sentiment_compound": 0.0772
        },
        {
            "id": "h8m4l13",
            "score": 1,
            "text": "Tbh a lot of people work their jobs and how no idea why... Haha",
            "title_similarity": "0.44994757",
            "sentiment_compound": 0.2023
        },
        {
            "id": "h8m4ri2",
            "score": 1,
            "text": "compartmentalization",
            "title_similarity": "0.03589107",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8m52r1",
            "score": 1,
            "text": "Boss tell me if instrument go click you die",
            "title_similarity": "0.38123834",
            "sentiment_compound": -0.5994
        },
        {
            "id": "h8m58jl",
            "score": 3,
            "text": "My daddy worked on the Manhattan project as an engineer and I do know that the five or six guys he kept up with after the project did not mention their work there in their obituaries.  He was also tracked by the FBI for 15 years afterwards. This was routine and understood by the engineers when they were assigned to the project.\n\nDaddy wasn’t a big deal there - he was just one of thousands of young college graduates.\n\nNone of his friends died of cancer. They all had heart attacks & lived out their normal life spans - in fact,  one of them is still alive. No kidding.",
            "title_similarity": "0.5811616",
            "sentiment_compound": -0.7876
        },
        {
            "id": "h8m5fgz",
            "score": 1,
            "text": "*But there's no way thousands of people could have kept this a secret!!*",
            "title_similarity": "0.47185788",
            "sentiment_compound": -0.5242
        },
        {
            "id": "h8m5puc",
            "score": 1,
            "text": "Still common practice for some industrial shops.\n\nYou'll make aeronautical parts, but never know what the completed part is, or what it belongs to.\n\nEdit: also very common for the militaries of the world.",
            "title_similarity": "0.5644306",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8m5qu7",
            "score": 1,
            "text": "I heard this many years ago. That's the way a lot of secret projects are done. Very few people knew what was going on. Not even the. Vice President knew. I also heard it consumed 10% of the country's electrical production. Somehow they even managed to keep it a secret after the Trinity test. It would have been a different story if the implosion device didn't work. At the time refining uranium was a very slow process but making plutonium was easy. I watched The Day After a couple days ago. It was the 1983 tv movie made about a nuclear exchange between the U. S. and Soviet Union.",
            "title_similarity": "0.69602585",
            "sentiment_compound": 0.5927
        },
        {
            "id": "h8m60hc",
            "score": 1,
            "text": "hmmm .. interesting",
            "title_similarity": "-0.08539839",
            "sentiment_compound": 0.4019
        },
        {
            "id": "h8m6i3w",
            "score": 1,
            "text": "...and yet Stalin had a pretty good idea",
            "title_similarity": "0.16776703",
            "sentiment_compound": 0.7269
        },
        {
            "id": "h8m6oqr",
            "score": 1,
            "text": "Currently reading the book To Hell and Back, which covers the bombing of Hiroshima and Nagasaki, and it is pretty apparent that none of the people that participated in dropping the bombs really knew what they were carrying. Just that it was a new experimental weapon that would end the war.\n\nHighly recommend the book. Very eye opening to the horrors that occured with those bombs.",
            "title_similarity": "0.74411345",
            "sentiment_compound": -0.8558
        },
        {
            "id": "h8m6qp6",
            "score": 2,
            "text": "The Manhattan Project national parks / museums are supposedly good. We have visited the Los Alamos lab site. There are also sites in Oak Ridge TN and Hanford WA. They are currently closed due to Covid. \n\nThe day we visited this summer, volunteers where outside talking with models and books. An elderly gentleman explained the science to us. He asked how deep we wanted to go? We said, all the way. He went way above the basic college chemistry class, and therefore way over our heads. He went h through atomic theory, the history of the program, and the thoughts behind the two bomb designs. He was obviously a retired scientist. He was incredible. It was worth the trip to spend a half hour with that man. \n\nThe boarding school that the government took over is still there too. Neat old timber lodge.\n\nEdit: The museum is also open. Only the national park is closed.",
            "title_similarity": "0.6831826",
            "sentiment_compound": 0.5945
        },
        {
            "id": "h8m77jy",
            "score": 2,
            "text": "It was and probably still is a sort of operational security protocol used for all classified projects. Given the fact it was used for development of the U2, A-12 Oxcart, B2 and F117, all at Area 51, seems pretty much like a common practice.",
            "title_similarity": "0.5302078",
            "sentiment_compound": 0.7787
        },
        {
            "id": "h8m7ezq",
            "score": 1,
            "text": "Nice new tidbit. Ty. \nFYI, the picture shown was taken by a cousin of mine and was the only color picture of the test. \nAlso, my dad worked at the Lab in the mid 1990's-2006 which afforded me the opportunity to visit the fairly restricted site. Very cool. Still has Trinitite spewed all over and the molten scaffolding. Got my dose of radiation that day handling the pebbles. So pretty though. And tasty. Lol.",
            "title_similarity": "0.57983446",
            "sentiment_compound": 0.933
        },
        {
            "id": "h8m7gy5",
            "score": 2,
            "text": "tl;dr \"Employees had no idea they were being poisoned and why.\"",
            "title_similarity": "0.64230776",
            "sentiment_compound": -0.6597
        },
        {
            "id": "h8m7hnv",
            "score": 1,
            "text": "First I thought of is [Consuela from Family Guy](https://static.wikia.nocookie.net/familyguyfanon/images/1/15/Consuela.png/revision/latest/scale-to-width-down/260?cb=20161215031734)\n\nNo... no.  You click.  No.  Mista Griffin, you click.",
            "title_similarity": "0.28315598",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8m7p90",
            "score": 2,
            "text": "I wonder if that's what it was like working on the Death Star",
            "title_similarity": "0.39156497",
            "sentiment_compound": -0.34
        },
        {
            "id": "h8m7sm0",
            "score": 1,
            "text": "Iirc the Eureka tv show was based on oak ridge",
            "title_similarity": "0.10482535",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8m7wpq",
            "score": 1,
            "text": "Richard Feynman was asked to do an investigation into why the Manhattan project was running so late. His eventual conclusion: the project was so secret, people didn't know what they were doing, so sometimes, they made incorrect guesses due to lack of knowledge. His recommendation (which was approved): widen the circle of people who knew.",
            "title_similarity": "0.7913097",
            "sentiment_compound": 0.128
        },
        {
            "id": "h8m8b9g",
            "score": 2,
            "text": "Consider this hour long, essentially TED Talk from 1975 about Richard Fenynman's involvement in the project, with about a dozen funny stories involved. His sense of humor is only matched by his wit.  \n\n\nLos Alamos From Below\n\n[https://www.youtube.com/watch?v=uY-u1qyRM5w](https://www.youtube.com/watch?v=uY-u1qyRM5w)",
            "title_similarity": "0.41347125",
            "sentiment_compound": 0.6553
        },
        {
            "id": "h8m8otk",
            "score": 3,
            "text": "[deleted]",
            "title_similarity": "0.07905349"
        },
        {
            "id": "h8m8q7m",
            "score": 1,
            "text": "A friends grandfather was a contractor and the house he was tasked of building had one wall that was two feet thick, he had no idea why, but when he pointed out what he thought was their mistake on the blueprints they told him it had to be that way.\n\nOnly later he realized the building was meant to withstand a nuclear blast.",
            "title_similarity": "0.70691043",
            "sentiment_compound": -0.3919
        },
        {
            "id": "h8m90ji",
            "score": 4,
            "text": "My mother grew up in Oak Ridge, lived there for a while myself when i was younger. Never even learned much at all about the manhattan project in school and the museum related to it is about a 20 minute walkthrough. I hear media still gets turned away when they try to further report/investigate. No swimming in the lake(s), don’t drink tap water, don’t go too deep into the woods, all things I remember hearing when I was younger. All together some really interesting history I never even knew about the town until I was older",
            "title_similarity": "0.5941852",
            "sentiment_compound": 0.2006
        },
        {
            "id": "h8ma5ij",
            "score": 3,
            "text": "I had the honor of seeing much of the facilities and tour the underground labs when I was a contractor to DOE back in the 1980s when a lot of it was still operating. Saw some interesting stuff. It was always interesting and at the meetings, we had there from time to time they often showed us what they were working on up to our clearance levels. I worked at the NTS in Nevada but my job took me to many labs, reservations, and testing facilities.",
            "title_similarity": "0.6373509",
            "sentiment_compound": 0.5859
        },
        {
            "id": "h8maj8i",
            "score": 3,
            "text": "Another thing I found interesting about these camps was that it was during war times and other jobs and resources weren’t as available. Like food wasn’t aplenty. But at the camps they made a point to feed them well. It’s probably one reason things worked out so well. That and back then the odds of the Axis powers taking over Europe and the Pacific then coming after the US was a very real threat.",
            "title_similarity": "0.6263858",
            "sentiment_compound": 0.1013
        },
        {
            "id": "h8maoqn",
            "score": 2,
            "text": "My grandfather had that very job in Los Alamos. He would do rounds and record the numbers. He didn't know what he was doing, what they were doing or even where he was. The letters he would send home were in different envelopes and much of the content was blacked out. My grandmother had a very rough time not knowing where in the world he was or what he was doing. Very little communication was allowed out of that place.",
            "title_similarity": "0.7462187",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8maos4",
            "score": 3,
            "text": "Tom Dawd, a world famous sound engineer (developer of the 4 track) worked on the manhattan project in the physics department, at Manhattan university. After his part was done, he was unable to move up a grade in his education because his classes were all classified. He returned to remedial physics to continue his work towards his PHD, only to lose interest because the physics he was being taught was now flawed because he had helped to further theory for the creation of the atom bomb.",
            "title_similarity": "0.7465394",
            "sentiment_compound": -0.5994
        },
        {
            "id": "h8mb65j",
            "score": 1,
            "text": "Oooo! New reddit fad!",
            "title_similarity": "0.21591184",
            "sentiment_compound": 0.3578
        },
        {
            "id": "h8mbagk",
            "score": 1,
            "text": "And people still think they can trust their government?",
            "title_similarity": "0.3008377",
            "sentiment_compound": 0.5106
        },
        {
            "id": "h8mbdvx",
            "score": 1,
            "text": "When I hear stuff like this it makes me question Bob Lazar",
            "title_similarity": "0.3315701",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h8mc5ow",
            "score": 3,
            "text": "The [Calutron girls didn’t know what they were doing either.](https://www.energy.gov/articles/five-fast-facts-about-calutron-girls)",
            "title_similarity": "0.6226299",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8mcxy6",
            "score": 2,
            "text": "There are several reasons for this, but the utmost of them is secrecy. If you don't know what the other guy is doing, you can't tell anyone. Not only that, people from different disciplines neither saw nor talked to each other. The mathematicians just worked on the math, without a clue as to what the equations described. The physicists had the best overall sense of what was happening, but still to a limited degree. A *big* reason why the MP was so successful, and *no one else in the world had a clue*.",
            "title_similarity": "0.7323265",
            "sentiment_compound": 0.9224
        },
        {
            "id": "h8mczl9",
            "score": 2,
            "text": "My great uncle was a physicist who worked on some aspect of the project unknowingly. He and his colleagues thought they were working on something related to alternative energy solutions. He never talked about it and the only reason I ever found out was because I did a school interview with him about his WWII experiences.",
            "title_similarity": "0.6524066",
            "sentiment_compound": 0.7845
        },
        {
            "id": "h8md2nd",
            "score": 1,
            "text": "May I dare ask, \"What Manhattan Project?\"",
            "title_similarity": "0.34312814",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8mddg2",
            "score": 3,
            "text": "An older friend's father worked on the Manhattan Project, and didn't even know where he was (University of Chicago) for for the first 8-9 months he was there. Even after they found out where they were, they had no clue what they were doing, though he and the other guys he was working with began to suspect they were doing grunt work for the development of a top-secret biological or chemical weapon to be used in an absolute emergency. \n\nThe only reason they were able to guess \"weapon\" was because he and a bunch of other guys with B.S. degrees in pure sciences were taken out of line while waiting for transport to the ship to take them to Europe to fight, and had raised their hands when a high-ranking officer asked for enlisted men with experience in lab work. Their collective knowledge of their fields led them to believe that the main focus was biology and chemistry, and the physics was simply something to do with a delivery method. I don't even know how they got that, since their days mainly consisted of cleaning labs and lab equipment.",
            "title_similarity": "0.7423284",
            "sentiment_compound": -0.9001
        },
        {
            "id": "h8mdn4s",
            "score": 3,
            "text": "See I already knew this since I live near the Manhattan project, and like 90 percent of employed citizens in our city still work there, and many still have to keep their jobs confidential.",
            "title_similarity": "0.62413037",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h8mf7tf",
            "score": 1,
            "text": "This reminds me that there are stories I never knew or bothered to ask my grandfather about what he did and now I’ll never know. 😢😀 \n\nI do know that he was a researcher and at least one of the designers of the fast flux nuclear reactor at Hanford. I do know he worked on the hydrogen bomb tests on the bikini atoll. I once heard him say to someone, “Alamogordo?! That’s my old stompin’ grounds!”\n\nI wonder if he worked on the original \nManhattan project. I wonder what else he knew that the rest of us didn’t and maybe still don’t. \n\nSide note: I also know that, as a PhD in chemistry, he laid out all the specifications for a glass whiskey still and had “the boys in the glass shop” at Hanford fab all the parts for him which he smuggled home piece by piece so he could homebrew distill. If that’s not punk rock, I don’t know what is. I made it clear to him that I was I interested in his still, but it was probably long gone by then. #crosspost #picobrew #picostill.",
            "title_similarity": "0.6946871",
            "sentiment_compound": 0.722
        },
        {
            "id": "h8mff9a",
            "score": 1,
            "text": "It's still pretty much the case today in a lot of classified, compartmentalized jobs. Pass a widget to a guy in a room, he pokes at it, passes it out of the room. No idea what it's for or what it does, although they are probably aware it's something to do with the military.",
            "title_similarity": "0.7191175",
            "sentiment_compound": 0.25
        },
        {
            "id": "h8mfzoi",
            "score": 1,
            "text": "great source\n\nhigh level of scholarship on this site",
            "title_similarity": "0.12422156",
            "sentiment_compound": 0.6249
        },
        {
            "id": "h8mgnqf",
            "score": 1,
            "text": "Siloing.",
            "title_similarity": "-0.028555097",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8mgyh7",
            "score": 4,
            "text": "Informed consent was not as big a thing back then, clearly. I wonder if the people working on the project knew they were being exposed to / working near radioactive materials?",
            "title_similarity": "0.67441523",
            "sentiment_compound": 0.5106
        },
        {
            "id": "h8mk5cp",
            "score": 3,
            "text": "My great grandfather was a high level military scientist. This was after the Manhattan project. He worked during Korea and the Cold War. He had a collegue in Russia that he would write, and each letter written to or from this collegue arrived at it's destination with 3 copies: the original, the CIA's copy, and the KGB's copy. Sometimes he would include little notes in the letters for the agents,  like Christmas wishes and stuff.  In addition to this, he was followed by government agents for years. He wasn't allowed to talk about his job for decades. Eventually, at least some of the tech he developed was declassified after newer stuff came out, so he was allowed to talk about the declassified stuff. Apparently he developed some cutting edge missile navigation tec, that was used for quite a while and that the government really didn't want other countries to know about. He also did some work with nuclear warheads.",
            "title_similarity": "0.639855",
            "sentiment_compound": 0.5573
        },
        {
            "id": "h8mpqr5",
            "score": 1,
            "text": "If anyone is interested in the whole story 'The making of the atomic bomb' is fantastic. The book is long but brilliant.",
            "title_similarity": "0.531668",
            "sentiment_compound": 0.8047
        },
        {
            "id": "h8mvpww",
            "score": 2,
            "text": "Makes sense. Wouldn't be a secret project if laundry service gossiped about it to their grandmas.",
            "title_similarity": "0.6072292",
            "sentiment_compound": -0.2732
        },
        {
            "id": "h8n79h2",
            "score": 3,
            "text": "My uncle was a graduate engineering student at Princeton during the Project.\n\nIt wasn’t until after the war that he found out much of his work there was related to the Manhattan Project. \n\nHe felt tremendous guilt for many years afterwards.",
            "title_similarity": "0.64073366",
            "sentiment_compound": -0.7425
        },
        {
            "id": "h8n96jy",
            "score": 1,
            "text": "Compartmentalization. You know only what you\nneed to know.",
            "title_similarity": "0.30087632",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8na1nj",
            "score": 1,
            "text": "My great grandfather was an electrician and he had no idea what he was working on till after the project was completed and they gave him a certificate thanking him for his contribution. He tore it up out of anger, but my great grandmother kept the pieces and stored them knowing it would be an important part of history.",
            "title_similarity": "0.6712727",
            "sentiment_compound": 0.8151
        },
        {
            "id": "h8nkcog",
            "score": 1,
            "text": "I don't know much about how the government kept these things so quiet, but I do know that fear played a huge part.  I had a client give me some old computer parts and tools from the Yucca mountain project and a month later a different client came into my office and noticed the items and mid conversation asked where I got them.  As I started my sentence, he stopped me, put his hands up and stopped me, as if he remembered what would happen if he talked about it.  He said never mind, he didn't want to know, and with his hands still up, backed towards our door and left.  That was a scary moment even for me as I stared at the roll of IDE cable and the tool used to cut it.",
            "title_similarity": "0.7308401",
            "sentiment_compound": -0.8636
        },
        {
            "id": "h8ntggk",
            "score": 1,
            "text": "Where I went to college, Iowa State University, manufactured over 900 tons of uranium metal for the Manhattan Project, in the middle of campus no less!\n\nOne of the production workers didn't care so much for safety procedures and was constantly covered in green uranium tetrachloride dust. His nickname was the Green Hornet.",
            "title_similarity": "0.67178285",
            "sentiment_compound": -0.2631
        },
        {
            "id": "h8nzzlx",
            "score": 1,
            "text": "If I had that job, and nobody told me why, I know I would start phoning it in. After a few days of no clicks I'd just be writing up my reports every day without even turning the Geiger counter on. \"No clicks again. Just like yesterday. And the day before . . . \" \n\nI bet there were a some huge fuck-ups caused by folks who started cutting corners, not realizing that those \"corners\" were actually the most important part of their job.",
            "title_similarity": "0.69422233",
            "sentiment_compound": 0.4927
        },
        {
            "id": "h8o4qsl",
            "score": 1,
            "text": "Read *The Girls of Atomic City* if you want to learn more about this! It's a great book, highly recommend!",
            "title_similarity": "0.43590197",
            "sentiment_compound": 0.8306
        },
        {
            "id": "h8obdtz",
            "score": 1,
            "text": "Donald trump uncle worked for manhattan project ( May have beeb his gpa can’t remember off top and I don’t feel like looking it up again lol",
            "title_similarity": "0.5741696",
            "sentiment_compound": 0.7269
        },
        {
            "id": "h8oe20b",
            "score": 1,
            "text": "Delete this post before conspiratards see it",
            "title_similarity": "0.38072565",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8p6tfl",
            "score": 2,
            "text": "This is a good counterpoint when people say large-scale conspiracies cannot exist because they require the silence of too many. Silence is easier when the people don't know the purpose of their actions.",
            "title_similarity": "0.56370306",
            "sentiment_compound": 0.6908
        },
        {
            "id": "h8py880",
            "score": 1,
            "text": "At the time, this was cutting edge physics. Nuclear physics would have been as abstruse to normal people back then as string theory is to regular people now. Imagine if some MIB looking guy came into your work and told you that your life depending on you doing some rain dance every 28.4 minutes to prevent a 26 dimensional manifold from collapsing into a singularity or something.",
            "title_similarity": "0.66966987",
            "sentiment_compound": -0.3818
        },
        {
            "id": "h8zlog2",
            "score": 1,
            "text": "The church we attended when we first moved here to Oak Ridge was one of the first ones built in Oak Ridge. There were still a lot of folks attending who were part of the Project. One of the most amazing machinists/mechanics I ever met was a member of the church. \"I machined parts. They'd bring me a drawing, I'd tell them why we couldn't make it and then show them how we could.\" Another was a chemist/mathematician. The day after he graduated from college, the Army came and got him and sent him here after a quick stint at Officer's Training School. He told me that after the war ended, he was released from the Army and came to work the next day in a suit and tie. Worked there for the next 35-40 years. Some brilliant, brilliant people that were there.",
            "title_similarity": "0.56259835",
            "sentiment_compound": 0.8313
        },
        {
            "id": "hhbwpd4",
            "score": 1,
            "text": "I've recently found that some researchers, like scientist Tom Heinsbergen, were aware of the project and employed boron as a non-radioactive neutron moderator to isolate neutrons for their experiments.  \nAt the same time, there were also some of those who were unaware of the project and unknowingly used boron as a constructive material for assistant inventions.",
            "title_similarity": "0.66009146",
            "sentiment_compound": -0.0258
        }
    ]
}