{
    "TIL that when Wayne Rogers left M*A*S*H, the producers tried to sue him for breach of contract. They discovered that Rogers had never actually signed his contract, having objected to a morals clause, and that he had been a free agent the entire time.\n": [
        {
            "id": "h8pbzf9",
            "score": 4,
            "text": "Replacing him with BJ Honeycutt was a huge step down.  That was the beginning of preachy MASH.",
            "title_similarity": "0.5534656",
            "sentiment_compound": 0.3182
        },
        {
            "id": "h8pe1ei",
            "score": 7,
            "text": "You're telling me a show that literally had a black character named \"Spearchucker Jones\" had bad moral clauses in their contracts... no....\n\nEDIT: For the asshole who PMed me saying I was just trying to be a racist making shit up...\n\nhttps://mash.fandom.com/wiki/Oliver_Harmon_%22Spearchucker%22_Jones",
            "title_similarity": "0.67544234",
            "sentiment_compound": -0.9022
        },
        {
            "id": "h8p9lzq",
            "score": -4,
            "text": "I'm not a lawyer, but I took a business law class.  Even if a contract is unsigned, I believe it can still be binding if both parties acted on it.  I think it's considered implied agreement.  However, not having a signed contract probably gives either party more leeway to get out of commitments.  Again - not a lawyer.",
            "title_similarity": "0.59638923",
            "sentiment_compound": 0.9209
        },
        {
            "id": "h8pbjnb",
            "score": 0,
            "text": "Can they then sue for wages paid? Since he never signed then he shouldn’t be paid the amount that was in the contract?",
            "title_similarity": "0.76545954",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8ppj1f",
            "score": 0,
            "text": "If Will Ferrel were handsome....",
            "title_similarity": "0.11814528",
            "sentiment_compound": 0.4939
        },
        {
            "id": "h8pyahk",
            "score": 0,
            "text": "Don Draper status",
            "title_similarity": "0.03859958",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8oulpj",
            "score": -8,
            "text": "McLean Stevenson (Colonel Blake) left the show for similar reasons.\n\n Rumor has it his character was killed off in the final scene of his departure episode at Alda's insistence to prevent his character from ever returning to the show.",
            "title_similarity": "0.73757803",
            "sentiment_compound": -0.6597
        },
        {
            "id": "h8p7kxo",
            "score": -1,
            "text": "I think that long term contracts in general are somewhat immoral.  If a giant corporations hands a poor actor a contract, the poor actor doesn't have a choice.  He has to sign it or become homeless.",
            "title_similarity": "0.6961139",
            "sentiment_compound": -0.8363
        },
        {
            "id": "h8pqm5k",
            "score": 1,
            "text": "What’s a morals cause?",
            "title_similarity": "0.040311016",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8qkxs3",
            "score": 1,
            "text": "Wayne Rogers was infinitely better than that humorless prig Mike Farrell who replaced him. Rogers and Alda were one of the best tv duos ever.",
            "title_similarity": "0.39142066",
            "sentiment_compound": 0.7003
        },
        {
            "id": "h8po5wq",
            "score": 4,
            "text": "There shouldn't BE morals clauses.  At least not for free.  You want control of behavior off the clock, that should come at a SIGNIFICANT premium.",
            "title_similarity": "0.512208",
            "sentiment_compound": 0.0338
        },
        {
            "id": "h8ojnxa",
            "score": 149,
            "text": "[deleted]",
            "title_similarity": "0.21750994"
        },
        {
            "id": "h8onlwd",
            "score": -8,
            "text": "he was unmemorable on the show anyways.",
            "title_similarity": "0.5627159",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8os8qy",
            "score": 0,
            "text": "Worked out well for him...",
            "title_similarity": "0.00830999",
            "sentiment_compound": 0.2732
        },
        {
            "id": "h8p8jcg",
            "score": 0,
            "text": "Hell yeah fuck producers",
            "title_similarity": "0.36494237",
            "sentiment_compound": -0.7845
        },
        {
            "id": "h8pagg8",
            "score": 0,
            "text": "[deleted]",
            "title_similarity": "0.21750994"
        },
        {
            "id": "h8pgzg2",
            "score": 0,
            "text": "r/thathappened",
            "title_similarity": "0.059556402",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8pkaj0",
            "score": 0,
            "text": "Comments don't seem to understand that the signature on the contract doesn't matter if you go ahead with the proposal anyway..",
            "title_similarity": "0.5787257",
            "sentiment_compound": -0.0191
        },
        {
            "id": "h8pkps5",
            "score": 0,
            "text": "Best MASH trivia question ever. Nobody IRL *ever* gets it:\n\n*What was the name of the guy on the phone who Radar always called?*",
            "title_similarity": "0.56161547",
            "sentiment_compound": 0.6369
        },
        {
            "id": "h8pmp6g",
            "score": 0,
            "text": "Hope he was paid up then, because they weren't contractually obliged to give him any money.",
            "title_similarity": "0.5171716",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h8ps2ri",
            "score": 4,
            "text": "[deleted]",
            "title_similarity": "0.21750994"
        },
        {
            "id": "h8q1nje",
            "score": 0,
            "text": "Fuk yeah, Wayne!",
            "title_similarity": "0.15229195",
            "sentiment_compound": 0.3595
        },
        {
            "id": "h8q8l21",
            "score": 0,
            "text": "I did this at rehab with piss testing",
            "title_similarity": "0.414223",
            "sentiment_compound": -0.4019
        },
        {
            "id": "h8on7tc",
            "score": -1,
            "text": "r/MASH",
            "title_similarity": "0.043008775",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8orh19",
            "score": 1,
            "text": "He died of cancer at a fairly young  age too, didn't he.",
            "title_similarity": "0.51073766",
            "sentiment_compound": -0.8402
        },
        {
            "id": "h8pb1xy",
            "score": 1,
            "text": "Smart",
            "title_similarity": "-0.13675514",
            "sentiment_compound": 0.4019
        },
        {
            "id": "h8pcag2",
            "score": 1,
            "text": "Maybe I'm wrong but I thought if you act in a manner in which to receive the benefit of a contract it's deemed accepted, wet ink not required.\n\nI'm surprised he got away with this",
            "title_similarity": "0.59009326",
            "sentiment_compound": 0.5575
        },
        {
            "id": "h8pcqz6",
            "score": 1,
            "text": "And he went on to a great career of … um … er….  ahh ….  What did he ever do again?",
            "title_similarity": "0.27372915",
            "sentiment_compound": 0.6249
        },
        {
            "id": "h8pfszv",
            "score": -1,
            "text": "[deleted]",
            "title_similarity": "0.21750994"
        },
        {
            "id": "h8pjfa8",
            "score": 1,
            "text": "I'd rather kept him and lost Hawkeye.",
            "title_similarity": "0.44555062",
            "sentiment_compound": -0.3182
        },
        {
            "id": "h8ppjti",
            "score": -1,
            "text": "[How has nobody mentioned Kevin Smith's story about Prince yet?](https://www.youtube.com/watch?v=SAFfsMl79Yc)",
            "title_similarity": "0.5768216",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8qlykj",
            "score": -1,
            "text": "When I hear mash music, it's time to go outside.",
            "title_similarity": "0.08902119",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8p89y8",
            "score": 7,
            "text": "TLDR;\nThe “morals clause” stated the studio can fire him if he’s ever seen doing something that could look bad upon the studio. He asked the front office to sign; they refused. He never signed.",
            "title_similarity": "0.85280955",
            "sentiment_compound": -0.7964
        },
        {
            "id": "h8pp6na",
            "score": 2,
            "text": "I think I remembered there also being talk he had some issues with being Alan Alda's sidekick, whereas his character Trapper was supposed to be equal in status. This was also the reason McLean Stevenson left (Henry Blake), something he later regretted. Blake's death in the series was basically the studio saying: \"well f** off then\". Ironic enough , it turned out to be the most iconic moment of the series. They had a point though. I liked Hawkeye, but sometimes it became a tad too much the Alan Alda show, especially the \"dear dad\" episodes are hard to swallow.",
            "title_similarity": "0.6964886",
            "sentiment_compound": 0.2886
        },
        {
            "id": "h8pp71a",
            "score": 2,
            "text": "Impossible to enforce non compete where I live. I always change the wording before I sign.",
            "title_similarity": "0.5896775",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8ppzar",
            "score": -2,
            "text": "When I learned Alan Alda started to make it about him, I lost interest in the reruns. The first 3 seasons were the best.",
            "title_similarity": "0.57337415",
            "sentiment_compound": 0.7096
        },
        {
            "id": "h8q8yk1",
            "score": 2,
            "text": "I always hated that he left the show. McLean Stevenson too.",
            "title_similarity": "0.6747937",
            "sentiment_compound": -0.6369
        },
        {
            "id": "h8op6o5",
            "score": -19,
            "text": "Same thing happened to me.\n\nBut since I was on the record saying; \"I don't believe in morals\" -- the courts went the other way in the contract lawsuit.\n\nSince they won the case with a contract that was open ended -- they took their revenge. And THAT is how the world got to witness the abomination that was the cop show T. J. Hooker. And they called it \"Hooker\" because it was written for a prostitute who turns crime fighter. How the dialog for \"Tootsie Sparkles\" worked so well with my character acting still haunts me.",
            "title_similarity": "0.7112545",
            "sentiment_compound": -0.2983
        },
        {
            "id": "h8oiovi",
            "score": 4,
            "text": "Like McCartney and the Beatles contract with Alan Klein. Smart.",
            "title_similarity": "0.25715706",
            "sentiment_compound": 0.6369
        },
        {
            "id": "h8oxe5p",
            "score": 3,
            "text": "[deleted]",
            "title_similarity": "0.21751001"
        },
        {
            "id": "h8pbzuq",
            "score": 3,
            "text": "I've heard of people getting whole houses b/c banks lost the actual paperwork after the loan was sold 5 times .",
            "title_similarity": "0.51620483",
            "sentiment_compound": -0.3182
        },
        {
            "id": "h8pcjy1",
            "score": 3,
            "text": "very trapper john",
            "title_similarity": "0.3219758",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8peyno",
            "score": 2,
            "text": "That’s actually pretty damn in-character",
            "title_similarity": "0.08624534",
            "sentiment_compound": 0.128
        },
        {
            "id": "h8pmut3",
            "score": 3,
            "text": "I had a job try to hold me, threatening contract violation and that they'd go after me. I asked them to show me the contract I signed. They were shit in general and I had the contract, still unsigned, in my truck. The office people rushed around a little and then finally grudgingly saw it my way.",
            "title_similarity": "0.7177313",
            "sentiment_compound": -0.8807
        },
        {
            "id": "h8pr1uf",
            "score": 3,
            "text": "I did that with an Non Compete and Education contract I was given as a PC tech many years ago. When I quit they tried to charge me for all the certification testing I took and tried to keep me from taking another job in the area. When they said to me \"you signed an Non Compete\" I told them to look at it. There was no sig, I didn't like it so I faxed it back to corporate without a signature and they filed it without looking at it. Also even if I had signed it, they had us fax it to them and without an actual signed copy it wouldn't be able to be enforced anyway.",
            "title_similarity": "0.78557694",
            "sentiment_compound": -0.5122
        },
        {
            "id": "h8r225d",
            "score": 4,
            "text": "Something similar happened to me. I contacted a new internet company for my house. The internet guy come to my house, conect everything,before that i told him that i would not sign if the speed wasnt the one announced. He was like \"sure,im just putting this here as a placeholder\". Alright. He said he would comeback the next day to give me the contract and verify speed. He never did,i even called him and he rejected the call. So 2 months pass, the internet company send me some bills and i call them to ask what was that about. They said i have to pay and i told them that i never signed anything,they eventually stopped trying. Of course they cut the internet but i never cared about it,i had another company to sign me in. Also pandemy happened around that time so i could not even give them stuff back. Pretty sure im blacklisted now tho.",
            "title_similarity": "0.6824732",
            "sentiment_compound": 0.4857
        },
        {
            "id": "h8ogy62",
            "score": 38,
            "text": "> But it turns out Rogers had pulled a fast one on the producers.\n\nThat's not really pulling a \"fast one\". That's the producers' staff failing to follow up on an unsigned contract, a pretty big oversight.",
            "title_similarity": "0.77110535",
            "sentiment_compound": -0.0387
        },
        {
            "id": "h8opi12",
            "score": 38,
            "text": "WTF?  I was today years old (almost 50) when I found out Trapper John, MD was Trapper John from M\\*A\\*S\\*H \n\nMy whole life has been a lie.",
            "title_similarity": "0.6642668",
            "sentiment_compound": -0.6739
        },
        {
            "id": "h8pa4i4",
            "score": 4,
            "text": "Good for him...hope he was happy after.",
            "title_similarity": "0.12935522",
            "sentiment_compound": 0.765
        },
        {
            "id": "h8pdsbu",
            "score": -4,
            "text": "I have tried, but never could get into this boring program.",
            "title_similarity": "0.6359887",
            "sentiment_compound": -0.5326
        },
        {
            "id": "h8qpzzb",
            "score": 5,
            "text": "I refused to sign a contract with a company when it was a customer support role because it said \"all ideas technologies etc developed while employed by the employer belong to the employer\" \n\nI insisted that it was too vague, what about things I develop on my own (I do write software) and that if they changed it to something like \"developed on company time or using company materials\" \n\nA couple days later they said HR refused to alter it so I picked up my stuff and walked out.\n\nThey had to gall to ask if I would finish my shift \"I said what.... After we just concluded that I won't work under your rules? Nope.\"",
            "title_similarity": "0.8109255",
            "sentiment_compound": 0.1027
        },
        {
            "id": "h8pogsv",
            "score": 5,
            "text": ">“Well, there were just some things we couldn’t agree on. For example, they had an old-fashioned morals clause. …” Rogers said. “And, the clause literally said, I can’t quote this quite verbatim, but it was something to the effect of if in the eyes of the studio you commit an act deemed to be immoral by whoever’s running the studio, then they have the right to suspend you or dismiss you – or whatever the consequences were. …”\n\n\nThe world has changed so much! \n\nOn the one hand you have people getting fired for morals breaches all the time.\n\nOn the other hand, you have people becoming president while discussing touching other people on the pussy. \n\nI feel like we're in a middle of a cultural war and in the end nothing will honestly change. Some things will become immoral other immoral crap will become moral. And we'll continue fighting on and off forever.",
            "title_similarity": "0.7323368",
            "sentiment_compound": -0.9681
        },
        {
            "id": "h8oej45",
            "score": 17,
            "text": "holy shit king",
            "title_similarity": "0.17393051",
            "sentiment_compound": -0.5574
        },
        {
            "id": "h8onsv7",
            "score": 68,
            "text": "Same thing happened to me.\n\nBut I told them I had no morals repeatedly, so the courts did not uphold the morals clause and charged me with fraud.\n\nAnd THAT is how the world got to witness the cop show travesty named *T. J. Hooker.* They named it \"Hooker\" just to rub it in that the series was originally named for a prostitute who turns crime fighter.",
            "title_similarity": "0.77231616",
            "sentiment_compound": -0.9643
        },
        {
            "id": "h8peaya",
            "score": 7,
            "text": "Lucky he got out of that contract, so he could go on to do nothing.",
            "title_similarity": "0.5955503",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h8p7u31",
            "score": 7,
            "text": "I liked BJ Hunnecutt better anyway",
            "title_similarity": "0.102440566",
            "sentiment_compound": 0.6908
        },
        {
            "id": "h8q5bbh",
            "score": -8,
            "text": "[deleted]",
            "title_similarity": "0.21750994"
        },
        {
            "id": "h8oor9l",
            "score": -9,
            "text": "Same thing happened to me.\n\nBut since I was on the record saying; \"I don't believe in morals\" -- the courts went the other way in the contract lawsuit.\n\nSince they won the case with a contract that was open ended -- they took their revenge. And THAT is how the world got to witness the abomination that was the cop show *T. J. Hooker.* And they called it \"Hooker\" because it was written for a prostitute who turns crime fighter. How the dialog for \"Tootsie Sparkles\" worked so well with my character acting still haunts me",
            "title_similarity": "0.7142326",
            "sentiment_compound": -0.2983
        },
        {
            "id": "h8ph2js",
            "score": 9,
            "text": "Imagine what it must have been like for the actors who left the series and were replaced by better actors with better characters.\n\nNobody could replace Radar, but...\n\n...BJ was an upgrade from Trapper.  Trapper was likable, but BJ had depth of character.\n\n...Winchester was a huge upgrade from Burns.  Both were obnoxious, but Frank Burns was just a vapid rage machine.  Winchester had depth of character, and getting rid of Burns allowed Margaret's character to grow.  The show became much better.\n\n...Sherman Potter was a massive upgrade from Henry Blake.  Henry was a likable goofball, but that was all his character could offer.  Potter's chanracter had so much more depth.\n\nNobody could replace Radar, but the other three departures made the show better.",
            "title_similarity": "0.61380005",
            "sentiment_compound": 0.6597
        },
        {
            "id": "h8ot71f",
            "score": 10,
            "text": "Hollywood producers slip up again due to knee deep in cocaine.",
            "title_similarity": "0.5975996",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8pxnn5",
            "score": 10,
            "text": "I used to work for Compuserve back in the day. AOL bought us out and on day one, they had us all sign NDA and separation agreements for the massive layoffs they assured us wouldn't happen.\nWithin the separation agreement was a clause that we would never speak poorly of AOL, their officers or the staff, in perpetuity or face repaying the separating package .\n\nWe scanned the document into an OCR application reworded the clause to remove the word \"NOT\" and printed it out on AOL letterhead.. We figured they would be getting about 2000 back would just look at the last page to see if we signed it. About 400 hundred staff signed OUR version.\n\nSo, FUCK YOU AOL, Steve Case, Bob Pittman- you all suck and should burn in hell for the pain you caused to thousands of people.",
            "title_similarity": "0.66255796",
            "sentiment_compound": -0.8494
        },
        {
            "id": "h8op5bn",
            "score": -13,
            "text": "Same thing happened to me.\n\nBut since I was on the record saying; \"I don't believe in morals\" -- the courts went the other way in the contract lawsuit.\n\nSince they won the case with a contract that was open ended -- they took their revenge. And THAT is how the world got to witness the abomination that was the cop show T. J. Hooker. And they called it \"Hooker\" because it was written for a prostitute who turns crime fighter. How the dialog for \"Tootsie Sparkles\" worked so well with my character acting still haunts me",
            "title_similarity": "0.71352684",
            "sentiment_compound": -0.2983
        },
        {
            "id": "h8oewm0",
            "score": 208,
            "text": "Sounds like the M\\*A\\*S\\*H production team was not militant with their contracts.",
            "title_similarity": "0.5763193",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h8p0bl2",
            "score": 24,
            "text": "MASH is one of my all time favorite IPs.  And, it’s very unique in that I first love the show, followed by the movie, then the book.\n\nI can’t think of any other property where I love them in Show —> Movie —> Book order.",
            "title_similarity": "0.38416967",
            "sentiment_compound": 0.9081
        },
        {
            "id": "h8q259c",
            "score": 22,
            "text": "Years ago, I moved in to my girlfriend's apartment. She was adamant that I go and sign the co lease (or whatever it's called) and, while I really intended to, never did. She then cheats on me, starts to move out, then gets that little kick to the gut. I moved my shit out and never looked back",
            "title_similarity": "0.7539968",
            "sentiment_compound": -0.7506
        },
        {
            "id": "h8oi1q0",
            "score": 194,
            "text": "Attorneys:  “Bad news, we can’t get him on breach of contract.  Good news, we don’t have to pay him residuals any more!”",
            "title_similarity": "0.6508765",
            "sentiment_compound": 0.4199
        },
        {
            "id": "h8ospei",
            "score": 123,
            "text": "No in his league, but my job was cut and I was let go.  A month or so the company discovered that I was an “officer” on a couple of their LLC companies.  They had to ask nicely to get me to resign.  My friends thought I should ask for payment to do so, but I just had a good laugh and sent them my resignation letter.",
            "title_similarity": "0.70882624",
            "sentiment_compound": 0.8625
        },
        {
            "id": "h8p283i",
            "score": 39,
            "text": "I did the same thing at a former employer when the company I worked for was bought by a larger company who wanted us all to sign a highly restrictive non-compete agreement. I told the new-company manager, “Gotta have my lawyer eyeball it first”, to which he replied “Sure, sure - just get it back to me as soon as you can”. Lawyer said, “Don’t sign it and don’t ever mention it to them - see what happens”. I didn’t sign or turn it in, nobody ever said “Boo” about it, and I kept working there for years.",
            "title_similarity": "0.79767525",
            "sentiment_compound": 0.6969
        },
        {
            "id": "h8ohbwy",
            "score": 40,
            "text": "I had no idea he was dead. I'd seen him on TV discussing stocks several times and just assumed he was still going. He didn't look anywhere near to being in his eighties when I saw him last.",
            "title_similarity": "0.6799242",
            "sentiment_compound": -0.7579
        },
        {
            "id": "h8paocw",
            "score": 37,
            "text": "'Duck' Phillips:  Don, you can either honor your contract, or walk out of that door with nothing and start selling insurance.\n\nDon Draper:  I don't have a contract.",
            "title_similarity": "0.69981325",
            "sentiment_compound": 0.4939
        },
        {
            "id": "h8pg6o7",
            "score": 44,
            "text": "My dad ordered towels from a large industrial supply company.  They tried to nearly double the price he was paying for them, so he went out and bought his own towels and an industrial washer.  The company told him he couldn't do that because he had a contract.  He asked to see that contract, so they sent him a copy \"he\" had signed.  They didn't even spell his name right.",
            "title_similarity": "0.69757634",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8omjsg",
            "score": 1031,
            "text": "Everyone seems to like the Trapper episodes more, but I prefer BJ (joke innuendos to follow).  Trap and Hawkeye were too similar in their characters, BJ offered more contrast to Hawk",
            "title_similarity": "0.3205461",
            "sentiment_compound": 0.1531
        },
        {
            "id": "h8olbx2",
            "score": 70,
            "text": "I seem to recall an episode where Sidney Freedman said he didn't sign his draft card...I think Flagg was in the episode too, maybe?\n\nHaven't watched the show in a number of years, but if my memory is correct, it makes me wonder if the writers were poking fun at the situation a little bit.",
            "title_similarity": "0.74893653",
            "sentiment_compound": 0.7311
        },
        {
            "id": "h8ptaq4",
            "score": 87,
            "text": "I signed a noncompete contract with WPLR-FM radio in New Haven, Connecticut back in 1997 but immediately discovered that I'd made a huge mistake, my boss was a horrible dick. I approached them about breaking the contract and talked my boss's boss (an even bigger dick) into a meeting to discuss. I arrived early for the meeting and saw their copy of my contract sitting on his desk so I picked it up, put it in my briefcase, walked out the front door, never looked back and went to work for WTIC - AM & FM in Hartford the next week. I have no idea what the conversation was like when they discovered both the contract and I was gone, but I am guessing they didn't have too much good to say about me...it was SO satisfying!",
            "title_similarity": "0.8073803",
            "sentiment_compound": -0.4798
        },
        {
            "id": "h8ofg0u",
            "score": 211,
            "text": "Should've had Radar look over those contracts first.",
            "title_similarity": "0.3989037",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8ogs1m",
            "score": 117,
            "text": "I wonder what was in the Morals clause.  That would have been funny  in a sense because he would be expected to uphold certain morals off screen, but on screen the character would have broke most of them.",
            "title_similarity": "0.59936976",
            "sentiment_compound": -0.296
        },
        {
            "id": "h8p973l",
            "score": 117,
            "text": "We had a honesty pledge at college where you had to sign it to promise not to cheat. It went in your file and if you were caught cheating you were expelled (it was very unforgiving). \n\nOne of the clauses on the pledge was that you would report any cheating you knew of, even if you were no involved. Basically a snitch requirement. Failure to do that could also get you expelled. \n\nA friend of mine knew he wouldn't actually do that, so he crossed out that clause and initialed the deletion, then signed the form and turned it in.\n\nNo one seemed to notice.",
            "title_similarity": "0.7538066",
            "sentiment_compound": -0.7731
        },
        {
            "id": "h8ohs3p",
            "score": 471,
            "text": "I wonder if this was the inspiration for the elisode where the CIA officer threatens to kick Sidney Freedman out of the army for not signing his loyalty oath when he was drafted.\n\nEdit- spelling",
            "title_similarity": "0.73270994",
            "sentiment_compound": 0.0129
        },
        {
            "id": "h8p26ho",
            "score": 119,
            "text": "When an administrator would ask me to sign something. I'd cross out what I didn't want signed it turned it in. They just filed it after checking signature. \nI had one broker sign an employment agreement. It said no cross outs. I crossed it out lol. Later we had a small disagreement. I told him I crossed it out. He told me I couldn't there were no cross outs ! I told him that's one of the things I crossed out. He laughed, we got along great. We worked it out.\nGood luck",
            "title_similarity": "0.67743254",
            "sentiment_compound": 0.9456
        },
        {
            "id": "h8oeima",
            "score": 2358,
            "text": "A completely M.A.S.H. thing to do. Stayed in character the whole time, the champ.",
            "title_similarity": "0.3117717",
            "sentiment_compound": 0.4767
        },
        {
            "id": "h8ph4yv",
            "score": 441,
            "text": "My then girlfriend /now wife and I rented our first apartment some 25ish years ago.  On key pick up day, the regular lady was sick and her cover lady just took my check and gave me the key.   She said to just come sign the lease another day. I said “ have her call me when she is back”\n\nShe never called , so I never mentioned it.\n\n3 months later my job was taking us out of state for a great opportunity.  I go up to the office to pay our final rent  and tell them We would be moving at tge end of the month.\n\n“Well, as you know, you will need to pay the remainder of your one year lease” she says snooty as can be.\n\n“I dont have a lease” I said\n\n“Haha, of COURSE you have a lease… how else could you be living here??  So we will need 9 months rent from you”\n\n“Well, let me see my lease then……. I just want to double check it….. that does not seem right”\n\nHUFFFFFFFF!\n\nShe reaches  in a drawer, slaps a file on the desk opens it and there it is….. an unsigned lease.\n\nThe look of realization on her face as she became aware that  there was a fuck up was priceless.\n\nI said, “ So, do you want a check for this months rent, or do you just want to use the security deposit for it?\n\nShe did not answer me, just stared.\n\nSo I said, “ok then keep the security deposit for the last month then” and walked out.",
            "title_similarity": "0.6399989",
            "sentiment_compound": 0.7212
        },
        {
            "id": "h8om0z9",
            "score": 2667,
            "text": "I do this when I work, except it's on the Non-Compete. I've only ever been called out on it once, and I just told them that the wording would prevent me from working in pretty much any job in the city so I wanted it changed. They said they'd get back to me with the updated form, and never did.\n\nI haven't signed a non-compete in ten years.",
            "title_similarity": "0.76020247",
            "sentiment_compound": 0.5106
        },
        {
            "id": "h8ogtj8",
            "score": 240,
            "text": "The replacement B.J. was awesome as well and I really came to like him. Same with Sherman and Winchester.",
            "title_similarity": "0.19469395",
            "sentiment_compound": 0.8387
        },
        {
            "id": "h8oh7zk",
            "score": 9555,
            "text": "Ha something similar happened to me once. I had a dispute with an employer and they cited a contract I had signed. That contract was still in my work bag - I’d forgotten to hand it over!",
            "title_similarity": "0.7134999",
            "sentiment_compound": 0.3164
        },
        {
            "id": "h8pea11",
            "score": 281,
            "text": "I do voiceovers and a common clause in Non Union contracts is \"In Perpetuity\" meaning the producers can use your work forever. \n\nSo, back when i was non-union, I booked a campaign that was not a Perpetuity gig, it was a 2 year deal according to the audition terms. But when I got the contract after recording, it suddenly said \"In Perpetuity.\" I crossed that out, added \"2 year term\" and initialed it right in front of the Producers who countersigned. \n\nSure enough, just over 2 years later, they start airing the spots again. I sent my contract to my agent who contacted the Producers who insisted it was In Perpetuity but then backtracked and admitted when we sent the contract that they looked right past the edit when they signed and agreed to the terms, which actually screwed up their budget to air the spots.\n\nI got paid for another 2 year cycle and they hopefully learned not to screw over actors or it might bite them in the ass.\n\nEDIT: typo/spacing",
            "title_similarity": "0.6410963",
            "sentiment_compound": 0.0372
        },
        {
            "id": "h8ow389",
            "score": 1100,
            "text": "I worked at a company that wanted me to sign an NDA. I told them to send it to me and I would. They never sent it to me, so I was not under NDA the whole time I worked there.\n\n\nIt never amounted to anything as I acted like I was on NDA just on principle, but I did think it was funny they just fucked that up.",
            "title_similarity": "0.836336",
            "sentiment_compound": -0.3612
        },
        {
            "id": "h8pbwn5",
            "score": 390,
            "text": "My apartment complex apparently lost a bunch of lease agreements and asked everyone to come in and re-sign. I put it off for several weeks and then we moved out. They came at us with all kinds of legal claims and I just replied \"I don't recall signing anything ... ?\", and they stopped calling.",
            "title_similarity": "0.74947",
            "sentiment_compound": -0.1531
        },
        {
            "id": "h8ohjn5",
            "score": 13561,
            "text": "he wouldn’t sign the morals clause on principle and [he asked the execs who ran the studio to sign one first ](https://outsider.com/news/entertainment/mash-star-wayne-rogers-revealed-beef-studio-forced-departure/)but they refused which is pretty funny",
            "title_similarity": "0.8413501",
            "sentiment_compound": 0.5994
        },
        {
            "id": "h8oriie",
            "score": 3,
            "text": "\"Here's lookin' up your old address.\"",
            "title_similarity": "0.15761435",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8oxeky",
            "score": 5,
            "text": "\"Wait he was a free agent?\"\n\n\"Always has been\"",
            "title_similarity": "0.37310284",
            "sentiment_compound": 0.5106
        },
        {
            "id": "h8oxwiy",
            "score": 9,
            "text": "He pulled a Don Draper.",
            "title_similarity": "0.060277164",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8p02pt",
            "score": 29,
            "text": "He left for a job at an advertising firm called Sterling Cooper where, years later, he pulled the exact same stunt during a corporate buy out.",
            "title_similarity": "0.54912674",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8p0ige",
            "score": 13,
            "text": "He “Trapped” them!",
            "title_similarity": "0.31910363",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8p5bh9",
            "score": 27,
            "text": "This is some Don Draper shit",
            "title_similarity": "0.26459917",
            "sentiment_compound": -0.5574
        },
        {
            "id": "h8p5u5m",
            "score": 39,
            "text": "It is funny that sometimes the \"put it off and hope people stop asking about it\" can work.",
            "title_similarity": "0.3362577",
            "sentiment_compound": 0.5574
        },
        {
            "id": "h8p799j",
            "score": 2,
            "text": "They actually turned this into an episode.",
            "title_similarity": "0.18864152",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8p7e96",
            "score": 2,
            "text": "How many lawyers were fired for that oversight?",
            "title_similarity": "0.5420497",
            "sentiment_compound": -0.5574
        },
        {
            "id": "h8p7gum",
            "score": 3,
            "text": "What was his reason for leaving? I've always thought that the original cast was the best, I watched it as a kid and I remember crying when Cpt. Blake died lol. I'm sure they kicked themselves in the ass for leaving what became one of the best shows of all time.",
            "title_similarity": "0.71484154",
            "sentiment_compound": 0.6808
        },
        {
            "id": "h8p7kav",
            "score": 2,
            "text": "Trapper avoided the old trapper!",
            "title_similarity": "0.5261892",
            "sentiment_compound": -0.4003
        },
        {
            "id": "h8p8agh",
            "score": 2,
            "text": "I did this with a lease in college once.",
            "title_similarity": "0.22066003",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8p8rjp",
            "score": 1,
            "text": "They had implemented a new point system at work for being late and leaving early. I typically showed up late and left like half hour early when finished with all my work instead of just hanging out and finishing my 8 Hrs. They did this cause others would pull the same move but would leave their stations dirty. So I ended up accumulating enough points to get fired. Worked out well for me cause they couldn't dispute it when I applied for unemployment. The company tries to fight every one they can fight. I wasn't in the meeting where they explained the new policy change. I left early that day. Haha. They had everyone sign a document explaining what would happen. I got lucky cause I made almost the same money without having to bust my ass for a bit.",
            "title_similarity": "0.6705556",
            "sentiment_compound": -0.9093
        },
        {
            "id": "h8p8t0y",
            "score": 1,
            "text": "Saw an interview with him once.. he claimed that he lost money by being on the show.  Can't remember what he did but he was a very successful businessman.",
            "title_similarity": "0.64038205",
            "sentiment_compound": 0.7175
        },
        {
            "id": "h8p8trv",
            "score": 1,
            "text": "RIP Wayne Rogers",
            "title_similarity": "0.21862097",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8p95t8",
            "score": 18,
            "text": "I would like to subscribe to more M*A*S*H facts please.",
            "title_similarity": "0.15643612",
            "sentiment_compound": 0.6204
        },
        {
            "id": "h8p96nj",
            "score": 1,
            "text": "As soon as MASH came on it was time to go outside and play.",
            "title_similarity": "0.19668913",
            "sentiment_compound": 0.34
        },
        {
            "id": "h8p99b6",
            "score": 2,
            "text": "This bit cracked me up\n\n>Later, the spin-off “Trapper John, M.D.” went into production. That show’s producers asked Rogers to reprise the role. But Rogers turned them down. He said he didn’t want Hollywood to typecast him as a physician.\n\nI didn't know what else he had done so I pulled up his Wikipedia page and saw this\n\n>William Wayne McMillan Rogers III was an American actor, known for playing the role of Captain \"Trapper\" John McIntyre in the CBS television series M*A*S*H and as Dr. Charley Michaels on House Calls",
            "title_similarity": "0.74560475",
            "sentiment_compound": 0.3919
        },
        {
            "id": "h8p9exd",
            "score": 70,
            "text": "Reminds me of when a former employer forced everyone to sign a non-compete agreement but fired the HR person in charge of collecting them.\n\nI never signed mine because I already had been considering quitting. A fact the owner very angrily found out when I went to a competitor.",
            "title_similarity": "0.8488841",
            "sentiment_compound": -0.8732
        },
        {
            "id": "h8payth",
            "score": 1,
            "text": "Shit, and here I thought we would talk about MASH smh",
            "title_similarity": "0.25735676",
            "sentiment_compound": -0.7096
        },
        {
            "id": "h8pc6z9",
            "score": 1,
            "text": "Internet lawyers, if you sign with an x or wrong name or a different way than how you usually sign, is it considered not valid, or just any sign work?",
            "title_similarity": "0.51535755",
            "sentiment_compound": -0.4767
        },
        {
            "id": "h8pc7py",
            "score": 3,
            "text": "Wouldn't sign it due to a morals clause. That seems sooo much like a stunt Trapper John would pull.",
            "title_similarity": "0.6881515",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h8pcati",
            "score": 1,
            "text": "In a similar way I worked for lab after college for about 2 years. After I left for another job, I was worried that there might be some overlap with the work I was doing at my old lab. I was trying to find the wording of my original contract and as I'm going through my files I see I never turned in some of the original documents. Problem solved. I also never turned in some of my harassment/safety seminar stuff. I'm surprised there aren't more safeguards to catch this stuff in HR.   \n\n\nKeep in mind this was a big $100 million a year budget lab, not some small company.",
            "title_similarity": "0.70349514",
            "sentiment_compound": 0.1147
        },
        {
            "id": "h8pcein",
            "score": 1,
            "text": "Don Draper didn’t have a contract and we all know how that turned out.",
            "title_similarity": "0.67103124",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8pcta2",
            "score": 1,
            "text": "[deleted]",
            "title_similarity": "0.21751001"
        },
        {
            "id": "h8pd48b",
            "score": 20,
            "text": "I did a show with a very shady producer a few years ago. I hired her on the word of people who I thought I could trust. Big mistake. At the time, I managed to not sign the contract because it just didn't feel right to me. Call it a hunch.\n\n\nShe ended up shorting the production. After a bunch of drama where she didn't want to literally write the checks her mouth was trying to cash. \n\n\nShe also didn't want to put out contracts and dragged it out to almost two weeks before opening. When she did put them out, she kept trying to undercut my cast and crew. But her dragging it out but negotiations more in favour of the performers she was now beholden to.\n\n\nWe all knew something wasn't right but we were literally days from opening. We all wanted to do the show and everyone got along except with her. That, and producers just tend to be dicks sometimes. So the cast signed with bonuses for rehearsal time which, surprisingly, she agreed to.\n\n\nIn the end, I didn't sign, but I still was able to do the show. We just all strapped in for opening and hoped for the best. The run itself was well receieved.\n\n\nPost mortum, she tried to fudge the numbers to report less than what we made. This is how she shorted us. Although I was able to make sure the rest of my people got paid by taking a negative loss myself. What I would've gotten paid was just enough to cover her negligence. \n\n\nThank goodness for savvy entertainment lawyers. She settled out to avoid embarrassment. Even though she's a well known grifter now.\n\n\nI feel bad for anyone who has the displeasure of working with this woman in the future.",
            "title_similarity": "0.77288544",
            "sentiment_compound": 0.9743
        },
        {
            "id": "h8pd8hs",
            "score": 1,
            "text": "Shoulda signed it Daffy Duck",
            "title_similarity": "0.276475",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8pf12o",
            "score": 1,
            "text": "Don Draper grins.",
            "title_similarity": "-0.0290177",
            "sentiment_compound": 0.2263
        },
        {
            "id": "h8pf6ls",
            "score": 1,
            "text": "Ah he pulled a Don Draper by having no contract, very nice",
            "title_similarity": "0.4952214",
            "sentiment_compound": 0.2247
        },
        {
            "id": "h8pf8p8",
            "score": 20,
            "text": "Huh. Reminds me of a case of the inverse: discovering that you *actually* signed a contract. Specifically, it reminds me of how Brian Pillman (RIP) left WCW. \n\nHe said that he had an idea to build his wrasslin' character by taking it across different promotions, but to do that, he'd first have to be fired from WCW in storyline. For the sake of authenticity, he had a higher-up sign an official release form. In other words, to make it look like WCW fired him, Pillman got WCW to actually fire him.\n\nSo he just bounced. Never went back.\n\n[Also reminds me of Aleister/Malakai Black](https://www.thesportster.com/news/how-aew-got-around-malakai-black-90-day-wwe-non-compete-clause/). He was released from WWE in June after barely being used on the main roster, despite seeing success in NXT (WWE's \"developmental\" brand and show). Now, typically, WWE main roster contracts typically come with a 90-day non-compete clause (fuck non-competes, all my homies hate non-competes). \n\nBut here's the thing. Contracts for wrestling on NXT come with only 30-day non-competes. Black's clause was never updated after he went to the main roster.\n\nThis means that it was a true surprise when he debuted on AEW last month. And it is hard to surprise wrasslin' fans nowadays.",
            "title_similarity": "0.77292645",
            "sentiment_compound": -0.9587
        },
        {
            "id": "h8pfhgi",
            "score": 8,
            "text": "The studio kind of got the last laugh when they created a spin-off show that centered on his character and used another actor for the role.",
            "title_similarity": "0.57241124",
            "sentiment_compound": 0.6808
        },
        {
            "id": "h8pfnj0",
            "score": 1,
            "text": "Lmao king shit",
            "title_similarity": "0.24897039",
            "sentiment_compound": 0.0772
        },
        {
            "id": "h8pfnso",
            "score": 2,
            "text": "Classic Trapper",
            "title_similarity": "0.16896062",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8pfw4c",
            "score": 24,
            "text": "I think the actor shakeups made it more realistic. People come and go all the time in a lot of military units.",
            "title_similarity": "0.37618923",
            "sentiment_compound": -0.128
        },
        {
            "id": "h8pg4hm",
            "score": 19,
            "text": "I had a yoga teacher friend that had signed a non compete for 2 years within a ten mile radius of a Hollywood studio she worked at for several years. If you're familiar with LA at all, Hollywood is at its center and the whole damn city is only like 12 miles wide, so that basically meant she wasn't allowed to work in this city anymore. She quickly was like fuck that and worked elsewhere anyway just assuming that it wouldn't hold up in court. Companies are ridiculous with some of their stuff. NDA's are laughable. I can technically get sued for 6 million for talking about any of the tv shows I work on, which we all do all the time.",
            "title_similarity": "0.70608085",
            "sentiment_compound": -0.0772
        },
        {
            "id": "h8pgslu",
            "score": 8,
            "text": "UK citizen here. Pretty sure in our legal system there's a notion that if you are given a contract and work to the terms of it you can be deemed under contract even if you never signed it. Just in case anyone was having creative thoughts.",
            "title_similarity": "0.5039809",
            "sentiment_compound": 0.836
        },
        {
            "id": "h8pgu2s",
            "score": 1,
            "text": "Those were the best episodes when he was on. Mike Ferrel wasnt funny at all",
            "title_similarity": "0.52844906",
            "sentiment_compound": 0.4203
        },
        {
            "id": "h8ph55r",
            "score": 1,
            "text": "“Don doesn’t have a contract”",
            "title_similarity": "0.389594",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8phi6m",
            "score": 1,
            "text": "Came on at bedtime",
            "title_similarity": "0.05625038",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8phseh",
            "score": 1,
            "text": "I work with large, complex contracts on a daily basis. This kind of thing happens occasionally where the other party completely misunderstands what they can/can’t do, their obligations or my obligations. Sometimes, they are under the misapprehension that a entire scope of work got added via an amendment only to have me point out that such amendment was never signed and therefore of no contractual relevance. In my business, there’s simply no substitute for reading and understanding your contract before making some wild claim.\n\nMost recently, the other party thought they had a contractual right to unilaterally change the terms and conditions of the contract. I (inwardly laughing) pointed out that, although certain types of changes are allowed to be issued unilaterally, that most certainly was not among them.",
            "title_similarity": "0.7450235",
            "sentiment_compound": 0.7506
        },
        {
            "id": "h8phxwj",
            "score": 2,
            "text": "Trapper was my favorite, I wanted to be just like him.",
            "title_similarity": "0.2788196",
            "sentiment_compound": 0.6705
        },
        {
            "id": "h8phzho",
            "score": 2,
            "text": "Hunnicutt wasn't such a bad replacement.",
            "title_similarity": "0.15559709",
            "sentiment_compound": 0.431
        },
        {
            "id": "h8pi8ll",
            "score": 10,
            "text": "Now I can finally say it! I was a medical SGT in the Army and on my last deployment I was made to pack up a connex full of medical equipment and stuff (mostly stuff, not mine) I was solely responsible for it all (aka hand receipt holder). During the load out to head back to the states, my unit commandeered my space for their stuff and promised to find a spot for all mine (you can pull favors and okie doke the process, but this isn’t smart). They packed everything but managed to lose some things (they took zero blame obviously). I didn’t get to oversee the packing, either. Looking back, so many things didn’t go the way they were supposed to, but I was told it was all kosher. \n\nNow, between all of the field loss, missions, etc some stuff got lost in the shuffle. Some of it expensive. Shit happens. Some even got broken or became a combat loss. I was on the tab for it all regardless. I had a supervisor that didn’t like me and I felt like he wanted to possibly make an example of me. Me and the senior were cool, but he was too passive to step in and deal with the NCO beef.\n\nLet’s just say that the supposed paper work and any other copies of it never again saw the light of day. I deny the existence of it. It was a clusterfuck, so my answer is shouldershrug. My subordinates “lost” their sub hand receipt copies also (I educated them, let’s say). Eventually everyone got shuffled back to hq company (medics belong to HQ and were loaned out) and we all did our layouts. I had no paperwork or proof to be found. I gave them “everything I could find and everything that came back.”\n\nI managed to get off the hook for it all (thank God) and shortly PCS’d to the onpost hospital. I noped the fuck out of that real quick and let that be someone else’s problem. I occasionally got calls while I was clearing the unit and even after I left. I don’t know nothing, Jack. You ain’t getting me on the hook for your short comings. I was not a fan of how things went down during and after redeployment and I was not about to be a bag holder.\n\nP.s. no one thought to digitize the document. It all came out in the wash eventually.",
            "title_similarity": "0.5875279",
            "sentiment_compound": -0.9642
        },
        {
            "id": "h8pikri",
            "score": 6,
            "text": "Pure Don Draper life\n\nHerman 'Duck' Phillips : It is. Because he loves this room, and hearing his own voice, and saving the day. Except this time he's got to get with the team. Don, you can either honor your contract, or walk out that door with nothing and start selling insurance.\n\nDon Draper : I don't have a contract.",
            "title_similarity": "0.632113",
            "sentiment_compound": 0.7845
        },
        {
            "id": "h8pir31",
            "score": 1,
            "text": "Scary castle,mystic",
            "title_similarity": "0.22497332",
            "sentiment_compound": -0.4939
        },
        {
            "id": "h8pj50h",
            "score": 2,
            "text": "This photo is very fitting",
            "title_similarity": "-0.15570694",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8pj96b",
            "score": 1,
            "text": "Those would've been awesome pay checks to receive. Solid move.",
            "title_similarity": "0.14502522",
            "sentiment_compound": 0.6486
        },
        {
            "id": "h8pjc2l",
            "score": 9,
            "text": "You can’t fire me!\n\nI don’t even work here!",
            "title_similarity": "0.574047",
            "sentiment_compound": -0.4559
        },
        {
            "id": "h8pjca6",
            "score": 1,
            "text": "What an absolute legend.",
            "title_similarity": "0.15480354",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8pk3sr",
            "score": 2,
            "text": ">Later, the spin-off “Trapper John, M.D.” went into production. That show’s producers asked Rogers to reprise the role. But Rogers turned them down. He said he didn’t want Hollywood to typecast him as a physician\n\n his next biggest job, was Dr. Charley Michaels on House Calls..\n\ntype casting cant be avoided. exec sees you earn them a lot of money as a doctor, it makes it seem like the safe choice.\n\nPS [wayne rogers apparently regretted leaving](https://screenrant.com/actors-who-regret-leaving-tv-shows-movies/), after seeing mash go on for 11 years without him, saying he should have just kept his  mouth shut",
            "title_similarity": "0.7284682",
            "sentiment_compound": 0.772
        },
        {
            "id": "h8pkg2h",
            "score": 2,
            "text": "Reading the non-compete is such a shitty way to telling employees \"You will only and can only work for us because we don't want to fight over you regarding benefits and other bonuses our competitors are offering.\"",
            "title_similarity": "0.6956887",
            "sentiment_compound": 0.5517
        },
        {
            "id": "h8pkjg8",
            "score": 2,
            "text": "I did the same thing for a teeny little professional theatre gig I did. The actors who were also instrumentalists were promised extra compensation, but that wasn't in the contract. I never signed it, and I wound up being what forced the director to pay *all* of the instrumentalists what they were promised.",
            "title_similarity": "0.7828623",
            "sentiment_compound": -0.1531
        },
        {
            "id": "h8pkzp1",
            "score": 1,
            "text": "That is terrific.",
            "title_similarity": "-0.17065924",
            "sentiment_compound": 0.4767
        },
        {
            "id": "h8pl5xp",
            "score": 1,
            "text": "Trapper was a pimp.",
            "title_similarity": "0.4149301",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8plcdx",
            "score": 11,
            "text": "I worked for a bunch of contracting companies in IT in the 2000's and I quit signing the no-competes. They just wouldn't check the paperwork for my signature amongst all the other hiring documents. It eventually paid off when the company I was working for wanted to hire me But they, \"can't justify paying the hiring cost to the contracting company.\" Good news I say! I never signed the no-compete, hire me! Best job I had for quite a long time.",
            "title_similarity": "0.7966298",
            "sentiment_compound": 0.9049
        },
        {
            "id": "h8pldqf",
            "score": 2,
            "text": "Ownership of media fascinates me so I Googled who ended up with MASH.\n\nTurns out its another jewel in the Mouse's crown.",
            "title_similarity": "0.43421322",
            "sentiment_compound": 0.6705
        },
        {
            "id": "h8plufz",
            "score": 1,
            "text": "Just like Don Drapper on Mad Men.",
            "title_similarity": "0.40110967",
            "sentiment_compound": -0.1779
        },
        {
            "id": "h8pm2sr",
            "score": 1,
            "text": "If he didn’t sign the contract how was he paid?",
            "title_similarity": "0.49567425",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8pm7ea",
            "score": 1,
            "text": "What I am getting from this is that Wayne Rogers couldn't handle not being the biggest star of a wildly successful tv show and decided to just piss off.",
            "title_similarity": "0.72240293",
            "sentiment_compound": 0.2732
        },
        {
            "id": "h8pmfrb",
            "score": 1,
            "text": "Fell for the old Trapper John trap.",
            "title_similarity": "0.52770793",
            "sentiment_compound": -0.3182
        },
        {
            "id": "h8pmhu2",
            "score": 1,
            "text": "watched Cool Hand Luke the other day.  He is great in it",
            "title_similarity": "0.25463706",
            "sentiment_compound": 0.8625
        },
        {
            "id": "h8pmye4",
            "score": 1,
            "text": "Does anyone know why he left MASH?",
            "title_similarity": "0.5103255",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8pn930",
            "score": 1,
            "text": "Great post!",
            "title_similarity": "-0.048070047",
            "sentiment_compound": 0.6588
        },
        {
            "id": "h8pnswd",
            "score": 4,
            "text": "The episode where Charles tries so hard to understand death and what lies beyond made me so sad. Along with his explanations on gifts and talent versus a learned skill to a man who had lost the ability to play piano with two hands.",
            "title_similarity": "0.5411192",
            "sentiment_compound": -0.8104
        },
        {
            "id": "h8po37h",
            "score": 2,
            "text": "Can't breach if you don't have a contract",
            "title_similarity": "0.32572383",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8po9po",
            "score": 1,
            "text": "This is my favorite show!!!",
            "title_similarity": "0.11618775",
            "sentiment_compound": 0.5962
        },
        {
            "id": "h8poo7c",
            "score": 2,
            "text": "Does that mean he didn’t have to be paid or no royalties for syndication?",
            "title_similarity": "0.5734452",
            "sentiment_compound": -0.296
        },
        {
            "id": "h8pou9s",
            "score": 2,
            "text": "That's incredible! I've been watching MASH for years, and never knew that. God, I love this subreddit.",
            "title_similarity": "0.44780773",
            "sentiment_compound": 0.5687
        },
        {
            "id": "h8ppebn",
            "score": 5,
            "text": "I am under the legal binding to non-compete with xx company even if they fired me.. I'm starting to think they hire and fire just to weed out the competition",
            "title_similarity": "0.7249812",
            "sentiment_compound": -0.6705
        },
        {
            "id": "h8pq8mc",
            "score": 1,
            "text": "This reminds me of some Mad Men Don Draper type stuff! :)",
            "title_similarity": "0.4807371",
            "sentiment_compound": -0.126
        },
        {
            "id": "h8prdfp",
            "score": 1,
            "text": "andall that reruns royalties along with it",
            "title_similarity": "0.24642603",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8pt1do",
            "score": 2,
            "text": "If I ever have to sign a contract like that or similar, I'll pull a Michael Scott and sign \"Daffy Duck\"",
            "title_similarity": "0.43632084",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h8pu0fn",
            "score": 17,
            "text": "The finale for MASH was so fucking sad that I couldn't watch the series again for like 2 years. And I've never rewatched the finale again. Same with the episode Jurassic Bark from Futurama.",
            "title_similarity": "0.7481797",
            "sentiment_compound": -0.2895
        },
        {
            "id": "h8pvrwq",
            "score": 2,
            "text": "What a coincidence!  I just started season 4 last night and was disappointed that he wasn't on the show....",
            "title_similarity": "0.7073386",
            "sentiment_compound": -0.5255
        },
        {
            "id": "h8pwgxr",
            "score": 3,
            "text": "This was such a great show. 70s TV rocked even though there were only like 13 stations.",
            "title_similarity": "0.39306313",
            "sentiment_compound": 0.765
        },
        {
            "id": "h8pxf7k",
            "score": 2,
            "text": "The actor was very savvy in general.  He’s worth millions from investing.  He knew what he was doing all along.",
            "title_similarity": "0.30010942",
            "sentiment_compound": 0.2263
        },
        {
            "id": "h8py1v8",
            "score": 2,
            "text": "This is why you always ask the bank for a copy of your mortgage if you get in any trouble making payments. \n\nIf they don't have a copy then they have a bigger problem than you do.",
            "title_similarity": "0.5363663",
            "sentiment_compound": -0.6597
        },
        {
            "id": "h8pynkv",
            "score": 1,
            "text": "Legend",
            "title_similarity": "0.053054094",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8pyzle",
            "score": 90,
            "text": "I did this at my current job. They put all kinds of shit like my car is an extension of my office subject to “inspection” or some bullshit like that. HR checks in like every 6 months saying they really need me to sign it, and I always say “oh I thought I took care of that. I’ll get it to you ASAP”. \n\nSpoiler alert, it’s not going to be ASAP",
            "title_similarity": "0.55306065",
            "sentiment_compound": 0.5423
        },
        {
            "id": "h8pz87y",
            "score": 5,
            "text": "Not really relevant to the exact topic, but back in the early days of the internet, when usenet was hot stuff, Larry Gelbart was on the MASH discussion usenet. I don't even remember what I asked him about, but he responded, I had a follow up and he responded again. Thought that was pretty cool.",
            "title_similarity": "0.4880429",
            "sentiment_compound": 0.8047
        },
        {
            "id": "h8q2500",
            "score": 1,
            "text": "I don't have a contract",
            "title_similarity": "0.39176658",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8q2krd",
            "score": 2,
            "text": "Great show",
            "title_similarity": "-0.03490254",
            "sentiment_compound": 0.6249
        },
        {
            "id": "h8q36yg",
            "score": 6,
            "text": "When a former employer of mine found out I was consulting for a competitor, they didn't exactly threaten me but let me know they could do it, saying how lucky I was that they are nice people. But I had a record of everything I signed--and didn't sign--and I never signed the non-compete. They literally forgot to send it to me, got my severance anyway because it was their mistake. So when they nice-guy-threatened me, I said ok, I've listened to you, so long. Didn't stop consulting for the competition. Didn't need to.",
            "title_similarity": "0.7270006",
            "sentiment_compound": 0.8234
        },
        {
            "id": "h8q4mrc",
            "score": 3,
            "text": "I honestly LOVE that for him. He was always one of my faves and I was so sad to see him go, but for this sake I'm now overjoyed.",
            "title_similarity": "0.36250338",
            "sentiment_compound": 0.8186
        },
        {
            "id": "h8q59wa",
            "score": 7,
            "text": "What the fuck? Companies really do be trying to own people.",
            "title_similarity": "0.40421993",
            "sentiment_compound": -0.5423
        },
        {
            "id": "h8q5g59",
            "score": 2,
            "text": "BDE",
            "title_similarity": "-0.09121482",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8q5osg",
            "score": 4,
            "text": "Pretty sure he asked the Execs to absolve him of all obligations if he became “emotionally exhausted and morally bankrupt.”",
            "title_similarity": "0.69369566",
            "sentiment_compound": 0.6369
        },
        {
            "id": "h8q6kmi",
            "score": 2,
            "text": "Trapper John MD always confused the shit out of me ...now I know",
            "title_similarity": "0.56956625",
            "sentiment_compound": 0.4019
        },
        {
            "id": "h8q6nrx",
            "score": 7,
            "text": "I have never seen an episode of M*A*S*H, as it was before my time (31). Curious if it holds up today to watch?",
            "title_similarity": "0.70604306",
            "sentiment_compound": 0.3182
        },
        {
            "id": "h8q9w8i",
            "score": 7,
            "text": "I took one of those boot camp courses years back that was grossly overpriced. Very quickly I learned the course was useless to learn new things and only useful as a way to network with other programmers.\n\nThey even had me helping and teaching the class a few days! But they never offered any discount for my efforts. Well, I was kind of a broke asshole and I quit paying. \n\nGuess next time they will make sure the get a signature on their contract. They sent my bill to collections and I disputed it and it was gone within 3 days. They couldn't produce any proof I agreed to their contract of payment terms",
            "title_similarity": "0.82220626",
            "sentiment_compound": 0.2363
        },
        {
            "id": "h8qaw58",
            "score": 5,
            "text": "Trapper was my favorite, Rogers played the character so well too. Hated that he got wrote into Alda's shadow and eventually left.",
            "title_similarity": "0.5847682",
            "sentiment_compound": 0.3975
        },
        {
            "id": "h8qb65e",
            "score": 3,
            "text": "Similar thing happened to me. I had shares in a company and it was going down the tubes. So the bank called me in to sign a personal guarantee (typical for fucking Canadian banks) and I said \"Uh, yeah, no\".",
            "title_similarity": "0.6155833",
            "sentiment_compound": 0.6597
        },
        {
            "id": "h8qbemy",
            "score": 2,
            "text": "I once had an employer make me sign an NDA upon termination.\n\nI sent back annotated copy asking for amendments. He took that as if it was signed and paid me.\n\n\n¯\\\\\\_(ツ)\\_/¯",
            "title_similarity": "0.58003116",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8qbwjz",
            "score": 3,
            "text": "Dude went to Princeton.  Damn straight!",
            "title_similarity": "0.3333789",
            "sentiment_compound": -0.2714
        },
        {
            "id": "h8qcxts",
            "score": 2,
            "text": "Rogers you sneaky bastard 👏",
            "title_similarity": "0.38420215",
            "sentiment_compound": -0.6597
        },
        {
            "id": "h8qeyco",
            "score": 1,
            "text": "Yep. For a fellowship I did a couple of years ago, they wanted us to sign a form releasing image rights so they could use whatever photo they wanted in their marketing. I’m not a fan of that and suspected they were fairly incompetent, so signed all the rest of the forms except that one. No one ever called me on it, so we’ll see how we go.",
            "title_similarity": "0.8039191",
            "sentiment_compound": -0.7151
        },
        {
            "id": "h8qfjpl",
            "score": 2,
            "text": "What the hell did they try to sue him over?",
            "title_similarity": "0.59826744",
            "sentiment_compound": -0.6808
        },
        {
            "id": "h8qhl9x",
            "score": 13,
            "text": "I avoided a  fine during my short stint as a mover. The contract said I was on the hook for damages at $2 per pound. A weird policy, didn't matter what something was worth only what it weighed. I didn't have any money to pay for that so I didn't sign it. If I had that kind of money I sure wouldn't have been carrying other people's stuff.\n\nIt only came up after I'd already quit. A customer discovered something damaged a few weeks later. The company called wanting me to pay. That was a fun conversation. Too bad I wasn't there in person to see their faces when they looked. It really wasn't a lot of money but that wasn't the point really. Who signs a contract like that?",
            "title_similarity": "0.76419675",
            "sentiment_compound": 0.0678
        },
        {
            "id": "h8qj3d2",
            "score": 2,
            "text": "the MASH producers sued show Trapper John MD, it was based on later chapters of same book. so they went after the actor AND the Character in different lawsuits. weird",
            "title_similarity": "0.7579769",
            "sentiment_compound": -0.3182
        },
        {
            "id": "h8qjndn",
            "score": 1,
            "text": "Via UC Berkeley and Under Armour",
            "title_similarity": "0.1460983",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8qk0y9",
            "score": 1,
            "text": "what is a morals clause?",
            "title_similarity": "0.09252478",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8qlm4c",
            "score": 7,
            "text": "Such an asshole. I got into a fender bender with him (his fault) when I was in high school amd he screamed at me for 20 minutes calling me a c**t until the cops came. I was traumatized.",
            "title_similarity": "0.69608194",
            "sentiment_compound": -0.7717
        },
        {
            "id": "h8qmeon",
            "score": 1,
            "text": "I had something similar happen to me with a leease for an apartment, we met up she signed hers i signed mine and then we traided and in the end she took the one she signed and i took mine.",
            "title_similarity": "0.32042217",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8qmsin",
            "score": 1,
            "text": "What a chad move",
            "title_similarity": "0.12880969",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8qncyh",
            "score": 2,
            "text": "My contract at work is completely void due to an all encompassing timeframe clause- i didnt sign within 48 hours of it being sent via email, as specified, despite my telling hr about it. They didnt care. Had my lawyer friend take a look at it and im completely free of contract.\n\nDoesnt change much because we’re both at will, but if they fuck with me i at least have that.",
            "title_similarity": "0.832687",
            "sentiment_compound": -0.4884
        },
        {
            "id": "h8qolyg",
            "score": 2,
            "text": "Them: \"Is this your signature right here?\" \\*points to where signature should be\\*\n\nHim: :)",
            "title_similarity": "0.092832915",
            "sentiment_compound": 0.4588
        },
        {
            "id": "h8qp7un",
            "score": 3,
            "text": "Got out of a shitty lease because I was never given a copy, and in the state of Ohio a contract is not valid until all signatories receive a copy (per a lawyer ten years ago)",
            "title_similarity": "0.8263002",
            "sentiment_compound": -0.5574
        },
        {
            "id": "h8qqgzj",
            "score": 2,
            "text": "When I went sky diving they had a waver to sign with about 10 Clause on it . I  didn't initial the clause that said I wouldn't sue . But I didn't need it , beside I'd probably be dead anyway .",
            "title_similarity": "0.65564144",
            "sentiment_compound": -0.7783
        },
        {
            "id": "h8qrgu5",
            "score": 3,
            "text": "I've always heard he was kind of a tool to work with but I'm not 100% sure about it. Honestly, I liked Mike Farrell's B.J. much better anyways so it didn't bother me too much.",
            "title_similarity": "0.43143088",
            "sentiment_compound": 0.9195
        },
        {
            "id": "h8qsb21",
            "score": 4,
            "text": "A fun fact about why he left. It’s because of many things of course he was starting to be a side kick to the Hawkeye character rather than an equal, which is not how the role was pitched to him. From what I understand he didn’t hold any ill will to Alan Alda about this. But then came one episode. The final straw. ‘Dear Dad’ in this episode Hawkeye is writing to his father and mentions he had to be flown out of a Christmas party to a foxhole because he was a ‘chest cutter’ (chest surgery specialist). The writers had stripped everything that was different about his character away giving it to tue Hawkeye character, despite it being established in the show and the movie the show was based on that the Trapper John character was the only chest cutter in that unit (or it may have been all mash units. Since his character no longer had anything unique about him, and was pretty much just the sidekick to Hawkeye, and Rogers knew he wasn’t under contract he peaced out.",
            "title_similarity": "0.74220616",
            "sentiment_compound": 0.8555
        },
        {
            "id": "h8qtdbc",
            "score": 2,
            "text": "fun fact: sometimes big actors dont sign contracts until first day of shooting. allows them to drop out of projects easily.",
            "title_similarity": "0.59334403",
            "sentiment_compound": 0.5574
        },
        {
            "id": "h8qu7m9",
            "score": 2,
            "text": "And he went on to become a wealthy businessman. \n\nSmart guy. \n\n:)",
            "title_similarity": "0.21368007",
            "sentiment_compound": 0.802
        },
        {
            "id": "h8qy0da",
            "score": 2,
            "text": "This is like when my landlord never gave me a lease agreement to sign so when I gave him 30 days notice I was leaving and his lease agreement requires 60 I said I actually never signed that cause you never gave it to me lol so I was a month to month the whole time and had no repurcussions for \"breaking lease\"",
            "title_similarity": "0.7799554",
            "sentiment_compound": 0.8591
        },
        {
            "id": "h8r1s3i",
            "score": 1,
            "text": "Classic Trapper",
            "title_similarity": "0.16896062",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8r1t70",
            "score": 3,
            "text": "Trapper John was a nonentity anyway. B. J. Hunnicutt was a much better character.",
            "title_similarity": "0.42413408",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h8r3bhs",
            "score": 6,
            "text": "If a person does not sign a contract, but performs work and receives the agreed upon compensation, then the contract is considered valid and enforceable. I don't know where outsider got this story from. It's called Principle of Laches.",
            "title_similarity": "0.5498531",
            "sentiment_compound": 0.3919
        },
        {
            "id": "h8rb476",
            "score": 1,
            "text": "So, if they decided to never pay him a penny he couldnt do anything?",
            "title_similarity": "0.5894137",
            "sentiment_compound": 0.0762
        },
        {
            "id": "h8rbnd6",
            "score": 1,
            "text": "I heard Honeycutt flight against the occult. Was that like part of the satanic panic?",
            "title_similarity": "0.49493194",
            "sentiment_compound": -0.2023
        },
        {
            "id": "h8rcqg4",
            "score": 1,
            "text": "I’m tired and read this as Wayne Rooney",
            "title_similarity": "0.29863596",
            "sentiment_compound": -0.4404
        },
        {
            "id": "h8re3xs",
            "score": 1,
            "text": "It's a shame he did leave though",
            "title_similarity": "0.4468611",
            "sentiment_compound": -0.5106
        },
        {
            "id": "h8ricck",
            "score": 1,
            "text": "“How about we sell spearchucker over here? “",
            "title_similarity": "0.22567995",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8rkk4v",
            "score": 1,
            "text": "Question is why did he leave",
            "title_similarity": "0.36306056",
            "sentiment_compound": -0.0516
        },
        {
            "id": "h8rm67n",
            "score": 1,
            "text": "I love mash so much but how did they never noticed he didnt sign his contract?? Dont they have like legal people",
            "title_similarity": "0.7510358",
            "sentiment_compound": 0.2605
        },
        {
            "id": "h8rmfu2",
            "score": 2,
            "text": "Unpopular opinion: I actually preferred all the replacements more than the original character, bj is great, potter is hilarious and winchester is amazing\nRadar didnt get a replacement but that was probably a good call, since he is the best. Klinger kinda replaced him but still",
            "title_similarity": "0.5890379",
            "sentiment_compound": 0.9534
        },
        {
            "id": "h8rnstj",
            "score": 1,
            "text": "Probably in the minority here, but I thought Trapper AND Hunnicutt were funnier and more interesting than Hawkeye.",
            "title_similarity": "0.3350713",
            "sentiment_compound": 0.8196
        },
        {
            "id": "h8rrawq",
            "score": 1,
            "text": "He never said goodbye to Hawkeye",
            "title_similarity": "0.58813953",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8rv98t",
            "score": 1,
            "text": "The theme song has lyrics that they didn’t play on the TV show..maybe because it was “Suicide is painless”",
            "title_similarity": "0.7028114",
            "sentiment_compound": 0.34
        },
        {
            "id": "h8rwfpp",
            "score": 1,
            "text": "Leaving the show was a dumb move that I’m sure he regretted inside.",
            "title_similarity": "0.6873338",
            "sentiment_compound": -0.5574
        },
        {
            "id": "h8ryqm4",
            "score": 1,
            "text": "There is an episode were visiting psychiatrist is being badgered for not signing a clause on his army commission.\n\nHawkeye says something like \"How do I not sign mine?\"",
            "title_similarity": "0.6659932",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h8ryu61",
            "score": 2,
            "text": "I'm curious how this works in practise, because as soon as you accept payment, you've tacitly agreed to be bound by the terms of service. Or perhaps thats just in UK law.",
            "title_similarity": "0.35689962",
            "sentiment_compound": 0.7184
        },
        {
            "id": "h8s0ia7",
            "score": 1,
            "text": "Surprised they couldn't recoup all his pay",
            "title_similarity": "0.55195385",
            "sentiment_compound": 0.128
        },
        {
            "id": "h8s1q3r",
            "score": 1,
            "text": "“And, the clause literally said, I can’t quote this quite verbatim…”  So, he doesn’t know what it literally said?",
            "title_similarity": "0.51819754",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8s26vv",
            "score": 1,
            "text": "He went on to open his own investment firm and did quite well. Used to be on Fox Business all the time",
            "title_similarity": "0.4159644",
            "sentiment_compound": 0.3384
        },
        {
            "id": "h8s9suv",
            "score": 1,
            "text": "🎵 So suing Wayne is pointless\n\nAll it brings is disappointment 🎵",
            "title_similarity": "0.56713474",
            "sentiment_compound": -0.722
        },
        {
            "id": "h8st85h",
            "score": 1,
            "text": "Went down a Wikipedia rabbit hole and now I'm furious that the united States can censor things for being obscene",
            "title_similarity": "0.64100015",
            "sentiment_compound": -0.8271
        },
        {
            "id": "h8sw3ow",
            "score": 1,
            "text": "Why do we have such a Sue happy culture?",
            "title_similarity": "0.22242466",
            "sentiment_compound": 0.5719
        },
        {
            "id": "h8sxnet",
            "score": 1,
            "text": "L can, zzz..ll 9 9,, 15 9 .",
            "title_similarity": "0.081530824",
            "sentiment_compound": 0.5766
        },
        {
            "id": "h8sxp9l",
            "score": 1,
            "text": "Sssssssss la",
            "title_similarity": "-0.03609302",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8u55da",
            "score": 3,
            "text": "Here, the contract is regulated by a labor union, AFTRA. The producers first sign a contract with the producers of the tv show, called the signatory. This contractually obligates both parties to abide by pre-negotiated rules, terms, and conditions of employment, working hours, residual payments, use of likeness, etc. Now this was a long time ago, and things have changed. An actor isn't even allowed on set without. Assigned contract. See, now he's saying he isn't under a long term contract, but just a week to week rate, but it's the contract that gives him the rate. I think the judge got it wrong here. Now look at Kim Basinger who agreed to do Boxing Helena,but when production started she backed out claiming she never signed a contract. She was found liable because she agreed to do it verbally only, the court held otherwise.",
            "title_similarity": "0.6462008",
            "sentiment_compound": 0.2846
        },
        {
            "id": "h8yw7gi",
            "score": 2,
            "text": "Can anyone shed a bit of light on how Rogers was not deemed to have accepted the contract by showing up to set to provide the agreed service?",
            "title_similarity": "0.6140357",
            "sentiment_compound": 0.4939
        },
        {
            "id": "h9d2v4w",
            "score": 1,
            "text": "M\\*A\\*S\\*H got woke before things got woke . Even as a kid iI realised it was just vehicle for Alan Alda & his social messages - The original movie and early shows were good as comedy did the talking - didn't need Alda to be preaching",
            "title_similarity": "0.5095626",
            "sentiment_compound": 0.7717
        }
    ]
}