{
    "TIL that Mike Judge moved to Texas and a storm blew off a part of his fence. After his new neighbors fixed it for him, no questions asked, it became the basis for King Of The Hill - \"about neighbors who... ultimately, do the right thing and do right by people and are basically good people.\"\n": [
        {
            "id": "h9d8mr2",
            "score": 4,
            "text": "And THAT, ladies and gentlemen, is what separates Texans from the Abbots and Cruz’s",
            "title_similarity": "0.44225922",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9cz41z",
            "score": -17,
            "text": "It used to be that way. I don't see it as much anymore.",
            "title_similarity": "0.19465184",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9d2xyh",
            "score": -23,
            "text": "I want to see the episode where Hank has a he faith shaken in the Republicans by Trump. I have no doubt he'd vote for Trump in the end (or maybe not vote for the first time in his life, or write in), but I think it would be a really important perspective on Trump support that liberals could understand it better why it's happening, with a character they can empathize with.",
            "title_similarity": "0.6282361",
            "sentiment_compound": 0.9099
        },
        {
            "id": "h9e3uet",
            "score": -1,
            "text": "Good thing Mike isn’t black or gay.",
            "title_similarity": "0.28154075",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h9dnut8",
            "score": 3,
            "text": "I grew up in rural America surrounded by caring compassionate neighbors like this. They all voted for Trump and believe liberals are the scum of the earth who are trying to shove fascist communism down everyone's throats. They are kind and loving towards people they know, their tribe, their in-group. The rest of the world is weird and wrong and most likely evil.",
            "title_similarity": "0.70162106",
            "sentiment_compound": 0.4804
        },
        {
            "id": "h9fmuyp",
            "score": 0,
            "text": "If all of this were 2 occur in this day & age his neighbor would have come over unmasked, given him or his family Covid & the name of the show would be \"King of the Assholes\". A show about irresponsible jerk neighbors who infect each other w/a deadly disease & the entire cast slowly dies alone & scared on a ventilator in a hospital surrounded by ppl in hazmat suits.",
            "title_similarity": "0.57768774",
            "sentiment_compound": -0.9186
        },
        {
            "id": "h9d8slm",
            "score": -3,
            "text": "[deleted]",
            "title_similarity": "0.048493862"
        },
        {
            "id": "h9d7w1f",
            "score": -6,
            "text": "Man, I recently have tried to watch that show because Covid and I watched everything else...watched the first two episodes and just can't get into it. Though my friends tell me it really gets good in season 2. Should I push through it? Skip to season 2?",
            "title_similarity": "0.5404045",
            "sentiment_compound": 0.7676
        },
        {
            "id": "h9d6mwe",
            "score": 1,
            "text": "hank hill is my hero. i wish it was an accurate depiction.",
            "title_similarity": "0.52904713",
            "sentiment_compound": 0.743
        },
        {
            "id": "h9di6jx",
            "score": -1,
            "text": "Not the Texas that Texas lives in, apparently.",
            "title_similarity": "0.34543645",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9djxvi",
            "score": -1,
            "text": "Sorry to go there, but I'm curious how this show would have handled the Trump years",
            "title_similarity": "0.40916687",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h9d9iz7",
            "score": -19,
            "text": "Sounds like Mike Judge is suffering from some survivorship bias. Not all people are so lucky. And Mike likely moved to an upper class neighborhood with wealthy people with lots of time and money on their hands who want to get on their celebrity neighbors good side. \n\nhttps://en.wikipedia.org/wiki/Survivorship_bias",
            "title_similarity": "0.54336727",
            "sentiment_compound": 0.8083
        },
        {
            "id": "h9db4hv",
            "score": 0,
            "text": "And then there's Dale...",
            "title_similarity": "0.10011941",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9dd19y",
            "score": -3,
            "text": "Judging by my neighbors, Hank and Boomhauer are great people but refuse to get vaccinated.",
            "title_similarity": "0.62566376",
            "sentiment_compound": -0.0644
        },
        {
            "id": "h9e3qoj",
            "score": -2,
            "text": "King of the Hill was a rare show that portrayed southerners as something other than backwards racist idiots. I appreciated that at the time.\n\nBut the last few years have indicated pretty strongly that the backwards racist idiots are in the driver's seat down there, so I don't know what to think.\n\nSo who would Hank have voted for?\n\nedit: instead of getting triggered over how the entire planet sees the American south, why don't you guys just like, stop being racist? Unless you think the entire planet is wrong and you're right, which would actually not surprise me.",
            "title_similarity": "0.67742664",
            "sentiment_compound": -0.9132
        },
        {
            "id": "h9eaenm",
            "score": -1,
            "text": "They're all Trumpers now, except MAYBE Bobby :'(",
            "title_similarity": "0.42000127",
            "sentiment_compound": -0.4939
        },
        {
            "id": "h9d6kjy",
            "score": -18,
            "text": "Too bad that’s not what Texas is like anymore.\n\nEdit: I said what I said. A significant percentage of Texas cannot be arsed to wear a mask and/or get vaccinated to help protect their neighbors.",
            "title_similarity": "0.6348177",
            "sentiment_compound": 0.6249
        },
        {
            "id": "h9diib0",
            "score": -8,
            "text": "So, why is it I feel so compelled to avoid Texas, the 49th most intelligent state in the United States?",
            "title_similarity": "0.49795163",
            "sentiment_compound": 0.6423
        },
        {
            "id": "h9db7u9",
            "score": -2,
            "text": "Let’s just be clear what political party that King of the Hill belong to.",
            "title_similarity": "0.34576094",
            "sentiment_compound": 0.6486
        },
        {
            "id": "h9dgf4a",
            "score": 1,
            "text": "This does not resemble my Texas experience.",
            "title_similarity": "0.2186144",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9dldz2",
            "score": 1,
            "text": "Too bad in reality neighbors are often a nightmare. The best neighbors are fences or better yet no neighbors at all.",
            "title_similarity": "0.5276593",
            "sentiment_compound": 0.34
        },
        {
            "id": "h9dy1nd",
            "score": 1,
            "text": "In Texas of all places. I was led to believe all americans were selfish bastards.",
            "title_similarity": "0.48254678",
            "sentiment_compound": -0.7964
        },
        {
            "id": "h9e67ra",
            "score": 1,
            "text": "My ex girlfriend met Mike Judge while working at The Mansion in Austin Texas, which is like a bed and breakfast.  He asked her to get his underwear dry cleaned, but the cleaners refused to dry clean underwear.  He screamed her head off mercilessly before she left and called me crying.  I’ve never been able to watch King of the Hill since then",
            "title_similarity": "0.65592295",
            "sentiment_compound": -0.6808
        },
        {
            "id": "h9ea9jb",
            "score": -1,
            "text": "Is it still like that? A coworker of mine lived in Texas for a decade and said the people were terrible. I went on a road trip there 15 years ago and I tend to agree.",
            "title_similarity": "0.68798614",
            "sentiment_compound": 0.2263
        },
        {
            "id": "h9ecnwz",
            "score": 1,
            "text": "Reddit users are so pissed at this story. TEXAS BAD",
            "title_similarity": "0.44608548",
            "sentiment_compound": -0.891
        },
        {
            "id": "h9f4foj",
            "score": 1,
            "text": "Good people.... until they install a bloated fascist.",
            "title_similarity": "0.5007492",
            "sentiment_compound": -0.1779
        },
        {
            "id": "h9d7qlm",
            "score": -17,
            "text": "Except it's texas.\n\nThey'll be good people, if you're white and protestant.",
            "title_similarity": "0.5723349",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h9d8cvp",
            "score": -12,
            "text": "I’ve seen a decent number of episodes, but I’m trying to think—is there a single black person depicted in the show ever?  There’s gotta be, but I can’t picture any.",
            "title_similarity": "0.4233305",
            "sentiment_compound": 0.0387
        },
        {
            "id": "h9d5ly1",
            "score": -4,
            "text": "Closest thing I've found to scratching that 'hank hill itch' is bill burr's / netflix's f is for family.",
            "title_similarity": "0.56502366",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9d8wpl",
            "score": -5,
            "text": "That's how tribalism works.  Help your tribe, your neighbor is your tribe.",
            "title_similarity": "0.53437465",
            "sentiment_compound": 0.4019
        },
        {
            "id": "h9da48x",
            "score": 39,
            "text": "i had always avoided King of the Hill when it was on TV, but last year during lockdown, i finally got around to giving it a shot, and fell in love with it. i couldn't help but imagine where the characters would be today, and all of the hijinks they could get into now.\n\nDale goes full conspiracy nut and takes down a 5G tower.\n\nsomeone from Boomhauer's past returns with allegations of past sexual misconduct.\n\nBill, just wanting to fit in, finds a new group friends who are planning a trip to DC on Jan 6.\n\nPeggy being Peggy finds herself becoming the face of Karens.\n\nBobby briefly finds modest success as a social media influencer.\n\nHank decides to stop supporting Trump, and has to convince Buck Strickland to do the same.",
            "title_similarity": "0.67963564",
            "sentiment_compound": 0.9566
        },
        {
            "id": "h9dflxf",
            "score": 1,
            "text": "Texas is crazy. There’s places here where these types of neighbors actually is exist. And then places here where you’ll get off scot fucking free for shooting someone just for stepping on your property.",
            "title_similarity": "0.58847255",
            "sentiment_compound": 0.2944
        },
        {
            "id": "h9epuie",
            "score": -2,
            "text": "Them KKK members who support treason and sedition and insurrection are the salt of the earth.",
            "title_similarity": "0.4075899",
            "sentiment_compound": -0.4588
        },
        {
            "id": "h9f0ebi",
            "score": 3,
            "text": "Damn. Sucks that California is gonna ruin this for Texas.",
            "title_similarity": "0.4425336",
            "sentiment_compound": -0.8402
        },
        {
            "id": "h9daqnj",
            "score": -8,
            "text": "Unless they identify you as one of THEM as opposed to one of US; then you discover that they are not \"basically\" good people, but instead, selectively good people. \nAnd they will NOT be doing the right thing since they don't really see you as \"people\".",
            "title_similarity": "0.3521803",
            "sentiment_compound": 0.4848
        },
        {
            "id": "h9d79la",
            "score": -6,
            "text": "They do right by people… that they know",
            "title_similarity": "0.23594622",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9d0o7y",
            "score": 73,
            "text": "Get politics and corporate owned mega media out of day to day life and yeah, people, even those who disagree on things, can be genuinely good to each other. Unfortunately, that’s not profitable.",
            "title_similarity": "0.51867723",
            "sentiment_compound": -0.3195
        },
        {
            "id": "h9d7cd8",
            "score": 27,
            "text": "[removed]",
            "title_similarity": "0.009889413"
        },
        {
            "id": "h9dtauf",
            "score": -3,
            "text": "Anyone else read the title and comments and have no fucking clue what’s going on in this post?",
            "title_similarity": "0.26670521",
            "sentiment_compound": -0.296
        },
        {
            "id": "h9dakak",
            "score": -7,
            "text": "Umm… I think Mike is probably white",
            "title_similarity": "0.19338119",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9dh0f4",
            "score": -8,
            "text": "As a Texans kid in a suburb like Harlen I hated King of the Hill when it first aired. Then I became an adult, moved to Austin where I didn’t have to live with people like in the animation and started to like the show. The thing about the show is that it’s mostly like that except rural people don’t actually learn from their lessons and change for the better like they do in the show. They double down and die on hills claiming it’s the right way of life when the reality is they are holding onto a way of life that’s racist, xenophobic, and bad for the environment.",
            "title_similarity": "0.71093476",
            "sentiment_compound": -0.4939
        },
        {
            "id": "h9do48n",
            "score": -8,
            "text": "It's too bad King of the Hill is such a boring and unfunny show.",
            "title_similarity": "0.30517125",
            "sentiment_compound": -0.7003
        },
        {
            "id": "h9d8n1s",
            "score": 0,
            "text": "King of the Hill holds a little different meaning in GTA",
            "title_similarity": "0.1994852",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9dcdw8",
            "score": 0,
            "text": "i was scrolling reddit while watching king of the hill when this came up and it was perfect",
            "title_similarity": "0.46220765",
            "sentiment_compound": 0.5719
        },
        {
            "id": "h9dcql0",
            "score": 0,
            "text": "Idk if Dale could be considered \"basically good people\" lol\n\nAlso I was pretty sure this was just a spin off of the \"tight ass\" character from Bevis and Butthead...",
            "title_similarity": "0.50493604",
            "sentiment_compound": 0.743
        },
        {
            "id": "h9ddz0e",
            "score": 0,
            "text": "What did Gen x do?",
            "title_similarity": "0.012816135",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9dh4sp",
            "score": -3,
            "text": "Really waiting on that neighborly Texan behavior.",
            "title_similarity": "0.46417612",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9dhz97",
            "score": 0,
            "text": "It's like adult Hey Arnold",
            "title_similarity": "0.15132627",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h9dit8a",
            "score": -4,
            "text": "I am so confused about that headline. Good neighbors?\n\nMy wife used to watch the show. It never really clicked with me, but since there was nothing else on, I sat through quite a few.\n\nI caught the vibe that they tolerated each other unless something set them off. I recall a couple of episodes wear the guy with the hat and glasses wanted to get revenge on the other guys for some assumed grievance. Other episodes where they were all doing their thing regardless of how it effected the others. I never got the sense that they really cared for each other - hat and glasses especially. Friendly facades, more or less.\n\nI did get the sense that the family loved each other. But the father thought the son was effeminate or something.\n\nI didn't bond with the characters. But my wife, who is a small town girl, did mention that it was something I would not understand unless I grew up in a small town. So there is that.",
            "title_similarity": "0.65863335",
            "sentiment_compound": 0.7531
        },
        {
            "id": "h9djuyk",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "0.009889379"
        },
        {
            "id": "h9dkkaw",
            "score": 0,
            "text": "\"I sell cocaine and cocaine accessories.\"",
            "title_similarity": "0.23635088",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9dmnpd",
            "score": 0,
            "text": "When did he change it? Hanks neighbors are assholes",
            "title_similarity": "0.4914354",
            "sentiment_compound": -0.5859
        },
        {
            "id": "h9dnelg",
            "score": 0,
            "text": "\"A man with nothing more than a 9th grade education, on the county's payroll, get's angry at a young injured man, assaults him for no reason.\"",
            "title_similarity": "0.532089",
            "sentiment_compound": -0.8934
        },
        {
            "id": "h9dokqj",
            "score": 0,
            "text": "Unless you happen to be black, or progressive, or didn't vote red, or are pro-mask or pro vaccination or any combination of those.",
            "title_similarity": "0.40190455",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9dqhh7",
            "score": 0,
            "text": "This was before Fox News really got going I guess.",
            "title_similarity": "0.373532",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9e35ah",
            "score": 0,
            "text": "Was Mike Judge a Judge?",
            "title_similarity": "0.19517475",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9eb8ap",
            "score": 0,
            "text": "TIL Mike judge is a straight looking white man. I've never seen a pic of him but I feel confident in my assumption based on this title.",
            "title_similarity": "0.4753422",
            "sentiment_compound": 0.6956
        },
        {
            "id": "h9eejed",
            "score": 0,
            "text": "Holy crap. I thought this said \"Moved to Texas and a storm ripped off a part of his **face** \"",
            "title_similarity": "0.66317713",
            "sentiment_compound": -0.3818
        },
        {
            "id": "h9ekdcr",
            "score": 0,
            "text": "Sure, keep pushing that myth...",
            "title_similarity": "0.11851604",
            "sentiment_compound": 0.3182
        },
        {
            "id": "h9eltxc",
            "score": 0,
            "text": "This is mildly interesting to learn, but the main reason I'm giving you an upvote is because you wrote \"a part\" instead of \"apart.\" Thank you. You have restored my faith in humanity a little.",
            "title_similarity": "0.527009",
            "sentiment_compound": 0.9325
        },
        {
            "id": "h9en0h2",
            "score": 0,
            "text": "Except for John Redcorn.\n\nFuck John Redcorn.",
            "title_similarity": "0.2882762",
            "sentiment_compound": -0.5423
        },
        {
            "id": "h9f3g1h",
            "score": 0,
            "text": "Of course it was no questions asked. What questions would they ask? They experienced the same storm, I assume. Unless you mean no payment asked? I guess will you pay me for this is a question, but it's only one, not multiple.",
            "title_similarity": "0.5588752",
            "sentiment_compound": -0.4137
        },
        {
            "id": "h9f4q2z",
            "score": 0,
            "text": "Hank was cool, until he started using an outdoor oven and called it a barbecue",
            "title_similarity": "0.51223433",
            "sentiment_compound": 0.3182
        },
        {
            "id": "h9f7867",
            "score": 0,
            "text": "some places in Texas the neighbors would have been shot for trespassing",
            "title_similarity": "0.50769705",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9faztz",
            "score": 0,
            "text": "texas do right by people.... ha ha ok",
            "title_similarity": "0.47445887",
            "sentiment_compound": 0.7184
        },
        {
            "id": "h9dhewk",
            "score": -6,
            "text": "As long as you're white.",
            "title_similarity": "0.15448391",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9dmi8u",
            "score": 5,
            "text": "If liberals lived next door to conservatives, and vice versa, and they (we) all took the time to fix each other’s fences when needed, this country would probably be in a slightly better place.",
            "title_similarity": "0.5989374",
            "sentiment_compound": 0.3832
        },
        {
            "id": "h9d4faf",
            "score": 7,
            "text": "I really thought this said a storm blew off a part of his face...goddamn",
            "title_similarity": "0.45463464",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9d9c4j",
            "score": -6,
            "text": "No they aren't.",
            "title_similarity": "-0.048973702",
            "sentiment_compound": -0.296
        },
        {
            "id": "h9d3bwj",
            "score": 1,
            "text": "I initially read that as “face” which made it a very different story.",
            "title_similarity": "0.24913627",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9d5ipw",
            "score": 1,
            "text": "I did not know that! Pretty cool",
            "title_similarity": "0.15001772",
            "sentiment_compound": -0.1581
        },
        {
            "id": "h9dcejn",
            "score": -1,
            "text": "Tiwan is a country.",
            "title_similarity": "0.19261423",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9dhmr1",
            "score": 1,
            "text": "A reboot could be huge.",
            "title_similarity": "0.16893949",
            "sentiment_compound": 0.3182
        },
        {
            "id": "h9dkb62",
            "score": -1,
            "text": "Fun fact: I'm eskimo brothers with Mike Judge",
            "title_similarity": "0.5487671",
            "sentiment_compound": 0.5106
        },
        {
            "id": "h9dkti6",
            "score": -1,
            "text": "I’m from Colorado… people here don’t care to much for Texans.. mostly because they buy second homes here… also they’re assholes at bars.. other than that, they’re excellent people.",
            "title_similarity": "0.6205548",
            "sentiment_compound": 0.4767
        },
        {
            "id": "h9dluv9",
            "score": 1,
            "text": "Meanwhile every character is really annoying except for Boomhauer 😂",
            "title_similarity": "0.26372224",
            "sentiment_compound": -0.024
        },
        {
            "id": "h9dml96",
            "score": 1,
            "text": "Who moves TO Texas?",
            "title_similarity": "0.34800962",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9dplze",
            "score": -1,
            "text": "typical nazi apologia smh. /s",
            "title_similarity": "0.29900986",
            "sentiment_compound": -0.3182
        },
        {
            "id": "h9dumi3",
            "score": -1,
            "text": "But they're actually traitors",
            "title_similarity": "0.21028702",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9e5n3x",
            "score": 1,
            "text": "I hate Peggy Hill.",
            "title_similarity": "0.22438338",
            "sentiment_compound": -0.5719
        },
        {
            "id": "h9ehm0n",
            "score": 1,
            "text": "I live in Texas and my Grandmother's mobile home was demolished by a tornado. The church she went to every Sunday said that they would help build her a new home, but they ended up adding an extra wing on to the church instead. \n\nThe tornado had caused damage to the church's roof, but it tore my grandmother's home in half and she had no insurance. Fuck that Church.",
            "title_similarity": "0.70341444",
            "sentiment_compound": -0.3559
        },
        {
            "id": "h9ejsej",
            "score": 1,
            "text": "Now if only my fellow Texans would ‘do the right thing’ and get their asses vaccinated and wear their masks for everyone else’s sake…",
            "title_similarity": "0.5663607",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9em1ew",
            "score": -1,
            "text": "I just woke up and i read that as blew off part of his face and i was very intrigued for a moment about how his neighbors just fixed his face for him.",
            "title_similarity": "0.6486486",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9ephxn",
            "score": 1,
            "text": "hank hill looks and sounds almost exactly like tom anderson from beavis and butthead...so im inclined to say that feel good neighbor crap is bs",
            "title_similarity": "0.5585299",
            "sentiment_compound": 0.3657
        },
        {
            "id": "h9es2js",
            "score": -1,
            "text": "Being white in the south isn't that bad, until they find out you married a poc. Then you get a dead raccoon in your letter box.\n\nDownvote me, southerners in denial.",
            "title_similarity": "0.6178176",
            "sentiment_compound": -0.3506
        },
        {
            "id": "h9ewygb",
            "score": 1,
            "text": "Texas now - MAKE ME WEAR A MASK AND I'LL THREATEN TO KILL YOU!",
            "title_similarity": "0.38109058",
            "sentiment_compound": -0.8767
        },
        {
            "id": "h9f47zg",
            "score": 1,
            "text": "My how times have changed.",
            "title_similarity": "0.05583275",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9f8mv2",
            "score": -1,
            "text": "I wonder if they would've done the same if he was black.",
            "title_similarity": "0.25568196",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9fjo5a",
            "score": 1,
            "text": "But Reddit keeps telling me that everybody in Texas, especially those that were there pre-1997, are just a bunch of racist assholes who couldn't care less about anyone but themselves!",
            "title_similarity": "0.578303",
            "sentiment_compound": -0.9471
        },
        {
            "id": "h9fmybp",
            "score": -1,
            "text": "King is the best show about conservativism. Though a better definition would be libertarianism. It is the best remedy for all the SJW shows on TV today. \n\nKahn was yellowface. That is problematic.\n\nThe show never addressed the Confederate flag. That is one problem. The south is full of pro Confederacy names. These is no solution.",
            "title_similarity": "0.63487315",
            "sentiment_compound": 0.7301
        },
        {
            "id": "h9fosvw",
            "score": -1,
            "text": "If you’re white…",
            "title_similarity": "0.0722021",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9d9v7d",
            "score": -2,
            "text": "Funny I was watching a bunch of beavis and butthead clips and his name pops up",
            "title_similarity": "0.3903577",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h9dazh3",
            "score": 2,
            "text": "The existence of Peggy Hill proves this statement false.",
            "title_similarity": "0.19814822",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9daznj",
            "score": 2,
            "text": "I always hoped Dale would get his own spin off show. The shit they could of done on Dale after dark...",
            "title_similarity": "0.5620681",
            "sentiment_compound": 0.765
        },
        {
            "id": "h9db4g1",
            "score": -2,
            "text": "King of the Hill is one of those shows that has its funny moments, but certain characters just ruin a lot of the enjoyment of it as a whole. Bobby Hill is one of those characters. He is just such an infuriating character.",
            "title_similarity": "0.45077437",
            "sentiment_compound": -0.3182
        },
        {
            "id": "h9dfpfm",
            "score": -2,
            "text": "I LOVE Mike Judge; but I never liked this show. I think because I was only mildly entertaining because it was animated. It could have easily been the most boring live action sitcom ever. It would be like if Rosanne was called DJ and had a continuous laugh track.",
            "title_similarity": "0.5521098",
            "sentiment_compound": 0.9132
        },
        {
            "id": "h9dg0f3",
            "score": 2,
            "text": "Especially that John Redcorn. He's so kind the way he's always healing Mrs. Gribble.",
            "title_similarity": "0.5241492",
            "sentiment_compound": 0.656
        },
        {
            "id": "h9dhoa1",
            "score": -2,
            "text": "Mike Judge then made millions satirizing those people. \n\nSorry, but you can't have the schadenfreude of Idiocracy and sincere homespun appreciation for regular people in the same thought.\n\nRight?\n\nBecause no one watches Idiocracy and thinks its about them.",
            "title_similarity": "0.57907975",
            "sentiment_compound": 0.7227
        },
        {
            "id": "h9dkf2c",
            "score": -2,
            "text": "Anytime I think I should sit down and watch all of KoTH I remember the running joke with John Recorn banging Dale's wife, and how they each entirely get away with everything.\n\nI know it gets resolved later where he stops doing so, it's not a big deal and it doesn't define the show, but it's such a sour thought it'd make it hard for me to get into the other things.",
            "title_similarity": "0.6165837",
            "sentiment_compound": 0.0129
        },
        {
            "id": "h9dndxo",
            "score": 2,
            "text": "Until Covid.  And certain people treated you like a pariah if you wore a goddamn mask.",
            "title_similarity": "0.38690937",
            "sentiment_compound": 0.128
        },
        {
            "id": "h9dqokg",
            "score": 2,
            "text": "This is a myth.  \n\nThe real story is that some kids, I think one calls himself Butthole and the other one's name is Joe, I think. I believe they were oriental.  They were the ones who damaged the fence.",
            "title_similarity": "0.53554875",
            "sentiment_compound": -0.4404
        },
        {
            "id": "h9evwhu",
            "score": 2,
            "text": "Careful with that \"good people\".  People can be good in one way, but want all atheists dead.",
            "title_similarity": "0.54963875",
            "sentiment_compound": -0.5574
        },
        {
            "id": "h9d967m",
            "score": 8,
            "text": "Meanwhile redditors in this situation would get a lawyer and ask Reddit on what the fuck their neighbors problem is",
            "title_similarity": "0.46361065",
            "sentiment_compound": -0.7351
        },
        {
            "id": "h9d9c2s",
            "score": 34,
            "text": "King of the Hill is without a doubt my favorite show of all time and I still watch it daily. Mike Judge is an absolute comedic genius. I still laugh at the same jokes I’ve heard 100 times over the last 20+ years. I hate to sound like a gatekeeper but I don’t think you can fully appreciate the show unless you’re from Texas. I recently saw in another thread on Reddit that someone didn’t know the origins of Luanne’s name. The Luanne Platter is a popular dish at the Texas cafeteria style restaurant Luby’s. I wonder how many more jokes are lost on people that aren’t from here.",
            "title_similarity": "0.6481976",
            "sentiment_compound": 0.9168
        },
        {
            "id": "h9db51o",
            "score": -2,
            "text": "Hank was funnier when he was in Beavis and Butthead",
            "title_similarity": "0.34374523",
            "sentiment_compound": 0.4019
        },
        {
            "id": "h9de1ey",
            "score": -3,
            "text": "Interesting how they vote in Texas, no?",
            "title_similarity": "0.5026592",
            "sentiment_compound": 0.4019
        },
        {
            "id": "h9decvg",
            "score": 3,
            "text": "Arlen is based on a town next to my hometown of Belton, Texas. They used to play my high school in football on the show. Growing up I thought it was a show just for people in Central Texas. It wasn’t till college that I realized it was a National show. I was shocked when my California roomate knew all about it.",
            "title_similarity": "0.6895166",
            "sentiment_compound": 0.2023
        },
        {
            "id": "h9denfc",
            "score": 3,
            "text": "Gem of a series- I’ve been rewatching the show in it’s entirety this summer and it’s been therapeutic - with all the chaos, madness and pain happening all around, it’s such a beautiful escape. Find myself wishing there were more real people like Hank in the roles, especially in Texas… and Florida.. and all of the south.. we’ll, everywhere in the world",
            "title_similarity": "0.61065054",
            "sentiment_compound": -0.1621
        },
        {
            "id": "h9diipm",
            "score": 2,
            "text": "*Looks at John Redcorn*",
            "title_similarity": "0.2662757",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9enzf3",
            "score": 2,
            "text": "This does not check out... Since moving here I've only experienced backwoods hicks with low iq , anti vax and just horrible people... Texas needs to be cut off from the country.",
            "title_similarity": "0.5806792",
            "sentiment_compound": -0.8402
        },
        {
            "id": "h9eyt3u",
            "score": -3,
            "text": "Who else isn't getting vaccinated like me , but got my hands on a vaccination card",
            "title_similarity": "0.3986501",
            "sentiment_compound": -0.1419
        },
        {
            "id": "h9d1o2e",
            "score": 13,
            "text": "They just wanted to make sure the Yankee was properly fenced in so he couldn't escape.",
            "title_similarity": "0.54036653",
            "sentiment_compound": 0.1326
        },
        {
            "id": "h9d9xiq",
            "score": 5,
            "text": "I caught that guy whackin' it in mah tool shed.",
            "title_similarity": "0.440103",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9dox1u",
            "score": 4,
            "text": "So I spend a lot of time on this website. I've learned that small town folks are basically bigoted losers who don't know what is right or good.\n\nThis story and its popularity seems to disagree with the general consensus that small town/conservative people are good people.\n\nWhat gives?",
            "title_similarity": "0.5153292",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h9dqdtm",
            "score": 5,
            "text": "> After his new neighbors fixed it for him, no questions asked, it became the basis for King Of The Hill - \"about neighbors who... ultimately, do the right thing and do right by people and are basically good people.\"\n\nIt always stood out to me for that reason, since it's something of a rarity to find an animated comedy aimed at adult audiences where the characters aren't assholes to each other, their neighbours, and everyone else.\n\nNot that there's anything wrong with animated comedies about assholes, but it's nice to have a palate cleanser or two to break them up sometimes.",
            "title_similarity": "0.7065569",
            "sentiment_compound": 0.6412
        },
        {
            "id": "h9dtz6l",
            "score": -4,
            "text": "Too bad this doesn't exist in Texas any more.\nRIP Texas hospitality",
            "title_similarity": "0.5584658",
            "sentiment_compound": -0.5423
        },
        {
            "id": "h9dwr3f",
            "score": 5,
            "text": "If I'm not mistaken, Dale Gribble is literally based on Alex Jones.\n\nJust a fun lil fact",
            "title_similarity": "0.44319704",
            "sentiment_compound": 0.6608
        },
        {
            "id": "h9eli90",
            "score": -4,
            "text": "King of the Hill is basically propaganda for racist conservative Texans. It's the same way the \"documentary\" show Cops was propaganda for pigs.",
            "title_similarity": "0.52156144",
            "sentiment_compound": -0.7906
        },
        {
            "id": "h9epcjv",
            "score": 4,
            "text": "I’ve lived in a conservative part of my state/country for the past few decades ( there are STILL several TRUMP flags in my neighborhood) and all my neighbors are friendly and helpful and go out of their way to be good neighbors. I’m also a married cis white straight woman. Those same neighbors are openly hostile towards POC and LGBTQ+ folks. I think your experience of whether people “ultimately do the right thing” depends a lot on whether those people perceive you as being “one of them” and to me, that’s not a recommendation.  I don’t talk politics (and don’t even know if Biden flags are a thing) and as long as I don’t, I feel sure they will stay good neighbors. \n\nI appreciated that Judge portrayed Hank’s feelings toward Kahn as ambivalent or distrustful at first, but it didn’t go far enough. And he certainly warmed to Kahn eventually in a way that I have never experienced. There’s never any warming or learning that all people are really the same here.",
            "title_similarity": "0.6870871",
            "sentiment_compound": 0.8602
        },
        {
            "id": "h9dqgwa",
            "score": -7,
            "text": "as long as youre white",
            "title_similarity": "0.13620742",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9eenkh",
            "score": -5,
            "text": "Oh look another white guy let's help him",
            "title_similarity": "0.22762674",
            "sentiment_compound": 0.4019
        },
        {
            "id": "h9d1qlq",
            "score": 206,
            "text": "i always like how that show seemed clearly \"liberal\" and made very light jokes at \"conservatives\" but only ever focused on the positive side of boths' politics. Its hard to explain what I mean i guess. Some of the scenes, you might be thinking HA! Take that conservatives! but then you are like wait a second, should they though? I am not sure which side I am supposed to be agreeing with! Anytime hank says something forwardly conservative it feels like he is so innocent. I don't what i am trying to say but the show manages to be entertainment for a spectrum of politic views without alienating anyone too badly. Helps make either side sympathetic to the others point of view in a positive way if you ask me. Like even if we don't agree, we can still get along but I am also not afraid to kick some ass when it is needed. Because if hank hill wants to kick your ass you know you deserve it.",
            "title_similarity": "0.5904305",
            "sentiment_compound": 0.9809
        },
        {
            "id": "h9da2ml",
            "score": 4,
            "text": "King of the hill is top tier, the comedy/stories are dank.\n\nTruly underrated. Get in early before the weirdos catch on.",
            "title_similarity": "0.4196938",
            "sentiment_compound": 0.3818
        },
        {
            "id": "h9djrkt",
            "score": 6,
            "text": "Thirty years born and raised in Texas and only started this show this past month for the first time. I’m absolutely amazed at the accuracy and wholesomeness within each episode. Judge was on another level with relatability and real issues.\n\nNow… if we can get some Texans to be real Texans in this state and begin to think about other fellow Texans we’ll be all set.",
            "title_similarity": "0.70215356",
            "sentiment_compound": 0.5413
        },
        {
            "id": "h9dptnn",
            "score": -5,
            "text": "Good think Mike Judge wasnt brown, black or asian otherwise the \"friendly\" texas neighbors would have murdered his dog, wife, children and stolen his land.",
            "title_similarity": "0.66594994",
            "sentiment_compound": -0.3612
        },
        {
            "id": "h9d5noj",
            "score": -6,
            "text": "Well, isn't that special.",
            "title_similarity": "-0.06599538",
            "sentiment_compound": -0.0408
        },
        {
            "id": "h9d7s3w",
            "score": 64,
            "text": "It's true. Texans get a lot of shit on this website, but we help eachother out when we need it. I had a tree come down after a storm and I was slowly but surely cutting it up. I had 3 neighbors with their own chainsaws come over no questions asked and helped me make a 3 hour job a 30 minute one. It was awesome. I kept what wood I could and seasoned it, that next winter was the \"snowpocalypse\" and a lot of our neighbors lost power. I gave all of that wood away as I had propane and power still.",
            "title_similarity": "0.75214875",
            "sentiment_compound": 0.8573
        },
        {
            "id": "h9da2lb",
            "score": 9,
            "text": "Damnit Bobby",
            "title_similarity": "0.101803295",
            "sentiment_compound": -0.5267
        },
        {
            "id": "h9dehyf",
            "score": 9,
            "text": "Americans are without a doubt some of the nicest, most well intentioned people on the planet. \n\nJust don’t fucking try to tell them what to do or you’ll be in for a world of hurt.",
            "title_similarity": "0.50883937",
            "sentiment_compound": 0.5111
        },
        {
            "id": "h9d5tdg",
            "score": 31,
            "text": "Listen to Boomhauer and then go listen to Dale Earnhardt Jr after a race. You be the judge.",
            "title_similarity": "0.5689132",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9d77aq",
            "score": 34,
            "text": "So are you Japanese or Chinese?",
            "title_similarity": "0.053627085",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9dc6ae",
            "score": 40,
            "text": "I enjoyed the show as a kid, some decent laughs, nice complement to The Simpsons. \n\nBut, dang ol, as a mid-30s, slightly left of center fella living in one of the most conservative parts of Texas suburbia - the show is an absolute masterpiece. I am on my third re-watch since the pandemic started: once early on, a rewatch after my wife got into it, and now a third time for the hell of it. It has replaced The Simpsons 1-12 as background noise. So much great, understated humor with the occasional beyond absurd hilarity. \n\nThe voice work is great - as a kid growing up in the oilfield, the amount of Buck Stricklands you’d come across was staggering, and just so spot on. Even going home now, the alley drinking scene is spot on, albeit much more white trash, way more money, and not nearly as endearing. \n\nAlso, Peggy Hill might be one of the greatest characters of all time - to have a main who is in no way a villain yet having zero redeemable characteristics is just incredible.",
            "title_similarity": "0.65961856",
            "sentiment_compound": 0.9573
        },
        {
            "id": "h9dg36i",
            "score": -13,
            "text": "FFS, you know mainstream US shows have gone to complete shit when KotH is held to such high regard.",
            "title_similarity": "0.41656247",
            "sentiment_compound": -0.8455
        },
        {
            "id": "h9dnz40",
            "score": 14,
            "text": "Bobby is generally a good kid, and often is the moral guidance - also represents a lot of innocence (that Hank shared as a kid).\n\nPeggy, somewhat ignorant tries her best, and might be the worst character next to Cotton. Her redeeming qualities to the show are purely comedic as she's uniquely funny to watch. She often gets into weird antics and awkward situations and wields polite misunderstanding like a baton. Sadly there isn't I don't think there's a ton of depth to her character other than she means well.\n\nCotton, who's loud and crass, usually a mess and present to Hank's detriment always, is strangely funny. He is the cause of Hank being so uptight and rigidness. Hanks relationship really feels one part understanding for the pain his father went through, but also one part resentment (displayed heavily through anxiety) for the brutal upbringing he went through. Cotton has moments of clarity where he is keenly aware that he is out of place.  The episode where they accidentally burn down a church - Cotton takes the blame, because he doesn't want people to hate Bobby for \"causing the fire\" (but also for stinking up the bathroom)  \n\nHank hill is so stuck in ways because of Cotton's severe upbringing and split parents. He usually always sees things one way rejecting change as much as possible. His son Bobby really brings the best out of Hank, who moves out of his comfort zone to support him when the time comes. Hank still kind of sucks sometimes but ultimately tries to do the most good, in his power, and to his understanding (though its lacking). \n\nThe rest of the characters (Khan, the Neighbors, Johnny Redcorn) all have great stories that center around their lives and experiences.  The Kahns Particularly, being Asian-Americans that out of place but fitting in is interesting.\n\nAlot of the characters have major defects - but despite that, they are good people - which I think is the thesis of the show (besides comedy). For the most part -> King of the Hill has aged very well. It's a hell of a lot better than most other animated sitcoms.  A lot more realism.",
            "title_similarity": "0.48555142",
            "sentiment_compound": -0.8829
        },
        {
            "id": "h9dlj0i",
            "score": 15,
            "text": "A rare nod from Reddit on the good nature of friendly rural conservatives.",
            "title_similarity": "0.57443726",
            "sentiment_compound": 0.7269
        },
        {
            "id": "h9d7pl3",
            "score": 16,
            "text": "[deleted]",
            "title_similarity": "0.048493862"
        },
        {
            "id": "h9d6jr3",
            "score": -16,
            "text": "their are no good “people” (note I use people very lightly as to be considered a human you must have some Base level of empathy  to your fellow man something which trump supporters lack), as one of the most in Texas because they voted trump",
            "title_similarity": "0.65692085",
            "sentiment_compound": -0.2037
        },
        {
            "id": "h9d8b2g",
            "score": 27,
            "text": "Easily two of the best scenes in the entire show\n\nhttps://youtu.be/MUqEAk1Ftcw\n\nhttps://youtu.be/APl0edZ8gI8",
            "title_similarity": "0.34603557",
            "sentiment_compound": 0.765
        },
        {
            "id": "h9d2527",
            "score": 299,
            "text": "King of The Hill is pretty much American's Comfy Slice of Life Anime",
            "title_similarity": "0.38884208",
            "sentiment_compound": 0.4939
        },
        {
            "id": "h9dbaa0",
            "score": 272,
            "text": "Texan native here, grew up in a suburb north of Austin. \n\nI remember I used to watch King of The Hill, and we referred to it as the \"Normal Life Show\". \n\nThere wasn't a comedic exaggeration to us, that was just how people acted. It wasn't until I've lived in other parts of the country that I get the jokes from King of the Hill.",
            "title_similarity": "0.70661885",
            "sentiment_compound": -0.0665
        },
        {
            "id": "h9da6xs",
            "score": 86,
            "text": "Tell you what, I never liked the show until I moved to Texas and realized it is dead. On. Accurate.",
            "title_similarity": "0.69378114",
            "sentiment_compound": -0.7672
        },
        {
            "id": "h9d24id",
            "score": 3482,
            "text": "King of the Hill is incredibly unique to me because it shows a “positive” example of a “conservative” person. I’m using quotation marks for both terms because these are highly subjective (I know there’s a debate over how Hank Hill votes), but in terms of a socially conservative personality, most of KotH’s cast count. Hank is a man who is incredibly set in his ways. He does not know anything about things outside of his interests and honestly has very little desire to learn more about the world. His stubbornness and traditional nature is the catalyst for many of the conflicts in the show. But unlike virtually any other sitcom “conservative” (again, I use the term very loosely), he is not some walking stereotype of backwards thinking. He’s not a bigot even though he knows next to nothing of life outside of his slice of Texas. If absolutely proven wrong, he doesn’t dig his shoes in to make the problem worse. He doesn’t fully understand his son and his artsy or effeminate ways, but he does support him when the chips are down. He’s just slightly backwater and stuck in his ways, sometimes to a fault. Compare that to Stan Smith or any other character of the same archetype and it’s so interesting to see a character with some depth of character.",
            "title_similarity": "0.59826297",
            "sentiment_compound": -0.4963
        },
        {
            "id": "h9cycfe",
            "score": 694,
            "text": "That show was not a comedy cartoon.\n\nIt was an animated documentary.",
            "title_similarity": "0.22011963",
            "sentiment_compound": -0.2755
        },
        {
            "id": "h9d1a5x",
            "score": 64,
            "text": "Dang ol storm done knock out yo fence man",
            "title_similarity": "0.5319376",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9doygt",
            "score": 61,
            "text": "I was always a fan of the most offensive, dysfunctional, or dark comedic shows out there. I don't know how KOTH made its way into my heart as a teenager born in NYC, but it did. I was abused, my home was hell, and Hank was just so reasonable. \n\nI remember the episode where Connie gets her period and Hank is the only one around to take her to buy pads. Neither of them want to be in the situation, and Connie is standing in the aisle alone staring at all the choices and starts to cry and Hank comes over to help her, an aisle he wouldn't even go down with his own wife. \n\nAnd I dislike thay periods are shamed, and that a grown man would have an issue being in the same aisle with boxes of tampons, but when the chips were down Hank was there for the people he cared about. Hank's wisdom came from a willingness to learn and help others. And he was rewarded with Connie's trust and respect. People aren't perfect, but that's a blueprint for how to honor and interact with others. \n\nAs I've gotten older I've quoted him a lot when issues come up that the show has addressed. He's a real role model for me, and sometimes it genuinely helps to think about what Hank would do.",
            "title_similarity": "0.62030953",
            "sentiment_compound": 0.8348
        },
        {
            "id": "h9czhb8",
            "score": 435,
            "text": "Subtle and gentle comedy.  A dying art.",
            "title_similarity": "0.19400409",
            "sentiment_compound": 0.6597
        },
        {
            "id": "h9d6swd",
            "score": 233,
            "text": "There's a lot of \"Texanisms\" that are explained perfectly to non-Texans. Sugarfoot's menu and decor, for instance. Peggy tried to change it and it failed, literally because people hate that stuff in rural Texas. \n\nTo this day, I use the episode where Peggy fails a football student to encapsulate how much people go for highschool football, even at the expense of the student's education.",
            "title_similarity": "0.6746733",
            "sentiment_compound": -0.6808
        },
        {
            "id": "h9ddt8b",
            "score": 180,
            "text": "Worked the whole run of King of the Hill as a background artist.. had the best time",
            "title_similarity": "0.5218985",
            "sentiment_compound": 0.6369
        },
        {
            "id": "h9d0pgh",
            "score": 242,
            "text": "One of best moments:\n\nhttps://youtu.be/oSzncxYqOaQ",
            "title_similarity": "0.26619723",
            "sentiment_compound": 0.6369
        },
        {
            "id": "h9d8aod",
            "score": 248,
            "text": "I woke up one morning to find the complex fence had been kicked in and panels were everywhere, so I went down with hammer and nails and started fixing the fence, putting the panels back into place. Halfway through the complex handyman turned up thanking me and saying some drunken fool kicked them down during the night, I didn't tell him that I was the drunken fool.",
            "title_similarity": "0.7356272",
            "sentiment_compound": -0.7003
        },
        {
            "id": "h9d2qgd",
            "score": 1193,
            "text": "I had a neighbor snowblow my whole driveway because he wasn’t content with just using his new snowblower on his own driveway. He was going to to his other side neighbor’s driveway, but ANOTHER neighbor got there first.\n\nIt was like living on fucking Rainey Street.",
            "title_similarity": "0.6862891",
            "sentiment_compound": 0.5023
        },
        {
            "id": "h9cxs4h",
            "score": 4928,
            "text": "Yeah man, I tell ya what, man. That dang ol' Internet, man. You just go on there and point and click. Talk about W-W-dot-W-com.",
            "title_similarity": "0.30747506",
            "sentiment_compound": 0.296
        },
        {
            "id": "h9d87vy",
            "score": 365,
            "text": "Hank Hill is one of the most decent people ever portrayed on television. \n\nWatching his character is taking a master-class in how to treat people right, stand up for what you believe in, and seeing what true loyalty to family and friends looks like.",
            "title_similarity": "0.61359334",
            "sentiment_compound": 0.9274
        },
        {
            "id": "h9cz40w",
            "score": 12362,
            "text": "When I was younger I thought Hank Hill was such a dopey nerd.\n\nNow that I'm older I think he's really cool and would love to have a neighbour like him.",
            "title_similarity": "0.5824859",
            "sentiment_compound": 0.796
        },
        {
            "id": "h9d2925",
            "score": 2026,
            "text": "Dale did a lot of things that should have ended their friendship. \n\nBill too, though his usually seemed less malicious and more just sad. \n\nBoomhauer was for the most part a responsible adult.",
            "title_similarity": "0.53073895",
            "sentiment_compound": 0.2698
        },
        {
            "id": "h9d2w7k",
            "score": 2789,
            "text": "Better than his previous town where the local teenage idiots keep getting up to no good in his toolshed that became the basis for a very different show",
            "title_similarity": "0.56045043",
            "sentiment_compound": 0.1265
        },
        {
            "id": "h9d56le",
            "score": 481,
            "text": "I always hear about people who were kids when it was a show but where were all the adults watching it lmao? If I was as old as I am now when it first came out I’d have loved it",
            "title_similarity": "0.52637583",
            "sentiment_compound": 0.9136
        },
        {
            "id": "h9cz763",
            "score": 100,
            "text": "Gttafix’isDangolfence, man",
            "title_similarity": "0.2270344",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9d4x5m",
            "score": 15,
            "text": "That was one of the best shows of all time!!",
            "title_similarity": "0.2754569",
            "sentiment_compound": 0.6988
        },
        {
            "id": "h9d5ypu",
            "score": 1,
            "text": "I don't remember exactly... \n\nWhere did John Redcorn live??",
            "title_similarity": "0.20180506",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9d6cxn",
            "score": 46,
            "text": "[deleted]",
            "title_similarity": "0.048493862"
        },
        {
            "id": "h9d6fv2",
            "score": 1,
            "text": "Glad I learned that today",
            "title_similarity": "0.31967717",
            "sentiment_compound": 0.4588
        },
        {
            "id": "h9d6nnp",
            "score": 2,
            "text": "I misread the title as \"a storm blew off a part of his face\" and I was so confused for a hot second.",
            "title_similarity": "0.4618002",
            "sentiment_compound": -0.6238
        },
        {
            "id": "h9d6v9q",
            "score": 2,
            "text": "Mike Judge has created the most insightful movies of our time.  Prove me wrong.",
            "title_similarity": "0.45415938",
            "sentiment_compound": -0.2732
        },
        {
            "id": "h9d7anb",
            "score": 7,
            "text": "This happened in my neighborhood!  Good folks.\n\nEDIT:  Meaning, this happened to Mike Judge when he lived in my neighborhood.  I'm still here he's not.  It's a good 'hood.",
            "title_similarity": "0.730546",
            "sentiment_compound": 0.1989
        },
        {
            "id": "h9d7b5m",
            "score": 1,
            "text": "Loved that show",
            "title_similarity": "0.21374732",
            "sentiment_compound": 0.5994
        },
        {
            "id": "h9d7f5k",
            "score": 140,
            "text": "Dang ol meaning of life man",
            "title_similarity": "0.27429146",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9d88di",
            "score": 1,
            "text": "I've seen every episode of king of the hill multiple times. I think I read somewhere that it got cancelled because the Cleveland show was more popular",
            "title_similarity": "0.5612671",
            "sentiment_compound": 0.2716
        },
        {
            "id": "h9d8arf",
            "score": 11,
            "text": "Bobby was someone he saw walking by, so there is a real life Bobby that is the basis for his drawing.",
            "title_similarity": "0.45664042",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9d8f4n",
            "score": 1,
            "text": "Fuck I have to watch that show in its entirety.",
            "title_similarity": "0.22083935",
            "sentiment_compound": -0.5423
        },
        {
            "id": "h9d8gyt",
            "score": 1,
            "text": "Yup",
            "title_similarity": "-0.05982452",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9d8hnc",
            "score": 1,
            "text": "“I tell ya whut....”",
            "title_similarity": "0.117203236",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9d8ooa",
            "score": 6,
            "text": "theres so many really good episodes of King Of The Hill",
            "title_similarity": "0.32205996",
            "sentiment_compound": 0.5356
        },
        {
            "id": "h9d8wh3",
            "score": 45,
            "text": "John Redcorn is the most helpful of all, always willing to help out with anything.",
            "title_similarity": "0.38311967",
            "sentiment_compound": 0.6997
        },
        {
            "id": "h9d8xt4",
            "score": 793,
            "text": "Why do you hate things you don't understand?! I don't hate you Bobby.",
            "title_similarity": "0.41397095",
            "sentiment_compound": -0.2486
        },
        {
            "id": "h9d938w",
            "score": 4,
            "text": "Great piece of info. Thank you for sharing. It’s so cool when a real life event leads to important works of art, in whatever medium, especially, current events.",
            "title_similarity": "0.3081249",
            "sentiment_compound": 0.9152
        },
        {
            "id": "h9d964s",
            "score": 1,
            "text": "I initially read this as a storm blew off part of his \"face\".",
            "title_similarity": "0.46804923",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9d96xj",
            "score": 4,
            "text": "A week ago I learned that Hank was an older, retired gent on Beavis and Butthead do America, even though I watched that movie almost 30 years ago.",
            "title_similarity": "0.5812062",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9d9c1k",
            "score": 3,
            "text": "My friend was a nanny for them and he has a painting of Beevus and Butthead over his fireplace.  Class act.",
            "title_similarity": "0.48518008",
            "sentiment_compound": 0.4939
        },
        {
            "id": "h9d9e9z",
            "score": 5,
            "text": "King of the Hill was such a weird show for me because I didn't like the show in general but liked what the show was about.",
            "title_similarity": "0.47434843",
            "sentiment_compound": 0.4205
        },
        {
            "id": "h9d9ylq",
            "score": 1,
            "text": "Never knew that, thanks",
            "title_similarity": "0.12656263",
            "sentiment_compound": -0.3412
        },
        {
            "id": "h9da3so",
            "score": 23,
            "text": "What’s funny is that when I was younger I never could understand him, but as I’ve gotten older I’ve learned a new language hahaha",
            "title_similarity": "0.4473201",
            "sentiment_compound": 0.7814
        },
        {
            "id": "h9da5jp",
            "score": 1,
            "text": "Then what the hell was John Redcorn doing banging dales wife?",
            "title_similarity": "0.37771273",
            "sentiment_compound": -0.6808
        },
        {
            "id": "h9da7sz",
            "score": 4,
            "text": "Almost through the second season and cant believe how well its held up",
            "title_similarity": "0.32474712",
            "sentiment_compound": -0.2057
        },
        {
            "id": "h9dap3h",
            "score": 1,
            "text": "My chance to hear Terry Gross say “Butthead”",
            "title_similarity": "0.3150034",
            "sentiment_compound": -0.2732
        },
        {
            "id": "h9davj1",
            "score": 105,
            "text": "The older I get the more I relate to hank",
            "title_similarity": "0.32844204",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9dbbt7",
            "score": 3,
            "text": "Isn't khhhhhhaaaan!!!!! a bad neighbor?",
            "title_similarity": "0.37287527",
            "sentiment_compound": 0.6147
        },
        {
            "id": "h9dbgr4",
            "score": 1,
            "text": "I like to think that the old man from Beavis and Butt-Head  was then given his own show.\n\nHank made it",
            "title_similarity": "0.61137617",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h9dbiwr",
            "score": 3,
            "text": "God Dammit Bobby! \n\nAmazing show!! Still holds up.",
            "title_similarity": "0.31740114",
            "sentiment_compound": 0.7767
        },
        {
            "id": "h9dbrdc",
            "score": 3,
            "text": "Wasn't hank neighbour's to Beavis and butthead?",
            "title_similarity": "0.40152216",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9dbujp",
            "score": 1,
            "text": "wonder if they rebuilt the fence cus that is a lot of work.",
            "title_similarity": "0.46588534",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9dc7gb",
            "score": 1,
            "text": "Fkn awesome!!!!",
            "title_similarity": "0.04436704",
            "sentiment_compound": 0.7405
        },
        {
            "id": "h9dcb7m",
            "score": 3,
            "text": "\"Please respect my fences right to be a fence\"",
            "title_similarity": "0.41096026",
            "sentiment_compound": 0.6597
        },
        {
            "id": "h9dceiq",
            "score": 1,
            "text": "I literally thought 'how did King of the Hill get started?' because I've been binging it. Thank you!!!",
            "title_similarity": "0.5296464",
            "sentiment_compound": 0.5229
        },
        {
            "id": "h9dcjyw",
            "score": 3,
            "text": "Growing up, I always thought that the show was boring. I mean what was so interesting about a group of guys who were hanging around a fence and drinking beer? Decided to give it another shot when I grew up and now it's one of my favourite shows.",
            "title_similarity": "0.60909534",
            "sentiment_compound": 0.4388
        },
        {
            "id": "h9dcpl7",
            "score": 4,
            "text": "King of the Hill is not a comedy, it is a documentary. Every single one of those people is REAL. \n\nand for those who can't figure out I'm joking, like, no not literally, but having grown up in dallas, every single archetype and trope is based on real people.",
            "title_similarity": "0.534786",
            "sentiment_compound": 0.0116
        },
        {
            "id": "h9dcqq8",
            "score": 1,
            "text": "I thought he was from Texas",
            "title_similarity": "0.42131937",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9dczoe",
            "score": 1,
            "text": "nobody would do that in california",
            "title_similarity": "0.19477071",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9dddft",
            "score": 7,
            "text": "Hank Hill reminds me so much of my dad, I'll never not love this series. The writer nailed the Texas mentality perfectly to me.",
            "title_similarity": "0.77449167",
            "sentiment_compound": 0.7877
        },
        {
            "id": "h9ddn3h",
            "score": 1,
            "text": "Yep.",
            "title_similarity": "-0.085123286",
            "sentiment_compound": 0.296
        },
        {
            "id": "h9ddwjl",
            "score": 1,
            "text": "Mike Judge is a national hero. Office Space and Idiocracy are before their time!",
            "title_similarity": "0.5291168",
            "sentiment_compound": 0.5983
        },
        {
            "id": "h9de0t0",
            "score": 1,
            "text": "This is the best thing you can have in a suburban neighborhood. Your neighbors make or break it. Love mine.",
            "title_similarity": "0.6525733",
            "sentiment_compound": 0.8555
        },
        {
            "id": "h9de4on",
            "score": 1,
            "text": "Pocket sand",
            "title_similarity": "-0.06314557",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9decc6",
            "score": 1,
            "text": "TIL Mike Judge is from Ecuador",
            "title_similarity": "0.22326812",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9delng",
            "score": 4,
            "text": "I’m from G-Arland, TX and I can confirm they did use some old landmarks within that show.",
            "title_similarity": "0.5239258",
            "sentiment_compound": 0.4995
        },
        {
            "id": "h9demli",
            "score": 2,
            "text": "Not before it became the basis of the poor neighbor who's camper bevis and butthead kept jerking off in.",
            "title_similarity": "0.57444257",
            "sentiment_compound": -0.4767
        },
        {
            "id": "h9dep30",
            "score": 67,
            "text": "If I had a neighbor compare me to Hank Hill, I’d be a happy man. \n\nHank is a good man- he doesn’t always know what’s right from the start, but got dangit if he doesn’t learn. \n\nI aspire for Hank levels of greatness.",
            "title_similarity": "0.6535879",
            "sentiment_compound": 0.5106
        },
        {
            "id": "h9dew9i",
            "score": 1,
            "text": "I never got into it when it was on. I watched some episodes here and there. I usually like it. Just never felt the draw to watch it. Was usually around some other show I watched and seem to catch the first or last half of episodes. Maybe someday I will binge it.",
            "title_similarity": "0.509343",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h9deyyt",
            "score": 1,
            "text": "I knew the original Boomhouer. Austin guy who suped up old cars.",
            "title_similarity": "0.5233081",
            "sentiment_compound": 0.3182
        },
        {
            "id": "h9dfm0j",
            "score": 1,
            "text": "I moved to the DFW area and my neighbors are ridiculous nice. I get it",
            "title_similarity": "0.5584383",
            "sentiment_compound": 0.0772
        },
        {
            "id": "h9dfy2b",
            "score": 1,
            "text": "Porky’s Butthole.\n\n[Mike Judge’s inspiration for Boomhauer’s voice.](https://youtu.be/hv5ToEEimTE)",
            "title_similarity": "0.43296576",
            "sentiment_compound": 0.5267
        },
        {
            "id": "h9dg0bu",
            "score": 1,
            "text": "The real question: what town was this in? \n\nBecause, as a Texan, it seems like every mid-sized town from San Antonio to Denton claims that it’s based on them.",
            "title_similarity": "0.46651602",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h9dgjgf",
            "score": 9,
            "text": "Mike Judge lived in the same town as me, Richardson Texas. We always made fun of Garland Tx and thought they were rednecks and we were more urbane and sophisticated. LOL!  \n\"Garland\" became \"Arlen\", and the Meglomart was a real place, except it was called the \"Hypermart\". That store was insanely huge. Workers there often wore roller skates to save time and walking.  \nYup!  \nYup.",
            "title_similarity": "0.5785959",
            "sentiment_compound": 0.96
        },
        {
            "id": "h9dgpee",
            "score": 1,
            "text": "I think the norm was that the dad was supposed to be dumb and fucking shit up, but Hank was smart and fixed shit. Lol",
            "title_similarity": "0.6287446",
            "sentiment_compound": -0.3064
        },
        {
            "id": "h9dgyvr",
            "score": 1,
            "text": "Life long Texan, we do this. Mike Judge is a Texan.",
            "title_similarity": "0.509826",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9dh1jz",
            "score": 3,
            "text": "Just finished watching the whole series for the first time about a month ago. It has honestly aged so well and I really hope the rumoured follow up series gets greenlit. I've already seen Office Space, but I think it's time to start diving into more of Mike Judge's work",
            "title_similarity": "0.62651014",
            "sentiment_compound": 0.642
        },
        {
            "id": "h9dhdbt",
            "score": 1,
            "text": "My block has a little collective like that. We help each other fix stuff, help move heavy objects, leave baskets of free produce out from our gardens, and message eachother when trouble happens. We also tag team to make sure our elderly neighbors (90s) are looked after. Best damn place I've ever lived.",
            "title_similarity": "0.7364404",
            "sentiment_compound": 0.8369
        },
        {
            "id": "h9dhp96",
            "score": 3,
            "text": "My neighbor paid for the whole three that had to be taken out on the border of the property line.  It would have cost me 450.00 (or maybe 1/2 of that I don’t remember). And he said that I’d done enough for him all the time and helped him out…….he paid the full bill for me.  Classy dude he is.",
            "title_similarity": "0.65559906",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h9dipb2",
            "score": 2,
            "text": "Umm... I'm guessing it was the neighbor's fence too",
            "title_similarity": "0.47847682",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9dj1m5",
            "score": 1,
            "text": "I read this as face. His neighbors fixed his face. Night night.",
            "title_similarity": "0.65180755",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9dja5f",
            "score": 1,
            "text": "\"An F in English. Bobby, you speak English.\"",
            "title_similarity": "0.20649312",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9djill",
            "score": 1,
            "text": "How is this true? Hank was a character on beavis and butthead",
            "title_similarity": "0.40593165",
            "sentiment_compound": 0.5023
        },
        {
            "id": "h9djpnz",
            "score": 1,
            "text": "I'll tell you hwat",
            "title_similarity": "0.07783812",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9djxef",
            "score": 2,
            "text": "And then there was idiocracy.",
            "title_similarity": "0.11495822",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9dl14c",
            "score": 6,
            "text": "[deleted]",
            "title_similarity": "0.048493862"
        },
        {
            "id": "h9dl3qy",
            "score": 1,
            "text": "I tell ya hwat",
            "title_similarity": "0.066065796",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9dl984",
            "score": 2,
            "text": "I didn’t get it as a kid growing up. I watched a lot of it and laughed at the easy stuff. Watching it as an adult now is completely different. Such a great show.",
            "title_similarity": "0.45042592",
            "sentiment_compound": 0.8934
        },
        {
            "id": "h9dlhcw",
            "score": 2,
            "text": "Neighbor: \"Oh no the fence broke , keep this dude contained in his perimeter\".",
            "title_similarity": "0.69398284",
            "sentiment_compound": -0.6124
        },
        {
            "id": "h9dlkoy",
            "score": 1,
            "text": "I’m Eskimo brothers with him, that is all.",
            "title_similarity": "0.50048196",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9dln16",
            "score": 1,
            "text": "I love you, Mike Judge!",
            "title_similarity": "0.30926532",
            "sentiment_compound": 0.6696
        },
        {
            "id": "h9dlunk",
            "score": 1,
            "text": "Xz, ͡  :,,,), , ,,  , ,  ,,,and  z--÷----       'v",
            "title_similarity": "0.1157641",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9dm40k",
            "score": 2,
            "text": "bro I fucking love Texans. Im biased cause I've been here my whole life, but godamn when my car broke down in a flood I had all my neighbors offering to tow it and check it out!!",
            "title_similarity": "0.73401487",
            "sentiment_compound": -0.4745
        },
        {
            "id": "h9dmfh0",
            "score": 1,
            "text": "I'm loving Boomhauer transcribed:\n\n>Mr. JUDGE: (As Boomhauer) Well, I'll tell you what, man, love just chill back and get a dang old grill and chill, man, but I'm about to head up to Canada this summer, man.\n\n>Mr. JUDGE: (As Hank) Canada? A man only has so many summers, Boomhauer. Why would you waste yours in a country that's dismantling its navy?\n\n>Mr. JUDGE: (As Boomhauer) (Unintelligible) house-swap with Canadian family for, you know, (unintelligible).",
            "title_similarity": "0.66178656",
            "sentiment_compound": 0.3094
        },
        {
            "id": "h9dmfqw",
            "score": 5,
            "text": "I always loved the episode where hank finds out every businessman he regularly deals with have all been taking advantage of him and know each other",
            "title_similarity": "0.50896907",
            "sentiment_compound": 0.7096
        },
        {
            "id": "h9dn2nh",
            "score": 2,
            "text": "When my family and I were out of town (we had no cell coverage), with a person scheduled to watch our dog, our dog got outside two or three times. (Bad planning, I know, since rectified).  One of our neighbors repaired our gate so the dog couldn't get out without us even knowing they did it. I can't even express how cool that was.",
            "title_similarity": "0.68428904",
            "sentiment_compound": -0.5267
        },
        {
            "id": "h9dn3x8",
            "score": 1,
            "text": "The award I gave is for Mike J’s neighbors.",
            "title_similarity": "0.5707962",
            "sentiment_compound": 0.5423
        },
        {
            "id": "h9dnlbj",
            "score": 1,
            "text": "Wtf. So exactly the opposite of Besvis and Butthead?\n\nAlso exactly the opposite premise Seinfeld was based on.",
            "title_similarity": "0.26244956",
            "sentiment_compound": -0.5859
        },
        {
            "id": "h9dnxox",
            "score": 1,
            "text": "Supposedly based on Garland Texas",
            "title_similarity": "0.3564765",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9dnxrb",
            "score": 1,
            "text": "My belated uncle use to always watch this show... Out of a zillion and one channels we'd always watch some kotf",
            "title_similarity": "0.56141245",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9do1by",
            "score": 1,
            "text": "I really like that phrase, thank you for sharing :)",
            "title_similarity": "0.23970278",
            "sentiment_compound": 0.8777
        },
        {
            "id": "h9douud",
            "score": 2,
            "text": "Show that made me a Texan..... Best flyover stay",
            "title_similarity": "0.5751488",
            "sentiment_compound": 0.6369
        },
        {
            "id": "h9dozdi",
            "score": 1,
            "text": "Mutual Aid? Where did I heard that one before",
            "title_similarity": "0.16419189",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9dp5tq",
            "score": 1,
            "text": "RemindMe! 28 days",
            "title_similarity": "0.15951465",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9dp8qk",
            "score": 1,
            "text": "Why did I spend 2 minutes thinking he lost part of his face? Facepalm lol",
            "title_similarity": "0.4079256",
            "sentiment_compound": 0.128
        },
        {
            "id": "h9dplfi",
            "score": 2,
            "text": "You're a good man, John Redcorn",
            "title_similarity": "0.35142365",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h9dpu14",
            "score": 1,
            "text": "Legend",
            "title_similarity": "0.05176563",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9dq746",
            "score": 1,
            "text": "How lovely :) there's nothing more wholesome than community!",
            "title_similarity": "0.27813083",
            "sentiment_compound": 0.7959
        },
        {
            "id": "h9dqkh5",
            "score": 3,
            "text": "King of the Hill is a national treasure.",
            "title_similarity": "0.30532727",
            "sentiment_compound": 0.296
        },
        {
            "id": "h9dqm9t",
            "score": 3,
            "text": "POCKET SAND!",
            "title_similarity": "-0.04235992",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9dqv7e",
            "score": 6,
            "text": "I love the Simpsons and respect it’s place in history but for me, KOTH is the best animated comedy I’ve ever seen",
            "title_similarity": "0.526554",
            "sentiment_compound": 0.9287
        },
        {
            "id": "h9drckb",
            "score": 1,
            "text": "Yep",
            "title_similarity": "-0.092948996",
            "sentiment_compound": 0.296
        },
        {
            "id": "h9droh4",
            "score": 1,
            "text": "Welcome to Texas",
            "title_similarity": "0.3886835",
            "sentiment_compound": 0.4588
        },
        {
            "id": "h9ds40w",
            "score": 2,
            "text": "Well, you've signed me up.\n\nAs someone who was on the fence about it, I'm going to start watching.",
            "title_similarity": "0.43040523",
            "sentiment_compound": 0.2732
        },
        {
            "id": "h9dsbn5",
            "score": 1,
            "text": "Tell you whut",
            "title_similarity": "-0.0034216866",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9dsgx5",
            "score": 3,
            "text": "Definitely read that as the storm blowing off part of his face and then was confused how his neighbors fixed it for him.",
            "title_similarity": "0.7284711",
            "sentiment_compound": 0.1027
        },
        {
            "id": "h9dslog",
            "score": 2,
            "text": "My neighbors who tried to get us to pay for the fence they put up before we moved in just moved to Texas, maybe they'll learn a thing or two.",
            "title_similarity": "0.7537397",
            "sentiment_compound": -0.1027
        },
        {
            "id": "h9due8o",
            "score": 4,
            "text": "Love Texas. Love the state and the people.",
            "title_similarity": "0.55565554",
            "sentiment_compound": 0.8555
        },
        {
            "id": "h9dv3eo",
            "score": 2,
            "text": "I read fence as face and was really confused",
            "title_similarity": "0.25303957",
            "sentiment_compound": -0.3804
        },
        {
            "id": "h9dv5x3",
            "score": 2,
            "text": "i have said for yrs koth is simultaneously the most perfect celebration and critique of middle class americana i have ever seen.",
            "title_similarity": "0.48368588",
            "sentiment_compound": 0.6115
        },
        {
            "id": "h9dvh03",
            "score": 9,
            "text": "A storm that strong will send an egg through a barn door. Two barn doors if one of thems open.",
            "title_similarity": "0.4569413",
            "sentiment_compound": 0.5106
        },
        {
            "id": "h9dw11q",
            "score": 1,
            "text": "My neighbors both stood out side and told me I shit luck while I cut a tree apart after it fell on my roof. And these are the best neighbors I have had as an adult.",
            "title_similarity": "0.737147",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h9dw892",
            "score": 3,
            "text": "I love King of the Hill. It’s so relatable.",
            "title_similarity": "0.36540723",
            "sentiment_compound": 0.6369
        },
        {
            "id": "h9dww52",
            "score": 2,
            "text": "A couple of months back it had been a very windy night and lots of trash bins had fallen over on my way to the gym. Picked them all up and put the trash back in. Didn't even try and get clout for it (as is the norm nowadays)",
            "title_similarity": "0.5926163",
            "sentiment_compound": -0.3612
        },
        {
            "id": "h9dxiuq",
            "score": 1,
            "text": "Well, dammit, what happened?",
            "title_similarity": "0.04937813",
            "sentiment_compound": 0.2732
        },
        {
            "id": "h9dyrwk",
            "score": 2,
            "text": "Drunk on my own morning lethargy, I read fence as face…",
            "title_similarity": "0.5000857",
            "sentiment_compound": -0.5859
        },
        {
            "id": "h9dytsm",
            "score": 3,
            "text": "Boomhauer was a good friend/neighbor at least. Bill and Dale would always turn on Hank given the opportunity, but it's been a long time since I've seen the series.",
            "title_similarity": "0.70653653",
            "sentiment_compound": 0.431
        },
        {
            "id": "h9e0z3v",
            "score": 15,
            "text": "KoTH was a masterpiece in realistic fiction.   They're all real characters.   \n\nIt's not like one dimensional romance where \"They really love each other\" is about the only interesting thing.  It's not like most sitcoms where it's just \"These idiots and this unstable person continue to actually be really bad people\".\n\nThey actually do things that real people actually spend their time on and have feelings about.  Some stuff is cartoonish and exaggerated but in general... it was all real.\n\nAnd they also handled politics incredibly well.  They showed the issues without fueling the real life shit fires around them, and generally were a really good model for how people could be a bit more progressive without completely losing their identity, even if it takes a long time.",
            "title_similarity": "0.49684942",
            "sentiment_compound": 0.8117
        },
        {
            "id": "h9e3lym",
            "score": 2,
            "text": "\"Good fences make good neighbors\"",
            "title_similarity": "0.45946074",
            "sentiment_compound": 0.7003
        },
        {
            "id": "h9e3p5f",
            "score": 1,
            "text": "Did they know who he was?",
            "title_similarity": "0.13112213",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9e44ia",
            "score": 5,
            "text": "Thise neighbours did more good that day than they'll ever know, I tell you what.",
            "title_similarity": "0.49630356",
            "sentiment_compound": 0.4927
        },
        {
            "id": "h9e7tok",
            "score": 2,
            "text": "Imagining coming outside after a storm and seeing a group of dudes standing around surveying the damage to your yard, sipping their beer and saying “yup.”",
            "title_similarity": "0.5764327",
            "sentiment_compound": -0.4939
        },
        {
            "id": "h9e8bfk",
            "score": 1,
            "text": "Basically good people…and dumb af social misfits of society lol",
            "title_similarity": "0.4160471",
            "sentiment_compound": 0.34
        },
        {
            "id": "h9e8wiq",
            "score": 1,
            "text": "It’s true then ‘Good fences make good neighbors’.",
            "title_similarity": "0.4886138",
            "sentiment_compound": 0.6908
        },
        {
            "id": "h9e92os",
            "score": 1,
            "text": "Unless they want their steak cooked medium, in that case we say no and ask them to politely leave.",
            "title_similarity": "0.48224473",
            "sentiment_compound": -0.2732
        },
        {
            "id": "h9e9hh5",
            "score": 1,
            "text": "[*King of the Hill* is such a fantastic show.](https://m.youtube.com/watch?v=bkID34FPRTk)",
            "title_similarity": "0.3884587",
            "sentiment_compound": 0.5574
        },
        {
            "id": "h9ea6mc",
            "score": 1,
            "text": "Still doesn’t explain the propane and propane accessories.",
            "title_similarity": "0.15685788",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9ea78s",
            "score": 3,
            "text": "I bet they waited like 2 days for him to fix it, and then quietly decided that Twig Boy wasn't up to the task. \n\nOn Day 3, the repair was finished before 8am (and they likely stood by to admire it until almost noon).",
            "title_similarity": "0.60616004",
            "sentiment_compound": 0.6808
        },
        {
            "id": "h9ea987",
            "score": 1,
            "text": "Yep",
            "title_similarity": "-0.092948996",
            "sentiment_compound": 0.296
        },
        {
            "id": "h9eb5nw",
            "score": 2,
            "text": "Something I find strange about that show is that the description of Hank Hill is pretty much everything I hate yet somehow, I like him.",
            "title_similarity": "0.52142847",
            "sentiment_compound": 0.0516
        },
        {
            "id": "h9ebi9a",
            "score": 1,
            "text": "He lived in Richardson, tx  and “arland” from king of the hill is based off of Garland, neighboring big city of Richardson (both suburbs of Dallas County).",
            "title_similarity": "0.53125113",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h9ed76o",
            "score": 1,
            "text": "Never knew this before.\n\nThks",
            "title_similarity": "0.15055175",
            "sentiment_compound": 0.34
        },
        {
            "id": "h9edoiu",
            "score": 1,
            "text": "Tried that in Missouri City. A week later my work van had $9,000 of power tools missing in the middle of the night",
            "title_similarity": "0.55617607",
            "sentiment_compound": -0.296
        },
        {
            "id": "h9ee7jp",
            "score": 3,
            "text": "One thing people forget about consistently is that Texas is really fucking huge. \n\nDesserts to lush forests to wetlands to crazy large cities. \n\nI grew up in suburban and rural Texas and this was not my experience with people growing up, however I recognized the traits and cadences in the show. But there all kinds of people there. And like in most of the gerrymandered states the backwards lunatics are in charge. \n\nWhile I lived there I couldn’t imagine ever wanting to live anywhere else. Now that I don’t, I don’t ever want to move back.",
            "title_similarity": "0.68907803",
            "sentiment_compound": 0.1118
        },
        {
            "id": "h9eei9o",
            "score": 3,
            "text": "King of the Hill is actually a masterpiece.\n\nI liked it as a kid but I LOVE it as an adult. There is some seriously level 300 superhumor in that show",
            "title_similarity": "0.5167357",
            "sentiment_compound": 0.8834
        },
        {
            "id": "h9ef1o2",
            "score": 3,
            "text": "No matter how many years have passed I can re-watch this show a hundred times over, truly one of the best shows of recent memory that even in later seasons was a solid hell of a show.",
            "title_similarity": "0.48125055",
            "sentiment_compound": 0.4635
        },
        {
            "id": "h9eff05",
            "score": 1,
            "text": "This must be an inside joke.",
            "title_similarity": "0.15439446",
            "sentiment_compound": 0.296
        },
        {
            "id": "h9efhyu",
            "score": 2,
            "text": "Do I look like I know what a jpeg is?",
            "title_similarity": "0.1337027",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h9efj17",
            "score": 1,
            "text": "LADYBIRD NOOOOO",
            "title_similarity": "0.06949597",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9efrmm",
            "score": 2,
            "text": "Where I grew up in Texas being kind and neighborly was a *big* deal. You didn’t have to like your neighbors or constantly do stuff like this but if you weren’t kind or at least respectful you’d likely be shunned by the rest of the block. It was a very close not community. We Texans try to do our best to be kind and friendly to everyone (expect for those bigots who hog I-10)",
            "title_similarity": "0.7266218",
            "sentiment_compound": 0.978
        },
        {
            "id": "h9egko9",
            "score": 1,
            "text": "There will never be another show like it. Shit was too clever for its own good.",
            "title_similarity": "0.37565634",
            "sentiment_compound": 0.5859
        },
        {
            "id": "h9ehdbb",
            "score": 1,
            "text": "I just moved to a house that has alley drive ways in Texas. Not sure if that’s the right term but anyway. Praying for cool neighbors and I’m trying to convince my wife to get a KOTH mural on our fence.",
            "title_similarity": "0.7348534",
            "sentiment_compound": 0.803
        },
        {
            "id": "h9ehizy",
            "score": 1,
            "text": "Doesn't that sort of highlight how 'tribalism' works.... 'love thy neighbor, fuck everyone else'.",
            "title_similarity": "0.5510406",
            "sentiment_compound": 0.4228
        },
        {
            "id": "h9ehwem",
            "score": 1,
            "text": "The older I got the more I liked the characters in this show. Except for Peggy. Peggy is just the worst.",
            "title_similarity": "0.47202784",
            "sentiment_compound": -0.2551
        },
        {
            "id": "h9ei5a7",
            "score": 2,
            "text": "I met mike judge when I was bartending in downtown austin like 15 years ago.\nHe was a great guy, really friendly and normal.\nLove his work\n\nName a more quoted movie than office space",
            "title_similarity": "0.6745994",
            "sentiment_compound": 0.9359
        },
        {
            "id": "h9ei6ao",
            "score": 1,
            "text": "Wow. Very wholesome and nice to hear. Thanks for sharing OP.",
            "title_similarity": "0.26506418",
            "sentiment_compound": 0.9112
        },
        {
            "id": "h9ei7be",
            "score": 1,
            "text": "Yup",
            "title_similarity": "-0.05982452",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9eidaf",
            "score": 1,
            "text": "I would be more likely to accept that as a premise for the show if they didn't all keep their mouths shut about Nancy, Redcorn, and Joseph while letting Dale get cucked.",
            "title_similarity": "0.50597084",
            "sentiment_compound": 0.4336
        },
        {
            "id": "h9eifsm",
            "score": 5,
            "text": "My favorite animated show of all time.  I used to watch re-runs on cartoon network at night but they stopped showing them.  Anyone know if it's on another channel or streaming service currently?",
            "title_similarity": "0.5629293",
            "sentiment_compound": -0.09
        },
        {
            "id": "h9eintb",
            "score": 1,
            "text": "This is insanely wholesome",
            "title_similarity": "0.08693382",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9eiov4",
            "score": 1,
            "text": "Ive been told that King of the Hill was originally going to be a live action sitcom, but they decided on animated so that people could voice multiple characters, not sure if that's true or not though",
            "title_similarity": "0.4556085",
            "sentiment_compound": 0.3087
        },
        {
            "id": "h9eiw32",
            "score": 1,
            "text": "Test",
            "title_similarity": "-0.06190238",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9ej2q1",
            "score": 2,
            "text": "Having mostly ignored it as a kid, I recently was convinced by reddit to give the series another try. Welp, turns out it's incredible but was way beyond my understanding. I had a very different kind of family so the Simpsons made more sense...\n\nAnyway, having now binged the first 12 seasons, I'm realizing just how timely the show was. They were incredibly well tuned into the changing shape of the country and the difference between its generations.",
            "title_similarity": "0.68733096",
            "sentiment_compound": 0.5089
        },
        {
            "id": "h9ejxq0",
            "score": 1,
            "text": "Except no one told Dale about Nancy and John Redcorn.",
            "title_similarity": "0.33013523",
            "sentiment_compound": -0.296
        },
        {
            "id": "h9ejy3v",
            "score": 1,
            "text": "I spend my whole childhood thinking that this s how took place in Saint-Irène, Quebec lol.",
            "title_similarity": "0.42782182",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h9ekl99",
            "score": 1,
            "text": "even khan?",
            "title_similarity": "0.061581448",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9ekr1b",
            "score": 2,
            "text": "one of the coolest things i ever saw was in austin texas. a friend introduced me to a man who looked just like hank hill, right down to the glasses. i asked him how his hank hill impression was. after saying it was on point, i told him okay say ghadangit bobby you kids and your videa games i tell you hwhat! and after a perfect delivery i told him now say peggy i'm a man who lives in the real world where real men sell propane and propane accessories! guy was unbelievable, and i laughed my ass off. he could have been the very same guy mr judge modeled the character after. much needed morale after having quite a bad week.\n/ tldr , guy in austin does a spot-on hank hill",
            "title_similarity": "0.7218205",
            "sentiment_compound": 0.8521
        },
        {
            "id": "h9eks72",
            "score": 1,
            "text": "Dang ol' Hank's the man.",
            "title_similarity": "0.36386913",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9eley7",
            "score": 3,
            "text": "The full thing is worth a listen. Terry Gross is a world class interviewer and Mike Judge is a legend.",
            "title_similarity": "0.46488306",
            "sentiment_compound": -0.296
        },
        {
            "id": "h9elmap",
            "score": 1,
            "text": "Plot twist: Those neighbors actually REALLY needed to get the fence back up quickly, because it was helping to obstruct the view of their grow operation.",
            "title_similarity": "0.5720867",
            "sentiment_compound": 0.296
        },
        {
            "id": "h9emat1",
            "score": 1,
            "text": "I read that the storm blew of a part of his face and was pretty horrified and simultaneously impressed by the attitude of his neighbors.",
            "title_similarity": "0.60470283",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h9emdku",
            "score": 2,
            "text": "I tell ya h'what.",
            "title_similarity": "0.0076668076",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9eq2re",
            "score": 5,
            "text": "Bobby, if you weren't my son, I'd hug you.",
            "title_similarity": "0.49294484",
            "sentiment_compound": 0.4767
        },
        {
            "id": "h9er4pp",
            "score": 2,
            "text": "Are you the two boys that's been whackin off in mu tool shed",
            "title_similarity": "0.36910242",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9erewc",
            "score": 1,
            "text": "And that neighbor is my best friend’a wife’s uncle actually. Many of the characters form King of the Hill were named after her family.",
            "title_similarity": "0.6446515",
            "sentiment_compound": 0.6369
        },
        {
            "id": "h9erutj",
            "score": 1,
            "text": "Nice",
            "title_similarity": "0.023332598",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h9eu0q9",
            "score": 1,
            "text": "Dammit, Bobby. Did you knock down the fence?",
            "title_similarity": "0.44806302",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9evlpf",
            "score": 2,
            "text": "Hank blocks fox network except during football season. Smart guy.",
            "title_similarity": "0.5987221",
            "sentiment_compound": 0.2023
        },
        {
            "id": "h9evunj",
            "score": 3,
            "text": "Mike Judge is a national treasure.",
            "title_similarity": "0.2982472",
            "sentiment_compound": 0.296
        },
        {
            "id": "h9ewhwk",
            "score": 3,
            "text": "I grew up being Bobby now I’m Hank\n\n\nCept I tell my kids I love em more.",
            "title_similarity": "0.6394132",
            "sentiment_compound": 0.6369
        },
        {
            "id": "h9ewl9t",
            "score": 1,
            "text": "I live in Texas and a storm earlier this year blew over my neighbors tree and crushed about six feet of my fence. The guy argued I needed to get it fixed ASAP cause he was trying to sell his house. I argued I don’t even need a fence so I was fine with leaving it the way it was. Eventually he hired someone to do the bare minimum repairs & we all won!",
            "title_similarity": "0.84147316",
            "sentiment_compound": -0.3244
        },
        {
            "id": "h9ewwp3",
            "score": 3,
            "text": "Dang ol wind tore up that house I tell you what, like that old Clinton guy, tear the roof off the sucker!",
            "title_similarity": "0.451277",
            "sentiment_compound": -0.2942
        },
        {
            "id": "h9f1tr6",
            "score": 2,
            "text": "now those same neighbors are anti maskers and clogging up hospitals lmao",
            "title_similarity": "0.46108705",
            "sentiment_compound": 0.3818
        },
        {
            "id": "h9f2zbx",
            "score": 1,
            "text": "Hmm",
            "title_similarity": "-0.13017502",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9f3udt",
            "score": 1,
            "text": "Just finished Silicon Valley, and remembered why I like this guys work so much , cool story",
            "title_similarity": "0.55278707",
            "sentiment_compound": 0.6204
        },
        {
            "id": "h9f56l9",
            "score": 1,
            "text": "Oh shit, the king of the hill reboot is happening. \n\nThis is an ad.",
            "title_similarity": "0.35423315",
            "sentiment_compound": -0.5574
        },
        {
            "id": "h9f5vhw",
            "score": 3,
            "text": "KoTH is one of my all time favorite shows. My wife and I just had our first son and he has a long standing family name of Cliff. I have been calling him Good Cliff nonstop and I can’t stop laughing about it to myself.",
            "title_similarity": "0.6344852",
            "sentiment_compound": 0.7845
        },
        {
            "id": "h9f6h5q",
            "score": 1,
            "text": "I read \"a part of his face\" haha",
            "title_similarity": "0.11442302",
            "sentiment_compound": 0.4588
        },
        {
            "id": "h9f6saj",
            "score": 1,
            "text": "“Good fences make good neighbors”",
            "title_similarity": "0.4693091",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h9f7b8c",
            "score": 1,
            "text": "Pocket sand!",
            "title_similarity": "-0.04235992",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9f9gxx",
            "score": 1,
            "text": "King of the hill is probably my favorite cartoon ever",
            "title_similarity": "0.4917063",
            "sentiment_compound": 0.4588
        },
        {
            "id": "h9fapxd",
            "score": 3,
            "text": "Anyone else remember seeing the Hank Hill character in the Beavis and Butthead movie?  Side note that movie is actually pretty good.",
            "title_similarity": "0.5381268",
            "sentiment_compound": 0.7269
        },
        {
            "id": "h9fau0r",
            "score": 2,
            "text": "After all these comments, i have to go for another re-watching.",
            "title_similarity": "0.300115",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9fbxpf",
            "score": 2,
            "text": "I always say that King of the Hill is the most accurate representation of middle-class life in Texas.\n\nOr at least it was when a high school education and a job selling propane and propane accessories bought you a house.",
            "title_similarity": "0.72734797",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9fcenc",
            "score": 3,
            "text": "Long joke, an atheist gets into heaven... God is there to show this person around... Confused and full of questions asks God why or how am I here....... God says because you are a good person. Gay couple walks past, God says good people. Buddhist monk walks past, God says great guy good person. Atheist asks where are all the Christians? God says good people only......",
            "title_similarity": "0.5496296",
            "sentiment_compound": 0.9808
        },
        {
            "id": "h9fcjqh",
            "score": 2,
            "text": "Texans are relatively friendlier vs Eastern or Western states though. \n\nFloridians are nice too.",
            "title_similarity": "0.48979488",
            "sentiment_compound": 0.7003
        },
        {
            "id": "h9fdm32",
            "score": 1,
            "text": "\"Laotian? What ocean?\" -Bill Dauterive",
            "title_similarity": "0.21791343",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9fdsbd",
            "score": 1,
            "text": "Dang it Bobby.",
            "title_similarity": "0.1091685",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9fdwsk",
            "score": 1,
            "text": "*sips beer* “Yep”",
            "title_similarity": "0.14913115",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9fhsg6",
            "score": 1,
            "text": "There’s also an interview where Mike Judge says the 4 characters (Hank, Dale, Bill, Boomhauer) are a modern interpretation of a Greek chorus, with “yep” being their comment on most things in society",
            "title_similarity": "0.4540868",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9fkl15",
            "score": 1,
            "text": "Does anyone know someone like him?",
            "title_similarity": "0.16325623",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h9fm27d",
            "score": 2,
            "text": "This is beautiful. Big King of The Hill fan!!! I live in Oklahoma but the show is one of my comfort shows. Reminds me of older people I care about and idk helps me understand them better..",
            "title_similarity": "0.69061136",
            "sentiment_compound": 0.9594
        },
        {
            "id": "h9fn5cj",
            "score": 1,
            "text": "Cool.  Now explain Idiocracy",
            "title_similarity": "0.19448979",
            "sentiment_compound": 0.3182
        },
        {
            "id": "h9fp4bh",
            "score": 2,
            "text": "except if you order your steak well done.",
            "title_similarity": "0.44684088",
            "sentiment_compound": 0.2732
        },
        {
            "id": "h9fp4w7",
            "score": 1,
            "text": "What about the time hank stole that guy's wallet?",
            "title_similarity": "0.3308131",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9fptj8",
            "score": 1,
            "text": "Boy I tell you hwhat",
            "title_similarity": "0.13942753",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9fqn6u",
            "score": 1,
            "text": "I just found this director from idiocracy",
            "title_similarity": "0.3450616",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9fsz4e",
            "score": 1,
            "text": "And now they wont even wear a mask",
            "title_similarity": "0.12805864",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9fvzxa",
            "score": 2,
            "text": "People from the coasts don’t get how actually genuine Americans are. I grew up in CA moved to the south and was blown away at how people help each other out. I couldn’t even get my neighbors to say hi in CA.",
            "title_similarity": "0.5996306",
            "sentiment_compound": 0.4019
        },
        {
            "id": "h9fxr03",
            "score": 3,
            "text": "I watch this entire show through every year. There’s never been anything quite like it again. Some of the seasons quality dips, but it overall was brilliant.\n\nI’d like if they made a new series set like 20 years later. I think that’s the only right way to do it.",
            "title_similarity": "0.59459484",
            "sentiment_compound": 0.9273
        },
        {
            "id": "h9fzqxk",
            "score": 2,
            "text": "Nevermind John Redcorn fucking Dale's wife, had a son with her, and nobody ever told him.",
            "title_similarity": "0.53959334",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9g6upx",
            "score": 2,
            "text": "Yup, very Texas.",
            "title_similarity": "0.3133161",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9gasnn",
            "score": 1,
            "text": "no such thing as right or good or for or against or not",
            "title_similarity": "0.12427463",
            "sentiment_compound": 0.1779
        },
        {
            "id": "h9gax17",
            "score": 2,
            "text": "I ate hippie gumbo!!",
            "title_similarity": "0.3610195",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9gb36h",
            "score": 1,
            "text": "When I first started watching King of the Hill I wasn't even 10, and while I didn't understand the plots most of the time, and found a good amount of it boring, I still found it strangely captivating. Even to this day it's in my top three animated shows behind Futurama and Over the Garden Wall.",
            "title_similarity": "0.5459312",
            "sentiment_compound": 0.0516
        },
        {
            "id": "h9ggq1v",
            "score": 1,
            "text": "My chocolate lab is named after Hank, my golden is named after Ken Griffey jr, not sure who i admire more but both are awesome people and am proud my boys are named after them",
            "title_similarity": "0.5890943",
            "sentiment_compound": 0.9075
        },
        {
            "id": "h9gjs62",
            "score": 4,
            "text": "Except NOBODY tells Dale about Nancy cheating on him for over a decade...",
            "title_similarity": "0.4617239",
            "sentiment_compound": -0.5574
        },
        {
            "id": "h9h46zi",
            "score": 1,
            "text": "This is a show that is easy to watch, and is a medium good time. It’s a shame that I can’t find anywhere online to watch it for free.",
            "title_similarity": "0.39321837",
            "sentiment_compound": 0.7184
        },
        {
            "id": "h9h6du1",
            "score": 1,
            "text": "Mike Judge is the only dude in animation who I have yet to properly appreciate. I kinda struggled with KOTH and B&B when I tried to watch it.",
            "title_similarity": "0.46361881",
            "sentiment_compound": 0.1513
        },
        {
            "id": "h9i4qjt",
            "score": 1,
            "text": "Ha! I always knew King of the Hill was a documentary.",
            "title_similarity": "0.4204641",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9kiy1j",
            "score": 1,
            "text": "It was based on Alex Jones",
            "title_similarity": "0.19432944",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9ly2u6",
            "score": 1,
            "text": "I about to finish binge watching King Of The Hill again for the second time.  Found it on Hulu last year and can’t believe how good it is.  Definitely did not appreciate it as a child but man as an adult it hits differently.  One of my all time favorite shows because it is grounded in reality.  Hope it comes back again.",
            "title_similarity": "0.64931047",
            "sentiment_compound": 0.8756
        },
        {
            "id": "hbrq5ge",
            "score": 1,
            "text": "God I love KotH… still watch it every night. It’s the only show I have watched every episode literally 100s of times. Not even sure what make me so addicted to it….",
            "title_similarity": "0.51276183",
            "sentiment_compound": 0.6529
        },
        {
            "id": "hc7ptpf",
            "score": 1,
            "text": "Dang ol storm done knock out yo fence man",
            "title_similarity": "0.5319376",
            "sentiment_compound": 0.0
        },
        {
            "id": "hc9lx3u",
            "score": 1,
            "text": "Mike Judge is a national treasure. End of story. If you find him offensive, move to Australia and be locked down for life like you deserve. KotH is literally the best show ever made. Nevis and Butthead is also an American Treasure. Thank you Mike.",
            "title_similarity": "0.61951363",
            "sentiment_compound": 0.8625
        }
    ]
}