{
    "TIL Los Angeles is the first major city in the world to synchronize all its traffic lights. Nearly 4,400 lights across 469 miles receive real-time updates about traffic flow to make second-by-second adjustments. The system limits congestion by up to 16% while also dramatically reducing idling time.\n": [
        {
            "id": "h9jju3y",
            "score": 3,
            "text": "I’m calling BS. Go to LA and try it. The traffic is so screwed up green or not you get stuck. Maybe from 2am-3:30am",
            "title_similarity": "0.560879",
            "sentiment_compound": -0.523
        },
        {
            "id": "h9jo9rn",
            "score": 22,
            "text": "It doesn't work",
            "title_similarity": "-0.13857955",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9jhwmu",
            "score": 3,
            "text": "[removed]",
            "title_similarity": "-0.1083646"
        },
        {
            "id": "h9jud06",
            "score": 3,
            "text": "Then explain why LA still fuckin sucks",
            "title_similarity": "0.10095894",
            "sentiment_compound": -0.4201
        },
        {
            "id": "h9k09n6",
            "score": 2,
            "text": "This is not true.  I take la brea Blvd to work every day and I promise you the lights every block are not sync’d.",
            "title_similarity": "0.5136177",
            "sentiment_compound": -0.4464
        },
        {
            "id": "h9jvn66",
            "score": 0,
            "text": "Pretty sure this is bull shit",
            "title_similarity": "0.1217138",
            "sentiment_compound": 0.2263
        },
        {
            "id": "h9jlvai",
            "score": 1,
            "text": "Great, until it gets hacked and all lights turn green simultaneously.",
            "title_similarity": "0.39514443",
            "sentiment_compound": 0.34
        },
        {
            "id": "h9k3xsu",
            "score": 158,
            "text": "The law of induced demand states that this car centric design will simply increase the number of cars by up to 16%, until you get to the same traffic congestion as before. In any city of sufficient population, the demand for cars will always rise to meet the supply of road capacity. The equilibrium point is when traffic is sufficiently terrible that public transit, cycling, or walking are faster, or when enough trips with flexible time happen during off-peak hours. The latter option is becoming less and less feasible in cities like LA and Boston, though. Rush hour is more like 16 hours a day in these places now…\n\nThe only solutions to this endless gridlock are proper separated bicycle infrastructure, trains, motorcycles, and bus rapid transit. The great suburban car experiment has been an utter failure in every possible way. It’s been financially ruinous, environmentally devastating, socially isolating, and hazardous to our physical and mental health. You’re probably better off smoking a pack a day than dealing with the stress of commuting by car 2 hours a day.\n\nYou want a real solution involving traffic signals? Look to the Netherlands. Their lights are not synchronized. They prioritize transit, bikes, pedestrians, and then private cars, in that order. The signal’s objective is very utilitarian: to get the most people through the intersection as quickly as possible. Cars are at the bottom of the priority queue. The way God intended. You can have 50 people in the area occupied by one bus, 50 bikes in about three buses’ space, or 50 cars in a football field worth of space. Prioritize the people using the road space as efficiently as possible. Let the cagers wait their fucking turn. Fuck cars, all my homies hate cars.",
            "title_similarity": "0.803687",
            "sentiment_compound": -0.4902
        },
        {
            "id": "h9k3u85",
            "score": 1,
            "text": "Uh, I live in LA and I doubt this is true, those street lights are still on timers man, they create major gridlock.\n\nEdit: article is from 2013, is there any update on this because I doubt they actually have this in effect any more",
            "title_similarity": "0.5574063",
            "sentiment_compound": -0.0258
        },
        {
            "id": "h9jv6hm",
            "score": 9,
            "text": "Or or we can build roundabouts instead",
            "title_similarity": "0.2673534",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9jtr3b",
            "score": 15,
            "text": "[deleted]",
            "title_similarity": "-0.06445307"
        },
        {
            "id": "h9kntsj",
            "score": 3,
            "text": "Total bs. Yesterday it took me 20 minutes to go up from la cienega  to San Vicente cause the damn lights kept changing to red. It was 8pm. No reason for that nonsense.",
            "title_similarity": "0.6584785",
            "sentiment_compound": -0.765
        },
        {
            "id": "h9jyp46",
            "score": 44,
            "text": "\"We're monitoring traffic realtime and every minute send out thousands of small adjustments to keep traffic flowing smoother for a 16% improvement in congestion\"\n\n\"Or we just invest money into making a city that's friendly to walking and public transportation\"\n\n\"SIR! That would be unamerican!\"",
            "title_similarity": "0.8267596",
            "sentiment_compound": 0.7772
        },
        {
            "id": "h9jm4yc",
            "score": -8,
            "text": "Not to be *that* guy - but they can do this, but they can't stop homeless people from pooping and leaving needles in the streets?",
            "title_similarity": "0.36131477",
            "sentiment_compound": 0.3252
        },
        {
            "id": "h9jl3ss",
            "score": 0,
            "text": "This seems like them making a marketing pitch to make sure ppl approve of the spending bc if you’ve ever driven in LA you’d know it’s the worst traffic ever. Worse than DC",
            "title_similarity": "0.596763",
            "sentiment_compound": -0.5267
        },
        {
            "id": "h9jow2u",
            "score": 0,
            "text": "\\*cries in Florida\\*",
            "title_similarity": "0.16889116",
            "sentiment_compound": -0.4019
        },
        {
            "id": "h9kb20u",
            "score": 0,
            "text": "Meanwhile they have some of the highest poverty and homeless rates in the country. #Priorities",
            "title_similarity": "0.47702333",
            "sentiment_compound": -0.5106
        },
        {
            "id": "h9kb2po",
            "score": 0,
            "text": "smart city fascism here we come",
            "title_similarity": "0.26093364",
            "sentiment_compound": 0.4019
        },
        {
            "id": "h9kb6ez",
            "score": 0,
            "text": "Yet there’s STILL that little section.. listed on any map Ap just east of downtown LA.. about 6 square blocks of one of the most densely homeless populated areas in the country let alone the world, gee yeah those traffic light funds couldn’t have went towards the 10K homeless and getting them shelter and cleaning up Skid Row?! BTW, in So Cal there’s still rush hours 19 hours out of every fucking day. These fucking traffic lights make no difference \nThe poor stay poor and the rich stay gentrified and in control.",
            "title_similarity": "0.7424172",
            "sentiment_compound": -0.6996
        },
        {
            "id": "h9kdvw5",
            "score": 0,
            "text": "Now imagine combining this system with autonomous cars. The thought of efficiency makes me shudder with anticipation.",
            "title_similarity": "0.46955422",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h9kedyx",
            "score": 0,
            "text": "Great, now clean up skid row...",
            "title_similarity": "0.33274332",
            "sentiment_compound": 0.7783
        },
        {
            "id": "h9kk3cd",
            "score": 0,
            "text": "And still is less efficient than trains.",
            "title_similarity": "0.11694988",
            "sentiment_compound": 0.3626
        },
        {
            "id": "h9kkyb7",
            "score": 0,
            "text": "They could also just build a tram. It's far faster, more effective and easier to maintain. Startup cost is a lot, but it basically pays for itself, and America is one of the richest countries in the world that built a transatlantic railroad before slavery was ended so I think LA can put a little effort into making one instead of that God awful \"hyper loop\" that's essentially another lane but worse. \n\nIt's such a time-tested and practical solution but car culture is a cancer that's taken hold everywhere in America that we'd rather stay an hour in traffic where some bozo might ruin our lives by killing or crashing into us than ride a train.",
            "title_similarity": "0.67912614",
            "sentiment_compound": -0.9745
        },
        {
            "id": "h9kww2p",
            "score": 4,
            "text": "Article is from 2013, so while cool in theory, it clearly hasn't worked as planned.",
            "title_similarity": "0.24558857",
            "sentiment_compound": 0.6461
        },
        {
            "id": "h9l3gr1",
            "score": 0,
            "text": "Why aren't we more up in arms about waiting at lights where we're waiting on NO ONE?  \n\nWaste of gas, more pollution, more noise, wear and tear, more time idling,... There's so many reasons to be against this waste of time.",
            "title_similarity": "0.36860466",
            "sentiment_compound": -0.5928
        },
        {
            "id": "h9l3n91",
            "score": 0,
            "text": "I legit thought that, as a kid, this was already a thing. I assumed adults were smart enough to have done this. Of course, I grew up and realized adults are fucking stupid lol",
            "title_similarity": "0.3780973",
            "sentiment_compound": 0.2698
        },
        {
            "id": "h9l4uu1",
            "score": 0,
            "text": "Sitting still on the 401 this morning, I was wondering if people would accept a system that monitored the traffic via our gps signals to then broadcast a speed limit that would be the most effective for the volume at the time.",
            "title_similarity": "0.7164625",
            "sentiment_compound": 0.7178
        },
        {
            "id": "h9l69a4",
            "score": 0,
            "text": "Waiting for China to hack this in one fell swoop.",
            "title_similarity": "0.38880858",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9l9v2u",
            "score": 0,
            "text": "I don’t know about living with it. But just visiting out there it was fun to treat traffic like a game. Then again the way I drive is definitely not for most.",
            "title_similarity": "0.3975516",
            "sentiment_compound": 0.9413
        },
        {
            "id": "h9lnbjo",
            "score": 0,
            "text": "Could have just used roundabouts.",
            "title_similarity": "0.20842302",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9m5slg",
            "score": 0,
            "text": "And yet my son was not allowed to fly to Hawaii because LA county's public health covid screening is not on their approved list. SMFH",
            "title_similarity": "0.34179294",
            "sentiment_compound": -0.3252
        },
        {
            "id": "h9mkjdr",
            "score": 0,
            "text": "LA also has the shittiest public infrastructure of any major city in the world",
            "title_similarity": "0.50077176",
            "sentiment_compound": -0.6597
        },
        {
            "id": "h9nm2v7",
            "score": 0,
            "text": "but the idiots will still sit through a green light. can't solve traffic issues as long as humans are behind the wheel. need proof? you're 10 cars back from the light. it turns green. you're instantly moving since you pay attention. yet it still take 20 seconds for traffic to move because some dipshit is on their fucking phone NOT paying attention to the road.",
            "title_similarity": "0.66377187",
            "sentiment_compound": -0.7676
        },
        {
            "id": "h9jic3v",
            "score": -21,
            "text": "[deleted]",
            "title_similarity": "-0.06445307"
        },
        {
            "id": "h9kizz5",
            "score": 8,
            "text": "No amount of traffic lights is gonna solve that car infested mess.",
            "title_similarity": "0.3649177",
            "sentiment_compound": -0.4404
        },
        {
            "id": "h9kcu86",
            "score": -1,
            "text": "Huh? The city I grew up in, might not have qualified as *major*, but was not just a *town*, had a system before the turn of the millennium. Maybe less advanced, but you don't get to make an incremental improvement and claim to be first on the whole thing.",
            "title_similarity": "0.51140904",
            "sentiment_compound": 0.7236
        },
        {
            "id": "h9kxq0q",
            "score": 1,
            "text": "Funking amazing. Well done to the guys who did the programming (because NOBODY remembers developers - except other developers).",
            "title_similarity": "0.3814311",
            "sentiment_compound": 0.7096
        },
        {
            "id": "h9ldc1t",
            "score": 1,
            "text": "I call BS.",
            "title_similarity": "0.09096757",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9m6jp6",
            "score": 1,
            "text": "Damn if only there was a way to decrease congestion even more, like some sort of public mass transit system that have been tried and tested, like trains",
            "title_similarity": "0.49896783",
            "sentiment_compound": 0.3804
        },
        {
            "id": "h9moas0",
            "score": 1,
            "text": "And it's still some of the worst traffic in the country",
            "title_similarity": "0.30101168",
            "sentiment_compound": -0.6249
        },
        {
            "id": "h9mqm8x",
            "score": 1,
            "text": "Except it doesn’t. Traffic has gotten progressively worse and you’re an idiot",
            "title_similarity": "0.19974807",
            "sentiment_compound": -0.7506
        },
        {
            "id": "h9nf8ui",
            "score": -1,
            "text": "Boston requests immediate assistance",
            "title_similarity": "0.23119006",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9jjzi9",
            "score": 188,
            "text": "so if you get stuck at 1 red you get stuck at them all? because that would be my luck",
            "title_similarity": "0.40467513",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9jw0jd",
            "score": 8,
            "text": "It litteraly is how Skynet was born. \n\nA software designed to handle L.A traffic.",
            "title_similarity": "0.49105084",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9jpxua",
            "score": 33,
            "text": "Yo LA figure out the 101/405 bullshit and the 101/134 bullshit and whatever the holy hell happens at western on the 101 at every time of day and the whole wtf 10/110 situation and then we can talk about how we are getting our shit together in regards to traffic",
            "title_similarity": "0.66395175",
            "sentiment_compound": -0.9666
        },
        {
            "id": "h9k13vl",
            "score": 9,
            "text": "LA also has street level light rail which doesn't have signal priority. Trains full of people literally wait at a stop light for people in cars (most of them single occupancy) to make a left turn. 👎",
            "title_similarity": "0.46099418",
            "sentiment_compound": -0.296
        },
        {
            "id": "h9k51vo",
            "score": 2,
            "text": "Then tell me what the fuck is going on in Van Nuys! The light at the corner at Victory and Sylmar usually takes up to four minutes!",
            "title_similarity": "0.6636676",
            "sentiment_compound": -0.6229
        },
        {
            "id": "h9kojk5",
            "score": 2,
            "text": "Recently went to Florida and the red lights seemed to take forever. Would drive me insane",
            "title_similarity": "0.441118",
            "sentiment_compound": -0.4019
        },
        {
            "id": "h9la2me",
            "score": 2,
            "text": "Traffic lights are a bandaid. You should be a) trying to limit suburban sprawl which makes neighborhoods walkable/bikeable and b) incorporating more roundabouts and spillway lanes.\n\nJust get rid of stroads, the majority of conflicts in which aren't controlled by light but their congestion caused increases the need for lights.",
            "title_similarity": "0.5934412",
            "sentiment_compound": -0.2023
        },
        {
            "id": "h9lbtly",
            "score": 2,
            "text": "Montgomery, AL sync'ed the lights on their southern connector back in the 1980's. They had signage that displayed the speed for which they were synced, usually 45MPH, and if you drove at the current speed, you'd only ever stop at one light.  \n\nThey certainly didn't have **ALL** their lights synchronized though.",
            "title_similarity": "0.65649223",
            "sentiment_compound": 0.0516
        },
        {
            "id": "h9mtgvm",
            "score": 2,
            "text": "Or you could build a subway and modern mass transport system like every advanced city in the world?",
            "title_similarity": "0.4709175",
            "sentiment_compound": 0.5423
        },
        {
            "id": "h9kn7r9",
            "score": 10,
            "text": "Well I’m in Los Angeles and if that’s true, why does it make us sit for 5 minutes at a red light in the middle of the night with zero cars in sight?",
            "title_similarity": "0.60693485",
            "sentiment_compound": 0.5994
        },
        {
            "id": "h9jtblr",
            "score": 2,
            "text": "The one good thing about Phoenix compared to anywhere in Texas.. The lights sink up and it's wonderful!!",
            "title_similarity": "0.44451684",
            "sentiment_compound": 0.8011
        },
        {
            "id": "h9kxxlk",
            "score": 3,
            "text": "I live in Los Angeles... nuh uh.",
            "title_similarity": "0.20062488",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9jie5w",
            "score": 1700,
            "text": "It's  called \"riding the green wave\".  Every person I know who drives professionally knows about this.\n\nMost cities have some form of this on many of their major roads. \n\nDrive the speed limit, exactly the speed limit. Chances are It's faster than speeding because the lights are timed to the speed limit. \n\nIn my city I can get from one side of town to the other without getting a single red light if I time it right.",
            "title_similarity": "0.77428913",
            "sentiment_compound": 0.2023
        },
        {
            "id": "h9kac7m",
            "score": 144,
            "text": "I live in LA and this just doesn't feel true to me. The reason I say this is because during low-traffic hours, you can sit at a light for no reason (no cross-traffic) and it will not change. I have idled for minutes waiting for a light to turn, with no obstructing traffic going through the intersection.\n\nIt's super frustrating sometimes.",
            "title_similarity": "0.53727794",
            "sentiment_compound": -0.5764
        },
        {
            "id": "h9jwksq",
            "score": 40,
            "text": "LPT if you want to catch all the greens go exactly the speed limit",
            "title_similarity": "0.5371976",
            "sentiment_compound": 0.0772
        },
        {
            "id": "h9lcgrc",
            "score": 3,
            "text": "Incredible when considering the size of LA. I don’t think you can get an accurate picture unless flying into LAX. Only then do you realize the immense size of Los Angeles.",
            "title_similarity": "0.56451094",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9lejbb",
            "score": 4,
            "text": "Looks great on paper\n\n\n-Guy posting this while hitting every red light in LA....",
            "title_similarity": "0.55743515",
            "sentiment_compound": 0.6249
        },
        {
            "id": "h9jkxww",
            "score": 43,
            "text": "It really makes a game of “red light, green light” predictable though.",
            "title_similarity": "0.30870938",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9kugno",
            "score": 4,
            "text": "I swear to God: knew a maintenance guy who worked for a small city. I asked him why they didn't. He almost looked embarrassed. \"We proposed syncing the stoplights at a city council meeting. It is so easy with modern stoplights. The business people in town went nuts. They *want* people stopped at stoplights. That way they have to look at your business and just may pull in.\"\n\nSimilar issue in the small tourist town I live in now. One main street with big rig truckers and machinery coming through town. Everywhere we see \"Stop the Bypass!\" signs. \n\nAs if that truck driver on a long haul delivery is going to shop at a boutique.",
            "title_similarity": "0.62158346",
            "sentiment_compound": -0.3554
        },
        {
            "id": "h9lat24",
            "score": 6,
            "text": "Impressive but completely ignores the root of the problem that car dependence is terrible planning for a city as large as LA.  It's like cutting the crust off a shit sandwich.",
            "title_similarity": "0.45976567",
            "sentiment_compound": -0.9192
        },
        {
            "id": "h9lggzm",
            "score": 7,
            "text": "LA did this in 2013 and claimed to be the first city in the world. \n\n[Sydney](https://en.m.wikipedia.org/wiki/Sydney_Coordinated_Adaptive_Traffic_System) did it in the 1970s.",
            "title_similarity": "0.4878183",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9jxygu",
            "score": 8,
            "text": "I remember when this started I was like “huh, Signal Sync, that’s cool” and now I’m like “THIS IS REVOLUTIONARY”",
            "title_similarity": "0.23013176",
            "sentiment_compound": 0.6124
        },
        {
            "id": "h9kyha2",
            "score": 41,
            "text": "Must be synched using 98' Compaq machine cause I'm constantly having to report broken traffic lights after they aren't fixed for a week😒🚦",
            "title_similarity": "0.66407025",
            "sentiment_compound": -0.4767
        },
        {
            "id": "h9jzkyq",
            "score": 115,
            "text": "Joan Dideon has an essay, \"Bureaucrats\", about the highway control center for Los Angeles. Would highly recommend. It's in The White Album.",
            "title_similarity": "0.49608707",
            "sentiment_compound": 0.4201
        },
        {
            "id": "h9jq55h",
            "score": 796,
            "text": "Even after all of this. It’ll just be bumper to bumper traffic Lmao.",
            "title_similarity": "0.5149566",
            "sentiment_compound": 0.5994
        },
        {
            "id": "h9joz8h",
            "score": 4054,
            "text": "From a science perspective, this kind of thing is really cool. From a real world perspective, driving in LA is worse than if your dentist was also the DMV.",
            "title_similarity": "0.55730736",
            "sentiment_compound": -0.1298
        },
        {
            "id": "h9jxedu",
            "score": 3401,
            "text": "In 50 years, two things only I’ve seen limit traffic congestion in L.A.:  immediately post 9/11 and the pandemic lockdown",
            "title_similarity": "0.6961386",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9ka1gf",
            "score": 445,
            "text": "As shown by Seth Green in *The Italian Job*",
            "title_similarity": "0.3212077",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9jmix2",
            "score": 14766,
            "text": "I’m pretty sure I’m in a city that has successfully unsynced all it’s traffic lights.",
            "title_similarity": "0.51693004",
            "sentiment_compound": 0.8271
        },
        {
            "id": "h9jt92y",
            "score": 1,
            "text": "20 years ago I'd ride a green wave on my way to work occasionally and it was based on luck.",
            "title_similarity": "0.5025219",
            "sentiment_compound": 0.4588
        },
        {
            "id": "h9jv832",
            "score": 1,
            "text": "In a Roundabout way",
            "title_similarity": "-0.06533922",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9jwavv",
            "score": 1,
            "text": "Maybe this is way more difficult than I though but I feel like we should be able to time traffic lights to move chunks of traffic with minimal stopping, like rolling red/green lights that mean you typically don't hit multiple reds in a row during normal traffic.\nFrustrates me to no end that we don't have better systems",
            "title_similarity": "0.5977458",
            "sentiment_compound": -0.7232
        },
        {
            "id": "h9jzi2o",
            "score": 1,
            "text": "Having spent 15 years in that morass, I'm highly skeptical.",
            "title_similarity": "0.38267782",
            "sentiment_compound": -0.3804
        },
        {
            "id": "h9k04je",
            "score": 1,
            "text": "You could have fooled me.",
            "title_similarity": "0.047379047",
            "sentiment_compound": -0.3818
        },
        {
            "id": "h9k0oo5",
            "score": 1,
            "text": "Denver does the complete opposite of this, I swear.",
            "title_similarity": "0.10329455",
            "sentiment_compound": -0.0516
        },
        {
            "id": "h9k0sjk",
            "score": 1,
            "text": "No one tell them the efficiency of a well mapped metro and regional train system, it’d really make this look a lot less impressive.",
            "title_similarity": "0.40709883",
            "sentiment_compound": 0.6605
        },
        {
            "id": "h9k1oup",
            "score": 1,
            "text": "yet, they still have red left turn arrows",
            "title_similarity": "0.2995084",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9k1qiq",
            "score": 1,
            "text": "I’m shocked this is 2021, I actually assumed we already did this….wtf.",
            "title_similarity": "0.2189066",
            "sentiment_compound": -0.3182
        },
        {
            "id": "h9k21br",
            "score": 1,
            "text": "I just wish it worked. I am in bumper to bumper traffic at 6am on my way to work in the mornings",
            "title_similarity": "0.552505",
            "sentiment_compound": 0.4019
        },
        {
            "id": "h9k2pin",
            "score": 1,
            "text": "Shit like this should be the bare minimum in the 21st century",
            "title_similarity": "0.20584956",
            "sentiment_compound": -0.2732
        },
        {
            "id": "h9k2ygf",
            "score": 1,
            "text": "This is so cool. I wish they would implement something like this in London city",
            "title_similarity": "0.29607296",
            "sentiment_compound": 0.8154
        },
        {
            "id": "h9k3ni6",
            "score": 1,
            "text": "This may be the only thing I know about California that I actually support.",
            "title_similarity": "0.29111123",
            "sentiment_compound": 0.4019
        },
        {
            "id": "h9k50e0",
            "score": 1,
            "text": "This is the future of America, pls.",
            "title_similarity": "0.12058991",
            "sentiment_compound": 0.0772
        },
        {
            "id": "h9k592w",
            "score": 1,
            "text": "But, keep very important high traffic junctions without any Protected Left turns. Let 4 cars fly through Red after every signal cycle.",
            "title_similarity": "0.6721163",
            "sentiment_compound": -0.1203
        },
        {
            "id": "h9k62nm",
            "score": 2,
            "text": "This is awesome and I always wondered why all cities did not have this. Wonder how much it will help.",
            "title_similarity": "0.4564823",
            "sentiment_compound": 0.7783
        },
        {
            "id": "h9k6ewq",
            "score": 1,
            "text": "It's 2021, why isn't this just solved using AI in every city?",
            "title_similarity": "0.5374672",
            "sentiment_compound": -0.2057
        },
        {
            "id": "h9k6uko",
            "score": 1,
            "text": "That’s great but they are still off. I got one light and then the next turns red    So they haven’t figured it out yet",
            "title_similarity": "0.31488937",
            "sentiment_compound": 0.3716
        },
        {
            "id": "h9k7lhg",
            "score": 1,
            "text": "I live in LA and one time I left for work, drove for a half an hour, and could still see my apartment building when I looked in the mirror. Fuck LA traffic.",
            "title_similarity": "0.6439308",
            "sentiment_compound": -0.5423
        },
        {
            "id": "h9k7r24",
            "score": 1,
            "text": "Could have spent the money on public transit and gotten a whole heck of a lot better results than 16%.",
            "title_similarity": "0.5510887",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h9k7rie",
            "score": 1,
            "text": "We need A. I controlled lights. Better zonings, better public transportation accessible to all.",
            "title_similarity": "0.43808836",
            "sentiment_compound": 0.7003
        },
        {
            "id": "h9k8khi",
            "score": 1,
            "text": "Can Orlando be next please",
            "title_similarity": "0.020338114",
            "sentiment_compound": 0.3182
        },
        {
            "id": "h9k8xa5",
            "score": 1,
            "text": "AS someone who lives in LA. It still sucks ass most of the time.",
            "title_similarity": "0.31571665",
            "sentiment_compound": -0.7184
        },
        {
            "id": "h9k91g8",
            "score": 1,
            "text": "Wow TM:PE has really upped it's game. Biffa would just have put roundabouts or placed timed traffic lights.",
            "title_similarity": "0.563781",
            "sentiment_compound": 0.5859
        },
        {
            "id": "h9k91tl",
            "score": 1,
            "text": "I'm pretty sure that my city does this as well but rather than \"limiting congestion\" they simply use it to make sure I get **every.single.red.light** down the stretch of 50.",
            "title_similarity": "0.5795335",
            "sentiment_compound": 0.7391
        },
        {
            "id": "h9k9jh6",
            "score": 1,
            "text": "Is there any reason to not just use roundabouts?\n\n\nI feel like that would've been cheaper.",
            "title_similarity": "0.2597763",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h9k9olw",
            "score": 1,
            "text": "Roundabouts work better without using electricity.",
            "title_similarity": "0.2833036",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h9k9sfn",
            "score": 1,
            "text": "The thing is... LA traffic is still brutal.",
            "title_similarity": "0.25990885",
            "sentiment_compound": -0.6249
        },
        {
            "id": "h9k9um0",
            "score": 1,
            "text": "Welp, now that this fact has gotten some attention, I give it three months, tops, before an epic hack throws the city into chaos.",
            "title_similarity": "0.55387783",
            "sentiment_compound": -0.1027
        },
        {
            "id": "h9k9x3f",
            "score": 1,
            "text": "Wish Tucson wasn't this corrupt.",
            "title_similarity": "0.19241828",
            "sentiment_compound": 0.4019
        },
        {
            "id": "h9ka7bt",
            "score": 1,
            "text": "Can't wait until that 16% decrease is eaten up by [induced demand](https://en.m.wikipedia.org/wiki/Induced_demand) in a couple years.",
            "title_similarity": "0.5837605",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9kaavy",
            "score": 1,
            "text": "Unfortunately, the other 88; municipalities in LA county go out of their way to fuck it up. \n\nLooking at you Culver city, marina del Rey, Santa Monica, Beverly hills... \n\nRuining west side traffic for ever",
            "title_similarity": "0.51295155",
            "sentiment_compound": -0.7845
        },
        {
            "id": "h9kad2a",
            "score": 1,
            "text": "I remember when that happened.  I think it was \"The Napster\" who did it. It was mainly to reroute armored trucks full of gold.",
            "title_similarity": "0.5284771",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9kad64",
            "score": 1,
            "text": "There should be a federal law about this.",
            "title_similarity": "0.20789045",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9kb0im",
            "score": 1,
            "text": "Exploiting this is the plot of Oceans 14 I'm fairly certain.",
            "title_similarity": "0.28691196",
            "sentiment_compound": -0.2023
        },
        {
            "id": "h9kb7dn",
            "score": 1,
            "text": "Oddly enough, they still have the worst traffic in the country.",
            "title_similarity": "0.33598116",
            "sentiment_compound": -0.6249
        },
        {
            "id": "h9kb7nf",
            "score": 1,
            "text": "Despite this the traffic is still shit",
            "title_similarity": "0.13687295",
            "sentiment_compound": -0.5574
        },
        {
            "id": "h9kb8ca",
            "score": 1,
            "text": "Just don't try to turn left in LA. They don't believe in left turn arrows.",
            "title_similarity": "0.19705828",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9kbzyj",
            "score": 1,
            "text": "Meanwhile the person who oversees all the traffic control decisions for our city semi-seriously suggested that we replace all the traffic lights on the city's \"main drag\" (about 2km) with 4-way stops because \"it would force people to stop and look around at all the stores every time they reach an intersection\". Ambulances, fire engines, law enforcement, and freight all use this road to get across the city quickly and he damn near lost his job for even considering it as an idea worth sharing. \n\nHopefully all cities embrace this model going forward.",
            "title_similarity": "0.7661052",
            "sentiment_compound": -0.3182
        },
        {
            "id": "h9kc1oa",
            "score": 1,
            "text": "SGV don’t have it.",
            "title_similarity": "-0.10680175",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9kcmbq",
            "score": 1,
            "text": "Now they can start adding left turn signals. Some of the busiest streets have no protected left arrows!",
            "title_similarity": "0.49347866",
            "sentiment_compound": -0.4015
        },
        {
            "id": "h9kcn29",
            "score": 1,
            "text": "Imagine they would've used that time, money and manpower on building a functional bus (or god forbid train) network.",
            "title_similarity": "0.47910377",
            "sentiment_compound": -0.0516
        },
        {
            "id": "h9kcu5d",
            "score": 3,
            "text": "Please do this in Florida.",
            "title_similarity": "0.041316617",
            "sentiment_compound": 0.3182
        },
        {
            "id": "h9kdkga",
            "score": 1,
            "text": "It sure as fuck doesn't feel like it lol",
            "title_similarity": "-0.057748564",
            "sentiment_compound": -0.1306
        },
        {
            "id": "h9keeuv",
            "score": 1,
            "text": "Yay. Oakland next.",
            "title_similarity": "0.088531375",
            "sentiment_compound": 0.5267
        },
        {
            "id": "h9kewq7",
            "score": 1,
            "text": "Now can we PLEASE make the lights flash yellow and red at night time in the less-traveled areas? Coming up to a stop light in the middle of nowhere at 3am only to have it change to green JUST after you stop is enough to make you want to blow through it and hope a train hits you.",
            "title_similarity": "0.5354216",
            "sentiment_compound": 0.4278
        },
        {
            "id": "h9kf79z",
            "score": 1,
            "text": "I wish my town had this.  I hate getting caught by a light while watching the other street have zero cars pass through for three minutes.",
            "title_similarity": "0.46535996",
            "sentiment_compound": -0.25
        },
        {
            "id": "h9kf9jc",
            "score": 1,
            "text": "Live in LA. Can't imagine if the lights weren't synchronized and having more traffic than we already do.",
            "title_similarity": "0.65885615",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9kfd9a",
            "score": 1,
            "text": "Meanwhile, Chicago doesn't even have sensors.  The left turn arrow goes on when nobody is there.",
            "title_similarity": "0.3198123",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9kfdv3",
            "score": 1,
            "text": "If you could hack into this system, you could turn all the traffic lights green and drive your modified Mini Coopers full of money to the train station.",
            "title_similarity": "0.6531104",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9kfe8u",
            "score": 1,
            "text": "I don't know if chicago does anything like this or if some streets have decent civil engineering/planning, but it is nice when you get on a road that almost always times out well.  And then I take a turn down a road where I ALWAYS hit each red light because of how the subsequent intersections are timed.  Civil engineering is interesting.",
            "title_similarity": "0.6104332",
            "sentiment_compound": 0.8922
        },
        {
            "id": "h9kg5wv",
            "score": 1,
            "text": "thats not that big of an improvement. better solutions could be devised",
            "title_similarity": "0.09685207",
            "sentiment_compound": 0.765
        },
        {
            "id": "h9kga29",
            "score": 1,
            "text": "Must’ve been unsynced while I lived there for 3 months. Infrastructure seemed like the last thing on the minds of those governing LA.",
            "title_similarity": "0.4505862",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h9kgdzw",
            "score": 1,
            "text": "Meanwhile, my small town has lights that turn red, and there's no one at them!",
            "title_similarity": "0.2724241",
            "sentiment_compound": -0.3595
        },
        {
            "id": "h9kgg0a",
            "score": 1,
            "text": "Lol nice try California",
            "title_similarity": "0.13947305",
            "sentiment_compound": 0.6808
        },
        {
            "id": "h9kgler",
            "score": 1,
            "text": "This is great until it gets hacked.",
            "title_similarity": "0.22907175",
            "sentiment_compound": 0.34
        },
        {
            "id": "h9kgokw",
            "score": 1,
            "text": "Every traffic light should be replaced with a rotary",
            "title_similarity": "0.47715992",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9kguhe",
            "score": 1,
            "text": "It's the little things...",
            "title_similarity": "-0.10218774",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9kh3hz",
            "score": 1,
            "text": "Traffic still fucking sucks",
            "title_similarity": "0.13915062",
            "sentiment_compound": -0.4201
        },
        {
            "id": "h9kh96z",
            "score": 1,
            "text": "Yeah? Tell that to the corner of Glendale and Berkeley. Dumbest intersection ever",
            "title_similarity": "0.29970157",
            "sentiment_compound": -0.2732
        },
        {
            "id": "h9kh9mq",
            "score": 1,
            "text": "About time! How about wear and tear and gas.. It's insane how some of the lights work around here, almost like they try to be annoying and wasteful.",
            "title_similarity": "0.29342765",
            "sentiment_compound": -0.54
        },
        {
            "id": "h9khdoq",
            "score": 1,
            "text": "First major city in the US.\n\nThe Japanese invented the technology then implemented the system in Tokyo almost 20 years ago and they actually get it to work properly.\n\nPhnom Penh beat LA.\n\n[https://urbangateway.org/news/japan-install-%E2%80%9Csmart%E2%80%9D-traffic-lights-throughout-cambodia%E2%80%99s-capital](https://urbangateway.org/news/japan-install-%E2%80%9Csmart%E2%80%9D-traffic-lights-throughout-cambodia%E2%80%99s-capital)",
            "title_similarity": "0.6552549",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9kht0t",
            "score": 1,
            "text": "Has it helped?  \n\n\nMovedout30yrsago",
            "title_similarity": "0.09976976",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9khx0u",
            "score": 2,
            "text": "Meanwhile where I live the major road has it's lights set up on what must be a timer, timed to make you stop at every light unless you speed more than 10 mph above the limit.",
            "title_similarity": "0.6559301",
            "sentiment_compound": -0.296
        },
        {
            "id": "h9khyl4",
            "score": 1,
            "text": "16% improvement over terrible is still terrible.",
            "title_similarity": "0.455092",
            "sentiment_compound": -0.4939
        },
        {
            "id": "h9ki79f",
            "score": 1,
            "text": "I grew up in Houston, Tx. in the late 1940's and remember my dad driving us through downtown at about 30mph and hot hitting a stop light for many many blocks.  He said that the light had been synchronized to speed up traffic.  It seemed to work.",
            "title_similarity": "0.689582",
            "sentiment_compound": -0.4767
        },
        {
            "id": "h9kida0",
            "score": 1,
            "text": "Driving there is still absolute piss shit regardless",
            "title_similarity": "0.20261155",
            "sentiment_compound": -0.743
        },
        {
            "id": "h9kioqn",
            "score": 1,
            "text": "Im in a city, where if you drive the speed limit every light you reach turns orange before you cross. You literally have to speed to beat the next set, its freakin ridiculous. Its a speed trap, because after 3 or 4 oranges, and sometimes waiting for no one, you naturally begin to get pissed off.",
            "title_similarity": "0.6187242",
            "sentiment_compound": -0.8779
        },
        {
            "id": "h9kiwvq",
            "score": 1,
            "text": "The grüne Welle has been a thing for a while in Germany and, I think, Paris has it too. \n\nPerhaps the first US city? If that’s your definition of major cities tho, fill your boots.",
            "title_similarity": "0.4504341",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9kj271",
            "score": 1,
            "text": "Show chicago this!",
            "title_similarity": "0.22214517",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9kj87j",
            "score": 1,
            "text": "If traffic is that bad with every single light synchronized then I can't imagine how awful it would be if they weren't.",
            "title_similarity": "0.48245484",
            "sentiment_compound": -0.2547
        },
        {
            "id": "h9kj8wk",
            "score": 1,
            "text": "ok this is definitely not true because there's a light i go through EVERY DAY that is not on a timer. It's on a switch and you have to hit it for it to turn green. It will absolutely NOT turn green unless you hit the spot on the ground.",
            "title_similarity": "0.43909997",
            "sentiment_compound": 0.3753
        },
        {
            "id": "h9kj9r6",
            "score": 1,
            "text": "THE ITALIAN JOB WAS REAL",
            "title_similarity": "0.3478797",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9kjdyj",
            "score": 1,
            "text": "How is this not more common?",
            "title_similarity": "-0.010587681",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9kjfom",
            "score": 1,
            "text": "I’m pretty sure LA isnt the only city to use signal timing. Fully synchronized maybe.",
            "title_similarity": "0.5429516",
            "sentiment_compound": 0.6705
        },
        {
            "id": "h9kjhex",
            "score": 1,
            "text": "The lights in my town know when I'm running late and make things as difficult as possible",
            "title_similarity": "0.41023964",
            "sentiment_compound": -0.3612
        },
        {
            "id": "h9kjmt8",
            "score": 1,
            "text": "ah so that's why when i encounter one red light i encounter 27 more (:",
            "title_similarity": "0.39444986",
            "sentiment_compound": 0.5413
        },
        {
            "id": "h9kjni9",
            "score": 1,
            "text": "20 years ago my dad swore that's how every traffic light in the city works. I knew Oklahoma City wasn't capable of that in the 90s.",
            "title_similarity": "0.6245223",
            "sentiment_compound": -0.2924
        },
        {
            "id": "h9kjr81",
            "score": 1,
            "text": "This reminds me of a question I had from driving in LA while visiting....are protected lefts at signals not a thing in California?",
            "title_similarity": "0.45114604",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h9kjy0j",
            "score": 1,
            "text": "Is it me or 16% doesnt seem like much at all",
            "title_similarity": "0.26553416",
            "sentiment_compound": -0.2755
        },
        {
            "id": "h9kka3w",
            "score": 1,
            "text": "You can tell too. Driving in LA is an absolute joy.",
            "title_similarity": "0.4115885",
            "sentiment_compound": 0.5859
        },
        {
            "id": "h9kkfav",
            "score": 1,
            "text": "This is how The Napster was able to get the truck where he wanted it in the documentary The Italian Job.",
            "title_similarity": "0.514272",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9kkip3",
            "score": 1,
            "text": "I was in LA in June for work. A 20 mile commute sometimes took what felt like hours. If that’s 16% decrease in congestion… sssh I would not want to see the real congestion.",
            "title_similarity": "0.68569654",
            "sentiment_compound": 0.3134
        },
        {
            "id": "h9kkj91",
            "score": 1,
            "text": "Honestly surprised it's only 4400 lights. You can easily run that off a single server.",
            "title_similarity": "0.5333604",
            "sentiment_compound": 0.743
        },
        {
            "id": "h9kkja4",
            "score": 1,
            "text": "Anyone know if Denver is synced up? I’m down for a 16 percent decrease in congestion!",
            "title_similarity": "0.64104784",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9kkmzi",
            "score": 1,
            "text": "meanwhile cincinnati can’t even sync its green lights on one way streets lol",
            "title_similarity": "0.30789518",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h9kknas",
            "score": 1,
            "text": "Pretty sure London already had this sort of system for a while now remember watching something relating to the traffic lights linking up to a maybe data centre to get real time updates? Might be misremembering",
            "title_similarity": "0.58072853",
            "sentiment_compound": 0.6705
        },
        {
            "id": "h9kkt0m",
            "score": 1,
            "text": "Street lights have been synchronized for years. Cruise down the boulevard at the speed limit, you won't have to stop for any criminals.",
            "title_similarity": "0.59926325",
            "sentiment_compound": -0.4238
        },
        {
            "id": "h9kktrf",
            "score": 1,
            "text": "Computerization, **finally** used to serve mankind.",
            "title_similarity": "0.3541475",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9kkxg2",
            "score": 1,
            "text": "We need some sort of national grid. I get so bothered by traffic lights",
            "title_similarity": "0.41618982",
            "sentiment_compound": -0.4572
        },
        {
            "id": "h9kle74",
            "score": 1,
            "text": "In my town all the left turn green arrows are synced such that you get every red light after them. I now make a right on red and uturn instead and it saves me a meaningful amount of time.",
            "title_similarity": "0.689723",
            "sentiment_compound": 0.3182
        },
        {
            "id": "h9klh1f",
            "score": 1,
            "text": "Sure doesn't feel like it =(",
            "title_similarity": "-0.119036436",
            "sentiment_compound": 0.049
        },
        {
            "id": "h9klhvj",
            "score": 1,
            "text": "This was in 2013 (apparently?) and I can assure you that it has done absolutely nothing to reduce traffic, which is ESPECIALLY hellish in areas with lots of traffic lights here in the city of angels.",
            "title_similarity": "0.52394795",
            "sentiment_compound": -0.5894
        },
        {
            "id": "h9klil4",
            "score": 1,
            "text": "\\*was.  There are many cities that do this now, LA did it almost a decade ago.",
            "title_similarity": "0.5877924",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9klips",
            "score": 1,
            "text": "This sounds cool and all, but, it doesn't work like you'd think. They've been doing this in CA for the last 20 years. I remember when Beach Blvd had its lights synced in the 90's. It still never works. Too many variables. Fast people, slow people, LOTS of people.",
            "title_similarity": "0.52895904",
            "sentiment_compound": -0.2535
        },
        {
            "id": "h9klnor",
            "score": 1,
            "text": "Alright Atlanta, you’re up next…",
            "title_similarity": "0.12925072",
            "sentiment_compound": 0.25
        },
        {
            "id": "h9kltsv",
            "score": 1,
            "text": "Good. Then build a fleet of buses that get green light priority and DONT build a hyper loop. Anywhere. Oh and light rail for fucks sake.",
            "title_similarity": "0.47103316",
            "sentiment_compound": -0.0516
        },
        {
            "id": "h9klvo7",
            "score": 1,
            "text": "What is 84% of infinity?",
            "title_similarity": "0.35917687",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9klxcx",
            "score": 1,
            "text": "I’ll believe it when the traffic get better.",
            "title_similarity": "0.27798066",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h9klz3q",
            "score": 1,
            "text": "Can they do this in Santa Ana please?",
            "title_similarity": "0.13410956",
            "sentiment_compound": 0.3182
        },
        {
            "id": "h9km5jy",
            "score": 1,
            "text": "Why is that standard everywhere by now.\n\nTraffic sync aside, sync the timing generally",
            "title_similarity": "0.47988692",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9km7ta",
            "score": 1,
            "text": "I think about how to come up with a proper algorithm for this every time I sit in traffic. I feel like it wouldn't be that complicated.",
            "title_similarity": "0.57275075",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h9kmbr1",
            "score": 1,
            "text": "Traffic lights are a relic from the past. Need to use tunnels, bridges, roundabouts and simply outlaw left-turns in some intersections. Everything goes much faster, maybe double speed, because you never need to stop.",
            "title_similarity": "0.67098045",
            "sentiment_compound": 0.2235
        },
        {
            "id": "h9kmfzq",
            "score": 1,
            "text": "Why does it still take me 30 minutes to get to the store that's 2 miles away then?",
            "title_similarity": "0.5328697",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9kmp8p",
            "score": 1,
            "text": "That is until \"The Napster\" hacks in to reroute the armoured truck.",
            "title_similarity": "0.4089089",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9kmpjr",
            "score": 1,
            "text": "I'm pretty sure this is already a thing in most of London with the same electromagnet sensors for cars & pedestrians and god knows we have enough traffic cameras watching everything. Considering the lights can all be controlled remotely for VIP's & emergency services, it's definitely all centralised.\n\nThe main difference to LA though would be that it's a LOT more pedestrian focused with some lights even prioritising foot traffic over cars.",
            "title_similarity": "0.7144972",
            "sentiment_compound": 0.8617
        },
        {
            "id": "h9kmt9p",
            "score": 1,
            "text": "Take notes rest of the country goddamn",
            "title_similarity": "0.28483802",
            "sentiment_compound": -0.4767
        },
        {
            "id": "h9kmu26",
            "score": 1,
            "text": "Los Angeles streetlights are trash because there are almost no left turn lights, in a city with constant traffic. Which means anyone turning left has to run a red and multiple people do it. Totally shitty. Saw a literal unconscious or dead kid the other day, likely because someone was trying to turn at the end when that guy was crossing on his bike. Total dumb shit LA",
            "title_similarity": "0.5071834",
            "sentiment_compound": -0.9557
        },
        {
            "id": "h9kmwzr",
            "score": 1,
            "text": "If it hasn’t been mentioned yet: Driving 37mph on certain streets with “Light Sync” signage ensures that you won’t hit a red light. \n\nJust FYI.",
            "title_similarity": "0.5220332",
            "sentiment_compound": 0.5622
        },
        {
            "id": "h9kn1zd",
            "score": 2,
            "text": "Boston lights say “Lights timed for frequent stops” That’s the exact OPPOSITE of what they should be, FFS…",
            "title_similarity": "0.4464689",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9kn3i1",
            "score": 1,
            "text": "I thought this was the norm??",
            "title_similarity": "0.032573335",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9kn50k",
            "score": 1,
            "text": "Lisbon had one of those for it's entire city center (the actual one, not the historical one).\n\nBut then extensive construction hit about a decade ago and almost every single connector was broken or cut and never repaired. Meaning every traffic light is now once again completely independent.",
            "title_similarity": "0.63152385",
            "sentiment_compound": -0.7783
        },
        {
            "id": "h9kn5zz",
            "score": 1,
            "text": "I put in about 40k miles driven for work a year and nothing pisses me off more than when 1 car pulls up to some wierd side street and instantly triggers trafflic flowing down 4-6 lanes to completely stop so they can make 1 roll threw right turn.",
            "title_similarity": "0.8095639",
            "sentiment_compound": -0.1172
        },
        {
            "id": "h9kn793",
            "score": 1,
            "text": "And we still have some of the worst traffic in the country.",
            "title_similarity": "0.336302",
            "sentiment_compound": -0.6249
        },
        {
            "id": "h9kn7hy",
            "score": 1,
            "text": "...now if you could only solve your unimaginable homelessness problem.",
            "title_similarity": "0.37759995",
            "sentiment_compound": -0.2263
        },
        {
            "id": "h9knba6",
            "score": 1,
            "text": "Why is the traffic here still absolutely horrible?",
            "title_similarity": "0.17525804",
            "sentiment_compound": -0.5849
        },
        {
            "id": "h9knf4c",
            "score": 1,
            "text": "meanwhile in my small midwest state, I sit at a light for 6-7 minutes while nobody is going either way waiting for it to change.",
            "title_similarity": "0.44914588",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9knh1o",
            "score": 1,
            "text": "This the same LA whose highway turns into parking lots EVERYDAY at rush hour?",
            "title_similarity": "0.6565825",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9knpqx",
            "score": 1,
            "text": "they recently replaced a stop sign on a residential street by my house with a stop light. \n\nat peak traffic times (like 3pm after school) that intersection did get really backed up so i can see why they did it, but at basically all other times the road is pretty empty and you could sit there at the intersection for the entire red light and not see a single car come passed. \n\nsomething like this would be cool, or if they just disabled it at all times because its annoying af to have to sit there for 3 minutes at 9pm on the way to the grocery store and not see a single car need the green light",
            "title_similarity": "0.6765947",
            "sentiment_compound": 0.6701
        },
        {
            "id": "h9knpsu",
            "score": 1,
            "text": "Prarie Ave would like a word",
            "title_similarity": "-0.050517067",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h9knybw",
            "score": 1,
            "text": "I remember when Los angeles had that on the 2008 ballot and it didnt pass.",
            "title_similarity": "0.42810318",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9knytx",
            "score": 1,
            "text": "16% less than infinity is still infinity",
            "title_similarity": "0.37052724",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9ko3jb",
            "score": 1,
            "text": "London pls",
            "title_similarity": "0.09528544",
            "sentiment_compound": 0.0772
        },
        {
            "id": "h9ko5ix",
            "score": 1,
            "text": "And yet, Los Angeles is known to have the worst traffic in the country",
            "title_similarity": "0.356834",
            "sentiment_compound": -0.6249
        },
        {
            "id": "h9ko8wb",
            "score": 1,
            "text": "Its still congested traffic lmao",
            "title_similarity": "0.31791407",
            "sentiment_compound": 0.5994
        },
        {
            "id": "h9koax1",
            "score": 1,
            "text": "That was a major plot point in the newer version of \"The Italian Job.\"",
            "title_similarity": "0.34969717",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9kobht",
            "score": 1,
            "text": "I'm pretty sure most cities have this kind of thing? Maybe not for ALL traffic light in the cities must at least some of them",
            "title_similarity": "0.56432885",
            "sentiment_compound": 0.6705
        },
        {
            "id": "h9kocsd",
            "score": 1,
            "text": "That's taxes for ya",
            "title_similarity": "0.26631737",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9kod7y",
            "score": 1,
            "text": "Ok and now the high ways. What’s the bright ideas there.",
            "title_similarity": "0.0850482",
            "sentiment_compound": 0.6249
        },
        {
            "id": "h9kod92",
            "score": 1,
            "text": "Beautiful",
            "title_similarity": "-0.05576898",
            "sentiment_compound": 0.5994
        },
        {
            "id": "h9kodx9",
            "score": 1,
            "text": "That's cool for the people that contribute to society but imagine being one of the 70000 homeless living in LA and not having a bathroom...\n\nBut the street lights will tell you how long it takes to drive past the tent city...\n\nhttps://www.npr.org/2020/06/12/875888864/homelessness-in-los-angeles-county-rises-sharply",
            "title_similarity": "0.6763064",
            "sentiment_compound": 0.1655
        },
        {
            "id": "h9kohrk",
            "score": 1,
            "text": "And somehow we have the worst traffic in the world.",
            "title_similarity": "0.29569668",
            "sentiment_compound": -0.6249
        },
        {
            "id": "h9kojha",
            "score": 1,
            "text": "The problem with syncing to the flow of traffic is that you’re now synced with the flow of traffic. Try to drive on your own or at your own pace and you will be inconvenienced by the traffic lights by default. Living in the town I do in Texas, I am more than glad to have the regular traffic lights I do. At night, no cars around, if you flash your brights at the red, it will change the lights for you. I prefer the small town system. Driving in Los Angeles having to travel in droves of masses of vehicles just to be with the flow of traffic to beat the lights by a second sounds like road torture.",
            "title_similarity": "0.6088729",
            "sentiment_compound": -0.3862
        },
        {
            "id": "h9kojih",
            "score": 1,
            "text": "I wish Dallas would do this. I love sitting at a light for a minute with no traffic at all going in the cross-direction.",
            "title_similarity": "0.46826053",
            "sentiment_compound": 0.6908
        },
        {
            "id": "h9kox2e",
            "score": 1,
            "text": "And its still sucks driving out here",
            "title_similarity": "0.13936356",
            "sentiment_compound": -0.3612
        },
        {
            "id": "h9kp0aw",
            "score": 1,
            "text": "Pretty sure ours works on a sundial which is why its all fucked at night",
            "title_similarity": "0.40753",
            "sentiment_compound": 0.0258
        },
        {
            "id": "h9kp1iq",
            "score": 1,
            "text": "The problem still comes to, that one or two bad drivers. Mess up the whole system. Need more automation and make drivers licenses hard to get and maintain.",
            "title_similarity": "0.40442795",
            "sentiment_compound": -0.8442
        },
        {
            "id": "h9kp8gr",
            "score": 1,
            "text": "But if you ask any LA driver they’ll tell you it’s a parking lot on a good day",
            "title_similarity": "0.4820481",
            "sentiment_compound": 0.5927
        },
        {
            "id": "h9kpaws",
            "score": 1,
            "text": "Yeah....fake news. Source: me, Angelino",
            "title_similarity": "0.08612755",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9kpd76",
            "score": 1,
            "text": "I bet Google still works better.",
            "title_similarity": "0.3237555",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h9kpgff",
            "score": 1,
            "text": "Oh wow, I honestly thought synchronization on this level would reduce more traffic than that.",
            "title_similarity": "0.44492224",
            "sentiment_compound": 0.7783
        },
        {
            "id": "h9kph2g",
            "score": 1,
            "text": "One interesting thing, and I've always wondered why it went away.  My dad said that in NYC when he was a kid (1930s), traffic lights in less dense areas change to flashing red/yellow (stop/yield) or red/red (4 way stop) in the early morning hours (I think he said 1:00am) and went back say 5:00am.  Traffic was light enough there was no reason to have you sit there waiting on the light...",
            "title_similarity": "0.6538161",
            "sentiment_compound": -0.1779
        },
        {
            "id": "h9kpiq2",
            "score": 1,
            "text": "How about they install more public transportation systems.",
            "title_similarity": "0.27841288",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9kpjp5",
            "score": 1,
            "text": "So cool. Frankly I’m surprised this wasn’t done earlier.",
            "title_similarity": "0.09747936",
            "sentiment_compound": 0.5413
        },
        {
            "id": "h9kpkep",
            "score": 1,
            "text": "Interesting fact: the 405 was supposed to be called the 404 but they couldn't find the sign.",
            "title_similarity": "0.2765221",
            "sentiment_compound": 0.2144
        },
        {
            "id": "h9kpqnj",
            "score": 1,
            "text": "Not when I'm on Glendale it doesn't.",
            "title_similarity": "0.07110617",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9kpvvd",
            "score": 1,
            "text": "And yet, traffic is still a giant clusterfuk. Guess no amount of traffic engineering can account for /r/IdiotsInCars",
            "title_similarity": "0.4041773",
            "sentiment_compound": -0.296
        },
        {
            "id": "h9kpy0v",
            "score": 1,
            "text": "Absolutely bullshit. I can't tell you how many times I go from stop light to stop light, 5-6 in a row on the same street, all turning red as we approach.",
            "title_similarity": "0.5807258",
            "sentiment_compound": -0.8173
        },
        {
            "id": "h9kpzmp",
            "score": 1,
            "text": "Y it still sux tho?",
            "title_similarity": "-0.054820206",
            "sentiment_compound": -0.3612
        },
        {
            "id": "h9kq3n8",
            "score": 1,
            "text": "Firstly I’m worried as to how secure this system is, my mind immediately goes to the hackable traffic lights in watch dogs and how you could use them to cause accidents. \nAlso why not take the money and invest in public transport system that doesn’t suck?",
            "title_similarity": "0.53384477",
            "sentiment_compound": -0.6124
        },
        {
            "id": "h9kq66i",
            "score": 1,
            "text": "UPS trucks making right turns only saves them like millions of dollars each year on gas ⛽️",
            "title_similarity": "0.65851015",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h9kq6pt",
            "score": 1,
            "text": "r/CitiesSkylines",
            "title_similarity": "0.1454103",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9kq9vf",
            "score": 1,
            "text": "I've always wondered why this isn't the status quo.",
            "title_similarity": "0.13694254",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9kqbud",
            "score": 1,
            "text": "Ya'll, it's not even rush hour.\n\nhttps://i.imgur.com/uWxcSim.png\n\nI think they wasted their money. Maybe work on mass transit instead.",
            "title_similarity": "0.47871402",
            "sentiment_compound": -0.4939
        },
        {
            "id": "h9kqdlr",
            "score": 1,
            "text": "I couldn’t tell",
            "title_similarity": "-0.15450743",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9kqf81",
            "score": 1,
            "text": "Did they do this before or after Seth Green in the Italian Job?",
            "title_similarity": "0.37538195",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9kqhxt",
            "score": 1,
            "text": "Yeah my fucking ass. Lights fucking go red then right back to green as a fuck you in particular all the time. No one around, just goes red and a split second later it's green again. Fucking maddening.",
            "title_similarity": "0.40569007",
            "sentiment_compound": -0.8953
        },
        {
            "id": "h9kqp03",
            "score": 1,
            "text": "It's all good until Michael Caine and Benny Hill break into the control centre",
            "title_similarity": "0.39661503",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h9kqq2k",
            "score": 1,
            "text": "Bullshit the lights right by my place are literally the opposite of synchronized. One turns green the one 50 yards down turns yellow.",
            "title_similarity": "0.37823892",
            "sentiment_compound": -0.5859
        },
        {
            "id": "h9kqqaf",
            "score": 1,
            "text": "I wish they would do this with Vegas. The lights seriously suck. One way gets 10 minute green the other you can barely turn left before it changes yellow on the first car.",
            "title_similarity": "0.6146114",
            "sentiment_compound": -0.2263
        },
        {
            "id": "h9kqxyf",
            "score": 1,
            "text": "Good next viable public transport.",
            "title_similarity": "0.14537245",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h9kr18o",
            "score": 1,
            "text": "Wow that’s a minor improvement to an insanely stupid transportation system, Nobel peace prize",
            "title_similarity": "0.3197275",
            "sentiment_compound": 0.8807
        },
        {
            "id": "h9kr2zh",
            "score": 1,
            "text": "Having moved from LA this is one of the things I miss the most",
            "title_similarity": "0.26855004",
            "sentiment_compound": -0.1531
        },
        {
            "id": "h9kr7a6",
            "score": 1,
            "text": "This feels like it belongs in r/oddlysatisfying.  Especially if we can get a video",
            "title_similarity": "0.14976412",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h9krj5b",
            "score": 1,
            "text": "This is one of those things you've wondered why it hasn't been done since you were a little kid and local governments are like \"lol we overpaid to pave a street by $9,000,000 and we're raising your taxes and not fixing the lights.\" Gg, LA.",
            "title_similarity": "0.662843",
            "sentiment_compound": 0.6486
        },
        {
            "id": "h9krl2x",
            "score": 1,
            "text": "Doesn’t work lol. The problem is the drivers. People just stare at green lights and don’t release the breaks until the car in front of them hits the gas. Look a couple cars ahead if they’re moving go ahead and release the breaks and start to roll. People have to have car lengths of front of them to release the breaks. Not breaking ≠ the gas peddle",
            "title_similarity": "0.53338903",
            "sentiment_compound": 0.0258
        },
        {
            "id": "h9krlt4",
            "score": 1,
            "text": "Did the mayor pay you to post this or something because I live in LA and cannot imagine a world where traffic and congestion caused by shitty traffic lights is 16% worse",
            "title_similarity": "0.6849578",
            "sentiment_compound": -0.7964
        },
        {
            "id": "h9krr66",
            "score": 1,
            "text": "i lived in la. i can unequivocally tell you this is bs.",
            "title_similarity": "0.32544616",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9krrzv",
            "score": 3,
            "text": "Yay no more traffic in L.A.",
            "title_similarity": "0.3563518",
            "sentiment_compound": 0.296
        },
        {
            "id": "h9ks0w8",
            "score": 1,
            "text": "And then there is Flint which is so poorly synced that if you hit one red light every light you get to will be red when you get there. It's awful",
            "title_similarity": "0.39727676",
            "sentiment_compound": -0.4588
        },
        {
            "id": "h9ks1n6",
            "score": 1,
            "text": "What a novel idea?!",
            "title_similarity": "0.0445468",
            "sentiment_compound": 0.3802
        },
        {
            "id": "h9ks227",
            "score": 1,
            "text": "In this day and age it just blows my mind this isn't something that's more wide spread.  They don't even mention reductions in crashes / increased safety by doing this.  Less stopping/starting at points of convergence is a good thing in the traffic world. Big time.",
            "title_similarity": "0.54454637",
            "sentiment_compound": 0.7783
        },
        {
            "id": "h9ks6pe",
            "score": 1,
            "text": "Do you want skynet, this is how you get skynet?",
            "title_similarity": "0.30333945",
            "sentiment_compound": 0.0772
        },
        {
            "id": "h9ks9u6",
            "score": 1,
            "text": "And cue the hackers",
            "title_similarity": "0.21710208",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9ksbwo",
            "score": 1,
            "text": "Remember when LA had one of the biggest, if not the biggest, street car systems in the world and the tire/automotive lobby bought it and killed it off?\n\nPepperidge Farm remembers",
            "title_similarity": "0.66637695",
            "sentiment_compound": -0.6597
        },
        {
            "id": "h9ksfyh",
            "score": 1,
            "text": "Pretty sure making decent public transport would reduce congestion by more than 16%.",
            "title_similarity": "0.72107387",
            "sentiment_compound": 0.6705
        },
        {
            "id": "h9ksif1",
            "score": 1,
            "text": "For fuck sake can we jump on this game in Florida?",
            "title_similarity": "0.16255644",
            "sentiment_compound": -0.5423
        },
        {
            "id": "h9ksld1",
            "score": 1,
            "text": "I would literally do horrible unspeakable unforgivable things to see this in Denver",
            "title_similarity": "0.2268708",
            "sentiment_compound": -0.5423
        },
        {
            "id": "h9ksmhq",
            "score": 1,
            "text": "Headline tomorrow: LA held by ransomeware hackers hostage",
            "title_similarity": "0.37918714",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9ksnio",
            "score": 1,
            "text": "[deleted]",
            "title_similarity": "-0.06445307"
        },
        {
            "id": "h9ksnzg",
            "score": 1,
            "text": "Let's have more roundabouts and fewer traffic lights. No synchronization needed.",
            "title_similarity": "0.41372454",
            "sentiment_compound": -0.296
        },
        {
            "id": "h9ksqrz",
            "score": 1,
            "text": "I've thought for a long time that google should get involved with this for other cities. They can write algorithms that would average aggregated traffic times based on location data of all the phones. Basically the same data they use from waze. Then provide an API that makesstoplight suggestions for municipalities to access to control lights.\n\nThe system would also be iterative to optimize the traffic flows over time and adjust to other conditions. I suspect the savings could be much larger than 16% which would account for huge savings to the population, a reduction in emissions, and even an increase in productivity and quality of life.\n\nThe data//tools would also be there to measure/validate the efficacy of municipality traffic programs, regardless of whether they're using the the traffic API to control the lights or implemented some other strategies.",
            "title_similarity": "0.7673229",
            "sentiment_compound": 0.6808
        },
        {
            "id": "h9kst4d",
            "score": 1,
            "text": "I drive here and it doesn't feel like that",
            "title_similarity": "0.15917538",
            "sentiment_compound": -0.2755
        },
        {
            "id": "h9kstrs",
            "score": 1,
            "text": "and yet driving is still a nightmare in LA",
            "title_similarity": "0.26286364",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9ksu58",
            "score": 1,
            "text": "We need to incentivize everyone that can work their jobs from home to do so. This would be a major cut to traffic nationwide, and would do a lot to cut our carbon emissions.",
            "title_similarity": "0.60803926",
            "sentiment_compound": -0.5413
        },
        {
            "id": "h9ksysp",
            "score": 1,
            "text": "Could have fucking fooled me\n- an LA native",
            "title_similarity": "0.21273953",
            "sentiment_compound": -0.4391
        },
        {
            "id": "h9kszb7",
            "score": 1,
            "text": "There's an intersection near me in San Francisco that has a human being operating the lights during the busiest part of the day. It's actually two intersections close together, with lots of pedestrian traffic. It might be expensive to use a human, but it sure keeps the traffic flowing. I wonder if LA's system takes pedestrian traffic into account. Not likely, I would think.",
            "title_similarity": "0.6313493",
            "sentiment_compound": 0.4497
        },
        {
            "id": "h9kt2s8",
            "score": 1,
            "text": "shut the fuck up traffic still sucks donkey balls here",
            "title_similarity": "0.20394546",
            "sentiment_compound": -0.7184
        },
        {
            "id": "h9kt42y",
            "score": 1,
            "text": "Nice. That means traffic can expand by 16% immediately.",
            "title_similarity": "0.58688086",
            "sentiment_compound": 0.6249
        },
        {
            "id": "h9kt9vq",
            "score": 1,
            "text": "They have only done this is the \"rich\" areas. It's not in downtown or ANY of the nearby surrounding areas. I work and drive here everyday. If this is actually true, they have either turned it off, or, like most things that the governor does, fucked it up.",
            "title_similarity": "0.61688375",
            "sentiment_compound": 0.5423
        },
        {
            "id": "h9ktcgt",
            "score": 1,
            "text": "It sure as shit doesn’t exist in the South Bay. Maybe it hasn’t been calibrated since this article published in 2013",
            "title_similarity": "0.2863854",
            "sentiment_compound": -0.3182
        },
        {
            "id": "h9ktfok",
            "score": 1,
            "text": "Is this why I catch all the red lights on my way to work?",
            "title_similarity": "0.577777",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9ktfqv",
            "score": 1,
            "text": "Isn't this the plot of the *The Italian Job* remake?",
            "title_similarity": "0.2478653",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9ktnnm",
            "score": 1,
            "text": "That’s not true, Salt Lake City is all synced up to fuck you in the face",
            "title_similarity": "0.29119024",
            "sentiment_compound": -0.7033
        },
        {
            "id": "h9ktov9",
            "score": 1,
            "text": "That's hot",
            "title_similarity": "-0.056602053",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9ktvdp",
            "score": 1,
            "text": "A thousand times yes!!! Pleas let this roll out country-wide. How many days collectively have we wasted having a cross-street with two cars hold up a light for 30 seconds while the street we are on has dozens of times the vehicles at any given point of the day?",
            "title_similarity": "0.68350357",
            "sentiment_compound": -0.3348
        },
        {
            "id": "h9ktwnu",
            "score": 2,
            "text": "[deleted]",
            "title_similarity": "-0.06445307"
        },
        {
            "id": "h9ku0xc",
            "score": 1,
            "text": "I can’t help but notice how inefficient most traffic lights are, not sure how they’re weighted/triggered in my area but… not goodly.",
            "title_similarity": "0.38477778",
            "sentiment_compound": -0.1513
        },
        {
            "id": "h9ku3n9",
            "score": 1,
            "text": "This is not working so well I think. Just last night I was at a red light that lasted SO long with no traffic coming from the perpendicular street that people just started running the red.  \n\n\nIn my home town, there were two one-way streets that were perfectly synced so if you went 35 you could get all the way across town without ever hitting a red...it was so that when the Oldsmobile plants (RIP) emptied out, they could have thousands of guys going home and not have a major traffic jam...  \n\n\nL.A. does NOT work like that.",
            "title_similarity": "0.6940211",
            "sentiment_compound": 0.2518
        },
        {
            "id": "h9ku9i6",
            "score": 1,
            "text": "Then why tf was on the highway for 2 hours when we were only 45 min away from our destination lol",
            "title_similarity": "0.63976085",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h9kucok",
            "score": 1,
            "text": "Instead of roads censors, have they ever considered just using the same technology used in cars? \nA Tesla’s cost $50k with cameras all over the place. Why can’t every intersection have a computer watch the intersection from cameras. Then it could anticipate the flow a 1/4 mile away. \n\nAlways wondered why No one has done this.",
            "title_similarity": "0.674459",
            "sentiment_compound": -0.5267
        },
        {
            "id": "h9kum6r",
            "score": 1,
            "text": "Really? No lag?",
            "title_similarity": "-0.05359116",
            "sentiment_compound": 0.4529
        },
        {
            "id": "h9kuoj6",
            "score": 1,
            "text": "Mira Mesa in San Diego county has got to be the worst I've ever driven in.",
            "title_similarity": "0.37273842",
            "sentiment_compound": -0.6249
        },
        {
            "id": "h9kus9e",
            "score": 1,
            "text": "California still has insane traffic",
            "title_similarity": "0.29922172",
            "sentiment_compound": -0.4019
        },
        {
            "id": "h9kuu1x",
            "score": 1,
            "text": "It's crazy that cities intentionally have streets that time lights to force you to stop every block with the intention to disincentive driving.\n\nMake that shit efficient.",
            "title_similarity": "0.5487177",
            "sentiment_compound": -0.8074
        },
        {
            "id": "h9kuwjp",
            "score": 1,
            "text": "But no green wave",
            "title_similarity": "-0.057975024",
            "sentiment_compound": -0.4215
        },
        {
            "id": "h9kv0io",
            "score": 1,
            "text": "did all that and still haven't put in left turn lanes",
            "title_similarity": "0.124246836",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9kv0l6",
            "score": 1,
            "text": "As this hits other cities, will we see an increase in accidents due to no longer being able to time the lights?",
            "title_similarity": "0.5200698",
            "sentiment_compound": -0.296
        },
        {
            "id": "h9kv0ow",
            "score": 1,
            "text": "Could just be a subway but instead let's invent entire new fields of study to enable cars destroying the climate.",
            "title_similarity": "0.50507903",
            "sentiment_compound": -0.7096
        },
        {
            "id": "h9kv4wq",
            "score": 1,
            "text": "16% faster, and that too was a fucking lie",
            "title_similarity": "0.46020305",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9kv7gf",
            "score": 1,
            "text": "bro la traffic us the worst in the country. this aint workin.",
            "title_similarity": "0.3106432",
            "sentiment_compound": -0.6249
        },
        {
            "id": "h9kv86h",
            "score": 1,
            "text": "I'm convinced there's a guy in a control room at a traffic light on a freeway by my town, I travel the road at 5 in the morning to commute to work and the light stays green for the whole distance I can see it, but as I get closer it turns so I have to stop. There's no other cars on the road, just me, and it turns red every time!!",
            "title_similarity": "0.69283366",
            "sentiment_compound": -0.6409
        },
        {
            "id": "h9kvbgy",
            "score": 1,
            "text": "Coulda fooled me",
            "title_similarity": "0.004674511",
            "sentiment_compound": -0.3818
        },
        {
            "id": "h9kvdig",
            "score": 1,
            "text": "Yeah until the crew from the Italian Job hacks in.",
            "title_similarity": "0.34167564",
            "sentiment_compound": 0.296
        },
        {
            "id": "h9kvehr",
            "score": 1,
            "text": "You'd think they would do something like that here in Phoenix where there's a perfect grid throughout much of the city, but no...",
            "title_similarity": "0.4884198",
            "sentiment_compound": 0.4767
        },
        {
            "id": "h9kvjst",
            "score": 1,
            "text": "Im curious how it will work after matchdays",
            "title_similarity": "0.23013726",
            "sentiment_compound": 0.3182
        },
        {
            "id": "h9kvovv",
            "score": 1,
            "text": "I watched a show, Taiwanese I think, where the stoplight had a countdown beside it telling you when the light will change. Do they have that anywhere in America, because that would be SO nice! I hate wondering how much longer I have to wait.",
            "title_similarity": "0.5603338",
            "sentiment_compound": -0.0984
        },
        {
            "id": "h9kvpdn",
            "score": 1,
            "text": "This is amazing! I love it! \nWhat all is needed for 1 traffic light to be automated? \nLTE/4.9GHz and a PLC? \nRoute the IOs through a web controller? \nI’m sure smart city companies have more expensive solutions with monthly licenses.",
            "title_similarity": "0.7495456",
            "sentiment_compound": 0.9442
        },
        {
            "id": "h9kvtf0",
            "score": 1,
            "text": "Sarah Connar does not approve.",
            "title_similarity": "-0.02959824",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9kvui2",
            "score": 1,
            "text": "I thought the netherlands had this",
            "title_similarity": "-0.032882225",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9kvvo9",
            "score": 1,
            "text": "Wasn’t this part of the storyline in the Sarah Connor Chronicles (terminator) ten years ago?… looks like skynet might be going live soon! 🙈",
            "title_similarity": "0.51966864",
            "sentiment_compound": 0.4199
        },
        {
            "id": "h9kvxa3",
            "score": 1,
            "text": "We should get Marky Mark to do a heist and use this system to get him and four other cars full of stolen gold bars from Italy out of the city.",
            "title_similarity": "0.5188557",
            "sentiment_compound": -0.4939
        },
        {
            "id": "h9kvzoz",
            "score": 1,
            "text": "Now do Boston",
            "title_similarity": "0.05002459",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9kw8f7",
            "score": 1,
            "text": "What I really want is to be able to get back home ten minutes before I left. When are we going to have time travel lights?",
            "title_similarity": "0.5346168",
            "sentiment_compound": 0.1513
        },
        {
            "id": "h9kwbt1",
            "score": 1,
            "text": "Munich, Germany here. Our traffic lights fuck with us deliberately",
            "title_similarity": "0.37180638",
            "sentiment_compound": -0.5423
        },
        {
            "id": "h9kwcv5",
            "score": 1,
            "text": "Englishman here - You could all just get roundabouts like to the rest of us.",
            "title_similarity": "0.39257038",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h9kwdmt",
            "score": 1,
            "text": "Some new Audi vehicles have a feature that supposedly taps into the LA traffic light network and tells you whether you will make the next light.",
            "title_similarity": "0.56626785",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9kwe2a",
            "score": 1,
            "text": "Trains are better",
            "title_similarity": "0.1632177",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h9kwf9b",
            "score": 1,
            "text": "desyncronize that shit because it doesn’t work",
            "title_similarity": "0.07137584",
            "sentiment_compound": -0.5574
        },
        {
            "id": "h9kwg86",
            "score": 1,
            "text": "Somethings I like to imagine the entire US going through a complete structural/design overhaul. Imagine remaking the country is a way to be convenient and efficient for the it's citizens.",
            "title_similarity": "0.5488305",
            "sentiment_compound": 0.6486
        },
        {
            "id": "h9kwgoh",
            "score": 3,
            "text": "If only my city did this. I have legit waited 1-2 minutes on a red light with no one else on the intersection but me. Fuckin bullshit yo",
            "title_similarity": "0.65134704",
            "sentiment_compound": -0.8042
        },
        {
            "id": "h9kwhbe",
            "score": 1,
            "text": "I know some of these lights are wasting everyone's time on purpose.",
            "title_similarity": "0.30005464",
            "sentiment_compound": -0.4019
        },
        {
            "id": "h9kwinv",
            "score": 1,
            "text": "So that’s why when ever I travel any where else it feels like the lights take FOREVER to change. I’m spoiled with all this synchronization.",
            "title_similarity": "0.4671027",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h9kwip3",
            "score": 1,
            "text": "[Sydney has had this since the 1970s](https://en.m.wikipedia.org/wiki/Sydney_Coordinated_Adaptive_Traffic_System), and that system’s been adopted in about 40 countries so LA definitely isn’t the first city to do this. First US city maybe",
            "title_similarity": "0.65696526",
            "sentiment_compound": 0.4549
        },
        {
            "id": "h9kwjz5",
            "score": 1,
            "text": "Wow.   What a concept.",
            "title_similarity": "-0.0999922",
            "sentiment_compound": 0.5859
        },
        {
            "id": "h9kwkdm",
            "score": 1,
            "text": "Ban the cars instead",
            "title_similarity": "0.22738805",
            "sentiment_compound": -0.5574
        },
        {
            "id": "h9kwm1z",
            "score": 1,
            "text": "Wait, I thought this was standard.  Why would all of the lights everywhere not be synchronized?",
            "title_similarity": "0.39564514",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9kwn6q",
            "score": 1,
            "text": "You would think in the year we live in that this had been done for some time.\n\nIve said it before, and ill say it again. If some developer out there with enough time decides to write some really kick ass stop light software using things like real time updates, traffic statuses over the last like 5-10 years, and a myriad of many other information sources in order to write code to make street lights \"smart\", you could make some really, really, reaaallly good money.\n\nStart small in some town and use it as your beta. Then expand and continue to build the code. Sell it to a few towns and build a history of how it works and how good it works. \n\nAnd then just keep going up. Its one of the biggest needs in not only America, but the entire world. And ive never heard of like badass software for traffic, and im sure there is some out there.. but again.. it seems like a market that given the right resources and some good people, you could make a product that would just rain money. Especially since its like a government contract, or at least municipal. So take that pocket and cut a hole in it because the money will just keep coming. \n\nAt least, in the field i work in.. when i work with government contracts / contracted jobs for parts for... \"equipment\" the government uses that they would pay us to do.. things to, they would always want it by a certain date, and would push hard to continuously move that date up and up and up, while still shipping \"equipment\" for us to do things to. So sometimes the number of items would double, triple, and then some seemingly overnight. \n\nHow they shipped it they didnt care how much it cost to ship it to us, and to ship it back to them. Not open on a sunday or a weekend? Theyd pay to have the shipper open for them. Theyd pay us a price we came up with to \"fire up\" our facilities, and on top of that we would charge crazy expedite fees, on top of normal fees to do the things we did to the stuff they had and wanted things done to them.\n\nDont work on xmas? We will pay 3x what we normally pay. We will pay for the double time for the workers. We will fly in lunch, dinner, breakfast, turkeys, hams, whatever it takes. It really seemed like dropping a nickle in a bucket to them because the end result is all they cared about. Money is like on a jurassic park level. Spared no expense.\n\nSeeing the numbers for each item, and overall numbers etc.. it was insane how much we would make per item. Per day. And like tripled sometimes, etc. You name it.\n\nPlus, since we would bring all the employees in we needed to do the things we do, it was almost like a lotto ticket or something. We of course would also work on other companies items they had in house for us to do things to, and some of those were on a expedite or whatever, but we could charge them all sorts of opening fees for the facilities, expedite fees, you name it.\n\nThe owners really doubled and tripled up on so many things.. So the government contracts made insane amounts of money not just from their stuff, but we would also rake it in from other vendors we would do stuff for and charge for but no one was the wiser. \n\nSure, its shitty backroom meeting rich/wiseguy bullshit, but thats how people that own companies do things. They take every opportunity and wring every fucking last penny they could get, and talk the talk, walk the walk, and delivery. Under-promise and over-deliver type stuff so those customers would all come back and keep coming back and word in the industry gets around and other customers see certain customers getting their stuff and them doing what they do.. theyd eventually figure out who they were going to to get the quality / service / speed they wanted.. and it was all available for a price.\n\nWhich pretty much all of them would be willing to pay. \n\nJust nuts really.\n\nBut yeah, do you want to develop an app? ( dont mind the tattoo on my forehead that says \"do not develop my app\" ) \n\nWell, if anyone wants to develop an app with me, I'm down.",
            "title_similarity": "0.645941",
            "sentiment_compound": 0.9624
        },
        {
            "id": "h9kwne7",
            "score": 1,
            "text": "My wife worked for a city down there that had one of those synced streets going through it.  Every now and then she'd look out the window and see the street was backed up, so she'd call the department that controlled the lights and the guy would say \"Watch this\" and all the lights as far down the street would turned green.  They called it flushing the system.  Pretty cool.",
            "title_similarity": "0.6183883",
            "sentiment_compound": 0.6808
        },
        {
            "id": "h9kwoua",
            "score": 1,
            "text": "Yeah and the person who controls that system is a sadistic madman who feels joy from the misfortune of those stuck in hi unending hellscape that is LA traffic.",
            "title_similarity": "0.3518955",
            "sentiment_compound": 0.6124
        },
        {
            "id": "h9kwru6",
            "score": 1,
            "text": "*In the United States.",
            "title_similarity": "0.14543924",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h9kwvsr",
            "score": 1,
            "text": "I wonder how tight the security on that system is",
            "title_similarity": "0.1627471",
            "sentiment_compound": 0.34
        },
        {
            "id": "h9kwyab",
            "score": 1,
            "text": "The company I used to work for does in this synchronization of traffic lights in western PA. We always go to the area and do travel runs to see how long it takes to get through. Then after the equipment is added, we go back and run it again to see the time savings. It costs a lot to do this bc you need more equipment, but I’ve seen it provide a time savings of 15 to 25%. The township or municipality has to have the money to do it though, and then it’s their responsibility to maintain it which can be a sticking point.",
            "title_similarity": "0.6959529",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9kx0c9",
            "score": 1,
            "text": "I believe this is the first headline I’ve seen in years about California doing something objectively good 😅",
            "title_similarity": "0.41346782",
            "sentiment_compound": 0.6597
        },
        {
            "id": "h9kx53c",
            "score": 1,
            "text": "Wish here in WA they would at least start with the small things. Like having a flashing yellow on left turn lights, we are always sitting at a red left turn light with little to no oncoming traffic.",
            "title_similarity": "0.51480997",
            "sentiment_compound": 0.507
        },
        {
            "id": "h9kx7q6",
            "score": 1,
            "text": "April 2, 2013 -- 09:11 GMT\n\nLazy journalism, London have been doing this for a lot longer.",
            "title_similarity": "0.50799793",
            "sentiment_compound": -0.3612
        },
        {
            "id": "h9kx8fd",
            "score": 1,
            "text": "This is bullshit for anyone driving LaBrea, every red light every time.",
            "title_similarity": "0.48128295",
            "sentiment_compound": -0.5859
        },
        {
            "id": "h9kx9ox",
            "score": 1,
            "text": "I havent been in Korea for a decade but when I was a kid I remember a taxi driver got super mad at a red light. I asked him why and he said most of the traffic lights usually synced up and timed so when you start with 1 green light, by the time you get to the next traffic light, itll turn green thus making sure that drivers can keep on driving. That was like 15 years ago",
            "title_similarity": "0.7354059",
            "sentiment_compound": 0.8047
        },
        {
            "id": "h9kxfio",
            "score": 1,
            "text": "In Orlando the traffic lights are programmed to ensure very car gets stuck at every light for a minimum of 7 minutes. Worst city engineering I’ve ever seen.",
            "title_similarity": "0.63317287",
            "sentiment_compound": -0.5809
        },
        {
            "id": "h9kxi05",
            "score": 1,
            "text": "I live in Los Angeles - have they turned this on yet?!  Lol",
            "title_similarity": "0.3294769",
            "sentiment_compound": 0.4753
        },
        {
            "id": "h9kxku5",
            "score": 1,
            "text": "Muh freeeedum! The government is watching and controlling us!",
            "title_similarity": "0.31245992",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9kxlrv",
            "score": 1,
            "text": "That's really cool now if only idiots knew what signs are and how to drive properly.",
            "title_similarity": "0.4034782",
            "sentiment_compound": 0.3804
        },
        {
            "id": "h9kxlw4",
            "score": 1,
            "text": "Hackers\t (rubbing hands together)",
            "title_similarity": "0.1295758",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9kxmmx",
            "score": 2,
            "text": "Not gonna lie, as someone who drives in LA. I feel like this is not the case. I've gotten stuck at 3 lights in a row. One turns green exactly as the next one is 2 seconds from turning yellow.",
            "title_similarity": "0.6029113",
            "sentiment_compound": 0.128
        },
        {
            "id": "h9kxp4z",
            "score": 1,
            "text": "Nashville needs that system....",
            "title_similarity": "0.17885292",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9kxybg",
            "score": 1,
            "text": "Lemme drive through, I’ll still be sure to hit every light red anyway.",
            "title_similarity": "0.44873145",
            "sentiment_compound": 0.3182
        },
        {
            "id": "h9ky0pj",
            "score": 1,
            "text": "And yet you can still be stuck at a red left turn arrow for 45 seconds at 3am on a Tuesday with no one else on the road.\n\nLA has come a long way, but the 24h left turn arrows are ludicrous.",
            "title_similarity": "0.6390916",
            "sentiment_compound": -0.6542
        },
        {
            "id": "h9ky1ct",
            "score": 1,
            "text": "Me: *Cries in ‘stop at every light on my way to work at 5:30am’*",
            "title_similarity": "0.5239397",
            "sentiment_compound": -0.4019
        },
        {
            "id": "h9ky25q",
            "score": 1,
            "text": "Wouldn’t need those traffic lights if you had good public transport tho…",
            "title_similarity": "0.2953478",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h9ky9ik",
            "score": 1,
            "text": "the lengths people will go to avoid installing more public transit",
            "title_similarity": "0.26462877",
            "sentiment_compound": -0.296
        },
        {
            "id": "h9kyb4p",
            "score": 1,
            "text": "This is probably my goto wish if I ever find a genie. Eff world peace and solving hunger, I just wanna drive from one intersection to the next without hitting every single red light",
            "title_similarity": "0.51802784",
            "sentiment_compound": 0.765
        },
        {
            "id": "h9kyf5r",
            "score": 1,
            "text": "now fix the water pipes.",
            "title_similarity": "0.15277737",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9kyh4x",
            "score": 2,
            "text": "And yet LA traffic is still trash",
            "title_similarity": "0.20045772",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9kyr18",
            "score": 1,
            "text": "Yea they are all sync to turn red at the wrong time for sure. Riding between fairfax and La brea on Wilshire is red light go, red light, go, red light, go, red light. There has never been a time I could drive or ride a bike without getting reds.",
            "title_similarity": "0.5993646",
            "sentiment_compound": -0.2023
        },
        {
            "id": "h9kysd4",
            "score": 1,
            "text": "Less congestion in LA? Good one",
            "title_similarity": "0.2643522",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h9kysev",
            "score": 1,
            "text": "Back on the late 90's, I was in a taxi in Montreal when I realized, every taxi I took had a digital speedometer. Fairly odd for the time. I can't remember the exact number, but he said if you drive 56kmh, or whatever, you'll only catch 1 red light through the whole city.",
            "title_similarity": "0.76349795",
            "sentiment_compound": -0.128
        },
        {
            "id": "h9kyxbl",
            "score": 1,
            "text": "Yeah they have synced them so that I get a red light every single time.",
            "title_similarity": "0.49004364",
            "sentiment_compound": 0.296
        },
        {
            "id": "h9kyxo8",
            "score": 1,
            "text": "Here in ny we barely know about green turn arrows and 4 way pedestrian red outs vs letting 1 car be able to turn per cycle",
            "title_similarity": "0.63521695",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9kz0h2",
            "score": 1,
            "text": "Then how come every time I’m on highland or la brea I hit every single red light in a row? Lmao",
            "title_similarity": "0.5815282",
            "sentiment_compound": 0.5994
        },
        {
            "id": "h9kz0nb",
            "score": 1,
            "text": "LA traffic needs all the help it can possibly get.",
            "title_similarity": "0.45312214",
            "sentiment_compound": 0.4019
        },
        {
            "id": "h9kz0u4",
            "score": 1,
            "text": "And yet, whenever I drive down Wilshire, it seems the exact opposite. My light turns green, the next is red. I always have to stop at the next traffic light. The flow is terrible.",
            "title_similarity": "0.56244206",
            "sentiment_compound": -0.6486
        },
        {
            "id": "h9kz57g",
            "score": 1,
            "text": "Let me tell you: not DTLA.",
            "title_similarity": "-0.11456159",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9kz6rs",
            "score": 1,
            "text": "And yet it’s still BS traffic on the 405 and 91 🤷🏼‍♀️",
            "title_similarity": "0.48479035",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9kz71i",
            "score": 1,
            "text": "I thought this is how lights work, like my whole life. I cant believe this wasnt a thing",
            "title_similarity": "0.3326109",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h9kza33",
            "score": 1,
            "text": "God that sounds amazing. I’ve wanted this forever. I’m pretty sure they do the opposite where I live so traffic moves in big chunks…really hard to change lanes when it’s a wall of cars all the way down the road because the lights won’t let you pass anyone.",
            "title_similarity": "0.6095592",
            "sentiment_compound": 0.875
        },
        {
            "id": "h9kzb0w",
            "score": 1,
            "text": "Was the first? Cause pretty sure we have it",
            "title_similarity": "0.10760399",
            "sentiment_compound": 0.6705
        },
        {
            "id": "h9kznxq",
            "score": 1,
            "text": "As someone who lived in downtown LA for some years and recently moved away, I would say that anecdotally I definitely thought that the lights were NOT synced. I would hit a red light, when it turned green, drive at the speed limit and the next light would be turning red in anticipation of my arrival. It was like this for pretty much every intersection. I estimated in order to hit consistent green lights, one would need to drive a good 10 miles above the speed limit. And this was my experience pretty much everywhere in LA. I can’t say that I really ever experienced a synchronized traffic light where it was green all the way down. Even at night when there was no traffic, you’d keep hitting red lights almost like they knew you were coming and turned red a good bit before you got there",
            "title_similarity": "0.72992414",
            "sentiment_compound": 0.9502
        },
        {
            "id": "h9kzoyw",
            "score": 1,
            "text": "isnt LA famous for having terrible traffic though? I am confusion.",
            "title_similarity": "0.36589086",
            "sentiment_compound": -0.6486
        },
        {
            "id": "h9kzutv",
            "score": 1,
            "text": "EVs would reduce idling time down to zero. Automated cars will reduce traffic (and deaths) to close to zero. We can do better than traffic light sync.\n\nIt's a start but I'm honestly not that impressed.",
            "title_similarity": "0.5598635",
            "sentiment_compound": 0.3857
        },
        {
            "id": "h9kzvqa",
            "score": 1,
            "text": "Wish my city would make an attempt at fixing lights. It will be 4am with light traffic but the turning lane I take to go into wawa will stay red for the longest damn time. While there is barely any traffic coming from the opposite direction because all the morning traffic is coming from the same direction as me, also causing said turning lane to get backed up at 4am…shits frustrating. I’ve had cars get impatient and go around me and run the red light.",
            "title_similarity": "0.6930183",
            "sentiment_compound": -0.8481
        },
        {
            "id": "h9kzw34",
            "score": 1,
            "text": "They need to share this with Malibu and fix the intersection in front of the entrance to Will Rogers beach.",
            "title_similarity": "0.3461212",
            "sentiment_compound": 0.296
        },
        {
            "id": "h9kzylm",
            "score": 1,
            "text": "there's literally no way this is true. the lights in LA are by far the worst and least synchronized of anywhere I've ever lived. NYC had synced lights, that was a time",
            "title_similarity": "0.5041541",
            "sentiment_compound": -0.5423
        },
        {
            "id": "h9kzzrd",
            "score": 1,
            "text": "That's just increasing capacity. Traffic issues are never solved by just increasing capacity. You've got to move people out of cars. The more impressive stuff is when LA builds rail lines, bus lines, and decreases parking spots each year.",
            "title_similarity": "0.6811572",
            "sentiment_compound": 0.4174
        },
        {
            "id": "h9l03tp",
            "score": 1,
            "text": "America will do anything to avoid installing roundabouts",
            "title_similarity": "0.37304986",
            "sentiment_compound": -0.296
        },
        {
            "id": "h9l05kg",
            "score": 1,
            "text": "lol they can afford to sync all their traffic lights but not help their poor",
            "title_similarity": "0.596866",
            "sentiment_compound": 0.3278
        },
        {
            "id": "h9l0a1n",
            "score": 1,
            "text": "i don't understand.  as far as i know, santiago (chile) has had a unified control system since around the year 2000.  isn't this normal in large cities?\n\nreference [here](https://www.dipres.gob.cl/597/articles-140975_informe_final.pdf) (in spanish).",
            "title_similarity": "0.54712546",
            "sentiment_compound": 0.3818
        },
        {
            "id": "h9l0a26",
            "score": 1,
            "text": "Coulda fucking fooled me lol. At least so I thought, until I experienced traffic lights in North Carolina for a bit. Ended up just running a lot of dumbass red lights at 1 or 2am because there were literally no other cars for miles away",
            "title_similarity": "0.6866452",
            "sentiment_compound": -0.6838
        },
        {
            "id": "h9l0a73",
            "score": 1,
            "text": "I hope my city is second",
            "title_similarity": "0.1765691",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h9l0dbz",
            "score": 1,
            "text": "And hear I thought the traffic control center in The Italian Job was BS",
            "title_similarity": "0.4909962",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9l0dfh",
            "score": 1,
            "text": "You know what reduces idle time even more? Roundabouts.",
            "title_similarity": "0.42344874",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9l0ir0",
            "score": 1,
            "text": "Synchronized to stop you.",
            "title_similarity": "0.1682559",
            "sentiment_compound": -0.296
        },
        {
            "id": "h9l0knj",
            "score": 1,
            "text": "Unless this system is radically different to SCATS, LA was not the first city to fully interconnect and automate their traffic signals. Sydney, Melbourne, Singapore, Adelaide, Brisbane and a bunch of other cities already had fully connected systems much earlier.",
            "title_similarity": "0.5459899",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9l0sxg",
            "score": 2,
            "text": "Now do it everywhere",
            "title_similarity": "0.12464185",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9l0vjv",
            "score": 2,
            "text": "It's absurd more cities don't do this.   The famed 8 Mile Road in Detroit had lights synched so that if you went with a certain speed range, you'd catch all the green lights (traffic clearly can affect this).",
            "title_similarity": "0.77590466",
            "sentiment_compound": 0.5859
        },
        {
            "id": "h9l10im",
            "score": 1,
            "text": "While riding the bus in LA there was some guy from this opticon coming that makes all the traffic lights turn green for buses or emergency vehicles. It was pretty cool.",
            "title_similarity": "0.611951",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h9l19ne",
            "score": 1,
            "text": "I thought Singapore had already accomplished this.",
            "title_similarity": "0.16352654",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h9l1bqs",
            "score": 1,
            "text": "and the traffic still sucks in LA",
            "title_similarity": "0.3170699",
            "sentiment_compound": -0.3612
        },
        {
            "id": "h9l1fmu",
            "score": 1,
            "text": "I thought Pittsburgh was ahead of the pack for this kind of tech.",
            "title_similarity": "0.40467384",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9l1fut",
            "score": 1,
            "text": "469 miles? How big is LA?",
            "title_similarity": "0.37958822",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9l1hcj",
            "score": 1,
            "text": "The problem with traffic in l.a. is 100% the lights. All crosswalk signals are active every fucking time so if adds 30 seconds no matter what, it's fucked",
            "title_similarity": "0.72263825",
            "sentiment_compound": -0.6677
        },
        {
            "id": "h9l1ht7",
            "score": 1,
            "text": "And yet driving here still drains your soul",
            "title_similarity": "0.24571785",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9l1jff",
            "score": 1,
            "text": "I’m sorry but anyone in LA can tell you the lights are not synchronized. The lights in Beverly Hills are synchronized but BH is it’s own city.",
            "title_similarity": "0.49263275",
            "sentiment_compound": -0.0387
        },
        {
            "id": "h9l1l6o",
            "score": 1,
            "text": "I can vouch for those dramatically reduced idling times. Sometimes I gotta eat when I can, and those 30 seconds at a red light were the glory days of motor-dining.",
            "title_similarity": "0.5972003",
            "sentiment_compound": 0.5423
        },
        {
            "id": "h9l1rs8",
            "score": 1,
            "text": "It don’t feel that way.",
            "title_similarity": "-0.16740832",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9l1t45",
            "score": 1,
            "text": "I call bullshit. I once had to run a red light in Southgate because traffic was so heavy I was there for 25 minutes.",
            "title_similarity": "0.67920953",
            "sentiment_compound": -0.5859
        },
        {
            "id": "h9l1uca",
            "score": 1,
            "text": "And it doesn't help....",
            "title_similarity": "-0.13629818",
            "sentiment_compound": -0.3089
        },
        {
            "id": "h9l1uub",
            "score": 2,
            "text": "Maybe now they will realize we dont need electric cars because gas use will cut way down with one simple fix!!!",
            "title_similarity": "0.5185956",
            "sentiment_compound": -0.4545
        },
        {
            "id": "h9l1xyp",
            "score": 1,
            "text": "I live in the confines of the City of Los Angeles.\n\nThis was actually started years ago by a Mayor who campaigned on reducing traffic congestion, it was successful and highly popular.\n\nAlso worth noting (since this is an article is from 2013) that more recently the city has started to deliberately break this timing with the explicitly stated goal of increasing congestion.  They call it \"traffic calming\" and their theory is that if they make driving miserable enough that some drivers will take our horribly slow almost entirely bus based public transportation system instead.",
            "title_similarity": "0.68983257",
            "sentiment_compound": 0.6318
        },
        {
            "id": "h9l1zrb",
            "score": 1,
            "text": "As someone who moved to Houston, I really need the urban planners to see this article.",
            "title_similarity": "0.42053163",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9l212w",
            "score": 1,
            "text": "And will become a critical piece of surveillance technology for Skynet.",
            "title_similarity": "0.35352105",
            "sentiment_compound": -0.3182
        },
        {
            "id": "h9l21sx",
            "score": 1,
            "text": "They clearly left out Lincoln Avenue in Venice.",
            "title_similarity": "0.15596658",
            "sentiment_compound": 0.4019
        },
        {
            "id": "h9l2j9z",
            "score": 1,
            "text": "I feel like we don't hear about technology being leveraged on our roadways enough",
            "title_similarity": "0.2963876",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h9l2jo3",
            "score": 1,
            "text": "Not gonna lie, I actually assumed that was already true of most cities. My good faith was misplaced!",
            "title_similarity": "0.47420466",
            "sentiment_compound": 0.8424
        },
        {
            "id": "h9l2lpx",
            "score": 1,
            "text": "Clearly bullshit if you ever have driven down Wilshire Blvd.",
            "title_similarity": "0.2791018",
            "sentiment_compound": -0.2732
        },
        {
            "id": "h9l2mfl",
            "score": 1,
            "text": "ANCHORAGE PLEASE",
            "title_similarity": "0.014827151",
            "sentiment_compound": 0.3182
        },
        {
            "id": "h9l2qdg",
            "score": 1,
            "text": "I mean, Australia's been using SCATS for a while now. It's about as real-time as you can get.\n\nhttps://en.m.wikipedia.org/wiki/Sydney_Coordinated_Adaptive_Traffic_System",
            "title_similarity": "0.5071439",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9l2vmc",
            "score": 1,
            "text": "The stoplight outside my neighborhood is the outlet from a school. People will be stacked up at the red light perpendicular to the school at any time of day any time of year because they hired the family guy dude with a stick in his head to program the light. It makes me want to open the access panel and cut any wire I find",
            "title_similarity": "0.61128044",
            "sentiment_compound": -0.2023
        },
        {
            "id": "h9l2xt3",
            "score": 1,
            "text": "Cities really need to time their lights out such that if you drive the speed limit you'll catch every green light. This way traffic moves in packets at the speed limit.",
            "title_similarity": "0.714972",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9l2ysn",
            "score": 2,
            "text": "All the people reading this stuck in LA traffic right now DAFUG",
            "title_similarity": "0.5173633",
            "sentiment_compound": -0.3071
        },
        {
            "id": "h9l30b2",
            "score": 1,
            "text": "Our downtown is synchronized intelligently. The other lights in my city are \"synchronized\" to have you stop at every. single. one, no matter your speed.",
            "title_similarity": "0.64108896",
            "sentiment_compound": 0.1842
        },
        {
            "id": "h9l31p2",
            "score": 1,
            "text": "Only 16% congestion improvement is surprising.",
            "title_similarity": "0.5281307",
            "sentiment_compound": 0.6249
        },
        {
            "id": "h9l33q0",
            "score": 1,
            "text": "We‘ve had these so called „green waves“ all over Germany in the 1980s (obviously not at such a scale). Munich was one of the first to switch it off again to make driving into the city center stressful and slow so that people use public transport instead. \n\nI don‘t think there’s a single city left in Germany where it still is in place. Instead our lights are now often triggered by trams and busses, so that they have priority at road crossings. One set of traffic lights where I live is extremely bad with the time between green phases varying between 2 and 8 (!) minutes, if there happen to be two trams going into the opposite direction within 2 minutes of each other. Average waiting time is 3.5 minutes.",
            "title_similarity": "0.67731476",
            "sentiment_compound": -0.8118
        },
        {
            "id": "h9l34zt",
            "score": 1,
            "text": "There's a spot near me where the lights are on a really stupid timer, which leads to the left turn lane being clogged because their light is green while the light in the lane that they're turning into is red and vice-versa. Meanwhile, people turning right coming from the other direction clog up the lanes the aforementioned left turners try to get into, because their light is green until a little after the other light becomes red.",
            "title_similarity": "0.5069761",
            "sentiment_compound": -0.5709
        },
        {
            "id": "h9l38es",
            "score": 1,
            "text": "Los Angeles only has 4400 tragic lights? That's so little.",
            "title_similarity": "0.52653223",
            "sentiment_compound": -0.4588
        },
        {
            "id": "h9l3abm",
            "score": 1,
            "text": "...very common in my country,  the netherlands",
            "title_similarity": "0.118092485",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9l3azz",
            "score": 1,
            "text": "So why can’t they just make a left turn signal.",
            "title_similarity": "0.16231984",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9l3cfz",
            "score": 1,
            "text": "YOU WILL NEVER SHUT DOWN THE REAL NAPSTER",
            "title_similarity": "0.34140354",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9l3enu",
            "score": 1,
            "text": "I wish my city had that, it's such a hit or miss if you're going to make it across town in 10 min or 30 min. Nothing worse then hitting every red light, especially late at night when there's not alot of cars.",
            "title_similarity": "0.6429838",
            "sentiment_compound": 0.5653
        },
        {
            "id": "h9l3idr",
            "score": 1,
            "text": "As someone living in LA, they must have done a fucking terrible ass job at it.",
            "title_similarity": "0.24481456",
            "sentiment_compound": -0.8004
        },
        {
            "id": "h9l3j7x",
            "score": 1,
            "text": "And here we have \"the green wave\"... Stay within the lights, and you'll catch all the green lights.\n\nhttps://youtu.be/6Kx1XZeFkXk\n\nBeat that, LA! ;)",
            "title_similarity": "0.42370063",
            "sentiment_compound": 0.2942
        },
        {
            "id": "h9l3jjb",
            "score": 2,
            "text": "Up until 10 years ago, the UK was actively timing lights to cause congestion and use more fuel!\n\n[In the UK, in 2009, it was revealed that the Department for Transport had previously discouraged green waves as they reduced fuel usage, and thus less revenue was raised from fuel taxes](https://en.m.wikipedia.org/wiki/Green_wave)",
            "title_similarity": "0.63174415",
            "sentiment_compound": -0.1759
        },
        {
            "id": "h9l3mxq",
            "score": 1,
            "text": "“The system limits congestion by up to 16%”\n\nI live in LA and can’t imagine if traffic was 16% worse. Oh man.",
            "title_similarity": "0.7874391",
            "sentiment_compound": -0.4767
        },
        {
            "id": "h9l3ni9",
            "score": 1,
            "text": "This should be a requirement for every city.",
            "title_similarity": "0.3359737",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9l3noi",
            "score": 1,
            "text": "Florida needs to take notes.",
            "title_similarity": "0.15121436",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9l3sw2",
            "score": 1,
            "text": "This is 8 years old and the traffic lights for sure have not gotten any better trust me I live here in LA",
            "title_similarity": "0.52395934",
            "sentiment_compound": 0.4929
        },
        {
            "id": "h9l3u71",
            "score": 1,
            "text": "I have no reason to doubt this about LA.\n\nRegardless, to live in LA is to commit a major chunk of your days to sitting in a car that's stuck in traffic which simply doesn't move.  Tried it for a couple of years, but time is just too damn precious to live like that.",
            "title_similarity": "0.67691755",
            "sentiment_compound": 0.5423
        },
        {
            "id": "h9l3ywd",
            "score": 1,
            "text": "I was trying to program this years back,\n\nSMART\n\nSystem maintained adjustable roads and transit",
            "title_similarity": "0.38353404",
            "sentiment_compound": 0.5319
        },
        {
            "id": "h9l43xp",
            "score": 1,
            "text": "Now do Brisbane!",
            "title_similarity": "0.10877765",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9l4blq",
            "score": 1,
            "text": "Mmm, now only one provider needs to be hacked.",
            "title_similarity": "0.24598886",
            "sentiment_compound": -0.4019
        },
        {
            "id": "h9l4dr8",
            "score": 1,
            "text": "How about traffic circles? Aren't those more efficient than lights?",
            "title_similarity": "0.37319103",
            "sentiment_compound": -0.4421
        },
        {
            "id": "h9l4eyt",
            "score": 1,
            "text": "2021 ive been waiting for this",
            "title_similarity": "0.046332806",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9l4hha",
            "score": 1,
            "text": "Why would you need to sync an entire cities lights though? I understand say on one street but city wide seems unnecessary.",
            "title_similarity": "0.4687578",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9l4mes",
            "score": 1,
            "text": "All that automation and the traffic is still the worst in the US.  \n\nAmazing!",
            "title_similarity": "0.44205013",
            "sentiment_compound": -0.1511
        },
        {
            "id": "h9l4y2q",
            "score": 1,
            "text": "*Cleveland* “imma pretend I didn’t see that”",
            "title_similarity": "0.16142997",
            "sentiment_compound": -0.1027
        },
        {
            "id": "h9l50vi",
            "score": 1,
            "text": "LA removed all their light rail in the first half of the 20th century and they've been paying the price ever since.",
            "title_similarity": "0.5827193",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9l571w",
            "score": 1,
            "text": "This is why all those movies that feature omnicient intellegence operatives working from a control room to turn off elevators or find the wiring diagrams of two hundred year old building are filmed in LA.",
            "title_similarity": "0.6416627",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9l5jvz",
            "score": 1,
            "text": "Wow if this is improved, imagine if it were 16% worse!",
            "title_similarity": "0.52049226",
            "sentiment_compound": 0.6239
        },
        {
            "id": "h9l5kqm",
            "score": 1,
            "text": "They warned about this in the Sarah Connor Chronicles.",
            "title_similarity": "0.25760978",
            "sentiment_compound": -0.2732
        },
        {
            "id": "h9l5lku",
            "score": 1,
            "text": "iM currently on jammed up on Olympic this system is shit",
            "title_similarity": "0.26674768",
            "sentiment_compound": -0.5574
        },
        {
            "id": "h9l5mdz",
            "score": 1,
            "text": "As a kid I thought this must be how it worked",
            "title_similarity": "0.074301064",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9l5ut7",
            "score": 1,
            "text": "As a person who lives in the LA area I call bullshit. Traffic here is terrible and nothing seems lined up at all. This all sound like a HUGE exaggeration to possibly just putting the lights on a cycle based on the time of day. LA is a shit hole that does nothing about traffic outside of blaming the people driving.",
            "title_similarity": "0.45763338",
            "sentiment_compound": -0.8468
        },
        {
            "id": "h9l5zoy",
            "score": 1,
            "text": "Meanwhile. In hamilton ontario Canada. The city is doing its best to remove all the efficient 1 way street systems that get you across town in 20 mins at 55kph with only 1 red light.\n\nBecause... Its bad for business for people not to have to stop and look around.\n\nOmg. If no one is shopping in your stupid main street store it's not. Because we don't know it's there - it's because your store sucks - is offering outdated services (appliance repair - but only for pre 21st century tech)",
            "title_similarity": "0.62614954",
            "sentiment_compound": -0.4404
        },
        {
            "id": "h9l656w",
            "score": 1,
            "text": "New York City has had 60% of its traffic lights synchronized since [1998](https://www.nytimes.com/1998/09/17/technology/choreographing-the-dance-of-traffic-lights.html). Now it's about 90%.",
            "title_similarity": "0.75959563",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9l67ab",
            "score": 1,
            "text": "Guess that’s why I hit every light red on fucking Telegraph",
            "title_similarity": "0.46751788",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9l6csa",
            "score": 1,
            "text": "Didn't Stockholm have this in the 80's?",
            "title_similarity": "0.28588974",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9l6h9x",
            "score": 1,
            "text": "It's been like that in Sydney and other places in Australia for decades. Apart from the occasional isolated traffic signals that don't need coordination, the rest are controlled with a central computer and have sensors in front of each stop line to detect residual queue after each cycle and 'vote' for increased cycle time for the next cycle. The coordination comes from having paths or 'green tunnels' through multiple adjacent lights for the traffic in peak flow. Unfortunately roads in Australia are generally not in the grid pattern you get in many US cities so coordination can often only benefit one direction of flow at a time.",
            "title_similarity": "0.731991",
            "sentiment_compound": 0.2484
        },
        {
            "id": "h9l6iif",
            "score": 1,
            "text": "And the traffic still sucks.",
            "title_similarity": "0.10208979",
            "sentiment_compound": -0.3612
        },
        {
            "id": "h9l6jk5",
            "score": 1,
            "text": "“Bullshit”\n-Los Angles resident",
            "title_similarity": "0.09722927",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9l6nyu",
            "score": 1,
            "text": "Cool now synchronize turn signals",
            "title_similarity": "0.21545076",
            "sentiment_compound": 0.3182
        },
        {
            "id": "h9l6o8p",
            "score": 1,
            "text": "That’s good but just a bandaid on a larger problem. A robust public transportation system would have significantly better returns",
            "title_similarity": "0.40575582",
            "sentiment_compound": 0.6542
        },
        {
            "id": "h9l6vh0",
            "score": 1,
            "text": "Idling - do people still sit whilst their car idles? Auto stop start is a thing",
            "title_similarity": "0.35959327",
            "sentiment_compound": -0.296
        },
        {
            "id": "h9l72n9",
            "score": 1,
            "text": "Why the fuck does it still suck -_-",
            "title_similarity": "-0.05298998",
            "sentiment_compound": -0.7506
        },
        {
            "id": "h9l7500",
            "score": 1,
            "text": "Wait I just assumed all cities did this, seemed like a no brainer...",
            "title_similarity": "0.387698",
            "sentiment_compound": 0.0772
        },
        {
            "id": "h9l78ll",
            "score": 1,
            "text": "Doesn’t seem to be working",
            "title_similarity": "-0.12174192",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9l7alx",
            "score": 1,
            "text": "Really disappointed to find out that most traffic systems are poorly synchronized. Seems like something that would have been implemented in a lot of places.",
            "title_similarity": "0.40976548",
            "sentiment_compound": -0.2247
        },
        {
            "id": "h9l7cqn",
            "score": 1,
            "text": "Pedestrian friendly roads also reduce congestion  ;)",
            "title_similarity": "0.32231864",
            "sentiment_compound": 0.6249
        },
        {
            "id": "h9l7dq7",
            "score": 1,
            "text": "And yet…LA.",
            "title_similarity": "0.08338256",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9l7i7g",
            "score": 1,
            "text": "This is cool, but it is not true that LA is the first.\n\nIn Germany, there has been a 'green wave' (grüne Welle) for nearly a century. [Here](https://babel.hathitrust.org/cgi/pt?id=uc1.d0000795989&view=1up&seq=123&skin=2021) is a link to a 1928 periodical discussing same, starting at the bottom left hand corner of page 95.",
            "title_similarity": "0.5069449",
            "sentiment_compound": 0.4501
        },
        {
            "id": "h9l7kg4",
            "score": 1,
            "text": "Meanwhile in South Africa: \n\nA set of traffic lights nearby my house were broken so frequently and for so long at a time that the municipality just decided to remove 1 of the 3 traffic lights in this 3 way junction and screw a fucking stop sign to the pole... It's been that way now for over a year.",
            "title_similarity": "0.55285627",
            "sentiment_compound": -0.7178
        },
        {
            "id": "h9l7lce",
            "score": 1,
            "text": "Only 16%? I feel like it would be at least 30% when you figure for how awful the wait is on some lights or regardless of traffic flow.",
            "title_similarity": "0.6612709",
            "sentiment_compound": -0.128
        },
        {
            "id": "h9l7uzc",
            "score": 2,
            "text": "Bullshit. Those lights almost got me killed. Why the fuck is a traffic light taking 10+ minutes to change in the middle of the night? A drunk could've plowed into me so I took the right, hung a \"u\"-turn then went on my merry way without dying... all because there's a traffic cam at that intersection. Fuck L.A. with a rusty spoon.",
            "title_similarity": "0.64677054",
            "sentiment_compound": -0.9317
        },
        {
            "id": "h9l7y1z",
            "score": 1,
            "text": "It’s not like we wanted to have car free cities or anything. No, this is America and oil is king.",
            "title_similarity": "0.44213164",
            "sentiment_compound": 0.2937
        },
        {
            "id": "h9l88b2",
            "score": 1,
            "text": "I visited my cousin in LA he informed me about this unwritten rule where three cars will run a red light. So watch out at intersections. I saw it in action a few times people really do run the red lights. Now my brother lives there he bought a motorcycle because he can get across town much faster. But he also confirmed the red light running but he says it’s really dangerous on a motorcycle because you don’t know if someone is going to go for it or not. He splits lanes all the time. I spent a week there. Can’t imagine the people who have to  spend hours in traffic every day. Good for the city trying to do something about the traffic problem.",
            "title_similarity": "0.7120353",
            "sentiment_compound": -0.6474
        },
        {
            "id": "h9l8f8q",
            "score": 1,
            "text": "They should have lasers that shines light to tell drivers to slow down or make gaps bigger.",
            "title_similarity": "0.4277022",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9l8mkr",
            "score": 1,
            "text": "I'm seriously impressed with our town's energy dissipated per microinch gained ratio.  Second only to sloth logistic planners and continental drift.",
            "title_similarity": "0.49722898",
            "sentiment_compound": 0.7269
        },
        {
            "id": "h9l8mlw",
            "score": 3,
            "text": "Pretty sure this is not true if you’ve actually driven in Los Angeles. It feels like they’ve gone and synced it so you get stuck on every traffic light.\n\nEdit: saw the article was written in 2013. Makes sense since none of the lights are synced",
            "title_similarity": "0.5890322",
            "sentiment_compound": 0.5274
        },
        {
            "id": "h9l8oqs",
            "score": 1,
            "text": "Atlantic City New Jersey had something like this. All the street lights going down the island would start turning green one after the other. And the sign on the side of the road said “if you drive 35 miles an hour you will hit every green light.” You could drive from Atlantic city to Margate never stop. My grandpop would set his cruise control.",
            "title_similarity": "0.75086266",
            "sentiment_compound": 0.5248
        },
        {
            "id": "h9l8qbq",
            "score": 1,
            "text": "And yet the expo line sits at red lights",
            "title_similarity": "0.36392617",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9l8rpb",
            "score": 2,
            "text": "I don't know when they did this, but it was a mess when I was there in 2014. Took a freaking hour to go seven miles on the 405.",
            "title_similarity": "0.5594959",
            "sentiment_compound": -0.7876
        },
        {
            "id": "h9l91pn",
            "score": 1,
            "text": "Does it though does it REALLY. You can take an hour to get across LA at 2:30pm on a Sunday",
            "title_similarity": "0.5662888",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9l96hb",
            "score": 1,
            "text": "Someone tell that to the light near our house which effectively hates us.",
            "title_similarity": "0.23068984",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9l97a4",
            "score": 1,
            "text": "I wish my city did this so that nighttime doordash deliveries would be faster...",
            "title_similarity": "0.4745177",
            "sentiment_compound": 0.4019
        },
        {
            "id": "h9l9i5u",
            "score": 1,
            "text": "Everywhere needs to do something like this.\n\nEspecially where I live, there's lights that will be green just long enough for 2 cars to get through and then turn red again, while others stay red for multiple minutes at a time. Like, a really long time.",
            "title_similarity": "0.69619006",
            "sentiment_compound": 0.6124
        },
        {
            "id": "h9l9p12",
            "score": 1,
            "text": "Clearly no one has seen The Italian Job (remake)",
            "title_similarity": "0.257132",
            "sentiment_compound": 0.128
        },
        {
            "id": "h9l9qd1",
            "score": 1,
            "text": "And I still have to wait hours to get home…",
            "title_similarity": "0.34992474",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9l9xe0",
            "score": 1,
            "text": "A city built for cars. Not people.",
            "title_similarity": "0.22205597",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9la00o",
            "score": 1,
            "text": "I actually really hate this. There are few lights be me like this. So if you dont \"speed\" to these lights if nobody is at the intersection on your side it wont turn green. Then you are stuck waiting 3 minutes! \n\nI much prefer normal lights as i can get a good feel for how long the cycles are and make good routes based on how they are going. It sounds odd but by me you can get \"trapped\" in a red light cycle and i can be absolutely infuriating",
            "title_similarity": "0.58632326",
            "sentiment_compound": -0.8985
        },
        {
            "id": "h9lagmk",
            "score": 1,
            "text": "Awesome\n So long as it cybersecurity is decent this is the kind of stuff we need.",
            "title_similarity": "0.26981366",
            "sentiment_compound": 0.6249
        },
        {
            "id": "h9lajhc",
            "score": 1,
            "text": "If only Denver would do the same. Driving in the town is a mess. It will take 30-45 minutes to drive 6 miles along Colorado Boulevard and every light you hit is red.",
            "title_similarity": "0.68531203",
            "sentiment_compound": -0.3612
        },
        {
            "id": "h9lavfl",
            "score": 2,
            "text": "Tail backs are limited to just 2 hours now.",
            "title_similarity": "0.390771",
            "sentiment_compound": -0.2732
        },
        {
            "id": "h9lavlu",
            "score": 2,
            "text": "And it’s awesome. Most of the time. Best at night or early morning where I can get from Like USC to Pasadena in 20 minutes. Though that’s a lot of freeway. \n\nOther times I feel it doesn’t matter at all if I’m stuck on Pico from Olympic trying to get to Fairfax and it takes 45 minutes even cutting through shit. \n\nLA Traffic sucks always",
            "title_similarity": "0.7136517",
            "sentiment_compound": 0.5423
        },
        {
            "id": "h9lazhw",
            "score": 2,
            "text": "NY has done this for decades. Glad to see Ca. finally sees the intelligence in it.",
            "title_similarity": "0.43265212",
            "sentiment_compound": 0.7269
        },
        {
            "id": "h9lb1hc",
            "score": 1,
            "text": "The nearest town to me can't figure out how to clear backed-up traffic despite their hai tekky video system.",
            "title_similarity": "0.38710564",
            "sentiment_compound": 0.3818
        },
        {
            "id": "h9lb20n",
            "score": 1,
            "text": "urban planning. try it some time ffs",
            "title_similarity": "0.23673691",
            "sentiment_compound": -0.5859
        },
        {
            "id": "h9lb5c7",
            "score": 1,
            "text": "Someone needs to learn from this. Near my house there's a light that specifically turns red when *no one* is waiting for a green. At 1am.",
            "title_similarity": "0.46467912",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9lb7o8",
            "score": 2,
            "text": "So if I'm stuck in a red light in LA, it's not because of random light timings, it's because an AI actively wants to make me wait. Neat.",
            "title_similarity": "0.46503234",
            "sentiment_compound": 0.4654
        },
        {
            "id": "h9lbdwe",
            "score": 1,
            "text": "I've always felt that traffic lights are remarkably reliable. But it might be confirmation bias, I don't know. I just feel like all other technology lets me down far more than traffic lights.",
            "title_similarity": "0.5739546",
            "sentiment_compound": 0.3919
        },
        {
            "id": "h9lbjj7",
            "score": 1,
            "text": "What about that city in the italian job (original)?",
            "title_similarity": "0.32116887",
            "sentiment_compound": 0.3182
        },
        {
            "id": "h9lbjom",
            "score": 1,
            "text": "Wow.",
            "title_similarity": "-0.134924",
            "sentiment_compound": 0.5859
        },
        {
            "id": "h9lbnp1",
            "score": 1,
            "text": "Long way off but once a cars are smart enough to drive themselves and communicate, lights will be unneeded.",
            "title_similarity": "0.412701",
            "sentiment_compound": 0.5499
        },
        {
            "id": "h9lc428",
            "score": 1,
            "text": "This is pretty cool but I'm just wondering if it doesn't open itself up to hacking? Do we still say hacking?",
            "title_similarity": "0.2557701",
            "sentiment_compound": 0.4784
        },
        {
            "id": "h9lc73t",
            "score": 1,
            "text": "They need to do this in Florida Tampa Bay Area. They couldn’t time a stoplight reasonably if there life depended on it. They wonder why so many people look at there phones while driving. It’s because of how long you sit a traffic lights!",
            "title_similarity": "0.59903026",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9lcsfw",
            "score": 2,
            "text": "Lmfao yeah we will see about that",
            "title_similarity": "0.0134632215",
            "sentiment_compound": 0.6908
        },
        {
            "id": "h9lcutk",
            "score": 2,
            "text": "I'm over here in a city with ancient timed lights that go red at 3am on a main road with no one in sight, ya know, because all those ghost cars gotta make it their meeting. Then you sit there for I am not kidding roughly 3-5 mins, depending on if you get out and go push the crosswalk button just to get some action going here. Then just as you think \"here comes the green\" the turning lights go and you grip the steering wheel with vice like force and scream into your airbag like Goku getting ready to go another level of super Saiyan.",
            "title_similarity": "0.6750443",
            "sentiment_compound": 0.5999
        },
        {
            "id": "h9lczgn",
            "score": 2,
            "text": "I believe Fort Worth has done this downtown to an extent. If you drive the speed limit you will hit all greens for most of the downtown area.",
            "title_similarity": "0.71270525",
            "sentiment_compound": 0.2263
        },
        {
            "id": "h9ldcqo",
            "score": 1,
            "text": "Damn even with this tech traffic still sucks",
            "title_similarity": "0.18317825",
            "sentiment_compound": -0.6369
        },
        {
            "id": "h9ldjvw",
            "score": 2,
            "text": "Hey Colorado, you see this? Worst fucking state to drive in with the worst drivers.",
            "title_similarity": "0.37192675",
            "sentiment_compound": -0.8743
        },
        {
            "id": "h9ldogc",
            "score": 1,
            "text": "My first instinct is to make a joke about how the traffic in LA is abysmal anyways but for a city that size without the same kinda robust transit system as New York I dunno what you would even do about it.",
            "title_similarity": "0.46668962",
            "sentiment_compound": 0.5041
        },
        {
            "id": "h9le0kc",
            "score": 1,
            "text": "I always wondered why big city or even small ones don't do this. Thanks LA",
            "title_similarity": "0.4674822",
            "sentiment_compound": 0.5228
        },
        {
            "id": "h9le3fz",
            "score": 1,
            "text": "Amazing. This should be the new standard. And I’m happy if my tax dollars are spent this way.",
            "title_similarity": "0.3523819",
            "sentiment_compound": 0.8176
        },
        {
            "id": "h9le4fz",
            "score": 1,
            "text": "I've come across sections of road where once you stop at 1 red light,  you will have to stop at the next 5 lights if you continue straight and do the speed limit.  Idk if it's by design or accident,  but it's super annoying.",
            "title_similarity": "0.6034472",
            "sentiment_compound": -0.0516
        },
        {
            "id": "h9le5wi",
            "score": 1,
            "text": "Please California my Texas.",
            "title_similarity": "0.24159324",
            "sentiment_compound": 0.3182
        },
        {
            "id": "h9lef36",
            "score": 1,
            "text": "Oh my god, imagine this in a grid system, amazing",
            "title_similarity": "0.29208767",
            "sentiment_compound": 0.7096
        },
        {
            "id": "h9lej0t",
            "score": 1,
            "text": "Wait you guys in the US dont have this system? I thought most US cities at least would have such a system in place.",
            "title_similarity": "0.45132434",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9letrb",
            "score": 1,
            "text": "Zurich Switzerland has this since 2012.",
            "title_similarity": "0.31678987",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9lfmc9",
            "score": 1,
            "text": "There seems to be a never ending list of U.S. infrastructure needing hardware & software updated to modern technology.",
            "title_similarity": "0.43852985",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9lfwc3",
            "score": 1,
            "text": "Instead letting people work from home for a ton more efficiency in traffic at a fraction of the cost ....",
            "title_similarity": "0.5532895",
            "sentiment_compound": 0.4201
        },
        {
            "id": "h9lfwf6",
            "score": 1,
            "text": "Maybe they should put traffic lights on the 101 to improve traffic flow?",
            "title_similarity": "0.47448963",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h9lfykj",
            "score": 2,
            "text": "California can’t get anything right. I am super skeptical that they pulled this off.",
            "title_similarity": "0.22160181",
            "sentiment_compound": 0.3818
        },
        {
            "id": "h9lg01j",
            "score": 2,
            "text": "Idk what part of LA they are talking about because it take 45 mins to go 7 miles here…",
            "title_similarity": "0.5834631",
            "sentiment_compound": -0.1027
        },
        {
            "id": "h9lg0d3",
            "score": 1,
            "text": "I wrote a program attempting to mimic real world traffic and then gave an ai control of the timing of all the lights, to see how much it could optimise the flow. Fun project.",
            "title_similarity": "0.61747783",
            "sentiment_compound": 0.7351
        },
        {
            "id": "h9lg80o",
            "score": 3,
            "text": "Decreasing standstill traffic by 16% still leaves you with standstill traffic.",
            "title_similarity": "0.63389796",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9lg9wv",
            "score": 1,
            "text": "Meanwhile in my city when I worked nights, I get hit with literally every red light on my way home.\n\nI could have a short shift and go home at 3 a.m. and there wouldn't be another person on the roads seemingly for miles, just to get caught at lights and wait for no one to cross.",
            "title_similarity": "0.60863835",
            "sentiment_compound": -0.296
        },
        {
            "id": "h9lgepc",
            "score": 1,
            "text": "Finally. \n\nI’m all for electric cars but the push for the very expensive EVs seemed hypocritical when there wasn’t any push to fix the roads they were driving on. With what Google and Facebook can do with AI and our personal data it’s catastrophic that cities have not used technology to fix traffic",
            "title_similarity": "0.5945014",
            "sentiment_compound": -0.8519
        },
        {
            "id": "h9lgfnc",
            "score": 1,
            "text": "Hi I live in Baltimore. Please help.",
            "title_similarity": "0.33812883",
            "sentiment_compound": 0.6124
        },
        {
            "id": "h9lgnkp",
            "score": 2,
            "text": "This Angelino experienced zero synced lights this morning!",
            "title_similarity": "0.3629365",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9lgp58",
            "score": 1,
            "text": "Looking at you Cleveland 🤔",
            "title_similarity": "0.17802022",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9lgwb5",
            "score": 1,
            "text": "Neat! Now do it with an entire city of self-driving cars.",
            "title_similarity": "0.5303359",
            "sentiment_compound": 0.5093
        },
        {
            "id": "h9lh5la",
            "score": 1,
            "text": "Fuck it’s about time. It amazes me all the advanced technology we posses and how inefficient traffic lights can be.",
            "title_similarity": "0.47206327",
            "sentiment_compound": 0.1779
        },
        {
            "id": "h9lha42",
            "score": 2,
            "text": "Time to put traffic lights on the 405 then.",
            "title_similarity": "0.4198295",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9lhwbi",
            "score": 1,
            "text": "Baltimore City need system like that",
            "title_similarity": "0.34432352",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h9li0tz",
            "score": 1,
            "text": "meanwhile in my town they time all the lights so it’s stop and go through every light. Drives up tax revenue on gas because everyone’s mileage plummets in stop and go traffic",
            "title_similarity": "0.74741834",
            "sentiment_compound": -0.5688
        },
        {
            "id": "h9li3l4",
            "score": 1,
            "text": "This is one of the reasons I like driving in LA compared to most other cities. Also, LA drivers know how to make left turns without left turn arrows.",
            "title_similarity": "0.5479282",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h9lidsw",
            "score": 1,
            "text": "I feel like timed lights and a grid is just better especially as cyclist but cool",
            "title_similarity": "0.35169783",
            "sentiment_compound": 0.6858
        },
        {
            "id": "h9lifu8",
            "score": 2,
            "text": "Full synchronisation doesn't necessarily mean the best outcomes though, and adaptive traffic light systems have been in operation for much longer.\n\nSCATS (Sydney Coordinated Adaptive Traffic System) is the most used system worldwide, and it was developed in the 1970s.",
            "title_similarity": "0.55084896",
            "sentiment_compound": 0.6369
        },
        {
            "id": "h9ligwd",
            "score": 1,
            "text": "🤩🤩🤩🤩😭😭😭 it's....it's beautiful!",
            "title_similarity": "-0.028595954",
            "sentiment_compound": -0.69
        },
        {
            "id": "h9lih49",
            "score": 2,
            "text": "Oregon is the best at red lighting 40 cars down from 55mph to allow 1 motorcycle to turn out into the same direction as the 40 cars were already going.  It's great for wear and tear on thr vehicles and roads, and also wasting fuel to re-accelerate back up to 55mph.",
            "title_similarity": "0.7598398",
            "sentiment_compound": 0.8176
        },
        {
            "id": "h9lii5o",
            "score": 2,
            "text": "Lol yeah right. There are so many lights in my area that are perfectly unsynchronized - like 2 intersections within a few hundred feet where the first only turns green when the second turns red.",
            "title_similarity": "0.56439984",
            "sentiment_compound": 0.8934
        },
        {
            "id": "h9liozi",
            "score": 1,
            "text": "But homeless is still a huge problem. Thank fuck for the traffic lights 16% efficiency boost though…",
            "title_similarity": "0.7269521",
            "sentiment_compound": 0.5719
        },
        {
            "id": "h9lipyz",
            "score": 1,
            "text": "I've often thought if lights had radar built in they could see when people are speeding and force them to slow down, thereby encouraging moderate speeds and improving traffic flow.",
            "title_similarity": "0.54699755",
            "sentiment_compound": 0.7351
        },
        {
            "id": "h9lit6b",
            "score": 2,
            "text": "Now what to do about the traffic.",
            "title_similarity": "0.20875797",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9livij",
            "score": 1,
            "text": "Wait why don’t all cities have this?",
            "title_similarity": "0.3052997",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9lj17q",
            "score": 1,
            "text": "Dude more cities and town should have this!",
            "title_similarity": "0.30755466",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9lj3y9",
            "score": 2,
            "text": "Really? I live in LA and the lights are shit.",
            "title_similarity": "0.3391084",
            "sentiment_compound": -0.5574
        },
        {
            "id": "h9ljejv",
            "score": 1,
            "text": "[Irvine CA has its own live realtime traffic monitoring center.](https://www.cityofirvine.org/transportation-department/signal-timing)",
            "title_similarity": "0.54276013",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9ljgy4",
            "score": 1,
            "text": "Uh, anyone driven in LA recently?",
            "title_similarity": "0.3770602",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9ljjhq",
            "score": 1,
            "text": "I live in the greater Los Angeles area and they sure don't feel synchronized when I drive to work at 4:30am in the morning, not many cars out but feel like I have to stop at every light on Hawthorne for no cars",
            "title_similarity": "0.676471",
            "sentiment_compound": 0.0129
        },
        {
            "id": "h9ljo4t",
            "score": 2,
            "text": "Still takes 2 hours to drive to work every morning",
            "title_similarity": "0.583621",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9ljozq",
            "score": 1,
            "text": "Too bad its now a 3rd world country.",
            "title_similarity": "0.2663123",
            "sentiment_compound": -0.5423
        },
        {
            "id": "h9ljp5v",
            "score": 1,
            "text": "Here I am watching a green light turn red on empty roads as I get close to an intersection",
            "title_similarity": "0.36573994",
            "sentiment_compound": -0.2023
        },
        {
            "id": "h9ljskr",
            "score": 2,
            "text": "Still fucking sucks to be driving anywhere near LA",
            "title_similarity": "0.30383906",
            "sentiment_compound": -0.4201
        },
        {
            "id": "h9ljwyy",
            "score": 1,
            "text": "So LA traffic could be even worse is what you're saying?",
            "title_similarity": "0.2548007",
            "sentiment_compound": -0.4767
        },
        {
            "id": "h9lk2cy",
            "score": 1,
            "text": "This is a 2013 article that gets its info from this NYTimes article\n\nhttps://www.nytimes.com/2013/04/02/us/to-fight-gridlock-los-angeles-synchronizes-every-red-light.html",
            "title_similarity": "0.5274073",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9lk3vu",
            "score": 1,
            "text": "And yet the city is still fucked and can take you 30 minutes to literally drive around the block in downtown.",
            "title_similarity": "0.5885732",
            "sentiment_compound": -0.8074
        },
        {
            "id": "h9lk6mq",
            "score": 1,
            "text": "Than why is the driving worse than India?",
            "title_similarity": "0.23625524",
            "sentiment_compound": -0.4767
        },
        {
            "id": "h9lk7ub",
            "score": 1,
            "text": "All yellow lights.",
            "title_similarity": "0.1687347",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9lk9yo",
            "score": 1,
            "text": "Synchronized lights in Houston when",
            "title_similarity": "0.2728858",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9lkjnd",
            "score": 1,
            "text": "Interesting. The traffic lights in my city will always turn yellow as you approach. Even late at night when no one is on the road. And then you sit there wait for the light change for at least 60-90 seconds.",
            "title_similarity": "0.68684447",
            "sentiment_compound": 0.128
        },
        {
            "id": "h9lklyr",
            "score": 1,
            "text": "We all watched the Italian job like twenty years ago, did they finally unfuck Scotty Evils sweet hack?",
            "title_similarity": "0.5296329",
            "sentiment_compound": 0.2023
        },
        {
            "id": "h9lkog5",
            "score": 1,
            "text": "And it's still fucking horrible. I love LA, but the traffic would make the most sane person lose their mind.",
            "title_similarity": "0.44108057",
            "sentiment_compound": -0.5589
        },
        {
            "id": "h9lkx2x",
            "score": 1,
            "text": "Our cigy has that covered. We have a total of one traffic light.",
            "title_similarity": "0.43070227",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9lkxz8",
            "score": 1,
            "text": "I drive an hour up and down Beverly Blvd every day. This is bullshit. I’ve never seen lights more inefficient than these. It’s green-red-green-red etc non stop. Often when there’s no one even there. It’s infuriating.",
            "title_similarity": "0.63058734",
            "sentiment_compound": -0.891
        },
        {
            "id": "h9lkymf",
            "score": 1,
            "text": "well it didn't work because traffic is still shit in LA",
            "title_similarity": "0.2544942",
            "sentiment_compound": -0.3612
        },
        {
            "id": "h9ll4xt",
            "score": 1,
            "text": "misleading headline:\n\n>The system limits congestion by up to 16%\n\nis never mentioned.\n\nwhat is actually in the article:\n\n>The city estimates that the system will increase travel speeds by 16 percent and reduce travel time by 12 percent.\n\nso if you were driving 10mph on the 405 you can now go almost 12 mph. that's some party-time there.\n\nif it took you an hour to get to work, now it takes about 50 minutes.\n\nthe article doesn't mention a cost. i would estimate in the millions of dollars. just about the most complete waste of time and money i've ever heard of.",
            "title_similarity": "0.7784109",
            "sentiment_compound": -0.539
        },
        {
            "id": "h9llavg",
            "score": 1,
            "text": "Today you‘ll learn that in some European cities like my hometown traffic lights get unsynced on purpose. This is because people should find using one of the 6+ subway lines, 60+ bus lines and 40+ tramway lines more attractive than driving your own car through a city of 2 million people.\nAnd i find it‘s the right thing.",
            "title_similarity": "0.62184036",
            "sentiment_compound": 0.6901
        },
        {
            "id": "h9llemf",
            "score": 1,
            "text": "After the first sentence i definately thought it was all the lights are green at the same time. And started thinking why this would be something someone would want?",
            "title_similarity": "0.35119116",
            "sentiment_compound": 0.1531
        },
        {
            "id": "h9llipv",
            "score": 1,
            "text": "I was under the impression such systems are already in place in most big cities like London?",
            "title_similarity": "0.46652472",
            "sentiment_compound": 0.5667
        },
        {
            "id": "h9lloi1",
            "score": 1,
            "text": "And yet you still sit at a light for two minutes. And if you don't speed to 55 you ain't making the next light even if you're at the front of the line on a fresh green.",
            "title_similarity": "0.5667181",
            "sentiment_compound": 0.3182
        },
        {
            "id": "h9llrv6",
            "score": 1,
            "text": "A whole 16%. HOT DAMN!",
            "title_similarity": "0.4646637",
            "sentiment_compound": -0.5754
        },
        {
            "id": "h9llvrd",
            "score": 1,
            "text": "Bullshit",
            "title_similarity": "-0.15544352",
            "sentiment_compound": -0.5859
        },
        {
            "id": "h9llztg",
            "score": 1,
            "text": "Nice idea. Doesn't work well enough.",
            "title_similarity": "-0.018528737",
            "sentiment_compound": 0.2467
        },
        {
            "id": "h9lm5pt",
            "score": 1,
            "text": "I coulda sworn it said “dramatically reducing idiot time”.",
            "title_similarity": "0.42773747",
            "sentiment_compound": -0.5106
        },
        {
            "id": "h9lmcx0",
            "score": 1,
            "text": "I live Los Angeles and can confirm, all of our traffic lights still fucking suck.",
            "title_similarity": "0.4802987",
            "sentiment_compound": -0.4927
        },
        {
            "id": "h9lmixb",
            "score": 1,
            "text": "I’ve actually been dreaming of this moment for the longest time lmao",
            "title_similarity": "0.32066113",
            "sentiment_compound": 0.5994
        },
        {
            "id": "h9lmn9w",
            "score": 1,
            "text": "This could be Jimbo's new pet project right after be fixes his choochoo train.",
            "title_similarity": "0.3724448",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9lmurk",
            "score": 1,
            "text": "Until the system gets hacked and screeches to a grinding halt.",
            "title_similarity": "0.25761816",
            "sentiment_compound": -0.4019
        },
        {
            "id": "h9lmv1f",
            "score": 1,
            "text": "Then why the hell does it take me 40 minutes to drive 5 miles.",
            "title_similarity": "0.56608623",
            "sentiment_compound": -0.6808
        },
        {
            "id": "h9lmwnm",
            "score": 1,
            "text": "Fucking finally, this should have started in every city years ago.",
            "title_similarity": "0.512569",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9lmybk",
            "score": 1,
            "text": "This article is complete and total bullshit. BULLSHIT.\n\nIf anything, the traffic lights in L.A. are deliberately unsynchronized.\n\nIf I was a paranoid conspiracy type of guy, I would believe that a group of oil executives found the person responsible for the synchronization of traffic lights, and bribed them to make sure that you couldn't drive more than a block or two without having to stop for a red light, thus maximizing gas use in city driving. Nothing eats gas like stop and go driving.\n\nBefore you roll your eyes, remember that it was an oil company that bought up L.A.'s extensive electric trolley system, then immediately destroyed all the cars and tore up all the tracks to impede the adoption of public transit. \n\nThose people are fucking greedy planet destroying animals.",
            "title_similarity": "0.5916239",
            "sentiment_compound": -0.9775
        },
        {
            "id": "h9ln3wy",
            "score": 1,
            "text": "This hardly makes a dent in how bad the traffic is. If they really wanted to fix it they’d build some public transportation. LA used to be the streetcar capital of the world in the 20s, but when cars took over they got rid of them and now it’s a total nightmare",
            "title_similarity": "0.597396",
            "sentiment_compound": -0.3071
        },
        {
            "id": "h9lnvgl",
            "score": 1,
            "text": "Yeah and it’s still fucking shit. Replace them with roundabouts and we might actually get somewhere but the drivers are too dumb to understand them",
            "title_similarity": "0.35300866",
            "sentiment_compound": -0.7428
        },
        {
            "id": "h9lo0bo",
            "score": 1,
            "text": "This is great but I really hope security is baked in or ww3 is going to be fun",
            "title_similarity": "0.24424008",
            "sentiment_compound": 0.9414
        },
        {
            "id": "h9lo977",
            "score": 1,
            "text": "First had experience no they don't.people that haven't experienced LA/NY traffic don't know real traffic (inside the US)",
            "title_similarity": "0.42102838",
            "sentiment_compound": -0.296
        },
        {
            "id": "h9loae0",
            "score": 1,
            "text": "Denver needs to get hip to this",
            "title_similarity": "0.17286792",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9lorlx",
            "score": 1,
            "text": "This is exactly how Skynet started, don’t forget",
            "title_similarity": "0.34706634",
            "sentiment_compound": -0.2263
        },
        {
            "id": "h9lp3b6",
            "score": 1,
            "text": "Reading synchronize makes me think all the lights turning green or red at the same time, but I would guess it's more of a cascade effect? I live in NYC and I love driving after midnight, the streets are empty and the lights turn green about 2 to 3 seconds one after the other, I've gone from around 14th street to 125th street without stopping",
            "title_similarity": "0.7288661",
            "sentiment_compound": 0.7404
        },
        {
            "id": "h9lp3r1",
            "score": 1,
            "text": "If I remember correctly it took them something like 20+ years to get it worked out.",
            "title_similarity": "0.3431697",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h9lp7fq",
            "score": 1,
            "text": "Then why am i here stuck in traffic!?!?",
            "title_similarity": "0.20860893",
            "sentiment_compound": -0.4486
        },
        {
            "id": "h9lpfgj",
            "score": 1,
            "text": "Do they have no crosswalk buttons in LA or are they still there but just as a placebo?",
            "title_similarity": "0.33881634",
            "sentiment_compound": -0.1531
        },
        {
            "id": "h9lq2qp",
            "score": 1,
            "text": "Every country that's been using SCATS for 30 years begs to differ",
            "title_similarity": "0.46401167",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9lqelt",
            "score": 2,
            "text": "Too bad L.A. drivers have paws instead of hands. Fn worst drivers ever.🤣",
            "title_similarity": "0.3477798",
            "sentiment_compound": -0.6597
        },
        {
            "id": "h9lqon0",
            "score": 1,
            "text": "The system doesn’t matter when the people using it includes brain dead idiots.",
            "title_similarity": "0.22725889",
            "sentiment_compound": -0.6369
        },
        {
            "id": "h9lqs32",
            "score": 1,
            "text": "This is the real big oil conspiracy. Unsynching all lights so we waste more gas. Wouldn't surprise me if some high level transportation officials suddenly 'disappeared. /s",
            "title_similarity": "0.47945446",
            "sentiment_compound": -0.8575
        },
        {
            "id": "h9lqxyg",
            "score": 1,
            "text": "I'm fairly sure here in the UK someone took an oil company back hander to perfectly fuck the lights up to ensure maximum waiting and petrol burning.",
            "title_similarity": "0.5026692",
            "sentiment_compound": 0.6808
        },
        {
            "id": "h9lr885",
            "score": 1,
            "text": "Should put roundabouts in",
            "title_similarity": "0.21873228",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9lrfmk",
            "score": 1,
            "text": "And traffic still sucks.",
            "title_similarity": "0.078693226",
            "sentiment_compound": -0.3612
        },
        {
            "id": "h9lrizs",
            "score": 1,
            "text": "News from 2013?",
            "title_similarity": "0.14605384",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9lrr0k",
            "score": 1,
            "text": "Now if only we could get people moving quicker once the light turns green.  Each person not paying attention/having slow reflexes/braking unnecessarily during acceleration causes loads of time loss.  I get irrationally angry at this, often causes me to have to wait through another light cycle.  In the far future when self driving cars can synchronize and all start moving almost immediately, this wait time will be drastically reduced.",
            "title_similarity": "0.56532437",
            "sentiment_compound": -0.802
        },
        {
            "id": "h9lrr9w",
            "score": 1,
            "text": "I would be willing to move and pay whatever to live there just to experience this.  The traffic lights where I live are a complete shitshow and I want to see how a city can make traffic work better.",
            "title_similarity": "0.4993055",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h9ls1bq",
            "score": 2,
            "text": "This is 8 years old. I’m calling BS. LA traffic is as bad as it ever was.",
            "title_similarity": "0.5243938",
            "sentiment_compound": -0.5423
        },
        {
            "id": "h9ls4xy",
            "score": 2,
            "text": "I prefer the complete annihilation of the majority of traffic lights. I also possess just enough IQ points to successfully navigate roundabouts without issue.",
            "title_similarity": "0.54748034",
            "sentiment_compound": 0.4939
        },
        {
            "id": "h9ls70u",
            "score": 1,
            "text": "If only the Pacific northwest had this kind of system. Any system really, something other than \"whatever\".",
            "title_similarity": "0.20612228",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9lsafe",
            "score": 1,
            "text": "Sydney Aus has been fiddling with this since the 70's.\n\nhttps://www.scats.nsw.gov.au/\n\nI wonder if LA is using this system. I didn't know it was being sold internationally - the first I knew of it (and last I looked into it) was a school excursion to their Sydney HQ in 1991, even then I thought \"SCATS\" was a terrible acronym.",
            "title_similarity": "0.48047665",
            "sentiment_compound": -0.4767
        },
        {
            "id": "h9lsgfs",
            "score": 1,
            "text": "#eliminateleftturns",
            "title_similarity": "0.15687811",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9lsvvc",
            "score": 1,
            "text": "My most recent trip this last week gave me a glimpse of this. There were numerous crosswalks without buttons to cross, but I didn’t have to wait long to get a chance for this lights to change. It seemed to work where I was.",
            "title_similarity": "0.62569594",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h9lswqm",
            "score": 1,
            "text": "I might be wrong about this but don't most people consider LA traffic to be the worst in the country?",
            "title_similarity": "0.4824214",
            "sentiment_compound": -0.8271
        },
        {
            "id": "h9lsyie",
            "score": 2,
            "text": "What? Traffic has only gotten worse here…. When was this supposed improvement.  Someone is making Millions I bet while we still\nHave shit traffic",
            "title_similarity": "0.5388335",
            "sentiment_compound": -0.5719
        },
        {
            "id": "h9lt0ab",
            "score": 1,
            "text": "With all of the technology we have, having \"smart\" traffic signals is long overdue.  There is so much that could be used in deep learning and BI that traffic could be drastically altered.  This could be used for emergency vehicles and even public transportation too.",
            "title_similarity": "0.61347616",
            "sentiment_compound": 0.0258
        },
        {
            "id": "h9ltk4r",
            "score": 1,
            "text": "A bit like the Seven Bridges of Königsberg problem X 500, good luck with that dynamic ongoing mathematical conundrum!",
            "title_similarity": "0.43764576",
            "sentiment_compound": 0.8221
        },
        {
            "id": "h9lu9vq",
            "score": 1,
            "text": "I love Chicago!! For years, they have synced their traffic lights with construction. Every time a traffic light notices the flow of traffic getting better, it automatically contacts the construction company to come and set up barriers to slow traffic once again.",
            "title_similarity": "0.70619226",
            "sentiment_compound": 0.8264
        },
        {
            "id": "h9lus5k",
            "score": 1,
            "text": "Lot of good it does",
            "title_similarity": "0.059762623",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h9luxkt",
            "score": 1,
            "text": "This is fascinating",
            "title_similarity": "-0.06795676",
            "sentiment_compound": 0.5423
        },
        {
            "id": "h9lvskk",
            "score": 1,
            "text": "I live just outside Los Angeles and one of the very few things about about the city that I truly do appreciate is relatively good traffic light timings. \n\nIt's a breath of fresh air for the city, that is, until you open your eyes and pay attention.",
            "title_similarity": "0.45277035",
            "sentiment_compound": 0.8555
        },
        {
            "id": "h9lvtkz",
            "score": 1,
            "text": "I thought there were cities in the Netherlands that already had this.\n\nEdit: can't find any evidence of a whole city. Must have been a corporate glitter article i read that made a proof-of-concept sound like the dawn of a new era.",
            "title_similarity": "0.47408694",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h9lw0ua",
            "score": 1,
            "text": "Is that why there's no traffic in LA?",
            "title_similarity": "0.25856376",
            "sentiment_compound": -0.296
        },
        {
            "id": "h9lwfdc",
            "score": 1,
            "text": "I live in LA - if the traffic here is optimized, then the bar for what we consider \"optimization\" is set really fucking low. It can easily take 45-60 minutes to travel 10 miles during peak traffic times (morning and afternoon rushes).",
            "title_similarity": "0.6993969",
            "sentiment_compound": 0.6518
        },
        {
            "id": "h9lwt7f",
            "score": 1,
            "text": "*laughs on the 101 for 2 hrs to go 10 miles.",
            "title_similarity": "0.6311387",
            "sentiment_compound": 0.4939
        },
        {
            "id": "h9lwzcb",
            "score": 1,
            "text": "Why not do like New York City? Clog up the traffic deliberately and then charge people to drive in clogged traffic.",
            "title_similarity": "0.5570642",
            "sentiment_compound": -0.2755
        },
        {
            "id": "h9lx6sr",
            "score": 1,
            "text": "Hard to believe this hasn’t happened before",
            "title_similarity": "0.04679896",
            "sentiment_compound": -0.1027
        },
        {
            "id": "h9lxibk",
            "score": 1,
            "text": "When the fuck did they do this shit? Definitely wasn’t going on when I lived there in 2008-09",
            "title_similarity": "0.29222745",
            "sentiment_compound": -0.7227
        },
        {
            "id": "h9lxv5l",
            "score": 1,
            "text": "We’ll you kind of fucking have to with 20 million fucking people in one shitbox",
            "title_similarity": "0.42419642",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9ly72j",
            "score": 1,
            "text": "Mexico city has been doing it since the 80s. They post a synch speed to keep the flow. You speed and you hit a red light white in 3 or 4 lights. \nFollowing the posted light I could drive for 6- 7 miles without stop or slow down",
            "title_similarity": "0.7726697",
            "sentiment_compound": 0.2235
        },
        {
            "id": "h9lydu4",
            "score": 1,
            "text": "If you want green lights just drive where I'm not going.",
            "title_similarity": "0.25995493",
            "sentiment_compound": 0.0772
        },
        {
            "id": "h9lyzwv",
            "score": 1,
            "text": "This is rubbish.  I live in LA and am constantly infuriated at the fact that I’ll be at a red light and there will be zero cars driving through the intersection.  Like why did my light turn red (on the main blvd)… when there are no cars that needed a green light on the cross streets? Happens all the fn time.",
            "title_similarity": "0.56295115",
            "sentiment_compound": -0.5719
        },
        {
            "id": "h9lzgvv",
            "score": 1,
            "text": "That's what the fuck im talking about!!!!! Fuck sitting at a red light at 3am with zero cars in sight.",
            "title_similarity": "0.47392017",
            "sentiment_compound": -0.8469
        },
        {
            "id": "h9lzmbg",
            "score": 1,
            "text": "Pretty sure chicago has done the exact OPPOSITE to this-\n\nAnd they just changed the speed cameras to ticket people going 6mph over the speed limit- gotta make up for all their financial fuck ups somewhere- why not hit the tax payer once again…",
            "title_similarity": "0.67504156",
            "sentiment_compound": 0.25
        },
        {
            "id": "h9lzplc",
            "score": 1,
            "text": "Austin has the same system. I know because one of our friends helped build it.  He has been to Austin multiple times to work on it. The city won't leave it alone and let it do its job. They want to correct and alter it. Idiots.",
            "title_similarity": "0.57427216",
            "sentiment_compound": 0.6472
        },
        {
            "id": "h9lzudx",
            "score": 1,
            "text": "LA has notoriously bad traffic",
            "title_similarity": "0.26204437",
            "sentiment_compound": -0.5423
        },
        {
            "id": "h9m0oli",
            "score": 1,
            "text": "ok, now let’s add some traffic lights on 405 please/s",
            "title_similarity": "0.43104345",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9m0wsd",
            "score": 2,
            "text": "Im pretty sure LA is one of the worst places to drive",
            "title_similarity": "0.29512393",
            "sentiment_compound": 0.1027
        },
        {
            "id": "h9m1qoc",
            "score": 2,
            "text": "Nice. 4 minutes saved on my 2 hours commute to work 8 miles away.",
            "title_similarity": "0.65638167",
            "sentiment_compound": 0.6808
        },
        {
            "id": "h9m2sab",
            "score": 1,
            "text": "Doubt",
            "title_similarity": "-0.17783733",
            "sentiment_compound": -0.3612
        },
        {
            "id": "h9m4446",
            "score": 1,
            "text": "Actually, San Diego did that a long time ago. They posted signs on surface streets, letting drivers know that the traffic signals were set at a specific speed. No computers back then, but it worked. Then they de-synced them later.",
            "title_similarity": "0.6605607",
            "sentiment_compound": -0.1531
        },
        {
            "id": "h9m44t4",
            "score": 1,
            "text": "Meanwhile Amsterdam has real time traffic monitoring of private vehicles, public buses and trams, cyclists and pedestrians, and traffic lights change based upon which allows the greatest number of people to proceed.",
            "title_similarity": "0.6106173",
            "sentiment_compound": 0.6705
        },
        {
            "id": "h9m4su3",
            "score": 1,
            "text": "Real life version of the game \"Mini Motorways\"!",
            "title_similarity": "0.42437488",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9m5662",
            "score": 1,
            "text": "Great, now do the freeways.",
            "title_similarity": "0.37499833",
            "sentiment_compound": 0.6249
        },
        {
            "id": "h9m5h5t",
            "score": 1,
            "text": "Can I have this in Cities Skylines?",
            "title_similarity": "0.22957394",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9m5vy8",
            "score": 1,
            "text": "I wonder what the impact is to the average driver and how much this cost. I have a feeling this was a really expensive system with marginal benefits. But maybe it was cheaper and more likely to happen politically than setting up a working transit system.",
            "title_similarity": "0.416524",
            "sentiment_compound": 0.2272
        },
        {
            "id": "h9m6ew6",
            "score": 1,
            "text": "The City of Toronto has had a traffic management system for about 20 years that is based on real time traffic volume and flow. It is driven by an algorithm called the Split Cycle Offset and Optimization Technique (SCOOT). In essence the system is adaptive in that it can monitor traffic flow and volume and within an established network, it can modify traffic signal timings to shorten or lengthen the duration of signals. \n\nFor example, a baseball game ends and a lot of traffic is dumped into the grid. Along the major arteries that the traffic moves, SCOOT will lengthen green light times to get more cars through. The system uses sensors at each intersection to feed data to the system that, in turn, will modify traffic signals. The system reverts to the normal traffic signal operation once it detects that the increased traffic flow has diminished.",
            "title_similarity": "0.777093",
            "sentiment_compound": 0.25
        },
        {
            "id": "h9m6n2h",
            "score": 3,
            "text": "As a LA native, locals can drive. It's the implants who can't drive for shit. LA streets and freeways can be confusing and congested, implants freak out and do dumb shit. \n\nWaze has made it worst because all of the side streets and \"secret\" routes got exposed. Now my street has 5x the cars driving down it than 10 years ago because people know it's a short cut.",
            "title_similarity": "0.6850519",
            "sentiment_compound": -0.9357
        },
        {
            "id": "h9m6n4b",
            "score": 2,
            "text": "Roundabouts reduce traffic congestion too for one easy cost.   No electricity required.",
            "title_similarity": "0.4469001",
            "sentiment_compound": 0.1779
        },
        {
            "id": "h9m7zmf",
            "score": 1,
            "text": "“Dramatically reducing idle time”\n\nYou’ve never driven in LA I take it.",
            "title_similarity": "0.5509846",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9m837v",
            "score": 1,
            "text": "And in my metropolis, the department responsible for traffic lights spent millions to replace them with smart lights.\n\nThey’re not synced. They just have digital clocks displaying how long the green/amber/red lights are lol. The division head handling research was fuming over the project when I asked her about it for my undergrad thesis. Fat rip",
            "title_similarity": "0.7149482",
            "sentiment_compound": 0.4767
        },
        {
            "id": "h9m8az9",
            "score": 1,
            "text": "Well, I've got a plan and I'm going to need 3 mini coopers and a tour bus. Who's in?",
            "title_similarity": "0.43160832",
            "sentiment_compound": 0.2732
        },
        {
            "id": "h9m9meg",
            "score": 1,
            "text": "Every 4 weeks I travel through downtown LA (DTLA). I hope this works. Also I'd love to see this troughout the LA metropolitan area where traffic is equally bad.",
            "title_similarity": "0.7796824",
            "sentiment_compound": 0.5574
        },
        {
            "id": "h9m9z42",
            "score": 1,
            "text": "No",
            "title_similarity": "-0.19416884",
            "sentiment_compound": -0.296
        },
        {
            "id": "h9ma7sc",
            "score": 1,
            "text": "Because when you think of places without traffic you think of Los Angeles",
            "title_similarity": "0.27555496",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9mb7y7",
            "score": 1,
            "text": "I've been through plenty of towns that have synced all their traffic lights (it isn't hard if you have only a few).",
            "title_similarity": "0.70332485",
            "sentiment_compound": 0.0762
        },
        {
            "id": "h9mbt0s",
            "score": 1,
            "text": "Interesting. That must be why it is so easy to drive around in LA.",
            "title_similarity": "0.37159723",
            "sentiment_compound": 0.7537
        },
        {
            "id": "h9mc4vz",
            "score": 1,
            "text": "Awesome!\n\nI'm still not going to move there though.",
            "title_similarity": "0.034459457",
            "sentiment_compound": 0.6588
        },
        {
            "id": "h9mccja",
            "score": 1,
            "text": "Wow. I wonder if all the homeless appreciate this amazing feat",
            "title_similarity": "0.40435356",
            "sentiment_compound": 0.9001
        },
        {
            "id": "h9mdn4g",
            "score": 1,
            "text": "Now imagine if autonomous cars were fully fleged out and fully adopted. We wouldn't even need stop lights. Cars on streets could flow like blood through veins.",
            "title_similarity": "0.6004802",
            "sentiment_compound": 0.5248
        },
        {
            "id": "h9mdnwz",
            "score": 2,
            "text": "I live in one of the first countries to sync their roundabouts.",
            "title_similarity": "0.45250124",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9mdqlz",
            "score": 1,
            "text": "Can we please have some real public transport now ffs I’m gonna kms in traffic going to work",
            "title_similarity": "0.50671107",
            "sentiment_compound": -0.3612
        },
        {
            "id": "h9mdryn",
            "score": 1,
            "text": "Yeah right.",
            "title_similarity": "-0.14692055",
            "sentiment_compound": 0.296
        },
        {
            "id": "h9mdv0s",
            "score": 1,
            "text": "First in the world? How is this different to the SCATS system in Australia?",
            "title_similarity": "0.1662889",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9mdx7a",
            "score": 1,
            "text": "Coulda fooled me.",
            "title_similarity": "0.016795173",
            "sentiment_compound": -0.3818
        },
        {
            "id": "h9mefoi",
            "score": 1,
            "text": "469 miles? Nice",
            "title_similarity": "0.23202345",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h9meo1b",
            "score": 1,
            "text": "This was back in 2013..",
            "title_similarity": "0.1337826",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9mf1xd",
            "score": 1,
            "text": "I don't think that's a goal for my town. I'm guessing the opposite.",
            "title_similarity": "0.08311367",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9mflne",
            "score": 1,
            "text": "And yet it somehow doesn't apply to late model Mercedes drivers. They're a menace I tell ya.",
            "title_similarity": "0.3534401",
            "sentiment_compound": -0.4939
        },
        {
            "id": "h9mfni1",
            "score": 1,
            "text": "I don’t fuckin believe this for a second",
            "title_similarity": "-0.005639558",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9mfyw6",
            "score": 1,
            "text": "Round  A bouts are still better",
            "title_similarity": "0.20749004",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h9mg8le",
            "score": 1,
            "text": "I called 311 here in LA once to report an out of sync traffic light, and the phone rep told me that the staff can *log into the traffic lights remotely* and troubleshoot. I thought that was so cool.",
            "title_similarity": "0.6815281",
            "sentiment_compound": 0.5847
        },
        {
            "id": "h9mh5bu",
            "score": 1,
            "text": "And yet I can't get a left hand turn signal in Northridge",
            "title_similarity": "0.18028595",
            "sentiment_compound": 0.4939
        },
        {
            "id": "h9mhbkm",
            "score": 1,
            "text": "Anyone living in LA knows this is crap",
            "title_similarity": "0.2645337",
            "sentiment_compound": -0.3818
        },
        {
            "id": "h9mhmn6",
            "score": 1,
            "text": "Arnold: “Skynet became self aware August 19th, 2021 at 2100 hours.”",
            "title_similarity": "0.35813034",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9mi0u6",
            "score": 1,
            "text": "If this is true why does everyone always say LA traffic is hell? 🤔",
            "title_similarity": "0.4146919",
            "sentiment_compound": -0.4215
        },
        {
            "id": "h9mi4up",
            "score": 1,
            "text": "This must be why we always hear how great traffic in LA is /s",
            "title_similarity": "0.4599678",
            "sentiment_compound": 0.6249
        },
        {
            "id": "h9mi9w0",
            "score": 1,
            "text": "I can attest and I love that my two main cross streets (in LA County) I know exactly where and how to drive over the sensor so that I can slow down just enough for it to turn green perfectly when I get there lol. & it *almost* feels wrong how PERFECT it works every. damn. time. Lol",
            "title_similarity": "0.6599119",
            "sentiment_compound": 0.9314
        },
        {
            "id": "h9micoj",
            "score": 1,
            "text": "And traffic there still fucking sucks.",
            "title_similarity": "0.1030058",
            "sentiment_compound": -0.4201
        },
        {
            "id": "h9midjr",
            "score": 1,
            "text": "Thank god",
            "title_similarity": "-0.018533973",
            "sentiment_compound": 0.5574
        },
        {
            "id": "h9mih2z",
            "score": 1,
            "text": "Toronto- yellow, yellow, u need another yellow ? We will sync it for you",
            "title_similarity": "0.34142926",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9miln9",
            "score": 1,
            "text": "Yeah it don’t work",
            "title_similarity": "-0.16068386",
            "sentiment_compound": 0.296
        },
        {
            "id": "h9miskp",
            "score": 1,
            "text": "Yet…they had Typhus in City Hall.    \nPriorities.",
            "title_similarity": "0.32171673",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9mivyt",
            "score": 1,
            "text": "Reducing congestion and idling time also cuts down on pollution. Sometimes it effective management of the thing already in place that can help.",
            "title_similarity": "0.40951368",
            "sentiment_compound": 0.5574
        },
        {
            "id": "h9miwg7",
            "score": 1,
            "text": "Bullshit. La Cieniga and Fairfax",
            "title_similarity": "0.0015259087",
            "sentiment_compound": -0.5859
        },
        {
            "id": "h9mjc05",
            "score": 1,
            "text": "I have no idea what \"The system limits congestion by up to 16%\" means. The article says that \"the system will increase travel speeds by 16 percent\" so I have to guess that's what that means.",
            "title_similarity": "0.7134898",
            "sentiment_compound": 0.0258
        },
        {
            "id": "h9mjf4a",
            "score": 1,
            "text": "This is a good start preventing climate change.",
            "title_similarity": "0.26420605",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h9mjhkr",
            "score": 1,
            "text": "DiDi in China has been doing this for the Chinese government for years... who ever wrote this is basically ignorant.",
            "title_similarity": "0.5035607",
            "sentiment_compound": -0.2732
        },
        {
            "id": "h9mjmxl",
            "score": 1,
            "text": "LA reduced idling time? Who knew? lol...",
            "title_similarity": "0.1756941",
            "sentiment_compound": 0.4871
        },
        {
            "id": "h9mjo6y",
            "score": 1,
            "text": "My city just adjusted arms to make it so that you can't make two lights in a row",
            "title_similarity": "0.5026938",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9mk42e",
            "score": 1,
            "text": "And thus skynet was born...",
            "title_similarity": "0.20701316",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9mlchz",
            "score": 1,
            "text": "Meanwhile, in Düsseldorf, you can see on your car info display how fast you kust drive to get the next traffic light in green.\n\nhttps://www.automobil-industrie.vogel.de/gruene-welle-ampelassistent-in-zweiter-deutscher-stadt-verfuegbar-a-830381/",
            "title_similarity": "0.6081563",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9mlxm9",
            "score": 1,
            "text": "but also less cars and more public transportation though",
            "title_similarity": "0.17184535",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9mmd88",
            "score": 1,
            "text": "It's easy to sync when every light on a major road is by default red for the main traffic and green for some side street.",
            "title_similarity": "0.5471209",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h9mmjiu",
            "score": 1,
            "text": "What does \"major city\" mean? Pretty sure many cities in China, Russia have already done that.",
            "title_similarity": "0.5743729",
            "sentiment_compound": 0.6969
        },
        {
            "id": "h9mmq4r",
            "score": 1,
            "text": "This title seems a bit scammy. It's the first \"major city\" to do this. So there are other cities that have done this?",
            "title_similarity": "0.42720026",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9mmy2g",
            "score": 1,
            "text": "If you’ve ever driven in Los Angeles, you’d know they need it. I wonder if Atlanta has anything like this too?",
            "title_similarity": "0.51672137",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h9mnzzx",
            "score": 1,
            "text": "Yet STILL, the Metro does not get signal priority because they seemingly can’t figure it out in the year 2021",
            "title_similarity": "0.2581249",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9mo6op",
            "score": 1,
            "text": "The whole of the netherlands has these lights since ever. And they are perfectly maintaned and timed.",
            "title_similarity": "0.39232135",
            "sentiment_compound": 0.6369
        },
        {
            "id": "h9mpuwp",
            "score": 1,
            "text": "I've never seen this in LA",
            "title_similarity": "0.13953693",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9mqctm",
            "score": 1,
            "text": "Then why tf is traffic so awful",
            "title_similarity": "0.18135151",
            "sentiment_compound": -0.5949
        },
        {
            "id": "h9mqjiz",
            "score": 1,
            "text": "This has to be a fake article. As someone who lived in nyc and now la, the lights in la suck and absolutely do not sync up.",
            "title_similarity": "0.298168",
            "sentiment_compound": -0.7184
        },
        {
            "id": "h9mqzud",
            "score": 1,
            "text": "You mean LA traffic could be worse?",
            "title_similarity": "0.1707773",
            "sentiment_compound": -0.4767
        },
        {
            "id": "h9mr09o",
            "score": 1,
            "text": "Somehow, it feels like Reno, NV had them all synchronized to accomplish the opposite...",
            "title_similarity": "0.2636462",
            "sentiment_compound": 0.6486
        },
        {
            "id": "h9mr12z",
            "score": 1,
            "text": "Meanwhile, there's a traffic light I have to go through to get to work that's timed. Red light is 8 minutes, yellow is 3 seconds, green is 5 seconds.",
            "title_similarity": "0.7057045",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9mr7qy",
            "score": 1,
            "text": "Reduced by 16%? That's great! Now it's just 1 hr and 18 minutes of traffic for my morning commute!",
            "title_similarity": "0.73141146",
            "sentiment_compound": 0.6892
        },
        {
            "id": "h9mr834",
            "score": 1,
            "text": "Then why the fuck does it still take 3 hours just to drive through LA!???",
            "title_similarity": "0.58510786",
            "sentiment_compound": -0.6522
        },
        {
            "id": "h9mrjrb",
            "score": 1,
            "text": "They also operate the lights manually for events like the Oscars.",
            "title_similarity": "0.51220894",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h9msl97",
            "score": 1,
            "text": "Now if the city can figure out how to have a delayed green light so I can turn left that would be amazing.",
            "title_similarity": "0.4295243",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h9mu9xv",
            "score": 1,
            "text": "Meanwhile in Las Vegas, every goddamn red light takes five minutes",
            "title_similarity": "0.58085704",
            "sentiment_compound": -0.4767
        },
        {
            "id": "h9mva61",
            "score": 1,
            "text": "I clicked for the pic...",
            "title_similarity": "0.16503115",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9mvwml",
            "score": 1,
            "text": "I mean if there’s one city that needs that, then it’s LA lol",
            "title_similarity": "0.28196204",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h9mw2i7",
            "score": 1,
            "text": "And what was the cost for this?",
            "title_similarity": "-0.068387225",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9mwlm3",
            "score": 1,
            "text": "Good on LA. That's one of the few things they actually do well.  For the rest of the story, read any books written by Mike Davis.",
            "title_similarity": "0.42415434",
            "sentiment_compound": 0.6124
        },
        {
            "id": "h9mwn00",
            "score": 1,
            "text": "London says hi.",
            "title_similarity": "0.043088477",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9mwq16",
            "score": 1,
            "text": "now imagine how much worse LA traffic would be if the lights WERENT synced",
            "title_similarity": "0.41016337",
            "sentiment_compound": -0.4767
        },
        {
            "id": "h9mxg7i",
            "score": 1,
            "text": "If only they didn’t have majority red turn arrows.",
            "title_similarity": "0.371566",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9mxluv",
            "score": 1,
            "text": "As a frustrated driver of roads author this, I've been wanting to start a company that implements this for years, but have no idea where to start.",
            "title_similarity": "0.40100968",
            "sentiment_compound": -0.4215
        },
        {
            "id": "h9my1e5",
            "score": 1,
            "text": "I live in LA and it hasn’t made a bit of difference",
            "title_similarity": "0.2377288",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9myc0l",
            "score": 1,
            "text": "I thought traffic lights already did this",
            "title_similarity": "0.3500799",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9myida",
            "score": 1,
            "text": "this will also reduce traffic related polution and noise somewhat.\n\nahm...\n\nTHE TRAFFIC MUST FLOW!!! ;)",
            "title_similarity": "0.35510066",
            "sentiment_compound": 0.4168
        },
        {
            "id": "h9mz3s6",
            "score": 1,
            "text": "Instead of all of this, just improve the public transport",
            "title_similarity": "0.32671037",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h9n00xd",
            "score": 1,
            "text": "We are all still letting two cars turn left on red, right guys?",
            "title_similarity": "0.40274024",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9n07is",
            "score": 1,
            "text": "Here in Vienna the city officials actually want traffic so people use more public transport",
            "title_similarity": "0.49869275",
            "sentiment_compound": 0.0772
        },
        {
            "id": "h9n3hmh",
            "score": 1,
            "text": "Interesting, however the technological advencement is it always the solution to an issue?  \nThe long term solution to traffic congestion is it not to invest in the territories with the fewest jobs and services to promote a more equitable distribution of the population at a time, citywide and also at the scale of the state and the country ?  \nA national planning policy to promote secondary towns and rural areas and not to always make the globalized city the panacea.  \n\rJust because a city is improved by technology does not mean that it is a \"smart city\".",
            "title_similarity": "0.5326917",
            "sentiment_compound": 0.949
        },
        {
            "id": "h9n3ojy",
            "score": 1,
            "text": "I synced all my traffic lights in mini motorways by never using them. Reduced traffic by 85% and removed road rage by 70%",
            "title_similarity": "0.78357905",
            "sentiment_compound": -0.5574
        },
        {
            "id": "h9n4340",
            "score": 1,
            "text": "I hope some hackers won't find this interesting.",
            "title_similarity": "0.1334718",
            "sentiment_compound": 0.7206
        },
        {
            "id": "h9n5s5l",
            "score": 1,
            "text": "Florida is the exact opposite & all the drivers are Neanderthals",
            "title_similarity": "0.28188893",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9n6pvh",
            "score": 1,
            "text": "No joke. *This is HUGE!!*",
            "title_similarity": "0.14132783",
            "sentiment_compound": 0.4076
        },
        {
            "id": "h9n8cfh",
            "score": 1,
            "text": "Didn't London do this ages ago already?",
            "title_similarity": "0.27790436",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9n8wd7",
            "score": 1,
            "text": "Tokyo have all it's traffic light sync for more than 20 years now !",
            "title_similarity": "0.6250361",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9na3de",
            "score": 1,
            "text": "Not surprised when the city is known for its traffic",
            "title_similarity": "0.3677519",
            "sentiment_compound": -0.1695
        },
        {
            "id": "h9namdv",
            "score": 1,
            "text": "Nashville traffic is horrible they had a chance to reduce it by putting max trains running through the city but the rich people shot it down because they didn't want it to run thru there side of town",
            "title_similarity": "0.50191784",
            "sentiment_compound": 0.5882
        },
        {
            "id": "h9nbcpj",
            "score": 1,
            "text": "Melbourne, Australia already has that",
            "title_similarity": "0.20064086",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9nbnn8",
            "score": 1,
            "text": "Well yea, we don't need to synchronize we got a good system in place for all kinds of traffic, not just motor vehicles, but bicycles and pedestrians as well. It aint much if it aint dutch",
            "title_similarity": "0.39920735",
            "sentiment_compound": 0.631
        },
        {
            "id": "h9ndnzk",
            "score": 1,
            "text": "There's a borough in my city that kept the lights out of sync on purpose to discourage from driving through... It's downtown adjacent and gotta pass through anyway.",
            "title_similarity": "0.4875967",
            "sentiment_compound": -0.4215
        },
        {
            "id": "h9nfkl0",
            "score": 1,
            "text": "While in Geneva, Switzerland, the local gov is making sure that all lights are de-synchronized to increase traffic and encourage people to take the bus. Geneva has 500k people and Manhattan-like traffic jams.",
            "title_similarity": "0.76518995",
            "sentiment_compound": 0.7845
        },
        {
            "id": "h9ng2yg",
            "score": 1,
            "text": "IOW, it massively saves gasoline, nd pollution plus, saves times for the drivers, which we cannot EVER replace. We can always get more gas. We cannot buy time.\n\nSadly, missed.",
            "title_similarity": "0.59951353",
            "sentiment_compound": 0.0341
        },
        {
            "id": "h9njuij",
            "score": 1,
            "text": "That’s my dream. No more red light for you when nobody’s on the other side",
            "title_similarity": "0.35981494",
            "sentiment_compound": -0.0516
        },
        {
            "id": "h9nk002",
            "score": 1,
            "text": "IVE BEEN SAYING THIS NEEDS TO BE DONE EVERYWHERE. Govern it!! make all yellow lights 10 seconds.  It can happen they’re just lazy",
            "title_similarity": "0.55619204",
            "sentiment_compound": -0.4738
        },
        {
            "id": "h9nkwdb",
            "score": 1,
            "text": "Really? The Lights bear my house would beg to differ. Especially when going home at night when no one is around",
            "title_similarity": "0.33573312",
            "sentiment_compound": -0.296
        },
        {
            "id": "h9nmgyq",
            "score": 1,
            "text": "The only trick is that you have to pull up all the way to the intersection for it to work!",
            "title_similarity": "0.5620916",
            "sentiment_compound": -0.126
        },
        {
            "id": "h9nmnfs",
            "score": 1,
            "text": "Why can’t all cities do this.",
            "title_similarity": "0.28762558",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9no1am",
            "score": 1,
            "text": "I'll bet traffic is still a nightmare.",
            "title_similarity": "0.208672",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9nrf85",
            "score": 1,
            "text": "Traffic still sucks.",
            "title_similarity": "0.08701576",
            "sentiment_compound": -0.3612
        },
        {
            "id": "h9ns70s",
            "score": 1,
            "text": "I am pretty sure my city makes it the exact opposite to discourage cars in the inner City.",
            "title_similarity": "0.36011803",
            "sentiment_compound": 0.4019
        },
        {
            "id": "h9nxx1n",
            "score": 1,
            "text": "Does this mean less-reliable lights for pedestrians?",
            "title_similarity": "0.13315889",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9o1aor",
            "score": 1,
            "text": "\"Do you want skynet? Because this is how you get skynet.\" ~Mallory Archer",
            "title_similarity": "0.40641913",
            "sentiment_compound": 0.0772
        },
        {
            "id": "h9o1bih",
            "score": 1,
            "text": "Drive bys always on time… but someone explain the traffic",
            "title_similarity": "0.5705849",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9oc1o6",
            "score": 1,
            "text": "bull...ahem...shit",
            "title_similarity": "-0.027443128",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9of6u6",
            "score": 1,
            "text": "You wouldn’t guess it if you lived here.",
            "title_similarity": "0.015461503",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9ptctu",
            "score": 3,
            "text": "Wait America accomplished something new and novel involving infrastructure? What is this 1909",
            "title_similarity": "0.3131391",
            "sentiment_compound": 0.6369
        },
        {
            "id": "h9rbxo9",
            "score": 1,
            "text": "A gentleman named Murray Main designed the Hamilton Ontario one way street system. If you traveled the speed limit every light changed as you approached. Four lanes West and four East.",
            "title_similarity": "0.7164602",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9sf4ui",
            "score": 1,
            "text": "Thats some real data shit right there",
            "title_similarity": "0.17544469",
            "sentiment_compound": -0.5574
        },
        {
            "id": "h9sfi2p",
            "score": 1,
            "text": "When I lived in LA, there was literally NO traffic 90% of the time. It was way worse back on the East Coast",
            "title_similarity": "0.5605396",
            "sentiment_compound": -0.7213
        },
        {
            "id": "h9sz96j",
            "score": 1,
            "text": "Do a lot of people think there are sensors because I've heard at least a few people saw that's what they thought was going on?",
            "title_similarity": "0.2969671",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9w9otl",
            "score": 1,
            "text": "Lmao and most LA drivers are looking at their phones when the lights turn green",
            "title_similarity": "0.54101276",
            "sentiment_compound": 0.5994
        },
        {
            "id": "h9wug3e",
            "score": 1,
            "text": "You mean to tell me traffic would be WORSE?",
            "title_similarity": "0.12168972",
            "sentiment_compound": -0.5904
        },
        {
            "id": "ha0e0za",
            "score": 1,
            "text": "And it’s still trash",
            "title_similarity": "-0.049847595",
            "sentiment_compound": 0.0
        },
        {
            "id": "ha3b0o0",
            "score": 1,
            "text": "The future from yesterday is here! They put computers in traffic lights! Wow!",
            "title_similarity": "0.60580397",
            "sentiment_compound": 0.6884
        },
        {
            "id": "habi09w",
            "score": 1,
            "text": "Louisville Kentucky is the worst city I've ever been in for not knowing how to move traffic. They think longer light cycles helps the flow. It just makes traffic back up where there once was no backup.",
            "title_similarity": "0.62955",
            "sentiment_compound": -0.5719
        }
    ]
}