{
    "TIL when he was 13, Davy Crockett attacked a school bully. Fearful of his father’s punishment, he ran away from home. Over the next two and a half years, he did odd jobs, learned several woodsman skills and traveled around in 3 states. When he finally returned home, his family couldn't recognize him\n": [
        {
            "id": "h9t4cx9",
            "score": -3,
            "text": "And to think he died helping texans defend their right to own slaves",
            "title_similarity": "0.46526927",
            "sentiment_compound": -0.34
        },
        {
            "id": "h9sj9qp",
            "score": 289,
            "text": "Not so fun fact: Davy Crocket died fighting for the right to own slaves.",
            "title_similarity": "0.609487",
            "sentiment_compound": -0.8409
        },
        {
            "id": "h9sq88q",
            "score": -21,
            "text": "Imagine what a badass his dad had to be for it to take two and a half years of training to be able to say “no father, I do not wish to accept this whipping from you, the boy was a bully and full well deserved his earnings which I was delighted to pay, but know that I am now prepared to reciprocate any undue punishment for my part in dispensing well timed and deserved justice.”",
            "title_similarity": "0.71045166",
            "sentiment_compound": -0.1081
        },
        {
            "id": "h9tf6ul",
            "score": 1,
            "text": "> When he finally returned home, his family couldn't recognize him. \n\nI can only conclude it was because *taking a bath* is not mentioned as one of the things he did over those three years.  /s\n\nI would hope after three years, young Davy returned with the ability to hand out some payback to dear ol' ~~abuser~~ dad. or if nothing else, inform him that his days of being whipped were over. \n\n\n&nbsp;\n\n\n*[long-winded rant follows -feel free to skip]*\n\n&nbsp;\n\nMy mother was always eager to dole out physical abuse under the guise of discipline. The day I stopped her from hurting me was rather empowering. \n\nWhen she raised her fist to \"let the beatings begin\" I basically grabbed her wrist. When she tried hitting me with her other fist, I grabbed that wrist and twisted her around until her arms were crossed in front with me standing behind her. (whodathunk learning dance moves while rollerskating would have real life application? /s ) \n\nWe stood in the kitchen for about an hour that way as she cussed, squirmed, lied, and tried to free herself. Each time she'd finally shut up,  I'd ignore every bit of word-bait . I'd tell her that her days of hitting me and my younger siblings were over. That would set her off again. Lather, foam at the mouth, rinse, repeat. \n\nNot gonna lie, I was scared to death for myself. If she had been able to see my face, I doubt I could have pulled it off. I figured after I did let go, she would call the police on me (one of her many threats over the years) and that would be that. She didn't but that didn't stop her from making all sorts of insane threats of retaliation for my \"disgusting mistreatment\" of her.\n\nOne of the things she said during one interlude of verbal abuse was that I was a horrible child for beating his mother (projection!!). \n\nI told her holding her wrists was not beating her, but if she was going to lie about it, as an attempt to get me punished for standing up for myself, I might as well do it. The long pause of silence that followed me saying that was also rather enjoyable to experience. She was really having to weigh whether lying was worth the pain.\n\nDuring one interlude as she claimed I was hurting her so badly she was going to need EMTs to come to the house to help her. (bullshit!!) I told her that was good because then they could also inspect the bruises on [younger sibs 1 and 2]. She physically jerked like she'd been shocked when I said that. \n\nWhen she finally stopped squirming any time I'd slightly loosen my grip on her wrists, I let go of her. She sat down in a chair and started her \"I have tried to be a good mother...\" lecture number 452. (make this all about her!!!) I told her none of the five of us kids believed that bullshit due to her actions. And I was really over all her lies. (fire, meet gasoline!!!) \n\nThat set her off. (Al-l-l-l--l-l aboard! Guilt trip is now leaving on track five! Destinations include *stab me in the heart while my back was turned*, and other tiredly familiar stops.) The train eventually pulled into the last station when she said, \"I'm not going to speak to you again until you can show some respect for me!!\" (Yay! Vacay from your drama, mom! Thanks! See ya!)\n\nLuckily I bit my tongue and left the room and house after that. \n\nIt didn't stop her from being abusive. It did end her *physical abuse* of us younger three kids. \n\nAnd, about three weeks later, when she needed me to do something for her, suddenly she felt me worthy of being talked to. (dang! vacation over! back to the salt mine!) She tried to love-bomb me. \"You know you're really a good kid.\" \n\nMy reply of, \"it's okay, you'll change your mind tomorrow\" bought me three more weeks of her not speaking to me. \n\nIn case you can't tell, I broke my *giveafuck* when I stood up to her and it's never worked properly since.",
            "title_similarity": "0.8003734",
            "sentiment_compound": -0.9879
        },
        {
            "id": "h9u0mqa",
            "score": 0,
            "text": "With the way kids are turning out today, maybe we should standardize disappearing at 13, doing odd jobs,  learning woodsman shit, traveling the states, and returning home a couple of years later.",
            "title_similarity": "0.7055581",
            "sentiment_compound": -0.7096
        },
        {
            "id": "h9t1ogr",
            "score": 13,
            "text": "Makes me wonder what was up that made him fear his dad like that simply for whupping a bully.\n\nI remember when I was 11, there was a kid who I did not get along with at all who was threatening me to “stay out of his neighborhood and don’t ride my bike through it”… “his neighborhood” actually being a neighboring one, and he making this threat when I was only riding in my neighborhood.  I rode my bike to my street, he sees me riding on my street, and threatened me again.  If you remember the scene from Christmas Story where Ralphie beats up Farkus, it pretty much played out like that.  I had enough of his shit, beat the unholy hell out of him, my brother (who was playing basketball in our driveway) runs to get my mother, and she had to pull me off him.  Except my dad was quite proud of what I did when he heard what happened.",
            "title_similarity": "0.8241068",
            "sentiment_compound": -0.9044
        },
        {
            "id": "h9sxfof",
            "score": 4,
            "text": "\"King of the Wild Frontier\" seems like an understatement.",
            "title_similarity": "0.19638371",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h9td1g8",
            "score": 53,
            "text": ">Crockett died fighting for Texan independence, sealing his reputation as a true American hero.\n\nThis is one of the greatest myths of American history. The Alamo was a stupid battle to fight. The defenders were fighting against Mexico because they had broken promises to live under the Mexican Constitution as Mexican citizens and wanted to violate the Mexican Constitution and reestablish slavery. They were racist, pro-slave owning, oathbreakers. Now admittedly that might make Crockett a great Texan.\n\nThe myth of Crockett was largely an invention of Disney and fueled by a desire to promote nationalist heroes during the cold war.",
            "title_similarity": "0.55467683",
            "sentiment_compound": -0.875
        },
        {
            "id": "h9t96g2",
            "score": 1,
            "text": "My great grandparents said that I’m related to Davy Crockett (Crockett is our family name) but I’ve never actually traced the genealogy to know if that’s true. Reading through these comments makes me feel less inclined to make that association…",
            "title_similarity": "0.5954929",
            "sentiment_compound": 0.7391
        },
        {
            "id": "h9sxfmq",
            "score": 13,
            "text": "The name of the website (texasproud.com) makes me wonder if the information might be a little one-sided.",
            "title_similarity": "0.36762625",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9t4cz6",
            "score": -7,
            "text": "He also died begging for his life like a coward at the Alamo.  Meanwhile Arkansas Jim Bowie got off his death bed and took out a few Mexicans with his famous knife.  Crockett apologists will say we don't know this, but the Mexicans said that's what happened and common  sense says there would be no reason for them to make it up about one of them and not the other.",
            "title_similarity": "0.6376685",
            "sentiment_compound": -0.7783
        },
        {
            "id": "h9t1g7r",
            "score": 3,
            "text": "How do we know Crocket wasn't the actual bully .",
            "title_similarity": "0.36994588",
            "sentiment_compound": 0.3875
        },
        {
            "id": "h9t3kjo",
            "score": 2,
            "text": "Did he at least leave a note?\n\nSimply disappearing is a horrible thing to do to people.",
            "title_similarity": "0.5508963",
            "sentiment_compound": -0.5719
        },
        {
            "id": "h9t7d8b",
            "score": 2,
            "text": "This isn't a very healthy story...",
            "title_similarity": "0.17820992",
            "sentiment_compound": -0.3559
        },
        {
            "id": "h9takt0",
            "score": 1,
            "text": "Fuck Davy Crockett, all the homies hate this mf 😤",
            "title_similarity": "0.5216607",
            "sentiment_compound": -0.802
        },
        {
            "id": "h9t0xtu",
            "score": -11,
            "text": "Yet 30yr olds today continue to live in mom’s basement.  \n\nProgress.  🇺🇸",
            "title_similarity": "0.4407953",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h9t0rq5",
            "score": -3,
            "text": "How the fuck do you not recognize your own child. I do not get it. There are cases where kids are lost and are found but years later they realise the found kid wasn't theirs. Boggles my mind",
            "title_similarity": "0.72248244",
            "sentiment_compound": -0.4404
        },
        {
            "id": "h9t23pe",
            "score": 3,
            "text": "You might want to read more about Crockett from other sources. This \"Texas Proud\" article reads like middle school myth-building.",
            "title_similarity": "0.53053224",
            "sentiment_compound": 0.7096
        },
        {
            "id": "h9t6vk2",
            "score": 2,
            "text": "I read a biography penned about him in the 1940's and presented a book report on it as a kid. I look back now and realize what utter bullshit the vast majority written about this guy is.",
            "title_similarity": "0.554293",
            "sentiment_compound": -0.624
        },
        {
            "id": "h9tbepj",
            "score": 2,
            "text": "*“His family didn’t recognize him?!?”* He was only 2 years older and a carpenter. Poor Davy my family tried to do the old *“we don’t recognize him”*  trick to me too.",
            "title_similarity": "0.76466084",
            "sentiment_compound": -0.6062
        },
        {
            "id": "h9syj6m",
            "score": 35,
            "text": "I feel like this particular website is not a reliable source of unbiased and well-vetted information...",
            "title_similarity": "0.36085534",
            "sentiment_compound": 0.34
        },
        {
            "id": "h9t0oos",
            "score": 0,
            "text": "Legend",
            "title_similarity": "-0.021325935",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9t3ut2",
            "score": 0,
            "text": "Pretty much what happened to me, I wasn't gone as long. I'm from Davy's part of Tennessee, wonder if it's something in the water?",
            "title_similarity": "0.36820248",
            "sentiment_compound": 0.4939
        },
        {
            "id": "h9t8d96",
            "score": 0,
            "text": "Also a Freemason. From the Grand Lodge of Maryland Website:\n\n>David “Davy” Crockett  remains one of the best-known American folk heroes.  Although commonly referred to in popular culture as “King of the Wild Frontier”, he was so much more.  He served as a Congressman, representing Tennessee.  He was also a key figure in the Texas Revolution, and died heroically at the Battle of the Alamo.\n\n>Crockett gained his reputation as an outdoorsman and adventurer growing up in eastern Tennessee.  His larger-than-life exploits were chronicled during his own lifetime and continue to this day to be celebrated in American culture.  After serving as a colonel in the Tennessee militia and in a stint in the state legislature, he was elected to the U.S. Congress in 1826.   During his tenure in Washington, Crockett was initiated into Freemasonry and became a Master Mason.",
            "title_similarity": "0.54003906",
            "sentiment_compound": 0.9246
        },
        {
            "id": "h9tammj",
            "score": 0,
            "text": "Soooooo a different dude",
            "title_similarity": "0.14152157",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9tat2z",
            "score": 5,
            "text": "He later went on to illegally run slaves from Galveston to New Orleans before becoming one of the most celebrated human traffickers in American folklore.",
            "title_similarity": "0.52439964",
            "sentiment_compound": 0.6115
        },
        {
            "id": "h9tazas",
            "score": 0,
            "text": "Parents never punish your kids for taking down a bully. Reward them for they're doing what's right.",
            "title_similarity": "0.50123537",
            "sentiment_compound": 0.5067
        },
        {
            "id": "h9tazh2",
            "score": 0,
            "text": "Davy Crockett was a real person???",
            "title_similarity": "0.09215832",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9u4jgw",
            "score": 0,
            "text": "Not even from TV?",
            "title_similarity": "0.20478618",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9ukk2a",
            "score": 0,
            "text": "I used to bone Davy Crockett’s great, great, great, great granddaughter. Fun times.",
            "title_similarity": "0.34584767",
            "sentiment_compound": 0.967
        },
        {
            "id": "h9vjs70",
            "score": 0,
            "text": "Such a shame he still turned out to be an overrated POS.",
            "title_similarity": "0.33018148",
            "sentiment_compound": -0.4767
        },
        {
            "id": "h9sz609",
            "score": 9,
            "text": "\"You kids have it easy! Back in my day we were so afraid of our dad's spankings we'd run away from home for several years and become a hobo grifter doing oddjobs across the Southwest and only return after puberty had aged our faces to be unrecognizable to our parents.\"  \n\\~Jesus grandma... did that really happen?",
            "title_similarity": "0.8829452",
            "sentiment_compound": 0.4926
        },
        {
            "id": "h9sx9gk",
            "score": 51,
            "text": "🎵\"Born on mountaintop in Tennessee....\"🎵\n\n&#x200B;\n\nEDIT: Actually, holy shit, I had no idea how completely racist that song became in later verses, or that it's freaking *twenty* verses long.",
            "title_similarity": "0.6373738",
            "sentiment_compound": -0.9168
        },
        {
            "id": "h9sxox4",
            "score": 6,
            "text": "Just the thought of that ass whoopin made my mans go on the lam for almost 3 years and become an adult.",
            "title_similarity": "0.6362438",
            "sentiment_compound": -0.5423
        },
        {
            "id": "h9sz87s",
            "score": -1,
            "text": "That's kinda sus",
            "title_similarity": "-0.20311618",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9t0wjc",
            "score": 1,
            "text": "Ahh, the good ole days.",
            "title_similarity": "-0.09528369",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h9t4g0r",
            "score": 1,
            "text": "Based on what I read  of him he sounds like a bada**",
            "title_similarity": "0.30158013",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h9t5a3z",
            "score": 1,
            "text": "As a mum, I cannot believe a mother would not recognise her own child.",
            "title_similarity": "0.4377047",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9ta40k",
            "score": 1,
            "text": "I love that a story about a kid running away from home for 2.5 years comes from texasproud.com. Proud of your kids being terrified of your parents?",
            "title_similarity": "0.74826914",
            "sentiment_compound": 0.5106
        },
        {
            "id": "h9tan2v",
            "score": -1,
            "text": "What a douche",
            "title_similarity": "0.124429174",
            "sentiment_compound": -0.3612
        },
        {
            "id": "h9tb0kd",
            "score": 1,
            "text": "His father seemed really freaking abusive then.",
            "title_similarity": "0.58207136",
            "sentiment_compound": -0.8211
        },
        {
            "id": "h9tfdi4",
            "score": 1,
            "text": "I really enjoyed that read, thanks for posting. And thanks to all the people who upvoted it to make it hot. But most of all, shout out Davey Crockett\n\nEdit: auto correct",
            "title_similarity": "0.15324515",
            "sentiment_compound": 0.6365
        },
        {
            "id": "h9tkkmj",
            "score": -1,
            "text": "are we supposed to know who that is",
            "title_similarity": "-0.046060048",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9tpg8y",
            "score": -1,
            "text": "Davy Crockett is a hero\n\nDon't forget Mexicans also fought for the Independence of Texas and to this day Texas is still a force to be reckon with.",
            "title_similarity": "0.32085258",
            "sentiment_compound": 0.4526
        },
        {
            "id": "h9txn4v",
            "score": 1,
            "text": "Yaaaa i think this is probably just exaggerated ;) who wouldn't recognize there own kid after only 3 years,even 20 years i would still be able to tell me kids from a stranger",
            "title_similarity": "0.60505307",
            "sentiment_compound": 0.128
        },
        {
            "id": "h9u3y13",
            "score": -1,
            "text": "Is this lore? Like was Davey the bully in reality but the narrative got flipped to show his virtue?",
            "title_similarity": "0.5091233",
            "sentiment_compound": 0.5733
        },
        {
            "id": "h9uhm4e",
            "score": 1,
            "text": "What fine grammar and writing skills.",
            "title_similarity": "-0.10126101",
            "sentiment_compound": 0.2023
        },
        {
            "id": "h9v6ghx",
            "score": 1,
            "text": "Davy came back YOLKED as fuck. Dude couldnt even fit through the door. Fun fact: Davy Crockett was the first Chad",
            "title_similarity": "0.6256199",
            "sentiment_compound": -0.3204
        },
        {
            "id": "h9syo6f",
            "score": 32,
            "text": "TIL: Davy Crockett was a real person.",
            "title_similarity": "0.0026748665",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9syi64",
            "score": 2,
            "text": "Supposedly my ancestor.",
            "title_similarity": "0.06493742",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9t2bn3",
            "score": 2,
            "text": "Davey Crockett ain't got shit on Josiah Blackwater.",
            "title_similarity": "0.32387313",
            "sentiment_compound": 0.4449
        },
        {
            "id": "h9t3lor",
            "score": 2,
            "text": "Davie Davy Crockett King of the wild frontier",
            "title_similarity": "0.3254279",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9t9m5p",
            "score": 2,
            "text": "seems like Pa Crockett was an abusive piece of shit.",
            "title_similarity": "0.45742676",
            "sentiment_compound": -0.743
        },
        {
            "id": "h9ud51f",
            "score": 2,
            "text": "what an absolute garbage human his father must have been if a 13 year old decided it was better to fucking run away for 2.5 years than face him for protecting himself from a bully.  i bet the father himself was the worst bully of all.",
            "title_similarity": "0.8137114",
            "sentiment_compound": -0.8225
        },
        {
            "id": "h9ugmf2",
            "score": 2,
            "text": "Today I learned Davey Crockett was a real person.",
            "title_similarity": "0.10063155",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9uoa15",
            "score": 2,
            "text": "And then he died supporting slavery and treason in Mexico.",
            "title_similarity": "0.50178486",
            "sentiment_compound": -0.8555
        },
        {
            "id": "h9vvlfj",
            "score": 2,
            "text": "Then he died like a bitch fighting to make a pretend cou try that would last less time than our occupation of Afghanistan lol",
            "title_similarity": "0.6496298",
            "sentiment_compound": -0.7184
        },
        {
            "id": "h9tn0hi",
            "score": 10,
            "text": "It's weird that up until a few decades ago you could like just leave home at 15 and find a job with no experience or much education and go on to become a successful man and now even with a good university degree you might still end up working minimum wage or barely above and have to live with your parents cuz you can't afford rent.",
            "title_similarity": "0.70269597",
            "sentiment_compound": 0.7269
        },
        {
            "id": "h9t3nu8",
            "score": 23,
            "text": "I thought Davy Crockett and Mr. Rogers were on the same SEAL team together.",
            "title_similarity": "0.15929726",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9suvau",
            "score": 161,
            "text": "I think people really underestimate the independence that young teens can exhibit when they are forced to. 13 year olds aren't the little children that we think they are.",
            "title_similarity": "0.571095",
            "sentiment_compound": -0.6697
        },
        {
            "id": "h9t4h3c",
            "score": 12,
            "text": "When they finally remembered him, he was punished severely.",
            "title_similarity": "0.47134405",
            "sentiment_compound": -0.7184
        },
        {
            "id": "h9tgw8w",
            "score": 4,
            "text": "I have the business diploma from my 5x-great grandfather issues in 1893.  This was years after he left school in 8th grade to help on the family farm.  Then one day he decided to open a bank inside a convenience store, and it eventually grew to be a nationwide bank that my grandfather sold majority shares to Old National bank in the late 1990's\\early 2000's.\n\nCrazy how back then you could just start a bank from scratch without a high school education... Or run away at 13 and actually get along fine.",
            "title_similarity": "0.6348522",
            "sentiment_compound": 0.5106
        },
        {
            "id": "h9tnq1g",
            "score": -2,
            "text": "He sounds like a hard tough kid, going around being a woodsman at 14 and all, but when you really look at it he was juat a giant wuss who left for almost 3 years cause he was afraid of a spanking from his daddy.",
            "title_similarity": "0.87245107",
            "sentiment_compound": 0.0772
        },
        {
            "id": "h9u1sdi",
            "score": 3,
            "text": "TIL that Davy Crockett isn't a tall tale character.",
            "title_similarity": "0.250686",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9uup1n",
            "score": 3,
            "text": "Fellaz you ever became so afraid of manning up and taking a physical punishment that you ran away and inadvertently manned up regardless?",
            "title_similarity": "0.6750093",
            "sentiment_compound": -0.4939
        },
        {
            "id": "h9t2vmy",
            "score": 5,
            "text": "Hey! I went to Crockett Elementary School! Our mascot was definitely not the most revered creature...",
            "title_similarity": "0.5912187",
            "sentiment_compound": -0.203
        },
        {
            "id": "h9sxzo3",
            "score": 47,
            "text": "legend has it, even his iphone's face id wouldn't recognize him",
            "title_similarity": "0.5049557",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9u1r3d",
            "score": 6,
            "text": "One interesting fact about Davy Crockett that's not documented on that website, is he had three ears. He had his left ear, and his right ear, and his wild front ear.",
            "title_similarity": "0.45120084",
            "sentiment_compound": 0.4019
        },
        {
            "id": "h9uqrct",
            "score": 7,
            "text": "Plot twist: they didn’t recognize him because it wasn’t him. It was Eugene J. McElroy, a 16 year old blacksmith apprentice runaway impersonating young Crockett after killing him in a neighboring state and assuming his identity to thwart pursuit.",
            "title_similarity": "0.84131587",
            "sentiment_compound": -0.6597
        },
        {
            "id": "h9ta884",
            "score": 144,
            "text": "John Crockett (Davy's dad) owed a gambling debt to my ancestor ~~great grandfather~~ and Davy had to work it off by driving cattle almost 400 miles, all at the age of 12 before even going to school, he decided he had enough of this work and left in a snowstorm to go back home.\n\nThis is something we talk about in my family occasionally, I also was a huge fan boy of Davy when I was younger before I knew any of his history.\n\n&#x200B;\n\nedit: Bonus; the same grandfather supposedly made a rifle for Daniel Boone earlier in life and was possibly a friend, although I can't confirm any of the Daniel Boone stuff, the closest I've been able to verify is my ancestors' name on a few of Boone's manifests to Kentucky.",
            "title_similarity": "0.7662969",
            "sentiment_compound": 0.9169
        },
        {
            "id": "h9tx05q",
            "score": 8,
            "text": "Did you know Davy crocket had a bear break his horse's leg, so he killed the bear with his own ears, then carried both the horse and the bear up the mountain and nursed it back to health over the next two months before riding it home when he was only six months old? That bear's name? Albert Einstein.",
            "title_similarity": "0.7383407",
            "sentiment_compound": -0.7301
        },
        {
            "id": "h9t1iwh",
            "score": 167,
            "text": "Be the kind of parent that your kid doesn’t disappear for 2.5 years afraid that you will punish them for one mistake.",
            "title_similarity": "0.63018596",
            "sentiment_compound": -0.7717
        },
        {
            "id": "h9t3z9x",
            "score": 12,
            "text": "Wait ... I heard he kilt him a bar when he wuz only 3. Shoulda been a warnin' to 'em he'd be up t' no good.",
            "title_similarity": "0.60521615",
            "sentiment_compound": -0.3412
        },
        {
            "id": "h9tgxpx",
            "score": 17,
            "text": "Born on a mountain top in Tennessee, greenest state in the land of the free. Raised in the woods so he knew every tree; killed him a bar’ when he was only 3. Daveeeree Davy Crockett, King of the wild frontier.",
            "title_similarity": "0.66496885",
            "sentiment_compound": -0.1027
        },
        {
            "id": "h9sp3dr",
            "score": 714,
            "text": "There has to be some other reason why he dipped. People fuckin loved southern backwoods brawling at that time. It was a way to gain/maintain honor. Someone calls you a \"buckskin\" or a \"lubber,\" you rip their goddamn eyeballs out. Davy definitely participated later in his life:\n\n\"I kept my thumb in his eye, and was just going to give it a twist and bring the peeper out, like taking a gooseberry in a spoon.\" \n\nThe rest of the article is fascinating: \"Gouge and bite, pull hair and scratch. The social significance of fighting in the southern backcountry by Elliot J. Gorn.",
            "title_similarity": "0.5433253",
            "sentiment_compound": 0.9117
        },
        {
            "id": "h9smvqr",
            "score": 91,
            "text": "Sounds like his dad was a lot of fun to be around.",
            "title_similarity": "0.23548979",
            "sentiment_compound": 0.7003
        },
        {
            "id": "h9u2dgt",
            "score": 23,
            "text": "\"Fearful of his father's punishment\" = he was legitimately afraid his father would beat him to death.",
            "title_similarity": "0.69691443",
            "sentiment_compound": -0.8834
        },
        {
            "id": "h9sn2on",
            "score": 430,
            "text": "If my 15 year old had left home 2 years ago, I too would have a hard time recognizing him.  Almost a foot taller, voice an octave lower and face like a mans.  But bruh, I’d def recognize him.",
            "title_similarity": "0.6272272",
            "sentiment_compound": -0.0129
        },
        {
            "id": "h9snxf3",
            "score": 30,
            "text": "Holy shit, that's intense",
            "title_similarity": "-0.044805918",
            "sentiment_compound": -0.5106
        },
        {
            "id": "h9t0x5k",
            "score": 81,
            "text": "He later went on to be Daniel Boone and also starred in Old Yeller",
            "title_similarity": "0.368496",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9sztu8",
            "score": 405,
            "text": "When I was a lad, I worked a summer job in Eastern Tennessee. The company owner took me on a tour down near Pigeon Forge and the surrounding area. I was a kid from out of town and he was proud of his home.\n\nAnyways, at one point we passed by a simple house and he says \"See that house there? That's the front yard where Davy Crockett's parents were scalped by Indians.\" \n\nI don't know if that's true, but that's about the only thing I remember about my Eastern Tennessee tour that day and I thought it was an oddly morbid thing to point out to visitors.",
            "title_similarity": "0.6589626",
            "sentiment_compound": 0.4497
        },
        {
            "id": "h9skv7y",
            "score": 2189,
            "text": "They didn’t remember his face. \nEven worse, they didn’t remember the Alamo.",
            "title_similarity": "0.51410747",
            "sentiment_compound": -0.4767
        },
        {
            "id": "h9t39ph",
            "score": 1224,
            "text": "When you can face the bully at school but not at home.",
            "title_similarity": "0.5806186",
            "sentiment_compound": -0.2732
        },
        {
            "id": "h9sr6px",
            "score": 2165,
            "text": "I’d believe it. I looked pretty different from 13 to 15 and I didn’t even do a bunch of badass woodsman stuff.",
            "title_similarity": "0.5444665",
            "sentiment_compound": 0.6808
        },
        {
            "id": "h9sgd69",
            "score": 8267,
            "text": "Think about how horrible the punishment would be to make a child run off at 13.\n\nEDIT: Please read the whole article - \"“The joy of my sisters and my mother, and indeed, of all the family, was such that it humbled me, and made me sorry that I hadn’t submitted to a hundred whippings, sooner than cause so much affliction as they had suffered on my account…I was now fifteen years old; and my increased age and size, together with the joy of my father, occasioned by my unexpected return, I was sure would secure me against my long-dreaded whipping.” -Crockett’s'",
            "title_similarity": "0.6839212",
            "sentiment_compound": 0.6705
        },
        {
            "id": "h9thcki",
            "score": 999,
            "text": "Dave: I'm so sorry I attacked that boy, pa.\n\nPa: who the fuck are you?",
            "title_similarity": "0.6024854",
            "sentiment_compound": -0.8179
        },
        {
            "id": "h9sgr0v",
            "score": 11528,
            "text": "I wonder if there are any conspiracy theories saying that the boy who returned wasn’t Davy Crockett.",
            "title_similarity": "0.48968703",
            "sentiment_compound": -0.5267
        },
        {
            "id": "h9t2pm6",
            "score": 3305,
            "text": "His father indentured him to a cattle rancher at the age of 12 to help pay off his debts, and he rode with the herd to Virginia. So maybe he was pretty well able to take care of himself already.",
            "title_similarity": "0.6577601",
            "sentiment_compound": 0.8689
        },
        {
            "id": "h9szlnb",
            "score": 1,
            "text": "Couldn’t?",
            "title_similarity": "0.041724175",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9szn92",
            "score": 1,
            "text": "That’s why he was king of the wild frontier.   He started early.",
            "title_similarity": "0.37648487",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9t01ws",
            "score": 2,
            "text": "[removed]",
            "title_similarity": "0.06297724"
        },
        {
            "id": "h9t0b7f",
            "score": 2,
            "text": "“I wanna warn you all that I’m a screamer”  - Davy Crockett",
            "title_similarity": "0.37837356",
            "sentiment_compound": -0.1027
        },
        {
            "id": "h9t1t5x",
            "score": 1,
            "text": "Loife went through ‘im",
            "title_similarity": "0.01387611",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9t3roe",
            "score": 2,
            "text": "What about Johnny Appleseed",
            "title_similarity": "0.17530814",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9t43d0",
            "score": 1,
            "text": "He also kilt him a bar when he was only 3.",
            "title_similarity": "0.47523338",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9t4fk6",
            "score": 2,
            "text": "Solid, liquid, and gas?",
            "title_similarity": "-0.06230301",
            "sentiment_compound": 0.1531
        },
        {
            "id": "h9t4kfd",
            "score": 1,
            "text": "Why the fuck would you nickname someone named Molly, as Polly!?",
            "title_similarity": "0.3362627",
            "sentiment_compound": -0.5848
        },
        {
            "id": "h9t5apt",
            "score": 2,
            "text": "Or he died and an imposter came knocking.",
            "title_similarity": "0.518643",
            "sentiment_compound": -0.5574
        },
        {
            "id": "h9t5kxg",
            "score": 1,
            "text": "DAVYYYYY DAVY CROCKETT KING OF THE WILD FRONTIER",
            "title_similarity": "0.31146687",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9t5zop",
            "score": 1,
            "text": "What the hell did he do to the kid? Cut his dick off? Damn dudes are wild",
            "title_similarity": "0.6106818",
            "sentiment_compound": -0.9195
        },
        {
            "id": "h9t6biq",
            "score": 1,
            "text": "The boy became a man",
            "title_similarity": "0.26461184",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9t74jj",
            "score": 9,
            "text": "That's my husband's great great great some odd greats uncle",
            "title_similarity": "0.28249884",
            "sentiment_compound": 0.9001
        },
        {
            "id": "h9t7wx8",
            "score": 3,
            "text": "It's Dave now, dad.",
            "title_similarity": "0.14389113",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9t7xiv",
            "score": 2,
            "text": "Also he caught him a baar when he was only three",
            "title_similarity": "0.51423174",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9t7z1t",
            "score": 1,
            "text": "true story im related to him",
            "title_similarity": "0.019819677",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h9t8awy",
            "score": 2,
            "text": "Insert conspiracy theory here",
            "title_similarity": "0.13834512",
            "sentiment_compound": -0.5267
        },
        {
            "id": "h9t8k9k",
            "score": 2,
            "text": "Probably didn’t recognize him until he took off his raccoon hat.",
            "title_similarity": "0.5454211",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9t8ng3",
            "score": 2,
            "text": "Hmmm.   I didn't know.",
            "title_similarity": "0.098008074",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9t8wl5",
            "score": 18,
            "text": "That's the first time I've ever seen a picture of him - so for that alone, thanks.",
            "title_similarity": "0.23480305",
            "sentiment_compound": 0.1621
        },
        {
            "id": "h9t9rxb",
            "score": 1,
            "text": "This sounds like Ron Swanson",
            "title_similarity": "-0.05552963",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h9t9scu",
            "score": 2,
            "text": "How many ears did he have?\n\n3, the left ear, the right ear and the wild front ear.",
            "title_similarity": "0.22620898",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9ta2dg",
            "score": 1,
            "text": "Fearful of punishment.  The good old days.  /s",
            "title_similarity": "0.3152923",
            "sentiment_compound": -0.5423
        },
        {
            "id": "h9ta7e2",
            "score": 2,
            "text": "This mf'er kilt him a b'ar when he was only three but was worried about beating up a bully? Hogwash.",
            "title_similarity": "0.84282684",
            "sentiment_compound": -0.9022
        },
        {
            "id": "h9tauz3",
            "score": 2,
            "text": "Single mothers are villains.",
            "title_similarity": "0.3857271",
            "sentiment_compound": -0.6597
        },
        {
            "id": "h9tb8m7",
            "score": 1,
            "text": "We need an anime adaptation of this, seems fitting",
            "title_similarity": "0.03952472",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9tc7di",
            "score": 1,
            "text": "“Do this for 2.5 years and your friend won’t recognize you”.",
            "title_similarity": "0.6786535",
            "sentiment_compound": 0.4939
        },
        {
            "id": "h9tcbcj",
            "score": 1,
            "text": "Legend had has it that the man that returned was an imposter and the real Davy Crockett remained in hiding until he emerged under a different name, Ron Swanson.",
            "title_similarity": "0.6773324",
            "sentiment_compound": -0.296
        },
        {
            "id": "h9tccd0",
            "score": 3,
            "text": "So who was the bully,  can we cancel him yet?",
            "title_similarity": "0.5094537",
            "sentiment_compound": -0.6369
        },
        {
            "id": "h9tcpbo",
            "score": 1,
            "text": "Can't no man whup my daddy.  I can whup my daddy.",
            "title_similarity": "0.4232051",
            "sentiment_compound": 0.2235
        },
        {
            "id": "h9tcxja",
            "score": 1,
            "text": "Legend says he return three weeks later with a full grown beard",
            "title_similarity": "0.42721444",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9tdaou",
            "score": 1,
            "text": "Imagine punishing someone for beating up a bully",
            "title_similarity": "0.52460563",
            "sentiment_compound": -0.8689
        },
        {
            "id": "h9tdb9s",
            "score": 1,
            "text": "damn his dad must be a giant asshole",
            "title_similarity": "0.46123308",
            "sentiment_compound": -0.4019
        },
        {
            "id": "h9tdi9u",
            "score": 1,
            "text": "He never went by \"Davy\".",
            "title_similarity": "0.3607539",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9tdy7m",
            "score": 1,
            "text": "TIL Davy Crockett was a real person.",
            "title_similarity": "0.010886593",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9tdzp7",
            "score": 3,
            "text": "A few months back, I found out he is either the brother or cousin of my great, great, great, great grandmother.",
            "title_similarity": "0.4177426",
            "sentiment_compound": 0.9545
        },
        {
            "id": "h9tdzwp",
            "score": 1,
            "text": "[Davieeeee, Daaavie Crockett, King of the wild frontier ](https://youtu.be/txcRQedoEyY)",
            "title_similarity": "0.29781467",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9tefmr",
            "score": 2,
            "text": "That sounds fake",
            "title_similarity": "0.09884219",
            "sentiment_compound": -0.4767
        },
        {
            "id": "h9tekji",
            "score": 1,
            "text": "TIL a random stranger appeared at the home of a 16 year old Davy Crockett to steal his identity.",
            "title_similarity": "0.7386031",
            "sentiment_compound": -0.4939
        },
        {
            "id": "h9teq2n",
            "score": 1,
            "text": "Old days seem much harder then modern. I can’t imagine what someone must have been doing to be considered a bully back then.",
            "title_similarity": "0.5867598",
            "sentiment_compound": -0.4939
        },
        {
            "id": "h9tes8l",
            "score": 1,
            "text": "That little scamp. \n\nYears later on the capitol steps he helped Andrew Jackson beat the crap out of a would-be assassin whose two pistols both misfired.",
            "title_similarity": "0.69726247",
            "sentiment_compound": -0.3818
        },
        {
            "id": "h9teuvi",
            "score": 1,
            "text": "Every father’s dream. Son goes out on his own at 13 and returns as a woodsman",
            "title_similarity": "0.6818678",
            "sentiment_compound": 0.25
        },
        {
            "id": "h9tg3po",
            "score": 2,
            "text": "He also killed a bear when he was only three!",
            "title_similarity": "0.70924276",
            "sentiment_compound": -0.6996
        },
        {
            "id": "h9tg8r4",
            "score": 2,
            "text": "How bad of a whuppin was he going to catch if the better option was to run away for 2.5 years at age 13?!",
            "title_similarity": "0.7446784",
            "sentiment_compound": -0.2244
        },
        {
            "id": "h9tga65",
            "score": 2,
            "text": "Did he kill this kid?",
            "title_similarity": "0.49432743",
            "sentiment_compound": -0.6908
        },
        {
            "id": "h9tgooi",
            "score": 40,
            "text": "Imagine fucking up as a child \n\"Shit my parents will kill me\" and the best thing you can think of to avoid the punishment is to runaway and become a fucking lumberjack",
            "title_similarity": "0.72902954",
            "sentiment_compound": -0.8591
        },
        {
            "id": "h9tgva1",
            "score": 2,
            "text": "Well... He was 13, and 15 or 16 when he came home. Of course his parents wouldn't recognize him, puberty does things to people",
            "title_similarity": "0.7959741",
            "sentiment_compound": 0.2732
        },
        {
            "id": "h9tgvlh",
            "score": 1,
            "text": "They forgor 💀",
            "title_similarity": "-0.014489066",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9thfp9",
            "score": 1,
            "text": "TIL Davy Crockett was a real person.  Lll",
            "title_similarity": "0.02213277",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9thrg9",
            "score": 1,
            "text": "And he’d go on to die fighting for the right to keep people as property and steal land from the legal owners.",
            "title_similarity": "0.59386116",
            "sentiment_compound": -0.8442
        },
        {
            "id": "h9ti019",
            "score": 1,
            "text": "David Crockett never went by the Davy. He despised people calling him by that name. His family and friends called him David. Only people who didn't know him called Davy.",
            "title_similarity": "0.70725745",
            "sentiment_compound": 0.1027
        },
        {
            "id": "h9ti3za",
            "score": 1,
            "text": "Same chap the k-ton nuke is named after ?",
            "title_similarity": "0.16404957",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9ti7xp",
            "score": 1,
            "text": "That was the point.  Davy who?",
            "title_similarity": "-0.005656559",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9ti8dm",
            "score": 1,
            "text": "Hmmm. So his first wife died of unknown causes, eh?",
            "title_similarity": "0.51304376",
            "sentiment_compound": -0.5574
        },
        {
            "id": "h9timd0",
            "score": 1,
            "text": "This is a funny question to ask, but do they actually know it was the same person?",
            "title_similarity": "0.20342809",
            "sentiment_compound": 0.2382
        },
        {
            "id": "h9tjh6v",
            "score": 1,
            "text": "But what about Tubbs?",
            "title_similarity": "0.02056054",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9tjxxk",
            "score": 1,
            "text": "Similarly, early American frontiersman Simon Kenton (a contemporary of Daniel Boone) fell in love with a girl when he was about 15.  She, instead, became engaged to William Leachman.  Kenton challenged Leachman to a fight and lost.  Kenton then started working out to get stronger.  He ran into Leachman one day when no one was around and beat him to a pulp.  Thinking he had killed Leachman, he fled from his home in Virginia to western Pennsylvania and changed his name to Simon Butler.  He became a soldier for a few years, then started exploring the untamed wilderness of West Virginia and Kentucky.  \n\nAfter a few years, he had made a name for himself as an explorer and guide for new settlers.  One day, he learned from a settler that William Leachman had not died.  In fact, Leachman was suspected of having murdered Kenton because Kenton had suddenly disappeared and Leachman was found covered in blood.  Since there was no body, Leachman was not found guilty.  \n\nSimon went back to his real name of Simon Kenton and went home to bring his family to Kentucky.",
            "title_similarity": "0.8221096",
            "sentiment_compound": -0.768
        },
        {
            "id": "h9tkchx",
            "score": 2,
            "text": "The jump from 13 to 15/16 is drastic in boys as well",
            "title_similarity": "0.40221116",
            "sentiment_compound": 0.2732
        },
        {
            "id": "h9tl3ia",
            "score": 1,
            "text": "Kids have it too damn easy nowadays!!!\n\n/s",
            "title_similarity": "0.030500099",
            "sentiment_compound": 0.2677
        },
        {
            "id": "h9tl3o7",
            "score": 1,
            "text": "TIL Davy Cricket was a real boy",
            "title_similarity": "0.20602818",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9tl5p9",
            "score": 1,
            "text": "\"Born in Green County, Tennessee to John and Rebecca Hawkins\"\n\n\nSo...Davy Hawkins?",
            "title_similarity": "0.35269797",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9tm3m1",
            "score": 3,
            "text": "There's a conspiracy theory* that the bully actually beat Crockett to within an inch of his life, and fearing retribution, ran off with his nearly dead victim. He attempted to nurse him back to health and performed odd jobs, learned several skills, and traveled around seeking the necessary care to nurse his victim back to health. During this time, he formed a genuine familial bond with Crockett (possibly having succumbed to some level of  munchausen's), learning a lot about his life. Unfortunately, Crockett passed away after 2 and a half years of this, and the bully, unable to accept this, suffered a severe mental breakdown, and thereafter began believing that he *was* Davey, and returned to his family and lived out his life as such.\n\nThe bully was never seen again and his family didn't care that much.\n\n*that I made up.",
            "title_similarity": "0.77900267",
            "sentiment_compound": -0.985
        },
        {
            "id": "h9tmhfi",
            "score": 1,
            "text": "American badass.",
            "title_similarity": "0.17370914",
            "sentiment_compound": 0.34
        },
        {
            "id": "h9tn1v7",
            "score": 3,
            "text": "My son asked when I read this to him, “did he still get punished.” Funny stuff",
            "title_similarity": "0.6296687",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h9tn2cj",
            "score": 10,
            "text": "Dude must have really fucked up that bully.",
            "title_similarity": "0.49642074",
            "sentiment_compound": -0.8357
        },
        {
            "id": "h9tn6t9",
            "score": 2,
            "text": "Man when I was 13 I only got about three miles away before my parents found me...",
            "title_similarity": "0.68655205",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9tn8lf",
            "score": 2,
            "text": "That’s a bit of an overreaction…",
            "title_similarity": "0.10706427",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9tnfcz",
            "score": 1,
            "text": "Wrong house. \n\n;D",
            "title_similarity": "0.24632408",
            "sentiment_compound": -0.1449
        },
        {
            "id": "h9tnz7g",
            "score": 1,
            "text": "Probably grew a mustache.",
            "title_similarity": "0.072229356",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9to9dw",
            "score": 1,
            "text": "It was the hat, wasn't it?",
            "title_similarity": "-0.1290099",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9tobgh",
            "score": 2,
            "text": "Davy Crockett later fought side by side with Captain America, vanquishing Nazis left and right.",
            "title_similarity": "0.4699128",
            "sentiment_compound": -0.3182
        },
        {
            "id": "h9toeei",
            "score": 1,
            "text": "Simon Kenton did something similar. He thought he killed a man and escaped to the Ohio/Kentucky frontier and took a fake name. He ended up becoming a legendary frontiersman and found out much later in life that the man survived",
            "title_similarity": "0.66598415",
            "sentiment_compound": -0.6486
        },
        {
            "id": "h9tpd49",
            "score": 2,
            "text": "He got a nuke weapon named after him",
            "title_similarity": "0.2562935",
            "sentiment_compound": -0.296
        },
        {
            "id": "h9tq26t",
            "score": 1,
            "text": "did",
            "title_similarity": "-0.18479863",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9tq3a4",
            "score": 2,
            "text": "\"... he killed him a barr, \nwhen he was only three.\"",
            "title_similarity": "0.66753066",
            "sentiment_compound": -0.6705
        },
        {
            "id": "h9tq4ja",
            "score": 1,
            "text": "Hear that kids?\n\nWhen you can't handle your bully. Become a youthful vagrant bouncing from state to state. \n\nThen you'll become a Murican folk hero. Instead of a terrifying statistic.",
            "title_similarity": "0.59141886",
            "sentiment_compound": 0.5897
        },
        {
            "id": "h9tqphq",
            "score": 1,
            "text": "TIL Davy Crockett was a real person",
            "title_similarity": "0.013580386",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9tqxe2",
            "score": 1,
            "text": "thats a lot to do for a 13 year old!",
            "title_similarity": "0.3497895",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9tr111",
            "score": 1,
            "text": "Because he came to the wrong address.",
            "title_similarity": "0.32749182",
            "sentiment_compound": -0.4767
        },
        {
            "id": "h9tr2rm",
            "score": 1,
            "text": "TIL Davy Crockett killed a bear when he was only three￼",
            "title_similarity": "0.63938093",
            "sentiment_compound": -0.6705
        },
        {
            "id": "h9tru30",
            "score": 4,
            "text": "You know the treatment of kids was bad when you were scared of your fathers reaction for standing up for yourself.",
            "title_similarity": "0.6986223",
            "sentiment_compound": -0.7506
        },
        {
            "id": "h9tsa0h",
            "score": 2,
            "text": "I have no way to show it since I don't have a copy of the family tree, (nor do I want to showcase my families and my identity like that) but Davys my ancestor. If I remember correctly he is my great great great grandfather. Can't remember if it's 3 or 4 'greats' but it's like, the only fun fact about my family",
            "title_similarity": "0.5879176",
            "sentiment_compound": 0.9812
        },
        {
            "id": "h9tsa8m",
            "score": 1,
            "text": "Ok im calling bullshit since this link doesn't provide any historical or academic source. It is widely known in the historical community that Davey Crockett was not only a fiction writer but is well known for telling \"tall tales\" as well in his professional life as well.",
            "title_similarity": "0.52215505",
            "sentiment_compound": 0.7311
        },
        {
            "id": "h9tsi9w",
            "score": 1,
            "text": "Christ. I was scared of my dad when I was kid, but this is a whole different level.",
            "title_similarity": "0.7250393",
            "sentiment_compound": -0.2382
        },
        {
            "id": "h9tsiuk",
            "score": 1,
            "text": "Now I have that stupid “Davy! Davy Crockett, King of the Wild Frontier!” Song stuck in my head.",
            "title_similarity": "0.5403305",
            "sentiment_compound": -0.717
        },
        {
            "id": "h9tsurc",
            "score": 2,
            "text": "It must have been so much easier to steal someone's identity back in the day, no videos or photos, you could turn up and claim to be anyone.",
            "title_similarity": "0.3858427",
            "sentiment_compound": -0.323
        },
        {
            "id": "h9tth2m",
            "score": 2,
            "text": "Time can certainly make its mark on someone physically, especially going through traumatic experiences/etc.",
            "title_similarity": "0.18651676",
            "sentiment_compound": -0.3744
        },
        {
            "id": "h9tudym",
            "score": 2,
            "text": "If his father was so dangerous that someone would leave home at 13 rather than face them, then I'm wondering if \"didn't recognize him\" is a polite way of saying \"chose not to recognize him.\" It's absolutely not out of the question, in my mind, that if the father was that bad, they could disown their own kid.",
            "title_similarity": "0.74273264",
            "sentiment_compound": -0.8267
        },
        {
            "id": "h9tv2lv",
            "score": 1,
            "text": "An older friend of mine is his direct descendant. How weird would it be to have a tv show about your great great great etc grandfather?",
            "title_similarity": "0.4516225",
            "sentiment_compound": 0.9413
        },
        {
            "id": "h9tv3ow",
            "score": 1,
            "text": "Puberty is a hell of a drug.",
            "title_similarity": "0.27459288",
            "sentiment_compound": -0.6808
        },
        {
            "id": "h9tvfm3",
            "score": 1,
            "text": "His name is David Crockett.",
            "title_similarity": "0.034178533",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9tvjyx",
            "score": 3,
            "text": "I think this says a lot more about Davy Crockett's father than about Davy Crockett",
            "title_similarity": "0.425178",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9tvu33",
            "score": 2,
            "text": "Dang, had to run away after standing up to his bully to avoid punishment. It's a good thing modern American school's protect the victims first and not the bully. /s",
            "title_similarity": "0.62119687",
            "sentiment_compound": -0.416
        },
        {
            "id": "h9tw4yg",
            "score": 1,
            "text": "Since when is it wrong to defend yourself against a bully?",
            "title_similarity": "0.48046303",
            "sentiment_compound": -0.743
        },
        {
            "id": "h9txmpe",
            "score": 1,
            "text": "Taking  1 for the team",
            "title_similarity": "0.05375082",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9txsah",
            "score": 1,
            "text": "One of my favorite historical frontiersman was a guy named, Simon Kenton. When he was a young lad he thought he killed a guy who was talking to a girl he liked and so he ran away and took the name, Simon Butler. \n\nEventually, years later, he learned that the guy lived and started using his real surname again. \n\nHe saved Daniel Boone’s life and did a bunch of other cool shit.",
            "title_similarity": "0.74875075",
            "sentiment_compound": 0.2023
        },
        {
            "id": "h9txzjo",
            "score": 1,
            "text": "How many people in this thread learned that Davy \"kilt him a 'bar when he was only three\" by watching Back To The Future?",
            "title_similarity": "0.65550095",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9tyjqu",
            "score": 2,
            "text": "> Crockett and his children lived for a short time with his brother’s family until he married Elizabeth Patton, a widow, in the late summer of 1815. She had two children from her first marriage, and together, Elizabeth and Davy had two more children.  \n\nand  \n\n> Crockett married widow Elizabeth Patton and had three more children named Robert, Rebecca, and Matilda.  \n\nWell researched indeed.",
            "title_similarity": "0.6086968",
            "sentiment_compound": 0.2732
        },
        {
            "id": "h9tzwp0",
            "score": 1,
            "text": "Photography wasnt really main stream until 50 years after Davy Crockett's death... nobody knew what the dude looked like at 13 let alone when he got back several years later",
            "title_similarity": "0.6802982",
            "sentiment_compound": -0.5267
        },
        {
            "id": "h9u1lvj",
            "score": 2,
            "text": "*morgan freeman’s voice*\n\nIt’s me. Davey",
            "title_similarity": "0.039280012",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9u1m35",
            "score": 3,
            "text": "Another frontiersman,  Simon Kenton/Butler had a similar story. He thought he had beaten a romantic rival to death and ran away. He changed his name to Butler and became a legend.  He later found he had not killed his rival. It's a fascinating story.\nhttps://en.wikipedia.org/wiki/Simon_Kenton",
            "title_similarity": "0.679752",
            "sentiment_compound": 0.4749
        },
        {
            "id": "h9u1pz0",
            "score": 4,
            "text": "killed a bear when he was only 3....",
            "title_similarity": "0.66644526",
            "sentiment_compound": -0.6705
        },
        {
            "id": "h9u5hcg",
            "score": 2,
            "text": "I'm not particularly impressed that they couldn't recognize him on his return.  Think about how much a body can change during puberty.",
            "title_similarity": "0.61325026",
            "sentiment_compound": -0.4158
        },
        {
            "id": "h9u8kp4",
            "score": 4,
            "text": "Damn his dad must have been a real bastard for him to be *that* afraid of him",
            "title_similarity": "0.6667625",
            "sentiment_compound": -0.7351
        },
        {
            "id": "h9u9ml8",
            "score": 1,
            "text": "Just another grifter.",
            "title_similarity": "0.12421204",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9uaapx",
            "score": 3,
            "text": "How common is this basic origin story?  [Simon Kenton](https://en.wikipedia.org/wiki/Simon_Kenton) beat a romantic rival nearly to death, but Kenton was so afraid he'd killed the guy that he ran away from home then and there, at 16.  His life as a frontiersman bears reading about and is scarcely to be believed.\n\nMinor connection - live within walking distance of the cabin he was born in, a spot I finally managed to locate last year.  Covid project.",
            "title_similarity": "0.8426828",
            "sentiment_compound": -0.8499
        },
        {
            "id": "h9uaq20",
            "score": 1,
            "text": "Another healthy reminder that we should teach ourselves to stand up to bullies.  Not to get rid of them.",
            "title_similarity": "0.36664137",
            "sentiment_compound": 0.4019
        },
        {
            "id": "h9uawnm",
            "score": 2,
            "text": "\"Killed him a bar when he was only three\"\n\nhttps://www.youtube.com/watch?v=83qUtyeyVt0",
            "title_similarity": "0.66090393",
            "sentiment_compound": -0.6705
        },
        {
            "id": "h9ub1kt",
            "score": 1,
            "text": "Neat history",
            "title_similarity": "-0.07354393",
            "sentiment_compound": 0.4588
        },
        {
            "id": "h9ub82q",
            "score": 2,
            "text": "TIL Davy Crockett is a real person!",
            "title_similarity": "0.011166234",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9uc8e6",
            "score": 1,
            "text": "Ok but who tf is Davy Crockett",
            "title_similarity": "0.16006915",
            "sentiment_compound": 0.1531
        },
        {
            "id": "h9udn96",
            "score": 3,
            "text": "Afraid of his dad, so he does something that takes 1000x more balls.\n\nEveryone is afraid of something, i guess",
            "title_similarity": "0.75088394",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9udxxk",
            "score": 3,
            "text": "Aahh , the good old days, when you could run away from home at 13 and nobody gave a shit.",
            "title_similarity": "0.6079253",
            "sentiment_compound": -0.1779
        },
        {
            "id": "h9ueutr",
            "score": 1,
            "text": "You could just do whatever back in the day.",
            "title_similarity": "-0.037220858",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9ufbrf",
            "score": 3,
            "text": "For all the shit my parents did, one thing thing got right was telling me if someone starts a fight I would not get in trouble for ending it.",
            "title_similarity": "0.45300627",
            "sentiment_compound": 0.5659
        },
        {
            "id": "h9ufwsr",
            "score": 1,
            "text": "He wrote an autobiography it's really good. He killed lots of bears.",
            "title_similarity": "0.5018724",
            "sentiment_compound": -0.3758
        },
        {
            "id": "h9ugea2",
            "score": 1,
            "text": "Davy Crockett, the definition of over reaction.",
            "title_similarity": "0.16983186",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9uhxh1",
            "score": 9,
            "text": "I also travel between three states: depression, intoxication, and New York.",
            "title_similarity": "0.34590352",
            "sentiment_compound": -0.5719
        },
        {
            "id": "h9uisjs",
            "score": 1,
            "text": "If he killed a bear when he was only three, why would he give two shits about what his dad was going to do?\n\nUnless his dad was a bad ass, too…",
            "title_similarity": "0.7953435",
            "sentiment_compound": -0.5574
        },
        {
            "id": "h9uk4ou",
            "score": 1,
            "text": "He also went off to Congress an' served a spell\n\nAn' patched up the crack in the Liberty Bell",
            "title_similarity": "0.5302071",
            "sentiment_compound": 0.5267
        },
        {
            "id": "h9uk5gl",
            "score": 1,
            "text": "TIL Davy Crockett was a looney guy",
            "title_similarity": "0.18837728",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9ul9rm",
            "score": 1,
            "text": "Plus he killt him a *bar* when he was only three.\n\n#DAAAAAAVY!\n\n#DAAAVY CROCKETT!\n\n**[King of the wild frontier!](https://www.youtube.com/watch?v=txcRQedoEyY)**",
            "title_similarity": "0.7345121",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9umbq9",
            "score": 1,
            "text": "did he escape on a garage door?",
            "title_similarity": "0.3294656",
            "sentiment_compound": 0.1779
        },
        {
            "id": "h9umc1l",
            "score": 1,
            "text": "Is it like \"we have a son but we don't think it's you\" or \" we have a son?\"",
            "title_similarity": "0.44426054",
            "sentiment_compound": 0.1901
        },
        {
            "id": "h9unspk",
            "score": 1,
            "text": "this interview includes a lot of unsavory facts about Davy Crockett. spoiler: he was awful\n\nhttps://www.npr.org/2021/06/16/1007186936/challenging-the-myths-of-the-alamo",
            "title_similarity": "0.5154352",
            "sentiment_compound": -0.7096
        },
        {
            "id": "h9uom9d",
            "score": 1,
            "text": "I thought he killed a bear when he was three.",
            "title_similarity": "0.6922476",
            "sentiment_compound": -0.6705
        },
        {
            "id": "h9up5b9",
            "score": 1,
            "text": "My Dad was scary like that.",
            "title_similarity": "0.44553012",
            "sentiment_compound": -0.1779
        },
        {
            "id": "h9upbl4",
            "score": 1,
            "text": "That's one way to avoid punishment.",
            "title_similarity": "0.033829432",
            "sentiment_compound": -0.6597
        },
        {
            "id": "h9urbis",
            "score": 2,
            "text": "The amount of people defending child slavery is horrifying.",
            "title_similarity": "0.45534128",
            "sentiment_compound": -0.8591
        },
        {
            "id": "h9ushix",
            "score": 1,
            "text": "What kind of Bart Simpson move is this?",
            "title_similarity": "0.27961934",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9usj7z",
            "score": 1,
            "text": "Born on a mountain top in Tennessee\n\nGreenest state in the land of the free\n\nKilled a mountain bear when he was only three\n\nDAVY, Davy Crockett, king of the wild frontier",
            "title_similarity": "0.64497864",
            "sentiment_compound": -0.1027
        },
        {
            "id": "h9utfec",
            "score": 2,
            "text": "People with strict parents will understand",
            "title_similarity": "0.117487356",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9utxfq",
            "score": 2,
            "text": "Wasn't his name David? Why does everyone call him Davy? The Disney movie?\nAsking because I am about to be a tenant in a building named after him and there is a debate about this in the office.",
            "title_similarity": "0.5051924",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9uulib",
            "score": 1,
            "text": "7th great uncle woop woop.( This isn't an invitation ICP fans).",
            "title_similarity": "0.38776118",
            "sentiment_compound": 0.6249
        },
        {
            "id": "h9uutl3",
            "score": 1,
            "text": "/r/yeoldekidsarestulid",
            "title_similarity": "0.05018253",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9uvr0u",
            "score": 2,
            "text": "I mean, if I were his old man, I'd have been shaking in my boots when my barely old enough to hold his own \"why does it get hard on its own?\" dick  who just kind of fucking ran into the woods to fight bears for food for a decade son comes back.  \n\nThere's not much you can say when your half your age kid comes home harder than a priest in a boys home, lays his knife on the table, and tells you to get supper ready.  He was probably wearing the bully for a set of long johns.",
            "title_similarity": "0.7872832",
            "sentiment_compound": -0.8271
        },
        {
            "id": "h9uwn0z",
            "score": 2,
            "text": "This was the most strikingly average TIL post. That’s it? That’s all he did?",
            "title_similarity": "0.14103466",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9uxfe5",
            "score": 1,
            "text": "Davey, Davey Crockett, King of the wild frontier…….",
            "title_similarity": "0.34172243",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9uxw86",
            "score": 2,
            "text": "He seems terrified of his dad. 😐",
            "title_similarity": "0.6002635",
            "sentiment_compound": -0.6124
        },
        {
            "id": "h9uyk26",
            "score": 1,
            "text": "Metal Gear Solid 3: Snake Eater.\nThats the first Time I've heard the name Davy Crockett.",
            "title_similarity": "0.46336317",
            "sentiment_compound": 0.1531
        },
        {
            "id": "h9uz0fb",
            "score": 2,
            "text": "King of the wild frontier? More like king of father abuse",
            "title_similarity": "0.5057178",
            "sentiment_compound": -0.3415
        },
        {
            "id": "h9uzc9v",
            "score": 2,
            "text": "How shitty is your family that you have to run away under those circumstances.",
            "title_similarity": "0.6515974",
            "sentiment_compound": -0.5574
        },
        {
            "id": "h9uzckc",
            "score": 2,
            "text": "I did that so often in high school.",
            "title_similarity": "0.25412965",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9uzn5f",
            "score": 3,
            "text": "Found this on Wikipedia..uh, what?\n\nMarriages and children\n\n\"Crockett fell in love with John Canady's niece Amy Summer, who was engaged to Canady's son Robert.[39] While serving as part of the wedding party, Crockett met Margaret Elder. He persuaded her to marry him, and a marriage contract was drawn up on October 21, 1805.[40] Margaret had also become engaged to another young man at the same time and married him instead.[41]\"",
            "title_similarity": "0.5179607",
            "sentiment_compound": 0.9062
        },
        {
            "id": "h9v010f",
            "score": 1,
            "text": "I learned that to just now thank you",
            "title_similarity": "-0.093748815",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h9v35gr",
            "score": 1,
            "text": "[The Ballet of Davy Crockett] (https://youtu.be/txcRQedoEyY)",
            "title_similarity": "0.19599122",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9v4k0e",
            "score": 1,
            "text": "Didn’t he kill a 3 year old bear, or something?",
            "title_similarity": "0.66922903",
            "sentiment_compound": -0.6908
        },
        {
            "id": "h9v6dpe",
            "score": 2,
            "text": "imagine just 2 and half years and they couldn't recognize you? what kind of job could do that to your face and body? I mean surely he didn't grow a monstrous and glorious beard, it's just over 2 years and he's 15 16 by then. he didn't shower for 2 years and show up like a street beggar? wtf",
            "title_similarity": "0.77357256",
            "sentiment_compound": 0.7461
        },
        {
            "id": "h9v7jde",
            "score": 2,
            "text": "Now this is a good post thank you",
            "title_similarity": "-0.16868317",
            "sentiment_compound": 0.6597
        },
        {
            "id": "h9vbx1y",
            "score": 1,
            "text": "Was it because he was wearing a dress?",
            "title_similarity": "-0.025347676",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9vh4lx",
            "score": 1,
            "text": "I always look at pics of Davy and see an old friend of mine. He is Davy’s great great great great nephew and they look exactly alike",
            "title_similarity": "0.36539865",
            "sentiment_compound": 0.9666
        },
        {
            "id": "h9vic5n",
            "score": 2,
            "text": "It's a similar story for Simon Kenton. He thought he killed someone when he was a teenager so he ran off changed his name to Simon Butler and gathered a bit of fame in the frontier. Turns out the person didn't die so he just started going by Simon Kenton again.",
            "title_similarity": "0.8019903",
            "sentiment_compound": 0.1396
        },
        {
            "id": "h9vir5e",
            "score": 3,
            "text": "Bruh why would u run if I attacked my bully my dad would pay one in the back and say “good job”",
            "title_similarity": "0.6744547",
            "sentiment_compound": -0.765
        },
        {
            "id": "h9vjp7c",
            "score": 2,
            "text": "Fuck Davy's dad!",
            "title_similarity": "0.5128936",
            "sentiment_compound": -0.5848
        },
        {
            "id": "h9vmojn",
            "score": 1,
            "text": "This is very similar to Simon Kenton’s story. In many cases, Simon Kenton’s actions have been attributed to others.",
            "title_similarity": "0.17258963",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9vmub9",
            "score": 1,
            "text": "This is not common knowledge, taught in US middle school?",
            "title_similarity": "0.4879946",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9vptr9",
            "score": 1,
            "text": "Davey Crocket did more at being a man at ages 13, 14, and 15, than pretty much every guy on reddit in their entire life.",
            "title_similarity": "0.48508924",
            "sentiment_compound": 0.4939
        },
        {
            "id": "h9vpvij",
            "score": 1,
            "text": "He also lied a lot.",
            "title_similarity": "0.34217545",
            "sentiment_compound": -0.3818
        },
        {
            "id": "h9vqduu",
            "score": 1,
            "text": "He pulled an Enzo matrix from the sounds of it, probably referred to himself as a separate name too!",
            "title_similarity": "0.3970547",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9vu4se",
            "score": 1,
            "text": "Texan cowards lost at the Alamo against a few thousand Mexicans  300 Spartans killed 250 thousand Persian before they died only with sharp sticks and short swords",
            "title_similarity": "0.63658464",
            "sentiment_compound": -0.886
        },
        {
            "id": "h9vv1u1",
            "score": 1,
            "text": "Real name was Hans Sprungfeld",
            "title_similarity": "0.06093023",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9w4wbl",
            "score": 1,
            "text": "Now that’s a comic book origin story",
            "title_similarity": "0.09446736",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9wopf8",
            "score": 1,
            "text": "It sucks he had to beat up his dad in front of the whole class /jk",
            "title_similarity": "0.7170415",
            "sentiment_compound": -0.3612
        },
        {
            "id": "h9xqed2",
            "score": 1,
            "text": "Davy Crockett scammed my family.\nI’ll tell the story later.",
            "title_similarity": "0.57263875",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9y20wa",
            "score": 1,
            "text": "If you want to hear something amazing check out Tim Curry singing the Ballad of Davy Crockett: https://www.youtube.com/watch?v=az91u7ni1Q4",
            "title_similarity": "0.33243397",
            "sentiment_compound": 0.6249
        },
        {
            "id": "ha5qy5h",
            "score": 2,
            "text": "Davy Crockett was a real person.",
            "title_similarity": "-0.015760591",
            "sentiment_compound": 0.0
        },
        {
            "id": "had7abc",
            "score": 1,
            "text": "\"My old man made the Great Santini look like Leo Buscaglia.\" \\~ Dennis Miller",
            "title_similarity": "0.3270682",
            "sentiment_compound": 0.765
        },
        {
            "id": "hdetw79",
            "score": 1,
            "text": "Davy...\n\nDavy Crockett!",
            "title_similarity": "0.13102217",
            "sentiment_compound": 0.0
        },
        {
            "id": "hi7qbcm",
            "score": 1,
            "text": "That punishment was apparently worse than homeless in 1800 wow.",
            "title_similarity": "0.41262984",
            "sentiment_compound": -0.3612
        }
    ]
}