{
    "TIL Harrison Ford was frozen in The Empire Strikes Back because, unlike Carrie Fisher and Mark Hamill, Ford had only signed on for two films. After the success of Raiders of the Lost Ark, Lucas didn't think Ford would return for the 3rd Star Wars film, but left him frozen just in case.\n": [
        {
            "id": "hbvpudw",
            "score": -3,
            "text": "I can’t be the only one who thought they actually froze the actor Harrison Ford after reading the title",
            "title_similarity": "0.7246614",
            "sentiment_compound": 0.0
        },
        {
            "id": "hbvlxfw",
            "score": -8,
            "text": "I remember watching in the theater when his son stabbed him with a lightsaber.",
            "title_similarity": "0.41328144",
            "sentiment_compound": -0.4404
        },
        {
            "id": "hbvxx1o",
            "score": 0,
            "text": "same say he is still frozen ...",
            "title_similarity": "0.22495598",
            "sentiment_compound": 0.0
        },
        {
            "id": "hbwbzb6",
            "score": 0,
            "text": "[deleted]",
            "title_similarity": "0.14139032"
        },
        {
            "id": "hbvvh08",
            "score": -3,
            "text": "Shoulda let him die. He had zero arc and absolutely nothing to do.",
            "title_similarity": "0.5310154",
            "sentiment_compound": -0.5994
        },
        {
            "id": "hbvnw3a",
            "score": -10,
            "text": "Lucas did Indiana jones as well,  how would he not have known?",
            "title_similarity": "0.55987036",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hbw8n64",
            "score": -1,
            "text": "Wait Harrison Ford was only in two of the OG Star Wars movies?",
            "title_similarity": "0.68670905",
            "sentiment_compound": -0.5574
        },
        {
            "id": "hbw9ovj",
            "score": -1,
            "text": "[deleted]",
            "title_similarity": "0.14139032"
        },
        {
            "id": "hbvm8hx",
            "score": 2,
            "text": "New to me! Awesome!",
            "title_similarity": "0.07548686",
            "sentiment_compound": 0.6892
        },
        {
            "id": "hbvqekx",
            "score": 1,
            "text": "I know.",
            "title_similarity": "-0.2013981",
            "sentiment_compound": 0.0
        },
        {
            "id": "hbw64ec",
            "score": 2,
            "text": "\"I know.\"",
            "title_similarity": "-0.17499274",
            "sentiment_compound": 0.0
        },
        {
            "id": "hbw7qnh",
            "score": 2,
            "text": "I know",
            "title_similarity": "-0.21021596",
            "sentiment_compound": 0.0
        },
        {
            "id": "hbwk5v2",
            "score": 3,
            "text": " Dear every piece of shit screenwriter in Hollywood today. Follow this lead. If you aren't bringing back a beloved character just because of contract stuff *DO NOT* kill them off out of pettiness or some shit. Hell I'd say if you did not create the character and don't have expressed permission from the original writer, DO NO kill off that character. So many franchises have been ruined because of this. Notably anything after Aliens, the Star Wars Sequels, Halloween and Nightmare on Elm Street suffer the worst from this. Seriously when the fuck did people just think that a dead character automatically meant it made a story good or exciting. I think Game of Thrones tainted everyone's perception of character deaths, like that automatically made the drama higher or story better or some shit. Here is a hint, it doesn't not the way half the fucking hacks write in Hollywood.",
            "title_similarity": "0.7349931",
            "sentiment_compound": -0.9483
        },
        {
            "id": "hbwq0ay",
            "score": -1,
            "text": "He is such an ungrateful ass, George gave him 2 of his 4 best characters and the one he is probably most loved for has always been such an issue for him. He's not even an amazing actor, just great in certain roles, namely Han, Indy, Jack Ryan and Deckard (I'm not a fan but clearly I'm in the minority on this one). Other than that he just did a bunch of law enforcement type movies, and one time he kicked a dude off his plane.",
            "title_similarity": "0.60583687",
            "sentiment_compound": 0.7252
        },
        {
            "id": "hbvyzjd",
            "score": 3,
            "text": "That explains a lot. And in a way good for him: he was among the few who had a career outside of Star Wars. \n\nGood move too! Instead of killing him off he was just in a space freezer. Chuckles.",
            "title_similarity": "0.55702674",
            "sentiment_compound": -0.3382
        },
        {
            "id": "hbw13js",
            "score": 31,
            "text": "~~Harrison Ford was also originally not ment to have a part in the original star wars, he was working as a carpenter at the time and only went along to the reading because one of his agents believed he had talent, he was told by George Lucas multiple times that he was only there to read lines and that nothing would come from it.~~\n\n~~He read the lines with a less than impressed demeanor, almost cocky, which funnily enough was exactly what George was looking for in Han Solo, he was offered the part after a whole day of reading lines.~~\n\nEdit: as pointed out by a user this may not be 100% accurate, I'm recalling from memory of a documentary I watched and am now questioning if it was accurate.\n\nEdit 2: read down further I got this wrong, sorry guys",
            "title_similarity": "0.827683",
            "sentiment_compound": 0.1093
        },
        {
            "id": "hbx3oyy",
            "score": 0,
            "text": "/r/shittymoviedetails",
            "title_similarity": "0.23338316",
            "sentiment_compound": 0.0
        },
        {
            "id": "hbxvs48",
            "score": 0,
            "text": "Everything you love about Star Wars was a goddamn accident and so were you enjoy life……… while you can",
            "title_similarity": "0.5912088",
            "sentiment_compound": -0.2815
        },
        {
            "id": "hbyqsh3",
            "score": 0,
            "text": "In a weird way, this makes me more forgiving of the Disney trilogy. They were flying by the seat of their pants just as much as Lucas was back in the day. Lucas just got really really lucky over and over again. And Disney didn’t.",
            "title_similarity": "0.6184911",
            "sentiment_compound": 0.7063
        },
        {
            "id": "hbvv5pc",
            "score": 24,
            "text": "Sorry but empire strikes back is only the best because George Lucas had very little to do with it. His wife fixed his garbage script and wrote a fantastic screenplay.",
            "title_similarity": "0.7004175",
            "sentiment_compound": 0.8519
        },
        {
            "id": "hbvwt04",
            "score": 1,
            "text": "\"Thats two you owe me lucas\" 😭😂😭😂",
            "title_similarity": "0.25465938",
            "sentiment_compound": -0.1027
        },
        {
            "id": "hbw1nn8",
            "score": 1,
            "text": "He really left him on ice",
            "title_similarity": "0.38667747",
            "sentiment_compound": 0.0
        },
        {
            "id": "hbw64hy",
            "score": 1,
            "text": "Holy shit this is amazing",
            "title_similarity": "-0.103762455",
            "sentiment_compound": 0.0516
        },
        {
            "id": "hbwrh58",
            "score": -1,
            "text": "You've gotta respect a man's commitment to his religion.",
            "title_similarity": "0.20303662",
            "sentiment_compound": 0.6908
        },
        {
            "id": "hbwsev7",
            "score": 1,
            "text": "So funny that this factoid came up today. Me and my husband are currently rewatching all the Star Wars movies, one a week, and episode 5 was tonight.",
            "title_similarity": "0.5076573",
            "sentiment_compound": -0.1045
        },
        {
            "id": "hbx1fta",
            "score": 1,
            "text": "Indiana Jones over Star Wars any day",
            "title_similarity": "0.4089824",
            "sentiment_compound": -0.5574
        },
        {
            "id": "hbvll7y",
            "score": 14,
            "text": "TIL indeed",
            "title_similarity": "-0.0807787",
            "sentiment_compound": 0.0
        },
        {
            "id": "hbvonyn",
            "score": 35,
            "text": "Harrison Ford wasn't frozen. Han Solo was",
            "title_similarity": "0.23317677",
            "sentiment_compound": 0.0
        },
        {
            "id": "hbvwtky",
            "score": 2,
            "text": "what could have been.",
            "title_similarity": "-0.04172915",
            "sentiment_compound": 0.0
        },
        {
            "id": "hbvyh60",
            "score": 2,
            "text": "Could you imagine thats just how it ended with Han Solo?",
            "title_similarity": "0.29456523",
            "sentiment_compound": 0.0
        },
        {
            "id": "hbx7hjq",
            "score": -2,
            "text": "Honestly it seems like Harrison Ford was a giant pain in the ass to deal with",
            "title_similarity": "0.4842926",
            "sentiment_compound": -0.3182
        },
        {
            "id": "hbxaiou",
            "score": -2,
            "text": "Is Star Wars still worth watching ? Haven’t seen any yet",
            "title_similarity": "0.6223527",
            "sentiment_compound": -0.4019
        },
        {
            "id": "hbvmf0e",
            "score": -30,
            "text": "[deleted]",
            "title_similarity": "0.14139032"
        },
        {
            "id": "hbvyipm",
            "score": 2,
            "text": "If you had never seen the Star Wars films, one would assume George Lucas freezes and thaws Ford according to his need.",
            "title_similarity": "0.79197025",
            "sentiment_compound": -0.5719
        },
        {
            "id": "hbvzlhq",
            "score": 2,
            "text": "Didn't Lucas also help produce Indiana Jones? I know he and Spielberg are bros.",
            "title_similarity": "0.6375413",
            "sentiment_compound": -0.3089
        },
        {
            "id": "hbwd744",
            "score": 3,
            "text": "I'm just going to take the title literally and believe that Lucas literally had Ford encased in Carbonite until he wanted to use him in another film.",
            "title_similarity": "0.68526363",
            "sentiment_compound": 0.0
        },
        {
            "id": "hbvla3c",
            "score": 55,
            "text": "but how did he do the other movie if he was frozen",
            "title_similarity": "0.68704355",
            "sentiment_compound": 0.0
        },
        {
            "id": "hbvqtw3",
            "score": 150,
            "text": "That would have been a huger finale of Solo and Leia if he'd stayed frozen.. like if that had never been resolved for like 30 years, since the next movies were prequels, they couldn't explain it either.  Maybe in the far future, he unthaws still young, but she's old now....  That storyline has LOTS of potential.  They even could have tried to save him and fail in ROTJ.  \n\n\nEDIT:  OH maybe they have a daughter together, and then when he's finally dethawed, he's the same age as his kid.  Skywalker pretended to be asleep, but he heard the whole thing too.",
            "title_similarity": "0.755031",
            "sentiment_compound": 0.2001
        },
        {
            "id": "hbw3tjt",
            "score": 4,
            "text": "This is a “what if” story idea if I’ve ever heard one. While he wasn’t important to the plot of the end battle (anybody could’ve stormed the Endor bunker) it’s hard to imagine them reconciling the Jabba scenes if Han wasn’t recoverable, especially since we know that’s where Han was headed. Would Leia have ended up with Lando? There was little chemistry plus he was the reason for Han’s capture. They would’ve had to either write a new love story for Leia (weird thing to squeeze into the finale) or left her awkwardly single with her best action coming from her own brother. The resolution of the Leia Han Luke “love triangle” was pretty important especially as it tied in with Vader being their father and a literal family emerging out of the last film (for Disney to piss away 40 years later)",
            "title_similarity": "0.788653",
            "sentiment_compound": 0.7579
        },
        {
            "id": "hbwbqkd",
            "score": 3,
            "text": "*30 years later when they meet up again*\n\nLeia: You know all anyone talks about when we rescued  you was me in that gold bikini. \n\nHan: …you were in a gold bikini? I was fucking blind, I missed it. By the time I got my sight back you were in commando fatigues. \n\nLeia: I could put it on now if you want.\n\nHan: Um…nah I’m good.",
            "title_similarity": "0.5271405",
            "sentiment_compound": -0.1918
        },
        {
            "id": "hbwh2uq",
            "score": 4,
            "text": "TIL they did not freeze the character, they froze Harrison Ford himself",
            "title_similarity": "0.7231013",
            "sentiment_compound": -0.0382
        },
        {
            "id": "hbvzzjh",
            "score": 5,
            "text": "Also read that Harrison Ford really really wanted to be killed off in ROTJ too, but lucas didn't want to.  At least Ford got his wish in TFA with that stupid shitty kill-off.",
            "title_similarity": "0.7273128",
            "sentiment_compound": -0.876
        },
        {
            "id": "hbwq5zg",
            "score": -6,
            "text": "Eveyone knows",
            "title_similarity": "-0.10034143",
            "sentiment_compound": 0.0
        },
        {
            "id": "hbws97d",
            "score": -5,
            "text": "This is pretty common knowledge. Just sayin",
            "title_similarity": "-0.015283152",
            "sentiment_compound": 0.4939
        },
        {
            "id": "hbwe33k",
            "score": 6,
            "text": "In other news, Steve Buscemi was a firefighter during 9/11",
            "title_similarity": "0.37911716",
            "sentiment_compound": 0.0
        },
        {
            "id": "hbvmrrs",
            "score": 261,
            "text": "> just ~~in case~~ *encased*\n\nftfy",
            "title_similarity": "0.083565205",
            "sentiment_compound": 0.0
        },
        {
            "id": "hbw85jv",
            "score": 16,
            "text": "I don’t think Harrison Ford even liked Star Wars",
            "title_similarity": "0.69000494",
            "sentiment_compound": -0.2023
        },
        {
            "id": "hbweyhl",
            "score": 19,
            "text": "I love how the title implies Ford himself was actually frozen.\n\n#\n\nFord: I dunno if I wanna do the third one. \n#\n\nLucas: Oh you're coming back for the third one. Trust me.",
            "title_similarity": "0.5674029",
            "sentiment_compound": 0.8176
        },
        {
            "id": "hbvw8mi",
            "score": 190,
            "text": "Something isn't right here.\n\nHarrison Ford wasn't cast as Indiana Jones until after The Empire Strikes Back was released.\n\nThe plot of The Empire Strikes Back was not at all influenced by Raiders of the Lost Ark.",
            "title_similarity": "0.80784506",
            "sentiment_compound": -0.743
        },
        {
            "id": "hbvpb28",
            "score": 141,
            "text": "Thaw Wars",
            "title_similarity": "0.2510295",
            "sentiment_compound": -0.5574
        },
        {
            "id": "hbvtuvk",
            "score": 103,
            "text": "Am I the only one who thought they were in r/shittymoviedetails for a moment?",
            "title_similarity": "0.3603902",
            "sentiment_compound": 0.0
        },
        {
            "id": "hbvsev0",
            "score": 484,
            "text": "I guess that would explain why Han's character was so watered-down and pointless in Return of the Jedi. Writers never planned for him to be there.",
            "title_similarity": "0.7502055",
            "sentiment_compound": 0.0
        },
        {
            "id": "hbvv4xc",
            "score": 42,
            "text": "I feel like this is just a rumor. Han was already confirmed to be alive in ESB, so it's not like his fate was ambiguous.",
            "title_similarity": "0.4121961",
            "sentiment_compound": 0.4071
        },
        {
            "id": "hbvn6ji",
            "score": 1113,
            "text": "I wonder if this post was inspired by yesterday's painted over cockroach.",
            "title_similarity": "0.43202966",
            "sentiment_compound": 0.4939
        },
        {
            "id": "hbwiu84",
            "score": 74,
            "text": "Fun Fact: George Lucas had never frozen anyone in Carbonite before Harrison Ford.\nIt was an experiment that paid off with Lucas eventually freezing many of his friends, family and colleagues- many of whom are proudly displayed in his house to this day, frozen in time.",
            "title_similarity": "0.62614655",
            "sentiment_compound": 0.8625
        },
        {
            "id": "hbvtear",
            "score": 1063,
            "text": "Ford said he thought Han should've died in Empire, and his lackluster performance in RotJ is because he didn't understand his character's motivations or what he was supposed to be doing.  He only agreed to do the Force Awakens if he died.",
            "title_similarity": "0.818463",
            "sentiment_compound": -0.7269
        },
        {
            "id": "hbw605a",
            "score": 83,
            "text": "Harrison Ford wasn't signed to Star Wars beyond the first sequel. That is a valid point. The idea that this was tied to Raiders isn't, that movie was released the year after Empire.",
            "title_similarity": "0.848096",
            "sentiment_compound": -0.5574
        },
        {
            "id": "hbvmuh0",
            "score": 1854,
            "text": "He has been trying to quit SW since the first movie. Just a paycheck to him.",
            "title_similarity": "0.6783681",
            "sentiment_compound": 0.0
        },
        {
            "id": "hbvjz2s",
            "score": 7176,
            "text": "Good thing he came back ...",
            "title_similarity": "0.069357224",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hbvrxrx",
            "score": 6400,
            "text": "Everything you loved in Star Wars came from contract disputes.",
            "title_similarity": "0.45242757",
            "sentiment_compound": -0.2023
        },
        {
            "id": "hbw2qpo",
            "score": 4502,
            "text": "Harrison Ford to this day continues to not give a fuck about Star Wars, and that’s totally fine.",
            "title_similarity": "0.64334875",
            "sentiment_compound": 0.0882
        },
        {
            "id": "hbvrapd",
            "score": 2,
            "text": "Practical!",
            "title_similarity": "-0.056011487",
            "sentiment_compound": 0.0
        },
        {
            "id": "hbvxcxs",
            "score": 2,
            "text": "Hollywood keeps lots of actors on ice.",
            "title_similarity": "0.32632476",
            "sentiment_compound": 0.0
        },
        {
            "id": "hbvz7yt",
            "score": 2,
            "text": "He'd have to be insane not to come back, He had to have made a fortune off of his appearance in episode 6",
            "title_similarity": "0.56933415",
            "sentiment_compound": -0.4019
        },
        {
            "id": "hbw0ytq",
            "score": 2,
            "text": "Also his line before being frozen was improv. She said I love you and I think he was supposed to say I love you too. But Harrison Ford was like I felt like Han solo would say something else so he went with \"I know\"",
            "title_similarity": "0.7107298",
            "sentiment_compound": 0.8934
        },
        {
            "id": "hbw199f",
            "score": 2,
            "text": "Lando also died (and the Falcon was destroyed) in an earlier draft of Return of the Jedi, but it was changed to make the ending more upbeat. Han still foreshadows this when he says he has a feeling he'll never see her (the Falcon) again",
            "title_similarity": "0.7721435",
            "sentiment_compound": -0.3919
        },
        {
            "id": "hbw26s5",
            "score": 2,
            "text": "Anyone think what would have happened if they pushed his carbonite slab the other way by accident?  Would it have crushed his face and hands that were sticking out?",
            "title_similarity": "0.6219804",
            "sentiment_compound": -0.7399
        },
        {
            "id": "hbw26zf",
            "score": 2,
            "text": "Hey, it's him.",
            "title_similarity": "-0.031531803",
            "sentiment_compound": 0.0
        },
        {
            "id": "hbw2qw9",
            "score": 8,
            "text": "He wanted to be killed off like Alec Guinness",
            "title_similarity": "0.49056908",
            "sentiment_compound": -0.4588
        },
        {
            "id": "hbw3638",
            "score": 2,
            "text": "There was a company it of Boston MA named after this freezing material. I think it was called Carbonite",
            "title_similarity": "0.39422727",
            "sentiment_compound": -0.128
        },
        {
            "id": "hbw3wex",
            "score": 3,
            "text": "Jedi honestly would’ve been stronger for it. I love Jabba’s Palace, but, it’s essentially irrelevant to the story (sort of like a super extended Bond intro) because Han goes on to do nothing for the rest of the film. \n\nIf he was gone entirely, that would’ve streamlined so much (the other solution obviously being instead tying the Jabba stuff more into the plot by having something set up there that pays off: a revelation from Boba Fett about the Empire’s second Death Star, Han’s piloting abilities solving a problem that only he can solve in the second half, etc). \n\nIt’s always felt like two films stapled together to me, and the pacing in the centre just sinks like a rock when they have to exposit what the actual plot of the film is.",
            "title_similarity": "0.7805128",
            "sentiment_compound": 0.9525
        },
        {
            "id": "hbw5sco",
            "score": 4,
            "text": "Ford also thought Solo should die in Return of the Jedi.  but hey at least he got his wish in the force awakens!",
            "title_similarity": "0.65951675",
            "sentiment_compound": 0.3382
        },
        {
            "id": "hbw6zn5",
            "score": 218,
            "text": "I've heard that this is why Lando is inexplicably wearing a remarkably similar outfit to Han's in the last part of *Empire* (white shirt, black vest) - they wanted him to be subliminally suggested as Han's replacement in RotJ.\n\nI don't have a source, but Lando is wearing a wearing the same outfit and it's kind of weird when you know about it.",
            "title_similarity": "0.5944343",
            "sentiment_compound": -0.359
        },
        {
            "id": "hbw83pt",
            "score": 3,
            "text": "Not only that, but Harrison Ford wanted Han to be killed off in *Return of the Jedi*. He only got what he wanted 40 years later in *The Force Awakens*.",
            "title_similarity": "0.7709062",
            "sentiment_compound": -0.8047
        },
        {
            "id": "hbw93lk",
            "score": 2,
            "text": "Sseriously?....please tell me you threw out the bullshit flag.....right?",
            "title_similarity": "0.30656743",
            "sentiment_compound": -0.6322
        },
        {
            "id": "hbw9mia",
            "score": 3,
            "text": "What about a “what if” story where Solo was hidden and not unfrozen until a long after Return of the Jedi, and he has to piece together of what happened.",
            "title_similarity": "0.6413101",
            "sentiment_compound": 0.0
        },
        {
            "id": "hbw9y5j",
            "score": 2,
            "text": "And the rest is history.",
            "title_similarity": "0.1583068",
            "sentiment_compound": 0.0
        },
        {
            "id": "hbwa70f",
            "score": 3,
            "text": "It's the same reason Picard gets assimilated, and the Enterprise prepares to blow up the Borg Cube at the end of \"Best of Both Worlds Part 1.\"",
            "title_similarity": "0.4524709",
            "sentiment_compound": 0.6369
        },
        {
            "id": "hbwa827",
            "score": 2,
            "text": "Thank god he came back. He was the best part of the original trilogy for me.",
            "title_similarity": "0.3592049",
            "sentiment_compound": 0.8779
        },
        {
            "id": "hbwaa60",
            "score": 2,
            "text": "I know",
            "title_similarity": "-0.21021596",
            "sentiment_compound": 0.0
        },
        {
            "id": "hbwayoj",
            "score": 2,
            "text": "I did not know that!",
            "title_similarity": "0.1585297",
            "sentiment_compound": 0.0
        },
        {
            "id": "hbwbb7k",
            "score": 2,
            "text": "Til this from your post. I love random facts like this.",
            "title_similarity": "0.19159807",
            "sentiment_compound": 0.7717
        },
        {
            "id": "hbwbvf9",
            "score": 6,
            "text": "But, wait, everyone...I thought Lucas had everything plotted out and planned from the very beginning!\n\n/s",
            "title_similarity": "0.2998407",
            "sentiment_compound": 0.0
        },
        {
            "id": "hbwc3kh",
            "score": 3,
            "text": "We love him.\n\nAnd he knows.",
            "title_similarity": "0.001977453",
            "sentiment_compound": 0.6369
        },
        {
            "id": "hbwcbfr",
            "score": 2,
            "text": "I thought this title meant in carbonite.",
            "title_similarity": "0.21971533",
            "sentiment_compound": 0.0
        },
        {
            "id": "hbwcc2l",
            "score": 3,
            "text": "I want to see David Lynch “Return of the Jedi”",
            "title_similarity": "0.41937274",
            "sentiment_compound": 0.0772
        },
        {
            "id": "hbwcihu",
            "score": 2,
            "text": "It’s surprising this isn’t done more often by film producers. Makes for a great negotiating position for the next film. \n\nThe star actor wants an extra $10m for the next film - ………",
            "title_similarity": "0.5443122",
            "sentiment_compound": 0.7351
        },
        {
            "id": "hbwcuch",
            "score": 5,
            "text": "It happened to work out in this case, but I really hate the whole concept of business factors determining movie plots.",
            "title_similarity": "0.68393457",
            "sentiment_compound": -0.7572
        },
        {
            "id": "hbwcuey",
            "score": 5,
            "text": "And then years later he finally got his wish to be killed off Star Wars for good… until he came back as a hallucination of his on-screen son… so… I guess there’s no rest for the Han.",
            "title_similarity": "0.7476539",
            "sentiment_compound": -0.8225
        },
        {
            "id": "hbwcye7",
            "score": 5,
            "text": "Imagine the amount of cameos his frozen corpse would have made trough out the series.",
            "title_similarity": "0.5323057",
            "sentiment_compound": -0.5719
        },
        {
            "id": "hbwds16",
            "score": 2,
            "text": "Plot twist - Ford was actually frozen. It wasn't an effect.",
            "title_similarity": "0.5764975",
            "sentiment_compound": 0.0
        },
        {
            "id": "hbwdyzi",
            "score": 2,
            "text": "*just encased",
            "title_similarity": "0.04660825",
            "sentiment_compound": 0.0
        },
        {
            "id": "hbweev2",
            "score": 2,
            "text": "Bullshit",
            "title_similarity": "0.06821306",
            "sentiment_compound": -0.5859
        },
        {
            "id": "hbwf1uk",
            "score": 3,
            "text": "It like trying to organise a D&D campaign plot arc around the probability that Fred shows up next week, except with tens of millions of dollars.",
            "title_similarity": "0.51846945",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hbwgswb",
            "score": 2,
            "text": "Ford wanted Lucas to kill of Han in Empire, but Lucas refused to do so as it would have hurt toy sales",
            "title_similarity": "0.80265677",
            "sentiment_compound": -0.882
        },
        {
            "id": "hbwhkt4",
            "score": 2,
            "text": "He literally Han solo’d his role as Han Solo",
            "title_similarity": "0.27552587",
            "sentiment_compound": 0.0
        },
        {
            "id": "hbwhnqv",
            "score": 4,
            "text": "To be honest it was his stunt double who was frozen all that time.. but still .. pretty amazing commitment.",
            "title_similarity": "0.49560383",
            "sentiment_compound": 0.9437
        },
        {
            "id": "hbwi297",
            "score": 3,
            "text": "Another Star franchise also did this. Picard abducted by the Borg at the end of Star Trek TNG s3 was a way to write him out if Patrick Stewart didn't renew his contract that made it easy to bring Jean-Luc back when the actor did return.",
            "title_similarity": "0.70960677",
            "sentiment_compound": -0.1027
        },
        {
            "id": "hbwitu1",
            "score": 2,
            "text": "That sentence doesn't make sense. Lucas didn't think he would return for the third film but left him frozen just in case?",
            "title_similarity": "0.82169145",
            "sentiment_compound": 0.0387
        },
        {
            "id": "hbwjiwt",
            "score": 2,
            "text": "Further cementing the fact that those two amazing films are honestly a fluke. Like many other great films of history. No shade intended. Lucas just won the lottery twice in a row.",
            "title_similarity": "0.62103814",
            "sentiment_compound": 0.9423
        },
        {
            "id": "hbwjwln",
            "score": 2,
            "text": "he also only agreed to the force awakens if they killed him off",
            "title_similarity": "0.5698652",
            "sentiment_compound": -0.5267
        },
        {
            "id": "hbwjzj5",
            "score": 4,
            "text": "Just encase",
            "title_similarity": "-0.073201284",
            "sentiment_compound": 0.0
        },
        {
            "id": "hbwkbt3",
            "score": 3,
            "text": "Kinda hard for him to NOT do a 3rd movie if hes frozen for later. Smart.",
            "title_similarity": "0.67012286",
            "sentiment_compound": 0.3804
        },
        {
            "id": "hbwl57v",
            "score": 2,
            "text": "That’s a long ass play. I mean that was set up in the first movie.",
            "title_similarity": "0.4532858",
            "sentiment_compound": -0.2732
        },
        {
            "id": "hbwlbcy",
            "score": 2,
            "text": "...when your pal freezes you \"just in case\".",
            "title_similarity": "0.4394663",
            "sentiment_compound": -0.0258
        },
        {
            "id": "hbwls94",
            "score": 2,
            "text": "So much bullshit in this article.",
            "title_similarity": "0.17476612",
            "sentiment_compound": -0.6222
        },
        {
            "id": "hbwm8z3",
            "score": 2,
            "text": "I know",
            "title_similarity": "-0.21021596",
            "sentiment_compound": 0.0
        },
        {
            "id": "hbwn3en",
            "score": 3,
            "text": "I hate this thread and everyone in it.\n\n\"Everyone who played in Star Wars hated it.\"\n\"Nobody thought it had a chance.\"\n\"They didn't even have full scripts.\"\n\nMight as well have a thread pissing on my mother.. :|",
            "title_similarity": "0.66567075",
            "sentiment_compound": -0.8779
        },
        {
            "id": "hbwn695",
            "score": 1,
            "text": "Thought I was in r/ShittyMovieDetails at first. Well played.",
            "title_similarity": "0.34316266",
            "sentiment_compound": 0.5423
        },
        {
            "id": "hbwn6pq",
            "score": 6,
            "text": "Title makes it sound like Lucas actually froze Harrison Ford the actor for reals until he agreed to do the third film.",
            "title_similarity": "0.8271276",
            "sentiment_compound": 0.5574
        },
        {
            "id": "hbwntej",
            "score": 1,
            "text": "It really shows you how good George Lucas was at setting universes/IP.\n\nMany people bash the prequels but even then it was able to have room for an opportunity to be fixed or improved. Unlike the Sequel trilogy.",
            "title_similarity": "0.56695604",
            "sentiment_compound": 0.8689
        },
        {
            "id": "hbwoimh",
            "score": 1,
            "text": "It would’ve made his return in the sequels very different.",
            "title_similarity": "0.5467752",
            "sentiment_compound": 0.0
        },
        {
            "id": "hbwp4sq",
            "score": 1,
            "text": "\"The Star Wars films are in danger. Please, Harrison, I need you.\"",
            "title_similarity": "0.5123565",
            "sentiment_compound": -0.6908
        },
        {
            "id": "hbwq50y",
            "score": 1,
            "text": "Thanks to Nostalgia critic this only makes me imagine a heated discussion between Harrison Ford and George Lucas and just when Lucas thinks he's got the upper hand, Harrison let's out a \"Christ, I was frozen today!\"",
            "title_similarity": "0.69289196",
            "sentiment_compound": 0.6476
        },
        {
            "id": "hbwqn2m",
            "score": 2,
            "text": "Even at the time. I'm sure Harrison knew Star Wars was blowing up and not signing on would be a bonehead move.",
            "title_similarity": "0.6452615",
            "sentiment_compound": -0.3182
        },
        {
            "id": "hbwrabf",
            "score": 1,
            "text": "So if Harrisoj Ford didn't want to come back, would the last movie have been 40 minutes shorter?",
            "title_similarity": "0.6563546",
            "sentiment_compound": -0.0572
        },
        {
            "id": "hbwrpti",
            "score": 1,
            "text": "Technically speaking he wasn't frozen, he was carbonated.",
            "title_similarity": "0.25517464",
            "sentiment_compound": 0.0
        },
        {
            "id": "hbwv4gc",
            "score": 2,
            "text": "Harrison Ford also was not shy about his dislike of being Han Solo and the Star Wars films just like Alec Guinness, becoming Indiana Jones and a mainstream star was exactly what he wanted and George Lucas knew that, it’s why he assumed from the start he wouldn’t come back\n\nI have always loved the fact Ford wanted to get Han killed in RotJ lmao it’s the same reason he returned for the Disney sequels, they threw a bunch of money at him and promised to kill Han finally, he was like let’s do this",
            "title_similarity": "0.72150564",
            "sentiment_compound": -0.0926
        },
        {
            "id": "hbwwh2n",
            "score": 1,
            "text": "Haha like cabbage rolls.",
            "title_similarity": "0.06806646",
            "sentiment_compound": 0.6705
        },
        {
            "id": "hbwxl3n",
            "score": 3,
            "text": "Fun fact... Indiana Jones was involved in the death of 20 plus people through out the first 3 movies. And it's easily visible... gunshots, strangulation, decapitation, etc...",
            "title_similarity": "0.44987994",
            "sentiment_compound": 0.2023
        },
        {
            "id": "hbwxwfj",
            "score": 3,
            "text": "Also why his line to Leia after she says \"I love you\" is \"I know\". Read somewhere that it should have been \"I'll be back soon\" or something like that but whether he was coming back was up in the air at the time.",
            "title_similarity": "0.48035944",
            "sentiment_compound": 0.5187
        },
        {
            "id": "hbwyeor",
            "score": 2,
            "text": "That makes so much more sense now.",
            "title_similarity": "-0.07301915",
            "sentiment_compound": 0.0
        },
        {
            "id": "hbwz7vp",
            "score": 2,
            "text": "In hindsight. They would have known.  He had to have enough money by the time that movie with Anne Heche came out.",
            "title_similarity": "0.5390744",
            "sentiment_compound": 0.0
        },
        {
            "id": "hbx3c1y",
            "score": 1,
            "text": "If he wasnt Indiana Jones he would beg to be in star wars",
            "title_similarity": "0.59535885",
            "sentiment_compound": -0.5574
        },
        {
            "id": "hbx3i2o",
            "score": 2,
            "text": "So really they gave him a pay freeze......",
            "title_similarity": "0.4381624",
            "sentiment_compound": -0.0516
        },
        {
            "id": "hbx4g0l",
            "score": 2,
            "text": "Harrison Ford had been wanting his character to die probably since the end of A New Hope... I guess that's about 38 years that it took to get that.",
            "title_similarity": "0.64055264",
            "sentiment_compound": -0.25
        },
        {
            "id": "hbx4og2",
            "score": 5,
            "text": "Should you say Han was frozen between films and not Ford, I don't think he was stuck in a freezer for a couple years between films😅",
            "title_similarity": "0.7504946",
            "sentiment_compound": 0.128
        },
        {
            "id": "hbx4vv1",
            "score": 1,
            "text": "Im sorry, I dont get it. He was frozen?",
            "title_similarity": "0.40714478",
            "sentiment_compound": -0.0772
        },
        {
            "id": "hbx63cy",
            "score": 2,
            "text": "Wow imagine turning down a huge payday like that",
            "title_similarity": "0.33430415",
            "sentiment_compound": 0.8225
        },
        {
            "id": "hbx7quz",
            "score": 3,
            "text": "The title of this makes it sound like they just froze the actor, not his character.",
            "title_similarity": "0.5752362",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hbx9an4",
            "score": 1,
            "text": "Mr. Worf.......\n\n.....Fire.",
            "title_similarity": "0.056319963",
            "sentiment_compound": -0.34
        },
        {
            "id": "hbxb4ou",
            "score": 1,
            "text": "Ford also wanted Han Solo to die in the first movie.",
            "title_similarity": "0.704953",
            "sentiment_compound": -0.5994
        },
        {
            "id": "hbxbapg",
            "score": 2,
            "text": "frozen just IN CASE\n\nheh",
            "title_similarity": "0.36073855",
            "sentiment_compound": -0.1531
        },
        {
            "id": "hbxd3lp",
            "score": 1,
            "text": "His character was literally put on ice...",
            "title_similarity": "0.23021871",
            "sentiment_compound": 0.0
        },
        {
            "id": "hbxd8h2",
            "score": 1,
            "text": "Harrison Ford was not frozen. The character he played was written into the story as ‘being frozen’.",
            "title_similarity": "0.4839307",
            "sentiment_compound": 0.34
        },
        {
            "id": "hbxdve7",
            "score": 1,
            "text": "No one’s gonna see this comment probably, but I have a question about this sub: every time I try to post here it says my link has already been posted. Are you telling me no one ever posted the wiki article for SW Ep6? It was (I checked) so why wasn’t OP’s post barred? \n\nNothing personal, OP, didn’t know and loved to learn this.",
            "title_similarity": "0.6602446",
            "sentiment_compound": 0.5122
        },
        {
            "id": "hbxdxmr",
            "score": 3,
            "text": "He's one of those actors who hates the thing that really made him famous too. He always wanted Han to be killed off. He wanted Han dead after Empire. Took him a while, but he finally got his wish.",
            "title_similarity": "0.620444",
            "sentiment_compound": -0.4215
        },
        {
            "id": "hbxegnq",
            "score": 1,
            "text": "Froze him like sperm to be possibly used later",
            "title_similarity": "0.46325377",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hbxg3x9",
            "score": 1,
            "text": "Thaw in case of success",
            "title_similarity": "0.23171732",
            "sentiment_compound": 0.5719
        },
        {
            "id": "hbxgbcx",
            "score": 1,
            "text": "To keep up with tradition, Disney dragged him into the third film of their trilogy as well.",
            "title_similarity": "0.5309596",
            "sentiment_compound": 0.2263
        },
        {
            "id": "hbxhuis",
            "score": 1,
            "text": "[deleted]",
            "title_similarity": "0.14139032"
        },
        {
            "id": "hbxieip",
            "score": 1,
            "text": "Harrison Ford: Grudgingly making money off of Star Wars since 1981.",
            "title_similarity": "0.67437595",
            "sentiment_compound": -0.5574
        },
        {
            "id": "hbxighu",
            "score": 1,
            "text": "I cant believe George Lucas literally froze Harrison Ford. What a madman.",
            "title_similarity": "0.60828984",
            "sentiment_compound": 0.0
        },
        {
            "id": "hbxji2r",
            "score": 3,
            "text": "There are so many \"accidental\" things in the original Star Wars trilogy where Lucas had no creative role in it... it just happened to work because of luck or lack of budget.\n\nI've heard at least 10 examples of where George wanted something in the movie that would have been corny or sucked, then due to circumstances they had to change it (to the 'good' version we know now).\n\nExplains why prequels weren't as successful. More CGI and surrounded by \"yes men\", he was free to make the gaudy/corny bits without end.",
            "title_similarity": "0.7683175",
            "sentiment_compound": -0.1917
        },
        {
            "id": "hbxjra4",
            "score": 1,
            "text": "Left him frozen just “encased” you might say?",
            "title_similarity": "0.4203917",
            "sentiment_compound": 0.0
        },
        {
            "id": "hbxrrfm",
            "score": 1,
            "text": "Last week my 8 year old nephew and I watched 4,5,6,1,2 on Disney+ (1 film per night, then I had to go so he will watch 3 on his own some time).\n\nIt’s been a while since I watched any of them, and I finally concluded that RofJ is a bit of a mess, almost like 3 mini-stories in 1, and overall much more like episode 1 than it is like episodes 4 & 5.\n\n* story 1 is the Han rescue, with over the top Jabba palace musical bit, but also thankfully ending with some bad-ass Jedi action and overall fight scene at the Sarlac pit.\n* story 2 is the whole rebel attack on the Death Star + Endor raid. Mostly a rehash of Episode 4 (again rehashed in ep 7), with the Ewoks also rehashed in ep 1 (gungans). The speeder chase scenes were the only saving grace, although the 8 year old LOVED the ewok vs stormtrooper forest battle\n* story 3 was basically finishing the main story line from ESB with Luke going back to Yoda, then cutting to when he hands himself to Vader and the whole throne room section taken separately from the endor parts that make up story 2.\n\n\nThe saga definitely needed some more bad ass Jedi action, as we only got to see mysterious glimpses of a bygone era by old past-it Jedi in 4 & 5, except for Vader’s masterclass in Cloud City. Sadly the fluff around it in all the other films is too often ‘meh’, but all of Luke’s bits in RotJ are essentially awesome. I’m not sure why rehashing the death start narrative was the only thing they could come up with, but aside from all that RotJ for me is basically story 3, the whole like vs Emperor and Vader parts. If only they had had the tech and foresight to do lightsaber battles like in the prequals. Vader vs Luke round 2 is good and all, but for me Qui Gon & Obi Wan vs Darth Maul is still where it’s at. I would have watched an entire film that was basically those fight scenes.\n\nSorry for long rant, but the TL;DR is basically that I’ve finally decided that I dont’ like RofJ that much as an entire film, despite it’s importance in resolving the central story line and my continued love of the throne room sequences.",
            "title_similarity": "0.72513247",
            "sentiment_compound": 0.9427
        },
        {
            "id": "hbxu64p",
            "score": 2,
            "text": "He literally “put him on ice”. Love it!",
            "title_similarity": "0.20587564",
            "sentiment_compound": 0.6696
        },
        {
            "id": "hby9hkp",
            "score": 1,
            "text": "Wampa attack was to cover Mark's car crash...seems a lot of that movie was situational",
            "title_similarity": "0.62668383",
            "sentiment_compound": -0.4767
        },
        {
            "id": "hbyboi7",
            "score": 1,
            "text": "[deleted]",
            "title_similarity": "0.14139032"
        },
        {
            "id": "hbyhi6d",
            "score": 1,
            "text": "So.. one of the most traumatic movie memories from my childhood is a contract management tactic? Nice..",
            "title_similarity": "0.49030048",
            "sentiment_compound": -0.2944
        },
        {
            "id": "hbyhku2",
            "score": 1,
            "text": "Had Ford not returned, Rotj would be exactly the same, but Hans frozen prop would be scurried about.",
            "title_similarity": "0.6385183",
            "sentiment_compound": 0.0
        },
        {
            "id": "hbyhscb",
            "score": 2,
            "text": "So did they ever thaw Harrison Ford out? Seems like thats taking method acting to an extreme.",
            "title_similarity": "0.64583856",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hbyi6p8",
            "score": 1,
            "text": "As in cryogenics?",
            "title_similarity": "0.21804954",
            "sentiment_compound": 0.0
        },
        {
            "id": "hbym8x1",
            "score": 1,
            "text": "Cool",
            "title_similarity": "-0.1030379",
            "sentiment_compound": 0.3182
        },
        {
            "id": "hbymbit",
            "score": 1,
            "text": "I always find it a bit odd that Ford hates Han Solo, but seemingly loves Indiana Jones when they’re not too dissimilar.",
            "title_similarity": "0.57879716",
            "sentiment_compound": 0.5346
        },
        {
            "id": "hbyn2hx",
            "score": 1,
            "text": "TIL star wars sucks",
            "title_similarity": "0.4329846",
            "sentiment_compound": -0.7269
        },
        {
            "id": "hbyncu6",
            "score": 2,
            "text": "Also the reason Lando is dressed EXACTLY like Han at the end of \"Empire...\" \n\nThey were trying to replace his character.",
            "title_similarity": "0.52720916",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hbypj9w",
            "score": 2,
            "text": "Pretty sure it was Han Solo that was frozen.",
            "title_similarity": "0.36652485",
            "sentiment_compound": 0.6705
        },
        {
            "id": "hbyquky",
            "score": 1,
            "text": "Good bargaining chip to have an out.",
            "title_similarity": "0.13106564",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hbyqvdp",
            "score": 3,
            "text": "They unfroze him for RotJ but then gave him nothing to do for 90% of the movie",
            "title_similarity": "0.6816709",
            "sentiment_compound": 0.0
        },
        {
            "id": "hbyra1h",
            "score": 1,
            "text": "It’s an elegant solution to an age old problem: what to do when you’re planning sequels but your actor may think they’ve outgrown it. Freeze that mother fucker and figure it out later. Sci fi?  Of course. Action movie?  Why not. Romantic comedy?  Absolutely.",
            "title_similarity": "0.7065919",
            "sentiment_compound": -0.8977
        },
        {
            "id": "hbzcwcd",
            "score": 1,
            "text": "Now that’s a good TIL!",
            "title_similarity": "-0.022774518",
            "sentiment_compound": 0.4926
        },
        {
            "id": "hctpb7u",
            "score": 2,
            "text": "I read the wiki and much like I suspected the words merchandise popped up so frequently with choices made to the film I am now cemented in the fact that in itself is a reason so many of these films don't feel right.",
            "title_similarity": "0.4739912",
            "sentiment_compound": 0.1531
        },
        {
            "id": "hdfhgsa",
            "score": 2,
            "text": "Watch a different movie",
            "title_similarity": "0.25736174",
            "sentiment_compound": 0.0
        }
    ]
}