{
    "TIL Due to casino distributions, every Seminole Indian child born is a multi millionaire when they turn 18 years old.\n": [
        {
            "id": "hcygbr0",
            "score": 8,
            "text": "[removed]",
            "title_similarity": "-0.12839404"
        },
        {
            "id": "hczf8wc",
            "score": -5,
            "text": "And what do they do with the money? Snort it up their nose. Turns out, when you give people free money - they don’t want to work and find destructive habits to engage in. **Shocker**. \n\nFact:\n\nThe rates of substance abuse among Native Americans are generally much higher than those of the general U.S. population. Data indicate that Native Americans have the highest rates of alcohol, marijuana, cocaine, inhalant, and hallucinogen use disorders compared to other ethnic groups.",
            "title_similarity": "0.50627035",
            "sentiment_compound": -0.5859
        },
        {
            "id": "hczdt6o",
            "score": -12,
            "text": "When does it end? Should I have reperations too, because my ancestors 200 years ago were incorrectly persecuted?\n\nIndian and black communities don't have anyone but themselves to blame for their current day troubles. Everyone makes their own decisions.\n\nYou don't see Jews asking for paychecks and other free shit from the government -- they pull themselves up by their boot straps and get their own shit done.",
            "title_similarity": "0.5326266",
            "sentiment_compound": -0.9378
        },
        {
            "id": "hcz0lrf",
            "score": -15,
            "text": "Casinos are that profitable and Trump still managed to bankrupt one.",
            "title_similarity": "0.5491984",
            "sentiment_compound": -0.1779
        },
        {
            "id": "hcz6ff9",
            "score": 2,
            "text": "[removed]",
            "title_similarity": "-0.12839404"
        },
        {
            "id": "hczb3lv",
            "score": 5,
            "text": "We really need to start taxing indians like common folk ffs.",
            "title_similarity": "0.25288323",
            "sentiment_compound": -0.3182
        },
        {
            "id": "hcyv3lt",
            "score": -4,
            "text": "That’s not fair. They need to be taxed, they need to pay their fair share.",
            "title_similarity": "0.22711372",
            "sentiment_compound": 0.2819
        },
        {
            "id": "hcywwey",
            "score": 0,
            "text": "hahaha. good.\n\nMy favorite throwaway line from a kind of clever heist movie ([the stick-up](https://www.imdb.com/title/tt0307507)): \"At this rate, they're gonna own the whole damn county!\" \"Well, they used to...\"",
            "title_similarity": "0.62345874",
            "sentiment_compound": 0.8979
        },
        {
            "id": "hcza2xm",
            "score": -2,
            "text": "That's actually really awesome. They support one another. It's not like the rest of America where 1% hoards it all.",
            "title_similarity": "0.38810152",
            "sentiment_compound": 0.7389
        },
        {
            "id": "hcz3j0k",
            "score": 1,
            "text": "See folks, this is what actual privilege looks like.",
            "title_similarity": "0.1398493",
            "sentiment_compound": 0.6124
        },
        {
            "id": "hcz48fs",
            "score": 23,
            "text": "[removed]",
            "title_similarity": "-0.12839407"
        },
        {
            "id": "hcyecq5",
            "score": 55,
            "text": "Tax the rich?",
            "title_similarity": "0.3731444",
            "sentiment_compound": 0.5574
        },
        {
            "id": "hd0v73n",
            "score": 7,
            "text": "> TIL Due to casino distributions, every Seminole Indian child born is a multi millionaire when they turn 18 years old.\n\nMany people keep talking about white privilege but why aren't they talking about the Seminole privilege?",
            "title_similarity": "0.9183406",
            "sentiment_compound": 0.6124
        },
        {
            "id": "hcygj2k",
            "score": 22,
            "text": "The real question is do they receive proper education on how to use and invest that money. That money can absolutely destroy a persons life if they arnt taught how to not abuse it.",
            "title_similarity": "0.28263265",
            "sentiment_compound": -0.1091
        },
        {
            "id": "hcyd1yd",
            "score": 37,
            "text": "> The Seminole Tribe of Florida may be guarded about sharing tribal information with outsiders, but they were smart enough to hire a non-native chief executive for their gambling operations \n\nThe choice not to use the passive voice was astounding here. It doesn’t bear on the story at all that the CEO of their gambling operations isn’t native, but they slipped it in there, so nobody gets the notion that natives are good with money from this article about how they have all this money.",
            "title_similarity": "0.48851508",
            "sentiment_compound": 0.9349
        },
        {
            "id": "hcyvqxu",
            "score": 0,
            "text": "I'm so sick of these Indigenous millionaires taking our jobs! They need to go back where they came from...",
            "title_similarity": "0.35715237",
            "sentiment_compound": -0.5974
        },
        {
            "id": "hcyrzvc",
            "score": 2,
            "text": "Barring cases like this, most reservations should be abolished, start with a 100 year lease. Far too many cases of extreme poverty and third world conditions in continental US in Indian communities.",
            "title_similarity": "0.54499656",
            "sentiment_compound": -0.2716
        },
        {
            "id": "hcyfjkr",
            "score": -6,
            "text": "Awesome\n\nEdit... 😆 down votes.  The fragility around here.",
            "title_similarity": "0.16190025",
            "sentiment_compound": 0.765
        },
        {
            "id": "hcyzo6q",
            "score": 6,
            "text": "The Rez I used to live on has turned into a weed utopia. People who were broke a few years ago are now millionaires-and you know what they did with the money? Put it back into the community. No kid has to worry about paying for sports, extra curricular, transportation anything. At my work we had a cheque book where I had permission to basically give money to people who needed it. It is so beautiful. And another thing, the bigger businesses close a couple hours earlier than the smaller ones so everyone gets their share of customers.\n\nEdit: word",
            "title_similarity": "0.6389178",
            "sentiment_compound": 0.075
        },
        {
            "id": "hcz7jzl",
            "score": 7,
            "text": "I worked for the Seminole tribe for several years, AMA. They are mostly shithead drunks.",
            "title_similarity": "0.5973565",
            "sentiment_compound": -0.6249
        },
        {
            "id": "hcyowhc",
            "score": 49,
            "text": "Money without earning it is a bad mix. I’m in a legal mess with a native of morongo tribe who gets $200,000 a year. He has no fear of anything because he never needs a job. He just continues to steal, abuse and destroy. Doesn’t matter what legal problems or credit issues he accrued, he has money garunteed. Most of the money goes to drugs and alcohol anyways. \n\nSounds nice on paper, horrible in practice",
            "title_similarity": "0.6090625",
            "sentiment_compound": -0.9322
        },
        {
            "id": "hd03uky",
            "score": -1,
            "text": "And every african american holds their breath",
            "title_similarity": "0.24474624",
            "sentiment_compound": 0.0
        },
        {
            "id": "hd08oif",
            "score": 0,
            "text": "And somehow they’re still all broke alcoholics",
            "title_similarity": "0.2697847",
            "sentiment_compound": -0.4215
        },
        {
            "id": "hd1z3mo",
            "score": 0,
            "text": "I wonder if us native Europeans will get the same treatment once we become a minority in our country",
            "title_similarity": "0.3265878",
            "sentiment_compound": 0.0
        },
        {
            "id": "hcylo3l",
            "score": -21,
            "text": "One of the systemic racist policies that keep native Americans in poverty is that foreclosures are impossible on reservations so banks won't issue mortgages to build businesses or homes.\n\n[I learnt lots from these guys.](https://www.unftr.com/episodes)",
            "title_similarity": "0.40979832",
            "sentiment_compound": -0.8934
        },
        {
            "id": "hcyjyok",
            "score": -1,
            "text": "So how’s that ubi working out?",
            "title_similarity": "0.054348342",
            "sentiment_compound": 0.0
        },
        {
            "id": "hcyp97v",
            "score": 1,
            "text": "Excuse me sir...I identify as Seminole Indian, where do I sign?",
            "title_similarity": "0.3572579",
            "sentiment_compound": 0.0772
        },
        {
            "id": "hczstj8",
            "score": -1,
            "text": "[deleted]",
            "title_similarity": "-0.09306649"
        },
        {
            "id": "hcz9vcw",
            "score": 14,
            "text": "Anyone else find it weird? Its like “hey your ancestors were killed and murdered, i know you really have no context or understanding of this past, but heres money to make up for it” and the other side of the coin “hey your born white so lets guilt you for some shit your ancestors did hundreds of years ago and make you feel like shit”",
            "title_similarity": "0.43795025",
            "sentiment_compound": -0.8887
        },
        {
            "id": "hczdwj9",
            "score": -3,
            "text": "Fuck that! Tax the fuck out them! How come they aren’t giving back to the rest of the world? How come these “natives” get to hoard money but not “corporations”?",
            "title_similarity": "0.41571623",
            "sentiment_compound": -0.5781
        },
        {
            "id": "hcyl0c6",
            "score": -2,
            "text": "It’s. Me your long lost Indian friend",
            "title_similarity": "0.31495237",
            "sentiment_compound": 0.2263
        },
        {
            "id": "hcyg26e",
            "score": -17,
            "text": "[removed]",
            "title_similarity": "-0.12839404"
        },
        {
            "id": "hcywnug",
            "score": -12,
            "text": "Native Americans doing more to ensure everyone in there tribe benefits from their wealth, rather than just a small handful of executives.\n\nJeff Bezos could learn a lot from the Native Americans.",
            "title_similarity": "0.45531875",
            "sentiment_compound": 0.8261
        },
        {
            "id": "hcz8t5h",
            "score": -8,
            "text": "Fun fact, indigenous people are not from fucking India. Indians are from India. Like how do people not know this yet? So tired of hearing this bullshit language.",
            "title_similarity": "0.22204849",
            "sentiment_compound": -0.5332
        },
        {
            "id": "hczawu0",
            "score": -11,
            "text": "Still not worth getting your land fucked up and stolen by a bunch of inbred, war hungry pricks...then again, they never really had a choice unfortunately.",
            "title_similarity": "0.18729898",
            "sentiment_compound": -0.9389
        },
        {
            "id": "hczt8jh",
            "score": 0,
            "text": "And this is why I tell everybody I can gambling is just as much of an addiction and just as evil as heroin\n\nI don't support gambling at all and I tell anyone that goes for participates in it that they're no better than a drug addict",
            "title_similarity": "0.4417038",
            "sentiment_compound": -0.9055
        },
        {
            "id": "hcypqhf",
            "score": -3,
            "text": "If only it weren’t so difficult to prove you’re actually a member of the tribe. This is because settler colonialists so effectively genocided indigenous cultures through direct murder, mass rape, kidnapping, “Americanization” and the erasure of family/cultural ties. It’s difficult for many descendants of indigenous tribes to be recognized, but the Seminole tribe is one of the hardest due to how the tribe was among the first to have to deal with the colonist murderers. Many tribes in the west saw how the Seminoles were basically erased from existence and were far less susceptible to the longer-term results of colonialist genocide (though they did largely meet the same fate).",
            "title_similarity": "0.41493374",
            "sentiment_compound": -0.9209
        },
        {
            "id": "hcz7xd0",
            "score": 2,
            "text": "The wealth of a nation being distributed to its people rather than being hoarded by a few at the very top resulting in incredibly positive outcomes for them all? Get outta here!",
            "title_similarity": "0.39341104",
            "sentiment_compound": 0.8583
        },
        {
            "id": "hczbqyi",
            "score": 1,
            "text": "So much for culture. They are Native American and do not have to follow American law either.\n\nWe can't say this is what privilege looks like, because our great grandfathers did them dirty and somehow their childrens children deserve it.\n\nThe world is strange.\n\nAs a POC, this irks me.",
            "title_similarity": "0.39545292",
            "sentiment_compound": 0.6597
        },
        {
            "id": "hczc87o",
            "score": 0,
            "text": "Pathetic and disgusting.",
            "title_similarity": "-0.1131255",
            "sentiment_compound": -0.7964
        },
        {
            "id": "hczf1t3",
            "score": 1,
            "text": "Holy fuck is this article ever using some sketchy wording with regard to indigenous people:\n\n* Using terms like \"addicted to regular paychecks\"\n* \"smart enough to hire a non-native\" as though indigenous people are financially incompetent\n* Reinforces the stereotype indigenous people are lazy and don't want to work\n* \"If you are lucky to belong to one of the wealthiest tribes...\" without adding the context of the systematic cultural and physical genocide of indigenous people in America is just beyond ludicrous",
            "title_similarity": "0.49354723",
            "sentiment_compound": -0.4445
        },
        {
            "id": "hczi85h",
            "score": 2,
            "text": "That's freakin awesome... good for them for actually distributing the money to their tribesman. Too bad black people never got their dues when it comes to reparations. I dunno if we should be handing out fat checks left and right but fast tracking low interest / 0 interest business loans, free or heavily subsidized college, and additional benefits from social programs would certainly be a good start to make up for generations of oppression.",
            "title_similarity": "0.50012684",
            "sentiment_compound": 0.9732
        },
        {
            "id": "hczlhvc",
            "score": 1,
            "text": "> The Seminole Tribe of Florida may be guarded about sharing tribal information with outsiders, but they were smart enough to hire a non-native chief executive for their gambling operations\n\nUh, the fuck is this?",
            "title_similarity": "0.5333296",
            "sentiment_compound": -0.0772
        },
        {
            "id": "hczyzg9",
            "score": 1,
            "text": "I don't make that and I'm good with this. Conservatives, this is how empathy works.",
            "title_similarity": "0.0606679",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hczzula",
            "score": 0,
            "text": "Step 1: get screwed over by colonizers \nStep 2: ???\nStep 3: profit",
            "title_similarity": "0.27273512",
            "sentiment_compound": -0.212
        },
        {
            "id": "hd06lal",
            "score": -1,
            "text": "As they should",
            "title_similarity": "-0.0044180173",
            "sentiment_compound": 0.0
        },
        {
            "id": "hd0n2cc",
            "score": 0,
            "text": "Why Indian.\n\nI’m just putting this out here, “Indian” is found to be derogatory to certain Native Americans today. I understand it’s what they federally call us. It would have been okay if the title was “Seminole Child” but the “Indian” is not required to describe our group when you have the tribe name. \n\nSheesh, if there’s a way you can change the title and remove that word I would love you forever OP.\n\n“We've been called 'Indians' and 'injun' to degrade us into a position of inferiority, and that's what we're reminded of when non-Natives call us Indian,\" — from [this article](https://www.oprahdaily.com/life/a34485478/native-american-vs-american-indian-meaning/) [Here’s another](https://hechingerreport.org/student-voice-dont-call-me-indian/), and [this one is really good too](https://www.oklahoman.com/story/special/2021/04/22/what-do-native-people-prefer-called/4831284001/).\n\nI share this to educate you, because people still think we’re “not here”, or we’ve been all killed off and kicked out of our lands (this part is true lol). And how modern times such as social media has allowed people like me to express and educate. “Indian” is derogatory because we have people from India, it’s derogatory because “Indian” indicates us Native Americans do not have an origin or place of belonging, as other ethnic groups (German, African, Chinese, Samoan,  Syrian, etc).\n\nI would really appreciate if this was upvoted and seen! I’m doing my very best every day to carry the legacy and resilience that my beautiful ancestors survived so can be here today, and to learn what was lost and taken away.\n\nDon’t forget **November is Indigenous People’s Month** ❤️ (: \n\nEdit: Linky link & November :)",
            "title_similarity": "0.38557512",
            "sentiment_compound": 0.9906
        },
        {
            "id": "hcymb7o",
            "score": -19,
            "text": "This is amazing. Florida man is white America's greatest failure and the people whose ancestors they fucked are generally wealthy do to exploiting their general lack of self control? This is like the best outcome i can think of for an indigenous culture.",
            "title_similarity": "0.5463134",
            "sentiment_compound": 0.6486
        },
        {
            "id": "hcz86w6",
            "score": -5,
            "text": "They deserve every bit of it",
            "title_similarity": "0.17102087",
            "sentiment_compound": 0.0
        },
        {
            "id": "hcziwqv",
            "score": -4,
            "text": "Well according to liberals I can identify as what ever I want. So I am a Seminole Indian.....show me the money",
            "title_similarity": "0.6080751",
            "sentiment_compound": 0.34
        },
        {
            "id": "hcyg1wd",
            "score": 10,
            "text": "brb going to get my dna checked",
            "title_similarity": "0.16387509",
            "sentiment_compound": 0.0
        },
        {
            "id": "hd0tnu0",
            "score": -5,
            "text": "Pretty sweet. Until you consider WE KILLED THEIR PEOPLE, STOLE THEIR LAND, KILLED THEIR CULTURE AND LANGUAGE, and TREATED THEM AS SUBHUMAN UNTIL the last 50 years or so…. Yeah, no, it’s just reparations and a big FUCK YOU.",
            "title_similarity": "0.4332684",
            "sentiment_compound": -0.8519
        },
        {
            "id": "hcye1di",
            "score": -14,
            "text": "Awesome news, it’s about damn time",
            "title_similarity": "0.30955064",
            "sentiment_compound": 0.34
        },
        {
            "id": "hcz8kh9",
            "score": 3,
            "text": "Time to find me a Seminole woman.",
            "title_similarity": "0.29082662",
            "sentiment_compound": 0.0
        },
        {
            "id": "hczlx7p",
            "score": -3,
            "text": "[deleted]",
            "title_similarity": "-0.09306649"
        },
        {
            "id": "hd01zok",
            "score": -3,
            "text": "So the Native Americans get reparations for having their land stolen from them and people murdered. Black people are bought and/or stolen from their native continent, brought overseas to said stolen Native land and forced to work for 200 years under unjustifiably horrible conditions and are told that they aren't deserving of any reparations, nor civil rights laws protecting blacks exclusively from the systematic oppression built into our society specifically to limit the success of African Americans as a whole on the individual level...despite having built the very foundation for the structure of such an economic system, that surely would have waned if not for the labor of slaves at the time. \n\nThe World is an odd place 😬🤔",
            "title_similarity": "0.5252881",
            "sentiment_compound": -0.9559
        },
        {
            "id": "hcz7oeq",
            "score": 6,
            "text": "The Seminole tribe funnelled millions into lobbying Florida State Congress to ensure they had a legal monopoly on gambling in the state.\n\nIt's a sham, and I think it's absolutely absurd that we've been guilted into allowing a particular ethnicity into funneling millions from people with gambling addiction because of something that happened 150 years ago.",
            "title_similarity": "0.66668546",
            "sentiment_compound": 0.3818
        },
        {
            "id": "hcypn00",
            "score": 5,
            "text": "Seminole Privilege...\n\n\n\n\n\n\n\n\n (please note sarcastic comedic tone you can't hear over this typed text)",
            "title_similarity": "0.18669534",
            "sentiment_compound": 0.6705
        },
        {
            "id": "hczmxrl",
            "score": -4,
            "text": "This article is racist as f*ck. “But they were smart enough to hire a non native CEO” excuse me??",
            "title_similarity": "0.42907697",
            "sentiment_compound": -0.3313
        },
        {
            "id": "hcyjx5j",
            "score": 8,
            "text": "This is so awesome to hear, glad they are taking care of their own",
            "title_similarity": "0.14252362",
            "sentiment_compound": 0.9089
        },
        {
            "id": "hcypnql",
            "score": 9,
            "text": "Edit 2: I rescend my entire comment because I misinterpreted the article to say 99.2% EMPLOYMENT rate – that people who didn’t have to work chose to anyway. Turns out, people who don’t have to work … don’t fucking work. At least not in this particular population. Sorry for my mistake!\n\n~~ It’s a good example of how people might handle universal basic income program. ~~\n\n>\tThe Shakopee Mdewakanton are the wealthiest Native American tribe, going by the individual personal wealth. They are 480 members, and each member gets around $84,000 per month, as disclosed by a tribe member going through a divorce. The tribe is so rich that no one has to work; in 2012, the tribe’s President then, Stanley R. Crooks, bragged that they enjoy 99.2% of voluntary unemployment.\n\n~~Edit: The point being that the common arguments against UBI – generally that it will make us all lazy – isn’t the case in this particular population. So why would it be the case if we received significantly less?~~\n\n~~I understand $82k is beyond unrealistic.~~",
            "title_similarity": "0.66421914",
            "sentiment_compound": 0.592
        },
        {
            "id": "hcz03du",
            "score": 31,
            "text": "Truth. Plus, they are each given a house. If they want to start a business, one presentation to the tribal elders and they receive $250k to start the business. And, if they commit a crime off the rez, cops can’t go on the rez to arrest them. \n\nAnother fun fact, the State of Florida initially denied them a casino license. The Seminoles told them they could remove the Florida turnpike from Seminole land as a result. \n\nThey got their license. \n\nI’m in awe of them. Their casinos are clean, well run and the bedrock of tourism in Broward County. \n\nGood on them. They deserve it. Chaps my ass when I hear people bitch about them.",
            "title_similarity": "0.67540157",
            "sentiment_compound": -0.3182
        },
        {
            "id": "hczb0c1",
            "score": -1,
            "text": "Native American. TIL people still don't know the difference between Indian and Native American.",
            "title_similarity": "0.2178129",
            "sentiment_compound": 0.0
        },
        {
            "id": "hczfsz6",
            "score": 2,
            "text": "Eat the rich",
            "title_similarity": "0.28366923",
            "sentiment_compound": 0.5574
        },
        {
            "id": "hd0hv5i",
            "score": 1,
            "text": "Brown privilege",
            "title_similarity": "0.06988618",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hd1gvx0",
            "score": -1,
            "text": "So what are they always complaining about?",
            "title_similarity": "0.040009446",
            "sentiment_compound": -0.2023
        },
        {
            "id": "hd1kpa1",
            "score": 1,
            "text": "We don’t call them Indians any more. The politically correct term is *Casino-owning Americans*.",
            "title_similarity": "0.47017205",
            "sentiment_compound": 0.0
        },
        {
            "id": "hd28q0i",
            "score": -1,
            "text": "I identify as a Seminole Indian.  Where can I pick up my check?",
            "title_similarity": "0.41277838",
            "sentiment_compound": 0.0
        },
        {
            "id": "hcylntw",
            "score": 18,
            "text": "Eat it, Andrew Jackson.",
            "title_similarity": "0.19629475",
            "sentiment_compound": 0.0
        },
        {
            "id": "hczd8sa",
            "score": 0,
            "text": "Is this real? Do earnings get evenly distributed within the tribes?",
            "title_similarity": "0.40711933",
            "sentiment_compound": 0.0
        },
        {
            "id": "hczgdjp",
            "score": 0,
            "text": "So where can I find myself a seminole woman",
            "title_similarity": "0.274981",
            "sentiment_compound": 0.0
        },
        {
            "id": "hczlk6y",
            "score": 0,
            "text": "Is there a dating app for the Seminole Indian community or something similar? Asking for a friend.",
            "title_similarity": "0.39226776",
            "sentiment_compound": 0.4939
        },
        {
            "id": "hczsnls",
            "score": 0,
            "text": "Another fun fact: the University of Florida was not the first college to develop a sports drink (Gatorade).\n\nFlorida State did it first, but the marketing wasn't there for Seminole Fluid.",
            "title_similarity": "0.3675291",
            "sentiment_compound": 0.2846
        },
        {
            "id": "hd08l6m",
            "score": 0,
            "text": "[deleted]",
            "title_similarity": "-0.09306649"
        },
        {
            "id": "hd0cjvl",
            "score": 0,
            "text": "WHERE ALL THE SEMINOLE WOMEN AT",
            "title_similarity": "0.4225161",
            "sentiment_compound": 0.0
        },
        {
            "id": "hd0z15q",
            "score": 0,
            "text": "how can I become a seminole indian?\n\nI already know some of the language... \"Heyyyhowwareya?... heyyyhowwareya?... heyyyhowwareya?...\"",
            "title_similarity": "0.38430655",
            "sentiment_compound": 0.0
        },
        {
            "id": "hd117oj",
            "score": 0,
            "text": "I now identify as a Seminole Indian. Now just gotta wait for my check.",
            "title_similarity": "0.3978506",
            "sentiment_compound": 0.0
        },
        {
            "id": "hcz6u0l",
            "score": 4,
            "text": "The majority of them are drug addicts and alcoholics because giving people free money with no incentive to work for it sucks the humanity out of them. Americans should be ashamed of this.\n\nAlso, the rates of domestic abuse and murder are well above the national average. And the number of women who go missing in reservation lands is staggering. \n\nGiving them free money kills them more effectively than any war waged against them ever did.",
            "title_similarity": "0.4679981",
            "sentiment_compound": -0.8811
        },
        {
            "id": "hcyx43w",
            "score": -6,
            "text": "Just to be clear, casinos are horrible, routinely destroy entire families since substantial fraction of gamblers are gambling addicts. Can't we help the Native Americans in a less destructive way?",
            "title_similarity": "0.5420532",
            "sentiment_compound": -0.8613
        },
        {
            "id": "hd0ve5x",
            "score": -5,
            "text": "Should read-Indigenous NOT Indian.  Indians are from INDIA.",
            "title_similarity": "0.1390285",
            "sentiment_compound": 0.0
        },
        {
            "id": "hd056er",
            "score": -5,
            "text": "Fuck yeah, roundabout reparations. Now give black people casinos to run.\n\nEdit: Not sure why the downvotes, I wasn't joking. I think it is a reasonable long-term solution for predictable income. Casinos are cash cows, a lot of people have a pretty hard stance on reparations but aside from initial development costs, this would be a willful redistribution of wealth.",
            "title_similarity": "0.5210311",
            "sentiment_compound": 0.6582
        },
        {
            "id": "hcyr789",
            "score": -12,
            "text": "Can you guys please start saying Native American or Indigenous?  Indians are from India.  Like, it's literally in the name.....  You just add a \"ns\".\nI'm sure there are some older indigenous people that may like that term, but the community hates that incorrect label.  Like, it is so painfully obvious.",
            "title_similarity": "0.32732144",
            "sentiment_compound": -0.5926
        },
        {
            "id": "hcylztj",
            "score": 2,
            "text": "Also, if I remember right, there is kind of a fight going on, because the Seminole's of Oklahoma want some of that money, but the Florida tribe is saying no.",
            "title_similarity": "0.40033332",
            "sentiment_compound": -0.1655
        },
        {
            "id": "hczavt0",
            "score": -2,
            "text": ">born a multimillionaire\n\n>when they turn 18.\n\n...huh?",
            "title_similarity": "0.6465409",
            "sentiment_compound": 0.0
        },
        {
            "id": "hczludm",
            "score": -1,
            "text": "Haven’t heard ‘Indian’ used improperly for so long, I was actually thrown off for a sec and thought this was about India.",
            "title_similarity": "0.35869482",
            "sentiment_compound": 0.0
        },
        {
            "id": "hd0py1t",
            "score": -2,
            "text": "Indians live in India my guy",
            "title_similarity": "0.31656453",
            "sentiment_compound": 0.0
        },
        {
            "id": "hcz6chq",
            "score": 34,
            "text": "Suddenly Reddit loves rich people who earned wealth by being born.",
            "title_similarity": "0.5485097",
            "sentiment_compound": 0.8885
        },
        {
            "id": "hczbpw3",
            "score": 2,
            "text": "Tax the rich?",
            "title_similarity": "0.3731444",
            "sentiment_compound": 0.5574
        },
        {
            "id": "hcz7781",
            "score": 18,
            "text": "Tax the rich",
            "title_similarity": "0.38885087",
            "sentiment_compound": 0.5574
        },
        {
            "id": "hcz0zk3",
            "score": -9,
            "text": "Damn where's the free shit for white guys?\n\nOh, wait...",
            "title_similarity": "0.31327063",
            "sentiment_compound": -0.4588
        },
        {
            "id": "hczxjm7",
            "score": 4,
            "text": "I hate that is article starts out saying they can  “just sleep through life”. 🙄 It's not that big of a trust and the point of it is so they can get back to living in a way they used to and preserving the land and culture that was stolen from them. I'm glad some states allow them to have casinos like this. In WA they are the only ones who can have casinos, sell “fun” fire works and have discounted gas. It took a while, but since the 70s theyve actually been able to dig their way out of the mess the US government created for them. I had a friend who would get $100 added to his trust everytime he got an A in school, and guess what? He is an engineer now that works for the tribe in conjunction with the state to preserve the salmon runs, has no college debt and is thriving while giving back to his community. \nOn the flip side I went to school in Montana, where they think native  Americans don't deserve anything. They're incredibly racist towards natives and think the rent the US government pays them, per their treat for taking their land, is a “hand out” and their just lazy natives. Their reservations are far worse off. \nThe casinos are good things. Like for fuck sake. We took everything they had, broke all our treaties with them, killed their families, stole their children and sent them to schools to “ kill the indian preserve the man” where they were abused and so children were killed. Oh and then we also forcefully sterilized their women so they couldn't have anymore children and took away their ability to practice their religion. Of course they have generational trauma. Of course they can't just pull up their boot straps. This author sucks and they deserve every dumb casino dollar they've earned to rebuild their community. It is also a testament to their core culture and smarts. To fight that long and finally win government support and then actually build mini empires for their community is amazing and a testament that more socialist societies can succeed. \n\nAnother story to add to some if their genius and kindness, the Navajo nation, who was already struggling at the time, sent money to Ireland during the famine, even though it wasn't much. Recognizing the bullshit the British we're pulling to kill and control the Irish people. The Irish never forget. They still send aid and donate to Native American tribes today and recently sent support during covid when Trump was giving us all nothing. If you travel to Ireland you’ll find people who know obscure tribes and states because native tribes helped them during the famine. Celtic tribes and native America tribes share very similar values. It's a bond I’ll always love. \n\nK rant over. Sorry for any grammar errors, this shit just pisses me off to no end.",
            "title_similarity": "0.51142925",
            "sentiment_compound": -0.9843
        },
        {
            "id": "hd0dimn",
            "score": -4,
            "text": "Good.  We owe reparations to more than just Native Americans.",
            "title_similarity": "0.3224171",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hcyjg8n",
            "score": 75,
            "text": "The Florida Seminoles were never defeated and never surrendered. The United States government finally gave up after spending much treasure and lives. Yes, it has happened before.",
            "title_similarity": "0.49274033",
            "sentiment_compound": 0.6276
        },
        {
            "id": "hcz10l1",
            "score": -9,
            "text": "who cares, good for them, we wiped out a hundred million native americans who lived on this land in synchronicity with it for more than 10,000 years.",
            "title_similarity": "0.6020937",
            "sentiment_compound": 0.7096
        },
        {
            "id": "hd0ez1i",
            "score": 3,
            "text": "From the article:  \n>The Seminole Tribe of Florida may be guarded about sharing tribal information with outsiders, but they were smart enough to hire a non-native chief executive for their gambling operations. \n\nIs it just me or is that _incredibly fucking racist_?",
            "title_similarity": "0.5237428",
            "sentiment_compound": -0.4417
        },
        {
            "id": "hd0ff39",
            "score": -3,
            "text": "It’s the least us in America can do after the rape and pillaging these people suffered at the hands of our ancestors.  But THAT doesn’t get taught in school…",
            "title_similarity": "0.30830532",
            "sentiment_compound": -0.6059
        },
        {
            "id": "hcyvbfq",
            "score": 1,
            "text": "And it only cost hundreds of years of their ancestors being murdered!",
            "title_similarity": "0.5648794",
            "sentiment_compound": -0.69
        },
        {
            "id": "hcywmkw",
            "score": -1,
            "text": "The Seminoles are amazing business people.",
            "title_similarity": "0.49207968",
            "sentiment_compound": 0.5859
        },
        {
            "id": "hcz0ryd",
            "score": 1,
            "text": "yet Trump's casinos went bankrupt....",
            "title_similarity": "0.47704434",
            "sentiment_compound": -0.5574
        },
        {
            "id": "hcz1qle",
            "score": 1,
            "text": "I need to marry a Seminole woman.",
            "title_similarity": "0.36393487",
            "sentiment_compound": 0.0
        },
        {
            "id": "hcz30x4",
            "score": 1,
            "text": "With all the bad things that happen in America, it's almost as if the entire country was built atop ancient Indian burial grounds.",
            "title_similarity": "0.40441692",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hcz5av7",
            "score": 1,
            "text": "That money enslaves the tribe though. Lots of good and bad in that situation.",
            "title_similarity": "0.36703938",
            "sentiment_compound": -0.4939
        },
        {
            "id": "hcz7rml",
            "score": -1,
            "text": "This is an insanely racist article talking about Native Americans becoming \"addicted\" to a steady income and some being \"smart enough\" to hire a non-Native chief executive.",
            "title_similarity": "0.55982554",
            "sentiment_compound": -0.3182
        },
        {
            "id": "hcz8xvl",
            "score": 1,
            "text": "This is what we call generational wealth.",
            "title_similarity": "0.31076732",
            "sentiment_compound": 0.4939
        },
        {
            "id": "hczb2zt",
            "score": -1,
            "text": "The fact the word \"Indian\" is still being used to describe Native Americans is sad",
            "title_similarity": "0.15049453",
            "sentiment_compound": -0.4767
        },
        {
            "id": "hczcrav",
            "score": 1,
            "text": "So they went from being exploited by white people to exploiting white people…",
            "title_similarity": "0.2761586",
            "sentiment_compound": -0.7096
        },
        {
            "id": "hczdlpb",
            "score": 1,
            "text": "does any other country give land retributions like the US?",
            "title_similarity": "0.29021788",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hcze0n5",
            "score": 1,
            "text": "Lucky..... I wish my ancestors were brutally killed by foreigners so u could be a millionaire now",
            "title_similarity": "0.48500887",
            "sentiment_compound": -0.6124
        },
        {
            "id": "hcze2jh",
            "score": -1,
            "text": "Conservatives would applaud this while ignoring the socialism",
            "title_similarity": "0.153563",
            "sentiment_compound": 0.0772
        },
        {
            "id": "hczfmzd",
            "score": 1,
            "text": ">but they (The Seminole Tribe) were smart enough to hire a non-native chief executive for their gambling operations.\n\nThat's some surprisingly frank racism.",
            "title_similarity": "0.5923958",
            "sentiment_compound": -0.0772
        },
        {
            "id": "hczj4cd",
            "score": -1,
            "text": "The white man stole their land, so now they get white people to give up their money in exchange for.... umm.... fire water and shiny baubles? Is that right? Because that seems rather fair.",
            "title_similarity": "0.40947816",
            "sentiment_compound": -0.1179
        },
        {
            "id": "hczkm7m",
            "score": 1,
            "text": "Considering how evil Europeans and by extension Americans have been to Native Americans since 1492, they deserve every cent.",
            "title_similarity": "0.4925872",
            "sentiment_compound": -0.6597
        },
        {
            "id": "hczkrvh",
            "score": 1,
            "text": "That’s what happens when you never lose a war to the United States.",
            "title_similarity": "0.38687468",
            "sentiment_compound": 0.8022
        },
        {
            "id": "hczlal5",
            "score": 1,
            "text": "eat the rich btw",
            "title_similarity": "0.28004727",
            "sentiment_compound": 0.5574
        },
        {
            "id": "hczsz99",
            "score": -1,
            "text": ">\tThe Seminole Tribe of Florida may be guarded about sharing tribal information with outsiders, but they were smart enough to hire a non-native chief executive for their gambling operations. \n\nBig woah on that line. Yikes.",
            "title_similarity": "0.5562935",
            "sentiment_compound": 0.6652
        },
        {
            "id": "hczyt8p",
            "score": -1,
            "text": "I'm sure they're generous with their other Native American kin that live in squalor and share the wealth.",
            "title_similarity": "0.46599078",
            "sentiment_compound": 0.875
        },
        {
            "id": "hczyzg8",
            "score": 1,
            "text": "Paging senator Warren......",
            "title_similarity": "0.16947106",
            "sentiment_compound": 0.0
        },
        {
            "id": "hd08cxt",
            "score": -1,
            "text": "We could all be born millionaires if it wasn’t for capitalism and greedy bastard 1%ers",
            "title_similarity": "0.62339556",
            "sentiment_compound": -0.7003
        },
        {
            "id": "hd0f0o9",
            "score": -1,
            "text": "It really bothers me how native Americans ARE STILL referred to as “Indians” even though they’ve never been to India",
            "title_similarity": "0.31957245",
            "sentiment_compound": -0.2716
        },
        {
            "id": "hd0fxpb",
            "score": -1,
            "text": "\"slowly taking back our money from white people, one quarter at a time\"\n\nEdit: it's a quote from parks and rec y'all",
            "title_similarity": "0.4129775",
            "sentiment_compound": 0.0
        },
        {
            "id": "hd0gzjt",
            "score": 1,
            "text": "talk about privilege",
            "title_similarity": "0.038061816",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hd0jeu2",
            "score": 1,
            "text": "Good for them, their tribe did it right. It's a shame corruption from their own screwed over most of the other tribes.",
            "title_similarity": "0.3265111",
            "sentiment_compound": -0.5267
        },
        {
            "id": "hd0jylw",
            "score": -1,
            "text": "This is called reparations. And they are deserved.",
            "title_similarity": "0.06835066",
            "sentiment_compound": 0.0
        },
        {
            "id": "hd0lc41",
            "score": 1,
            "text": "Anyone know how much 23 and me costs? Asking for a friend, for umm research?",
            "title_similarity": "0.3001992",
            "sentiment_compound": 0.5514
        },
        {
            "id": "hd0qh3l",
            "score": -1,
            "text": ">~~Indian~~ Native American\n\nFTFY",
            "title_similarity": "0.30043644",
            "sentiment_compound": 0.0
        },
        {
            "id": "hd0xzv2",
            "score": 1,
            "text": "That is a curse to get so much money when you are 18. It discourages any ambition. It would be more wise to phase it in; You don’t want them to be super poor but having so much so early will really hurt the drive to make something of yourself.",
            "title_similarity": "0.30991584",
            "sentiment_compound": -0.7574
        },
        {
            "id": "hd0y6on",
            "score": 1,
            "text": "#”INDIAN”",
            "title_similarity": "0.14250863",
            "sentiment_compound": 0.0
        },
        {
            "id": "hd0ykpf",
            "score": 1,
            "text": "From genocide and our federal government paying bounties for our scalps to this 👍",
            "title_similarity": "0.38840443",
            "sentiment_compound": 0.0
        },
        {
            "id": "hd114vm",
            "score": 1,
            "text": "I went to rehab with a Native American…he used to get 3k every month just from being part of a tribe.. blew that check on drugs every month within the first week. Sad honestly",
            "title_similarity": "0.61592686",
            "sentiment_compound": -0.0258
        },
        {
            "id": "hd1693j",
            "score": -1,
            "text": "Serious question why do Americans still call aboriginal peoples Indians? Its seen as exetremly offensive in Canada",
            "title_similarity": "0.2643129",
            "sentiment_compound": -0.5106
        },
        {
            "id": "hd36j0h",
            "score": 1,
            "text": "How funny the superior progressive Reddit arena has all these ppl “jealous” & flabbergasted by Indians… yea I said Indians because they call themselves that & only white Americans made up the name native Americans to fell better about the genocide… you all are making comments about how wild & amazing it is to get $40k-$80K/mo from the tribe… I’m sure they’d rather have their land back which is worth much more, their ancestors to have proper burials, and many years of being treated horribly rather treated with respect & pride…. They are getting a penny to every $1K they should be… you should have more respect with how you speak on the $ they receive & not be so blinded by a $$ amount rather what they lost for it",
            "title_similarity": "0.5216301",
            "sentiment_compound": 0.9524
        },
        {
            "id": "hcyc4pz",
            "score": 87,
            "text": "TIL i maybe have some seminole blood",
            "title_similarity": "0.25138104",
            "sentiment_compound": 0.0
        },
        {
            "id": "hcz5ndz",
            "score": -4,
            "text": "They're not Indian though.",
            "title_similarity": "-0.059780523",
            "sentiment_compound": 0.0
        },
        {
            "id": "hcywld4",
            "score": -8,
            "text": "Great, now make this true for all Native people.",
            "title_similarity": "0.33938715",
            "sentiment_compound": 0.81
        },
        {
            "id": "hczk6fp",
            "score": -5,
            "text": "[deleted]",
            "title_similarity": "-0.09306651"
        },
        {
            "id": "hcyr14w",
            "score": -5,
            "text": "The Seminoles are one of the only tribes to successfully resist US Imperialism to the present day.",
            "title_similarity": "0.4220309",
            "sentiment_compound": 0.4939
        },
        {
            "id": "hcyugfw",
            "score": 45,
            "text": "Some Rando: \"OMG!! Why does FSU still used \"Seminole\" as a mascot!! It's so insulting!!\"\n\nThe Unconquered Seminole Tribe of Florida, who has a close relationship with the university and calls all the shot in how they can be portrayed and their name used, has a dedicated anthropologist studying and cataloging their history at a major university, and is also beyond exploitation due to their vast wealth: *looks up from counting money* \"hmm?\"",
            "title_similarity": "0.5807901",
            "sentiment_compound": 0.5026
        },
        {
            "id": "hczbltd",
            "score": 5,
            "text": "Native American Privilege",
            "title_similarity": "0.23636745",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hcyp972",
            "score": -3,
            "text": "Talk about scalping the palefaces!",
            "title_similarity": "0.2213839",
            "sentiment_compound": 0.0
        },
        {
            "id": "hcyvzym",
            "score": 1,
            "text": "Damn. I really can’t help but feel jealous. My life is and always will be shit because I’m poor.",
            "title_similarity": "0.21476027",
            "sentiment_compound": -0.9314
        },
        {
            "id": "hcz0snd",
            "score": 2,
            "text": "Brb gonna go find a Seminole Indian GF...",
            "title_similarity": "0.4151349",
            "sentiment_compound": 0.0
        },
        {
            "id": "hcz4jyy",
            "score": 2,
            "text": "Honestly, good for them. The Western Europeans raped their way of life for the last 3-400 years so I’m happy for them.",
            "title_similarity": "0.52580035",
            "sentiment_compound": 0.6461
        },
        {
            "id": "hczg1id",
            "score": -2,
            "text": "Think about all the alcohol they can buy!",
            "title_similarity": "0.45795566",
            "sentiment_compound": 0.0
        },
        {
            "id": "hczjc3b",
            "score": 2,
            "text": "You don’t want to come to this thread. Turn back.",
            "title_similarity": "-0.08180528",
            "sentiment_compound": 0.0772
        },
        {
            "id": "hczjiaq",
            "score": 2,
            "text": "ITT: Enlightened adolescent white boys riddled with guilt and eager to show off how progressive they are by bad mouthing the evil white man and singing the praises of indigenous native american indians and the sweet justice of a handful of them making money off stupid old gamblin grandmas",
            "title_similarity": "0.45044667",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hczkb70",
            "score": -2,
            "text": "Can people stop calling them Indians? Indians come from India, these are Native Americans or specifically Seminole Americans.",
            "title_similarity": "0.36251897",
            "sentiment_compound": -0.296
        },
        {
            "id": "hczr5z5",
            "score": 3,
            "text": "Seems like when a nation prospers ALL of its people do…. Not just a chosen 1%….. we should all look to this model for the future.",
            "title_similarity": "0.5078509",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hczsvk3",
            "score": -2,
            "text": "OOOOOH !!! Now I know why Trump hates Indians owning Casinos … They can do it at a profit without going bankrupt … American Indians are smarter at business than the Stable Genius Traitor . Lmao ! They are probably smarter than him at a lot of things including how to treat others !",
            "title_similarity": "0.55645895",
            "sentiment_compound": 0.9577
        },
        {
            "id": "hczu32u",
            "score": -3,
            "text": "Sources cited in this article include the Daily Mail, and I swear to God, Deep South Magazine. Solid sources here, my colonialist friend.",
            "title_similarity": "0.4229731",
            "sentiment_compound": 0.6908
        },
        {
            "id": "hczzrhb",
            "score": 1,
            "text": "And they say every white person is born with a silver spoon in his or her mouth.  ;) \n\nDon't forget the cigarette \"duty free\" tax racket that they have.",
            "title_similarity": "0.56075513",
            "sentiment_compound": 0.7065
        },
        {
            "id": "hd00kyf",
            "score": 2,
            "text": "So they are repaying the native Americans with money from stupid white people who gamble a lot?",
            "title_similarity": "0.54984933",
            "sentiment_compound": -0.5267
        },
        {
            "id": "hd083l1",
            "score": -2,
            "text": "They don't deserve it. It's generational wealth that they simply didn't earn. Billionaire/millionaire estates should be taxed incredibly heavily and so should these stipends.",
            "title_similarity": "0.4272706",
            "sentiment_compound": 0.4939
        },
        {
            "id": "hd0daox",
            "score": -3,
            "text": "Tax the rich",
            "title_similarity": "0.38885087",
            "sentiment_compound": 0.5574
        },
        {
            "id": "hd0obn0",
            "score": -2,
            "text": "Indians are from India. The term is Native American or Indigenous. How do people not know this by now?",
            "title_similarity": "0.30612266",
            "sentiment_compound": 0.0
        },
        {
            "id": "hd0wtk1",
            "score": 1,
            "text": "Good for them. They've earned it.",
            "title_similarity": "0.118196085",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hd1fn6k",
            "score": 2,
            "text": "Glad to be invaded",
            "title_similarity": "0.07299544",
            "sentiment_compound": 0.4588
        },
        {
            "id": "hd1v7mr",
            "score": -2,
            "text": "I identify as Seminole Indian…",
            "title_similarity": "0.31570128",
            "sentiment_compound": 0.0
        },
        {
            "id": "hd1wndy",
            "score": -2,
            "text": "Indians are from India",
            "title_similarity": "0.17282616",
            "sentiment_compound": 0.0
        },
        {
            "id": "hcyh3sd",
            "score": 61,
            "text": "No different in my mind than any wealthy family with a financial trust set up. If people are smart or stupid with it, that is on them. They aren’t any more or less deserving of that money than anyone born into affluence.",
            "title_similarity": "0.43505943",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hcyfu86",
            "score": -13,
            "text": "[deleted]",
            "title_similarity": "-0.09306649"
        },
        {
            "id": "hczg015",
            "score": 6,
            "text": "Eat the rich? Or just not these rich?",
            "title_similarity": "0.28680778",
            "sentiment_compound": 0.2584
        },
        {
            "id": "hczjmlg",
            "score": -7,
            "text": "[removed]",
            "title_similarity": "-0.12839404"
        },
        {
            "id": "hczn0qe",
            "score": 6,
            "text": "You know what? Good for them.",
            "title_similarity": "0.003714433",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hd1hnjs",
            "score": -6,
            "text": "All the white people and their opinions…. The Caucasity 🤣🤣🤣 while corporations/capatilism is giving you all shit on your upper lip… \n\nSure…. Get mad at the indigenous… 🤣💀",
            "title_similarity": "0.4220882",
            "sentiment_compound": 0.8126
        },
        {
            "id": "hcz8jcv",
            "score": -2,
            "text": "Man just think if there was a tax on stock trading that gave a stimulus check every year to the nations tax payers. Oh, but that's not the right narritive to sell, shit.",
            "title_similarity": "0.54697573",
            "sentiment_compound": -0.7096
        },
        {
            "id": "hczgg0u",
            "score": 4,
            "text": "ITT: People completely ignoring that the business model of casinos is exploiting mentally ill people. \n\nThis comment section is literally the “YAASSS MORE WOMEN CEOS MORE BLACK DRONE PILOTS” meme.\n\nI agree that reparations should be made to native Americans since they were effectively genocided by the Europeans who arrived here. However, the way to pay these reparations is not by granting a free pass to dominate an extremely exploitative industry like gambling.",
            "title_similarity": "0.507508",
            "sentiment_compound": -0.0236
        },
        {
            "id": "hczi23d",
            "score": 4,
            "text": "I like how everyone here is pro Indian casinos when the only way they stay in business is constant lobbying to criminalize casinos via state legislature, i.e. hypocrisy and corruption. No better than Shelsen Adelson.\n\nTwo wrongs don't make a right.",
            "title_similarity": "0.5033572",
            "sentiment_compound": -0.0531
        },
        {
            "id": "hczjqud",
            "score": -2,
            "text": "Nothing like a bit of communism on American soil to brighten my day! XD\n\nEdit: Lot of humourless righty's out there apparently. Stay classy!",
            "title_similarity": "0.3516231",
            "sentiment_compound": 0.8692
        },
        {
            "id": "hczy4aq",
            "score": -3,
            "text": "Reminds me of another oppressed minority group, except they're not sitting on millions of dollars in profit sharing revenue🤔",
            "title_similarity": "0.3587104",
            "sentiment_compound": 0.3818
        },
        {
            "id": "hd01t4c",
            "score": -4,
            "text": "Such a good example of why socialism is the best political/socioeconomical philosophy",
            "title_similarity": "0.28716627",
            "sentiment_compound": 0.7964
        },
        {
            "id": "hd03p2i",
            "score": 4,
            "text": "Good. Native Americans have suffered enough. The US government won't do right by them, they atleast deserve something.",
            "title_similarity": "0.2512993",
            "sentiment_compound": -0.0772
        },
        {
            "id": "hd080j6",
            "score": 4,
            "text": "There is a tribe near me that has an EXTREMELY large casino. It's a similar to the tribe in the article where they get a shit ton of money for just being in the tribe. Whenever I work on the reservation, it is kind of disgusting. These mansions are completely trashed inside, the people are children in adults bodies, and just not the best people in general. Not having to work for their money makes them extremely entitled. \n\nI've had it multiple times where I show up at a house to install or repair internet, and they will be passed out from partying all night and won't answer the door.\n\nToo much money at a young age can be bad.\n\nObviously not everyone on this reservation is the way described above, but enough for me to warrant saying it.",
            "title_similarity": "0.5939968",
            "sentiment_compound": -0.6792
        },
        {
            "id": "hd0av1l",
            "score": -4,
            "text": "NooOooOoooOOO mY cRiTiCaL rAcE tHeOrY",
            "title_similarity": "0.1810635",
            "sentiment_compound": -0.3182
        },
        {
            "id": "hd0bs44",
            "score": 3,
            "text": "They all deserve it, im only a fraction native so I dont deserve a dime, but anyone with significant native dna should be given a check. My european ancestors committed a successful genocide both accidentally through disease and purposely.",
            "title_similarity": "0.4542968",
            "sentiment_compound": 0.7876
        },
        {
            "id": "hd0npgu",
            "score": 3,
            "text": "this rules. still need landback tho",
            "title_similarity": "0.09598448",
            "sentiment_compound": 0.0
        },
        {
            "id": "hd0x189",
            "score": 4,
            "text": "Most tribes don’t have casinos. What was taken will never be made up for by a few casino tribes getting rich.",
            "title_similarity": "0.46539912",
            "sentiment_compound": 0.5574
        },
        {
            "id": "hczl0ke",
            "score": 7,
            "text": "Well they deserve it.  Lost a whole state, but gained a huge cash cow casino: and now they are all millionaires, likely wealthier than 95+ % of all Americans.",
            "title_similarity": "0.7629626",
            "sentiment_compound": 0.8898
        },
        {
            "id": "hczd3aj",
            "score": 23,
            "text": "People need to realize this is one tribe of hundreds of American tribes.\n\nMany Americans are struggling with broken families, cultures, languages, and lives. And of course, many live in poverty.",
            "title_similarity": "0.38507843",
            "sentiment_compound": -0.8481
        },
        {
            "id": "hcysqi8",
            "score": 4,
            "text": "Why do some tribes get huge amounts of money whereas others are very poor?",
            "title_similarity": "0.37054372",
            "sentiment_compound": -0.2716
        },
        {
            "id": "hcyt26f",
            "score": 4,
            "text": "I identify as a Seminole, just didn't realize it before this. Now, where's my damn money?",
            "title_similarity": "0.42419124",
            "sentiment_compound": -0.4019
        },
        {
            "id": "hcz5tqs",
            "score": -4,
            "text": "Somewhere out there, maybe in this very thread, a Republican is calling aboriginals lucky for this.",
            "title_similarity": "0.4413229",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hcz6khc",
            "score": -3,
            "text": "I read the entire article it doesn't mention India once",
            "title_similarity": "0.32167596",
            "sentiment_compound": 0.0
        },
        {
            "id": "hcz7d7o",
            "score": 0,
            "text": ":)  good job guys..",
            "title_similarity": "0.02647151",
            "sentiment_compound": 0.7096
        },
        {
            "id": "hczag6k",
            "score": 0,
            "text": "Just curious but does anyone know if there’s a Seminole dating app?",
            "title_similarity": "0.33984256",
            "sentiment_compound": 0.1655
        },
        {
            "id": "hczeauv",
            "score": 0,
            "text": "Good. Still not enough for what happened to them.",
            "title_similarity": "-0.07608897",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hczellm",
            "score": 0,
            "text": "My s/o is half Navajo, her dad (full blooded) refuses to be on the birth certificate, has she been/is she missing out on anything governmental wise?",
            "title_similarity": "0.40462345",
            "sentiment_compound": 0.2263
        },
        {
            "id": "hczfn7p",
            "score": 6,
            "text": "Yup, then they buy brand new shit and houses and car s and drugs and they’re dead by 21. The highschool I went to was near a Indian casino so I got to know a lot of them. It’s really sad how many friends I’ve lost from the reservation",
            "title_similarity": "0.63251275",
            "sentiment_compound": -0.8883
        },
        {
            "id": "hczh7h5",
            "score": 0,
            "text": "Native Americans should be the rulers of the United States and the old pale faced men.",
            "title_similarity": "0.4686331",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hczj91p",
            "score": 0,
            "text": "It’s quite literally the bare minimum the descendants of entire swaths of people  murdered by colonialists deserve",
            "title_similarity": "0.45960766",
            "sentiment_compound": -0.6597
        },
        {
            "id": "hczk4r9",
            "score": 0,
            "text": "*cries in Eastern Pequot*",
            "title_similarity": "0.15576826",
            "sentiment_compound": -0.4019
        },
        {
            "id": "hczmb1z",
            "score": 0,
            "text": "As an 'Indian' child (from India) reading this stopped my heart for the second (or two) that it took my brain to figure out that it is the other 'Indian' this post be talking about.\n\nNow I'm depressed.",
            "title_similarity": "0.2583833",
            "sentiment_compound": -0.058
        },
        {
            "id": "hczmpq9",
            "score": 0,
            "text": "I have some money to claim",
            "title_similarity": "0.15151574",
            "sentiment_compound": 0.0
        },
        {
            "id": "hczr7g4",
            "score": 0,
            "text": "I'm not sure racial oppression can be measured in money, certainly by someone who hasn't experienced a notable amount of it, but damn, I'd take that.",
            "title_similarity": "0.31671637",
            "sentiment_compound": -0.5157
        },
        {
            "id": "hczs1kr",
            "score": 0,
            "text": "Still couldn't fight Florida State mascot.",
            "title_similarity": "0.08564616",
            "sentiment_compound": 0.2924
        },
        {
            "id": "hczs56j",
            "score": 0,
            "text": "I’d be pumpin out some kids so they can live fulfilling lives without having to worry about funds.",
            "title_similarity": "0.29062855",
            "sentiment_compound": 0.3412
        },
        {
            "id": "hczsx11",
            "score": 0,
            "text": "How can you be born at 18",
            "title_similarity": "0.35889673",
            "sentiment_compound": 0.0
        },
        {
            "id": "hczw4tp",
            "score": 0,
            "text": "I just hard a DNA test. I am 23% african seminole native😁. Good for them. They should share their success story with other tribes though(or, other tribes can just ask them what's up)",
            "title_similarity": "0.5112283",
            "sentiment_compound": 0.886
        },
        {
            "id": "hczx0hn",
            "score": 0,
            "text": "On a completely unrelated note, anyone know where I can get my hands on some Seminole fluid?",
            "title_similarity": "0.23327275",
            "sentiment_compound": 0.0
        },
        {
            "id": "hczxl8b",
            "score": 0,
            "text": "It’s a start",
            "title_similarity": "0.06423602",
            "sentiment_compound": 0.0
        },
        {
            "id": "hczy8ak",
            "score": 0,
            "text": "they're already 18 when they're born?  jesus fuck that's wild",
            "title_similarity": "0.5205517",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hd09wd8",
            "score": 0,
            "text": "What the actual fuck.",
            "title_similarity": "-0.02405291",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hd0bwkv",
            "score": 0,
            "text": "This is a false claim. Due to excessive baby making, every Seminole child is withheld from receiving money until they turn 18. They don’t get back pay or anything.",
            "title_similarity": "0.5076848",
            "sentiment_compound": -0.1027
        },
        {
            "id": "hd0cltc",
            "score": 0,
            "text": "Kiss of death",
            "title_similarity": "0.0074063446",
            "sentiment_compound": -0.2732
        },
        {
            "id": "hd0leb6",
            "score": 0,
            "text": " .v mcheck\nBbn;LM\n\n ..",
            "title_similarity": "0.1019754",
            "sentiment_compound": 0.0
        },
        {
            "id": "hd0nlvy",
            "score": 0,
            "text": "Wait indian as in native american?",
            "title_similarity": "0.23933466",
            "sentiment_compound": 0.0
        },
        {
            "id": "hd0nncj",
            "score": 0,
            "text": "\\#SeminolePrivilege",
            "title_similarity": "0.3140993",
            "sentiment_compound": 0.0
        },
        {
            "id": "hd0pj9b",
            "score": 4,
            "text": "My daughter dated a Seminole, kid was 18 and getting $10k a month, he bought his own house recently. I have no problem the native Americans (don’t call them Indians) getting money from idiots gambling. Kinda like reparations without our taxes involved at all",
            "title_similarity": "0.73266804",
            "sentiment_compound": 0.5369
        },
        {
            "id": "hd0sqbv",
            "score": 0,
            "text": "Gotta go get one of those ancestry things see if I’m Seminole",
            "title_similarity": "0.34591323",
            "sentiment_compound": 0.0
        },
        {
            "id": "hd10bhe",
            "score": 0,
            "text": "There exists better policies and treatment or people inside America, that aren't even American.\n\nEdit: American children could only dream of having something like this. Apparently my grammer sucked on this one. Apologies.",
            "title_similarity": "0.35233325",
            "sentiment_compound": 0.5267
        },
        {
            "id": "hd11buz",
            "score": 0,
            "text": "Explains why Florida State gets to keep the name.",
            "title_similarity": "0.17275639",
            "sentiment_compound": 0.0
        },
        {
            "id": "hd1cg90",
            "score": 0,
            "text": "“How is wealth distribution good for society for $500, Alex!”",
            "title_similarity": "0.53715914",
            "sentiment_compound": 0.75
        },
        {
            "id": "hd1dhom",
            "score": 0,
            "text": "You know…it would be really nice if this happened to me. \nOh motherfucking well. \n\nTrail of Tears trumps my back pain.",
            "title_similarity": "0.20130238",
            "sentiment_compound": -0.5868
        },
        {
            "id": "hd1e6fm",
            "score": 0,
            "text": "Unearned money can be a real curse, but a benefit to many as well. WIll be interesting to see what the shakeout is. Unfortunately, the ugly underside to the native casinos story is the removal of feuding people from tribes by those with financial control.",
            "title_similarity": "0.44178504",
            "sentiment_compound": -0.714
        },
        {
            "id": "hd1hpsh",
            "score": 0,
            "text": "Here I thought they were wiped out",
            "title_similarity": "0.08292955",
            "sentiment_compound": 0.0
        },
        {
            "id": "hd1ocv9",
            "score": 0,
            "text": "I really need to get a genealogy test.",
            "title_similarity": "0.1370018",
            "sentiment_compound": 0.0
        },
        {
            "id": "hd20umj",
            "score": 0,
            "text": "An FSU tomahawk chop to that! F*ck yeah!",
            "title_similarity": "0.18746889",
            "sentiment_compound": 0.4184
        },
        {
            "id": "hcyrc6f",
            "score": -5,
            "text": "Good it's the least that we can do. They shouldn't have to pay taxes on it either.",
            "title_similarity": "0.17593938",
            "sentiment_compound": 0.4932
        },
        {
            "id": "hcz3paf",
            "score": -6,
            "text": "Only Definitely not Indians, they're native American or indigenous people. This is the oldest and silliest mistake to still be making.",
            "title_similarity": "0.36150688",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hcz8o92",
            "score": -4,
            "text": "Native. Unless you mean children of subcontinental Inndian descent",
            "title_similarity": "0.24864264",
            "sentiment_compound": 0.0
        },
        {
            "id": "hczb697",
            "score": -5,
            "text": "This is what happens when you build a society that takes care of *all* its members.",
            "title_similarity": "0.3987741",
            "sentiment_compound": 0.4939
        },
        {
            "id": "hczg09u",
            "score": 5,
            "text": "I hope nobody thinks that this is in any way helping native populations long-term.",
            "title_similarity": "0.16705608",
            "sentiment_compound": 0.6249
        },
        {
            "id": "hd0nxy3",
            "score": 5,
            "text": "Meanwhile, my tribe pulls in billions every year, and what do I get? \n\nA free hunting/fishing license sent to me every year. \n\nI'm a vegetarian.",
            "title_similarity": "0.588694",
            "sentiment_compound": 0.5106
        },
        {
            "id": "hczr0kf",
            "score": 19,
            "text": "These type of articles lead to people thinking Native Americans are all rich drunkards. When there are many Native Americans on revs without running water or any claim to anything that rightfully belongs to them. That are so deeply stuck in poverty and drug abuse and the government doesn’t really help them except maybe food stamps and help with college if they can make it there. \n\nThere are over 500 tribes and to get this money you have to be 100 percent Indian and from the Florida Seminole Indians .",
            "title_similarity": "0.6137439",
            "sentiment_compound": -0.2598
        },
        {
            "id": "hcyrum7",
            "score": 6,
            "text": "And my tribe refuse to grow weed in tribal land to sell to tourist so we stay broke",
            "title_similarity": "0.25260556",
            "sentiment_compound": -0.6444
        },
        {
            "id": "hcyl6qe",
            "score": 1,
            "text": "Sign me up!",
            "title_similarity": "0.073308356",
            "sentiment_compound": 0.0
        },
        {
            "id": "hcymuhf",
            "score": 1,
            "text": "If you would like an entertaining video on this very inspiring group of people...\n\nhttps://youtu.be/VDPj0wJFmTY",
            "title_similarity": "0.22221324",
            "sentiment_compound": 0.8173
        },
        {
            "id": "hcyw6xi",
            "score": 1,
            "text": "and as usual, now everybody in this thread will assume all indians get free money. news flash: not all of us do.",
            "title_similarity": "0.5568581",
            "sentiment_compound": 0.5106
        },
        {
            "id": "hcz0l3k",
            "score": 1,
            "text": "I’m sooooo glad I don’t enjoy gambling.",
            "title_similarity": "0.061441503",
            "sentiment_compound": 0.7351
        },
        {
            "id": "hcz338j",
            "score": -1,
            "text": "*tAx ThE RiCh ! !*",
            "title_similarity": "0.46993095",
            "sentiment_compound": 0.6351
        },
        {
            "id": "hcz3tfe",
            "score": 1,
            "text": "If we could only elect the quality of people that they (tribes) elect.",
            "title_similarity": "0.2540434",
            "sentiment_compound": 0.0
        },
        {
            "id": "hcz7qaz",
            "score": -1,
            "text": "Yeah but imagine how little the distributions would be if not for all the genocide.",
            "title_similarity": "0.23768626",
            "sentiment_compound": 0.1531
        },
        {
            "id": "hcz9dsz",
            "score": 1,
            "text": "This means nothing, if it not backed up by teaching them good money management skills in their schools  curriculum. I know people that have been handed that kinda money at that age. They are now both completely broke. I hope they give them real money education to help them be  prosperous. They sure do deserve it.",
            "title_similarity": "0.4177656",
            "sentiment_compound": 0.8749
        },
        {
            "id": "hcz9itn",
            "score": 1,
            "text": "Unpopular opinion- I would definitely take this option and become rich. \n I already don't give a fuck, or even know any details of how my ancestors lived and died beyond my grandad. Whether they were killed off in a genocide, or lived terrible lives working in mines and Mills in disease ridden poverty from the age of 10, I am here and that is all they would want. Gimme the money",
            "title_similarity": "0.56389904",
            "sentiment_compound": -0.7227
        },
        {
            "id": "hcza8ty",
            "score": 1,
            "text": "Damn lucky bastards",
            "title_similarity": "0.14806561",
            "sentiment_compound": -0.5994
        },
        {
            "id": "hczaw5x",
            "score": 1,
            "text": "You don’t need casino money to do this.\n\nIf you do something like the baby bonds program proposed by Darrick Hamilton, each child in this country that reaches 18 years of age gets an average of $25,000.",
            "title_similarity": "0.65584034",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hczb3i7",
            "score": 1,
            "text": "Back in the 90s I did a short stint selling Kirby vacuum cleaners door to door, by short I mean like 2 weeks.\nIt was in Central Florida and one of the areas they dropped us off in was the Seminole reservation.\n\nIt was absolutely dismal.\n\nThere was a playground, partially flooded, with a dead dog laying in a puddle while children played 10 ft away on equipment that was rusted and broken.\nEvery house had a dirt floor, try selling vacuum cleaners to people with dirt floors sometime... The poverty was overwhelming and it was just a seriously eye-opening experience for me.\n\nI say good on them, fleece those suckers for every penny, you shouldn't live in third world conditions in the richest country in the world.",
            "title_similarity": "0.49665534",
            "sentiment_compound": -0.9273
        },
        {
            "id": "hczc30e",
            "score": 1,
            "text": "It's also a backdoor to genocide. \n\nWhen you split gambling money proceeds among the tribe each members share goes down if the tribe grows. This encourages a policy that sets strict blood quantums on new members and other strict ,seemingly fiscal smart, rules that keep the tribe small. Along with Disney keeping it in your mind that Native Americans are stone age spiritualists these dynamics become barriers.  I don't know the solution because cutting off the money would be a bad thing for such a  poor economic area.",
            "title_similarity": "0.46112427",
            "sentiment_compound": 0.0806
        },
        {
            "id": "hczcz67",
            "score": 1,
            "text": "So there's a community that splits all their proceedings amongst themselves and of course the mother's basement dwelling libertardian capitalists will come up with their usual lunacies. Obviously it would have been much better if all the proceeds were accumulated by one or two owner operators",
            "title_similarity": "0.49561828",
            "sentiment_compound": 0.4588
        },
        {
            "id": "hczd5x2",
            "score": 1,
            "text": "Good for them; it’s the least they deserve. Good for them indeed",
            "title_similarity": "0.032306787",
            "sentiment_compound": 0.7003
        },
        {
            "id": "hczddh0",
            "score": -1,
            "text": "Woah what the fuck is this doing with so many upvotes. This is by far the most racist fucking article I have read in a long time.",
            "title_similarity": "0.41773388",
            "sentiment_compound": -0.8313
        },
        {
            "id": "hczdjjj",
            "score": -1,
            "text": "And that’s how you take care of your people instead of hoarding money.",
            "title_similarity": "0.04868992",
            "sentiment_compound": 0.4939
        },
        {
            "id": "hczds13",
            "score": 1,
            "text": "Rock ,hard \n\nFeather , soft\n\nPuddle, wet",
            "title_similarity": "0.067973316",
            "sentiment_compound": -0.1027
        },
        {
            "id": "hczf30w",
            "score": 1,
            "text": "So as a non tribe affiliated native by blood, according to 23andme, how do I go about finding my tribe or joining one? Any info would be appreciated.",
            "title_similarity": "0.31174573",
            "sentiment_compound": 0.5106
        },
        {
            "id": "hczgg6b",
            "score": -1,
            "text": "Yawn... After having their land stolen, casinos aren't how they should be making that money. \n\n... and they should all be billionaires.",
            "title_similarity": "0.52088904",
            "sentiment_compound": -0.4939
        },
        {
            "id": "hczh5q2",
            "score": 1,
            "text": "They are born when they turn 18?",
            "title_similarity": "0.44959223",
            "sentiment_compound": 0.0
        },
        {
            "id": "hczib80",
            "score": -1,
            "text": "Then why does their football team suck so bad?",
            "title_similarity": "0.1349015",
            "sentiment_compound": -0.8122
        },
        {
            "id": "hczk7jn",
            "score": -1,
            "text": "When you’re East Indian and the title confuses you 😑",
            "title_similarity": "0.14108312",
            "sentiment_compound": -0.3182
        },
        {
            "id": "hczmko6",
            "score": 1,
            "text": "And then there’s my partner, from a more remote reservation, who gets $250 a year from his tribe. Everyone thinks enrolled tribal members are all rich, but it heavily depends on the location of their reservation. Sure, they have a casino, but it’s in the middle of nowhere so it doesn’t generate the same revenue as one would in a populated area.",
            "title_similarity": "0.6773211",
            "sentiment_compound": 0.4497
        },
        {
            "id": "hczmsqx",
            "score": 1,
            "text": "I now identify as a Seminole Indian",
            "title_similarity": "0.34582412",
            "sentiment_compound": 0.0
        },
        {
            "id": "hcznc2u",
            "score": 1,
            "text": "I mean, we took their land, fair is fair.",
            "title_similarity": "0.26668224",
            "sentiment_compound": 0.5574
        },
        {
            "id": "hczonvt",
            "score": -1,
            "text": "Fuck that shit. Shut it down and tax them",
            "title_similarity": "0.15417303",
            "sentiment_compound": -0.7964
        },
        {
            "id": "hczq1ok",
            "score": 1,
            "text": "I love it. Wish all indigenous were as prosperous. \n\nCries in Yupik.",
            "title_similarity": "0.39217517",
            "sentiment_compound": 0.8074
        },
        {
            "id": "hczq5aj",
            "score": -1,
            "text": "Does the article really need to drip that prolifically with racism?",
            "title_similarity": "0.24721506",
            "sentiment_compound": -0.6249
        },
        {
            "id": "hczqej3",
            "score": 1,
            "text": "Thats awesome.  The wealth of the US as a whole is around $500,000 per person, but its obviously not distributed as equally as this.",
            "title_similarity": "0.5073718",
            "sentiment_compound": 0.5647
        },
        {
            "id": "hczr0ds",
            "score": 1,
            "text": "I guess they can't play the oppressed card haha",
            "title_similarity": "0.010745887",
            "sentiment_compound": 0.5451
        },
        {
            "id": "hczrgn3",
            "score": 1,
            "text": "I guess it all worked out for them?!?",
            "title_similarity": "0.16526318",
            "sentiment_compound": 0.0
        },
        {
            "id": "hczs6i5",
            "score": -1,
            "text": "Nope, That would be socialism and the billionaires told me that socialism was bad.",
            "title_similarity": "0.3001597",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hczv5ng",
            "score": 1,
            "text": "Good.",
            "title_similarity": "-0.05223153",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hczvmnr",
            "score": 1,
            "text": "Do Seminole’s adopt 37 y/o white women who have no family’s and loves them just because they’re humans and also would like to be a millionaire…? No that’s bad right? Fuck I’m lonely and poor.",
            "title_similarity": "0.46681473",
            "sentiment_compound": -0.4784
        },
        {
            "id": "hczvv59",
            "score": 1,
            "text": "So with all the revenue these tribes make, why don't they swing more power with the federal government? With that kind of money they could probably put one of their own in the White House.",
            "title_similarity": "0.5683391",
            "sentiment_compound": 0.0
        },
        {
            "id": "hczxpm4",
            "score": -1,
            "text": "Kinda socialism?",
            "title_similarity": "0.08073078",
            "sentiment_compound": 0.0
        },
        {
            "id": "hczypqo",
            "score": 1,
            "text": "I'm Seminole. Just don't do a blood test or look into my ancestry. Otherwise, I'm Seminole.",
            "title_similarity": "0.2701066",
            "sentiment_compound": 0.0
        },
        {
            "id": "hd02gf0",
            "score": 1,
            "text": "The real question is how can I, as a white man, take advantage of this?",
            "title_similarity": "0.2670884",
            "sentiment_compound": 0.25
        },
        {
            "id": "hd02zja",
            "score": 1,
            "text": "Hi, it's me, your forgotten ancestor.",
            "title_similarity": "0.22246954",
            "sentiment_compound": -0.2263
        },
        {
            "id": "hd05s0q",
            "score": 1,
            "text": "Hold up I'm confused.. So why are they all not driving around in Ferrari and owning mega mansions?\n\nAren't NA tribes highly impoverished?",
            "title_similarity": "0.47307688",
            "sentiment_compound": -0.3939
        },
        {
            "id": "hd08pwh",
            "score": 1,
            "text": "As they should be! 💰",
            "title_similarity": "0.07221071",
            "sentiment_compound": 0.0
        },
        {
            "id": "hd09lrp",
            "score": -1,
            "text": "In southern California a \"tribe\" with one or two members opened a small casino. It's a bit ridiculous",
            "title_similarity": "0.51214564",
            "sentiment_compound": -0.3612
        },
        {
            "id": "hd0a2vj",
            "score": 1,
            "text": "Florida Doing Shit Right yay!!!!\n\nPeople wanna hate on Florida cuz of the Sunshine Laws but this kinda thing helps me stay positive.",
            "title_similarity": "0.3092732",
            "sentiment_compound": 0.8658
        },
        {
            "id": "hd0atxd",
            "score": 1,
            "text": "That is only a drop in the bucket, compared to what was stolen from them.",
            "title_similarity": "0.24701117",
            "sentiment_compound": -0.6486
        },
        {
            "id": "hd0eg21",
            "score": -1,
            "text": "The natives are really prospering. Gambling addictions are great",
            "title_similarity": "0.5233267",
            "sentiment_compound": 0.6249
        },
        {
            "id": "hd0fezl",
            "score": 1,
            "text": "The Unconquered People.",
            "title_similarity": "0.027697252",
            "sentiment_compound": 0.0
        },
        {
            "id": "hd0fmq1",
            "score": 1,
            "text": "Any Seminole women want to adopt a kid? I’m turning 29 next month.",
            "title_similarity": "0.55650055",
            "sentiment_compound": 0.25
        },
        {
            "id": "hd0g2yg",
            "score": 1,
            "text": "Bet they’d rather have their ancestors",
            "title_similarity": "0.0949606",
            "sentiment_compound": 0.0
        },
        {
            "id": "hd0hu5i",
            "score": 1,
            "text": "If I become a student at Florida State do I get a cut?",
            "title_similarity": "0.3225673",
            "sentiment_compound": -0.2732
        },
        {
            "id": "hd0i0jx",
            "score": 1,
            "text": "Cue the racist comments....",
            "title_similarity": "0.086365715",
            "sentiment_compound": -0.6124
        },
        {
            "id": "hd0jyzf",
            "score": -1,
            "text": "Now everyone knows who is in the market for drugs...cool :P",
            "title_similarity": "0.49303055",
            "sentiment_compound": 0.4084
        },
        {
            "id": "hd0lb9t",
            "score": -1,
            "text": "Explain this to white people and watch them suddenly understand privilege.",
            "title_similarity": "0.28765705",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hd0pfac",
            "score": 1,
            "text": "I identify as Seminole",
            "title_similarity": "0.24778664",
            "sentiment_compound": 0.0
        },
        {
            "id": "hd0u02g",
            "score": 1,
            "text": "So do they now practice massive amounts of inbreeding to keep their family as members?",
            "title_similarity": "0.42680657",
            "sentiment_compound": 0.0
        },
        {
            "id": "hd0u6mx",
            "score": 1,
            "text": "They probably would rather have their land, heritage and descendants that would be here if they weren't killed off, but still 🤑🤑",
            "title_similarity": "0.16888998",
            "sentiment_compound": 0.3171
        },
        {
            "id": "hd0v7qp",
            "score": 1,
            "text": "Imagine how big the casinos would be if we didn't take all their land!",
            "title_similarity": "0.5910021",
            "sentiment_compound": 0.0
        },
        {
            "id": "hd0wrab",
            "score": -1,
            "text": "This is why there will be no pan native movement lol. First nations are fucked.",
            "title_similarity": "0.26870915",
            "sentiment_compound": -0.5859
        },
        {
            "id": "hd0y5ep",
            "score": 1,
            "text": "Good for them!  As much abuse as native Americans suffered, these people deserve everything they can get.",
            "title_similarity": "0.3452053",
            "sentiment_compound": -0.6996
        },
        {
            "id": "hd10i53",
            "score": 1,
            "text": "TIL I'm a Seminole Indian.\n\nIs that all I need to do?",
            "title_similarity": "0.39433005",
            "sentiment_compound": 0.0
        },
        {
            "id": "hd10yok",
            "score": -1,
            "text": "TY for reminding me why I don't go to the Cherokee casino any more.  You never win there... just lose.  Beautiful area, nice hotel, horrible casino.",
            "title_similarity": "0.46024442",
            "sentiment_compound": 0.1274
        },
        {
            "id": "hd111uz",
            "score": 1,
            "text": "Sounds like the only good thing about being a native American honestly. I often think about what the land in the state I live in would look like if it hadn't been ravaged by the white man.  So sick of everyone (including myself) just disrespecting the fuck out of our beautiful planet and it's inhabitants in my lifetime, can only imagine what it would be like to have everything you have ever known be ripped away from you while your people are enslaved and slaughtered for being different and not believing in your religion.",
            "title_similarity": "0.42992616",
            "sentiment_compound": 0.7058
        },
        {
            "id": "hd122bb",
            "score": -1,
            "text": "[deleted]",
            "title_similarity": "-0.09306649"
        },
        {
            "id": "hd16sbg",
            "score": -1,
            "text": "must be nice to get reperations for being screwed over by the american govt. our 40 acres and a mule got revoked by the white supremacists in charge cause they was racist asf and didnt want to see us come up",
            "title_similarity": "0.3725053",
            "sentiment_compound": -0.7665
        },
        {
            "id": "hd1asoi",
            "score": 1,
            "text": "To be fair they should be billionaires.",
            "title_similarity": "0.4137957",
            "sentiment_compound": 0.3182
        },
        {
            "id": "hd1ey20",
            "score": -1,
            "text": "These same folks want everything regulated by the government. Keep that in mind..",
            "title_similarity": "0.29019392",
            "sentiment_compound": 0.0772
        },
        {
            "id": "hd1h9o1",
            "score": -1,
            "text": "Isn’t this why grapes and fruit can cost up to $20 on the some reservations? I know theres pics of this somewhere too",
            "title_similarity": "0.49691153",
            "sentiment_compound": 0.0
        },
        {
            "id": "hd1i189",
            "score": -1,
            "text": "Those lucky natives!",
            "title_similarity": "0.1976004",
            "sentiment_compound": 0.4753
        },
        {
            "id": "hd1i1t0",
            "score": -1,
            "text": "Natives*",
            "title_similarity": "0.1357801",
            "sentiment_compound": 0.0
        },
        {
            "id": "hd1j7oa",
            "score": -1,
            "text": "And they spend it all on 211",
            "title_similarity": "0.27261627",
            "sentiment_compound": 0.0
        },
        {
            "id": "hd1p7sz",
            "score": 1,
            "text": "How do I become a Seminole?",
            "title_similarity": "0.3195126",
            "sentiment_compound": 0.0
        },
        {
            "id": "hd1px5d",
            "score": 1,
            "text": "Note to self: reincarnate as a Seminole native American.",
            "title_similarity": "0.39829612",
            "sentiment_compound": 0.0
        },
        {
            "id": "hd1x8yw",
            "score": 1,
            "text": "Must be fucking nice..",
            "title_similarity": "-0.011078715",
            "sentiment_compound": 0.4754
        },
        {
            "id": "hd23w9i",
            "score": -1,
            "text": "It tooke way too long before I realized we're not talking about actual indians.",
            "title_similarity": "0.22540161",
            "sentiment_compound": 0.0
        },
        {
            "id": "hd2mrwh",
            "score": 1,
            "text": "Was it worth the centuries of genocide and cultural destruction?",
            "title_similarity": "0.32428783",
            "sentiment_compound": -0.4215
        },
        {
            "id": "hczbagi",
            "score": 7,
            "text": "Correct me if I am wrong, but I heard a news story a couple years back about how the reservations were kicking tribal members off of their books. They could do it for any reason, so if they had a mix child or if they didn't \"behave\" the tribes would take away their membership. The controversy was that they allege the tribes did this to keep the member numbers low and the $$$ up.",
            "title_similarity": "0.49491796",
            "sentiment_compound": -0.5719
        },
        {
            "id": "hczvhtn",
            "score": -7,
            "text": "Blacks sold blacks in Africa. We wouldn't have had slaves without those events. \n\nEurope tried to civilize the natives, but they chose not to be. You don't stifle worldly innovation because a group of people don't think it's right. Especially when that group of people live on a large majority of the world (north/south America).",
            "title_similarity": "0.42064732",
            "sentiment_compound": -0.4168
        },
        {
            "id": "hcz7c56",
            "score": 10,
            "text": "Not all tribes are like that though.  The one by me gets $50/month.",
            "title_similarity": "0.49719045",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hcytkis",
            "score": 2,
            "text": "Actually, Seminole are not all Florida Seminole. There is more than one tribe with that name. Oklahoma has a large tribe as well, not related.",
            "title_similarity": "0.38277173",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hcyv3e5",
            "score": 2,
            "text": "god i wish i was a seminole",
            "title_similarity": "0.27689236",
            "sentiment_compound": 0.5859
        },
        {
            "id": "hcz0kzn",
            "score": 2,
            "text": "Mods are here to shut down discussion again and delete all the comments.\n\n🎉",
            "title_similarity": "0.11907777",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hcz0mzu",
            "score": -2,
            "text": "Seems fair tbh.",
            "title_similarity": "-0.007307183",
            "sentiment_compound": 0.3182
        },
        {
            "id": "hcz4lf7",
            "score": 2,
            "text": "My friend who is Ho-Chunk, got $250k when he graduated high school. He used it all on drugs and alcohol and is now broke.",
            "title_similarity": "0.64491904",
            "sentiment_compound": 0.1027
        },
        {
            "id": "hcz86el",
            "score": 2,
            "text": "I am 1.75% Seminole, can I be 1.75% multimillionaire?",
            "title_similarity": "0.62291855",
            "sentiment_compound": 0.0
        },
        {
            "id": "hcz8e9z",
            "score": 2,
            "text": "Dang, I am Muskogee Creek. 4th largest federally recognized tribe. \n\nDuring the european invasion Creeks fled from Tennessee and Alabama, and Georgia into Florida. The Florida faction intermarried with tribes there and became known as the Seminoles. \n\nThe others remaining in TN, AL, GA were on trail of tears to Oklahoma. (Seminoles also later put on trail of tears, then returned during the Indian Reorganization Act of 1934)\n\nNo benefits like that for us.. if my ancestors had just taken a Right instead of a Left.. I could be a millionaire right now.",
            "title_similarity": "0.62029356",
            "sentiment_compound": -0.7264
        },
        {
            "id": "hcz8xej",
            "score": 2,
            "text": "The founder of the first Native casino passed away a few days ago.\n\n\nHere is the story behind it.\n\nhttps://mynorth.com/2014/02/fred-dakota-founded-native-american-casinos-in-a-u-p-garage/",
            "title_similarity": "0.5997139",
            "sentiment_compound": 0.0
        },
        {
            "id": "hcz98ml",
            "score": -2,
            "text": "Unfortunately 75% of them squander the money",
            "title_similarity": "0.4375797",
            "sentiment_compound": -0.34
        },
        {
            "id": "hczck6x",
            "score": 2,
            "text": "You know, I’m something of a Seminole Indian myself",
            "title_similarity": "0.36913908",
            "sentiment_compound": 0.0
        },
        {
            "id": "hczdaai",
            "score": 2,
            "text": "The Christians came an took our land.\n\nWe took their Bingo.",
            "title_similarity": "0.5175503",
            "sentiment_compound": 0.0
        },
        {
            "id": "hczdtnx",
            "score": 2,
            "text": "I actually feel sorry for these ppl then because no one has taught them the money management skills to handle such a burden **facepalm** I've heard 2nd hand stories from folks who lived near a reserve where kids received money at 18  ( not multi millions  yet) often it would turn out to be a brand new truck and a week long party at the end of which after getting drunk and getting the truck hopelessly stuck they'd simply  go buy a new one! They need the tools to cope with this incredible gift  /  burden imo",
            "title_similarity": "0.55478585",
            "sentiment_compound": -0.7478
        },
        {
            "id": "hczhied",
            "score": 2,
            "text": "A group of people over coming the circumstances of their ancestors using capitalism and debauchery. The world isn't that bad a place.",
            "title_similarity": "0.38323355",
            "sentiment_compound": 0.431
        },
        {
            "id": "hczio7s",
            "score": -2,
            "text": "TIL that indians have so many casinos because gambling is banned in many areas but they can do whatever the fuck they want",
            "title_similarity": "0.5304984",
            "sentiment_compound": -0.743
        },
        {
            "id": "hczkd8q",
            "score": -2,
            "text": "And conservatives say they hate reparations…",
            "title_similarity": "0.1260285",
            "sentiment_compound": -0.5719
        },
        {
            "id": "hczmfv4",
            "score": 2,
            "text": "Hey it’s me, lost Seminole child. Who do I have to speak to?",
            "title_similarity": "0.26258114",
            "sentiment_compound": -0.3182
        },
        {
            "id": "hczmzsv",
            "score": -2,
            "text": "Today I learned I identify as a Seminole Indian  child.",
            "title_similarity": "0.4178335",
            "sentiment_compound": 0.0
        },
        {
            "id": "hczp4ln",
            "score": 2,
            "text": "> The Seminole Tribe of Florida may be guarded about sharing tribal information with outsiders, but they were smart enough to hire a non-native chief executive for their gambling operations.\n\nAnyone else think that this sounds kinda racist?",
            "title_similarity": "0.48478347",
            "sentiment_compound": -0.1557
        },
        {
            "id": "hczpfwx",
            "score": 2,
            "text": "Fantastic. Well deserved. Too bad they're are only 2000 Seminoles left. That part is depressing, but the multi millions are at least a silver lining though I'm sure they would prefer to have more brothers and sisters.",
            "title_similarity": "0.58157945",
            "sentiment_compound": 0.1154
        },
        {
            "id": "hczst8x",
            "score": -2,
            "text": "[deleted]",
            "title_similarity": "-0.09306649"
        },
        {
            "id": "hczxcxf",
            "score": -2,
            "text": "Man if only black People got the compensation other races did",
            "title_similarity": "0.34773868",
            "sentiment_compound": 0.0
        },
        {
            "id": "hczxxs1",
            "score": 2,
            "text": "Wife had a student who received biweekly payments. Said the kid was one of the brightest and gifted students she ever had who had no motivation to do anything other than buyi a house and play Xbox with his friends…",
            "title_similarity": "0.6394796",
            "sentiment_compound": 0.6558
        },
        {
            "id": "hd01n1j",
            "score": 2,
            "text": "Tax the rich?",
            "title_similarity": "0.3731444",
            "sentiment_compound": 0.5574
        },
        {
            "id": "hd0206t",
            "score": 2,
            "text": "Damn, Southwest tribes really got fucked over what with Vegas existing and all",
            "title_similarity": "0.37057704",
            "sentiment_compound": -0.8115
        },
        {
            "id": "hd024x0",
            "score": -2,
            "text": "So oppressed",
            "title_similarity": "-0.0525662",
            "sentiment_compound": -0.5256
        },
        {
            "id": "hd02e9k",
            "score": 2,
            "text": "Good for them, natives got screwed when Europe stole their country.",
            "title_similarity": "0.31247643",
            "sentiment_compound": -0.0772
        },
        {
            "id": "hd057x2",
            "score": 2,
            "text": "Fair",
            "title_similarity": "-0.011192787",
            "sentiment_compound": 0.3182
        },
        {
            "id": "hd08oh0",
            "score": -2,
            "text": "This but on a national scale instead of letting 1% keep 99% of the wealth.",
            "title_similarity": "0.40034428",
            "sentiment_compound": 0.6486
        },
        {
            "id": "hd0ai20",
            "score": -2,
            "text": "Lol this is why we don't need socialism, I bet they WISH they could have earned that themselves. \n\nLike good GOP bigots do.  \n\n/s",
            "title_similarity": "0.2280365",
            "sentiment_compound": 0.8918
        },
        {
            "id": "hd0cjma",
            "score": 2,
            "text": "Native Americans can never really be repaid but automatic millionaire status is probably about as close as we can get.",
            "title_similarity": "0.507892",
            "sentiment_compound": 0.0
        },
        {
            "id": "hd0dnyb",
            "score": -2,
            "text": "Proof that reservations were actually for the best amirite?",
            "title_similarity": "0.23250204",
            "sentiment_compound": 0.6369
        },
        {
            "id": "hd0dogk",
            "score": -2,
            "text": "Time to find me a Seminole bride! Wait….Shit I’m married. Anyone know a good divorce lawyer?",
            "title_similarity": "0.50915873",
            "sentiment_compound": 0.4926
        },
        {
            "id": "hd0fi3o",
            "score": 2,
            "text": "good for them, that’s the least we can do for literally every indigenous person in north america.",
            "title_similarity": "0.44417468",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hd0mg5i",
            "score": 2,
            "text": "My DNA results say I am 0% Native American.  They also say that I am 0% African American.  (Damn, I was more disappointed by that one.)\n\nThey do say that I am 100% white though so atleast there's that I guess.  Just so the people in charge know, I'm still waiting in those privilege checks.  You guys are really dropping the ball right now.",
            "title_similarity": "0.50202817",
            "sentiment_compound": -0.5563
        },
        {
            "id": "hd0z598",
            "score": 2,
            "text": "I’m just waiting on all of the “Tax the rich!” and “Eat the rich!” comments to come flooding in.",
            "title_similarity": "0.4732306",
            "sentiment_compound": 0.0
        },
        {
            "id": "hd0z86c",
            "score": -2,
            "text": "Time to free the Indians!",
            "title_similarity": "0.3112716",
            "sentiment_compound": 0.5562
        },
        {
            "id": "hd10rn6",
            "score": 2,
            "text": "Good. They deserve it.",
            "title_similarity": "0.024191758",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hd11jvp",
            "score": -2,
            "text": "Good for them, but do any of them use that money in a useful way?",
            "title_similarity": "0.1759789",
            "sentiment_compound": 0.7003
        },
        {
            "id": "hd1924z",
            "score": 2,
            "text": "Why are Native American still referred to as Indians?",
            "title_similarity": "0.2082558",
            "sentiment_compound": 0.0
        },
        {
            "id": "hd1brej",
            "score": 2,
            "text": "The Native American culture is a culture very much based on helping each other out. For example, if someone’s house is destroyed. Other folks will let them stay at their house/pitch in to help them get a new house built.\n\nIt’s an incredible lesson in generosity that all can learn from.",
            "title_similarity": "0.4720853",
            "sentiment_compound": 0.6444
        },
        {
            "id": "hd1guru",
            "score": 2,
            "text": "Tax the rich!!",
            "title_similarity": "0.41359442",
            "sentiment_compound": 0.6351
        },
        {
            "id": "hd1nqsm",
            "score": 2,
            "text": "Are we really still using the term 'Indian' to describe the native Americans. Do you think the president is Roosevelt too?",
            "title_similarity": "0.4721058",
            "sentiment_compound": 0.0
        },
        {
            "id": "hd1puq3",
            "score": 2,
            "text": "Don't think this is true",
            "title_similarity": "-0.1751501",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hd26rwx",
            "score": 2,
            "text": "Calling bullshit",
            "title_similarity": "-0.08408702",
            "sentiment_compound": -0.5859
        },
        {
            "id": "hcz9urf",
            "score": 26,
            "text": "I'm native from the southwest. It's interesting learning about other tribes and distribution. I turned 18 and got a fat check. Get monthly checks until I guess I die? I got college paid for (went to a private school and was around $60k a year so saved me over $200k). They have stepped the fuck up for covid too. I have received several thousand just randomly in the mail. They have paid 4 months rent, water and utilities. My kids will get free college and all the same benefits. Lots of tribe pay for college and it's hopeful they return educated to help the reservation. It is very very very rare to find a decent looking reservation.",
            "title_similarity": "0.69721884",
            "sentiment_compound": 0.8561
        },
        {
            "id": "hcyzjw5",
            "score": 2,
            "text": "Man I wish this was true of my Tribe. The casino generates enough revenue to stay open and a pinch of crumbs to the tribe",
            "title_similarity": "0.5489044",
            "sentiment_compound": 0.6705
        },
        {
            "id": "hcz8id4",
            "score": 3,
            "text": "Can anyone explain to me why native Americans own casinos?",
            "title_similarity": "0.5184617",
            "sentiment_compound": 0.0
        },
        {
            "id": "hcz95t6",
            "score": 4,
            "text": "Is it their plan to buy the North American continent?",
            "title_similarity": "0.33784148",
            "sentiment_compound": 0.0
        },
        {
            "id": "hczaa5b",
            "score": -3,
            "text": "Take note Americans, THIS is true Socialism in action.",
            "title_similarity": "0.300977",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hczaz6x",
            "score": 4,
            "text": "Casinos. Taking back white people’s money, one quarter at a time.",
            "title_similarity": "0.5888758",
            "sentiment_compound": 0.0
        },
        {
            "id": "hczcl2u",
            "score": -3,
            "text": "The hate from these comments.\n\nYour hating on an entire race/ethnic group. Racists.",
            "title_similarity": "0.1482077",
            "sentiment_compound": -0.8885
        },
        {
            "id": "hczfdck",
            "score": 3,
            "text": "Around 16,000 enrolled Seminole members in Oklahoma, and 4,000 enrolled Seminole members in Florida. This money is only given to the Florida members.",
            "title_similarity": "0.54791963",
            "sentiment_compound": 0.0
        },
        {
            "id": "hcznels",
            "score": -3,
            "text": "But they still lay the white guilt on as heavily as they can whenever we ask for things like taxes from them.",
            "title_similarity": "0.32581455",
            "sentiment_compound": 0.1531
        },
        {
            "id": "hcznvqg",
            "score": 2,
            "text": "These are very specific cases. Please do not assume every Tribe in the US is flooded with money and gives out per capita payments to their tribal members. I was infuriated when my freshmen's college filppantly recommended to go to my tribe to ask for 24,000 to cover her tuition.",
            "title_similarity": "0.58128285",
            "sentiment_compound": -0.1621
        },
        {
            "id": "hczu85m",
            "score": -3,
            "text": "Come on, man. Even the article calls them Native American. \"Indian\" is outdated.",
            "title_similarity": "0.33689478",
            "sentiment_compound": 0.0
        },
        {
            "id": "hczvt3d",
            "score": -3,
            "text": "Is that why black people from black communities reiterate the same thing? Indians just keep their mouths shut and keep getting paid reperations -- I know this because I have an uncle who partnered with an Indian woman who won't get married because she'd lose all of her Indian benefits.",
            "title_similarity": "0.462125",
            "sentiment_compound": -0.0258
        },
        {
            "id": "hczyfg2",
            "score": 3,
            "text": ">every Seminole Indian child born is a multi millionaire when they turn 18 years old.\n\nIt doesn't say that in the linked article?\n\n&#x200B;\n\nWhat it says:\n\n>earlier on, the Children’s Trust Fund paid Seminole high school students $17,000 upon graduation, but the amount has since grown to $200,000\n\nand\n\n>every tribe member gets $128,000 per year\n\n&#x200B;\n\nNothing in the article about turning 18.  Nothing in the article about multimiliiionaires.",
            "title_similarity": "0.7854432",
            "sentiment_compound": 0.2846
        },
        {
            "id": "hczzore",
            "score": -4,
            "text": "Why are people still referring to native Americans as Indians? They aren't Indian. They are native Americans. Indians = From India. Native Americans are not from India. I really wish people would stop saying Indian when referring to a native American.",
            "title_similarity": "0.2911131",
            "sentiment_compound": 0.2006
        },
        {
            "id": "hd0631a",
            "score": 3,
            "text": "I kinda wish all the casinos in the US were native outfits, it would be a bit of a give back to the indigenous people who suffered from the settling of their territory. It should be well accounted for and administered wisely and evenly among all natives. This would mean a fund that could build out roads and hospitals as seen fit on reserved land but would also release funds directly to individuals based on the balance of need.  Gambling is a vice, it can be fun but in the long run the odds are against you, it's experiential in that you know you might be throwing your money away in the pursuit of more, in an Indian Casino at least the house is set up to use the profits for good.",
            "title_similarity": "0.49945474",
            "sentiment_compound": 0.9428
        },
        {
            "id": "hd06f98",
            "score": 3,
            "text": "They deserve it!",
            "title_similarity": "0.08815352",
            "sentiment_compound": 0.0
        },
        {
            "id": "hd0926k",
            "score": 4,
            "text": "I live near another tribe. But they get their paper as well. I knew a dude in high school who wasn't all there, but got ridiculous money. It was sad to see him get taken advantage of.  The worst part was he knew. But he said the love was worth more than the money. Fuck. I wonder how he is.",
            "title_similarity": "0.43896964",
            "sentiment_compound": -0.7579
        },
        {
            "id": "hd0az6h",
            "score": 2,
            "text": "My parents went to school with most of the Seminole Tribe of Florida members who are running the show now. They both said that they were dirt poor and barely had shoes on their feet. \n\nThey all went to college and were the ones who figured out the sovereign nation status that most native American casinos depend on now.",
            "title_similarity": "0.6316244",
            "sentiment_compound": -0.6705
        },
        {
            "id": "hd0dcdq",
            "score": 3,
            "text": "That’s nice but doesn’t help the other thousands of Natives living in shitty reservations without much aid.",
            "title_similarity": "0.34085697",
            "sentiment_compound": -0.1154
        },
        {
            "id": "hd0e1jc",
            "score": 2,
            "text": "My college had free tuition for native Americans, I’ve interacted with both ridiculously loaded natives and ridiculously poor native americans. There is a huge disparity between tribes.  I’ll never forget being the only white person at a native party though. It got pretty awkward when they started hating on white people.",
            "title_similarity": "0.5441905",
            "sentiment_compound": 0.0941
        },
        {
            "id": "hd0epfu",
            "score": -3,
            "text": "Tax them to hell and back.",
            "title_similarity": "0.2163808",
            "sentiment_compound": -0.6808
        },
        {
            "id": "hd0f2uy",
            "score": 3,
            "text": "And most Native Americans don't get jack shit when they turn 18, so don't be an asshole and ask them if they get any of \"that Indian money\"",
            "title_similarity": "0.48493075",
            "sentiment_compound": 0.4449
        },
        {
            "id": "hd0mruj",
            "score": 1,
            "text": "Fun fact: they still tend to live in squalor and spend their days doing drugs. \n\nNot hating on them, it’s just the truth.",
            "title_similarity": "0.24845181",
            "sentiment_compound": 0.8075
        },
        {
            "id": "hd0ong4",
            "score": 4,
            "text": "just call it reparations",
            "title_similarity": "-0.020591052",
            "sentiment_compound": 0.0
        },
        {
            "id": "hd0qk65",
            "score": 2,
            "text": "It’s kinda sad, though. I was a cashier at a Seminole casino and you get quite a few 18-22 year olds coked out of their minds coming in to cash checks. You can tell the influx of money is too tempting",
            "title_similarity": "0.6512047",
            "sentiment_compound": -0.4228
        },
        {
            "id": "hd0vy2n",
            "score": 3,
            "text": "1 get rich, 100 get kicked out of their homes...\nCasino math.",
            "title_similarity": "0.6919326",
            "sentiment_compound": 0.5574
        },
        {
            "id": "hd0w602",
            "score": 3,
            "text": "My checks are the only reason I've been able to relocate to the EU and follow my dreams. Its not much but I make it work as additional income.",
            "title_similarity": "0.4067819",
            "sentiment_compound": 0.2144
        },
        {
            "id": "hd0yhqg",
            "score": 2,
            "text": "*cries in unregistered Cherokee*",
            "title_similarity": "0.2496831",
            "sentiment_compound": -0.4019
        },
        {
            "id": "hd11ze0",
            "score": 4,
            "text": "I think people grossly overestimate the income from casinos on Indian land.",
            "title_similarity": "0.5709119",
            "sentiment_compound": -0.2263
        },
        {
            "id": "hd1rfql",
            "score": -2,
            "text": "[deleted]",
            "title_similarity": "-0.09306651"
        },
        {
            "id": "hcyls1d",
            "score": 40,
            "text": "I did some work for their environmental department years ago. No one working there was Indian, I asked why and they said they are all millionaires and don't need to work.",
            "title_similarity": "0.51076305",
            "sentiment_compound": -0.296
        },
        {
            "id": "hczaxee",
            "score": -4,
            "text": "Gotta love the payback. The inbred descendants of the murderous white folk that literally wiped out whole civilizations, are spending all their money at Indian Casinos.",
            "title_similarity": "0.6769708",
            "sentiment_compound": 0.0
        },
        {
            "id": "hczm10z",
            "score": -4,
            "text": "ZsaA...\n......po...oom\n.o..o\nPoco por\no:-)(^^)(^^)^_^(^^)(^^)(^^)(^^)^_^*\\0/**\\0(^^)(づ￣ ³￣)づ(づ￣ ³￣)づ(づ￣ ³￣)づ(⊃ • ʖ̫ • )⊃\nP⊂(･ω･*⊂)(づ￣ ³￣)づo((*^▽^*))oo((*^▽^*)(づ￣ ³￣)づo((*^▽^*))oo((*^▽^*))o(づ￣ ³￣)づ(づ￣ ³￣)づ(づ￣ ³￣)づ(⊃ • ʖ̫ • )⊃(⊃ • ʖ̫ • )⊃(⊃ • ʖ̫ • )⊃(⊃ • ʖ̫ • )⊃(⊃ • ʖ̫ • )⊃༼ つ ◕‿◕ ༽～(つˆДˆ)つ｡☆o((*^▽^*))o(づ￣ ³￣)づo((*^▽^*))oo((*^▽^*))o((*^▽^*))o(づ￣ ³￣)づ༼ つ ◕‿◕ ༽つ(づ￣ ³￣)づ(⊃ • ʖ̫ • )⊃༼ つ ◕‿◕ ༽つ(づ￣ ³￣)づ(づ￣ ³￣)づ(づ￣ ³￣)づo((*^▽^*))o⊂(･ω･*⊂～(つˆДˆ)つ｡☆⊂(･ω･*⊂)(⊃ • ʖ̫ • )⊃(⊃ • ʖ̫ • )⊃(⊃ • ʖ̫ • )(･–･) \\(･◡･)/o((*^▽^*))o(づ￣ ³￣)づ(づ￣ ³￣)づ(づ￣ ³￣)づ(づ￣ ³￣)づ༼ つ ◕‿◕ ༽つ(⊃ • ʖ̫ • )⊃༼ つ ◕‿◕ ༽つ(づ￣ ³￣)づ(づ￣ ³￣)づ(づ￣ ³￣)づ༼ つ ◕‿◕ ༽つ(⊃ • ʖ̫ • )⊃୧(﹒︠ᴗ﹒︡)୨ᕦ⊙෴⊙ᕤᕦ⊙෴⊙ᕤᕦ༼ ~ •́ ₒ •̀ ~ ༽ᕤᕦ༼ ~ •́ ₒ •̀ ~ ༽ᕤᕦ༼ ~ •́ ₒ •̀ ~ ༽ᕤᕦ༼ ~ •́ ₒ •̀ ~ ༽ᕤᕦ༼ ~ •́ ₒ •̀ ~ ༽ᕤᕦ༼ ~ •́ ₒ •̀ ~ ༽ᕤᕦ༼ ~ •́ ₒ •̀ ~ ༽ᕤᕦ༼ ~ •́ ₒ •̀ ~ ༽ᕤᕦ⊙෴⊙ᕤᕦ⊙෴⊙ᕤᕦ⊙෴⊙ᕤᕦ⊙෴⊙ᕦ⊙෴⊙ᕤᕦ( ⊡ 益 ⊡ᕦ⊙෴⊙ᕤᕦ༼ ~ •́ ₒ •̀ ~ᕦ( ⊡ 益 ⊡ )ᕦ༼ ~ •́ ₒ •̀ ~ ༽ᕤᕦ༼ ~ •́ ₒ •̀ ~ ༽ᕤᕦ༼ ~ •́ ₒ •̀ ~ ༽ᕤᕦ༼ ~ •́ ₒ •̀ ~ ༽ᕤᕦ༼ ~ •́ ₒ •̀ ~ ༽ᕤᕦ༼ ~ •́ ₒ •̀ ~ ༽ᕤᕦ⊙෴ᕦ( ⊡ 益 ⊡ )ᕤᕦ⊙෴⊙ᕤᕦ⊙෴⊙ᕤᕦ⊙෴⊙ᕤᕦ⊙෴⊙ᕤᕦ༼ ~ •́ ₒ •̀ ~ ༽ᕤᕦ༼ ~ •́ ₒ •̀ ~ ༽ᕤᕦ⊙෴⊙ᕤᕦ⊙෴⊙ᕤᕦ( ⊡ 益 ⊡ )ᕤ୧(﹒︠ᴗᕙ( ¤ 〰 ¤ )ᕗᕦ( ⊡ 益 ⊡ )ᕤᕙ( ¤ 〰 ¤ )ᕗᕙ( ¤ 〰 ¤ )୧(﹒︠ᴗ﹒︡)୨ᕙ(  • ‿ •  )ᕗᕙ( ¤ 〰 ¤ )ᕗᕙ(  • ‿ •  )ᕗᕙ( ¤ 〰 ¤ )ᕗᕙ(  • ‿ •  )ᕗᕙ( ¤ 〰 ¤ )ᕗᕙ( ¤ 〰 ¤ )ᕗ୧(﹒︠ᴗ﹒︡)୨ᕦ⊙෴⊙ᕤ୧(﹒︠ᴗᕦ༼ ~ •́ ₒ •̀ ~ ༽ᕦ༼ ~ •́ ₒ •̀ ~ ༽୧(﹒︠ᴗ﹒︡)୨ᕙ(  • ‿ •  )ᕗ\n\nO\n\nO\n\n\nᕙ( ¤ 〰 ¤ )ᕗᕙ(  • ‿ •  )୧(﹒︠ᴗ﹒︡)୨ᕙ(  • ‿ •  )ᕗ୧(﹒︠ᕙ(  • ‿ •  )ᕗᴗ﹒︡ᕙ(  • ‿ •  )ᕗ୨ᕙ(  • ‿ •  )ᕗᕙ(  • ‿ •  )ᕗᕙ(  • ᕙ(  • ‿ •  )ᕗ •  )ᕗᕙ(  • ‿ •  )ᕗᕙ( ¤ 〰 ¤ )ᕗᕙ(  • ‿ •  )ᕗᕙ(  •ᕙ( ¤ 〰 ¤ )୧(﹒︠ᴗ﹒︡)୨୧(﹒︠ᴗ﹒︡)୨ᕙ(  • ‿ •  )ᕗ୧(﹒︠ᴗ﹒︡)୨ᕙ( ¤ 〰 ¤ )ᕗ୧(﹒︠ᴗ﹒︡)୨୧(﹒︠ᴗ﹒︡)୨‿ •  )ᕗ\nᕙ(  • ‿ •  )ᕗᕙ(  • ‿ •  )ᕗᕙ( ¤ 〰 ¤ )ᕗᕙ(  • ‿ •  )ᕗᕙ(  • ‿ •  )ᕗᕙ(  • ‿ •  )ᕦ༼ ~ •́ ₒ •̀ ~ ༽ᕦ༼ ~ •́ ₒ •̀ ~ ᕦ༼✩ل͜✩༽ᕤᕦ༼ ~ •́ ₒ •̀ ~ ༽ᕤ୧(﹒︠ᴗ﹒︡)୨୧(﹒︠ᴗ﹒︡)୨ᕙ(  • ‿ •  )ᕗ୧(﹒︠ᕦ༼ ~ •́ ₒ •̀ ~ ༽ᕤ୧(﹒︠ᴗ﹒︡)୨୧(﹒︠ᴗ﹒︡)୨୧(﹒︠ᴗ﹒︡)୨୧(﹒︠ᴗ﹒︡ᕙ( ¤ 〰 ¤ )ᕗᕙ(  • ‿ •  )ᕗᕙ(  • ‿ •  )ᕗ)୨ᕙ( ¤ 〰 ᕦ( ⊡ಠಿヮಠ (◠ᴥ◕ʋ) ⊡ )ᕤᕦ⊙෴⊙ᕤᕦ⊙෴⊙ᕤ୧(﹒︠ᴗ﹒︡)୨ᕦ༼✩ل͜ಠ︵ಠಠ ͜ʖ ಠಠ ͜ʖ ಠಠ ͜ʖ ಠಠ ͜ʖ ಠΣ(ಠ_ಠ)Σ(ಠ_ಠ)ಠ ೧ ಠಠ︵ಠಠಿヮಠಠಿヮಠಠ︵ಠಠಿヮಠಠ ͜ʖ ಠಠ ೧ ಠಠ ͜ʖ ಠಠ ೧ ಠಠ︵ಠಠ ͜ʖ ಠಠ︵ಠΣ(ಠ_ಠ)ಠωಠಠ︵ಠ ೧ ಠಠ ೧ ಠ༽ᕤಠ ೧ಠ ೧ ಠಠ ೧ಠ︵ಠ ل͟ ಠಠωಠಠ︵ಠಠ︵ಠಠ ೧ ಠಠ︵ಠಠ ͜ʖ ಠಠ︵ಠΣ(ಠ_ಠ)ಠಿヮಠΣ(ಠ_ಠ)ಠ︵ಠΣ(ಠ_ಠ)Σ(ಠ_ಠ)ಠ︵ಠΣ(ಠ_ಠ)Σ(ಠ_ಠ)Σ(ಠ_ಠ)Σ(ಠ_ಠ)Σ(ಠ_ಠ)Σ(ಠ_ಠ)ಠ︵ಠಠ︵ಠಠ ೧ ಠಠ︵ಠಠ ͜ʖ ಠಠ ͜ʖ ಠಠ ͜ʖ ಠಠ ೧ ಠಠ ೧ ಠ ͜ʖ ಠಠ ೧ ಠ ಠಠ︵ಠಠ ͜ʖ ಠಠ︵ಠಠ ͜ʖ ಠಠ ೧ ಠಠಿヮಠಠಿヮಠಠಿヮಠಠ‿ಠΣ(ಠ_ಠ)Σ(ಠ_ಠ)ಠ‿ಠΣ(ಠ_ಠ)ಠ‿ಠΣ(ಠ_ಠ)Σ(ಠ_ಠ)ಠಿヮಠಠಿヮಠಠ︵ಠಠ ೧ ಠ\n^_^(^^)(^^)^_^o:-)^_^(^^)^_^(^^)(^^)(^^)(^^)(^^)(^^)(^^)(^^)",
            "title_similarity": "0.27540702",
            "sentiment_compound": 0.0
        },
        {
            "id": "hczzaif",
            "score": 4,
            "text": "As they fucking should!!!",
            "title_similarity": "0.10532502",
            "sentiment_compound": 0.0
        },
        {
            "id": "hd028ob",
            "score": -5,
            "text": "Wow. So why don't they advocate for the other native Americans?",
            "title_similarity": "0.17548653",
            "sentiment_compound": 0.5859
        },
        {
            "id": "hd04m6i",
            "score": 3,
            "text": "The sad fact I kept seeing is that there are less than 500 members of each tribe alive… so I’m happy they are getting something in return.",
            "title_similarity": "0.3836093",
            "sentiment_compound": 0.2212
        },
        {
            "id": "hd0a7em",
            "score": -4,
            "text": "And they want to cry about oppression. Lmfao!",
            "title_similarity": "0.09640318",
            "sentiment_compound": 0.2481
        },
        {
            "id": "hd0lnmr",
            "score": -3,
            "text": "Let me guess, there's also a very high rate of substance abuse too?  Just giving people money, like with lottery winners, tends to ruin them.",
            "title_similarity": "0.41779882",
            "sentiment_compound": -0.25
        },
        {
            "id": "hd1fgyu",
            "score": 4,
            "text": "Imagine taking care of your community.",
            "title_similarity": "0.0133412555",
            "sentiment_compound": 0.4939
        },
        {
            "id": "hd1kwzl",
            "score": -4,
            "text": "I’m ashamed to admit that I knew none of this. America is a third world country, I’m convinced",
            "title_similarity": "0.2525884",
            "sentiment_compound": 0.1027
        },
        {
            "id": "hd1z7m1",
            "score": 5,
            "text": "Seminole privilege",
            "title_similarity": "0.25026524",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hcz4rsw",
            "score": 168,
            "text": "There's a pretty similar (but less positive and darker) aspect to the Canadian Sawridge Band.\n\nThey lease their land to the Canadian Oilsands Industry and are one of the largest benefactors of it (getting a royalty on all oil extracted).  This has made them BILLIONAIRES and the thing is, their band only has 50 members so each member is sort of one of the richest people in Canada.\n\nBut to keep a band at 50 members is tough because people procreate and so they've made rules to artificially limit the size of their bands.\n\nMen can marry outside of the band, women cannot.  If women marry out, they get out.  And thus there are hundreds of ex-Sawridge women across Canada who have no access to their benefits or fortune because they opted to marry out rather than marry a cousin.\n\nWhen tested in court they declared Marry Out Get Out was a protected part of their tradition and no laws on sexism could change that.\n\nThe federal government created a law that stated that if an indigenous group did not provide a proper account of spending that they would be cut off from all federal funding.  The billionaires at Sawridge argued that secrecry is a tradition of theirs protected under treaty rights and thus they're not required to expose their finances to anyone.\n\nToday Sawridge secretly has its money in everything and is secretly one of the largest investment groups in the world.\n\nThe group secretive nature has made them the indigenous boogieman of Canada (in which every indigneous group must be like them).",
            "title_similarity": "0.64727306",
            "sentiment_compound": 0.9547
        },
        {
            "id": "hd035q3",
            "score": 5,
            "text": "Redditors are now in love with small group of wealthy people.",
            "title_similarity": "0.37186325",
            "sentiment_compound": 0.7717
        },
        {
            "id": "hd08fsn",
            "score": 5,
            "text": "Let’s not forget this is not the norm. I can’t help but feel people will point to this as justification why rez folks don’t need assistance 😖",
            "title_similarity": "0.04072558",
            "sentiment_compound": 0.2921
        },
        {
            "id": "hd09yvc",
            "score": -5,
            "text": "Red Privilege",
            "title_similarity": "0.0987168",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hd0faci",
            "score": -4,
            "text": "And yet they'll still somehow manage to be a broke waste of space by the time they're 19",
            "title_similarity": "0.36936742",
            "sentiment_compound": -0.6808
        },
        {
            "id": "hcyrcu4",
            "score": 212,
            "text": "The title is extremely false. The largest Seminole band is the [Seminole Nation of Oklahoma](https://en.m.wikipedia.org/wiki/Seminole_Nation_of_Oklahoma) and they do not get this money",
            "title_similarity": "0.47051346",
            "sentiment_compound": 0.0
        },
        {
            "id": "hcz9bih",
            "score": 37,
            "text": "I’m somewhat of a Seminole Indian myself",
            "title_similarity": "0.33434886",
            "sentiment_compound": 0.0
        },
        {
            "id": "hcyrhc7",
            "score": -6,
            "text": "Good.\n\nNow, if they would just pay the kid for the stolen land.",
            "title_similarity": "0.32393098",
            "sentiment_compound": -0.1779
        },
        {
            "id": "hcz7e6t",
            "score": 6,
            "text": "My brother knew someone like this. He would regularly take his whole group of friends to strip clubs and paid for everyone. \n\nCouldn’t save money to safe his life. He got locked up for a few months and came out to like 50k in his bank account.\n\nThe guy could live on a beautiful island resort for the rest of his life, but he goes to strip clubs and gets DWIs.",
            "title_similarity": "0.68200606",
            "sentiment_compound": 0.8422
        },
        {
            "id": "hczgyg3",
            "score": 7,
            "text": "In CA the tribe where I'm from is loaded too. They have more financial resources available than any other ethnic group yet the res looks like a third world country. Addiction is a huge problem. I hope the Seminole are doing better.",
            "title_similarity": "0.56961906",
            "sentiment_compound": 0.7845
        },
        {
            "id": "hd169zh",
            "score": 7,
            "text": "Just want to throw out some additional info for reference and further perspective. \n\nThis is talking about the Seminole Tribe of Florida specifically. There are two other federally recognized Seminole tribes. The Seminole Nation of Oklahoma, and the Miccosukee Tribe of Indians of Florida. Members of the latter two tribes do not receive these payments. \n\nAs of 2019 there were 4,244 enrolled members in the Seminole Tribe of Florida. In 2020 9.7 million people identified as Native American and Alaska Native (NAAI) alone and in combination with another race. The Seminole Tribe of Florida makes up only 0.04% of that number.\n\nTo compare to the rest of the country as a whole, in 2019 there were 5.91 million high net worth individuals (net worth of $1M or more) in the US, compared to a population 328.2 million people. Essentially, millionaires and up make up 1.8% of our population. The rate of millionaires amongst the general population is almost five times higher than that of the NAAI population.\n\nI know most of us here don't need to hear this, but the experience of this tribe is not even remotely indicative of that of the vast majority of native Americans.",
            "title_similarity": "0.52546334",
            "sentiment_compound": 0.1779
        },
        {
            "id": "hcz8zvu",
            "score": 52,
            "text": "I’m Seminole Indian but do not see any revenue from the casino. I get all the other benefits listed, like free medical, money for college and other things but it’s all stuff we have to apply to.",
            "title_similarity": "0.46231788",
            "sentiment_compound": 0.9022
        },
        {
            "id": "hczbald",
            "score": 6,
            "text": "fun fact...the Seminoles 1. Never surrendered....2. Were 6'6 average height (probably evolution from living in southern Florida with a lot of swamp land and water.\n\n(I live in South Florida so knew these 2 facts)\n\n\"By May 10, 1842, when a frustrated President John Tyler ordered the end of military actions against the Seminoles, over $20 million had been spent, 1500 American soldiers had died and still no formal peace treaty had been signed. At that time, it marked the most costly military campaign in the young country's history. And it wasn't over yet. Thirteen years later, a U.S. Army survey party - seeking the whereabouts of Abiaka and other Seminole groups - was attacked by Seminole warriors under the command of the colorful Billy Bowlegs. The nation invested its entire reserve into the apprehension of the ambushers\"",
            "title_similarity": "0.6531458",
            "sentiment_compound": -0.916
        },
        {
            "id": "hczds51",
            "score": 5,
            "text": "Now imagine the largest native tribe in the US (Navajo Nation), where most children are born into poverty.",
            "title_similarity": "0.5948964",
            "sentiment_compound": -0.5106
        },
        {
            "id": "hczgvor",
            "score": 8,
            "text": "It says much about the American psyche that the author felt it was necessary to add ‘in the world’ to an article titled ‘The Richest Native American tribes’",
            "title_similarity": "0.5738566",
            "sentiment_compound": 0.5267
        },
        {
            "id": "hczb51o",
            "score": -8,
            "text": "Too bad most people prefer capitalism where you work for pennies and can't afford to have food and shelter.",
            "title_similarity": "0.37623033",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hczh060",
            "score": 9,
            "text": "The title of the article is \"The Richest Native American Tribes in the World\". Native American tribes. In the WORLD. 🙄",
            "title_similarity": "0.69236267",
            "sentiment_compound": 0.5267
        },
        {
            "id": "hcz2by3",
            "score": 88,
            "text": "Native American casinos are supposed to distribute, but they don't.\n\nMy friend who is Quapaw should be receiving revenue earned from Downstream Casino in Oklahoma, but the tribal elders, who all have part ownership, decided it would promote 18 yr olds not to work and be lazy.....\n\n\n\n\n.....so they decided to keep ALL of it themselves.....and use that as an excuse to keep it.",
            "title_similarity": "0.5346855",
            "sentiment_compound": -0.4295
        },
        {
            "id": "hcz3qp2",
            "score": 9,
            "text": "It took me way too long to realise Seminole is a Native American tribe and not an ethnicity in India.",
            "title_similarity": "0.43398774",
            "sentiment_compound": 0.0
        },
        {
            "id": "hczaoxi",
            "score": 11,
            "text": "Time for a reddit circle jerk.",
            "title_similarity": "0.27318406",
            "sentiment_compound": -0.34
        },
        {
            "id": "hcyxbcf",
            "score": 339,
            "text": ">The State of Florida has also been enjoying massive sums of money thanks to a deal brokered in 2010 where the tribe would make payments to the state in good faith in return for exclusivity to offer blackjack and other banked card games.\n\nHow the fuck is this not bribery?",
            "title_similarity": "0.6752172",
            "sentiment_compound": 0.8176
        },
        {
            "id": "hd0kpyn",
            "score": 11,
            "text": "\"The Seminole Tribe of Florida may be guarded about sharing tribal information with outsiders, but they were smart enough to hire a non-native chief executive for their gambling operations.\"\nOne of the many tidbits from this subtly but consistently racist article",
            "title_similarity": "0.5005206",
            "sentiment_compound": -0.2617
        },
        {
            "id": "hcz693a",
            "score": 15,
            "text": "My current boss worked for the Seminole tribe years ago. He managed their education grant program and with that came a company car, phone, and travel. When the seniors graduates high school they all go on a multi-week trip to the Bahamas the he went on as a chaperone as well. Seemed like a pretty sweet gig.",
            "title_similarity": "0.68943155",
            "sentiment_compound": 0.9062
        },
        {
            "id": "hcyf2ym",
            "score": 582,
            "text": "Ummm...I'm a member of the Choctaw Nation and we have casinos.  Where's my check?!",
            "title_similarity": "0.6212368",
            "sentiment_compound": 0.0
        },
        {
            "id": "hcz0c2v",
            "score": 506,
            "text": "I dunno my 23AndMe result  is telling me im 0.005% Seminole Indian despite my parents both being immigrants from Asia.",
            "title_similarity": "0.55951583",
            "sentiment_compound": 0.0
        },
        {
            "id": "hcz8io3",
            "score": 108,
            "text": "For one rich as fuck tribe you got 4 poor as fuck tribes",
            "title_similarity": "0.49406704",
            "sentiment_compound": -0.7579
        },
        {
            "id": "hcyqyze",
            "score": 237,
            "text": "there are two major seminole tribes, the larger of which is based in oklahoma. so not all seminoles are wealthy, just the ones descended from the ancestors who hid in the florida swamps and avoided forced removal to indian territory. history is weird.",
            "title_similarity": "0.5167165",
            "sentiment_compound": -0.6124
        },
        {
            "id": "hczcfqk",
            "score": 32,
            "text": "My old boss was just a regular old working stiff, college dropout. In his early 30's, it was disovered he was descendant of a tribe that runs a large casino/hotel down here in Southern California. After this discovery, he was told he could receive financial compensation after taking a few classes about the tribe's history, language, do some community work and participate in some ceremonies, etc. This process took about a year. After he was done with all that, he began receiving about $350k a year from the tribe. Must be nice. \n\nToo bad this nice little windfall didn't stop him from being a prick.",
            "title_similarity": "0.6757206",
            "sentiment_compound": 0.196
        },
        {
            "id": "hcyfyub",
            "score": 3675,
            "text": "As a member of the Seminole Tribe of Oklahoma, we real poor.\n\nEdit: I didn't imagine this somewhat deprecating statement to blow up as it did. However, I'd like to add that I'm very proud to be part of the Seminole Tribe in Oklahoma and despite our financial challenges, we have a rich tradition. Also, If y'all want a quasi-glimpse of Native life in Oklahoma, give the show Reservation Dogs a view. The show is directed and written by  a local Muscogee-Creek and Seminole filmmaker, Sterlin Harjo, from Oklahoma.",
            "title_similarity": "0.45814687",
            "sentiment_compound": 0.7558
        },
        {
            "id": "hcyp9fj",
            "score": 1266,
            "text": "Now let’s talk about the fun part of who gets to decide who is an “official” Seminole Indian. These things get complicated and ugly.\n\nDo you have a child with a tribe member and another child with a non-tribe member? Guess who is a millionaire and guess who gets jack shit?!?\n\nWanna marry outside the tribe? Want to divorce a tribe member? Millions of dollars are at stake.",
            "title_similarity": "0.61869323",
            "sentiment_compound": -0.6759
        },
        {
            "id": "hcyqoqi",
            "score": 1034,
            "text": "Worked on a Seminole reservation in South Florida when I was younger for a year or so. Not everyone was getting that money at the time. The casino disbursements were allotted by political standing in the tribe. The daughter of the chief at the time we found in the ditch passed out with cocaine and booze all over her car. The tribal police came and took her home, lol. There were very rich natives that had awesome houses etc, and there were typical single wide trailers with 80 broken down beater cars out front. Lots of drug use and alcoholism even though the rez was dry. I'm not sure if the amount of money has changed per person but you could just go drive out to the big cypress Seminole reservation and drive around and see.",
            "title_similarity": "0.61716056",
            "sentiment_compound": 0.5212
        },
        {
            "id": "hcyjejs",
            "score": 3399,
            "text": "\"The Shakopee Mdewakanton are the wealthiest Native American tribe, going by the individual personal wealth. They are 480 members, and each member gets around $84,000 per month\"\n\n&#x200B;\n\nBruhhhh",
            "title_similarity": "0.7677858",
            "sentiment_compound": 0.7506
        },
        {
            "id": "hcye42g",
            "score": 7177,
            "text": "And to think all this came about because some small tribe ran a bingo hall out of a single-wide.",
            "title_similarity": "0.5883581",
            "sentiment_compound": 0.0
        },
        {
            "id": "hcybs18",
            "score": 23147,
            "text": "Every tribe member gets $128,000 per year, distributed through biweekly payments. Besides the hefty paychecks, members also get access to free private school and college fees, senior citizen care, and universal health care. By the time Seminole children attain 18 years, they are multi-millionaires because the child and parents are not allowed to withdraw any cash from the trust funds until the kids are adults. They also get an additional $200,000 when they graduate college.",
            "title_similarity": "0.74045336",
            "sentiment_compound": 0.9186
        },
        {
            "id": "hcyj7vq",
            "score": 20508,
            "text": "Funfact: The [Seminole Hard Rock Casino](https://en.wikipedia.org/wiki/Seminole_Hard_Rock_Hotel_and_Casino_Tampa) in Tampa is the 6th largest casino in the world. Originally, the land was being developed by the city for a parking garage when in 1980, Indian remains were found. The land was turned over to the Seminole tribe and within 2 years the first bingo hall was built and it's been expanding ever since",
            "title_similarity": "0.77252567",
            "sentiment_compound": -0.1027
        },
        {
            "id": "hcytw1a",
            "score": 1,
            "text": "I read the article and was curious if anyone knew how Florida fucked up to not getting 350 million dollars a year? That is a huge breach of contract.",
            "title_similarity": "0.5350317",
            "sentiment_compound": -0.2023
        },
        {
            "id": "hcyw1gm",
            "score": 1,
            "text": "Check out the Shakopee tribe",
            "title_similarity": "0.2098395",
            "sentiment_compound": 0.0
        },
        {
            "id": "hcyw23g",
            "score": 1,
            "text": "native Americans do pretty well with some tribes. I know some that don't work because they get their monthly check.",
            "title_similarity": "0.4981482",
            "sentiment_compound": 0.6486
        },
        {
            "id": "hcyw550",
            "score": 1,
            "text": "The article alludes to Florida breaking an agreement where the Seminoles paid them hundreds of millions of dollars each year to continue to gamble and now the Seminoles are not paying. What in the hell did Florida do to screw that up?",
            "title_similarity": "0.64671075",
            "sentiment_compound": -0.4215
        },
        {
            "id": "hcyxl93",
            "score": 1,
            "text": "Oh something I can contribute to. You should all read about the current chieftain and the guy they brought in to build the empire. Fun fact - The current chief was abandoned by his mother and learned how to wrestle alligators for tourists to make enough money to survive. \n\nhttps://www.forbes.com/sites/laurengensler/2016/10/19/seminole-tribe-florida-hard-rock-cafe/?sh=431f52c45bbc",
            "title_similarity": "0.54032815",
            "sentiment_compound": 0.0772
        },
        {
            "id": "hcz1wnr",
            "score": 1,
            "text": "Til, they are not the richest, other tribe is, and those get 80k per month, while Seminole has 120k per year. Talk about rich.",
            "title_similarity": "0.5760728",
            "sentiment_compound": 0.2081
        },
        {
            "id": "hcz2gne",
            "score": 1,
            "text": "I did a satellite TV install in Lorida, FL for a very nice old man. He used to be a really wealthy investor/businessman.  He had designed a giant casino/amusement park that was going to be built on one of the Seminole reservations in that area.  He has drawings, models, and other stuff in his big work shop attached to his house. Everything was going great until the tribal leader died and his son became the new leader. The son backed out of the deal and this man and all the other investors involved lost everything. This happened in the early 2000's. It was going to be crazy huge. Apparently the son and his group did not want several million visitors a year on their land.",
            "title_similarity": "0.69987607",
            "sentiment_compound": 0.5946
        },
        {
            "id": "hcz2pdn",
            "score": 1,
            "text": "And that's why tribes across the US are being torn apart.  People look at their fellows tribal members and say, \"Hey, didn't Joe have a great-grandfather who wasn't tribal?  If we increase the blood quota to be a real tribal member to at least 25% then all the money that would have gone to Joe will instead be split among the rest of us.\"\n\nSome tribes in California have literally seen their tribal rolls cut in half over the last couple decades from shenanigans like this.  Doesn't matter if you have six, seven, eight generations who lived on the reservation, if there's a way to disenfranchise you and make everyone else more wealthy then eventually they'll vote to do it.\n\nThere's no recourse.  The federal government says that membership is an intra-tribal matter.  And when it only takes a bare minimum to disenfranchise people...",
            "title_similarity": "0.6310404",
            "sentiment_compound": 0.3224
        },
        {
            "id": "hcz3095",
            "score": 1,
            "text": "Not all. The guy I buy weed from isn’t rich but one of my old highschool friends was rich. Used to carry $666 around in middle school to show off. No surprise the only friends he had wanted his money. Also had an arranged marriage to another native that he backed out of. So he doesn’t get his tribe money anymore because he married a white women. Proud of him for realizing money isn’t everything after growing up. \n\nNow on the other hand the kid my girlfriend went to school with was 18 and owned his own house. A hellcat challenger, hellcat charger that he destroyed and a new 5.0 mustang. \n\nAlso I used to live by a Seminole reservation and tried to get a job at one of their casinos. You’ll never see so many Ford Raptors and Hellcats anywhere else. Also one guy had a GT-R which is sweet. Even being a police officer on the reservation starts around $80,000 and easily goes to $100,000 a year. \n\nThey changed how money is distributed because of so many natives having mixed children so most of the next generations will never know that kind of money.",
            "title_similarity": "0.5945035",
            "sentiment_compound": 0.9826
        },
        {
            "id": "hcz4pjc",
            "score": 1,
            "text": "I’m taking a DNA test right now!",
            "title_similarity": "0.25451064",
            "sentiment_compound": 0.0
        },
        {
            "id": "hcz51k4",
            "score": 1,
            "text": "And what are they doing with the money? My nation is too small and poor to even operate as a nation. Most other nations, especially those that were pushed out west, are poorer than dirt and cannot a afford proper food, housing, medical care, or police protection.",
            "title_similarity": "0.33254206",
            "sentiment_compound": -0.5859
        },
        {
            "id": "hcz5k65",
            "score": 21,
            "text": "This is Florida Seminole only and not all.",
            "title_similarity": "0.20913026",
            "sentiment_compound": 0.0
        },
        {
            "id": "hcz5qho",
            "score": 1,
            "text": "I don't know about that....have you ever seen the housing on one of their reservations?  Not rich.",
            "title_similarity": "0.2675171",
            "sentiment_compound": -0.4449
        },
        {
            "id": "hcz5vdr",
            "score": 43,
            "text": "[deleted]",
            "title_similarity": "-0.09306649"
        },
        {
            "id": "hcz6bsh",
            "score": 1,
            "text": "Today I learned about adult adoption.",
            "title_similarity": "0.2974896",
            "sentiment_compound": 0.0
        },
        {
            "id": "hcz6ccj",
            "score": 1,
            "text": "so when theyre born or turn 18",
            "title_similarity": "0.38919044",
            "sentiment_compound": 0.0
        },
        {
            "id": "hcz6it7",
            "score": 1,
            "text": "I don’t think anyone is born 18 years old",
            "title_similarity": "0.31376284",
            "sentiment_compound": 0.0
        },
        {
            "id": "hcz746k",
            "score": 1,
            "text": "I spent time near a much poorer tribe a few years back. There were no protections on their gaming money, and parents regularly spent their kids money without regard for their kids at all, and then the kids spent their own kids money. Rather than it enriching the tribe and its members, it destroyed the families there and left them in a perceptual chase after anyone who had money, to grab what they could.\n\nIt sounds like the Seminole tribe did a far better job structuring their systems to prevent this from happening.",
            "title_similarity": "0.4917819",
            "sentiment_compound": -0.34
        },
        {
            "id": "hcz75dm",
            "score": 1,
            "text": "Must be nice",
            "title_similarity": "-0.045808323",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hcz76y2",
            "score": 1,
            "text": "Yes, there is wealth, which is good, but Native American casinos also create [a lot of problems for the tribes](https://www.kcur.org/community/2019-02-05/native-americans-face-greater-risk-of-becoming-problem-gamblers). These problems include gambling addiction (facilitated by the regular payouts from the tribal funds) and problems that often coexist with gambling addiction such as substance abuse.",
            "title_similarity": "0.5551183",
            "sentiment_compound": -0.9186
        },
        {
            "id": "hcz7gao",
            "score": 1,
            "text": "They are born at 28 years old??",
            "title_similarity": "0.36008656",
            "sentiment_compound": 0.0
        },
        {
            "id": "hcz7i4t",
            "score": 1,
            "text": "How?",
            "title_similarity": "-0.11509818",
            "sentiment_compound": 0.0
        },
        {
            "id": "hcz7jwr",
            "score": 2,
            "text": "Blow blow Seminole wind",
            "title_similarity": "0.29319158",
            "sentiment_compound": 0.0
        },
        {
            "id": "hcz7l27",
            "score": 1,
            "text": "How many members are there?",
            "title_similarity": "0.17498389",
            "sentiment_compound": 0.0
        },
        {
            "id": "hcz7ssu",
            "score": 23,
            "text": "Pretty sure this is the FLORIDA Seminoles. Back when the trail of tears occurred, many Seminoles relocated to Oklahoma. Today the Seminoles exists as two different tribes: one in Florida and one in Oklahoma. The Florida Seminoles are very rich while the Oklahoma Seminoles are not",
            "title_similarity": "0.60629106",
            "sentiment_compound": 0.8173
        },
        {
            "id": "hcz7ww3",
            "score": 1,
            "text": " D4s4  4K s",
            "title_similarity": "0.16664287",
            "sentiment_compound": 0.0
        },
        {
            "id": "hcz7xn2",
            "score": 1,
            "text": "S",
            "title_similarity": "-0.088794105",
            "sentiment_compound": 0.0
        },
        {
            "id": "hcz89pb",
            "score": 26,
            "text": "The per-member distributions are so large partly because they aggressively purge their membership roles.  They controversially use a 1/8 blood quantum standard to determine tribe membership.  This isn't some relic from the Indian Blood Laws either --it was established in 2000.\n\n&#x200B;\n\nA more cynical person than I might say that existing members have a financial incentive to deny legitimate membership claims, shrinking the pool of beneficiaries.",
            "title_similarity": "0.5167295",
            "sentiment_compound": -0.4818
        },
        {
            "id": "hcz8hrd",
            "score": 5,
            "text": "I don't understand why casinos aren't just legal everywhere? You hear all kinds of excuses as to why cities and locations don't want them (crime, wrong sort of people, etc.... ) but it's okay for your local tribe to have them right next door?",
            "title_similarity": "0.4183995",
            "sentiment_compound": 0.3158
        },
        {
            "id": "hcz9006",
            "score": 1,
            "text": "I thought that I was looking at Pride Rock",
            "title_similarity": "0.10035455",
            "sentiment_compound": 0.34
        },
        {
            "id": "hcz96kw",
            "score": 1,
            "text": "What?",
            "title_similarity": "-0.12978236",
            "sentiment_compound": 0.0
        },
        {
            "id": "hcz9ah0",
            "score": 2,
            "text": "Where do I sign up?",
            "title_similarity": "0.007897999",
            "sentiment_compound": 0.0
        },
        {
            "id": "hcz9he5",
            "score": 1,
            "text": "a whole nation of people born at 18, incredible stuff really",
            "title_similarity": "0.61877656",
            "sentiment_compound": 0.0
        },
        {
            "id": "hcz9k14",
            "score": 1,
            "text": "There must not be many.",
            "title_similarity": "-0.07983182",
            "sentiment_compound": 0.0
        },
        {
            "id": "hcz9k3f",
            "score": 1,
            "text": "And that totally makes it worth all the death, suffering, and tragedies incurred. Not to mention the desecration of land.",
            "title_similarity": "0.27539116",
            "sentiment_compound": -0.8288
        },
        {
            "id": "hcz9uu9",
            "score": 1,
            "text": "The town is Whiteclay, and all of the liquor stores lost their licenses in 2017.",
            "title_similarity": "0.4996783",
            "sentiment_compound": -0.3182
        },
        {
            "id": "hcza0no",
            "score": 3,
            "text": "Hello fellow Seminoles…",
            "title_similarity": "0.2732771",
            "sentiment_compound": 0.0
        },
        {
            "id": "hcza0vc",
            "score": 2,
            "text": "Are they adopting 40 year old guys?",
            "title_similarity": "0.41152456",
            "sentiment_compound": 0.0
        },
        {
            "id": "hczaa09",
            "score": 1,
            "text": "There’s a [case making it’s way to the Supreme Court that may eventually end this](https://www.wbur.org/onpoint/2021/09/14/custody-case-investigates-native-american-rebecca-nagle-this-land).\n\nMoneyed lawyers, the revolving door between the Texas ag’s office and a big firm, oil, gambling and bible thumping right wing extremists are, of course, behind this shit show. I’m sure these folks think the 7th cav are the heroes of the “battle” of Wounded Knee, too.",
            "title_similarity": "0.5217652",
            "sentiment_compound": 0.6059
        },
        {
            "id": "hczab5a",
            "score": 4,
            "text": "Imagine that. Rich families stay rich.",
            "title_similarity": "0.42412764",
            "sentiment_compound": 0.802
        },
        {
            "id": "hczahop",
            "score": 1,
            "text": "Time to get a DNA test. I know there’s Indian blood in my veins.",
            "title_similarity": "0.39917713",
            "sentiment_compound": 0.0
        },
        {
            "id": "hczaimv",
            "score": 6,
            "text": "Didn't This American Life run a show where they investigated Indian tribes who are pretty cutthroat in removing members from their tribe? Like if you are any bit mixed blood or haven't lived on the reservation for a while, then you get kicked out.",
            "title_similarity": "0.4429022",
            "sentiment_compound": 0.6908
        },
        {
            "id": "hczajam",
            "score": 2,
            "text": "sweet, lets call it even",
            "title_similarity": "0.0038171224",
            "sentiment_compound": 0.4588
        },
        {
            "id": "hczas2m",
            "score": 1,
            "text": "That's dope af",
            "title_similarity": "-0.0052334517",
            "sentiment_compound": 0.0
        },
        {
            "id": "hczay0h",
            "score": 1,
            "text": "My history teacher told me about this so intresting.",
            "title_similarity": "0.22505093",
            "sentiment_compound": 0.0
        },
        {
            "id": "hczbc4v",
            "score": 1,
            "text": "What the actual fuck",
            "title_similarity": "-0.03179705",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hczbfyx",
            "score": 1,
            "text": "I hope they are honoring Fred Dakota this week.",
            "title_similarity": "0.3075869",
            "sentiment_compound": 0.7351
        },
        {
            "id": "hczbyfn",
            "score": 2,
            "text": "So THAT'S what happened to The Hard Rock Cafe...",
            "title_similarity": "0.22138256",
            "sentiment_compound": -0.1027
        },
        {
            "id": "hczbzh2",
            "score": 3,
            "text": "The Tohono O'odom (I'm probably butchering the spelling) tribe in Arizona also has casino rights but doesn't seem to divide the wealth very well. \n\nThe father of a highschool friend of mine was a member of the tribe and my friend would visit the rez for a few weeks each summer.... Verrrrry squalid. Like everything bad you hear about reservations appeared true from the photos hed share. But those casinos might not do nearly as well...? They seemed pretty nice.",
            "title_similarity": "0.5897186",
            "sentiment_compound": 0.9857
        },
        {
            "id": "hczc26n",
            "score": 1,
            "text": "Oh hey, I have some experience with this. \n\nFirst off, I'm a mortgage underwriter. I reviewed a loan for a Native American a few months ago, and was shocked at their income docs. The guy started receiving 160k/year that was set to pay out for 20 years if I remember correctly. It was a passive income based on the earnings from the tribes casino. I'd never seen anything like it before, but frankly I was very happy to approve that loan. Good for them.",
            "title_similarity": "0.6873748",
            "sentiment_compound": 0.8532
        },
        {
            "id": "hczc4iy",
            "score": 1,
            "text": "Good for them! I just wish there was less substance abuse.",
            "title_similarity": "0.024442254",
            "sentiment_compound": 0.243
        },
        {
            "id": "hczchpl",
            "score": 1,
            "text": "This is actually really cool",
            "title_similarity": "0.023587791",
            "sentiment_compound": 0.3804
        },
        {
            "id": "hczd35l",
            "score": 2,
            "text": "ITS HARD ROCK NICK",
            "title_similarity": "0.085546546",
            "sentiment_compound": -0.1027
        },
        {
            "id": "hczd9k7",
            "score": 1,
            "text": "Lots of firewater money",
            "title_similarity": "0.31805837",
            "sentiment_compound": 0.0
        },
        {
            "id": "hczdbb7",
            "score": 1,
            "text": "How?",
            "title_similarity": "-0.11509818",
            "sentiment_compound": 0.0
        },
        {
            "id": "hczde9r",
            "score": 2,
            "text": "hey it's me your seminole indian",
            "title_similarity": "0.36878765",
            "sentiment_compound": 0.0
        },
        {
            "id": "hczdgjx",
            "score": 1,
            "text": "Can the grammar police help to clean up that headline?",
            "title_similarity": "0.15761897",
            "sentiment_compound": 0.6597
        },
        {
            "id": "hczdgtq",
            "score": 1,
            "text": "Imo they deserve that much and far more for the abhorrent treatment their culture has endured over the centuries. All natives deserve that",
            "title_similarity": "0.32543215",
            "sentiment_compound": -0.6557
        },
        {
            "id": "hczdkq9",
            "score": 1,
            "text": "All four of them.",
            "title_similarity": "0.08419791",
            "sentiment_compound": 0.0
        },
        {
            "id": "hczdm05",
            "score": 1,
            "text": "Good for them! They deserve it!",
            "title_similarity": "0.093144104",
            "sentiment_compound": 0.5399
        },
        {
            "id": "hczdqqx",
            "score": 1,
            "text": "Yea that’s not the case for native Americans in Oklahoma 😂",
            "title_similarity": "0.20460026",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hczdqx5",
            "score": 5,
            "text": "Living in Palm Springs, CA (and some of the surrounding cities) we have a few Native American tribes. The largest is the Aqua Caliente Band. Most of the cities of Palm Springs and cathedral City are built right on top of their reservation. They collect huge sums of money through land leasing from businesses, resorts, and Residential homes. They get a large sum when they turn 18, and them monthly payments from the casinos. I know a few members and quality of life varies. Some members are responsible and use the payments to live good lives, and still work full time jobs. Others… not so much. Some waste to it all and live really poorly.",
            "title_similarity": "0.75246894",
            "sentiment_compound": 0.6412
        },
        {
            "id": "hczdsmv",
            "score": 1,
            "text": "Good. Turnabout is fair.",
            "title_similarity": "0.119986676",
            "sentiment_compound": 0.6369
        },
        {
            "id": "hczdyzs",
            "score": 7,
            "text": "There’s a lot of corruption and nepotism with tribal government.",
            "title_similarity": "0.29581118",
            "sentiment_compound": 0.0
        },
        {
            "id": "hczec94",
            "score": 3,
            "text": "Hey…uh…I think my checks got lost in the mail. Who do I call about that?",
            "title_similarity": "0.14779235",
            "sentiment_compound": -0.3182
        },
        {
            "id": "hczejoj",
            "score": 2,
            "text": "What I don't understand is, if there is so much prosperity, wouldn't they be having a lot of kids? \n\nThen with the increase in population of the tribe, wouldn't the payments get diluted in the next generation?",
            "title_similarity": "0.4832855",
            "sentiment_compound": 0.3939
        },
        {
            "id": "hczeu5i",
            "score": 2,
            "text": "Damn.  That Seminole wind blowin' some money.",
            "title_similarity": "0.45608968",
            "sentiment_compound": -0.4019
        },
        {
            "id": "hczex0l",
            "score": 2,
            "text": "I believe most tribes do not get per cap. But they receive college tuition/scholarships, free home repairs including free appliances like AC units, refrigerators, stoves. Free medical at a no so modern indigenous hospitals. On reservations there’s still a lot of substance abuse, suicides and tribal youth being gangbangers and forgetting they’re Native Americans.",
            "title_similarity": "0.46383554",
            "sentiment_compound": 0.8402
        },
        {
            "id": "hczf8r6",
            "score": 1,
            "text": "Nice to see some native Americans doing well!",
            "title_similarity": "0.2879744",
            "sentiment_compound": 0.636
        },
        {
            "id": "hczfmsf",
            "score": 1,
            "text": "That is called a progamer move.",
            "title_similarity": "0.16183661",
            "sentiment_compound": 0.0
        },
        {
            "id": "hczfu7x",
            "score": 1,
            "text": "Any way an Ojibway can get in on this? 👀",
            "title_similarity": "0.1515273",
            "sentiment_compound": 0.0
        },
        {
            "id": "hczgbfp",
            "score": 1,
            "text": "Having just read Blood Meridian, this makes me feel real good",
            "title_similarity": "0.24930772",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hczgeuz",
            "score": 5,
            "text": "I too identify as a Seminole Indian",
            "title_similarity": "0.3441055",
            "sentiment_compound": 0.0
        },
        {
            "id": "hczgm4e",
            "score": 2,
            "text": "Wow. As someone who’s grandma was Seminole, I’m really upset she never registered my dad",
            "title_similarity": "0.42996067",
            "sentiment_compound": 0.228
        },
        {
            "id": "hczgohf",
            "score": 1,
            "text": "They should bying land up.....",
            "title_similarity": "0.13455167",
            "sentiment_compound": 0.0
        },
        {
            "id": "hczgte6",
            "score": 1,
            "text": "Doesn't count all the basically white Seminoles here in Oklahoma",
            "title_similarity": "0.39895695",
            "sentiment_compound": 0.0
        },
        {
            "id": "hczgxi5",
            "score": 2,
            "text": "*googles how to become Seminole.* disappointment…",
            "title_similarity": "0.23498443",
            "sentiment_compound": 0.0
        },
        {
            "id": "hczh2dw",
            "score": 1,
            "text": "Finally getting reparations.",
            "title_similarity": "0.11662221",
            "sentiment_compound": 0.0
        },
        {
            "id": "hczh91j",
            "score": 1,
            "text": "They deserve this and so much more",
            "title_similarity": "0.11475492",
            "sentiment_compound": 0.0
        },
        {
            "id": "hczhcm2",
            "score": 6,
            "text": "casinos ruin lives : i wish they didnt exist but they do",
            "title_similarity": "0.3041186",
            "sentiment_compound": -0.1406
        },
        {
            "id": "hczhu81",
            "score": 1,
            "text": "Good. What about the other tribes?",
            "title_similarity": "0.107238345",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hczhw4p",
            "score": 2,
            "text": "It's crazy how native Americans are both the poorest 1 percent and the incredibly wealthy based on the war department of the U.S. to grant them the right to build private businesses on their land or not.",
            "title_similarity": "0.5988437",
            "sentiment_compound": -0.6712
        },
        {
            "id": "hczhylv",
            "score": 1,
            "text": "Also one of the only tribes who endorses a college using their name as a mascot.",
            "title_similarity": "0.35524866",
            "sentiment_compound": 0.34
        },
        {
            "id": "hczhzfj",
            "score": 1,
            "text": "I'm in Australia and i've never understood the link between native americans and casinos, are they the only ones permitted to own them in certain areas or something?",
            "title_similarity": "0.5148266",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hczhzga",
            "score": 1,
            "text": "Good",
            "title_similarity": "-0.04749878",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hczi13r",
            "score": 1,
            "text": "You will never see the so called five civilized tribes on a list like this because they got shilled the minute they signed a treaty with the white man so that he could take everything from them. That’s why they are “civilized “",
            "title_similarity": "0.4510334",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hczi53x",
            "score": 1,
            "text": "Makes you think about an ancestry test to see if the great grand parent tales of Indian family were true.",
            "title_similarity": "0.48629767",
            "sentiment_compound": 0.872
        },
        {
            "id": "hczif9l",
            "score": 1,
            "text": "Damn they really made work of that 20 dollars",
            "title_similarity": "0.48957896",
            "sentiment_compound": -0.4019
        },
        {
            "id": "hczilqo",
            "score": 2,
            "text": "The greatest business model ever invented by man, your customers walk into your business, throw all kinds of money at you, and then walk away blaming themselves... seriously... is there not a better business model?....\n\nAlso - Trump is the only idiot known to have lost money in owning a casino. Imagine that (sorry a bit of info there).",
            "title_similarity": "0.6450566",
            "sentiment_compound": -0.7909
        },
        {
            "id": "hczimah",
            "score": 1,
            "text": "You have to be 1/4 Seminole to be considered part of the Seminole Nation.  There's only about ~~2,000~~ 4,000 of those left in Florida. (Previous source of 2,000 was incorrect)\n\nI wonder how much of that profit the Nation uses for itself (not giving to the people).  I know the Choctaw Nation in my state spends a shit ton on investments and it doesn't trickle down to the people much.",
            "title_similarity": "0.5576257",
            "sentiment_compound": -0.409
        },
        {
            "id": "hcziper",
            "score": 1,
            "text": "Heck yeah!",
            "title_similarity": "-0.019698713",
            "sentiment_compound": 0.3595
        },
        {
            "id": "hcziq7k",
            "score": 1,
            "text": "I wonder how this is sustainable? Is the tribe itself incredibly small?",
            "title_similarity": "0.105663374",
            "sentiment_compound": 0.0
        },
        {
            "id": "hcziqhq",
            "score": 1,
            "text": "Good for them, they deserve it.",
            "title_similarity": "0.051913247",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hcziwmc",
            "score": 1,
            "text": "Seminole tribe, not Seminole nation . It's kind of fun watching them spend all that $$ every month. GOOD FOR THEM.",
            "title_similarity": "0.62276006",
            "sentiment_compound": 0.7677
        },
        {
            "id": "hczj6ab",
            "score": 2,
            "text": "Good.",
            "title_similarity": "-0.05223153",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hczjbfi",
            "score": 6,
            "text": "I work in a potawatomi-owned casino. What I love about Native-owned casinos is that they do what governments SHOULD do with the revenue from the casinos (I've talked with people from other casinos and found this to be true among other tribes). When they start making money, before expanding, they take care of the needs of their people on the reserve first and foremost (building medical centers, schools, community centers, grocery stores, homes for their elders, homes for their people, etc), and once they are certain their people are well provided for, THEN they invest more in the casino, expanding the business. That's how government SHOULD work.",
            "title_similarity": "0.61302054",
            "sentiment_compound": 0.9246
        },
        {
            "id": "hczk8k8",
            "score": 1,
            "text": "I wonder what this type of financial security does to youth attitudes in terms of setting a life goal, working towards achieving it, hard work and such other important values anyone should grow up with.",
            "title_similarity": "0.31326604",
            "sentiment_compound": 0.6705
        },
        {
            "id": "hczknmx",
            "score": 1,
            "text": "I read about a tribe in the Great Lakes region that harvests wild rice for sale, and that tribal members can sell up to 6 fish a day to the local tribal fishery for $12/each!",
            "title_similarity": "0.6190965",
            "sentiment_compound": 0.6588
        },
        {
            "id": "hczkuuf",
            "score": 1,
            "text": "Utes did that for a while but stopped.  Turns out giving a 21 yo a million dollars is not a very good idea if you expect him to have any of it by the time he's 22.",
            "title_similarity": "0.42613783",
            "sentiment_compound": -0.3988
        },
        {
            "id": "hczkxtr",
            "score": 2,
            "text": "I’m finding the comments interesting around how contentious it gets if someone is of mixed heritage (in terms of what distribution they get, if any).\n\nHere in New Zealand if you have any indigenous ancestry you can still be considered Māori where you can vote in the indigenous electorate, affiliate with your tribe etc etc. although I guess every country is different and with millions of dollars on the line I can see how that would change things.",
            "title_similarity": "0.45833609",
            "sentiment_compound": 0.128
        },
        {
            "id": "hczl4te",
            "score": 2,
            "text": "Now that’s what I call some serious reparations!",
            "title_similarity": "0.11872194",
            "sentiment_compound": -0.1511
        },
        {
            "id": "hczlms2",
            "score": 1,
            "text": "Damn it! Wish my tribe wasn't poor....",
            "title_similarity": "0.14073178",
            "sentiment_compound": 0.4303
        },
        {
            "id": "hczm2zd",
            "score": 1,
            "text": "Good for them.",
            "title_similarity": "-0.0233883",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hcznpv9",
            "score": 1,
            "text": "Same as the San Manuel Indian Resvervation.  They have the San Manuel casino in a perfect location too. All of the tribes families live in mansions in the hills.",
            "title_similarity": "0.62550026",
            "sentiment_compound": 0.5719
        },
        {
            "id": "hczo451",
            "score": 1,
            "text": "Thank god they live in the land of opportunity",
            "title_similarity": "0.19595382",
            "sentiment_compound": 0.7506
        },
        {
            "id": "hczoedh",
            "score": 1,
            "text": "My grandpa had to be a Seneca Indian. If only he were Seminole…",
            "title_similarity": "0.43590495",
            "sentiment_compound": 0.0
        },
        {
            "id": "hczok0o",
            "score": 1,
            "text": "Taking back the White Man's one dollar at a time.",
            "title_similarity": "0.4239447",
            "sentiment_compound": 0.0
        },
        {
            "id": "hczoofq",
            "score": 1,
            "text": "fun fact: the seminoles were the nazis of pre-colonial america.",
            "title_similarity": "0.45168865",
            "sentiment_compound": 0.5106
        },
        {
            "id": "hczoqw7",
            "score": 2,
            "text": "Is this what people mean when they say generational wealth",
            "title_similarity": "0.29479647",
            "sentiment_compound": 0.4939
        },
        {
            "id": "hczoraz",
            "score": 1,
            "text": "So to be a Seminole or not a millionaire?\n\nI wouldnt.  But then I'm already conceived.",
            "title_similarity": "0.5858141",
            "sentiment_compound": 0.0
        },
        {
            "id": "hczothd",
            "score": 1,
            "text": "Glad that at least now some ancestors of the Natives we screwed over are getting compensated.\nOf course, in the #1 spot there are only 480 people left on the tribe.\nPretty sure there was more than that in recent history....\n\nEdit: the #4 spot (Mashantucket Pequot with annual revenue of $539 million) has twice the members (around 800 [per the article](https://moneyinc.com/richest-native-american-tribes/) )",
            "title_similarity": "0.6960658",
            "sentiment_compound": 0.6486
        },
        {
            "id": "hczp7gt",
            "score": 1,
            "text": "\\*of Florida.  Oklahomans aren't.",
            "title_similarity": "0.17749652",
            "sentiment_compound": 0.0
        },
        {
            "id": "hczp8l2",
            "score": 1,
            "text": "Just imagine if we had this for each country, it be insane",
            "title_similarity": "0.19319901",
            "sentiment_compound": -0.4019
        },
        {
            "id": "hczp9y0",
            "score": 1,
            "text": "Is this an ironic payback? Wealth and the greed of the old countries deprived the original peoples for so long and now they get the payback! Could call it a break even for now I guess.",
            "title_similarity": "0.39787456",
            "sentiment_compound": -0.2714
        },
        {
            "id": "hczpwo2",
            "score": 2,
            "text": "This would be called...planning appropiately and using the funds right. \n\nSimple as that. \n\nI'll give you not everyone has the same demand as they do. But this is the entire idea of the casinos. \n\nLike most things its odd how it goes from \"for everyone\" to \"for me\"...",
            "title_similarity": "0.52955675",
            "sentiment_compound": -0.0889
        },
        {
            "id": "hczqf0t",
            "score": 1,
            "text": "We could do this :(",
            "title_similarity": "-0.00027849525",
            "sentiment_compound": -0.5228
        },
        {
            "id": "hczqfq0",
            "score": 2,
            "text": "All my life I've been waiting for someone to tell me I'm a millionaire, and I miss out on it by being someone else.",
            "title_similarity": "0.48118567",
            "sentiment_compound": -0.1531
        },
        {
            "id": "hczqw3d",
            "score": 1,
            "text": "This makes me happy.",
            "title_similarity": "0.04493746",
            "sentiment_compound": 0.5719
        },
        {
            "id": "hczqyk7",
            "score": 6,
            "text": "But within a tribe, how large is the dating pool? \n\nLike, if you want your kids to meet blood quantum, can you only date from a pool of ~500 men/women? Lol",
            "title_similarity": "0.6512756",
            "sentiment_compound": 0.8299
        },
        {
            "id": "hczr16u",
            "score": 1,
            "text": "We (the rest of the USA) could be like this too",
            "title_similarity": "0.25062",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hczr32r",
            "score": 1,
            "text": "I live in South Florida, right down the road from the Hard Rock Hollywood. They just built a giant hotel shaped like a guitar, in case anyone happens by it's amazing. Anyways, I didn't realize this, but the tribe owns the whole Hard Rock brand, not just individual casinos. There are multiple reservations down here and they have their own police and fire departments.",
            "title_similarity": "0.5666054",
            "sentiment_compound": -0.1901
        },
        {
            "id": "hczrbqx",
            "score": 1,
            "text": "How do I change my heritage to Seminole Indian?",
            "title_similarity": "0.3367537",
            "sentiment_compound": 0.0
        },
        {
            "id": "hczrc1p",
            "score": 1,
            "text": "Me: sends a fuck ton of dna to every company until they find some Seminole genes….",
            "title_similarity": "0.625368",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hczrf2e",
            "score": 1,
            "text": "https://www.nytimes.com/2006/12/08/business/08rock.html\n\nNot sure of Reddit rules so I hope this link is acceptable.",
            "title_similarity": "0.32448363",
            "sentiment_compound": 0.5448
        },
        {
            "id": "hczrw2g",
            "score": 1,
            "text": "I'm actually really happy for them. That's amazingly cool.",
            "title_similarity": "0.12229597",
            "sentiment_compound": 0.764
        },
        {
            "id": "hczs5s4",
            "score": 5,
            "text": "...unless you get kicked out of your tribe by the ones in control so they can keep the payments from getting too diluted",
            "title_similarity": "0.30298895",
            "sentiment_compound": 0.0
        },
        {
            "id": "hczs79k",
            "score": 1,
            "text": "Why there are no reality shows about rich Seminole people???",
            "title_similarity": "0.4269984",
            "sentiment_compound": 0.4479
        },
        {
            "id": "hczt7aq",
            "score": 2,
            "text": ">The Seminole Tribe of Florida may be guarded about sharing tribal information with outsiders, but they were smart enough to hire a non-native chief executive for their gambling operations.\n\nExcuse me, da fuq?",
            "title_similarity": "0.52550024",
            "sentiment_compound": 0.7096
        },
        {
            "id": "hczthur",
            "score": 4,
            "text": "I worked for a hotel and casino that was owned by the Seminole tribe. They decided that they were paying department too much and made a change that basically cut my pay in half. They did this while also increasing my workload to the point that more than half my department quit within a month of these changes. They also moved a bunch of the managers around to different locations and gave them bonuses with the money they saved not paying us. Good to know that they had the money to pay us property the entire time, they just didn't feel like it. I guess I made the right choice when I left the company.",
            "title_similarity": "0.612954",
            "sentiment_compound": -0.0041
        },
        {
            "id": "hcztxh5",
            "score": 5,
            "text": "\"Wamapoke Casino, slowly taking back our money from white people one quarter at a time.\" -Ken Hotate",
            "title_similarity": "0.5385554",
            "sentiment_compound": 0.0
        },
        {
            "id": "hcztxvk",
            "score": 2,
            "text": "They don't pay normal taxes btw.",
            "title_similarity": "0.14052199",
            "sentiment_compound": 0.0762
        },
        {
            "id": "hczu1m6",
            "score": 1,
            "text": "My tribe sucks. I'll get fifty dollars for Xmas when I'm old enough to be an elder.",
            "title_similarity": "0.57744193",
            "sentiment_compound": -0.3612
        },
        {
            "id": "hczufzp",
            "score": 1,
            "text": "Seems fair to me. Unironically.",
            "title_similarity": "0.033147503",
            "sentiment_compound": 0.3182
        },
        {
            "id": "hczur52",
            "score": 1,
            "text": "Anyone know about the narragansett tribe?",
            "title_similarity": "0.26028866",
            "sentiment_compound": 0.0
        },
        {
            "id": "hczurdc",
            "score": 1,
            "text": "“I’m a junk bond king….”",
            "title_similarity": "0.24276218",
            "sentiment_compound": 0.0
        },
        {
            "id": "hczuvkv",
            "score": 2,
            "text": "Me apart of the Seminole Nation in Oklahoma: sad sounds",
            "title_similarity": "0.27785826",
            "sentiment_compound": -0.4767
        },
        {
            "id": "hczuwgj",
            "score": 1,
            "text": "How? Lol",
            "title_similarity": "-0.057499304",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hczw2c2",
            "score": 1,
            "text": "Now, we know why so many people claim Native American ancestry. “Oh, I’m .00021 Cherokee.”",
            "title_similarity": "0.54836917",
            "sentiment_compound": 0.0
        },
        {
            "id": "hczw2f1",
            "score": 3,
            "text": "If there was something to learn from this, it's \"do not gamble with the false impression that you will win.\"  These people get money each year from people that think they can beat the house.",
            "title_similarity": "0.53756464",
            "sentiment_compound": 0.6908
        },
        {
            "id": "hczwnr3",
            "score": 1,
            "text": "I feel like it doesn't really work out that way",
            "title_similarity": "-0.16085944",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hczxd9m",
            "score": 1,
            "text": "If I'm not mistaken, they are also the only tribe to never \"surrender\" or sign a peace treaty with the US government.",
            "title_similarity": "0.37658483",
            "sentiment_compound": 0.6818
        },
        {
            "id": "hczxi54",
            "score": 1,
            "text": "The money has been a double edge sword for the tribe. It’s resulted in rampant drug and alcohol abuse.",
            "title_similarity": "0.47951493",
            "sentiment_compound": -0.6369
        },
        {
            "id": "hczxjil",
            "score": 2,
            "text": "Theres about 27,000 seminole indians presently, so that 128k payout per year would mean the casinos are turning a 3.5 billion dollar profit each year.    And paying it all out to the tribe.\n\nEither the math doesnt line up... or running a casino is wayyyyyyyyyyyyyy more profitable that I would understand.",
            "title_similarity": "0.76227695",
            "sentiment_compound": 0.7264
        },
        {
            "id": "hczxvja",
            "score": 1,
            "text": "Talk about being given only lemons and making a fortune on lemonade. Good on them!",
            "title_similarity": "0.35818377",
            "sentiment_compound": 0.4926
        },
        {
            "id": "hczxwlr",
            "score": 2,
            "text": "From the article:\n\n>The Seminole Tribe of Florida may be guarded about sharing tribal   \ninformation with outsiders, but they were smart enough to hire a   \nnon-native chief executive for their gambling operations.\n\nYou, uh, might want to rephrase that.",
            "title_similarity": "0.4945253",
            "sentiment_compound": 0.7096
        },
        {
            "id": "hczy7cg",
            "score": 1,
            "text": "I still remember before  Seminole Hardrock Tampa, when it was just some trailers and a bingo hall.  No wait, also the drive through trailer for tax free smokes.",
            "title_similarity": "0.57282615",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hczyaq5",
            "score": 8,
            "text": "Must gotta be 100% full blood Seminole...one of my friends is 3/4 seminole (father parents were full blood, father married a white woman)...dude is broke as shit and always has been.\n\n(edit ~ his mom is half seminole but as white as I am)",
            "title_similarity": "0.67432564",
            "sentiment_compound": -0.2846
        },
        {
            "id": "hczz7nr",
            "score": 1,
            "text": "Who is Casino and why does his probability distribution results in indigenous kids getting so rich?",
            "title_similarity": "0.6707444",
            "sentiment_compound": 0.6825
        },
        {
            "id": "hczzrgv",
            "score": 2,
            "text": "Creating inter-generational wealth the right way.",
            "title_similarity": "0.28701618",
            "sentiment_compound": 0.6597
        },
        {
            "id": "hczzrs7",
            "score": 1,
            "text": "Highly recommend reading Killers of the Flower Moon to everyone interested in this topic",
            "title_similarity": "0.35417485",
            "sentiment_compound": -0.0183
        },
        {
            "id": "hd00h11",
            "score": 7,
            "text": "Too bad for Oklahoma Seminoles, only ones I know are quite poor",
            "title_similarity": "0.3037983",
            "sentiment_compound": -0.7841
        },
        {
            "id": "hd00iwk",
            "score": 1,
            "text": "Friend was dating a girl off the reservation. She made 50k a month.",
            "title_similarity": "0.5700712",
            "sentiment_compound": 0.4939
        },
        {
            "id": "hd012sv",
            "score": 1,
            "text": "https://www.kosu.org/u-s-news/2021-09-02/new-season-of-this-land-podcast-explores-efforts-to-dismantle-the-indian-child-welfare-act",
            "title_similarity": "0.36074448",
            "sentiment_compound": 0.0
        },
        {
            "id": "hd019mt",
            "score": 1,
            "text": "Hello, Ancestry.com? Yeah, I need a big favor!",
            "title_similarity": "0.18640924",
            "sentiment_compound": 0.636
        },
        {
            "id": "hd01a3i",
            "score": 7,
            "text": ">every **Florida** Seminole Indian child born is a multi millionaire when they turn 18 years old.\n\nA very important qualifier missing from the post title. Could a mod add it via tag?",
            "title_similarity": "0.86206484",
            "sentiment_compound": -0.0953
        },
        {
            "id": "hd01mmd",
            "score": 1,
            "text": "Meanwhile, in reality most of them get that money, go on a giant spending spree, and then end up broke until the next payment hits.  Alcoholism is rampant.\n\nI’ve lived in Northwest lower Michigan near two casinos almost my entire life, and before you call me a racist, that’s 100% what happens.",
            "title_similarity": "0.7035781",
            "sentiment_compound": -0.8402
        },
        {
            "id": "hd023rj",
            "score": 1,
            "text": "I identify as Seminole. Where’s my check!?",
            "title_similarity": "0.33629194",
            "sentiment_compound": 0.0
        },
        {
            "id": "hd02oje",
            "score": 1,
            "text": "Didn't they buy Hard Rock?",
            "title_similarity": "0.19472161",
            "sentiment_compound": 0.0762
        },
        {
            "id": "hd02s3t",
            "score": 2,
            "text": "It just so happens I identify as a Seminole Indian child.",
            "title_similarity": "0.4116043",
            "sentiment_compound": 0.0
        },
        {
            "id": "hd02ssz",
            "score": 1,
            "text": "That's insane!",
            "title_similarity": "-0.06335312",
            "sentiment_compound": -0.4574
        },
        {
            "id": "hd033fk",
            "score": 1,
            "text": "OTH, such sums might be handy to help some Seminoles to start projects such as college studies or business creation.\n\nOTOH, 18 isn't the most mature age, and some could spend it recklessly. Maybe, until 25, recipients should have to justify to the trust managers why they want to spend their money, to avoid such issues.",
            "title_similarity": "0.4687255",
            "sentiment_compound": 0.5649
        },
        {
            "id": "hd034mj",
            "score": 1,
            "text": "Is this where that stereotype about “free college for Native Americans” comes from?",
            "title_similarity": "0.35449833",
            "sentiment_compound": -0.3182
        },
        {
            "id": "hd03oo8",
            "score": 3,
            "text": "This fantastic. I wish all my Native brethren were doing so well.",
            "title_similarity": "0.299662",
            "sentiment_compound": 0.8419
        },
        {
            "id": "hd03wnv",
            "score": 3,
            "text": "With regular cash payments like this, who is actually working in the casinos?",
            "title_similarity": "0.5746662",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hd04agc",
            "score": 1,
            "text": "Ironic, isn’t it?",
            "title_similarity": "-0.060468994",
            "sentiment_compound": -0.128
        },
        {
            "id": "hd04k8u",
            "score": 1,
            "text": "Puff…. Privilege",
            "title_similarity": "0.04906554",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hd04v6m",
            "score": 9,
            "text": "My dad works for a tribe-owned casino. \n\nThere’s around 250 members. After the age of 18yo, each person gets a monthly $30k stipend for the rest of their life. \n\nJust wild.",
            "title_similarity": "0.735555",
            "sentiment_compound": 0.0
        },
        {
            "id": "hd04zvc",
            "score": 1,
            "text": "sigma af",
            "title_similarity": "0.08204256",
            "sentiment_compound": 0.0
        },
        {
            "id": "hd067es",
            "score": 1,
            "text": "Back in 99 in central valley of california. A clasmate of ours was an native american and their tribe opened a casino a few years back. Anyways he turned 18 during high-school. Was paid basically a 6 salary figure for doing nothing, could make at min 60k more by working part time (i think it was like 1 week a month).  Anyways dude had a hummer ( the real one not an H2) couple mercedes, bikes, a house.",
            "title_similarity": "0.70892966",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hd06rqt",
            "score": 2,
            "text": "This is only true for the Florida Seminoles not the Oklahoma Seminole",
            "title_similarity": "0.22561757",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hd06skc",
            "score": 1,
            "text": "Damn, maybe my family history of Seminole princesses is real",
            "title_similarity": "0.46267855",
            "sentiment_compound": -0.4019
        },
        {
            "id": "hd07jux",
            "score": 1,
            "text": "Man, that wealth redistribution must really suck!  I'm sure glad the Casino profits in my state didn't make me a millionaire when I turned 18!  /s",
            "title_similarity": "0.54160273",
            "sentiment_compound": 0.8424
        },
        {
            "id": "hd07nu0",
            "score": 1,
            "text": "Fuck yeah",
            "title_similarity": "-0.022289805",
            "sentiment_compound": -0.3182
        },
        {
            "id": "hd07pb4",
            "score": 1,
            "text": "Secretly wishes I was born into that tribe 🙃",
            "title_similarity": "0.2802354",
            "sentiment_compound": 0.1531
        },
        {
            "id": "hd07q6x",
            "score": 2,
            "text": "I had friends who worked there, and it was nothing but horror stories. Apparently the Seminole have a real chip on their shoulder because they didn't surrender like other tribes, and how they treat their staff there is awful. They're even like this with other native tribes in Florida. I want to reiterate though that this is coming from others who have worked there and not myself.",
            "title_similarity": "0.3568537",
            "sentiment_compound": 0.7672
        },
        {
            "id": "hd07wdp",
            "score": 1,
            "text": "Where can I apply to become a member of this tribe",
            "title_similarity": "0.218714",
            "sentiment_compound": 0.0
        },
        {
            "id": "hd08cnu",
            "score": 5,
            "text": "Yea I don’t know why the hell people waste their money gambling.    Like I can have fun playing poker with friends and losing 40 bucks to my buddies that’s fine but just giving your money to the casino doesn’t make sense.\n\n\nActually isn’t funny that the government said that gambling is bad and should be illegal then turns around and makes a ton of money off of the lottery.",
            "title_similarity": "0.5187748",
            "sentiment_compound": -0.5346
        },
        {
            "id": "hd08ipx",
            "score": 1,
            "text": "Wow, I went to school with a kid, not gonna say his first name, but his last was Osceola. He was a direct descendant of the great Chief Osceola. Happy to hear he’s a millionaire now.",
            "title_similarity": "0.6582118",
            "sentiment_compound": 0.9337
        },
        {
            "id": "hd08m7d",
            "score": 1,
            "text": "YES. this is what we want!",
            "title_similarity": "0.07840451",
            "sentiment_compound": 0.6155
        },
        {
            "id": "hd08q3t",
            "score": 1,
            "text": "Talkin bout Seminole privilege",
            "title_similarity": "0.31210828",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hd08q75",
            "score": 2,
            "text": "Me who has very little Seminole: See you.later, peasants!",
            "title_similarity": "0.27285984",
            "sentiment_compound": 0.0
        },
        {
            "id": "hd08ux5",
            "score": 2,
            "text": "Man fuck them kids",
            "title_similarity": "0.08597225",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hd09bhd",
            "score": 1,
            "text": "Based 🙏",
            "title_similarity": "-0.008336613",
            "sentiment_compound": 0.0
        },
        {
            "id": "hd09ge0",
            "score": 1,
            "text": "And rightfully so.",
            "title_similarity": "0.017484386",
            "sentiment_compound": 0.0
        },
        {
            "id": "hd09q44",
            "score": 2,
            "text": "They won a game you didn't know was available",
            "title_similarity": "0.34248585",
            "sentiment_compound": 0.5719
        },
        {
            "id": "hd09qbm",
            "score": 2,
            "text": "Note to self.  Get reborn as a Seminole Indian in my next life.",
            "title_similarity": "0.4424607",
            "sentiment_compound": 0.0
        },
        {
            "id": "hd09u4s",
            "score": 8,
            "text": "It sucks being Indigenous to North America but born on the ‘wrong’ side of the border….",
            "title_similarity": "0.24483672",
            "sentiment_compound": -0.1901
        },
        {
            "id": "hd0a3ez",
            "score": 1,
            "text": "Eyy good to see we didn’t leave natives completely fucked up 👍",
            "title_similarity": "0.088281915",
            "sentiment_compound": -0.4576
        },
        {
            "id": "hd0agh5",
            "score": 2,
            "text": "Their kids are born when they turn 18 years old? Those poor moms!",
            "title_similarity": "0.4899453",
            "sentiment_compound": -0.5255
        },
        {
            "id": "hd0ahj6",
            "score": 1,
            "text": "Time to invest in 23andMe",
            "title_similarity": "0.2519972",
            "sentiment_compound": 0.0
        },
        {
            "id": "hd0at3h",
            "score": 2,
            "text": "TIFU I was not born a full blooded Florida Seminole.",
            "title_similarity": "0.31594658",
            "sentiment_compound": 0.0
        },
        {
            "id": "hd0be7i",
            "score": 1,
            "text": "What if the child is only half Seminole?",
            "title_similarity": "0.32737052",
            "sentiment_compound": 0.0
        },
        {
            "id": "hd0becl",
            "score": 1,
            "text": "Whatever tribe mystic lake pays out too has to be equally as rich. It’s white something but they’re loaded in Minnesota and get 30-60k a month or something like that",
            "title_similarity": "0.6393092",
            "sentiment_compound": 0.6757
        },
        {
            "id": "hd0bv81",
            "score": 1,
            "text": "This is amazing! Also belongs in r/UpliftingNews",
            "title_similarity": "0.18680632",
            "sentiment_compound": 0.6239
        },
        {
            "id": "hd0bx48",
            "score": 1,
            "text": "Wish i was born a seminole",
            "title_similarity": "0.3589333",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hd0bzqg",
            "score": 1,
            "text": "It’s 2021 and I think I will identify as a Seminole Indian now.",
            "title_similarity": "0.5103694",
            "sentiment_compound": 0.0
        },
        {
            "id": "hd0c4r5",
            "score": 1,
            "text": "Good, should be more uniform across indigenous communities",
            "title_similarity": "0.15334892",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hd0cf3b",
            "score": 1,
            "text": "The shakopee Sioux in Minnesota get around 84000.00 per MONTH.  the richest Indian tribe in America. https://moneyinc.com/richest-native-american-tribes/",
            "title_similarity": "0.6780338",
            "sentiment_compound": 0.5267
        },
        {
            "id": "hd0cp36",
            "score": 1,
            "text": "So are they born a multimillionaire or do they become one at 18.",
            "title_similarity": "0.61926115",
            "sentiment_compound": 0.0
        },
        {
            "id": "hd0cr9o",
            "score": 4,
            "text": "i went to jail with a guy that got 11k from his tribe every month since he was born and he said life is terrible. everyone be has ever known and loved is dead or addicted to drugs. life is meaningless when you are handed everything.",
            "title_similarity": "0.55791473",
            "sentiment_compound": -0.7506
        },
        {
            "id": "hd0cw2z",
            "score": 2,
            "text": "So where is my Muscogee-Creek cash? Maybe our casinos suck",
            "title_similarity": "0.39980137",
            "sentiment_compound": -0.4404
        },
        {
            "id": "hd0d8qm",
            "score": 1,
            "text": "The Seminole Tribe never conceded to the US Government- just saying- I live here in crazy FL!",
            "title_similarity": "0.40995407",
            "sentiment_compound": -0.4003
        },
        {
            "id": "hd0dqwy",
            "score": 1,
            "text": "How’s that for community, am I right? Taking care of their own. We don’t seem to do that much anymore.",
            "title_similarity": "0.063979864",
            "sentiment_compound": 0.4939
        },
        {
            "id": "hd0etns",
            "score": 1,
            "text": "Native poverty is lowkey a major issue facing the US that few people think about. Even with the benefits, you’re lucky if you ever leave the tribe.",
            "title_similarity": "0.31628117",
            "sentiment_compound": 0.2263
        },
        {
            "id": "hd0falw",
            "score": 1,
            "text": "I just took a dna test, turns out I’m 4% Seminole.  I’m 40, soooo with interest I should be expecting a rather large check in the mail",
            "title_similarity": "0.5200697",
            "sentiment_compound": 0.4588
        },
        {
            "id": "hd0fvrk",
            "score": 1,
            "text": "Better be worried we’re all buying our land back. Not me though. I’m a poor Sioux, lol",
            "title_similarity": "0.2993206",
            "sentiment_compound": 0.1027
        },
        {
            "id": "hd0g4qx",
            "score": 5,
            "text": "I’ve got a mutual friend on Steam who is very generous. She’s legit on steam all day every day and everyone kept saying she was loaded because she was Native American (the way she paid to win and gifted games even to me leave no doubts we’re talking handing out knives in csgo back in the day). I now understand why lol",
            "title_similarity": "0.64114815",
            "sentiment_compound": 0.9335
        },
        {
            "id": "hd0glyc",
            "score": 3,
            "text": "holy crap though. Does this ruin a bunch of kids? I couldn't imagine getting a shit ton of money at 18. I'd just be eying and buying everything!",
            "title_similarity": "0.49260482",
            "sentiment_compound": -0.8999
        },
        {
            "id": "hd0hv86",
            "score": 5,
            "text": "Yea one of my friends was Seminole. When they were of age, went completely out of control. They were buying ridiculous things like $1500 tables for their college apartment. Completely went through the roof on every drug you could think of. Started to break the law and bragged about it all. You ever meet someone that you knew was going to die and there's nothing you could do to stop it? Well they died and the whole ordeal was very sad.",
            "title_similarity": "0.5914942",
            "sentiment_compound": -0.8357
        },
        {
            "id": "hd0hzx3",
            "score": 1,
            "text": "Wow, did the birth rate increase significantly?",
            "title_similarity": "0.39802566",
            "sentiment_compound": 0.7269
        },
        {
            "id": "hd0i5n6",
            "score": 1,
            "text": "It would suck if you were 17 and 11 months and the casino suddenly went bust and you never got your money!!",
            "title_similarity": "0.46755219",
            "sentiment_compound": -0.5399
        },
        {
            "id": "hd0i9ew",
            "score": 1,
            "text": "Good!!",
            "title_similarity": "-0.008803649",
            "sentiment_compound": 0.5399
        },
        {
            "id": "hd0jdr4",
            "score": 2,
            "text": "That's awesome, but how do they get born at age 18?",
            "title_similarity": "0.4828813",
            "sentiment_compound": 0.3716
        },
        {
            "id": "hd0jvp7",
            "score": 1,
            "text": "A quarter at a time!  Good for them’",
            "title_similarity": "0.22345012",
            "sentiment_compound": 0.4926
        },
        {
            "id": "hd0kgja",
            "score": 2,
            "text": "Ah yes, \"the wealthiest Native American tribe in the world\". Far wealthier than all those Native American tribes outside America.",
            "title_similarity": "0.6829728",
            "sentiment_compound": 0.8442
        },
        {
            "id": "hd0kjm9",
            "score": 1,
            "text": "This makes me happy. Their future generations are set. And have the financial power to make change. ❤️",
            "title_similarity": "0.3581707",
            "sentiment_compound": 0.5719
        },
        {
            "id": "hd0kk04",
            "score": 1,
            "text": "Neat!",
            "title_similarity": "-0.02030712",
            "sentiment_compound": 0.5093
        },
        {
            "id": "hd0kni6",
            "score": 1,
            "text": "Least we could do.",
            "title_similarity": "-0.045847163",
            "sentiment_compound": 0.0
        },
        {
            "id": "hd0lb43",
            "score": 1,
            "text": "I work for DCF and there is a Seminole tribe in my district. All of them have standard homes and crazy expensive cars. Child welfare has to have a higher standard of proof to remove one of their children or to mandate services. They have their own advocate that needs to be present during any interaction with a tribe member according to the Indian Child Welfare Act ICWA.",
            "title_similarity": "0.5784813",
            "sentiment_compound": -0.34
        },
        {
            "id": "hd0lx33",
            "score": 1,
            "text": "I live in Florida near a Seminole reservation. I remember getting invited to their Thanksgiving party, yea they have a party on Thanksgiving don't ask me why, and seeing the kids had an entire skatepark built across three front yards and said their parents had it made. The damn 5hing had a full empty swimming pool in it among other things. Seminole are flush with cash.",
            "title_similarity": "0.6642674",
            "sentiment_compound": 0.2263
        },
        {
            "id": "hd0m0d8",
            "score": 4,
            "text": "Is this just for 100% full-blooded Seminole Indians at 18?",
            "title_similarity": "0.70189",
            "sentiment_compound": 0.0
        },
        {
            "id": "hd0m3x1",
            "score": 1,
            "text": "Good.",
            "title_similarity": "-0.05223153",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hd0mdr7",
            "score": 1,
            "text": "Bull fuckin shit.. one of my best friends is a Seminole  and hes broke as shit!",
            "title_similarity": "0.483071",
            "sentiment_compound": -0.5081
        },
        {
            "id": "hd0mfka",
            "score": 1,
            "text": "This makes sense because I have a customer that is Native American, and nobody truly knows “where” his money comes from. But the speculation and rumor was always something to do with his parents owning a casino and him getting some sort of monthly allowance.",
            "title_similarity": "0.7118317",
            "sentiment_compound": 0.2382
        },
        {
            "id": "hd0ms5m",
            "score": 1,
            "text": "How can I get to be that?",
            "title_similarity": "-0.02697048",
            "sentiment_compound": 0.0
        },
        {
            "id": "hd0mswu",
            "score": 6,
            "text": "I’m more impressed that they’re born at 18 years old.",
            "title_similarity": "0.4863804",
            "sentiment_compound": 0.5256
        },
        {
            "id": "hd0nv1j",
            "score": 1,
            "text": "Unbelievable. Thanks for sharing",
            "title_similarity": "0.052777372",
            "sentiment_compound": 0.7579
        },
        {
            "id": "hd0og8h",
            "score": 2,
            "text": "How many of them are there though?",
            "title_similarity": "0.10499483",
            "sentiment_compound": 0.0
        },
        {
            "id": "hd0oqmk",
            "score": 1,
            "text": "What would Silvio think of this",
            "title_similarity": "0.033287305",
            "sentiment_compound": 0.0
        },
        {
            "id": "hd0q16y",
            "score": 12,
            "text": "This is only technically true and is essentially untrue. This framing is also used by racists to paint Native Americans as lazy or having easy, cushy lives. You only get much money if you're 100% Florida Seminole, if you satisfy very specific and ever narrowing criteria. There are lots of people who are for all intents and purposes Seminole, but don't get money (or very much anyway) because they're not 100%. This is so people with money get even more money and control everything, just like the rest of America. Plus you can't escape some of the huge problems that come with being Native, like specific institutions not accepting tribal birth certificates, racism, abusive families, extreme poverty and terrible water quality, and substance abuse.",
            "title_similarity": "0.5385534",
            "sentiment_compound": -0.9808
        },
        {
            "id": "hd0q1r9",
            "score": 2,
            "text": "Good. I love this country but the native Americans were fucked badly. A legitimate genocide that just isn’t spoken about",
            "title_similarity": "0.28138953",
            "sentiment_compound": -0.8271
        },
        {
            "id": "hd0q9rj",
            "score": 6,
            "text": "The dark side of these things is that tribe members often get pushed out purely out of greed.  What’s better than splitting money 100 ways? Splitting it 10 ways. While the intent was good at some point, it often leaves a lot of people in already disadvantaged communities behind.",
            "title_similarity": "0.39507407",
            "sentiment_compound": 0.0352
        },
        {
            "id": "hd0q9rp",
            "score": 1,
            "text": "Weren’t the Seminole never conquered (is that the right word)?",
            "title_similarity": "0.3473161",
            "sentiment_compound": 0.0
        },
        {
            "id": "hd0qhlx",
            "score": 1,
            "text": "How.",
            "title_similarity": "-0.09261097",
            "sentiment_compound": 0.0
        },
        {
            "id": "hd0rd4w",
            "score": 3,
            "text": "Over here in Australia they cut out the middle man and just took our land\n\nNo need to give us money if we don't own anything",
            "title_similarity": "0.45795208",
            "sentiment_compound": -0.5106
        },
        {
            "id": "hd0rj76",
            "score": 3,
            "text": "Thats gangster",
            "title_similarity": "0.24442849",
            "sentiment_compound": 0.0
        },
        {
            "id": "hd0rjzc",
            "score": 1,
            "text": "Every Native American tribe needs a Casino.",
            "title_similarity": "0.6413783",
            "sentiment_compound": 0.0
        },
        {
            "id": "hd0ru2v",
            "score": 3,
            "text": "awesome!!!",
            "title_similarity": "0.12078865",
            "sentiment_compound": 0.7163
        },
        {
            "id": "hd0s14o",
            "score": 4,
            "text": "Ok. I'm ignorant and confused. I've read lots of stories about how there's such a huge drug and alcohol problem. Along with widespread poverty amongst the Native American/Indian (still unsure what they prefer to be called. Have heard cases of both) tribes. Is this just one of those \"some are doing better than others,\" type of thing?",
            "title_similarity": "0.42426813",
            "sentiment_compound": -0.7351
        },
        {
            "id": "hd0s7kr",
            "score": 1,
            "text": "My great gran was Seminole, she migrated to the Caribbean or something. My Father’s family history is very murky so only have a few pics of her. Crazy to think if she didn’t move how different her life would of been.",
            "title_similarity": "0.51122737",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hd0sdmt",
            "score": 3,
            "text": "This is so weird considering the extreme poverty so many natives currently face.",
            "title_similarity": "0.19369528",
            "sentiment_compound": -0.7035
        },
        {
            "id": "hd0sppm",
            "score": 1,
            "text": "I love how most of this post is talking about people from the tribe or tribal politics and not one person thinks to maybe ask a tribal member. Most of the top posts on here are wrong or partial truths.",
            "title_similarity": "0.39439312",
            "sentiment_compound": 0.7152
        },
        {
            "id": "hd0su7h",
            "score": 2,
            "text": "And what about the other Native tribes folks.",
            "title_similarity": "0.2155469",
            "sentiment_compound": 0.0
        },
        {
            "id": "hd0swmz",
            "score": 2,
            "text": "Wow!",
            "title_similarity": "-0.018338494",
            "sentiment_compound": 0.6239
        },
        {
            "id": "hd0td0x",
            "score": 4,
            "text": "Can't wait for the \"Crazy Rich Indians\" movie.",
            "title_similarity": "0.5535876",
            "sentiment_compound": 0.296
        },
        {
            "id": "hd0texz",
            "score": 1,
            "text": "I can’t remember the tribe name, but whatever Tribe run mystic lake / the casino in Shakopee MN is basically the same thing. 18 yr old kids driving around a middle class area in lambos / Ferrari’s / bentleys etc.",
            "title_similarity": "0.628165",
            "sentiment_compound": 0.0
        },
        {
            "id": "hd0uune",
            "score": 2,
            "text": "But why? I’m uneducated",
            "title_similarity": "-0.06765724",
            "sentiment_compound": 0.0
        },
        {
            "id": "hd0vnfo",
            "score": 1,
            "text": "What do they get from FSU? I know that they have a unique relationship with the tribe, so that they won't be labeled a \"mascot\".",
            "title_similarity": "0.2023381",
            "sentiment_compound": 0.0
        },
        {
            "id": "hd0xy0l",
            "score": 1,
            "text": "Casino distributions and that fat check the tribe gets from Florida State University every year to keep using the Seminole name and likeness.",
            "title_similarity": "0.7060763",
            "sentiment_compound": 0.0
        },
        {
            "id": "hd0y926",
            "score": 6,
            "text": "That's amazing that they can be born at 18!",
            "title_similarity": "0.47371787",
            "sentiment_compound": 0.6239
        },
        {
            "id": "hd0zcr9",
            "score": 1,
            "text": "Can confirm. I’m a family law attorney in Florida and recently had a case where my client was divorcing her husband who is a Seminole Indian. His net monthly payments from the tribe are $10k, plus free health care, school for the kids, etc. Additionally, the children receive at least $1500 per month in “dividends” so child support isn’t really a thing when there’s a divorce since the children already have so much of their own money. I do know that, as of a couple years ago, though, they stopped providing dividends for the kids from birth and only started paying them when they got older.",
            "title_similarity": "0.6490814",
            "sentiment_compound": 0.8214
        },
        {
            "id": "hd0zvl6",
            "score": 1,
            "text": "That's awesome, but what about all the other native American tribes. Both federally recognized or not.",
            "title_similarity": "0.46915218",
            "sentiment_compound": 0.3716
        },
        {
            "id": "hd10ppg",
            "score": 2,
            "text": "Bullshit. I'm an Oklahoma Seminole and I sure as hell don't get anything from the tribe.",
            "title_similarity": "0.3200658",
            "sentiment_compound": -0.7964
        },
        {
            "id": "hd123px",
            "score": 1,
            "text": "What’s the history behind casinos and tribe. Sorry to Ask a newb question",
            "title_similarity": "0.4428855",
            "sentiment_compound": -0.0772
        },
        {
            "id": "hd12w7k",
            "score": 1,
            "text": "I should know this as a lawyer but why is it casinos are so great on reservations?",
            "title_similarity": "0.47822583",
            "sentiment_compound": 0.8542
        },
        {
            "id": "hd13gm5",
            "score": 2,
            "text": "Close to the same thing with the creek Indians in my area the are hella rich from casino money",
            "title_similarity": "0.73077714",
            "sentiment_compound": 0.5984
        },
        {
            "id": "hd13og7",
            "score": 2,
            "text": "What??!  This is an outrage!  Can't the government keep to its historical track record and find a way to screw these people out of their earnings?\n\n/s",
            "title_similarity": "0.29837823",
            "sentiment_compound": -0.7026
        },
        {
            "id": "hd13qfw",
            "score": 1,
            "text": "The universal healthcare thing isn't related to casinos. It is a legal obligation of the federal government to provide it.",
            "title_similarity": "0.19215928",
            "sentiment_compound": 0.128
        },
        {
            "id": "hd14led",
            "score": 2,
            "text": "I live right next to the “Mdewakanton” reservation and they are also millionaires as soon as they turn 18. And after some get about 20k every other week for life. Most start businesses or end up doing drugs. In high school it was the party location and LOTS of fights happened on the Rez. I remember a town car driver brought us all McDonald’s one night and that’s when I knew they really lived different.",
            "title_similarity": "0.7444659",
            "sentiment_compound": 0.0
        },
        {
            "id": "hd152l2",
            "score": 1,
            "text": "hey its me ur Seminole brother",
            "title_similarity": "0.41427335",
            "sentiment_compound": 0.0
        },
        {
            "id": "hd15gb2",
            "score": 1,
            "text": "I’m curious to know whom that actually applies to nowadays, do you have to maintain residency on the reservation? What percentage do you actually have to be and if 100%, I wonder how many 100% Seminole American Indians will be born in the next year? I bet the statistics are saddening unfortunately but would hope it is all in favor and completely controlled within the tribe and to their discretion.",
            "title_similarity": "0.61616087",
            "sentiment_compound": 0.7657
        },
        {
            "id": "hd16ngq",
            "score": 1,
            "text": "Damn that’s kind of cray",
            "title_similarity": "0.02534107",
            "sentiment_compound": -0.4019
        },
        {
            "id": "hd176vi",
            "score": 2,
            "text": "Probably not the greatest thing to give a kid when they turn 18",
            "title_similarity": "0.3216255",
            "sentiment_compound": -0.5216
        },
        {
            "id": "hd179kp",
            "score": 1,
            "text": "When they're born, when they turn 18.",
            "title_similarity": "0.41722474",
            "sentiment_compound": 0.0
        },
        {
            "id": "hd17gt8",
            "score": 2,
            "text": "Fucking good.",
            "title_similarity": "0.009653235",
            "sentiment_compound": 0.4927
        },
        {
            "id": "hd187cd",
            "score": 2,
            "text": "I'm not too sure about in terms of individual distributions, but the 3 affiliated tribes (Mandan Hidatsa and Arikara) that are located on the Fort Berthold Reservation in ND are situated on top of a literal ocean of oil with constant production for decades now. They must be doing pretty well...\n\nI'm really surprised that more tribes don't set up something like a sovereign wealth fund. Something like a Norwegian model and use extensive cash flow to aggressively diverse and invest.",
            "title_similarity": "0.61212677",
            "sentiment_compound": 0.9602
        },
        {
            "id": "hd187m1",
            "score": 1,
            "text": "Wasn't that red hot chili peppers guitar player from one of those tribes ?",
            "title_similarity": "0.2829875",
            "sentiment_compound": 0.0
        },
        {
            "id": "hd18u77",
            "score": 2,
            "text": "I’m ok with this, very cool",
            "title_similarity": "0.0010275375",
            "sentiment_compound": 0.5849
        },
        {
            "id": "hd195i8",
            "score": 1,
            "text": "I guess that'a small price to pay compared to genocide and colonization (sarcasm) but if that helps ppl sleep at night........",
            "title_similarity": "0.18966793",
            "sentiment_compound": 0.4118
        },
        {
            "id": "hd19lp7",
            "score": 3,
            "text": "Good. Let's do the same for every Native American.",
            "title_similarity": "0.4064263",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hd1akcz",
            "score": 1,
            "text": "I just sent a sample to 23andme today. Fingers crossed that I'm Seminole...",
            "title_similarity": "0.50130594",
            "sentiment_compound": 0.0
        },
        {
            "id": "hd1au15",
            "score": 2,
            "text": "So what if we take an ancestry test and it shows were Seminole? We’re owed money? Or would a DNA test not show specific tribal lineage?",
            "title_similarity": "0.45611438",
            "sentiment_compound": 0.0
        },
        {
            "id": "hd1b6cp",
            "score": 1,
            "text": "Hi Seminole indian child it's me your long lost father!",
            "title_similarity": "0.48611653",
            "sentiment_compound": -0.3802
        },
        {
            "id": "hd1bjsk",
            "score": 1,
            "text": "Dana Hanson couldn’t write her way out of a wet paper bag. That writing is hideous. I guess Cracker Jack has started including PhDs as prizes. I wouldn’t believe a word she wrote.",
            "title_similarity": "0.41360164",
            "sentiment_compound": 0.4588
        },
        {
            "id": "hd1bngt",
            "score": 1,
            "text": "It's all the casinos they have in the North end of Florida... It better be big.  The school kids need new books.",
            "title_similarity": "0.63083166",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hd1bpwq",
            "score": 1,
            "text": "Cherokee casino is the most depressing casino I’ve ever been to.",
            "title_similarity": "0.4349863",
            "sentiment_compound": -0.4391
        },
        {
            "id": "hd1c87y",
            "score": 2,
            "text": "Yea just super important to remember these are the exceptions for Indian nations and not typical for Indian country as a whole.",
            "title_similarity": "0.20625976",
            "sentiment_compound": 0.6908
        },
        {
            "id": "hd1c9ic",
            "score": 1,
            "text": "If there are any Seminole women who want a husband to rub your feet, cook you dinner, and cuddle, send me a message!!",
            "title_similarity": "0.40017754",
            "sentiment_compound": 0.2225
        },
        {
            "id": "hd1cxr1",
            "score": 1,
            "text": "Hi. Yes. I am Indian. Where is the bank line again?",
            "title_similarity": "0.32476792",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hd1ded5",
            "score": 2,
            "text": "Good every indigenous person deserves to live care free FOREVER",
            "title_similarity": "0.3463994",
            "sentiment_compound": 0.8555
        },
        {
            "id": "hd1dftp",
            "score": 1,
            "text": "Man I was born in the wrong native tribe",
            "title_similarity": "0.31929109",
            "sentiment_compound": -0.4767
        },
        {
            "id": "hd1dyaw",
            "score": 2,
            "text": "I grew up one block from a small but popular gaming casino and reservation so I went to school with a lot of the Native American kids & my friend was getting like 50k a month in disbursements our senior year. She bought her boyfriend a Hmmwv and I always thought that was wild.",
            "title_similarity": "0.6519036",
            "sentiment_compound": 0.8834
        },
        {
            "id": "hd1e8bl",
            "score": 1,
            "text": "These seminal truths of the seminoles",
            "title_similarity": "0.33573216",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hd1e8mw",
            "score": 1,
            "text": "Some Native Americans have found nice financial success. This is a very small minority of of all people we have completely removed there opportunity to live the life of their heritage.",
            "title_similarity": "0.48674446",
            "sentiment_compound": 0.8612
        },
        {
            "id": "hd1euad",
            "score": 5,
            "text": "Came here to also say- there’s 560+ federally recognized tribes and this is only one of them. These are Nations with distinct histories, languages, etc. just because one tribe has this doesn’t mean others do. \n\nThink of Europe. Hard to make sweeping statements about Europeans. There’s French, British, Italian, etc. all distinct down to the foods. Guess what? Native tribes are like that too- and there’s over 560 of them… \n\nContext- my tribe is poor af",
            "title_similarity": "0.41385096",
            "sentiment_compound": -0.25
        },
        {
            "id": "hd1f3zb",
            "score": 1,
            "text": "How are they this rich and other native american nations are so poor? Even with casinos on their land?",
            "title_similarity": "0.5385818",
            "sentiment_compound": 0.1578
        },
        {
            "id": "hd1hoe5",
            "score": 1,
            "text": "I guess that's why Silvio got so mad at them lol",
            "title_similarity": "0.17724271",
            "sentiment_compound": -0.3218
        },
        {
            "id": "hd1hsqj",
            "score": 3,
            "text": "This is bullshit! They do get some money when the turn 18 but they are NOT multi millionaires! They amount depends solely in the size of the tribe! AND YES NATIVES DO PAY TAXES",
            "title_similarity": "0.54990804",
            "sentiment_compound": 0.3455
        },
        {
            "id": "hd1iofe",
            "score": 1,
            "text": "Pin1",
            "title_similarity": "0.0084232725",
            "sentiment_compound": 0.0
        },
        {
            "id": "hd1kfk6",
            "score": 1,
            "text": "Good for them!",
            "title_similarity": "0.014912241",
            "sentiment_compound": 0.4926
        },
        {
            "id": "hd1kgqk",
            "score": 1,
            "text": "Laughs in San Manuel Indian.",
            "title_similarity": "0.24439402",
            "sentiment_compound": 0.4939
        },
        {
            "id": "hd1leio",
            "score": 2,
            "text": "So why aren’t members of the Seminole nation of Oklahoma not getting a piece of the pie, if anything we should be compensated more because we were forced to move during the trail of tears???",
            "title_similarity": "0.4360472",
            "sentiment_compound": -0.6641
        },
        {
            "id": "hd1m9f6",
            "score": 1,
            "text": "Least they can do",
            "title_similarity": "-0.033969164",
            "sentiment_compound": 0.0
        },
        {
            "id": "hd1muzn",
            "score": 1,
            "text": "are any of them single?",
            "title_similarity": "0.14815992",
            "sentiment_compound": 0.0
        },
        {
            "id": "hd1n6n2",
            "score": 1,
            "text": "I wish I had a 3rd of that, but my tribe is not so lucky. If I had that kind of money, I would pursue my dreams in technology a la elon musk.",
            "title_similarity": "0.308422",
            "sentiment_compound": 0.127
        },
        {
            "id": "hd1ngmv",
            "score": 1,
            "text": "I watched a documentary about this along time ago. One of the stories had this kid talk about how all his friends used him and some other kids overdosed. Pretty nuts and it wasn’t all peaches and cream as it sounded",
            "title_similarity": "0.4550398",
            "sentiment_compound": 0.6124
        },
        {
            "id": "hd1nxk0",
            "score": 1,
            "text": "I live in Oklahoma but for some reason only recently started visiting our casinos here. Always a blast, great service and atmosphere, I regret ignoring them all these years",
            "title_similarity": "0.62121934",
            "sentiment_compound": -0.1531
        },
        {
            "id": "hd1o177",
            "score": 2,
            "text": "$128k/yr invested into a basic index fund averaging an 8% annual return would equal $5.3M after 18 years.",
            "title_similarity": "0.64304376",
            "sentiment_compound": 0.0
        },
        {
            "id": "hd1o43w",
            "score": 3,
            "text": "I mean there ancestors \"generously donated\" their land for everyone to live on..... Sooo there is that.",
            "title_similarity": "0.4305118",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hd1oyqy",
            "score": 1,
            "text": "They deserve it, they are the most people in America who got the rug pulled out from them & were treated the worst.",
            "title_similarity": "0.40852273",
            "sentiment_compound": -0.6249
        },
        {
            "id": "hd1rf4y",
            "score": 1,
            "text": "I wonder what the numbers are here in Southern California. Morongo, San Manuel, Saboba, and Pechanga to name a few.",
            "title_similarity": "0.25796118",
            "sentiment_compound": 0.0
        },
        {
            "id": "hd1tbc9",
            "score": 3,
            "text": "If that’s the case, I’ve seen a lot of homeless millionaires",
            "title_similarity": "0.51825583",
            "sentiment_compound": 0.0
        },
        {
            "id": "hd1vr6m",
            "score": 2,
            "text": "GOOD",
            "title_similarity": "-0.04749878",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hd1yez8",
            "score": 2,
            "text": "Insane numbers. Good for them though.",
            "title_similarity": "0.05277969",
            "sentiment_compound": 0.0516
        },
        {
            "id": "hd1zcr9",
            "score": 2,
            "text": "Wow. Can you put Seminole in  your Tinder profile?",
            "title_similarity": "0.3430854",
            "sentiment_compound": 0.5859
        },
        {
            "id": "hd2093p",
            "score": 1,
            "text": "I’m sure that’s working out well for",
            "title_similarity": "0.055741437",
            "sentiment_compound": 0.5267
        },
        {
            "id": "hd216by",
            "score": 1,
            "text": "Can I have one",
            "title_similarity": "-0.048909605",
            "sentiment_compound": 0.0
        },
        {
            "id": "hd21xl1",
            "score": 2,
            "text": "The reservation I grew up on, they are given a monthly payment of 1600$ and a bigger check at 18 depending on when they’re parents started saving so it can vary from 90k-210k plus currently. The younger generation is getting a bigger check each year due to the tribe giving out more money for there trust fund.",
            "title_similarity": "0.66800475",
            "sentiment_compound": 0.6908
        },
        {
            "id": "hd24wjm",
            "score": 1,
            "text": "Can’t wait for people claiming to identify as a Seminole Native American /s",
            "title_similarity": "0.43528166",
            "sentiment_compound": 0.0
        },
        {
            "id": "hd25gre",
            "score": 1,
            "text": "Good. Too bad the Maori tribes here in NZ don't take that approach. Maori tribal elites sit on millions of dollars of settlement money and dish it out to their own people, while ordinary members go without.",
            "title_similarity": "0.5510268",
            "sentiment_compound": -0.1531
        },
        {
            "id": "hd2c3oj",
            "score": 1,
            "text": "Good.",
            "title_similarity": "-0.05223153",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hd2fbo0",
            "score": 1,
            "text": "Oh those Native Americans stay paid. Even here in Tucson, if your full Yaqui than your getting a check. My sons are only 25% so they missed the 401k plan. Hahah",
            "title_similarity": "0.5733017",
            "sentiment_compound": -0.3566
        },
        {
            "id": "hd2gp0d",
            "score": 1,
            "text": "But how about the Tongva?\n\nOh right the Federal government won't even recognize us.",
            "title_similarity": "0.21883556",
            "sentiment_compound": 0.0
        },
        {
            "id": "hd2gxuj",
            "score": 2,
            "text": "Would be very surprised how many first Nations group could do something similar, but don't. There's a lot of greed that comes with money, it's a wonder that the senior members originally decided that everyone should get it, and nobody else is allowed to touch it except the person getting it. Very smart.\n\n \"Of course, the more members there are, the less your share. It has caused tribal disbandment as some seek to have larger payments by kicking out fellow tribe members.\"\n\nHowever, it would be more accurate to describe them as a family, everyone's essentially getting an inheritance - not to mention the obvious sexual abuse and incestuous ramifications that come with the rules required to have your child remain eligible.",
            "title_similarity": "0.50130725",
            "sentiment_compound": -0.5238
        },
        {
            "id": "hd2jm5y",
            "score": 1,
            "text": "That is awesome...",
            "title_similarity": "0.030598022",
            "sentiment_compound": 0.6249
        },
        {
            "id": "hd2kn6m",
            "score": 2,
            "text": "Having watched this happen with kids in the Mohegan tribe of Connecticut, 18 is too young. It would be financially smart to assign a fiduciary to assist these young adults wrap their head around the fortune.",
            "title_similarity": "0.60179603",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hd2lswb",
            "score": 1,
            "text": "How!",
            "title_similarity": "-0.07465636",
            "sentiment_compound": 0.0
        },
        {
            "id": "hd2o3ey",
            "score": 2,
            "text": "How do I become a Seminole? Seriously my great grandmother was full blood",
            "title_similarity": "0.6014622",
            "sentiment_compound": 0.5267
        },
        {
            "id": "hd2olkr",
            "score": 1,
            "text": "Do they have to be full Seminole?",
            "title_similarity": "0.39428627",
            "sentiment_compound": 0.0
        },
        {
            "id": "hd3cutk",
            "score": 4,
            "text": "I don’t understand as I thought reservations are underserved and have poor quality of life.  Do the Seminole reservations have a better standard of living than others?  I apologize in advance if what I’m asking is offensive, my impressions are based on what I’ve read in the media.",
            "title_similarity": "0.33249903",
            "sentiment_compound": -0.2263
        },
        {
            "id": "hd3lp0e",
            "score": 1,
            "text": "How do you trace your heritage?  I’m supposed to be 1/4 Cherokee, but there are no family records of any kind.  My grandfather looked like a Native American oil painting, while I am definitely Dutch/Irish looking.  Not interested in any tribal money, just want to know where my family roots are.",
            "title_similarity": "0.44124192",
            "sentiment_compound": 0.7999
        },
        {
            "id": "hd3n2od",
            "score": 1,
            "text": "Wealthy tribes also sue people to get them off the tribal rolls. Fun fact.",
            "title_similarity": "0.48078367",
            "sentiment_compound": 0.7003
        },
        {
            "id": "hd41yfv",
            "score": 1,
            "text": "Dammit.. my Seminole tribe is out of OK.",
            "title_similarity": "0.30574545",
            "sentiment_compound": 0.0
        },
        {
            "id": "hd4z87h",
            "score": 1,
            "text": "There's a lot of different groups of people that can claim this",
            "title_similarity": "0.16973972",
            "sentiment_compound": 0.0
        },
        {
            "id": "hd5gbw3",
            "score": 3,
            "text": "\"every Seminole Indian child born is a multi millionaire when they turn 18 years old.\"\n\nAnd they often make it as far as their 24th birthday before they die of alcohol poisoning.",
            "title_similarity": "0.8583503",
            "sentiment_compound": -0.8271
        },
        {
            "id": "hd5j0t3",
            "score": 1,
            "text": "So why did the white people who came to Florida get away with it better?",
            "title_similarity": "0.43382147",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hd5obwz",
            "score": 1,
            "text": "And to think that their ancestors had reservations about this plan.",
            "title_similarity": "0.07689701",
            "sentiment_compound": 0.0
        },
        {
            "id": "hddewfb",
            "score": 1,
            "text": "I'm so happy to be WRONG !!!",
            "title_similarity": "0.12617934",
            "sentiment_compound": 0.2584
        },
        {
            "id": "hdk7gxo",
            "score": 1,
            "text": "u/reddit-download",
            "title_similarity": "0.14524624",
            "sentiment_compound": 0.0
        },
        {
            "id": "hdmi63s",
            "score": 1,
            "text": "Why were the Indians awarded this ability   with the casinos? \n Why is something that's so heavily reguarded as an addiction so widely advertised for people to continue to keep coming?",
            "title_similarity": "0.6108659",
            "sentiment_compound": 0.6893
        },
        {
            "id": "hdttpre",
            "score": 2,
            "text": "That's amazing that they can be born at 18!",
            "title_similarity": "0.47371787",
            "sentiment_compound": 0.6239
        },
        {
            "id": "hdz6v2y",
            "score": 1,
            "text": "The title of the article is \"The Richest Native American Tribes in the World\" I would like to know what the richest Native American Tribe in Africa is.",
            "title_similarity": "0.6416056",
            "sentiment_compound": 0.8519
        },
        {
            "id": "hf44rqp",
            "score": 1,
            "text": "So they have all the normal treaty rights and extremely limited methods of getting membership.",
            "title_similarity": "0.29164565",
            "sentiment_compound": -0.2944
        },
        {
            "id": "hfk10gc",
            "score": 2,
            "text": "Good for them 🙌🏻 🙏🏻",
            "title_similarity": "0.05849249",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hftm8bz",
            "score": 1,
            "text": "Bruh I've got a Seminole homie three feet away from me, missed that memo wtf",
            "title_similarity": "0.36068237",
            "sentiment_compound": -0.7184
        },
        {
            "id": "hg1m3y0",
            "score": 1,
            "text": "Someone should do a post about the Osage Indian Tribe. They were the richest group in America in the 1920’s until white people started murdering them for their oil wealth",
            "title_similarity": "0.68238705",
            "sentiment_compound": 0.3182
        },
        {
            "id": "hg4p2c7",
            "score": 1,
            "text": "Casino's are the biggest scam ever to be recorded...and while I respect the fact that getting a little money back from the warmongers who took their land in the first place is a really good reason to do it. This kind of money is dirty beyond all comprehension. It carries with it the pain and misery of like 90% of the people who walk into that door...and so I say to you...That money is cursed and anyone who uses it will never know peace.",
            "title_similarity": "0.5209017",
            "sentiment_compound": -0.9092
        }
    ]
}