{
    "TIL Mexico was the only country to protest the annexation of Austria by Nazi Germany. To honor that support, there is a square in Vienna named \"Mexikoplatz\".\n": [
        {
            "id": "he4x91p",
            "score": 0,
            "text": "So if México was opppsed to German expansion from the beginning then why did German send them the Zimmerman note?",
            "title_similarity": "0.7150871",
            "sentiment_compound": 0.0
        },
        {
            "id": "he503lc",
            "score": -1,
            "text": "Hell yeah proud to be brown",
            "title_similarity": "0.13282266",
            "sentiment_compound": -0.0772
        },
        {
            "id": "he4jz2y",
            "score": 14,
            "text": "Sorry but that’s stupid. \n\nNot even Austria opposed the annexation!  They threw a parade!",
            "title_similarity": "0.5936512",
            "sentiment_compound": -0.7457
        },
        {
            "id": "he46ivv",
            "score": -11,
            "text": "Makes sense. Mexico did have an Austrian emperor, so there's some loyalty there.\n\n[https://en.wikipedia.org/wiki/Maximilian\\_I\\_of\\_Mexico#Emperor\\_of\\_Mexico](https://en.wikipedia.org/wiki/Maximilian_I_of_Mexico#Emperor_of_Mexico)\n\nEdit: This is a joke.",
            "title_similarity": "0.72260386",
            "sentiment_compound": 0.7152
        },
        {
            "id": "he4i93d",
            "score": 9,
            "text": "Good old Austria, joining the bad side then pretending they were the victims\n\nSee also; Scotland",
            "title_similarity": "0.55732703",
            "sentiment_compound": -0.3612
        },
        {
            "id": "he4jiy1",
            "score": 7,
            "text": "Why would Mexico protest it when  the majority of Austrian themselves preferred the reunification?",
            "title_similarity": "0.72372746",
            "sentiment_compound": -0.25
        },
        {
            "id": "he56re5",
            "score": 0,
            "text": "We all know hitlers response was something along the lines of\n\nDo they have a strong navy?\n\nNo, hitler\n\nThen why would I give a fuck",
            "title_similarity": "0.5912781",
            "sentiment_compound": -0.0516
        },
        {
            "id": "he4iuzs",
            "score": -13,
            "text": "\"Urrrrrr only Merica fights for freedumb urrrrrrr\".... \\*\\*\\*\\* off historically illiterate hogs.",
            "title_similarity": "0.52934676",
            "sentiment_compound": -0.4019
        },
        {
            "id": "he51tb1",
            "score": -2,
            "text": "The same Mexico that Hitler supposedly sent a letter to to persuade them to join the Axis and attack the US?",
            "title_similarity": "0.6313219",
            "sentiment_compound": -0.2263
        },
        {
            "id": "he4iio1",
            "score": -3,
            "text": "If i was Austria I definitely would have protested the annexation of Austria...  \n\n\nDidn't they just let the army parade-march in with their jackboots shining, though?",
            "title_similarity": "0.7192718",
            "sentiment_compound": 0.296
        },
        {
            "id": "he4mxrl",
            "score": 4,
            "text": "Til the word \"only\" changed.",
            "title_similarity": "0.18887645",
            "sentiment_compound": 0.0
        },
        {
            "id": "he5uspb",
            "score": 3,
            "text": "Mexico also  tried to stop racists from founding a slave state. We now call it Texas.",
            "title_similarity": "0.5774476",
            "sentiment_compound": -0.6908
        },
        {
            "id": "he4usph",
            "score": 1,
            "text": "Aside from the whole narco terrorism, which was basically US led from the get go.... Mexico has been a pretty dope country.",
            "title_similarity": "0.6158036",
            "sentiment_compound": -0.34
        },
        {
            "id": "he5mug4",
            "score": 1,
            "text": "It sounds like something that happens when you throw Mexican food at the wall … “mexikoplatz!” Uh ….. hello ? .. hello? (Crickets)",
            "title_similarity": "0.5045171",
            "sentiment_compound": 0.4857
        },
        {
            "id": "he691kh",
            "score": 1,
            "text": "dont think Austria was really a victim.",
            "title_similarity": "0.47721103",
            "sentiment_compound": -0.3353
        },
        {
            "id": "he4208m",
            "score": 86,
            "text": "Having lived in Vienna, I wish I’d known this was there. It’s also crazy how Austria just kind of pretends ww2 didn’t happen.  Kristalnacht? Sure, it happened. Annexation? Sure, but we didn’t want it (questionable).  The rest of the war? ….what war?\n\nEdit:  clearly this is from my experience living in Austria and is not indicative of every single person living there. There was also a pretty clear generational split and the younger ones seemed to be more progressive. It’s an Internet forum, not a site for 100% statistically proven claims.  Calm down ya Jelly Donuts.",
            "title_similarity": "0.6791431",
            "sentiment_compound": 0.4962
        },
        {
            "id": "he4tpq6",
            "score": 4,
            "text": "Wow that's kinda crazy considering that not even Austria protested Anschluss",
            "title_similarity": "0.602903",
            "sentiment_compound": 0.4701
        },
        {
            "id": "he4j1zd",
            "score": 5,
            "text": "Isn't there a case to be made that they wanted to make sure to not set the precedent as well? Mexico wouldn't want the further annexation of Mexican states to the United States.",
            "title_similarity": "0.49376577",
            "sentiment_compound": 0.7165
        },
        {
            "id": "he4jhvu",
            "score": 2,
            "text": "Funny, Austria didn't seem too upset at the time 🤔🤔🤔",
            "title_similarity": "0.34401068",
            "sentiment_compound": 0.6229
        },
        {
            "id": "he4l03d",
            "score": 2,
            "text": "Uuuhhh the Austrians welcomed the Nazis and had wide support.",
            "title_similarity": "0.51157796",
            "sentiment_compound": 0.6249
        },
        {
            "id": "he4ihtx",
            "score": 5,
            "text": "Austria didn't even protest when the nazi's marched in and was annexed",
            "title_similarity": "0.6956735",
            "sentiment_compound": 0.1877
        },
        {
            "id": "he4ex43",
            "score": 3,
            "text": "I wouldn't call that an annexation, there was a widespread support for the union in the Austrian populace at the time.",
            "title_similarity": "0.5995166",
            "sentiment_compound": 0.4019
        },
        {
            "id": "he4la61",
            "score": 3,
            "text": "It is not correct that Mexica was the only country to protest the annexation of Austria. Having said that, here is Mexico's protest submitted to the League of Nations: https://biblio-archive.unog.ch/Dateien/CouncilMSD/C-101-M-53-1938-VII_EN.pdf",
            "title_similarity": "0.86562455",
            "sentiment_compound": -0.4588
        },
        {
            "id": "he4jn48",
            "score": 0,
            "text": ">Naturally, Germany's forced union with Austria drew world-wide attention and protest. Among the nations to object to Anschluss was the United States. Approaching the Anschluss, the United States had many domestic problems, which dictated what foreign policy the American government could pursue. The isolationists dominated not only the Middle West, but the entire nation and Congress as well. President Roosevelt could not endanger his secure political position over a controversial foreign policy. However, at the end of 1937, the President decided to challenge isolation, advocating a gradual acknowledgment of America's role as a world power.\n\n>Only six months after Roosevelt's Quarantine Speech, Germany annexed Austria. The overt German action caused great concern in Washington, and even though the American reaction is significant, historians have not adequately focused on this event. Most importantly, Anschluss aided the passage of Roosevelt's naval rearmament program. The President also established an international organization responsible for Austrian refugees in the aftermath of the Austro-German Union. Though Roosevelt did not desire an unnecessary rift between Germany and the United States, Secretary of the Interior Harold Ickes refused to sell helium to Germany, causing increased tension between Germany and the United States.",
            "title_similarity": "0.67698795",
            "sentiment_compound": 0.8431
        },
        {
            "id": "he4k6hu",
            "score": 0,
            "text": ">Prior to the Anschluss, there had been strong support from people of all backgrounds in both Austria and Germany for unification of the two countries. In the immediate aftermath of the dissolution of the Habsburg Monarchy—with Austria left as a broken remnant, deprived of most of the territories it ruled for centuries and undergoing a severe economic crisis—the idea of unity with Germany seemed attractive also to many citizens of the political Left and Center. Had the victors of World War I allowed it, Austria would have united with Germany as a freely taken democratic decision. But after 1933, when the Austrian-born Adolf Hitler rose to power in Germany, desire for unification could be identified with the Nazis, for whom it was an integral part of the Nazi \"Heim ins Reich\" concept, which sought to incorporate as many Volksdeutsche (ethnic Germans outside Germany) as possible into a \"Greater Germany\".\n\nSource: https://en.wikipedia.org/wiki/Anschluss",
            "title_similarity": "0.7152331",
            "sentiment_compound": 0.8047
        },
        {
            "id": "he4lgrj",
            "score": 0,
            "text": "Yet in 1919, Austria and Germany proposed to the league of nations to allow a unification of the two nations. They were denied, why because they believed it was easier to keep Germany fragmented... Hindsight 20/20 I guess",
            "title_similarity": "0.65905327",
            "sentiment_compound": 0.2023
        },
        {
            "id": "he4nvcb",
            "score": 0,
            "text": "Sure. The plaza was given that name in 1956, because Austria, in 38, were not that annoyed with the annexation",
            "title_similarity": "0.6030628",
            "sentiment_compound": 0.5399
        },
        {
            "id": "he4ub4a",
            "score": 0,
            "text": "Didn’t everyone kinda protest that in a way? I mean, define ‘protest’",
            "title_similarity": "0.3694162",
            "sentiment_compound": -0.1796
        },
        {
            "id": "he4xunj",
            "score": 4,
            "text": "Not even the Austrians complained when that happened...",
            "title_similarity": "0.4832474",
            "sentiment_compound": -0.4019
        },
        {
            "id": "he71bi9",
            "score": 0,
            "text": "You know that Italy protested as well, they are the reason annexation didn't happen earlier, idk where this misinformation came from",
            "title_similarity": "0.54493237",
            "sentiment_compound": -0.1037
        },
        {
            "id": "he7gyjv",
            "score": 0,
            "text": "Mexico doing so much good but failing to get these countries recognise the annexation of Mexico's Texas and California by USA.",
            "title_similarity": "0.59496355",
            "sentiment_compound": -0.5205
        },
        {
            "id": "he7qi2y",
            "score": 0,
            "text": "Mexico was even under austrian rule not too long ago",
            "title_similarity": "0.6074168",
            "sentiment_compound": 0.0
        },
        {
            "id": "he8cw1b",
            "score": 0,
            "text": "Also interesting is that the Nazis had designs on convincing Mexico to join the war effort against the US in WW1. They made it clear by WW2 where they stood that’s for sure",
            "title_similarity": "0.6862731",
            "sentiment_compound": 0.765
        },
        {
            "id": "he4siph",
            "score": -9,
            "text": "the cartels who have whooped nazi ass.",
            "title_similarity": "0.53115606",
            "sentiment_compound": -0.5423
        },
        {
            "id": "he4slu1",
            "score": -12,
            "text": "Fun fact though, the Mexican army was in collusion with the Nazi's, planning on storming south west of the US. The Mexicans hated our land reach past New Mexico and was very inclined to help the Nazis",
            "title_similarity": "0.65076375",
            "sentiment_compound": 0.2878
        },
        {
            "id": "he4y4pa",
            "score": 12,
            "text": "And the only country in the world which, for 40 long years - and to their own financial detriment - refused to recognise the fascist regime in Spain after Franco staged a coup d'etat against a legitimate and democratic government and won a (un)civil war thanks to both Hitler's and Mussolini's assistance and support. Not enough credit has been given to Mexico for that.\n\nMeanwhile, 'freedom loving' countries such as the US - as well as the rest of the world that followed their lead, to be fair - had no qualms whatsoever recognising this fascist regime that had paraded nazi swastikas in the streets of Madrid and murdered/kidnapped/enslaved its own citizens. \n\nAmerica welcomed fascism into the UN and paved the way for its international acceptance. Mexico upheld legality, democratic legitimacy and human rights until the very end of the Francoist dictatorship. Viva México.",
            "title_similarity": "0.7224463",
            "sentiment_compound": 0.8345
        },
        {
            "id": "he4klct",
            "score": -1,
            "text": "[deleted]",
            "title_similarity": "0.07029892"
        },
        {
            "id": "he4mit1",
            "score": 1,
            "text": "Ww2 is over america",
            "title_similarity": "0.34053063",
            "sentiment_compound": 0.0
        },
        {
            "id": "he4pxpm",
            "score": -1,
            "text": "Austrians, South Tyrolleans, Slovenes, and many others, considered themselves volksdeutsches and would welcome an opportunity to return to a nation they saw as their own.\n\nBorders are often political, but nations are cultural. Even before Hitler's invasion the Austrians were, and still are, of the same nation as the Germans.",
            "title_similarity": "0.7258942",
            "sentiment_compound": 0.4404
        },
        {
            "id": "he4xqdw",
            "score": 1,
            "text": "I was in Mexico for a weekend. My 18th birthday.\n\nIt was fantastic. One of the best times of my life.",
            "title_similarity": "0.36306578",
            "sentiment_compound": 0.8316
        },
        {
            "id": "he4y04y",
            "score": 1,
            "text": "Not even Austria protested, the fathers allowed their daughters to leave their basements to celebrate.",
            "title_similarity": "0.53596854",
            "sentiment_compound": 0.5954
        },
        {
            "id": "he4z8ge",
            "score": 1,
            "text": "Even Austria didn't protest.",
            "title_similarity": "0.41223922",
            "sentiment_compound": 0.1877
        },
        {
            "id": "he550l2",
            "score": 1,
            "text": "Austria didn’t protest though",
            "title_similarity": "0.38671213",
            "sentiment_compound": -0.25
        },
        {
            "id": "he55j4z",
            "score": 1,
            "text": "Not to be \"Hitler had some good ideas\" guy but Austria wanted anschluss (even if official referendum was bad)  and Austria as a part of greater Germany had been popular idea for a long time.  It is mostly a political balance issue why it wasn't.",
            "title_similarity": "0.6854887",
            "sentiment_compound": 0.4854
        },
        {
            "id": "he573t1",
            "score": 1,
            "text": "I thought Italy opposed the annexation of Austria?",
            "title_similarity": "0.5130732",
            "sentiment_compound": 0.0
        },
        {
            "id": "he5eqgh",
            "score": -1,
            "text": "^^hey ^^stop ^^that",
            "title_similarity": "0.15874295",
            "sentiment_compound": -0.296
        },
        {
            "id": "he5fzra",
            "score": 1,
            "text": "Love how the Australians always pretend they were invaded and had to join the German side... There were as many nazi supporters in Austria as in Germany LMAO",
            "title_similarity": "0.70344895",
            "sentiment_compound": 0.9265
        },
        {
            "id": "he5moj3",
            "score": 1,
            "text": "Why protesting lol? It's not like most Austrians were against it xD Hell Austrians were more Nazi then Germans themselves xD And Mexikoplatz was part of their victim card, it's funny how they went totally unpunished cause if it after the WWII.",
            "title_similarity": "0.7392726",
            "sentiment_compound": 0.3999
        },
        {
            "id": "he5nyfx",
            "score": 1,
            "text": "Meanwhile in the US, France  has been our best friend and saved our asses too many times, even gave us a gorgeous bronze woman... and we just shit on them.",
            "title_similarity": "0.4531592",
            "sentiment_compound": 0.891
        },
        {
            "id": "he5sqvv",
            "score": -1,
            "text": "Must go back to the Habsburg era when they ruled Mexico.",
            "title_similarity": "0.5529916",
            "sentiment_compound": 0.0
        },
        {
            "id": "he6a5az",
            "score": 1,
            "text": "I should study Spanish and move to Mexico... it sounds like a place with a  moral backbone (unlike Australia).",
            "title_similarity": "0.57795835",
            "sentiment_compound": 0.3612
        },
        {
            "id": "he6cojz",
            "score": 1,
            "text": "Mexico probably protested the annexation more than Austria lol",
            "title_similarity": "0.61571854",
            "sentiment_compound": 0.3744
        },
        {
            "id": "he6ebj5",
            "score": 1,
            "text": "Austria didn’t kick or scream plus Hitler was Austrian. If the war went in Germany’s favor I could safely say the majority of Austrians would have celebrated.\n\n\nMy brother lived in Germany during the early 70’s and never met anyone that supported the Nazis. In fact they were vehemently opposed them. Really??",
            "title_similarity": "0.72501314",
            "sentiment_compound": 0.6868
        },
        {
            "id": "he6ew4a",
            "score": 1,
            "text": "That support ? Austria couldn't wait to get annexed lmao",
            "title_similarity": "0.57607985",
            "sentiment_compound": 0.765
        },
        {
            "id": "he6h22c",
            "score": 1,
            "text": "They protested it more than the Austrians did.",
            "title_similarity": "0.44793582",
            "sentiment_compound": -0.128
        },
        {
            "id": "he6jek2",
            "score": 1,
            "text": "Even Austria didn't protest it's annexation!",
            "title_similarity": "0.59704703",
            "sentiment_compound": 0.2575
        },
        {
            "id": "he7kek1",
            "score": -1,
            "text": "If you remove people related to drug cartel, rest of population from Mexico is super humble and nice.",
            "title_similarity": "0.5754994",
            "sentiment_compound": 0.7717
        },
        {
            "id": "he4lo7p",
            "score": 21,
            "text": "Lol Austrians trying to pretend like they didn’t overwhelmingly support joining the Nazi Reich",
            "title_similarity": "0.6202971",
            "sentiment_compound": 0.7269
        },
        {
            "id": "he5b572",
            "score": 7,
            "text": "Yeah, well, good for Austria but...\n\nHitler was real popular there up until about 1945...\n\nWhen they were filming The Sound of Music the Austrians at fist balked at putting Nazi flags on buildings for a scene.  The director said fine, if we can't do that we'll just use newsreel footage of Austrian crowds enthusiastically cheering the Nazi takeover.  The Austrians relented...",
            "title_similarity": "0.68677086",
            "sentiment_compound": 0.9604
        },
        {
            "id": "he58leq",
            "score": 2,
            "text": "Why are thy \"honoring\" that? The Austrians welcomed the Nazi's with open arms, so much so they forced the Jews of Vienna to publicly clean the streets on their knees with their bare hands. Austrians love to pat themselves on the back as if they did anything to stop the rise of Hitler and they plundered the wealth of the rich Jews just like the Germans did. \n\nhttps://perspectives.ushmm.org/item/photograph-of-jews-cleaning-streets-in-vienna",
            "title_similarity": "0.63910556",
            "sentiment_compound": 0.947
        },
        {
            "id": "he5dtdd",
            "score": -2,
            "text": "I wonder if this was just a random political move. like... did Mexico actually even give a shit? its like Morocco recognizing the USA as a country.. like.. did Morocco even care or was that a political thing?",
            "title_similarity": "0.5813846",
            "sentiment_compound": 0.755
        },
        {
            "id": "he5sc0k",
            "score": -2,
            "text": "Too bad reddit ....fucknit.",
            "title_similarity": "0.27316433",
            "sentiment_compound": -0.5423
        },
        {
            "id": "he4is6v",
            "score": 3,
            "text": "So the square was named in 1956. As far as I understood it were a large fraction of Austrians in favour of the Anschluss when it happened.\n\nI wonder: are there any non-right wing opinions for Austria as a state in the German federation today? Have the Nazis competely spoiled that prospect?",
            "title_similarity": "0.66723573",
            "sentiment_compound": 0.6662
        },
        {
            "id": "he4y1hk",
            "score": -3,
            "text": "Didn’t Mexico end up trying to help the Nazis with certain endeavors countering the US? Or am I crazy😂",
            "title_similarity": "0.62481964",
            "sentiment_compound": 0.6486
        },
        {
            "id": "he65ihq",
            "score": -2,
            "text": "Why is this so big? This is why reddit is a joke.",
            "title_similarity": "0.36548674",
            "sentiment_compound": 0.296
        },
        {
            "id": "he4xwqt",
            "score": 13,
            "text": "This is going to get buried in the comments, but as a US Citizen who is about to be eligible for Mexican citizenship, I want to explain how Awesome Mexico is with foreign policy. Mexico is open to most countries if you want asylum they are more than likely going to grant it. When the US failed to get Afgan journalists who were working for the NTYs out of harm's way Mexico brought them to Mexico to wait while their asylum statuses were stored out in the US.  When China tried to exchange vaccines for preferable voting in the UN regarding their human rights violations Mexico said no, even though that meant that it took extra time for them to get vaccines, they knew that they had to hold China accountable. Mexico is in a really interesting position internationally because they aren't a world power but they still have more power than a lot of other developing countries which allows them to hold other countries accountable without escalating the situation.",
            "title_similarity": "0.71059495",
            "sentiment_compound": 0.6946
        },
        {
            "id": "he4ow53",
            "score": -4,
            "text": "Hitler tried to get Mexico to invade the U.S. during WW2. Mexico was not cooperative.",
            "title_similarity": "0.5598767",
            "sentiment_compound": 0.0
        },
        {
            "id": "he4so1g",
            "score": 3,
            "text": "To be fair a lot of the Austrians were not that bothered either.",
            "title_similarity": "0.39855546",
            "sentiment_compound": 0.5043
        },
        {
            "id": "he4tm83",
            "score": 4,
            "text": "Mexico was also the first western country to have a black president",
            "title_similarity": "0.60219854",
            "sentiment_compound": 0.0
        },
        {
            "id": "he50qwe",
            "score": -4,
            "text": "Do redditors actually believe these? LMAO",
            "title_similarity": "0.23273459",
            "sentiment_compound": 0.6841
        },
        {
            "id": "he55ztl",
            "score": 4,
            "text": "Thank god they did, if the Nazis had learned how to ride kangaroos the war would had gone very differently.",
            "title_similarity": "0.5849745",
            "sentiment_compound": -0.0772
        },
        {
            "id": "he6qrep",
            "score": 4,
            "text": "From what I learned about the annexation of Austria, Austria didn’t protest either.",
            "title_similarity": "0.6315962",
            "sentiment_compound": -0.25
        },
        {
            "id": "he4fu6g",
            "score": 89,
            "text": "Mexico - the real MVP",
            "title_similarity": "0.4563917",
            "sentiment_compound": 0.0
        },
        {
            "id": "he53tzr",
            "score": 5,
            "text": "Emperor Maximilian or Austria was the emperor of Mexico for a few years. so I do not doubt that he has a lot of history in Mexico and Mexico simply remembers and respect it own history.",
            "title_similarity": "0.6000666",
            "sentiment_compound": 0.6381
        },
        {
            "id": "he54t95",
            "score": 4,
            "text": "That is super interesting.\n\nHonestly though it would have been nicer if instead of a square named after Mexico, how about return Moctezuma's headdress? :)\n\n[The Fight to Bring Home the Headdress of Aztec Emperor](https://www.atlasobscura.com/articles/moctezuma-headdress-mexico-austria)\n\n[Mexico Continues to Request its Aztec Headdress from Austria](https://hypebeast.com/2021/8/mexico-requests-aztec-headdress-austria-montezuma)",
            "title_similarity": "0.6971295",
            "sentiment_compound": 0.9169
        },
        {
            "id": "he58bwf",
            "score": 5,
            "text": "Mexico was also one of the few countries who tried to help Spain during the fascist takeover in the 30s - the other main one being France.\n\nBritain and the US quickly put a stop to it, though - forcing Spain to turn to Stalin (who used the opportunity to extort gold from Spain before sabotaging the Spanish resistance with his NKVD)",
            "title_similarity": "0.7137103",
            "sentiment_compound": -0.0772
        },
        {
            "id": "he64222",
            "score": -5,
            "text": "okay i don't care",
            "title_similarity": "0.07351264",
            "sentiment_compound": -0.1847
        },
        {
            "id": "he4bk3k",
            "score": 190,
            "text": "Had to be the beer. Modelo Negra, a Mexican beer, is actually a Munich Dunkel style lager. \n\nA history \"joke\": Austrians always try to claim that Hitler was German even though he was born in Austria, and that Beethoven was Austrian even though he was born in Germany.",
            "title_similarity": "0.7689706",
            "sentiment_compound": 0.296
        },
        {
            "id": "he4r3cx",
            "score": 5,
            "text": "There’s is a Mexican anti-fascist poster that depicts the flags Mexican eagle perched on a rock tearing up the Nazi flag. It’s pretty dope",
            "title_similarity": "0.64220446",
            "sentiment_compound": 0.4939
        },
        {
            "id": "he4m1v0",
            "score": 152,
            "text": "Back when Mexico was a role model in international diplomacy and always stood up for injustice (even if the country itself was a mess), but those times are gone.",
            "title_similarity": "0.6097655",
            "sentiment_compound": -0.4767
        },
        {
            "id": "he4e8i8",
            "score": 55,
            "text": "Even the Austrians didn't protest.",
            "title_similarity": "0.396654",
            "sentiment_compound": 0.1877
        },
        {
            "id": "he4litc",
            "score": 7,
            "text": "Hitler annexes Austria     \n     \nMexico: \"Not cool, cabron!\"    \n     \nFree platz!",
            "title_similarity": "0.71534455",
            "sentiment_compound": -0.6426
        },
        {
            "id": "he4hv75",
            "score": -9,
            "text": "Didn't Mexico almost join Germany in WW1 and conspire to invade the US?\n\nZimmermann Telegram\n\nhttps://www.history.com/news/what-was-the-zimmermann-telegram",
            "title_similarity": "0.6676683",
            "sentiment_compound": -0.1708
        },
        {
            "id": "he49qry",
            "score": 12,
            "text": "I was just there but missed the significance. Thanks!",
            "title_similarity": "0.3128302",
            "sentiment_compound": 0.6114
        },
        {
            "id": "he4r8lk",
            "score": 31,
            "text": "Now can Austria return us the favour and help us with the Cartels?  We can name a taco in their behalf: \"The Austraquito\"",
            "title_similarity": "0.6511241",
            "sentiment_compound": 0.6808
        },
        {
            "id": "he4p0sq",
            "score": 11,
            "text": "Correct me if I'm wrong but Austria wanted to be part of Germany by-and-large.",
            "title_similarity": "0.6576524",
            "sentiment_compound": -0.2617
        },
        {
            "id": "he4w1kl",
            "score": 39,
            "text": "Pretty sure Austria didn't even protest the annexation of Austria by nazi Germany.",
            "title_similarity": "0.7263633",
            "sentiment_compound": 0.7383
        },
        {
            "id": "he4pj4n",
            "score": 13,
            "text": "Interesting, because I don't even think Austria protested its annexation by Germany.",
            "title_similarity": "0.6365274",
            "sentiment_compound": 0.296
        },
        {
            "id": "he6ak11",
            "score": 23,
            "text": "Yeah because We Mexicans know exactly what it feels that other country just takes away your land *cough* ^texas, ^nevada ^and ^cali  *cough*",
            "title_similarity": "0.63087344",
            "sentiment_compound": 0.296
        },
        {
            "id": "he3y6vw",
            "score": 230,
            "text": "Mexico wanted to ensure that they would keep getting Vienna sausages hence the protest.",
            "title_similarity": "0.67163956",
            "sentiment_compound": 0.1531
        },
        {
            "id": "he474jk",
            "score": -23,
            "text": "Austria remains a poor cousin to Germany with lower income and quality of life.  Would have been better off within the fatherland",
            "title_similarity": "0.48003423",
            "sentiment_compound": -0.34
        },
        {
            "id": "he4o32s",
            "score": 25,
            "text": "Mexico is chill",
            "title_similarity": "0.31174",
            "sentiment_compound": 0.0
        },
        {
            "id": "he3ylsm",
            "score": 534,
            "text": "After the Zimmermann telegram, Mexico knew Germany was trouble.",
            "title_similarity": "0.5850215",
            "sentiment_compound": -0.4019
        },
        {
            "id": "he4hpko",
            "score": 92,
            "text": "I mean, even Austria didn't protest the annexation of Austria by the Nazis.",
            "title_similarity": "0.68756104",
            "sentiment_compound": 0.1877
        },
        {
            "id": "he4h21l",
            "score": 38,
            "text": "Mexico talking to Austria\n\"Those bastards asked us to invade THE UNITED STATES 20 years ago! they have bad judgement\"",
            "title_similarity": "0.6310289",
            "sentiment_compound": -0.6439
        },
        {
            "id": "he3wfoc",
            "score": 1900,
            "text": "Even Austria didn't protest",
            "title_similarity": "0.40410107",
            "sentiment_compound": 0.1877
        },
        {
            "id": "he4dwnr",
            "score": 956,
            "text": "The memorial stone and plaque on the Mexikoplatz portrayed Austria as the \"first victim of nazi germany\".\n\n&#x200B;\n\nA few decades later huge black numbers saying \"99.73\" were put next to that stone.\n\nThat was the official result of the Austrian vote if they would like to be annexed into Nazi Germany.\n\nOf course the number was very likely faked. But we Austrians get taught deeply about this subject and i can tell you with certainty that Austria was an ally not a victim of the Nazis.\n\n&#x200B;\n\nInfact 40% of concentration camp personell and 75% of concentration camp commanders were Austrian.\n\nWhich is wild if you remember that Austrians were 8% of Nazi Germanys population.\n\n  \nSadly the numbers were only a temporary art installation and not a permanent thing.",
            "title_similarity": "0.79379183",
            "sentiment_compound": 0.2549
        },
        {
            "id": "he44lcf",
            "score": 4099,
            "text": "I remember a Sound of Music special feature showed an interview where they wanted to put up the Nazi flags and shoot german military rolling in. Austrian government said no. The movie people said fine we’ll use real footage of austrians cheering the nazis rolling in. I guess the threat worked.",
            "title_similarity": "0.72694314",
            "sentiment_compound": 0.25
        },
        {
            "id": "he3y6i7",
            "score": 6027,
            "text": " Mexico is only one of two Latin-American nations to contribute soldiers during the war (the other nation being Brazil). More Mexican troops fought in the Philippines than in Europe",
            "title_similarity": "0.5668634",
            "sentiment_compound": -0.7553
        },
        {
            "id": "he4fms4",
            "score": 476,
            "text": "There is a Mexikoplatz in Berlin too. I wonder if the reason was the same.",
            "title_similarity": "0.43858594",
            "sentiment_compound": 0.0
        },
        {
            "id": "he4odon",
            "score": 3811,
            "text": "Mexico was one of five countries to refuse to recognize Italy's annexation of Ethiopia, and as such, there is a \"Mexico Square\" in Ethiopia.",
            "title_similarity": "0.6247708",
            "sentiment_compound": -0.296
        },
        {
            "id": "he4ajpa",
            "score": 5,
            "text": "Oh shit, I went found myself there while backpacking but had no idea the history behind it.  Thats awesome.",
            "title_similarity": "0.38311607",
            "sentiment_compound": 0.3716
        },
        {
            "id": "he4gvf8",
            "score": 2,
            "text": "Interestingly enough there's also a public square called [Mexikoplatz](https://de.m.wikipedia.org/wiki/Mexikoplatz_(Berlin) (and its adjacent [railway station](https://en.m.wikipedia.org/wiki/Berlin_Mexikoplatz_station) in Southern Berlin). According to Wikipedia the current name officially came into use in 1987.",
            "title_similarity": "0.52655894",
            "sentiment_compound": 0.4019
        },
        {
            "id": "he4hhks",
            "score": 4,
            "text": "Sadly this place is probably one of the worst in the whole city. The church (franz-von-assisi-church) is incredible Imho",
            "title_similarity": "0.42250174",
            "sentiment_compound": -0.7845
        },
        {
            "id": "he4i29f",
            "score": 2,
            "text": "But if you say it backwards it goes back it's home dimension.",
            "title_similarity": "0.20842195",
            "sentiment_compound": 0.0
        },
        {
            "id": "he4ixee",
            "score": 3,
            "text": "Actually ,Italy got real pissed !",
            "title_similarity": "0.23734751",
            "sentiment_compound": -0.6696
        },
        {
            "id": "he4lol6",
            "score": 1,
            "text": "Gotta preempt a second Zimmerman Telegram.",
            "title_similarity": "0.2988155",
            "sentiment_compound": 0.0
        },
        {
            "id": "he4mhd7",
            "score": 1,
            "text": "I never knew why it was called that!",
            "title_similarity": "0.10228594",
            "sentiment_compound": 0.0
        },
        {
            "id": "he4n0k8",
            "score": 5,
            "text": "Berlin has a public transport station called Mexikoplatz as well, not sure if it’s related.",
            "title_similarity": "0.43187004",
            "sentiment_compound": 0.0356
        },
        {
            "id": "he4naf7",
            "score": 1,
            "text": "How much of Austria at the time was pro annexation?",
            "title_similarity": "0.6027089",
            "sentiment_compound": 0.0
        },
        {
            "id": "he4pxj6",
            "score": 1,
            "text": "There is a square in Berlin named \"Mexikoplatz\" for the same reason...",
            "title_similarity": "0.42697138",
            "sentiment_compound": 0.0
        },
        {
            "id": "he4r48a",
            "score": 1,
            "text": "There's one in Berlin too.",
            "title_similarity": "0.35815668",
            "sentiment_compound": 0.0
        },
        {
            "id": "he4r7xs",
            "score": 1,
            "text": "Not long ago this square was known for black market deals like being able to buy illegal firearms there",
            "title_similarity": "0.44710234",
            "sentiment_compound": -0.2732
        },
        {
            "id": "he4sjci",
            "score": 5,
            "text": "There’s a Mexikoplatz in Berlin as well. Very beautiful old S-Bahn station there.",
            "title_similarity": "0.4893067",
            "sentiment_compound": 0.7425
        },
        {
            "id": "he4swln",
            "score": 1,
            "text": "I thought austrians were happy about being a part of the Reich.",
            "title_similarity": "0.47083524",
            "sentiment_compound": 0.5719
        },
        {
            "id": "he4t3hm",
            "score": 6,
            "text": "As a Mexican, now I know where to visit next.",
            "title_similarity": "0.42276436",
            "sentiment_compound": 0.0
        },
        {
            "id": "he4tjib",
            "score": 4,
            "text": "As an Austrian, this is very interesting to learn!",
            "title_similarity": "0.33048895",
            "sentiment_compound": 0.5081
        },
        {
            "id": "he4tqhu",
            "score": 1,
            "text": "There is one in Berlin too, but I don't know if that one has anything to do with Austria.",
            "title_similarity": "0.47344255",
            "sentiment_compound": 0.0
        },
        {
            "id": "he4vnhf",
            "score": 15,
            "text": "Also, an Austrian duke of the Habsburg family was (briefly) Emperor of Mexico.",
            "title_similarity": "0.5545826",
            "sentiment_compound": 0.0
        },
        {
            "id": "he4wiq2",
            "score": 1,
            "text": "\"thank you Mexico, for protesting the annexation that despite what we like to tell our selves about the vote being rigged, even we were for\" ~Austria, ~~probably~~ definitely.",
            "title_similarity": "0.76135015",
            "sentiment_compound": -0.2982
        },
        {
            "id": "he4wol7",
            "score": 1,
            "text": "If you visit Vienna, visit the House of Austrian History at the Hofburg. It's a fantastic and frank look at their recent history including the occupation.",
            "title_similarity": "0.60063326",
            "sentiment_compound": 0.5574
        },
        {
            "id": "he4wsup",
            "score": 3,
            "text": "Czechs after seeing the western part of their country surrounded: I'm in Danger!\n\nRemember folks: Hilter was in power from 1933 to 1945 - 12 fucking years.",
            "title_similarity": "0.5647111",
            "sentiment_compound": -0.5707
        },
        {
            "id": "he4x56t",
            "score": 1,
            "text": "¡Viva Mexico Cabrones!\n\nAlso another little known fact, in the Auschwitz camp there was a section called \"Mexico\" ( https://second.wiki/wiki/mexiko_kz_auschwitz ) because the prisoners surviving in there had pieces of different clothes all of different colors. The \"colorful\" combinations of clothing reminded people of Mexico (for whatever reason haha).",
            "title_similarity": "0.5692005",
            "sentiment_compound": 0.2942
        },
        {
            "id": "he4x68m",
            "score": 1,
            "text": "“We tried to tell em” -Mexico\n\nOr actually, \n\n“Tratamos de decirles” -Mexico",
            "title_similarity": "0.47603768",
            "sentiment_compound": 0.0
        },
        {
            "id": "he4xx4i",
            "score": 1,
            "text": "I just learned this earlier today",
            "title_similarity": "0.16547145",
            "sentiment_compound": 0.0
        },
        {
            "id": "he4y6u1",
            "score": 7,
            "text": "Viva mexico 🇲🇽💪",
            "title_similarity": "0.3852823",
            "sentiment_compound": 0.0
        },
        {
            "id": "he4ywaf",
            "score": 3,
            "text": "How did I never learn this in school?(Mexican private schools)\n\nGracias amigos!",
            "title_similarity": "0.49064702",
            "sentiment_compound": 0.0
        },
        {
            "id": "he4z24c",
            "score": 1,
            "text": "Huh, well, TIL g'wan Mexico",
            "title_similarity": "0.39922327",
            "sentiment_compound": 0.2732
        },
        {
            "id": "he50lmq",
            "score": 1,
            "text": "Now give us the penacho damnit!",
            "title_similarity": "0.25379333",
            "sentiment_compound": -0.5707
        },
        {
            "id": "he50ulu",
            "score": 1,
            "text": "The Austrians welcomed a Nazi invasion with open arms",
            "title_similarity": "0.6357605",
            "sentiment_compound": 0.34
        },
        {
            "id": "he517b0",
            "score": 1,
            "text": "I mean a lot of Austrians didn't protest either",
            "title_similarity": "0.43293452",
            "sentiment_compound": 0.1877
        },
        {
            "id": "he51kp7",
            "score": 1,
            "text": "Mexico has publicly denounced you! NOTE: You are not at war.",
            "title_similarity": "0.59541965",
            "sentiment_compound": 0.5327
        },
        {
            "id": "he527yz",
            "score": 1,
            "text": "Thank you!",
            "title_similarity": "0.040293716",
            "sentiment_compound": 0.4199
        },
        {
            "id": "he52973",
            "score": 2,
            "text": "Didn’t Austria join Nazi Germany willingly?",
            "title_similarity": "0.73316765",
            "sentiment_compound": 0.296
        },
        {
            "id": "he52bl6",
            "score": 1,
            "text": "What about the soviet union?",
            "title_similarity": "0.2568797",
            "sentiment_compound": 0.0
        },
        {
            "id": "he52fx1",
            "score": 1,
            "text": "....to honor the support against something austia enthusiastically agreed to?\n\nSomething austrians wanted for decades before it happened?",
            "title_similarity": "0.57973075",
            "sentiment_compound": 0.8992
        },
        {
            "id": "he52szl",
            "score": 1,
            "text": "Wait, I thought the Nazis were also trying to recruit Mexico to join the war on their side? Or was that just the plot of a video game I played?",
            "title_similarity": "0.55027986",
            "sentiment_compound": -0.168
        },
        {
            "id": "he5312g",
            "score": 1,
            "text": "Mexico has some really cool anti-fascist art from the era too",
            "title_similarity": "0.62537944",
            "sentiment_compound": 0.3804
        },
        {
            "id": "he53fpq",
            "score": 2,
            "text": "And the Austrians told México “fuck you” I’ll keep the original head dress of your last Aztec king!",
            "title_similarity": "0.6933003",
            "sentiment_compound": 0.3802
        },
        {
            "id": "he53fz3",
            "score": 2,
            "text": "But didn't the people vote to be annexed by them?",
            "title_similarity": "0.38885146",
            "sentiment_compound": 0.0
        },
        {
            "id": "he53hso",
            "score": 1,
            "text": "Thank you for info",
            "title_similarity": "0.09446809",
            "sentiment_compound": 0.3612
        },
        {
            "id": "he53z0e",
            "score": 1,
            "text": "Austria certainly didn’t protest.",
            "title_similarity": "0.39573932",
            "sentiment_compound": 0.1027
        },
        {
            "id": "he549oq",
            "score": 3,
            "text": "Weird relationship given their history.",
            "title_similarity": "0.1302264",
            "sentiment_compound": -0.1779
        },
        {
            "id": "he54dqe",
            "score": 2,
            "text": "Mexico and Austria go way back to when Austria was the Holy Roman Empire.",
            "title_similarity": "0.6170814",
            "sentiment_compound": 0.0
        },
        {
            "id": "he54vrc",
            "score": 2,
            "text": "Didn’t Austria really want to join Germany?",
            "title_similarity": "0.5912451",
            "sentiment_compound": 0.469
        },
        {
            "id": "he55kvl",
            "score": 1,
            "text": "Viva Mexico putos",
            "title_similarity": "0.39000186",
            "sentiment_compound": 0.0
        },
        {
            "id": "he55l62",
            "score": 87,
            "text": "Mexico was also one of only five countries in the League of Nations to condemn the Italian invasion of Ethiopia. There’s a square in the capital Addis Ababa called “Mexico Square” and the former emperor Haile Selassie was the first African head of state to make an official visit to Mexico. I love this nation so much because as an American I respect my neighbors and recognize how much cultural and historical influence they’ve had and continue to have on us and as an American with Ethiopian descent I will forever be grateful that they stood in solidarity with us when our supposed big nation allies France and Britain immediately turned the “balance of power” bullshit and left us hung out to dry. Mexico is honestly one of the most epic nations in the world. Their constitution fucking abolished slavery generations before the American South.",
            "title_similarity": "0.7401514",
            "sentiment_compound": 0.4627
        },
        {
            "id": "he55mu9",
            "score": 2,
            "text": "Vienna was one of my favorite places to visit, the center of the city is a living museum. Absolutely beautiful and tons of fun.",
            "title_similarity": "0.41694674",
            "sentiment_compound": 0.8883
        },
        {
            "id": "he55t06",
            "score": 5,
            "text": "Well, Mexico knew a thing or two about annexation-happy neighbors...",
            "title_similarity": "0.51242113",
            "sentiment_compound": 0.2732
        },
        {
            "id": "he57da1",
            "score": 1,
            "text": "Interesting to remember that Austria didn’t protest the annexation",
            "title_similarity": "0.52102757",
            "sentiment_compound": 0.1779
        },
        {
            "id": "he57dzd",
            "score": 1,
            "text": "Yea but who liberated them lol.",
            "title_similarity": "0.18775937",
            "sentiment_compound": 0.5719
        },
        {
            "id": "he57edh",
            "score": 1,
            "text": "Loser \"teachers\" on dead-end jobs would have Mexican teenagers believe otherwise. I've had two of those dinwits as teachers and they love to woo their students with shitty takes on topics that are barely touched it discussed in this country (ww2, antisemitism, racism,  capitalism, etc).",
            "title_similarity": "0.533865",
            "sentiment_compound": -0.5859
        },
        {
            "id": "he57he4",
            "score": 1,
            "text": "Huh, I wonder why other nations didn't protest?",
            "title_similarity": "0.3781672",
            "sentiment_compound": 0.1877
        },
        {
            "id": "he57hk7",
            "score": 1,
            "text": "there also is a \"Mexico Platz\" in Berlin, Germany",
            "title_similarity": "0.5205138",
            "sentiment_compound": 0.0
        },
        {
            "id": "he57n5y",
            "score": 4,
            "text": "Same thing with Italy invading Eritrea during ww2. Mexico has a circle street there as well",
            "title_similarity": "0.6108115",
            "sentiment_compound": 0.2732
        },
        {
            "id": "he585ka",
            "score": 29,
            "text": "Mexico must have some friends all over the world: when Trump International Scotland golf course put up trees blocking the neighbor's view, the neighbors put up Mexican flags along their property lines.",
            "title_similarity": "0.56197494",
            "sentiment_compound": 0.128
        },
        {
            "id": "he58f59",
            "score": 1,
            "text": "Annexation? I thought it was Anschluss(merge)",
            "title_similarity": "0.49624792",
            "sentiment_compound": 0.0
        },
        {
            "id": "he58kvf",
            "score": 1,
            "text": "Only country including Austria",
            "title_similarity": "0.49414802",
            "sentiment_compound": 0.0
        },
        {
            "id": "he59ojo",
            "score": 1,
            "text": "And to think that the US could have had Greenland!",
            "title_similarity": "0.31760204",
            "sentiment_compound": 0.0
        },
        {
            "id": "he5acxw",
            "score": 1,
            "text": "That might be the reason. However, I suspect that maybe it may also have been  a way for the Austrians to subtly say Sorry without having to say sorry (or, god forbid, do anything about it) for that time an Austrian archduke ruled over Mexico and also owning some high valued and extremely precious and simply amazing native Mexican feather crowns and refusing to give them back. Naming a shitty looking square after Mexico than giving them back their property is so much wasier",
            "title_similarity": "0.7227399",
            "sentiment_compound": 0.5849
        },
        {
            "id": "he5azxw",
            "score": 3,
            "text": "Berlin has also an Mexicoplatz",
            "title_similarity": "0.48939615",
            "sentiment_compound": 0.0
        },
        {
            "id": "he5b2wn",
            "score": 1,
            "text": "We also have Schwedenplatz (Swedish) and Karlsplatz (just for Karl - good for drugs)",
            "title_similarity": "0.5292129",
            "sentiment_compound": 0.4404
        },
        {
            "id": "he5bo1n",
            "score": 3,
            "text": "This is badass, thanks for sharing",
            "title_similarity": "0.25631562",
            "sentiment_compound": 0.7964
        },
        {
            "id": "he5cxhg",
            "score": 4,
            "text": "Wasn't Hitler Austrian-born?",
            "title_similarity": "0.5333229",
            "sentiment_compound": 0.0
        },
        {
            "id": "he5dfog",
            "score": 3,
            "text": "México to other leading countries:  \"It smell like bitch in here!\"",
            "title_similarity": "0.47463012",
            "sentiment_compound": -0.3802
        },
        {
            "id": "he5do69",
            "score": 3,
            "text": "I was under the impression Austria were more or less on the same page and wanted to join into a german reich for the german people? Not that all austrians were nazis, but you did not have to be a nazi to want something like that back then.",
            "title_similarity": "0.74514735",
            "sentiment_compound": 0.6956
        },
        {
            "id": "he5fih8",
            "score": 1,
            "text": "Also, speaking of WW2, I once read somewhere that Mexico had declared war on Germany after the Germans had sunk one of their ships (I think). \n\nSo that's something else you guys probably didn't know :)",
            "title_similarity": "0.6609986",
            "sentiment_compound": -0.7491
        },
        {
            "id": "he5fpjp",
            "score": 1,
            "text": "sounds like a wrestling move",
            "title_similarity": "0.14461768",
            "sentiment_compound": 0.3612
        },
        {
            "id": "he5ggtq",
            "score": 3,
            "text": "And it used to be a popular spot for drug dealing (I’m Austrian and mexikoplatz is well known for it)",
            "title_similarity": "0.53831613",
            "sentiment_compound": 0.5994
        },
        {
            "id": "he5glka",
            "score": 1,
            "text": "VIVA MEXICO CABRONES",
            "title_similarity": "0.37987334",
            "sentiment_compound": 0.0
        },
        {
            "id": "he5gq2f",
            "score": 1,
            "text": "I really get the feeling like Mexico is far too sidelined when it comes to history",
            "title_similarity": "0.5600225",
            "sentiment_compound": 0.5046
        },
        {
            "id": "he5gu6n",
            "score": 2,
            "text": "Interestingly enough, there is a S-Bahn station in Berlin called Mexikoplatz. I caught the train there every day to go to school!",
            "title_similarity": "0.45394903",
            "sentiment_compound": 0.4574
        },
        {
            "id": "he5hab0",
            "score": 1,
            "text": "I honestly read Austria as Australia and was surprised by both facts that\n\n* Germany annexed Australia\n\n* Australia gave a German name to its square",
            "title_similarity": "0.6960935",
            "sentiment_compound": 0.5994
        },
        {
            "id": "he5i7dq",
            "score": 1,
            "text": "Mexico at the time was led by Cárdenas and the left wing of the PRI, who also nationalized all the foreign mines and oil wells in Mexico.",
            "title_similarity": "0.521762",
            "sentiment_compound": 0.25
        },
        {
            "id": "he5ibtj",
            "score": 5,
            "text": "Viva das Mexiko",
            "title_similarity": "0.22330385",
            "sentiment_compound": 0.0
        },
        {
            "id": "he5jkdv",
            "score": 1,
            "text": "Let's not pretend that annexation wasn't wildly popular among many Austrians.",
            "title_similarity": "0.4674464",
            "sentiment_compound": -0.2584
        },
        {
            "id": "he5jt1m",
            "score": 1,
            "text": "and what the fuck was my country doin- ah right we neutral",
            "title_similarity": "0.4064621",
            "sentiment_compound": -0.5423
        },
        {
            "id": "he5khkp",
            "score": 1,
            "text": "... did *Austria* protest the German annexation of Austria?",
            "title_similarity": "0.68993926",
            "sentiment_compound": -0.25
        },
        {
            "id": "he5lxc4",
            "score": 3,
            "text": "The emperor Maximilian of Mexico was Austrian.",
            "title_similarity": "0.57866937",
            "sentiment_compound": 0.0
        },
        {
            "id": "he5m7r3",
            "score": 1,
            "text": "I assume Austria had some reservations",
            "title_similarity": "0.40334898",
            "sentiment_compound": 0.0
        },
        {
            "id": "he5ovvm",
            "score": 3,
            "text": "Did Austria even protest the annexation of Austria?",
            "title_similarity": "0.6245209",
            "sentiment_compound": -0.25
        },
        {
            "id": "he5p574",
            "score": 1,
            "text": "\"support\" lmao as if Austria wasn't by and large perfectly happy to join the Nazi Reich",
            "title_similarity": "0.7280856",
            "sentiment_compound": 0.9493
        },
        {
            "id": "he5p7l9",
            "score": 1,
            "text": "Good to know for six degrees of Wikipedia...thanks.",
            "title_similarity": "0.24262738",
            "sentiment_compound": 0.4404
        },
        {
            "id": "he5pkxt",
            "score": 4,
            "text": "Huh...\n\nWell Done, Mexico! TIL Mexico stood against all the politicians in the world, and flipped a throbbing middle finger to the Nazis... BAD. ASS. 👍💖🤘",
            "title_similarity": "0.606547",
            "sentiment_compound": 0.9151
        },
        {
            "id": "he5qbzu",
            "score": 1,
            "text": "ITT: Even Austria didn't protest x1000",
            "title_similarity": "0.5258996",
            "sentiment_compound": 0.1877
        },
        {
            "id": "he5sajm",
            "score": 1,
            "text": "😃",
            "title_similarity": "-0.010828242",
            "sentiment_compound": 0.3612
        },
        {
            "id": "he5sdfd",
            "score": 1,
            "text": "The whole reason countries let Germany do it is because they were frantically building up their armies. Hitlers entire plan was to get them declare war by making outrageous demands so he could destroy them.",
            "title_similarity": "0.48182052",
            "sentiment_compound": -0.9196
        },
        {
            "id": "he5sok3",
            "score": 1,
            "text": "Not even austria protested lmao",
            "title_similarity": "0.5286012",
            "sentiment_compound": 0.6451
        },
        {
            "id": "he5sx5l",
            "score": 1,
            "text": "Mexico is even more based than i had originally thought",
            "title_similarity": "0.4093156",
            "sentiment_compound": 0.0
        },
        {
            "id": "he5tohb",
            "score": 1,
            "text": "[deleted]",
            "title_similarity": "0.07029892"
        },
        {
            "id": "he5vl4z",
            "score": 2,
            "text": "Yeah, Mexico after 1930 and before 1960 is fucking based",
            "title_similarity": "0.48848602",
            "sentiment_compound": 0.296
        },
        {
            "id": "he5yayi",
            "score": 1,
            "text": "I don't think even *Austria* protested it, so that's saying something!",
            "title_similarity": "0.50227565",
            "sentiment_compound": -0.2003
        },
        {
            "id": "he60de6",
            "score": 3,
            "text": "Mexico is the shit.",
            "title_similarity": "0.42168474",
            "sentiment_compound": 0.6124
        },
        {
            "id": "he62m61",
            "score": 1,
            "text": "Even though a large portion of Austrians supported the Anschluss..",
            "title_similarity": "0.5881218",
            "sentiment_compound": 0.3182
        },
        {
            "id": "he653c2",
            "score": 1,
            "text": "Austria is very thankful for Arnold Schwarzenegger because before him, there was only one possible answer to the question, \"Who's the most well known Austrian?\"",
            "title_similarity": "0.6288092",
            "sentiment_compound": 0.7496
        },
        {
            "id": "he65jze",
            "score": 2,
            "text": "Lol as if the Austrians didn’t want it. Their victim posturing post war has been really something to behold.",
            "title_similarity": "0.59171367",
            "sentiment_compound": -0.4404
        },
        {
            "id": "he68pwf",
            "score": 1,
            "text": "This is especially ironic given the fact that Anschluss was incredibly popular in Austria; they might as well have laid out the red carpet for Hitler.",
            "title_similarity": "0.62424684",
            "sentiment_compound": 0.5267
        },
        {
            "id": "he6a76o",
            "score": 1,
            "text": "Thats actually really cool I will check it out when I visit",
            "title_similarity": "0.1457",
            "sentiment_compound": 0.3804
        },
        {
            "id": "he6b7f9",
            "score": 1,
            "text": "Reading the comments has helped me find out that Mexico is the most based country",
            "title_similarity": "0.5568998",
            "sentiment_compound": 0.0
        },
        {
            "id": "he6e06b",
            "score": 1,
            "text": "Didn’t know that.",
            "title_similarity": "0.03767153",
            "sentiment_compound": 0.0
        },
        {
            "id": "he6e6yy",
            "score": 1,
            "text": "Awesome!",
            "title_similarity": "0.023057535",
            "sentiment_compound": 0.6588
        },
        {
            "id": "he6fg2c",
            "score": 1,
            "text": "But Mexico liked beer and oom-pah Oktoberfest music.\n\nA good lesson to take the good stuff from other countries and rightfully call them out on the bad stuff.",
            "title_similarity": "0.6130252",
            "sentiment_compound": 0.7684
        },
        {
            "id": "he6jyg2",
            "score": 3,
            "text": "There should be a 'platz' when United States invaded Vietnam. There should be another one when they invaded Afganistan. There should be another one when they annexed like 1200 military bases all over the world for having control.\n\nThere should be another one in Cuba btw.",
            "title_similarity": "0.5087338",
            "sentiment_compound": 0.6486
        },
        {
            "id": "he6k4qj",
            "score": 1,
            "text": "ahuevo pinche mexico por fin hacen algo bien, lastima que es la unica vez en la historia",
            "title_similarity": "0.48175028",
            "sentiment_compound": 0.0
        },
        {
            "id": "he6o12f",
            "score": 1,
            "text": "Damn wish I knew that when I visited Vienna!",
            "title_similarity": "0.5294541",
            "sentiment_compound": 0.0
        },
        {
            "id": "he6oefq",
            "score": 1,
            "text": "Mexico understand what it is like to be ruled under tyrants, it would never support such a thing",
            "title_similarity": "0.55623996",
            "sentiment_compound": 0.0624
        },
        {
            "id": "he6ory7",
            "score": 1,
            "text": "I have 2 questions here: “why?\n“ to Mexico and “why?” to the rest of the world.",
            "title_similarity": "0.50548255",
            "sentiment_compound": 0.0
        },
        {
            "id": "he6q6pb",
            "score": 1,
            "text": "There is a square to celebrate the Sovie Union who freed Vienna too.",
            "title_similarity": "0.5927108",
            "sentiment_compound": 0.7506
        },
        {
            "id": "he6tuik",
            "score": 1,
            "text": "Turkey once did a similar thing for Poland. My history teacher was very adamant that we know it.",
            "title_similarity": "0.5803707",
            "sentiment_compound": 0.0
        },
        {
            "id": "he6uztg",
            "score": 1,
            "text": "There is one in Budapest, Hungary as well. For the same reason",
            "title_similarity": "0.311755",
            "sentiment_compound": 0.2732
        },
        {
            "id": "he6vn1h",
            "score": 1,
            "text": "What is it with Latin America and Germans? Doesn't some of them have Nazi runaways?",
            "title_similarity": "0.53083223",
            "sentiment_compound": 0.0
        },
        {
            "id": "he6vsrk",
            "score": 16,
            "text": "Mexico? More like Mexibro",
            "title_similarity": "0.39612824",
            "sentiment_compound": 0.4201
        },
        {
            "id": "he6ybca",
            "score": 3,
            "text": "I find it interesting that Austria mostly escaped unharmed after ww2 and was treated as a victim of nazism, when historians consider at least half of the population supported Anschluss and the Nazi state.",
            "title_similarity": "0.74470663",
            "sentiment_compound": 0.4404
        },
        {
            "id": "he72t2m",
            "score": 1,
            "text": "Berlin also has a “Mexikoplatz”",
            "title_similarity": "0.38808942",
            "sentiment_compound": 0.0
        },
        {
            "id": "he75jfd",
            "score": 1,
            "text": "Then they joined the Nazis and sent thousands of \"expats\" to fight for the motherland...",
            "title_similarity": "0.5028442",
            "sentiment_compound": -0.3818
        },
        {
            "id": "he766xf",
            "score": 1,
            "text": "This rules",
            "title_similarity": "0.040204797",
            "sentiment_compound": 0.0
        },
        {
            "id": "he78xd6",
            "score": 1,
            "text": "There's also a Mexikoplatz in Berlin.",
            "title_similarity": "0.36257666",
            "sentiment_compound": 0.0
        },
        {
            "id": "he7alqx",
            "score": 1,
            "text": "They protested the annexation of Austria, by Germany. A Germany that was primarily led by... Austrians.",
            "title_similarity": "0.6903192",
            "sentiment_compound": -0.128
        },
        {
            "id": "he7dox2",
            "score": 1,
            "text": "I am aware of that, I am German.",
            "title_similarity": "0.41307336",
            "sentiment_compound": 0.0
        },
        {
            "id": "he7dr5p",
            "score": 1,
            "text": "Oh Yeah they were captured. They mostly were nazis too!",
            "title_similarity": "0.51340353",
            "sentiment_compound": 0.3595
        },
        {
            "id": "he7f3dm",
            "score": 1,
            "text": "And Mexico also sent troops to fight in WW2.",
            "title_similarity": "0.48280513",
            "sentiment_compound": -0.3818
        },
        {
            "id": "he7gp0c",
            "score": 1,
            "text": "And now in 2021 they just recived with honors a moteefuking Dictator to celebrate their independence day. Current  president is a shame for all the free countries of Latin America",
            "title_similarity": "0.5771879",
            "sentiment_compound": 0.802
        },
        {
            "id": "he7i3hf",
            "score": 1,
            "text": "99% of Austrians voted for this to happen",
            "title_similarity": "0.4698549",
            "sentiment_compound": 0.0
        },
        {
            "id": "he7w485",
            "score": 1,
            "text": "Most of the time when radicals start crossing lines they do it in a slow planned out way and only those with an actual moral fortitude will stand up to injustice. Unfortunately few people learn from history",
            "title_similarity": "0.4980877",
            "sentiment_compound": -0.7269
        },
        {
            "id": "he81p49",
            "score": 3,
            "text": "Well,,  it's a nice piece of revisionist history by Austria. An absolute MASSIVE majority of Austrians were in favour of shacking up with Hitler. For some reason, Austria avoids being mentioned as part of the Germany-Italy axis of WW2, but they really deserve to be.",
            "title_similarity": "0.74051887",
            "sentiment_compound": 0.4678
        },
        {
            "id": "he83gjv",
            "score": 2,
            "text": "wasn't austria itself pretty much completely okay with it? I mean yes they faked the vote but they would have won regardless.",
            "title_similarity": "0.6203047",
            "sentiment_compound": 0.7706
        },
        {
            "id": "he86z0u",
            "score": 1,
            "text": "Don’t discount the German heritage in Mexico  \nhttps://en.m.wikipedia.org/wiki/German_Mexicans.",
            "title_similarity": "0.7089368",
            "sentiment_compound": 0.0
        },
        {
            "id": "he87z3d",
            "score": 1,
            "text": "Annexation of Austria by Nazi Germany, lead by an Austrian.",
            "title_similarity": "0.6513401",
            "sentiment_compound": 0.0
        },
        {
            "id": "he8ava1",
            "score": 1,
            "text": "Like half or maybe more of Mexico's land was annexed by the US less than 100 years prior, so I'm not surprised they'd be strongly against annexation.",
            "title_similarity": "0.6439699",
            "sentiment_compound": 0.396
        },
        {
            "id": "he8ch7w",
            "score": 1,
            "text": "Why did the Mexicans care?  I mean the vast majority of Austrians were even for it.",
            "title_similarity": "0.67386127",
            "sentiment_compound": 0.4939
        },
        {
            "id": "he8haq9",
            "score": 1,
            "text": "which is interesting because Austria didn't actually care",
            "title_similarity": "0.43377972",
            "sentiment_compound": 0.0186
        },
        {
            "id": "heb8fdm",
            "score": 1,
            "text": "Not many people know that there was a Second Empire in Mexico. \n\nWe had an Austrian emperor: Maximiliano De Habsburgo. \n\nWe loved him and there is a Castle in Mexico City that he made.",
            "title_similarity": "0.69250715",
            "sentiment_compound": 0.5994
        },
        {
            "id": "hevmyyo",
            "score": 1,
            "text": "wow, I'm going to visit Vienna in November. I'm definitely taking some pics there!",
            "title_similarity": "0.42108563",
            "sentiment_compound": 0.7777
        }
    ]
}