{
    "TIL about the Finnish \"Day-fine\" system; most infractions are fined based on what you could spend in a day based on your income. The more severe the infraction the more \"day-fines\" you have to pay, which can cause millionaires to recieve speeding tickets of 100,000+$\n": [
        {
            "id": "hfnjdzt",
            "score": 1,
            "text": "Sadly it doesn't scale steep enough and doesn't account for net worth so incredibly rich people won't be fined enough. It goes by your income so if you just pump all money into your companies and don't actually take all that much in wages, you won't be fined nearly enough for it to matter. \n\nStill better than just fining a set amount for everyone.",
            "title_similarity": "0.67516273",
            "sentiment_compound": 0.7408
        },
        {
            "id": "hfngvy7",
            "score": 0,
            "text": "This is the way!",
            "title_similarity": "-0.09236285",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfnlgr1",
            "score": 23,
            "text": "Tucker Carlson: \"WE CAN'T HAVE THIS IN OUR COUNTRY.  The courts will be full of poor people getting fifty cent fines, laughing as they leave the courtroom.\"\n\nIdiots: \"By god, he's right.  What's with these socialist policies?\"",
            "title_similarity": "0.72449887",
            "sentiment_compound": 0.25
        },
        {
            "id": "hfngpqd",
            "score": -78,
            "text": "Ah yes, unequal treatment under the law. What could go wrong?",
            "title_similarity": "0.31131575",
            "sentiment_compound": -0.4215
        },
        {
            "id": "hfobw87",
            "score": -5,
            "text": "[removed]",
            "title_similarity": "-0.0066152774"
        },
        {
            "id": "hfng4tw",
            "score": 27,
            "text": "All fines everywhere should be some kind of percentage of income or profit, for persons and companies. Otherwise the fines become meaningless over time.\n\nDumping toxic waste should be like 50% of the gross for a company. That would get their attention. The fines now are laughable.",
            "title_similarity": "0.7867142",
            "sentiment_compound": -0.6705
        },
        {
            "id": "hfnny49",
            "score": 12,
            "text": "I have been concerned about this for a long time. Fine-enforced laws are just laws for the poor. I've always said it should be based on your net worth.",
            "title_similarity": "0.50756514",
            "sentiment_compound": -0.296
        },
        {
            "id": "hfnoreb",
            "score": 5,
            "text": "This is how it should be everywhere. When the penalty for a crime is a fixed fine, then it is simply legal for the wealthy.",
            "title_similarity": "0.5334319",
            "sentiment_compound": -0.4019
        },
        {
            "id": "hfo1pwr",
            "score": 2,
            "text": "\"Great idea!\" - Everybody in Reddit with puny incomes",
            "title_similarity": "0.4810068",
            "sentiment_compound": 0.6588
        },
        {
            "id": "hfnixrb",
            "score": -12,
            "text": "That's bleeping amazing.  In a couple hundred years our children's children will be studying the history of how thoroughly backwards and barbaric america truly was.",
            "title_similarity": "0.561205",
            "sentiment_compound": 0.7717
        },
        {
            "id": "hfnliu3",
            "score": 2,
            "text": "Nice for criminals who report little income and keep millions in cash",
            "title_similarity": "0.6186979",
            "sentiment_compound": -0.2263
        },
        {
            "id": "hfnfg78",
            "score": 43,
            "text": "The unemployed just go on crime sprees?",
            "title_similarity": "0.44128278",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hfncc8d",
            "score": 26,
            "text": "Other countries could learn a thing or two here. And probably raise more income in a fairer way. \n\nBring it on!",
            "title_similarity": "0.36744547",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfncnz7",
            "score": -15,
            "text": "Impressed obama.jpg",
            "title_similarity": "0.21786961",
            "sentiment_compound": 0.4767
        },
        {
            "id": "hfnn6aq",
            "score": -4,
            "text": "[deleted]",
            "title_similarity": "0.03025806"
        },
        {
            "id": "hfniuau",
            "score": 5,
            "text": "I fucking love it",
            "title_similarity": "0.021677092",
            "sentiment_compound": 0.6697
        },
        {
            "id": "hfnp244",
            "score": -8,
            "text": "The argument against this is that police would actively seek wealthy for crimes in order to get the biggest pay cuts from their tickets. Not saying I think this is a bad idea, but that is an argument I've heard",
            "title_similarity": "0.7192149",
            "sentiment_compound": -0.6858
        },
        {
            "id": "hfnrixy",
            "score": -6,
            "text": "I, (an American) came up with an idea like this a while back, but thought it made too much sense for humans to attempt it.   I'm glad to be wrong!  Horay for Finland!",
            "title_similarity": "0.4373138",
            "sentiment_compound": 0.2924
        },
        {
            "id": "hfnsi27",
            "score": 8,
            "text": "This is the only sane system, if you're going to use fines as a punishment. Because if you have a fixed fine that's affordable to the poor, then it is more or less legal - or at least inconsequential - for rich people to break that law.\n\nIn theory, time has the same value to everyone, so giving people the same prison sentences is fair. But imagine how unfair it would be if poor people had to spend 100x as much time in jail as rich people for the same crime. That's what these fixed fines are like.\n\n(and yes, I know, in the real world rich people spend very little time in jail for the same crime, so it already is mostly like that. And it's a great injustice)",
            "title_similarity": "0.710512",
            "sentiment_compound": 0.585
        },
        {
            "id": "hfnuhkq",
            "score": -3,
            "text": "I’ve been saying or years  this is what we need in America.",
            "title_similarity": "0.3205793",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfnh6hn",
            "score": 6,
            "text": "Wait, is this not a thing in other countries?",
            "title_similarity": "0.088735044",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfnx2al",
            "score": 2,
            "text": "Love it. This is the only way to make fines actually punish the rich. Can se get someone from finland in contact with the SEC? Tired of evil cunts getting fined $50k for crimes that generate them millions in profit",
            "title_similarity": "0.8133708",
            "sentiment_compound": -0.5994
        },
        {
            "id": "hfnpdzw",
            "score": -30,
            "text": "More screw the successful socialist BS....\n\nWhy should someone who worked harder to get ahead pay more for the very same thing a lazy couch potato does?",
            "title_similarity": "0.57279825",
            "sentiment_compound": 0.1206
        },
        {
            "id": "hfnlbb6",
            "score": 4,
            "text": "Pretty smart idea. I like it.",
            "title_similarity": "0.021604743",
            "sentiment_compound": 0.8126
        },
        {
            "id": "hfnuw7e",
            "score": 0,
            "text": "Let me guess, when the government commits a crime against you they magically forget this principle and dont give you a single day's worth of their potential spending.\n\nSilly peasant, this is here to enrich *us*, not *you*.",
            "title_similarity": "0.5966457",
            "sentiment_compound": -0.5106
        },
        {
            "id": "hfozt9v",
            "score": 0,
            "text": "Billionaires don't have an income, where I'm from. They usually \"earn\" less than your average teacher.",
            "title_similarity": "0.54386216",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfno8wi",
            "score": -3,
            "text": "[deleted]",
            "title_similarity": "0.03025806"
        },
        {
            "id": "hfnox65",
            "score": 5,
            "text": "This is the solution to the “If the penalty for a crime is a fine, then the law only exists if you are poor.” problem.  There are already so many benefits to being wealthy, it's frankly cruel to make the way the law is structed another one.",
            "title_similarity": "0.7224085",
            "sentiment_compound": -0.6728
        },
        {
            "id": "hfnps9s",
            "score": 11,
            "text": "Shouldn't the punishment fit the crime? What difference does someone's income have on how bad their actions are?",
            "title_similarity": "0.5527708",
            "sentiment_compound": -0.7809
        },
        {
            "id": "hfnn167",
            "score": 3,
            "text": "Anyone else want this here in the states? I’m loving the idea.",
            "title_similarity": "0.181037",
            "sentiment_compound": 0.6369
        },
        {
            "id": "hfnmc6f",
            "score": -2,
            "text": "And so the rich just hire chauffeurs.",
            "title_similarity": "0.42885578",
            "sentiment_compound": 0.5965
        },
        {
            "id": "hfoamir",
            "score": 1,
            "text": "I can confirm.. there was a time when I young, stupid, and making way too much money and had to travel a lot... speeding tickets were just a cost of doing business... fines were just a license to speed",
            "title_similarity": "0.7487963",
            "sentiment_compound": -0.5267
        },
        {
            "id": "hfnmc2m",
            "score": 6,
            "text": "this is fucking briliant!!\n\n&#x200B;\n\nI know so many assholes who dont mind speeding or parking illegally. to them its just an issue you can throw a little money at and it goes away. Make it more expensive and theyll start acting like decent human beings. \n\n&#x200B;\n\nBy the same token it means someone on wellfare isnt left unable to feed their kids coz they went a little over the speed limit two weeks ago and got slapped with a fine thats about half what they make in a week",
            "title_similarity": "0.82675964",
            "sentiment_compound": -0.3318
        },
        {
            "id": "hfnpxz5",
            "score": 8,
            "text": "I brought this up once in conversation with an uncle of mine. He called me a socialist and yell-asked (yasked?) if I thought a gallon of milk should cost more for rich people. \n\nWhy is it always an uncle? He's not even *that* uncle in my family, we have a **different** *that* uncle...",
            "title_similarity": "0.6418159",
            "sentiment_compound": 0.6415
        },
        {
            "id": "hfnmkka",
            "score": 11,
            "text": "Main issue with that is most millionaires don't have a traditional income, so they could end up paying *less* than a wage earner for the same infraction (which is ***exactly*** what US lawmakers would do to protect their class interests). Would be better to go by net worth.",
            "title_similarity": "0.7278282",
            "sentiment_compound": 0.8126
        },
        {
            "id": "hfnr68k",
            "score": 6,
            "text": "Wouldn't that encourage authorities to arrest people with seemingly more valuable vehicles? Or is that a myth? I remember people arguing over this a few years ago",
            "title_similarity": "0.6020205",
            "sentiment_compound": -0.6211
        },
        {
            "id": "hfnv1t5",
            "score": 4,
            "text": "America needs this system for corporations that fuck around.\n\nBut corporations are a protected class",
            "title_similarity": "0.49633634",
            "sentiment_compound": 0.3818
        },
        {
            "id": "hfnirge",
            "score": 1,
            "text": " Cash fines only affect the poor except Finland",
            "title_similarity": "0.58819616",
            "sentiment_compound": -0.4767
        },
        {
            "id": "hfnnsgq",
            "score": -2,
            "text": "WHY ARE WE NOT FUNDING THIS",
            "title_similarity": "0.12817317",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfnpv13",
            "score": -2,
            "text": ">which can cause millionaires to recieve speeding tickets of 100,000+$\n\nIt seems like most millionaire’s (and above) wouldn’t be affected very much, if this only applies to annual income, as a lot of them make their money through investments such as capital gains instead of salary.",
            "title_similarity": "0.8363464",
            "sentiment_compound": 0.5106
        },
        {
            "id": "hfnq5dp",
            "score": 2,
            "text": "I love this (๑♡⌓♡๑)",
            "title_similarity": "-0.00980165",
            "sentiment_compound": 0.6369
        },
        {
            "id": "hfo3qjy",
            "score": 1,
            "text": "This opens up the argument that prison time for someone who makes significant amount of money should be adjusted down because the prison time is disproportionately more expensive for the high-income earner.\n\nWhat about prison time for someone who is younger vs older? The older person has less time left, so each day in prison is more likely to be a higher % of their remaining life.",
            "title_similarity": "0.7486682",
            "sentiment_compound": -0.9313
        },
        {
            "id": "hfoa1bv",
            "score": 1,
            "text": "Hey America, common sense over here",
            "title_similarity": "0.119008645",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfoa2qn",
            "score": 2,
            "text": "I'm sure it works perfectly and nobody in Finland or any other country has an opinion on it other than what an amazing system it is",
            "title_similarity": "0.29064703",
            "sentiment_compound": 0.8834
        },
        {
            "id": "hfoj1xf",
            "score": 1,
            "text": "We need this soooooo badly.\n\nStarts with the seditious members of congress who refuse to wear a mask.\n\n5000 is not enough when corporations are sponsoring them.",
            "title_similarity": "0.6697949",
            "sentiment_compound": -0.7906
        },
        {
            "id": "hfnbfjr",
            "score": 465,
            "text": "This is absolutely how it should be everywhere.",
            "title_similarity": "-0.024722183",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfnnyqa",
            "score": 98,
            "text": "Whenever this gets re-posted it's an instant front-page Reddit circlejerk lol",
            "title_similarity": "0.43228576",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hfoezwp",
            "score": -9,
            "text": "\"F you for being successful\"",
            "title_similarity": "0.11891472",
            "sentiment_compound": 0.5859
        },
        {
            "id": "hfot7o2",
            "score": 11,
            "text": "I showed this article to a friend of mine who happens to be Republican, and he predictably blew his lid. \"Why should I pay $100,000 for a speeding ticket, that's communism, it's socialism, it's Obama, it's blah blah stupid shit right wing nonsense blah blah!\"\n\nLike dude, you work at fucking Q'doba. You're not gonna get a 100k speeding ticket, in fact you'd probably get less because of your shit job you absolute donkey.",
            "title_similarity": "0.8164941",
            "sentiment_compound": -0.8977
        },
        {
            "id": "hfnqnou",
            "score": 3,
            "text": "From Finland here, I knew a man (friend's dad) who got approx 300,000€ fine taking his Lamborghini out for a joy ride. I think it is a fair system, they barely batted an eyelash at the cost...",
            "title_similarity": "0.603023",
            "sentiment_compound": 0.7845
        },
        {
            "id": "hfnu1wc",
            "score": 3,
            "text": "I received a ticket for $40, that's $40 that I can't spend on groceries in a few weeks unless I find another couple hours at work. \n\nTo someone else, it's cheaper than the garage down the street.",
            "title_similarity": "0.6965058",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfnuj01",
            "score": 3,
            "text": "All fines should be this way. In the American justice system EVERYTHING is a small fine if you’re rich enough.",
            "title_similarity": "0.5640423",
            "sentiment_compound": 0.8316
        },
        {
            "id": "hfo5phh",
            "score": 3,
            "text": "This is fucking genius... How do we not have this in America? ..... Oh yeah. Corruption.",
            "title_similarity": "0.4363971",
            "sentiment_compound": 0.296
        },
        {
            "id": "hfo9qik",
            "score": 4,
            "text": "This is 100% how fines should work, so they actually affect the rich folks",
            "title_similarity": "0.71305454",
            "sentiment_compound": 0.5574
        },
        {
            "id": "hfnof8k",
            "score": -7,
            "text": "[deleted]",
            "title_similarity": "0.03025806"
        },
        {
            "id": "hfob3er",
            "score": -7,
            "text": "Any \"fine\" or \"license\" you pay to a government entity is just theft. There is no victim for these \"fines\" and a \"license\" is just extortion of basic human rights, like fishing.",
            "title_similarity": "0.51112884",
            "sentiment_compound": 0.5739
        },
        {
            "id": "hfnq831",
            "score": 0,
            "text": "Do they include capital gains? Otherwise the truly rich who don't work wouldn't get charged at all.",
            "title_similarity": "0.5769104",
            "sentiment_compound": 0.8588
        },
        {
            "id": "hfnqksy",
            "score": 0,
            "text": "Interestingly it includes a fixed exemption for living expenses, so less well off get a break but rich people can’t deduct a lavish lifestyle from the penalty. \n\n> The daily disposable income is considered to be one 60th part of the person's monthly mean income during the year, after taxes, social security payments and a basic living allowance of €255 per month have been deducted.",
            "title_similarity": "0.74419725",
            "sentiment_compound": 0.7501
        },
        {
            "id": "hfns3hn",
            "score": 0,
            "text": "Finland: More socialist than countries that call themselves socialist, and they're not even trying.",
            "title_similarity": "0.5144228",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfnt4i6",
            "score": 0,
            "text": "How does it works if you are an ultrarich that doesn't have a \"standard\" salary/paying yourself by other means?",
            "title_similarity": "0.4565825",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfnuno7",
            "score": 5,
            "text": "Equity in its purest form",
            "title_similarity": "0.12782723",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfnw685",
            "score": 0,
            "text": "Hahaha could you imagine this being implemented in the USA. Poor people with red MAGA hats would riot.",
            "title_similarity": "0.5804328",
            "sentiment_compound": -0.4767
        },
        {
            "id": "hfnwosu",
            "score": 0,
            "text": "\"ya but the rich as so smrt! did you know bezos only paid himself 80k last year?  heehee! \"\n\neat. the.  rich.",
            "title_similarity": "0.6878607",
            "sentiment_compound": 0.9078
        },
        {
            "id": "hfnz2tz",
            "score": 3,
            "text": "This wouldn't work in America. The only way for the government to determine your income is through tax documents. The rich are already using loopholes to lower their taxable income. So their fines would likely be lower than a poor person fine.",
            "title_similarity": "0.70965886",
            "sentiment_compound": -0.2732
        },
        {
            "id": "hfnzdws",
            "score": 0,
            "text": "It is a step in the right direction but still doesn't go far enough. If person A make $500 a week and person B makes $5,000 a week then losing $100 may mean that person A has trouble paying their monthly bills. For person B losing $1,000 will still have no impact on their day to day life.",
            "title_similarity": "0.6735605",
            "sentiment_compound": -0.9209
        },
        {
            "id": "hfo85yt",
            "score": 0,
            "text": "What if you have no income? Just go doing dumb shit all day scott free?",
            "title_similarity": "0.4386951",
            "sentiment_compound": -0.7319
        },
        {
            "id": "hfo8kon",
            "score": 0,
            "text": "Wow the system is fair? What? When this happen? Well good for you, system. Ya got one. Juuuuuuust one :/",
            "title_similarity": "0.1987625",
            "sentiment_compound": 0.8496
        },
        {
            "id": "hfo9h2y",
            "score": -4,
            "text": "I fundamentally disagree with any system which encourages and rewards the issuance of tickets.\n\nThis just incentivises police to write more tickets the nicer the car you have.",
            "title_similarity": "0.6217773",
            "sentiment_compound": 0.7624
        },
        {
            "id": "hfoa568",
            "score": -5,
            "text": "[removed]",
            "title_similarity": "-0.0066152774"
        },
        {
            "id": "hfod72f",
            "score": 0,
            "text": "stupid",
            "title_similarity": "0.090645745",
            "sentiment_compound": -0.5267
        },
        {
            "id": "hfoornt",
            "score": 0,
            "text": "This should apply to prison time as well, with the multiples being based around the average income. i.e. an average income person's 1 year jail sentence would become a 20 year sentence for someone who earns 20x the average. Billionaires would strongly reconsider any crime no matter how good a lawyer they could hire.",
            "title_similarity": "0.7344682",
            "sentiment_compound": -0.0449
        },
        {
            "id": "hfosg1f",
            "score": 0,
            "text": "Isn't this common practice in most countries? I think only countries that are known to be more on the totalitarian side have random punishments?",
            "title_similarity": "0.5538397",
            "sentiment_compound": -0.7596
        },
        {
            "id": "hfotmco",
            "score": 0,
            "text": "What if I dont have a job? Can I just speed everywhere then?",
            "title_similarity": "0.3464557",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfovpig",
            "score": 0,
            "text": "Canada's fines are too big for this. They would need to have week fines here.",
            "title_similarity": "0.7321978",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfovrd2",
            "score": 0,
            "text": "So someone who is wealthy but makes little to no income pays little to no fee? Is that right?",
            "title_similarity": "0.37189907",
            "sentiment_compound": -0.5228
        },
        {
            "id": "hfoy74r",
            "score": 0,
            "text": "Damn. It’s good to be rich in America. 😎",
            "title_similarity": "0.38915044",
            "sentiment_compound": 0.7783
        },
        {
            "id": "hfozb3z",
            "score": 0,
            "text": "Upon hearing the 100k+ fine,  the millionaires immediately shrugs it off and turn to the politician and says “that’s coming out of your pocket, I mean political donation.”",
            "title_similarity": "0.6769148",
            "sentiment_compound": 0.2023
        },
        {
            "id": "hfozc6p",
            "score": 0,
            "text": "Billionaires often have an income less than your average chef.",
            "title_similarity": "0.57480645",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfozhl2",
            "score": 0,
            "text": "Upon hearing the 100k+ fine,  the millionaires immediately shrugs it off and turn to the politician and says “that’s coming out of your pocket, I mean political donation.”",
            "title_similarity": "0.6769148",
            "sentiment_compound": 0.2023
        },
        {
            "id": "hfozkha",
            "score": 0,
            "text": "Upon hearing the 100k+ fine,  the millionaires immediately shrugs it off and turn to the politician and says “that’s coming out of your pocket, I mean political donation.”",
            "title_similarity": "0.6769148",
            "sentiment_compound": 0.2023
        },
        {
            "id": "hfozwf8",
            "score": 0,
            "text": "Haha :) Free speeding for me! \n\n(If I had a car...)",
            "title_similarity": "0.3965127",
            "sentiment_compound": 0.8622
        },
        {
            "id": "hfp81ee",
            "score": 0,
            "text": "Doing a ton twenty because your poor as fuck and just stole the car. No ticket for me. *taps head",
            "title_similarity": "0.7120358",
            "sentiment_compound": -0.8316
        },
        {
            "id": "hfp8r1r",
            "score": 0,
            "text": "My thoughts for fines is to have the regular fine amount for the low to average and even above average income. Then, after a point an excess fee should be lopped on top of income/net worth — but I’m talking about the $200kaud + mark, and net worth being a contributing factor so they can’t conceal themselves behind assets. \n\nSomething about the asshole that parks his Ferrari in my loading zone getting a ticket proportionate to the size of his smugness brings me joy.\n\nI’d also have something in place for those under the poverty line, but you’ll find more people will gripe about poor people paying less — despite the proportion they really should be taking from the wealthy. For petty shit that isn’t a danger to people’s lives (like parking for too long) — I think allowances could be made.",
            "title_similarity": "0.7542153",
            "sentiment_compound": -0.8225
        },
        {
            "id": "hfpap4x",
            "score": 0,
            "text": "Is it based on income or net worth?\n\nBecause lots of billionaires only make $1, and they get their spending money via loans (therefore debt, not income) to dodge taxes and things based on income.",
            "title_similarity": "0.69118905",
            "sentiment_compound": -0.1531
        },
        {
            "id": "hfpaxn9",
            "score": 0,
            "text": "[deleted]",
            "title_similarity": "0.03025806"
        },
        {
            "id": "hfpptpa",
            "score": 0,
            "text": "This just seems like asset seizure with extra steps.  If the “crime” is so petty that a fine is an acceptable punishment, then why is it a crime at all?  Who is the victim?",
            "title_similarity": "0.57723594",
            "sentiment_compound": -0.5309
        },
        {
            "id": "hfpxryi",
            "score": 0,
            "text": "There's going to be a point where a billionaire gets hit with one of these, tells the government to abolish this system or they're pulling their production out of the country, the government calls their bluff, and then they show they weren't bluffing.\n\nIt hasn't happened yet but I could see it going down and eventually costing the government more than it brings in with the day fines.",
            "title_similarity": "0.7014184",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfqow5s",
            "score": 0,
            "text": "This is so unfair and downright communism, discusting.",
            "title_similarity": "0.390231",
            "sentiment_compound": -0.6113
        },
        {
            "id": "hgjwi0d",
            "score": 0,
            "text": "How evil is this?",
            "title_similarity": "0.22266176",
            "sentiment_compound": -0.6597
        },
        {
            "id": "hfnghnw",
            "score": 8,
            "text": "I'm finn with this",
            "title_similarity": "0.1195656",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfnx3ui",
            "score": 6,
            "text": "Finland is ahead of the curve on global Democracy. Northern/Western Europe in general, sure. But Finland is near the top.\n\nFun fact: The first nation of every recorded nation on the entire planet to implement democracy with full suffrage for sex and ethnicity (meaning the ability to vote and be elected) is Finland. New Zealand is a close second place.",
            "title_similarity": "0.5616393",
            "sentiment_compound": 0.882
        },
        {
            "id": "hfo9t2j",
            "score": -4,
            "text": "[deleted]",
            "title_similarity": "0.03025806"
        },
        {
            "id": "hfodbb9",
            "score": -5,
            "text": "Lets punosh people for having money",
            "title_similarity": "0.4439986",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfnfa0a",
            "score": 180,
            "text": "I'd be much more interested in data that shows the efficacy of deterrence on that system versus say the US system, or the prevalence of speeding in each country by income.\n\nIn the US a chronic violator of traffic laws could still lose their license even if they can afford the fines, so I'm skeptical of this making a difference without seeing more info",
            "title_similarity": "0.71908057",
            "sentiment_compound": -0.6893
        },
        {
            "id": "hfntcoe",
            "score": 12,
            "text": "Otherwise fines are just fees to do illegal shit for rich people.",
            "title_similarity": "0.66409135",
            "sentiment_compound": -0.5574
        },
        {
            "id": "hfo1l9u",
            "score": 13,
            "text": "I love my country, but in the US, this would lead to chaos.  Anyone appearing to have any wealth would be pulled over and ticketed for the smallest infraction while those appearing to have little income would be entirely unmolested.  This is because citation is income to police.  It isn’t worth their time to get citations for $6 when there are citations of $100k to be had.  \n\nI like the idea of the day-fine, but our corrupt policing system would just abuse the privilege to get cool new toys to further abuse privileges.",
            "title_similarity": "0.7353482",
            "sentiment_compound": -0.0387
        },
        {
            "id": "hfnmzzy",
            "score": -1,
            "text": "Anatole France:  \"The law, in its majestic equality, forbids all men to sleep under bridges, to beg in the streets and to steal bread -- the rich as well as the poor.\"\n\nFinland:  \"Actually we figured out a fix for that.\"",
            "title_similarity": "0.50242573",
            "sentiment_compound": -0.4404
        },
        {
            "id": "hfnrmg1",
            "score": -1,
            "text": "We need this.",
            "title_similarity": "-0.0040167905",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfnryit",
            "score": 1,
            "text": "I wonder how it's calculated for those rich people who have a salary of $1 because all their compensation is stock or w.e. You know how they dodge income taxes in the US because they don't earn \"income\"?",
            "title_similarity": "0.7522193",
            "sentiment_compound": 0.5574
        },
        {
            "id": "hfnvb05",
            "score": 1,
            "text": "Pro rata fines are the only way to have a fair justice system. It's astonishing that they aren't ubiquitous. I know oligarchs run the world but this is an easy way to at least apply a veneer of fairness to the system because people who are powerful enough simply won't be fined in the first place and it'll generate more cash for their pile of gold. It's win-win for everyone but the people who are wealthy but not powerful and I think I'll save my tears for someone else in that case.",
            "title_similarity": "0.66580117",
            "sentiment_compound": 0.9274
        },
        {
            "id": "hfnwujk",
            "score": 1,
            "text": "This is amazing and should be replicated everywhere",
            "title_similarity": "0.08689858",
            "sentiment_compound": 0.5859
        },
        {
            "id": "hfo09py",
            "score": -1,
            "text": "Cringe",
            "title_similarity": "0.12551048",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfo1h2t",
            "score": -1,
            "text": "Interesting. I've had that idea as well. My idea also was to be implemented for basically any kind of purchasing like for groceries/medical/..., but I thought of flaws with my idea.",
            "title_similarity": "0.39567584",
            "sentiment_compound": 0.4854
        },
        {
            "id": "hfo1zsd",
            "score": 1,
            "text": "Absolute genius if you ask me.  A fine should be a deterrent and an actual hardship.  A fine of $100 could RUIN a poor person for months, but a millionaire would just do the same thing every single day and forget they're even paying $100 every time because it's as meaningless as $1.",
            "title_similarity": "0.8237225",
            "sentiment_compound": -0.871
        },
        {
            "id": "hfo2hpd",
            "score": 1,
            "text": "Was the millionaire's speeding more dangerous than an average person? What a ridiculous idea.",
            "title_similarity": "0.6891305",
            "sentiment_compound": -0.7089
        },
        {
            "id": "hfo3k3j",
            "score": -1,
            "text": "Problem with this system is that 5% of anything to a poorer person is still more impactful to their life than a millionaire getting a 5% fine.",
            "title_similarity": "0.7044323",
            "sentiment_compound": -0.5267
        },
        {
            "id": "hfo3qze",
            "score": -1,
            "text": "Idiocy",
            "title_similarity": "0.14290525",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfo4ane",
            "score": -1,
            "text": "So poor people get to live in The Purge while rich people have a nervous breakdown thinking about jaywalking?",
            "title_similarity": "0.5462507",
            "sentiment_compound": -0.2247
        },
        {
            "id": "hfo4t78",
            "score": -1,
            "text": "Sounds great, but isn't this also a incentive for poorer people? Or is there a minimum fine",
            "title_similarity": "0.41708335",
            "sentiment_compound": 0.5789
        },
        {
            "id": "hfo8qh7",
            "score": 1,
            "text": "I like it",
            "title_similarity": "-0.07254417",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hfo99oq",
            "score": 1,
            "text": "nice",
            "title_similarity": "-0.09762296",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hfo9s5l",
            "score": 1,
            "text": "Feel like this would really help balance some budgets.",
            "title_similarity": "0.22932458",
            "sentiment_compound": 0.6697
        },
        {
            "id": "hfocqle",
            "score": -1,
            "text": "Imagine if a store was run that way.  You walk in, try to buy a can of beans.  They demand access to your last 4 paystubs, and your last tax return in order to determine the price. You end up paying $1.  Bill Gates walks in, ends up paying $1000 for that exact same can of beans.  Meanwhile, some other people are walking in, grabbing handfuls of stuff and waking out, not paying a dime because they don't have an income.  Insanity.",
            "title_similarity": "0.68968904",
            "sentiment_compound": -0.6369
        },
        {
            "id": "hfofe59",
            "score": 1,
            "text": "I legit saw people complaining about how such a system isn't equal.\n\nI'm still trying to wrap my head around that one.",
            "title_similarity": "0.3394921",
            "sentiment_compound": -0.2023
        },
        {
            "id": "hfohtry",
            "score": -1,
            "text": "So you get punished harder for being better. Awesome outlook",
            "title_similarity": "0.44296956",
            "sentiment_compound": 0.577
        },
        {
            "id": "hfok8fu",
            "score": -1,
            "text": "So lemme get this straight - as long as I'm a criminal and don't report my earnings, there is no real penalty for speeding?",
            "title_similarity": "0.4667461",
            "sentiment_compound": -0.2488
        },
        {
            "id": "hfol77z",
            "score": 1,
            "text": "Need this in the states",
            "title_similarity": "0.21121964",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfolyek",
            "score": 1,
            "text": "There seems to be quite a few amazing ‘systems’ in Finland.  \n\nGovernments are always wondering how to raise money. This should be added to the list.",
            "title_similarity": "0.5764054",
            "sentiment_compound": 0.6204
        },
        {
            "id": "hfoqgas",
            "score": 1,
            "text": "Lol, does that mean my parking ticket will be $0.45 if I only use like $10.00 per day?",
            "title_similarity": "0.6655626",
            "sentiment_compound": 0.6486
        },
        {
            "id": "hfou4kz",
            "score": 1,
            "text": "This is how it should be worldwide",
            "title_similarity": "0.040667143",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfowkgy",
            "score": -1,
            "text": "Kinda for this. Kinda not. I’d really hate for legislation to, yah know, work, or something...",
            "title_similarity": "0.30838376",
            "sentiment_compound": 0.4964
        },
        {
            "id": "hfowogs",
            "score": 1,
            "text": "We need this in America.",
            "title_similarity": "0.22954509",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfox0fb",
            "score": 1,
            "text": "Very interesting concept that brings up two thought starters:\n\n1. Why are fines unique in this regard? IE should a load of bread cost a rich person more money? If not, why are fines different than goods and services?\n\n2. Not sure if they look at other considerations beyond income but if not that is a gap. A single father of 4 making $50k is under more financial stress than a man making $40k, but who has no kids and whose spouse also works. By using taxable household income it could be a better gauge",
            "title_similarity": "0.7342536",
            "sentiment_compound": -0.2004
        },
        {
            "id": "hfoz83e",
            "score": -1,
            "text": "Billionaires don't have an income, they've got such good tax lawyers. This would be completely ineffective.",
            "title_similarity": "0.593894",
            "sentiment_compound": 0.2748
        },
        {
            "id": "hfozcb7",
            "score": -1,
            "text": "Upon hearing the 100k+ fine,  the millionaires immediately shrugs it off and turn to the politician and says “that’s coming out of your pocket, I mean political donation.”",
            "title_similarity": "0.6769148",
            "sentiment_compound": 0.2023
        },
        {
            "id": "hfp14g4",
            "score": 1,
            "text": "This is a fair system, but sometimes the really rich will \"underestimate\" their income to make the fine lower. They just provide the court an income document from the time they were vacationing in Monte Carlo or some place for a few months. With minimal income during that time, it makes the fine substantially lower.",
            "title_similarity": "0.66743374",
            "sentiment_compound": 0.2857
        },
        {
            "id": "hfp1oe0",
            "score": 1,
            "text": "Most US billionaires have very small paychecks (if any). So they would pay smaller fines than a convenience store clerk.",
            "title_similarity": "0.6398976",
            "sentiment_compound": -0.1689
        },
        {
            "id": "hfp4ywn",
            "score": 1,
            "text": "While I agree with the idea and wouldn't mind seeing it introduced, would this not encourage harassing or targeting high wealth individuals or areas. Why police a lower socioeconomic area when you can police the affluent area where every ticket or fine is going to net the council/government much much more?",
            "title_similarity": "0.66252124",
            "sentiment_compound": 0.6649
        },
        {
            "id": "hfp7dy5",
            "score": 1,
            "text": "What about people with negative income (deep in debt)? Speeding could be profitable for them.",
            "title_similarity": "0.62701464",
            "sentiment_compound": -0.5106
        },
        {
            "id": "hfp8n4w",
            "score": 1,
            "text": "We totally need this in America. Not only based on income but also the value of the car. Enough of spoiled rich teenager going north of 90+ in city limit. People had die because of their recklessness.",
            "title_similarity": "0.7606095",
            "sentiment_compound": 0.3919
        },
        {
            "id": "hfpc7iq",
            "score": 1,
            "text": "We have the same in Sweden too. Its more logical this way.",
            "title_similarity": "0.18700726",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfpdx3m",
            "score": -1,
            "text": "Per this reasoning, should a 20 year old man get twice the prison sentence as a 50 year old men?\n\n% of life left to live as a prison sentence?",
            "title_similarity": "0.6064902",
            "sentiment_compound": -0.7476
        },
        {
            "id": "hfpi04o",
            "score": 1,
            "text": "The biggest hurdle to this being implemented in the US is that we don't have national police (which is a good thing, but that's another topic), and a lot of local police departments are basically funded through tickets. \n\nYou can see this in a lot of places where there are obvious \"speed traps\" along roadways, where the speed limit suddenly goes from 75 to 30 over the course of a mile. (Pro tip to anyone visiting America: if that ever happens, even if you're on a stretch of road where you've seen nobody for an hour, be 100% strict about not going even 1 mph over the speed limit; because there **is** going to be a cop hiding behind some blindspot shortly after the sign.)\n\nThis sort of law sometimes comes up, and people bring up those sorts of situations, and the obvious conclusion that would follow: **cops would start targeting anyone that appears vaguely rich**.\n\nCatching Jeff Bezos going 36 in a 35 zone is more valuable to the department than 100 people going 75 in the same zone trying to not be late to their jobs at his shipping facility. But even ignoring the extremes, it becomes a game of trying to catch the richest person available, instead of traffic enforcement doing its purported job of protecting public safety.\n\nOf course, it *shouldn't work that way in the first place*, but that's a larger problem to solve than just the way traffic tickets are calculated; thus, it never gets done.",
            "title_similarity": "0.72289205",
            "sentiment_compound": 0.9192
        },
        {
            "id": "hfqgzpf",
            "score": 1,
            "text": "gosh, isn't getting rich exactly the point for getting rid of such problems? Damn Finns they are breaking the game",
            "title_similarity": "0.61637956",
            "sentiment_compound": -0.8087
        },
        {
            "id": "hfnt3ez",
            "score": 7,
            "text": "North American pro sports need to adopt this.",
            "title_similarity": "0.2700065",
            "sentiment_compound": 0.1779
        },
        {
            "id": "hfo400v",
            "score": 442,
            "text": "Fines should definitely be based on your net worth or income. They need to hurt.",
            "title_similarity": "0.5226636",
            "sentiment_compound": 0.0516
        },
        {
            "id": "hfo0bzj",
            "score": 208,
            "text": "This is brilliant.",
            "title_similarity": "-0.055718448",
            "sentiment_compound": 0.5859
        },
        {
            "id": "hfnkc93",
            "score": 2,
            "text": "If the person is exempt from taxes (non citizen) or doesn't have an income... then what? Straight to jail?",
            "title_similarity": "0.49156886",
            "sentiment_compound": 0.3939
        },
        {
            "id": "hfnm5pu",
            "score": -2,
            "text": "It's the only logical way to actually hand out fines yet almost nowhere does it.",
            "title_similarity": "0.3949551",
            "sentiment_compound": 0.4939
        },
        {
            "id": "hfnqm9o",
            "score": 2,
            "text": "I'm okay with this. Crimes with fines means everything is legal for a price.",
            "title_similarity": "0.42831072",
            "sentiment_compound": 0.34
        },
        {
            "id": "hfnv5fi",
            "score": 2,
            "text": "This is the way.",
            "title_similarity": "-0.14002031",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfnvpct",
            "score": 2,
            "text": "Good system. For a multimillionaire, a $100.00 fine and a $0.01 fine are pretty much the same. There’s no point hitting them with such small fines. Squeeze the bastards.",
            "title_similarity": "0.6779296",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hfo00mu",
            "score": -2,
            "text": "ITT: people not realizing the effects of such a policy. What happens? Rich citizens are unfairly targeted by law enforcement, simply due to the fact that they are a more profitable endeavor. \n\nOn the flip side: why fine that homeless drunk who took a dump on the sidewalk? He’s not going to be fined anything. It’s not worth my time! \n\nSource: I understand the basic notion of economic incentives.",
            "title_similarity": "0.6666422",
            "sentiment_compound": 0.7077
        },
        {
            "id": "hfo1puc",
            "score": 2,
            "text": "This would be a great system to have in the US but sadly the rich and powerful make the laws and you know they would not let this go through. If you are going to have a Fine system then it should be equal and based off your income rather that set amounts.",
            "title_similarity": "0.62652344",
            "sentiment_compound": 0.8641
        },
        {
            "id": "hfo33bm",
            "score": 2,
            "text": "Rightly so. Otherwise it's just a poor people subjugation system, which I'm sure a certain group of elites like. This seems more equitable, fair and just. If laws exist to deter undesired behaviors then it should seek to deter them equally, regardless of status or wealth.",
            "title_similarity": "0.42424196",
            "sentiment_compound": 0.8214
        },
        {
            "id": "hfo3eh4",
            "score": 2,
            "text": "I would like to add this to the US laws please.",
            "title_similarity": "0.23972371",
            "sentiment_compound": 0.5859
        },
        {
            "id": "hfo3ukt",
            "score": 2,
            "text": "Still, one day's worth could mean one day without food at the end of the month if you're really living paycheck to paycheck. Maybe Finland doesn't have anybody in that situation, I dunno.",
            "title_similarity": "0.60774827",
            "sentiment_compound": 0.2263
        },
        {
            "id": "hfo4f9q",
            "score": 2,
            "text": "This is why people in Finland are so much more unhappy than those in the United States.\n\n/s",
            "title_similarity": "0.58449763",
            "sentiment_compound": -0.1423
        },
        {
            "id": "hfo5snq",
            "score": -2,
            "text": "Yeah it's fucked up that someone broke might pay $150 for a speeding ticket, but that doesn't mean that someone wealthy should pay $100k for a speeding ticket.",
            "title_similarity": "0.7787392",
            "sentiment_compound": -0.1406
        },
        {
            "id": "hfoc1j4",
            "score": 2,
            "text": "That's how it should be. As it is, the poor are punished and have to pay the ticket instead of eating that day and the rich basically pay pocket change to remove themselves from the law.",
            "title_similarity": "0.71154106",
            "sentiment_compound": -0.5106
        },
        {
            "id": "hfom41g",
            "score": -2,
            "text": "TIL?  Really?  On Reddit?  It's mentioned every day.",
            "title_similarity": "0.3658224",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfomkc5",
            "score": -2,
            "text": "This is absurd",
            "title_similarity": "0.08157453",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfook4l",
            "score": -2,
            "text": "So if I am poor and drive over the speed limit with my beat up car, my fine is… what… $1?\n\nSounds good to me!",
            "title_similarity": "0.66077054",
            "sentiment_compound": 0.2244
        },
        {
            "id": "hfor1nr",
            "score": 2,
            "text": "Pro tip: use your wealth to cheat the system. Such as hiring a chauffeur on minimum wage. Have him break any traffic laws to your liking with minimal fines.",
            "title_similarity": "0.64039266",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hfosw3z",
            "score": 2,
            "text": "My friend used to work with someone who consistently drove home blackout wasted all the time.  He had enough money to just blow off any tickets he ever got and it got to a point where cops wouldn't even bother pulling him over anymore",
            "title_similarity": "0.669726",
            "sentiment_compound": 0.2584
        },
        {
            "id": "hfozuz8",
            "score": -2,
            "text": "Billionaires don't have an income, where I'm from. They usually \"earn\" less than your average teacher.",
            "title_similarity": "0.54386216",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfphhev",
            "score": -2,
            "text": "A millionaire getting a $100,000 fine is taking a tenth of everything they own. I like the idea of progressive fines... But should a speeding ticket cost anyone 10% of their net worth?",
            "title_similarity": "0.8600811",
            "sentiment_compound": 0.5423
        },
        {
            "id": "hfpuu9l",
            "score": -2,
            "text": "The only problem with this is, how do you know what one makes… you would need a tax database and give access to traffic department for example. Once you give cross access like this, it slowly breeds corruption",
            "title_similarity": "0.6375155",
            "sentiment_compound": -0.0516
        },
        {
            "id": "hfq34dz",
            "score": 2,
            "text": "What a great idea!  It’s always great when a bloated, corrupt bureaucracy fleeces their own citizenry. I’m sure they’ll put the money they confiscate from successful people to great use!",
            "title_similarity": "0.62186694",
            "sentiment_compound": 0.9637
        },
        {
            "id": "hfq4h9g",
            "score": 2,
            "text": "Nah, not good. I got caught up in this in Germany. It feels pretty sketch when you're getting a ticket and the policeman ask you how much money you make.",
            "title_similarity": "0.6358114",
            "sentiment_compound": 0.1012
        },
        {
            "id": "hfnukql",
            "score": -10,
            "text": "Such a dumbass system, how do you measure wealth?",
            "title_similarity": "0.5149375",
            "sentiment_compound": -0.1027
        },
        {
            "id": "hfnrh52",
            "score": -2,
            "text": "This is all well and good but there are two problems.\n\nA person with $0 income is unstoppable. You can't divide by zero (this is mostly a joke, there is probably a minimum set)\n\nThe second problem is it's still disproportionate. The $10 I would get fined still hurts significantly more than the person fined $100k.\n\nAnd well actually, a third problem. Lie about your income. Make a million, claim 10k, pay the minimum.",
            "title_similarity": "0.8178652",
            "sentiment_compound": -0.8922
        },
        {
            "id": "hfnu2a7",
            "score": -4,
            "text": "Please don't give our US police any more money...They're already corrupt enough with their current funding. I don't care if this money is supposed to go somewhere else, police in the US would absolutely pocket this.",
            "title_similarity": "0.64953583",
            "sentiment_compound": -0.0844
        },
        {
            "id": "hfnu7sd",
            "score": 3,
            "text": "I something is punishable by a fine, it is meant to be illegal for the poor and legal for the rich.",
            "title_similarity": "0.6020229",
            "sentiment_compound": -0.5719
        },
        {
            "id": "hfo8vfq",
            "score": 4,
            "text": "If the punishment for breaking a law is a fine, then that law was put in place to punish poor people. This idea totally helps stop that! Love it.",
            "title_similarity": "0.5520952",
            "sentiment_compound": -0.554
        },
        {
            "id": "hfogeys",
            "score": 4,
            "text": "In the US rich people get off scott free whereas the plebs get one ticket, which are expensive as fuck, and they're trapped into a never ending cycle of debt peonage. \n\nIs that dramatic enough for you? Probably sounds fake to white reddit, but in the darker parts of your country it's pretty real",
            "title_similarity": "0.7707342",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hfp0r2y",
            "score": 4,
            "text": "Just like how in theory the rich should be taxed more and whatnot... The problem is that these laws are very often skirted around within the legal system so the rich don't actually have to pay almost anything when shit comes up.\n\nThe rich are some corrupt and morally dirty people... Sometimes.",
            "title_similarity": "0.71460146",
            "sentiment_compound": 0.6948
        },
        {
            "id": "hfncjsa",
            "score": 25,
            "text": "Finnish gonna fine",
            "title_similarity": "0.17995496",
            "sentiment_compound": 0.2023
        },
        {
            "id": "hfnzal3",
            "score": 105,
            "text": "Amateurs. In Switzerland we have something similar and *on top of that*, if you're speeding above a certain limit, besides losing your license from anywhere from 1 month to *forever* depending how grave was your infraction and also if you've done it before, they will *confiscate your vehicle, sell it at auction and keep the whole money they make* - and you can't bid on it either. Oh and did I mention that there's up to 1 year in jail too? They get medieval on you here. That's why everyone here goes the speed limit, nice and easy.",
            "title_similarity": "0.7678598",
            "sentiment_compound": 0.5267
        },
        {
            "id": "hfnvzie",
            "score": -4,
            "text": "This cannot be true?   WOuld'nt small town law enforcement target expensive vehicles???",
            "title_similarity": "0.53837097",
            "sentiment_compound": -0.5093
        },
        {
            "id": "hfoo2u6",
            "score": -5,
            "text": " become unemployed and I'm basically untouchable. got it.",
            "title_similarity": "0.2515735",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfos31a",
            "score": -4,
            "text": "That's fucking rediculous. Speeding is speeding. What the fuck is wrong with people? This is just discrimination.",
            "title_similarity": "0.5618941",
            "sentiment_compound": -0.765
        },
        {
            "id": "hfq8lzw",
            "score": 5,
            "text": "\nHow this would play out in the US:\n\nBillionaire claims losses on taxes each year. When they get a speeding ticket the government has to give them money..",
            "title_similarity": "0.83455503",
            "sentiment_compound": -0.0772
        },
        {
            "id": "hfo2hb9",
            "score": 35,
            "text": "If this makes sense to you make sure you apply the same understanding to taxes.",
            "title_similarity": "0.3527542",
            "sentiment_compound": 0.3182
        },
        {
            "id": "hfnu4ji",
            "score": 4,
            "text": "We have this in Sweden also.",
            "title_similarity": "0.15933119",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfojck3",
            "score": -5,
            "text": "This is stupid on so many levels. \n\nThe only people who are happy about it are commies.",
            "title_similarity": "0.44695175",
            "sentiment_compound": 0.0772
        },
        {
            "id": "hfojdf7",
            "score": -5,
            "text": "This is stupid on so many levels. \n\nThe only people who are happy about it are commies.",
            "title_similarity": "0.44695175",
            "sentiment_compound": 0.0772
        },
        {
            "id": "hfojeaa",
            "score": -6,
            "text": "This is stupid on so many levels. \n\nThe only people who are happy about it are commies.",
            "title_similarity": "0.44695175",
            "sentiment_compound": 0.0772
        },
        {
            "id": "hforqsb",
            "score": 5,
            "text": "I feel like Scandinavian countries figured out this whole \"human society\" thing way ahead of the rest of us.",
            "title_similarity": "0.38420564",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hfnkiu4",
            "score": 77,
            "text": "Sweden aswell",
            "title_similarity": "0.14116995",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfnow6w",
            "score": 18,
            "text": "I read somewhere that severity of punishment has less of an effect than certainty of punishment. \n\nThis feels like it straddles that point. You may not get a ticket every time you drive, but if you do, it's still going to hurt no matter how much you make.",
            "title_similarity": "0.618155",
            "sentiment_compound": -0.7691
        },
        {
            "id": "hfnxf8x",
            "score": -5,
            "text": "It's a silly system.\n\nDoes a wealthier person get less prison time because their time is more valuable?\n\nIts not like rich people are routinely using roads as racetracks purely because they can afford a fine.  i could maybe see such a regime if this were a big public safety issue and not just a form of socialism and class warfare.",
            "title_similarity": "0.702719",
            "sentiment_compound": 0.2621
        },
        {
            "id": "hfots9g",
            "score": 5,
            "text": "Same in Sweden, the fines are based on the income you earned the year prior. \n\nOne time I got caught with some pot (my first offense) and since I was jobless the year prior (payed zero income taxes), my fine was about 600 SEK (roughly 60 USD). \n\nSame thing happened to a friend of mine (first offense and about the same amount of pot), his income the year prior was average, which is why his fine landed at a hefty 6000 SEK (roughly 600 USD).\n\nIn conclusion, in some instances it payes not to have a job nor pay taxes, folks 🤙🏽 /s.\n\nEdit: Grammar.",
            "title_similarity": "0.72969145",
            "sentiment_compound": 0.7427
        },
        {
            "id": "hfoqj0o",
            "score": 7,
            "text": "Why do the Scandinavian countries do all the smart things like this while we are left with the dumpster fire that is America?",
            "title_similarity": "0.606314",
            "sentiment_compound": 0.296
        },
        {
            "id": "hfp3lk6",
            "score": -9,
            "text": "So the person who does well for themselves gets punished more severely for making the same mistake as someone else, who gets a discount because they did not do as well for themselves.\n\nSeems fair.",
            "title_similarity": "0.5578516",
            "sentiment_compound": -0.7275
        },
        {
            "id": "hfnfmtc",
            "score": 599,
            "text": "At college, I would constantly be late or even miss class because I could never find parking as a commuter. I would always dream of just saying fuck it and parking in a space [I shouldn’t] and accepting the parking ticket fine. \n\nThere was *always* this Porsche that would park in a permitted zone without a permit and they would have parking tickets piled up on their windshield because the fines obviously didn’t bother them. \n\nThe Day-fine system would really help in these situations and I think it would help humble a lot of rich assholes who think they can get away with whatever they want.",
            "title_similarity": "0.6633022",
            "sentiment_compound": 0.5709
        },
        {
            "id": "hfntz8p",
            "score": 9,
            "text": "An interesting sideffect in the US system (where police funding is in part raised by fines and tickets) is that cops might start targeting expensive cars and people who look rich, which raises an interesting alternate reality",
            "title_similarity": "0.71275955",
            "sentiment_compound": 0.8402
        },
        {
            "id": "hfnb6ul",
            "score": 3136,
            "text": "I am 100 percent fine with this. (Fining by percentages)",
            "title_similarity": "0.15987349",
            "sentiment_compound": 0.2023
        },
        {
            "id": "hfnar02",
            "score": 3201,
            "text": "That seems like it could be a pretty good system. The problem with fines for crimes (in most places) is that it disproportionately punishes the poor and the wealthy.\n\nIf someone is regularly dropping $100 on a plate of food at a nice restaurant, a $100 ticket hardly means anything.",
            "title_similarity": "0.7496563",
            "sentiment_compound": 0.6124
        },
        {
            "id": "hfo9a15",
            "score": 91,
            "text": "Fixed fines are just a fee for the rich to break laws. This equalizes the pain and hopefully does a better job of curbing the bad behavior which is the idea.",
            "title_similarity": "0.6002811",
            "sentiment_compound": 0.34
        },
        {
            "id": "hfoy0x8",
            "score": 101,
            "text": "I will always remember my trust funded buddy in college. \n\n\"It's not illegal to walk around town with an open beer, it just costs $150\"\n\n\"Parking in a handicapped spot isn't illegal, it just costs $300\"\n\n\"Dude I can litter here, the worst that happens is I pay $100.\"\n\nWhen the punishment is a fine, it's only a punishment on the poor.",
            "title_similarity": "0.71875834",
            "sentiment_compound": -0.6189
        },
        {
            "id": "hfnbdm7",
            "score": 9005,
            "text": "It is kind of crazy that a simple fine, in america, could be a huge impact on someone poor but chump change for someone rich. \n\nI feel like it’s similar to our elite defense attorneys and someone’s paid for legal team.",
            "title_similarity": "0.7007635",
            "sentiment_compound": 0.8691
        },
        {
            "id": "hfnpr28",
            "score": 307,
            "text": "What if you’re a foreigner and the Finnish government obviously doesn’t know your income, what then?",
            "title_similarity": "0.53794646",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfnqsj3",
            "score": 563,
            "text": "This also exists in Germany we call it Tagessätze.",
            "title_similarity": "0.22962163",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfng72i",
            "score": 3408,
            "text": "I once got 6 day fines and as I was unemployed it added up to 36e",
            "title_similarity": "0.5861371",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfno9yw",
            "score": 4583,
            "text": "There was a story many years ago of a rich guy speeding (I thought in Switzerland) and his ticket was like 400k Swiss franc",
            "title_similarity": "0.748351",
            "sentiment_compound": 0.7269
        },
        {
            "id": "hfnmya2",
            "score": 1,
            "text": "Yup, same thing in Switzerland",
            "title_similarity": "0.09195657",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfnne1l",
            "score": 4,
            "text": "This was introduced in the UK about 30 years ago (as unit fines) by a Conservative government.  It was very quickly repealed once stories about rich people facing large penalties became commonplace with the excuse that some poorer miscreants were unfairly penalized because they didn't fill the forms in properly.",
            "title_similarity": "0.74004203",
            "sentiment_compound": 0.34
        },
        {
            "id": "hfnohxv",
            "score": 1,
            "text": "Question: How would Finland know how much a person makes? Are we talking just salary or what if they make money off things like investments? Are we just talking money earned in Finland because many of the rich make money in other countries?",
            "title_similarity": "0.6972673",
            "sentiment_compound": 0.7677
        },
        {
            "id": "hfnqm4x",
            "score": 1,
            "text": "There are punishments in Germany like that as well, though the most notable offenses entail insulting police men.",
            "title_similarity": "0.51749647",
            "sentiment_compound": -0.6344
        },
        {
            "id": "hfnrdib",
            "score": 1,
            "text": "I love the Finns!!",
            "title_similarity": "0.19798963",
            "sentiment_compound": 0.6988
        },
        {
            "id": "hfnrlos",
            "score": 4,
            "text": "Millionaire to 100000 speed run",
            "title_similarity": "0.5884383",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfns4a2",
            "score": 1,
            "text": "As all fines should be based. If crimes are of the same fiscal numbers for the poor and the rich the poor are the only ones actually receiving any punishment.",
            "title_similarity": "0.63622594",
            "sentiment_compound": -0.7003
        },
        {
            "id": "hfns6nm",
            "score": 1,
            "text": "Oh the fair fine system, I like it.",
            "title_similarity": "0.03929828",
            "sentiment_compound": 0.6808
        },
        {
            "id": "hfnsba0",
            "score": 1,
            "text": "In America this would somehow infuriate some of the poorest people alive...or in a pinch it would be called socialism and the people who are in favor of it would somehow be communists",
            "title_similarity": "0.5763519",
            "sentiment_compound": -0.6124
        },
        {
            "id": "hfnsde9",
            "score": 1,
            "text": "This is how it should be everywhere.\n\nFixed amount fines basically mean the law related only applies to the poor. A fine is supposed to hurt you financially.",
            "title_similarity": "0.62774307",
            "sentiment_compound": -0.6908
        },
        {
            "id": "hfnsngr",
            "score": 39,
            "text": "I recall not long ago hearing on the radio that a woman there got a €175,000 fine for driving too fast in her range rover.",
            "title_similarity": "0.67465734",
            "sentiment_compound": 0.2023
        },
        {
            "id": "hfnt169",
            "score": 1,
            "text": "This is why I pay my chauffeur next to nothing.",
            "title_similarity": "0.29747397",
            "sentiment_compound": -0.1027
        },
        {
            "id": "hfnt9kf",
            "score": 1,
            "text": "I like this system",
            "title_similarity": "-0.042415865",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hfnta08",
            "score": 1,
            "text": "Any flat rate fines are inherently regressive.",
            "title_similarity": "0.52486384",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfntwt8",
            "score": 1,
            "text": "Makes sense. I don't know why we don't do it in America.",
            "title_similarity": "0.2802516",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfnugyk",
            "score": 2,
            "text": "The wealthy consider fines “convenience fees”.",
            "title_similarity": "0.5424296",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hfnv7fn",
            "score": 1,
            "text": "This helped me comprehend how much less money I have. Jesus\n\nIt’s technically fair it’s just so strange to think about. But would bezos, for example, be affected by this? Technically his salary is a lot lower than how much he actually makes",
            "title_similarity": "0.5923569",
            "sentiment_compound": -0.5766
        },
        {
            "id": "hfnvb3m",
            "score": 4,
            "text": "This sounds similar to [Brehon law](https://en.wikipedia.org/wiki/Early_Irish_law) from pre-Norman Ireland. If a wealthy person stole from a poor person, their punishment would be greater than if a poor person stole from a rich person.",
            "title_similarity": "0.65646017",
            "sentiment_compound": -0.2023
        },
        {
            "id": "hfnvfh9",
            "score": 1,
            "text": "Maybe it is because I live in a third world failed state but this sounds insane.\n\nYou are suddenly creating a whole incentives model where bribes to get out of these fines could reach 5 figures. I can only begin to imagine the rampant corruption... \n\nI assume that you believe that your cops are as honest, composed and well trained as the ones from Finland. Just... wow...",
            "title_similarity": "0.7151523",
            "sentiment_compound": 0.926
        },
        {
            "id": "hfnvhap",
            "score": 3,
            "text": "This system also exist in germany, but only on level of monetary criminal punishment. 30 day payments are equal to a month's income. The punishment (if monetary punishment is applicable) will be given out in these day payments.",
            "title_similarity": "0.685041",
            "sentiment_compound": -0.9612
        },
        {
            "id": "hfnvn7z",
            "score": 1,
            "text": "There was a CMV about this and the top comment was that rich men could be targeted by shady authorities that would abuse this system for easy money... So yeah, this system is only fair if you put it in good hands, which sadly is not always the case.",
            "title_similarity": "0.6396283",
            "sentiment_compound": 0.7902
        },
        {
            "id": "hfnvo56",
            "score": 1,
            "text": "Lol, what would they do with my broke ass?",
            "title_similarity": "0.37362278",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hfnvpqb",
            "score": 1,
            "text": "As it should be",
            "title_similarity": "-0.12070594",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfnvv2z",
            "score": 1,
            "text": "Be poor. Commit unlimited crime.",
            "title_similarity": "0.43143797",
            "sentiment_compound": -0.6597
        },
        {
            "id": "hfnvxew",
            "score": 1,
            "text": "Thats a massive improvement but has a flaw that would need to be worked out. Most of the rich keep wealth in assets, it would be hard to gauge what a fine should be.",
            "title_similarity": "0.6818508",
            "sentiment_compound": 0.9354
        },
        {
            "id": "hfnw05g",
            "score": 6,
            "text": "What would it be of Bezos got caught speeding in Finland? It might be enough money to fund a significant portion of Finland's government for a year.",
            "title_similarity": "0.7481016",
            "sentiment_compound": 0.2023
        },
        {
            "id": "hfnw6pt",
            "score": 1,
            "text": "A $100,000 \"day fine\" would mean that they net $36,500,000 per year. I suppose that's still just considered a millionaire, but they'd likely have net worths over $100mil.",
            "title_similarity": "0.7680926",
            "sentiment_compound": 0.1027
        },
        {
            "id": "hfnwc89",
            "score": 1,
            "text": "Wouldn't the ultra-rich just get personal drivers then",
            "title_similarity": "0.5343328",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfnwchf",
            "score": 3,
            "text": "I've always thought that instead of fines, you just accrue penalties.\n\nWhen taxes are collected, you have to pay an increases percentage based on your penalties, or a flat amount, whichever is higher.\n\nObviously this doesn't work well for the ultra-poor, but neither do fines.",
            "title_similarity": "0.72489727",
            "sentiment_compound": -0.1548
        },
        {
            "id": "hfnwdy8",
            "score": 2,
            "text": "Finla d doing government the way it's supposed to",
            "title_similarity": "0.21223184",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfnwhqm",
            "score": 1,
            "text": "A drunk Elon Musk in a Maserati would double the Finnish GDP in one night.",
            "title_similarity": "0.72711396",
            "sentiment_compound": -0.34
        },
        {
            "id": "hfnwkah",
            "score": 1,
            "text": "Well.....he doesn't need to climb the stairs anymore to stack them on the deck",
            "title_similarity": "0.07536438",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfnwoap",
            "score": 1,
            "text": "I want to see Elon Musk get a ticket there",
            "title_similarity": "0.21494453",
            "sentiment_compound": 0.0772
        },
        {
            "id": "hfnwubb",
            "score": 2,
            "text": "Jahas, se ois varmaa taas torille sitte. Älkää ajako ylinopeutta!",
            "title_similarity": "0.16263591",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfnwz53",
            "score": 1,
            "text": "Meanwhile in America.\n\n😆",
            "title_similarity": "0.17548892",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hfnwzx6",
            "score": 1,
            "text": "That's a brilliant idea!",
            "title_similarity": "-0.007943486",
            "sentiment_compound": 0.6239
        },
        {
            "id": "hfnx0b9",
            "score": 1,
            "text": "word",
            "title_similarity": "-0.07186048",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfnx0rq",
            "score": 1,
            "text": "So people just evade audits to hide their true income or have ways to earn money without government knowing about it, big deal. Same thing with taxes in a lot of countries.",
            "title_similarity": "0.62475824",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hfnx3jv",
            "score": 4,
            "text": "In Mexico is called “salarios diarios (day income)”  in construcción we used this kind of fine when the project is not finish at the end date in the contract (if there is no elements to delay the project).  Government used it too (for example to fine bars, restaurants or places where the alcohol sells is involved mostly), normal people is rare.",
            "title_similarity": "0.6035738",
            "sentiment_compound": -0.2944
        },
        {
            "id": "hfnxb7x",
            "score": 1,
            "text": "I remember reading about Teemu Selanne getting a speeding ticket. This all checks out",
            "title_similarity": "0.6226731",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfnxh6b",
            "score": 2,
            "text": "What about unemployed people?",
            "title_similarity": "0.24022005",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfnxj1m",
            "score": 1,
            "text": "what happens if you're poor/homeless or have no income? Is there a base fine you have to pay regardless?",
            "title_similarity": "0.5259908",
            "sentiment_compound": -0.2869
        },
        {
            "id": "hfnxjhb",
            "score": 2,
            "text": "It makes too much damn sense",
            "title_similarity": "0.1854767",
            "sentiment_compound": -0.4019
        },
        {
            "id": "hfnxkiv",
            "score": 1,
            "text": "I remember a few years ago Kimi Raikkonen was pulled over while towing a couple of snow mobiles that weren't secured properly. I think the fine was like 30k euros or something.",
            "title_similarity": "0.6405935",
            "sentiment_compound": 0.2598
        },
        {
            "id": "hfnxndy",
            "score": 1,
            "text": "Learned about this one when hockey star Teemu Selanne got a speeding ticket in the offseason.",
            "title_similarity": "0.6654494",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfnxojq",
            "score": 1,
            "text": "This is such a good idea!!!",
            "title_similarity": "0.0006456617",
            "sentiment_compound": 0.5826
        },
        {
            "id": "hfnxp4r",
            "score": 1,
            "text": "Same system in Germany, \"Tagessatz\", you can either go to jail for x days, or pay a fine based on how much you'd make in x days.",
            "title_similarity": "0.6662518",
            "sentiment_compound": 0.1027
        },
        {
            "id": "hfnxpmo",
            "score": 1,
            "text": "I want to approach this ftrans girl but im afraid help me find hee i seen her in starbucks today https://youtu.be/pX8fwBLM6fA",
            "title_similarity": "0.30035675",
            "sentiment_compound": 0.5719
        },
        {
            "id": "hfnxpy0",
            "score": 1,
            "text": "… and billionaires with offshore accounts would only have to pay $0.01",
            "title_similarity": "0.55515707",
            "sentiment_compound": -0.1027
        },
        {
            "id": "hfnxsxp",
            "score": 1,
            "text": "It's more equitable, but hardly just at all. Someone with six-figure plus disposable income paying a fine is very different than the minimum wage earning single dad who is now going to come up short on rent for the month. \n\nAfter a certain income bracket, these progressive fines are meaningless. You'd have to put these people in jail (losing time) or take away income producing capital (property, stocks, etc.) to actually have meaningful punishment.",
            "title_similarity": "0.7798005",
            "sentiment_compound": -0.6956
        },
        {
            "id": "hfnxzlp",
            "score": 1,
            "text": "have minimum wage chauffeurs speed for you",
            "title_similarity": "0.40481105",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfny0df",
            "score": 1,
            "text": "[deleted]",
            "title_similarity": "0.03025806"
        },
        {
            "id": "hfny3pn",
            "score": 1,
            "text": "America is a Pay to Win game",
            "title_similarity": "0.52169746",
            "sentiment_compound": 0.5267
        },
        {
            "id": "hfny65a",
            "score": 1,
            "text": "Really wish this was the case in the US. Im in a local Miata club and the older dudes have no problem going 20-30+ over the speed limit because they can afford it. Meanwhile those of us without as much disposable income keep it a slow 10 over",
            "title_similarity": "0.6169429",
            "sentiment_compound": 0.6429
        },
        {
            "id": "hfny8a7",
            "score": 1,
            "text": "That’s awesome! Maybe in 50 years they’ll do that here too",
            "title_similarity": "0.27813846",
            "sentiment_compound": 0.6588
        },
        {
            "id": "hfny8hv",
            "score": 1,
            "text": "I've never understood why fines ever need a set rate. Judt as taxes are percentages, everything else shouod be too.",
            "title_similarity": "0.6286457",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfnye42",
            "score": 1,
            "text": "Oh, that's really cool",
            "title_similarity": "-0.099394694",
            "sentiment_compound": 0.3804
        },
        {
            "id": "hfnyhfj",
            "score": 1,
            "text": "In America it's designed to fuck with poor people and be a fee for what a rich person would like to do.",
            "title_similarity": "0.6317735",
            "sentiment_compound": -0.128
        },
        {
            "id": "hfnyhri",
            "score": 1,
            "text": "The way it should be everywhere. Income based fees. Only fair & best way to keep the rich from breaking the law. Can you imagine? $100 speeding fine would be crippling for some but for the rich it would be like throwing a penny at something for the rest of us. However, slap the rich with a $100,000 speeding tickets/other fines & see how quickly they stop breaking the law. Also, what a great money maker for the community too. Instead of milking the lower & middle classes for the fees & fines that run a municipality, do income based fees & fines. Win win all around - except for the rich, but fuck them - they've been paying zero in taxes but hogging all the social benefits for far too long.",
            "title_similarity": "0.83299017",
            "sentiment_compound": 0.9885
        },
        {
            "id": "hfnyjdb",
            "score": 1,
            "text": "damn this is fucking dope",
            "title_similarity": "0.21842083",
            "sentiment_compound": -0.4019
        },
        {
            "id": "hfnyl28",
            "score": 1,
            "text": "I'm glad they set it at \"spend\" and not \"earn\", with how often CEOs cut themselves $1/year paychecks...",
            "title_similarity": "0.66742086",
            "sentiment_compound": 0.2263
        },
        {
            "id": "hfnyzkm",
            "score": 1,
            "text": "Same in many other European countries. Thought it was like that everywhere. Absolute fines make no sense at all.",
            "title_similarity": "0.5201644",
            "sentiment_compound": 0.0772
        },
        {
            "id": "hfnz1kc",
            "score": 1,
            "text": "Except they won't receive those tickets because multi millionaires wouldn't be stupid enough to get taxed personally for a big salary and instead use an offshore shell company to avoid paying taxes.",
            "title_similarity": "0.5443851",
            "sentiment_compound": 0.1471
        },
        {
            "id": "hfnz7ao",
            "score": 1,
            "text": "This is great. Seems an equitable way to deal with these types of fines.",
            "title_similarity": "0.26836392",
            "sentiment_compound": 0.6249
        },
        {
            "id": "hfnz7mv",
            "score": 1,
            "text": "Proportionality is a basic principal of justice. The Finnish way makes perfect sense.",
            "title_similarity": "0.29459727",
            "sentiment_compound": 0.7964
        },
        {
            "id": "hfnzlih",
            "score": 1,
            "text": "Andy Griffith (sheriff of Mayberry) did this to Danny Thomas on an episode of Make Room for Daddy. Always seemed like a stellar way to keep the laws fair for all.",
            "title_similarity": "0.374619",
            "sentiment_compound": 0.5859
        },
        {
            "id": "hfnzmeq",
            "score": 1,
            "text": "Okay and how does this account for rich people that get paid in stock and not-money things?",
            "title_similarity": "0.56356335",
            "sentiment_compound": 0.6705
        },
        {
            "id": "hfnzu52",
            "score": 2,
            "text": "i remember a very wealthy person who when parking in a NO PARKING area. as he walked away someone told him \"you can't park there\"  replied \"sure i can. it just costs me a $100.\"",
            "title_similarity": "0.7333497",
            "sentiment_compound": 0.2869
        },
        {
            "id": "hfo006b",
            "score": 1,
            "text": "Same in Switzerland",
            "title_similarity": "0.04731525",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfo00pe",
            "score": 1,
            "text": "Love it!",
            "title_similarity": "-0.045611076",
            "sentiment_compound": 0.6696
        },
        {
            "id": "hfo01c2",
            "score": 1,
            "text": "Ah, yes your honor, im 40k in debt, so how will you be paying me?",
            "title_similarity": "0.6799623",
            "sentiment_compound": 0.5267
        },
        {
            "id": "hfo01d4",
            "score": 1,
            "text": "that's so elegantly beautiful",
            "title_similarity": "0.02799283",
            "sentiment_compound": 0.8111
        },
        {
            "id": "hfo02ec",
            "score": 1,
            "text": "If the rich person hires a driver, would the day fine be paid based on the driver's salary? They would still be able to speed but aren't really affected by the day fine.",
            "title_similarity": "0.6208805",
            "sentiment_compound": 0.7088
        },
        {
            "id": "hfo05yx",
            "score": 1,
            "text": "What happens if your income is $0?",
            "title_similarity": "0.36538106",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfo06z0",
            "score": 2,
            "text": "Jepskukkuu torille pojat",
            "title_similarity": "0.15239078",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfo09zr",
            "score": 5,
            "text": "This should also be done for corporate fines based on gross revenue.",
            "title_similarity": "0.6002002",
            "sentiment_compound": -0.4767
        },
        {
            "id": "hfo0e3o",
            "score": 1,
            "text": "I remember when I was a kid my dad did construction work for a super rich guy. I got along with his kid so he invited us to his cabin which was a 13hr drive. He literally drove 100-110mph the whole way. He got pulled over 3 times and each time he was fairly arrogant and kind of rude, basically demanding the cop just give him a ticket as quickly as possible to make sure it was underscored that he was completely unrepentant. When asked about it he viewed it more akin to a toll than a fine. “That’s the cost of driving fast”. I have no idea how he had car insurance but it had to be insane",
            "title_similarity": "0.72647786",
            "sentiment_compound": -0.4672
        },
        {
            "id": "hfo0h3n",
            "score": 1,
            "text": "Don't know if it's been mentioned yet, but back in 2000 Teemu Selänne got a speeding ticket for 257 299 Finnish marks (roughly $60000 USD in present day value). He was pretty sore about it.",
            "title_similarity": "0.8281331",
            "sentiment_compound": 0.631
        },
        {
            "id": "hfo0hi3",
            "score": 1,
            "text": "I'm curious what happens to homeless crime then?",
            "title_similarity": "0.38583386",
            "sentiment_compound": -0.296
        },
        {
            "id": "hfo0hqa",
            "score": 1,
            "text": "I was just thinking about this today! And how much better it would be. I had no idea it actually was a real thing.",
            "title_similarity": "0.36175275",
            "sentiment_compound": 0.2481
        },
        {
            "id": "hfo0mpn",
            "score": 1,
            "text": "Would that include income from capital gains like stocks or just base income from their job?",
            "title_similarity": "0.46559262",
            "sentiment_compound": 0.5994
        },
        {
            "id": "hfo0mr9",
            "score": 1,
            "text": "This is the way.",
            "title_similarity": "-0.1400203",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfo0tcn",
            "score": 1,
            "text": "I wonder how Finland defines income. Net? Can I have negative income if I’m starting a business? Does that mean I could use speeding as a source of income? /s",
            "title_similarity": "0.62804645",
            "sentiment_compound": -0.6416
        },
        {
            "id": "hfo0two",
            "score": 5,
            "text": "Day fine....fighter of the night fine.",
            "title_similarity": "0.20072028",
            "sentiment_compound": 0.2023
        },
        {
            "id": "hfo0ul7",
            "score": 1,
            "text": "The way it should be done.",
            "title_similarity": "-0.06643553",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfo0vkr",
            "score": 1,
            "text": "It should be implemented in America. It won't but it should.",
            "title_similarity": "0.25685966",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfo0zw5",
            "score": 1,
            "text": "Based on income, not wealth.  I would prefer the other way around.",
            "title_similarity": "0.25512695",
            "sentiment_compound": -0.3875
        },
        {
            "id": "hfo101e",
            "score": 1,
            "text": "Jeff Bezos probably makes a million a year, or less.",
            "title_similarity": "0.5391209",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfo12z8",
            "score": 1,
            "text": "Perfect.",
            "title_similarity": "-0.11492282",
            "sentiment_compound": 0.5719
        },
        {
            "id": "hfo1335",
            "score": 1,
            "text": "the first and only speeding ticket i ever got was during my first part time job.  it cost me i think $110.  i was pissed because that amounted to almost an entire paycheck.  i really hated that.",
            "title_similarity": "0.7659581",
            "sentiment_compound": -0.8655
        },
        {
            "id": "hfo14j6",
            "score": 1,
            "text": "It sort of balances out the \"laws that require paying a fine if you break it, are basically just saying rich people can do it whenever they want for a small fee\".",
            "title_similarity": "0.6747776",
            "sentiment_compound": 0.6908
        },
        {
            "id": "hfo1gg7",
            "score": 1,
            "text": "Yes please, more of this",
            "title_similarity": "0.020695599",
            "sentiment_compound": 0.6124
        },
        {
            "id": "hfo1h7z",
            "score": 1,
            "text": "and it's still an advantage for rich people since more of your budget is flexible.",
            "title_similarity": "0.46809828",
            "sentiment_compound": 0.7579
        },
        {
            "id": "hfo1sgt",
            "score": 2,
            "text": "Amazing!\n\nWe have minimum-wage days fines, everyone pays as if they earn minimum-wage.\n\nWhen the fines are bigger, they are paid in months.",
            "title_similarity": "0.7075534",
            "sentiment_compound": 0.6239
        },
        {
            "id": "hfo28cl",
            "score": 1,
            "text": "This is the way.",
            "title_similarity": "-0.14002031",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfo2aru",
            "score": 1,
            "text": "This is the way",
            "title_similarity": "-0.1422585",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfo2g0j",
            "score": 1,
            "text": "GOOD!",
            "title_similarity": "-0.08175038",
            "sentiment_compound": 0.4926
        },
        {
            "id": "hfo2gz6",
            "score": 1,
            "text": "I LOVE this with a raging passion",
            "title_similarity": "0.1621936",
            "sentiment_compound": 0.6739
        },
        {
            "id": "hfo2vg7",
            "score": 2,
            "text": "I think people are missing that this is income, and the most wealthy people have very little income with all of their wealth tied up in stocks and other assets, so they probably would get off easy in this system.",
            "title_similarity": "0.60168386",
            "sentiment_compound": 0.8122
        },
        {
            "id": "hfo2vmf",
            "score": 1,
            "text": "Equity!",
            "title_similarity": "0.021404434",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfo3g4r",
            "score": 3,
            "text": "Really changing the saying, “If the penalty for a crime is a fine, then that law only exists for the lower class”",
            "title_similarity": "0.5471252",
            "sentiment_compound": -0.7845
        },
        {
            "id": "hfo3j9v",
            "score": 1,
            "text": "NHL player Rasmus Ristolainen got a speeding ticket for $135,000",
            "title_similarity": "0.7658556",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfo3m00",
            "score": 1,
            "text": "Do they do EVERYTHING right?",
            "title_similarity": "0.027381957",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfo3raf",
            "score": 1,
            "text": "This occurred to me back in high school and our system here in the US has disgusted me ever since.  There's clearly a more equitable way of doing things, yet we choose the one that fucks the poor the hardest.\n\n'Murica",
            "title_similarity": "0.5944024",
            "sentiment_compound": -0.7845
        },
        {
            "id": "hfo3usz",
            "score": 1,
            "text": "Agree with this method. Rich ass holes always speeding because “their time is worth more than lost on a ticket”",
            "title_similarity": "0.68938917",
            "sentiment_compound": 0.2315
        },
        {
            "id": "hfo3zqc",
            "score": 1,
            "text": "It says its based on income but won't that hurt working class people the most? What about the ultra-rich who don't work or have daily incomes? How do they calculate that?",
            "title_similarity": "0.6317687",
            "sentiment_compound": 0.6374
        },
        {
            "id": "hfo47j9",
            "score": 1,
            "text": "Interesting",
            "title_similarity": "-0.026839329",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hfo48yq",
            "score": 1,
            "text": "Finnish Fining at its finest",
            "title_similarity": "0.2963982",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfo4b4i",
            "score": 1,
            "text": "I got pulled over once in Finland and the police officer forced me to give an estimate even though I told him I was a student and hadn’t received my summer job contract yet. Ended up forcing me to pay ~360€",
            "title_similarity": "0.641783",
            "sentiment_compound": -0.5267
        },
        {
            "id": "hfo4e6y",
            "score": 2,
            "text": "My boss coped a 45k fine when I was living there. It was the talk of the town for weeks.",
            "title_similarity": "0.47744945",
            "sentiment_compound": 0.2023
        },
        {
            "id": "hfo4jkp",
            "score": 1,
            "text": "S/ Well, this is just unAmerican.",
            "title_similarity": "-0.02957468",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hfo4l5y",
            "score": 1,
            "text": "I think I'd just hire a chauffeur if i could",
            "title_similarity": "0.26630935",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfo4li5",
            "score": 1,
            "text": "I always remember my father stressing to me, \"life isn't fair.\" But like, why not?",
            "title_similarity": "0.45525062",
            "sentiment_compound": -0.5988
        },
        {
            "id": "hfo4nn1",
            "score": 1,
            "text": "Fine the rich",
            "title_similarity": "0.23097342",
            "sentiment_compound": 0.6597
        },
        {
            "id": "hfo4pt2",
            "score": 1,
            "text": "seeking for a friend",
            "title_similarity": "0.030615758",
            "sentiment_compound": 0.4939
        },
        {
            "id": "hfo50n7",
            "score": 1,
            "text": "*Cocks shotgun* smells like curmurnusm!",
            "title_similarity": "0.42292368",
            "sentiment_compound": 0.4199
        },
        {
            "id": "hfo50op",
            "score": 1,
            "text": "I wasn't aware of that, but I have often thought that we needed something similar here in the US.",
            "title_similarity": "0.24369115",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfo5a8m",
            "score": 1,
            "text": "Seriously every other country seems to have figured out how to run better than the US. God I hate it here.",
            "title_similarity": "0.55331475",
            "sentiment_compound": -0.1027
        },
        {
            "id": "hfo5b6r",
            "score": 1,
            "text": "Laws that have monetary punishments are only laws for poor people",
            "title_similarity": "0.42669415",
            "sentiment_compound": -0.7096
        },
        {
            "id": "hfo5jdn",
            "score": 1,
            "text": "So if you have no income you pay . . . ?",
            "title_similarity": "0.3533145",
            "sentiment_compound": -0.3818
        },
        {
            "id": "hfo5muc",
            "score": 1,
            "text": "Every time I hear about Finland \nIt seems better and better",
            "title_similarity": "0.3318406",
            "sentiment_compound": 0.7003
        },
        {
            "id": "hfo5tlj",
            "score": 3,
            "text": "That is a pretty good idea. Some state try this and report back.",
            "title_similarity": "0.21149069",
            "sentiment_compound": 0.7269
        },
        {
            "id": "hfo68pm",
            "score": 1,
            "text": "I wish this could be implemented in the US but the tax system and finding peoples income bracket is already so hard.\n\nI wish funding the IRS wasn’t political suicide",
            "title_similarity": "0.68789005",
            "sentiment_compound": -0.5795
        },
        {
            "id": "hfo6eco",
            "score": 1,
            "text": "That makes sense. After all, a fine that could destroy a clerk is nothing to a millionaire.",
            "title_similarity": "0.51671296",
            "sentiment_compound": -0.4019
        },
        {
            "id": "hfo6ixi",
            "score": 1,
            "text": "I did the math in my state, out of curiosity.  A parking ticket in Providence is $25.  To the average Rhode Islander, that's 90 minutes of work.  To the top 5% RI earners, it's 8.39 minutes.  For the top 1%, it's 2.37.   \n\nTime is the closest thing we have to a resource that's handed out equally among people living in the same area.  Even then, lower income correlates (along with other factors like race) to lower life expectancy - so 90 minutes from an average poor person equates to a larger portion of their life than that same 90 minutes from a wealthy one.  \n\nTwo people let the meter run out.  One loses a movie's length of time, the other loses a song's length.  A short one.",
            "title_similarity": "0.7244368",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hfo6l4b",
            "score": 1,
            "text": "How does the system work? Like how does it check your income?",
            "title_similarity": "0.3812958",
            "sentiment_compound": 0.4329
        },
        {
            "id": "hfo6lps",
            "score": 1,
            "text": "How is insurance handled there, though? In the states, the fine is sometimes secondary to what insurance might cost if I rack up another ticket - even if I get the points removed from the state DOT registrar. Not to mention at one point between my dad and I our family had to change insurerers.... Oh to be a teenager and on my parents auto insurance again...",
            "title_similarity": "0.66111314",
            "sentiment_compound": 0.2023
        },
        {
            "id": "hfo6nhj",
            "score": 1,
            "text": "Finnish fair fines",
            "title_similarity": "0.48382556",
            "sentiment_compound": 0.3182
        },
        {
            "id": "hfo6y8u",
            "score": 1,
            "text": "As should be your taxes",
            "title_similarity": "0.3396989",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfo711z",
            "score": 1,
            "text": "We need this here in the United States.",
            "title_similarity": "0.19292134",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hfo78dg",
            "score": 1,
            "text": "Brilliant!  Im going to guess they don’t have nearly as bad of a poverty and homeless problem as we have here in the states.  Yup, google says [it’s half](https://www.washingtonpost.com/business/2020/02/03/finland-american-dream/?outputType=amp).",
            "title_similarity": "0.5480691",
            "sentiment_compound": -0.7177
        },
        {
            "id": "hfo79km",
            "score": 1,
            "text": "Thing with this is the rich people have the wealth to just kinda leave and take their business elsewhere where they can do whatever they want again",
            "title_similarity": "0.47461855",
            "sentiment_compound": 0.8016
        },
        {
            "id": "hfo7izd",
            "score": 1,
            "text": "It’s not just Finland that does this",
            "title_similarity": "0.19117785",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfo7jku",
            "score": 1,
            "text": "What about people who make money “under the table” ?",
            "title_similarity": "0.36559093",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfo7kwo",
            "score": 1,
            "text": "As things should be. Because otherwise, fines are just fees you have to pay that allow you to do something illegal if you're rich.",
            "title_similarity": "0.66008985",
            "sentiment_compound": 0.128
        },
        {
            "id": "hfo7vai",
            "score": 1,
            "text": ">most infractions are fined based on what you could spend in a day based on your income\n\nI understand fining people based on what they earn but earnings and expenditures are not necessarily related. Someone might be in the midst of paying back a lot of debt and not spending much. Or a company owner might be living high on the hog but writing off huge amount of money as business expense while only drawing a modest salary.\n\nI'm fine with using day-fine as the base penalty but I think a judge should be able to adjust.",
            "title_similarity": "0.7437855",
            "sentiment_compound": -0.4767
        },
        {
            "id": "hfo84pe",
            "score": 1,
            "text": "I think this is a great system.\n\nThe loophole that immediately comes to mind, and I don't think that there will be too many abusers, is the one where the millionaire and/or drug dealer who makes crazy money but hides it or lies about it or makes it under the table looks like they make very little money while they go speeding in their Ferraris.\n\nThat would drive me crazy, but hey you take the bad with the good I guess",
            "title_similarity": "0.67899513",
            "sentiment_compound": -0.7391
        },
        {
            "id": "hfo8a6k",
            "score": 1,
            "text": "This makes so much more sense than hammering everyone with the same fines. With flat fines, all too often, What amounts to a fly landing on one man’s wrist is life-altering to another.",
            "title_similarity": "0.6060264",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfo916t",
            "score": 7,
            "text": "I remember barley being able to afford speeding tickets when I was in my early 20s and in college.  I got one in my mid 30s once I was full time employed and felt like it was a joke.",
            "title_similarity": "0.6714967",
            "sentiment_compound": 0.5719
        },
        {
            "id": "hfo9jwk",
            "score": 1,
            "text": "finnish fine is fun to say",
            "title_similarity": "0.24914427",
            "sentiment_compound": 0.6249
        },
        {
            "id": "hfo9q47",
            "score": 1,
            "text": "BUT MY FLAT RATE<!!!!!>!@3!!1!!",
            "title_similarity": "0.2267842",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfo9vhc",
            "score": 1,
            "text": "And what stops the LAPD from just hanging out in bel-air?",
            "title_similarity": "0.30888015",
            "sentiment_compound": -0.1531
        },
        {
            "id": "hfoabdw",
            "score": 2,
            "text": "*$100,000+",
            "title_similarity": "0.52720475",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfoaf4g",
            "score": 1,
            "text": "Former Nokia Employee here. Anssi Vanjoki, where are you?",
            "title_similarity": "0.19748595",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfoayph",
            "score": 1,
            "text": "This is the way.",
            "title_similarity": "-0.1400203",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfob5cg",
            "score": 1,
            "text": "This is so smart, what a great concept",
            "title_similarity": "0.056844287",
            "sentiment_compound": 0.822
        },
        {
            "id": "hfobpgp",
            "score": 1,
            "text": "Everything I read about Finland makes me want to move there.",
            "title_similarity": "0.3881106",
            "sentiment_compound": 0.0772
        },
        {
            "id": "hfoc42p",
            "score": 1,
            "text": "🥺🥺🥺",
            "title_similarity": "-0.069000065",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfoc8kg",
            "score": 1,
            "text": "The rich will still circumvent what they truly deserve based off their ability to navigate offshore taxes.",
            "title_similarity": "0.5303025",
            "sentiment_compound": 0.8316
        },
        {
            "id": "hfoceca",
            "score": 3,
            "text": "If you think it’s unethical to fine a rich man $100,000 then you should also think it unethical to fine a poor man $1,000.",
            "title_similarity": "0.7500852",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hfocpph",
            "score": 1,
            "text": "When fines can just be part of the budget or \"cost of operation\" something is very wrong with the system.",
            "title_similarity": "0.5843034",
            "sentiment_compound": -0.5256
        },
        {
            "id": "hfocpxm",
            "score": 1,
            "text": "I like how they use gross income instead of taxable income, otherwise the ultra rich will be paying pennies because their taxable income are a joke",
            "title_similarity": "0.5939647",
            "sentiment_compound": 0.6369
        },
        {
            "id": "hfod0ps",
            "score": 1,
            "text": "I live in Canada, but I'm tempted to move to Finland the more I hear about it.",
            "title_similarity": "0.37322637",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfodmhd",
            "score": 1,
            "text": "But doesn’t that punish the “job creators”? Also, what happened to that term?",
            "title_similarity": "0.40631872",
            "sentiment_compound": -0.7149
        },
        {
            "id": "hfodsqz",
            "score": 1,
            "text": "Didn't Teemu Selanne get crushed by this?",
            "title_similarity": "0.31452423",
            "sentiment_compound": -0.4215
        },
        {
            "id": "hfoduwh",
            "score": 1,
            "text": "Traffic infractions should never be fines. They should always be ‘points’ against you license. Otherwise tickets just before a revenue source (which is how they are treated) instead of traffic enforcement.",
            "title_similarity": "0.38596082",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfoec25",
            "score": 1,
            "text": "So if Elion Musk got 10 day-fines it would be 4,1 billion. Did I calculate that wrong? 4,1 billion!?",
            "title_similarity": "0.70271575",
            "sentiment_compound": -0.5792
        },
        {
            "id": "hfoedyp",
            "score": 1,
            "text": "I wish american fines worked in a similar way.",
            "title_similarity": "0.3821028",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hfoee3c",
            "score": 2,
            "text": "Getting hit in the pocket makes more of an impression than a vacation at a white collar prison or house arrest.",
            "title_similarity": "0.5893913",
            "sentiment_compound": -0.5478
        },
        {
            "id": "hfoeh64",
            "score": 1,
            "text": "Omg",
            "title_similarity": "-0.07783655",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfoewn5",
            "score": 1,
            "text": "Some might say - \"Holup.  Is this what I would spend in a day, or my spouse who gets daily Amazon deliveries??\"",
            "title_similarity": "0.49964428",
            "sentiment_compound": 0.264
        },
        {
            "id": "hfoezen",
            "score": 1,
            "text": "Not... a terrible idea...",
            "title_similarity": "0.12306244",
            "sentiment_compound": 0.3724
        },
        {
            "id": "hfofdw4",
            "score": 1,
            "text": "TBH I think this is probably good? Tenatively? Like, there are so many laws that are basically just for poor people.",
            "title_similarity": "0.50313157",
            "sentiment_compound": 0.3939
        },
        {
            "id": "hfofnvq",
            "score": 2,
            "text": "If the penalty for something is just a fine, it’s only going to effect the poor.",
            "title_similarity": "0.44596314",
            "sentiment_compound": -0.6486
        },
        {
            "id": "hfogvfi",
            "score": 1,
            "text": "So earn nothing and break the law. Got it",
            "title_similarity": "0.23960286",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfohf4l",
            "score": 1,
            "text": "Kimi Raikkonen is going to go broke",
            "title_similarity": "0.46536955",
            "sentiment_compound": -0.4215
        },
        {
            "id": "hfohg97",
            "score": 1,
            "text": "It sounds like the answer to us Americans, but it's not.  I mean it can't hurt, but all that would happen is Mr.Multimillionaire will have a nice thick envelope inside his glove compartment, or if he is above bribery and tries to enforce the fine, he will be fired and black balled by his community the next day and probably worse.",
            "title_similarity": "0.69933736",
            "sentiment_compound": 0.068
        },
        {
            "id": "hfoi69z",
            "score": 1,
            "text": "The dollar sign goes before the number.",
            "title_similarity": "0.38492247",
            "sentiment_compound": 0.0772
        },
        {
            "id": "hfoiqsu",
            "score": 3,
            "text": "It's a good system, one that *should* be implemented in the U.S. as a matter of course.",
            "title_similarity": "0.19264542",
            "sentiment_compound": 0.4588
        },
        {
            "id": "hfoivp3",
            "score": 1,
            "text": "I think this is a really good idea, especially for stupid non-violent crimes.",
            "title_similarity": "0.32812113",
            "sentiment_compound": -0.1243
        },
        {
            "id": "hfoj8ur",
            "score": 1,
            "text": "This is the way.",
            "title_similarity": "-0.1400203",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfoja4x",
            "score": 1,
            "text": "The fact that this isn't how it works everywhere means that those countries knowingly only apply those laws to non-rich people...",
            "title_similarity": "0.46453083",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfoja50",
            "score": 3,
            "text": "This is the way.",
            "title_similarity": "-0.1400203",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfojoi2",
            "score": 1,
            "text": "They replaced a perfectly good poor-suppressant system with a justice system!? Idiots!",
            "title_similarity": "0.40193367",
            "sentiment_compound": 0.9018
        },
        {
            "id": "hfok9s3",
            "score": 1,
            "text": "You sir, kick ass!",
            "title_similarity": "0.2853725",
            "sentiment_compound": -0.5848
        },
        {
            "id": "hfokfdi",
            "score": 1,
            "text": "I don't think they drive themselves they probably pay somebody minimum wage to drive them.",
            "title_similarity": "0.48233312",
            "sentiment_compound": -0.1027
        },
        {
            "id": "hfokgbo",
            "score": 1,
            "text": "I have thought about this a lot- I’m glad to see it’s being done somewhere.\n\nA millionaire getting the same fine as some below the poverty line is non-sense. Fine’s should be equal for all.",
            "title_similarity": "0.5237586",
            "sentiment_compound": 0.128
        },
        {
            "id": "hfol892",
            "score": 1,
            "text": "Need this in the states",
            "title_similarity": "0.21121964",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfolxaf",
            "score": 1,
            "text": "There seems to be quite a few amazing ‘systems’ in Finland.  \n\nGovernments are always wondering how to raise money. This should be added to the list.",
            "title_similarity": "0.5764054",
            "sentiment_compound": 0.6204
        },
        {
            "id": "hfom196",
            "score": 3,
            "text": "I love this. When laws aren’t just a poor tax.",
            "title_similarity": "0.35726458",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hfom1jt",
            "score": 4,
            "text": "If the penalty for breaking the law is a set fine then that law doesn't apply to the wealthy",
            "title_similarity": "0.54894185",
            "sentiment_compound": 0.0772
        },
        {
            "id": "hfommbc",
            "score": 4,
            "text": "Why isn’t this implemented in other countries? Seems like a pretty good system",
            "title_similarity": "0.25199443",
            "sentiment_compound": 0.8225
        },
        {
            "id": "hfomwl5",
            "score": 1,
            "text": "So you're saying they ... Tax the rich?",
            "title_similarity": "0.5611376",
            "sentiment_compound": 0.5574
        },
        {
            "id": "hfon9tb",
            "score": 1,
            "text": "Does that mean if you don’t have money you can break all the rules?",
            "title_similarity": "0.5762745",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfon9wz",
            "score": 1,
            "text": "Parity is more important than equality.",
            "title_similarity": "0.35294798",
            "sentiment_compound": 0.2716
        },
        {
            "id": "hfonawa",
            "score": 1,
            "text": "Parity is more important than equality.",
            "title_similarity": "0.35294798",
            "sentiment_compound": 0.2716
        },
        {
            "id": "hfoo93t",
            "score": 1,
            "text": "Is this day advertised?",
            "title_similarity": "0.07621711",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfoog1r",
            "score": 1,
            "text": "It’s the same in Mexico, they fine you based on days of salary of your salary when you committed the crime.",
            "title_similarity": "0.5353089",
            "sentiment_compound": -0.1531
        },
        {
            "id": "hfoohaz",
            "score": 1,
            "text": "It’s the same in Mexico, they fine you based on days of salary of your salary when you committed the crime.",
            "title_similarity": "0.5353089",
            "sentiment_compound": -0.1531
        },
        {
            "id": "hfop1r4",
            "score": 1,
            "text": "So I guess, here in Houston, all the paper plate tickets get what... A free pass? 9/10 if I'm getting passed, it's by an Altima. The Corvette is in the corner focusing on gas mileage haha.",
            "title_similarity": "0.5766634",
            "sentiment_compound": 0.743
        },
        {
            "id": "hfop8tq",
            "score": 3,
            "text": "I used to work as an auto detailer. One of my regulars was always getting various parking tickets because he intentionally park illegally. Or he'd speed, or whatever. He was rich enough to consider  them \"convenience fees\".",
            "title_similarity": "0.65889",
            "sentiment_compound": 0.5574
        },
        {
            "id": "hfopc7o",
            "score": 1,
            "text": "It makes sense, but it's still a harsher penalty for the poor. I wish there was a more equitable way to punish people for minor crimes but I don't think anyone has come up with one. \n\nEven though 100k is absolutely more money than the 1k a poorer person might pay, the rich guy gives up some luxuries (if that money even effects him) while the poor person may have to go without food or rent.",
            "title_similarity": "0.7674657",
            "sentiment_compound": -0.9559
        },
        {
            "id": "hfopffc",
            "score": 1,
            "text": "I heard a story about some Finnish student who triggered a fire alarm as a prank knowing that the fine would be tiny since he was broke as fuck. Then the fine actually happened to be huge because his rich uncle secretly made a pretty big bank account on his behalf in order to avoid taxes. Don't know if the story is true, I'm selling it for what I bought it for.",
            "title_similarity": "0.7240014",
            "sentiment_compound": 0.296
        },
        {
            "id": "hfoq2pp",
            "score": 2,
            "text": "We have the same system in Mexico, but I do not think we have the integrity to maintain it",
            "title_similarity": "0.40504748",
            "sentiment_compound": 0.5267
        },
        {
            "id": "hfoq7pm",
            "score": 1,
            "text": "How it should be",
            "title_similarity": "-0.12961543",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfoqsnl",
            "score": 3,
            "text": "US needs that ASAP, we'd pay off national debt in 5 years",
            "title_similarity": "0.52711606",
            "sentiment_compound": -0.4404
        },
        {
            "id": "hfor1i9",
            "score": 3,
            "text": "I am poor and have to borrow money to pay a $100 speeding ticket for going *3 miles over the speed limit* (it was on a highway too, the speed limit over the county line a couple miles ahead also changed to 80 mph). It was in another state so I can’t even fight it, it’d cost me more to fight it than to pay it. I’d much rather have fines be a percentage than a set amount.",
            "title_similarity": "0.82361877",
            "sentiment_compound": -0.8548
        },
        {
            "id": "hfordqz",
            "score": 2,
            "text": "What keeps this from being implemented in the US?",
            "title_similarity": "0.21500413",
            "sentiment_compound": 0.0
        },
        {
            "id": "hforqv7",
            "score": 3,
            "text": "Fucking amazing.",
            "title_similarity": "0.008531608",
            "sentiment_compound": 0.624
        },
        {
            "id": "hforxvr",
            "score": 1,
            "text": "Taking \"do what you can afford to a new level\", I like it.",
            "title_similarity": "0.25045323",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hfotavg",
            "score": 1,
            "text": "This makes that Top Gear Episode make way more sense, they wouldn't film car scenes there because of the fines",
            "title_similarity": "0.5185106",
            "sentiment_compound": 0.2023
        },
        {
            "id": "hfotoil",
            "score": 2,
            "text": "US too now please.",
            "title_similarity": "-0.03151398",
            "sentiment_compound": 0.3182
        },
        {
            "id": "hfotuq3",
            "score": 1,
            "text": "I was just thinking about this a couple weeks ago. If you're richer you have the freedom to speed, park wherever, and break the law because you're not worried about the small fines. Whereas if you're poorer, you're more fearful of breaking the law and having to pay those fines.",
            "title_similarity": "0.65913284",
            "sentiment_compound": 0.4758
        },
        {
            "id": "hfotvz8",
            "score": 1,
            "text": "\\- Now, when ya gonna learn?\r  \n\\- Big and Little Enos Burdette make that same bet with every gearjammer they can.  \nRich people getting poor people to do their dirty illegal work, cause it cost less than if they got caught :-D",
            "title_similarity": "0.67449844",
            "sentiment_compound": -0.2422
        },
        {
            "id": "hfou906",
            "score": 2,
            "text": "What a great message, \"Don't speed here\" I love it!",
            "title_similarity": "0.17249054",
            "sentiment_compound": 0.8622
        },
        {
            "id": "hfoufnw",
            "score": 2,
            "text": "Wow a law/punishment that actually makes sense!",
            "title_similarity": "0.14820641",
            "sentiment_compound": 0.6239
        },
        {
            "id": "hfouryt",
            "score": 2,
            "text": "That seems fair. Like literally its definition.",
            "title_similarity": "-0.0034029912",
            "sentiment_compound": 0.5859
        },
        {
            "id": "hfouwx3",
            "score": 1,
            "text": "Meanwhile on r/unpopularopinion \n\nHow would you feel about a fine system that takes your income into account.",
            "title_similarity": "0.44995365",
            "sentiment_compound": 0.2023
        },
        {
            "id": "hfovo2t",
            "score": 1,
            "text": "This is the way to do it",
            "title_similarity": "-0.071067736",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfowaz1",
            "score": 1,
            "text": "This is why my company is buying all my Starbucks' - less money spend by me",
            "title_similarity": "0.54245603",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfowmqx",
            "score": 1,
            "text": "This is the way",
            "title_similarity": "-0.1422585",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfp02od",
            "score": 1,
            "text": "Doesnt germany already have a 10% fine for excessive speeding?",
            "title_similarity": "0.8074441",
            "sentiment_compound": 0.2023
        },
        {
            "id": "hfp1dpq",
            "score": 3,
            "text": "I was once sentenced to 30 days in jail for having a cracked windshield...  Didn't have $100 to fix it before my court date, judge chewed my ass for not having it repaired and imposed a $300 fine.  \n\nI asked him how I was supposed to ever get it fixed if I was now $300 in the hole with the court, and wouldn't have the money to get a windshield for months while I was trying to pay the fine.\n\nHe says \"ok, 30 days in jail\", and I just kinda shrugged as if to say \"fuck it\", and I guess he grew some common sense or something, because he deferred the sentence on the condition that I get it fixed in that 30 days.  \n\nTook a trip to the pawn shop to get screwed over on interest, and was a $200 windshield, but fuck it, I didn't go to jail I guess :/\n\nWrite me a $300 ticket now and I'll literally just lol and pay it that same day, no fucks given.  \n\nFlat fines are most definitely not a fair system...",
            "title_similarity": "0.7510449",
            "sentiment_compound": -0.4446
        },
        {
            "id": "hfp1ykd",
            "score": 1,
            "text": "Rasmus Ristolainen (plays hockey for Flyers, fitting team name btw) is the current record holder with a 120k€ fine. Anssi Vanjoki, one of the Nokia bosses got a fine of over 100k€ too.",
            "title_similarity": "0.6981243",
            "sentiment_compound": 0.5574
        },
        {
            "id": "hfp27ra",
            "score": 3,
            "text": "Day-fine... AaaaAAAaaah, fighter of the night-crime... AaAaaaaaAAAAAaaahh",
            "title_similarity": "0.3403292",
            "sentiment_compound": 0.1531
        },
        {
            "id": "hfp2e4t",
            "score": 1,
            "text": "I fucking love it. That makes so much more sense.",
            "title_similarity": "0.11173739",
            "sentiment_compound": 0.6697
        },
        {
            "id": "hfp2xam",
            "score": 1,
            "text": "Be filthy rich + pay someone a misery to drive yourself everywhere = enjoy the low-cost fines while being filthy rich 8)",
            "title_similarity": "0.6490654",
            "sentiment_compound": 0.8481
        },
        {
            "id": "hfp2zv8",
            "score": 1,
            "text": "How to actually tax rich people, catch their ass speeding in 4 k",
            "title_similarity": "0.7620211",
            "sentiment_compound": 0.0258
        },
        {
            "id": "hfp3fkt",
            "score": 1,
            "text": "Finnish be like : Ya grounded",
            "title_similarity": "0.22772542",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hfp3ioz",
            "score": 1,
            "text": "In 2019 the NHL hockey star Rasmus Ristolainen was given 120,000 € (138,666 $) fine for driving 50 mph In a 25 mph zone In Turku, Finland. It was 40 \"day fines\" but since his I come was so high thats why the fine was so huge.",
            "title_similarity": "0.8069986",
            "sentiment_compound": 0.7175
        },
        {
            "id": "hfp3o37",
            "score": 2,
            "text": "Gangsta.",
            "title_similarity": "0.227216",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfp3qnz",
            "score": 1,
            "text": "This makes sense. It's the only way to stop individuals and entities from looking at fines as the cost of doing business.",
            "title_similarity": "0.43502316",
            "sentiment_compound": -0.296
        },
        {
            "id": "hfp41ok",
            "score": 3,
            "text": "This is not unique to Finland. Denmark, Estonia, France, Germany, Sweden, Switzerland, and Macao all use the same system.",
            "title_similarity": "0.16512278",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfp4akq",
            "score": 1,
            "text": "We have a progressive tax system up to a point, so it makes sense that you also pay tickets according to your salary.",
            "title_similarity": "0.5120127",
            "sentiment_compound": -0.1027
        },
        {
            "id": "hfp4as5",
            "score": 1,
            "text": "Welcome to the Thunderdome.",
            "title_similarity": "0.21600787",
            "sentiment_compound": 0.4588
        },
        {
            "id": "hfp5hic",
            "score": 2,
            "text": "As it should be. If the penalty for the crime is a ticket, then it's only illegal for the poors - some vise man",
            "title_similarity": "0.5131054",
            "sentiment_compound": -0.8779
        },
        {
            "id": "hfp5rhe",
            "score": 1,
            "text": "It's a pity the weather is so shit in Finland, they do a lot of things right.",
            "title_similarity": "0.5533085",
            "sentiment_compound": -0.7793
        },
        {
            "id": "hfp63no",
            "score": 1,
            "text": "What if you have no incomes?",
            "title_similarity": "0.18852359",
            "sentiment_compound": -0.296
        },
        {
            "id": "hfp68g2",
            "score": 1,
            "text": "It's cheaper near the big city by me to speed than in the country areas.  Almost twice as much for the same speeding infraction.  There's literally no consistency.  I looked at the list of fines and DUI charges were actually less than the Speeding infractions. Then they give you at most 2 weeks to come up with hundreds of dollars or you can have a warrant issued for your arrest.",
            "title_similarity": "0.81620383",
            "sentiment_compound": -0.6908
        },
        {
            "id": "hfp6alz",
            "score": 2,
            "text": "Makes sense. Punitive measures like this are only really a punishment for the poor, unless it's adjusted for income or wealth.",
            "title_similarity": "0.45734033",
            "sentiment_compound": -0.6344
        },
        {
            "id": "hfp6tap",
            "score": 1,
            "text": "As it should be",
            "title_similarity": "-0.12070594",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfp702d",
            "score": 1,
            "text": "Imagine sticking up for millionaires when you probably make well under what would actual effect this system. My 100$ is not the same to a millionaire so why would he care about any fines from speeding or any other monetary fee.",
            "title_similarity": "0.7915804",
            "sentiment_compound": 0.6486
        },
        {
            "id": "hfp7b7z",
            "score": 1,
            "text": "This has been in place for years",
            "title_similarity": "0.048944157",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfp879l",
            "score": 2,
            "text": "If they got Elon Musk last year he'd be fined like 300 million dollars",
            "title_similarity": "0.7558604",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hfp8uuh",
            "score": 5,
            "text": "So you mean how fines should actually work rather than them just being the price of doing things when you're rich?",
            "title_similarity": "0.58932173",
            "sentiment_compound": 0.5574
        },
        {
            "id": "hfp9mqw",
            "score": 1,
            "text": "Finland, Sweden, and Medicine Hat seem to know what’s up.\n\nWish Ontario would follow.",
            "title_similarity": "0.25960967",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hfp9ulu",
            "score": 2,
            "text": "Wish we could have this in America but then it would punish everyone more fairly instead of just punishing the poor",
            "title_similarity": "0.55937505",
            "sentiment_compound": -0.93
        },
        {
            "id": "hfpaa15",
            "score": 1,
            "text": "And that makes perfect sense.",
            "title_similarity": "-0.10081307",
            "sentiment_compound": 0.5719
        },
        {
            "id": "hfpandc",
            "score": 1,
            "text": "Geez thassa bit harsh",
            "title_similarity": "0.26592237",
            "sentiment_compound": -0.4404
        },
        {
            "id": "hfpaqu1",
            "score": 1,
            "text": "This is something we should do in America. As it stands a lot of driving violation consequences are just a fine. Which is technically not a punishment if you have millions of dollars.",
            "title_similarity": "0.7136322",
            "sentiment_compound": 0.0588
        },
        {
            "id": "hfpbn9z",
            "score": 2,
            "text": "This is simple and brilliant. It is certainly a more just system and allows everyone to experience a similar financial pain.  Way to logical for the US though.  People hear wet the bed when they are told to get a safe vaccine that could save their lives.  I guess you could say that we are opting for anarchy instead.",
            "title_similarity": "0.4807375",
            "sentiment_compound": 0.8402
        },
        {
            "id": "hfpboh6",
            "score": 3,
            "text": "This should be how it goes everywhere cuz a $100 fine to someone like jeff bezos is just trash and they can get like x3738382992 of that $100 in like one minute",
            "title_similarity": "0.81788623",
            "sentiment_compound": 0.8074
        },
        {
            "id": "hfpcgrf",
            "score": 1,
            "text": "Good plan",
            "title_similarity": "-0.030798797",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hfpcvwj",
            "score": 2,
            "text": "Business plan: Hire poor Finnish people to drive the rich Finnish people around *really fast*. Lowers the fees for the rich, gives jobs to the poor, and...that's it. I'm Finnish'd.",
            "title_similarity": "0.70412016",
            "sentiment_compound": 0.0571
        },
        {
            "id": "hfpcwgz",
            "score": 1,
            "text": "What if you're unemployed & in debt?",
            "title_similarity": "0.42668033",
            "sentiment_compound": -0.3612
        },
        {
            "id": "hfpdesu",
            "score": 1,
            "text": "A Finnish guy who plays in the NHL go a solid speeding ticket\n\nhttps://sports.yahoo.com/sabres-defenceman-rasmus-ristolainen-earned-himself-a-ridiculous-speeding-ticket-while-in-finland-000139701.html",
            "title_similarity": "0.6851151",
            "sentiment_compound": 0.3818
        },
        {
            "id": "hfpdh5x",
            "score": 1,
            "text": "And this system has the same problem like any „income“ tax. It only taxes income earned through work but most very rich people don’t have high incomes they funnel their money through corporations and funds so that on paper they are as poor as you and me, only difference is that they are „poor“ while having access to privat jets beach houses and so on while you not",
            "title_similarity": "0.6777162",
            "sentiment_compound": 0.3934
        },
        {
            "id": "hfpdmwz",
            "score": 2,
            "text": "It's a great idea but proportionate fines seem a bit too much like equality to exist in my country (UK)",
            "title_similarity": "0.5150197",
            "sentiment_compound": 0.7003
        },
        {
            "id": "hfpdzst",
            "score": 4,
            "text": "It's only fucking fair!",
            "title_similarity": "0.08420448",
            "sentiment_compound": 0.4376
        },
        {
            "id": "hfpe7ff",
            "score": 12,
            "text": "There was an attempt to try that in England (\"unit fines\") but it was hounded out of existence by the press. I remember the coverage being almost entirely hostile.\n\nEg, one article found a \"poor unemployed person\" who had no income, who had been given an enormous fine. Long sob story. How was he going to be able to pay his fine.? The small print was that he had not responded to any queries from the magistrates about his income, so they had to assume the maximum. His fault entirely.",
            "title_similarity": "0.6737388",
            "sentiment_compound": -0.9271
        },
        {
            "id": "hfpejyl",
            "score": 1,
            "text": "I could break all the laws. For free.",
            "title_similarity": "0.44755572",
            "sentiment_compound": 0.5106
        },
        {
            "id": "hfpf2pi",
            "score": 1,
            "text": "I'm not a millionaire, so my Swiss speeding fine was only 5000€. I crossed the (unmanned and deserted) France/Switzerland border at 10pm at 80kph when the limit is 30kph. The Swiss police were hiding in the bushes with a speed trap. I have driven very carefully since then...",
            "title_similarity": "0.67640805",
            "sentiment_compound": -0.228
        },
        {
            "id": "hfpfxkg",
            "score": 1,
            "text": "Lets gooooo. my country",
            "title_similarity": "0.07456063",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfpg9cz",
            "score": 2,
            "text": "That's an absolutely fair system",
            "title_similarity": "0.039700337",
            "sentiment_compound": 0.3804
        },
        {
            "id": "hfpgh3m",
            "score": 1,
            "text": "Idgaf what the wealthy have to pay for anything",
            "title_similarity": "0.54532844",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hfpghgl",
            "score": 1,
            "text": "Should do this everywhere. Speeding tickets mean nothing to rich people. And who buys fast cars?",
            "title_similarity": "0.6295742",
            "sentiment_compound": -0.4449
        },
        {
            "id": "hfpgnbe",
            "score": 1,
            "text": "Now do this in the U.S. where only the poor and middle class have abusive ass fines cast on them.",
            "title_similarity": "0.5928897",
            "sentiment_compound": -0.8957
        },
        {
            "id": "hfpgupe",
            "score": 1,
            "text": "The guy was trying to overtake, the speed of sound.",
            "title_similarity": "0.33072662",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfphd30",
            "score": 1,
            "text": "There’s a speed camera on Mechelininkatu in Helsinki that (at one time) was the highest earning camera in the city. Its the one near the cemetery. \n\nIt’s well placed to capture some of the wealthier city residents and the workers commuting to the industrial area of the city. \n\nWatch out for it!",
            "title_similarity": "0.65003586",
            "sentiment_compound": 0.68
        },
        {
            "id": "hfpi6ff",
            "score": 1,
            "text": "i read somewhere that finland as a country doesnt exist? is this true??",
            "title_similarity": "0.3165419",
            "sentiment_compound": 0.5845
        },
        {
            "id": "hfpidla",
            "score": 1,
            "text": "A fair system!?!",
            "title_similarity": "0.10040746",
            "sentiment_compound": 0.4374
        },
        {
            "id": "hfpifpa",
            "score": 1,
            "text": "I don't know the specifics, but there are plenty of rich that don't have any income - how is it calculated for them? And it is not the same punishment if you take half of the monthly pay from low income person or half of monthly pay from rich person - poor guy would not have enough to pay rent and the food, and rich guy wouldnt even notice. It would be fairer to punish them so they have same amount of money left after the fine.",
            "title_similarity": "0.75579953",
            "sentiment_compound": 0.7988
        },
        {
            "id": "hfpimxd",
            "score": 1,
            "text": "Ah yes scalability.",
            "title_similarity": "-0.044240974",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hfpind9",
            "score": 1,
            "text": "Those huge fines are only used for when you are speeding over 20kph. Then you get the ”day-fine”. Under 20kph speedings are fined with same fine for everyone. \nSpeed limit 20-60kph and you are speeding 10kph or less over the limit you get fined for 100€. Same speed limit and you are speeding 11-15kph its 170€ and 16-20kph its 200€. \nHigher speed roads 70-120kph its 70€-140€-170€. And if you are speeding over 20kph on any road you are fined by your income.\n\nThe spreadsheet can be found at:\nhttps://lakineuvo.fi/liikennerikos-ylinopeussakko-ja-rikesakko-poliisin-sakotuskaytanto/\n\nAnd for bonus if you really are speeding like I did over 10 years ago, you can get jailtime… which is fucked imo. Got 10months probation for speeding 102kph on 100kph speed limit.",
            "title_similarity": "0.83079183",
            "sentiment_compound": 0.6077
        },
        {
            "id": "hfpjqe5",
            "score": 1,
            "text": "This happens in England as well for some things. Motoring offences and not buying a train ticket for example, but instead of a day it's range of 25-175% of weekly income depending on the offence",
            "title_similarity": "0.7531564",
            "sentiment_compound": -0.4497
        },
        {
            "id": "hfpjtgq",
            "score": 1,
            "text": "If something applies to one nordic country, it will most like be the case on the others.",
            "title_similarity": "0.2693177",
            "sentiment_compound": 0.4201
        },
        {
            "id": "hfpk0et",
            "score": 2,
            "text": "Can someone explain this to me in layman’s terms? Thanks - an idiot",
            "title_similarity": "0.29245692",
            "sentiment_compound": -0.1027
        },
        {
            "id": "hfpkghh",
            "score": 1,
            "text": "I think I love Finland.",
            "title_similarity": "0.25270444",
            "sentiment_compound": 0.6369
        },
        {
            "id": "hfpkzbu",
            "score": 3,
            "text": "The only fair way to fine people, otherwise you’re just making it legal for the rich.",
            "title_similarity": "0.49614224",
            "sentiment_compound": 0.802
        },
        {
            "id": "hfplao0",
            "score": 1,
            "text": "Meanwhile, in Romania, if you are the spoiled son of a shady soccer mogul, you can [consume cocaine, speed-drive, kill someone](https://tekdeeps.com/mario-iorgulescu-was-sent-to-trial-for-murder-and-driving-a-vehicle-under-the-influence-of-alcohol-and-cocaine/) and run to Italy, not worrying about it.",
            "title_similarity": "0.5412378",
            "sentiment_compound": -0.5667
        },
        {
            "id": "hfplnlv",
            "score": 1,
            "text": "Makes sense. A $10 fine doesn't deter you from shit if you're a millionaire.",
            "title_similarity": "0.5884872",
            "sentiment_compound": -0.4215
        },
        {
            "id": "hfplpus",
            "score": 1,
            "text": "Wish they did that in South Australia. As it is, the top end of society pay mere petty cash for their fines, so it isn’t a deterrent, and the other end cannot afford to feed their families over something that was probably just a once-off slip.",
            "title_similarity": "0.63776517",
            "sentiment_compound": 0.3182
        },
        {
            "id": "hfpm1of",
            "score": 3,
            "text": "Why isn't this the norm?",
            "title_similarity": "0.035222646",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfpm46c",
            "score": 2,
            "text": "Why do these Scandinavian countries make so much sense. Its like they thought about the idea, THEN did it.",
            "title_similarity": "0.37114024",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hfpmh1m",
            "score": 2,
            "text": "I love the thought of potentially having your dashboard filled with unpaid parking tickets that beats the state budget of some smaller 3rd world countries.",
            "title_similarity": "0.6921244",
            "sentiment_compound": 0.6369
        },
        {
            "id": "hfpmpky",
            "score": 1,
            "text": "Sounds like it’s a Finnish problem.",
            "title_similarity": "0.33258298",
            "sentiment_compound": -0.0516
        },
        {
            "id": "hfpmsd0",
            "score": 2,
            "text": "Without this system, with absolute values, fines are just a way to codify \"rules for thee, not for me\".\n\n\nWhen a fine is prohibitive fore a minimum wage worker, but the equivalent of < 1 cent for a high-net-worth individual, it's not a fine and won't have a steering effect on behaviour for them.",
            "title_similarity": "0.62747246",
            "sentiment_compound": 0.0931
        },
        {
            "id": "hfpnfmp",
            "score": 1,
            "text": "A friend of a friend is heir to a pretty considerable fortune. He was fined 100k for speeding or something ridiculous like that.",
            "title_similarity": "0.8125838",
            "sentiment_compound": 0.8625
        },
        {
            "id": "hfpnimo",
            "score": 1,
            "text": "In the US a chronic violator of traffic laws could still lose their license even if they can afford the fines, so I'm skeptical of this making a difference without seeing more info",
            "title_similarity": "0.6455621",
            "sentiment_compound": -0.8261
        },
        {
            "id": "hfpo4mv",
            "score": 1,
            "text": "So the very rich that make single digits pay virtually $0?",
            "title_similarity": "0.62174475",
            "sentiment_compound": 0.5799
        },
        {
            "id": "hfpo980",
            "score": 1,
            "text": "This exists in other countries too. In Sweden it is known as Dagsböter, ie., day-fine.",
            "title_similarity": "0.33444205",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfpogo2",
            "score": 1,
            "text": "It makes sense. I live not to far from Sandbanks on the UK South Coast which has insanely high property prices and is a popular stay-at-home beach destination for the wealthy.\n\nIn the summer, there are countless expensive cars illegally parked, holding up traffic, and causing a complete nightmare blocking access. All because the extent of the parking fine has nearly no impact on them from a financial standpoint",
            "title_similarity": "0.6039673",
            "sentiment_compound": 0.3182
        },
        {
            "id": "hfpoqoa",
            "score": 2,
            "text": "We really need this is Ontario. Insurance rates are out of control because rich assholes' kids smashing up their teslas. Maybe if the fine was 100k daddy might think twice about buying junior a fancy sports car for their sweet 16",
            "title_similarity": "0.76033986",
            "sentiment_compound": 0.5574
        },
        {
            "id": "hfpph0r",
            "score": 1,
            "text": "Yup, Sweden has this aswell",
            "title_similarity": "0.17244078",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfpq159",
            "score": 1,
            "text": "Whoa, a fee penalty system that isn’t regressive?!  Sign me up.",
            "title_similarity": "0.33393168",
            "sentiment_compound": -0.5093
        },
        {
            "id": "hfpq676",
            "score": 1,
            "text": "I like this idea.",
            "title_similarity": "-0.06130481",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hfpqi7p",
            "score": 1,
            "text": "Finnish NHL player Rasmus Ristolainen got a 120 000€ speeding ticket. Equilavent to about 140k USD. I'm pretty sure Rostolainen homds the record for highest speeding ticket in Finnish law history.",
            "title_similarity": "0.8107021",
            "sentiment_compound": 0.6705
        },
        {
            "id": "hfpqloc",
            "score": 2,
            "text": "Can you imagine American cops with this?  \n\n\nIn their gold-plated cop cars…..they’d never leave the rich part of town, slapping people with tickets for j-walking, speeding 1 mph over, suspicious driving, bikes on sidewalks, etc.  \n\n\nIt would be just like it is for poor people now.",
            "title_similarity": "0.6633781",
            "sentiment_compound": -0.7074
        },
        {
            "id": "hfpqvt1",
            "score": 2,
            "text": "Shit i got a parking ticket in Helsinki and it was 85 euros. I'm unemployed now, but receiving union help. I wonder if that was factored in",
            "title_similarity": "0.6225623",
            "sentiment_compound": 0.3071
        },
        {
            "id": "hfprrlk",
            "score": 2,
            "text": "Sounds great 'n' all but...\n\nMost millionaires and higher actually register near zero daily income\n\nThere's a well known Finnish case where the granddaughter of a very wealthy politicial fixer demonstrated that her actual income was around FIM6 - about £1 at the time, despite the fact that she was clocked at 137km/h in her brand new paid-for-on-granddaddy's-card sports car\n\nMany truly wealthy people do not have any notifiable income (or a bare minimum)",
            "title_similarity": "0.7228371",
            "sentiment_compound": 0.9431
        },
        {
            "id": "hfps1bx",
            "score": 1,
            "text": "Without a sliding scale system, if the punishment for a crime is a fine, it's a crime only for the poor.",
            "title_similarity": "0.5364134",
            "sentiment_compound": -0.91
        },
        {
            "id": "hfps5i7",
            "score": 1,
            "text": "That only works if it's impossible to hide your true income.\n\nHow does Finland get around this problem?",
            "title_similarity": "0.46318793",
            "sentiment_compound": -0.2558
        },
        {
            "id": "hfpt02o",
            "score": 3,
            "text": "[deleted]",
            "title_similarity": "0.03025806"
        },
        {
            "id": "hfpt31x",
            "score": 1,
            "text": "\"From each according to their ability..\"\n\nThis is a brilliant solution to a massive problem. The rich can basically break so many laws because the fine they pay is nothing to them.",
            "title_similarity": "0.72406584",
            "sentiment_compound": 0.8658
        },
        {
            "id": "hfpt9ms",
            "score": 1,
            "text": "Good, in the US fines are just another tax on the poor",
            "title_similarity": "0.56418294",
            "sentiment_compound": -0.0516
        },
        {
            "id": "hfpty1p",
            "score": 2,
            "text": "America take notes. I know you won’t but take notes.",
            "title_similarity": "0.37781873",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfpv1ot",
            "score": 1,
            "text": "- 👀?!\n- 🕶\n-  °. WTF?!",
            "title_similarity": "0.085339144",
            "sentiment_compound": -0.7563
        },
        {
            "id": "hfpvfwj",
            "score": 1,
            "text": "They tried an income based approach in the UK once. Unfortunately they didnt bank on all the folks who had complex income structures where on paper they only had tiny incomes. High rollers were often paying peanuts in comparison to middle earners. Would love to know how this works in the countries where it is widely seen as successful.",
            "title_similarity": "0.66635543",
            "sentiment_compound": 0.765
        },
        {
            "id": "hfpw7gn",
            "score": 2,
            "text": "In Italy you get the fine AND they give you 6 points penalty for driving too fast. When you reach 20, your license is suspended and you must pass exams again to get license back.\n\n5 points if you drive without safety belt and so on.\n\nThis helped reducing deaths by car accidents in the last 20 years",
            "title_similarity": "0.7136363",
            "sentiment_compound": -0.833
        },
        {
            "id": "hfpwyqp",
            "score": 1,
            "text": "Isn't Jeff Bezos' salary $1 a year?",
            "title_similarity": "0.54895616",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfpxcf3",
            "score": 2,
            "text": "A good idea if you believe that everyones life is equal.",
            "title_similarity": "0.17084771",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hfpxg5t",
            "score": 2,
            "text": "The world could learn a lot from Finland",
            "title_similarity": "0.35873574",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfpxwr3",
            "score": 3,
            "text": "If the penalty is a fine, the law only applies to the poor.",
            "title_similarity": "0.5014796",
            "sentiment_compound": -0.6486
        },
        {
            "id": "hfpxymk",
            "score": 2,
            "text": "There's probably also a minimum or unemployed people could go nuts. Or even better if you have negative income, you get paid each time you speed.",
            "title_similarity": "0.69736606",
            "sentiment_compound": -0.4767
        },
        {
            "id": "hfpz9wt",
            "score": 2,
            "text": "Marco Reus got a ticket of €100,000.",
            "title_similarity": "0.6631869",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfpzrge",
            "score": 2,
            "text": "Yeah fine should always be based on what individuals income. Otherwise it doesn’t affect those with lots of money.",
            "title_similarity": "0.3862688",
            "sentiment_compound": 0.4588
        },
        {
            "id": "hfq06qb",
            "score": 1,
            "text": "That is the only way, fines are not getting to be a class problem! All people have to learn some rules!",
            "title_similarity": "0.26640224",
            "sentiment_compound": -0.508
        },
        {
            "id": "hfq0mb4",
            "score": 3,
            "text": "We Finns are professionals in making money and people part ways.",
            "title_similarity": "0.42463452",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfq17a2",
            "score": 3,
            "text": "See, simple solutions to simple problems.  It's not that complicated.  Also, when the punishment for a crime is a fine, it's only illegal if you can't afford.  Otherwise its just extra tax",
            "title_similarity": "0.51936376",
            "sentiment_compound": -0.8885
        },
        {
            "id": "hfq1spb",
            "score": 3,
            "text": "Karim Benzema, the footballer paid 85k euros a couple of years ago. Dude was doing 100 in a 30 zone.",
            "title_similarity": "0.59835404",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfq280g",
            "score": 2,
            "text": "That’s too fair to be true! Amazing!\n\nCongrats!",
            "title_similarity": "0.19367999",
            "sentiment_compound": 0.9213
        },
        {
            "id": "hfq4dag",
            "score": 2,
            "text": "There's literally no reason to not implement this everywhere.",
            "title_similarity": "0.09103884",
            "sentiment_compound": -0.296
        },
        {
            "id": "hfq51fv",
            "score": 2,
            "text": "As it should be.\n\nAny crime for which the penalty is a flat fine irrespective of income is just something that's only a crime for poor people.",
            "title_similarity": "0.5429421",
            "sentiment_compound": -0.9062
        },
        {
            "id": "hfq5cly",
            "score": 2,
            "text": "Here ya go Bezos ya fucking turd. Parking ticket $2.8 million",
            "title_similarity": "0.6561044",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfq73xn",
            "score": 3,
            "text": "Income doesn’t exactly translate to wealth. Millionaire doesn’t mean high earning at any particular time.",
            "title_similarity": "0.4332958",
            "sentiment_compound": 0.4939
        },
        {
            "id": "hfq9wz7",
            "score": 2,
            "text": "Does this work well for poor people? My worry is that it would only be a \"rich people pay more\" system and never a \"poor people pay less\" system, like poor people would pay whatever the ticket would have been for everyone without this system in place because the government is always composed of big ol' meanies.",
            "title_similarity": "0.76759744",
            "sentiment_compound": -0.1433
        },
        {
            "id": "hfqaa4y",
            "score": 3,
            "text": "Any time the result of breaking a law is a fine, that states the law is for the poor\n\nBut this is a nice change of pace",
            "title_similarity": "0.55875194",
            "sentiment_compound": 0.4678
        },
        {
            "id": "hfqbcn1",
            "score": 5,
            "text": "Please bring this here! I cant believe I have to pay the same amount as effin millionaires",
            "title_similarity": "0.6130016",
            "sentiment_compound": -0.4003
        },
        {
            "id": "hfqg6zq",
            "score": 2,
            "text": "\"If the penalty for a crime is a fine, *that law only exists for the lower classes.\"*",
            "title_similarity": "0.5015587",
            "sentiment_compound": -0.7845
        },
        {
            "id": "hfqk1tz",
            "score": 2,
            "text": "Could you imagine receiving a speeding ticket of $100,000!!! 🤦‍♂️🤦‍♂️\n\nI don't, hopefully, even think a millionaire would stomach to often..... \n\n&#x200B;\n\ngood idea...",
            "title_similarity": "0.79621494",
            "sentiment_compound": 0.3649
        },
        {
            "id": "hfqlf01",
            "score": 2,
            "text": "Rasmus Ristolainen owns the highest one I think 🤣",
            "title_similarity": "0.31051007",
            "sentiment_compound": 0.4939
        },
        {
            "id": "hfqne1i",
            "score": 1,
            "text": "This is a great idea.",
            "title_similarity": "-0.007118499",
            "sentiment_compound": 0.6249
        },
        {
            "id": "hfqplqz",
            "score": 1,
            "text": "Is also a society where their greatest contribution to the world is a drying dish rack.\n\nWhy would I work harder if I'm going to be punished more?\n\nhttps://www.finnstyle.com/inventions.html",
            "title_similarity": "0.52435577",
            "sentiment_compound": 0.296
        },
        {
            "id": "hfqptxb",
            "score": 1,
            "text": "This is the way",
            "title_similarity": "-0.1422585",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfqrf08",
            "score": 1,
            "text": "That’s a fucking baller move by the Finnish Government over here",
            "title_similarity": "0.52020806",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfqsku0",
            "score": 2,
            "text": "This seems great in theory, but wouldn’t this influence lot of young, reckless, low income drivers to be dangerous on the roadway because their day-fines would be so low? Maybe not, just a thought",
            "title_similarity": "0.5960737",
            "sentiment_compound": -0.9083
        },
        {
            "id": "hfqtol5",
            "score": 1,
            "text": "There still has to be a minimum right?",
            "title_similarity": "-0.055929005",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfqtsy7",
            "score": 1,
            "text": "That’s real justice right there",
            "title_similarity": "0.021624524",
            "sentiment_compound": 0.5267
        },
        {
            "id": "hfr6us2",
            "score": 1,
            "text": "Same in Sweden, called dagsböter. The severity of the crime determines how many fines you get, and one's income how much each day-fine is.",
            "title_similarity": "0.7957",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hfr77nw",
            "score": 2,
            "text": "It's brilliant. An actual deterrent.",
            "title_similarity": "0.07932505",
            "sentiment_compound": 0.5859
        },
        {
            "id": "hfrdizs",
            "score": 2,
            "text": "So the chemical company worth half a trillion can pay a real fine for destroying some aquifers or what have you. \n\nYea we need this here in the US.",
            "title_similarity": "0.7601821",
            "sentiment_compound": -0.3182
        },
        {
            "id": "hfrg265",
            "score": 1,
            "text": "Yes.",
            "title_similarity": "-0.119250424",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hfrrzqh",
            "score": 1,
            "text": "Dhe",
            "title_similarity": "-0.110476375",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfshtyx",
            "score": 1,
            "text": "\"if a law is punishable by a fine it does not exist for the rich\"",
            "title_similarity": "0.53579444",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hfsnpoi",
            "score": 1,
            "text": "There was a scene in the Snowden movie (based on a true story according to memoir) where his boss from the CIA basically deported a banker the US hates by getting him a drunk driving ticket that's really high because he's a rich banker.",
            "title_similarity": "0.70999193",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hft460e",
            "score": 1,
            "text": "It's astounding this system hasn't been adopted elsewhere. When the penalty for a crime is a flat fine, then the law only applies to those not rich enough to pay it.",
            "title_similarity": "0.62263614",
            "sentiment_compound": -0.7371
        },
        {
            "id": "hftilxt",
            "score": 1,
            "text": "I'm so broke my speeding ticket would make me money",
            "title_similarity": "0.7657031",
            "sentiment_compound": -0.4754
        },
        {
            "id": "hftkz5o",
            "score": 1,
            "text": "This, or something similar to it is the standard in most European nations.",
            "title_similarity": "0.22028264",
            "sentiment_compound": 0.0
        },
        {
            "id": "hftq88u",
            "score": 1,
            "text": "What happens if you ask your driver to zip it through.  Do you get fined by your driver's income or yours.",
            "title_similarity": "0.5837631",
            "sentiment_compound": 0.0
        },
        {
            "id": "hftqqbr",
            "score": 2,
            "text": "In Spain this system is used when a judge fine you, it doesn't apply to administrative faults, like speeding a little bit over the max speed",
            "title_similarity": "0.47903666",
            "sentiment_compound": 0.0516
        },
        {
            "id": "hfuffth",
            "score": 3,
            "text": "Reddit in here salivating over the thought of paying nothing for fines cause they don't have jobs",
            "title_similarity": "0.52498746",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfwt45w",
            "score": 4,
            "text": "Yes! This is exactly how it should be!! Just like cops are treated with a heavier hand when they commit criminal acts.\n\nEdit: Thought about it. Cops get off easy allot.",
            "title_similarity": "0.42744818",
            "sentiment_compound": 0.8743
        },
        {
            "id": "hg46k3e",
            "score": 1,
            "text": "Sweden aswell",
            "title_similarity": "0.14116995",
            "sentiment_compound": 0.0
        },
        {
            "id": "hg5mewt",
            "score": 1,
            "text": "Your REPORTED income.",
            "title_similarity": "0.19487095",
            "sentiment_compound": 0.0
        },
        {
            "id": "hgexy56",
            "score": 1,
            "text": "Look at all the low income food service workers that think THEY should get a break because they don't work hard enough to have a better income than they do.\n\nTypical socialist mentality.",
            "title_similarity": "0.49412173",
            "sentiment_compound": 0.2723
        },
        {
            "id": "hgfek4m",
            "score": 1,
            "text": "Pretty absurd",
            "title_similarity": "0.0690067",
            "sentiment_compound": 0.4939
        },
        {
            "id": "hglgs2f",
            "score": 3,
            "text": "i have 100% chosen a $35 24-hour city parking ticket over paying $60 for two-hour event parking that expires by the minutes, so i feel this on a spiritual level.",
            "title_similarity": "0.6786828",
            "sentiment_compound": 0.0
        },
        {
            "id": "hhjkoz5",
            "score": 1,
            "text": "That’s pretty fucked. So much for equality huh",
            "title_similarity": "0.20895183",
            "sentiment_compound": -0.296
        },
        {
            "id": "hhjoo29",
            "score": 1,
            "text": "big disagree. flat fines stop being poor",
            "title_similarity": "0.5004616",
            "sentiment_compound": -0.7845
        },
        {
            "id": "hhl4hko",
            "score": 2,
            "text": "I’ll",
            "title_similarity": "-0.13133976",
            "sentiment_compound": 0.0
        },
        {
            "id": "hhxmp7f",
            "score": 1,
            "text": "So much for equal protection under the law.",
            "title_similarity": "0.21539107",
            "sentiment_compound": 0.0
        },
        {
            "id": "hhxtywe",
            "score": 2,
            "text": "i agree 100%\n\neat the rich",
            "title_similarity": "0.4397307",
            "sentiment_compound": 0.7269
        },
        {
            "id": "hisphld",
            "score": 1,
            "text": "This system should be in place in the US, or every country for that matter. Fines are simply laws for the poor.",
            "title_similarity": "0.5010525",
            "sentiment_compound": -0.4588
        },
        {
            "id": "hiukjdj",
            "score": 1,
            "text": "I mean, that's one way to bypass the \"a crime with nothing but a fine as punishment is only a crime for the poor\" thing. Honestly though? I kinda like it. That way it's a percentage, if you will, so it hurts everyone the same.",
            "title_similarity": "0.5369617",
            "sentiment_compound": -0.9441
        },
        {
            "id": "hiuqj48",
            "score": 1,
            "text": "I heard something disturbing the other day.  If the penalty for a crime is a fine, it's only a law for poor people. \n\nConsidering I've heard of rich Americans who hire lawyers to handle their speeding tickets and just stopped whenever they want cause they have the money to this day fine system sounds awesome.",
            "title_similarity": "0.7501151",
            "sentiment_compound": -0.4939
        },
        {
            "id": "hjaf6yo",
            "score": 1,
            "text": "Breaking News: Milita funded by Elon Musk invades Finland after Musk ordered to pay 7 Day Fine",
            "title_similarity": "0.6474241",
            "sentiment_compound": 0.1027
        }
    ]
}