{
    "TIL that an underachieving Princeton student wrote a term paper describing how to make a nuclear bomb. He got an A but his paper was taken away by the FBI.\n": [
        {
            "id": "hixr18u",
            "score": 0,
            "text": "I loaned [this](https://en.wikipedia.org/wiki/The_Making_of_the_Atomic_Bomb) Pulitzer Prize winning book to a friend to read and he decided to fly with it and had it not in a bag. Lucky for him this was pre 9/11 and he was only detained for 45 minutes. \n\nIn short - The Making of the Atomic Bomb by Richard Rhodes is not good in-flight reading according to the TSA.",
            "title_similarity": "0.7534723",
            "sentiment_compound": 0.6591
        },
        {
            "id": "hiyh6la",
            "score": -1,
            "text": "Good thing they are protecting us from this student’s paper instead of individuals who are literally trying to sabotage US democracy.   Starting not to know which side the FBI is on.",
            "title_similarity": "0.6854353",
            "sentiment_compound": -0.128
        },
        {
            "id": "hixf0s7",
            "score": 6,
            "text": "This is going to be a dumb question, but at this point who DOESN'T know how to make a nuclear bomb? Are we talking the general construction? The principles behind it? I mean the only had part is getting and processing the uranium into plutonium...",
            "title_similarity": "0.7497256",
            "sentiment_compound": -0.79
        },
        {
            "id": "hixwrj3",
            "score": 1,
            "text": "Science doesn't work that way. He could just write it again.",
            "title_similarity": "0.5604631",
            "sentiment_compound": 0.0
        },
        {
            "id": "hix8j38",
            "score": 2,
            "text": "Hehe, silly state police",
            "title_similarity": "0.32370853",
            "sentiment_compound": 0.0258
        },
        {
            "id": "hiwyo7d",
            "score": 71,
            "text": "For those of you wondering, the reason why the fbi took it away is because some dude from Pakistan wanted to buy and so the fbi took it away. It’s there in the article",
            "title_similarity": "0.7015722",
            "sentiment_compound": 0.0
        },
        {
            "id": "hixfzms",
            "score": 18,
            "text": "The student? Albert Einstein. \n\nThe FBI Agent? James Bond",
            "title_similarity": "0.6242931",
            "sentiment_compound": 0.0
        },
        {
            "id": "hixuhnj",
            "score": 0,
            "text": "Lol oh man I’m glad that paper didn’t fall into the wrong hands. That’s real magic right there. Gods are great again blessings to all of you involved and to the poster",
            "title_similarity": "0.29363686",
            "sentiment_compound": 0.8834
        },
        {
            "id": "hiycavn",
            "score": 0,
            "text": "Great, now the FBI is a nuclear power.",
            "title_similarity": "0.60657716",
            "sentiment_compound": 0.6249
        },
        {
            "id": "hiyrmtb",
            "score": 0,
            "text": "“Whoa…we truly do live in a society. They don’t understand us outsiders. Everyone is a sheep but we are real sigma males”",
            "title_similarity": "0.41409278",
            "sentiment_compound": 0.2382
        },
        {
            "id": "hiz0jfz",
            "score": 0,
            "text": "My mom had a camera and roll of film taken from her by some SP after she took pictures of a submarine leaving  the Groton base in Connecticut in 1980. She got the camera back but not the pictures fast forward to 2011 and you can go on tours of submarines go figure",
            "title_similarity": "0.6134449",
            "sentiment_compound": 0.0
        },
        {
            "id": "hj0oxvh",
            "score": 0,
            "text": "That’s just wrong for the government to confiscate someone’s work! But it doesn’t surprise me",
            "title_similarity": "0.46398118",
            "sentiment_compound": 0.2244
        },
        {
            "id": "hj0ve56",
            "score": 0,
            "text": "Yeah and better yet after his paper was taken away he got a job and then gave [this speech ](https://youtu.be/RmUWWVZw28E) (presentation?)\n\nIt’s kind of terrifying to realize how simple it may be to create these kind of weapons",
            "title_similarity": "0.67956764",
            "sentiment_compound": -0.2467
        },
        {
            "id": "hixpkxv",
            "score": 1,
            "text": "The basic plot of this movie:\n\nThe Manhattan Project\n1986\n\nhttps://m.imdb.com/title/tt0091472/",
            "title_similarity": "0.5354234",
            "sentiment_compound": 0.0
        },
        {
            "id": "hixxu8f",
            "score": 1,
            "text": "[ This comment has been seized by the *[ The organization seizing this comment has also been seized ]* ]",
            "title_similarity": "0.3098809",
            "sentiment_compound": 0.0
        },
        {
            "id": "hiyb5a4",
            "score": -1,
            "text": "It’s pretty funny to think information that was once among the most guarded of national secrets is now freely available on Wikipedia. I have an amateur interest in nuclear weapons and I haven’t even had any nuclear engineer training, but I’m pretty sure if you dropped me in an alternate reality with no nuclear weapons, I could lead a nuclear weapons development committee and guide even a country with modest resources into developing a Hiroshima style bomb within a few years.\n\nThose early bombs really aren’t all that complex. It’s when you start getting into H-bomb territory that the descriptions of how they work start to go over my head.",
            "title_similarity": "0.76964885",
            "sentiment_compound": 0.536
        },
        {
            "id": "hiyf6c9",
            "score": -1,
            "text": "I'd venture any chemist or engineer in the country could tell you how to make one, even some highschool kids could.\n\nSounds like the princeton karen'd the fuck out on this guy.",
            "title_similarity": "0.70572054",
            "sentiment_compound": -0.25
        },
        {
            "id": "hizvvtp",
            "score": 1,
            "text": "Hahaha…I went to school with him…and Boy Scouts….just a big nerd….harmless",
            "title_similarity": "0.48599896",
            "sentiment_compound": 0.0
        },
        {
            "id": "hixi3ll",
            "score": 2,
            "text": "This sounds like exactly the type of story an underacheiving student at Princton would make up.",
            "title_similarity": "0.394598",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hixz27f",
            "score": -2,
            "text": "…and that student, Donald J Trump.",
            "title_similarity": "0.34212118",
            "sentiment_compound": 0.0
        },
        {
            "id": "hiy6e45",
            "score": 2,
            "text": "Now he owns a data mining company with information on 175 million US voters. \n\nI mean, this guy actually sounds like a huge piece of shit, tbh",
            "title_similarity": "0.5391935",
            "sentiment_compound": 0.0516
        },
        {
            "id": "hix4oh1",
            "score": 3,
            "text": "Segway to my most favorite of all home projects: https://en.wikipedia.org/wiki/David\\_Hahn",
            "title_similarity": "0.2503144",
            "sentiment_compound": 0.5095
        },
        {
            "id": "hixzsx5",
            "score": 5,
            "text": "Physicist here\n\nNuclear bombs are rather easily to figure out with just a google search. Like, super easy, very much possible even with just a high school education. \n\nIt was so hard and took so many people/so much effort in the 40s because it was brand new science back then. \n\nIt’s hard to make a practical bomb today because making something that intricate act precisely how you want it to and not be dangerous until you want it to be, and explode as much as possible, and all when strapped to an intercontinental missile, is hard\n\nAssuming you didn’t get raided by the feds, anyone with enough money could easily build a Hiroshima-style bomb in their basement. The problem is getting all the materials, not dying in the process, and not being noticed while doing so.\n\nTwo little tidbits to maybe put some things in perspective:\n\n1. Hiroshima was not the primary target for the first bombing, but the cloud cover over Kokura (the actual target) was too dense to ensure good aim. We could harness the power of atoms, turn matter into energy on an atomic scale and use it to end over 100,000 lives with a single button, burn hotter than the sun on earth, but not reliably tell if it would be cloudy tomorrow. This is still true today: We have thousands of weapons that are all thousands of times more destructive than the Hiroshima bomb, and the only reason that they aren’t more powerful is because at that point it would so destructive as to become pointless to get any more powerful. Meanwhile, even the best scientists and meteorologists put together couldn’t tell you with better than 90% accuracy if it’s gonna rain tomorrow.\n\n2. The Hiroshima and Nagasaki bombs were pitiful; they barely worked. They used massive amounts of plutonium and uranium, but only a gram or so actually generated any energy; multi-ton bombs that only used a dollar bill’s weight in explosive. Yet they killed about 200,000 people, and are still killing people today, even affecting those that weren’t alive at the time. Certain things don’t have to be exact or even remotely efficient to be unfathomably destructive. Obviously data on nuclear weapons isn’t exactly public knowledge, but even in the 60s the strongest nuclear weapons were capable of turning states into lakes, despite not reaching even 50% fuel efficiency. A backyard bomb need only be a janky, half broken fuck up of a machine to still be capable of killing thousands.",
            "title_similarity": "0.708603",
            "sentiment_compound": -0.9496
        },
        {
            "id": "hix58fj",
            "score": -5,
            "text": "1984 is no longer fiction",
            "title_similarity": "0.16537523",
            "sentiment_compound": -0.296
        },
        {
            "id": "hixovd2",
            "score": 5,
            "text": "Well, hmmm, since we're talking underachieving nuclear bomb designers.  There was a guy named Ted Taylor who was disqualified from a graduate program at Berkeley in 1949. A prof recommended him for a job at Los Alamos and he worked there until 1953 when he went to Cornell for a PhD. \n\nHis wikipedia page is a pretty good read but he's the star of 'The Curve of Binding Energy\" by John McPhee and, if you aren't already a McPhee fan it's as good a place as any to start that little addiction.",
            "title_similarity": "0.8575967",
            "sentiment_compound": 0.8537
        },
        {
            "id": "hixtyr4",
            "score": 17,
            "text": ">As of 2016, Phillips is in the business of political data mining—he finds out everything he can about individual voters and then sells that information to politicians. Aristotle’s massive private database contains detailed information on roughly 175 million American voters. The company was founded in 1983.\n\nNasty fucker.",
            "title_similarity": "0.60838544",
            "sentiment_compound": -0.836
        },
        {
            "id": "hixbhvi",
            "score": 62,
            "text": "As of 2016, Phillips is in the business of political data mining—he finds out everything he can about individual voters and then sells that information to politicians. Aristotle’s massive private database contains detailed information on roughly 175 million American voters. The company was founded in 1983.\n\nThis is exactly the person that we need in STEM, but he is doing political consulting instead. I am not faulting him at all, but the incentives are fucked up that you can make more money doing that instead of STEM stuff. Speaks volumes as to what our society values.",
            "title_similarity": "0.64219475",
            "sentiment_compound": 0.2392
        },
        {
            "id": "hiwyhmj",
            "score": 9,
            "text": "Did his professor snitch on him? That's uncool",
            "title_similarity": "0.5473401",
            "sentiment_compound": 0.0
        },
        {
            "id": "hixgww6",
            "score": 12,
            "text": "So you KNOW someone had to report him to the FBI.....and who would have had access to that report but the professor.....I see a potential lawsuit...",
            "title_similarity": "0.6679907",
            "sentiment_compound": -0.3291
        },
        {
            "id": "hiwq2tq",
            "score": 1587,
            "text": "The 70s were a much different time.  \n\nI was in 6th grade, and had to write a 30 page paper.  I wrote to the NRC and to the nuclear plant directors in my state (NJ).   I told them who I was, and that I was interested in any basics about how nuclear plants were constructed, plans they could share, basics about how nuclear power was generated, and anything else they thought I might need to understand better.   \n\nI didn't get that stuff, or even an answer.  After a month, my teacher made me write on something else, so I wrote about the Newark NJ riots.   \n\nOver the summer, I received 34 boxes of literature - construction plans, site layouts, reactor specs, and all kinds of other literature from all of those agencies.  Bits if it were redacted, but not much.   My Mom made me put all the boxes in the basement, and only read from one box at a time.  \nI learned a ton.    \n\nToday, I'd probably wind up in Gitmo for making such a request as an adult, and if they did send me anything, I'm sure a whole lot more would have been redacted.",
            "title_similarity": "0.7417359",
            "sentiment_compound": 0.6369
        },
        {
            "id": "hiwok36",
            "score": 402,
            "text": "Underachieving? Has the FBI ever taken an interest in your schoolwork, OP?",
            "title_similarity": "0.66616726",
            "sentiment_compound": 0.5204
        },
        {
            "id": "hixa160",
            "score": 125,
            "text": "He got an A **and** his paper was taken away by the FBI. Testament to the success!  \nIf he got a D-, you could go \"He got a D-, but his paper was taken away by the FBI\".",
            "title_similarity": "0.68927205",
            "sentiment_compound": 0.3903
        },
        {
            "id": "hix78uj",
            "score": 300,
            "text": "I mean there's papers on it, explaining the early bombs like fat man and lil boy. Looks pretty straighforward if you have the fissible material.",
            "title_similarity": "0.63108647",
            "sentiment_compound": 0.6908
        },
        {
            "id": "hix5vun",
            "score": 957,
            "text": "Well the FBI are not exactly nuclear experts, they would have taken everything if you just write Pu-239 on a piece of paper, just in case.",
            "title_similarity": "0.73628056",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hiwrrto",
            "score": 69,
            "text": "They made a movie with this premise in the mid-80's called the Manhattan Project and had John Lithgow in it.",
            "title_similarity": "0.4484004",
            "sentiment_compound": 0.0
        },
        {
            "id": "hiwwpyt",
            "score": 3483,
            "text": "I have a friend who majored in nuclear engineering in undergrad. I once asked him if he knew how to build a nuclear bomb. His response was \"Most of my high school Go team could have built a nuclear bomb, assuming they could get their hands on enough fissionable material\"",
            "title_similarity": "0.8021038",
            "sentiment_compound": -0.4939
        },
        {
            "id": "hixhyyq",
            "score": 95,
            "text": "This does not just work for physics papers. In any subject, if you demonstrate to the teacher that you can make a nuclear bomb and ask for an A, the teacher will give you an A.",
            "title_similarity": "0.7750068",
            "sentiment_compound": -0.4939
        },
        {
            "id": "hiwxehd",
            "score": 1113,
            "text": "And then there was this guy.\n\nhttps://en.m.wikipedia.org/wiki/David_Hahn\n\nI first saw this before he passed. I always hoped he had went on to something spectacular and not what fate brought him.",
            "title_similarity": "0.5099673",
            "sentiment_compound": 0.3818
        },
        {
            "id": "hix2igq",
            "score": 131,
            "text": "It's like an old Steve Martin routine, \"How to be a Millionaire,\" which goes, \"step 1, get a million dollars, step 2...\"",
            "title_similarity": "0.5097376",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hixdbjk",
            "score": 5089,
            "text": "A good friend of mine was a math major at Yale and his thesis on some obscure area of number theory - which he thought was entirely theoretical and without practical impact, was classified by the NSA (this was in the early 80s).",
            "title_similarity": "0.75309557",
            "sentiment_compound": 0.7506
        },
        {
            "id": "hiwqtim",
            "score": 5624,
            "text": "[deleted]",
            "title_similarity": "0.12068858"
        },
        {
            "id": "hiwtqyp",
            "score": 23615,
            "text": "The thing is, even if you know exactly how to make one, and have the technical expertise to do so, you're still going to need literally tons of uranium ore.  Then you need to refine that ore to get the uranium.  Then you need to turn that uranium into a corrosive gas and pump it through a large industrial centrifuge complex to enrich it.  *Then* you can build your bomb.",
            "title_similarity": "0.6427874",
            "sentiment_compound": -0.4939
        },
        {
            "id": "hixfh2u",
            "score": 1987,
            "text": "The reason it's seized was probably because, as mentioned in the article, the paper \"deals with the key problem of the type of high-explosive component needed to trigger the nuclear blast\". Everybody knows that when some fission material reaches critical mass things go boom, but it took the genius-level scientists at Los Alamos some time and effort to even determine that the gun-type design (like the Little Boy) wasn't compatible with the plutonium that they were able to produce at that time.",
            "title_similarity": "0.7815156",
            "sentiment_compound": 0.2144
        },
        {
            "id": "hix0zrw",
            "score": 27,
            "text": "I first read that story in a Reader's Digest from the 70s.\n\n[https://classic.esquire.com/article/1978/8/1/how-i-designed-an-a-bomb-my-junior-year-at-princeton](https://classic.esquire.com/article/1978/8/1/how-i-designed-an-a-bomb-my-junior-year-at-princeton)",
            "title_similarity": "0.636235",
            "sentiment_compound": 0.0
        },
        {
            "id": "hix6ja7",
            "score": 9,
            "text": "You gotta make science fun",
            "title_similarity": "0.31057456",
            "sentiment_compound": 0.5106
        },
        {
            "id": "hixbvr9",
            "score": 2,
            "text": "Was that before or after that John Lithgow movie? Did he reccomend Alberto V05 and sparkles?",
            "title_similarity": "0.45519263",
            "sentiment_compound": 0.3939
        },
        {
            "id": "hixd3ff",
            "score": 1,
            "text": "Was he at least hired by the government?",
            "title_similarity": "0.42065665",
            "sentiment_compound": 0.0
        },
        {
            "id": "hixejdt",
            "score": 1,
            "text": "u/profanitycounter [self]",
            "title_similarity": "0.27096254",
            "sentiment_compound": 0.0
        },
        {
            "id": "hixew2f",
            "score": 6,
            "text": "> Phillips hasn’t actually built the bomb\n\nWell, thank fuck for that.",
            "title_similarity": "0.60420334",
            "sentiment_compound": 0.8591
        },
        {
            "id": "hixfbvg",
            "score": 82,
            "text": "Its not hard... just:\n\n#[DELETED]",
            "title_similarity": "0.10242892",
            "sentiment_compound": 0.0762
        },
        {
            "id": "hixhc22",
            "score": 53,
            "text": ">underachieving Princeton",
            "title_similarity": "0.4081803",
            "sentiment_compound": 0.0
        },
        {
            "id": "hixhq16",
            "score": 1,
            "text": "And now he works for the Department of Energy",
            "title_similarity": "0.35050613",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hixiduy",
            "score": 1,
            "text": "And that mans name was?",
            "title_similarity": "0.07530914",
            "sentiment_compound": 0.0
        },
        {
            "id": "hixikx3",
            "score": 1,
            "text": "That article barely told me more than the headline ffs...",
            "title_similarity": "0.36176747",
            "sentiment_compound": -0.5859
        },
        {
            "id": "hixiq3u",
            "score": 1,
            "text": "I feel like even if the FBI took his paper away, he still *knows* how to make one (in theory at least). It's not like they neuralized him lmao",
            "title_similarity": "0.64257866",
            "sentiment_compound": 0.6474
        },
        {
            "id": "hixk8mh",
            "score": 1,
            "text": "They made a movie in the '80s with similar events (not sure if it was based on this)\r  \n\r  \nhttps://www.imdb.com/title/tt0091472/",
            "title_similarity": "0.3592592",
            "sentiment_compound": -0.2411
        },
        {
            "id": "hixk8q4",
            "score": 4,
            "text": "As I understand it, the mechanics behind making a bomb aren't terribly complex (relatively speaking). The hard part is accumulating necessary material. Which, luckily, is a very tough hurdle to overcome.",
            "title_similarity": "0.40522584",
            "sentiment_compound": 0.2098
        },
        {
            "id": "hixkqg4",
            "score": 1,
            "text": "nilered is that you?",
            "title_similarity": "-0.048928432",
            "sentiment_compound": 0.0
        },
        {
            "id": "hixksl9",
            "score": 1,
            "text": "He should sell the paper as an NFT",
            "title_similarity": "0.39420512",
            "sentiment_compound": 0.0
        },
        {
            "id": "hixkwnf",
            "score": 1,
            "text": "Give me a million dollars and I’ll make you a nuclear bomb in a year.",
            "title_similarity": "0.65600693",
            "sentiment_compound": -0.4939
        },
        {
            "id": "hixl088",
            "score": 1,
            "text": "\"....so does that mean it was an A+?\"",
            "title_similarity": "0.15982462",
            "sentiment_compound": 0.0
        },
        {
            "id": "hixldhc",
            "score": 1,
            "text": "Yea its easy you just need to have Doc Brown get you some plutonium",
            "title_similarity": "0.53855383",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hixlo8r",
            "score": 5,
            "text": "Its called information thats \"born secret.\" Private development of nuclear weapons is not allowed to be made public even if all the research was done privately and legally. You can read more about it [here](https://en.m.wikipedia.org/wiki/Born_secret#:~:text=%22Born%20secret%22%20and%20%22born,describes%20the%20operation%20of%20nuclear).",
            "title_similarity": "0.67785347",
            "sentiment_compound": -0.3612
        },
        {
            "id": "hixlomo",
            "score": 1,
            "text": "Forget having the dog eat tour homework, THIS is the new excuse for not turning in your assignments",
            "title_similarity": "0.51984435",
            "sentiment_compound": -0.1531
        },
        {
            "id": "hixm494",
            "score": 1,
            "text": "That man? Albert Einstein",
            "title_similarity": "0.40934992",
            "sentiment_compound": 0.0
        },
        {
            "id": "hixm5eo",
            "score": 1,
            "text": "He can just rewrite it...",
            "title_similarity": "0.20485249",
            "sentiment_compound": 0.0
        },
        {
            "id": "hixm5lr",
            "score": 1,
            "text": "C'mon Aaron, be serious, what happened to your homework?\n\nI swear I'm telling you the truth, the FBI ate it.",
            "title_similarity": "0.7087543",
            "sentiment_compound": 0.2023
        },
        {
            "id": "hixmie7",
            "score": 1,
            "text": "Wow...",
            "title_similarity": "-0.16408423",
            "sentiment_compound": 0.5859
        },
        {
            "id": "hixmix4",
            "score": 1,
            "text": "I think the main part miss with the danger of this info is that yes it requires some intense resource gathering and refining, it’s not your average Joe making a bomb but a smaller nation. One that’d have the abilities to get this and make a cheap efficient bomb.",
            "title_similarity": "0.646418",
            "sentiment_compound": -0.1779
        },
        {
            "id": "hixmnej",
            "score": 2,
            "text": "It's not that hard. North Korea can do it.",
            "title_similarity": "0.15805036",
            "sentiment_compound": 0.0762
        },
        {
            "id": "hixmnhz",
            "score": 1,
            "text": "Couldn't he just like ... rewrite it?",
            "title_similarity": "0.30032256",
            "sentiment_compound": -0.2755
        },
        {
            "id": "hixmpkl",
            "score": 1,
            "text": "Building a nuclear bomb is not that hard if you have access to refined uranium, unlimited money, and don't care about maximizing the yield. Fission *wants* to happen in sufficiently refined uranium. It's just a question of building a configuration that's sufficiently favorable for it that it can happen with exclusively prompt neutrons.",
            "title_similarity": "0.6073116",
            "sentiment_compound": -0.3468
        },
        {
            "id": "hixmu9q",
            "score": 1,
            "text": "My understanding of the process is that it's pretty simple coming up with the materials is the hard part.",
            "title_similarity": "0.27170914",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hixn2bm",
            "score": 1,
            "text": "the concept is simple,and the information is public but its a NIGHTMARE to build,why do you think it can be observed who makes weapons grade uranium? because it requires factories that are MASSIVE,if someone found a way to make weapons grade uranium without massive factories then its already a threat all in itself since every country would be able to do it",
            "title_similarity": "0.66615033",
            "sentiment_compound": -0.9231
        },
        {
            "id": "hixn6dm",
            "score": 1,
            "text": "Sufferin' from success",
            "title_similarity": "0.15683863",
            "sentiment_compound": 0.5719
        },
        {
            "id": "hixnhg6",
            "score": 1,
            "text": "The process of building a nuclear weapon is fairly easy to research. The challenge of actually building one comes from the extraordinary difficulty associated with gathering the materials to build one.\n\nHow to build a nuclear weapon has been published in newspapers before but it does nothing since it is impossible to get nuclear materials",
            "title_similarity": "0.69121444",
            "sentiment_compound": -0.2023
        },
        {
            "id": "hixnje6",
            "score": 255,
            "text": "This happened when i was an undergrad in the early 2000's too. The class was on terrorism and the culminating project was to plan a terror attack in every detail: target, costs, transportation, lodging, public communiques to be released after the attack, morbidity/mortality projections, possible fallout/retaliation, weapons, etc... \n\nWell, someone printed off a part of their report (contamination of milk supply trucks) with VERY accurate schedules found on open source... But forgot it on the library printer. You can imagine what happened next, FBI & DHS were all over the place. No one got in trouble, and we even continued our assignments but had to header/footer every document with \"THEORETICAL EXERCISE FOR GOV 1234 CLASS\".\n\nI was also reprimanded for conducting physical surveillance of my selected target without express permission of the instructor for my project. Still learned a lot by doing all that",
            "title_similarity": "0.7765883",
            "sentiment_compound": -0.9127
        },
        {
            "id": "hixnk76",
            "score": 1,
            "text": "How did the professor know enough to give him an A?",
            "title_similarity": "0.40605736",
            "sentiment_compound": 0.0
        },
        {
            "id": "hixnudo",
            "score": 1,
            "text": "So what did the FBI accomplish here?  \n\n\nAlright son you swear thats the only copy? \n\nOh I swear on my mother sir! \n\n\n( ͡° ͜ʖ ͡°)",
            "title_similarity": "0.64024353",
            "sentiment_compound": 0.6189
        },
        {
            "id": "hixnyn0",
            "score": 1,
            "text": "So I learned that a guy who wrote a \"How to build an A_Bomb for Dummies\" book now sells our (we who vote) info to politicans. This guy was destined to destroy people's lives....",
            "title_similarity": "0.7389831",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hixo6qx",
            "score": 1,
            "text": "This is an urban legend. The FBI doesn't ever do shit.",
            "title_similarity": "0.38915446",
            "sentiment_compound": 0.4449
        },
        {
            "id": "hixo8ip",
            "score": 1,
            "text": "This makes no sense. I could describe how to make one right now, it’s not exactly secret knowledge",
            "title_similarity": "0.32420653",
            "sentiment_compound": -0.296
        },
        {
            "id": "hixoa5x",
            "score": 1,
            "text": "According to the Wikipedia article on him, his faculty advisor is quoted as saying that the design was not functional: https://en.wikipedia.org/wiki/John_Aristotle_Phillips#Political_activity\n\nAlso, according to most sources, only one page was confiscated by the FBI.",
            "title_similarity": "0.72446436",
            "sentiment_compound": 0.0
        },
        {
            "id": "hixohlp",
            "score": 1,
            "text": "Theres youtube videos on it and if you research the chemical properties it isnt hard to come up with some roughly accurate numbers. The hard part is actually producing the material and theres basically no way in hell it can be done without a few hundred million to a billion dollars.",
            "title_similarity": "0.5409087",
            "sentiment_compound": -0.7848
        },
        {
            "id": "hixootf",
            "score": 1,
            "text": "Did the fbi think the paper was the only copy of that information?",
            "title_similarity": "0.58984923",
            "sentiment_compound": 0.0
        },
        {
            "id": "hixotm0",
            "score": 1,
            "text": "Ok, now you're overachieveing.",
            "title_similarity": "0.10737576",
            "sentiment_compound": 0.0
        },
        {
            "id": "hixp0it",
            "score": 1,
            "text": "There’s a ton of information out there on how a basic fission weapon works. As others have said, the limitation is on tools, materials and expertise and how to put this together.\n\nWhat gets the authorities really salty is if you start sharing information they isn’t public domain. Start asking about using hydrocodes to model and simulate a functional explosive lens, or to explore what magic materials make teller-ulam work in a highly compact warhead. That’s the stuff that gives arms control guys sweaty palms.",
            "title_similarity": "0.7108099",
            "sentiment_compound": -0.1531
        },
        {
            "id": "hixp1ii",
            "score": 2,
            "text": "TFW you write such a good paper that you ace it and get it confiscated by the fbi, but you’re still known as an underachiever\n\nEdit: typo",
            "title_similarity": "0.6734774",
            "sentiment_compound": 0.2382
        },
        {
            "id": "hixp8tm",
            "score": 2,
            "text": "What does underachieving have to do with anything though?",
            "title_similarity": "0.2811607",
            "sentiment_compound": 0.0
        },
        {
            "id": "hixpjbn",
            "score": 1,
            "text": "making a nuke isnt really that hard. getting the materials, THAT is where the challenge comes in.",
            "title_similarity": "0.3329869",
            "sentiment_compound": 0.2028
        },
        {
            "id": "hixpmi3",
            "score": 1,
            "text": "When I was a nuclear engineering student, one of our professors walked in the room and declared, \"today I'm going to teach you how to make a nuclear bomb\" and then he did.",
            "title_similarity": "0.76196384",
            "sentiment_compound": -0.4939
        },
        {
            "id": "hixps18",
            "score": 1,
            "text": "MUSHROOM: THE STORY OF THE A BOMB KID.",
            "title_similarity": "0.5595243",
            "sentiment_compound": -0.4939
        },
        {
            "id": "hixpydl",
            "score": 2,
            "text": "I think it was Pakistan trying to buy it from him that was the issue (lol no one here actually read the article including op it seems). Most Physics grads in 1977 should know how to build a nuclear bomb as it wasn't exactly a secret how they worked by then.\n\nI'm not even a physics grad but know the basics and could research the rest. I couldn't make one though as thats a different skill set and requires several billion dollars.\n\n\nThe article seems to be an advert for this guys shitty business. One of the sources is the guys own book and the other two are articles about the same book....it all smells of bullshit to me.",
            "title_similarity": "0.8049344",
            "sentiment_compound": -0.9169
        },
        {
            "id": "hixpzp3",
            "score": 2,
            "text": "What does it even mean “paper was taken by the FBI”? Did they destroy all copies? Deleted documents from computers? Are they protecting the student against kidnapping by some terrorists?",
            "title_similarity": "0.770024",
            "sentiment_compound": -0.8611
        },
        {
            "id": "hixqn5a",
            "score": 1,
            "text": "I wonder if he included the directions to make aerogel that includes lithium 6 and 7, or the needed casing reflector material to make a neutron weapon.",
            "title_similarity": "0.6224047",
            "sentiment_compound": -0.296
        },
        {
            "id": "hixquhf",
            "score": 1,
            "text": "I see this site was blessed with the old Reddit “hug”",
            "title_similarity": "0.0819391",
            "sentiment_compound": 0.5994
        },
        {
            "id": "hixr077",
            "score": 2,
            "text": "I read the article... what info is there that he was an \"underacheiving\" student?",
            "title_similarity": "0.5987449",
            "sentiment_compound": 0.0
        },
        {
            "id": "hixr0bu",
            "score": 1,
            "text": "Great",
            "title_similarity": "-0.2005781",
            "sentiment_compound": 0.6249
        },
        {
            "id": "hixr4bg",
            "score": 1,
            "text": "oh that thing? it’s on sparknotes web archive",
            "title_similarity": "0.15771174",
            "sentiment_compound": 0.0
        },
        {
            "id": "hixr5gx",
            "score": 1,
            "text": "This is obtainable for even an underachiever?! Interesting...",
            "title_similarity": "0.2065232",
            "sentiment_compound": 0.4574
        },
        {
            "id": "hixrkns",
            "score": 1,
            "text": "So if you actually read the article, the guy ends up doing something even worse for a living",
            "title_similarity": "0.5339048",
            "sentiment_compound": -0.4767
        },
        {
            "id": "hixrkr0",
            "score": 1,
            "text": "I know this will seem really naive and stupid but, once you have an understanding of the components is it really  that difficult to make a radioactive element go supercritical? Isnt it basically making it ionizing radiation reflect back and create fission on its own matter from its own energy?",
            "title_similarity": "0.6983998",
            "sentiment_compound": -0.383
        },
        {
            "id": "hixrp7j",
            "score": 1,
            "text": "I heard about this about 30 years ago in school",
            "title_similarity": "0.30901226",
            "sentiment_compound": 0.0
        },
        {
            "id": "hixrqo6",
            "score": 1,
            "text": "The FBI wants to build their own nuke apparently",
            "title_similarity": "0.69764656",
            "sentiment_compound": 0.0
        },
        {
            "id": "hixs4sx",
            "score": 1,
            "text": "1950s tech....",
            "title_similarity": "0.21797633",
            "sentiment_compound": 0.0
        },
        {
            "id": "hixsdbi",
            "score": 3,
            "text": "Couldn’t you hire some Libyans to steal your plutonium?",
            "title_similarity": "0.73182344",
            "sentiment_compound": -0.4939
        },
        {
            "id": "hixslf4",
            "score": 2,
            "text": "Underachievers are often people that care way more about their own opinion of themselves than what other people think. Ere go no need to work too hard for some bag of meat and bones to pat you on the back for something you already know you’re good at.",
            "title_similarity": "0.332703",
            "sentiment_compound": 0.5423
        },
        {
            "id": "hixsmkp",
            "score": 2,
            "text": "The fbi was on his radar.",
            "title_similarity": "0.3686026",
            "sentiment_compound": 0.0
        },
        {
            "id": "hixsn78",
            "score": 1,
            "text": "Well now I wanna write a paper on how to do it.",
            "title_similarity": "0.3277225",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hixsug6",
            "score": 2,
            "text": "Ya they’re still figuring out how Jan 6 happened with their high forehead surveillance knowledge.",
            "title_similarity": "0.39818108",
            "sentiment_compound": 0.0
        },
        {
            "id": "hixtl1p",
            "score": 5,
            "text": "He turned his potentially destructive mind towards...political data mining.",
            "title_similarity": "0.4870823",
            "sentiment_compound": -0.6124
        },
        {
            "id": "hixudo6",
            "score": 3,
            "text": "Making nuclear weapons is scarily trivial in theory. Getting the material is by far the only reason they aren't more widespread.",
            "title_similarity": "0.60842067",
            "sentiment_compound": -0.4588
        },
        {
            "id": "hixui7z",
            "score": 1,
            "text": "How did the FBI find out?",
            "title_similarity": "0.45548993",
            "sentiment_compound": 0.0
        },
        {
            "id": "hixv6k8",
            "score": 1,
            "text": "Underachieving?",
            "title_similarity": "0.15454067",
            "sentiment_compound": 0.0
        },
        {
            "id": "hixv8g8",
            "score": 7,
            "text": "[deleted]",
            "title_similarity": "0.12068858"
        },
        {
            "id": "hixvwh0",
            "score": 1,
            "text": "The logistics to pull this off is so challenging that becomes clear it's not only about knowledge...",
            "title_similarity": "0.19528566",
            "sentiment_compound": 0.5742
        },
        {
            "id": "hixw2rp",
            "score": 1,
            "text": "Reminds me of a certain book by George Orwell…",
            "title_similarity": "0.3408651",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hixw4st",
            "score": 2,
            "text": "Plain brown wrapper",
            "title_similarity": "0.112557024",
            "sentiment_compound": 0.0
        },
        {
            "id": "hixwtfi",
            "score": 3,
            "text": "Curiously, how does the FBI become aware of a random kid's college paper? Did the teacher give him an A and then tip off the feds? There are other comments in this thread talking about people writing college papers on nuclear related topics and the papers becoming classified.",
            "title_similarity": "0.8438386",
            "sentiment_compound": 0.0
        },
        {
            "id": "hixx1f9",
            "score": 2,
            "text": "“It’s very simple. Any undergraduate physics major could have done what I did.”  - Humble young guy",
            "title_similarity": "0.5734379",
            "sentiment_compound": 0.0
        },
        {
            "id": "hixx5nk",
            "score": 5,
            "text": "I took an engineering course in 1978 where one of the two end of term projects was designing a nuclear bomb.  The prof casually remarked that designing one was pretty routine;  getting the fissionable material was the hard part.  And he pointed out that every country that has tried to make a bomb (then) had succeeded, first time.",
            "title_similarity": "0.79948175",
            "sentiment_compound": -0.0258
        },
        {
            "id": "hixxnne",
            "score": 2,
            "text": "He need to use Nord VPN",
            "title_similarity": "0.19851622",
            "sentiment_compound": 0.0
        },
        {
            "id": "hixxurm",
            "score": 103,
            "text": "FUN FACT: Tom Clancy would have similar problems with his book *The Hunt For Red October*.\n\nThe FBI contacted Clancy, demanding to know who provided him with top secret information. When Clancy asked which bit was confidential, he was informed they couldn’t tell him that, as the information was confidential.",
            "title_similarity": "0.69311535",
            "sentiment_compound": 0.3034
        },
        {
            "id": "hixyace",
            "score": 1,
            "text": "The bomb is the easiest part. Any industrialized country could do that. It's the fuel that's the hard part.",
            "title_similarity": "0.48014644",
            "sentiment_compound": -0.2023
        },
        {
            "id": "hixyhtq",
            "score": 1,
            "text": "Even reading the title, I half expected that.",
            "title_similarity": "0.3210896",
            "sentiment_compound": 0.0
        },
        {
            "id": "hixylyq",
            "score": 2,
            "text": "Like that John Lithgow movie where that boy scout build a nuclear bomb.",
            "title_similarity": "0.75963867",
            "sentiment_compound": -0.1779
        },
        {
            "id": "hixz2y8",
            "score": 1,
            "text": "how can you be an underachiever and go to princeton? do they just pay to get in?",
            "title_similarity": "0.6658637",
            "sentiment_compound": -0.1926
        },
        {
            "id": "hixz4s1",
            "score": 1,
            "text": "This shitty country has never been free.",
            "title_similarity": "0.2841205",
            "sentiment_compound": -0.7432
        },
        {
            "id": "hixz9t5",
            "score": 3,
            "text": "They're really not that complicated. It's technically easy to design and build one... if you can get the proper grade of fissile material. Or fissile material period.",
            "title_similarity": "0.15804517",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hixziko",
            "score": 3,
            "text": "Barney Miller did it.\n\n https://www.youtube.com/watch?v=ib8StpzyxDE",
            "title_similarity": "0.2737331",
            "sentiment_compound": 0.0
        },
        {
            "id": "hixznpj",
            "score": 1,
            "text": "This sounds like BS. A nuclear bomb is not hard to make. It's making the fuel that is difficult. And making the fuel is not a super secret either, its just extremely resource consuming.",
            "title_similarity": "0.46183467",
            "sentiment_compound": -0.7227
        },
        {
            "id": "hiy0723",
            "score": 1,
            "text": "Jesus his job now is more malicious than the Hiroshima bomb. Sells voter information to political entities.",
            "title_similarity": "0.61240053",
            "sentiment_compound": -0.4939
        },
        {
            "id": "hiy0kwp",
            "score": 1,
            "text": "Making a crude bomb isn't that hard IIRC, it's getting the enriched radioactive material",
            "title_similarity": "0.5967067",
            "sentiment_compound": -0.7652
        },
        {
            "id": "hiy0wbv",
            "score": 1,
            "text": "And then he made something worse.",
            "title_similarity": "0.21399562",
            "sentiment_compound": -0.4767
        },
        {
            "id": "hiy153x",
            "score": 1,
            "text": "I believe a boyscout in Michigan built a functioning ,(this one's for baby Bush ) W.M.D. in his shed out back ,,complete with trigger AND ignition !",
            "title_similarity": "0.43040952",
            "sentiment_compound": 0.0
        },
        {
            "id": "hiy1a3w",
            "score": 1,
            "text": "\"Where the hell did you get the atomic bomb\"?https://i.imgur.com/FmUbdI4.jpg",
            "title_similarity": "0.69728476",
            "sentiment_compound": -0.6808
        },
        {
            "id": "hiy1cjt",
            "score": 1,
            "text": "I mean, you can look it up on Wikipedia. I don't know what the reason for the FBI taking it was, but literally anyone can find out *how* to build a nuke. Actually getting the materials and doing it is the hard part.",
            "title_similarity": "0.70933926",
            "sentiment_compound": -0.1531
        },
        {
            "id": "hiy1hn7",
            "score": 1,
            "text": "Now he is under surveillance by FBI",
            "title_similarity": "0.4515792",
            "sentiment_compound": 0.0
        },
        {
            "id": "hiy25xm",
            "score": 1,
            "text": "That student went on to become the founder and CEO of political gambling website [PredictIt](https://www.predictit.org/). Interesting life.\n\n[Proof](https://www.youtube.com/watch?v=uuVR04O2HWQ&ab_channel=PredictItOfficial)",
            "title_similarity": "0.5429422",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hiy2665",
            "score": 1,
            "text": "From my understanding there's actually doctorate programs where designing a bomb is a test question. They're surprisingly detailed YouTube videos talking about weapon design on a technical level.",
            "title_similarity": "0.63666904",
            "sentiment_compound": -0.4939
        },
        {
            "id": "hiy29db",
            "score": 1,
            "text": "He now works for the MIB 😎",
            "title_similarity": "0.19702229",
            "sentiment_compound": 0.4588
        },
        {
            "id": "hiy2x02",
            "score": 1,
            "text": "who narked?",
            "title_similarity": "0.09181721",
            "sentiment_compound": 0.0
        },
        {
            "id": "hiy39gj",
            "score": 1,
            "text": "Wait until you learn about the nuclear boy scout.",
            "title_similarity": "0.6762525",
            "sentiment_compound": 0.0
        },
        {
            "id": "hiy3smp",
            "score": 2,
            "text": "And that students name? Rodney McKay.",
            "title_similarity": "0.2798707",
            "sentiment_compound": 0.0
        },
        {
            "id": "hiy3xng",
            "score": 1,
            "text": "Imagine having that on your resume!",
            "title_similarity": "0.15208893",
            "sentiment_compound": 0.0
        },
        {
            "id": "hiy49tz",
            "score": 2,
            "text": "I remember reading an article about this back in the 80's. It talked about how he was able to get a lot of information through social engineering; specifically he was making phone calls pretending to be someone he wasn't and asking for information that he was not supposed to be able to get. He got that information. This should have been a huge wake-up call for companies and government agencies to keep better control over information that was supposed to be tightly protected but I doubt that it did.",
            "title_similarity": "0.6279788",
            "sentiment_compound": 0.128
        },
        {
            "id": "hiy4mio",
            "score": 1,
            "text": "I read his account about his paper decades ago. The hard bit was figuring out what explosive to use to create a perfectly even, spherical imploding shock wave. He called an explosives company, and went with the sales rep's suggestion.",
            "title_similarity": "0.76752174",
            "sentiment_compound": 0.5106
        },
        {
            "id": "hiy52o6",
            "score": 1,
            "text": "Goddamn it, kids….stop giving the FBI ideas.",
            "title_similarity": "0.52204484",
            "sentiment_compound": -0.1779
        },
        {
            "id": "hiy57ih",
            "score": 1,
            "text": "My org teacher taught us how to make meth step by step. I still have it in my notes. \n\nThe step by step diy nuclear bomb is out there. Good luck finding the material.",
            "title_similarity": "0.72554135",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hiy5yj2",
            "score": 1,
            "text": "The Iranians are probably taking note here.",
            "title_similarity": "0.28220555",
            "sentiment_compound": 0.0
        },
        {
            "id": "hiy63ba",
            "score": 1,
            "text": "I got told at school that a lot fo science teachers could tell you how to make a nuclear bomb, its just the ingredients that is the hard part",
            "title_similarity": "0.736064",
            "sentiment_compound": -0.5574
        },
        {
            "id": "hiy63wj",
            "score": 1,
            "text": "Nov 2006: U.S. Web Archive Is Said to Reveal a Nuclear Primer\n\n\"Last March, the federal government set up a Web site to make public a vast archive of Iraqi documents captured during the war. The Bush administration did so under pressure from Congressional Republicans who had said they hoped to “leverage the Internet” to find new evidence of the prewar dangers posed by Saddam Hussein.\n\nBut in recent weeks, the site has posted some documents that weapons experts say are a danger themselves: detailed accounts of Iraq’s secret nuclear research before the 1991 Persian Gulf war. The documents, the experts say, constitute a basic guide to building an atom bomb...\"\n\nhttp://large.stanford.edu/publications/crime/references/broad2/",
            "title_similarity": "0.78181446",
            "sentiment_compound": -0.9738
        },
        {
            "id": "hiy7ckv",
            "score": 1,
            "text": "Sounds like the plot to a future Riverdale season.",
            "title_similarity": "0.0906869",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hiy7k0k",
            "score": 1,
            "text": "what is taking away the paper going to do unless they wipe his memory also",
            "title_similarity": "0.49231446",
            "sentiment_compound": 0.0
        },
        {
            "id": "hiy7l6m",
            "score": 1,
            "text": "Sounds like an achievement to me. How many students can have that claim?",
            "title_similarity": "0.1746535",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hiy7qfb",
            "score": 1,
            "text": "I was taught how to do this in high school chemistry. There was a documentary and everything. I wonder why they would be worried considering how difficult it is for the average joe to get the materials.",
            "title_similarity": "0.7131734",
            "sentiment_compound": -0.5719
        },
        {
            "id": "hiy7w1t",
            "score": 1,
            "text": "Shucks... too bad they can't take his thinking process...",
            "title_similarity": "0.32818872",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hiy8a3o",
            "score": 1,
            "text": "The reference material was availible in the library here in 1968 when I looked it up.\n\nNot really a secret.",
            "title_similarity": "0.3221668",
            "sentiment_compound": 0.0
        },
        {
            "id": "hiy8d54",
            "score": 1,
            "text": "Wait so they pulled that thing from Recess?",
            "title_similarity": "0.42765933",
            "sentiment_compound": 0.0
        },
        {
            "id": "hiy8fbd",
            "score": 1,
            "text": "True, but this was in the 60’s when words like ‘Pit’ and “initiator”were heavily classified. As I recall, it was a plutonium device and not a Hiroshima device which can be fairly described as a nuclear IED.",
            "title_similarity": "0.66345775",
            "sentiment_compound": 0.631
        },
        {
            "id": "hiy8fzf",
            "score": 1,
            "text": "[Reminds me of the boys scout trying to build a nuclear reactor at 17](https://en.m.wikipedia.org/wiki/David_Hahn)",
            "title_similarity": "0.7163878",
            "sentiment_compound": 0.0
        },
        {
            "id": "hiy8le6",
            "score": 2,
            "text": "That is what using RefWorks will get you.  Do you think it and the other citation managers are being monitored?",
            "title_similarity": "0.22922158",
            "sentiment_compound": 0.0
        },
        {
            "id": "hiy9ui4",
            "score": 2,
            "text": "I helped campaign for him when he ran for Congress in 1982.",
            "title_similarity": "0.43183705",
            "sentiment_compound": 0.0
        },
        {
            "id": "hiyb574",
            "score": 1,
            "text": "So according the article he turned out into an asshole after all.",
            "title_similarity": "0.43985254",
            "sentiment_compound": 0.0
        },
        {
            "id": "hiybodg",
            "score": 2,
            "text": "Is this still a closely guarded secret? I was under the impression that every significant country has the ability to make a nuclear bomb, but there are international restrictions in place on who is **allowed** to make one.",
            "title_similarity": "0.7272676",
            "sentiment_compound": 0.1027
        },
        {
            "id": "hiybs2u",
            "score": 1,
            "text": "Like he didn't have a second copy",
            "title_similarity": "0.21468768",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hiyd7e8",
            "score": 2,
            "text": "If that's what the *underachiever* can do, imagine what the guy at the top of the class is capable of...\n\napart from being smart enough not to end up on a watch list, that is.",
            "title_similarity": "0.5412897",
            "sentiment_compound": 0.7269
        },
        {
            "id": "hiyffzl",
            "score": 1,
            "text": "I’m pretty sure this was included in an early episode of *Sliders*.",
            "title_similarity": "0.19262962",
            "sentiment_compound": 0.6705
        },
        {
            "id": "hiyg48x",
            "score": 3,
            "text": "Best 2 words in one sentence. \"Under achieving\" and \"princeton\"",
            "title_similarity": "0.31652322",
            "sentiment_compound": 0.6705
        },
        {
            "id": "hiyg9kx",
            "score": 1,
            "text": "And that student's name?",
            "title_similarity": "0.21554807",
            "sentiment_compound": 0.0
        },
        {
            "id": "hiyguxg",
            "score": 2,
            "text": "Pretty sure a vast majority of Tom Clancy novels tell you how to make weapons of mass destruction lol.",
            "title_similarity": "0.5399766",
            "sentiment_compound": 0.1779
        },
        {
            "id": "hiyhe5v",
            "score": 1,
            "text": "The FBI ate my homework",
            "title_similarity": "0.5487248",
            "sentiment_compound": 0.0
        },
        {
            "id": "hiyi4dv",
            "score": 1,
            "text": "I worked for his company for several years. Interesting guy.",
            "title_similarity": "0.3108068",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hiyiy5r",
            "score": 1,
            "text": "I wrote a recipe for Yellowcake. But no one took it away.",
            "title_similarity": "0.43344098",
            "sentiment_compound": -0.4215
        },
        {
            "id": "hiyj2f9",
            "score": 1,
            "text": "nuclear boyscout cackles in the distance",
            "title_similarity": "0.4946358",
            "sentiment_compound": 0.0
        },
        {
            "id": "hiykf51",
            "score": 2,
            "text": "Isn't the bomb bit the easy part. Its the enrichment etc that is hard.",
            "title_similarity": "0.5585926",
            "sentiment_compound": 0.6283
        },
        {
            "id": "hiyko3g",
            "score": 1,
            "text": "That paper better have been detailed instructions on where to get needed materials and a list of contacts to help with procurement, otherwise this seems like a big waste of time for federal resources!\n\nAnyone remotely interested in how nuclear bombs work has had the ability to read up on it for decades now! Personally, I remember reading very detailed papers on the difference between A and H type nuclear detonations back when I was still a teenager.\n\nHell, I bet you could even find an episode on it from one of those ‘How They Make This’ type TV shows! 😉😂",
            "title_similarity": "0.7703321",
            "sentiment_compound": 0.8164
        },
        {
            "id": "hiyl83u",
            "score": 1,
            "text": "Don’t you just smash 40kg or so of enriched uranium together using explosives?",
            "title_similarity": "0.6244209",
            "sentiment_compound": 0.0
        },
        {
            "id": "hiylbu6",
            "score": 2,
            "text": "Look up The Atomic Boy Scout, a kid made a nuclear reactor in his back yard as part of a Nuclear Energy achievement badge.",
            "title_similarity": "0.6667321",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hiylgcs",
            "score": 2,
            "text": "Just the A-bomb though; the aerogel or polystyrene - like substance used to channel the radiation from the fission primary to the fusion secondary stage in a thermonuclear device (Teller-Ulam design) is one of the most secret things ever. The original (or rather the last iteration of the) formula for making it was never written down, and when they had to refurbish warheads after the original scientists had died, it took quite some doing to re-engineer.",
            "title_similarity": "0.79432714",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hiym99i",
            "score": 2,
            "text": "I read somewhere that Tom Clancy encountered a similar problem when he wrote The Sum of All Fears. He just made an informed guess and it turns out he was exactly right, so the Feds (not sure if FBI, CIA, or Homeland Security, or whoever else) made him change it.",
            "title_similarity": "0.6626513",
            "sentiment_compound": -0.6202
        },
        {
            "id": "hiympav",
            "score": 1,
            "text": "I wonder if he was awarded the A before the FBI team or because the FBI came?",
            "title_similarity": "0.61789227",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hiynuby",
            "score": 2,
            "text": "“Underachieving” probably a lazy genius tbh but I’m not the FBI who took an interest in his work so what do I know.",
            "title_similarity": "0.52476394",
            "sentiment_compound": 0.5023
        },
        {
            "id": "hiyog97",
            "score": 1,
            "text": "For some reason the word \"underachieving\" makes this whole thing funny",
            "title_similarity": "0.18508309",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hiyoizg",
            "score": 1,
            "text": "Did he later became \"Fatman\" and work in the counter-terrorism unit, *Dead Cell*?",
            "title_similarity": "0.64787614",
            "sentiment_compound": -0.6486
        },
        {
            "id": "hiyq6om",
            "score": 1,
            "text": "Nuclear weapons for dummies.",
            "title_similarity": "0.58622885",
            "sentiment_compound": -0.4404
        },
        {
            "id": "hiyrhm4",
            "score": 2,
            "text": "\"Underachieving\" does not mean unintelligent. That word is shorthand for \"this person isnt the robot we want him to be.\"",
            "title_similarity": "0.42560324",
            "sentiment_compound": 0.4176
        },
        {
            "id": "hiyroes",
            "score": 2,
            "text": "The Feds treacherously stole his intellectual property.",
            "title_similarity": "0.55983686",
            "sentiment_compound": 0.5106
        },
        {
            "id": "hiys4xv",
            "score": 1,
            "text": "Apparently it’s not as easy as one might think. Precise machining is required to actually get it to work. If a college student could come up with this once, I’m guessing other people would also come up with it.  Or maybe the FBI has been busier than I thought!",
            "title_similarity": "0.6369952",
            "sentiment_compound": -0.4015
        },
        {
            "id": "hiysejd",
            "score": 3,
            "text": "Got expelled from an alternative school for writing a paper on how to make yellowcake. They me told to write an essay about anything though...",
            "title_similarity": "0.7878716",
            "sentiment_compound": -0.25
        },
        {
            "id": "hiysq4z",
            "score": 7,
            "text": "I still remember internet in the 90's... it was pretty easy to learn how to build a nuclear bomb.",
            "title_similarity": "0.5365191",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hiyuqld",
            "score": 1,
            "text": "What title missed: pakistani officials tried to get his paper and it prompted FBI to seize.",
            "title_similarity": "0.7168401",
            "sentiment_compound": -0.296
        },
        {
            "id": "hiyvd1f",
            "score": 26,
            "text": "Every time this comes up I feel compelled to note that his paper was never taken away by the FBI. It does not contain classified information. It was put on a \"do not circulate without permission of the chair of the Physics Department\" status at Princeton. Which was unusual and it is interesting that they did that (at the recommendation of his advisor, the famed physicist Freeman Dyson). But it is not illegal to have it or to have written it — it is not legally classified in any way.\n\nI have read it (and interviewed Phillips several times [for my book](http://book.nuclearsecrecy.com/)). It is good undergraduate physics work on the basics of an implosion nuclear weapons design for 1976. It does not contain anything you could not get off of Wikipedia today, though. [Here is the cover page](https://i0.wp.com/alexwellerstein.com/wp-content/uploads/2021/01/John-Aristotle-Phillips-Thesis-May-1976-cover-page.jpg?ssl=1), just for kicks.\n\nThe goal of Phillips writing the paper was to illustrate a point made by weapons design Ted Taylor, which was that basically anybody could figure out how to design a nuclear weapon by the 1970s. There was just enough information out there to do it, even if you were an underachieving undergraduate. So the only thing keeping a terrorist from a nuclear weapon was access to the fuel (fissile material). The paper was, in a roundabout way, an argument for better fissile material security.\n\nThe really bonkers thing is not any of the above, but that a few years later some agents from Pakistan tried to buy Phillips paper from him. He went to the FBI and this became part of an argument in Congress to stop a French reactor from being sold to Pakistan.",
            "title_similarity": "0.6625889",
            "sentiment_compound": -0.9203
        },
        {
            "id": "hiyvom5",
            "score": 1,
            "text": "One of the key parts that I don't understand how it works is how they time the detonation so perfectly (this compresses the fissile material into supercritical)",
            "title_similarity": "0.54688036",
            "sentiment_compound": 0.7481
        },
        {
            "id": "hiyxpvp",
            "score": 10,
            "text": "I remember a story about a professor on nuclear physics was giving a talk to congressmen about the threat of unfriendly nations developing nuclear weapons. One congressman tried dismissing the nuclear physicist by saying something to the effect of, \"yeah so they got the uranium, but they don't actually know how to assemble a bomb, it's way too complicated.\" \n\nIn response, the nuclear physicist professor said, \"Sir, that is literally one of the projects we give to our Ph.D students. By the time it's complete, they have a functioning nuclear bomb that's only missing the uranium.\"",
            "title_similarity": "0.88335",
            "sentiment_compound": -0.9153
        },
        {
            "id": "hiyy80d",
            "score": 1,
            "text": "I think there was an HAI video about this, but theres a bunch of research that gets Classified by the government prepublication. Things like weapons research, security research, etc. Obviously the stuff that the DOD does is classified if its important, but even independent research can be \"forcibly classified\", preventing the author from legally sharing it.",
            "title_similarity": "0.65354335",
            "sentiment_compound": 0.8338
        },
        {
            "id": "hiyzgev",
            "score": 1,
            "text": "Call me ignorant, but isn't the \"how\" of an atomic bomb pretty well known? I thought it was the resources and actual building that prevent individuals/countries from doing so.",
            "title_similarity": "0.7296593",
            "sentiment_compound": 0.3071
        },
        {
            "id": "hiyzmz9",
            "score": 1,
            "text": "And that student was…Bill Gates",
            "title_similarity": "0.28576452",
            "sentiment_compound": 0.0
        },
        {
            "id": "hiz03ht",
            "score": 1,
            "text": "princeton student has freedom of speech. should make his work public ASAP",
            "title_similarity": "0.41903445",
            "sentiment_compound": 0.6369
        },
        {
            "id": "hiz03mp",
            "score": 2,
            "text": "I worked on a project with a guy who did basically the same thing but in high school. He was in a class where the teacher was (in his opinion) exaggerating the difficulty in developing the A bomb and explaining why it takes government level teams to do it, whereas a lone rogue individual would not be capable.\nDude said, \"I dunno. Doesn't seem all that hard.\" \nThe teacher flippantly said, \"Ok let's see you do it, smarty pants.\"\n\nHe took it as a challenge, and after a month of researching how they worked, he developed a model where you would build one into a house in the city you wanted to target. (Solves the problem of transportation and delivery.) And turned it in to the teacher.\n\nA couple weeks later, he got a visit from the FBI. They came in and talked to him and his dad for an hour and a half. Once they were satisfied he did not obtain the design from anyone else and had no desire to build out the model or harm a US city, they told him, \"Your government would appreciate it if you didn't tell anyone else about your model, share the plans with anyone else, or put them down on paper again.\"\n\nI believed his story. He designed the inventory logistics and database system of a big box store you've heard of. He also did high level origami and had a couple other oddball skill hobbies. He was a polymath with the kind of brain and desire for challenges to do stuff just to see if he could.",
            "title_similarity": "0.78167474",
            "sentiment_compound": -0.7822
        },
        {
            "id": "hiz0vqh",
            "score": 1,
            "text": "Don't tell the FBI you just plagiarized wikipedia.",
            "title_similarity": "0.5934393",
            "sentiment_compound": 0.0
        },
        {
            "id": "hiz2f68",
            "score": 1,
            "text": "If this is the story I think it is, he got the information from Encyclopedia Britannica.  (It was hilarious.)",
            "title_similarity": "0.45847195",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hiz44en",
            "score": 1,
            "text": "And that student's name was... Albert Einstein.",
            "title_similarity": "0.45647484",
            "sentiment_compound": 0.0
        },
        {
            "id": "hiz515r",
            "score": 1,
            "text": "Here we go with all the fake i know someone bull shit stories",
            "title_similarity": "0.40900367",
            "sentiment_compound": -0.7717
        },
        {
            "id": "hiz5hqx",
            "score": 1,
            "text": "Inspired the movie The Manhattan Project, Matthew Broderick’s other Cold War 80s movie",
            "title_similarity": "0.53764653",
            "sentiment_compound": -0.1779
        },
        {
            "id": "hiz6550",
            "score": 1,
            "text": "Rumor is he is still on a list somewhere being watched....just like the rest of us",
            "title_similarity": "0.13740823",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hiz677i",
            "score": 1,
            "text": "Another fact, a similar thing happened with a truck driver except his wasn't confiscated. He didnt have a paper.\n\nNope. This man had the most detailed replica of the Little Boy Atomic Bomb that he made in his garage with the help of his son and publicly available papers regarding the Little Boy.\n\nDoing this earned him the nickname: \"Atomic John\"",
            "title_similarity": "0.73228097",
            "sentiment_compound": -0.0609
        },
        {
            "id": "hiz8u1q",
            "score": 1,
            "text": "That student? Abraham Lincoln.",
            "title_similarity": "0.38023096",
            "sentiment_compound": 0.0
        },
        {
            "id": "hiz8vsz",
            "score": 1,
            "text": "How did the FBI find out about the paper?",
            "title_similarity": "0.58298147",
            "sentiment_compound": 0.0
        },
        {
            "id": "hizb2k0",
            "score": 4,
            "text": "Okay but how the article ended left me reeling at what data mining really is when put simply like this \n\n* As of 2016, Phillips is in the business of political data mining—he finds out everything he can about individual voters and then sells that information to politicians. Aristotle’s massive private database contains detailed information on roughly 175 million American voters. The company was founded in 1983. (Source)*",
            "title_similarity": "0.6645255",
            "sentiment_compound": 0.5719
        },
        {
            "id": "hize6ni",
            "score": 2,
            "text": "Check out the last paragraph of the article… he’s now a data miner. Real ethical guy/s",
            "title_similarity": "0.4341752",
            "sentiment_compound": 0.5106
        },
        {
            "id": "hizeb4i",
            "score": 1,
            "text": "He could've just had a PDF copy of the paper somewhere.",
            "title_similarity": "0.36575395",
            "sentiment_compound": 0.0
        },
        {
            "id": "hizfqv0",
            "score": 2,
            "text": "Is nuclear science considered being an underachiever at princeton? Whats considered overachievers? Teleportation?",
            "title_similarity": "0.7649822",
            "sentiment_compound": 0.0
        },
        {
            "id": "hizgnk9",
            "score": 2,
            "text": "Surely a Princeton term paper has to cite references. So there must be something out there that explains the mechanics of it for him to get an A.",
            "title_similarity": "0.49981427",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hizgv1j",
            "score": 1,
            "text": "Probably a good idea it was taken",
            "title_similarity": "-0.027308613",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hizj2af",
            "score": 1,
            "text": "That's good for a paper.",
            "title_similarity": "0.012088226",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hizjxjb",
            "score": 3,
            "text": "I always wanted to know how to make nuke.  I obviously wouldn't have the resources or skills to actually build it, I just like seeing how things are made.(yes, I loved to watch \"how it's made\" when it was). Only problem is, I don't wanna search that up and have men in black knocking on my door.",
            "title_similarity": "0.58820033",
            "sentiment_compound": 0.5719
        },
        {
            "id": "hizr7hz",
            "score": 2,
            "text": "Do you mean... he *bombed* his term paper?",
            "title_similarity": "0.60442626",
            "sentiment_compound": 0.0
        },
        {
            "id": "hizs18n",
            "score": 1,
            "text": "Born secret? There was an N+1 experiment in mid 1960's that showed that 3 just-graduaded phisicist developed a design of A-bomb. Much needed information entered public domain later and key problems may be resolved numerically nowadays.",
            "title_similarity": "0.72092617",
            "sentiment_compound": -0.25
        },
        {
            "id": "hizt99n",
            "score": 1,
            "text": "That student? Albert Einstein",
            "title_similarity": "0.49350333",
            "sentiment_compound": 0.0
        },
        {
            "id": "hiztqz7",
            "score": 1,
            "text": "In February 1977, several months after the story first went public, Phillips was contacted by a Pakistani official trying to purchase the bomb design. By that point the Federal Bureau of Investigation had confiscated Phillips’s term paper along with a mockup of the bomb he had constructed in his dormitory room.",
            "title_similarity": "0.81830335",
            "sentiment_compound": 0.8402
        },
        {
            "id": "hizujwm",
            "score": 1,
            "text": "Feds can take away a college paper but but a bunch of terrorist highjackers enrolled in flight school is A-ok!",
            "title_similarity": "0.791201",
            "sentiment_compound": -0.8335
        },
        {
            "id": "hizzyf6",
            "score": 5,
            "text": "There is this weird concept in the US called \"born secret\", especially with nuclear weapons. Even if you've found out yourself how it works, it may still be confidential and indeed you get some rather determined visitors taking away all your research.\n\nhttps://en.wikipedia.org/wiki/Born\\_secret",
            "title_similarity": "0.7876851",
            "sentiment_compound": -0.3897
        },
        {
            "id": "hj02e2d",
            "score": 2,
            "text": "The fact he knew how meant it had to be public so why take it?",
            "title_similarity": "0.3164652",
            "sentiment_compound": 0.0
        },
        {
            "id": "hj03nhz",
            "score": 1,
            "text": "Quiet Kid 2.0",
            "title_similarity": "0.061701644",
            "sentiment_compound": 0.0
        },
        {
            "id": "hj0cilc",
            "score": 1,
            "text": "I'm like 90% certain this incident inspired part of Rodney McKay's backstory in SGA.",
            "title_similarity": "0.31236368",
            "sentiment_compound": 0.7783
        },
        {
            "id": "hj0j6p6",
            "score": 1,
            "text": "So how did the FBI get involved in a student’s paper in the first place? Somebody get sus or good old fashioned wholesale surveillance?",
            "title_similarity": "0.75275046",
            "sentiment_compound": 0.504
        },
        {
            "id": "hj1yd8i",
            "score": 1,
            "text": "Same guy discovered the clitoris",
            "title_similarity": "0.32377088",
            "sentiment_compound": 0.0
        },
        {
            "id": "hj2cr67",
            "score": 1,
            "text": "The course is still offered: Theory and Politics of Terrorism at George Mason... I took it as an undergrad, but it helped when i later got a Masters in Biodefense (aka bioterrorism)",
            "title_similarity": "0.6704922",
            "sentiment_compound": -0.4215
        },
        {
            "id": "hj7h0ch",
            "score": 1,
            "text": "Idk, seems like he was overachieving if anything",
            "title_similarity": "0.23674768",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hjfc9ua",
            "score": 1,
            "text": "Thats nothing compared to the teenager nicknamed the \"Nuclear Boy Scout\" that built a breeder reactor in his family's tool shed. https://en.wikipedia.org/wiki/David_Hahn\n\nI've come across a lot of wild stories in my life but have yet to find a story crazier than that one.",
            "title_similarity": "0.667597",
            "sentiment_compound": -0.0387
        },
        {
            "id": "hjndxyk",
            "score": 1,
            "text": "The Manhattan Project (1986) called and wants it’s plot back.",
            "title_similarity": "0.48213905",
            "sentiment_compound": 0.0
        },
        {
            "id": "hjwb4v8",
            "score": 2,
            "text": "I read a really good interview the other day with the writers of Leverage. It’s a tv show about criminals who sabotage other criminals, basically. The writers came up with a white collar crime so perfect that the FBI forbade them from airing the episode.",
            "title_similarity": "0.7590916",
            "sentiment_compound": -0.7481
        },
        {
            "id": "hl2s1gc",
            "score": 1,
            "text": "Buy up Ukrainian smoke detectors in bulk (needs Americium 241) and you too can make and improvised radiological device good enough to irradiate Manhattan",
            "title_similarity": "0.6320036",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hm8kpcr",
            "score": 1,
            "text": "Read this in college in the late 80s. Found it fascinating in a Student did that? kind of way. \n[Esquire: HOW I DESIGNED AN A-BOMB MY JUNIOR YEAR AT PRINCETON AUGUST 1 1978 JOHN ARISTOTLE PHILLIPS, DAVID MICHAELIS](https://classic.esquire.com/article/1978/8/1/how-i-designed-an-a-bomb-my-junior-year-at-princeton)",
            "title_similarity": "0.7189822",
            "sentiment_compound": 0.5423
        },
        {
            "id": "hn04iaj",
            "score": 1,
            "text": "Reminds me of that kid that constructed a functioning nuclear reactor in a shed and later met with the man in black.",
            "title_similarity": "0.65187967",
            "sentiment_compound": 0.0
        }
    ]
}