{
    "TIL Cats domesticated themselves. They existed unchanged until the Middle Ages; and even now are genetically extremely close to their ancestors.\n": [
        {
            "id": "hm8haox",
            "score": 7,
            "text": "Its one hypothesis, one that's essentially impossible to prove. \n\nBeing Reddit this inevitably turns into a bunch of people anthropomorphizing their cats and 'proving it' with personal anecdotes. \n\nGod I hate this place sometimes.",
            "title_similarity": "0.4061043",
            "sentiment_compound": -0.3818
        },
        {
            "id": "hm80vnr",
            "score": 8,
            "text": "Cats are literally the best creature",
            "title_similarity": "0.59901744",
            "sentiment_compound": 0.6369
        },
        {
            "id": "hm8inwz",
            "score": 1,
            "text": "Cats suck",
            "title_similarity": "0.24723302",
            "sentiment_compound": -0.4404
        },
        {
            "id": "hm7wj2p",
            "score": 6,
            "text": "Once an a-hole, always an a-hole.",
            "title_similarity": "0.26097608",
            "sentiment_compound": 0.0
        },
        {
            "id": "hm8ffhd",
            "score": -6,
            "text": "Yeah, thats because they are parasites.",
            "title_similarity": "0.14608212",
            "sentiment_compound": 0.296
        },
        {
            "id": "hm8ol69",
            "score": 6,
            "text": "I **laugh out loud** at anyone who unironically says that housecats are in any way shape or form 'domesticated' -- and if cats understood us well enough to grasp the meaning of those words, *they* would laugh their furry asses off at you, too, right before taking a massive dump in your shoes.\n\nEDIT: Why downvote me on this? Is someone actually *offended* at this? Really? Have you no sense of humor? **FYI I like cats**. Take it easy.",
            "title_similarity": "0.44210777",
            "sentiment_compound": 0.9221
        },
        {
            "id": "hm8588a",
            "score": 6,
            "text": "Still, there's a reason why we allow dogs of all sizes in our homes, but most housecats are no bigger than a toy poodle.",
            "title_similarity": "0.5361548",
            "sentiment_compound": -0.4109
        },
        {
            "id": "hm8lsfc",
            "score": 9,
            "text": "Keep your fucking cats indoors.",
            "title_similarity": "0.44941804",
            "sentiment_compound": 0.0
        },
        {
            "id": "hm7nmtr",
            "score": -18,
            "text": "Pretty sure this is a myth.",
            "title_similarity": "0.18533143",
            "sentiment_compound": 0.6705
        },
        {
            "id": "hm7ki0k",
            "score": -12,
            "text": "Cats are not domesticated.",
            "title_similarity": "0.34490317",
            "sentiment_compound": 0.0
        },
        {
            "id": "hm7gcum",
            "score": 162,
            "text": "I love my murder-machine but, in line with today's news from Australia, they 100% should be indoor-only.",
            "title_similarity": "0.5413945",
            "sentiment_compound": 0.3818
        },
        {
            "id": "hm8uer7",
            "score": -6,
            "text": "Cats are better than dogs.",
            "title_similarity": "0.4509461",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hm92nyt",
            "score": -3,
            "text": "And yet some people think they can be happy as inside animals. These natural killers barely diverged from their wild cousins are just fine in a studio apartment with a cat tower. Right.",
            "title_similarity": "0.6524078",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hm8xitd",
            "score": -3,
            "text": "Trump supporter",
            "title_similarity": "0.30311435",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hm93n6i",
            "score": 0,
            "text": "I live vicariously through my cats, I sleep more that way",
            "title_similarity": "0.6366346",
            "sentiment_compound": 0.0
        },
        {
            "id": "hm9b6n5",
            "score": 0,
            "text": "I wish Americans could do this.",
            "title_similarity": "0.26653486",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hm9enfw",
            "score": 0,
            "text": "You could tell this sentence for ANY domesticated animal. What a money waste this research was.",
            "title_similarity": "0.36393338",
            "sentiment_compound": -0.3453
        },
        {
            "id": "hmav7hu",
            "score": 0,
            "text": "That’s 100% false. The only man ever to do a scientific study on cats, concluded they are not domesticated at all. They are partially docile, unintelligent, and dangerous to all environments they are introduced to. Also, they don’t bring gifts of dead things because they love or care about you. They do it because they see you as an extremely stupid cat that can’t hunt for itself.",
            "title_similarity": "0.51919377",
            "sentiment_compound": -0.7713
        },
        {
            "id": "hm7m97o",
            "score": 73,
            "text": "Dogs have a family. Cats have a staff.",
            "title_similarity": "0.56410265",
            "sentiment_compound": 0.0
        },
        {
            "id": "hm7g8vc",
            "score": 96,
            "text": "[deleted]",
            "title_similarity": "0.07834196"
        },
        {
            "id": "hm804gm",
            "score": 42,
            "text": "Also why you should feed wet food over dry food. They are obligate carnivores and don’t process plant-based products or carbohydrates, and kibble is 30-50%+ carbohydrate. It tends to translate to fat and raise insulin levels to insane peaks their bodies weren’t designed at all for. Wet food regardless of brand is naturally low carb, as well as high in moisture. Cats further evolve to get most of their moisture from the animals they eat and don’t have much of a thirst reflex. \n\nTLDR: wet food diets prevent diabetes, urinary crystals, UTIs, and kidney failure. Don’t free feed, and avoid dry food whenever possible because your cat is genetically identical to an obligate carnivore. \n\nSources: feline-nutrition.org, catinfo.org, littlebigcat.com, also spent years working in animal hospitals and can attest to miraculous differences in cats who had this diet change when instructed by vets.",
            "title_similarity": "0.52371335",
            "sentiment_compound": -0.5859
        },
        {
            "id": "hm7trw4",
            "score": 1,
            "text": "P.S.  They never become fully domesticated. They’re always savages. 😼",
            "title_similarity": "0.2767593",
            "sentiment_compound": -0.2263
        },
        {
            "id": "hm7xk2d",
            "score": 1,
            "text": "One gene delta can cause enormous differences. Just look at primates and humans. Misleading title.",
            "title_similarity": "0.2577837",
            "sentiment_compound": -0.4019
        },
        {
            "id": "hm8211e",
            "score": 1,
            "text": "[All cats have an element of psychopathy.](https://www.independent.co.uk/life-style/cat-psychopath-study-science-test-b1964701.html)",
            "title_similarity": "0.45665342",
            "sentiment_compound": 0.0
        },
        {
            "id": "hm8pkl4",
            "score": 1,
            "text": "I hate observing this reddit phenomenon. A comic gets posted about how cats domesticated themselves, or sometimes its a comment on a popular post, and then half a day later someone uses the content for a full post. Y’all are basic plain and simple",
            "title_similarity": "0.5199262",
            "sentiment_compound": -0.2263
        },
        {
            "id": "hm8t9qq",
            "score": 1,
            "text": "Cats win the “most individualistic” superlative .  Interesting thought about them not having “social hierarchy” .  This is a pretty loaded subject , I actually think about it a lot , they’re a really significant species .  Their predation aspects too, while lots of nature doesn’t eat other animal flesh .  Idk if any of these sentences are even coherently linked, but supposedly people used to “worship cats” whatever that means, if it’s even true.  Cool to hear there’s cat mummies too.",
            "title_similarity": "0.63170457",
            "sentiment_compound": 0.909
        },
        {
            "id": "hm8vjg0",
            "score": 1,
            "text": "Since cats sleep during the day, I would pet my cat during his bed time. However if he would ever get into the bedroom at night he would cuddle my face.\n\nTurn around is fair play...",
            "title_similarity": "0.51685745",
            "sentiment_compound": 0.5719
        },
        {
            "id": "hm8w2zg",
            "score": 1,
            "text": "The anti cat and \"cats are demons\" sentiment in the middle ages was pretty horrific though. Poor babies.",
            "title_similarity": "0.42219722",
            "sentiment_compound": -0.765
        },
        {
            "id": "hm9enfo",
            "score": 1,
            "text": "Cats also carry a brain parasite that makes rats unafraid of them. This parasite has also been found in humans. Although it's not proven to effect human behaviour, I like the idea that cats are actually hideously repulsive creatures, like giant spiders or something, but because of the parasite we perceive them as being adorably cute and fluffy.",
            "title_similarity": "0.45060885",
            "sentiment_compound": 0.8922
        },
        {
            "id": "hm9ey85",
            "score": 1,
            "text": "Stubborn fucks",
            "title_similarity": "0.08512122",
            "sentiment_compound": -0.7003
        },
        {
            "id": "hm9zr5l",
            "score": 1,
            "text": "Because we keep feeding the selfish little shits.",
            "title_similarity": "0.21797988",
            "sentiment_compound": -0.7102
        },
        {
            "id": "hma0qrk",
            "score": 1,
            "text": "They’re still wild ass holes. That’s what makes them funny though. Well most of the time it’s funny.",
            "title_similarity": "0.23643243",
            "sentiment_compound": 0.5267
        },
        {
            "id": "hma32to",
            "score": 1,
            "text": "So… they’re parasites",
            "title_similarity": "0.077260345",
            "sentiment_compound": 0.0
        },
        {
            "id": "hm7z8jb",
            "score": 25,
            "text": "Also Cats infect us with [toxoplasmosis](https://www.bustle.com/articles/169131-does-toxoplasmosis-make-you-like-cats-this-video-could-explain-your-feline-enthusiasm) which makes us like them. ;)",
            "title_similarity": "0.45257777",
            "sentiment_compound": 0.5267
        },
        {
            "id": "hm7l93c",
            "score": 8,
            "text": "They never domesticated themselves, they exploited us.  They are small, cute, furry and warm.  As a  plus, they purr.\n\nLittle devils are irresistible.",
            "title_similarity": "0.43310344",
            "sentiment_compound": -0.0953
        },
        {
            "id": "hm85v8m",
            "score": 2,
            "text": "“Domesticated.”",
            "title_similarity": "0.2866065",
            "sentiment_compound": 0.0
        },
        {
            "id": "hm86cdf",
            "score": -2,
            "text": "Cats are smarter than dogs, they have a larger toolbox. I've acquainted many cats and I've never seen a cat re-consume their own vomit, like dogs may do. They also don't eat feces.",
            "title_similarity": "0.601984",
            "sentiment_compound": 0.6705
        },
        {
            "id": "hm89i2y",
            "score": 2,
            "text": "I had a friend who explained it like this:\n\nDogs see us feeding them and think “wow, they must be gods.”\n\nCats see us feeding them and think “wow, we must be gods.”",
            "title_similarity": "0.54543114",
            "sentiment_compound": 0.6908
        },
        {
            "id": "hm8lk5w",
            "score": 2,
            "text": "Kind of creepy that their toxoplasma gondii might have helped with them getting straight up idolized by the Egyptians.  Just a little unsettling that we can be very subtly controlled by a organism that has a symbiotic relationship with cats.\n\nScience has just shown that toxoplasma gondii infections will make people like cats more, but also get into accidents more frequently and be a little more quick to anger. I can only assume it was a LOT more prevalent back then since there wasn't really such a thing as an indoor cat. We'd probably still have developed a relationship with them because of rodent extermination etc., but I wonder if we'd have gotten to the level of worship that the Egyptians did if it weren't for the toxo component?",
            "title_similarity": "0.5533295",
            "sentiment_compound": -0.6592
        },
        {
            "id": "hm90278",
            "score": 2,
            "text": "They domesticated jack shit",
            "title_similarity": "0.3561101",
            "sentiment_compound": -0.5574
        },
        {
            "id": "hm95tri",
            "score": 2,
            "text": "Yeah that poo poison got y’all. Haha",
            "title_similarity": "0.2327681",
            "sentiment_compound": 0.1779
        },
        {
            "id": "hm9vhd5",
            "score": 2,
            "text": "r/letushatecats",
            "title_similarity": "0.18977025",
            "sentiment_compound": 0.0
        },
        {
            "id": "hm7k7hm",
            "score": 29,
            "text": "Tl;dr - cats haven’t evolved.",
            "title_similarity": "0.4660909",
            "sentiment_compound": 0.0
        },
        {
            "id": "hm80xak",
            "score": 9,
            "text": "[How did cats evolve?](https://www.youtube.com/watch?v=wS-3_flpX9s&ab_channel=UCD-UniversityCollegeDublin)\n\nWarning: this guy is an actual geneticist, he won't just tell you whatever it is you want to hear.",
            "title_similarity": "0.53228223",
            "sentiment_compound": -0.3527
        },
        {
            "id": "hm8gx73",
            "score": 3,
            "text": "I always hate this \"factoid\", because it is in no way any different from any other domestication.  Like, I could just as well say that wheat domesticated us -- it found a species it could make dependent on it, and basically adapted that species to spend their lives learning how to grow and protect wheat from disease and pests.  We've defended huge tracts of land for wheat.\n\nFrom the wheat's perspective, it domesticated us.\n\nBut since we look at things from a human perspective, we consider wheat to be the domesticated one in the relationship.\n\nDogs and cats were domesticated in very similar ways -- we had a use for them, and our helping them caused them to, over time, become more adapted to living with us and being our helpers.  The big difference is just that dogs were domesticated tens of thousands of years earlier, and thus are more changed from their ancestors.\n\nOur use for cats really only came about with our switch from hunter/gatherer life to an agrarian one, which was 9k - 10k years ago.  Everything \"domesticated itself\", just as much as everything was domesticated by us.",
            "title_similarity": "0.5624341",
            "sentiment_compound": 0.7391
        },
        {
            "id": "hm8lb05",
            "score": 3,
            "text": "Dogs domesticated themselves too. If you want to look at it that way.",
            "title_similarity": "0.46743777",
            "sentiment_compound": 0.0772
        },
        {
            "id": "hm87lja",
            "score": 14,
            "text": "[deleted]",
            "title_similarity": "0.07834196"
        },
        {
            "id": "hm87nq9",
            "score": -4,
            "text": "As in they dont want you to touch or hold them but you can play with them and look at them from a distance?",
            "title_similarity": "0.19881514",
            "sentiment_compound": 0.4568
        },
        {
            "id": "hm8b35u",
            "score": 4,
            "text": "Is this why my cat doesn't like it when I pick him up and then snuffle his belly?",
            "title_similarity": "0.40541467",
            "sentiment_compound": -0.2755
        },
        {
            "id": "hm7e63h",
            "score": 1027,
            "text": "Cats are the fucking best, man. They are wild and alien in a way the dogs aren’t but also totally hilarious and loving.",
            "title_similarity": "0.49447942",
            "sentiment_compound": 0.9257
        },
        {
            "id": "hm7v6eh",
            "score": 34,
            "text": "I have two cats that I love to death, but I can't help but feel like they're both… “special” in some way. Fairly certain one of them is autistic and the other is incapable of feeling pain, given one of his favorite sleeping spots is a pile of sharp volcanic rocks we have in our backyard.",
            "title_similarity": "0.55897516",
            "sentiment_compound": 0.0163
        },
        {
            "id": "hm83h0m",
            "score": 20,
            "text": "There’s actually a lot of debate over whether cats are domesticated at all.  The Smithsonian even says cats are “domesticated when they want to be” which basically means they’re not.",
            "title_similarity": "0.59557843",
            "sentiment_compound": 0.0772
        },
        {
            "id": "hm7eyhl",
            "score": 1256,
            "text": "Cats domesticated us.",
            "title_similarity": "0.5877228",
            "sentiment_compound": 0.0
        },
        {
            "id": "hm81ei1",
            "score": 52,
            "text": "My personal pet theory is that the reason cats will bring dead animals to your doorstep, is that back in ancient times people would reward cats for protecting their grain stores.\n\nAs in, early agricultural societies stored their grain to use throughout the year, and they didn’t want rodents to eat it. So when a cat killed a mouse, if it brought the mouse to the people, they would reward the cat with milk or cream or something.\n\nOver time, the cats that were more comfortable around humans and brought the dead mice like that, ended up being the ones that became domesticated.\n\nSo after many generations, the cats that ended up living with humans, are exactly the ones that would present dead mice to them.",
            "title_similarity": "0.64230466",
            "sentiment_compound": -0.6815
        },
        {
            "id": "hm7k072",
            "score": 130,
            "text": "They make us think they domesticated themselves.. this is exactly what they want",
            "title_similarity": "0.417566",
            "sentiment_compound": 0.0772
        },
        {
            "id": "hm7tjb0",
            "score": 23,
            "text": "I am certain they have genetic memory of their time with the Egyptians, and how they were worshipped like gods.\n\nI am convinced. Not in that hard proof way, but in the way that it makes sense in explaining cat behaviors.",
            "title_similarity": "0.65404254",
            "sentiment_compound": 0.6856
        },
        {
            "id": "hm8d29q",
            "score": 23,
            "text": "This article is slap full of misinformation and falsehoods. The egyptians for one were selectively breeding cats far far before the middle ages.   \nAnd this quote is just moronic and likely tells you everything you need to know about the \"scientist\"  \n\n\n“I think that there was no need to subject cats to such a selection   \nprocess since it was not necessary to change them,” said evolutionary   \ngeneticist and study coauthor Eva-Maria Geigl to National Geographic. “They were perfect as they were.”",
            "title_similarity": "0.6768556",
            "sentiment_compound": -0.4404
        },
        {
            "id": "hm7euvk",
            "score": 121,
            "text": "So typical of a cat",
            "title_similarity": "0.44116366",
            "sentiment_compound": 0.0
        },
        {
            "id": "hm8n4lb",
            "score": 71,
            "text": "That’s one of my favorite jokes:  two dogs and a cat enter heaven and meet God sitting on a golden throne.  God asks the Doberman what he believes in and the dog says “I believe in loyalty and dedication” and God says “for this you may sit on my left side”.  God then asks the Collie what he believes in and the dog says “I believe in working hard and never giving up” and God invites him to sit at his right side.  Then God asks the cat what he believes in and the cat answers “I believe you are sitting in my chair”.",
            "title_similarity": "0.5738852",
            "sentiment_compound": 0.9582
        },
        {
            "id": "hm7v7ob",
            "score": 30,
            "text": "Well, yeah, they don't need to evolve since they figured out how to enslave humans in a way that humans are *glad* to be their devoted servants.",
            "title_similarity": "0.556183",
            "sentiment_compound": 0.5994
        },
        {
            "id": "hm7idmi",
            "score": 432,
            "text": "I long to give as little fuck as a cat",
            "title_similarity": "0.38334465",
            "sentiment_compound": -0.4951
        },
        {
            "id": "hm8fkd6",
            "score": 81,
            "text": "There was a stray that kept coming into our garden about 10 years ago. I kept giving her tins of tuna. She was so thin. Mum was out so I just kept feeding her. She kept coming back. \n\nOne day mum was off as this cat sat at our back doorstep just waiting. So mum fed her too. \n\nNow. My dad is insanely allergic to cats. But we ended up taking her in because mums sensitive and dad was like, okay I’ll deal with antihistamines. \n\nThe latch on the kitchen window was open and this cat found a way to open the thing from the outside and come in that way. One day, she came in. And so did 6 Tom cats. \n\nMum shooed them away and our cat ended up pregnant. My dad came downstairs and found she was in distress and helped her birth 5 healthy kittens. While he was puffing up, because of his allergies. We kept the kittens and the cat until dad got a severe chest infection and we had to give them all away. Dad loved her, and we were all heartbroken. She chose us, but dad was getting so poorly, and my grandma refused to come round because of her severe phobia of cats. \n\nWe still think about pretzel to this day, and how she chose us to be her family. What a cat. (And obv, a top shagger with 6 toms in the kitchen. What a girl).\n\nEdit:spellings",
            "title_similarity": "0.5713378",
            "sentiment_compound": -0.8294
        },
        {
            "id": "hm81ij8",
            "score": 93,
            "text": "Domesticating yourself is the most cat thing ever. “ I will not be domesticated!…well, ok, I’m domesticated now. On my own terms, mind you”",
            "title_similarity": "0.5540914",
            "sentiment_compound": 0.0
        },
        {
            "id": "hm7x77e",
            "score": 38,
            "text": "You could make an argument that various other animals are like this too. Cats found human settlements useful places to hunt, they’re not big enough to hurt humans so humans don’t mind them, they’re not useful as sources of food and don’t spread disease. They eat the rats and make good pets.\n\nIf anything we are currently in the process of domesticating them. But cats are so good at surviving on their own it’s a tough battle. They don’t really need it, and it’s hard to pass down the genes of well socialized cats.",
            "title_similarity": "0.5519424",
            "sentiment_compound": 0.7355
        },
        {
            "id": "hm7ik4d",
            "score": 5805,
            "text": "The ancient Egyptians worshipped cats as gods. And the cats never really got past it.",
            "title_similarity": "0.6285417",
            "sentiment_compound": 0.5719
        },
        {
            "id": "hm7hu70",
            "score": 51,
            "text": "If they fit, they sit",
            "title_similarity": "0.24172851",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hm7v9fm",
            "score": 682,
            "text": "I mean, you see all those videos of stray cats latching onto people and refusing to let go?\n\nSymbiosis with humans is a survival strategy for them. They very clearly pick their human. Humans provide food and keep away larger predators, and in turn cats have made themselves attractive by dealing with vermin and appealing to the human weakness for cute things.\n\nHumans bent dogs to our will, but with cats it was kind of a mutually beneficial arrangement that cats evolved into taking full advantage of.",
            "title_similarity": "0.5144353",
            "sentiment_compound": 0.7612
        },
        {
            "id": "hm7lc92",
            "score": 314,
            "text": "My cat better domesticate  herself a little more and stop peeing in my plants.\n..",
            "title_similarity": "0.47623098",
            "sentiment_compound": 0.1742
        },
        {
            "id": "hm7u65n",
            "score": 642,
            "text": "[Both](https://i.imgur.com/i3WxOaV.jpg) of my cats are very affectionate (which surprised me, because they're ex-strays and I thought life on the street would make them harsh, solitary creatures), so if they're genetically close to their ancestors, then I can imagine mine building a box for the pet sabretooth tiger.",
            "title_similarity": "0.6252665",
            "sentiment_compound": 0.352
        },
        {
            "id": "hm81jz8",
            "score": 1208,
            "text": "Ever seen an African wild cat? It's the species domestic cats evolved from. \n\n[It's just a cat. They even let people pet them.](https://youtu.be/G_XEhm0JAj0)",
            "title_similarity": "0.6124041",
            "sentiment_compound": 0.0
        },
        {
            "id": "hm84xk7",
            "score": 1199,
            "text": "Can't remember the comedian, but I honestly think they had this right.\n\nCat: Hey. You gonna eat that? *points to mouse.*\n\nHuman: That thing? Ew no. It eats all my food and tastes terrible.\n\nCat: Awesome, dibs.\n\nLater...\n\nCat: Hey, you okay if I sleep here?\n\nHuman: Sure?\n\nCat: Cool.\n\nMuch later...\n\nCat: Hey I need to go kill some more mice, can you watch these for me? *Points to kittens.*\n\nHuman: This is the fucking cutest thing ever, I will die for it.",
            "title_similarity": "0.45347363",
            "sentiment_compound": 0.7819
        },
        {
            "id": "hm7jw01",
            "score": 4374,
            "text": "We have 3 cats and they are all equally capable of herding their human cattle to their feeding trays.",
            "title_similarity": "0.51652676",
            "sentiment_compound": 0.3818
        },
        {
            "id": "hm7lt9t",
            "score": 384,
            "text": "The cat scientific name “Felis silvestris” used in the article cracks me up.  So that’s why he is called Sylvester the Cat!",
            "title_similarity": "0.49766883",
            "sentiment_compound": 0.0
        },
        {
            "id": "hm7ukln",
            "score": 4924,
            "text": "Cats are a mini version of apex predators that you can snuggle.",
            "title_similarity": "0.49014997",
            "sentiment_compound": 0.0
        },
        {
            "id": "hm7iags",
            "score": 972,
            "text": "It's just easier to let people feed you and clean up your messes...",
            "title_similarity": "0.29567248",
            "sentiment_compound": 0.6705
        },
        {
            "id": "hm7wd4g",
            "score": 13992,
            "text": "Humans with dogs: \"Let's breed this extremely strong and loyal animal to perform a variety of specialized tasks over many generations, resulting in extremely visually distinct breeds!\"\n\nHumans with cats: \"Well it looks cute and kills vermin for us. No need to mess with that.\"",
            "title_similarity": "0.58527964",
            "sentiment_compound": 0.6308
        },
        {
            "id": "hm7pox3",
            "score": 3113,
            "text": "I got my cat at 6 weeks old, he's indoors, gets plenty of food and love.  He's very silly and playful.  When he was a year old two mice got into the basement and he savagely hunted them down and terminated them.\n\nInstinct is a hell of a thing.",
            "title_similarity": "0.5417905",
            "sentiment_compound": -0.0112
        },
        {
            "id": "hm82jkm",
            "score": 5610,
            "text": "\"Look human. It's easier for both of us if I live with you. Don't make this harder than it has to be.\"",
            "title_similarity": "0.35953164",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hm7wfyd",
            "score": 9923,
            "text": "Cats moved in with us because it was convenient for *them.*",
            "title_similarity": "0.6017468",
            "sentiment_compound": 0.0
        },
        {
            "id": "hm87jab",
            "score": 1449,
            "text": "My cat is really more of a roommate than a pet. I feed him, clean out his litter, and we both just do our own thing. Of course he needs to pay rent by giving me hugs and purring when a pet him.\n\nMy cat really loves playing half of fetch, where I throw something he chases it down and just leaves it.",
            "title_similarity": "0.5560868",
            "sentiment_compound": 0.9181
        },
        {
            "id": "hm82khw",
            "score": 9138,
            "text": "My cat turns the PS4 on herself to sleep on the warm console",
            "title_similarity": "0.38644606",
            "sentiment_compound": 0.2263
        },
        {
            "id": "hm7igvy",
            "score": 8,
            "text": "Such a cat thing to do",
            "title_similarity": "0.36032423",
            "sentiment_compound": 0.0
        },
        {
            "id": "hm7l8v6",
            "score": 1,
            "text": "I’ve heard pigs did the same.",
            "title_similarity": "0.3035547",
            "sentiment_compound": 0.0
        },
        {
            "id": "hm7p5vl",
            "score": 1,
            "text": "Sounds about right",
            "title_similarity": "0.19676052",
            "sentiment_compound": 0.0
        },
        {
            "id": "hm7p6gb",
            "score": 5,
            "text": "Gotta be that ‘I don’t give a fuck about you’ gene they all have.",
            "title_similarity": "0.34523395",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hm7rsio",
            "score": 40,
            "text": "I think they love to be venerated… worshipped… catered to every need.  Then they have this way to make us enjoy doing it… clever felines!",
            "title_similarity": "0.37976968",
            "sentiment_compound": 0.8932
        },
        {
            "id": "hm7u7s7",
            "score": 47,
            "text": "I had an old professor who referred to cats as \"more or less\" domesticated.",
            "title_similarity": "0.6459589",
            "sentiment_compound": 0.0
        },
        {
            "id": "hm7vxgi",
            "score": 1,
            "text": "It wasn't really that long ago. We're pretty similar to out ancestors too",
            "title_similarity": "0.5109551",
            "sentiment_compound": 0.4939
        },
        {
            "id": "hm7wli4",
            "score": 1,
            "text": "Domesticated is a strong word.  More like they moved in an tolerate us.",
            "title_similarity": "0.40033707",
            "sentiment_compound": 0.7264
        },
        {
            "id": "hm7xqwm",
            "score": 104,
            "text": "Meanwhile, my cat lays on the deck and yells until I come out and shoo away any bird that landed too close to him…",
            "title_similarity": "0.38144556",
            "sentiment_compound": 0.0
        },
        {
            "id": "hm7yyq6",
            "score": 1,
            "text": "I can tell",
            "title_similarity": "0.19319677",
            "sentiment_compound": 0.0
        },
        {
            "id": "hm8075u",
            "score": 1,
            "text": "You simply do not change a perfection.",
            "title_similarity": "0.30548108",
            "sentiment_compound": -0.4585
        },
        {
            "id": "hm810bc",
            "score": 1,
            "text": "I’m pretty sure cats domesticated us.",
            "title_similarity": "0.68636817",
            "sentiment_compound": 0.6705
        },
        {
            "id": "hm81b4k",
            "score": 8,
            "text": "My cats are both simultaneously amazingly clever and fucking stupid at the same time with added weirdness. Best animals on the planet.",
            "title_similarity": "0.48095444",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hm81dgp",
            "score": 1,
            "text": "Of course they did. Nobody makes a cat do anything it doesn’t already want to do.",
            "title_similarity": "0.5073117",
            "sentiment_compound": 0.0772
        },
        {
            "id": "hm81m3i",
            "score": 1,
            "text": "they own the Internet, too.",
            "title_similarity": "0.28544196",
            "sentiment_compound": 0.0
        },
        {
            "id": "hm81m9f",
            "score": 1,
            "text": "The perfect freeloaders",
            "title_similarity": "0.27961338",
            "sentiment_compound": 0.5574
        },
        {
            "id": "hm827nv",
            "score": 1,
            "text": "It took us long enough to work out what they already knew.",
            "title_similarity": "0.31345695",
            "sentiment_compound": 0.0
        },
        {
            "id": "hm82co2",
            "score": 1,
            "text": "“But still I am the Cat who walks by himself, and all places are alike to me.”\n\nExcerpt from Just So Stories, by Rudyard Kipling",
            "title_similarity": "0.5631584",
            "sentiment_compound": 0.0
        },
        {
            "id": "hm82dey",
            "score": 3,
            "text": "No shit, they understand what you tell them but it will be on their time and if it pleases them. Now, hurry with them treats!",
            "title_similarity": "0.39696312",
            "sentiment_compound": 0.7007
        },
        {
            "id": "hm82e5y",
            "score": 7,
            "text": "They are already nature's perfect killing machines.\n\nSomething like a 10ft vertical leap from standing. Lightening fast sprint. Spine uniquely set to help them on the lunge because of how it can contract and stretch. Which couples with their shoulder blades to make them able to seemingly glide through the air, or fit in impossibly tight spaces. \n\nBasically their prey are at an extreme disadvantage because the cat can attack in so many unexpected angles. And follow into what would normally be too small for a similarly sized other predators.",
            "title_similarity": "0.38953835",
            "sentiment_compound": -0.0498
        },
        {
            "id": "hm82ei3",
            "score": 1,
            "text": "Dang platonic forms were wrong!",
            "title_similarity": "0.18587181",
            "sentiment_compound": -0.5255
        },
        {
            "id": "hm82ini",
            "score": 11,
            "text": "They’re not stupid, free food, cozy life, indoor toilet. What else could they want?",
            "title_similarity": "0.44509137",
            "sentiment_compound": 0.0961
        },
        {
            "id": "hm83ff6",
            "score": 1,
            "text": "Apparently they did this 2-3 times btw, that's amazing",
            "title_similarity": "0.27397662",
            "sentiment_compound": 0.5859
        },
        {
            "id": "hm83glo",
            "score": 3,
            "text": "So one day they just figured out that they can hang about inside the castle. Catch all the mice they want. Get fed and get all the snuggles they like. And dogs are smarter how...?",
            "title_similarity": "0.50704813",
            "sentiment_compound": 0.7003
        },
        {
            "id": "hm83lwz",
            "score": 2,
            "text": "All assholes at heart",
            "title_similarity": "0.1857544",
            "sentiment_compound": 0.1027
        },
        {
            "id": "hm83n9k",
            "score": 9,
            "text": "I've always said that cats are barely domesticated.  Almost any can can survive without its owner if you just let it go.  The same is not true of most domesticated animals like dogs, sheep, or cows.",
            "title_similarity": "0.62745166",
            "sentiment_compound": 0.1108
        },
        {
            "id": "hm83p3q",
            "score": 1,
            "text": "Cats aren't domesticated.",
            "title_similarity": "0.36386234",
            "sentiment_compound": 0.0
        },
        {
            "id": "hm83zuf",
            "score": 1,
            "text": "Of course they did",
            "title_similarity": "0.20009956",
            "sentiment_compound": 0.0
        },
        {
            "id": "hm84wjd",
            "score": 1,
            "text": "[Roughly how domestication happened.](https://www.smbc-comics.com/comic/domestication)",
            "title_similarity": "0.34191993",
            "sentiment_compound": 0.0
        },
        {
            "id": "hm84wp4",
            "score": 1,
            "text": "Cats domesticated us.",
            "title_similarity": "0.5877228",
            "sentiment_compound": 0.0
        },
        {
            "id": "hm84xmu",
            "score": 3,
            "text": "This is entirely accurate and if a cat decides I’m its owner now then that’s it I have a cat",
            "title_similarity": "0.65464646",
            "sentiment_compound": 0.0
        },
        {
            "id": "hm84z08",
            "score": 1,
            "text": "Obviously, they only do what THEY want.",
            "title_similarity": "0.2646356",
            "sentiment_compound": 0.0772
        },
        {
            "id": "hm8508p",
            "score": 8,
            "text": "My two cats have food and water dishes on each floor, litterboxes and scratching posts on each floor, a fountain, their own bed in the master bedroom with a wood frame I built. They have their own play room plus a stupid amount of toys all over the house.  They never even try to go outside. Cats know when they have it good.",
            "title_similarity": "0.5363524",
            "sentiment_compound": 0.2263
        },
        {
            "id": "hm852pp",
            "score": 1,
            "text": "Cats domesticated people. FTFY",
            "title_similarity": "0.550627",
            "sentiment_compound": 0.0
        },
        {
            "id": "hm854nl",
            "score": 1,
            "text": "Genetically super close aside from being dwarf versions of their ancestors maybe.",
            "title_similarity": "0.48296517",
            "sentiment_compound": 0.5994
        },
        {
            "id": "hm855rg",
            "score": 1,
            "text": "Sounds like a cat posted this, TBH.",
            "title_similarity": "0.42008343",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hm857kh",
            "score": 1,
            "text": "they have the whole humanity as their slaves, why would they need to change?",
            "title_similarity": "0.32832438",
            "sentiment_compound": 0.0
        },
        {
            "id": "hm85arb",
            "score": 6,
            "text": "***domesticated***   \n\nMore like saw a niche they could live in and gain warmth, food, water and protection from other predators in.   \nOf course the pets don't hurt either, everyone loves pets.",
            "title_similarity": "0.5229254",
            "sentiment_compound": 0.94
        },
        {
            "id": "hm85b75",
            "score": 1,
            "text": "Maybe it's the cats who have domesticated US!",
            "title_similarity": "0.6016632",
            "sentiment_compound": 0.0
        },
        {
            "id": "hm85bqg",
            "score": 7,
            "text": "I think it's more that cats domesticated us. I wish I could just yowl until someone fed me and demand the most comfortable spot on the couch while everyone else was watching television.",
            "title_similarity": "0.5081263",
            "sentiment_compound": 0.6997
        },
        {
            "id": "hm85ceb",
            "score": 1,
            "text": "Don’t fix what ain’t broken",
            "title_similarity": "0.17664924",
            "sentiment_compound": -0.4767
        },
        {
            "id": "hm85cmp",
            "score": 1,
            "text": "Aliens",
            "title_similarity": "0.2133094",
            "sentiment_compound": 0.0
        },
        {
            "id": "hm85enw",
            "score": 1,
            "text": "They adapted.",
            "title_similarity": "0.190247",
            "sentiment_compound": 0.0
        },
        {
            "id": "hm85j87",
            "score": 1,
            "text": "So they were born jerks not bred to be.\n\nLoveable jerks",
            "title_similarity": "0.4080199",
            "sentiment_compound": -0.4939
        },
        {
            "id": "hm85lz5",
            "score": 1,
            "text": "Sure.",
            "title_similarity": "0.13071409",
            "sentiment_compound": 0.3182
        },
        {
            "id": "hm85ont",
            "score": 1,
            "text": "“Should we kill them?”\n\n“No, no, let us snuggle them in disdain and make them our slaves”",
            "title_similarity": "0.17670174",
            "sentiment_compound": -0.8316
        },
        {
            "id": "hm85ppb",
            "score": 2,
            "text": "The fact that ancient people pretty much dealt with cats as we do today is hilarious to me.",
            "title_similarity": "0.5785413",
            "sentiment_compound": 0.7096
        },
        {
            "id": "hm85tk7",
            "score": 1,
            "text": "theres evidence of more than 1 self-domestication.",
            "title_similarity": "0.23205334",
            "sentiment_compound": 0.0
        },
        {
            "id": "hm85w62",
            "score": 1,
            "text": "Explain why Feral cats don’t domesticate",
            "title_similarity": "0.42901567",
            "sentiment_compound": 0.0
        },
        {
            "id": "hm85zfq",
            "score": 1,
            "text": "Humans did not domestic cats. Cats domesticed humans. J/K",
            "title_similarity": "0.4915028",
            "sentiment_compound": 0.516
        },
        {
            "id": "hm860gd",
            "score": 1,
            "text": "No. Cats domesticated humans.",
            "title_similarity": "0.5258844",
            "sentiment_compound": 0.0
        },
        {
            "id": "hm863nk",
            "score": 1,
            "text": "Shapeshifters too if you watch their eyes. They can go from snake, to human, to dog, to bird, and they use mind-control.",
            "title_similarity": "0.27947322",
            "sentiment_compound": 0.0
        },
        {
            "id": "hm8643n",
            "score": 1,
            "text": "Got it backwards. Cats domesticated us.",
            "title_similarity": "0.6002023",
            "sentiment_compound": 0.0
        },
        {
            "id": "hm86513",
            "score": 2,
            "text": "Honestly kinda cool that of the two main types of animals people choose as pets, one of them is a normal wild animal that chose to live with humans. Almost like we were made for each other :)",
            "title_similarity": "0.5213124",
            "sentiment_compound": 0.8487
        },
        {
            "id": "hm868r2",
            "score": 1,
            "text": "Cats are always going to be the coolest to have as a pet companion.",
            "title_similarity": "0.62767965",
            "sentiment_compound": 0.0
        },
        {
            "id": "hm86989",
            "score": 30,
            "text": "\"In mother Russia, cat Pspsps you\"",
            "title_similarity": "0.46083266",
            "sentiment_compound": 0.0
        },
        {
            "id": "hm86cn7",
            "score": 2,
            "text": "> “I think that there was no need to subject cats to such a selection process since it was not necessary to change them ... They were perfect as they were.”\n\n100% agree. Cats are honestly just perfect.",
            "title_similarity": "0.65168524",
            "sentiment_compound": 0.8934
        },
        {
            "id": "hm86ioc",
            "score": 2,
            "text": "I feel like ***we*** as humans are genetically extremely close to our ancestors (monkeys) but look at the fucking huge difference that makes. It's weird to compare the two.",
            "title_similarity": "0.5345093",
            "sentiment_compound": 0.4748
        },
        {
            "id": "hm86jkg",
            "score": 2,
            "text": "If they can do it, I can do it \n.\n\n   -*feral human*",
            "title_similarity": "0.32690233",
            "sentiment_compound": 0.0
        },
        {
            "id": "hm86kx9",
            "score": 9,
            "text": "Cats liked us because our farms attracted rodents and we liked cats because they killed the rodents. We've been living alongside cats for a very long time, but we haven't had them as pets for very long at all. Truly magnificent creatures",
            "title_similarity": "0.66524684",
            "sentiment_compound": 0.9032
        },
        {
            "id": "hm86m30",
            "score": 2,
            "text": "More proof that cats DGAF",
            "title_similarity": "0.4263224",
            "sentiment_compound": 0.0
        },
        {
            "id": "hm86opa",
            "score": 6,
            "text": "Cat domesticated us, not the other way around.",
            "title_similarity": "0.67749834",
            "sentiment_compound": 0.0
        },
        {
            "id": "hm86tjc",
            "score": 1,
            "text": "Humans are the dumbest species. We fell for it.",
            "title_similarity": "0.28947067",
            "sentiment_compound": -0.5106
        },
        {
            "id": "hm86y6f",
            "score": 2,
            "text": "Cats choosing to be domestic animals on their own because it made life easier for them is, like, the most cat thing ever.",
            "title_similarity": "0.6830355",
            "sentiment_compound": 0.6486
        },
        {
            "id": "hm872sa",
            "score": 2,
            "text": "Highly recommend the book “The Lion in the Living Room”. It’s a great read on the topic and the history of cat domestication.",
            "title_similarity": "0.5545636",
            "sentiment_compound": 0.7841
        },
        {
            "id": "hm8760f",
            "score": 1,
            "text": " Cohabitation worked out very well for animals. We spring up out of nowhere in their habitats. If rodents were cuter and pillow sized, we would have fed them kibble and cuddled with them in our beds too.",
            "title_similarity": "0.5413467",
            "sentiment_compound": 0.6901
        },
        {
            "id": "hm87dov",
            "score": 2,
            "text": "Cat: \"Why change perfection ?\"",
            "title_similarity": "0.4228524",
            "sentiment_compound": 0.5719
        },
        {
            "id": "hm87lg6",
            "score": 3,
            "text": "They aren’t domesticated. They’re waiting.",
            "title_similarity": "0.16601965",
            "sentiment_compound": 0.0
        },
        {
            "id": "hm87vo4",
            "score": 1,
            "text": "Reminds me of a video I saw on reddit earlier today, two cheetahs meowing and purring just like dosmetic cats.\n\n[edit: found it](https://www.reddit.com/r/AnimalsBeingBros/comments/r285nf/a_bond_between_two_brothers_kitu_and_lavani/)",
            "title_similarity": "0.49880886",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hm880ni",
            "score": 2,
            "text": "Cats are creatures of opportunity and much smarter than we give them credit for",
            "title_similarity": "0.45772302",
            "sentiment_compound": 0.8126
        },
        {
            "id": "hm8875o",
            "score": 1,
            "text": "Today I learned that a lot of the subscribers have cats",
            "title_similarity": "0.4847563",
            "sentiment_compound": 0.0
        },
        {
            "id": "hm88gjw",
            "score": 1,
            "text": "Classic cat behavior",
            "title_similarity": "0.5194697",
            "sentiment_compound": 0.0
        },
        {
            "id": "hm88gsb",
            "score": 1,
            "text": "Cats got it all figured out by Middle Ages.. why be wild and hunt for food when they can just be home and have a human servant.",
            "title_similarity": "0.5940681",
            "sentiment_compound": 0.0
        },
        {
            "id": "hm88ovj",
            "score": 1,
            "text": "Parasites",
            "title_similarity": "0.008027375",
            "sentiment_compound": 0.0
        },
        {
            "id": "hm892n0",
            "score": 11,
            "text": "I got adopted by cats 7 years back, really nice of them come to think of it. They even let me pay rent for their house, it's a benevolent dictatorship. I'm not sure why my furry, bitey masters would want to change, you can't beat perfection.",
            "title_similarity": "0.7252144",
            "sentiment_compound": 0.4084
        },
        {
            "id": "hm896xr",
            "score": 1,
            "text": "They begrudgingly domesticated themselves. That's why they still have such a defiant attitude.",
            "title_similarity": "0.44012564",
            "sentiment_compound": -0.2263
        },
        {
            "id": "hm898q9",
            "score": 2,
            "text": "There's also this notion that cats only meow to humans is crazy because cheetahs meow.",
            "title_similarity": "0.4069326",
            "sentiment_compound": -0.34
        },
        {
            "id": "hm89b05",
            "score": 1,
            "text": "Just take a look at Egyptian history. Maybe we will understand one day",
            "title_similarity": "0.34845942",
            "sentiment_compound": 0.0
        },
        {
            "id": "hm89jor",
            "score": 2,
            "text": "They aren't really domesticated, they just found a symbiotic relationship.",
            "title_similarity": "0.35855222",
            "sentiment_compound": 0.0
        },
        {
            "id": "hm89mva",
            "score": 1,
            "text": "I want to know more about what happened in the Middle Ages.",
            "title_similarity": "0.25973588",
            "sentiment_compound": 0.0772
        },
        {
            "id": "hm89qqm",
            "score": 3,
            "text": "see THIS is why i'm a cat person \n\nthe cat chooses me.  i work for the cat.",
            "title_similarity": "0.528667",
            "sentiment_compound": 0.0
        },
        {
            "id": "hm8a1cj",
            "score": 3,
            "text": "I had a cat that my little sister found one day on the bus ride home from elementary school. Very smol kitten, a beautiful stout little Russian blue. The cat lived with us for like 6 years, she was a total badass. Preferred to be outside. Best friends with the dog, had cat friends that would come to the house and meow until we let her out. She brought home animal stomachs and skulls. Specifically. \n\nThen one day when we started packing up to move, she ran away. Never seen again. Idk what happened to her but I like to think she understood we were moving and just took the opportunity to skip out and do her own thing.",
            "title_similarity": "0.5840586",
            "sentiment_compound": 0.9531
        },
        {
            "id": "hm8a4h9",
            "score": 1,
            "text": "Makes sense, you can't own cats they own you.",
            "title_similarity": "0.4021837",
            "sentiment_compound": 0.0
        },
        {
            "id": "hm8act6",
            "score": 3,
            "text": "I have always said that if reincarnation is true I want to come back as a housecat.",
            "title_similarity": "0.5526607",
            "sentiment_compound": 0.4767
        },
        {
            "id": "hm8adg5",
            "score": 1,
            "text": "Cats domesticated us",
            "title_similarity": "0.5941241",
            "sentiment_compound": 0.0
        },
        {
            "id": "hm8ae04",
            "score": 1,
            "text": "Dogs have owners.  Cats have staff.",
            "title_similarity": "0.5383915",
            "sentiment_compound": 0.0
        },
        {
            "id": "hm8aihc",
            "score": 1,
            "text": "This is how you know it's a trap.",
            "title_similarity": "0.15226069",
            "sentiment_compound": -0.3182
        },
        {
            "id": "hm8akar",
            "score": 2,
            "text": "Yes, my cat loves to lick my armpits, who would want to change that.",
            "title_similarity": "0.4433686",
            "sentiment_compound": 0.7717
        },
        {
            "id": "hm8al86",
            "score": 1,
            "text": "Even if humans were trying to domesticate cats, it only happened because cats were on board with it",
            "title_similarity": "0.59239095",
            "sentiment_compound": 0.0
        },
        {
            "id": "hm8ap86",
            "score": 1,
            "text": "Cats did not domesticate themselves.  They just moved in.",
            "title_similarity": "0.49755847",
            "sentiment_compound": 0.0
        },
        {
            "id": "hm8bb6o",
            "score": 2,
            "text": "“You’re perfect, never change.”",
            "title_similarity": "0.43923426",
            "sentiment_compound": 0.5719
        },
        {
            "id": "hm8bddt",
            "score": 1,
            "text": "I reject your primary assertion and stipulate that they trained us to accommodate their wishes. 😺 👍🏼 🖖🏼",
            "title_similarity": "0.32416236",
            "sentiment_compound": 0.1027
        },
        {
            "id": "hm8bgwt",
            "score": 1,
            "text": "Prrrrr",
            "title_similarity": "0.14579462",
            "sentiment_compound": 0.0
        },
        {
            "id": "hm8bham",
            "score": 1,
            "text": "My cat is sleeping on a heated blanket next to me snoring... Domesticated...",
            "title_similarity": "0.3546051",
            "sentiment_compound": 0.0
        },
        {
            "id": "hm8br76",
            "score": 1,
            "text": "Cats domesticated humans to serve them. It’s working well for them, I’d say.",
            "title_similarity": "0.68150926",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hm8c51t",
            "score": 1,
            "text": "Some scientists argue that cats aren’t domesticated in the strictest sense of the term. They are considered quasi domesticated by many scientists.",
            "title_similarity": "0.50711876",
            "sentiment_compound": -0.34
        },
        {
            "id": "hm8c610",
            "score": 6,
            "text": "So they faked their domestication for free food and shelter?",
            "title_similarity": "0.38124537",
            "sentiment_compound": 0.5106
        },
        {
            "id": "hm8chrt",
            "score": 1,
            "text": "It's debatable whether housecats actually are domesticated given the limited differences between feral and \"domesticated\" cats.",
            "title_similarity": "0.52113503",
            "sentiment_compound": -0.2263
        },
        {
            "id": "hm8cm93",
            "score": 1,
            "text": "how come domesticated cats seem to come in so many colors whereas the wild ones all look about the same?",
            "title_similarity": "0.5518104",
            "sentiment_compound": 0.0
        },
        {
            "id": "hm8crky",
            "score": 3,
            "text": "TIL: Cat's have always been aloof, judgmental, passive/aggressive, sentient beings who think the whole of humanity exists just to serve them.\n\nWhooda thunk it?",
            "title_similarity": "0.4581502",
            "sentiment_compound": 0.0
        },
        {
            "id": "hm8cse6",
            "score": 1,
            "text": "This reminds me of this farside cartoon: https://hinessight.blogs.com/church_of_the_churchless/2012/02/cats-and-organized-religion.html",
            "title_similarity": "0.4572087",
            "sentiment_compound": 0.0
        },
        {
            "id": "hm8d2bl",
            "score": 1,
            "text": "We’ve been slaves to kitties for a while now",
            "title_similarity": "0.41005504",
            "sentiment_compound": 0.0
        },
        {
            "id": "hm8d2rj",
            "score": 1,
            "text": "Okay....so how'd they look before the middle ages then?",
            "title_similarity": "0.33199155",
            "sentiment_compound": 0.0
        },
        {
            "id": "hm8d7u8",
            "score": 1,
            "text": "That's not entirely true. We accidentally domesticated them",
            "title_similarity": "0.37606934",
            "sentiment_compound": -0.6384
        },
        {
            "id": "hm8ddhn",
            "score": 2,
            "text": "Title should read \"cats domesticated us\".",
            "title_similarity": "0.57401574",
            "sentiment_compound": 0.0
        },
        {
            "id": "hm8dgyo",
            "score": 1,
            "text": "We didn't domesticate cats, they domesticated us.",
            "title_similarity": "0.554247",
            "sentiment_compound": 0.0
        },
        {
            "id": "hm8dlag",
            "score": 2,
            "text": "Mutualism... The cats get a cushy life, and cat owners get... an interesting roommate.",
            "title_similarity": "0.52181536",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hm8drpb",
            "score": 1,
            "text": "Cats are smart as hell, but they think differently than we do which makes them seem cute and dumb really often. But some of the long term reasoning skills I've witnessed from cats has really surprised me. They give me a similar intelligence vibe to crows.",
            "title_similarity": "0.46911022",
            "sentiment_compound": 0.6746
        },
        {
            "id": "hm8e5x8",
            "score": 1,
            "text": "My family's old cat was a fat lazy thing, but was also the meanest, most ruthless cat I've seen. He loved to curl up in your lap and take up space sleeping, but put him outside at night and he'd end up beating up stray cats or racoons that showed up on our property.",
            "title_similarity": "0.46032077",
            "sentiment_compound": 0.1531
        },
        {
            "id": "hm8e72k",
            "score": 1,
            "text": "I was under the impression that our overlords were never truly domesticated.",
            "title_similarity": "0.35029542",
            "sentiment_compound": -0.1295
        },
        {
            "id": "hm8eden",
            "score": 1,
            "text": "They know servants when they see 'em, there's no need for them to do anything or change anything",
            "title_similarity": "0.45110694",
            "sentiment_compound": -0.296
        },
        {
            "id": "hm8ev51",
            "score": 2,
            "text": "We are their slaves.",
            "title_similarity": "0.21114671",
            "sentiment_compound": 0.0
        },
        {
            "id": "hm8fo81",
            "score": 1,
            "text": "Seems typical. Cat just decided \"I live here now\" and... here we are now lol",
            "title_similarity": "0.5720538",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hm8fqds",
            "score": 2,
            "text": "So they just came up to human and meow until they get fed? Sounds about right. My cat still does the same thing.",
            "title_similarity": "0.6711252",
            "sentiment_compound": 0.0
        },
        {
            "id": "hm8ftm5",
            "score": 2,
            "text": "One day I came home from work, as usual both my cats were waiting for me at the door, happy to see me come home like every other day. So I walk passed them after giving them both head scritches and there was a mouse still half alive with two huge holes in its back bleeding out on my hardwood floor. I was perplexed. As soon as I went to grab a napkin to throw it out my youngest cat grabbed it in its mouth and threw it in the trash then pranced around in a circle. She was so proud. So I gave them both treats, and since that day they leave their kills for me to see.\n\nI love them to death",
            "title_similarity": "0.52109563",
            "sentiment_compound": 0.8955
        },
        {
            "id": "hm8fxz5",
            "score": 1,
            "text": "I mean, lol they’re still adopting humans",
            "title_similarity": "0.48438263",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hm8fytw",
            "score": 3,
            "text": "We had a sweet little grey and white cat who would go on a killing rampage whenever vermin showed up.\n\nHer name was Persephone Springtime but we ended up just calling her MurderBreath.",
            "title_similarity": "0.4561796",
            "sentiment_compound": -0.1893
        },
        {
            "id": "hm8gbxn",
            "score": 1,
            "text": "In Soviet Russia, cat domesticates you!",
            "title_similarity": "0.5248871",
            "sentiment_compound": 0.0
        },
        {
            "id": "hm8geu0",
            "score": 1,
            "text": "I mean that's definitely consistent with what I would expect lol",
            "title_similarity": "0.30804074",
            "sentiment_compound": 0.6705
        },
        {
            "id": "hm8ghc1",
            "score": 8,
            "text": "Why mess with purrrfection 😻",
            "title_similarity": "0.116427235",
            "sentiment_compound": 0.128
        },
        {
            "id": "hm8ghkv",
            "score": 1,
            "text": "Obligatory plug for Kipling: The cat who walked by himself, that tells the exact story how it happened.",
            "title_similarity": "0.5504196",
            "sentiment_compound": 0.0
        },
        {
            "id": "hm8go1r",
            "score": 2,
            "text": "They domesticated humans.",
            "title_similarity": "0.31517276",
            "sentiment_compound": 0.0
        },
        {
            "id": "hm8gs2d",
            "score": 1,
            "text": "A lot of people are disconnected from cats killing rats, but they will absolutely murder them. It only takes one of those small pointy canines in the back of the neck to take out even the biggest of rats.",
            "title_similarity": "0.41018292",
            "sentiment_compound": -0.8931
        },
        {
            "id": "hm8h3bw",
            "score": 1,
            "text": "Thats sounds about right.",
            "title_similarity": "0.20688613",
            "sentiment_compound": 0.0
        },
        {
            "id": "hm8h76d",
            "score": 1,
            "text": ">Their lack of selective breeding means that for the most part, genetic susceptibility to disease, typical of hyper-specialized dog breeds, is mostly absent in cats, and it’s not uncommon for them to live past 20 years old.\n\nnow then, we have Munchkin breed with small feets for the sake of cute. I hate this trend.",
            "title_similarity": "0.58363366",
            "sentiment_compound": -0.4588
        },
        {
            "id": "hm8hhfm",
            "score": 1,
            "text": "“Domesticated”\n\n-every owner with an asshole cat",
            "title_similarity": "0.44522145",
            "sentiment_compound": 0.0
        },
        {
            "id": "hm8hks9",
            "score": 9,
            "text": "Cats also proved the world is round. If it was flat they would have knocked everything over the edge. Take that flat earthers!",
            "title_similarity": "0.549935",
            "sentiment_compound": 0.0
        },
        {
            "id": "hm8hofp",
            "score": 1,
            "text": "Cats domesticated humans. Film at 11.",
            "title_similarity": "0.53014183",
            "sentiment_compound": 0.0
        },
        {
            "id": "hm8hy7b",
            "score": 1,
            "text": "\"if it ain't broke...\"",
            "title_similarity": "0.14837694",
            "sentiment_compound": 0.3252
        },
        {
            "id": "hm8i7ld",
            "score": 1,
            "text": "Which is why you have to have sand for them to crap in as they shake their tiny paws at Darwin’s theory.",
            "title_similarity": "0.3168264",
            "sentiment_compound": -0.5106
        },
        {
            "id": "hm8iaw6",
            "score": 2,
            "text": "Yes my cat is extremely close to his ancestors… he meows at the hamper, walks around the house with a sock in his mouth, has serious anxiety issues bc you can’t make any sudden moves or he thinks you’re out to get him, gets happy for you to rub his belly that he rolls over off the couch and DOESN’T land on his feet… yeah …ok. Cats. Are. Dumb. (But cute)",
            "title_similarity": "0.50631255",
            "sentiment_compound": 0.7311
        },
        {
            "id": "hm8iee8",
            "score": 1,
            "text": "Cat: *sees enclosed space, heated by a fireplace, and plenty of fresh rats*\n\n\"This that gourmet shit\"",
            "title_similarity": "0.3340505",
            "sentiment_compound": -0.3182
        },
        {
            "id": "hm8ihlh",
            "score": 1,
            "text": "It was probably children who befriended kittens that led them into houses. They would be like brothers or sisters, and they have food.",
            "title_similarity": "0.57321274",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hm8ii5e",
            "score": 1,
            "text": "\\> even now are genetically extremely close to their ancestors\n\nanyone who has seen cats on medieval paintings knows this is not true",
            "title_similarity": "0.7314692",
            "sentiment_compound": -0.3252
        },
        {
            "id": "hm8ijgj",
            "score": 1,
            "text": "Cats domesticating themselves is the most cat-like thing I've ever heard of. This little animal genetically figured out how to use our love and effection to their advantage. If anything was gonna do that, it was gonna be cats.",
            "title_similarity": "0.71609855",
            "sentiment_compound": 0.7351
        },
        {
            "id": "hm8iuc0",
            "score": 1,
            "text": "They aren’t technically domesticated",
            "title_similarity": "0.1515365",
            "sentiment_compound": 0.0
        },
        {
            "id": "hm8iy9o",
            "score": 1,
            "text": "If cats were human, they'd just be exceptionally shitty roommates.",
            "title_similarity": "0.36954713",
            "sentiment_compound": -0.5984
        },
        {
            "id": "hm8j2ld",
            "score": 1,
            "text": "Aren't we also extremely close to apes DNA? I think that part of the title is kinda baiting",
            "title_similarity": "0.38477123",
            "sentiment_compound": 0.0
        },
        {
            "id": "hm8jdlt",
            "score": 1,
            "text": "\"Domesticated \"",
            "title_similarity": "0.30359378",
            "sentiment_compound": 0.0
        },
        {
            "id": "hm8jf1g",
            "score": 1,
            "text": ">Tabby cats evolved their characteristic blotches in the Ottoman Empire in 1,300 CE, and it wasn’t until the 18th century that the tabby pattern began to be associated, societally, with domestication.\n\n>Not until the 19th century, thousands of years after dog diversification, did Europeans begin selecting certain characteristics to breed together in cats, resulting in the Russian Blue, perhaps around 1875, and the Maine Coon around the same time.\n\nNeat.\n\nI've had two Russian Blues and one Maine Coon and they were by far the best of any other cats I've had.",
            "title_similarity": "0.7156184",
            "sentiment_compound": 0.8519
        },
        {
            "id": "hm8jk40",
            "score": 1,
            "text": "Kiki likes cream cheese. Kiki needs us to provide.",
            "title_similarity": "0.35229778",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hm8jofb",
            "score": 1,
            "text": "I read this as they essentially domesticated us",
            "title_similarity": "0.43866295",
            "sentiment_compound": 0.0
        },
        {
            "id": "hm8joqr",
            "score": 1,
            "text": "Are cats actually domesticated?",
            "title_similarity": "0.55569005",
            "sentiment_compound": 0.0
        },
        {
            "id": "hm8jrza",
            "score": 2,
            "text": "They domesticated us",
            "title_similarity": "0.4230082",
            "sentiment_compound": 0.0
        },
        {
            "id": "hm8jwk4",
            "score": 1,
            "text": "This is totally a cat thing",
            "title_similarity": "0.3538341",
            "sentiment_compound": 0.0
        },
        {
            "id": "hm8jx8i",
            "score": 1,
            "text": "I don't see why their DNA makes them so confident that cats \"domesticated themselves\".",
            "title_similarity": "0.7147397",
            "sentiment_compound": 0.6269
        },
        {
            "id": "hm8k1oa",
            "score": 1,
            "text": "My cat would be happy if he can wait 7 hours to kill a frog. Sadly for him we don't let him xd \nSo, yes cats are very efficient killers",
            "title_similarity": "0.5715364",
            "sentiment_compound": -0.7689
        },
        {
            "id": "hm8k8sk",
            "score": 1,
            "text": "They're a wild animal that likes to hang out, that's why so many of them do fine by themselves and can leave the house for like 3 days and come back like nothing happened.",
            "title_similarity": "0.4749627",
            "sentiment_compound": 0.8126
        },
        {
            "id": "hm8kmp0",
            "score": 1,
            "text": "Well, I mean humans did selectively breed cats... I dont see how that's any different from dogs...",
            "title_similarity": "0.6323646",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hm8ktvs",
            "score": 1,
            "text": "And then someone said, do you see this floof? Look at this floof. I want to cuddle with the floof.",
            "title_similarity": "0.21655753",
            "sentiment_compound": 0.0772
        },
        {
            "id": "hm8kuat",
            "score": 2,
            "text": "Twice.",
            "title_similarity": "0.10198673",
            "sentiment_compound": 0.0
        },
        {
            "id": "hm8l90w",
            "score": 20,
            "text": "I have the sweetest, most lovable and affectionate, docile-as-can-be, cat that melts in your arms whenever you pick her up.\n\nBut God help you if you are an insect or rodent because come morning I will find their brutalized remains on my kitchen floor.\n\nGood kitty, and thanks for keeping the kills off of the carpets. Cats of all sizes are furry murder machines.  I'm glad she's on my side.",
            "title_similarity": "0.5725761",
            "sentiment_compound": 0.5759
        },
        {
            "id": "hm8lafm",
            "score": 2,
            "text": "Dogs have masters.\nCats have staff.",
            "title_similarity": "0.50966686",
            "sentiment_compound": 0.0
        },
        {
            "id": "hm8laxh",
            "score": 1,
            "text": "So..they adopted humans whereas humans adopted dogs",
            "title_similarity": "0.45319948",
            "sentiment_compound": 0.0
        },
        {
            "id": "hm8lfds",
            "score": 1,
            "text": "Of course they did.",
            "title_similarity": "0.20811357",
            "sentiment_compound": 0.0
        },
        {
            "id": "hm8lvoj",
            "score": 1,
            "text": "The same process is now happening with raccoons, as they adapt to living around people.",
            "title_similarity": "0.44349945",
            "sentiment_compound": 0.0
        },
        {
            "id": "hm8m2lc",
            "score": 2,
            "text": "The thumbnail image that accompanies this article is so apropos. \n\n“That’s right, i domesticated *myself 😎 Deal with it.*”",
            "title_similarity": "0.28922972",
            "sentiment_compound": 0.4588
        },
        {
            "id": "hm8m2pn",
            "score": 2,
            "text": "Dogs, horses, cows, and nearly every other domesticated animal provide us with benefits. We provide the benefits for cats.",
            "title_similarity": "0.58990103",
            "sentiment_compound": 0.6369
        },
        {
            "id": "hm8m3tg",
            "score": 1,
            "text": "\\*Boomalope Self Tamed\\*",
            "title_similarity": "0.30261135",
            "sentiment_compound": 0.0
        },
        {
            "id": "hm8mi62",
            "score": 4,
            "text": "of course they did... long-con playin' mah fackas.",
            "title_similarity": "0.28724167",
            "sentiment_compound": 0.0
        },
        {
            "id": "hm8mmb0",
            "score": 2,
            "text": "Well no wonder they don't give af",
            "title_similarity": "0.17011924",
            "sentiment_compound": -0.0258
        },
        {
            "id": "hm8mnwl",
            "score": 2,
            "text": "As a pet cats kinda have everything you need being small, self sufficiant, low maintenance, and successful hunters of anything smaller then they are which is probably why most breeds arn't that different and just have a \"fancy\" look.",
            "title_similarity": "0.6033348",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hm8mpdf",
            "score": 1,
            "text": "That how I ended up with a cat. Two years ago a stray shop cat at work had a kitten in the spring, at about 6 months old it experienced the cold for the first time amd hopped in my car when I was leaving. The only time he leaves the house is when I take him to the vets and it is a battle every time, the second he entered my house he decided he was done with the outdoors.",
            "title_similarity": "0.5578807",
            "sentiment_compound": -0.3818
        },
        {
            "id": "hm8mxlx",
            "score": 1,
            "text": "Out of spite I'm sure.",
            "title_similarity": "0.23069863",
            "sentiment_compound": -0.2732
        },
        {
            "id": "hm8mzb1",
            "score": 3,
            "text": "To be more accurate, they domesticated US. Unlike other domesticated animals, they weren’t changed to serve a purpose, but WE started taking care of them for no reason other than they’re cute.",
            "title_similarity": "0.6157899",
            "sentiment_compound": 0.7579
        },
        {
            "id": "hm8mzq8",
            "score": 1,
            "text": "The Cat's motto has always been: Wait and see.",
            "title_similarity": "0.5979471",
            "sentiment_compound": 0.0
        },
        {
            "id": "hm8n7sh",
            "score": 1,
            "text": "So what you're telling me is\n\n... It's all an act",
            "title_similarity": "0.17009315",
            "sentiment_compound": 0.0
        },
        {
            "id": "hm8nkiu",
            "score": 5,
            "text": "We had our cat for 3 or 4 years, she wasn't a purebred or anything. She was just a run of the mill grey medium sized cat with the darker grey stripes we've all seen 100s of.\n\nShe laid around a lot like cats do and I wouldn't say she was overly attached to any of us but she was our house cat and that was good enough for her.\n\nWe had went into town one evening and got back right before dark...walked up to the front door & unlocked it and started in. \n\nOut of the corner of my eye I saw something fly through the doorway & into our still dark living room. I hurried & turned some lights on and started looking for the intruder .\n\nIt was a bat...it had flown straight through to the kitchen. Our cat Cheerio was downstairs..at least I thought she was. The wife and I chased this vermin  around the house for over an hour when it finally made its way downstairs.\n\nIn the time that we had our cat she never showed the slightest interest in catching any critters around our home. Birds, squirrels, chipmunks, field mice, nothing really.\n\nWe knew the bat had gone downstairs so I closed the staircase door and stepped out for a smoke. When I came back in my wife was grinning and I asked her \"what's up?\"\n\nShe said \"look downstairs\". Sure enough there was Cheerio at the bottom of the stairs with the bat firmly in her mouth with its wings pinned by her paws to the floor.\n\nI tried to take it from her but she refused to give it up...growling and running away. After several attempts I decided to let her out with it. She stayed out by our back patio for an hour or two then came back in without it.\n\nI don't know if she ate the thing or if it flew away...we never saw any traces of it after. She lived to be 19 and passed away on her birthday.",
            "title_similarity": "0.6743275",
            "sentiment_compound": 0.9645
        },
        {
            "id": "hm8nsib",
            "score": 7,
            "text": "People get mad when I say this, cats are tame, but they are not domesticated. Don't know this would bother people, it makes me like them more.  It is why some cats can go feral in 10 minutes but you don't see packs of roving golden retrievers. Though that would be funny. Experts say they are about 10% domesticated.\n\nWhen they show attention, it is legitimate attention and trust, not because it was bred into them. I like the idea that we evolved with friends.\n\nPLT: House Cats are from the desert. Which is why they have 3 eyelids. They are strict carnivores and get most of their moisture from their food. It is important to give them wet food every day just for this reason. You should not see your cat drink more than once or twice a day, If they drink frequently, they need to see a vet. Just feeding them kibble is akin to a steady diet of potato chips.",
            "title_similarity": "0.5935234",
            "sentiment_compound": 0.9513
        },
        {
            "id": "hm8nweu",
            "score": 1,
            "text": "They probably just figured out they would get food if they get along with people. Takes less work than hunting.",
            "title_similarity": "0.3397564",
            "sentiment_compound": 0.0
        },
        {
            "id": "hm8nzy7",
            "score": 1,
            "text": "They figured it was easier to get people to feed them. Masters of manipulation.",
            "title_similarity": "0.30263817",
            "sentiment_compound": 0.1531
        },
        {
            "id": "hm8o4rg",
            "score": 2,
            "text": "I would die laughing if someone could find proof of a cat in a royal household knocking things off a table at a noble gathering! You know they did!",
            "title_similarity": "0.44740278",
            "sentiment_compound": 0.4374
        },
        {
            "id": "hm8o9ii",
            "score": 38,
            "text": "My cat insists that he's in charge of taking care of the human child in my stomach. Maintains a strict schedule for me and if I deviate he bites. This includes waking up at night for bathroom breaks. I'm convinced he's simply preparing the child for a future subservient to him.",
            "title_similarity": "0.50880325",
            "sentiment_compound": 0.7096
        },
        {
            "id": "hm8odqo",
            "score": 15,
            "text": "I have a cat that taught herself how to pee in the toilet. I'm not entirely sure what, if anything, that adds to the conversation but I thought I would share.",
            "title_similarity": "0.5130497",
            "sentiment_compound": 0.2983
        },
        {
            "id": "hm8of4j",
            "score": 1,
            "text": "Theres a good argument that they still aren't fully domesticated tbh",
            "title_similarity": "0.35769236",
            "sentiment_compound": 0.1027
        },
        {
            "id": "hm8ojno",
            "score": 3,
            "text": "Dogs didn’t just get domesticated by people right off the bat as people often think- there was domestication to a degree, but to start wolves actually began to evolve alongside us! Humans are quite wasteful with meat, so wolves began to hang around us to eat the leftovers from what we hunted. It was symbiotic; wolves got food, people got protection. Once this bond was established, domestication became possible.",
            "title_similarity": "0.4227044",
            "sentiment_compound": 0.0
        },
        {
            "id": "hm8olcm",
            "score": 1,
            "text": "Cat does, as Cat wants. \nWhen Cat wants.",
            "title_similarity": "0.47864246",
            "sentiment_compound": 0.0
        },
        {
            "id": "hm8omjc",
            "score": 2,
            "text": "I know a cat. It goes \"mmbrrrrrrr\" and runs away every time you touch it.",
            "title_similarity": "0.4527805",
            "sentiment_compound": 0.0
        },
        {
            "id": "hm8oxth",
            "score": 1,
            "text": "TIL cats domesticated themselves!",
            "title_similarity": "0.66759986",
            "sentiment_compound": 0.0
        },
        {
            "id": "hm8p21j",
            "score": 1,
            "text": "OP is new I’ve known this since I was a little\nBoy",
            "title_similarity": "0.41523093",
            "sentiment_compound": 0.0
        },
        {
            "id": "hm8p77p",
            "score": 2,
            "text": "Anyone that has had a cat knows these things are a step away from wild assholes.",
            "title_similarity": "0.5003325",
            "sentiment_compound": -0.5859
        },
        {
            "id": "hm8pa13",
            "score": 1,
            "text": "It’s pretty evident to anyone who has spent time with their cats:)",
            "title_similarity": "0.5208155",
            "sentiment_compound": 0.4939
        },
        {
            "id": "hm8pa67",
            "score": 1,
            "text": "[deleted]",
            "title_similarity": "0.07834196"
        },
        {
            "id": "hm8pawt",
            "score": 1,
            "text": "My cat is pretty fuckin cool.",
            "title_similarity": "0.5669254",
            "sentiment_compound": 0.6997
        },
        {
            "id": "hm8pdkv",
            "score": 1,
            "text": "I think we all knew cats domesticated themselves at this point.",
            "title_similarity": "0.7101028",
            "sentiment_compound": 0.0
        },
        {
            "id": "hm8pg07",
            "score": 1,
            "text": "Kats rule.",
            "title_similarity": "0.2945396",
            "sentiment_compound": 0.0
        },
        {
            "id": "hm8pqse",
            "score": 1,
            "text": "See https://reddit.com/r/AnimalsBeingJerks/comments/r2og7q/didnt_like_the_prank/",
            "title_similarity": "0.312212",
            "sentiment_compound": 0.0
        },
        {
            "id": "hm8pr7c",
            "score": 1,
            "text": "#CatsAreCunts",
            "title_similarity": "0.39279652",
            "sentiment_compound": 0.0
        },
        {
            "id": "hm8pr8f",
            "score": 1,
            "text": "Anyone who's got a Cat as a master knows we can't make them do anything... so I would've come to the same conclusion without any studies",
            "title_similarity": "0.5158866",
            "sentiment_compound": 0.0
        },
        {
            "id": "hm8pw4n",
            "score": 1,
            "text": "Cats are not domesticated, they just got too small and weak to kill us.",
            "title_similarity": "0.43959594",
            "sentiment_compound": -0.8225
        },
        {
            "id": "hm8q1ek",
            "score": 1,
            "text": "From the movie Kedi which I HIGHLY recommend for any cat lover. \n\n\"Dogs think humans are God. Cats know the difference\"",
            "title_similarity": "0.5415163",
            "sentiment_compound": 0.8565
        },
        {
            "id": "hm8qav8",
            "score": 1,
            "text": "Domesticated?\n\nOr tolerating human sources of food?",
            "title_similarity": "0.26569977",
            "sentiment_compound": 0.0
        },
        {
            "id": "hm8qk3y",
            "score": 1,
            "text": "we can tell",
            "title_similarity": "0.2081662",
            "sentiment_compound": 0.0
        },
        {
            "id": "hm8qo1i",
            "score": 12,
            "text": "This just reaffirms my belief that the literal only difference between house cats and wild cats are that house cats are simply too small to kill us.",
            "title_similarity": "0.55483544",
            "sentiment_compound": -0.6908
        },
        {
            "id": "hm8qovq",
            "score": 1,
            "text": "Good for her",
            "title_similarity": "0.2649221",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hm8qpsg",
            "score": 2,
            "text": "Cats: why take care of myself when I can get these humans to do it instead?",
            "title_similarity": "0.4536907",
            "sentiment_compound": 0.4939
        },
        {
            "id": "hm8qswx",
            "score": 1,
            "text": "Wow",
            "title_similarity": "0.025477419",
            "sentiment_compound": 0.5859
        },
        {
            "id": "hm8r2i7",
            "score": 2,
            "text": "cats are awesome",
            "title_similarity": "0.4695471",
            "sentiment_compound": 0.6249
        },
        {
            "id": "hm8r2yz",
            "score": 1,
            "text": "My cat sits in the sink while you have wash your hands over a giant fur ball. Just hanging out as the sink fills with water because he’s covering the drain. Domesticated? Hardly. I’m reminded of The Presidents of the United States, “fuck you kitty.”",
            "title_similarity": "0.44719493",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hm8r6xs",
            "score": 2,
            "text": "Raising a cat is really thinking like a raw wild cat - they need to hunt their food for them to be happy. Given that hunting your own food isn't exactly nice nowadays we need to stimulate hunt session (murder time practice) before feeding them.",
            "title_similarity": "0.40119982",
            "sentiment_compound": 0.0891
        },
        {
            "id": "hm8rld5",
            "score": 3,
            "text": "Cats domesticated humans, change my mind",
            "title_similarity": "0.48541236",
            "sentiment_compound": 0.0
        },
        {
            "id": "hm8rm7o",
            "score": 23,
            "text": "I will say.. this is one reason I like cats better than dogs. Cats do noT need us, they choose to be with us, and when they choose you as their person... It feels like an accomplishment. I've had a house panther for 11 years now and honestly she's my best friend.",
            "title_similarity": "0.7669839",
            "sentiment_compound": 0.9538
        },
        {
            "id": "hm8rmoo",
            "score": 2,
            "text": "They domesticated us",
            "title_similarity": "0.4230082",
            "sentiment_compound": 0.0
        },
        {
            "id": "hm8s0vj",
            "score": 2,
            "text": "Cats are so lovable if you treat them right. You have to actually put in the work to earn their adoration and respect, which makes me love them even more",
            "title_similarity": "0.56860954",
            "sentiment_compound": 0.9639
        },
        {
            "id": "hm8s1pl",
            "score": 2,
            "text": "Once an asshole, always an asshole.",
            "title_similarity": "0.19123721",
            "sentiment_compound": 0.0
        },
        {
            "id": "hm8s585",
            "score": 16,
            "text": "> \"Wait...these morons will just GIVE US FOOD if we hang out with them?  Fuck yeah.\"\n\n-- Some cat, thousands of years ago",
            "title_similarity": "0.52919954",
            "sentiment_compound": -0.5574
        },
        {
            "id": "hm8smel",
            "score": 2,
            "text": "I have and have had several Himalayan cats. You will never convince me they could live without a human care taker.",
            "title_similarity": "0.65457165",
            "sentiment_compound": -0.5216
        },
        {
            "id": "hm8som5",
            "score": 2,
            "text": "This explains why they're always scheming ways to kill you.",
            "title_similarity": "0.19603589",
            "sentiment_compound": -0.6908
        },
        {
            "id": "hm8svzz",
            "score": 1,
            "text": "*[Just like in the simulations ](https://rimworldwiki.com/wiki/Events#.28Animal.29_self-tamed)*",
            "title_similarity": "0.3876878",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hm8t317",
            "score": 2,
            "text": "Makes the whole \"they adopted us\" much more real",
            "title_similarity": "0.38531664",
            "sentiment_compound": 0.0
        },
        {
            "id": "hm8t44n",
            "score": 1,
            "text": "The Cat That Walked By Itself",
            "title_similarity": "0.4172451",
            "sentiment_compound": 0.0
        },
        {
            "id": "hm8t91h",
            "score": 2,
            "text": "They are telepathic they are the apex race were just their slaves",
            "title_similarity": "0.49534097",
            "sentiment_compound": 0.0
        },
        {
            "id": "hm8to8w",
            "score": 2,
            "text": "If there’s a bug in my apartment one of my cats will find it and begin tormenting it until I walk over and squish it. They have their uses those felines!",
            "title_similarity": "0.41929173",
            "sentiment_compound": 0.0
        },
        {
            "id": "hm8tqdk",
            "score": 4,
            "text": "When people shifted from hunter-gatherers to agricultural societies, there were storehouses of grain. Grain attracts mice. Big 2-legged critters were associated with plenty of mice to eat, and not only didn’t they attack the cats, they’d chase off the dangerous critters which would. Great place to move in and settle down.",
            "title_similarity": "0.47129148",
            "sentiment_compound": 0.1531
        },
        {
            "id": "hm8two9",
            "score": 2,
            "text": "The cat in the picture of the article seems to be having second thoughts.",
            "title_similarity": "0.2861433",
            "sentiment_compound": 0.0
        },
        {
            "id": "hm8u2h4",
            "score": 1,
            "text": "How do cats actually kill mice and stuff? Teeth or claws? How do they kill bigger things? Their stuff is sharp but doesn't seem especially deadly to me.",
            "title_similarity": "0.4430924",
            "sentiment_compound": -0.7383
        },
        {
            "id": "hm8u74q",
            "score": 2,
            "text": "Louis wain",
            "title_similarity": "0.14267093",
            "sentiment_compound": 0.0
        },
        {
            "id": "hm8u9cq",
            "score": 1,
            "text": "Cat's are just waiting for the moment we stop doing what they want us to.",
            "title_similarity": "0.36448166",
            "sentiment_compound": -0.2263
        },
        {
            "id": "hm8ue5g",
            "score": 1,
            "text": "We've been looking at it backwards.  Cats domesticated humans.",
            "title_similarity": "0.5714935",
            "sentiment_compound": 0.0
        },
        {
            "id": "hm8utyb",
            "score": 1,
            "text": "My \"sweet angel\" loves to hunt mice, he'll chase them, play with them, then finally kill them. (Usually I would have stepped in by then and let it free or finished killing it so it wouldn't suffer). One time i guess he tortured it so much that it escaped, found shelter under my shoe cupboard and died. Well I wasn't there for it, so that's what I assumed happened. Started smelling something gross, but my partner kept telling me they were his work shoes. Finally it got so gross I was like man, you need to see a Dr if that's your feet. I decided to clean out the whole cupboard, move it etc. Well underneath the cupboard I found a partially liquefied mouse. Most disgusting fucking thing I've ever dealt with in my entire life.",
            "title_similarity": "0.41353366",
            "sentiment_compound": -0.6672
        },
        {
            "id": "hm8uwky",
            "score": 1,
            "text": "What did genetically change?",
            "title_similarity": "0.25351533",
            "sentiment_compound": 0.0
        },
        {
            "id": "hm8uwuv",
            "score": 1,
            "text": "My cat can't manage a jump to the windowsill. It's got so bad I shepherd her on and off these days.\n\n\nThen again, she's 15 so I'm proud of her trying. I just make it as safe as possible!",
            "title_similarity": "0.5923999",
            "sentiment_compound": 0.2684
        },
        {
            "id": "hm8v9n5",
            "score": 1,
            "text": "They would do that",
            "title_similarity": "0.17844974",
            "sentiment_compound": 0.0
        },
        {
            "id": "hm8vek6",
            "score": 1,
            "text": "Isnt domesticating one's self just evolution?",
            "title_similarity": "0.30296585",
            "sentiment_compound": 0.0
        },
        {
            "id": "hm8vkkj",
            "score": 1,
            "text": "But now some people want to turn them into dogs 2.0.",
            "title_similarity": "0.31617087",
            "sentiment_compound": 0.1154
        },
        {
            "id": "hm8vmsp",
            "score": 1,
            "text": "Cats adopted us.\n\nMy overlord is sitting on my lap right now plotting his next move.",
            "title_similarity": "0.51966953",
            "sentiment_compound": 0.0
        },
        {
            "id": "hm8vs9j",
            "score": 1,
            "text": "I'm pretty sure cats believe they domesticated us..",
            "title_similarity": "0.68257177",
            "sentiment_compound": 0.6705
        },
        {
            "id": "hm8vtiw",
            "score": 2,
            "text": "Meanwhile, people breeding dogs that can't even breathe.",
            "title_similarity": "0.3463774",
            "sentiment_compound": 0.0
        },
        {
            "id": "hm8w0uj",
            "score": 1,
            "text": "well really is that a surprise they are smart buggers it is like a shark with pilot fish attach to it",
            "title_similarity": "0.27055752",
            "sentiment_compound": 0.8126
        },
        {
            "id": "hm8w9e8",
            "score": 1,
            "text": "I'm not religious, but I love this quote from the cat documentary\"Kedi\".\n\n “Dogs think people are God, but cats don’t. Cats know that people act as middlemen to God’s will. They’re not ungrateful. They just know better.”",
            "title_similarity": "0.5914899",
            "sentiment_compound": 0.913
        },
        {
            "id": "hm8wego",
            "score": 2,
            "text": "\"And they chose this God damn picture to represent\" \n-Cat probably",
            "title_similarity": "0.42016667",
            "sentiment_compound": -0.0836
        },
        {
            "id": "hm8wmo1",
            "score": 1,
            "text": "But aren’t all animals genetically extremely close to their ancestors? Aren’t humans just a few percentages away from dolphins?",
            "title_similarity": "0.507307",
            "sentiment_compound": 0.0
        },
        {
            "id": "hm8woy8",
            "score": 1,
            "text": "Not sure they are domesticated. Just biding their time.",
            "title_similarity": "0.32606834",
            "sentiment_compound": -0.2411
        },
        {
            "id": "hm8wsrm",
            "score": 1,
            "text": "The Just So Stories had it right.  The Cat That Walks Alone.",
            "title_similarity": "0.5410131",
            "sentiment_compound": -0.25
        },
        {
            "id": "hm8ww1f",
            "score": 2,
            "text": "Cats are weird but in a good way",
            "title_similarity": "0.36795592",
            "sentiment_compound": 0.5423
        },
        {
            "id": "hm8wz4d",
            "score": 5,
            "text": "Of course they did! Anyone who owns a cat (actually the cat owns them) knows that cats are here because they want to be here.",
            "title_similarity": "0.6261613",
            "sentiment_compound": 0.1511
        },
        {
            "id": "hm8x2c0",
            "score": 1,
            "text": "After sleeping peacefully on my lap for over an hour earlier this very night, my cat was awoken by what I can only assume was a nightmare and shot into the air withoit warning, flailing it's appendages every which, defying gravity like a cartoon, before savagely clawing it's way up my arms, chest, then face to escape whatever it imagined to be after it. So there's that.",
            "title_similarity": "0.44653836",
            "sentiment_compound": 0.25
        },
        {
            "id": "hm8xcj3",
            "score": 2,
            "text": "This reminds me of that cool \"your friend the rat\" Disney short where Remy explains that cats look down to man lol",
            "title_similarity": "0.475245",
            "sentiment_compound": 0.8074
        },
        {
            "id": "hm8xxyh",
            "score": 2,
            "text": "Cats are extremely well adapted to the urban environment after all.",
            "title_similarity": "0.52692163",
            "sentiment_compound": 0.3384
        },
        {
            "id": "hm8xzqs",
            "score": 2,
            "text": "I have three cats and I love them more than my one child",
            "title_similarity": "0.54915965",
            "sentiment_compound": 0.6369
        },
        {
            "id": "hm8y8we",
            "score": 2,
            "text": "Me reading this thread: I wish I had a cat 🥺",
            "title_similarity": "0.428164",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hm8ygbj",
            "score": 7,
            "text": "So, fun thing. We have archeological evidence that cats have domesticated themselves alongside us on THREE SEPARATE OCASSIONS. Not once, not twice, but THREE SEPARATE times throughout human history.",
            "title_similarity": "0.5958538",
            "sentiment_compound": 0.2846
        },
        {
            "id": "hm8yh8t",
            "score": 1,
            "text": "There is a new study claiming all house cats are varying degrees of psychopath.",
            "title_similarity": "0.40447557",
            "sentiment_compound": 0.0
        },
        {
            "id": "hm8ylsh",
            "score": 1,
            "text": "i will guess that it was at the same time that mouse domesticated themselves too",
            "title_similarity": "0.60596627",
            "sentiment_compound": 0.0
        },
        {
            "id": "hm8yxo5",
            "score": 8,
            "text": "Recently my girlfriend and I are helping out a friend whose between places and their cat.  We have our own kitty so of course we requested a full vet examination to make sure they were healthy.  Turns out he needed some dental work and is currently recovering but given how he immediately became buddies with our cat you wouldn't even know anything was wrong.  \n\nThey've got this spot where they glare at the various birds, chipmunks, and squirrels and it's like watching a duo of murders planning how to dismantle a captive victim.  Cute but horrifying on examination.",
            "title_similarity": "0.5705084",
            "sentiment_compound": -0.7845
        },
        {
            "id": "hm8zd55",
            "score": 2,
            "text": "Wolves became dogs through generations of traits being passed down that were beneficial to humans, a wolf was much more likely to live peacefully amongst humans if it were docile, protective, and family friendly.   Breeding based on those characteristics caused them to look different from wolves too.  Dogs were a creation of unintentional selective breeding.\n\nCats just jumped in through the window, and crashed on the couch.  Cats still arent domesticated, they do what they want.  They can easily survive on their own in the wild.  They look the same and act the same as they did thousands of years ago.  They're still raccoons in disguise.",
            "title_similarity": "0.6583893",
            "sentiment_compound": 0.9062
        },
        {
            "id": "hm908ax",
            "score": 4,
            "text": "Cats domesticated us, made us believe they were gods, used us for food and shelter. I can see why you'd be confused though. /s",
            "title_similarity": "0.60698247",
            "sentiment_compound": -0.3182
        },
        {
            "id": "hm90h2y",
            "score": 3,
            "text": "Not saying I’m mad, but when I posted this exact thing I got railed on for stating that they domesticated themselves.",
            "title_similarity": "0.38472313",
            "sentiment_compound": 0.2057
        },
        {
            "id": "hm90hpf",
            "score": 1,
            "text": "Also, dogs became domesticated 25,000 years ago; cats were around 4,000 years ago",
            "title_similarity": "0.64198744",
            "sentiment_compound": 0.0
        },
        {
            "id": "hm90i5y",
            "score": 1,
            "text": "It was done 3 different times as well.",
            "title_similarity": "0.057404093",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hm90jrc",
            "score": 2,
            "text": "Cute, independent and strong, I respect cats.",
            "title_similarity": "0.55771583",
            "sentiment_compound": 0.8555
        },
        {
            "id": "hm90s1k",
            "score": 7,
            "text": "This is exactly what I would have expected from cats. They did this on their own and remain unchanged.",
            "title_similarity": "0.6696222",
            "sentiment_compound": 0.0
        },
        {
            "id": "hm90tus",
            "score": 10,
            "text": "Cats are angry because they are perfect tuned killing predators BUT very small :)) my fav cats quote.",
            "title_similarity": "0.43056244",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hm90xel",
            "score": 5,
            "text": "Cats are not domesticated, we are.",
            "title_similarity": "0.40556893",
            "sentiment_compound": 0.0
        },
        {
            "id": "hm91mep",
            "score": 1,
            "text": "We have a 2 month old kitten that lives on the ranch where I work. He got bitten by a copperhead 2 weeks ago. He’s 100% fine like nothing happened. Just a gigantic spot on his neck where the snake bit him. That cat is a little badasss",
            "title_similarity": "0.5361334",
            "sentiment_compound": 0.5106
        },
        {
            "id": "hm91nr6",
            "score": 1,
            "text": "I’m pretty sure one of my cats domesticated himself.",
            "title_similarity": "0.6838821",
            "sentiment_compound": 0.6705
        },
        {
            "id": "hm91nz3",
            "score": 1,
            "text": "I have a Maine Coon who thinks he’s a dog with all the aloofness of a cat. He’s pretty chill then he remembers he’s a cat and jumps 3 feet in the air when the ice maker drops the cubes! He’s very suspicious of the new refrigerator.",
            "title_similarity": "0.4399112",
            "sentiment_compound": 0.1776
        },
        {
            "id": "hm92590",
            "score": 2,
            "text": "Okay, so I've never owned an animal as a kid, but I was aware of some of the famous tropes of pet ownership (mainly about dogs) like, training them to shit in a particular place, or staying off of the furniture, etc.\n\nSo, about 5 ish years ago, I moved in with my SO, who had two cats at the time. After a while two cats became one cat (RIP Dynamite), and after some time, she actually wanted a new cat companion for our remaining cat.\n\nWell, the area we lived in at the time had a number of strays and stuff, most wouldn't approach us. One day, a little black cat (younger, maybe a year old? Maybe a bit older), approached our door, my SO opened the door and he walked in like he owned the place.\n\nSo, new cat. My SO's other cats were already pretty well behaved when we moved in together, so this would be my first experience with an untrained cat.\n\nWe did all the things and I was kinda braced for this little boy to be rightly terrible until we taught him some rules.\n\nI could not have been more wrong.\n\nWe set out some litter for him to use, he did. Apart from a few accidents (mainly related to him not being fixed and marking his territory), he has never been trained, nor required any training to know what the litter box is, or what it's for. Apart from some picky eating choices, food and water has never been a problem. And when he was finally cleaned up, de-flea'd and had his shots, we introduced him to our existing cat (they don't really get along, but mainly stay out of each other's way), and after that, he's been perfect.\n\nHe walked in off the street, with all the knowledge and skills I would expect from a house pet. Zero training.\n\nHe's been our fluffy buddy since.\n\nAdopt, don't shop. And in the case of cats, they will adopt you, you just have to let them find you.\n\nTL:DR; cat walks into my home and life from the streets, requires no training, and is a perfect domestic house cat.",
            "title_similarity": "0.64080596",
            "sentiment_compound": 0.9408
        },
        {
            "id": "hm92cpf",
            "score": 1,
            "text": "Semi-domesticated really. No reason for cats to change in any way much genetically when human influence on them is so minimal, unlike what kind of work dogs can do for us.",
            "title_similarity": "0.5880957",
            "sentiment_compound": -0.3597
        },
        {
            "id": "hm92iqe",
            "score": 2,
            "text": "The title should actually read: \"TIL Cats domesticated humans themselves...\"",
            "title_similarity": "0.6106886",
            "sentiment_compound": 0.0
        },
        {
            "id": "hm931ir",
            "score": 1,
            "text": "Futurama was right cats are indeed aliens.",
            "title_similarity": "0.5122832",
            "sentiment_compound": 0.0
        },
        {
            "id": "hm935ug",
            "score": 2,
            "text": "Truth. There was once a cat that made herself at home in my neighbor's barn. Our dogs (who had grown up with cats) liked to visit the barn every now and then to find horse hoof shavings to chew on. She noticed their coming and goings and realized food could be found at our place if she ran out of mice to eat. Weeks later, and she had us trained to feed her the same time as our other pets, but she was adamant about being an outside cat until it became far too cold for her to be outside. Even after a taste of the good life, she would still demand to be outside as much as possible. One time she yowled to get my parents' attention and show off the plump mole she had caught. Thinking she was trying to give it to them as a gift, dad went to pick it up to release it later (since it was still alive). She immediately snatched it back up with a growl and proceeded to eat it in front of them. It didn't matter that she was given food earlier in the day. You can give a cat everything they could possibly want and need, but only they can choose if they want to be domesticated. When she got fairly old, one day after letting her out, she never came back. We assume she wanted to die in private.",
            "title_similarity": "0.56604815",
            "sentiment_compound": 0.8095
        },
        {
            "id": "hm939qx",
            "score": 2,
            "text": "What does that even mean??\n\nLike we had to keep giving them food and shelter and not kick them out so how did we not domesticate them?\n\nWe chose not to eat them, how was it their choice???",
            "title_similarity": "0.4087044",
            "sentiment_compound": 0.7059
        },
        {
            "id": "hm93nid",
            "score": 2,
            "text": "It wasn't until after the Middle Ages that they thought human housing standards had progressed enough to bother walking inside...plus humans were filthy and their food was rubbish",
            "title_similarity": "0.46553317",
            "sentiment_compound": -0.34
        },
        {
            "id": "hm93w3z",
            "score": 1,
            "text": "Tell this to the wads who tried to shame me for wanting to domesticate cheetahs.  The argument was literally \"we *already* domesticated cats\".  I was, well, frankly, appalled.  Like, the implication was that humans already domesticated something so close to a cheetah that we may as well have already done just such a thing, and furthermore that my desire to do so was in vain",
            "title_similarity": "0.48683694",
            "sentiment_compound": -0.5046
        },
        {
            "id": "hm94086",
            "score": 2,
            "text": "I love cats",
            "title_similarity": "0.44217488",
            "sentiment_compound": 0.6369
        },
        {
            "id": "hm94eb4",
            "score": 1,
            "text": "Why change when your purrfect.",
            "title_similarity": "0.14792562",
            "sentiment_compound": 0.0
        },
        {
            "id": "hm953j3",
            "score": 1,
            "text": "Let’s be honest, the only ones domesticated in this relationship is us humans...",
            "title_similarity": "0.48055857",
            "sentiment_compound": 0.5106
        },
        {
            "id": "hm95kmi",
            "score": 1,
            "text": "So there are no original cats left then? All we got is almost. Same with dogs.",
            "title_similarity": "0.5817806",
            "sentiment_compound": -0.1774
        },
        {
            "id": "hm95o9s",
            "score": 1,
            "text": "Cats have a purr that mimics the frequency of a human baby cry. It totally disarm us as we are hard wired never to ignore that frequency. In our house e call it the wanty purr.",
            "title_similarity": "0.48069477",
            "sentiment_compound": -0.3378
        },
        {
            "id": "hm95q38",
            "score": 1,
            "text": "Goes to show, my cat only likes 2 things; being a dick, and eating. In no exclusive order.",
            "title_similarity": "0.43441427",
            "sentiment_compound": -0.2192
        },
        {
            "id": "hm95tvs",
            "score": 3,
            "text": "They didn't domesticate themselves. They enslaved humans to be their care takers.",
            "title_similarity": "0.26703894",
            "sentiment_compound": 0.128
        },
        {
            "id": "hm95xyy",
            "score": 1,
            "text": "My cat has a higher K/D ratio in R6 Siege than I do so maybe they're better off domesticated than humans",
            "title_similarity": "0.49577367",
            "sentiment_compound": 0.4877
        },
        {
            "id": "hm960vd",
            "score": 1,
            "text": "Humans domesticated themselves. They existed unchanged until the Middle Ages; and even now are genetically extremely close to their ancestors.\n\nSuck on that damn overrated cats!",
            "title_similarity": "0.9147378",
            "sentiment_compound": -0.7088
        },
        {
            "id": "hm96bra",
            "score": 5,
            "text": "my cat pees outside of the box",
            "title_similarity": "0.36410686",
            "sentiment_compound": 0.0
        },
        {
            "id": "hm96ghs",
            "score": 2,
            "text": "I totally feed my maste- my cat everyday voluntarily.",
            "title_similarity": "0.6484866",
            "sentiment_compound": 0.0
        },
        {
            "id": "hm96gpc",
            "score": 2,
            "text": "The cats aren’t domesticated, they’re just patient.",
            "title_similarity": "0.5512647",
            "sentiment_compound": 0.0
        },
        {
            "id": "hm96tm1",
            "score": 1,
            "text": "That’s assuming cat’s didn’t domesticate use just look at Egyptians they worshipped cats skip 4 millennia humanity is still worshipping them.",
            "title_similarity": "0.74644625",
            "sentiment_compound": 0.743
        },
        {
            "id": "hm9761y",
            "score": 2,
            "text": "cats are dope af",
            "title_similarity": "0.3876185",
            "sentiment_compound": 0.0
        },
        {
            "id": "hm976ox",
            "score": 3,
            "text": "That's the most cat-like thing I could imagine them doing..",
            "title_similarity": "0.5324757",
            "sentiment_compound": 0.0
        },
        {
            "id": "hm97duq",
            "score": 4,
            "text": "Cat has self-tamed and will known as cat 1!",
            "title_similarity": "0.6300628",
            "sentiment_compound": 0.0
        },
        {
            "id": "hm97j78",
            "score": 1,
            "text": "Cats were like, \"we saw what y'all did to the wolves, we're gonna wait until you're a little more civilized.\"",
            "title_similarity": "0.5110645",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hm97r4j",
            "score": 1,
            "text": "Flashbacks to the rick and morty episode where a talking cat has committed atrocities so brutal and horrible it makes rick, a sociopath, feel empathy.",
            "title_similarity": "0.31633008",
            "sentiment_compound": -0.7939
        },
        {
            "id": "hm98vj3",
            "score": 1,
            "text": "The wildcats they are descended from lack any real social hierarchy making them unlikely for domestication by humans.\n….     \n\nSo what your saying is we could have domesticated lions? God that would have been so cool.",
            "title_similarity": "0.44777018",
            "sentiment_compound": 0.4198
        },
        {
            "id": "hm98y79",
            "score": 1,
            "text": "Domesticated cats predate the Middle Ages by thousands of years!",
            "title_similarity": "0.6592577",
            "sentiment_compound": 0.0
        },
        {
            "id": "hm997bu",
            "score": 1,
            "text": "\"Why change purrfection?\"",
            "title_similarity": "0.14449044",
            "sentiment_compound": 0.0
        },
        {
            "id": "hm997up",
            "score": 1,
            "text": "Huh, as usual human race falling sucker to cats. \n\nWho domesticated who here? Free house, food, accommodation, does whatever it wants and has no rules. Dogs on the other hand...",
            "title_similarity": "0.6455598",
            "sentiment_compound": 0.0772
        },
        {
            "id": "hm99c9n",
            "score": 1,
            "text": "The truth is we don't know when cats or dogs were domesticated, and if it was a natural thing that happened as in what this claims that they \"domesticated themselves\" , if humans encouraged it, or if it was a combination of the two. It just happened so long ago we can only make educated guesses. We won't ever know for sure.",
            "title_similarity": "0.6019279",
            "sentiment_compound": 0.8225
        },
        {
            "id": "hm99ckx",
            "score": 2,
            "text": "Doesen't that mean rhat cats actually domesticated us?",
            "title_similarity": "0.61774844",
            "sentiment_compound": 0.0
        },
        {
            "id": "hm99ejc",
            "score": 1,
            "text": "Smart lil fuckers",
            "title_similarity": "0.303012",
            "sentiment_compound": -0.296
        },
        {
            "id": "hm9a1p8",
            "score": 1,
            "text": "Cats domesticated us",
            "title_similarity": "0.5941241",
            "sentiment_compound": 0.0
        },
        {
            "id": "hm9a4fn",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.06739382"
        },
        {
            "id": "hm9ai5x",
            "score": 1,
            "text": "Yeah that's an extremely cat thing to do.",
            "title_similarity": "0.3778026",
            "sentiment_compound": 0.296
        },
        {
            "id": "hm9ape7",
            "score": 2,
            "text": "They also only meow to humans and dont use it to communicate to each other.",
            "title_similarity": "0.2383012",
            "sentiment_compound": 0.0
        },
        {
            "id": "hm9b70v",
            "score": 1,
            "text": "I didn’t even buy or adopt a cat, it just showed up and won’t leave. Now it just lives here... I guess.. haha",
            "title_similarity": "0.50590765",
            "sentiment_compound": 0.5423
        },
        {
            "id": "hm9bskw",
            "score": 1,
            "text": "Cats are so adorable to me, but sometimes they are actually disturbing!   \n\n\nFew days earlier I bought new curtain for my home. After installing them they started playing with them. Not only this thing is there favorite but also they always play with the study items of my daughter.   \n\n\nThey really help my daughter to play with. Such a lovely & cute creature!",
            "title_similarity": "0.5965151",
            "sentiment_compound": 0.9758
        },
        {
            "id": "hm9c7cx",
            "score": 1,
            "text": "They found their awesome niche and ran with it. No hating on the kitties.",
            "title_similarity": "0.40767932",
            "sentiment_compound": 0.7784
        },
        {
            "id": "hm9cm8t",
            "score": 2,
            "text": "Dogs were created by humans to fulfill a number of roles.\n\nCats were not. The cat human relationship was entirely symbiotic: They prey on small mammals like rodents, which are incidentally attracted to stockpiles of food that humans like to create.",
            "title_similarity": "0.54396564",
            "sentiment_compound": 0.9201
        },
        {
            "id": "hm9d6kw",
            "score": 1,
            "text": "Yeah, one day my dad found this kitten under his car. It was cold and raining and the kitten was covered in grease and dust. My dad took the kitten home, fed it, cleaned it and then proceeded to call all his friends and acquaintances until he found a good home for the kitten. The cat now weights 5kg and is called Fidel Castro.",
            "title_similarity": "0.5035093",
            "sentiment_compound": 0.802
        },
        {
            "id": "hm9d9ch",
            "score": 1,
            "text": "Fun fact, I think all big cats were originally arboreal - they all lived in trees.\n\nThe likes of lions etc evolved when they got down from trees. Like our ancestors I suppose..",
            "title_similarity": "0.58911884",
            "sentiment_compound": 0.8225
        },
        {
            "id": "hm9dq27",
            "score": 1,
            "text": "Cats: Why change something that’s perfect.",
            "title_similarity": "0.5011338",
            "sentiment_compound": 0.5719
        },
        {
            "id": "hm9dy3h",
            "score": 1,
            "text": "Yes and this is why I love them. \n\nI love dogs too - I’m not an *exclusively* cat person - but I do get sad when I see how much they’ve changed from their ancestors, particularly when humans have bred so many health problems into them!",
            "title_similarity": "0.43975237",
            "sentiment_compound": -0.5167
        },
        {
            "id": "hm9eaf4",
            "score": 6,
            "text": "When she was growing up, one of my wife's cats ran off. He was gone for months, and they assumed he was gone forever. One day he came home from out of the woods with three kittens. He dropped the fuckers off on their porch and left again, never to be seen. They kept them.",
            "title_similarity": "0.52666354",
            "sentiment_compound": -0.4939
        },
        {
            "id": "hm9eddb",
            "score": 1,
            "text": "Like rimworld animals taming themselves",
            "title_similarity": "0.32130244",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hm9egy1",
            "score": 1,
            "text": "We are cat pets...",
            "title_similarity": "0.5271792",
            "sentiment_compound": 0.0
        },
        {
            "id": "hm9elnf",
            "score": 1,
            "text": "What if cats are the real reason humans domesticated themselves",
            "title_similarity": "0.610121",
            "sentiment_compound": 0.0
        },
        {
            "id": "hm9eoco",
            "score": 1,
            "text": "Cats domesticated us",
            "title_similarity": "0.5941241",
            "sentiment_compound": 0.0
        },
        {
            "id": "hm9etox",
            "score": 1,
            "text": "Have human population genetic changed as a result of our domestication by cats?",
            "title_similarity": "0.5122248",
            "sentiment_compound": 0.0
        },
        {
            "id": "hm9eu6i",
            "score": 1,
            "text": "\"...cats simply existed in close proximity to humans, without ever fully entering societal processes.\"\n\nStart as you mean to go on, cat",
            "title_similarity": "0.5946342",
            "sentiment_compound": 0.0
        },
        {
            "id": "hm9evfr",
            "score": 1,
            "text": "Sneaky bastards. Truly their own masters.",
            "title_similarity": "0.24526696",
            "sentiment_compound": -0.4588
        },
        {
            "id": "hm9f9wm",
            "score": 1,
            "text": "As long as you give me exactly what I want, anytime I ask, then we’re good… deal?",
            "title_similarity": "0.3489563",
            "sentiment_compound": 0.0772
        },
        {
            "id": "hm9fdce",
            "score": 1,
            "text": "Both my cats were feral.  One domesticated himself by just walking in and deciding that he likes it here.  He's currently purring on my lap. \n\nThe second was born in a garage.  I picked him up two years ago.  He likes to pee outside.  I just let him out,  he'll be back in a half hour or so.  Then, both will want to be fed.",
            "title_similarity": "0.60945964",
            "sentiment_compound": 0.7096
        },
        {
            "id": "hm9g02u",
            "score": 1,
            "text": "Of course they did. \n\nThat's the cat-iest cat thing, ever.",
            "title_similarity": "0.5432388",
            "sentiment_compound": 0.0
        },
        {
            "id": "hm9g2ak",
            "score": 1,
            "text": "ITT: People have cats and or cats have people.",
            "title_similarity": "0.39957964",
            "sentiment_compound": 0.0
        },
        {
            "id": "hm9gsut",
            "score": 1,
            "text": "When you look at your cat, your basically looking at a mountain lion.   Mountain lions are closely related to the typical house cat....just 100+ pounds heavier and much larger.",
            "title_similarity": "0.4797174",
            "sentiment_compound": 0.0
        },
        {
            "id": "hm9gzdm",
            "score": 1,
            "text": "We've had a cat for four years now and it doesn't even know my name yet.",
            "title_similarity": "0.5898751",
            "sentiment_compound": 0.0
        },
        {
            "id": "hm9h2br",
            "score": 2,
            "text": ">“I think that there was no need to subject cats to such a selection process since it was not necessary to change them,” said evolutionary geneticist and study coauthor Eva-Maria Geigl to National Geographic. “They were perfect as they were.”\n\nYou got that right.",
            "title_similarity": "0.680941",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hm9h47e",
            "score": 1,
            "text": "Symbiotic parasite relationship lol",
            "title_similarity": "0.16665414",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hm9hy1w",
            "score": 1,
            "text": "That´s why so many people have cat allergy.",
            "title_similarity": "0.39997706",
            "sentiment_compound": 0.0
        },
        {
            "id": "hm9is80",
            "score": 2,
            "text": "Cats domesticated us. Change my mind.",
            "title_similarity": "0.51546735",
            "sentiment_compound": 0.0
        },
        {
            "id": "hm9je1k",
            "score": 1,
            "text": "It is a myth that cats are domesticated. They have tamed us.",
            "title_similarity": "0.6508999",
            "sentiment_compound": 0.0
        },
        {
            "id": "hm9jiin",
            "score": 1,
            "text": "There's evidence to suggest dogs did the same. Prehistoric wolves realised that human hunting parties tend to leave quite a large amount of food behind after a kill so they started following hunting parties when they went hunting. They then started to keep other animals away whilst the hunters were stripping the kill. Humans began to notice this and started to encourage the wolves more. Over time they just got closer and closer.",
            "title_similarity": "0.35246193",
            "sentiment_compound": -0.4404
        },
        {
            "id": "hm9k88t",
            "score": 1,
            "text": "My baby girl cat is 100% all wild instincts and reactions. Some cats are thinkers but she is NOT, she just experiences. \n\nCurrently she’s lying in the little 4 shape I make with my legs for her. (One foot tucked under opposite knee.)",
            "title_similarity": "0.5798151",
            "sentiment_compound": -0.6808
        },
        {
            "id": "hm9k9nn",
            "score": 2,
            "text": "We provide them with shelter, food, care, companionship, clean up after them, seek their love and approval, strive to entertain them, worshipped them at one point....pretty sure cats domesticated us.",
            "title_similarity": "0.6323681",
            "sentiment_compound": 0.9661
        },
        {
            "id": "hm9kbi3",
            "score": 2,
            "text": "Our cat just started showing up one day in the garden. Gradually she started coming more and more often, sometimes sleeping for hours on the bench. \n\nThen she started sneaking into the house if we left the patio door open in the summer. If it wasn't open she'd sit there making a racket until we let her in.\n\nIt went on like this for quite some time. We noticed that she was often spending pretty much all her time at our house so we decided to feed her since she obviously wasn't eating elsewhere and she was looking pretty thin.\n\nGradually this turned into her basically living at our house all the time. We decided to take her to the vet and see if they knew anything. She was microchipped and had an owner, but hadn't been to the vets for a couple of years. So we paid for her jabs and a checkup, overall she was in pretty good health though.\n\nShe continued to live with us and about a year or so later we did track down her original owner. It turned out that she'd gone missing several years previously, and the owner had 'assumed she was dead'. Fortunately for us, the previous owner had no interest in taking her back and agreed we could formally adopt her.\n\nSo yeah... Essentially our cat ran away from her previous home and decided she was going to come and live with us instead 🤣 You could say that she used us for food and shelter, but we like to see it a different way. Most pets have no choice of their owner, but ours chose us.",
            "title_similarity": "0.5183664",
            "sentiment_compound": 0.9228
        },
        {
            "id": "hm9kdu0",
            "score": 2,
            "text": "they caught mice and rats, and most humans stopped kicking or otherwise causing bodily harm to them when given the opportunity, of-cause even in this day and age some humans still find enjoyment in such endeavors, sadly.",
            "title_similarity": "0.5466604",
            "sentiment_compound": -0.2682
        },
        {
            "id": "hm9loqk",
            "score": 2,
            "text": "Cats are aliens. Not much time left until we figure that out and bow down to our new overlord",
            "title_similarity": "0.55153775",
            "sentiment_compound": 0.0
        },
        {
            "id": "hm9m65g",
            "score": 1,
            "text": "Too smart for the wild.",
            "title_similarity": "0.22859667",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hm9mi04",
            "score": 1,
            "text": "I also learned recently they’re the only domesticated animals that can just go right back to living on their own with no problem",
            "title_similarity": "0.6711114",
            "sentiment_compound": 0.3089
        },
        {
            "id": "hm9mn64",
            "score": 1,
            "text": "For some of us they do give us a buff that relaxes us and over a prolonged period of time does extend our life span. Same with dogs.",
            "title_similarity": "0.42823046",
            "sentiment_compound": 0.4939
        },
        {
            "id": "hm9mnu2",
            "score": 2,
            "text": "Very few cats meet criteria for domestication because we do not control their reproduction. Most housecats are descended from feral cats. So, they didn’t “domesticate” themselves, they simply adapted to humans like many other non-domesticated species (like pigeons).",
            "title_similarity": "0.5898627",
            "sentiment_compound": 0.6124
        },
        {
            "id": "hm9msh6",
            "score": 2,
            "text": "So what you're saying is we have barely explored all the ways to fuck up cats through selective breeding.",
            "title_similarity": "0.54660755",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hm9my4d",
            "score": 1,
            "text": ".",
            "title_similarity": "0.04025788",
            "sentiment_compound": 0.0
        },
        {
            "id": "hm9n3yq",
            "score": 1,
            "text": "Nobody who has ever owned a cat is surprised at all by this.",
            "title_similarity": "0.5206208",
            "sentiment_compound": 0.2263
        },
        {
            "id": "hm9n5n9",
            "score": 2,
            "text": "I was having this discussion with a friend a week ago lol",
            "title_similarity": "0.37624598",
            "sentiment_compound": 0.7184
        },
        {
            "id": "hm9nkvb",
            "score": 1,
            "text": "I’m inclined to believe cats domesticated us…",
            "title_similarity": "0.5929762",
            "sentiment_compound": 0.0
        },
        {
            "id": "hm9o538",
            "score": 1,
            "text": "Cats can’t be domesticated cos they’re so damn cool",
            "title_similarity": "0.5360367",
            "sentiment_compound": -0.2294
        },
        {
            "id": "hm9ocmc",
            "score": 3,
            "text": "No you see they domesticated humans not the other way around, and have been laughing at us ever since.",
            "title_similarity": "0.56331426",
            "sentiment_compound": 0.25
        },
        {
            "id": "hm9oftg",
            "score": 2,
            "text": "Cats domesticated humans and are themselves undomesticated",
            "title_similarity": "0.602249",
            "sentiment_compound": 0.0
        },
        {
            "id": "hm9pea5",
            "score": 2,
            "text": "All comments here are like kids describing their cats. Now draw your cat",
            "title_similarity": "0.45750678",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hm9piij",
            "score": 6,
            "text": "I wouldn't say cats domesticated themselves. I'd say they realized how useful humans can be",
            "title_similarity": "0.64878905",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hm9pwgq",
            "score": 1,
            "text": "I've seen more than enough videos of them attacking someone to KNOW that this has to be true 🤣\n\n(cat vs babysitter, cat vs woman trying to do a suitcase prank)",
            "title_similarity": "0.40831494",
            "sentiment_compound": 0.4588
        },
        {
            "id": "hm9q633",
            "score": 1,
            "text": "What I do understand is the relationship between cats and can openers.  My cats were all raised in a manual can opener home.   Two of them are approaching 20 years old and had never been around an electric can opener.  Ever.\n\nAnd then I saw an electric can opener on sale and I bought it.  First such machine anyone in my family has owned going back more than 30 years.  We were huge Swing-A-Way fans.  It's a wall mounted manual can opener.\n\nAnyway I got this electric one and the very first time I used it, ALL the cats came running, yelling to be fed whatever was being opened.\n\nNobody has taught them.  They have never heard a can opener before.  They don't like motors normally.\n\nHow the hell do they know what this machine does?  And why does that make them come running when the sound of a pull top wet cat food can is beneath their contempt?",
            "title_similarity": "0.5924101",
            "sentiment_compound": -0.8303
        },
        {
            "id": "hm9q9os",
            "score": 1,
            "text": "Foxes are doing the same",
            "title_similarity": "0.37134865",
            "sentiment_compound": 0.0
        },
        {
            "id": "hm9qk27",
            "score": 1,
            "text": "Sassholes then, sassholes now.",
            "title_similarity": "0.16242144",
            "sentiment_compound": 0.0
        },
        {
            "id": "hm9qqx7",
            "score": 1,
            "text": "They're just waiting to steal Earth's rotational energy.",
            "title_similarity": "0.22866435",
            "sentiment_compound": -0.2732
        },
        {
            "id": "hm9r52j",
            "score": 3,
            "text": "Another fun thing about cats is that they treat us like other cats. While dogs treat humans differently than other dogs. Cats are just like you are a big cat here let me groom you.",
            "title_similarity": "0.5039482",
            "sentiment_compound": 0.9136
        },
        {
            "id": "hm9rax7",
            "score": 2,
            "text": "They let us love them",
            "title_similarity": "0.34313202",
            "sentiment_compound": 0.6369
        },
        {
            "id": "hm9rcnb",
            "score": 3,
            "text": "Cats domesticated humans.",
            "title_similarity": "0.50815976",
            "sentiment_compound": 0.0
        },
        {
            "id": "hm9rg8h",
            "score": 1,
            "text": "Wasn't that the Caticultural Revolution?",
            "title_similarity": "0.3343128",
            "sentiment_compound": 0.0
        },
        {
            "id": "hm9rist",
            "score": 1,
            "text": "Cats are not real.",
            "title_similarity": "0.23672616",
            "sentiment_compound": 0.0
        },
        {
            "id": "hm9rnm4",
            "score": 8,
            "text": "Owners of dogs will have noticed that, if you provide them with food and water and shelter and affection, they will think you are god. Whereas owners of cats are compelled to realize that, if you provide them with food and water and shelter and affection, they draw the conclusion that they are gods.\n\nCH",
            "title_similarity": "0.54833907",
            "sentiment_compound": 0.8442
        },
        {
            "id": "hm9s08q",
            "score": 1,
            "text": "Further proof that they domesticated us instead",
            "title_similarity": "0.3482911",
            "sentiment_compound": 0.0
        },
        {
            "id": "hm9sask",
            "score": 4,
            "text": "I had a fraternity brother bring us a  “cat” he found at a nearby dumpster. It had a bob tail and really long hairy ears. It was the meanest thing ever. Climbed bare walls to jump down on us. Long story short it was a lynx. This was before google. I still laugh about it today. Raja was given to the Jacksonville zoo. No shit.",
            "title_similarity": "0.5214225",
            "sentiment_compound": 0.7117
        },
        {
            "id": "hm9sc44",
            "score": 1,
            "text": "Smart motherfuckers.",
            "title_similarity": "0.2872132",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hm9sf5p",
            "score": 2,
            "text": "Nothing about that headline surprises me",
            "title_similarity": "0.29617208",
            "sentiment_compound": 0.2263
        },
        {
            "id": "hm9sulr",
            "score": 1,
            "text": "There's a problem with wild cats in Scotland essentially dying out, as they breed with domestic cats all the time, essentially breeding themselves out of existence.",
            "title_similarity": "0.56770086",
            "sentiment_compound": -0.4019
        },
        {
            "id": "hm9t2m4",
            "score": 1,
            "text": "Nope. Cats domesticated people.",
            "title_similarity": "0.5728504",
            "sentiment_compound": 0.0
        },
        {
            "id": "hm9t6qe",
            "score": 1,
            "text": "Dang I love cats.",
            "title_similarity": "0.44416678",
            "sentiment_compound": 0.6369
        },
        {
            "id": "hm9t7ud",
            "score": 1,
            "text": "They have always been dicks then",
            "title_similarity": "0.30888158",
            "sentiment_compound": 0.0
        },
        {
            "id": "hm9td0h",
            "score": 2,
            "text": "Cats domesticated US.",
            "title_similarity": "0.5877228",
            "sentiment_compound": 0.0
        },
        {
            "id": "hm9trl5",
            "score": 2,
            "text": "Cats are also noted for forming families with other species, particularly when thrown together by circumstance. Even animals that would be otherwise considered prey, like mice or opossums. So they may not have domesticated themselves so much as adopted us.",
            "title_similarity": "0.53918743",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hm9u82f",
            "score": 4,
            "text": "Cats, much like wheat, domesticated humans.",
            "title_similarity": "0.6220329",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hm9v3dw",
            "score": 3,
            "text": "There are a number of criteria for domestication: a diverse appetite, rapid maturation, willingness to breed in captivity, docility, strong nerves, and a nature that conforms to social hierarchy.\n\nPretty sure you can qualify with one or a few of those, but cats pretty much fail all criteria across the board.\n\nThe humans stored food, the rodents came to raid those food stores, the cats came to expect the rodents in human environments and don't compete with humans for good except for birds.\n\nCats didn't just domesticate themselves, this was a wholly natural symbiotic relationship. \"Your food is eating my food\"",
            "title_similarity": "0.56192905",
            "sentiment_compound": 0.9011
        },
        {
            "id": "hm9vawh",
            "score": 1,
            "text": "Kitty!",
            "title_similarity": "0.25164294",
            "sentiment_compound": 0.0
        },
        {
            "id": "hm9vcqr",
            "score": 2,
            "text": "It only appears they domesticated themsleves.  In reality, they domesticated humans.",
            "title_similarity": "0.48634687",
            "sentiment_compound": 0.0
        },
        {
            "id": "hm9vre7",
            "score": 8,
            "text": "“Yeah so you’re going to take care of me now. Feed me daily and clean up after me thanks”",
            "title_similarity": "0.44216388",
            "sentiment_compound": 0.7096
        },
        {
            "id": "hm9w83h",
            "score": 4,
            "text": "Cats domesticated humans.",
            "title_similarity": "0.50815976",
            "sentiment_compound": 0.0
        },
        {
            "id": "hm9whye",
            "score": 3,
            "text": "mine screams at me for milk LOL",
            "title_similarity": "0.16432574",
            "sentiment_compound": 0.3254
        },
        {
            "id": "hm9wpsi",
            "score": 3,
            "text": "My cats might've lost their instincts because they keep bringing live lizards in our place",
            "title_similarity": "0.42294803",
            "sentiment_compound": -0.3182
        },
        {
            "id": "hm9xfqp",
            "score": 3,
            "text": "There's a theory we got language from first the need to give dogs commands.",
            "title_similarity": "0.26112416",
            "sentiment_compound": 0.0
        },
        {
            "id": "hm9xwdj",
            "score": 7,
            "text": "I still view my house cats as wild animals...wild animals that know how to poop in a litter robot lol",
            "title_similarity": "0.54181826",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hm9y12n",
            "score": 1,
            "text": "Why am I not surprised",
            "title_similarity": "0.21342608",
            "sentiment_compound": -0.1695
        },
        {
            "id": "hm9y26v",
            "score": 2,
            "text": "Technically cats are not domesticated. They are perfectly capable of surviving and thriving in the wild without human assistance.",
            "title_similarity": "0.62459695",
            "sentiment_compound": 0.8402
        },
        {
            "id": "hm9zdis",
            "score": 3,
            "text": "Maybe cats are the perfect organism",
            "title_similarity": "0.5812147",
            "sentiment_compound": 0.5719
        },
        {
            "id": "hm9zpbs",
            "score": 2,
            "text": "Humans also domesticated themselves and we don't get credit for it.",
            "title_similarity": "0.42685643",
            "sentiment_compound": -0.2924
        },
        {
            "id": "hm9zuci",
            "score": 2,
            "text": "I see nothing wrong with this.",
            "title_similarity": "0.2812724",
            "sentiment_compound": 0.3724
        },
        {
            "id": "hm9zy7x",
            "score": 2,
            "text": "I would not be surprised if they found out, that cats domesticated us!",
            "title_similarity": "0.68126434",
            "sentiment_compound": -0.2401
        },
        {
            "id": "hma0ftg",
            "score": 3,
            "text": "Cats aren't domesticated, theyre just waiting",
            "title_similarity": "0.48080784",
            "sentiment_compound": 0.0
        },
        {
            "id": "hma0ib7",
            "score": 2,
            "text": "> Their lack of selective breeding means that for the most part, genetic susceptibility to disease, typical of hyper-specialized dog breeds, is mostly absent in cats, and it’s not uncommon for them to live past 20 years old.\n\nThat does explain things.",
            "title_similarity": "0.621954",
            "sentiment_compound": -0.3182
        },
        {
            "id": "hma10ho",
            "score": 3,
            "text": "At my zoo they have one of the ancestors of domestic cats, and it literally looks like they picked a stray out of the park and just put it in the habitat lol",
            "title_similarity": "0.60099965",
            "sentiment_compound": 0.6486
        },
        {
            "id": "hma1wlu",
            "score": 2,
            "text": "they so evil",
            "title_similarity": "0.06391464",
            "sentiment_compound": -0.6901
        },
        {
            "id": "hma26ju",
            "score": 2,
            "text": "This is on brand for cats.  They're here because they want to be, never forget that hooman.",
            "title_similarity": "0.601843",
            "sentiment_compound": 0.242
        },
        {
            "id": "hma26rw",
            "score": 4,
            "text": "I was at a friend's office this stray kitten walks in the back door from the alley and climbs my leg.\nAnd that's how I got a cat.",
            "title_similarity": "0.48025638",
            "sentiment_compound": 0.0
        },
        {
            "id": "hma2apw",
            "score": 2,
            "text": "And that's why cats usually look fine while dogs look goofy.",
            "title_similarity": "0.5668718",
            "sentiment_compound": 0.2023
        },
        {
            "id": "hma2otf",
            "score": 1,
            "text": "*Doo doot*\n\nCats join.",
            "title_similarity": "0.40847793",
            "sentiment_compound": 0.296
        },
        {
            "id": "hma2t0a",
            "score": 1,
            "text": "Lots of people talking about their cat here and not paying the cat tax....",
            "title_similarity": "0.43189788",
            "sentiment_compound": 0.0
        },
        {
            "id": "hma3b27",
            "score": 1,
            "text": "So, man had to force dogs to be their friend, while cats chose to be our friends. Now who's truly man's best friend?",
            "title_similarity": "0.46421868",
            "sentiment_compound": 0.9485
        },
        {
            "id": "hma3o2r",
            "score": 1,
            "text": "That’s why they can do without us.",
            "title_similarity": "0.32593453",
            "sentiment_compound": 0.0
        },
        {
            "id": "hma5a3n",
            "score": 1,
            "text": "Cats really like routine",
            "title_similarity": "0.47186106",
            "sentiment_compound": 0.4201
        },
        {
            "id": "hma5b7d",
            "score": 2,
            "text": "My cat regularly murders animals that look more than capable of taking him on. I’m pretty sure that if I was smaller he would consider taking me on.",
            "title_similarity": "0.38406304",
            "sentiment_compound": 0.5233
        },
        {
            "id": "hma5dmc",
            "score": 1,
            "text": "Cats domesticated us. They are virtually unchanged compared to their ancestors unlike dogs, cows, or any other domestic animal. \n\nThey did such a good job domesticating me I have to feed them wet food every day at 1800, I got a giant cat tree in the corner, two cat wheels I have to keep up with cat nip, three cat hammocks, and a litter box they still go I even thought they have access to a cat door, also I got a super dance cat door that uses a microchip to open so I can be sure nothing follows them into the house.",
            "title_similarity": "0.7210529",
            "sentiment_compound": 0.8442
        },
        {
            "id": "hma5g8k",
            "score": 1,
            "text": "If cats ever got their act together they’d conquer the Milky Way.",
            "title_similarity": "0.53433263",
            "sentiment_compound": 0.0
        },
        {
            "id": "hma5hri",
            "score": 1,
            "text": "My cats are close to their wild ancestors, but they’re a “hybrid” breed. One of these days, I need to track down their pedigrees. One is absolutely more standoffish than the other (and the other two I had). They came from different breeders, and I’ve always wondered if the younger one is closer in generation.",
            "title_similarity": "0.64431405",
            "sentiment_compound": 0.0
        },
        {
            "id": "hma7glg",
            "score": 2,
            "text": "theyre perfect little creatures, despite the bizarre socially permissible anti-cat sentiment... they just happen to be cute to the human eye and theyve exploited their favored status very shrewdly... \n\nbut consider their predicament! the human comparison would be if we found ourselves in a world where the dominant species were like super intelligent bears or gorillas and humans were nude scavengers who if we play our cards right can get fed and taken in... even if the bear overlords are really nice it would still be awkward, the part where they pick us up and kiss on us and do babytalk in a booming and bass-y unknown language would be annoying and offputting at best... the part where they turned us on our back and tickled our bellies would suck too, except we don't have the claws... cats are many things but most of all theyre good sports",
            "title_similarity": "0.4259097",
            "sentiment_compound": 0.9847
        },
        {
            "id": "hma97is",
            "score": 2,
            "text": "Why change perfection?",
            "title_similarity": "0.193451",
            "sentiment_compound": 0.5719
        },
        {
            "id": "hmabgi7",
            "score": 2,
            "text": "It’s kinda hard to evolve when you are sleeping all the time",
            "title_similarity": "0.21134105",
            "sentiment_compound": -0.0276
        },
        {
            "id": "hmabo7e",
            "score": 1,
            "text": "So Rimworld what right? Animals can just choose to join a colony?",
            "title_similarity": "0.3481061",
            "sentiment_compound": 0.3736
        },
        {
            "id": "hmac1fs",
            "score": 1,
            "text": "Maybe they domesticated us. They figured if they made baby noises at us and looked cute, we give them food… And it worked.",
            "title_similarity": "0.41096398",
            "sentiment_compound": 0.4588
        },
        {
            "id": "hmad2b0",
            "score": 1,
            "text": "We have to have a lid on any cup of water we drink because one of our cats will always come specifically to drink out of our cups.\n\nAlso, if you are running water somewhere, they will insist you leave it running for them to drink from. We've had to rubber band a faucet together so she can't turn it on.",
            "title_similarity": "0.4577217",
            "sentiment_compound": -0.0516
        },
        {
            "id": "hmad9yn",
            "score": 1,
            "text": "My cat learned how to let himself inside closed rooms",
            "title_similarity": "0.50223935",
            "sentiment_compound": 0.0
        },
        {
            "id": "hmadxar",
            "score": 1,
            "text": "More like, cats trained humans to take care of them.\n\nSlavery exists, and cats are the masters.",
            "title_similarity": "0.5664757",
            "sentiment_compound": 0.0498
        },
        {
            "id": "hmaf247",
            "score": 1,
            "text": "My cat is definitely feral during these teenage years lol",
            "title_similarity": "0.4448862",
            "sentiment_compound": 0.6705
        },
        {
            "id": "hmaju86",
            "score": 1,
            "text": "cat is a cat is a cat is a cat",
            "title_similarity": "0.39016503",
            "sentiment_compound": 0.0
        },
        {
            "id": "hmak77a",
            "score": 1,
            "text": "Technically they have been domesticated twice.",
            "title_similarity": "0.39220002",
            "sentiment_compound": 0.0
        },
        {
            "id": "hmakpml",
            "score": 1,
            "text": "Semi domesticated species",
            "title_similarity": "0.28695363",
            "sentiment_compound": 0.0
        },
        {
            "id": "hmam6qt",
            "score": 2,
            "text": "Owning one I can tell you that “domesticated” is a strong word",
            "title_similarity": "0.36572787",
            "sentiment_compound": 0.5106
        },
        {
            "id": "hmaq0xt",
            "score": 2,
            "text": "yessiiiir, just think about how cats literally live with humans for thousands of years, thats the reason lots of cats come to people when they are pregnant about to give birth. Its in their DNA to live with people now.",
            "title_similarity": "0.6736556",
            "sentiment_compound": 0.0
        },
        {
            "id": "hmar0iq",
            "score": 1,
            "text": "This tells it perfectly.  The Cat That Walks By Himself. \n\nhttps://youtu.be/9IbTHL-AXH8",
            "title_similarity": "0.5283947",
            "sentiment_compound": 0.6369
        },
        {
            "id": "hmat8is",
            "score": 2,
            "text": "By killing all those plague mice they likely helped end it.",
            "title_similarity": "0.3983909",
            "sentiment_compound": -0.6597
        },
        {
            "id": "hmawwmx",
            "score": 1,
            "text": "Cats domesticated humans. **FTFY",
            "title_similarity": "0.5730781",
            "sentiment_compound": 0.0
        },
        {
            "id": "hmb20qq",
            "score": 1,
            "text": "I sing with mine. I call her name happy in a singing way with two different tones and she sometimes do the same once per day when we play together. Its really nice . Feels like a big achievement even if we just communicate our name in a two singing tones.",
            "title_similarity": "0.38361454",
            "sentiment_compound": 0.8932
        },
        {
            "id": "hmb75uz",
            "score": 1,
            "text": "\"A cat has self tamed!\" Thanks randy random",
            "title_similarity": "0.5828115",
            "sentiment_compound": 0.4926
        },
        {
            "id": "hmb79ql",
            "score": 1,
            "text": "Cats are stubborn that’s why",
            "title_similarity": "0.31179935",
            "sentiment_compound": -0.4019
        },
        {
            "id": "hmbahpc",
            "score": 1,
            "text": "Douglas Adams got it all wrong. It won’t be “so long and thanks for the all the fish”, but “meow, suckers!”",
            "title_similarity": "0.35112315",
            "sentiment_compound": -0.1007
        },
        {
            "id": "hmbnx1k",
            "score": 2,
            "text": "I’ve seen cats referred to as semi-domesticated in recent scientific literature. Because their genome has barely changed when compared to wildcats they tend to exist on their own terms, and not for the sole purpose of assisting or pleasing humans. This is pretty different to most other domestic animals when you think about it.",
            "title_similarity": "0.6645619",
            "sentiment_compound": 0.765
        },
        {
            "id": "hmbqcdb",
            "score": 5,
            "text": "Cats domesticated humans.\n\nWe domesticated and controlled dogs for them.  Feed and house them.  For those that still choose to roam free, we still feed and provide for them.\n\nWell played cats… yes, I will stop typing and pet you now.",
            "title_similarity": "0.64557993",
            "sentiment_compound": 0.8074
        },
        {
            "id": "hmbrktk",
            "score": 6,
            "text": "They didn't domesticate themselves, they domesticated us.",
            "title_similarity": "0.35183096",
            "sentiment_compound": 0.0
        },
        {
            "id": "hmc7539",
            "score": 1,
            "text": "Mine used to turn on the faucet so he could curl up in the sink and take a bath, and also because he knew I would come turn it off, which meant he could start bugging me to play fetch.",
            "title_similarity": "0.30228952",
            "sentiment_compound": 0.34
        },
        {
            "id": "hmcdix2",
            "score": 2,
            "text": "Mine scratches on the closed bathroom door, to get me to turn on the bathtub water.",
            "title_similarity": "0.257828",
            "sentiment_compound": 0.0
        },
        {
            "id": "hmcxw31",
            "score": 2,
            "text": "I wonder if cats actually did their own natural selection to become more small, cute and endearing because that’s actually what ensures their survival by being appealing to humans, as opposed to being stronger to survive like the other animals",
            "title_similarity": "0.53236663",
            "sentiment_compound": 0.8714
        },
        {
            "id": "hmd6w2s",
            "score": 1,
            "text": ">",
            "title_similarity": "0.1273385",
            "sentiment_compound": 0.0
        },
        {
            "id": "hmdbfpy",
            "score": 1,
            "text": "Triangle-faced demons.",
            "title_similarity": "0.08886054",
            "sentiment_compound": 0.0
        },
        {
            "id": "hmhjvwc",
            "score": 4,
            "text": "My cat turns on the clock radio to wake us up when he decides it’s morning.",
            "title_similarity": "0.46163523",
            "sentiment_compound": 0.0
        },
        {
            "id": "hmi36uu",
            "score": 3,
            "text": "I wrote my college thesis paper on this!",
            "title_similarity": "0.29274428",
            "sentiment_compound": 0.0
        },
        {
            "id": "hmj5vjz",
            "score": 1,
            "text": "my cat is a fatty and super lazy, but when she went outside she caught and killed so many moles. the most i’ve picked up is SIX in one day. She’s a killer, but also loves belly rubs, very funny",
            "title_similarity": "0.43512565",
            "sentiment_compound": -0.4872
        },
        {
            "id": "hml4rwf",
            "score": 1,
            "text": "Are they the only animal to domesticate themselves?",
            "title_similarity": "0.4679338",
            "sentiment_compound": 0.0
        },
        {
            "id": "hmlx78q",
            "score": 1,
            "text": "Arguably, cats aren't even domesticated.",
            "title_similarity": "0.41535157",
            "sentiment_compound": -0.25
        },
        {
            "id": "hmmfydt",
            "score": 1,
            "text": "My cat is super sweet , he races me to my computer chair (he wins most the time ) and then will stand on his hind legs until I pick him up. From there he purrs contentedly while biting the shit out of my shoulder . Truly a marvelous creature",
            "title_similarity": "0.50544083",
            "sentiment_compound": 0.9758
        },
        {
            "id": "hmx7a29",
            "score": 2,
            "text": "😻",
            "title_similarity": "0.09984415",
            "sentiment_compound": 0.4588
        },
        {
            "id": "hnlbc0p",
            "score": 1,
            "text": "There’s a wonderful cat book (and two sequels) titled, The Cat that Went to Paris.",
            "title_similarity": "0.50253475",
            "sentiment_compound": 0.5719
        },
        {
            "id": "hp8ieu3",
            "score": 2,
            "text": "You know what this tells me? They didn't domesticate themselves... they domesticated us.",
            "title_similarity": "0.42574644",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpe2sq0",
            "score": 1,
            "text": "Yeah",
            "title_similarity": "0.07034643",
            "sentiment_compound": 0.296
        },
        {
            "id": "hpg8wui",
            "score": 2,
            "text": "My cat is more of a homeless man camping in my house but hes helping so im not bothered. He gets a \"semi warm house\" to live in. Its mostly winter here except in july so the temp inside is basically never over 14°c and he feeds himself by getting rid of mice and rats.",
            "title_similarity": "0.567506",
            "sentiment_compound": 0.7899
        }
    ]
}