{
    "TIL that Javier Bardem's performance as Anton Chigurh in 'No Country for Old Men' was named the 'Most Realistic Depiction of a Psychopath' by an independent group of psychologists in the 'Journal of Forensic Sciences'.\n": [
        {
            "id": "hpg2ynn",
            "score": -8,
            "text": "I was dating a girl at the time this movie came out that was in shock after the movie. Not because of how creepy he was but because he drank milk. So do I. She hates it. When he took a drink she just looked at me. Then I warned her about the tracking device before the characters knew. After the movie she seriously asked me “How could you possibly know so much about being a criminal?!” I just told her I watched too many movies and winked.",
            "title_similarity": "0.5690237",
            "sentiment_compound": -0.8639
        },
        {
            "id": "hpglj5l",
            "score": -4,
            "text": "I just don't get it. Chigurh is the LEAST frightening villian I've ever seen. Yes he is ruthless and methodolical but he survives on plot convienenences. His magical whisper quiet silenced shot gun and ability to walk unnoticed, fully armed through a multi story office building in the middle of the day certainly make it easier to seem scary. He also monologues like a superman vilian but with less eloquence. \n\nI want to feed him to Hannibal Lechter.",
            "title_similarity": "0.70189345",
            "sentiment_compound": 0.8084
        },
        {
            "id": "hpgjg2o",
            "score": -13,
            "text": "Was Donald Trump's performance in Home Alone 2 considered?",
            "title_similarity": "0.4531103",
            "sentiment_compound": -0.25
        },
        {
            "id": "hph8qh0",
            "score": -11,
            "text": "I think Donald trump did a less nuanced but nevertheless equally amazing portrayal of a psychopath",
            "title_similarity": "0.6833016",
            "sentiment_compound": 0.7351
        },
        {
            "id": "hpgzq8x",
            "score": -13,
            "text": "It's completely unrealistic though lmfao. Psychology is pseudoscience.",
            "title_similarity": "0.51005536",
            "sentiment_compound": 0.3744
        },
        {
            "id": "hpgg961",
            "score": -26,
            "text": "Immensely overrated character, in probably one of the Coens lesser films.",
            "title_similarity": "0.4867284",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpg8v3n",
            "score": 5,
            "text": " I had to do a double take when I read that it was a study by an independent group of psychopaths...",
            "title_similarity": "0.6186234",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpg3o93",
            "score": 42,
            "text": "Not gonna lie. I never *got* that movie... Watched it in high school and just...didn't understand what was happening the whole time.",
            "title_similarity": "0.40875667",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpi10eq",
            "score": 1,
            "text": "Knowing actual diagnosed ASPD people they probably meant most sensationalized depiction. People with ASPD live all around us, most of you wouldn't even know it.",
            "title_similarity": "0.50388324",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpgkn4o",
            "score": 9,
            "text": "I thought this movie was horrible in the sense that he got to walk around like Jason from Friday the 13th unrealistically killing people. The ending was even worse. He gets into a car accident and gets to walk away. Its been a while since I saw this movie but that was my initial thoughts on it.",
            "title_similarity": "0.60224277",
            "sentiment_compound": -0.743
        },
        {
            "id": "hpgy8cb",
            "score": 25,
            "text": "Forensic psychologist here. I've worked in prisons as a psychologist in three different countries\n\nI  think this is just dead wrong.\n\nFor one, this isn't even a clinical term. The DSM uses the term '\"antisocial personality disorder.\" Here are the criteria. This isn't really his character. Sure he fits SOME of this, but he's really missing the charming and manipulative part. But hold tight, we will discuss the term \"psychopath\" in a minute.\n\nDisregard for right and wrong\n\nPersistent lying or deceit to exploit others\n\nBeing callous, cynical and disrespectful of others\n\nUsing charm or wit to manipulate others for personal gain or personal pleasure\n\nArrogance, a sense of superiority and being extremely opinionated\n\nRecurring problems with the law, including criminal behavior\n\nRepeatedly violating the rights of others through intimidation and dishonesty\n\nImpulsiveness or failure to plan ahead\n\nHostility, significant irritability, agitation, aggression or violence\n\nLack of empathy for others and lack of remorse about harming others\n\nUnnecessary risk-taking or dangerous behavior with no regard for the safety of self or others\n\nPoor or abusive relationships\n\nFailure to consider the negative consequences of behavior or learn from them\n\nBeing consistently irresponsible and repeatedly failing to fulfill work or financial obligations\n\n&#x200B;\n\nRobert Hare is arguably the world's leading expert on psychopathy. Here are the 20 items on his psychopathy checklist.\n\nglib and superficial charm\n\ngrandiose (exaggeratedly high) estimation of self\n\nneed for stimulation\n\npathological lying\n\ncunning and manipulativeness\n\nlack of remorse or guilt\n\nshallow affect (superficial emotional responsiveness\n\ncallousness and lack of empathy\n\nparasitic lifestyle\n\npoor behavioral controls\n\nsexual promiscuity\n\nearly behavior problems\n\nlack of realistic long-term goals\n\nimpulsivity\n\nirresponsibility\n\nfailure to accept responsibility for own actions\n\nmany short-term marital relationships\n\njuvenile delinquency\n\nrevocation of conditional release\n\ncriminal versatility\n\n&#x200B;\n\nI think we have really mixed up, \"super scary and interesting villian\" with the term psychopath here.\n\nAmy from \"Gone Girl\" and Chad from \"In the Company of Men\" are chilling characters utterly without remorse, but again, they don't really fit this list either. Honestly someone like Jack from the movie \"Sideways\" is probably closer to this list than all these awesome supervillains. He's a user. He's only interested in his own pleasure. He lies easily and convincingly.\n\nJust like to mention this because psychopaths walk among us in every walk of life, and they aren't often remotely like Anton. Using the term in this way contributes to a misunderstanding of what a psychopath really is. The real psychopath in everyday life would be that funny, charming guy in the bar preying on lonely and vulnerable women for financial gain. The kind that destroys marriages and credit ratings. I would hazard a guess we've all met one of these in our lives. I've counselled far too many women (and some men) who have had their lives destroyed by these people.\n\nI doubt most of us will ever meet a Chigurh. I've worked with thousands of inmates and have never met one.  \n\n\nEdit- Upon thinking about it a little more, I thought of a perfect example of a psychopath, \"Dirty John\" played by Eric Bana in the recent series. Based on the real John Meehan, who was in an out of jail and got a number of prominent women to give him money. Incredibly, he was killed by the tiny daughter of his recent victim, who stabbed him after he tried to kill her in a revenge attack.   \nhttps://people.com/crime/the-true-story-behind-dirty-john-meehan/",
            "title_similarity": "0.7231847",
            "sentiment_compound": -0.9989
        },
        {
            "id": "hpggtda",
            "score": -10,
            "text": "Have they seen Spider-Man No Way Home yet? Cuz Norman Osbourne has an opinion on this subject.",
            "title_similarity": "0.517934",
            "sentiment_compound": -0.296
        },
        {
            "id": "hpi980n",
            "score": -4,
            "text": "A great performance by Javier Bardem, but I would give the award for most realistic depiction of a psychopath to Trump for his performance in 'Home Alone 2'.",
            "title_similarity": "0.80440116",
            "sentiment_compound": 0.7003
        },
        {
            "id": "hpk0rxi",
            "score": -4,
            "text": "This was such a terrible movie, can’t believe it won best picture.",
            "title_similarity": "0.5174855",
            "sentiment_compound": 0.7003
        },
        {
            "id": "hpg42uc",
            "score": -22,
            "text": "That’s how I act on a normal day ☹️\n\nNo wonder ppl avoid me lol",
            "title_similarity": "0.3461284",
            "sentiment_compound": -0.4588
        },
        {
            "id": "hpgnsb6",
            "score": 0,
            "text": "\"depiction\"",
            "title_similarity": "-0.049729772",
            "sentiment_compound": 0.0
        },
        {
            "id": "hph3wxc",
            "score": 0,
            "text": "Jodie Comers character in Killing Eve is a great example as well imo.",
            "title_similarity": "0.47574914",
            "sentiment_compound": 0.2023
        },
        {
            "id": "hphb5rr",
            "score": 0,
            "text": "Anton doesn’t exist. It’s a fantasy of Tommy Lee Johnes about a stone cold killer. All assassinations was made by a main character",
            "title_similarity": "0.6523744",
            "sentiment_compound": -0.8402
        },
        {
            "id": "hphswxu",
            "score": 0,
            "text": "Except his motivations don't make sense. We are to believe he's this driven guy that is willing to flip on his employer but in his late 40s? Someone with his drive and determination would have already pulled that slick shit with the money a while ago or would be running a fortune 500 company....or both.",
            "title_similarity": "0.5209567",
            "sentiment_compound": -0.3291
        },
        {
            "id": "hphtc63",
            "score": 0,
            "text": "Good for him?",
            "title_similarity": "0.20674601",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hpi38wx",
            "score": 0,
            "text": "NO!!  This is terrifying.",
            "title_similarity": "0.17683595",
            "sentiment_compound": -0.6467
        },
        {
            "id": "hpi9vix",
            "score": 0,
            "text": "Interesting. Horrible movie",
            "title_similarity": "0.3410627",
            "sentiment_compound": -0.2023
        },
        {
            "id": "hpibq8n",
            "score": 0,
            "text": "Ngl that was the most boring movie I've ever watched",
            "title_similarity": "0.5313197",
            "sentiment_compound": -0.3804
        },
        {
            "id": "hpj10px",
            "score": 0,
            "text": "One of the best movies ever made. Probably because it was 99% true to the book.",
            "title_similarity": "0.5044056",
            "sentiment_compound": 0.7906
        },
        {
            "id": "hpj6paw",
            "score": 0,
            "text": "So what'll it be?\n\nEverything\n\nWhat do you mean?\n\nLong in the short places. Short in the long places. It should be from both the future and the past, like something a child would do to a doll",
            "title_similarity": "0.2878632",
            "sentiment_compound": 0.4329
        },
        {
            "id": "hpjow19",
            "score": 0,
            "text": "Ok",
            "title_similarity": "-0.08488405",
            "sentiment_compound": 0.296
        },
        {
            "id": "hpfzklu",
            "score": 7,
            "text": "I would absolutely agree!",
            "title_similarity": "0.034591287",
            "sentiment_compound": 0.474
        },
        {
            "id": "hpgbej4",
            "score": -1,
            "text": "Javier is an incredible actor.  He gave me the creeps in NCFOM.",
            "title_similarity": "0.5594872",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpgtruo",
            "score": 1,
            "text": "They obviously never seen American psycho which is a way better depiction",
            "title_similarity": "0.5247394",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hpguypo",
            "score": -1,
            "text": "One of the worst films I've ever seen.",
            "title_similarity": "0.47874296",
            "sentiment_compound": -0.6249
        },
        {
            "id": "hpgxtfy",
            "score": 1,
            "text": ">...an independent group of psychologist...\n\n\"Independant\" from what? Independant from the movie studio?",
            "title_similarity": "0.57730556",
            "sentiment_compound": 0.0
        },
        {
            "id": "hph5lpm",
            "score": -1,
            "text": "I wish that had been a better movie.",
            "title_similarity": "0.32320106",
            "sentiment_compound": 0.6808
        },
        {
            "id": "hph6ca7",
            "score": 1,
            "text": "I think he was also the guy that kidnapped people in benidorm and held them hostage on the hotel roof?",
            "title_similarity": "0.4398161",
            "sentiment_compound": 0.0
        },
        {
            "id": "hph6fhd",
            "score": -1,
            "text": "Perhaps he has a bit of that in him which would explain his support of disgusting pedophile Woody Allen.",
            "title_similarity": "0.5152746",
            "sentiment_compound": -0.1779
        },
        {
            "id": "hph6ioc",
            "score": 1,
            "text": "[Here’s the actual paper](https://onlinelibrary.wiley.com/doi/abs/10.1111/1556-4029.12359).  It wasn’t an “independent group” of psychologists. It was two psychiatrists who knew each other (think Niles and Frasier) and went in to it with certain conclusions as a goal. \n\nThis isn’t my field but honestly I’m shocked they were able to get this published. I’ve heard from many psychiatrists that no self-respecting member of their profession uses the term “psychopath” so the verbiage is not really professional,  and more importantly there’s no reproducibility to their methods. At the end of the day it’s still a purely subjective judgment call from two guys who sat through hundreds of movies who happen to have terminal degrees in their field. Repeat the same study with different professionals of the same level and you’ll get different results, which can’t be reproduced or verified so it flies in the face of the scientific method.\n\nHowever this isn’t a psychiatric journal, it’s more of an interdisciplinary journal aimed at cops and forensic technicians. So it’s probably a lot of raw lab research and the psychiatric sections are pseudoscience like personality typing, statistics on whether people look left or right before they lie that sort of thing.",
            "title_similarity": "0.7007108",
            "sentiment_compound": 0.1139
        },
        {
            "id": "hph6r31",
            "score": 1,
            "text": "I am sure that idiot Athena Walker will be all over this pumping up her schtick.\n\nAnd psychologists are idiots.  Of course it’s the most realistic to them.  They get to study prisoners.   \n\nWhy the fuck would a healthy psychopath risk seeing a psychologist?  That makes sense doesn’t it.",
            "title_similarity": "0.715852",
            "sentiment_compound": -0.802
        },
        {
            "id": "hph8ic3",
            "score": 1,
            "text": "He was like an anti cop. He had principals that never failed him an he enforced those principals.",
            "title_similarity": "0.5371145",
            "sentiment_compound": 0.4408
        },
        {
            "id": "hpha6q5",
            "score": -1,
            "text": "I’d say Trump’s performance as President, but then again, each character actor in his cabinet, made Javier Bardem’s psychopath, look like Tom Hanks in comparison.",
            "title_similarity": "0.66999185",
            "sentiment_compound": 0.5023
        },
        {
            "id": "hphgz7v",
            "score": -1,
            "text": "It amazes me that so many people don't understand who his character represents in this movie.\n\nHe isn't really \"in\" the movie. He is playing the grim reaper. His hair cut is even made to look like he's wearing a hood.\n\nThis is really a new take on western movies but with a spin. Hence the name, no county for old men.",
            "title_similarity": "0.66033316",
            "sentiment_compound": -0.3506
        },
        {
            "id": "hphm8r7",
            "score": -1,
            "text": "HE SENT HIS KID TO NXIVM’S SCHOOL FOR KIDS AND HIS NANNY WAS PAID A 140k A YEAR AND A HIGH RANKING NXIVM MEMBER! #ALLRHODESWEST\n\n(I love that movie)",
            "title_similarity": "0.47590774",
            "sentiment_compound": 0.6696
        },
        {
            "id": "hphnhyp",
            "score": -1,
            "text": "We know, this gets posted every 2 weeks.",
            "title_similarity": "0.17220138",
            "sentiment_compound": 0.0
        },
        {
            "id": "hphpthq",
            "score": -1,
            "text": "I heard that they got a real serial killer for the actor to learn from.\n\nAnd then the director did a Stanley Kubrick, and hired the actual serial killer to play the part.",
            "title_similarity": "0.6839567",
            "sentiment_compound": -0.802
        },
        {
            "id": "hpimmpe",
            "score": 1,
            "text": "Aren’t psychopaths usually more charming and can blend in with people better? He just seemed like a robot throughout the entire movie.",
            "title_similarity": "0.6271869",
            "sentiment_compound": 0.8588
        },
        {
            "id": "hpiu7rb",
            "score": -1,
            "text": "Nah. I love that film and his performance, but it definitely wasn't a perfect depiction. It was really good though.",
            "title_similarity": "0.49035585",
            "sentiment_compound": 0.7385
        },
        {
            "id": "hpj62pd",
            "score": -1,
            "text": "Yeah it’s one of the greatest movies /acting performances ever and you show it to some broad : “ohh I didn’t really like that one, you liked that one? That sucked.”",
            "title_similarity": "0.60446346",
            "sentiment_compound": 0.8999
        },
        {
            "id": "hpg290w",
            "score": 13,
            "text": "Shortlist would be Bardem's role in Skyfall, equally psycho.",
            "title_similarity": "0.51862895",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpg69wu",
            "score": 8,
            "text": "They haven’t met my mother.",
            "title_similarity": "0.17672533",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpgifgt",
            "score": -16,
            "text": "[deleted]",
            "title_similarity": "0.10133153"
        },
        {
            "id": "hpgbgq8",
            "score": 2,
            "text": "Dudes not even evil as I would define it, evil requires you to want the bad things you do to happen and to enjoy them. He has no joy, no remorse, and no hate. He just is.",
            "title_similarity": "0.56618345",
            "sentiment_compound": 0.1887
        },
        {
            "id": "hpgeyiq",
            "score": 2,
            "text": "Hi emotionlessness and seemingly arbitrary disregard for human life was a joy to watch",
            "title_similarity": "0.43083942",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hpgizlt",
            "score": 2,
            "text": "He looks like he could be Adam driver's dad.",
            "title_similarity": "0.45781463",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hpgjiw7",
            "score": 2,
            "text": "Guess they never watched Fox News",
            "title_similarity": "0.32549036",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpgl8uk",
            "score": 2,
            "text": "Not a psychologist, but I thought his depiction was almost too sedate. As I understand it, psychopaths often tend toward thrill-seeking behavior and often aren't especially aroused by circumstances that would excite normal people. I've heard it said they seek out these experiences because they're emotionally blunted and don't *feel emotions* like normal people. Chigurh struck me as robotic and driven by a mission or his code, rather than opportunistically amusing himself. The gas station scene might be an exception, but I'm skeptical a psychopath (especially one with some shred of sadism) would have let a coin flip get in the way of his \"fun\".",
            "title_similarity": "0.580999",
            "sentiment_compound": 0.8039
        },
        {
            "id": "hpgrid5",
            "score": 2,
            "text": "To be honest. Most psychopaths are actually lame in real life.. If you've met some. They haveno idea how to act socially and make girls cry without knowing what they did.. They really suck at manipulating people.. I doubt most of you have any Ide WHT psychopath is really life.. Its not a sexy murderer",
            "title_similarity": "0.57897735",
            "sentiment_compound": -0.8469
        },
        {
            "id": "hpgtoz9",
            "score": -2,
            "text": "Neat. Movie was still boring as fuck.",
            "title_similarity": "0.38366014",
            "sentiment_compound": -0.4215
        },
        {
            "id": "hph4hlw",
            "score": 2,
            "text": "Wouldn't real professional psychologists have used the term sociopath?",
            "title_similarity": "0.5816431",
            "sentiment_compound": 0.0
        },
        {
            "id": "hphnaad",
            "score": -2,
            "text": "Movie sucked donkey balls",
            "title_similarity": "0.27146277",
            "sentiment_compound": -0.4588
        },
        {
            "id": "hpicog3",
            "score": -2,
            "text": "If only it was enough to actually make the movie good",
            "title_similarity": "0.33823925",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hplizuh",
            "score": -2,
            "text": "That movie sucked so badly!! If I had watched it in the theater I would have asked for a refund.",
            "title_similarity": "0.45701724",
            "sentiment_compound": -0.8213
        },
        {
            "id": "hpg22d7",
            "score": 20,
            "text": "This movie and Strangeland  by dee snider regularly get touted for their accurate portrayals of their psychos",
            "title_similarity": "0.61257166",
            "sentiment_compound": -0.0516
        },
        {
            "id": "hpg6pjd",
            "score": -3,
            "text": "It wasn’t acting…plot twist",
            "title_similarity": "0.16620898",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpgddzo",
            "score": 2,
            "text": "It reminds me of Ledger's Joker performance, no one will ever pull it off that well ever again.",
            "title_similarity": "0.53087837",
            "sentiment_compound": 0.1027
        },
        {
            "id": "hpggxua",
            "score": -2,
            "text": "I have tried for years to Emulate this guy!!!",
            "title_similarity": "0.31003144",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpgm475",
            "score": 2,
            "text": "Can anybody tell me what the hell Tommy Lee Jones was rambling about that entire movie?",
            "title_similarity": "0.4919147",
            "sentiment_compound": -0.6808
        },
        {
            "id": "hpgs6em",
            "score": -4,
            "text": "\"Mom, the psychologists are latching their charlatan fingers onto pop culture to try and promote their discipline as a science again.\" \n\n\"Just ignore them sweety.\"\n\n\"But mooooooom!\"",
            "title_similarity": "0.5883477",
            "sentiment_compound": 0.088
        },
        {
            "id": "hpjlnkq",
            "score": 3,
            "text": "Here’s a criminologist review of Javier’s character:\n\n[https://youtu.be/29n2bv7F6uc](https://youtu.be/29n2bv7F6uc)\n\nWhich I would agree with. Anton is too on the nose (cold / emotionless) his actions and thinking process don’t really line up to what/how a realistic psychopath would behave. \n\nThe criminologist review of Hannibal makes more sense. Albeit, it’s a total Hollywood dramatization of a serial killer, Hopkins and Demme knock it out the park.",
            "title_similarity": "0.75106657",
            "sentiment_compound": -0.4215
        },
        {
            "id": "hpgmpfa",
            "score": 12,
            "text": "Bardem seems rediculously underrated considering his talents",
            "title_similarity": "0.4161732",
            "sentiment_compound": 0.4588
        },
        {
            "id": "hpg3y40",
            "score": 4,
            "text": "such a great movie",
            "title_similarity": "0.26140994",
            "sentiment_compound": 0.6249
        },
        {
            "id": "hpgx2a7",
            "score": 4,
            "text": "Having known legit psychopaths, gangbangers that shoot and spray bullets around neighborhoods, some with a few murders under their belt. How Anton shows no emotion but will mirror the facial expressions the other person does after seeing em, like a \"What face should I wear in this dialogue\" kinda deal. TOTALLY ACCURATE!",
            "title_similarity": "0.62492883",
            "sentiment_compound": -0.2124
        },
        {
            "id": "hpi3jip",
            "score": -4,
            "text": "Worst movie I've ever seen. It was between this and Zoolander. Shoulda watched Zoolander.",
            "title_similarity": "0.54580677",
            "sentiment_compound": -0.6249
        },
        {
            "id": "hpgaz2g",
            "score": -14,
            "text": "At least some good acting came from one of the worst movies of all time.\n\nEdit: if you have self-diagnosed that you have shit taste in movies because you liked No Country for Old Men, please downvote this comment",
            "title_similarity": "0.6686691",
            "sentiment_compound": -0.4404
        },
        {
            "id": "hpg7ykb",
            "score": 306,
            "text": "I just want to say I love Bardem in Dune, but having him do his amazing Spanish moorish dusty Fremen acting and then Zendaya just says “sup. Here’s a dagger so you die honorably. Sucks, that’s life” in a 100% American accent drives me IIIISSSAANNNEEE. Ugh. She looks the part perfectly, but as soon as she speaks the illusion is wrecked for me.",
            "title_similarity": "0.6263161",
            "sentiment_compound": 0.7922
        },
        {
            "id": "hpgbqiu",
            "score": 5,
            "text": "Call it.",
            "title_similarity": "-0.029920045",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpgk0k7",
            "score": -5,
            "text": "So... numerous people have told me that I remind them of Chigurh. Not just look like but how he walks and acts. Soooo",
            "title_similarity": "0.29161018",
            "sentiment_compound": -0.1419
        },
        {
            "id": "hph58uf",
            "score": 5,
            "text": "“I am going to kill you because you are an old man, and as you know, this is no country for old men” \n\n-Anton Chigurh",
            "title_similarity": "0.5599886",
            "sentiment_compound": -0.7845
        },
        {
            "id": "hpg5pzc",
            "score": 5,
            "text": "Friendo",
            "title_similarity": "0.09451772",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpg9otu",
            "score": -4,
            "text": "I didn't think he was a psychopath, I just thought he was really good and dedicated to his job.",
            "title_similarity": "0.42453355",
            "sentiment_compound": 0.7548
        },
        {
            "id": "hpgmv3w",
            "score": 7,
            "text": "I read the title as \"'Most Realistic Depiction of a Psychopath' by an independent group of psychopaths.\" \n\nGlad to see this study got a peer review.",
            "title_similarity": "0.71858275",
            "sentiment_compound": 0.4588
        },
        {
            "id": "hpgnlmn",
            "score": 6,
            "text": "The matter-of-factness of it is, IMO, what makes it so frightening.\n\nThere's no dramatic flair, no grandiose posturing. It's just a guy doing what he's doing because he needs to get it done with no reverence for any pain he's causing or morals he might be violating. \n\nIt's not even like he's conflicted about what he's doing (ie- Buffalo Bill getting upset over having someone in the well to kill, but doing it anyway), because something inside him is fundamentally broken and doesn't register good vs. bad in anything like the rest of society does.",
            "title_similarity": "0.57582283",
            "sentiment_compound": -0.9694
        },
        {
            "id": "hpgvv8c",
            "score": 6,
            "text": "Stelio.. Stelio Kontos!",
            "title_similarity": "0.08873916",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpihpjt",
            "score": -6,
            "text": "Biden evil democracy evil commcuist 🐒🐵 the the beasts of hell but Trump the great is fighting back.",
            "title_similarity": "0.5383935",
            "sentiment_compound": -0.5859
        },
        {
            "id": "hpg5mno",
            "score": 54,
            "text": "Meanwhile, psychologists don't consider psychopathy to be a specific mental disorder, but a trait of antisocial behavior.",
            "title_similarity": "0.5209231",
            "sentiment_compound": -0.2144
        },
        {
            "id": "hpfxzc1",
            "score": 121,
            "text": "This movie was terrifying, even though I kept calling it old man country",
            "title_similarity": "0.53955775",
            "sentiment_compound": -0.5719
        },
        {
            "id": "hpgnjkv",
            "score": 6,
            "text": "His confidence in his own logic is what made him so frightening to me.  You can’t reason with that. Many characters tried to.",
            "title_similarity": "0.5525407",
            "sentiment_compound": -0.2062
        },
        {
            "id": "hpfydh7",
            "score": 55,
            "text": "That movie was so good. Edit:  I should have mentioned I read the book (after seeing the movie) and this movie is a rare case of doing the book justice.  Fight Club is another movie that did the book justice but that’s another thread",
            "title_similarity": "0.5449664",
            "sentiment_compound": 0.6086
        },
        {
            "id": "hpg11ww",
            "score": 102,
            "text": "Normal people: terrified\n\nService workers: [*you cannot kill that which is already dead*](https://youtu.be/nh1FjMDKMNw)",
            "title_similarity": "0.5446645",
            "sentiment_compound": -0.0675
        },
        {
            "id": "hpg4576",
            "score": 8,
            "text": "Scariest part was just his face, that haircut played a creepy part",
            "title_similarity": "0.509096",
            "sentiment_compound": 0.34
        },
        {
            "id": "hpgdrfe",
            "score": -8,
            "text": "This gets posted literally daily",
            "title_similarity": "0.11077133",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpgwqr8",
            "score": 10,
            "text": "The Woody Harrelson and AC scene in the hotel. Great, great scene.\n\nWH: Do you have any idea how crazy you are?\nAC: You mean the nature of this conversation?\nWH: I mean the nature of you.",
            "title_similarity": "0.50960636",
            "sentiment_compound": 0.7998
        },
        {
            "id": "hpglzic",
            "score": 10,
            "text": "So, Cormac McCarthy is a superb writer and deserves the Nobel prize\n\nAm I wrong?",
            "title_similarity": "0.5498947",
            "sentiment_compound": 0.6486
        },
        {
            "id": "hpgqakp",
            "score": 14,
            "text": "Was Dennis Reynolds not considered?",
            "title_similarity": "0.21586914",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpgufme",
            "score": 14,
            "text": "Anton Chigurh : What's the most you ever lost on a coin toss?\n\nGas Station Proprietor : Sir?\n\nAnton Chigurh : The most. You ever lost. On a coin toss.\n\nGas Station Proprietor : I don't know. I couldn't say.\n\n[Chigurh flips a quarter from the change on the counter and covers it with his hand] \n\nAnton Chigurh : Call it.\n\nGas Station Proprietor : Call it?\n\nAnton Chigurh : Yes.\n\nGas Station Proprietor : For what?\n\nAnton Chigurh : Just call it.\n\nGas Station Proprietor : Well, we need to know what we're calling it for here.\n\nAnton Chigurh : You need to call it. I can't call it for you. It wouldn't be fair.\n\nGas Station Proprietor : I didn't put nothin' up.\n\nAnton Chigurh : Yes, you did. You've been putting it up your whole life, you just didn't know it. You know what date is on this coin?\n\nGas Station Proprietor : No.\n\nAnton Chigurh : 1958. It's been traveling twenty-two years to get here. And now it's here. And it's either heads or tails. And you have to say. Call it.\n\nGas Station Proprietor : Look, I need to know what I stand to win.\n\nAnton Chigurh : Everything.\n\nGas Station Proprietor : How's that?\n\nAnton Chigurh : You stand to win everything. Call it.\n\nGas Station Proprietor : Alright. Heads then.\n\n[Chigurh removes his hand, revealing the coin is indeed heads]\n\nAnton Chigurh : Well done.\n\n[the gas station proprietor nervously takes the quarter with the small pile of change he's apparently won while Chigurh starts out] \n\nAnton Chigurh : Don't put it in your pocket, sir. Don't put it in your pocket. It's your lucky quarter.\n\nGas Station Proprietor : Where do you want me to put it?\n\nAnton Chigurh : Anywhere not in your pocket. Where it'll get mixed in with the others and become just a coin. Which it is.\n\nEvery time I see this movie mentioned, I have the urge to remind people that it’s one of the best films ever made. Easily in my top 5.",
            "title_similarity": "0.5827962",
            "sentiment_compound": 0.9862
        },
        {
            "id": "hpg088d",
            "score": 26,
            "text": "He definitely did an amazing job.",
            "title_similarity": "0.19546327",
            "sentiment_compound": 0.7579
        },
        {
            "id": "hpfz6oc",
            "score": 411,
            "text": "Great movie made from a great book. If you like it and are a reader, check out blood meridian also from Cormac McCarthy",
            "title_similarity": "0.5085356",
            "sentiment_compound": 0.8934
        },
        {
            "id": "hpg7bkt",
            "score": 35,
            "text": "That shot of the wrapping paper struggling on the counter was some serious filmmaking",
            "title_similarity": "0.41545343",
            "sentiment_compound": -0.4767
        },
        {
            "id": "hpglcp2",
            "score": 40,
            "text": "Javier Bardem looked like the spitting image of my older brother in that movie. So much so that I jumped when I saw my brother next time I saw him. Now he thinks it’s funny to give me quarters",
            "title_similarity": "0.5904239",
            "sentiment_compound": 0.6597
        },
        {
            "id": "hpgcp7o",
            "score": 94,
            "text": "I'm not sure if it's accurate but I likewise thought Jake Gyllenhaal in Nightcrawler played a really chilling psychopath if you're looking for a movie that imitates despicable people.",
            "title_similarity": "0.6902066",
            "sentiment_compound": 0.2569
        },
        {
            "id": "hpg0d9f",
            "score": 212,
            "text": "For the uninitiated: https://youtu.be/BqMdQBox15s",
            "title_similarity": "0.33348733",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpgj3yx",
            "score": 39,
            "text": "[family guy Javier Bardem haircut ](https://youtu.be/PPJ1zHNryJk)",
            "title_similarity": "0.36407512",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpgju8p",
            "score": 44,
            "text": "Don’t put it in your pocket! That’s your lucky quarter. Put it anywhere that’s not in your pocket, or it’ll get mixed in with all the others and become just a coin………which it is.",
            "title_similarity": "0.45022446",
            "sentiment_compound": 0.4753
        },
        {
            "id": "hpgd9hf",
            "score": 48,
            "text": "This is the best villain in all of cinema. Vidal from Pan's Labyrinth is a close second. There's something so visceral about a villain that actually exists, rather than one who is embellished for film.",
            "title_similarity": "0.70514125",
            "sentiment_compound": -0.4588
        },
        {
            "id": "hpgaqzp",
            "score": 127,
            "text": "Anyone who grew up around a farm knew exactly what that tank was for.",
            "title_similarity": "0.25361246",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpfxtcp",
            "score": 57,
            "text": "That must be why I legitimately felt uncomfortable watching him on screen.",
            "title_similarity": "0.3893113",
            "sentiment_compound": -0.3818
        },
        {
            "id": "hpgc4o9",
            "score": 642,
            "text": "Bardem's is one of my favorite performances as a psychopath. Others would be Daniel Day Lewis in There Will be Blood and more recently Jake Gyllenhall in Night Crawler. Although Jake's performance is more of antisocial behavior. You can just tell something is weird and alien with him.",
            "title_similarity": "0.7057423",
            "sentiment_compound": 0.3182
        },
        {
            "id": "hpgaxok",
            "score": 184,
            "text": "The gas station scene where he’s flipping the coin, yeah that was some psychopathic shit right there.",
            "title_similarity": "0.48627508",
            "sentiment_compound": -0.2815
        },
        {
            "id": "hpgfdkr",
            "score": 824,
            "text": "Interesting observation as I thought he may have been over the top.   \n\n\nFrom the actual [Science news article (2014)](https://www.sciencenews.org/blog/gory-details/most-and-least-realistic-movie-psychopaths-ever): \n\n>The maniacal laugh: only in the movies. For a more realistic psychopath, look to bolt-gun–wielding Anton Chigurh from No Country for Old Men. He just quietly walks up and it’s ka-chunk, you’re dead.\n\n>That’s the diagnosis from forensic psychiatrist Samuel Leistedt, who has interviewed and diagnosed real psychopaths, people who he describes as feeling no empathy for others. “They’re cold-blooded,” he says. “They don’t know what an emotion is.”\n\n>Leistedt and his colleague Paul Linkowski spent three years watching 400 movies looking for realistic portrayals of psychopaths. Leistedt says he personally watched all 400, some several times.\n\n>**The frighteningly realistic:**\n\n>*1. Anton Chigurh, No Country for Old Men (2007)*\n\n>This contract killer hauls around a bolt pistol attached to tank of compressed air, a handy tool both for shooting out door locks and for shooting people in the head. Leistedt says Chigurh is his favorite portrayal of a psychopath. “He does his job and he can sleep without any problems.In my practice I have met a few people like this,” he says. In particular, Chigurh reminds him of two real-life professional hit men who he interviewed. “They were like this: cold, smart, no guilt, no anxiety, no depression.”\n>*Diagnosis: Primary, classic/idiopathic psychopath*\n\n\n\n\n>**Scary, but not realistic:**\n\n\n>*3.     Hannibal Lecter, Silence of the Lambs (1991)*\n\n>Yes, he scares the bejesus out of me, too. But Lecter’s almost superhuman intelligence and cunning are just not typical among, well, anyone, let alone psychopaths. Lecter is a perfect example of the “elite psychopath” that became popular in the 1980s and 1990s. This calm, in-control character type has sophisticated tastes and manners (think Chianti and jazz),exceptional skill in killing and a vain and “almost catlike demeanor,” the researchers write, adding, “These traits, especially in combination, are generally not present in real psychopaths.”\n\n>The new release The Wolf of Wall Street may be part of another movie-psychopath trend, the “successful psychopath.” Leistedt hasn’t seen the film yet, but he says the story of real-life con man Jordan Belfort should make for an interesting portrayal. “These guys are greedy, manipulative, they lie, but they’re not physically aggressive,” Leistedt says. Gordon Gekko in Wall Street is an example of a realistic successful movie psychopath. He’s “probably one of the most interesting, manipulative, psychopathic fictional characters to date,” the researchers write.\n\nEdit: Clarified Hannibal’s category.",
            "title_similarity": "0.82793486",
            "sentiment_compound": 0.963
        },
        {
            "id": "hpghqil",
            "score": 81,
            "text": "Bardem was really great in that role. Anybody who hasn’t read the book should do so. The movie is very faithful to the book for the most part but it never explains Chigurh‘s motivation, which is revealed in the book. It’s really fucked up\n\nEdit: autocorrect doesn’t recognize my boy Javier\n\nEdit 2-electric bugaloo: Chigurh’s motivation >!At the end of the book Chigurh goes to return the money to its “rightful” owners. They offer him a finder’s fee, which he declines and just asks that they hire him the next time they need something taken care of. Basically he slaughtered a shit ton of people free lance and tracked down the money pro bono for future job opportunities!<",
            "title_similarity": "0.6503221",
            "sentiment_compound": 0.6842
        },
        {
            "id": "hpgl4p1",
            "score": 91,
            "text": "I read the book after watching the movie, and I had a hard time *not* seeing Bardem in my mind. He did such an amazing job capturing that character. \n\nThat being said, the Coen brothers nailed the adaptation.  Quite possibly the best movie version of a book I've seen.",
            "title_similarity": "0.6324416",
            "sentiment_compound": 0.8344
        },
        {
            "id": "hpg271c",
            "score": 1680,
            "text": "He also lamented the haircut he had to get to play Chigurh because he \"wouldn't get laid\" lmao",
            "title_similarity": "0.49354893",
            "sentiment_compound": -0.4847
        },
        {
            "id": "hpfxydr",
            "score": 263,
            "text": "He was amazing and deeply freaky in that",
            "title_similarity": "0.32674503",
            "sentiment_compound": 0.2516
        },
        {
            "id": "hpg1j31",
            "score": 1027,
            "text": "The scene where he casually kills Woody Harrelson and then kicks his feet up to avoid the blood while talking on the phone.\n\n\"Not in the sense that you mean.\"",
            "title_similarity": "0.57671833",
            "sentiment_compound": -0.6124
        },
        {
            "id": "hpg0c02",
            "score": 2936,
            "text": "The combination of his growly voice \"Call it\" and watery intense eyes was absolutely riveting. Possibly my favorite villain of all time. And that haircut lmao, amazing",
            "title_similarity": "0.61847115",
            "sentiment_compound": 0.8126
        },
        {
            "id": "hpfxt2d",
            "score": 542,
            "text": "Hey friendo",
            "title_similarity": "0.1106625",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpfzing",
            "score": 2397,
            "text": "\"What’s the most you’ve ever lost in a coin toss?\"",
            "title_similarity": "0.39164996",
            "sentiment_compound": -0.3744
        },
        {
            "id": "hpfxyrd",
            "score": 11477,
            "text": "I believe it.  He was scary as hell.",
            "title_similarity": "0.37065881",
            "sentiment_compound": -0.8316
        },
        {
            "id": "hpg6ynn",
            "score": 979,
            "text": "McCarthy + Coens + Bardem = Magic",
            "title_similarity": "0.36268666",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpfyfb5",
            "score": 9768,
            "text": "But he called me his friendo. Seems like a nice guy to be honest.",
            "title_similarity": "0.3933062",
            "sentiment_compound": 0.9081
        },
        {
            "id": "hpg5jyl",
            "score": 6477,
            "text": "Would you hold still, please, sir?",
            "title_similarity": "0.14579144",
            "sentiment_compound": 0.3182
        },
        {
            "id": "hpg5nsc",
            "score": 13818,
            "text": "I wanna give a round of applause for whoever decided to give him that dumbass haircut, it made him look like even more of a psycho",
            "title_similarity": "0.5501189",
            "sentiment_compound": 0.1779
        },
        {
            "id": "hpg2feq",
            "score": 37,
            "text": "Seems like we all could feel that at the time, it was fucking terrifying.",
            "title_similarity": "0.395613",
            "sentiment_compound": -0.3597
        },
        {
            "id": "hpg3c3g",
            "score": 30,
            "text": "That dude truly freaked me out.",
            "title_similarity": "0.31827205",
            "sentiment_compound": 0.1779
        },
        {
            "id": "hpg3u8s",
            "score": 2,
            "text": "No wonder, he's very unsettling in the movie.",
            "title_similarity": "0.42190096",
            "sentiment_compound": -0.296
        },
        {
            "id": "hpg508i",
            "score": 2,
            "text": "That haircut tho",
            "title_similarity": "0.07645728",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpg56p0",
            "score": 1,
            "text": "I think someone should check on him.",
            "title_similarity": "0.19997717",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpg77zc",
            "score": 2,
            "text": "For me it was his delivery paired with that haircut. Something about his hair made his character much more intense.",
            "title_similarity": "0.29492944",
            "sentiment_compound": 0.1513
        },
        {
            "id": "hpg7n3z",
            "score": 1,
            "text": "Sugar?",
            "title_similarity": "0.09406831",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpg9rp1",
            "score": 1,
            "text": "The house that jack build was spot on too. With Dillon ..",
            "title_similarity": "0.31354225",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpga7vz",
            "score": 5,
            "text": "He did so well, whenever I see him in other roles, or in this post for instance, a part of me feels legit fear for a minute",
            "title_similarity": "0.41250372",
            "sentiment_compound": -0.1176
        },
        {
            "id": "hpgat0a",
            "score": 1,
            "text": "Heads…or tails",
            "title_similarity": "0.05570738",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpgaxqr",
            "score": 1,
            "text": "Maybe he wasn’t acting and was just himself.",
            "title_similarity": "0.25875437",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpgb235",
            "score": 2,
            "text": "I watched the movie one time and he gave me the chills, never watched it again.",
            "title_similarity": "0.49309734",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpgbajl",
            "score": 3,
            "text": "heads or tail, friendo?",
            "title_similarity": "0.18099876",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpgbasq",
            "score": 5,
            "text": "He Was upset that that garage/ store guy who was( unknowingly) nearly murdered by him,  thought that coin, that was flipped was just a regular coin.",
            "title_similarity": "0.5700867",
            "sentiment_compound": -0.7906
        },
        {
            "id": "hpgcl7j",
            "score": 2,
            "text": "The only time i've been actually scared by a character",
            "title_similarity": "0.5138557",
            "sentiment_compound": -0.4404
        },
        {
            "id": "hpgd7yk",
            "score": 1,
            "text": "Got a scroogie?",
            "title_similarity": "0.1980618",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpgdrwj",
            "score": 3,
            "text": "One of the greatest films of all time. Period",
            "title_similarity": "0.3863991",
            "sentiment_compound": 0.6369
        },
        {
            "id": "hpge2gj",
            "score": 34,
            "text": "\"\\*cough\\* You married into it?\"\n\nBloody hilarious.",
            "title_similarity": "0.36432207",
            "sentiment_compound": -0.0516
        },
        {
            "id": "hpge554",
            "score": 1,
            "text": "Gotta admit, his presence was not only intimidating but scary af. Ever felt that with a person, the one you know who will do scary unpredictable shit, that was him. Definitely the perfect person for the role.",
            "title_similarity": "0.5960791",
            "sentiment_compound": -0.5855
        },
        {
            "id": "hpgenyi",
            "score": 3,
            "text": "No Country is probably my favorite movie. It's captivating, authentic and actually pretty funny in a lot of ways.",
            "title_similarity": "0.48029208",
            "sentiment_compound": 0.7845
        },
        {
            "id": "hpgewyg",
            "score": 7,
            "text": "I found his performance bone-chilling. I hope I don't meet anyone like him. It is bad enough when you read about the percentage of people that have brain conditions/development walking around that are natural psychopaths or sociopaths.",
            "title_similarity": "0.6706022",
            "sentiment_compound": -0.0541
        },
        {
            "id": "hpgf3lp",
            "score": 2,
            "text": "https://www.youtube.com/watch?v=2LwhlesHNgM",
            "title_similarity": "0.2000927",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpgfdi6",
            "score": 12,
            "text": "This is the best Terminator movie ever made",
            "title_similarity": "0.47405553",
            "sentiment_compound": 0.6369
        },
        {
            "id": "hpgfmif",
            "score": 2,
            "text": "I’d like to nominate Vera (Elliot Villar) from Mr. Robot. Played a psychopath perfectly",
            "title_similarity": "0.69096005",
            "sentiment_compound": 0.8442
        },
        {
            "id": "hpgg5kd",
            "score": 1,
            "text": "One of my all time favorite films. Javier’s performance was amazing. Truly feared the character and his ferocity. Daniel Day Lewis in “There Will Be Blood” is another fantastic performance where I found myself quite intimidated by Daniel.",
            "title_similarity": "0.6743657",
            "sentiment_compound": 0.7357
        },
        {
            "id": "hpgg7fa",
            "score": 1,
            "text": "That guy was friggin terrifying",
            "title_similarity": "0.32468596",
            "sentiment_compound": -0.6115
        },
        {
            "id": "hpgg8lz",
            "score": 1,
            "text": "is that because he drank a glass of milk?",
            "title_similarity": "0.33082455",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpgg90h",
            "score": 1,
            "text": "It was the haircut",
            "title_similarity": "0.111647",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpggbc5",
            "score": 20,
            "text": "Another good, if obscure, depiction of a psychopathic character is in the 1950’s ‘Dragnet’ episode ‘The Big Cast.’  A young Lee Marvin plays >!a serial killer who calmly describes the murder he committed as he’s eating with the cops at a restaurant.!<",
            "title_similarity": "0.64348495",
            "sentiment_compound": -0.508
        },
        {
            "id": "hpggfej",
            "score": 12,
            "text": "Great, now I have to watch this for the 1,000th time again.",
            "title_similarity": "0.29011136",
            "sentiment_compound": 0.6249
        },
        {
            "id": "hpggfeq",
            "score": 1,
            "text": "The movie follows the book to an extraordinary degree.",
            "title_similarity": "0.32066482",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpggfy0",
            "score": 20,
            "text": "Dude was scary as hell. Every scene he was in was absolutely captivating. Felt like he was a guy that could not be reasoned with. He's easily the scariest villain I've seen in film.",
            "title_similarity": "0.6577062",
            "sentiment_compound": -0.804
        },
        {
            "id": "hpggheo",
            "score": 9,
            "text": "Maybe,  but i loved Buffalo Bill \"I'd fuck me\" insanity.  Ted Levine was great,  the character was creepy as hell.",
            "title_similarity": "0.5880879",
            "sentiment_compound": -0.7351
        },
        {
            "id": "hpgglgi",
            "score": 1,
            "text": "‘You’ve been putting it up your whole life’ and the fact that he still went to kill Llewelyns wife on principle",
            "title_similarity": "0.5190451",
            "sentiment_compound": -0.6908
        },
        {
            "id": "hpggmop",
            "score": 1,
            "text": "He play pretend good",
            "title_similarity": "0.2662531",
            "sentiment_compound": 0.5994
        },
        {
            "id": "hpggpag",
            "score": 1,
            "text": "Such a slow great film. Now I wanna watch it",
            "title_similarity": "0.41385025",
            "sentiment_compound": 0.6249
        },
        {
            "id": "hpggsky",
            "score": 1,
            "text": "Wow!",
            "title_similarity": "-0.06028815",
            "sentiment_compound": 0.6239
        },
        {
            "id": "hpggy3c",
            "score": 1,
            "text": "It was obvious he was a psychopath... Who willingly has their hair cut like that?",
            "title_similarity": "0.52195656",
            "sentiment_compound": 0.1027
        },
        {
            "id": "hpggzdw",
            "score": 1,
            "text": "Absolutely clinical performance\n\n\nSeparately, what was his weapon of choice again? Thing was grisly",
            "title_similarity": "0.53705835",
            "sentiment_compound": -0.296
        },
        {
            "id": "hpgh0pf",
            "score": 60,
            "text": "He was great.  That movie is such an excellent adaptation of Cormac McCarthy’s novel.  \n\nI wish the countless Stephen King adaptations were able to stay as faithful to the source material as this movie did. \n\nThe way he catches up to Llewelyn’s wife at the end because he promised him he would kill her is just plain psychopathic.",
            "title_similarity": "0.689578",
            "sentiment_compound": 0.91
        },
        {
            "id": "hpgh6kb",
            "score": 1,
            "text": "The way he ate the peanuts - one by one, was really frightening.",
            "title_similarity": "0.38425085",
            "sentiment_compound": -0.5413
        },
        {
            "id": "hpghfiu",
            "score": 1,
            "text": "One of my top 5 movies",
            "title_similarity": "0.37793976",
            "sentiment_compound": 0.2023
        },
        {
            "id": "hpghjlq",
            "score": 1,
            "text": "Sugar.",
            "title_similarity": "0.11438587",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpghvp6",
            "score": 2,
            "text": "One of my all-time favorite movies.  Bardem plays the most terrifying psychopath ever.  The whole goddamn thing is just so brilliant, so understated.",
            "title_similarity": "0.7064371",
            "sentiment_compound": 0.4163
        },
        {
            "id": "hpghyd6",
            "score": 2,
            "text": "I am Jack's complete lack of surprise",
            "title_similarity": "0.29085833",
            "sentiment_compound": -0.0516
        },
        {
            "id": "hpgi2ft",
            "score": 5,
            "text": "I had never seen a more psychologically terrifying villain than Hannibal Lector, until this performance",
            "title_similarity": "0.6664001",
            "sentiment_compound": -0.8335
        },
        {
            "id": "hpgi6f2",
            "score": 1,
            "text": "He was an amazing, menacing, unpredictable, fascinating villain in that movie. He's like darth Vader but in a non-scifi setting.",
            "title_similarity": "0.6581577",
            "sentiment_compound": 0.4767
        },
        {
            "id": "hpgi8m9",
            "score": 1,
            "text": "Always reminded me of Danny Torrence's haircut in the Shining.",
            "title_similarity": "0.34426516",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpgibvo",
            "score": 7,
            "text": "Aside from Daniel Day Lewis as Bill the Butcher in Gangs of New York, this is my second favorite performance by an actor. So freakin well done!!",
            "title_similarity": "0.6820003",
            "sentiment_compound": 0.7151
        },
        {
            "id": "hpgiekz",
            "score": 1,
            "text": "Still my favorite villain of all time. Pure distilled evil.",
            "title_similarity": "0.6405404",
            "sentiment_compound": -0.7184
        },
        {
            "id": "hpgif3f",
            "score": 1,
            "text": "I fucking *hated* him. Still do. \n\n\nThat means he did one hell of a job then, eh ?",
            "title_similarity": "0.51668906",
            "sentiment_compound": -0.8777
        },
        {
            "id": "hpgig4b",
            "score": 1,
            "text": "I love this movie . So many good characters . Luellans wife was hot … haha .",
            "title_similarity": "0.36696875",
            "sentiment_compound": 0.8854
        },
        {
            "id": "hpgijs7",
            "score": 2,
            "text": "That's interesting. I agree, but I watched a video once where this criminologist reviewed various killers from movies and he actually didn't agree that Chigurh was very realistic. Something about how a man as powerful and scary as him wouldn't need to get his kicks from killing.\n\nhttps://youtu.be/29n2bv7F6uc?t=1179",
            "title_similarity": "0.6945354",
            "sentiment_compound": -0.9405
        },
        {
            "id": "hpgimhx",
            "score": 2,
            "text": "As opposed to the hired psychologists by Big Hollywood?",
            "title_similarity": "0.5217611",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpgj1et",
            "score": 1,
            "text": "I believe there are \"functioning psychopaths\" among us.  I know for sure that I went to school and may have worked (or currently working) with some. \n\nThat's the scary part - people think a psychopath is a crazed killer just going around and murdering people.  Those are the ones that make the news anyway. There are others that sit in a classroom or work in a cubicle next to you.  They'll have unfeeling eyes.  If something tragic happens they feign sorrow but you can tell it's not genuine.  There is a person I work with who gives off this vibe.  They're like robots. Everything is very procedural.  This person was actually manager who has people working under them.  Whenever a person leaves our department we usually do a small ceremonial cake in a conference room.  When it was her turn to do this for someone, it seemed like the most disingenuous thing I've ever witnessed.  It was like she was reading a queue card.  It was like the Twilight Zone.",
            "title_similarity": "0.5825939",
            "sentiment_compound": 0.5859
        },
        {
            "id": "hpgjcbg",
            "score": 1,
            "text": "Loved it. One of my favorite movies. Even dressed up as him for Halloween that year.",
            "title_similarity": "0.50007814",
            "sentiment_compound": 0.7845
        },
        {
            "id": "hpgjdjt",
            "score": 7,
            "text": "I think this movie is probably the best adaptation of a book I’ve seen so far. I generally read the book before watching the movie, and I had read several of McCarthys other books, but for whatever reason I saw this movie first. When I read the book I was amazed at how well they did, it was pretty much word for word, scene for scene, faithfully adapted. Chigurh is a terrifying person, and the actor nailed the part perfectly. \n\nI’m still curious about a Blood Meridian movie, but I have little faith that it could be pulled off. It might just be too grim and too violent for a lot of people, but with the right set of people making it I think it could be amazing. I’ve spent entirely too much time imagining who would be the perfect casting for the Judge.",
            "title_similarity": "0.6381663",
            "sentiment_compound": 0.976
        },
        {
            "id": "hpgjlxs",
            "score": 1,
            "text": "The coin flip scene. Where the old timer flips for his life and doesn't even realize it. That was such a good fucking movie. I need to rewatch it.",
            "title_similarity": "0.5434681",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hpgjrz8",
            "score": 2,
            "text": "I agree. Dude scared the shit out of me.",
            "title_similarity": "0.43718892",
            "sentiment_compound": 0.5574
        },
        {
            "id": "hpgjxtb",
            "score": 2,
            "text": "The only movie I’ve watched as an adult that gave me nightmares",
            "title_similarity": "0.5964049",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpgk5hp",
            "score": 2,
            "text": "The scene where he pulls a guy over in the cop car is one of the most chilling film scenes I've ever seen. Just thinking about it upsets me.",
            "title_similarity": "0.65707016",
            "sentiment_compound": -0.4391
        },
        {
            "id": "hpgk5wh",
            "score": 1,
            "text": "Total lack of compassion - check\n\nPropensity to hurt others - check\n\nDead, soulless look - check",
            "title_similarity": "0.43601453",
            "sentiment_compound": -0.7923
        },
        {
            "id": "hpgk9yq",
            "score": 1,
            "text": "I love watching interviews with him. He's such a warm-hearted individual *who played Chigurh*. Such an incredible performance.",
            "title_similarity": "0.45263493",
            "sentiment_compound": 0.765
        },
        {
            "id": "hpgkauu",
            "score": 1,
            "text": "My fav movie and character. Can’t get enough of it. The movie never gets old how many times you watch.",
            "title_similarity": "0.4795643",
            "sentiment_compound": 0.4588
        },
        {
            "id": "hpgkd7z",
            "score": 1,
            "text": "A psychiatrist I know was very impressed with Michael Shannon's performance of acute psychosis in Take Shelter.",
            "title_similarity": "0.632279",
            "sentiment_compound": 0.5256
        },
        {
            "id": "hpgkfha",
            "score": 10,
            "text": "Don't forget the line \"I always thought that God would come into my life somehow....... but He didn't.\"\nAnd \"You gave your word? You've got to kill me because you gave word?\"",
            "title_similarity": "0.521713",
            "sentiment_compound": -0.7922
        },
        {
            "id": "hpgkkz1",
            "score": 1,
            "text": "He is just too good. Everything about the movie is perfect!",
            "title_similarity": "0.3932264",
            "sentiment_compound": 0.784
        },
        {
            "id": "hpgknp3",
            "score": 1,
            "text": "He also kills it in Skyfall, too. His character in that genuinely unnerved me.",
            "title_similarity": "0.53201824",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hpgkp9r",
            "score": 1,
            "text": "His role in Perdita Durango didn't do it for them?!",
            "title_similarity": "0.37790555",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpgktoq",
            "score": 1,
            "text": "This is one of the best acting of all time fucking great movie",
            "title_similarity": "0.45934618",
            "sentiment_compound": 0.8622
        },
        {
            "id": "hpgl108",
            "score": 1,
            "text": "This is also one of the main reasons why this is one if my favourite movies. The acting is top class",
            "title_similarity": "0.46262258",
            "sentiment_compound": 0.2023
        },
        {
            "id": "hpgl40s",
            "score": 1,
            "text": "I could only watch it once.",
            "title_similarity": "0.1727443",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpgl6w7",
            "score": 2,
            "text": "Chigurh was such a great character in that book. One of my favorites.",
            "title_similarity": "0.39240092",
            "sentiment_compound": 0.7845
        },
        {
            "id": "hpgl7ai",
            "score": 2,
            "text": "One of the best movies I've seen. Anton is a true talent.",
            "title_similarity": "0.48144123",
            "sentiment_compound": 0.8689
        },
        {
            "id": "hpglce7",
            "score": 1,
            "text": "I get to post this next week guys",
            "title_similarity": "0.12788531",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpglclz",
            "score": 1,
            "text": "One of the scariest villains of all time.",
            "title_similarity": "0.48862982",
            "sentiment_compound": -0.6597
        },
        {
            "id": "hpglfqk",
            "score": 1,
            "text": "Man had a silencer on a shot gun ffs amazing film",
            "title_similarity": "0.5244149",
            "sentiment_compound": -0.34
        },
        {
            "id": "hpgljan",
            "score": 1,
            "text": "Last night I watched him playing Desi Arnaz in [Being the Ricardos](https://www.imdb.com/title/tt4995540/?ref_=nm_flmg_act_5) and the contrast between Anton and Desi is almost mind-boggling.\n\nYou gotta see him playing the bongos and singing!",
            "title_similarity": "0.5402454",
            "sentiment_compound": 0.4389
        },
        {
            "id": "hpglqs0",
            "score": 1,
            "text": "Okay so I already found him like this in other movies. Not to the same level, but still. Something about the man puts my hackles up, even when he's playing the nice guy.",
            "title_similarity": "0.5281011",
            "sentiment_compound": 0.7964
        },
        {
            "id": "hpglrus",
            "score": 1,
            "text": "Great piece of acting is the scene with Carson when he says the line \"Let me ask you something. If the rule you followed...brought you to this, of what use was the rule?\" he says most of the line with a smile then drops to stone faced when he asks what use was the rule. Although every scene he is in is a masterclass in this movie.",
            "title_similarity": "0.61908984",
            "sentiment_compound": 0.765
        },
        {
            "id": "hpglt3u",
            "score": 1,
            "text": "Just cause he’s ugly?",
            "title_similarity": "0.31893182",
            "sentiment_compound": -0.5106
        },
        {
            "id": "hpglthk",
            "score": 1,
            "text": "Where does he work?",
            "title_similarity": "0.11474775",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpglx0j",
            "score": 1,
            "text": "The thing that really does it is the way he flips so effortlessly from politeness to intimidation as soon as he doesn’t get what he wants.\n\nThe trailer park scene and that infamous gas station scene really drive that home so well.\n\nOne of my favorite films (and novels) of all time, and one of my favorite actors as well. Bardem is so damn talented.",
            "title_similarity": "0.65414155",
            "sentiment_compound": 0.798
        },
        {
            "id": "hpglxps",
            "score": 5,
            "text": "[what’s the most you ever lost in a coin toss?](https://youtu.be/opbi7d42s8E)",
            "title_similarity": "0.5095628",
            "sentiment_compound": -0.3744
        },
        {
            "id": "hpgm2k2",
            "score": 1,
            "text": "Dangerous? As opposed to what? Bubonic Plague?",
            "title_similarity": "0.3569957",
            "sentiment_compound": -0.5632
        },
        {
            "id": "hpgm72d",
            "score": 9,
            "text": "I studied psychopathy for a while in grad school.   The condition has something of a sliding scale and there are far more psychopaths in the population than we imagine.  Some of them are very high functioning, in that they are largely prosocial, while others are sadistic criminals with absolutely no regard for their victims.  Physicians, religious leaders, and politicians seem to have a high proportion of psychopaths, though it is hard to know for sure because they are rarely tested.  \n\nThere is no treatment for psychopathy.",
            "title_similarity": "0.6360933",
            "sentiment_compound": -0.8313
        },
        {
            "id": "hpgm7vh",
            "score": 1,
            "text": "The quiet ones are the ones you need to be afraid of.",
            "title_similarity": "0.40761882",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpgm82s",
            "score": 1,
            "text": "It is one of my favorite performances of all time",
            "title_similarity": "0.31063014",
            "sentiment_compound": 0.4588
        },
        {
            "id": "hpgm85u",
            "score": 6,
            "text": "Very interesting! The full paper gives the entire list of fictional characters that Liestedt et al considered to fall into the psychopath diagnosis.\n\nI think I have my movie list for 2022.",
            "title_similarity": "0.6533253",
            "sentiment_compound": 0.5081
        },
        {
            "id": "hpgm8d1",
            "score": 2,
            "text": "Probably because the haircut.",
            "title_similarity": "0.16259736",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpgm8zf",
            "score": 1,
            "text": "Yeah. He was so bored with all this, the only thing he wanted was for these splashing people to stop bleeding so heavily on his clothes.",
            "title_similarity": "0.46002415",
            "sentiment_compound": -0.4101
        },
        {
            "id": "hpgm9hw",
            "score": 1,
            "text": "Americam psycho...",
            "title_similarity": "0.32305205",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpgmb0u",
            "score": 2,
            "text": "Accurate. It was chilling.",
            "title_similarity": "0.23289096",
            "sentiment_compound": -0.0258
        },
        {
            "id": "hpgmcda",
            "score": 1,
            "text": "This actor rocks every role he performs. One of the bests in the whole world",
            "title_similarity": "0.414762",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpgme7f",
            "score": 1,
            "text": "Reminds me of my buddy Eric",
            "title_similarity": "0.2860253",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpgmg4o",
            "score": 2,
            "text": "He was so disturbing in that role",
            "title_similarity": "0.2905876",
            "sentiment_compound": -0.6418
        },
        {
            "id": "hpgmhg4",
            "score": 6,
            "text": "The scene when he rigs the car to blow so he can rob the pharmacy and patch himself up is so dope",
            "title_similarity": "0.47194764",
            "sentiment_compound": -0.5945
        },
        {
            "id": "hpgmin8",
            "score": 1,
            "text": "I wonder how much time it took to get into being Anto Chigurh and how much time it took to go back to being Javier Bardem?",
            "title_similarity": "0.30444703",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpgmo97",
            "score": 1,
            "text": "Call it.",
            "title_similarity": "-0.029920045",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpgmqx5",
            "score": 1,
            "text": "Every day I hate the fucking jokes that are forensic psychologist just a bit more.",
            "title_similarity": "0.5375916",
            "sentiment_compound": -0.3415
        },
        {
            "id": "hpgmxtn",
            "score": 1,
            "text": "I guess these people didn’t watch MIND HUNTER.",
            "title_similarity": "0.2883068",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpgn00q",
            "score": 1,
            "text": "Can we have Javier and Joaquin Phoenix in a movie together playing psychos? I do not know what the plot would be, or what their character's backstories would be but I would love to see how they would play off eachother.",
            "title_similarity": "0.56457895",
            "sentiment_compound": 0.8834
        },
        {
            "id": "hpgn0d0",
            "score": 1,
            "text": "All three of the main characters (besides the sheriff) were that way to some degree. They're all Vietnam vets.",
            "title_similarity": "0.45656973",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpgn0j1",
            "score": 1,
            "text": "Great movie, great performance",
            "title_similarity": "0.25896317",
            "sentiment_compound": 0.8481
        },
        {
            "id": "hpgn1wz",
            "score": 1,
            "text": "Such a good movie, I find him a lot scarier than the likes of most horror characters in modern movies",
            "title_similarity": "0.6399305",
            "sentiment_compound": 0.1796
        },
        {
            "id": "hpgn6ri",
            "score": 2,
            "text": "That depends...... Can you see me ?!",
            "title_similarity": "0.025568709",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpgn9jr",
            "score": 1,
            "text": "Literally watched this movie for the first time last night",
            "title_similarity": "0.37942746",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpgna1l",
            "score": 1,
            "text": "Remember though, this movie was set in 1980. It was a different world then and people were more trusting. Today, most people would be highly suspicious of somebody who acts like Anton.",
            "title_similarity": "0.47906137",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hpgnc5l",
            "score": 1,
            "text": "I also liked him as the villain in Skyfall",
            "title_similarity": "0.54445314",
            "sentiment_compound": -0.2023
        },
        {
            "id": "hpgncad",
            "score": 1,
            "text": "That’s a dead dog\n\n…yes it is",
            "title_similarity": "0.3374073",
            "sentiment_compound": -0.6486
        },
        {
            "id": "hpgnim7",
            "score": 1,
            "text": "Great… now I must watch this again asap.",
            "title_similarity": "0.14082056",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpgnpar",
            "score": 1,
            "text": "Great villain.",
            "title_similarity": "0.33540216",
            "sentiment_compound": 0.128
        },
        {
            "id": "hpgnqbv",
            "score": 1,
            "text": "that dude is realistic? maybe like the ice man kuklinski, i guess?",
            "title_similarity": "0.481019",
            "sentiment_compound": 0.4329
        },
        {
            "id": "hpgnqsm",
            "score": 1,
            "text": "Takes one  to know one?",
            "title_similarity": "0.07165739",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpgnsik",
            "score": 1,
            "text": "Dont Bro me Br....THWACK",
            "title_similarity": "0.20200095",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpgnsx7",
            "score": 2,
            "text": "Bardem is who I wanted for Negan in TWD, based solely on this role.",
            "title_similarity": "0.418038",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpgnugc",
            "score": 1,
            "text": "Javier’s performance is so intense. Glad to hear his work is still being recognized years later. NCFOM was great until it’s mediocre, and rushed ending… Just my opinion.",
            "title_similarity": "0.5052504",
            "sentiment_compound": 0.845
        },
        {
            "id": "hpgnuze",
            "score": 2,
            "text": "The real star of that movie was the gas station attendant. I saw confusion and fear at the same time.",
            "title_similarity": "0.59754634",
            "sentiment_compound": -0.6597
        },
        {
            "id": "hpgo0hc",
            "score": 1,
            "text": "“Do you have any idea how crazy you are?”\n“You mean the nature of this conversation?”",
            "title_similarity": "0.28318352",
            "sentiment_compound": -0.4137
        },
        {
            "id": "hpgo4hk",
            "score": 2,
            "text": "Most accurate depiction of death incarnate*",
            "title_similarity": "0.5133344",
            "sentiment_compound": -0.5994
        },
        {
            "id": "hpgoaet",
            "score": 1,
            "text": "Daniel Plainview and Gordon Gekko are probably the most realistic depictions of high functioning sociopaths (as opposed to psychopaths). Pure ego and drive to power with little to no empathy. Willing to hurt anyone to anyone to achieve success. Highly charismatic when it serves their own ends.",
            "title_similarity": "0.6769023",
            "sentiment_compound": -0.1585
        },
        {
            "id": "hpgoawu",
            "score": 3,
            "text": "He had me so freaked/uncomfortable in Skyfall I haven't watched No Country for Old Men...",
            "title_similarity": "0.46321267",
            "sentiment_compound": 0.2235
        },
        {
            "id": "hpgoc9s",
            "score": 1,
            "text": "Another really good one are Mariko and Lucy from Elfen Lied. You wanna see some really twisted characters, Elfen Lied has a handful of them that are just as fucked up as Anton.",
            "title_similarity": "0.5266905",
            "sentiment_compound": -0.7512
        },
        {
            "id": "hpgoce0",
            "score": 1,
            "text": "I can't count the number of times I watched this film, but it is definitely Javier's tension-filled performance that stands out. After the first watch, Anton Chigurh's name was stuck in your brain.",
            "title_similarity": "0.59429646",
            "sentiment_compound": 0.2356
        },
        {
            "id": "hpgol55",
            "score": 1,
            "text": "One of my favorite performances ever.",
            "title_similarity": "0.2962149",
            "sentiment_compound": 0.4588
        },
        {
            "id": "hpgon1p",
            "score": 6,
            "text": "Javier Bardem is super talented, but don’t forget all the writers (and everyone else involved in the movie) who helped make the character realistic.",
            "title_similarity": "0.53324664",
            "sentiment_compound": 0.3071
        },
        {
            "id": "hpgor7f",
            "score": 1,
            "text": "Totally agree with there choice, I just like to say the one scary actor that terrified me was Stephen Graham playing Combo in ‘This is England’",
            "title_similarity": "0.6898417",
            "sentiment_compound": -0.2748
        },
        {
            "id": "hpgou0s",
            "score": 4,
            "text": "Anyone with that haircut is a clear cut psychopath",
            "title_similarity": "0.50530064",
            "sentiment_compound": 0.128
        },
        {
            "id": "hpgowwn",
            "score": 1,
            "text": "It was an incredible performance",
            "title_similarity": "0.10097949",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpgoxof",
            "score": 1,
            "text": "*I need you to step outta the car, Sir.*",
            "title_similarity": "0.23502925",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpgp34z",
            "score": 1,
            "text": "Hands down one of the best movies I’ve ever seen. Bardem’s depiction of Chigurh was amazing. I highly recommend the book. Texas Gothic needs to have more literature added to its canon.",
            "title_similarity": "0.61891705",
            "sentiment_compound": 0.8955
        },
        {
            "id": "hpgp5d8",
            "score": 2,
            "text": "He’s an amazing actor, I haven’t watched that movie again just because his role really scared the crap out of me.",
            "title_similarity": "0.61962664",
            "sentiment_compound": -0.3086
        },
        {
            "id": "hpgp8mv",
            "score": 1,
            "text": "Call it.",
            "title_similarity": "-0.029920045",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpgpa1x",
            "score": 2,
            "text": "I’m not surprised. He gave a phenomenal performance and scared the shit out of me.",
            "title_similarity": "0.46713188",
            "sentiment_compound": 0.1114
        },
        {
            "id": "hpgpe6p",
            "score": 7,
            "text": "I watched that movie once and it was fucking amazing but the stress of that movie was more than I could stand...however I should definitely show my nephew.",
            "title_similarity": "0.55596954",
            "sentiment_compound": 0.3392
        },
        {
            "id": "hpgphnc",
            "score": 1,
            "text": "I just watched this for the first time. 1 huge plot hole. If I found a suitcase of money and was alone in a hotel room, I would dump it and count it and see exactly what was in it. Then I would have found the transponder.",
            "title_similarity": "0.54138076",
            "sentiment_compound": -0.3182
        },
        {
            "id": "hpgpozd",
            "score": 1,
            "text": "\\*\\*Chigurh Warning\\*\\*",
            "title_similarity": "0.22854742",
            "sentiment_compound": -0.34
        },
        {
            "id": "hpgpp2i",
            "score": 1,
            "text": "I honestly believe playing a role like that takes something out of you, and could make some sort of permanent mark on the psyche.",
            "title_similarity": "0.40246218",
            "sentiment_compound": 0.743
        },
        {
            "id": "hpgpvz2",
            "score": 1,
            "text": "1958. It's been traveling twenty-two years to get here. And now it's here. And it's either heads or tails. And you have to say. Call it.",
            "title_similarity": "0.33611432",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpgpzrz",
            "score": 1,
            "text": "Isnt psychopathy not a real diagnosis",
            "title_similarity": "0.3344909",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpgq27x",
            "score": 1,
            "text": "It’s absolutely chilling",
            "title_similarity": "0.28116846",
            "sentiment_compound": -0.101
        },
        {
            "id": "hpgq2f0",
            "score": 8,
            "text": "*don't put it in your pocket or it will become just a coin...*\n\n*...which it is.*\n\nCan somebody smarter than me explain why I find this so powerful?",
            "title_similarity": "0.41349667",
            "sentiment_compound": 0.7661
        },
        {
            "id": "hpgq44w",
            "score": 9,
            "text": "I kept my eyes on him while I was watching the movie, the same way I would keep my eyes on a shark if I was in the water.  There are some actors who can act well enough to trigger this wary instinctive protection response to a predator, and he's definitely believable in the role.",
            "title_similarity": "0.50533265",
            "sentiment_compound": 0.5859
        },
        {
            "id": "hpgq6uj",
            "score": 1,
            "text": "David Wilson said Anton had a bit of a Hollywood characterization of a serial killer as the super predator which is not realistic. This is the sad part, Wilson who is a criminologist who interviews serial killers, said Anton's character wouldn't need to kill because he is so in control he would more likely be a CEO of a multinational corporation instead of a murderer, or a leader of a country. This says a lot about how David Wilson views these types of people.\n\nYou can find the full interview on YouTube. Criminologist reviews serial killers from movies and TV.",
            "title_similarity": "0.7677233",
            "sentiment_compound": -0.932
        },
        {
            "id": "hpgq7m1",
            "score": 1,
            "text": "It was terrifying.",
            "title_similarity": "0.18606037",
            "sentiment_compound": -0.5719
        },
        {
            "id": "hpgqefm",
            "score": 2,
            "text": "It was 20% acting, 80% the haircut.",
            "title_similarity": "0.34191585",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpgqfqj",
            "score": 1,
            "text": "The list mentions Hannibal Lecter as an 'unrealistic' psychopath, but honestly that character always struck me as closer to the vampire archetype veiled through an esthetic of psychiatry.\n\n(Eastern European, aristocratic, intellectual, unexpectedly strong, charming, consumes others, etc.)",
            "title_similarity": "0.6887851",
            "sentiment_compound": 0.9559
        },
        {
            "id": "hpgqfzf",
            "score": 1,
            "text": "Sick of this pop-psychology pseudoscience. Stop it.",
            "title_similarity": "0.36637318",
            "sentiment_compound": -0.7717
        },
        {
            "id": "hpgqkow",
            "score": 1,
            "text": "That's amazing. \nLeistedt and Linkowski, the two Belgian psychiatrists who worked on the list of realistic movie psychopaths, are two professors at my university.\nSamuel Leistedt was my psychiatry prof during my last year of Bachelor in Medicine. Super interesting guy with fascinating anecdotes. He actually watched a whole lot of movies to sort out depictions of psychopathy in the media, and made a list with rankings and all.",
            "title_similarity": "0.6967175",
            "sentiment_compound": 0.9313
        },
        {
            "id": "hpgqn6j",
            "score": 1,
            "text": "Bardem is a national treasure.",
            "title_similarity": "0.26054433",
            "sentiment_compound": 0.296
        },
        {
            "id": "hpgqosu",
            "score": 1,
            "text": "They never met my ex-mother in law.",
            "title_similarity": "0.31988552",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpgqq7p",
            "score": 1,
            "text": "I love this movie. One of my favorites. The best part - it's slow, it's simple and has no music.",
            "title_similarity": "0.51303256",
            "sentiment_compound": 0.875
        },
        {
            "id": "hpgqsqm",
            "score": 1,
            "text": "Zuckerberg is about 15x above Anton.",
            "title_similarity": "0.18901189",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpgqwns",
            "score": 1,
            "text": "[deleted]",
            "title_similarity": "0.10133153"
        },
        {
            "id": "hpgr1jd",
            "score": 1,
            "text": "I wonder where Poindexter from Daredevil Season 3 would rank if they did this now. >!his depiction of ASPD as a painful, confusing illness and not just something that makes you not care about anything really affected me. I’m on my first rewatch and the scene where he watches Julie and eats his Broccoli sausage pizza just like she eats hers…at first watch you’re supposed to find it creepy and evil like “we this guy is a stalker” but on second watch it’s so clear what he’s doing. He’s eating sausage broccoli pizza because “the good person I am modeling my life after eats sausage broccoli pizza so if I eat it I’m doing things like a good person would”. It’s just such a sincere, childlike misunderstanding of causality that it broke my heart on the second watch. He is just trying to do better and he keeps getting taken advantage of his whole life.!<",
            "title_similarity": "0.56989145",
            "sentiment_compound": 0.9679
        },
        {
            "id": "hpgr3mi",
            "score": 1,
            "text": "Hats off to Javier…but Dan Povenmire’s performance as Dr. Heinz Doofenshmirtz was absolutely riveting.",
            "title_similarity": "0.6434113",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpgr433",
            "score": 5,
            "text": "He looked like no people. You didn’t know where he came from. He was so ambiguous that it was terrifying   Incredible casting, costume design, accent, his performance was perfect",
            "title_similarity": "0.5430962",
            "sentiment_compound": 0.0772
        },
        {
            "id": "hpgr4co",
            "score": 1,
            "text": "That movie has one of the best soundtracks of all time.",
            "title_similarity": "0.43910325",
            "sentiment_compound": 0.6369
        },
        {
            "id": "hpgr6mv",
            "score": 2,
            "text": "This tension in this movie is so good. I like how he never explains his motive - you just have listen to other character’s descriptions of him.",
            "title_similarity": "0.58367544",
            "sentiment_compound": 0.6375
        },
        {
            "id": "hpgrbsx",
            "score": 1,
            "text": "One of the best films ever imo",
            "title_similarity": "0.40426123",
            "sentiment_compound": 0.6369
        },
        {
            "id": "hpgrcgr",
            "score": 1,
            "text": "I guess they haven't met my best friend in the whole world, Amos Burton,",
            "title_similarity": "0.48546696",
            "sentiment_compound": -0.0433
        },
        {
            "id": "hpgre97",
            "score": 2,
            "text": "If Peppermint Patty from the Peanuts Gang was a serial killer. That's what popped into my head when I saw his character",
            "title_similarity": "0.5806366",
            "sentiment_compound": -0.6486
        },
        {
            "id": "hpgrfhz",
            "score": 1,
            "text": "Interesting. I wonder where Heath Ledger’s Joker falls on the list. Because I didn’t find that character credible at all. Thought Robert Downey Jr. was much more deserving of the Oscar (for Tropic Thunder).",
            "title_similarity": "0.64593375",
            "sentiment_compound": 0.4939
        },
        {
            "id": "hpgrneg",
            "score": 1,
            "text": "What time do you close",
            "title_similarity": "-0.017556308",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpgrq3g",
            "score": 1,
            "text": "He's a very bad depiction of a serial killer though.",
            "title_similarity": "0.5764854",
            "sentiment_compound": -0.8439
        },
        {
            "id": "hpgrwhz",
            "score": 1,
            "text": "If you want to see how a real psychopath behaves, just to mention one, look at better.com CEO firing 900 employees over a Zoom call.",
            "title_similarity": "0.5811595",
            "sentiment_compound": -0.2732
        },
        {
            "id": "hpgrx4k",
            "score": 1,
            "text": "Hello friendo…",
            "title_similarity": "0.13113743",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpgrz71",
            "score": 1,
            "text": "Sugar!?!",
            "title_similarity": "0.11689938",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpgs4we",
            "score": 1,
            "text": "I remember watching this movie in the cinema and being sat next to an old lady and her husband.\n\nEvery time he came on the screen the old lady would start humming to herself and very slightly rocking back and forth to soothe herself as he made her feel so uncomfortable.\n\nThat performance always sticks out to me because of that. I've never seen an adult react to a movie character like that, before or since.",
            "title_similarity": "0.51012045",
            "sentiment_compound": 0.1615
        },
        {
            "id": "hpgsari",
            "score": 2,
            "text": "I haven't seen that movie, but loved him as the main villain in the James Bond movie Skyfall. That's a great movie.",
            "title_similarity": "0.689546",
            "sentiment_compound": 0.7964
        },
        {
            "id": "hpgsc7x",
            "score": 1,
            "text": "Such good acting, he would have made.a great Joker",
            "title_similarity": "0.46331474",
            "sentiment_compound": 0.8176
        },
        {
            "id": "hpgsm4x",
            "score": 2,
            "text": "Give me that dummy cut",
            "title_similarity": "0.2242926",
            "sentiment_compound": -0.2732
        },
        {
            "id": "hpgsmup",
            "score": 2,
            "text": "This was the first villain in cinema that was actually unsettling to me.",
            "title_similarity": "0.6107663",
            "sentiment_compound": -0.5574
        },
        {
            "id": "hpgsr3x",
            "score": 1,
            "text": "I wonder what they'd say about Eric Cartman. Some of the things he does in the show might be unrealistic, but his behavior is pretty spot-on psychopathic.",
            "title_similarity": "0.52812785",
            "sentiment_compound": 0.6486
        },
        {
            "id": "hpgstkn",
            "score": 1,
            "text": "That's funny but didn't medical science stop using or never use the word psychopath.",
            "title_similarity": "0.57547665",
            "sentiment_compound": 0.5076
        },
        {
            "id": "hpgsvju",
            "score": 1,
            "text": "I love this movie. Has anyone read the book? Is it better than the movie?",
            "title_similarity": "0.4869611",
            "sentiment_compound": 0.8156
        },
        {
            "id": "hpgsxum",
            "score": 1,
            "text": "I am a bit ashamed to say I have never seen this movie!",
            "title_similarity": "0.35257706",
            "sentiment_compound": -0.5255
        },
        {
            "id": "hpgt32z",
            "score": 2,
            "text": "makes sense. I always come back to this film and the draw is always his character.",
            "title_similarity": "0.39228883",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpgt4o6",
            "score": 2,
            "text": "Plot twist. He actually is a serial killer",
            "title_similarity": "0.52153933",
            "sentiment_compound": -0.6486
        },
        {
            "id": "hpgt5tz",
            "score": 1,
            "text": "I’ve always said this. Kudos",
            "title_similarity": "0.16794094",
            "sentiment_compound": 0.596
        },
        {
            "id": "hpgt8no",
            "score": 2,
            "text": "Is this worth a watch?",
            "title_similarity": "0.16369708",
            "sentiment_compound": 0.2263
        },
        {
            "id": "hpgt9h0",
            "score": 5,
            "text": "I can agree with that. That character was absolutely fucking terrifying. The nonchalant way he violently murdered people and continued about his business was fucking horrifying.",
            "title_similarity": "0.58828133",
            "sentiment_compound": -0.9429
        },
        {
            "id": "hpgtc9w",
            "score": 1,
            "text": "Jake Gyllenhaal in Nightcrawler is a pretty good one too.",
            "title_similarity": "0.47957385",
            "sentiment_compound": 0.7269
        },
        {
            "id": "hpgthr6",
            "score": 1,
            "text": "Call it",
            "title_similarity": "-0.025938546",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpgtjc7",
            "score": 1,
            "text": "I misread this title as, \"Most Realistic Depiction of a Psychopath by an independent group of psychopaths.\"\n\n&#x200B;\n\nThat would have so much cooler.",
            "title_similarity": "0.7166973",
            "sentiment_compound": -0.2732
        },
        {
            "id": "hpgtjca",
            "score": 1,
            "text": "What were the other movies I wonder",
            "title_similarity": "0.19807997",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpgtkqh",
            "score": 4,
            "text": "Im convinced that his behavior in the gas station scene was based purely because he had no money to pay for the gas.",
            "title_similarity": "0.49593708",
            "sentiment_compound": 0.0258
        },
        {
            "id": "hpgtn5e",
            "score": 1,
            "text": "I gotta be honest: if he didn't have\nThat yee yee ass haircut I would've find his character more threatening and overall like him better",
            "title_similarity": "0.5034581",
            "sentiment_compound": 0.1298
        },
        {
            "id": "hpgtuy3",
            "score": 1,
            "text": "I thought the title said ...by a group of psychopaths... And thought it was hilarious imagining a group of psychopaths gathering showing psychopathic IDs and discussing and voting on the subject",
            "title_similarity": "0.62386596",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hpgtuzh",
            "score": 4,
            "text": "The scene with the old dude at the gas station was what really sold me on how much of a psycho Chigurh was. I mean he's a mercenary/hit man and him killing to achieve that goal makes sense. Even the first few scenes of the movie where he kills innocent people to obtain a vehicle furthers his goal. \n\nBut not the gas station worker. He was just an old man and was scared shitless of Chigurh and did nothing to help aid his goal. He almost killed him, and was fully ready to but the coin flip was in his favor. Chigurh got excited that he won and that was the creepiest part. Like he truly believed the coin actual determined if someone should live or die by his hands. \n\nGreat fucking movie.",
            "title_similarity": "0.6556993",
            "sentiment_compound": 0.8777
        },
        {
            "id": "hpgtvnr",
            "score": 2,
            "text": "One of the greatest villains.",
            "title_similarity": "0.43415585",
            "sentiment_compound": -0.0516
        },
        {
            "id": "hpgty48",
            "score": 1,
            "text": "what’s the most you’ve ever lost on a coin toss",
            "title_similarity": "0.42781734",
            "sentiment_compound": -0.3744
        },
        {
            "id": "hpgtzdn",
            "score": 1,
            "text": "No don’t put it in your pocket, then it just becomes another coin, which it is",
            "title_similarity": "0.2640472",
            "sentiment_compound": -0.296
        },
        {
            "id": "hpgu2bw",
            "score": 1,
            "text": "That movies scared the crap out of me.  I was suspicious of strangers for at least a month.   The strangulation scene still ranks in the top 5 most traumatizing things I’ve witnessed on the screen.",
            "title_similarity": "0.5987245",
            "sentiment_compound": -0.8687
        },
        {
            "id": "hpgu43v",
            "score": 4,
            "text": "Brilliant book. Brilliant movie. Excellent acting.",
            "title_similarity": "0.346964",
            "sentiment_compound": 0.9062
        },
        {
            "id": "hpgu5d0",
            "score": 3,
            "text": "The clip in question: https://www.youtube.com/watch?v=OLCL6OYbSTw",
            "title_similarity": "0.22958392",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpguft5",
            "score": 1,
            "text": "\\[Ben Kingsly in Sexy Beast\\](https://www.youtube.com/watch?v=k\\_e2zQY\\_HuM) is right up there as well, but that film flew under the radar.",
            "title_similarity": "0.59312606",
            "sentiment_compound": 0.4118
        },
        {
            "id": "hpgufvu",
            "score": 2,
            "text": "That whole movie is a trip. Just quietly unsettling the entire way through. But anytime Bardem pops up, it goes from quietly unsettling, to loudly unsettling. \n\nWhat a great damn movie.",
            "title_similarity": "0.54925776",
            "sentiment_compound": 0.4767
        },
        {
            "id": "hpgug0t",
            "score": 4,
            "text": "God, I hope he was acting...",
            "title_similarity": "0.27355194",
            "sentiment_compound": 0.6124
        },
        {
            "id": "hpguj8h",
            "score": 1,
            "text": "Could you just...stand...right there.  Perfect.",
            "title_similarity": "0.046303205",
            "sentiment_compound": 0.5719
        },
        {
            "id": "hpgujqt",
            "score": 1,
            "text": "I saw this article a few years ago and decided to watch the movie. Next to The Dark Knight it's my favorite movie of all time",
            "title_similarity": "0.58457506",
            "sentiment_compound": 0.4588
        },
        {
            "id": "hpgumtf",
            "score": 1,
            "text": "I just... Cannot like him. Not in anything I've seen. Like Juaquin Phoenix, poor shadow of his dead brother.",
            "title_similarity": "0.49799663",
            "sentiment_compound": -0.7912
        },
        {
            "id": "hpgune1",
            "score": 6,
            "text": "He was the only reason that movie was decent",
            "title_similarity": "0.47425097",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpguoms",
            "score": 1,
            "text": "They do their homework the Cohen bros.",
            "title_similarity": "0.32700622",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpguovs",
            "score": 6,
            "text": "That air gun gave me nightmares for years",
            "title_similarity": "0.45472702",
            "sentiment_compound": -0.34
        },
        {
            "id": "hpgus3b",
            "score": 1,
            "text": "I liked him the movie so much, but I couldn't stand him initially. It took me literally a year in multiple viewings to get the whole movie through.",
            "title_similarity": "0.47705406",
            "sentiment_compound": 0.2263
        },
        {
            "id": "hpgus9q",
            "score": 1,
            "text": "Oh boy that’s aggravating, milks still sweating.",
            "title_similarity": "0.35697883",
            "sentiment_compound": -0.296
        },
        {
            "id": "hpgutyr",
            "score": 2,
            "text": "What’s interesting is that I’d say Jake Gyllenhaals character in Nightcrawler would give him a good run for his money. The article where they ranked Anton #1 came out in January 2014 while Nightcrawler came out in October 2014. \n\nNeed a rematch!",
            "title_similarity": "0.6569425",
            "sentiment_compound": 0.7088
        },
        {
            "id": "hpguvxn",
            "score": 1,
            "text": "Anyone who has a silencer on a shotgun is not to be fucked with.",
            "title_similarity": "0.37822497",
            "sentiment_compound": 0.5448
        },
        {
            "id": "hpguwcx",
            "score": 4,
            "text": "The haircut that says “I care about my looks insofar as they scare you”",
            "title_similarity": "0.4891798",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpguws9",
            "score": 4,
            "text": "I've been saying it for years, he should play the next Joker.",
            "title_similarity": "0.4090708",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hpguxwt",
            "score": 1,
            "text": "[best scene.](https://youtu.be/nh1FjMDKMNw)",
            "title_similarity": "0.3426786",
            "sentiment_compound": 0.6369
        },
        {
            "id": "hpguy1d",
            "score": 1,
            "text": "Wow now that was a hellva movie. Left everyone hanging at the end",
            "title_similarity": "0.4011424",
            "sentiment_compound": 0.5859
        },
        {
            "id": "hpgv079",
            "score": 4,
            "text": "Hi I’m not sure if anyone sees comments like these, but if you are interested in brief psycho analyses of villains in cinema I would strongly recommend TheVileEye on YouTube, it’s very interesting to see villains deconstructed in pop culture and it can make you appreciate different depictions of evil a lot more.",
            "title_similarity": "0.6060812",
            "sentiment_compound": -0.6176
        },
        {
            "id": "hpgv10v",
            "score": 1,
            "text": "An amazing performance",
            "title_similarity": "0.103038624",
            "sentiment_compound": 0.5859
        },
        {
            "id": "hpgv2aj",
            "score": 1,
            "text": "Plot twist - And he said “the role was easy because I just had to be myself” - fiction, just made it up so don’t ask for references",
            "title_similarity": "0.5273116",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hpgv3es",
            "score": 1,
            "text": "Wow",
            "title_similarity": "-0.07987491",
            "sentiment_compound": 0.5859
        },
        {
            "id": "hpgv3gs",
            "score": 2,
            "text": "Call it.",
            "title_similarity": "-0.029920045",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpgv3hr",
            "score": 4,
            "text": "The book is written so well too. I don’t think the movie could’ve portrayed it any better.",
            "title_similarity": "0.47742897",
            "sentiment_compound": 0.685
        },
        {
            "id": "hpgv4ko",
            "score": 1,
            "text": "Dang. Gotta watch this movie now. I wanna know why people are raving about it so much",
            "title_similarity": "0.36607063",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpgv9hb",
            "score": 1,
            "text": "This gets posted to Reddit at least once a week....",
            "title_similarity": "0.1610237",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpgv9pf",
            "score": 1,
            "text": "Kirsten Dunst in Fargo has to be up there. Terrifying.",
            "title_similarity": "0.31262597",
            "sentiment_compound": -0.5719
        },
        {
            "id": "hpgvbr9",
            "score": 16,
            "text": "[deleted]",
            "title_similarity": "0.10133153"
        },
        {
            "id": "hpgve1d",
            "score": 2,
            "text": "javier bardem is also the best villain of james bond ever",
            "title_similarity": "0.68092215",
            "sentiment_compound": 0.1531
        },
        {
            "id": "hpgvegk",
            "score": 1,
            "text": "really good movie\nexcellent acting",
            "title_similarity": "0.33945262",
            "sentiment_compound": 0.7996
        },
        {
            "id": "hpgvlq5",
            "score": 1,
            "text": "What, you mean Villanelle didn't make the cut?",
            "title_similarity": "0.2503286",
            "sentiment_compound": 0.2057
        },
        {
            "id": "hpgvlvy",
            "score": 9,
            "text": "I personally think what amped it up in addition to Bardem's brilliance is the lack of a score. The fact that there's no *get ready for some tension!* music is what gives it even more tension. It's awkward, you hear your own breathing, and feel as though you're in the room too.  By far my favorite Coen Brothers movie and that's saying a lot because they're almost all amazing.",
            "title_similarity": "0.64942944",
            "sentiment_compound": 0.0892
        },
        {
            "id": "hpgvrcn",
            "score": 1,
            "text": "\"Call it.\"",
            "title_similarity": "-0.009131653",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpgvskp",
            "score": 1,
            "text": "\"Are you going to kill me?\"\n\nAC: \"That depends. Do you see me?\"",
            "title_similarity": "0.40020162",
            "sentiment_compound": -0.7236
        },
        {
            "id": "hpgvtzu",
            "score": 1,
            "text": "The average psychopath probably isn't a serial killer, but okay, I get what they're saying",
            "title_similarity": "0.59513587",
            "sentiment_compound": 0.5531
        },
        {
            "id": "hpgw2v7",
            "score": 1,
            "text": "Funfact: Daniel Brühl's performance in The White Sound is used today in schools and universities to describe and show schizophrenia.",
            "title_similarity": "0.5669675",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpgw31o",
            "score": 1,
            "text": "Except \"psychopathy\" isn't a diagnosis and hasn't been for quite some time.",
            "title_similarity": "0.31936705",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpgw3j6",
            "score": 1,
            "text": "He looks shockingly like the depiction of Aragorn in Ralph Bakshis animated Lord of the Rings film",
            "title_similarity": "0.4457355",
            "sentiment_compound": 0.2023
        },
        {
            "id": "hpgw807",
            "score": 1,
            "text": "Dude I saw this with my friend in a small theater when it came out. We were looking through our fingers like little kids, it's the most scared I've been in a theater experience.",
            "title_similarity": "0.49646938",
            "sentiment_compound": 0.3626
        },
        {
            "id": "hpgw8ov",
            "score": 2,
            "text": "took me a few watches to notice the almost complete lack of soundtrack/score to this movie. which makes sense, because the sound in the film is top-shelf. borderline ASMR experience in some parts.",
            "title_similarity": "0.6106925",
            "sentiment_compound": -0.2551
        },
        {
            "id": "hpgw8r3",
            "score": 1,
            "text": "Because all those independent psychologists have actually met a realistic psychopath.",
            "title_similarity": "0.73040974",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpgwacw",
            "score": 1,
            "text": "Every (people I perceive to be) psychopath I have ever met is super super friendly and then I find out they drugged my friend and raped her or his son that died *never fucking existed.*\n\nBoth of those stories are true, and they are 2 different people.",
            "title_similarity": "0.7007891",
            "sentiment_compound": 0.8316
        },
        {
            "id": "hpgwed3",
            "score": 1,
            "text": "Psychologists be straight up snubbing Brad Dourif.",
            "title_similarity": "0.6721249",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpgwetv",
            "score": 1,
            "text": "Idk, he seemed pretty unrelatable to me",
            "title_similarity": "0.26115277",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hpgwid1",
            "score": 1,
            "text": "Either his acting was that good or he himself is little off.",
            "title_similarity": "0.34435922",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hpgwptr",
            "score": 1,
            "text": "The acting of the wrapper was chilling",
            "title_similarity": "0.34477535",
            "sentiment_compound": -0.0258
        },
        {
            "id": "hpgwuck",
            "score": 1,
            "text": "“I like ya cut G.” \n\nChigurh: *pick heads or tails.*",
            "title_similarity": "0.36496493",
            "sentiment_compound": 0.1027
        },
        {
            "id": "hpgwv2x",
            "score": 1,
            "text": "Definitely In the conversation for the greatest piece of acting in the modern era.",
            "title_similarity": "0.46532893",
            "sentiment_compound": 0.7845
        },
        {
            "id": "hpgwx49",
            "score": 1,
            "text": "Fuck yeah, that movie is incredible",
            "title_similarity": "0.25659546",
            "sentiment_compound": -0.3182
        },
        {
            "id": "hpgx6b3",
            "score": 4,
            "text": "When I first saw this movie i thought he was Robert Downey JR and that Robert Downey Jr is the most underrated actor in Hollywood...True Story.",
            "title_similarity": "0.7094162",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpgxde1",
            "score": 1,
            "text": "I'm sure Penelope Cruz is just over the moon with this news...",
            "title_similarity": "0.25489074",
            "sentiment_compound": 0.3182
        },
        {
            "id": "hpgxguz",
            "score": 1,
            "text": "He nailed that role. It’s a A++ performance",
            "title_similarity": "0.371102",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpgxh78",
            "score": 2,
            "text": "Also no country for old men is the greatest movie of all time",
            "title_similarity": "0.62040496",
            "sentiment_compound": 0.4588
        },
        {
            "id": "hpgxiqe",
            "score": 1,
            "text": "how? what scenes?",
            "title_similarity": "-0.0065665096",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpgy2s6",
            "score": 1,
            "text": "Just rewatched this two days ago. He is so good in this movie.",
            "title_similarity": "0.49174112",
            "sentiment_compound": 0.5777
        },
        {
            "id": "hpgy3me",
            "score": 1,
            "text": "I was reminded a lot of Robert Mitchum's character in \"Night of the Hunter\"",
            "title_similarity": "0.4525377",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpgy4ag",
            "score": 2,
            "text": "Amazingly creepy… beats all horror movie bad guys because I know Freddy isn’t going to kill me in my nightmares…. But this freak could end up in the kitchen one morning when you are strolling in for a drink of water half asleep with morning wood….",
            "title_similarity": "0.6367413",
            "sentiment_compound": -0.9003
        },
        {
            "id": "hpgyap6",
            "score": 1,
            "text": "Jim Can't Swim on YouTube, last video kind of touched on this. Not this exact story but he showed two people who faked being insane and one who actually was",
            "title_similarity": "0.59197587",
            "sentiment_compound": -0.5499
        },
        {
            "id": "hpgyble",
            "score": 1,
            "text": "The way his character interacts with other people not in the main storyline of the movie where he's upset that they don't understand his viewpoint is fantastic",
            "title_similarity": "0.47023958",
            "sentiment_compound": 0.25
        },
        {
            "id": "hpgyct8",
            "score": 1,
            "text": "“Call it.” & “What’s the most you ever lost in a coin toss?”\n\nTo this day, two of the scariest lines of dialogue I’ve ever heard.",
            "title_similarity": "0.5601609",
            "sentiment_compound": -0.3744
        },
        {
            "id": "hpgycxk",
            "score": 1,
            "text": "One of the best, worst characters of all time. Insane.",
            "title_similarity": "0.4834193",
            "sentiment_compound": -0.3818
        },
        {
            "id": "hpgyhvk",
            "score": 1,
            "text": "\"Um, thanks. I guess.\"",
            "title_similarity": "0.028485922",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hpgyi84",
            "score": 1,
            "text": "He is apparently a sweet guy. Hates violence according to his Wikipedia article. Great actor indeed!",
            "title_similarity": "0.63701844",
            "sentiment_compound": 0.1007
        },
        {
            "id": "hpgyk55",
            "score": 1,
            "text": "I feel bad I cannot see him in anything without whispering \"jack parrow\"",
            "title_similarity": "0.42689",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hpgylbf",
            "score": 1,
            "text": "The Coens' script was so exact for this movie that even the wadded up peanut package slowly uncrinkling on the counter was in the storyboards.",
            "title_similarity": "0.5418855",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpgyozj",
            "score": 1,
            "text": "Sugar?",
            "title_similarity": "0.09406831",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpgyp5o",
            "score": 1,
            "text": "I read that as “independent group of psychopaths”. Disappointed.",
            "title_similarity": "0.57531035",
            "sentiment_compound": -0.4767
        },
        {
            "id": "hpgyy2v",
            "score": 1,
            "text": "What time does the store close…\nCloses now sir…\nNow is not a time, what time do you close?",
            "title_similarity": "0.30119163",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpgz2zd",
            "score": 2,
            "text": "I bet they just saw the haircut",
            "title_similarity": "0.22933337",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpgziof",
            "score": 1,
            "text": "The fact that you dont need a college degree to be a fire arsonist investigator, dont really put much weight on an independent forensic pamphlet has to say about this matter.",
            "title_similarity": "0.4694417",
            "sentiment_compound": -0.3127
        },
        {
            "id": "hpgzq3p",
            "score": 1,
            "text": "The scene where he’s dealing with the property manager was when I really felt the weight of his psychopathy. It was malevolent, but organized. Although he was annoyed she wouldn’t help him, he respected her because she was 100% devoted to that principle. Even in the face of obvious danger, she would die before letting Anton have the satisfaction of getting what he wanted.\n\nMost of the time, psychopaths are depicted in movies as being wildly unpredictable, and having no moral guide. Anton very much does. It’s just a really misguided compass.",
            "title_similarity": "0.649969",
            "sentiment_compound": -0.2617
        },
        {
            "id": "hpgzrth",
            "score": 1,
            "text": "Anyone been in Javier’s basement?",
            "title_similarity": "0.35125756",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpgzthy",
            "score": 1,
            "text": "… which is insane.",
            "title_similarity": "0.1210438",
            "sentiment_compound": -0.4019
        },
        {
            "id": "hpgzwic",
            "score": 1,
            "text": "I really need to re-watch this. It came out when I graduated back in 07.  I found it really boring back then, but I was also a dumbass 18 year old.",
            "title_similarity": "0.57280886",
            "sentiment_compound": -0.7715
        },
        {
            "id": "hpgzyas",
            "score": 1,
            "text": "Greatest villain ever",
            "title_similarity": "0.50095206",
            "sentiment_compound": 0.1531
        },
        {
            "id": "hph01du",
            "score": 2,
            "text": "I fucking loved this movie as a teenager and it held up as an adult. \n\nHighly recommend it to all my friends who ask about movies",
            "title_similarity": "0.5101233",
            "sentiment_compound": 0.8775
        },
        {
            "id": "hph054y",
            "score": 2,
            "text": "Christian Bale*\n\nWell this is bullshit",
            "title_similarity": "0.29073453",
            "sentiment_compound": -0.4019
        },
        {
            "id": "hph08rm",
            "score": 2,
            "text": "I really think all he needed was that haircut.",
            "title_similarity": "0.36480457",
            "sentiment_compound": 0.0
        },
        {
            "id": "hph0hbp",
            "score": 1,
            "text": "[Call it](https://youtu.be/ANlMM0HQxC0)",
            "title_similarity": "0.15640509",
            "sentiment_compound": 0.0
        },
        {
            "id": "hph0i7j",
            "score": 1,
            "text": "Stelio!",
            "title_similarity": "0.023972563",
            "sentiment_compound": 0.0
        },
        {
            "id": "hph0lot",
            "score": 1,
            "text": "I guess they didn't want anything else than, not even a certain British show about a virus and some mentally deranged psychopathic contract killer....\n\nK",
            "title_similarity": "0.6182213",
            "sentiment_compound": -0.7458
        },
        {
            "id": "hph0qpa",
            "score": 1,
            "text": "100% agree\n\nI still think about his character randomly sometimes because it was so compelling and horrifying.\n\nHe had the sociopath component down so well.  Just cold indifference and almost toying with people. Sort of like a lion does with a baby antelope it’s caught.  \n\nSo unsettling",
            "title_similarity": "0.63255584",
            "sentiment_compound": 0.5825
        },
        {
            "id": "hph0rhl",
            "score": 1,
            "text": "Louise Belcher has therefore done the second most realistic impression of a psychopath",
            "title_similarity": "0.6423209",
            "sentiment_compound": 0.2911
        },
        {
            "id": "hph0s2p",
            "score": 1,
            "text": "Bond villain was GREAT!!",
            "title_similarity": "0.39822435",
            "sentiment_compound": 0.4247
        },
        {
            "id": "hph12k9",
            "score": 1,
            "text": "nonsense. not most realistic, maybe most effective.",
            "title_similarity": "0.30273414",
            "sentiment_compound": 0.1761
        },
        {
            "id": "hph16ys",
            "score": 2,
            "text": "His performance is CHILLING. The scene at the run down gas station with the coin is INCREDIBLE.",
            "title_similarity": "0.53180873",
            "sentiment_compound": -0.2103
        },
        {
            "id": "hph18vf",
            "score": 2,
            "text": "It was a dam fine performance.",
            "title_similarity": "0.15766671",
            "sentiment_compound": 0.2023
        },
        {
            "id": "hph1dtp",
            "score": 2,
            "text": "I read that as \"independent group of psychopaths\" at first",
            "title_similarity": "0.5602837",
            "sentiment_compound": 0.0
        },
        {
            "id": "hph1enh",
            "score": 3,
            "text": "“Where do you want me to put it?”\n\n“Anywhere not in your pocket. Where it'll get mixed in with the others and become just a coin. Which it is…”",
            "title_similarity": "0.3008301",
            "sentiment_compound": 0.0772
        },
        {
            "id": "hph1ik8",
            "score": 2,
            "text": "I can do better.",
            "title_similarity": "0.06366685",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hph1mg7",
            "score": 1,
            "text": "The look on his face as he stitched up his wounds was perfect.\n\nEnraged but focused. He’d rather die then not pay Llewelyn back.",
            "title_similarity": "0.55414987",
            "sentiment_compound": -0.2514
        },
        {
            "id": "hph1obq",
            "score": 2,
            "text": "Guess I'll have to watch this.",
            "title_similarity": "0.10406917",
            "sentiment_compound": 0.0
        },
        {
            "id": "hph1ykc",
            "score": 2,
            "text": "That scene in the gas station still terrifies me.",
            "title_similarity": "0.4388001",
            "sentiment_compound": -0.5574
        },
        {
            "id": "hph2ai3",
            "score": 1,
            "text": "I wonder why psychopaths act like everyone acts when they play GTA.",
            "title_similarity": "0.6197339",
            "sentiment_compound": 0.5994
        },
        {
            "id": "hph2odi",
            "score": 5,
            "text": "Love his performance, but it should be noted that most psychopaths are not actually like him. While 'psychopath' is not actually a psychologically accepted term, in laymans, there are different layers of it. He would be considered someone who lacks empathy, and also has a deep desire to hurt others, with no remorse. But most psychopaths are on a 'scale' in that regard. \n\nOne of the best depictions of a psychopath was in the Sopranos. Ralphie. He is your average, every-day psychopath. In many respects, he is extremely charming and fun to be around, and yet deep down he holds a strong desire to hurt those around him for his own personal sense of pleasure. They show this when they first start introducing him, the way he [bullies and assaults those around him for his own personal pleasure.](https://youtu.be/GjntHn-s43c?t=68) Note, that Tony abuses him too at other parts of the show, but only in fits of rage. He does not do it purely for pleasure. Ralphie has a smile on his face, he can barely even help himself from tormenting this guy. That is a tell tale symptom of a psychopath. \n\nThe scene where Ralphie murders Tracee and Tony is horrified by it is the difference between a psychopath (someone who is born that way, innate desire to cause pain on others) and a sociopath (lack of empathy through exposure to trauma and abuse, often selective lack of empathy, IE Tony). I don't know if it was intentionally written that way, but it feels almost *too* on the nose to me.",
            "title_similarity": "0.664166",
            "sentiment_compound": 0.0493
        },
        {
            "id": "hph2twh",
            "score": 1,
            "text": "If you're goingby a convincing portrayal of psychopath thats also incredibly violent, murderous and almost completely anti-social then sure. Most psychopaths live like you and me though.",
            "title_similarity": "0.66304183",
            "sentiment_compound": -0.3907
        },
        {
            "id": "hph2v67",
            "score": 1,
            "text": "So was he acting",
            "title_similarity": "0.16925055",
            "sentiment_compound": 0.0
        },
        {
            "id": "hph30jx",
            "score": 3,
            "text": "That's pretty cool. He was perfect for that part. \n\nThat haircut is the perfect \"I don't care what you think\" haircut.",
            "title_similarity": "0.3861823",
            "sentiment_compound": 0.8826
        },
        {
            "id": "hph3auw",
            "score": 1,
            "text": "This happens to be filmed mostly in my hometown. Such a great, thrilling movie!",
            "title_similarity": "0.34843835",
            "sentiment_compound": 0.8172
        },
        {
            "id": "hph3b1n",
            "score": 3,
            "text": "What’s the most you ever lost on a coin toss?",
            "title_similarity": "0.41092822",
            "sentiment_compound": -0.3744
        },
        {
            "id": "hph3esd",
            "score": 3,
            "text": "In an interview about \"No Country For Old Men\", Chigur was supposed to generally be the same but also give the feeling that something wasn't quite right.  His clothes are too dark,  his hair is strange, his mannerisms are strange.",
            "title_similarity": "0.5217793",
            "sentiment_compound": -0.3919
        },
        {
            "id": "hph3tur",
            "score": 2,
            "text": "Great movie",
            "title_similarity": "0.2410164",
            "sentiment_compound": 0.6249
        },
        {
            "id": "hph3tzj",
            "score": 1,
            "text": "Also the [acid scene from Hot Rod](https://www.youtube.com/watch?v=Nrs-lyhcXmA) is the most accurate description of LSD portrayed in a movie",
            "title_similarity": "0.6162768",
            "sentiment_compound": 0.0
        },
        {
            "id": "hph46l0",
            "score": 3,
            "text": "\"Don't put it in your pocket. If you put it in your pocket it just becomes another coin. Which it is...\"",
            "title_similarity": "0.2687843",
            "sentiment_compound": 0.0
        },
        {
            "id": "hph47vc",
            "score": 1,
            "text": "Someone’s been watching Emplemon lol",
            "title_similarity": "0.15196224",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hph4ah3",
            "score": 2,
            "text": "Cool. He was pretty intimidating in that movie.",
            "title_similarity": "0.49878737",
            "sentiment_compound": 0.3818
        },
        {
            "id": "hph4btw",
            "score": 2,
            "text": "I'd say that the more appropriate word would be sociopath.",
            "title_similarity": "0.35859603",
            "sentiment_compound": 0.0
        },
        {
            "id": "hph4ftz",
            "score": 2,
            "text": "I would never want to flip a coin at his request",
            "title_similarity": "0.26582694",
            "sentiment_compound": -0.0572
        },
        {
            "id": "hph52vs",
            "score": 3,
            "text": "The portrayal of the serial killer in ‘The Vanishing’ (1988) is also up there for me",
            "title_similarity": "0.5409606",
            "sentiment_compound": -0.6486
        },
        {
            "id": "hph59kq",
            "score": 2,
            "text": "Oh that’s a great thing to know!",
            "title_similarity": "0.047061905",
            "sentiment_compound": 0.6588
        },
        {
            "id": "hph5cm0",
            "score": 2,
            "text": "The scene where he’s just sitting in the dudes house drinking milk so so fuckin unsettling to me. Top villain imo",
            "title_similarity": "0.550874",
            "sentiment_compound": -0.4215
        },
        {
            "id": "hph5es2",
            "score": 4,
            "text": "He's married to Penelope Cruz.. Right?",
            "title_similarity": "0.22157997",
            "sentiment_compound": 0.0
        },
        {
            "id": "hph5hx2",
            "score": 1,
            "text": "This character gave me chills.",
            "title_similarity": "0.26027668",
            "sentiment_compound": 0.0
        },
        {
            "id": "hph5nv4",
            "score": 1,
            "text": "Pretty sure I said something like this when I first watched it. Amazing performance by him!",
            "title_similarity": "0.33071655",
            "sentiment_compound": 0.902
        },
        {
            "id": "hph614y",
            "score": 1,
            "text": "I completely agree with those psychologists!",
            "title_similarity": "0.37501505",
            "sentiment_compound": 0.474
        },
        {
            "id": "hph62bs",
            "score": 1,
            "text": "Definitely read that as “independent group of psychopaths” at first",
            "title_similarity": "0.57772815",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hph6qy1",
            "score": 1,
            "text": "I was fortunate enough to have seen this amazing movie in the theater on opening night in Boston.\n\nAnd after I became acquainted with his character every time he came on screen an unsettling and anxious feeling washed over me. Bardem was incredible, his performance rocked me to my bones. The only other time I could think of feeling that type of anxiety when seeing a character on screen was the Wicked Witch of the West and Darth Vader as a child.",
            "title_similarity": "0.5904834",
            "sentiment_compound": 0.2023
        },
        {
            "id": "hph6wbx",
            "score": 1,
            "text": "Seriously, he makes that movie. \n “If the rule you followed brought you to this, what use was that rule?”",
            "title_similarity": "0.45251286",
            "sentiment_compound": -0.1779
        },
        {
            "id": "hph70ns",
            "score": 1,
            "text": "Agreed, not since 'Henry:Portrait of a serial killer' have I felt that sinister emptyness.",
            "title_similarity": "0.6846645",
            "sentiment_compound": -0.7964
        },
        {
            "id": "hph76bk",
            "score": 1,
            "text": "I didnt need a journal to tell me this. That coin toss scene was IN-TENSE.",
            "title_similarity": "0.34370732",
            "sentiment_compound": 0.0
        },
        {
            "id": "hph79ig",
            "score": 1,
            "text": "Is the movie good? Genuine question",
            "title_similarity": "0.34793225",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hph7ogu",
            "score": 1,
            "text": "[Here's the PDF of the paper](https://www.sakkyndig.com/psykologi/artvit/leistedt2013.pdf), if you want to read it.  It came out in 2013, so it would be missing some notable candidates like Amy Dunne from Gone Girl or Louis Bloom from Nightcrawler. \n\nThey also don't rank the movie psychopaths and have him come in at #1.  They merely describe him as \"among the most realistic\". Relevant passage:\n\n>Among the most interesting recent and most realistic idiopathic psychopathic characters is Anton Chigurh in the 2007 Coen brothers’ film, No Country for Old Men. Anton Chigurh is a well-designed prototypical idiopathic/primary psychopath. We lack information concerning his childhood, but there are sufficient arguments and detailed information about his behavior in the film to obtain a diagnosis of active, primary, idiopathic psychopathy, incapacity for love, absence of shame or remorse, lack of psychological insight, inability to learn from past experience, cold-blooded attitude, ruthlessness, total determination, and lack of empathy. He seems to be affectively invulnerable and resistant to any form of emotion or humanity. Having read and studied Richard Kuklinski’s case, Chigurh and Kuklinski have several traits in common (20). In the case of Chigurh, the description is extreme, but we could realistically almost talk about ≪ an anti-human personality disorder ≫",
            "title_similarity": "0.7142433",
            "sentiment_compound": -0.7513
        },
        {
            "id": "hph7u2s",
            "score": 2,
            "text": "Christian Bale is probably pissed. He tried so hard in American Psycho.",
            "title_similarity": "0.54078037",
            "sentiment_compound": -0.7241
        },
        {
            "id": "hph7vsk",
            "score": 3,
            "text": "What's even more interesting is that Bardem has a very deep resentment towards violence and really didn't like the character, but rolled with him till the end. That's real acting!",
            "title_similarity": "0.5950155",
            "sentiment_compound": -0.5616
        },
        {
            "id": "hph87w8",
            "score": 1,
            "text": "Time to watch it again.and again. And again.",
            "title_similarity": "0.056264527",
            "sentiment_compound": 0.0
        },
        {
            "id": "hph8ciw",
            "score": 1,
            "text": "To everyone who loved this movie I implore you to read the book by kormac McCarthy on which it is based on.  Then read everything else by him because this is his worst book and it’s still amazing.  Kormac is one of the greatest unsung American authors",
            "title_similarity": "0.7146982",
            "sentiment_compound": 0.8316
        },
        {
            "id": "hph8ez3",
            "score": 1,
            "text": "Stelio... Stelio Kontos!",
            "title_similarity": "0.09085489",
            "sentiment_compound": 0.0
        },
        {
            "id": "hph8ez7",
            "score": 3,
            "text": "I always wondered why I got so uncomfortable with his character in this movie. I still get the chills, and I’ve only watched it once.",
            "title_similarity": "0.5485915",
            "sentiment_compound": -0.5214
        },
        {
            "id": "hph8kuj",
            "score": 2,
            "text": "His acting was absolutely incredible in this",
            "title_similarity": "0.26645294",
            "sentiment_compound": 0.0
        },
        {
            "id": "hph96p3",
            "score": 2,
            "text": "Are you going to kill me?\n\nThat depends. Can you see me?",
            "title_similarity": "0.34041417",
            "sentiment_compound": -0.7236
        },
        {
            "id": "hph9ejq",
            "score": 1,
            "text": "Javier Bardem was amazing in No Country for Old Men and I would argue that he was the main character",
            "title_similarity": "0.6772837",
            "sentiment_compound": 0.0516
        },
        {
            "id": "hph9g79",
            "score": 1,
            "text": "He was terrifying.   If i was dating the actor, i would have broken up with him.",
            "title_similarity": "0.48523483",
            "sentiment_compound": -0.7783
        },
        {
            "id": "hph9hwk",
            "score": 1,
            "text": "One of my favourite psychos.",
            "title_similarity": "0.48205325",
            "sentiment_compound": 0.0
        },
        {
            "id": "hph9o8r",
            "score": 2,
            "text": "Anything written by Cormac McCarthy is gold IMO. Bardem definitely nailed the part but the genius behind it is McCarthy. Wait until they figure out a way to get Blood Meridian to the public. The Judge will make Anton look like Mary Poppins",
            "title_similarity": "0.6630903",
            "sentiment_compound": 0.6249
        },
        {
            "id": "hph9ojn",
            "score": 1,
            "text": "Completely agree, his character was more scary than any other I've seen on film. There's just something so unsettling about that man.",
            "title_similarity": "0.58975303",
            "sentiment_compound": -0.1779
        },
        {
            "id": "hpha2aq",
            "score": 1,
            "text": "Got to admit, he gets the job done.",
            "title_similarity": "0.17890592",
            "sentiment_compound": 0.2023
        },
        {
            "id": "hpha42a",
            "score": 1,
            "text": "He definitely made that movie real.",
            "title_similarity": "0.31455636",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hpha9gg",
            "score": 1,
            "text": "Cashier ask this man about the weather. \n\nAnton: So it is death you have chosen.",
            "title_similarity": "0.4836069",
            "sentiment_compound": -0.6326
        },
        {
            "id": "hpha9sg",
            "score": 1,
            "text": "I was at a con doing a cosplay of Heisenberg from Breaking Bad and ran into a guy who did a spot on Anton Chigurh. Simple cosplay, yet one of the coolest ones I've ever seen. Had the gas cylinder and everything.\n\nhttps://imgur.com/a/wfIbowQ",
            "title_similarity": "0.7062899",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hphae0w",
            "score": 1,
            "text": "He was so, so good in this film. Looks like I'm watching this again tonight! On a side note, I recently got a bob with bangs and honestly it looks better on him.",
            "title_similarity": "0.48904184",
            "sentiment_compound": 0.9087
        },
        {
            "id": "hphafvb",
            "score": 1,
            "text": "Fuck. His performance was spot on scary as fuck.",
            "title_similarity": "0.44704604",
            "sentiment_compound": -0.8807
        },
        {
            "id": "hpham4e",
            "score": 1,
            "text": "He definitely got my vote.  Chilling performance.   \n\nKind of makes you think just how easy it is to kill someone if you put your mind to it.  Crap let me rephrase, makes you think how it easy it is for someone to kill you if they put their mind to it.",
            "title_similarity": "0.5797802",
            "sentiment_compound": -0.6808
        },
        {
            "id": "hpham7y",
            "score": 1,
            "text": "In the years since seeing this movie I’ve had the misfortune of encountering psychopaths in my life, and although not murderous ones, it was this character’s relentlessness that I was always reminded of.  It is a truly terrifying experience to go through especially when so-called “law enforcement” in this case can do nothing to stop it.",
            "title_similarity": "0.67733264",
            "sentiment_compound": 0.5355
        },
        {
            "id": "hphauc1",
            "score": 3,
            "text": "Every year I appreciate Javier Bardem even more he’s such a great actor",
            "title_similarity": "0.37840876",
            "sentiment_compound": 0.7783
        },
        {
            "id": "hphauoe",
            "score": 2,
            "text": "The funniest part of this whole thing is that J Brolin got hurt in a motorcycle accident and that pushed the story more fwd to the 80s. They originally wanted it to be in the 70s. \nI saw an article about that little gem.",
            "title_similarity": "0.6150816",
            "sentiment_compound": -0.4404
        },
        {
            "id": "hphb0im",
            "score": 1,
            "text": "I read this interesting movie analysis article that was breaking down the movies' themes. One interesting aspect, in describing how the movie is a \"foil\" for western's (I can't remember the correct term - it's a western that's the opposite of western's, in ways): Llewyn (the MC) is represented as the western hero figure, but he does what he wants/doesn't have some code/principals (uncharacteristic of MC's in westerns), and dies (not giving you the sense of \"justice\" typically seen in westerns),... while Anton has a code/set of principals, and isn't killed by either of the MC's (making the movie intentionally feel awkward for a \"western\" genre movie, that resolves very differently). Thought that was interesting... The movie opposes the viewers expectations in westerns, making ya ponder things (like \"do people get what they deserve?\" or \"is there meaning in (things)?\").\n\nE: I just wanted to point out that the article (obviously) gets much, much further in depth, and explains things much better.",
            "title_similarity": "0.6366241",
            "sentiment_compound": 0.9759
        },
        {
            "id": "hphba86",
            "score": 1,
            "text": "Is this coming up because this movie is about to stop being on Netflix so loads of people are watching it for the first time?",
            "title_similarity": "0.4472409",
            "sentiment_compound": -0.296
        },
        {
            "id": "hphbf58",
            "score": 1,
            "text": "Curious to what was the close 2nd?",
            "title_similarity": "0.15026224",
            "sentiment_compound": 0.3182
        },
        {
            "id": "hphbkih",
            "score": 1,
            "text": "I mean yeah. Films tend to portray psychopaths as either mentally unstable deranged killers or emotionless robots. \n\nTruth is that a psychopath is just a normal ass person with zero empathy or pity. They'll do anything they want regardless of how it affects others so long as it doesn't affect them negatively.",
            "title_similarity": "0.67508364",
            "sentiment_compound": -0.8271
        },
        {
            "id": "hphbo94",
            "score": 2,
            "text": "This movie was incredibly intense for me, even though there was little to no action/violence. His performance was chilling. I was afraid of him and had to keep reminding myself that he was just acting in a movie.",
            "title_similarity": "0.6433008",
            "sentiment_compound": -0.11
        },
        {
            "id": "hphbxsx",
            "score": 1,
            "text": "Is Llewellen there?\n\nNot in the sense that you mean it.",
            "title_similarity": "0.12965292",
            "sentiment_compound": 0.0
        },
        {
            "id": "hphc06p",
            "score": 1,
            "text": "What came in second?",
            "title_similarity": "0.051286623",
            "sentiment_compound": 0.0
        },
        {
            "id": "hphc10v",
            "score": 1,
            "text": "I wonder where Billy Bob placed for his role in Fargo season 1",
            "title_similarity": "0.43915036",
            "sentiment_compound": 0.0
        },
        {
            "id": "hphc1zr",
            "score": 1,
            "text": "Brilliant performance. Definitely a film watching if you haven’t seen it.",
            "title_similarity": "0.3644282",
            "sentiment_compound": 0.7579
        },
        {
            "id": "hphc63s",
            "score": 1,
            "text": "Anyone see the latest Dune movie. Both Bardem and Josh Brolin are in it.\n\nGurney Halek, \"I don't like him\".\n\nYeah, cuz he murdered you in No Country For Old Men.",
            "title_similarity": "0.6722089",
            "sentiment_compound": -0.8624
        },
        {
            "id": "hphc6s1",
            "score": 1,
            "text": "Inb4 dude is just real psycho and have like 40 dead bodies in basement",
            "title_similarity": "0.52722406",
            "sentiment_compound": -0.4215
        },
        {
            "id": "hphcf8r",
            "score": 1,
            "text": "I think I heard on NPR(?) that Bardem had only a cursory knowledge of English at the time.  I wonder if it helped him isolate and protect his characters' space.",
            "title_similarity": "0.46038422",
            "sentiment_compound": 0.2023
        },
        {
            "id": "hphcfc1",
            "score": 1,
            "text": "My understanding of a psychopath would be Chigurh having some more social skills, or at least the facade of social skills.  But still, he embodies what he supposed to be.",
            "title_similarity": "0.5110484",
            "sentiment_compound": 0.0
        },
        {
            "id": "hphck93",
            "score": 1,
            "text": "Criminally overrated movie though.",
            "title_similarity": "0.41905603",
            "sentiment_compound": 0.0
        },
        {
            "id": "hphcl9e",
            "score": 1,
            "text": "Stand still please",
            "title_similarity": "0.035615906",
            "sentiment_compound": 0.3182
        },
        {
            "id": "hphcsv6",
            "score": 1,
            "text": "Seemed like a great role model for me. To each their own huh? Not everyone can be a psychologist living life in an office.",
            "title_similarity": "0.5536759",
            "sentiment_compound": 0.765
        },
        {
            "id": "hphct46",
            "score": 2,
            "text": "One of the few movies I can rewatch.",
            "title_similarity": "0.24683699",
            "sentiment_compound": 0.0
        },
        {
            "id": "hphcut7",
            "score": 1,
            "text": "Can someone please explain Woody Harrelson’s character to me?  Also a bounty hunter/assassin, just not a fucking psycho?  Have not readthe book but he seems under-drawn as a character in the movie.",
            "title_similarity": "0.5999138",
            "sentiment_compound": 0.2523
        },
        {
            "id": "hphd033",
            "score": 7,
            "text": "Are those psychologists aware that the average psychopath is a brutally good salesman on the high ranks of a company?",
            "title_similarity": "0.69745415",
            "sentiment_compound": -0.2732
        },
        {
            "id": "hphd9ko",
            "score": 2,
            "text": "He's (generally referring to the specific portrayal, but i might slip up in wording) one of the only fictional antagonists i've encountered in film (where they were trying to portray a proper psychopath) that really unnerved me. Most \"psycho\" characters (that i can recall) seem to have too much 'fun' with their issues. Chigurh is also far from mechanical; methodical, pragmatic, but adaptable... seems aware of what he is, and you might not notice anything amiss until it's far too late.\n\nedit: I also found notable his tendency towards indifference over any sort of enjoyment or malice, yet somehow he does not seem empty inside.",
            "title_similarity": "0.71439016",
            "sentiment_compound": 0.8338
        },
        {
            "id": "hphdapa",
            "score": 2,
            "text": "What about cape fear",
            "title_similarity": "0.21311542",
            "sentiment_compound": -0.4939
        },
        {
            "id": "hphdbmx",
            "score": 2,
            "text": "“Step out of the car, sir.” - 😀",
            "title_similarity": "0.1775007",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hphdfc9",
            "score": 1,
            "text": "I heard something similar about Paul Newman in HUD.",
            "title_similarity": "0.300187",
            "sentiment_compound": 0.0
        },
        {
            "id": "hphdic2",
            "score": 1,
            "text": "I need a link to that whole list.",
            "title_similarity": "0.10474565",
            "sentiment_compound": 0.0
        },
        {
            "id": "hphdmpm",
            "score": 1,
            "text": "I'm not surprised he was great.",
            "title_similarity": "0.19003609",
            "sentiment_compound": 0.5321
        },
        {
            "id": "hphdodq",
            "score": 2,
            "text": "Actor level: GOD",
            "title_similarity": "0.25344825",
            "sentiment_compound": 0.4278
        },
        {
            "id": "hphdtb8",
            "score": 1,
            "text": "Great movie",
            "title_similarity": "0.2410164",
            "sentiment_compound": 0.6249
        },
        {
            "id": "hphel8c",
            "score": 2,
            "text": "Javier Bardem's performance was a bit too good lol. It was very unsettling to watch.",
            "title_similarity": "0.47763857",
            "sentiment_compound": 0.6908
        },
        {
            "id": "hphelmh",
            "score": 1,
            "text": "Oh an independent group of psychologist well I'm sold.  This is so stupid seeing how hard it is to label someone a actually psychopath.",
            "title_similarity": "0.6180804",
            "sentiment_compound": -0.567
        },
        {
            "id": "hpheotj",
            "score": 1,
            "text": "Perfect! Adding this to the list of brilliant movies that I will never ever ever watch.",
            "title_similarity": "0.4492889",
            "sentiment_compound": 0.8313
        },
        {
            "id": "hphf0wt",
            "score": 1,
            "text": "Most stressful movie I've ever seen. Every scene he was in was incredibly tense 😬.",
            "title_similarity": "0.49908355",
            "sentiment_compound": -0.8387
        },
        {
            "id": "hphf1uq",
            "score": 1,
            "text": "I find his character so creepy yet fascinating.  It's like killing was never personal, it's a calculation based on his task, nothing personal. In a weird way and this may just be me but theirs something quite uncomplicated in somebody being killed for those reasons rather than some petty gripe or slant. Still wouldn't want to go for a bagel with him.",
            "title_similarity": "0.60051274",
            "sentiment_compound": -0.8658
        },
        {
            "id": "hphf4ea",
            "score": 1,
            "text": "And I say that he’s the scariest character in all filmdom.",
            "title_similarity": "0.61651313",
            "sentiment_compound": 0.0
        },
        {
            "id": "hphf4r9",
            "score": 1,
            "text": "He’s pretty wild in mother too, kinda freaked me out",
            "title_similarity": "0.39444345",
            "sentiment_compound": 0.3167
        },
        {
            "id": "hphf66a",
            "score": 1,
            "text": "hes not a psychopath hes a \"cleaner\"  \nevery person he kills was for a reason. he never just murdered someone randomly.",
            "title_similarity": "0.5475311",
            "sentiment_compound": 0.1818
        },
        {
            "id": "hphf6ux",
            "score": 1,
            "text": "Lawful Neutral",
            "title_similarity": "0.1505915",
            "sentiment_compound": 0.0
        },
        {
            "id": "hphf7j4",
            "score": 1,
            "text": "🤷🏻‍♀️",
            "title_similarity": "-0.024049597",
            "sentiment_compound": 0.0
        },
        {
            "id": "hphf98t",
            "score": 1,
            "text": "Soon is not a time.\nWhat a great movie!",
            "title_similarity": "0.29465798",
            "sentiment_compound": 0.6588
        },
        {
            "id": "hphfh6d",
            "score": 1,
            "text": "What about Jack Nicholson in Batman?",
            "title_similarity": "0.34681863",
            "sentiment_compound": 0.0
        },
        {
            "id": "hphflq0",
            "score": 1,
            "text": "Great movie, he truly did an amazing job",
            "title_similarity": "0.36727673",
            "sentiment_compound": 0.8957
        },
        {
            "id": "hphfo0l",
            "score": 1,
            "text": "Fun fact, there’s no music for a score in this movie, instead the Coen Brothers used sounds from the environment to create tension.",
            "title_similarity": "0.5216828",
            "sentiment_compound": 0.2263
        },
        {
            "id": "hphfwhk",
            "score": 1,
            "text": "What. A. Great. Character!\n\nHe was the best part of this film.",
            "title_similarity": "0.4660605",
            "sentiment_compound": 0.8622
        },
        {
            "id": "hphg486",
            "score": 1,
            "text": "I love his character, and the movie. Like a lot.",
            "title_similarity": "0.3456053",
            "sentiment_compound": 0.7717
        },
        {
            "id": "hphgcv3",
            "score": 1,
            "text": "\"Call it\"",
            "title_similarity": "-0.008567676",
            "sentiment_compound": 0.0
        },
        {
            "id": "hphgeyb",
            "score": 1,
            "text": "I knew it. His character in this movie made me feel uneasy Everytime I saw him in another movie.",
            "title_similarity": "0.53186524",
            "sentiment_compound": -0.3818
        },
        {
            "id": "hphggbs",
            "score": 1,
            "text": "Heads or tails. Make a decision.",
            "title_similarity": "0.07361748",
            "sentiment_compound": 0.0
        },
        {
            "id": "hphghth",
            "score": 1,
            "text": "The scene in the gas station. To me it's almost like he could feel the pain in the old man's soul, like he read him all at one. And maybe he felt that killing him in the coin toss wasn't a bad thing, that it would deliver him from it. Probably nonsense but such amazing cinema like that makes your brain work. A masterpiece of a movie.",
            "title_similarity": "0.67144144",
            "sentiment_compound": 0.9284
        },
        {
            "id": "hphgjky",
            "score": 1,
            "text": "That’s why I love his performance in the Princess Bride Home Movie as Inigo Montoya. Because I know him as such a convincing method actor, it’s so refreshing to see him be funny.",
            "title_similarity": "0.52261806",
            "sentiment_compound": 0.8689
        },
        {
            "id": "hphgmsc",
            "score": 1,
            "text": "He would make an amazing re-imagination of Jaws in a Bond film.",
            "title_similarity": "0.47759122",
            "sentiment_compound": 0.5859
        },
        {
            "id": "hphgmsh",
            "score": 2,
            "text": "If I was the Gas Station Guy...I would have died because I would not play him game.\n\n\"Call it\"\n\n\"Why? What do I stand to win or lose?\"\n\n\"Everything\"\n\n\"Then no. I won't risk everything on a coin toss.\"\n\n\"Then you forfeit and lose everything\"\n\n\"No. I'm not even playing. I never agreed to it.\"\n\n\"Call it, please.\"\n\n\"If I win, do you lose everything?\"\n\n\"No.\"\n\n\"Then it's not fair, I'm risking everything and you're risking nothing.\"\n\nBLAM!\n\nI hope in my death he gets more confused about the purpose of using a coin to decide someone's fate.",
            "title_similarity": "0.48381004",
            "sentiment_compound": -0.9296
        },
        {
            "id": "hphgoer",
            "score": 1,
            "text": "\"I don't know... do you see me?\"",
            "title_similarity": "0.02653277",
            "sentiment_compound": 0.0
        },
        {
            "id": "hphgor7",
            "score": 1,
            "text": "I can’t wait to see him as Desi Arnaz in the Lucy movie",
            "title_similarity": "0.3938163",
            "sentiment_compound": 0.0
        },
        {
            "id": "hphgoxf",
            "score": 1,
            "text": "My buddy and I had planned to go grocery shopping right after we saw this movie. We had to go back to my place first and discuss the movie, sort of decompress.  Wow. This was a great film.",
            "title_similarity": "0.41455367",
            "sentiment_compound": 0.8228
        },
        {
            "id": "hphgrfg",
            "score": 1,
            "text": "Canyoustepouttathecarsirplease",
            "title_similarity": "0.1238756",
            "sentiment_compound": 0.0
        },
        {
            "id": "hphgrk7",
            "score": 1,
            "text": "independent group of psychos would have been a better group",
            "title_similarity": "0.45812368",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hphh0h4",
            "score": 1,
            "text": "Most unrealistic is Hannibal Lector. Terrifying, yes,  but unrealistic.",
            "title_similarity": "0.4671132",
            "sentiment_compound": -0.128
        },
        {
            "id": "hphh16m",
            "score": 1,
            "text": "No shit, what an amazing performance",
            "title_similarity": "0.18538094",
            "sentiment_compound": 0.7733
        },
        {
            "id": "hphhf4d",
            "score": 1,
            "text": "One coin toss for someone’s life and they call you a psycho ugh 🙄🙄",
            "title_similarity": "0.5040775",
            "sentiment_compound": -0.4215
        },
        {
            "id": "hphhjlo",
            "score": 1,
            "text": "I didn't think they would care.",
            "title_similarity": "0.14772017",
            "sentiment_compound": 0.4939
        },
        {
            "id": "hphhoj7",
            "score": 1,
            "text": "I believe it. True psychopaths aren't a definitive personality like the joker laughing and screaming historically. They can be quite normal which is what makes them all the more creepy.",
            "title_similarity": "0.67305017",
            "sentiment_compound": 0.7506
        },
        {
            "id": "hphhozl",
            "score": 1,
            "text": "Have watched this movie more than hundred times. And I still feel it's fresh everytime.",
            "title_similarity": "0.26344943",
            "sentiment_compound": 0.3182
        },
        {
            "id": "hphhufx",
            "score": 2,
            "text": "Hot take for the day, *No Country for Old Men* is boring and overrated. I’m sure this will go over well.",
            "title_similarity": "0.5552521",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hphhugk",
            "score": 1,
            "text": "Now i need to watch it",
            "title_similarity": "0.0669954",
            "sentiment_compound": 0.0
        },
        {
            "id": "hphi3ds",
            "score": 1,
            "text": "You know, psychologists had to make a choice.",
            "title_similarity": "0.28694123",
            "sentiment_compound": 0.0
        },
        {
            "id": "hphi3fa",
            "score": 1,
            "text": "And it was mostly the haircut.",
            "title_similarity": "0.15770388",
            "sentiment_compound": 0.0
        },
        {
            "id": "hphi557",
            "score": 1,
            "text": "I disagree about it being realistic. Anton would stand out too much IRL and would find himself caught pretty quickly, he doesn't have the subtly or self-awareness to get away with his behavior for very long, so in reality we do not encounter people like this, they're all in prison/mental asylums.\n\nThe most realistic psychopath is going to a less over-the-top Patrick Bateman type, who tries extremely hard to blend in and sell the idea that they're normal, but in private they're doing some fucked up shit. Hollywood, politics, wall street, and fortune 500 companies have lots of people like this because their mindset (that anything is permissible for personal gain) is rewarded in corporate america.",
            "title_similarity": "0.6556074",
            "sentiment_compound": -0.1158
        },
        {
            "id": "hphifhb",
            "score": 1,
            "text": "So, just like upper management!!!",
            "title_similarity": "0.18302588",
            "sentiment_compound": 0.5229
        },
        {
            "id": "hphijj9",
            "score": 3,
            "text": "I remember learning about this the last time this was posted on Reddit",
            "title_similarity": "0.31525832",
            "sentiment_compound": 0.0
        },
        {
            "id": "hphimqd",
            "score": 2,
            "text": "Choose:\n\n* Heads\n* Tails",
            "title_similarity": "0.11259201",
            "sentiment_compound": 0.0
        },
        {
            "id": "hphiqvh",
            "score": 2,
            "text": "The scene where he separated his principal of fate/game theory/universal chaos or whatever you want to call it from the humanity of the gas station attendant...that was truly psychopathic",
            "title_similarity": "0.563265",
            "sentiment_compound": -0.128
        },
        {
            "id": "hphizq6",
            "score": 1,
            "text": "Oh yeah. He’s fucking phenomenally psychotic. Love the ending. Is he out there?",
            "title_similarity": "0.53386223",
            "sentiment_compound": 0.7693
        },
        {
            "id": "hphjhwx",
            "score": 1,
            "text": "I said this 08 English 101 classes term paper and the teacher disagreed and gave me a C. Not exactly a psychopath but someone who greatly depicts evil.",
            "title_similarity": "0.6455424",
            "sentiment_compound": -0.8469
        },
        {
            "id": "hphjkws",
            "score": 1,
            "text": "I might have to rewatch this film.  I saw it in the theater and missed A LOT.  I didn’t even know that Brolin was dead in that one scene.  And when it ended I thought the projector broke.  Everyone says it was a masterpiece.  I don’t get it.",
            "title_similarity": "0.520381",
            "sentiment_compound": -0.6369
        },
        {
            "id": "hphjonk",
            "score": 1,
            "text": "I can’t watch him in any other movie role now. His performance was so incredible that he’s now that guy in every single movie. I can never forget.",
            "title_similarity": "0.45040166",
            "sentiment_compound": 0.1695
        },
        {
            "id": "hphjp8u",
            "score": 1,
            "text": "My wife is terrified of this movie, the lack of score throughout and Bardens casual take on killing along with his monotonous voice.\n\nWhen we can’t pick what to have for dinner I’ll say “Heads or tails” in the best voice for him I can do. She tells me to get out of the kitchen and she makes dinner haha",
            "title_similarity": "0.49277484",
            "sentiment_compound": -0.4019
        },
        {
            "id": "hphjth9",
            "score": 1,
            "text": "Takes one to play one!",
            "title_similarity": "0.12064333",
            "sentiment_compound": 0.4003
        },
        {
            "id": "hphk0id",
            "score": 1,
            "text": "They haven’t watched The Expanse",
            "title_similarity": "0.11359698",
            "sentiment_compound": 0.0
        },
        {
            "id": "hphk1va",
            "score": 1,
            "text": "I didn’t recall ever seeing him in a movie before so this was my first real introduction to him.  He fucking killed that performance and I knew I’d see him in more movies in the future.  Very talented guy.",
            "title_similarity": "0.58033425",
            "sentiment_compound": -0.296
        },
        {
            "id": "hphkdf6",
            "score": 1,
            "text": "Anton Chigurh was a local legend",
            "title_similarity": "0.38145322",
            "sentiment_compound": 0.0
        },
        {
            "id": "hphkegn",
            "score": 1,
            "text": "Hell yea he  was on point. U literally had no idea wtf he has gonna do, but he had a simple plan for just about every situation.",
            "title_similarity": "0.43616807",
            "sentiment_compound": -0.3322
        },
        {
            "id": "hphkfaz",
            "score": 1,
            "text": "If the rule you followed brought you to this, of what use was the rule?",
            "title_similarity": "0.206894",
            "sentiment_compound": 0.0
        },
        {
            "id": "hphkg82",
            "score": 2,
            "text": "Great performance, but can't hold a candle to nurse Ratched",
            "title_similarity": "0.46799046",
            "sentiment_compound": 0.3716
        },
        {
            "id": "hphki4e",
            "score": 2,
            "text": "I wonder if they had ever seen Jimmy Cagney as Cody Jarrett in 'White Heat'?",
            "title_similarity": "0.4554717",
            "sentiment_compound": 0.0
        },
        {
            "id": "hphkox7",
            "score": 1,
            "text": "I wonder how many movies they watch in order to make that distinction.",
            "title_similarity": "0.2768098",
            "sentiment_compound": 0.0
        },
        {
            "id": "hphkyfn",
            "score": 1,
            "text": "Always thought the haircut really added to the psycho look, so childlike.\n\nThinks that's maybe where they got Billy Bob's 'do in the series. Could be wrong though!",
            "title_similarity": "0.56777054",
            "sentiment_compound": -0.5255
        },
        {
            "id": "hphl338",
            "score": 2,
            "text": "Ive read all of cormac mccarthy’s writing and believe him to be a psycho.",
            "title_similarity": "0.6046109",
            "sentiment_compound": 0.0
        },
        {
            "id": "hphlilm",
            "score": 1,
            "text": "Scariest movie ever!!",
            "title_similarity": "0.4602819",
            "sentiment_compound": 0.0
        },
        {
            "id": "hphlorx",
            "score": 3,
            "text": "Berries and Cream looking ass haircut lmfao",
            "title_similarity": "0.3432901",
            "sentiment_compound": 0.0
        },
        {
            "id": "hphloyt",
            "score": 2,
            "text": "The look on his face when he strangles the policeman",
            "title_similarity": "0.45735657",
            "sentiment_compound": 0.0
        },
        {
            "id": "hphm0oy",
            "score": 2,
            "text": "reminded me how much i love this movie.....",
            "title_similarity": "0.30874863",
            "sentiment_compound": 0.6369
        },
        {
            "id": "hphm508",
            "score": 1,
            "text": "Scariest movie I had seen when I first saw it.",
            "title_similarity": "0.50732106",
            "sentiment_compound": 0.0
        },
        {
            "id": "hphmbeo",
            "score": 1,
            "text": "That movie scared the f*** out of me. Still remember the \"cattle thunker\".",
            "title_similarity": "0.52917176",
            "sentiment_compound": -0.4404
        },
        {
            "id": "hphmta2",
            "score": 3,
            "text": "Dude the whole shot of him in the gas station probing the dude behind the counter was chilling",
            "title_similarity": "0.5386603",
            "sentiment_compound": -0.0258
        },
        {
            "id": "hphmtri",
            "score": 3,
            "text": "He's the reason I'd refrain from picking up a bag of money. Rather stay poor.",
            "title_similarity": "0.38826042",
            "sentiment_compound": -0.4767
        },
        {
            "id": "hphnccd",
            "score": 2,
            "text": "What business is it of yours where I'm from, friendo?\n\nI thought the storekeeper in that scene did a terrific job too - as he slowly realizes that he is not dealing with a normal human being turning from affable to confused to terrified to pants shitting relief.",
            "title_similarity": "0.562055",
            "sentiment_compound": -0.4404
        },
        {
            "id": "hphnr3p",
            "score": 1,
            "text": "Call it.",
            "title_similarity": "-0.029920045",
            "sentiment_compound": 0.0
        },
        {
            "id": "hphnszg",
            "score": 2,
            "text": "Zero music in the whole movie. Rewatch it and remind yourself how good it is",
            "title_similarity": "0.5201209",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hphntyu",
            "score": 2,
            "text": "Difficult to watch but easily one of my most memorable films for its dialogue, tension, and flow",
            "title_similarity": "0.48177528",
            "sentiment_compound": -0.1531
        },
        {
            "id": "hpholxl",
            "score": 2,
            "text": "My friends uncle was the chicken farmer that gets murdered for his truck. I got his autograph one Christmas after the movie came out and told him that it’s cool to get killed in movies.",
            "title_similarity": "0.5939091",
            "sentiment_compound": -0.6705
        },
        {
            "id": "hphomja",
            "score": 3,
            "text": "Javier Bardem is the fucking man. If he was an American actor he’d be listed in the top 3 Hollywood’s best male performers list hands down.",
            "title_similarity": "0.6741786",
            "sentiment_compound": 0.7184
        },
        {
            "id": "hphooe9",
            "score": 2,
            "text": "real talk, i legit cannot finish this movie because of this performance. i cant handle it. that first scene still freaks me out, i get filled with a kind of raw and primal fear that is overwhelming. still never ween the whole movie, but maybe one day i’ll work up to it.",
            "title_similarity": "0.50952846",
            "sentiment_compound": -0.3182
        },
        {
            "id": "hphopfa",
            "score": 1,
            "text": "Don’t put that coin in your pocket, then It will just be another coin",
            "title_similarity": "0.26467383",
            "sentiment_compound": 0.0
        },
        {
            "id": "hphoppv",
            "score": 2,
            "text": "A hard luck dude finds enough money to start over. A certain individual with a weird haircut has other plans.",
            "title_similarity": "0.37083223",
            "sentiment_compound": 0.4588
        },
        {
            "id": "hphopy5",
            "score": 2,
            "text": "Clearly they haven't seen a Jerma stream",
            "title_similarity": "0.22467977",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hphoz48",
            "score": 3,
            "text": "This movie, Michael Clayton and There Will Be Blood all came out within earshot of one another. All basically flawless films, imo.",
            "title_similarity": "0.43924522",
            "sentiment_compound": 0.5106
        },
        {
            "id": "hphp1ph",
            "score": 1,
            "text": "I based one of my sims off of him when I first added the extreme violence mod",
            "title_similarity": "0.48937786",
            "sentiment_compound": -0.659
        },
        {
            "id": "hphpc0d",
            "score": 1,
            "text": "Darth Vader was always my all time favorite movie villain until I saw No Country for Old Men.",
            "title_similarity": "0.7060299",
            "sentiment_compound": -0.4215
        },
        {
            "id": "hphpeap",
            "score": 1,
            "text": "Shit i watched this last night. Tommy Lee Jones steals it for me.",
            "title_similarity": "0.47252694",
            "sentiment_compound": -0.7845
        },
        {
            "id": "hphpi2d",
            "score": 1,
            "text": "You have to call it.  I can’t call it for you.",
            "title_similarity": "0.15756594",
            "sentiment_compound": 0.0
        },
        {
            "id": "hphppzj",
            "score": 1,
            "text": "Great movie",
            "title_similarity": "0.2410164",
            "sentiment_compound": 0.6249
        },
        {
            "id": "hphpvqx",
            "score": 2,
            "text": "Of all the things he does in the movie, the thing that sticks out to me is how he randomly tries to kill that raven on the bridge. He had already laid a path of destruction, was on his way to do more killing, but saw an opportunity where nobody else was around and he could just get more killing in. Dude was machine. The fact that he was shooting a raven gave it even more impact. It was like death itself had to dodge him.",
            "title_similarity": "0.5548378",
            "sentiment_compound": -0.9323
        },
        {
            "id": "hphq1wj",
            "score": 1,
            "text": "How can he be bad munchin on those cashews.",
            "title_similarity": "0.40831733",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hphqbjn",
            "score": 1,
            "text": "And just like that I’ll be watching this movie tonight",
            "title_similarity": "0.24738438",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hphqv7n",
            "score": 1,
            "text": "What's this movie about?",
            "title_similarity": "0.23033914",
            "sentiment_compound": 0.0
        },
        {
            "id": "hphr57c",
            "score": 2,
            "text": "Also, best use of a bowl cut in film",
            "title_similarity": "0.40038416",
            "sentiment_compound": 0.4767
        },
        {
            "id": "hphr5fi",
            "score": 1,
            "text": "👀",
            "title_similarity": "-0.024049597",
            "sentiment_compound": 0.0
        },
        {
            "id": "hphrigx",
            "score": 1,
            "text": "saw this last night. Great performance and movie. also govt tracking my thoughts.",
            "title_similarity": "0.38417792",
            "sentiment_compound": 0.6249
        },
        {
            "id": "hphrjhg",
            "score": 1,
            "text": "What’s the most you ever lost on a coin toss?\n\nRunner up: “*cough* You married into it?”",
            "title_similarity": "0.49221906",
            "sentiment_compound": -0.4448
        },
        {
            "id": "hphrsqh",
            "score": 3,
            "text": "Did they never see “Celebrity Apprentice” or “Home Alone 2”?",
            "title_similarity": "0.40512538",
            "sentiment_compound": -0.25
        },
        {
            "id": "hphs3vf",
            "score": 2,
            "text": "Like they know anything. If we could get some independent group of psychopaths to chime in?",
            "title_similarity": "0.56264216",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hphs4yc",
            "score": 1,
            "text": "Agreed.",
            "title_similarity": "-0.04820323",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hphsjuh",
            "score": 2,
            "text": "The convenience store scene is my favorite of any scene in any movie.  I start the movie there at 20 minutes in.  I have the movie and watch it often.  He's crazy.",
            "title_similarity": "0.52829754",
            "sentiment_compound": 0.1531
        },
        {
            "id": "hphszqg",
            "score": 2,
            "text": "He was a scary fucking guy in that movie. Horrifying",
            "title_similarity": "0.54047716",
            "sentiment_compound": -0.7845
        },
        {
            "id": "hphto53",
            "score": 1,
            "text": "I loved this movie",
            "title_similarity": "0.25355494",
            "sentiment_compound": 0.5994
        },
        {
            "id": "hphtrdy",
            "score": 1,
            "text": "One of the best movies ever made. Especially on mushrooms.",
            "title_similarity": "0.5105088",
            "sentiment_compound": 0.6369
        },
        {
            "id": "hphtt9h",
            "score": 1,
            "text": "He did a really good job in that role. This is one of my favorite movies",
            "title_similarity": "0.4452474",
            "sentiment_compound": 0.7346
        },
        {
            "id": "hphucd0",
            "score": 3,
            "text": "… awarded Most Realistic Depiction of a Psychopath, presented by the National Association for the Advancement of Psychopaths.",
            "title_similarity": "0.71091646",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hphunmr",
            "score": 2,
            "text": "That was a scary portrayal. It's scarier to hear that psych specialists think it was realistic.",
            "title_similarity": "0.53859186",
            "sentiment_compound": -0.4939
        },
        {
            "id": "hphusu8",
            "score": 1,
            "text": "The scene that stuck out to me was Chigurh driving at nightime across a bridge and gleefully shooting at a murder of crows with a big smile on his face. His face looked demented AF and was a real window into his sadistic nature in that he's not just passively ruthless but actually relishes the evil he engages in.",
            "title_similarity": "0.5520339",
            "sentiment_compound": -0.787
        },
        {
            "id": "hphutt1",
            "score": 1,
            "text": "Just let me sit here awhile..",
            "title_similarity": "0.10219402",
            "sentiment_compound": 0.0
        },
        {
            "id": "hphuy24",
            "score": 1,
            "text": "He (quite literally) killed that shit.",
            "title_similarity": "0.3663678",
            "sentiment_compound": -0.8548
        },
        {
            "id": "hphv3o5",
            "score": 1,
            "text": "Agree! He was so in-character in that movie. Let’s just hope he wasn’t method-acting! 😂",
            "title_similarity": "0.5587306",
            "sentiment_compound": 0.8353
        },
        {
            "id": "hphvuk4",
            "score": 1,
            "text": "Kevin James did a bit on the gas station scene that is in my “we might get through  this pandemic after all” list:\n\nhttps://youtu.be/ANlMM0HQxC0",
            "title_similarity": "0.48632017",
            "sentiment_compound": 0.0
        },
        {
            "id": "hphw7tf",
            "score": 1,
            "text": "“Sir, is something… wrong?”\n\n*With what?*\n\n“With anything...”\n\n*Is there something wrong with anything? That’s what you’re asking me?*",
            "title_similarity": "0.24799728",
            "sentiment_compound": -0.6199
        },
        {
            "id": "hphxb2u",
            "score": 1,
            "text": "The scariest villain of any movie I’ve ever seen.",
            "title_similarity": "0.6012084",
            "sentiment_compound": -0.5574
        },
        {
            "id": "hphxgot",
            "score": 1,
            "text": "You’ve been watching some Emplemon haven’t you…",
            "title_similarity": "0.22380543",
            "sentiment_compound": 0.0
        },
        {
            "id": "hphxntm",
            "score": 1,
            "text": "I liked the encounter with the trailer park attendant when he was looking for Llewelyn Moss. She was not taking any crap from him",
            "title_similarity": "0.44478488",
            "sentiment_compound": 0.6103
        },
        {
            "id": "hphxucm",
            "score": 1,
            "text": "You like Javier Bardem's acting?\n\nName a movie he was in other than 'No Country'",
            "title_similarity": "0.5611966",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hphxw3v",
            "score": 1,
            "text": "Anton Chigurh is Randall Flagg.",
            "title_similarity": "0.27406615",
            "sentiment_compound": 0.0
        },
        {
            "id": "hphxwmt",
            "score": 2,
            "text": "I've never seen this movie.  Any good?",
            "title_similarity": "0.33502376",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hphyb74",
            "score": 1,
            "text": "“You need to call it. I can't call it for you. It wouldn't be fair.”",
            "title_similarity": "0.20337039",
            "sentiment_compound": 0.0
        },
        {
            "id": "hphyrcf",
            "score": 1,
            "text": "What about that redneck from Breaking Bad? He was stone cold.",
            "title_similarity": "0.62051964",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hphysh7",
            "score": 1,
            "text": "\"You choose the one right tool.\"",
            "title_similarity": "0.26818052",
            "sentiment_compound": 0.0
        },
        {
            "id": "hphywg2",
            "score": 1,
            "text": "He was pretty damn good in \"skyfall\" too!",
            "title_similarity": "0.3466363",
            "sentiment_compound": 0.5707
        },
        {
            "id": "hphyz22",
            "score": 1,
            "text": "While it was great, his depiction wasn’t based on anyone (afaik), so it isn’t realistic at all, rather, it’s completely fabricated. Still, loved it",
            "title_similarity": "0.49553248",
            "sentiment_compound": 0.8505
        },
        {
            "id": "hphzq4d",
            "score": 1,
            "text": "He almost never speak on the movie so yea that is it",
            "title_similarity": "0.3718559",
            "sentiment_compound": 0.0
        },
        {
            "id": "hphzqg9",
            "score": 1,
            "text": "I thought it was good.\n\nI also thought the guy form \"night crawler\" was brilliant too.\n\nHe uses facial expressions as \"camouflage\"",
            "title_similarity": "0.45556733",
            "sentiment_compound": 0.7717
        },
        {
            "id": "hphzt4n",
            "score": 1,
            "text": "i love him in that movie",
            "title_similarity": "0.34078616",
            "sentiment_compound": 0.6369
        },
        {
            "id": "hphzybu",
            "score": 1,
            "text": "That “lucky quarter” scene gives me chills when I think about it.",
            "title_similarity": "0.38862824",
            "sentiment_compound": 0.0
        },
        {
            "id": "hphzzoo",
            "score": 1,
            "text": "Phenomenal acting. Javier Bardem killed that role. Every time he's on the screen, the film turns into a horror. Also one of the best somber endings to a movie",
            "title_similarity": "0.70177484",
            "sentiment_compound": -0.7783
        },
        {
            "id": "hpi02z3",
            "score": 1,
            "text": "I thought the “friendo” scene at the market was brilliant. The owner (and audience) felt he was in some kind of mortal danger but could not exactly tell why.",
            "title_similarity": "0.51617545",
            "sentiment_compound": 0.0516
        },
        {
            "id": "hpi062i",
            "score": 1,
            "text": "I’m a psycho and I approve this title.",
            "title_similarity": "0.4784932",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpi0coy",
            "score": 1,
            "text": "Well that's fucking stupid because most psychopaths are functioning members of society that don't go around murdering.",
            "title_similarity": "0.604353",
            "sentiment_compound": 0.2141
        },
        {
            "id": "hpi0drv",
            "score": 1,
            "text": "i'm recovering from being in relationships with psychopaths and after watching the gas station scene... goddamn\n\nthe way he coldly pushes and manipulates the other man's emotions like surrounding him in a noose.\n\n\nthat mix of ice cold and provocative is definitely distinct.",
            "title_similarity": "0.6650618",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hpi0qbr",
            "score": 1,
            "text": "Eh he’s far closer to an autistic serial killer. We know so much more about “psychopaths” than we used to.",
            "title_similarity": "0.67401135",
            "sentiment_compound": -0.6486
        },
        {
            "id": "hpi0tky",
            "score": 1,
            "text": "Javier in most of his roles, becomes very disturbing. The scene with him facing James Bond in the chair, stroking his leg, is over the top creep.",
            "title_similarity": "0.54698825",
            "sentiment_compound": -0.4201
        },
        {
            "id": "hpi0w9o",
            "score": 1,
            "text": "I had a psychiatrist when I was a kid that looked EXACTLY like him. Dude disappeared and I can’t even find his office anymore in NYC.",
            "title_similarity": "0.53645",
            "sentiment_compound": 0.1531
        },
        {
            "id": "hpi0xo4",
            "score": 1,
            "text": "Heads or tails, call it",
            "title_similarity": "0.10423331",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpi10og",
            "score": 1,
            "text": "Yes, but this was before David Tennant played Kilgrave on Jessica Jones.",
            "title_similarity": "0.32877097",
            "sentiment_compound": 0.6059
        },
        {
            "id": "hpi14jl",
            "score": 2,
            "text": "He was amazing in that movie, but I'm surprised they consider him as a psychopath more than a sociopath.",
            "title_similarity": "0.66169566",
            "sentiment_compound": 0.5789
        },
        {
            "id": "hpi1uud",
            "score": 1,
            "text": "In my top ten!",
            "title_similarity": "0.17745951",
            "sentiment_compound": 0.2714
        },
        {
            "id": "hpi1wl9",
            "score": 1,
            "text": "Do you see me?",
            "title_similarity": "-0.030298311",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpi20jb",
            "score": 1,
            "text": "Sugar ?",
            "title_similarity": "0.09406831",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpi2n5m",
            "score": 1,
            "text": "I agree",
            "title_similarity": "-0.039181594",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hpi3022",
            "score": 1,
            "text": "Such a great character and excellent movie.\n\nEach of the 4 main/co actors play compelling rolls that are absolutely worth watching.   Woody Harrelson's performance is only slightly behind that of Bardem's, imo.",
            "title_similarity": "0.5875468",
            "sentiment_compound": 0.923
        },
        {
            "id": "hpi3kgn",
            "score": 1,
            "text": "One of the best performance by anybody on big-small screen.",
            "title_similarity": "0.38672233",
            "sentiment_compound": 0.6369
        },
        {
            "id": "hpi3p1u",
            "score": 1,
            "text": "He’s not your friendo",
            "title_similarity": "0.18379399",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpi3wlk",
            "score": 1,
            "text": "For anyone who hasnt seen Kevin James skit on [this](https://youtu.be/ANlMM0HQxC0) its well worth it.\n\nHis youtube channel is a goldmine!",
            "title_similarity": "0.51264805",
            "sentiment_compound": 0.5093
        },
        {
            "id": "hpi42zo",
            "score": 1,
            "text": "they fall down down down",
            "title_similarity": "0.08854455",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpi4pb2",
            "score": 1,
            "text": "He is a phenomenal actor",
            "title_similarity": "0.2973088",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpi4vmc",
            "score": 1,
            "text": "“I need you to step out car please, sir.”",
            "title_similarity": "0.24195558",
            "sentiment_compound": 0.3182
        },
        {
            "id": "hpi5305",
            "score": 1,
            "text": "I watched this B2b with there will be blood in theaters I came out not knowing how to feel but knowing I saw two amazing pieces of cinema",
            "title_similarity": "0.49981582",
            "sentiment_compound": 0.7351
        },
        {
            "id": "hpi53bn",
            "score": 4,
            "text": "This movie is great, watch it once a year. Pair it up with There Will Be Blood, 2 dope movies from the same year.",
            "title_similarity": "0.41168398",
            "sentiment_compound": 0.6249
        },
        {
            "id": "hpi59gg",
            "score": 2,
            "text": "He didn't do any creepy dances down stairs. I'm unconvinced.",
            "title_similarity": "0.36666358",
            "sentiment_compound": -0.3818
        },
        {
            "id": "hpi5btd",
            "score": 1,
            "text": "Did they watch every movie?",
            "title_similarity": "0.23207453",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpi5r98",
            "score": 1,
            "text": "Step 1, hire a psychopath.",
            "title_similarity": "0.5008348",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpi5vak",
            "score": 1,
            "text": "Maybe my favorite movie ever. His face when the cop stops struggling in the beginning of the movie is burned into my brain forever. The sigh of relief.",
            "title_similarity": "0.6708772",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hpi64ff",
            "score": 1,
            "text": "One of the best, for sure. I'm also particularly fond of Bale in American Psycho, Nicholson in The Shining & Hopkins in Silence of the Lambs.",
            "title_similarity": "0.5563382",
            "sentiment_compound": 0.8655
        },
        {
            "id": "hpi65ch",
            "score": 1,
            "text": "That character made me deeply uncomfortable.",
            "title_similarity": "0.25356603",
            "sentiment_compound": -0.4391
        },
        {
            "id": "hpi6jpp",
            "score": 2,
            "text": "The funny thing is, I feel like from a writing and directing standpoint, his character is mostly the result of a lack of characterization. Maybe too many movies that try to depict psychopaths give them too much characterization and instead should be treating that character like a void in the script.",
            "title_similarity": "0.6062799",
            "sentiment_compound": 0.6808
        },
        {
            "id": "hpi6zv1",
            "score": 2,
            "text": "“He does his job and he can sleep without any problems.In my practice I have met a few people like this,” he (Leistedt, the forensic psychiatrist) says. In particular, Chigurh reminds him of two real-life professional hit men who he interviewed. “They were like this: cold, smart, no guilt, no anxiety, no depression.” [source of the source](https://www.sciencenews.org/blog/gory-details/most-and-least-realistic-movie-psychopaths-ever)",
            "title_similarity": "0.79250836",
            "sentiment_compound": 0.8958
        },
        {
            "id": "hpi7bcq",
            "score": 3,
            "text": "I read that as \"an independent group of psychopaths\" and honestly, that makes it so much better.",
            "title_similarity": "0.6148722",
            "sentiment_compound": 0.7334
        },
        {
            "id": "hpi7bps",
            "score": 1,
            "text": "Bullshit.  People love being pandered to.  Watch the police interviews of actual psychopaths and they feel nothing like this romanticized character.  Great movie but people are so damn gullible when someone says something they want to hear.",
            "title_similarity": "0.6486203",
            "sentiment_compound": -0.7349
        },
        {
            "id": "hpi7zl9",
            "score": 1,
            "text": "hello carson. let's go to your room.",
            "title_similarity": "0.18308103",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpi80av",
            "score": 1,
            "text": "I am a 50 year old man and this movie still scares the fork out of me.",
            "title_similarity": "0.5207988",
            "sentiment_compound": -0.34
        },
        {
            "id": "hpi80r6",
            "score": 1,
            "text": "One of the most genius performances of all time. The man is a god.",
            "title_similarity": "0.4254619",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hpi8d49",
            "score": 1,
            "text": "This is one of my favorite movies of all time",
            "title_similarity": "0.4091406",
            "sentiment_compound": 0.4588
        },
        {
            "id": "hpi8hm8",
            "score": 1,
            "text": "The author, Cormac McCarthy, is so brilliant ,that if you love the movies , I highly recommend you read this books. He is my favorite!",
            "title_similarity": "0.51524866",
            "sentiment_compound": 0.9446
        },
        {
            "id": "hpi8qpv",
            "score": 2,
            "text": "Pretty sure most psychopaths aren't murderers",
            "title_similarity": "0.53594685",
            "sentiment_compound": 0.8483
        },
        {
            "id": "hpi8z9c",
            "score": 3,
            "text": "Anton kills or attempts to kill almost every person he shares a scene with. The guy at the store noticed where his plates were from, so that was enough to leave his faith up to a coin toss. The lady that didn’t want to tell him where Moss worked at, she was only spared because Anton heard someone in that back room, or else he would have definitely killed her. He even gave her that look of how incredibly lucky she was. The accountant he meets at the office after killing the man who hired the Mexicans, I want to think he let him live.",
            "title_similarity": "0.58021307",
            "sentiment_compound": -0.8363
        },
        {
            "id": "hpi8zkr",
            "score": 1,
            "text": "I went to a Halloween party once as Anton, no one knew who I was....\nDisappointing as he is still one of my favourite movie characters.",
            "title_similarity": "0.59007967",
            "sentiment_compound": -0.4019
        },
        {
            "id": "hpi967l",
            "score": 3,
            "text": "“What business is it of yours where I’m from?”",
            "title_similarity": "0.10889791",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpi9dsb",
            "score": 3,
            "text": "One of the most terrifying characters to ever be displayed in film. Genuinely had no idea what he was doing or what he wanted in any given scene.",
            "title_similarity": "0.5224755",
            "sentiment_compound": -0.7346
        },
        {
            "id": "hpi9hrh",
            "score": 2,
            "text": "I thought Jake Gyllenhal did a great job with it in Nightcrawler. Very off-setting.",
            "title_similarity": "0.5864519",
            "sentiment_compound": 0.6249
        },
        {
            "id": "hpi9o9o",
            "score": 1,
            "text": "I was way too young when I watched that movie to ever appreciate the details. Must rewatch.",
            "title_similarity": "0.39864856",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hpi9xl8",
            "score": 1,
            "text": "I know it's in the book as well but I never understood the significance of him missing the bird on the bridge....\n\nAnyone have any ideas about that?",
            "title_similarity": "0.40108812",
            "sentiment_compound": -0.5379
        },
        {
            "id": "hpiach2",
            "score": 1,
            "text": ". . . a well deserved recognition, but what about Dr. Lecter? 😈",
            "title_similarity": "0.4661411",
            "sentiment_compound": 0.6757
        },
        {
            "id": "hpiae45",
            "score": 1,
            "text": "I have an inner Anton! This was my favorite bad guy ever!",
            "title_similarity": "0.65488887",
            "sentiment_compound": -0.2695
        },
        {
            "id": "hpib9ku",
            "score": 1,
            "text": "Agree",
            "title_similarity": "-0.038042888",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hpiboip",
            "score": 1,
            "text": "He must truly be a psychopath considering his performance in Skyfall....",
            "title_similarity": "0.56483626",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hpibp0l",
            "score": 1,
            "text": "I can do nothin for ya son.",
            "title_similarity": "0.30638832",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpibss1",
            "score": 3,
            "text": "Keep that quarter. Don’t mix it up with the others in your pocket.",
            "title_similarity": "0.27045807",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpid4i0",
            "score": 1,
            "text": "I thought Mark Zuckerberg as himself in those hearings was the most realistic.",
            "title_similarity": "0.58307064",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpidw12",
            "score": 1,
            "text": "One of my favorite movies of all time",
            "title_similarity": "0.40113115",
            "sentiment_compound": 0.4588
        },
        {
            "id": "hpieddd",
            "score": 2,
            "text": "\"I ain't put nothing up.\"\n\"You've been putting it up your whole life you just didn't know it.\"",
            "title_similarity": "0.32566655",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpiefsz",
            "score": 1,
            "text": "One of my all-time favorite villains.",
            "title_similarity": "0.51793283",
            "sentiment_compound": -0.34
        },
        {
            "id": "hpiep5b",
            "score": 1,
            "text": "The ‘group’ consisted of one guy that watched them all and some others who weighed in on some.",
            "title_similarity": "0.2526027",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpieu16",
            "score": 1,
            "text": "One of my favourite movies purely based on his acting in this film, so cold",
            "title_similarity": "0.7062459",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpievi6",
            "score": 2,
            "text": "That coin flip scene>",
            "title_similarity": "0.16653548",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpifqgo",
            "score": 2,
            "text": "Lol just fyi, there's no such thing as \"most realistic depiction of a psychopath.\"",
            "title_similarity": "0.47843903",
            "sentiment_compound": 0.34
        },
        {
            "id": "hpifztm",
            "score": 2,
            "text": "TIL Javier Bradem is married to Penelope Cruz",
            "title_similarity": "0.26182872",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpig57m",
            "score": 2,
            "text": "He was a fucking bad ass in that movie!!!",
            "title_similarity": "0.4827698",
            "sentiment_compound": 0.7074
        },
        {
            "id": "hpig7uj",
            "score": 2,
            "text": "I was waiting for \"an independent group of psychopaths\"",
            "title_similarity": "0.5704417",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpighkl",
            "score": 2,
            "text": "Call it.",
            "title_similarity": "-0.029920045",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpigi24",
            "score": 1,
            "text": "Christian Bale as Patrick Bateman was pretty incredible as well",
            "title_similarity": "0.40563923",
            "sentiment_compound": 0.6786
        },
        {
            "id": "hpigjnj",
            "score": 3,
            "text": "The scene with him and the store attendant was amazing.",
            "title_similarity": "0.21209145",
            "sentiment_compound": 0.5859
        },
        {
            "id": "hpih37p",
            "score": 1,
            "text": "https://www.sciencenews.org/blog/gory-details/most-and-least-realistic-movie-psychopaths-ever",
            "title_similarity": "0.71532923",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpih8ab",
            "score": 1,
            "text": "Interestingly, an independent group of hair stylists voted the same way.",
            "title_similarity": "0.37553117",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hpihds8",
            "score": 2,
            "text": "Woody Harrelsons character said it best. Pure fuckin evil. Like michaels myers type",
            "title_similarity": "0.6235094",
            "sentiment_compound": 0.315
        },
        {
            "id": "hpihn8a",
            "score": 2,
            "text": "Definitely one of the creepiest and most memorable villains in recent times in film. Great character.",
            "title_similarity": "0.62794524",
            "sentiment_compound": 0.2782
        },
        {
            "id": "hpiht0m",
            "score": 2,
            "text": "Oh yeah, we make arbitrary life or death decisions at the drop of a hat. Or the flip of a coin. Call it, friendo.",
            "title_similarity": "0.40697283",
            "sentiment_compound": -0.5859
        },
        {
            "id": "hpii89p",
            "score": 2,
            "text": "I need to watch this again, only saw it once when it came out and I was pretty young and just remember at the end being like, wtf? Lol but now I have a better appreciation for story telling I think",
            "title_similarity": "0.35860768",
            "sentiment_compound": 0.8922
        },
        {
            "id": "hpiia1k",
            "score": 3,
            "text": "Little known fact: Anton had a wife named KimChee Chigurh",
            "title_similarity": "0.2794437",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpiiipm",
            "score": 1,
            "text": "I’ve suffered from mental illness before and totally get it.",
            "title_similarity": "0.47619545",
            "sentiment_compound": -0.7096
        },
        {
            "id": "hpiin3b",
            "score": 1,
            "text": "https://youtu.be/ANlMM0HQxC0",
            "title_similarity": "0.11407947",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpij46x",
            "score": 1,
            "text": "Link?",
            "title_similarity": "-0.036165625",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpijhov",
            "score": 2,
            "text": "Coin toss scene was amazing but this seen also gets me every time, [Anton Chigurh Vs. The Office Lady](https://m.youtube.com/watch?v=gpqSE6igjW8) She was giving him sass that caused my nervous laughter to kick in, she was in so much danger until that toilet flushed! I can’t watch the scene now without laughing.",
            "title_similarity": "0.491728",
            "sentiment_compound": -0.6126
        },
        {
            "id": "hpijjn4",
            "score": 1,
            "text": "“ACTIIIING!!!!” Michael Scott.",
            "title_similarity": "0.2563303",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpijqxf",
            "score": 2,
            "text": "I need you step outta the car, sir.",
            "title_similarity": "0.2137219",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpil02d",
            "score": 1,
            "text": "I love this movie.\nLove it.",
            "title_similarity": "0.25430417",
            "sentiment_compound": 0.8555
        },
        {
            "id": "hpila19",
            "score": 1,
            "text": "That’s a group of guys that has too much time on their hands",
            "title_similarity": "0.19301423",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpilnr7",
            "score": 2,
            "text": "Armie Hammer as the Winklevoss twins IMO",
            "title_similarity": "0.34235775",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpilzwe",
            "score": 1,
            "text": "You have to call it.",
            "title_similarity": "0.03749107",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpim324",
            "score": 1,
            "text": "The incapacity, or refusal, to connect person-to-person with the gas clerk even slightly, even for the ease of the conversation, feels revealing. It's as if he is so alien, or disgusted, that even coming to terms with such a person would be unthinkable. As well,\n\n\"I don't have some way to 'put it.' .. That's the way it is.\"\n\nThere's just no place for outside perspective or framing in his worldview at all.",
            "title_similarity": "0.45328987",
            "sentiment_compound": -0.3102
        },
        {
            "id": "hpimy26",
            "score": 3,
            "text": "Great movie. Great actors.",
            "title_similarity": "0.35884255",
            "sentiment_compound": 0.8481
        },
        {
            "id": "hpinjti",
            "score": 3,
            "text": "Javier is absolutely incredible in that movie but Tommy Lee is who makes the movie an all timer- for me anyway. The way his character speaks is almost mesmerizing. When he’s telling Carla Jean the story in the diner and says “…he still can’t pick up his right hand for his hat.” I don’t know why that scene has always stuck with me. Or at the end of the movie when he’s telling his wife about the second dream he had: \n\n“….and he had his blanket wrapped around him and his head down and when he rode past I seen he was carryin' fire in a horn the way people used to do and I could see the horn from the light inside of it. 'Bout the color of the moon. And in the dream I knew that he was goin' on ahead and he was fixin' to make a fire somewhere out there in all that dark and all that cold, and I knew that whenever I got there he would be there. And then I woke up.” \n\nHe’s just so damn good.",
            "title_similarity": "0.6157739",
            "sentiment_compound": 0.0337
        },
        {
            "id": "hpinu56",
            "score": 2,
            "text": "I always liked when he argued with the secretary, it seemed liked she had the upper hand on him.",
            "title_similarity": "0.4480963",
            "sentiment_compound": 0.743
        },
        {
            "id": "hpinund",
            "score": 2,
            "text": "The coin scene",
            "title_similarity": "0.056694373",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpio3op",
            "score": 1,
            "text": "So that means he executed Llewellyn's wife near the end of the movie? TIL.\n\nOh, and thanks to the silly Cormac McCarthy ideas of logic and physics, we have the preposterous idea of a \"shotgun silencer.\"",
            "title_similarity": "0.6397729",
            "sentiment_compound": 0.4588
        },
        {
            "id": "hpio5sr",
            "score": 1,
            "text": "Anton Chigur only existed in sheriffs imagination. All the murders were carried out either by the cartel, or Moss.",
            "title_similarity": "0.6063031",
            "sentiment_compound": -0.6124
        },
        {
            "id": "hpiobd7",
            "score": 2,
            "text": "Gotta admit that was a badass movie fr fr",
            "title_similarity": "0.39784342",
            "sentiment_compound": 0.4939
        },
        {
            "id": "hpiobz1",
            "score": 1,
            "text": "Just look at the damn thang!",
            "title_similarity": "0.3311242",
            "sentiment_compound": -0.4574
        },
        {
            "id": "hpioc02",
            "score": 1,
            "text": "so this guy and Joaquin phoenix are not the exact same person......",
            "title_similarity": "0.25385505",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpioj1u",
            "score": 2,
            "text": "I thought psychopath is a term that psychological professionals don’t use.",
            "title_similarity": "0.5224905",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpipbtv",
            "score": 2,
            "text": "He doesn’t blink when he shoots the guns",
            "title_similarity": "0.28875798",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpipt45",
            "score": 1,
            "text": "Shit I act like that everyday….in gta",
            "title_similarity": "0.21530941",
            "sentiment_compound": -0.2732
        },
        {
            "id": "hpipzic",
            "score": 2,
            "text": "That’s funny because I just listened to a FBI profiler discuss this character. He said it’s unlikely a psychopath like him would be a serial killer, he’d be more likely to be running a Fortune 500 company or something",
            "title_similarity": "0.676888",
            "sentiment_compound": 0.0258
        },
        {
            "id": "hpiqb6g",
            "score": 1,
            "text": "Not sure why I read “by an independent group of psychopaths” initially.",
            "title_similarity": "0.4889503",
            "sentiment_compound": -0.2411
        },
        {
            "id": "hpiqcmr",
            "score": 1,
            "text": "lol what?",
            "title_similarity": "-0.038897272",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hpiqiib",
            "score": 1,
            "text": "What the fk does til \n Mean",
            "title_similarity": "0.18039367",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpiqt34",
            "score": 1,
            "text": "this is old news.",
            "title_similarity": "0.18387711",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpiqvsm",
            "score": 2,
            "text": "Call it. 🪙",
            "title_similarity": "0.0063282736",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpiqxuv",
            "score": 1,
            "text": "Flip the coin",
            "title_similarity": "0.031489685",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpiqy0l",
            "score": 3,
            "text": "..but was he a Psychopath or did he just have principles?",
            "title_similarity": "0.4464661",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpir1ax",
            "score": 1,
            "text": ">[Yale](https://en.m.wikipedia.org/wiki/Yale) professor [Harold Bloom](https://en.m.wikipedia.org/wiki/Harold_Bloom) labelled Chigurh the main weakness of No Country for Old Men, saying \"has none of the legitimacy or grandeur that [Judge Holden](https://en.m.wikipedia.org/wiki/Judge_Holden) has.\"[[9]](https://en.m.wikipedia.org/wiki/Anton_Chigurh#cite_note-9)\n\nWhat worthless fucking criticism, both books are in no way comparable and i doubt McCarthy writes his books with trying to trump previous works of his in mind. Hell, No Country came out 30 years after Blood Meridian and even the prose reads completly different.",
            "title_similarity": "0.6536797",
            "sentiment_compound": -0.9531
        },
        {
            "id": "hpirrmo",
            "score": 1,
            "text": "That boom guy video from Kevin James is just hilarious in the convenience store scene",
            "title_similarity": "0.44188052",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hpiso8t",
            "score": 1,
            "text": "Wow! That's high praise.",
            "title_similarity": "0.07517105",
            "sentiment_compound": 0.8268
        },
        {
            "id": "hpiuqit",
            "score": 1,
            "text": "Thanks for sharing. This is why I spend time scrolling through Reddit at least once a day.",
            "title_similarity": "0.25758353",
            "sentiment_compound": 0.6908
        },
        {
            "id": "hpiuwcc",
            "score": 1,
            "text": "Chigurh should have gotten his own movie. He's a scary badass.",
            "title_similarity": "0.57567745",
            "sentiment_compound": -0.2023
        },
        {
            "id": "hpiuyw8",
            "score": 3,
            "text": "Chilling. His portrayal was remarkable.  Led me to believe that I had never truly committed to my profession.  This man ruled the movie beyond all of the incredible performances. This is a Top 3 movie for me from casting to production and through performances.  \n\nI am convinced by this movie that The Godfather will never be overtaken. This was the movie that came the closest.",
            "title_similarity": "0.64144933",
            "sentiment_compound": 0.5831
        },
        {
            "id": "hpiwcmc",
            "score": 2,
            "text": "You mean the nature of this conversation?",
            "title_similarity": "0.00053618476",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpixq4p",
            "score": 1,
            "text": "Truly one of the best antagonists in cinema. So complex, and deep, but they really trusted the audience to dig deeper into his character, instead of using forced back story, or explaining his motivations directly.\n\nWhat a character.",
            "title_similarity": "0.64568293",
            "sentiment_compound": 0.5089
        },
        {
            "id": "hpiy1rv",
            "score": 1,
            "text": "Wow. So not woody Harrelson in Venom Let There Be Carnage? Surprising",
            "title_similarity": "0.46811768",
            "sentiment_compound": 0.7096
        },
        {
            "id": "hpiytcm",
            "score": 2,
            "text": "God this movie is so brilliant. Only There Will Be Blood Rivals it….",
            "title_similarity": "0.49433744",
            "sentiment_compound": 0.7886
        },
        {
            "id": "hpizmfk",
            "score": 1,
            "text": "One of my favorite movies of all time. And the book is also really good too.",
            "title_similarity": "0.45999962",
            "sentiment_compound": 0.7346
        },
        {
            "id": "hpj03sc",
            "score": 1,
            "text": "As a non-native english speaker I have to thank this movie for teaching me the wonderful expression: [riding bitch](https://www.urbandictionary.com/define.php?term=riding%20bitch)",
            "title_similarity": "0.56180924",
            "sentiment_compound": 0.7351
        },
        {
            "id": "hpj05iy",
            "score": 1,
            "text": "Truly intriguing performance…I would compare to Heath Ledgers Joker. Top tier imo, definitely made me a fan of his acting.",
            "title_similarity": "0.5841637",
            "sentiment_compound": 0.8481
        },
        {
            "id": "hpj0chk",
            "score": 1,
            "text": "This performance was amazing.  Javier is my favorite actor.  One thing I loved about this role is how weird they made him look.  Normally, he's extremely handsome.",
            "title_similarity": "0.5838674",
            "sentiment_compound": 0.9259
        },
        {
            "id": "hpj1518",
            "score": 1,
            "text": "He's character absolutely frightened me. I would never watch that movie again.",
            "title_similarity": "0.47639948",
            "sentiment_compound": -0.4927
        },
        {
            "id": "hpj1iaq",
            "score": 1,
            "text": "And now he’s gonna be Ricky Ricardo I hope he brings a little Anton to that show like walks up to Fred and says do you consider your self a lucky man Fred?",
            "title_similarity": "0.52090627",
            "sentiment_compound": 0.802
        },
        {
            "id": "hpj1lfj",
            "score": 1,
            "text": "I can see this. Like the rest of the movie his character is delicately understated. His psychopathy/ sociopathy is more like a law of nature than something the character wears on his sleeve so the audience knows he’s sick. I love understated characters that make you know what they’re about without needing to paint it on the walls.",
            "title_similarity": "0.64613074",
            "sentiment_compound": 0.8209
        },
        {
            "id": "hpj1wuj",
            "score": 2,
            "text": "Psychopathic Neil Diamond!!!",
            "title_similarity": "0.423845",
            "sentiment_compound": 0.5067
        },
        {
            "id": "hpj2kad",
            "score": 1,
            "text": "Kinda dope considering he's not even real",
            "title_similarity": "0.293993",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpj3bet",
            "score": 1,
            "text": "Todd from breaking bad was good",
            "title_similarity": "0.4380879",
            "sentiment_compound": -0.1531
        },
        {
            "id": "hpj3msw",
            "score": 1,
            "text": "https://youtu.be/PPJ1zHNryJk",
            "title_similarity": "0.108031064",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpj3tb4",
            "score": 1,
            "text": "There’s also no music in this movie",
            "title_similarity": "0.29803205",
            "sentiment_compound": -0.296
        },
        {
            "id": "hpj4c4h",
            "score": 1,
            "text": "It's a cool anecdote, but I feel like the psychologists who participated in this vote were kind of callous too. Some guy comes into your office, and he's got an inherited disease which he has no control over, and you're like, \"You'll never guess who you remind me of! That movie murderer guy who creeps everyone out!\"",
            "title_similarity": "0.7125945",
            "sentiment_compound": -0.5624
        },
        {
            "id": "hpj4ufi",
            "score": 1,
            "text": "Writers are alway overlooked. The writer deserves more credit than the actor for this “portrayal”.  Without the script, he’s just a guy with a bad haircut and nothing to say.",
            "title_similarity": "0.58079904",
            "sentiment_compound": -0.1796
        },
        {
            "id": "hpj553g",
            "score": 1,
            "text": "I think I read somewhere that the same was said about Christian Bale in American Psycho.",
            "title_similarity": "0.48459145",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpj5pn0",
            "score": 1,
            "text": "*Heads or tails?*",
            "title_similarity": "0.1324305",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpj6j7l",
            "score": 2,
            "text": "What about Dennis Reynolds?",
            "title_similarity": "0.2107908",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpj6m9l",
            "score": 1,
            "text": "He really made that entire movie. What an act!",
            "title_similarity": "0.45004833",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpj7y6o",
            "score": 1,
            "text": "He's scary as fuck in this film. The film would not of been so good if it wasn't for his performance",
            "title_similarity": "0.55622447",
            "sentiment_compound": -0.4513
        },
        {
            "id": "hpj8yri",
            "score": 1,
            "text": "And he actually nailed Desi!",
            "title_similarity": "0.40973598",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpj9dyu",
            "score": 3,
            "text": "Chigurh is the first and only character I’ve seen demonstrate a personal belief in determinism. That they do not possess free will. He states that he and the coin got there the same way at the end of the movie. \n\nWhat I think is especially fascinating about this is, determinism may or may not be true, but your beliefs however you acquired them are not acausal. A person who believes in free will and non-determinism will behave differently than someone who doesn’t believe in free will like Chigurh. It’s just the first time I’ve seen a character believably not believe in their own free will. Intellectually I think free will is a confused set of contradictory desires many of which are not possible or consistent. However, in my everyday life I am free-willing myself around. It feels impossible not to believe in free will for practical non-intellectual purposes but Chigurh gives a convincing and terrifying case study of what that could possibly look like.",
            "title_similarity": "0.66676253",
            "sentiment_compound": 0.9781
        },
        {
            "id": "hpj9xn1",
            "score": 3,
            "text": "I gotta watch this movie again. I watched it when I was young and didn’t have a brain yet. All I remember is his haircut and the silenced shotgun. I’m trying to think of other really well done psychos in movies.. Just watched tenet for the first time yesterday and I thought the actor who played Andrei Sator did an amazing job.",
            "title_similarity": "0.6498933",
            "sentiment_compound": 0.8221
        },
        {
            "id": "hpja959",
            "score": 1,
            "text": "You would be crazy to think otherwise.",
            "title_similarity": "0.23874792",
            "sentiment_compound": -0.34
        },
        {
            "id": "hpjahfd",
            "score": 2,
            "text": "That isn't Dennis Reynolds",
            "title_similarity": "0.12450227",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpjbf9y",
            "score": 1,
            "text": "Been known that since they posted it back in 2016",
            "title_similarity": "0.18821988",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpjc22o",
            "score": 1,
            "text": "I always interpreted Anton's killings of the 2 guys that went with him to the drug deal aftermath as nothing more than him removing unnecessary tools for the job. Thats the reason he gave to the accountant for killing the guy that hired him. But the deputy killing was satisfying for him. So he is not just a psychopath, but one that may have different motives and reasons for each person he kills and not just one easily profiled motive for all his victims.",
            "title_similarity": "0.6345787",
            "sentiment_compound": -0.9572
        },
        {
            "id": "hpjc3sn",
            "score": 1,
            "text": "Redo this test with nightcrawler in the mix.",
            "title_similarity": "0.44274715",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpjc7e3",
            "score": 1,
            "text": "Its a very chilling performance. Bravo.",
            "title_similarity": "0.39531446",
            "sentiment_compound": -0.101
        },
        {
            "id": "hpjcj51",
            "score": 1,
            "text": "That hypnotizing stare before the captive pin penetrated the skulls of upright citizens, that was a strong performance.",
            "title_similarity": "0.58262295",
            "sentiment_compound": 0.5106
        },
        {
            "id": "hpjczkn",
            "score": 1,
            "text": "the gas station scene was amazing",
            "title_similarity": "0.2902587",
            "sentiment_compound": 0.5859
        },
        {
            "id": "hpjdix7",
            "score": 1,
            "text": "This movie is one the greats!",
            "title_similarity": "0.31426832",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpje07k",
            "score": 2,
            "text": "What's the most u ever lost in a coin toss?",
            "title_similarity": "0.4266802",
            "sentiment_compound": -0.3744
        },
        {
            "id": "hpjepjh",
            "score": 1,
            "text": "For me its most prevalent in his overt need to prove that he cannot be beaten... It's never just a job it's like a treasure hunt where he will stop at nothing and causalities along the way are just minor inconvenience",
            "title_similarity": "0.48996103",
            "sentiment_compound": 0.3252
        },
        {
            "id": "hpjetoi",
            "score": 1,
            "text": "Anyone have a list of any of the other contenders?",
            "title_similarity": "0.12349939",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpjf8h7",
            "score": 2,
            "text": "Saw an explanation on YouTube, where guy proved, that Anton was a fictional character, just a description of a theoretical killer from sheriff. Hold it in your mind while next watching and you'll see",
            "title_similarity": "0.66897815",
            "sentiment_compound": -0.6486
        },
        {
            "id": "hpjfwpo",
            "score": 1,
            "text": "He really brought a new dimension to villain characters tbf",
            "title_similarity": "0.44768322",
            "sentiment_compound": -0.5574
        },
        {
            "id": "hpjg67p",
            "score": 3,
            "text": "Oh man, it wasn’t Leto in Suicide Squad??…",
            "title_similarity": "0.49055737",
            "sentiment_compound": -0.7059
        },
        {
            "id": "hpjgbqk",
            "score": 1,
            "text": "Ya. The pure dissociation with morals and chaos was perfect. He literally didn’t care. You could kill him, too, and it wouldn’t matter.  Such an amazing and scary character.",
            "title_similarity": "0.61626786",
            "sentiment_compound": -0.2023
        },
        {
            "id": "hpjgo8s",
            "score": 2,
            "text": "Oh he's an actor? I thought they got an irl psychopath",
            "title_similarity": "0.56666166",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpjh1ue",
            "score": 1,
            "text": "You are so charming, my old baby！！！",
            "title_similarity": "0.3014927",
            "sentiment_compound": 0.7065
        },
        {
            "id": "hpjhj83",
            "score": 1,
            "text": "Yes.",
            "title_similarity": "-0.06781742",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hpjhwyx",
            "score": 1,
            "text": "I’m sure he’s so flattered.  What about de niro in taxi driver?  Woody barrels on in natural born killer?  Wayne knight in Seinfeld?",
            "title_similarity": "0.5683298",
            "sentiment_compound": 0.4466
        },
        {
            "id": "hpjhyrc",
            "score": 2,
            "text": "Based entirely on his haircut",
            "title_similarity": "0.2764087",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpjigby",
            "score": 2,
            "text": "Love his performance as Felix in Collateral, too:\n\n\"Now, if I am being Santa Claus, and you are Pedro, how do you think jolly Santa Claus would feel if one day Pedro came into his office and said, 'I lost the list.' How fucking furious do you think he will get?\"",
            "title_similarity": "0.5813599",
            "sentiment_compound": 0.2975
        },
        {
            "id": "hpjix80",
            "score": 1,
            "text": "The scene where he cleans a gunshot wound in the bath was confirmed as \"how it should be done\" by an a&e nurse.",
            "title_similarity": "0.44763947",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpjjefj",
            "score": 1,
            "text": "No offence but sociopaths aren't as interesting, or violent, as Anton tbh. He was \"the bubonic plague\" in a bad haircut",
            "title_similarity": "0.58209705",
            "sentiment_compound": -0.9266
        },
        {
            "id": "hpjjif0",
            "score": 1,
            "text": "Friendo.",
            "title_similarity": "0.10454783",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpjk10h",
            "score": 3,
            "text": "Who else read the subject as referencing an “independent group of psychopaths”?",
            "title_similarity": "0.5730885",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpjkdb9",
            "score": 3,
            "text": "Up there with Wes Chatham's Amos from *The Expanse*",
            "title_similarity": "0.24404106",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpjle58",
            "score": 1,
            "text": "Everyone kept raving about this movie whose plot looked boring to me. \"You should see it! It's great!\"\n\nIt was years later I finally got around to it.\n\nYeah, now comes the obligatory \"Damn, I wish I had seen it sooner.\"\n\nThis movie is a damn near masterpiece of suspension, and reminds me of how John Carpenter and Steven Spielberg used the setting to promote the drama than the character itself.\n\nBardem's performance is hauntingly awesome and is absolutely worth the watch.\n\nHe deserved every award for this performance, including the Oscar.\n\nThough, I think it's stupid it was for supporting actor. He is the star of the movie, and I doubt many will disagree.",
            "title_similarity": "0.6804917",
            "sentiment_compound": 0.9297
        },
        {
            "id": "hpjm4iz",
            "score": 1,
            "text": "“Step out of the car, sir” that smile he does is sooo creepy lol",
            "title_similarity": "0.43252683",
            "sentiment_compound": 0.6486
        },
        {
            "id": "hpjmg2g",
            "score": 2,
            "text": "Wouldn’t you need psychiatric doctors to confirm this poll not psychologists",
            "title_similarity": "0.56247705",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpjnxy7",
            "score": 2,
            "text": "I love the scene in the gas station with the coin toss. Gave me shivers when I first watched it, saying it's been travelling all these years to get to you. Scary shit.  \n\nHe's just so out of it and has absolutely no regard for life.",
            "title_similarity": "0.59775853",
            "sentiment_compound": -0.624
        },
        {
            "id": "hpjo84g",
            "score": 1,
            "text": "He's fucking terrifying",
            "title_similarity": "0.2817876",
            "sentiment_compound": -0.6115
        },
        {
            "id": "hpjoyr5",
            "score": 1,
            "text": "Ya this was an actual terrifying character.",
            "title_similarity": "0.38005817",
            "sentiment_compound": -0.5719
        },
        {
            "id": "hpjpjmu",
            "score": 1,
            "text": "To me, it’s the calm, the absolute still water smooth calm at the most inappropriate time. Add a little mismatched upper/lower face, and a voice pattern/tone that feels AI-ish. Brilliant … had to be some method.",
            "title_similarity": "0.4459858",
            "sentiment_compound": 0.8126
        },
        {
            "id": "hpjqyi9",
            "score": 1,
            "text": "That role was fricken AWESOME!!! He was so fricken creepy.  I think one just as good was Ted Levine as buffalo bill.  He was so creepy in that movie silence of the lambs.  The next movie I saw him in was flubber, with robin williams. I recognized the voice, but he was in a Disney movie!",
            "title_similarity": "0.63912255",
            "sentiment_compound": 0.7214
        },
        {
            "id": "hpjr7if",
            "score": 1,
            "text": "He was decent in Bond.   But he cracks me up in this movie.   \n\nCan you see me?  😂",
            "title_similarity": "0.56966966",
            "sentiment_compound": 0.5927
        },
        {
            "id": "hpjrn8s",
            "score": 1,
            "text": "\"...If the Road you followed, brought you to This, of what use was the Road?\"\n\n\nActors/Actresses don't generally impress me.  It does not strike me as a tough occupation.  I had never had the single bit of interest in acting but I wish I did - I think it would be pretty damn easy and I could be pretty decent at it.\n\nHaving said that - every once in a while I am impressed.  Recently the entire cast of \"Vikings\" - pretty much all the men and women - impress me very much.  Timothée Chalamet put on a master class in \"The King\" ... but Javier Bardem was outstanding as Anton Chigurh.  Outstanding.\n\n\"Do you have any idea how crazy you are?\" === \"You mean the Nature of This Conversation??!\"",
            "title_similarity": "0.60066485",
            "sentiment_compound": 0.99
        },
        {
            "id": "hpjs0ox",
            "score": 1,
            "text": "He is extremely unsettling in that movie, you never know what he’s gonna do.",
            "title_similarity": "0.4342526",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpjsmru",
            "score": 4,
            "text": "Two things after spending like 20 minutes reading the comments in this post.\n\n1) Some of you should be movie/book critics.\n2) I need to watch NCFOM again tomorrow",
            "title_similarity": "0.39326632",
            "sentiment_compound": 0.0772
        },
        {
            "id": "hpjv64s",
            "score": 1,
            "text": "That's crazy",
            "title_similarity": "0.0619202",
            "sentiment_compound": -0.34
        },
        {
            "id": "hpjwmvn",
            "score": 1,
            "text": "What about that Japanese movie about a serial killer (forgot the title), where in the final scene, they want to throw his ashes (well, actually, bones) into the see, but the camera freezes when the bone is still mid-air? That guy was creepy too...",
            "title_similarity": "0.60289264",
            "sentiment_compound": -0.2732
        },
        {
            "id": "hpjwrf5",
            "score": 3,
            "text": "He did an amazing job in this role. As good as Raoul Silva in 007.",
            "title_similarity": "0.46138078",
            "sentiment_compound": 0.7717
        },
        {
            "id": "hpjzot5",
            "score": 1,
            "text": "Call it!",
            "title_similarity": "-0.025669962",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpk0a64",
            "score": 2,
            "text": "Indeed. He played his role near perfection - creepy, fascinating and realistic.",
            "title_similarity": "0.49688214",
            "sentiment_compound": 0.8625
        },
        {
            "id": "hpk452q",
            "score": 2,
            "text": "“Look at that fuuuckin’ bone.”",
            "title_similarity": "0.27800146",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpk97eo",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.0698901"
        },
        {
            "id": "hpk99xn",
            "score": 1,
            "text": "I am convinced. He was terrifying.",
            "title_similarity": "0.3413914",
            "sentiment_compound": -0.25
        },
        {
            "id": "hpk9asj",
            "score": 1,
            "text": "\"How much money have you ever lost in a coin toss?\"",
            "title_similarity": "0.28979334",
            "sentiment_compound": -0.3182
        },
        {
            "id": "hpknprb",
            "score": 4,
            "text": "Well just look at the haircut",
            "title_similarity": "0.1336354",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hpllbnq",
            "score": 3,
            "text": "I think there's a couple of good portrayals in The Sopranos, Tony being the most realistic.  It even delves into his therapy over multiple years and shows how he subtly uses what he learns in therapy to manipulate and destroy people.  Love No Country for Old Men, but Chiguhr is a bit too close to the impossible white man trope (but as a villain) to be realistic.",
            "title_similarity": "0.76701796",
            "sentiment_compound": -0.6369
        },
        {
            "id": "hplomaa",
            "score": 1,
            "text": "I found the pig scene in ‘Spirited Away’ more disturbing than him",
            "title_similarity": "0.36214396",
            "sentiment_compound": -0.5563
        },
        {
            "id": "hpn9y71",
            "score": 2,
            "text": "I find this hard to believe.\n\nThere's a variety of different manifestations of  a psychopathic personality disorder, as there are five common types.\n\nIf we're going to diagnose Anton from his behavior on film, he's certainly an antisocial personality with psychopathic tendencies. Since he doesn't say or do much in the film, he's a cardboard cutout symbol of \"evil\".\n\nAs there are numerous films since the 40's that contain superior depictions of psychopaths, Anton is a poor choice.",
            "title_similarity": "0.64067686",
            "sentiment_compound": -0.7003
        },
        {
            "id": "hppbr28",
            "score": 1,
            "text": "There's a shit storm a comin Rand, HEADS OR TAILS?",
            "title_similarity": "0.3132094",
            "sentiment_compound": -0.5574
        },
        {
            "id": "hpuwmuq",
            "score": 1,
            "text": "I heard a story that Javier said that the director was crazy for auditioning him because Javier was very anti-violence personally. The director's response was \"Don't you think I knew that already?\"",
            "title_similarity": "0.6197544",
            "sentiment_compound": -0.34
        },
        {
            "id": "hpy5lqr",
            "score": 2,
            "text": "His coin flip gets me every time poor gas attendant did not know how lucky he was",
            "title_similarity": "0.48651206",
            "sentiment_compound": -0.6632
        },
        {
            "id": "hq4wk7q",
            "score": 2,
            "text": "It's him... It's the man from my nightmares..",
            "title_similarity": "0.52410305",
            "sentiment_compound": 0.0
        },
        {
            "id": "hq6vlyx",
            "score": 2,
            "text": "Also one of the most boring and overrated movie I've seen. Never understood the hype. Down vote away. Just my opinion.",
            "title_similarity": "0.5476748",
            "sentiment_compound": -0.3804
        },
        {
            "id": "hqduig0",
            "score": 2,
            "text": "I just watched him play Desi Arnaz in, \"Being The Ricardos\". Another terrific performance!",
            "title_similarity": "0.5161051",
            "sentiment_compound": 0.6996
        },
        {
            "id": "hrnxu3e",
            "score": 1,
            "text": "Yeah honestly it's rather offensive to me how psychopaths are portrayed in media. They get so much wrong it's insane.",
            "title_similarity": "0.4396507",
            "sentiment_compound": -0.5965
        },
        {
            "id": "hro12qj",
            "score": 1,
            "text": "I read: by an independent group of psychopaths",
            "title_similarity": "0.5580712",
            "sentiment_compound": 0.0
        },
        {
            "id": "hrpyjqw",
            "score": 1,
            "text": "https://tegr.am/+ZFRnItoS3MdjM2Vh",
            "title_similarity": "0.21977177",
            "sentiment_compound": 0.0
        },
        {
            "id": "hrqrder",
            "score": 1,
            "text": "A great scene to demonstrate this, which can be subtle at first, is the night time scene where he is investigating the scene of the deal gone wrong with the two suits. If you pay attention to his lines, you’ll notice he only speaks to them when he needs something from them. The two guys are trying to banter and chit chat, make jokes etc. Anton only says things like “got a flashlight?” “Got a screwdriver?” “Hold this”, etc. and then to top it all off he kills them",
            "title_similarity": "0.6306139",
            "sentiment_compound": 0.4137
        },
        {
            "id": "hrr2en1",
            "score": 1,
            "text": "When he killed woody it was straight up to the point look him in the eyes no warning cold blooded craziness",
            "title_similarity": "0.5569429",
            "sentiment_compound": -0.6327
        },
        {
            "id": "hryvbuk",
            "score": 1,
            "text": "He was also a kidnapper in Benidorm.",
            "title_similarity": "0.3198361",
            "sentiment_compound": 0.0
        },
        {
            "id": "hs7qhni",
            "score": 2,
            "text": "Exactly *blink*\nCountry in the world?",
            "title_similarity": "0.102806605",
            "sentiment_compound": 0.0
        },
        {
            "id": "hs7se4d",
            "score": 2,
            "text": "[removed]",
            "title_similarity": "0.0698901"
        },
        {
            "id": "hship4i",
            "score": 2,
            "text": "Watched that movie recently \n\nCormac's greatest contribution to cinema",
            "title_similarity": "0.489483",
            "sentiment_compound": 0.6369
        },
        {
            "id": "hsmbgkg",
            "score": 1,
            "text": "So true",
            "title_similarity": "-0.0038592853",
            "sentiment_compound": 0.4754
        },
        {
            "id": "hsr24l2",
            "score": 1,
            "text": "The cartoonishly evil murderous villain accurately represents all people with a serious neurological disorder? Ok",
            "title_similarity": "0.6588648",
            "sentiment_compound": -0.9325
        },
        {
            "id": "hsz92g5",
            "score": 1,
            "text": "Bruh",
            "title_similarity": "0.028957795",
            "sentiment_compound": 0.0
        },
        {
            "id": "ht0jlwt",
            "score": 1,
            "text": "Yes, you see there are ZILLIONS of people who call themselves \"ACTORS\"  in our great Country, especially California.\nTHING is, then there are TRULY TALENTED, WORTHY OF THE TITLE \"ACTOR,\" ACTUALLY STILL WORKING and getting better and better every year.\nWatch carefully, you can always tell the difference between TALENT and luck. The latter FADES FAST WITH TIME.",
            "title_similarity": "0.4651759",
            "sentiment_compound": 0.9848
        },
        {
            "id": "htaldjq",
            "score": 1,
            "text": "Heads? Or tails?",
            "title_similarity": "0.09919922",
            "sentiment_compound": 0.0
        },
        {
            "id": "htdshik",
            "score": 2,
            "text": "Personally, I really didn’t care for the movie. But I loved the power of his performance. I was disturbed and uncomfortable, which I know was precisely the point. It’s chilling for the reality in the depiction.",
            "title_similarity": "0.5517826",
            "sentiment_compound": 0.1628
        },
        {
            "id": "htg6fx2",
            "score": 1,
            "text": "Thanks friendo",
            "title_similarity": "0.108893774",
            "sentiment_compound": 0.4404
        },
        {
            "id": "i1bqpj0",
            "score": 1,
            "text": "He was really scary in that.",
            "title_similarity": "0.2892469",
            "sentiment_compound": -0.5413
        }
    ]
}