{
    "TIL during the 2014 Winter Olympics in Sochi, Russians made a small \"mouse\" hole into a secure anti-doping lab and exchanged \"clean\" urine samples for those showing their athletes' PED use. Over 100 dirty samples were smuggled out by a Russian agent pretending to be a sewer engineer.\n": [
        {
            "id": "hwe6yln",
            "score": 0,
            "text": "The Russians are manipulating and interfering with elections all over the world, they are taking the world to the brink of WWIII, and they are routine cheaters in the Olympics, yet I almost got banned from a different sub for saying that Russians generally suck.",
            "title_similarity": "0.685911",
            "sentiment_compound": -0.8756
        },
        {
            "id": "hwd9uqb",
            "score": 2,
            "text": "This must be fake. Russians would have used a bear.",
            "title_similarity": "0.43511742",
            "sentiment_compound": -0.4767
        },
        {
            "id": "hwe0rqj",
            "score": 3,
            "text": "Russia has never accomplished anything without cheating or stealing",
            "title_similarity": "0.43266475",
            "sentiment_compound": 0.5448
        },
        {
            "id": "hwe3ely",
            "score": -4,
            "text": "[deleted]",
            "title_similarity": "-0.05756315"
        },
        {
            "id": "hwdl4u0",
            "score": 1,
            "text": "What's with Russian athletes and seemingly not being able to help themselves with cheating in what feels like every olympics?",
            "title_similarity": "0.6109643",
            "sentiment_compound": 0.1531
        },
        {
            "id": "hwdawr6",
            "score": 3,
            "text": "Plot twist: he was only stealing it to drink",
            "title_similarity": "0.3592834",
            "sentiment_compound": -0.5719
        },
        {
            "id": "hwdwn8l",
            "score": 0,
            "text": "can you imagine if the Russian people finally found self-determination and threw off the yoke of Vladimir Putin.\n\nthey could actually use their vast intelligence to make the world a better place instead of cheating at the Olympics and threatening their neighbors.",
            "title_similarity": "0.64323264",
            "sentiment_compound": -0.25
        },
        {
            "id": "hwecwm3",
            "score": 1,
            "text": "What is it with Russians and constantly cheating at sport, or stealing/hacking in general? Is it part of their culture or something? It happens over and over and over again.\n\nAnd yes, I know, not exclusive to Russia/Russians, but it does seem to come up quite often with them.",
            "title_similarity": "0.57082176",
            "sentiment_compound": -0.2488
        },
        {
            "id": "hwdsqiv",
            "score": 0,
            "text": "the russians ALWAYS DOPE. always. they just don't care. they get caught, they find another way. it's like a challenge or something.",
            "title_similarity": "0.49031478",
            "sentiment_compound": 0.0444
        },
        {
            "id": "hwedlvu",
            "score": 1,
            "text": "Proof?",
            "title_similarity": "-0.14454146",
            "sentiment_compound": 0.0
        },
        {
            "id": "hwehrw1",
            "score": 1,
            "text": "Russians being Russians. Leading the world by being the reason why policies and regulations are written. Yet they demand respect and puff up around Ukraine until their whining is heard. What a weak country with such great potential.",
            "title_similarity": "0.57500196",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hwgj4as",
            "score": 1,
            "text": "Why is Russia included in anything at this point.",
            "title_similarity": "0.28154314",
            "sentiment_compound": 0.0
        },
        {
            "id": "hwdnhxh",
            "score": 0,
            "text": "I cannot wrap my head around why Russia cares SO MUCH about winning.   \nThe world is not the same as it once was, and it feels like we all just want to see the winners - the country is almost a second thought!   \nWhy is their ego THIS damaged, I do not understand!   \nIf this is stupid someone please explain LOL",
            "title_similarity": "0.4760893",
            "sentiment_compound": 0.9164
        },
        {
            "id": "hwdnlfq",
            "score": -1,
            "text": "I cannot wrap my head around why they care SO MUCH about winning.   \nThe world is not the same as it once was, and it feels like we all just want to see the winners - the country is almost a second thought!   \nWhy is their ego THIS damaged, I do not understand!",
            "title_similarity": "0.36619464",
            "sentiment_compound": 0.8918
        },
        {
            "id": "hwdr0mj",
            "score": 0,
            "text": "They should just make two divisions, PED and PED-Free. We all know lots of athletes dope, we know all bodybuilders that reach the absolute highest levels dope (don't even try to argue that, none are natty). There have been enough \"scandals\" that involved the majority of players in a competition, doping is an open secret.\n\nJust make PED division and let the roid monsters duke it out, and let those who want to stay natural stay natural.",
            "title_similarity": "0.5934408",
            "sentiment_compound": -0.0516
        },
        {
            "id": "hwecoq7",
            "score": -1,
            "text": "Why do I smell fake news",
            "title_similarity": "0.27318376",
            "sentiment_compound": -0.4767
        },
        {
            "id": "hwee2nm",
            "score": 2,
            "text": "Russia continues to be pathetically pathetic - they can seemingly never accomplish anything without some cheating, scamming, lying or bullying.\n \nTheir (Putin and the Oligarchs) desire - and their cheating ways - to \"be number 1\" is sad.",
            "title_similarity": "0.52649444",
            "sentiment_compound": -0.951
        },
        {
            "id": "hwdwvxq",
            "score": 1,
            "text": "If you have ever played any game with Russians, online games especially, cheating is part of the game to them in most cases. To me that isn't fun, but apparently it is fine by them.",
            "title_similarity": "0.6018883",
            "sentiment_compound": -0.1021
        },
        {
            "id": "hwdz94e",
            "score": 0,
            "text": "Why is Russia so shitty? Not the normal citizens obviously. But damn. It’s every time!",
            "title_similarity": "0.44584835",
            "sentiment_compound": -0.7684
        },
        {
            "id": "hwe3zcc",
            "score": 0,
            "text": "Ban the Fucking Russians.",
            "title_similarity": "0.2719705",
            "sentiment_compound": -0.5574
        },
        {
            "id": "hwdvu8u",
            "score": 0,
            "text": "Thanks Joe rogan",
            "title_similarity": "-0.056293886",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hwe1arb",
            "score": 0,
            "text": "Can't believe there are people who still believe the Russians will do the right thing ever",
            "title_similarity": "0.36545599",
            "sentiment_compound": 0.0
        },
        {
            "id": "hwe5rfh",
            "score": 0,
            "text": "Best to keep the Russians out of the olympics for the foreseeable future",
            "title_similarity": "0.39071232",
            "sentiment_compound": 0.6369
        },
        {
            "id": "hwe7opp",
            "score": 0,
            "text": "And now a 15 year old Russia athlete is found to be doping.  They as a country should be banned.",
            "title_similarity": "0.58592844",
            "sentiment_compound": -0.4588
        },
        {
            "id": "hwe9aee",
            "score": 0,
            "text": "this story is crazy. if this is what they'll do for the olympics imagine what else they do. It must be a terrifying time to be a Ukrainian citizen",
            "title_similarity": "0.5023431",
            "sentiment_compound": -0.7269
        },
        {
            "id": "hwefeud",
            "score": 0,
            "text": "[deleted]",
            "title_similarity": "-0.05756315"
        },
        {
            "id": "hwep4qe",
            "score": 0,
            "text": "Just ban the country for good already. Why ffo they feel the need to cheet so much?",
            "title_similarity": "0.37642235",
            "sentiment_compound": -0.1779
        },
        {
            "id": "hwf1qln",
            "score": 0,
            "text": "Why haven’t they just kicked Russia out of the Olympics entirely? It doesn’t seem like they’re going to stop cheating so why allow them to continue to taint the games?",
            "title_similarity": "0.58297664",
            "sentiment_compound": -0.3573
        },
        {
            "id": "hwf4fhv",
            "score": 0,
            "text": "I heard about this way back in the day from that racist alt right nut Joe Rogan back in the day before he turned.",
            "title_similarity": "0.45850262",
            "sentiment_compound": -0.6124
        },
        {
            "id": "hwdkq4u",
            "score": 3,
            "text": "This is so pathetic.\n\nLike what happens if your country sweeps the Olympics?  You get bragging rights.  It's not like other countries have to cede territory to you.",
            "title_similarity": "0.534073",
            "sentiment_compound": -0.6215
        },
        {
            "id": "hwdc6hl",
            "score": 7,
            "text": "This is why Russia is no longer allowed at the olympics as a nation.",
            "title_similarity": "0.54952323",
            "sentiment_compound": -0.296
        },
        {
            "id": "hwdm6j8",
            "score": -5,
            "text": "Children will be children 🙄",
            "title_similarity": "-0.04943919",
            "sentiment_compound": 0.0
        },
        {
            "id": "hwdbn8l",
            "score": -62,
            "text": "That's the kind of behavior that communism breeds -- wholesale fraud at all levels.",
            "title_similarity": "0.45945603",
            "sentiment_compound": -0.5859
        },
        {
            "id": "hwe0ppp",
            "score": 5,
            "text": "Ah, Reddit's daily dose of war propaganda. I give zeros fucks on this.",
            "title_similarity": "0.44693995",
            "sentiment_compound": -0.8402
        },
        {
            "id": "hwdmynw",
            "score": -11,
            "text": "Not all heroes wear capes\n\nI'm unabashedly pro doping. \"All drug Olympics\" FTW.",
            "title_similarity": "0.5396984",
            "sentiment_compound": 0.2572
        },
        {
            "id": "hwdr1yh",
            "score": 11,
            "text": "And this is why I stopped GAF about the Olympics; Russia is some how still allowed to send athletes, who continue to dope, athletes get to pick and choose who they compete for (Eileen Gu was born, raised, and lives in California but competed for China. . . That’s not suspicious), the coverage sucks, and not even the truely best athletes compete in the big sports (I.e. NHL Players are not playing in the Men’s Hockey and the Men’s Basketball also tends to lack the star power it had before when it used to be stacked with all the NBA stars), then there is the corruption within the IOC",
            "title_similarity": "0.649238",
            "sentiment_compound": 0.2328
        },
        {
            "id": "hwdk6jn",
            "score": 1,
            "text": "There is a Netflix documentary on it, something with Ikarus, if I recall myself correctly. Very interesting!",
            "title_similarity": "0.29818693",
            "sentiment_compound": 0.5081
        },
        {
            "id": "hwed31s",
            "score": -3,
            "text": "[deleted]",
            "title_similarity": "-0.05756315"
        },
        {
            "id": "hwdua18",
            "score": 9,
            "text": "The russians have been doping in every single olympics event. Can't understand why they haven't been permabanned from everything after being so untrustworthy liars.",
            "title_similarity": "0.70502603",
            "sentiment_compound": -0.5688
        },
        {
            "id": "hwdidb9",
            "score": 47,
            "text": "I wouldn't be surprised if the Chinese aren't doing the same right now.",
            "title_similarity": "0.221712",
            "sentiment_compound": -0.1695
        },
        {
            "id": "hwdt8pm",
            "score": 1,
            "text": "Watch Icarus on Netflix. You get the full extent of the operation.",
            "title_similarity": "0.4250856",
            "sentiment_compound": 0.0
        },
        {
            "id": "hwdz597",
            "score": 1,
            "text": "Gotta give it to Russia, they consistently prove that they can't be trusted. No peacocking just straight corruption",
            "title_similarity": "0.50812143",
            "sentiment_compound": 0.0603
        },
        {
            "id": "hwe3uic",
            "score": 1,
            "text": "As the old saying goes.  \"If you ain't cheating, you ain't trying'",
            "title_similarity": "0.078831",
            "sentiment_compound": 0.4449
        },
        {
            "id": "hwe91b2",
            "score": 1,
            "text": "I like the world just humors Russia and China like children when it comes this stuff lmao. Sports, video games...they cheat, we all know they're cheating before we even start, we fake clap when they \"win\", then we talk about who really won. And I just don't get why. They make themselves look incompetent. Do they *want* us to think Russian athletes are pathetic? That they literally can't compete with the rest of us? I didn't think that, should I??\n\nI mean I'm absolutely laughing my ass off at the thought of sneaking clean piss in through a fake mouse hole to play a game. Someone came up with that, some adult person, who was in charge of an entire countries image on the world stage, came up with doping and slipping piss through a fake mouse hole, and it was presumably done to make the country look \"better\". \n\nGuys...if you're that bad just don't play. You think you'll be embarrassed by losing but this shit is WAY more embarrassing.",
            "title_similarity": "0.59383714",
            "sentiment_compound": -0.9469
        },
        {
            "id": "hweblet",
            "score": 1,
            "text": "Soviets in the 20th century \"We will go toe to toe with the combined spy agencies of the West and even get double agents into some of their highest intelligence positions.\"\n\nRussians in the 21st century \"We will get caught smuggling pee in our own back yard\"",
            "title_similarity": "0.7654847",
            "sentiment_compound": 0.0
        },
        {
            "id": "hwev9uj",
            "score": 1,
            "text": "Cheating to win... Russian and Republican playbook, got it.",
            "title_similarity": "0.45279938",
            "sentiment_compound": 0.0516
        },
        {
            "id": "hwdig93",
            "score": 3,
            "text": "Interesting, the ingenuity and dedication that people can direct towards criminality and thievery. \n\nI really thought about ‘organised crime’ the other day and how it’s exactly that - organised, planned and strategised as a business. I guess I was aware of it before but that whole business with olive oil and the agrimafia just made me think about it a bit more. \n\nA friend of mine used to have this view about petty criminals who operate at night, as well.  And would say, that they think of the burglaries and robberies as their job. So they sleep during the day to prepare for the night. They’re wide awake at night and clear thinking, so while the rest of us are sleeping, they are ready to start the night.",
            "title_similarity": "0.54988253",
            "sentiment_compound": 0.7662
        },
        {
            "id": "hwe1ul8",
            "score": 12,
            "text": "Russia just got busted cheating AGAIN yesterday...even when they were already banned from competing under their own flag.\n\nThey just cant help themselves and should be perma banned from ever competing even under a different name.",
            "title_similarity": "0.59859914",
            "sentiment_compound": -0.897
        },
        {
            "id": "hwdonqb",
            "score": -2,
            "text": "“Must…win…medals!! Whatever it takes.” -Russia’s motto",
            "title_similarity": "0.3534121",
            "sentiment_compound": 0.0
        },
        {
            "id": "hwdq1qc",
            "score": 2,
            "text": "And yet they're still allowed to compete.",
            "title_similarity": "-0.043352474",
            "sentiment_compound": 0.0
        },
        {
            "id": "hwds1h7",
            "score": 3,
            "text": "Imagine the lengths they'll go to to own a POTUS. Oh, right...",
            "title_similarity": "0.10698581",
            "sentiment_compound": 0.0
        },
        {
            "id": "hwe0vkz",
            "score": -2,
            "text": "[removed]",
            "title_similarity": "-0.111661725"
        },
        {
            "id": "hwed77m",
            "score": 2,
            "text": "I was at Pyeongchang 2018 and watched curling and there was a Russian mixed team of Alexander Krushelnitskiy and Anastasia Bryzgalova and they won a Bronze Medal. I turned to my friends and said \"at least it's a clean win as surely they won't be doping in curling\". \n\nLater they were caught for doping and stripped of the medal. https://www.npr.org/sections/thetorch/2018/02/22/587849425/russian-curler-stripped-of-olympic-bronze-after-hes-found-guilty-of-doping?t=1644517281476",
            "title_similarity": "0.7296075",
            "sentiment_compound": 0.9698
        },
        {
            "id": "hwei9vt",
            "score": -1,
            "text": "I love the little slap on the wrist the IOC gave Russia for this. Fuck the IOC, fuck Russia. They're all corrupt assholes in their international circlejerk\n\nThe real losers in all of this are the athletes who work their asses off only to have their cocky dictator ruin their lifelong goals for an inflated fake Olympics",
            "title_similarity": "0.650089",
            "sentiment_compound": -0.9566
        },
        {
            "id": "hwer64g",
            "score": -3,
            "text": "I’m just gonna say it, but that move was dope as fuck.",
            "title_similarity": "0.1824308",
            "sentiment_compound": -0.6956
        },
        {
            "id": "hwf4sw1",
            "score": -2,
            "text": "TIL why conservatives are so much in love with Russia. Inferior athletes? Just cheat. Inferior numbers?  Just cheat. If you ain’t cheating you ain’t trying.",
            "title_similarity": "0.5213967",
            "sentiment_compound": -0.8719
        },
        {
            "id": "hwdji8y",
            "score": 29,
            "text": "Nothing sounds more insecure than trying to force wins at some made up sports contest with no real meaning.",
            "title_similarity": "0.37485993",
            "sentiment_compound": 0.6185
        },
        {
            "id": "hwdsll2",
            "score": 17,
            "text": "I mean, if you have to cheat to win, and it's known you're cheating, did you really win?  The prestige?  Doped athletes are usually pariahs within their sport - look at Lance Armstrong or Barry Bonds.",
            "title_similarity": "0.45065507",
            "sentiment_compound": 0.3925
        },
        {
            "id": "hwdss49",
            "score": -3,
            "text": "Link to report is broken, and there is no statistical validation of the report.\n\nTake this with a huge grain of salt.",
            "title_similarity": "0.3499908",
            "sentiment_compound": -0.4588
        },
        {
            "id": "hwe58z0",
            "score": 3,
            "text": "Congrats OP you watched a documentary on Netflix. Harvest them internet points.",
            "title_similarity": "0.4109568",
            "sentiment_compound": 0.5267
        },
        {
            "id": "hwedyar",
            "score": -5,
            "text": "If they need to cheat it shows how weak and pathetic they must be. Embarrassing. Beta males and females obviously. Otherwise why bother?",
            "title_similarity": "0.38242948",
            "sentiment_compound": -0.9274
        },
        {
            "id": "hweghga",
            "score": -3,
            "text": "Russians are such great people.",
            "title_similarity": "0.18190576",
            "sentiment_compound": 0.6249
        },
        {
            "id": "hwgt60o",
            "score": 2,
            "text": "Russia and China have killed the Olympics and sporting integrity.",
            "title_similarity": "0.5262825",
            "sentiment_compound": -0.4404
        },
        {
            "id": "hwdotdh",
            "score": -11,
            "text": "Someone has been listening to Joe Rogan",
            "title_similarity": "-0.00051085",
            "sentiment_compound": 0.0
        },
        {
            "id": "hwdj9zf",
            "score": 0,
            "text": "Wow everything is rigged and pay to play 21CE 3M",
            "title_similarity": "0.3124593",
            "sentiment_compound": 0.5106
        },
        {
            "id": "hwdl6fs",
            "score": 0,
            "text": "Wasn’t this in the news like 3 days after the Winter Olympics in Russia?",
            "title_similarity": "0.4752014",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hwdma11",
            "score": 0,
            "text": "and they still didnt win lmao",
            "title_similarity": "0.0024286732",
            "sentiment_compound": -0.7366
        },
        {
            "id": "hwdmgyz",
            "score": 0,
            "text": "Olympics, how to bribe a international committee to look the other way at human rights violations to lay bribes on everyone in control while first world countries try new techniques to cheat while the world ignores shit like the plastic garbage patch, missing airliners, and dictators annexing other countries. Olympics is a human punchline. Olympics are synonymous with bribes, poor planning, poor execution, stadium requirements and the worst construction possible for venues that are used ONCE. Hahahahaha waste fraud and abuse games.",
            "title_similarity": "0.6684779",
            "sentiment_compound": -0.9869
        },
        {
            "id": "hwdoui6",
            "score": 0,
            "text": "My wife said “Wow so much work, couldn’t they have just picked better athletes?” \n\nlol",
            "title_similarity": "0.36592957",
            "sentiment_compound": 0.6908
        },
        {
            "id": "hwdoymi",
            "score": 0,
            "text": "And that's definitely not happening at the genocide Olympics",
            "title_similarity": "0.27868524",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hwdsaiz",
            "score": 0,
            "text": "Is this ICARUS movie all about. I actually want to watch. Could someone please suggest?",
            "title_similarity": "0.29400688",
            "sentiment_compound": 0.3818
        },
        {
            "id": "hwdu2ob",
            "score": 0,
            "text": "Icarus was one of the best documentaries I’ve ever seen",
            "title_similarity": "0.22071551",
            "sentiment_compound": 0.6369
        },
        {
            "id": "hwdufta",
            "score": 0,
            "text": "The fact Russia still participates as the ROC shows the Olympics is a fucking joke. Oh also the fact China is hosting it this year... Pathetic.",
            "title_similarity": "0.5407861",
            "sentiment_compound": -0.2975
        },
        {
            "id": "hwdug87",
            "score": 0,
            "text": "Such **bullshit** that Russia is allowed to compete under the \"ROC\" banner.",
            "title_similarity": "0.45809364",
            "sentiment_compound": -0.5859
        },
        {
            "id": "hwduk91",
            "score": 0,
            "text": "Imagine being a KGB spetzna secret service guy in Russia and your big mission is to help doping in some dumb sports .",
            "title_similarity": "0.79788554",
            "sentiment_compound": -0.1531
        },
        {
            "id": "hwdun91",
            "score": 0,
            "text": "Yes the movie Icarus has been out for a while",
            "title_similarity": "0.109249055",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hwdupj1",
            "score": 0,
            "text": "I'm shocked & from a nation with soooo few contributions to mankind who only steal from others. Shocked I say!",
            "title_similarity": "0.39604503",
            "sentiment_compound": -0.7959
        },
        {
            "id": "hwduqsj",
            "score": 0,
            "text": "Check out Icarus, an oscar-winning documentary about Russian doping. I've never seen a film go more sideways than this thing. The filmmaker starts out with a premise and the next thing you know he's dealing with issues on an international level including these 2014 Sochi games.",
            "title_similarity": "0.70967823",
            "sentiment_compound": 0.0
        },
        {
            "id": "hwduz0v",
            "score": 0,
            "text": "What a crock\n\nIf you play cards with someone or a group of someones there is NO PLACE were even a little cheating is acceptable.\n\nTo cheat is admitting you can't compete honestly or fairly.",
            "title_similarity": "0.36017326",
            "sentiment_compound": -0.8065
        },
        {
            "id": "hwdv9ae",
            "score": 0,
            "text": "Icarus is a great film",
            "title_similarity": "0.12599814",
            "sentiment_compound": 0.6249
        },
        {
            "id": "hwdv9dv",
            "score": 0,
            "text": "watch movie [Ikarus](https://www.netflix.com/us/title/80168079?s=i&trkid=13747225&vlang=en&clip=80208678) to get to know the story better) to know better about putins ugly way of setting that olympics fckry. thanks to that russia is disqualified and uses shameful ROC and all medals they won, they will have to leave behind. BOYCOT OLYMPICS IN DICTATORSHIPS. it’s just ridiculous and reminds 1938",
            "title_similarity": "0.64524543",
            "sentiment_compound": 0.1027
        },
        {
            "id": "hwdvphr",
            "score": 0,
            "text": "How is that country allowed to complete",
            "title_similarity": "0.029236766",
            "sentiment_compound": 0.0
        },
        {
            "id": "hwdw099",
            "score": 0,
            "text": "At this point they just need to be banned from all sports Summer or Winter and then maybe they’ll change their acts. This is disgusting and so unfair for other athletes",
            "title_similarity": "0.44274062",
            "sentiment_compound": -0.8687
        },
        {
            "id": "hwdw23s",
            "score": 0,
            "text": "The russians are dirty fucks just like the chinese this year",
            "title_similarity": "0.5008016",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hwdwipb",
            "score": 0,
            "text": "Is there a competition for doping? I feel like russians would finally win something fair and square",
            "title_similarity": "0.51692283",
            "sentiment_compound": 0.8225
        },
        {
            "id": "hwdwj7h",
            "score": 0,
            "text": "Make PEDs legal already",
            "title_similarity": "0.080431566",
            "sentiment_compound": 0.128
        },
        {
            "id": "hwdwww8",
            "score": 0,
            "text": "Yes there is a great documentary on the doping issue in the Olympics.\n\nEdit, looks like a Russian must not have liked my comment.",
            "title_similarity": "0.6860415",
            "sentiment_compound": 0.7887
        },
        {
            "id": "hwdx21e",
            "score": 0,
            "text": "This definitely going to be downloaded but Joe Rogan has an awesome interview with the journalist behind this discovery",
            "title_similarity": "0.29620466",
            "sentiment_compound": 0.8176
        },
        {
            "id": "hwdxee0",
            "score": 0,
            "text": "Doping is a Russian event at this point might as well award medals for it",
            "title_similarity": "0.5169544",
            "sentiment_compound": 0.6808
        },
        {
            "id": "hwdxjjl",
            "score": 0,
            "text": "Is it really winning if you cheat? Apparently, Russia thinks it is.",
            "title_similarity": "0.35060802",
            "sentiment_compound": 0.1761
        },
        {
            "id": "hwdxltz",
            "score": 0,
            "text": "Russians just can’t live by the rules can they?",
            "title_similarity": "0.337812",
            "sentiment_compound": 0.0
        },
        {
            "id": "hwdxqq9",
            "score": 0,
            "text": "Can someone tell me what's the end goal with this countries that want theis athletes to succeed so bad that they cheat?\n\nIs it something about morale of their citizens? Like I can't think about someone so nationalist that they boast their own country on the basis of Olympics success lol",
            "title_similarity": "0.52967155",
            "sentiment_compound": 0.6563
        },
        {
            "id": "hwdxvqs",
            "score": 0,
            "text": "Between this and fixing the figure skating scores and so many other stories, who know why viewership is down and trust in Russia is pitiful.",
            "title_similarity": "0.56558454",
            "sentiment_compound": 0.0258
        },
        {
            "id": "hwdxz93",
            "score": 0,
            "text": "Love that the samples were in \"tamper proof\" vials but were found to have marks and scratches as if they'd been levered open with a tool.",
            "title_similarity": "0.53351545",
            "sentiment_compound": 0.3818
        },
        {
            "id": "hwdy3ry",
            "score": 0,
            "text": "and russian athletes are still welcome at international competition, showing international sport is basically for sale",
            "title_similarity": "0.39962125",
            "sentiment_compound": 0.4588
        },
        {
            "id": "hwdy95s",
            "score": 0,
            "text": "First time watching Icarus?",
            "title_similarity": "0.23624125",
            "sentiment_compound": 0.0
        },
        {
            "id": "hwdyfer",
            "score": 0,
            "text": "The Olympics are such a stupid joke.",
            "title_similarity": "0.3529158",
            "sentiment_compound": -0.296
        },
        {
            "id": "hwdyijo",
            "score": 0,
            "text": "They really should just ban Russia for the next couple Olympics. Have them miss 2 of each.",
            "title_similarity": "0.5204623",
            "sentiment_compound": -0.6666
        },
        {
            "id": "hwdyjsp",
            "score": 0,
            "text": "God can Russia do fucking anything without cheating or playing dirty? As a country their primary exports are sabotage and disinformation.",
            "title_similarity": "0.5883324",
            "sentiment_compound": -0.3827
        },
        {
            "id": "hwdykkj",
            "score": 0,
            "text": "If you want to know more was ICARUS it’s a good documentary about this",
            "title_similarity": "0.22589773",
            "sentiment_compound": 0.4939
        },
        {
            "id": "hwdyr3x",
            "score": 0,
            "text": "More dirty shit from the all time dirty POS …. Putin. Just like Trump…. I mean Lord Dampnut, all shit flows downhill.",
            "title_similarity": "0.49407458",
            "sentiment_compound": -0.9016
        },
        {
            "id": "hwdyv8p",
            "score": 0,
            "text": "The Russian doctor who exposed it now has a permanent security detail. He’s (allegedly) a high value target on par with Sergei Skripal.",
            "title_similarity": "0.552039",
            "sentiment_compound": 0.5423
        },
        {
            "id": "hwdyykz",
            "score": 0,
            "text": "Just watch the sports documentary, Icarus, it goes into some of the details regarding this post, I believe. It’s also a great documentary.",
            "title_similarity": "0.37977037",
            "sentiment_compound": 0.6249
        },
        {
            "id": "hwdyzs2",
            "score": 0,
            "text": "the ICARUS documentary on netflix goes over this in great detail...highly recommend",
            "title_similarity": "0.36611107",
            "sentiment_compound": 0.765
        },
        {
            "id": "hwdyzvf",
            "score": 0,
            "text": "I think the Olympics should just permanently disinvite nations caught cheating on a systemic scale. The Olympics are a sham all the way through and its shocking to me that they have any viewership at all.",
            "title_similarity": "0.55305916",
            "sentiment_compound": -0.743
        },
        {
            "id": "hwdz7s4",
            "score": 0,
            "text": "If this really been done as an organised scam by Russian authorities, Russia should be banned maybe 10-15 years from the Olympic. Good things is they could invent better scamming techniques in this time.",
            "title_similarity": "0.638813",
            "sentiment_compound": -0.2263
        },
        {
            "id": "hwdzgzu",
            "score": 0,
            "text": "Why are any Russian athletes even allowed to compete!?! I feel like I'm taking crazy pills! WTF!",
            "title_similarity": "0.55052763",
            "sentiment_compound": -0.765
        },
        {
            "id": "hwdzter",
            "score": 0,
            "text": "Gotta give it to them.\n  \n\n  \n  \n\n  \n  \n\n  \n  \n\n\n\n  \n  \n  \n  \n\n  \n  \n  \nThe clean urine samples that is.",
            "title_similarity": "0.26237017",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hwdzyh6",
            "score": 0,
            "text": "We dream of being Olympic gold medal winners...but it seems there's only one in their field in the world. I'm happy for them, and can't even fathom the 10+, 20+,30+ years focus, agonizing trainings sacrificed. Then I feel even more \"what-if\" pride and teary smiles for the 2nd place. Let's not even discuss the 3rd place...",
            "title_similarity": "0.48447186",
            "sentiment_compound": 0.8714
        },
        {
            "id": "hwdzzk1",
            "score": 0,
            "text": "Russia sucks",
            "title_similarity": "0.21887302",
            "sentiment_compound": -0.3612
        },
        {
            "id": "hwe0d39",
            "score": 0,
            "text": "Watch the movie Icarus on Netflix by Bryan Fogel.",
            "title_similarity": "0.38795167",
            "sentiment_compound": 0.0
        },
        {
            "id": "hwe0e3v",
            "score": 0,
            "text": "Those sneaky bastards.",
            "title_similarity": "0.11832295",
            "sentiment_compound": -0.7096
        },
        {
            "id": "hwe0jxi",
            "score": 0,
            "text": "The hiding of the samples was necessary because every one of Russia's atheletes was doping.",
            "title_similarity": "0.65515614",
            "sentiment_compound": -0.296
        },
        {
            "id": "hwe0n81",
            "score": 0,
            "text": "Yeah, fuck Russian (and Chinese) Olympic Committee",
            "title_similarity": "0.46546227",
            "sentiment_compound": -0.3182
        },
        {
            "id": "hwe1lfx",
            "score": 0,
            "text": "Why does any government care about Olympic wins?  It's not like multi billion dollar corporations are somehow swayed to do more business in another country because that country had some recent gold medalists.\n\nBy early 2010s, not many gives two shits about Olympic, younger generation may find the Olympic to be the broadcast's nail in the coffin since they don't like forced programming, much less forced programming of the same event for this long.\n\nGreat on the athletes, but from a circus and bread point of view, we all have access to much more entertaining circuses in our hands.",
            "title_similarity": "0.5222937",
            "sentiment_compound": 0.7915
        },
        {
            "id": "hwe22zc",
            "score": 0,
            "text": "Waiting to see how teams do on the endurance cross country skiing and biathlon events.   If a team outperforms, compared especially to Norway, like Russia did at Sochi, then you know something is up.  Looking at you, China, and of course, you, ROC.",
            "title_similarity": "0.5489704",
            "sentiment_compound": 0.4144
        },
        {
            "id": "hwe2mxb",
            "score": 0,
            "text": "I want to know where the Russians got that many “clean” samples.",
            "title_similarity": "0.62574446",
            "sentiment_compound": 0.0772
        },
        {
            "id": "hwe2ykt",
            "score": 0,
            "text": "Literal glory hole",
            "title_similarity": "-0.08861561",
            "sentiment_compound": 0.5423
        },
        {
            "id": "hwe2zj3",
            "score": 0,
            "text": "I feel shocked.",
            "title_similarity": "-0.09907575",
            "sentiment_compound": -0.3182
        },
        {
            "id": "hwe2zv9",
            "score": 0,
            "text": "Icaures does a great job showing this.",
            "title_similarity": "-0.029285358",
            "sentiment_compound": 0.6249
        },
        {
            "id": "hwe30e7",
            "score": 0,
            "text": "lol just on Rogan.",
            "title_similarity": "-0.05911856",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hwe3838",
            "score": 0,
            "text": "no yeh, they just paid a sewer engineer some under the table cash to siphon some locals piss to shoot up cuz they go hard in russia. lol. gotta think through the pipe dream.",
            "title_similarity": "0.7542211",
            "sentiment_compound": -0.4404
        },
        {
            "id": "hwe39uq",
            "score": 0,
            "text": "you know what, just can the olypmics at this point. it has no value whatsoever at this point.",
            "title_similarity": "0.11915336",
            "sentiment_compound": -0.2584
        },
        {
            "id": "hwe3fuw",
            "score": 0,
            "text": "Why are any Russians even allowed in the Olympics. Get rid of the ROC as well. Just stop allowing Russians to compete in the Olympics. Period.",
            "title_similarity": "0.56029356",
            "sentiment_compound": -0.0258
        },
        {
            "id": "hwe3gtm",
            "score": 0,
            "text": "And the top female figure skater in the world who is supposed to be experiencing her highest moment just tested positive for a banned substance. ROC athletes are a disgrace.",
            "title_similarity": "0.5348873",
            "sentiment_compound": -0.2023
        },
        {
            "id": "hwe3u4c",
            "score": 0,
            "text": "Is the arm of the American Right Wing taking notes?  Ted Cruz?  Tucker Carlson?",
            "title_similarity": "0.3017472",
            "sentiment_compound": 0.0
        },
        {
            "id": "hwe3vi9",
            "score": 0,
            "text": "I don't trust Russian government at all.\n\nI watched Roger Clemens, MLB pitcher, have one of the best seasons of his career, at age 36.    PED's we found out a few years later.\n\nI watch Ovetchkin,(a big supporter of Putin), having one of the best years of his career playing in the NHL, at age 36, after 18 seasons of hard play,  makes me think he's juiced up just on my past experience with Russian athletes. What he's doing has never been done before, by any player at his age. \n\nSorry...it's Russia.",
            "title_similarity": "0.62812716",
            "sentiment_compound": 0.8909
        },
        {
            "id": "hwe48pm",
            "score": 0,
            "text": "Why is Russia always up to something",
            "title_similarity": "0.2491011",
            "sentiment_compound": 0.0
        },
        {
            "id": "hwe4k4w",
            "score": 0,
            "text": "Russia, China… same sh1t, same cheaters and copy cats. They run out of ideas to show their supremacy and skills.",
            "title_similarity": "0.6154419",
            "sentiment_compound": -0.4019
        },
        {
            "id": "hwe52b9",
            "score": 0,
            "text": "I legitimately cannot imagine being so insecure that you would go to such lengths just to win at some sports.  To prove... I'm not exactly sure.  It's honestly incredibly pathetic and I can't imagine why any athlete would even compete for Russia after the country's athletic legacy has been so tainted.  \n  \nWell, I mean, unless you are looking to cheat to win, in which case, I guess it's a good option.",
            "title_similarity": "0.5318192",
            "sentiment_compound": 0.5118
        },
        {
            "id": "hwe53tc",
            "score": 0,
            "text": "Well, there's a reason Russian athletes can't compete under their national flag in the Olympics.",
            "title_similarity": "0.5562457",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hwe5d7s",
            "score": 0,
            "text": "Russia: East side is de best",
            "title_similarity": "0.22488648",
            "sentiment_compound": 0.6369
        },
        {
            "id": "hwe5dn4",
            "score": 0,
            "text": "It beggars belief that Russian athletes were allowed to compete in subsequent competitions.",
            "title_similarity": "0.44404024",
            "sentiment_compound": 0.0
        },
        {
            "id": "hwe5fr4",
            "score": 0,
            "text": "Why do we not have zero tolerance with it there’s legal and illegal drugs you can dope with this is why these become things it’s manic ban all drugs 100% tho don’t ban weed that’s stupid",
            "title_similarity": "0.52438074",
            "sentiment_compound": -0.9391
        },
        {
            "id": "hwe5yx9",
            "score": 0,
            "text": "Not surprised at all",
            "title_similarity": "-0.10695196",
            "sentiment_compound": -0.1695
        },
        {
            "id": "hwe63py",
            "score": 0,
            "text": "Russia is what you get when the mob seizes control over a country. Literally everything they do is corrupt.",
            "title_similarity": "0.59378",
            "sentiment_compound": 0.0
        },
        {
            "id": "hwe63yx",
            "score": 0,
            "text": "It was on the Netflix Doc called Icarus",
            "title_similarity": "0.3270618",
            "sentiment_compound": 0.0
        },
        {
            "id": "hwe65gt",
            "score": 0,
            "text": "Russians and athletics is a 100% doping no matter the sport. They know no other way. Time and time again.",
            "title_similarity": "0.5278249",
            "sentiment_compound": -0.3125
        },
        {
            "id": "hwe6u09",
            "score": 0,
            "text": "Just go watch Icarus on Netflix for the whole story",
            "title_similarity": "0.45708573",
            "sentiment_compound": 0.0
        },
        {
            "id": "hwe6u4f",
            "score": 0,
            "text": "Russias such a insecure country. Will literally go to such extremes to win.",
            "title_similarity": "0.33793133",
            "sentiment_compound": 0.25
        },
        {
            "id": "hwe7v28",
            "score": 0,
            "text": "This has not been confirmed, though. Russia always denied it so we can't call it a fact for sure.",
            "title_similarity": "0.36129123",
            "sentiment_compound": -0.1531
        },
        {
            "id": "hwe7z3g",
            "score": 0,
            "text": "What a bunch of absolute clowns. Just fucking clowns.",
            "title_similarity": "0.27346715",
            "sentiment_compound": 0.0
        },
        {
            "id": "hwe83yr",
            "score": 0,
            "text": "I can't po$$ibly think of any reason why the IOC would let Russia \n compete. No idea.",
            "title_similarity": "0.470182",
            "sentiment_compound": -0.296
        },
        {
            "id": "hwe8j1s",
            "score": 0,
            "text": "If you’re a Russian athlete in the Olympics you’re cheating.  Not necessarily by any choice of the athlete, but because the Russian government makes them do it.",
            "title_similarity": "0.6377524",
            "sentiment_compound": -0.3182
        },
        {
            "id": "hwe8jzr",
            "score": 0,
            "text": "Yep! They always find ways to cheat! Fuckers!!!!",
            "title_similarity": "0.30987915",
            "sentiment_compound": -0.7825
        },
        {
            "id": "hwe8k7u",
            "score": 0,
            "text": "Can we either cancel the Olympics or just let these athletes use what ever drugs they want. They are going to cheat no matter what do let's see how much performance a human can gain.",
            "title_similarity": "0.54668665",
            "sentiment_compound": -0.0961
        },
        {
            "id": "hwe8uat",
            "score": 0,
            "text": "Russia and China can't win jack without cheating.",
            "title_similarity": "0.46124557",
            "sentiment_compound": -0.0382
        },
        {
            "id": "hwe9plw",
            "score": 0,
            "text": "Watch \"Icarus\" on Netflix for a great documentary on this topic.",
            "title_similarity": "0.4538778",
            "sentiment_compound": 0.6249
        },
        {
            "id": "hwe9zye",
            "score": 0,
            "text": "Is it me or is Russia always cheating?",
            "title_similarity": "0.39243996",
            "sentiment_compound": -0.5574
        },
        {
            "id": "hweb6bv",
            "score": 0,
            "text": "And we still let these cheating pieces of shit compete. Sad.",
            "title_similarity": "0.30625042",
            "sentiment_compound": -0.8834
        },
        {
            "id": "hweb9st",
            "score": 0,
            "text": "Watch the Documentary 'Icaris' on Netflix.  Awesome film.  And goes into great detail about the Sochi Doping and the men behind it.",
            "title_similarity": "0.6066499",
            "sentiment_compound": 0.8481
        },
        {
            "id": "hwebqke",
            "score": 0,
            "text": "Everyone knows this",
            "title_similarity": "-0.092641234",
            "sentiment_compound": 0.0
        },
        {
            "id": "hwebvuf",
            "score": 0,
            "text": "You are downplaying the absolute fuck out of this. The entire Russian government was behind the use of PEDs in their athletes. They made an agency called *\"The Russian Anti-Doping Agency\"* that was state run, enabling the systemic doping of athletes.",
            "title_similarity": "0.72731346",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hwebvz8",
            "score": 0,
            "text": "There is a movie about it on Netflix called Icarus.",
            "title_similarity": "0.2832488",
            "sentiment_compound": 0.0
        },
        {
            "id": "hwecprt",
            "score": 0,
            "text": "The Russians are pretty much the most prolific cheaters in International Sport. I don't think anyone else even comes close.",
            "title_similarity": "0.51880735",
            "sentiment_compound": 0.0056
        },
        {
            "id": "hwectdn",
            "score": 0,
            "text": "Russia, China, doping.",
            "title_similarity": "0.43782628",
            "sentiment_compound": 0.0
        },
        {
            "id": "hwed2tl",
            "score": 0,
            "text": "Russian dogs can only compete at anything by cheating.",
            "title_similarity": "0.5791057",
            "sentiment_compound": -0.5574
        },
        {
            "id": "hwed3g5",
            "score": 0,
            "text": "There’s a very good documentary on Netflix about this. It’s about a guy doping for a cycling race and connects with the scientist who runs this russian lab. They befriend each other and he later reveals all these secrets",
            "title_similarity": "0.7455914",
            "sentiment_compound": 0.4927
        },
        {
            "id": "hwed5d6",
            "score": 0,
            "text": "Y'all need to watch the documentary Icarus which goes into this",
            "title_similarity": "0.34625715",
            "sentiment_compound": 0.0
        },
        {
            "id": "hwed8c0",
            "score": 0,
            "text": "Those damn dirty Russians",
            "title_similarity": "0.31292772",
            "sentiment_compound": -0.6808
        },
        {
            "id": "hwedgfz",
            "score": 0,
            "text": "I expected nothing else from my them.",
            "title_similarity": "0.021779586",
            "sentiment_compound": 0.0
        },
        {
            "id": "hwedk8b",
            "score": 0,
            "text": "at this point they should deny all athletes from russia participation in the olympics (and china as well after these ridiculous cheater-games).\n\nthese two countries are single-handedly (or double-handedly?) destroying the olympic idea.",
            "title_similarity": "0.5272263",
            "sentiment_compound": -0.7506
        },
        {
            "id": "hwedkfj",
            "score": 0,
            "text": "Why isn’t Russia banned from the Olympics for 100 generations?",
            "title_similarity": "0.54581565",
            "sentiment_compound": -0.4588
        },
        {
            "id": "hwedp2u",
            "score": 0,
            "text": "Highly recommend a documentary called \"Icarus\" on Netflix. Touches on some of this. They had a crazy setup going on.",
            "title_similarity": "0.4365413",
            "sentiment_compound": 0.101
        },
        {
            "id": "hwedu3c",
            "score": 0,
            "text": "Russia should not be allowed to compete again. It's fucked.",
            "title_similarity": "0.29957038",
            "sentiment_compound": -0.6597
        },
        {
            "id": "hwedurr",
            "score": 0,
            "text": "Russian scum",
            "title_similarity": "0.326379",
            "sentiment_compound": 0.0
        },
        {
            "id": "hwee69a",
            "score": 0,
            "text": "Does this mean the whole country is a loser?",
            "title_similarity": "0.20498082",
            "sentiment_compound": -0.5267
        },
        {
            "id": "hweeeww",
            "score": 0,
            "text": "Can we, finally, exclude them from the \nOlympic Games?\n\nHow would it feel to lose to some fucking Russian to then find out they were using PEDs and cheating to win....come the fuck on already.",
            "title_similarity": "0.6057899",
            "sentiment_compound": -0.8934
        },
        {
            "id": "hweeobv",
            "score": 0,
            "text": "Icarus on Netflix, is all about this fraud.",
            "title_similarity": "0.5251404",
            "sentiment_compound": -0.6705
        },
        {
            "id": "hweeoz2",
            "score": 0,
            "text": "Russians be Russians",
            "title_similarity": "0.22675544",
            "sentiment_compound": 0.0
        },
        {
            "id": "hweeu8l",
            "score": 0,
            "text": "but that's Russophobia and propaganda\nthe great Putin would never do such things\n/s",
            "title_similarity": "0.33504197",
            "sentiment_compound": 0.631
        },
        {
            "id": "hweexee",
            "score": 0,
            "text": "why are they still allowed to compete",
            "title_similarity": "0.044095803",
            "sentiment_compound": 0.0
        },
        {
            "id": "hwef188",
            "score": 0,
            "text": "This is so pathetic",
            "title_similarity": "-0.024872579",
            "sentiment_compound": -0.6948
        },
        {
            "id": "hwef2y0",
            "score": 0,
            "text": "They should be banned from the competition permanently.",
            "title_similarity": "0.2432801",
            "sentiment_compound": -0.4588
        },
        {
            "id": "hwefer3",
            "score": 0,
            "text": "So you watched Icarus",
            "title_similarity": "0.18615618",
            "sentiment_compound": 0.0
        },
        {
            "id": "hwefo0g",
            "score": 0,
            "text": "Icarus.",
            "title_similarity": "0.04806373",
            "sentiment_compound": 0.0
        },
        {
            "id": "hwefoq3",
            "score": 0,
            "text": "russians are the hillbillies of europe.",
            "title_similarity": "0.31070745",
            "sentiment_compound": 0.0
        },
        {
            "id": "hwefqvw",
            "score": 0,
            "text": "baller. i love russia",
            "title_similarity": "0.22154865",
            "sentiment_compound": 0.6369
        },
        {
            "id": "hwefs9b",
            "score": 0,
            "text": "IIRC there were comments by the Russian teams that seemed to incriminate the IOC, accusing many of them of accepting bribes to look the other way. But no, most countries just wanted to see Russia, and only Russia suffer the consequences. IOC used Pikachu face.",
            "title_similarity": "0.6381379",
            "sentiment_compound": -0.6486
        },
        {
            "id": "hwefyg1",
            "score": 0,
            "text": "Their only regret is getting caught… Despicable morals",
            "title_similarity": "0.24677947",
            "sentiment_compound": -0.4215
        },
        {
            "id": "hweg0pa",
            "score": 0,
            "text": "Russia … honorable country …",
            "title_similarity": "0.1393749",
            "sentiment_compound": 0.5423
        },
        {
            "id": "hweg10i",
            "score": 0,
            "text": "Is there anything Russians won't cheat at?",
            "title_similarity": "0.2901",
            "sentiment_compound": 0.357
        },
        {
            "id": "hweg2ov",
            "score": 0,
            "text": "Russian Piss Smuggler",
            "title_similarity": "0.46205503",
            "sentiment_compound": -0.7003
        },
        {
            "id": "hweg2r3",
            "score": 0,
            "text": "Check out the movie Icarus. It's an amazing documentary that kind of took on a life of it's own. It chronicles the whistleblower from Russia who risked his life fleeing the country as this broke. Really enjoyed it and gives a very different perspective on things then people are used to hearing.",
            "title_similarity": "0.6313502",
            "sentiment_compound": 0.5012
        },
        {
            "id": "hweg425",
            "score": 0,
            "text": "According to the documentary that debunked the doping schemes in Russia, there's never been an anti doping agency",
            "title_similarity": "0.55311716",
            "sentiment_compound": 0.2411
        },
        {
            "id": "hwegf9b",
            "score": 0,
            "text": "Ah those Russians",
            "title_similarity": "0.14915447",
            "sentiment_compound": 0.0
        },
        {
            "id": "hweh1vi",
            "score": 0,
            "text": "Very sad, if your country is lead by someone who thinks that cheating is the same thing as winning.",
            "title_similarity": "0.36742538",
            "sentiment_compound": -0.5563
        },
        {
            "id": "hwejc1j",
            "score": 0,
            "text": "I too saw ICARUS on Netflix",
            "title_similarity": "0.3520459",
            "sentiment_compound": 0.0
        },
        {
            "id": "hwejvs1",
            "score": 0,
            "text": "And we are suppose to believe that Russia isn’t going to invade. Yeah right?!?!?",
            "title_similarity": "0.26440656",
            "sentiment_compound": -0.6278
        },
        {
            "id": "hwel454",
            "score": 0,
            "text": "There's an entire Netflix documentary discussing this issue. Super interesting.\n\n[https://www.netflix.com/ca/title/80168079](https://www.netflix.com/ca/title/80168079)",
            "title_similarity": "0.35719514",
            "sentiment_compound": 0.765
        },
        {
            "id": "hwem1b1",
            "score": 0,
            "text": "And we should trust Russia on all other fronts as well!!!\n\n/s",
            "title_similarity": "0.34028786",
            "sentiment_compound": 0.7412
        },
        {
            "id": "hwem6v3",
            "score": 0,
            "text": "And now their \"darling\" figure skater is doped up too (at age 15).\n\nFucking unbelievable how corrupt that country is, kick them out of all international sport for a decade.",
            "title_similarity": "0.60642016",
            "sentiment_compound": 0.7089
        },
        {
            "id": "hwemfna",
            "score": 0,
            "text": "Russians are the ultimate cheaters",
            "title_similarity": "0.43955612",
            "sentiment_compound": -0.4404
        },
        {
            "id": "hwemhx8",
            "score": 0,
            "text": "So horrible at everything they do that they have to cheat.",
            "title_similarity": "0.3135573",
            "sentiment_compound": -0.7778
        },
        {
            "id": "hwemq46",
            "score": 0,
            "text": "There's a great [documentary](https://www.imdb.com/title/tt6333060/) about it",
            "title_similarity": "0.16723123",
            "sentiment_compound": 0.6249
        },
        {
            "id": "hwen4p5",
            "score": 0,
            "text": "Check the documentary on it on Netflix, ICARUS. GREAT watch, even for someone that usually doesn’t go for docs",
            "title_similarity": "0.4459669",
            "sentiment_compound": 0.7034
        },
        {
            "id": "hwenp81",
            "score": 0,
            "text": "Check out the documentary, Icarus, if you want more details. The source material is the head of the Russian doping program. He is currently in witness protection in the US, I believe. The film won Oscar for best documentary.",
            "title_similarity": "0.72922206",
            "sentiment_compound": 0.8481
        },
        {
            "id": "hwep4hl",
            "score": 0,
            "text": "Gotta appreciate their dedication to being blatant cheaters. At least every other country manages to convince people they aren’t systematically cheating at every turn as well.",
            "title_similarity": "0.48712432",
            "sentiment_compound": -0.1779
        },
        {
            "id": "hweq0sc",
            "score": 0,
            "text": "If it hasn’t been mentioned yet, the documentary “Icarus” does a great job on doping and highlights this incident.",
            "title_similarity": "0.45179456",
            "sentiment_compound": 0.6249
        },
        {
            "id": "hweq3rx",
            "score": 0,
            "text": "There is *nothing* Russia won't do to cheat their way to the top. This is why the US is so worried about Russia starting another war.",
            "title_similarity": "0.48455942",
            "sentiment_compound": -0.5402
        },
        {
            "id": "hweq7sa",
            "score": 0,
            "text": "[deleted]",
            "title_similarity": "-0.05756315"
        },
        {
            "id": "hweqvkr",
            "score": 0,
            "text": "Any word on the team figure skating results being changed as the 15 year old Russian star woman failed a doping test.",
            "title_similarity": "0.6491351",
            "sentiment_compound": -0.5106
        },
        {
            "id": "hwes4hp",
            "score": 0,
            "text": "If they do this for the Olympics, just imagine what they are prepared to do on the world stage.",
            "title_similarity": "0.28361315",
            "sentiment_compound": 0.2263
        },
        {
            "id": "hwes6aa",
            "score": 0,
            "text": "But let's not ban them from the Olympics for reasons",
            "title_similarity": "0.24109687",
            "sentiment_compound": 0.5975
        },
        {
            "id": "hwes9z1",
            "score": 0,
            "text": "and NATO wants to tangle with those crack covert capabilities? C'mon, man.",
            "title_similarity": "0.38641596",
            "sentiment_compound": 0.0
        },
        {
            "id": "hwet22z",
            "score": 0,
            "text": "So I take that as Russia admitting they can't win without cheating...",
            "title_similarity": "0.46603912",
            "sentiment_compound": -0.67
        },
        {
            "id": "hwetfjt",
            "score": 0,
            "text": "There’s a very good documentary about this and the Russian Doctor who ran the program on Netflix.",
            "title_similarity": "0.50638324",
            "sentiment_compound": 0.4927
        },
        {
            "id": "hwetl5e",
            "score": 0,
            "text": "Didn’t you see “Icarus”",
            "title_similarity": "0.20954189",
            "sentiment_compound": 0.0
        },
        {
            "id": "hweu3ax",
            "score": 0,
            "text": "Russia and China show how pathetic they are when it comes to international competitions",
            "title_similarity": "0.45395237",
            "sentiment_compound": -0.5719
        },
        {
            "id": "hweuk0b",
            "score": 0,
            "text": "Russian “Glory hole” /r/Russia",
            "title_similarity": "0.3198172",
            "sentiment_compound": 0.0
        },
        {
            "id": "hweumwj",
            "score": 0,
            "text": "They should ban them for a couple years, this is state sponsored doping not just one person..",
            "title_similarity": "0.47886133",
            "sentiment_compound": -0.5574
        },
        {
            "id": "hweurn2",
            "score": 0,
            "text": "Do Russians enjoy having the reputation of being cheaters or something?",
            "title_similarity": "0.42518684",
            "sentiment_compound": 0.0772
        },
        {
            "id": "hweus2q",
            "score": 0,
            "text": "\"Russia would never try and interfere in the 2016 US elections! Look how honest they are!\"",
            "title_similarity": "0.43134668",
            "sentiment_compound": 0.5972
        },
        {
            "id": "hweutxl",
            "score": 0,
            "text": "We use to live in Lake Placid the Russians got caught heating their rails on the bob sled with a cigarette lighter. They are the best...",
            "title_similarity": "0.66586316",
            "sentiment_compound": 0.6369
        },
        {
            "id": "hwewddd",
            "score": 0,
            "text": "and they still lost in almost every event to clean athletes.. what a shame",
            "title_similarity": "0.40230516",
            "sentiment_compound": -0.4019
        },
        {
            "id": "hwewhoa",
            "score": 0,
            "text": "TIL you now know why the I.O.C. should be disbanded.   They let the Russians compete again, ruined the whole games.  Lets start over...",
            "title_similarity": "0.5565264",
            "sentiment_compound": -0.4767
        },
        {
            "id": "hwewyp6",
            "score": 0,
            "text": "At this point Russia's just using under handed tactics like blackmail, hacking, etc to keep themselves relevant on the world stage.  if they didn't have the mass quantities of oil and natural gas they just be a third world country with nukes.",
            "title_similarity": "0.58492154",
            "sentiment_compound": 0.6124
        },
        {
            "id": "hwex926",
            "score": 0,
            "text": "Yeah. The documentary Icarus talks about this.  This doc was so good, and so crazy.  Highly recommend.",
            "title_similarity": "0.31253126",
            "sentiment_compound": 0.7434
        },
        {
            "id": "hweysl6",
            "score": 0,
            "text": "So Icarus?",
            "title_similarity": "0.08117152",
            "sentiment_compound": 0.0
        },
        {
            "id": "hwf07v8",
            "score": 0,
            "text": "Highly recommend watching Icarus:\n\nhttps://www.netflix.com/ca/title/80168079",
            "title_similarity": "0.26581",
            "sentiment_compound": 0.4201
        },
        {
            "id": "hwf0ldb",
            "score": 0,
            "text": "watch the movie Icarus",
            "title_similarity": "0.24434425",
            "sentiment_compound": 0.0
        },
        {
            "id": "hwf13ea",
            "score": 0,
            "text": "The olympics are a fucking joke",
            "title_similarity": "0.36079174",
            "sentiment_compound": 0.3597
        },
        {
            "id": "hwfdrxo",
            "score": 0,
            "text": "Imagine caring this much about the Olympics",
            "title_similarity": "0.23709962",
            "sentiment_compound": 0.4939
        },
        {
            "id": "hwfsi49",
            "score": 0,
            "text": "Russians cheat because it is in their DNA.",
            "title_similarity": "0.60895014",
            "sentiment_compound": -0.4588
        },
        {
            "id": "hwfstxh",
            "score": 0,
            "text": "One this is cool. Two, who cares it’s hilarious the Olympics even still exists",
            "title_similarity": "0.27740157",
            "sentiment_compound": 0.7906
        },
        {
            "id": "hwgbyyl",
            "score": 0,
            "text": "Russian idiots, cheating fucks, no wonder trump kook idiots liked you",
            "title_similarity": "0.49890596",
            "sentiment_compound": -0.7269
        },
        {
            "id": "hwgou2o",
            "score": 0,
            "text": "You forget a thousand things every day. Why don’t you make sure this is one of ‘em",
            "title_similarity": "0.30359408",
            "sentiment_compound": 0.1027
        },
        {
            "id": "hwh0u6g",
            "score": 0,
            "text": "Losers (like Russia in life, not the games) ALWAYS CHEAT!",
            "title_similarity": "0.47884244",
            "sentiment_compound": -0.7118
        },
        {
            "id": "hwi2vaz",
            "score": 0,
            "text": "You're completely brainwashed, my western friends.\n\nRussia is a Northern country, has always had great sports schools, coaches and great athletes. We had won Winter Olympics more times than any other country.\n\nAnd you just believe in EVERY fairytale if posted in NY Times and contains smth like \"in the dead of night\", and \" a \"mouse hole\" drilled into the wall\"...\n\nLOL",
            "title_similarity": "0.64204836",
            "sentiment_compound": 0.9496
        },
        {
            "id": "hwddklb",
            "score": 15,
            "text": "the funniest part is, its state funded!!",
            "title_similarity": "0.16985843",
            "sentiment_compound": 0.6351
        },
        {
            "id": "hwdm424",
            "score": -5,
            "text": "The largest country on earth ruled by idiots for over 100 years !",
            "title_similarity": "0.29656726",
            "sentiment_compound": 0.0
        },
        {
            "id": "hwe4yrb",
            "score": 4,
            "text": "They really are like Boris and Natasha style Russians.",
            "title_similarity": "0.25290322",
            "sentiment_compound": 0.4173
        },
        {
            "id": "hwdc8wr",
            "score": 11,
            "text": "Just watched this yesterday on netflix. Really well done doxumentary.",
            "title_similarity": "0.40373003",
            "sentiment_compound": 0.3384
        },
        {
            "id": "hwdkbr3",
            "score": 39,
            "text": "Turns out the Russians were just doing this as a goof to their friends at the lab. They created the holes as a way of taking the piss out of them.",
            "title_similarity": "0.7538804",
            "sentiment_compound": 0.34
        },
        {
            "id": "hwdnjxp",
            "score": -5,
            "text": "I say we allow all athletes to dope\n\nLet us allow them to go all the way \n\nLets watch giant fucking people all hopped up on designer drugs throwing shit super far\n\nI wanna see superman dam it!\n\nI wanna see utter chaos as jacked up Russians scream war cries as they lift heavy objects \n\nI wanna see utter bedlam as roided out athletes scream at each other in an attempt at intimidation",
            "title_similarity": "0.52895457",
            "sentiment_compound": -0.9431
        },
        {
            "id": "hwdql9e",
            "score": -5,
            "text": "What a waste of time and energy. Cause there's no better feeling than winning by cheating....To me, that's a hollow victory. Russians are a different breed of people. It's like they've never grown up. I guess that's why they always have to have a Daddy (Tsars, Stalin, Putin).",
            "title_similarity": "0.55521536",
            "sentiment_compound": 0.3451
        },
        {
            "id": "hwdjoo9",
            "score": -1,
            "text": "Kind of crazy how the truth always comes out",
            "title_similarity": "0.13880907",
            "sentiment_compound": -0.0258
        },
        {
            "id": "hwdn0a2",
            "score": -1,
            "text": "Russians literally have a culture around cheating. It's so strange, it's why any time you saw a name like Игор you logged the fuck off in DayZ because next second you're likely dead.",
            "title_similarity": "0.6122455",
            "sentiment_compound": -0.8999
        },
        {
            "id": "hwdnkcm",
            "score": -1,
            "text": "Is russia in such bad shape that mouse holes are common in their buildings and homes?",
            "title_similarity": "0.5783061",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hwdnmym",
            "score": -1,
            "text": "Is russia in such bad shape that mouse holes are common in their buildings and homes?",
            "title_similarity": "0.5783061",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hwdo7q4",
            "score": -1,
            "text": "just a small reason why i will never watch the olympics.\n\nmaybe if they paid the athletes a fucking dime. it's literally a big corp money making greed fest. sucks for the athletes.",
            "title_similarity": "0.56321",
            "sentiment_compound": -0.6369
        },
        {
            "id": "hwdpddl",
            "score": -1,
            "text": "They deserve it at that point",
            "title_similarity": "-0.14478332",
            "sentiment_compound": 0.0
        },
        {
            "id": "hwdsymp",
            "score": 1,
            "text": "This reminds me of Trailer Park Boys: Countdown to Liquor Day. You’re stealing… piss?",
            "title_similarity": "0.5096011",
            "sentiment_compound": -0.4019
        },
        {
            "id": "hwdtg9l",
            "score": 1,
            "text": "Why does every story about Russians make them out to be terrible people?\n\nAll right I forgot",
            "title_similarity": "0.49635518",
            "sentiment_compound": -0.4767
        },
        {
            "id": "hwdtssl",
            "score": 1,
            "text": "the fact they aren't permanently just banned from competing in the olympics is just pathetic",
            "title_similarity": "0.40338004",
            "sentiment_compound": -0.3004
        },
        {
            "id": "hwdtswq",
            "score": 1,
            "text": "Russia feels no shame and never will. They have a \"win at all costs\" mentality that often gets them into trouble. They are seldom seen as winners on the world stage but it must look better domestically i guess.",
            "title_similarity": "0.48450315",
            "sentiment_compound": 0.6597
        },
        {
            "id": "hwdtunf",
            "score": -1,
            "text": "Whyyyyyy does anybody even give a fuck? Let them use *all* the PEDs. Might actually boost viewership for a change.",
            "title_similarity": "0.26598614",
            "sentiment_compound": -0.2023
        },
        {
            "id": "hwdue5f",
            "score": 1,
            "text": "FYI this is why they cant use their flag in the olympics now, because russia as a nation is banned.",
            "title_similarity": "0.5140421",
            "sentiment_compound": -0.1197
        },
        {
            "id": "hwdup4v",
            "score": 1,
            "text": "Since Russia has been caught doping many times why are they allowed to continue competing?",
            "title_similarity": "0.59502554",
            "sentiment_compound": 0.0
        },
        {
            "id": "hwdwiwo",
            "score": -1,
            "text": "Why is it that major governmental powers give this much of a shit about the Olympics? China giving out starvation meals and now this. Real people don't look at an Olympian gold medalist and go \"wow america is so great because of this one person\". What does it change?",
            "title_similarity": "0.61467665",
            "sentiment_compound": 0.8482
        },
        {
            "id": "hwdxay8",
            "score": 1,
            "text": "Must’ve carried a ladder",
            "title_similarity": "-0.044844486",
            "sentiment_compound": 0.0
        },
        {
            "id": "hwdylw1",
            "score": 1,
            "text": "This guy listens to the Joe Rogan podcast.",
            "title_similarity": "0.23760122",
            "sentiment_compound": 0.0
        },
        {
            "id": "hwdznxb",
            "score": 1,
            "text": "If the truth were told probably most of the medals won by the USSR and now Russia should be stripped from their athletes since the time they started checking for doping at the Olympics, because they like East Germany doped their athletes and found ways around the testing.  The problem with both the USSR then and  Russia now is the country as a whole is corrupt and corruption is a way of life, so they don't see any problem with doping or cheating, it's not the sport but winning at all cost that is important.",
            "title_similarity": "0.72565746",
            "sentiment_compound": 0.8414
        },
        {
            "id": "hwdztgd",
            "score": 1,
            "text": "Man this is Oceans Eleven of doping.",
            "title_similarity": "0.38756067",
            "sentiment_compound": 0.0
        },
        {
            "id": "hwdzy4y",
            "score": 1,
            "text": "I am for allowing all forms of performance enhancers in sports competitions. I want to see superhumans compete.",
            "title_similarity": "0.42250058",
            "sentiment_compound": 0.0772
        },
        {
            "id": "hwe1rb8",
            "score": 1,
            "text": "John Oliver said it best “They made a literal glory hole”",
            "title_similarity": "0.14964417",
            "sentiment_compound": 0.8271
        },
        {
            "id": "hwe2i5h",
            "score": 1,
            "text": "Why in the world are they still allowed to compete?",
            "title_similarity": "0.1293165",
            "sentiment_compound": 0.0
        },
        {
            "id": "hwe38yf",
            "score": 1,
            "text": "Tbh they should just turn the Olympics and other sports into two separate categories of clean vs \"unlimited\" classes.",
            "title_similarity": "0.4335667",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hwe468d",
            "score": -1,
            "text": "Should’ve submitted this on r/TILJRE",
            "title_similarity": "-0.020462986",
            "sentiment_compound": 0.0
        },
        {
            "id": "hwe4hrt",
            "score": 1,
            "text": "I mean **THIS** should be an Olympic event! I'd def tune in every 4 years to watch each country concoct some elaborate plan to circumvent anti-doping testing. You could score both technical and artistic elements of the heist.",
            "title_similarity": "0.6591463",
            "sentiment_compound": 0.0
        },
        {
            "id": "hwe59lv",
            "score": 1,
            "text": "imagine if the mafia oligarchy would put that much effort into improving the russian people's lives...",
            "title_similarity": "0.51454544",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hwe5idp",
            "score": 1,
            "text": "You’d  have to be waking from a coma or not a fan of sport to just learn today about that Russia scheme",
            "title_similarity": "0.54319984",
            "sentiment_compound": -0.2411
        },
        {
            "id": "hwe6lqt",
            "score": 1,
            "text": "If you only learned this today, I highly recommend watching the Netflix documentary \"Icarus\". It starts off being about a guy wanting to see how much doping can affect his cycling, but then a crazy russian scientist comes along, who happens to be the head of the Russian anti doping labs and in charge of the anti doping during the Sochi Olympics, and shit gets wild. Its a must watch.",
            "title_similarity": "0.76487863",
            "sentiment_compound": -0.9186
        },
        {
            "id": "hwe80ex",
            "score": 1,
            "text": "Russians and cheat? What? No way! Never! I can't believe it!",
            "title_similarity": "0.3063215",
            "sentiment_compound": -0.7533
        },
        {
            "id": "hwe8417",
            "score": 1,
            "text": "Why are they still allowed to compete? Ban them completely and all new names they come up with too.",
            "title_similarity": "0.4298141",
            "sentiment_compound": -0.5574
        },
        {
            "id": "hwe8m9g",
            "score": 1,
            "text": "ICARUS....  An excellent documentary movie that goes into great detail about the extensive doping that took place in Sochi .",
            "title_similarity": "0.5810863",
            "sentiment_compound": 0.8316
        },
        {
            "id": "hwe8yxr",
            "score": 1,
            "text": "And they could be at it again",
            "title_similarity": "-0.15136813",
            "sentiment_compound": 0.0
        },
        {
            "id": "hwe9t8l",
            "score": 1,
            "text": "Ivan drago is that u ?",
            "title_similarity": "0.029707534",
            "sentiment_compound": 0.0
        },
        {
            "id": "hweac91",
            "score": 1,
            "text": "This is one of many reasons I don't give a shit about the Olympics. The athletes are dirty and the IOC is even worse.",
            "title_similarity": "0.49740866",
            "sentiment_compound": -0.4724
        },
        {
            "id": "hweacx3",
            "score": -1,
            "text": "Man i wonder how much illegal shit russia must do for stuff that actually matters.",
            "title_similarity": "0.5139756",
            "sentiment_compound": -0.7964
        },
        {
            "id": "hwebo8k",
            "score": 1,
            "text": "How did they train the mice.",
            "title_similarity": "0.468626",
            "sentiment_compound": 0.0
        },
        {
            "id": "hwed5zd",
            "score": 1,
            "text": "They were literally taking the piss.\n\nNow we hear about this Russian Teenage Olympian who has potentially failed her drugs test.\n\nTut tut tut...",
            "title_similarity": "0.58490574",
            "sentiment_compound": -0.7184
        },
        {
            "id": "hweepu4",
            "score": 1,
            "text": "Watch \"Icarus\". What a rollercoaster",
            "title_similarity": "0.1762867",
            "sentiment_compound": 0.0
        },
        {
            "id": "hweewyp",
            "score": 1,
            "text": "Nothing against the athletes that bust their ass to get into the Olympics but I think the Olympics have got to the point that it's a complete waste of time and in most cases the places that hold the Olympics go to shit quickly after the Olympics is done",
            "title_similarity": "0.5552865",
            "sentiment_compound": -0.8968
        },
        {
            "id": "hwef42u",
            "score": 1,
            "text": "This is why the olympics are pointless imo.\n\nWith the resources of an entire country behind you motherfuckers will always find way to cheat and dope.\n\nIf they aint doping during the games theyve probably taken something against thr rules to train and build muscle. Just seems like way too big of an incentive for smoke and mirrors.\n\nTo me esports are more fun to watch for  because I know none of them can be doping on steroids to win",
            "title_similarity": "0.6184193",
            "sentiment_compound": 0.8553
        },
        {
            "id": "hweg0t8",
            "score": -1,
            "text": "I wonder if we'll ever find out how China cheated at the current Olympics. \n\nUntil proven otherwise I assume most Olympians use doping. It's literally been around since ancient Greece. \n\nAlso I saw Icarus.",
            "title_similarity": "0.6175154",
            "sentiment_compound": -0.5106
        },
        {
            "id": "hweg1d3",
            "score": 1,
            "text": "Banning Russia from Olympic competition, but still allowing ROC to compete, is the most toothless punishment that’s ever been handed out in the world of sport. \n\nIt seems abundantly clear that Russia (and, by extension, the ROC) will *always* cheat. They should be permanently banned from all international sports competition, and any IOC official who says otherwise should likewise be banned for life.",
            "title_similarity": "0.5459574",
            "sentiment_compound": -0.9575
        },
        {
            "id": "hwehs5d",
            "score": 1,
            "text": "so what is china doing? starving athletes, what else?",
            "title_similarity": "0.41657978",
            "sentiment_compound": -0.4871
        },
        {
            "id": "hweietp",
            "score": 1,
            "text": "Just fucking ban them for the next 2 events. No ROC...no bullshit...banned from competing. It’s obvious they don’t care and probably never will care about the rules",
            "title_similarity": "0.29617655",
            "sentiment_compound": -0.6727
        },
        {
            "id": "hwek094",
            "score": 1,
            "text": "I also learned this today from listening to Joe Rogan's Podcast with his guest Josh Dubin.",
            "title_similarity": "0.3613634",
            "sentiment_compound": 0.0
        },
        {
            "id": "hwek63c",
            "score": 1,
            "text": "Check out the documentary \"Icarus\" it escalated quickly",
            "title_similarity": "0.23825982",
            "sentiment_compound": 0.0
        },
        {
            "id": "hwekax6",
            "score": 1,
            "text": "I still don't understand how the entire russian Olympic federation was not banned for life. This was done willfully and with malice intend.",
            "title_similarity": "0.61627793",
            "sentiment_compound": 0.357
        },
        {
            "id": "hwelb9y",
            "score": 1,
            "text": "Seems a good place to mention the German public broadcaster and investigative journalist Hajo seppel specifically since they’re the ones who broke the story in the first place and made it public for all to see",
            "title_similarity": "0.51033413",
            "sentiment_compound": 0.0258
        },
        {
            "id": "hwemcw1",
            "score": 1,
            "text": "If you want a good understanding of this watch Icarus on Netflix. That is how this was so greatly exposed.",
            "title_similarity": "0.48679537",
            "sentiment_compound": 0.3245
        },
        {
            "id": "hwen6yx",
            "score": -1,
            "text": "Russia fucking sucks lol. And the only time they're not last place their either lying or cheating. \"First satellite in space!!!\" Oh you mean Sputnik the publicity stunt that had nothing built into it except a blinking light? LMFAO.",
            "title_similarity": "0.60128134",
            "sentiment_compound": -0.52
        },
        {
            "id": "hweooxd",
            "score": 1,
            "text": "Russia Always Cheats hell they are cheating Right Now",
            "title_similarity": "0.46121985",
            "sentiment_compound": -0.9001
        },
        {
            "id": "hwepdgt",
            "score": 1,
            "text": "I really want to know how advanced these tamper proof seals are. I imagine anything wouldn’t be that hard to fake for a country to fake, but I haven’t heard of anything a normal job seeker can’t handle to get around drug testing.",
            "title_similarity": "0.5592352",
            "sentiment_compound": -0.3619
        },
        {
            "id": "hwepvy0",
            "score": 1,
            "text": "FYI there’s a detailed documentary about this called Icarus.",
            "title_similarity": "0.24461088",
            "sentiment_compound": 0.368
        },
        {
            "id": "hwes36e",
            "score": -1,
            "text": "Dude can we just ban Russia from everything? I mean REAL bans, not \"call yourself ROC and play Tchaikovsky for your anthem and we're good\"",
            "title_similarity": "0.52400595",
            "sentiment_compound": 0.1779
        },
        {
            "id": "hwesg5u",
            "score": 1,
            "text": "Watch Icarus… it’s a great documentary all about this on netflix",
            "title_similarity": "0.39102116",
            "sentiment_compound": 0.6249
        },
        {
            "id": "hwesrl4",
            "score": -1,
            "text": "Russians are the biggest cheaters in the world",
            "title_similarity": "0.4605735",
            "sentiment_compound": -0.4404
        },
        {
            "id": "hwesvqq",
            "score": -1,
            "text": "Never ever trust a russian.",
            "title_similarity": "0.2817685",
            "sentiment_compound": -0.4023
        },
        {
            "id": "hwev5ha",
            "score": 1,
            "text": "Watch the documentary Icharus for more insight. It’s very eye opening as to how hard some people will work to cheat.",
            "title_similarity": "0.4478714",
            "sentiment_compound": -0.5267
        },
        {
            "id": "hwevlyx",
            "score": 1,
            "text": "It’s like the entire Russian culture is built around being a cheating scumbag.",
            "title_similarity": "0.6087488",
            "sentiment_compound": -0.743
        },
        {
            "id": "hwexc9j",
            "score": 1,
            "text": "To anyone else who just learned this today, watch the documentary Icarus.\n\nIt won an Oscar for a reason - half incredible storytelling, half Tiger King-esque serendipity.\n\nEdit: sorry, just saw I’m 5K upvotes behind the first person to recommend this.",
            "title_similarity": "0.51024365",
            "sentiment_compound": 0.7096
        },
        {
            "id": "hwey0zp",
            "score": 1,
            "text": "If ANYONE is surprised by this I highly encourage you to watch Icarus. One of the “masterminds” of the Russian doping program goes in depth into how all of this works from the top down",
            "title_similarity": "0.6428821",
            "sentiment_compound": 0.7425
        },
        {
            "id": "hwf3fv8",
            "score": 1,
            "text": "TIL the Russians are so good at cheating, they even managed to beat the system during the Winter Olympics!",
            "title_similarity": "0.7138946",
            "sentiment_compound": -0.1064
        },
        {
            "id": "hwf45c1",
            "score": 1,
            "text": "“Russia uses glory hole to swap drug laced urine”",
            "title_similarity": "0.59735465",
            "sentiment_compound": 0.5423
        },
        {
            "id": "hwf5gp3",
            "score": 1,
            "text": "China and Russia give no shits about morals or rules. They cheat left and right. I'm sure there's other stuff they've done that we don't even know of.",
            "title_similarity": "0.5618635",
            "sentiment_compound": 0.2153
        },
        {
            "id": "hwff1jg",
            "score": 1,
            "text": "The fact that Russia and China cheat so blatantly so often at the Olympics just shows how pathetic they are.  Instead of surpassing in the Olympics, they drag everyone else down to their level.",
            "title_similarity": "0.62641394",
            "sentiment_compound": -0.8225
        },
        {
            "id": "hwfgsij",
            "score": 1,
            "text": "Remember all those East German female athletes that were bigger than the men on their teams? \n\nPepperidge Farm remembers.",
            "title_similarity": "0.40347624",
            "sentiment_compound": 0.0
        },
        {
            "id": "hwfsjx5",
            "score": 1,
            "text": "and this is why Russia has been banned from future olympics for 4 years (down to 2 now). Now you see ROC instead of Russia at the Olympics. IMO - it should have been all future olympics. Does anyone really think Russia is going to magically stop doping at the olympics? from their perspective, it's part of being an athlete. (r.disabled)",
            "title_similarity": "0.66122866",
            "sentiment_compound": -0.6369
        },
        {
            "id": "hwg0pna",
            "score": 1,
            "text": "It's time to disband the IOC, \n\nand return the Olympic Games to Greece\n\npermanently, \n\nwhere they belong.",
            "title_similarity": "0.34368154",
            "sentiment_compound": 0.0
        },
        {
            "id": "hwg37lq",
            "score": 1,
            "text": "Russians are so weak.",
            "title_similarity": "0.23373109",
            "sentiment_compound": -0.5777
        },
        {
            "id": "hwgsxcw",
            "score": -1,
            "text": "What is real funny is that there were provided zero evidence. Only testimony of some guy pretending to work for Russian WADA. No samples, tampered bottles ever found. \nAnd some hakers leaked docs that US athletes are excempt and can take antidepressants, Norway athletes all have asthma.\nThis was part of anti Russian info war.",
            "title_similarity": "0.74514675",
            "sentiment_compound": -0.7506
        },
        {
            "id": "hwddyvp",
            "score": 150,
            "text": "Just go ahead and ban the Russians from ever competing.",
            "title_similarity": "0.31398544",
            "sentiment_compound": -0.5574
        },
        {
            "id": "hwdqkhy",
            "score": 9,
            "text": "Winter Olympics 2022 - They took place in a location that gets on average of less than 3\" of snow. Top athletes were \"Diagnosed\" with Covid and unable to participate and treated like prisoners.",
            "title_similarity": "0.64090407",
            "sentiment_compound": 0.0
        },
        {
            "id": "hwdvq98",
            "score": 8,
            "text": "Let’s be real here, 95% of professional athletes use PEDs regardless of nationality.",
            "title_similarity": "0.4246162",
            "sentiment_compound": 0.0
        },
        {
            "id": "hwdn045",
            "score": -2,
            "text": "Anyone want to share their opinions on doping because with the information I have, I wouldn't really consider it cheating any more than I would consider excessive makeup in a beauty contest to be cheating. But I might not have all the facts.",
            "title_similarity": "0.45423734",
            "sentiment_compound": -0.1486
        },
        {
            "id": "hwdncd0",
            "score": -2,
            "text": "I cannot wrap my head around why Russia cares SO MUCH about winning.   \nThe world is not the same as it once was, and it feels like we all just want to see the winners - the country is almost a second thought!   \nWhy is their ego THIS damaged, I do not understand!   \nIf this is stupid someone please explain LOL",
            "title_similarity": "0.4760893",
            "sentiment_compound": 0.9164
        },
        {
            "id": "hwdobcv",
            "score": -2,
            "text": "you just learned this? are you like 10? was huge news all over the world at the time.",
            "title_similarity": "0.19263239",
            "sentiment_compound": 0.6322
        },
        {
            "id": "hwdrpx8",
            "score": -2,
            "text": "But like why? The olympics don’t even matter anymore",
            "title_similarity": "0.23355591",
            "sentiment_compound": 0.5267
        },
        {
            "id": "hwdwtxu",
            "score": 2,
            "text": "In the 2016 Rio Olympics, Great Britain came second leaving a fully doped up Russian team in 4th. Of course Team GB did this through cold showers and Corinthian spirit.",
            "title_similarity": "0.62403333",
            "sentiment_compound": 0.7003
        },
        {
            "id": "hwe01a0",
            "score": -2,
            "text": "The west 30 40 year later",
            "title_similarity": "-0.023737662",
            "sentiment_compound": 0.0
        },
        {
            "id": "hwe1go9",
            "score": 2,
            "text": "Can't wait for that episode of dirty jobs",
            "title_similarity": "0.2880441",
            "sentiment_compound": -0.4404
        },
        {
            "id": "hwe20wh",
            "score": 2,
            "text": "Well at least we know things are solid with FIFA and the World Cup…. nothing shady there. /s",
            "title_similarity": "0.23377809",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hwexs0g",
            "score": 2,
            "text": "Oh yeah? So now we are exposing 2014 Olympics 8 years later 🤔? Wonder why? Is it because Chinas Olympics is a dumpster fire but nobody is allowed to talk about this? We are not stupid",
            "title_similarity": "0.6176303",
            "sentiment_compound": 0.5682
        },
        {
            "id": "hwey06c",
            "score": 2,
            "text": "This is why Russian athletes compete under the Russian Olympic Committee (ROC) and not the country of Russia.",
            "title_similarity": "0.54831016",
            "sentiment_compound": 0.0
        },
        {
            "id": "hwguqnh",
            "score": 2,
            "text": "Thanks to Russia and China nobody believes in the Olympics anymore. Russians are probably some of the worst people on the planet.",
            "title_similarity": "0.566834",
            "sentiment_compound": -0.296
        },
        {
            "id": "hwh837k",
            "score": -2,
            "text": "[deleted]",
            "title_similarity": "-0.05756315"
        },
        {
            "id": "hwds4m9",
            "score": 20,
            "text": "Dude fuck it. At this point let everyone get drugged up as much as possible and call it the Super Olympics. Let's see how far we can push the body. I want an entire Luge team too big to fit on the ice hit mach 5 on turn 2. I want a big air jumper smashing through the ramp instead of soaring off of it. I want a curler to launch a stone into the fucking stratosphere.",
            "title_similarity": "0.63233745",
            "sentiment_compound": 0.5859
        },
        {
            "id": "hwdhuop",
            "score": -3,
            "text": "Wouldn’t it be easier just to making doping legal? They’re going to do it anyway",
            "title_similarity": "0.2457903",
            "sentiment_compound": 0.5106
        },
        {
            "id": "hwebslw",
            "score": 2,
            "text": "And yet those Olympics were a blessing compared to the corrupt Chinese trash on now",
            "title_similarity": "0.40117648",
            "sentiment_compound": 0.4939
        },
        {
            "id": "hwek3im",
            "score": 3,
            "text": "All for the equivalent of reddit silver and gold.",
            "title_similarity": "0.15927032",
            "sentiment_compound": 0.0
        },
        {
            "id": "hwes5in",
            "score": 2,
            "text": "As a fan of cycling, I don't care about doping. Everyone does it. The only difference is the team budget which dictates which drugs are used and what method(s) are used to hide them from WADA.\n\nPEDs or no, I'm still motivated to ride when I watch pro racing.\n\nI'm a bit more inclined to believe women's cycling is clean*er* but it's down to money and the fact that there is laughably little of it to be had. Most female pro riders are not able to make ends meet by cycling alone",
            "title_similarity": "0.43653876",
            "sentiment_compound": 0.1989
        },
        {
            "id": "hwfgf2m",
            "score": -2,
            "text": "People believe this then call others brainwashed",
            "title_similarity": "0.16804889",
            "sentiment_compound": 0.0
        },
        {
            "id": "hwdvq1g",
            "score": 45,
            "text": "And yet they got REKT by the Canadian hockey team eh 🏒 🍁",
            "title_similarity": "0.37691993",
            "sentiment_compound": 0.0
        },
        {
            "id": "hwdbshw",
            "score": 37,
            "text": "Good thing they got put in there place after they got caught. Isn't that right Russian figure skaters",
            "title_similarity": "0.5732249",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hwdzoqb",
            "score": 4,
            "text": "Most of you don’t seem to realize that almost every professional athlete uses steroids or other types of performance enhancing drugs. There’s ways around the tests, very few professional athletes are 100% natural. Regardless, steroids aren’t a magic solution to become a great athlete, it still takes a lot of effort and training to excel, even with steroids. Genetics are also a massive factor as well.",
            "title_similarity": "0.52756894",
            "sentiment_compound": 0.9186
        },
        {
            "id": "hwdrbd6",
            "score": 60,
            "text": "I honestly think Russia should be banned from all Olympics because they've repeatedly shown that they can't be trusted at any part of it",
            "title_similarity": "0.4800854",
            "sentiment_compound": -0.3724
        },
        {
            "id": "hwdwu33",
            "score": -3,
            "text": "Why did so many ‘experts’ on Chinese culture on Reddit come out and claim that all Chinese are cheaters because it is in their Chinese culture but no ‘experts’ on Russian culture are coming out to say the same thing about Russians?\n\nIs it because Russians are white?\n\nWhat about that time Spain sent a team of normal athletes to compete in the Paralympic basketball team?\n\nDid anyone say the same thing about Spanish culture then? \n\nAre the Spanish considered white?",
            "title_similarity": "0.6775158",
            "sentiment_compound": -0.6917
        },
        {
            "id": "hwec22n",
            "score": 4,
            "text": "[deleted]",
            "title_similarity": "-0.05756315"
        },
        {
            "id": "hwek6hl",
            "score": 5,
            "text": "The Olympics are fucked just get rid of them honestly",
            "title_similarity": "0.43132976",
            "sentiment_compound": -0.34
        },
        {
            "id": "hwh8h9s",
            "score": -5,
            "text": "Wow, someone really believes such kind of nonsense.",
            "title_similarity": "0.033949666",
            "sentiment_compound": 0.204
        },
        {
            "id": "hwdmxef",
            "score": 81,
            "text": "Remember when we didn't pick the absolute worst countries in the world to host the olympics?",
            "title_similarity": "0.46281967",
            "sentiment_compound": -0.6249
        },
        {
            "id": "hwdzhoz",
            "score": 5,
            "text": "Don't get caught saying olympic athletes are all on steroids though or you'll get jumped by the good Samaritans of the internet.",
            "title_similarity": "0.6197103",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hwdr831",
            "score": 105,
            "text": "Remind me why we are allowing Russians to compete at all?",
            "title_similarity": "0.43455645",
            "sentiment_compound": 0.0
        },
        {
            "id": "hwenaq4",
            "score": 8,
            "text": "Wait til you find out that most professional athletes are on PED's, especially in the Olympics.",
            "title_similarity": "0.46960068",
            "sentiment_compound": 0.0
        },
        {
            "id": "hwdae1a",
            "score": 230,
            "text": "So the Russianss have a history of cheating in the Olympics.  Actually they cheated in the Olympics by doping their athletes and then double downed by stealing the doped urine samples and replacing them with clean urine sample.",
            "title_similarity": "0.7417925",
            "sentiment_compound": -0.836
        },
        {
            "id": "hwe2vrd",
            "score": 7,
            "text": "The Olympics is nothing but a propaganda machine. \n\nI'm not gonna watch the Beijing Olympics this year. Fuck CCP. It's probably corrupt as fuck in China's favour. They probably fudge all kinds of documents, just like the underage gymnasts last time.they hosted the summer ones, and they probably have a bunch of doping loopholes too. \n\nFuck all dictatorships.",
            "title_similarity": "0.6366663",
            "sentiment_compound": -0.7929
        },
        {
            "id": "hwdk6zt",
            "score": 314,
            "text": "I get that athletes dope but I'm surprised that any government would care about the Olympics so much that they would use intelligence resources for it.",
            "title_similarity": "0.507482",
            "sentiment_compound": 0.8957
        },
        {
            "id": "hwdkw88",
            "score": 216,
            "text": "I think Russia spends more money on cheating than they do on actually trying to be competent in whatever field they pursue. From athletics to academics this seems to be the case for them.",
            "title_similarity": "0.48488772",
            "sentiment_compound": -0.3744
        },
        {
            "id": "hwdgsmu",
            "score": 948,
            "text": "Between authoritarian countries cheating and not understanding that it completely undermines not just that win, but any medal they get in any competition moving forward, and the IOC being a corrupt piece of shit, I am 100% over the olympics.\n\nI was never into sports to begin with, but I'd still watch the olympics, cause the events were mostly interesting things you wouldn't see in normal sports broadcasting like archery, diving, and curling.  \n\nBut now?  Fuck it.  In a world where I have access to infinite, ad free content, why would I support a corrupt organization putting on a sham of an event so shitty fascists can cheat and pretend they're superior?",
            "title_similarity": "0.6310773",
            "sentiment_compound": -0.6892
        },
        {
            "id": "hwdiiri",
            "score": 190,
            "text": "If Russia put as much effort into winning fairly as they do cheating, they could win fairly.",
            "title_similarity": "0.39505523",
            "sentiment_compound": 0.5574
        },
        {
            "id": "hwdqeot",
            "score": 201,
            "text": "One of the best sports interviews was the swimmer who straight up said she beat her russian competitor even though she was on steroids. The Russian competitor was standing right next to her at the time. \n\nIf anyone can find the video I'd be grateful. Can't find it anywhere",
            "title_similarity": "0.6160714",
            "sentiment_compound": 0.8442
        },
        {
            "id": "hwdcend",
            "score": 3860,
            "text": "Russia has an elite unit dedicated solely to acts of espionage involving urine, such as in this case. It’s known as the K G Pee",
            "title_similarity": "0.672082",
            "sentiment_compound": 0.4588
        },
        {
            "id": "hwdpsc1",
            "score": 969,
            "text": "Salt Lake City 2002 - Russian & French Fed caught in massive results rigging scandal that lowers figure skating viewership worldwide in subsequent years and seriously sullies the credibility of the sport, leading to an entirely new judging system that casual fans still don’t seem to like that much. \n\n2014 Sochi Olympics - Adelina Sotnikova somehow beats Yu Na Kim for gold with two skates that would never have beaten Yu Na in any other competition. I stopped watching figure skating because of this. \n\nNovember 2015 - the World Anti-Doping Agency (WADA) published a report, and the International Association of Athletics Federations (IAAF) suspended Russia indefinitely from world track and field events. The 335-page report, compiled following a nearly year-long investigation by a commission led by former anti-doping agency President Dick Pound, urged the IAAF to suspend Russia from competition, including the 2016 Summer Olympics. Allegations are made that Russian atheles doped at both the 2012 Summer Games and 2014 Winter Games. \n\nMarch 2016 - Maria Sharapova is handed a 15-month suspension from tennis after her admittance to using meldonium, an anti-ischemic drug banned by WADA. \n\n2016 Summer Games - Russia is once again accused of doping by WADA, which recommends banning the entire team. One day prior to the opening ceremony, 278 athletes are cleared to compete under the Russian flag, while 111 are removed because of doping. The Paralympics ban the entire country. \n\nMay 2016 - The New York Times publishes allegations by the former director of Russia's anti-doping laboratory, Dr. Grigory Rodchenkov, that a conspiracy of corrupt anti-doping officials, Federal Security Service (FSB) intelligence agents, and compliant Russian athletes used banned substances to gain an unfair advantage during the 2016 Games. Rodchenkov stated that the FSB tampered with over 100 urine samples as part of a cover-up, and that a third of the Russian medals won at Sochi were the result of doping.\n\nDecember 2017 - the IOC announces that the Russian Olympic Committee had been suspended from the 2018 Winter Olympics with immediate effect. Athletes who had no previous drug violations and a consistent history of drug testing were to be allowed to compete under the Olympic Flag as an \"Olympic Athlete from Russia\" (OAR).\n\nDecember 2019 - WADA bans Russia from all international sport for four years, after it was found that data provided by the Russian Anti-Doping Agency had been manipulated by Russian authorities with a goal of protecting athletes involved in its state-sponsored doping scheme. \n\nDecember 2020 - the Court of Arbitration decides to to reduce the penalty that WADA had placed. Instead of banning Russia from sporting events, the ruling allowed Russia to participate at the Olympics and other international events, but for a period of two years, the team cannot use the Russian name, flag, or anthem and must present themselves as \"Neutral Athlete\" or \"Neutral Team\". \n\nLiterally last night - Kamila Valieva, a FIFTEEN YEAR OLD LITERAL CHILD, is found to have taken Trimetazidine. This is a HEART MEDICATION that could seriously mess with someone as young as Kamila. \n\nI am so beyond just sick of this crap. Russia has absolutely ruined the Olympics and the enjoyment of figure skating as a sport for me. And I am beyond angry that they would mess with the health of an incredibly talented CHILD. \n\nRussia should not be competing in this or any other sporting event. It’s been literally 20 years of OVERT cheating that the whole world has witnessed time and time again. Enough is enough.",
            "title_similarity": "0.70402783",
            "sentiment_compound": -0.9777
        },
        {
            "id": "hwe3pxo",
            "score": 29,
            "text": "The good people of Russia need help.  This country is run by terrible people.",
            "title_similarity": "0.45546103",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hwdd1zz",
            "score": 2337,
            "text": "At least the IOC really went off and punished the cheaters…. By banning the ath…. No wait. They made them go by ROC. Whoaaa. Harsh.",
            "title_similarity": "0.5062859",
            "sentiment_compound": -0.7964
        },
        {
            "id": "hwdpmp3",
            "score": 934,
            "text": "The Olympics were so much more fun when I was a kid and I didn’t know about the money and the politics and the cheating but instead I was just enthralled but what I thought was nothing but the pure pinnacle of human athleticism.",
            "title_similarity": "0.50278974",
            "sentiment_compound": 0.0331
        },
        {
            "id": "hwde5t0",
            "score": 8381,
            "text": "If y’all didn’t know: a doping scandal is hitting the women’s singles figure skating OGM favorite right now. A drug that’s been banned for ages was found in her tests. The complication is that she is under 16\n\nI feel so, so terrible for her. She’s getting huge journalist traction and media hate, and she’s only 15. Her coaches couldn’t even support her by accompanying her places, since Olympic journalists are everywhere asking her insensitive questions. I hope she gets good support. She’s a lovely and sweet kid. As the Olympic champ Witt said, whichever adult orchestrated this should be banned for life. To people like Eteri, Kamila is disposable to them. They don’t really care about her. If they don’t get punished, they’ll just do the same thing to the next world-class FS talent. It’s just so wrong. I pray for Kamila and hope she is doing okay amidst all this. \n\nMOST RECENT UPDATE (2-10): Official report is out and available here (https://ita.sport/news/beijing-2022-the-ita-informs-on-figure-skater-kamila-valieva/#). In short, the test was submitted in 12-2021 and positive results came back on 2-8-2022. A suspension on her was put immediately into effect, but the Russian anti-doping agency lifted it yesterday (probably why we saw her training as if everything was normal). Now, the IOC is planning on appealing it (this likely means they seek to prevent her from competing in individuals, stripping her (and the entire team) of her already-attained gold medal, and potentially banning her in future competitions). I am personally predicting a success on IOC's part. This would only make it fair, but this also means that Anna and Sasha have likely also doped (perhaps unknowingly), while they will probably not get positive results.\n\nEDIT 1: for context, she’s Russian, lol\n\nShe is the girl who landed the first Olympic woman’s quad\n\nMore information is that she has now been allowed to attend training sessions. No one knows about the actual medals \n\nOverall, bad for everyone. She will have terrible reputation after this if she does get the two gold medals (team and individual). This will be even worse than the 2014 Sochi thing with Adelina, which ruined her career\n\nEDIT 2: Adelina did not dope. She won gold over 2010 champ Yuna Kim, which caused a huge controversy over how her score strangely got inflated during the Olympic season by a ton and how she was good friends with a judge (corruption)",
            "title_similarity": "0.67317164",
            "sentiment_compound": 0.8153
        },
        {
            "id": "hwdsghd",
            "score": 300,
            "text": "Sewer engineer was taking the piss",
            "title_similarity": "0.3670177",
            "sentiment_compound": -0.4019
        },
        {
            "id": "hwd9y0i",
            "score": 6851,
            "text": "Great documentary about this called Icarus on Netflix.",
            "title_similarity": "0.39360422",
            "sentiment_compound": 0.6249
        },
        {
            "id": "hwdfbhs",
            "score": 3823,
            "text": "What were the consequences of this?",
            "title_similarity": "-0.08049914",
            "sentiment_compound": 0.0
        },
        {
            "id": "hwdkek6",
            "score": 1,
            "text": "Oh but we showed them they have to go under the name of RCO!",
            "title_similarity": "0.06012141",
            "sentiment_compound": 0.0
        },
        {
            "id": "hwdlj5g",
            "score": 1,
            "text": "The Olympics are dead.",
            "title_similarity": "0.25308084",
            "sentiment_compound": -0.6486
        },
        {
            "id": "hwdmva5",
            "score": 1,
            "text": "But Putin said nothing happened.",
            "title_similarity": "0.114339404",
            "sentiment_compound": 0.0
        },
        {
            "id": "hwdnoat",
            "score": 1,
            "text": "Darknet diaries should do an episode on the guy who did that",
            "title_similarity": "0.33555472",
            "sentiment_compound": 0.0
        },
        {
            "id": "hwdnw9f",
            "score": 1,
            "text": "It's weird how little confidence Russia has in its athletes",
            "title_similarity": "0.34910178",
            "sentiment_compound": 0.3197
        },
        {
            "id": "hwdo2p4",
            "score": 1,
            "text": "I listened to a podcast on this and it was super elaborate. And that's why they have to be the ROC in the olympics right now, that'll show 'em!",
            "title_similarity": "0.500563",
            "sentiment_compound": 0.636
        },
        {
            "id": "hwdoom4",
            "score": 1,
            "text": "So, with their country renamed \"Russian Olympic Committee\", how does that make things different?  \n\nThey're still repping Russian, right?  Even after the IOC said they would not be eligible to win medals?  I know I am missing something.",
            "title_similarity": "0.6037809",
            "sentiment_compound": 0.4836
        },
        {
            "id": "hwdoq8m",
            "score": 1,
            "text": "Russians out here trying to make the worst name for themselves possible lolll. I feel sorry for all well-meaning Russian people with how bad of a reputation they have",
            "title_similarity": "0.5151076",
            "sentiment_compound": -0.836
        },
        {
            "id": "hwdpxgj",
            "score": 1,
            "text": "I bet you the secret agent did the ladder trick.",
            "title_similarity": "0.4058913",
            "sentiment_compound": -0.0516
        },
        {
            "id": "hwdq0b3",
            "score": 1,
            "text": "I feel like there's gotta be an easier way to play in the Olympics",
            "title_similarity": "0.2649721",
            "sentiment_compound": 0.7717
        },
        {
            "id": "hwdq6nu",
            "score": 1,
            "text": "So the Russian gloryhole",
            "title_similarity": "0.27368945",
            "sentiment_compound": 0.0
        },
        {
            "id": "hwdqp1j",
            "score": 1,
            "text": "Damn!!!",
            "title_similarity": "-0.15066344",
            "sentiment_compound": -0.5538
        },
        {
            "id": "hwdr4by",
            "score": 1,
            "text": "This was a huge story 8 years ago. I’m curious why it’s TIL but different people I guess \n\nThis is why they are the Russian Olympic Committee and not Russia at Olympics and I think other smaller events as well. The athletes can compete, just not under the Russian flag",
            "title_similarity": "0.6294056",
            "sentiment_compound": 0.6059
        },
        {
            "id": "hwdr5kj",
            "score": 1,
            "text": "why would they even take \"dirty\" samples? guy goes in with empty cup passes through the mouse hole and gets urine in a cup back?",
            "title_similarity": "0.65221196",
            "sentiment_compound": -0.6199
        },
        {
            "id": "hwdrcmu",
            "score": 1,
            "text": "TIL sucks. This was literally one of the top documentaries on Netflix.",
            "title_similarity": "0.35811386",
            "sentiment_compound": -0.1779
        },
        {
            "id": "hwdrfok",
            "score": 1,
            "text": "Shocked. I am shocked.",
            "title_similarity": "-0.0740795",
            "sentiment_compound": -0.5574
        },
        {
            "id": "hwdrn24",
            "score": 1,
            "text": "I mean honestly, why even bother anymore.",
            "title_similarity": "-0.016009092",
            "sentiment_compound": 0.1531
        },
        {
            "id": "hwdskie",
            "score": 1,
            "text": "Perfect cover. The agent kinda smells like piss…well duh, they’re a sewer engineer!",
            "title_similarity": "0.4750177",
            "sentiment_compound": 0.7362
        },
        {
            "id": "hwdtnhd",
            "score": 1,
            "text": "Is anyone surprised?",
            "title_similarity": "-0.12037119",
            "sentiment_compound": 0.2263
        },
        {
            "id": "hwdtp7i",
            "score": 1,
            "text": "You only learned about that today? Never wondered why the Russian olympic athletes are still competing under a neutral flag?",
            "title_similarity": "0.5514921",
            "sentiment_compound": 0.0
        },
        {
            "id": "hwdtwt9",
            "score": 1,
            "text": "Has OP been living in a cave? This was head line news around the world for months. Russian athletes have been banned from competing for ages, unless undeniably proven to be clean and then they compete as a neutral athlete under ROC",
            "title_similarity": "0.7016528",
            "sentiment_compound": -0.0772
        },
        {
            "id": "hwdu14n",
            "score": 1,
            "text": "Honestly that’s amazing. Let’s allow creative cheating in the Olympics and whoever cheats the best gets a metal. These athletes aren’t hero’s without some villains.",
            "title_similarity": "0.61110044",
            "sentiment_compound": 0.9172
        },
        {
            "id": "hwdukzr",
            "score": 1,
            "text": "Piss Heist",
            "title_similarity": "0.2477982",
            "sentiment_compound": -0.4019
        },
        {
            "id": "hwduqif",
            "score": 1,
            "text": "Its sad but on a world staged all countries have athletes that try and cheat 1 way or the other. They are just finding new ways that are easier to hide it.",
            "title_similarity": "0.5336342",
            "sentiment_compound": -0.5267
        },
        {
            "id": "hwdvaqp",
            "score": 1,
            "text": "I wish we would have had this kind of support when I was on the high school swim team.",
            "title_similarity": "0.39868468",
            "sentiment_compound": 0.6258
        },
        {
            "id": "hwdvf36",
            "score": 1,
            "text": "Honestly we should make cheating at the olympics an olympic sport. It seems what most teams are practicing anyway.",
            "title_similarity": "0.5323334",
            "sentiment_compound": -0.1531
        },
        {
            "id": "hwdvhco",
            "score": 1,
            "text": "Look at that, they cheated to win and all they won was shame.",
            "title_similarity": "0.34404716",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hwdvhsa",
            "score": 1,
            "text": "Just let them do all the drugs they want. Who cares",
            "title_similarity": "0.26732934",
            "sentiment_compound": 0.5106
        },
        {
            "id": "hwdvkjn",
            "score": 1,
            "text": "Well, at least China won't do anything like that.....",
            "title_similarity": "0.14393556",
            "sentiment_compound": -0.0026
        },
        {
            "id": "hwdvs28",
            "score": 7,
            "text": "I know this is an unpopular opinion, but do we really need something like the Olympics that encourages short sighted, nationalistic sentiment?",
            "title_similarity": "0.35946032",
            "sentiment_compound": 0.8174
        },
        {
            "id": "hwdvuxf",
            "score": 1,
            "text": "Wow.",
            "title_similarity": "-0.27905053",
            "sentiment_compound": 0.5859
        },
        {
            "id": "hwdwods",
            "score": 1,
            "text": "TDI china won 200 gold Medals , noone else won any medals anyone else was discalified",
            "title_similarity": "0.4018891",
            "sentiment_compound": 0.8126
        },
        {
            "id": "hwdwsc7",
            "score": 1,
            "text": "TIL I still don’t give a shit about the Olympics.",
            "title_similarity": "0.24910273",
            "sentiment_compound": -0.5574
        },
        {
            "id": "hwdwslm",
            "score": 1,
            "text": "Wait… Do people actually believe athletes (Olympic or pro) are clean? Come on…",
            "title_similarity": "0.40608868",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hwdwuxp",
            "score": 1,
            "text": "“Sports news” 🙄",
            "title_similarity": "0.12265892",
            "sentiment_compound": 0.0
        },
        {
            "id": "hwdx33k",
            "score": 1,
            "text": "> *...pretending to be a sewer engineer.*  \n  \nTechnically he *was* engineering sewage...",
            "title_similarity": "0.46325347",
            "sentiment_compound": 0.1027
        },
        {
            "id": "hwdx58t",
            "score": 1,
            "text": "It ain't cheatin' if you don't get caught.",
            "title_similarity": "0.04233948",
            "sentiment_compound": 0.0
        },
        {
            "id": "hwdxdvq",
            "score": 1,
            "text": "imagion using a pee hole to win sports",
            "title_similarity": "0.3436355",
            "sentiment_compound": 0.5859
        },
        {
            "id": "hwdxnwc",
            "score": 1,
            "text": "What's personal meaning does winning have if you cheated?",
            "title_similarity": "0.19315979",
            "sentiment_compound": 0.0258
        },
        {
            "id": "hwdy13s",
            "score": 1,
            "text": "When the Olympics has been turned from a coming together of nations for competition into a propaganda machine for \"look how happy, healthy, strong people we have\" and will cheat to keep up that image, it's time to burn it all to the ground and no longer have it. The spirit of the games is gone there is no point in having them anymore.",
            "title_similarity": "0.5330705",
            "sentiment_compound": 0.4588
        },
        {
            "id": "hwdygtb",
            "score": 1,
            "text": "This can't be real, but then again it could be. lol",
            "title_similarity": "-0.008801773",
            "sentiment_compound": 0.5719
        },
        {
            "id": "hwdyifa",
            "score": 1,
            "text": "Occupation?  Why I'm a Urine Smuggling Engineer!",
            "title_similarity": "0.49525917",
            "sentiment_compound": -0.5255
        },
        {
            "id": "hwdz4q4",
            "score": 1,
            "text": "Olympics should go back to being amateurs only",
            "title_similarity": "0.28305316",
            "sentiment_compound": 0.0
        },
        {
            "id": "hwdz8oi",
            "score": 3,
            "text": "The Olympics have been a fraud for decades. The Olympic committee is a cartel. No one is watching end them.",
            "title_similarity": "0.5763073",
            "sentiment_compound": -0.7184
        },
        {
            "id": "hwe040k",
            "score": 1,
            "text": "So... Russian athletes are ok with this?!",
            "title_similarity": "0.29300582",
            "sentiment_compound": 0.3595
        },
        {
            "id": "hwe089o",
            "score": 3,
            "text": "Wile E. Coyote with a saw under a test tube rack is what I see in my head.",
            "title_similarity": "0.52887976",
            "sentiment_compound": 0.0
        },
        {
            "id": "hwe0a1p",
            "score": 1,
            "text": "Piss connoisseur disguised as Russian agent",
            "title_similarity": "0.50348765",
            "sentiment_compound": -0.5859
        },
        {
            "id": "hwe0bz3",
            "score": 1,
            "text": "Christ, just take the L",
            "title_similarity": "-0.10202558",
            "sentiment_compound": 0.5766
        },
        {
            "id": "hwe0dqk",
            "score": 1,
            "text": "The anti-doping rules in athletics is a double edged sword that shouldn’t be.  It’s used less to keep athletes from cheating than it’s used to strip legitimate winners of their awards.",
            "title_similarity": "0.50882334",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hwe0m8p",
            "score": 1,
            "text": "sounds about right",
            "title_similarity": "-0.2907464",
            "sentiment_compound": 0.0
        },
        {
            "id": "hwe3l3t",
            "score": 1,
            "text": "Everyone is on them.",
            "title_similarity": "-0.1592685",
            "sentiment_compound": 0.0
        },
        {
            "id": "hwe3p5d",
            "score": 1,
            "text": "So frustrating. Why do we have to be like this?",
            "title_similarity": "0.03997197",
            "sentiment_compound": -0.1761
        },
        {
            "id": "hwe3x2t",
            "score": 1,
            "text": "The olympics feel like they’ve become such a joke of a spectacle now",
            "title_similarity": "0.3406839",
            "sentiment_compound": 0.5719
        },
        {
            "id": "hwe4wqw",
            "score": 1,
            "text": "Sounds like UCI Bike Racing...",
            "title_similarity": "0.0020996407",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hwe54xi",
            "score": 3,
            "text": "Yep corrupt governments gonna cheat.  They have to take shortcuts to pretend they are big players.",
            "title_similarity": "0.4670729",
            "sentiment_compound": -0.296
        },
        {
            "id": "hwe5py2",
            "score": 1,
            "text": "The true Olympic games happens behind the scenes among the various intelligence communities. Imagine all the spies trying to cheat for their countries, and all the other spies using the distraction to achieve completely different objectives. I just wish I had a spectator seat to that competition, because it must be wild.",
            "title_similarity": "0.662417",
            "sentiment_compound": 0.4588
        },
        {
            "id": "hwe6ppc",
            "score": 1,
            "text": "That's why Olympics are not Dope anymore.",
            "title_similarity": "0.20053779",
            "sentiment_compound": 0.0
        },
        {
            "id": "hwe6ss2",
            "score": 1,
            "text": "If we played a game of basketball, and I obviously cheated as much as possible to win, then I flexed on everyone how great I am for winning, I would get kicked in the dick.\n\nFor some reason this is normal practice for countries to do tho, so lame.",
            "title_similarity": "0.499688",
            "sentiment_compound": 0.5398
        },
        {
            "id": "hwe6uc7",
            "score": 1,
            "text": "So this is the CPC propaganda coming through now? Divert attention elsewhere. Do they even try to hide this lol?",
            "title_similarity": "0.3938703",
            "sentiment_compound": 0.2287
        },
        {
            "id": "hwe71gr",
            "score": 1,
            "text": "insane",
            "title_similarity": "-0.0920635",
            "sentiment_compound": -0.4019
        },
        {
            "id": "hwe7k1w",
            "score": 1,
            "text": "Didn’t a Russian athlete just text positive yesterday?",
            "title_similarity": "0.47742245",
            "sentiment_compound": 0.5574
        },
        {
            "id": "hwe7liv",
            "score": 1,
            "text": "That is so fucking greasy yet so fucking unsurprising\n\nFuck the IOC on a side note",
            "title_similarity": "0.40949073",
            "sentiment_compound": -0.6177
        },
        {
            "id": "hwe8evk",
            "score": 1,
            "text": "Breaking news! ..... It was, about more then 5 years ago.",
            "title_similarity": "0.19809729",
            "sentiment_compound": 0.0
        },
        {
            "id": "hwe8fh9",
            "score": 1,
            "text": "I remember this!",
            "title_similarity": "-0.23434752",
            "sentiment_compound": 0.0
        },
        {
            "id": "hwe8iml",
            "score": 1,
            "text": "It’s a game….",
            "title_similarity": "-0.102029175",
            "sentiment_compound": 0.0
        },
        {
            "id": "hwe8kqa",
            "score": 1,
            "text": "I wonder who will make the film about all the cheating in China?",
            "title_similarity": "0.50814635",
            "sentiment_compound": -0.5574
        },
        {
            "id": "hwe8xdw",
            "score": 1,
            "text": "I dont get why Russia is taking the olympics so serious enough to cheat. The cold old war is over the prestige payout isnt the same as it was.",
            "title_similarity": "0.54935455",
            "sentiment_compound": -0.8244
        },
        {
            "id": "hwe9825",
            "score": 1,
            "text": "Oceans 11k",
            "title_similarity": "-0.0029054293",
            "sentiment_compound": 0.0
        },
        {
            "id": "hwe99mj",
            "score": 1,
            "text": "If all the athletes who take banned substances were actually caught, there'd be no Olympics. Everyone does them from every country. It's a game of not getting caught, paying the right people off, and cheating the tests.",
            "title_similarity": "0.66310316",
            "sentiment_compound": -0.8316
        },
        {
            "id": "hwe9cjz",
            "score": 1,
            "text": "Ah, glad to see sportsmanship and the Spirit of the Olympic games is alive and well!",
            "title_similarity": "0.15549818",
            "sentiment_compound": 0.8268
        },
        {
            "id": "hwe9dal",
            "score": 1,
            "text": "Sochi is Russia. That's a lot of effort for cheating in your own backyard.",
            "title_similarity": "0.61453223",
            "sentiment_compound": -0.5574
        },
        {
            "id": "hwe9dti",
            "score": 1,
            "text": "They’re missing the point, as always",
            "title_similarity": "0.036475673",
            "sentiment_compound": -0.296
        },
        {
            "id": "hwe9sq2",
            "score": 1,
            "text": "If they just stopped testing everyone these cases would disappear. /s",
            "title_similarity": "0.27318543",
            "sentiment_compound": -0.4215
        },
        {
            "id": "hwe9yaj",
            "score": 1,
            "text": "Did they win sg by cheating?",
            "title_similarity": "0.24622272",
            "sentiment_compound": 0.0516
        },
        {
            "id": "hwea9yu",
            "score": 1,
            "text": "Ffs Russia leaders can you guys NOT so some shady shit for  FIVE SECONDS.",
            "title_similarity": "0.54241544",
            "sentiment_compound": -0.8255
        },
        {
            "id": "hweatup",
            "score": 1,
            "text": "But why? Why go through all of that hassle? Its not like theres anything actually at stake. I dont even know anyone who watches the winter olympics. And wouldnt it be cooler to see how you match up with others around the world without doping?",
            "title_similarity": "0.56547624",
            "sentiment_compound": -0.4948
        },
        {
            "id": "hweauid",
            "score": 1,
            "text": "There are plenty of legit athletes, but competition gets the better of people, and they would rather win by any means than fair and square. The Olympics is a joke.",
            "title_similarity": "0.43027806",
            "sentiment_compound": 0.9413
        },
        {
            "id": "hweax94",
            "score": 1,
            "text": "Yup. Anything won by China, Russia, or the USA needs an asterisk next to it.",
            "title_similarity": "0.4145333",
            "sentiment_compound": 0.5719
        },
        {
            "id": "hweaxu6",
            "score": 1,
            "text": "That’s crappy",
            "title_similarity": "-0.07153994",
            "sentiment_compound": -0.5574
        },
        {
            "id": "hweb1bu",
            "score": 1,
            "text": "So basically the Olympics are a terrible measure of skill.  It's just about which country cheats the best",
            "title_similarity": "0.49377578",
            "sentiment_compound": -0.1779
        },
        {
            "id": "hwebv9x",
            "score": 1,
            "text": "this is why we cannot have nice things.",
            "title_similarity": "0.09612468",
            "sentiment_compound": -0.3252
        },
        {
            "id": "hwec0em",
            "score": 1,
            "text": "IOC is corrupt...",
            "title_similarity": "0.2153495",
            "sentiment_compound": 0.0
        },
        {
            "id": "hwec0zo",
            "score": 1,
            "text": "Fuck it, let EVERYONE dope. Let's see how roided up we can make athletes",
            "title_similarity": "0.35932702",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hwec59l",
            "score": 4,
            "text": "Can't decide on if China spiked the samples or Russia did it. China shown its colors this olympic games, and Russia has its history",
            "title_similarity": "0.56113034",
            "sentiment_compound": 0.0
        },
        {
            "id": "hwec9d8",
            "score": 1,
            "text": "Frankly why do we even have the olympics anymore?\n\nThe spirit is long gone and dead. Its about cheating and pepsi commercials at this point. Not being all of humanity together.",
            "title_similarity": "0.5271836",
            "sentiment_compound": -0.802
        },
        {
            "id": "hwecddi",
            "score": 1,
            "text": "Lmao I honest to god pity anyone who's insecure enough to go to such lengths to win a game.",
            "title_similarity": "0.3554973",
            "sentiment_compound": 0.8442
        },
        {
            "id": "hwecei6",
            "score": 1,
            "text": "The Olympics should be about the *athletes* but the *counties* ruin the fun….",
            "title_similarity": "0.4801047",
            "sentiment_compound": -0.7351
        },
        {
            "id": "hweckwq",
            "score": 1,
            "text": "Classic russia",
            "title_similarity": "0.15942746",
            "sentiment_compound": 0.0
        },
        {
            "id": "hwecze4",
            "score": 1,
            "text": "So have the Olympics just been about posture and cheating since Hitler attended? Why can't we just have fair games, literally nothing happens when one country wins a lot, and when you cheat everything is lost. There will always be another Olympics just as there always has been, this just pushes people away from watching even more. I don't get why Russia and somewhat lesser China continuously needs to shit on their own flag by doping up their athletes like this.",
            "title_similarity": "0.5995097",
            "sentiment_compound": -0.6124
        },
        {
            "id": "hwedvpc",
            "score": 1,
            "text": "Lol wonder how China is cheating",
            "title_similarity": "0.305117",
            "sentiment_compound": -0.2023
        },
        {
            "id": "hwee5ue",
            "score": 3,
            "text": "Ever heard of a video camera to watch lab samples? It's not rocket science.",
            "title_similarity": "0.4208203",
            "sentiment_compound": 0.0
        },
        {
            "id": "hwee8p3",
            "score": 1,
            "text": "I think the mouse holes were actually fake electrical receptacle boxes that were pass throughs.",
            "title_similarity": "0.56368494",
            "sentiment_compound": -0.4767
        },
        {
            "id": "hweeeoy",
            "score": 1,
            "text": "Add me",
            "title_similarity": "-0.17439008",
            "sentiment_compound": 0.0
        },
        {
            "id": "hweeg5b",
            "score": 1,
            "text": "It’s why the olympics bore me so much. Everyone is cheating and it’s just about money and political power. It’s not really about sports at this point.",
            "title_similarity": "0.5411094",
            "sentiment_compound": -0.6808
        },
        {
            "id": "hweeo6k",
            "score": 1,
            "text": "Is anyone surprised?",
            "title_similarity": "-0.12037119",
            "sentiment_compound": 0.2263
        },
        {
            "id": "hwef8mb",
            "score": 1,
            "text": "Learn this from Last Week Tonight?",
            "title_similarity": "0.15191717",
            "sentiment_compound": 0.0
        },
        {
            "id": "hwefd6a",
            "score": 1,
            "text": "Hey this was just on the Joe Rogan show, cool!",
            "title_similarity": "0.15404305",
            "sentiment_compound": 0.3802
        },
        {
            "id": "hwefeaw",
            "score": 1,
            "text": "\"Our doped up guy beat your doped up guys\" - Bill Burr\n\nShow me a well known professional athlete in any major sport, thats not doping, and I'll show you a unicorn. I promise.",
            "title_similarity": "0.5524966",
            "sentiment_compound": 0.5267
        },
        {
            "id": "hwefjp3",
            "score": 1,
            "text": "I was confused by the title and wording. It's the other way around - unclean urine was exchanged for the clean samples.",
            "title_similarity": "0.49825722",
            "sentiment_compound": 0.1027
        },
        {
            "id": "hwehgqu",
            "score": 1,
            "text": "Old joke but just say f*ck it and see how high a human really can jump. Have the performance enhanced compete against there own. Prothesis runners can beat able runners. Say throw them in the running to. Totally ok with bionic men & such.",
            "title_similarity": "0.47550535",
            "sentiment_compound": 0.5913
        },
        {
            "id": "hwehxnm",
            "score": 1,
            "text": "Time for this? https://m.youtube.com/watch?v=jAdG-iTilWU",
            "title_similarity": "0.08902919",
            "sentiment_compound": 0.0
        },
        {
            "id": "hweiupz",
            "score": 1,
            "text": "Y’all haven’t seen the Netflix doc?",
            "title_similarity": "0.30206928",
            "sentiment_compound": 0.0
        },
        {
            "id": "hweizq2",
            "score": 1,
            "text": "Putin and every other corrupt politician: “It’s a political attack!”",
            "title_similarity": "0.48622003",
            "sentiment_compound": 0.0
        },
        {
            "id": "hwej2ua",
            "score": 1,
            "text": "There should be competitions in which athletes are allowed to take as much as any drugs as they want and doping is fair game. Bring it on scientists.",
            "title_similarity": "0.49216247",
            "sentiment_compound": 0.3818
        },
        {
            "id": "hwekggw",
            "score": 1,
            "text": "Mouse hole, glory hole, whatever.",
            "title_similarity": "0.07568763",
            "sentiment_compound": 0.5423
        },
        {
            "id": "hwekkna",
            "score": 1,
            "text": "imagine training as a spy/agent just to smuggle a few liters of piss.",
            "title_similarity": "0.58811545",
            "sentiment_compound": -0.6486
        },
        {
            "id": "hweksxb",
            "score": 1,
            "text": "You only just heard about this??? \n\nI’m sure Komrade Putin inspected each sample personally before the switches were made lol.",
            "title_similarity": "0.56350833",
            "sentiment_compound": 0.6848
        },
        {
            "id": "hwektlv",
            "score": 1,
            "text": "If you can't afford to give your athletes cutting edge supplements that haven't been made illegal yet you got to get creative I suppose.",
            "title_similarity": "0.3734672",
            "sentiment_compound": 0.6513
        },
        {
            "id": "hwekwh8",
            "score": 1,
            "text": "The Olympics is a shit show this year.",
            "title_similarity": "0.37848607",
            "sentiment_compound": -0.5574
        },
        {
            "id": "hwel44l",
            "score": 1,
            "text": "Man, cheating is wrong…. But that’s pretty badass",
            "title_similarity": "0.23711675",
            "sentiment_compound": 0.7269
        },
        {
            "id": "hwela8t",
            "score": 1,
            "text": "I gotta say, if I’m a part of the Olympic committee and some dude with a heavy Russian accent just so happened to need access to the urine sample lab, I’d probably call my boss",
            "title_similarity": "0.7686364",
            "sentiment_compound": 0.0
        },
        {
            "id": "hwelmyj",
            "score": 1,
            "text": "All professional athletes dope, yes even your favorite American Olympians",
            "title_similarity": "0.34622258",
            "sentiment_compound": 0.6908
        },
        {
            "id": "hwelt6d",
            "score": 1,
            "text": "Will there be any consequences for that chinese skater throwing debris at the other skater’s feet? That move felt pretty “off the books” to me",
            "title_similarity": "0.5762309",
            "sentiment_compound": 0.4939
        },
        {
            "id": "hwem6ub",
            "score": 1,
            "text": "5 years ago I learned. Like literally, this was huge national news. What were you doing? Lmao",
            "title_similarity": "0.28661618",
            "sentiment_compound": 0.8271
        },
        {
            "id": "hwem80g",
            "score": 1,
            "text": "This is why hardly anyone cares about the Olympics anymore. We all know it’s a sham, bankrupts local cities and is often built on the backs of slave labor for a bunch of sports many could care less about (no shade to the athletes)",
            "title_similarity": "0.5281045",
            "sentiment_compound": 0.6929
        },
        {
            "id": "hweme4y",
            "score": 1,
            "text": "Based Russia",
            "title_similarity": "0.19352686",
            "sentiment_compound": 0.0
        },
        {
            "id": "hwemh8v",
            "score": 1,
            "text": "I love how a story about Russians cheating using PEDs comes up while the Chinese are almost certainly doing the same thing as we speak.",
            "title_similarity": "0.56729996",
            "sentiment_compound": 0.4033
        },
        {
            "id": "hwemlo9",
            "score": 1,
            "text": "The Astro's cheated and nothing happened but we did keep Pete Rose out of the Hall for gambling, not cheating, cheating is acceptable practice",
            "title_similarity": "0.5389179",
            "sentiment_compound": 0.8615
        },
        {
            "id": "hwen32l",
            "score": 1,
            "text": "At what point is it just easier to do it legit?",
            "title_similarity": "-0.081976786",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hwen3gs",
            "score": 1,
            "text": "LMAO!! And they only get 2 years, which basically is a wash.",
            "title_similarity": "0.29543132",
            "sentiment_compound": 0.7365
        },
        {
            "id": "hwen5k5",
            "score": 1,
            "text": "They should have been banned from participating in all Olympic events for 20 years.  But considering the IOC is one of the most corrupt organizations in the world...",
            "title_similarity": "0.56192124",
            "sentiment_compound": -0.25
        },
        {
            "id": "hwen5t6",
            "score": 1,
            "text": "Wtf is Russia's deal man. It's a fucking sport. A Sport who gives that much of a fuck. These nationalist assholes.",
            "title_similarity": "0.49587226",
            "sentiment_compound": -0.9022
        },
        {
            "id": "hwenww5",
            "score": 1,
            "text": "I wish the sanctions were for two OLYMPICS instead of two years.\n\nAnd the coaches and athletes involved should get a perma-ban",
            "title_similarity": "0.54445183",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hweob56",
            "score": 1,
            "text": "They could engineer this but no one knew how to instal a toilet seat correctly?",
            "title_similarity": "0.44586968",
            "sentiment_compound": -0.4215
        },
        {
            "id": "hwepcpa",
            "score": 1,
            "text": "God i love/hate the russians",
            "title_similarity": "0.33418107",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hweq3v4",
            "score": 6,
            "text": "\"Everybody's on steroids\" - Nate Diaz",
            "title_similarity": "0.28430378",
            "sentiment_compound": 0.0
        },
        {
            "id": "hweqf7t",
            "score": 1,
            "text": "Pathetic",
            "title_similarity": "-0.071770296",
            "sentiment_compound": -0.5719
        },
        {
            "id": "hweqni6",
            "score": 1,
            "text": "That sounds like some Mission: Impossible antics.",
            "title_similarity": "0.0657749",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hweqrjp",
            "score": 1,
            "text": "Does anyone care about the Olympics anymore? I say let ‘em all dope up and let’s see how SUPERHUMAN these athletes can be.",
            "title_similarity": "0.53078943",
            "sentiment_compound": 0.4939
        },
        {
            "id": "hweqxcu",
            "score": 1,
            "text": "Didn't know. But I can believe this",
            "title_similarity": "-0.11404905",
            "sentiment_compound": 0.0
        },
        {
            "id": "hwer7jo",
            "score": 1,
            "text": "& that's why they r sanctioned. Why they r allowed 2 compete at all. & u can bet the CCP r up 2 something  similar",
            "title_similarity": "0.31971127",
            "sentiment_compound": 0.0
        },
        {
            "id": "hwermgb",
            "score": 1,
            "text": "If we're never gonna stop athlete's from doping 100% across the board why don't we just get real weird on it and make doping mandatory. Olympic Weight Lifting would be real fun with a bunch of roided up peeps",
            "title_similarity": "0.54422593",
            "sentiment_compound": 0.5842
        },
        {
            "id": "hweryl1",
            "score": 1,
            "text": "They should just add a new discipline called the podium pissing and force every single athlete who finish in the top three to compete or give up their medals.",
            "title_similarity": "0.48178104",
            "sentiment_compound": -0.2263
        },
        {
            "id": "hwet0u6",
            "score": 1,
            "text": "Don’t you mean members of the Russian Olympic Committee made a small hole to clean urine samples from members of the Russian Olympic Committee?",
            "title_similarity": "0.7842257",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hwets8k",
            "score": 1,
            "text": "Russian's and cheating at the Olympics name a more iconic duo.",
            "title_similarity": "0.5621775",
            "sentiment_compound": -0.5574
        },
        {
            "id": "hwetxsg",
            "score": 1,
            "text": "I AM A SWEDISH PLUMBER!",
            "title_similarity": "0.4689052",
            "sentiment_compound": 0.0
        },
        {
            "id": "hweuaco",
            "score": 1,
            "text": "Imagine training as an agent your whole adult life and your assignment is to chaperone piss. Some shameful shit.",
            "title_similarity": "0.4998929",
            "sentiment_compound": -0.8591
        },
        {
            "id": "hweunm7",
            "score": 1,
            "text": "Man, this is some after school kids show level of try hard.",
            "title_similarity": "0.27397126",
            "sentiment_compound": -0.1027
        },
        {
            "id": "hwev4zn",
            "score": 1,
            "text": "Can't imagine more than 100 Russian olympic level athletes thought cheating was ok.",
            "title_similarity": "0.58024704",
            "sentiment_compound": -0.5574
        },
        {
            "id": "hwewaxw",
            "score": 1,
            "text": "Yeah, bold Russia, I can't believe what they did, I but my steroids direct from Russian Olympic athletes as they aren't available anywhere else in the world",
            "title_similarity": "0.6802461",
            "sentiment_compound": 0.34
        },
        {
            "id": "hwewo20",
            "score": 1,
            "text": "We need to cancel the Olympics and make a new olympics...with blackjack and hookers.",
            "title_similarity": "0.47209352",
            "sentiment_compound": -0.25
        },
        {
            "id": "hwexh5q",
            "score": 1,
            "text": "And now the figure skater tested positive lol",
            "title_similarity": "0.22921853",
            "sentiment_compound": 0.7506
        },
        {
            "id": "hwexmuq",
            "score": 1,
            "text": "so they are still doing what they did to get banned, but unlike facebook the olymics never actually ban people for being bad, where facebook bans based on political views",
            "title_similarity": "0.47229153",
            "sentiment_compound": -0.4337
        },
        {
            "id": "hwez2rp",
            "score": 3,
            "text": "The real Olympic games are all the cheating and corruption governments will go through to compete in the Olympic games.",
            "title_similarity": "0.6284214",
            "sentiment_compound": -0.5574
        },
        {
            "id": "hwezg07",
            "score": 1,
            "text": "Why are we talking about Italy in 2016,  Germany in the 70s, Ben Johnson in 1988?",
            "title_similarity": "0.26479906",
            "sentiment_compound": 0.0
        },
        {
            "id": "hwf0o98",
            "score": 1,
            "text": "That the problem with running your nation like a crime syndicate, is that not everyone works for you.",
            "title_similarity": "0.42685646",
            "sentiment_compound": -0.5719
        },
        {
            "id": "hwf1meh",
            "score": 1,
            "text": "Apparently it didn’t work.",
            "title_similarity": "-0.065882474",
            "sentiment_compound": 0.0
        },
        {
            "id": "hwf1u3g",
            "score": 1,
            "text": "sadly this is why I stopped paying attention to the olympics. what’s the point of it all if there is sanctioned cheating? BORING.",
            "title_similarity": "0.52442884",
            "sentiment_compound": -0.8842
        },
        {
            "id": "hwf2m88",
            "score": 1,
            "text": "once this stuff gets proven, why don't they just get banned from participating?",
            "title_similarity": "0.23921862",
            "sentiment_compound": -0.4588
        },
        {
            "id": "hwf2uee",
            "score": 1,
            "text": "How were they found out?",
            "title_similarity": "0.06651174",
            "sentiment_compound": 0.0
        },
        {
            "id": "hwf2wev",
            "score": 1,
            "text": "Watch Icarus and prepare to be mind-blown. It’s on Netflix.",
            "title_similarity": "0.39029205",
            "sentiment_compound": 0.0
        },
        {
            "id": "hwf2zm7",
            "score": 1,
            "text": "> Rodchenkov, who ~~is now~~ **was poisoned** in Los Angeles, has estimated that 100 urine samples were swapped out during the Olympics, including those of at least 15 Russian medal winners.\n\nAn edit from the future",
            "title_similarity": "0.7222944",
            "sentiment_compound": 0.4588
        },
        {
            "id": "hwf30bt",
            "score": 1,
            "text": "Why?",
            "title_similarity": "-0.17360835",
            "sentiment_compound": 0.0
        },
        {
            "id": "hwf36f8",
            "score": 1,
            "text": "ITT: People who think only Russia gets all their athletes on all sorts of gear",
            "title_similarity": "0.49093604",
            "sentiment_compound": 0.0
        },
        {
            "id": "hwf3kya",
            "score": 2,
            "text": "Something important to note about steroids/doling for athletes is that the effects last far far beyond what is testable. The core of what steroids allows is to train more and rest/recover more quickly, to then train more. An athlete on steroids in the off season can grow big muscles while no one is testing, and then go off them for competition. \n\nTesting just ensures they catch what they can, and at least the athletes are encountering the same stamina and rest challenges as each other. Athletes compete in multiple events over a long period, so something extended like the Tour de France is more likely to catch a doped athlete than, say for example, Major League Baseball home run hitters. \n\nMy isn’t it amazing how the MLB almost shut down after the strike, and people started to lose internet, and then Bonds and McGwire starting hitting insane amounts of home runs and people got interested again? What a coincidence.",
            "title_similarity": "0.44586325",
            "sentiment_compound": 0.6666
        },
        {
            "id": "hwf4qr1",
            "score": 1,
            "text": "Russia has to be the dirtiest, most insecure country, from top to bottom, on the planet. Good lord. Just win on your own merits.",
            "title_similarity": "0.45064187",
            "sentiment_compound": 0.5729
        },
        {
            "id": "hwf5so6",
            "score": 1,
            "text": "I don't understand why countries care so much they have to cheat. People pretty much forget about the Olympics the week after they air",
            "title_similarity": "0.529919",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hwf5uk6",
            "score": 1,
            "text": "Yet this nation is allowed to compete in the Olympics.\n\nWhy does anyone watch the fucking Olympics?",
            "title_similarity": "0.495802",
            "sentiment_compound": 0.0
        },
        {
            "id": "hwf5vem",
            "score": 1,
            "text": "I kind of admire Russia for stuff like that.  You can't have the wacky races without Dick Dastardly.",
            "title_similarity": "0.5180061",
            "sentiment_compound": 0.7911
        },
        {
            "id": "hwf6077",
            "score": 1,
            "text": "And they still couldn’t win any gold",
            "title_similarity": "0.087299064",
            "sentiment_compound": 0.5859
        },
        {
            "id": "hwf61bj",
            "score": 1,
            "text": "If anyone hasn’t seen the Academy Award winning doc about this subject, I suggest that you do. It is called “Icarus” and is eye opening to say the least. \n\nThe Russian scientist who led the effort in the laboratory (on orders from a high level official of course) is the focus of this documentary.",
            "title_similarity": "0.66444767",
            "sentiment_compound": 0.7845
        },
        {
            "id": "hwf6874",
            "score": 1,
            "text": "Someone just saw Icarus lol\n\nSeriously though, fucking insane story",
            "title_similarity": "0.33801234",
            "sentiment_compound": -0.2247
        },
        {
            "id": "hwf6nkd",
            "score": 1,
            "text": "Well when your country is a dictatorship",
            "title_similarity": "0.16726425",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hwf6nsx",
            "score": 1,
            "text": "Sounds appropriate.    No russian ever did anything that wasn't corrupt, selfish, lazy and criminal.   Path of least resistance no matter what.  You have to search long and hard to find a good person there.     And the government there is worse.   Pure evil.",
            "title_similarity": "0.5893294",
            "sentiment_compound": -0.7912
        },
        {
            "id": "hwf6pvz",
            "score": 1,
            "text": "Watch Icarus. It’s a phenomenal documentary on doping and this doping scandal.",
            "title_similarity": "0.5521188",
            "sentiment_compound": -0.4404
        },
        {
            "id": "hwf6qox",
            "score": 1,
            "text": "Always some dickface that's gotta cheat.",
            "title_similarity": "0.31179878",
            "sentiment_compound": -0.4588
        },
        {
            "id": "hwf70q9",
            "score": 1,
            "text": "Olympics is not what it is anymore. IOC has ruined the integrity of the games and made it more of a money grab. It's just another case of rich get's richer and poor gets poorer. Imagine coming from a third world country to compete at a high level, training for years, just to be either DQ'd by the host nation for questionable reasons or lose against someone who was caught doping (which you can't afford anyways) just for the penalty being a slap on a wrist. Shame.",
            "title_similarity": "0.5733402",
            "sentiment_compound": -0.8176
        },
        {
            "id": "hwf7cst",
            "score": 1,
            "text": "But the doping allegations against their athletes this year are false, right?",
            "title_similarity": "0.50215393",
            "sentiment_compound": 0.0
        },
        {
            "id": "hwf7knd",
            "score": 1,
            "text": "Cheating is only necessary when you fuckin suck.",
            "title_similarity": "0.3114748",
            "sentiment_compound": -0.7778
        },
        {
            "id": "hwf7uq3",
            "score": 1,
            "text": "So legit questions\n1. Who's more fucked up. America or Russia?\n2. 4 year ban that's it? Malicious intent of the Russian Olympian crews not just athletes.\n3. Is the rest of humans on this planet sick of governments ALWAYS trying to pull off some sort of shady shit?",
            "title_similarity": "0.6574055",
            "sentiment_compound": -0.9519
        },
        {
            "id": "hwf7vci",
            "score": 1,
            "text": "Today you went searching for 6 year old news articles?",
            "title_similarity": "0.40358627",
            "sentiment_compound": 0.0
        },
        {
            "id": "hwf885b",
            "score": 1,
            "text": "I mean most pro level athletes use PEDs but yeah I mean passing the tests this way...",
            "title_similarity": "0.49721277",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hwf89nx",
            "score": 1,
            "text": "What did they do with the pee? Especially from the female athletes?",
            "title_similarity": "0.34911788",
            "sentiment_compound": 0.0
        },
        {
            "id": "hwf8c40",
            "score": 1,
            "text": "This post just reminded I never finished watching Icarus.",
            "title_similarity": "0.3602007",
            "sentiment_compound": 0.0
        },
        {
            "id": "hwf93x3",
            "score": 1,
            "text": "This is so wild you can’t make it up",
            "title_similarity": "0.063875325",
            "sentiment_compound": 0.0
        },
        {
            "id": "hwf9n3e",
            "score": 1,
            "text": "I don’t give a fuck about cheating  at the Olympics, and people who invest nationalist generalizations into figure skating medals or whatever are awful.",
            "title_similarity": "0.6026777",
            "sentiment_compound": -0.8779
        },
        {
            "id": "hwfaa6x",
            "score": 5,
            "text": "They also gave Bob Costas pinkeye.",
            "title_similarity": "0.19212765",
            "sentiment_compound": 0.0
        },
        {
            "id": "hwfaxtl",
            "score": 1,
            "text": "Who else but the Russians",
            "title_similarity": "0.22598812",
            "sentiment_compound": 0.0
        },
        {
            "id": "hwfbpon",
            "score": 1,
            "text": "Icarus is a good doc on Russian doping scandals. also interesting lance Armstrong got got for doping and like top 18 were doing",
            "title_similarity": "0.6527599",
            "sentiment_compound": 0.6908
        },
        {
            "id": "hwfby3p",
            "score": 1,
            "text": "Scum. Let the nuclear fire clear the planet.",
            "title_similarity": "0.39153016",
            "sentiment_compound": 0.0516
        },
        {
            "id": "hwfcgjj",
            "score": 1,
            "text": "they should make a movie about it",
            "title_similarity": "0.098204195",
            "sentiment_compound": 0.0
        },
        {
            "id": "hwfcomu",
            "score": 3,
            "text": "If China's not doing the same kind of thing right now, I think I'd literally die of shock.",
            "title_similarity": "0.28087744",
            "sentiment_compound": -0.7579
        },
        {
            "id": "hwfcs2l",
            "score": 1,
            "text": "Lol imagine being a piss spy.",
            "title_similarity": "0.3062698",
            "sentiment_compound": 0.0258
        },
        {
            "id": "hwfcwpd",
            "score": 1,
            "text": "So embarrassing that they go to all that effort to cheat. Why don't they just put all that effort into training?",
            "title_similarity": "0.44015688",
            "sentiment_compound": -0.7089
        },
        {
            "id": "hwfd5fa",
            "score": 3,
            "text": "Crazy they are still in the olympics but doping is widespread.",
            "title_similarity": "0.5227643",
            "sentiment_compound": -0.1779
        },
        {
            "id": "hwfebd6",
            "score": 1,
            "text": "They're still cheating. Ban them from international sport.",
            "title_similarity": "0.30344552",
            "sentiment_compound": -0.802
        },
        {
            "id": "hwfegxq",
            "score": 1,
            "text": "Didn't they still not win the medal count? How embarrassing for them lmaoo",
            "title_similarity": "0.34308028",
            "sentiment_compound": -0.8034
        },
        {
            "id": "hwfeidj",
            "score": 1,
            "text": "Russia never cease to meet my expectations.",
            "title_similarity": "0.26196945",
            "sentiment_compound": 0.0
        },
        {
            "id": "hwfeit8",
            "score": 1,
            "text": "Olympics are silly",
            "title_similarity": "0.1671551",
            "sentiment_compound": 0.0258
        },
        {
            "id": "hwfejyv",
            "score": 1,
            "text": "Go watch Icarus.",
            "title_similarity": "0.18036115",
            "sentiment_compound": 0.0
        },
        {
            "id": "hwferbf",
            "score": 1,
            "text": "This is detailed thoroughly in the docudrama Icarus",
            "title_similarity": "0.18181726",
            "sentiment_compound": 0.0
        },
        {
            "id": "hwffs9w",
            "score": 1,
            "text": "In Soviet Russia, sewage engineers you!",
            "title_similarity": "0.5340249",
            "sentiment_compound": 0.0
        },
        {
            "id": "hwffy1z",
            "score": 1,
            "text": "how did you just learn this today 8 years after the fact when it was on every news headline for a month and was discussed during the summer olympics..?",
            "title_similarity": "0.4403202",
            "sentiment_compound": 0.0
        },
        {
            "id": "hwfgv40",
            "score": 1,
            "text": "Would recommend the documentary “Icarus” which dives pretty deep into dopping and Russia during the 2014 Olympics.",
            "title_similarity": "0.6657305",
            "sentiment_compound": 0.6908
        },
        {
            "id": "hwfgvsx",
            "score": 1,
            "text": "JRE",
            "title_similarity": "-0.20905815",
            "sentiment_compound": 0.0
        },
        {
            "id": "hwfgxrg",
            "score": 1,
            "text": "Everybody Lies\n\nHouse",
            "title_similarity": "0.15937713",
            "sentiment_compound": -0.4215
        },
        {
            "id": "hwfhjnn",
            "score": 1,
            "text": "This is the real Olympics who ever can cheat, dope, or do spy shit and not get caught is the true winner",
            "title_similarity": "0.49238133",
            "sentiment_compound": 0.0
        },
        {
            "id": "hwfjbgg",
            "score": 1,
            "text": "Whatch “Icarus” on Netflix. Riveting documentary about this",
            "title_similarity": "0.34761387",
            "sentiment_compound": 0.0
        },
        {
            "id": "hwfkgte",
            "score": 1,
            "text": "The Russian are annoyingly dishonest. It's like they just don't give a rat's tail about rules, and when caught, they still don't care. \n\nEven Olympic athletes are THAT dirty.",
            "title_similarity": "0.5408797",
            "sentiment_compound": -0.7736
        },
        {
            "id": "hwfkn2x",
            "score": 1,
            "text": "Does Russia ever do anything good?",
            "title_similarity": "0.29279804",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hwfle53",
            "score": 1,
            "text": "It's crazy Russia is allowed to compete in any Olympics.",
            "title_similarity": "0.5201261",
            "sentiment_compound": -0.34
        },
        {
            "id": "hwfmd2q",
            "score": 1,
            "text": "There’s a documentary on Netflix called Icarus about this whole thing.",
            "title_similarity": "0.4116943",
            "sentiment_compound": 0.0
        },
        {
            "id": "hwfn3y6",
            "score": 3,
            "text": "The Olympics don't matter anymore. Can we stop trying",
            "title_similarity": "0.29143208",
            "sentiment_compound": -0.3125
        },
        {
            "id": "hwfn5nh",
            "score": 1,
            "text": "If you think Uncle Sam hasn’t been engaging in the same kind/level of activity you are very much mistaken. Russia just got caught… The world is not pretty.",
            "title_similarity": "0.4850541",
            "sentiment_compound": -0.46
        },
        {
            "id": "hwfnyn4",
            "score": 1,
            "text": "If you would have watched Icarus a few years ago you wouldn’t have just learned this today…",
            "title_similarity": "0.3574863",
            "sentiment_compound": 0.0
        },
        {
            "id": "hwfo8bw",
            "score": 1,
            "text": "Tbh everyone in the olympics is on the juice. Most are just smart enough to lay off it when the testing time comes",
            "title_similarity": "0.483662",
            "sentiment_compound": 0.4522
        },
        {
            "id": "hwfoaqv",
            "score": 1,
            "text": "Lol and here we are again, a Russian figure skater tested positive for an illegal substance, and they're still going to allow her to compete for a medal. The IOC is a joke.",
            "title_similarity": "0.73293006",
            "sentiment_compound": 0.8402
        },
        {
            "id": "hwfoxu2",
            "score": 1,
            "text": "If the IOC doesn’t drop them down a hole after this week I’ll know they’re just as corrupt as the Russians.",
            "title_similarity": "0.6151935",
            "sentiment_compound": -0.2732
        },
        {
            "id": "hwfp220",
            "score": 1,
            "text": "Not the peepee hole I’m used to",
            "title_similarity": "0.084317416",
            "sentiment_compound": 0.0
        },
        {
            "id": "hwfqkt2",
            "score": 1,
            "text": "This sounds like something I’d call bullshit on if I didn’t believe the sources",
            "title_similarity": "0.09815669",
            "sentiment_compound": -0.3182
        },
        {
            "id": "hwfqnri",
            "score": 1,
            "text": "If you haven’t seen Icarus I highly recommend it. It’s an amazing story of how one documentary turns into something much bigger.",
            "title_similarity": "0.2889373",
            "sentiment_compound": 0.7645
        },
        {
            "id": "hwfquz2",
            "score": 2,
            "text": "Don't tell anyone you learned about this from the Joe Rogan Podcast yesterday",
            "title_similarity": "0.41081214",
            "sentiment_compound": 0.0
        },
        {
            "id": "hwfr7t8",
            "score": 1,
            "text": "Russia invented cheating",
            "title_similarity": "0.49314773",
            "sentiment_compound": -0.5574
        },
        {
            "id": "hwfrkkh",
            "score": 1,
            "text": "Jesus Christ, why can't people just win legitimately?",
            "title_similarity": "0.1748054",
            "sentiment_compound": -0.4717
        },
        {
            "id": "hwfs18n",
            "score": 3,
            "text": "Russia has cheated at every single thing ever. They must truly feel pathetic inside.",
            "title_similarity": "0.46313673",
            "sentiment_compound": -0.6249
        },
        {
            "id": "hwfsjrk",
            "score": 1,
            "text": "You should watch Icarus on Netflix or the JRE episode with Bryan Fogel if your interested in it",
            "title_similarity": "0.31317818",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hwfsvch",
            "score": 1,
            "text": "Did y’all even watch icarus…",
            "title_similarity": "0.35381353",
            "sentiment_compound": 0.0
        },
        {
            "id": "hwft8c9",
            "score": 1,
            "text": "What is the Russian psyche when it comes to this stuff. It always seems like it's biting cynicism mixed with self pity: \"oh, sure, like nobody else does it, you are all sooooo perfect\" - but more whiny.",
            "title_similarity": "0.48837692",
            "sentiment_compound": 0.4678
        },
        {
            "id": "hwfttdd",
            "score": 1,
            "text": "Russians love their peds",
            "title_similarity": "0.27745247",
            "sentiment_compound": 0.6369
        },
        {
            "id": "hwfun9h",
            "score": 1,
            "text": "This is why the Olympics are pretty much a joke. Performance enhancing drugs and cheating are rampant.",
            "title_similarity": "0.5199722",
            "sentiment_compound": 0.2023
        },
        {
            "id": "hwfv9d1",
            "score": 1,
            "text": "Is this how they also snuck in to Crimea and took it over?",
            "title_similarity": "0.42095208",
            "sentiment_compound": 0.0
        },
        {
            "id": "hwfw0s8",
            "score": 1,
            "text": "It’s not even worth reading this the whole world hates Russia",
            "title_similarity": "0.37497053",
            "sentiment_compound": -0.5523
        },
        {
            "id": "hwfwkhz",
            "score": 1,
            "text": "Meh, every country is doing it. And of course they would catch Russia. This is all so predictable and boring.",
            "title_similarity": "0.5029942",
            "sentiment_compound": -0.4336
        },
        {
            "id": "hwfwp7q",
            "score": 1,
            "text": "*plumber",
            "title_similarity": "0.19434051",
            "sentiment_compound": 0.0
        },
        {
            "id": "hwfwx9p",
            "score": 1,
            "text": "Of course they did. F Putin.",
            "title_similarity": "0.031858087",
            "sentiment_compound": 0.0
        },
        {
            "id": "hwfx7j7",
            "score": 1,
            "text": "I bet the Russian agent just had a high visibility vest and a ladder. That'll get you in anywhere. /s",
            "title_similarity": "0.4055215",
            "sentiment_compound": 0.0
        },
        {
            "id": "hwfyjrs",
            "score": 1,
            "text": "I would love to know how they got caught, so we no maek this mistake again.....     \nAHEM. I mean, for academic purposes. Of course.",
            "title_similarity": "0.41340995",
            "sentiment_compound": 0.0828
        },
        {
            "id": "hwfz7u7",
            "score": 1,
            "text": "Why invite the cheating countries to the next Olympics?",
            "title_similarity": "0.4811793",
            "sentiment_compound": -0.4588
        },
        {
            "id": "hwfzob1",
            "score": 1,
            "text": "Yep. Watch the documentary “Icarus” on Netflix. The Olympics are absolutely rigged af. I don’t bother watching them anymore.\n\nThe IOC doesn’t give AF. To them, money > literally everything else",
            "title_similarity": "0.59192866",
            "sentiment_compound": -0.4576
        },
        {
            "id": "hwg00hf",
            "score": 1,
            "text": "Wow.... Someone watches a lot of Golden Eye..",
            "title_similarity": "-0.1009472",
            "sentiment_compound": 0.5859
        },
        {
            "id": "hwg06w0",
            "score": 1,
            "text": "Russia should be banned from competing in the Olympics. But I really need to ask. Does anyone even watch the Olympics anymore? It’s kind of a joke",
            "title_similarity": "0.5970955",
            "sentiment_compound": 0.2023
        },
        {
            "id": "hwg0wi8",
            "score": 1,
            "text": "Humans really love to destroy some of the most beautiful things we create.",
            "title_similarity": "0.32137996",
            "sentiment_compound": 0.7919
        },
        {
            "id": "hwg16v4",
            "score": 1,
            "text": "There’s a documentary on this, it’s called Icarus.",
            "title_similarity": "0.22679853",
            "sentiment_compound": 0.0
        },
        {
            "id": "hwg1fki",
            "score": 1,
            "text": "I can't believe you're just learning of this! The whole fiasco was such big news.",
            "title_similarity": "0.26406485",
            "sentiment_compound": -0.5562
        },
        {
            "id": "hwg2sx1",
            "score": 1,
            "text": "I literally watched the documentary about this today!!",
            "title_similarity": "0.22724283",
            "sentiment_compound": 0.0
        },
        {
            "id": "hwg2v51",
            "score": 1,
            "text": "[Icarus](https://youtu.be/qXoRdSTrR-4)",
            "title_similarity": "0.19991136",
            "sentiment_compound": 0.0
        },
        {
            "id": "hwg39of",
            "score": 1,
            "text": "Heard this on Joe Rogan podcast with Bryan Fogel, it’s insane!!!",
            "title_similarity": "0.31396368",
            "sentiment_compound": -0.5538
        },
        {
            "id": "hwg3f86",
            "score": 2,
            "text": "What’s the benefit? Just a medal and gloating rights? Internal propaganda?",
            "title_similarity": "0.25999796",
            "sentiment_compound": 0.6848
        },
        {
            "id": "hwg4o66",
            "score": 1,
            "text": "WADA made it impossible for doped athletes to compete. Russia got dopers in. Watch Icarus on Netflix. It’s crazy what they pulled",
            "title_similarity": "0.6341529",
            "sentiment_compound": -0.34
        },
        {
            "id": "hwg50ck",
            "score": 1,
            "text": "There is a documentary on Netflix about this.  It is very entertaining.",
            "title_similarity": "0.19834588",
            "sentiment_compound": 0.4927
        },
        {
            "id": "hwg5kjs",
            "score": 1,
            "text": "Start making test facilities have walls/ceiling/ floors 6’ thick with sensors. Have fun tampering with that cheaters without explosives.",
            "title_similarity": "0.59766316",
            "sentiment_compound": 0.1027
        },
        {
            "id": "hwg6lw2",
            "score": 3,
            "text": "Some say they’re still doping to this day.",
            "title_similarity": "0.19401848",
            "sentiment_compound": 0.0
        },
        {
            "id": "hwg6qyi",
            "score": 1,
            "text": "What the fuck!!!! This is the plot for a movie not real life",
            "title_similarity": "0.17952311",
            "sentiment_compound": -0.6876
        },
        {
            "id": "hwg87lm",
            "score": 1,
            "text": "How pathetic is your \"country\" to have to use government resources to cheat the Olympics.",
            "title_similarity": "0.5351646",
            "sentiment_compound": -0.7717
        },
        {
            "id": "hwga82s",
            "score": 1,
            "text": "Why not just have a separate doping only Olympics?",
            "title_similarity": "0.40556157",
            "sentiment_compound": 0.0
        },
        {
            "id": "hwgadlr",
            "score": 1,
            "text": "I am stunned there are people who don’t know about this",
            "title_similarity": "0.06134843",
            "sentiment_compound": -0.1027
        },
        {
            "id": "hwgb53i",
            "score": 2,
            "text": "all that for what? Outside of athletes, does anyone really give a shit about medal totals? Peak insecurity about your nation being a shitty place to cheat in the olympics",
            "title_similarity": "0.52791893",
            "sentiment_compound": -0.8891
        },
        {
            "id": "hwgbacc",
            "score": 1,
            "text": "Where does Lance Armstrong stand on this issue?",
            "title_similarity": "0.07979274",
            "sentiment_compound": 0.0
        },
        {
            "id": "hwgbe51",
            "score": 1,
            "text": "Go watch the documentary Icarus!! It talks about this and more. It’s fascinating",
            "title_similarity": "0.28461975",
            "sentiment_compound": 0.6556
        },
        {
            "id": "hwgbvqk",
            "score": 1,
            "text": "There's an entire documentary about this. It's old, actually. Maybe check that out.",
            "title_similarity": "0.17775896",
            "sentiment_compound": 0.0
        },
        {
            "id": "hwgcpwt",
            "score": 1,
            "text": "Watch the incredibly entertaining and interesting Netflix documentary:  Icarus\n\nJust unreal.\n https://www.rottentomatoes.com/m/icarus_2017",
            "title_similarity": "0.44474143",
            "sentiment_compound": 0.7316
        },
        {
            "id": "hwgdikq",
            "score": 1,
            "text": "But why spend all of the time, money and effort to cheat in a competition about sports? Like I never understood why winning in the Olympics is so important that they need to go to these lengths?",
            "title_similarity": "0.54271233",
            "sentiment_compound": -0.4068
        },
        {
            "id": "hwggy3s",
            "score": 1,
            "text": "Russia bunch of rats",
            "title_similarity": "0.5227734",
            "sentiment_compound": 0.0
        },
        {
            "id": "hwgi63p",
            "score": 1,
            "text": "why bother competing when everything is rigged (I am not only talking about the Olympics)",
            "title_similarity": "0.43267268",
            "sentiment_compound": -0.5994
        },
        {
            "id": "hwgk8n5",
            "score": 1,
            "text": "There’s a documentary on this. It’s good.",
            "title_similarity": "-0.05602883",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hwgl6ew",
            "score": 2,
            "text": "No wonder trump loves Russia",
            "title_similarity": "0.31672245",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hwgli40",
            "score": 1,
            "text": "Don't know if it's been said in here somewhere, a must watch related to this topic is a documentary on Netflix called Icarus. You won't be disappointed.",
            "title_similarity": "0.39572597",
            "sentiment_compound": 0.3724
        },
        {
            "id": "hwgm6jg",
            "score": 1,
            "text": "Like why are nations and society in general so horny about medals and the Olympics? I just don’t get the lure and obsession with this corrupt shit.",
            "title_similarity": "0.42489767",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hwgmbx7",
            "score": 1,
            "text": "Why does the news surprise me?",
            "title_similarity": "0.10060055",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hwgnobh",
            "score": 1,
            "text": "Watch the doc Icarus, covers this pretty well.",
            "title_similarity": "0.24160323",
            "sentiment_compound": 0.705
        },
        {
            "id": "hwgnxbu",
            "score": 1,
            "text": "Don’t they dive into this in the film *Icarus*? I remember watching and thinking it was a fantastic documentary and revealed so much!",
            "title_similarity": "0.38726985",
            "sentiment_compound": 0.5983
        },
        {
            "id": "hwgo5vb",
            "score": 1,
            "text": "Russians are fucking cheaters and liars.",
            "title_similarity": "0.44197",
            "sentiment_compound": -0.7818
        },
        {
            "id": "hwgpiwg",
            "score": 1,
            "text": "we saw Icarus, we know",
            "title_similarity": "0.1523643",
            "sentiment_compound": 0.0
        },
        {
            "id": "hwgq0ai",
            "score": 5,
            "text": "Well the olympics is just a joke now. I used to like watching. I love snowboarding and skiing. Havent tuned in once. Why would I? I can just watch highlights on youtube if I really want to.",
            "title_similarity": "0.5295797",
            "sentiment_compound": 0.8908
        },
        {
            "id": "hwgq9en",
            "score": 1,
            "text": "It's all highlighted in a doc on Netflix: Icarus",
            "title_similarity": "0.38321757",
            "sentiment_compound": 0.0
        },
        {
            "id": "hwgrfij",
            "score": 1,
            "text": "[deleted]",
            "title_similarity": "-0.05756315"
        },
        {
            "id": "hwgrz64",
            "score": 2,
            "text": "This is why Russia is still banned from the Olympics. Individual athletes feom Russia can complete, but their anthem is not played when they win gold and the country is not credited with their medals.",
            "title_similarity": "0.5728692",
            "sentiment_compound": -0.0049
        },
        {
            "id": "hwgs63z",
            "score": 1,
            "text": "Vhat? Don’t believe what you read or hear? We are friends, no?",
            "title_similarity": "0.18812059",
            "sentiment_compound": 0.5632
        },
        {
            "id": "hwgsbt4",
            "score": 1,
            "text": "The documentary ‘Icarus’ was filmed during the time all the news was breaking about the doping scandal. I can’t recommend it enough. I’ve seen it at least 10 times.",
            "title_similarity": "0.52948236",
            "sentiment_compound": -0.1027
        },
        {
            "id": "hwgsnsl",
            "score": 1,
            "text": "Ahh Russia. You so fucked.",
            "title_similarity": "0.29361713",
            "sentiment_compound": -0.7661
        },
        {
            "id": "hwgu0pq",
            "score": 1,
            "text": "Sounds more like today I watched Icarus",
            "title_similarity": "0.2443287",
            "sentiment_compound": 0.4201
        },
        {
            "id": "hwguv4c",
            "score": 2,
            "text": "And what's funny/sad is they're still cheating in the current Olympics. They're giving literal children illegal PEDS.",
            "title_similarity": "0.62055475",
            "sentiment_compound": -0.7003
        },
        {
            "id": "hwgvj6o",
            "score": 1,
            "text": "The documentary on Netflix \"Icarus\" talks a lotttt about this, one of my favorites",
            "title_similarity": "0.355947",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hwgvkfk",
            "score": 2,
            "text": "Have any one of you seen Icarus? That was a legendary documentary about this and more. Must watch",
            "title_similarity": "0.3580877",
            "sentiment_compound": 0.0
        },
        {
            "id": "hwgyc7h",
            "score": 1,
            "text": "As a punishment… they still get to compete.  What a crock of urine",
            "title_similarity": "0.2880628",
            "sentiment_compound": 0.0
        },
        {
            "id": "hwgzc9m",
            "score": 1,
            "text": "Every day I learn something else about the Russian government the more realistic James bond movies seem.",
            "title_similarity": "0.5566484",
            "sentiment_compound": 0.0
        },
        {
            "id": "hwgzg01",
            "score": 2,
            "text": "Watch Icarus on Netflix my guy, it is mindblowing",
            "title_similarity": "0.44195285",
            "sentiment_compound": 0.0
        },
        {
            "id": "hwh0pop",
            "score": 1,
            "text": "Watch Icarus on Netflix",
            "title_similarity": "0.32328272",
            "sentiment_compound": 0.0
        },
        {
            "id": "hwh1dwp",
            "score": 1,
            "text": "I recommend the documentary Icarus on Netflix, which details much of this.",
            "title_similarity": "0.3974592",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hwh1nit",
            "score": 1,
            "text": "This story is documented in the netflix documentary 'Icarus'. If you haven't seen it, do yourself a favour and watch it. Mind blowing story. All true.",
            "title_similarity": "0.3755244",
            "sentiment_compound": 0.6908
        },
        {
            "id": "hwh1pvu",
            "score": 1,
            "text": "Just like Lance Armstrong told the world... doping is here to stay, and it's the only way that anyone can compete at the level of modern athletes. They all do it in one way or another... And that means you're not really watching the Olympics, you're watching some WWF shit with Hulksters.  \n\n\nSay what you want, but don't deny it is what it is.",
            "title_similarity": "0.6113293",
            "sentiment_compound": 0.2856
        },
        {
            "id": "hwh20in",
            "score": 2,
            "text": "Check out the documentary Icarus if you're interested in learning about this type of thing. It's a WILD ride, I cannot recommend it enough",
            "title_similarity": "0.36882257",
            "sentiment_compound": 0.1506
        },
        {
            "id": "hwh4anr",
            "score": 1,
            "text": "You guys should watch the documentary Icarus on Netflix, its basically based on this",
            "title_similarity": "0.3970847",
            "sentiment_compound": 0.0
        },
        {
            "id": "hwh5ycv",
            "score": 1,
            "text": "can't be untrue, i trust anything and anyone, tell me something else and i will trust you too",
            "title_similarity": "0.068311654",
            "sentiment_compound": 0.765
        },
        {
            "id": "hwh6ce1",
            "score": 1,
            "text": "clap...clap...clap\n*strolls out from behind big laser*\n\nVery good, Mr Bond! Yes, a great winter for Mother Russia. It's a shame you won't live to see another...",
            "title_similarity": "0.5117631",
            "sentiment_compound": 0.8012
        },
        {
            "id": "hwh6f3r",
            "score": 1,
            "text": "Wonder why the western world always feel sus about Russia…",
            "title_similarity": "0.45355278",
            "sentiment_compound": 0.0
        },
        {
            "id": "hwh6mxq",
            "score": 1,
            "text": "For more info watch netflix icarus 2017. \nFun fact : that documentary won an academy Award",
            "title_similarity": "0.39921921",
            "sentiment_compound": 0.8885
        },
        {
            "id": "hwh6rvm",
            "score": 1,
            "text": "Seriously, fuck the Russians. This is bullshit.",
            "title_similarity": "0.23423356",
            "sentiment_compound": -0.8402
        },
        {
            "id": "hwh9cbh",
            "score": 1,
            "text": "Whilst acknowledging the soft power n political points etc that come with success, it always astounds me how far people and nations go to cheat to essentially win a game.",
            "title_similarity": "0.40660024",
            "sentiment_compound": 0.8225
        },
        {
            "id": "hwhb258",
            "score": 3,
            "text": "I think there should be a separate category in the Olympics for athletes who are pumped full of performance enhancing drugs just to see how far the body can be pushed.",
            "title_similarity": "0.550973",
            "sentiment_compound": 0.0
        },
        {
            "id": "hwhbqan",
            "score": 2,
            "text": "The documentary  [Icarus](https://en.m.wikipedia.org/wiki/Icarus_(2017_film)) is a must watch if you want to learn more. It's mind boggling the level of planning and execution that went into this",
            "title_similarity": "0.4352576",
            "sentiment_compound": 0.0772
        },
        {
            "id": "hwhcj33",
            "score": 1,
            "text": "Tchaikovsky doesn't seem like a punishment at all just saying",
            "title_similarity": "0.15041807",
            "sentiment_compound": -0.6497
        },
        {
            "id": "hwhdyvk",
            "score": 2,
            "text": "Bro you didnt watch icarus????",
            "title_similarity": "0.30497003",
            "sentiment_compound": 0.0
        },
        {
            "id": "hwhg18y",
            "score": 2,
            "text": "They just keep on that stupid Cold War era bullshit don’t they. (Putin and his lot I mean) like does he think he’s in a space race too. Like nobody cares. Fucking cheating the Olympics and shit. I feel we’re a few years away from not even having Olympics anymore",
            "title_similarity": "0.6208774",
            "sentiment_compound": -0.9117
        },
        {
            "id": "hwhgale",
            "score": 1,
            "text": "Bitch made",
            "title_similarity": "0.12068087",
            "sentiment_compound": -0.5859
        },
        {
            "id": "hwhhbxw",
            "score": 1,
            "text": "If you havent watched Icarus on Netflix go watch it right this second!",
            "title_similarity": "0.36906105",
            "sentiment_compound": 0.0
        },
        {
            "id": "hwhhcww",
            "score": 3,
            "text": "Since no home country is seriously invested in cracking down on cheating I'd like to see an Olympics where instead they say fuck it,  everyone can whatever use performance enhancers you want. Let's find out how hard human bodies can actually be pushed.",
            "title_similarity": "0.62177384",
            "sentiment_compound": -0.8225
        },
        {
            "id": "hwhijuj",
            "score": 1,
            "text": "Sewer engineer handling dirty fluids\n\nChecks out",
            "title_similarity": "0.42695057",
            "sentiment_compound": -0.4404
        },
        {
            "id": "hwhk2ed",
            "score": 1,
            "text": "And to celebrate their success, they invaded a sovereign nation the week after…",
            "title_similarity": "0.26324716",
            "sentiment_compound": 0.8126
        },
        {
            "id": "hwhkg5a",
            "score": 1,
            "text": "Why is Russia like so heavily invested in the Olympics,",
            "title_similarity": "0.46435988",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hwhlk3z",
            "score": 2,
            "text": "Maybe the olympics need to go away for a while.",
            "title_similarity": "0.16834785",
            "sentiment_compound": 0.0
        },
        {
            "id": "hwhm5vs",
            "score": 1,
            "text": "Wow, winter Olympics got worse and worse.",
            "title_similarity": "0.39794168",
            "sentiment_compound": -0.34
        },
        {
            "id": "hwhrlf5",
            "score": 1,
            "text": "In Mother Russia, Glory Hole fucks you.",
            "title_similarity": "0.42276075",
            "sentiment_compound": 0.1027
        },
        {
            "id": "hwhs94w",
            "score": 1,
            "text": "I mean, c'mon, they deserve a medal for this. Not the medal for the event they competed in, strip them of that. But this is some serious commitment.",
            "title_similarity": "0.33942652",
            "sentiment_compound": 0.4978
        },
        {
            "id": "hwhsvkd",
            "score": 2,
            "text": "Damn you got a ton of upvotes for this!",
            "title_similarity": "0.04722708",
            "sentiment_compound": -0.4574
        },
        {
            "id": "hwhto9l",
            "score": 1,
            "text": "Why is Russia even allowed to compete at this point? I feel like at least one Russian athlete is caught doping every time.",
            "title_similarity": "0.6341765",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hwhw13a",
            "score": 2,
            "text": "Christ. It’s like more and more that country is showing itself as being the typical bond movie villain",
            "title_similarity": "0.34407854",
            "sentiment_compound": -0.2732
        },
        {
            "id": "hwhwxi1",
            "score": 1,
            "text": "Check out the documentary Icarus if you haven't seen it.",
            "title_similarity": "0.3418975",
            "sentiment_compound": 0.0
        },
        {
            "id": "hwi8dzn",
            "score": 1,
            "text": "That agent was a sewer rat",
            "title_similarity": "0.48577124",
            "sentiment_compound": 0.0
        },
        {
            "id": "hwib1yj",
            "score": 1,
            "text": "This is all western propaganda!! R/Russia, probably",
            "title_similarity": "0.34949422",
            "sentiment_compound": -0.3786
        },
        {
            "id": "hwiy2kf",
            "score": 1,
            "text": "Isn’t doping the whole reason why there’s only an RoC team and no \"Russia\" at the Olympics? Jesus Christ, you just cannot trust them team managers and coaches…",
            "title_similarity": "0.60429716",
            "sentiment_compound": -0.5996
        },
        {
            "id": "hwj3ia2",
            "score": 1,
            "text": "Netflix documentary Ikarus does explain how hard it actually was.",
            "title_similarity": "0.33268404",
            "sentiment_compound": -0.1027
        },
        {
            "id": "hx6ep3z",
            "score": 1,
            "text": "On a lighter note there were some very funny construction gaffes (stuff like, a toilet installed with a wall bisecting it)... this was because a lot of construction was rushed, I believe. You can probably find it by searching Sochi Olympic Fails.",
            "title_similarity": "0.57016706",
            "sentiment_compound": 0.4391
        },
        {
            "id": "hy23j8k",
            "score": 1,
            "text": "wow",
            "title_similarity": "-0.2845528",
            "sentiment_compound": 0.5859
        },
        {
            "id": "hy24xm8",
            "score": 1,
            "text": "wow",
            "title_similarity": "-0.2845528",
            "sentiment_compound": 0.5859
        }
    ]
}