{
    "TIL the New State Assembly voted to honor Bruce Springsteen's song \"Born to Run\" as the \"rock theme\" of NJ. The bill didn't pass in the state senate when it was realized the song was about running away from New Jersey.\n": [
        {
            "id": "i04ljb1",
            "score": -1,
            "text": "I love when Republicans use \"Born in the USA\" as a patriotic rallying cry.",
            "title_similarity": "0.3746034",
            "sentiment_compound": 0.2732
        },
        {
            "id": "i04a6c1",
            "score": 5,
            "text": "All the bridges I'm aware of (NYC and Philly) only charge one-way and you always need to pay to get out of Jersey. And it's always worth it.",
            "title_similarity": "0.44297433",
            "sentiment_compound": 0.128
        },
        {
            "id": "i04s02b",
            "score": 3,
            "text": "And that Bruce Springsteen is one of the most overrated musicians in history",
            "title_similarity": "0.38376704",
            "sentiment_compound": 0.0
        },
        {
            "id": "i05dck7",
            "score": 3,
            "text": "Springsteen is overrated.",
            "title_similarity": "0.34635788",
            "sentiment_compound": 0.0
        },
        {
            "id": "i05abic",
            "score": -1,
            "text": "Was this before or after the warmongering patriots wanted to use \"Born in the USA\" as their mantra?\n\nI understand liking a tune for the emotion and rhythm, but Jesus Christ do some people need to learn to read.",
            "title_similarity": "0.5487136",
            "sentiment_compound": -0.1027
        },
        {
            "id": "i04g0ym",
            "score": 0,
            "text": "Theres a lot better artists from new jersey anyway. Thankfully they didnt do this",
            "title_similarity": "0.52774197",
            "sentiment_compound": 0.6908
        },
        {
            "id": "i04sx52",
            "score": 0,
            "text": "Living in New Jersey for a couple of years, it makes sense for anyone to want to run away from New Jersey.",
            "title_similarity": "0.6454853",
            "sentiment_compound": 0.0772
        },
        {
            "id": "i04246n",
            "score": -2,
            "text": "Only in New Jersey.  Sigh.",
            "title_similarity": "0.3915815",
            "sentiment_compound": 0.0258
        },
        {
            "id": "i04wowd",
            "score": 1,
            "text": "\"The bill didn't pass in the state senate when it was realized the song sucks ass.\"\n\nFTFY.",
            "title_similarity": "0.74468637",
            "sentiment_compound": -0.7184
        },
        {
            "id": "i04y3pq",
            "score": 1,
            "text": "Jersey sucks.",
            "title_similarity": "0.21665095",
            "sentiment_compound": -0.3612
        },
        {
            "id": "i04zdsw",
            "score": -1,
            "text": "yeah. and by the way, \"Born in the USA\" is NOT a patriotic song, all you MAGAts out there! it's the exact opposite. neither is \"fortunate son\" by credence clearwater, ya big dummies.",
            "title_similarity": "0.6060919",
            "sentiment_compound": -0.1275
        },
        {
            "id": "i050bzr",
            "score": -1,
            "text": "The Boss has contributed greatly to the \"Upbeat Tunes About Very Sad Things\" songbook. And Republican rally organizers and their foaming attendees never seem to put it together.",
            "title_similarity": "0.615",
            "sentiment_compound": -0.5256
        },
        {
            "id": "i05r92p",
            "score": 1,
            "text": "New Jersey: The Armpit of America.",
            "title_similarity": "0.3679386",
            "sentiment_compound": 0.0
        },
        {
            "id": "i05ts78",
            "score": -1,
            "text": "Running away from New Jersey is just sound advice. I've never even been to Jersey and I daydream of running away from there about 20 times a day.",
            "title_similarity": "0.6395644",
            "sentiment_compound": 0.0
        },
        {
            "id": "i068asm",
            "score": -1,
            "text": "Also it's just not very good.",
            "title_similarity": "0.102147",
            "sentiment_compound": -0.3865
        },
        {
            "id": "i04rn0g",
            "score": 1,
            "text": "Ever noticed that it's free to get into NJ and you have to pay to leave?\n\nEdit: I think you can cross a bridge from Titusville, NJ to Washington Crossing, PA without paying a toll.",
            "title_similarity": "0.5798501",
            "sentiment_compound": 0.4019
        },
        {
            "id": "i042lnz",
            "score": 18,
            "text": "But Bruce never left New Jersey even though he could have lived in high style anywhere in the world.",
            "title_similarity": "0.5084818",
            "sentiment_compound": 0.0
        },
        {
            "id": "i04r8or",
            "score": 3,
            "text": "with all the racism, drug addiction, healthcare problems and poverty this is what they spend their time on",
            "title_similarity": "0.2340126",
            "sentiment_compound": -0.8779
        },
        {
            "id": "i045isl",
            "score": 33,
            "text": "My brother’s friends have largely gone no where since high school. He always plays “Glory days” when they get together. They have no idea what the song means and always remark how much they love it",
            "title_similarity": "0.5759764",
            "sentiment_compound": 0.7096
        },
        {
            "id": "i04hagz",
            "score": 0,
            "text": "Like trump and the other draft dodging chickenhawk gop candidates when they try using \"fortunate son\" in campaigns.\n\n>\"Some folks are born made to wave the flag\nOoh, they're red, white and blue\nAnd when the band plays \"Hail To The Chief\"\nOoh, they point the cannon at you, Lord\n\n>It ain't me, it ain't me, I ain't no senator's son, son\nIt ain't me, it ain't me; I ain't no fortunate one, no\n\n>Some folks are born silver spoon in hand\nLord, don't they help themselves, oh\nBut when the taxman comes to the door\nLord, the house looks like a rummage sale, yes\n\n>It ain't me, it ain't me, I ain't no millionaire's son, no, no\nIt ain't me, it ain't me; I ain't no fortunate one, no\n\n>Yeah!\nSome folks inherit star spangled eyes\nOoh, they send you down to war, Lord\nAnd when you ask them, \"How much should we give?\"\nOoh, they only answer, \"More! More! More!\" Yo\n\n>It ain't me, it ain't me, I ain't no military son, son\nIt ain't me, it ain't me; I ain't no fortunate one, one\n\n>It ain't me, it ain't me, I ain't no fortunate one, no no no\nIt ain't me, it ain't me, I ain't no fortunate son, no no no\"",
            "title_similarity": "0.61193895",
            "sentiment_compound": 0.9656
        },
        {
            "id": "i04ml0r",
            "score": 0,
            "text": "Thought it was about riding a motorcycle",
            "title_similarity": "0.3048525",
            "sentiment_compound": 0.0
        },
        {
            "id": "i04s2i1",
            "score": 0,
            "text": "Why was any politician wasting time on shit like this?",
            "title_similarity": "0.49226043",
            "sentiment_compound": -0.5859
        },
        {
            "id": "i05c1fg",
            "score": 0,
            "text": "I think it's really about what a shithole NJ is. \n\n🎵 Down in the shadow of the penitentiary\nOut by the gas fires of the refinery\nI'm ten years burning down the road\nNowhere to run ain't got nowhere to go 🎵",
            "title_similarity": "0.5973079",
            "sentiment_compound": 0.0
        },
        {
            "id": "i05yry7",
            "score": 0,
            "text": "Born in the USA - official song of the US armed forces?",
            "title_similarity": "0.49390215",
            "sentiment_compound": 0.0
        },
        {
            "id": "i06bqot",
            "score": 0,
            "text": "Bruce always confusing the tone-deaf idiots.\n\n“America’s future rests in a thousand dreams inside our hearts,” Reagan said at a stump speech in Hammonton, New Jersey. “It rests in the message of hope in the songs of a man so many young Americans admire: New Jersey’s own Bruce Springsteen.”",
            "title_similarity": "0.66893405",
            "sentiment_compound": 0.7783
        },
        {
            "id": "i06rfrt",
            "score": 0,
            "text": "His songs are not that complicated, why do people keep acting like they agree with the absolutely horrific views of conservative Americans?\n\nThey are literally all against that stupidity.",
            "title_similarity": "0.49006468",
            "sentiment_compound": -0.5563
        },
        {
            "id": "i07bse3",
            "score": 0,
            "text": "As a native.  Im so sick of Springsteen.   Like 100% all of him.  If I hear small town girl or whatever that songs name is again ill just end it... id rather yoko ono create the theme song.  Swear to god...",
            "title_similarity": "0.6217483",
            "sentiment_compound": -0.3697
        },
        {
            "id": "i04h4f5",
            "score": -10,
            "text": "He's a liberal douche bag anyway.",
            "title_similarity": "0.23165002",
            "sentiment_compound": -0.3612
        },
        {
            "id": "i041q35",
            "score": -1,
            "text": "Lol.",
            "title_similarity": "-0.098230205",
            "sentiment_compound": 0.4215
        },
        {
            "id": "i043v5f",
            "score": 1,
            "text": "Haha!",
            "title_similarity": "-0.120715655",
            "sentiment_compound": 0.5093
        },
        {
            "id": "i04pszj",
            "score": 1,
            "text": "They particularly despised the line, “ Baby this town rips the bones from your back, it’s a death trap, it’s a suicide rap, we got to get out while we’re young…”",
            "title_similarity": "0.5439764",
            "sentiment_compound": -0.9286
        },
        {
            "id": "i050q44",
            "score": -1,
            "text": "[deleted]",
            "title_similarity": "0.14549185"
        },
        {
            "id": "i052dic",
            "score": 1,
            "text": "Make it “My Home Town.” A lot of people stuck where they are can relate.",
            "title_similarity": "0.25342253",
            "sentiment_compound": -0.25
        },
        {
            "id": "i0584hp",
            "score": 1,
            "text": "[state song for NJ](https://youtu.be/Fg-5BAfSkE4)",
            "title_similarity": "0.51912636",
            "sentiment_compound": 0.0
        },
        {
            "id": "i05a4wl",
            "score": -1,
            "text": "\"We would like to pass this bill to honor *Born to Run* as our states official rock song.\"\n\n\"What's it about?\"\n\n\"Getting out of a state we made the policies for on behalf of generous individuals. We can all agree that we suck, right?\"\n\n\"I second the motion because I'm an incorrigible asshole who doesn't get sarcasm.\"\n\n\\-- nothing is more cool than New Jersey cool.",
            "title_similarity": "0.7513335",
            "sentiment_compound": 0.8673
        },
        {
            "id": "i05aaaf",
            "score": 1,
            "text": "Right up there with the Reagan campaign wanting to use Bruces' Born In The USA back in the 1980s. Leave it to dimwitted republicans to have zero ability at lyric comprehension.",
            "title_similarity": "0.6883527",
            "sentiment_compound": 0.2732
        },
        {
            "id": "i06pve9",
            "score": 1,
            "text": "Wait until the right wing Boomer and Gen X shitheads figure out what \"Born in the USA\" is really about.",
            "title_similarity": "0.50425005",
            "sentiment_compound": -0.5574
        },
        {
            "id": "i04pr88",
            "score": -9,
            "text": "Fuck NJ and Springsteen. Absolute TRASH",
            "title_similarity": "0.4677163",
            "sentiment_compound": -0.5423
        },
        {
            "id": "i047q2z",
            "score": 2,
            "text": "I always say, number 1 export in jersey is our people!",
            "title_similarity": "0.3729627",
            "sentiment_compound": 0.1511
        },
        {
            "id": "i04cdpk",
            "score": 2,
            "text": "That’s what they spend their time voting on? Next they’re going to be allowing romantic couples to register their  “their songs” officially and legally.",
            "title_similarity": "0.4635861",
            "sentiment_compound": 0.4767
        },
        {
            "id": "i050ecc",
            "score": -2,
            "text": "Visited New Jersey in 2010, I understood why people want to run away, but never understand why people wanted to stay, except for mafias there’s a lot of money to be made.",
            "title_similarity": "0.6815003",
            "sentiment_compound": 0.0387
        },
        {
            "id": "i053bms",
            "score": -2,
            "text": "I knew a guy who used to beat kids who'd throw Bruce's name around a lot. I don't get why people give a shit about him or his music.",
            "title_similarity": "0.5484153",
            "sentiment_compound": -0.5574
        },
        {
            "id": "i06pgmp",
            "score": 3,
            "text": "I still think Born to Run is an accurate song for NJ, As someone who lives in NJ, I will be running from this state soon as humanly possible.",
            "title_similarity": "0.55777186",
            "sentiment_compound": 0.0
        },
        {
            "id": "i04b33e",
            "score": 16,
            "text": "Speaking of not reading the lyrics, what about that time Mercedes Benz used the song of the same name by Janis Joplin, which is a song mocking prosperity gospel by having its protagonist pray to God for expensive luxury items?",
            "title_similarity": "0.6171213",
            "sentiment_compound": 0.1779
        },
        {
            "id": "i04bxzb",
            "score": 20,
            "text": "Wait til they hear Atlantic City....",
            "title_similarity": "0.40300912",
            "sentiment_compound": 0.0
        },
        {
            "id": "i043fmg",
            "score": 7,
            "text": "\"Eggs like these, baby they were born to run!\" Modern Man's response to a NJ law forbidding serving runny eggs.",
            "title_similarity": "0.6445726",
            "sentiment_compound": -0.1759
        },
        {
            "id": "i04fnxx",
            "score": 4,
            "text": "Also, “No Woman, No Cry” is saying “No, don’t cry, woman” not “if you don’t have a woman, you won’t cry”",
            "title_similarity": "0.4115482",
            "sentiment_compound": -0.6486
        },
        {
            "id": "i04xbjw",
            "score": -7,
            "text": "Bruce doesn't deserve anything anymore. His mouth got too big when trump was running for president",
            "title_similarity": "0.6405931",
            "sentiment_compound": 0.0
        },
        {
            "id": "i04ayez",
            "score": 27,
            "text": "texas tried to make the breakfast taco the official breakfast sandwich of texas. this is what they get up to instead of... you know... governing.",
            "title_similarity": "0.5223302",
            "sentiment_compound": 0.0
        },
        {
            "id": "i045o7b",
            "score": 48,
            "text": "Seems to be a theme with him. Born in the USA is a PROTEST song.",
            "title_similarity": "0.5314988",
            "sentiment_compound": -0.4084
        },
        {
            "id": "i0444bp",
            "score": 156,
            "text": "I’m from NJ, particularly the town Springsteen was originally from. I spent tons of time at all the places he sings about. I grew up with his music.\n\nI always get a kick out if these things. Especially when people play songs like Born in the USA (I know different song than the article) at things like political rallies or 4th of July celebrations. A LOT of his music is about some depressing time in regards to the US economy and civil rights, and overall the sentiment is quite anti-government.",
            "title_similarity": "0.60718286",
            "sentiment_compound": 0.6204
        },
        {
            "id": "i04ozjl",
            "score": 20,
            "text": "About running away from New Jersey, where Bruce Springsteen currently resides.",
            "title_similarity": "0.75606143",
            "sentiment_compound": 0.0
        },
        {
            "id": "i03z4bo",
            "score": 373,
            "text": "The one time people read lyrics. I want to see when a shoe company uses Pumped Up Kicks.",
            "title_similarity": "0.28542566",
            "sentiment_compound": 0.0772
        },
        {
            "id": "i04qebc",
            "score": 37,
            "text": "Springsteen has a line about this in his Broadway show. Something about dreaming about getting out of NJ growing up and now he lives 5 mins away from where he grew up",
            "title_similarity": "0.6506475",
            "sentiment_compound": 0.1779
        },
        {
            "id": "i04ar9z",
            "score": 88,
            "text": "*laughs in <pork roll, egg & cheese>*",
            "title_similarity": "0.16339856",
            "sentiment_compound": 0.4939
        },
        {
            "id": "i04d5nf",
            "score": 43,
            "text": "People just don't listen to lyrics carefully. It's why \"Born in the USA\" or John Mellencamp's \"Pink Houses\" or CCR's \"Fortunate Son\" are used as a flag-waving patriotic songs in ads.",
            "title_similarity": "0.6504616",
            "sentiment_compound": 0.5267
        },
        {
            "id": "i03yf8x",
            "score": 2222,
            "text": "Wait till they findout the meaning behind \"Born in the USA\".",
            "title_similarity": "0.4405865",
            "sentiment_compound": 0.0
        },
        {
            "id": "i04mg12",
            "score": 80,
            "text": "Bruce Springsteen and the government misunderstanding the lyrics name a more iconic duo",
            "title_similarity": "0.7671091",
            "sentiment_compound": -0.4215
        },
        {
            "id": "i043yj5",
            "score": 6340,
            "text": "What could be more New Jersey than wanting to leave New Jersey?",
            "title_similarity": "0.46498144",
            "sentiment_compound": -0.0516
        },
        {
            "id": "i04cr1j",
            "score": 682,
            "text": "Best description I ever heard about Springsteen’s music was at his Kennedy Center Honors when Jon Stewart was the MC. Stewart described working at a crappy New Jersey bar, and at the end of his shift he’d get in his crappy car and drive back to his crappy apartment.  And he said on that long drive he’d listen to Bruce Springsteen.  Paraphrasing, he said “when you listen to Bruce, you don’t feel like a loser. Instead, you feel like a character in an epic poem … *about* losers.”",
            "title_similarity": "0.69502324",
            "sentiment_compound": -0.4019
        },
        {
            "id": "i046fec",
            "score": 603,
            "text": "Sorry I was late, the highway's jammed with broken heroes on a last chance power drive",
            "title_similarity": "0.474842",
            "sentiment_compound": 0.2263
        },
        {
            "id": "i03ye65",
            "score": 2370,
            "text": "The lyrics in question:\n\nOh, baby this town rips the bones from your back  \nIt's a death trap, it's a suicide rap  \nWe gotta get out while we're young  \n'Cause tramps like us, baby we were born to run  \nYes, girl, we were",
            "title_similarity": "0.54980284",
            "sentiment_compound": -0.7579
        },
        {
            "id": "i041vd5",
            "score": 1894,
            "text": "Bruce Springsteen said, “We Got To Get Out Of This Place by The Animals is every song I ever wrote.”    \n     \nhttps://youtube.com/watch?v=FVSoilSuXO4",
            "title_similarity": "0.61809987",
            "sentiment_compound": 0.0
        },
        {
            "id": "i043ikg",
            "score": 3502,
            "text": "Surely the only official NJ theme could be Woke Up This Morning.",
            "title_similarity": "0.42900598",
            "sentiment_compound": 0.4404
        },
        {
            "id": "i044aqu",
            "score": 26,
            "text": "Robert Wuhl was all over the story in 1990\n\nhttps://youtu.be/8sbhGggvCRI?t=01m53s",
            "title_similarity": "0.35200825",
            "sentiment_compound": 0.0
        },
        {
            "id": "i044bzm",
            "score": 66,
            "text": "\"the New State Assembly\"",
            "title_similarity": "0.3280737",
            "sentiment_compound": 0.0
        },
        {
            "id": "i049r9u",
            "score": 1,
            "text": "How the turns have tabled.",
            "title_similarity": "0.07395631",
            "sentiment_compound": 0.0
        },
        {
            "id": "i049wfu",
            "score": 1,
            "text": "so many rock anthems just completely taken out of context and defaced by pop culture.",
            "title_similarity": "0.56846267",
            "sentiment_compound": 0.0
        },
        {
            "id": "i04b760",
            "score": 54,
            "text": "In all fairness couldn't he just have been talking about fleeing his hometown (so say Freehold for Red Bank)?",
            "title_similarity": "0.6145721",
            "sentiment_compound": 0.1779
        },
        {
            "id": "i04bqh4",
            "score": 2,
            "text": "That would still make it a good State song. So many of us from New Jersey left because it is just so crowded. We are still proud.",
            "title_similarity": "0.4576001",
            "sentiment_compound": 0.7184
        },
        {
            "id": "i04c89s",
            "score": 6,
            "text": "I mean I guess that's one interpretation. To me it's always been about the listlessness of becoming an adult. Most people in post WWII America don't desire to live in the same home or same town as their parents. \n\nSo in essence to me this has always been a song about longing to escape, not a set place like New Jersey, but from a certain situation.",
            "title_similarity": "0.64515376",
            "sentiment_compound": 0.4715
        },
        {
            "id": "i04c91m",
            "score": 1,
            "text": "LMAO",
            "title_similarity": "-0.08925606",
            "sentiment_compound": 0.5994
        },
        {
            "id": "i04dxq1",
            "score": 1,
            "text": "WE GOTTA GET OUT WHILE WE'RE YOUNG",
            "title_similarity": "0.29613793",
            "sentiment_compound": 0.0
        },
        {
            "id": "i04e44e",
            "score": 1,
            "text": "Politicians misunderstanding a Bruce Springsteen song.  Seems like I've heard something like this before.\n\nCough cough Regan cough cough",
            "title_similarity": "0.66510695",
            "sentiment_compound": 0.296
        },
        {
            "id": "i04f33p",
            "score": 1,
            "text": "Robert Wuhl (Go Coogs) basically outlined this in his HBO standup special, maybe 25 - 30 years ago.",
            "title_similarity": "0.43062347",
            "sentiment_compound": 0.4019
        },
        {
            "id": "i04fcyf",
            "score": 1,
            "text": "New Jersey is the only state without an official state song.",
            "title_similarity": "0.5082778",
            "sentiment_compound": 0.0
        },
        {
            "id": "i04ffev",
            "score": 1,
            "text": "Why does the state senate waste their time on something so trivial...",
            "title_similarity": "0.53828454",
            "sentiment_compound": -0.5092
        },
        {
            "id": "i04gdhr",
            "score": 1,
            "text": "This is a pretty good example of the difference between house and senate due diligence...",
            "title_similarity": "0.2405349",
            "sentiment_compound": 0.7269
        },
        {
            "id": "i04gu0d",
            "score": 1,
            "text": "baby this town rips the bones from your back, it's a death trap, a suicide rap. we gotta get out while we're young...",
            "title_similarity": "0.53050065",
            "sentiment_compound": -0.8934
        },
        {
            "id": "i04gxm7",
            "score": 57,
            "text": "\"Misunderstanding Bruce Springsteen\" is actually the official State Pastime.",
            "title_similarity": "0.60453093",
            "sentiment_compound": -0.4215
        },
        {
            "id": "i04hgti",
            "score": 1,
            "text": "This is like Reagan using Born in the USA.\n\n\"I had a brother at Khe Sanh\nFighting off the Viet Cong\nThey're still there, he's all gone\nHe had a woman he loved in Saigon\nI got a picture of him in her arms now\n\nDown in the shadow of the penitentiary\nOut by the gas fires of the refinery\nI'm ten years burning down the road\nNowhere to run ain't got nowhere to go\"\n\nThat's some blind patriotism right there.",
            "title_similarity": "0.64157575",
            "sentiment_compound": 0.296
        },
        {
            "id": "i04hzw8",
            "score": 1,
            "text": "Instead of spending time on important work, state legislatures spend time on things like state rock theme, state bird, state mollusk, state insect, etc",
            "title_similarity": "0.5017859",
            "sentiment_compound": 0.5106
        },
        {
            "id": "i04iikx",
            "score": 1,
            "text": ">It's a death trap, it's a suicide rap\n\nLiteral lyrics from the song describing life in a town in New Jersey",
            "title_similarity": "0.64115435",
            "sentiment_compound": -0.8934
        },
        {
            "id": "i04ikns",
            "score": 1,
            "text": "\"Together we can live with the sadness\" should be the state's new motto.",
            "title_similarity": "0.4147687",
            "sentiment_compound": -0.4404
        },
        {
            "id": "i04j59o",
            "score": 1,
            "text": "What about Jersey Girl by Tom Waits..\n\nhttps://youtu.be/j-ROB8kI_fw",
            "title_similarity": "0.4275946",
            "sentiment_compound": 0.0
        },
        {
            "id": "i04jhvp",
            "score": 1,
            "text": "Same as people walking out of a CSNY show in 2014. Saying i wish they would keep politics out of it. lol",
            "title_similarity": "0.6740019",
            "sentiment_compound": 0.6705
        },
        {
            "id": "i04k0vw",
            "score": 1,
            "text": "“It’s a town full of losers, and I’m pulling out of here to win”\nSeems pretty to the point.",
            "title_similarity": "0.48143113",
            "sentiment_compound": -0.0516
        },
        {
            "id": "i04kkdd",
            "score": 1,
            "text": "I remember this being in a standup skit about the inadvisability of picking a state anthem that mentions suicide ... *twice*.",
            "title_similarity": "0.6726269",
            "sentiment_compound": -0.6705
        },
        {
            "id": "i04kots",
            "score": 1,
            "text": "LOLOLOLO",
            "title_similarity": "-0.06305955",
            "sentiment_compound": 0.0
        },
        {
            "id": "i04ksgz",
            "score": 1,
            "text": "As someone who has lived in NJ in two separate times in their life: it is the perfect theme, everyone there wants to get the fuck out, that's why everyone is in a hurry.",
            "title_similarity": "0.44860294",
            "sentiment_compound": 0.0516
        },
        {
            "id": "i04kuqt",
            "score": 1,
            "text": "Robert Wuhl \"Born to Run\"\nhttps://youtu.be/8sbhGggvCRI?t=200",
            "title_similarity": "0.32510605",
            "sentiment_compound": 0.0
        },
        {
            "id": "i04kvkz",
            "score": 1,
            "text": "The 3rd Eye Blind song playing at Kids partys",
            "title_similarity": "0.39258903",
            "sentiment_compound": -0.2263
        },
        {
            "id": "i04l1fy",
            "score": 1,
            "text": "what a weird thing to have a vote on in the first place",
            "title_similarity": "0.35003573",
            "sentiment_compound": -0.1779
        },
        {
            "id": "i04l2gv",
            "score": 1,
            "text": "SUICIDE MACHINES",
            "title_similarity": "0.25459045",
            "sentiment_compound": -0.6705
        },
        {
            "id": "i04leme",
            "score": 1,
            "text": "Chamber of somber second thought huh",
            "title_similarity": "0.13092439",
            "sentiment_compound": -0.4215
        },
        {
            "id": "i04m57r",
            "score": 1,
            "text": "Kinda like how born in the USA isn’t about being patriotic, yet played as if it’s a patriotic song.",
            "title_similarity": "0.60625243",
            "sentiment_compound": 0.5584
        },
        {
            "id": "i04m5no",
            "score": 1,
            "text": "Why are his songs taken opposite of what they actually mean???",
            "title_similarity": "0.4555484",
            "sentiment_compound": 0.0
        },
        {
            "id": "i04m5wf",
            "score": 1,
            "text": "My MiL thought the lyric was \"Jam slap Gus\" instead of \"tramps like us\".  For like 40 years, she just figured it out.",
            "title_similarity": "0.5748811",
            "sentiment_compound": 0.6808
        },
        {
            "id": "i04mazm",
            "score": 1,
            "text": "And yet still every other politician from Jersey ends up using this song for campaign events.",
            "title_similarity": "0.478854",
            "sentiment_compound": 0.0
        },
        {
            "id": "i04my5t",
            "score": 1,
            "text": "To florida",
            "title_similarity": "0.14921479",
            "sentiment_compound": 0.0
        },
        {
            "id": "i04myi2",
            "score": 1,
            "text": "As someone who grew up in NJ and was trapped there for the first 20 years of my life (and as much as I can't stand Bruuuuuuce). Yeah. Baby, I was definitely born to run.",
            "title_similarity": "0.5275987",
            "sentiment_compound": -0.3794
        },
        {
            "id": "i04n3de",
            "score": 1,
            "text": "Goes to show you that no one really LISTENS to Springsteen. \n\nThey hear the tune and say “oh my god! I fucking love Springsteen!” without actually hearing what he says,",
            "title_similarity": "0.70154285",
            "sentiment_compound": 0.7164
        },
        {
            "id": "i04n8f1",
            "score": 1,
            "text": "Wait until they finally learn what “Born in the USA” is all about!",
            "title_similarity": "0.47633517",
            "sentiment_compound": 0.0
        },
        {
            "id": "i04nfpm",
            "score": 1,
            "text": "Didn't something simelar happen with Reagan and \"Born in the USA\"?",
            "title_similarity": "0.47140095",
            "sentiment_compound": 0.0
        },
        {
            "id": "i04ngkn",
            "score": 4,
            "text": "Just wait till they realized what “Born in the USA” is really about.",
            "title_similarity": "0.46905488",
            "sentiment_compound": 0.0
        },
        {
            "id": "i04nibm",
            "score": 1,
            "text": "Lol did they even listen to the song?",
            "title_similarity": "0.45141685",
            "sentiment_compound": 0.4215
        },
        {
            "id": "i04nk0c",
            "score": 4,
            "text": "TIL some New Jersey state senators read/listen.",
            "title_similarity": "0.52207005",
            "sentiment_compound": 0.0
        },
        {
            "id": "i04nm1d",
            "score": 1,
            "text": "“I love LA” is actually about how LA sucks \n\nWe embrace both sides of it. Jersey is still in denial I guess, not sure how that is",
            "title_similarity": "0.4170707",
            "sentiment_compound": 0.4657
        },
        {
            "id": "i04nmam",
            "score": 1,
            "text": "Forget about it. The New Jersey theme song is “Woke Up This Morning”.",
            "title_similarity": "0.54455143",
            "sentiment_compound": -0.2263
        },
        {
            "id": "i04nv4y",
            "score": 1,
            "text": "So NJ",
            "title_similarity": "0.07503739",
            "sentiment_compound": 0.0
        },
        {
            "id": "i04o4pg",
            "score": 1,
            "text": "And that's why representative government doesn't work. It got all the way to the vote before anyone actually read the context.",
            "title_similarity": "0.6293375",
            "sentiment_compound": 0.0
        },
        {
            "id": "i04o851",
            "score": 2,
            "text": "Same story with \"Born in the USA\". The song is not about patriotism",
            "title_similarity": "0.55467916",
            "sentiment_compound": 0.0
        },
        {
            "id": "i04o9vv",
            "score": 7,
            "text": "This is the part where I if only due to obligation emphasize that I am a diehard Springsteen fan and that he has a ridiculous amount of great songs and albums and so if you want recommendations pls ask",
            "title_similarity": "0.5124669",
            "sentiment_compound": 0.6969
        },
        {
            "id": "i04og6g",
            "score": 1,
            "text": "Kind of like Sean Hannity playing Martina McBride's \"Independence Day.\"  It's about spousal abuse and escaping it by blowing up the house with the abuser inside.",
            "title_similarity": "0.5239861",
            "sentiment_compound": -0.6486
        },
        {
            "id": "i04p51f",
            "score": 1,
            "text": "I’ve always thought it should be Thunder Road. It just feels right to me.",
            "title_similarity": "0.37590075",
            "sentiment_compound": 0.0
        },
        {
            "id": "i04p735",
            "score": 11,
            "text": "A lot of Springsteen’s songs are really catchy, but the lyrics are depressing as hell.",
            "title_similarity": "0.37886173",
            "sentiment_compound": -0.8957
        },
        {
            "id": "i04p9sw",
            "score": 1,
            "text": "I nominate the Aqua Teen Hunger Force theme song by Schoolly D.",
            "title_similarity": "0.49646527",
            "sentiment_compound": -0.25
        },
        {
            "id": "i04pqdw",
            "score": 1,
            "text": "Robert Wohl did a [comedy bit](https://youtu.be/8sbhGggvCRI) about this soon after it happened. They played it a LOT when The Comedy Channel was first starting up. (Jump to about 3:00)",
            "title_similarity": "0.43855652",
            "sentiment_compound": 0.7506
        },
        {
            "id": "i04qbpl",
            "score": 3,
            "text": "I suspect the same sorta thing happened with my baseball team playing “Glory Days” after the 6th inning, only for them to listen to the lyrics and realize “hey, this actually isn’t a song that’s as positive as we thought”",
            "title_similarity": "0.5658532",
            "sentiment_compound": 0.4939
        },
        {
            "id": "i04qgao",
            "score": 1,
            "text": "Politicians failing to do due diligence. *I am shocked. Shocked I tell you.*",
            "title_similarity": "0.48524553",
            "sentiment_compound": -0.7845
        },
        {
            "id": "i04qnen",
            "score": 3,
            "text": "That was like when GM used Eminence Front by the who in their advertising. Literally the worst song choice to push your brand. Like saying buy this if you want to put out that youre fugazy",
            "title_similarity": "0.60641605",
            "sentiment_compound": 0.0516
        },
        {
            "id": "i04qqcu",
            "score": 1,
            "text": "“WE GOTTA GET OUT WHILE WE’RE YOUNG!”\n\nNailed it? ¯\\\\\\_(ツ)_/¯",
            "title_similarity": "0.4174747",
            "sentiment_compound": 0.0
        },
        {
            "id": "i04qto7",
            "score": 2,
            "text": "I remember being in high school where students were trying to get people to sign a petition for this. I had the same argument. \n\nFast forward a few years as people play “Born in the USA” as a patriotic song.",
            "title_similarity": "0.58689284",
            "sentiment_compound": -0.0258
        },
        {
            "id": "i04r8wa",
            "score": 1,
            "text": "Next up born in the USA!!!",
            "title_similarity": "0.39726353",
            "sentiment_compound": 0.0
        },
        {
            "id": "i04rgo7",
            "score": 1,
            "text": "I just moved to Edgewater",
            "title_similarity": "0.3159402",
            "sentiment_compound": 0.0
        },
        {
            "id": "i04s0gb",
            "score": 2,
            "text": "This is topped only by Ronald Reagan wanting to use *Born in the USA* as a campaign song.",
            "title_similarity": "0.63248116",
            "sentiment_compound": 0.0
        },
        {
            "id": "i04s467",
            "score": 1,
            "text": "Kind of like how Born in the USA is used for jingoistic purposes.",
            "title_similarity": "0.3672526",
            "sentiment_compound": 0.3612
        },
        {
            "id": "i04slxo",
            "score": 1,
            "text": "Similarly, Voltaire's \"Bomb New Jersey\" was equally voted down.",
            "title_similarity": "0.6283342",
            "sentiment_compound": -0.4939
        },
        {
            "id": "i04tcfm",
            "score": 2,
            "text": "This is almost as bad as Ron Reagan choosing Born in the USA",
            "title_similarity": "0.49226087",
            "sentiment_compound": -0.4976
        },
        {
            "id": "i04tg35",
            "score": 1,
            "text": "A few of his songs are misunderstood",
            "title_similarity": "0.23822398",
            "sentiment_compound": -0.34
        },
        {
            "id": "i04tkob",
            "score": 1,
            "text": "That's so boss",
            "title_similarity": "-0.006604772",
            "sentiment_compound": 0.0
        },
        {
            "id": "i04u1nt",
            "score": 1,
            "text": "r/nottheonion",
            "title_similarity": "0.14821157",
            "sentiment_compound": 0.0
        },
        {
            "id": "i04u536",
            "score": 1,
            "text": "Bruce's songs have to be the most misunderstood music in history, at least to 50% of the US population.\n\nIt's amazing at how many times it's used in politics to the opposite effect of intention. Dude makes some catchy tunes.",
            "title_similarity": "0.416924",
            "sentiment_compound": 0.2748
        },
        {
            "id": "i04u8et",
            "score": 1,
            "text": "What's with politicians trying to graft popular songs onto their campaigns/causes without hitting up the internet to glance at the lyrics?\n\nThey tried gloming onto another song of his to be a \"patriotic\" song, \"Born in the  U.S.A.\". Yeah, not as patriotic as they though.",
            "title_similarity": "0.7329253",
            "sentiment_compound": 0.6124
        },
        {
            "id": "i04ufur",
            "score": 6,
            "text": "Sooooo… it should be the theme of New Jersey?\n\nWanting to leave but never actually doing it is New Jersey as it gets.",
            "title_similarity": "0.70347154",
            "sentiment_compound": -0.0258
        },
        {
            "id": "i04ug8l",
            "score": 1,
            "text": "This song will always remind me of Battle Royale.",
            "title_similarity": "0.2718754",
            "sentiment_compound": -0.3818
        },
        {
            "id": "i04unci",
            "score": 1,
            "text": "It isn't specifically about Jersey. Springsteen opens with a broad scope:\n\n >*In the day we sweat it out on the streets of a runaway American dream*\n\nAdditionally, the word \"dream\" encapsulates everyone who has wished for a better life or had an ambition. Springsteen also reveals there is an inner uniqueness or nonconformity to the characters:\n\n>*Oh honey, tramps like us--Baby we were born to run*\n\n*Born to Run* is the first album I owned and played constantly. Every word, note, and nuance is part of me. Even the cover-art, which was everywhere in NYC at the time, releases strong memories.",
            "title_similarity": "0.6168233",
            "sentiment_compound": 0.9201
        },
        {
            "id": "i04uroo",
            "score": 1,
            "text": "Born in the USA is like that too.  Everyone treats it like it 's THE American anthem.",
            "title_similarity": "0.4017815",
            "sentiment_compound": 0.6124
        },
        {
            "id": "i04utss",
            "score": 1,
            "text": "Yep, Harry and the mrs ran to NJ for their dozen charities!  Good one!",
            "title_similarity": "0.47453967",
            "sentiment_compound": 0.8353
        },
        {
            "id": "i04uvm0",
            "score": 1,
            "text": "I lived in Jersey then and remember it well.  Like they didn’t even listen to the song, we had to tell them.  “Baby this town rips the bones off your back, it’s a death trap, a suicide rap…. We gotta get out while we’re young”.  C’mon that was sung so loud!",
            "title_similarity": "0.6630211",
            "sentiment_compound": -0.8122
        },
        {
            "id": "i04v0d0",
            "score": 1,
            "text": "“Yes, this is a good title. No, we do not need to listen to the lyrics, it’s Bruce Springsteen for chrissake”",
            "title_similarity": "0.6439229",
            "sentiment_compound": 0.4404
        },
        {
            "id": "i04v42a",
            "score": 1,
            "text": "Took me a minute to realize “New State Assembly” was supposed to be “New Jersey State Assembly”.",
            "title_similarity": "0.611251",
            "sentiment_compound": 0.0
        },
        {
            "id": "i04vbn8",
            "score": 1,
            "text": "Reminds me of the time way back in the day, when Richard Nixon insisted The Guess Who's song American Woman be played at some gala event. No one, especially Tricky Dicky,  had listened to the words.\n\nAmerican woman, said get away \n\nAmerican woman, listen what I say \n\nDon't come a-hangin' around my door \n\nDon't wanna see your face no more \n\nI don't need your war machines \n\nI don't need your ghetto scenes",
            "title_similarity": "0.7065977",
            "sentiment_compound": 0.0652
        },
        {
            "id": "i04vgtx",
            "score": 3,
            "text": "Wait until they actually read the lyrics to Born in the USA.",
            "title_similarity": "0.56076",
            "sentiment_compound": 0.0
        },
        {
            "id": "i04vksd",
            "score": 1,
            "text": ">WHEREAS, yada yada yada, Born to Run, whose title song has achieved **anthem-like status throughout the world** and has been **adopted as their song by the teenagers of New Jersey**; \r  \n\r\n\n\"We had no clue that reading the lyrics might be a good idea. Also, we've fired the person who researched the yada yada shit. It's all their fault.\"",
            "title_similarity": "0.76746655",
            "sentiment_compound": -0.8481
        },
        {
            "id": "i04vzt7",
            "score": 1,
            "text": "Sorta similar, the Bruins and Red Sox use Dirty Water by the Standells a song made to mock Boston as their win song.",
            "title_similarity": "0.46211898",
            "sentiment_compound": -0.2263
        },
        {
            "id": "i04wbhi",
            "score": 3,
            "text": "I don’t know when politicians are going to realize Bruce Springsteen isn’t Lee Greenwood.",
            "title_similarity": "0.681803",
            "sentiment_compound": 0.0
        },
        {
            "id": "i04wbx5",
            "score": 1,
            "text": "I think about homeless transients when I hear that song.",
            "title_similarity": "0.38894778",
            "sentiment_compound": 0.0
        },
        {
            "id": "i04wyw5",
            "score": 1,
            "text": "Man, politicians really have trouble paying attention to Springsteen lyrics.",
            "title_similarity": "0.5369795",
            "sentiment_compound": -0.4549
        },
        {
            "id": "i04x11h",
            "score": 1,
            "text": "Robert Wuhl has a great bit about this story in his standup act.  He does a complete comedy analysis of the songs lyrics. Awesomely funny.\nWatch:\nhttps://youtu.be/8sbhGggvCRI?t=113",
            "title_similarity": "0.33469966",
            "sentiment_compound": 0.8591
        },
        {
            "id": "i04x34v",
            "score": 2,
            "text": "Neil Young and ‘Rockin in the free world’ have entered the chat",
            "title_similarity": "0.30371428",
            "sentiment_compound": 0.5106
        },
        {
            "id": "i04x3d6",
            "score": 1,
            "text": "Wait, aren't \"death trap\" and \"suicide rap\" good things",
            "title_similarity": "0.4838419",
            "sentiment_compound": 0.3628
        },
        {
            "id": "i04x4s6",
            "score": 1,
            "text": "As a New Jerseyan, this is hilarious. Also, we're the only state without an official state song.",
            "title_similarity": "0.5531567",
            "sentiment_compound": 0.4019
        },
        {
            "id": "i04xdva",
            "score": 3,
            "text": "He's good at that. \"Born in the USA\" isn't the anthem that the chorus makes it seem to be either.",
            "title_similarity": "0.5017601",
            "sentiment_compound": 0.4404
        },
        {
            "id": "i04xjc9",
            "score": 1,
            "text": "This reminds me of right wing politicians using \"Born In The USA\" as a jingoistic campaign rally song.",
            "title_similarity": "0.55308646",
            "sentiment_compound": 0.0
        },
        {
            "id": "i04xqo6",
            "score": 1,
            "text": "[deleted]",
            "title_similarity": "0.14549185"
        },
        {
            "id": "i04xsb8",
            "score": 1,
            "text": "When I was in high school we had an assemble where a band came to play. They played Brn to Run and a bunch of us stood up and put out hands over our hearts. \n\nWe all got detention. We still laugh about it. \n\nIf you're going to pick a Bruce song why not Jersey Girl. (And yes, I know it was written by Tom Waites). When you think about American icons the Jersey Girl is as iconic as the cowboy.",
            "title_similarity": "0.6750865",
            "sentiment_compound": 0.9169
        },
        {
            "id": "i04xttd",
            "score": 1,
            "text": "https://www.toneden.io/megantheestallion/post/megan-the-stallion-nail-pop-up-stream-to-win?referrer=55972319",
            "title_similarity": "0.33571696",
            "sentiment_compound": 0.0
        },
        {
            "id": "i04xvfx",
            "score": 1,
            "text": "And they got all the way past putting in the hours to think this up, draft the bill, and vote before they realized this…",
            "title_similarity": "0.4564221",
            "sentiment_compound": 0.0
        },
        {
            "id": "i04ybjm",
            "score": 2,
            "text": "Like when Microsoft used \"Start Me Up\" by the Rolling Stones in their ad campaign for Windows 95, and they conveniently cut out the lyrics \"You make a grown man cry\"",
            "title_similarity": "0.5561217",
            "sentiment_compound": -0.4019
        },
        {
            "id": "i04yjxd",
            "score": 1,
            "text": "Yeaaaaah, they should have gone with \"Jersey Girl\".  \n\nSuggestion submitted by the South Jersey Black Sheep Contingency.",
            "title_similarity": "0.49729806",
            "sentiment_compound": 0.0
        },
        {
            "id": "i04yppy",
            "score": 1,
            "text": "Morons...",
            "title_similarity": "0.09476104",
            "sentiment_compound": -0.3182
        },
        {
            "id": "i04z7dy",
            "score": 1,
            "text": "I mean of course it’s “Don’t stop believin’” right?",
            "title_similarity": "0.15597712",
            "sentiment_compound": -0.296
        },
        {
            "id": "i04z7t1",
            "score": 1,
            "text": "HAHAHA 😂",
            "title_similarity": "-0.09750591",
            "sentiment_compound": 0.8038
        },
        {
            "id": "i04z8jn",
            "score": 2,
            "text": "Just like his “Born in the USA” was about his avoiding the Vietnam war",
            "title_similarity": "0.671973",
            "sentiment_compound": -0.5859
        },
        {
            "id": "i04zkc5",
            "score": 1,
            "text": "It always makes me think of *Battle Royale*.",
            "title_similarity": "0.17388238",
            "sentiment_compound": -0.3818
        },
        {
            "id": "i04znf3",
            "score": 1,
            "text": "In a rare display of reading comprehension.",
            "title_similarity": "0.06144147",
            "sentiment_compound": 0.0
        },
        {
            "id": "i04ztj5",
            "score": 1,
            "text": "Ahh...lawmakers and forethought.",
            "title_similarity": "0.18138254",
            "sentiment_compound": 0.0
        },
        {
            "id": "i04zvah",
            "score": 1,
            "text": "[I know a song about this shithole of a state](https://youtu.be/PXALl6o4Aek)",
            "title_similarity": "0.38426435",
            "sentiment_compound": 0.0
        },
        {
            "id": "i04zw2x",
            "score": 1,
            "text": "Maybe Exit Song by Sum 41?",
            "title_similarity": "0.4393728",
            "sentiment_compound": 0.0
        },
        {
            "id": "i04zxoj",
            "score": 1,
            "text": "Bruce Springsteen is such a terrible singer that literally nobody understands what he’s singing about, ever.",
            "title_similarity": "0.5883073",
            "sentiment_compound": -0.4767
        },
        {
            "id": "i0505pr",
            "score": 2,
            "text": "[deleted]",
            "title_similarity": "0.14549185"
        },
        {
            "id": "i050avu",
            "score": 1,
            "text": "Its crazy to me that people live there or any endless urban sprawl.",
            "title_similarity": "0.34235126",
            "sentiment_compound": -0.34
        },
        {
            "id": "i050krw",
            "score": 1,
            "text": "Sure.  A song detailing how desperately people want to get the fuck out of New Jersey.",
            "title_similarity": "0.60536087",
            "sentiment_compound": -0.5423
        },
        {
            "id": "i050wkq",
            "score": 2,
            "text": "I think everyone at some point wants to leave New Jersey, but then there are those of us that discover that life is where you make it and sometimes, where you make it.....is New Jersey.",
            "title_similarity": "0.57578915",
            "sentiment_compound": -0.0258
        },
        {
            "id": "i050zgb",
            "score": 1,
            "text": "Journey and Detroit has entered the chat.",
            "title_similarity": "0.15071855",
            "sentiment_compound": 0.0
        },
        {
            "id": "i0516qk",
            "score": 2,
            "text": "Oh well, try again with Born in the USA?",
            "title_similarity": "0.38588107",
            "sentiment_compound": 0.2732
        },
        {
            "id": "i052anv",
            "score": 1,
            "text": "I thought it didn’t pass bc the bill was filled with broken heroes on a last chance power drive.",
            "title_similarity": "0.63980424",
            "sentiment_compound": 0.296
        },
        {
            "id": "i052had",
            "score": 1,
            "text": "I heard the same thing happened with Neil Young's \"Alabama\".",
            "title_similarity": "0.21375808",
            "sentiment_compound": 0.0
        },
        {
            "id": "i052roi",
            "score": 1,
            "text": "My guess is that whoever proposed the bill knew that and was trolling.",
            "title_similarity": "0.28363544",
            "sentiment_compound": 0.0
        },
        {
            "id": "i053gg7",
            "score": 33,
            "text": "> Now everybody, everybody has a love-hate relationship with their hometown. It's just built into the equation of growing up. If you take me, I'm Mr. Born to Run. I'm Mr. Thunder Fucking Road. I was born to run, not to stay! My home, New Jersey - it's a death trap. It's a suicide rap. Listen to the lyrics, alright? I had to get out, I gotta hit the highway, I'm a roadrunner man, I got the white line fever in my veins, I am gonna bring my girl and I have had enough of the shit that this place dishes out. I am gonna run, run, run, and I'm - well, I'm never coming back! \n\n> I currently live ten minutes from my hometown. But born to come back, or born to stay - who would've bought that shit? Nobody!\n\n— Bruce Springsteen, *Springsteen on Broadway*",
            "title_similarity": "0.6227226",
            "sentiment_compound": -0.8437
        },
        {
            "id": "i053gsf",
            "score": 1,
            "text": "According to Bruce himself it’s not about leaving NJ, just leaving Freehold lmao\n\nhttps://en.wikipedia.org/wiki/Born_to_Run_(Bruce_Springsteen_song)#Composition",
            "title_similarity": "0.67580795",
            "sentiment_compound": 0.6808
        },
        {
            "id": "i053y2h",
            "score": 1,
            "text": "I miss Lenny",
            "title_similarity": "0.23319773",
            "sentiment_compound": -0.1531
        },
        {
            "id": "i054yv2",
            "score": 2,
            "text": "Got em",
            "title_similarity": "-0.12596343",
            "sentiment_compound": 0.0
        },
        {
            "id": "i054zkk",
            "score": 1,
            "text": "Should be Hackensack by Fountains of Wayne",
            "title_similarity": "0.284333",
            "sentiment_compound": 0.0
        },
        {
            "id": "i0552kk",
            "score": 2,
            "text": "Bruce Springsteen sings about the plight of common people. Funny how often that puts him on collision course with US officials.",
            "title_similarity": "0.5597428",
            "sentiment_compound": 0.1027
        },
        {
            "id": "i0553y4",
            "score": 7,
            "text": "Bruce still lives in NJ, so it’s not like he ran away from the state.",
            "title_similarity": "0.49818063",
            "sentiment_compound": -0.3343
        },
        {
            "id": "i055e5s",
            "score": 1,
            "text": "lmao",
            "title_similarity": "-0.08925606",
            "sentiment_compound": 0.5994
        },
        {
            "id": "i055imi",
            "score": 1,
            "text": "I remember them joking about this in literally 1988.  The joke was \"why do you want your song about suicide machines\" as your anthem.  Looks like not much changes in Jersey legislation.",
            "title_similarity": "0.72594976",
            "sentiment_compound": 0.1027
        },
        {
            "id": "i0569br",
            "score": 1,
            "text": "I remember talk a few decades ago about choosing an official song for the City of Los Angeles. Despite the lyrics, there was some support for Randy Newman's *I Love L.A.*, but the way I remembered it, Frank Sanatra's *L.A.'s My Lady* was going to be the official song.\n\nWell, memory is a funny thing. I went on some research, and I'm not even sure that Los Angeles has an official song. I did find evidence that it did have one called *Angel Town*, back in the 1960's, but I also found evidence that L.A. no longer has an official song (L.A. County definitely does have one)\n\nThe answer to my question may be in the LA Times article linked below, but I don't have a subscription:\n\nhttps://www.latimes.com/california/story/2021-06-18/do-you-love-l-a-learn-these-other-songs-too",
            "title_similarity": "0.7000829",
            "sentiment_compound": 0.8503
        },
        {
            "id": "i056k8i",
            "score": 1,
            "text": "XX ya 5hguez),€",
            "title_similarity": "0.042451262",
            "sentiment_compound": 0.0
        },
        {
            "id": "i0577ql",
            "score": 2,
            "text": "Maybe Stacy's Mom by Fountains of Wayne?",
            "title_similarity": "0.40281767",
            "sentiment_compound": 0.0
        },
        {
            "id": "i057k4h",
            "score": 2,
            "text": "\"... eh. Still make it work.\"",
            "title_similarity": "-0.0800922",
            "sentiment_compound": 0.0
        },
        {
            "id": "i057u5w",
            "score": 1,
            "text": "Just like how politicians use “born in the USA” without realizing it’s anti-American and anti military industrial complex.",
            "title_similarity": "0.56849",
            "sentiment_compound": 0.0516
        },
        {
            "id": "i0586a7",
            "score": 2,
            "text": "Isn’t that what people do though?  Runaway from the Tristate area??  Sure seems like it in the south…",
            "title_similarity": "0.4260099",
            "sentiment_compound": 0.6531
        },
        {
            "id": "i0586kh",
            "score": 1,
            "text": "Tramps like us,\n\nbaby, we were born to proof-read!",
            "title_similarity": "0.23223078",
            "sentiment_compound": 0.4199
        },
        {
            "id": "i05a2eh",
            "score": 1,
            "text": "It's hilarious when politicians use \"Born in the USA\" as an anthem",
            "title_similarity": "0.49239725",
            "sentiment_compound": 0.4019
        },
        {
            "id": "i05bc04",
            "score": 2,
            "text": "Hope they don’t look too deeply at Born in the USA…",
            "title_similarity": "0.5666525",
            "sentiment_compound": 0.4404
        },
        {
            "id": "i05bq6r",
            "score": 1,
            "text": "May I recommend honoring this song by The World/Inferno Frienship Society as the \"Cabaret punk theme\" of New Jersey\n\n[May I recommend honoring this song by The World/Inferno Frienship Society as the \"Cabaret punk theme\" of New Jersey](https://www.youtube.com/watch?v=KbshG7nv1HE&ab_channel=TheWorld%2FInfernoFriendshipSociety-Topic)\n\n&#x200B;\n\n^(INB4 I'm a Californian who gots mad California love for the west coast)\n\n^(\\[throwing no shade towards the East Coast btw neither\\])",
            "title_similarity": "0.63637835",
            "sentiment_compound": 0.886
        },
        {
            "id": "i05buyl",
            "score": 1,
            "text": "picture kinda looks like Alessandro Del Piero",
            "title_similarity": "0.1584683",
            "sentiment_compound": 0.3008
        },
        {
            "id": "i05c3f9",
            "score": 2,
            "text": "Yeah, but name one song about running *towards* New Jersey...",
            "title_similarity": "0.54650176",
            "sentiment_compound": 0.1531
        },
        {
            "id": "i05cryl",
            "score": 1,
            "text": "TIL, born to runs about ditching NJ.  \n\nHahaha",
            "title_similarity": "0.51629275",
            "sentiment_compound": 0.5574
        },
        {
            "id": "i05du1e",
            "score": 1,
            "text": "Born in NJ. Left NJ over 30 years ago. No regrets. Tramps like me, baby I was born to run",
            "title_similarity": "0.5165424",
            "sentiment_compound": 0.5588
        },
        {
            "id": "i05ecc7",
            "score": 1,
            "text": "It's literally in the damn title?!?",
            "title_similarity": "0.09321465",
            "sentiment_compound": -0.5191
        },
        {
            "id": "i05ed0v",
            "score": 1,
            "text": "I remember the republican party using Born in the USA without asking him",
            "title_similarity": "0.65481734",
            "sentiment_compound": 0.4019
        },
        {
            "id": "i05f3tm",
            "score": 1,
            "text": "Ironically, my (NJ) high School principal thought the song \"break away\" by kelly clarkson was too negative for a graduation song, so she recommended \"The Rising\" by Bruce....a song about literally overcoming 9/11....but sure, the kelly clarkson song made our school look bad.",
            "title_similarity": "0.7225983",
            "sentiment_compound": -0.5888
        },
        {
            "id": "i05f6wv",
            "score": 1,
            "text": "r/newjersey",
            "title_similarity": "0.13378975",
            "sentiment_compound": 0.0
        },
        {
            "id": "i05f92x",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.11652437"
        },
        {
            "id": "i05gplp",
            "score": 3,
            "text": "Here’s comedian Robert Wuhl’s routine about that:\nhttps://youtu.be/YcOBb6PNIoM",
            "title_similarity": "0.32723007",
            "sentiment_compound": 0.3818
        },
        {
            "id": "i05gzja",
            "score": 1,
            "text": "He ran away from New Jersey but the first earthquake he felt in Cali made him high tail right back 😂",
            "title_similarity": "0.6824775",
            "sentiment_compound": 0.5927
        },
        {
            "id": "i05hfgf",
            "score": 2,
            "text": "You've gotta read the words before you start pumping your first to one of his songs.",
            "title_similarity": "0.49285704",
            "sentiment_compound": 0.0
        },
        {
            "id": "i05ib1x",
            "score": 2,
            "text": "Politicians, the vast majority, are just fucking tools who couldn’t make it in any other livelihood. The 2-party system guarantees the biggest shithead will rise like the best and brightest…actually faster under the new R anti America party",
            "title_similarity": "0.50284606",
            "sentiment_compound": 0.5859
        },
        {
            "id": "i05ijzf",
            "score": 1,
            "text": "Sounds about right",
            "title_similarity": "-0.13038057",
            "sentiment_compound": 0.0
        },
        {
            "id": "i05ip4l",
            "score": 2,
            "text": "A more fitting song woult be the Aminals' \"We Gotta Get Out of This Place\"... and I did just that 4 months ago, and I'm not looking back!",
            "title_similarity": "0.6193584",
            "sentiment_compound": 0.0
        },
        {
            "id": "i05j2ia",
            "score": 1,
            "text": "Just like Born in the USA isn’t a patriotic tune.",
            "title_similarity": "0.50854945",
            "sentiment_compound": 0.3612
        },
        {
            "id": "i05mdaa",
            "score": 1,
            "text": "That’s the most New Jersey thing ever to almost make your new theme a song about running away from your state haha. it’s literally called “born to run”, what did you expect?",
            "title_similarity": "0.70186794",
            "sentiment_compound": 0.4588
        },
        {
            "id": "i05moxr",
            "score": 1,
            "text": "I feel like this song is like one of the most misinterpreted songs ever. Along with Fortunate Son.",
            "title_similarity": "0.33915615",
            "sentiment_compound": 0.6494
        },
        {
            "id": "i05on34",
            "score": 1,
            "text": "What gave it away? Was it the line “it’s a death trap, it’s a suicide rap”?",
            "title_similarity": "0.43080306",
            "sentiment_compound": -0.9013
        },
        {
            "id": "i05ot2r",
            "score": 2,
            "text": "But doesn’t he still live in NJ in the same neighborhood as Oprah?",
            "title_similarity": "0.49856994",
            "sentiment_compound": 0.0
        },
        {
            "id": "i05ou35",
            "score": 1,
            "text": "Wait until they learn what Born In The U.S.A. is about.",
            "title_similarity": "0.40215608",
            "sentiment_compound": 0.0
        },
        {
            "id": "i05ov6w",
            "score": 1,
            "text": "This is like when all these politicians etc want to use “Born in the USA” as a “‘MURICA, FUCK YEAH!” song, even though it’s an anti-war song talking about how bad the military is.",
            "title_similarity": "0.59606993",
            "sentiment_compound": -0.7371
        },
        {
            "id": "i05p0b0",
            "score": 1,
            "text": "\"Baby this town rips the bones from your back, it's a death trap, it's a suicide rap, we gotta get out while we're young, cause tramps like us, baby we were born to run.\" I mean, how did they not realize it. Also Bruce spent like 3 months perfecting this masterpiece, I vaguely read some of his book in a costco 5 years ago.",
            "title_similarity": "0.6278099",
            "sentiment_compound": 0.3559
        },
        {
            "id": "i05q1i9",
            "score": 1,
            "text": "Just like “Born in the USA” or “Keep on Rocking in the Free World” aren’t the pro-American patriot songs that some people try to co-opt as conservative right wing anthems. People not paying attention to lyrics pisses me off.",
            "title_similarity": "0.6507566",
            "sentiment_compound": 0.5267
        },
        {
            "id": "i05s518",
            "score": 2,
            "text": "You gotta pass the bill to see the lyrics",
            "title_similarity": "0.33701578",
            "sentiment_compound": 0.0
        },
        {
            "id": "i05sei0",
            "score": 1,
            "text": "I thought the NJ theme song was \"Stuck outside of Mobile with the Memphis blues again\"?",
            "title_similarity": "0.63734496",
            "sentiment_compound": -0.25
        },
        {
            "id": "i05snua",
            "score": 2,
            "text": "Wait until America hears the meaning behind Born in the USA :)",
            "title_similarity": "0.43226457",
            "sentiment_compound": 0.4588
        },
        {
            "id": "i05t3wq",
            "score": 3,
            "text": "Misunderstanding Springsteen since at least 1972. They still play Born in the USA at Republican rallies. This song, I don't think it means what you think it means.\n\nI remember watching Roger and Me in 1990 and Flint had a big rally to show they weren't down and out and they played \"My Hometown\" by Springsteen. It starts off like they want but gets pretty dark by the second verse.\n\nIn '65 tension was running high\n\nAt my high school\n\nThere was a lot of fights\n\nBetween the black and white\n\nThere was nothing you could do\n\nTwo cars at a light on a Saturday night\n\nIn the back seat there was a gun\n\nWords were passed in a shotgun blast\n\nTroubled times had come\n\nTo my hometown\n\n\n\nNow Main Street's whitewashed windows\n\nAnd vacant stores\n\nSeems like there ain't nobody\n\nWants to come down here no more\n\nThey're closing down the textile mill\n\nAcross the railroad tracks\n\nForeman says, \"these jobs are going, boys\n\nAnd they ain't coming back\n\nTo your hometown",
            "title_similarity": "0.68752253",
            "sentiment_compound": -0.7543
        },
        {
            "id": "i05t5y7",
            "score": 6,
            "text": "Oh, baby this town rips the bones from your back\nIt's a death trap, it's a suicide rap\nWe gotta get out while we're young\n'Cause tramps like us, baby, we were born to run\n\nMost of Bruce's songs of that era were pretty damned dark, but that doesn't keep people from using them as campaign songs (Born in the USA), wedding songs (tunnel of love).",
            "title_similarity": "0.66055393",
            "sentiment_compound": 0.4588
        },
        {
            "id": "i05thgr",
            "score": 1,
            "text": "And I thought it was 'Shake, Rattle and Roll'?",
            "title_similarity": "0.22930187",
            "sentiment_compound": -0.1779
        },
        {
            "id": "i05udb1",
            "score": 1,
            "text": "I think I was in 7th or 8th grade when there was a petition for this going around school.",
            "title_similarity": "0.34266958",
            "sentiment_compound": 0.0
        },
        {
            "id": "i05ug62",
            "score": 2,
            "text": "Wait until they hear what born in the USA is about....",
            "title_similarity": "0.44313353",
            "sentiment_compound": 0.0
        },
        {
            "id": "i05w2kf",
            "score": 1,
            "text": "I read about this a while back and found it pretty funny. I can see how someone might not want their state to be associated with a song about running away, but I don't think it's a big deal.",
            "title_similarity": "0.58411694",
            "sentiment_compound": 0.4477
        },
        {
            "id": "i05xd07",
            "score": 1,
            "text": "I saw this post of a beautiful view from each state. New Jersey's picture was of the Deleware Water Gap.\n\nIt was a picture of the Pennsylvania side of the Deleware River.\n\nI suppose the second most beautiful view from New Jersey would be of New York City.",
            "title_similarity": "0.50971943",
            "sentiment_compound": 0.8439
        },
        {
            "id": "i05y1bl",
            "score": 1,
            "text": "Reminds me of when my Mexican homie thought it would be funny to do Born In The USA at the Japanese karaoke joint until he got to… the part.",
            "title_similarity": "0.57942855",
            "sentiment_compound": 0.4404
        },
        {
            "id": "i05yip3",
            "score": 1,
            "text": "I remember a comedian in the 90's riffing on this. \n\n\"It's a death trap, it's a suicide rap. Tourism is gonna skyrocket!\"",
            "title_similarity": "0.5389021",
            "sentiment_compound": -0.8553
        },
        {
            "id": "i05za4e",
            "score": 1,
            "text": "As a New Jersey resident, I can confirm this song would have been an accurate one for residents' feelings",
            "title_similarity": "0.3877768",
            "sentiment_compound": 0.0
        },
        {
            "id": "i060623",
            "score": 3,
            "text": "Literally most of Springsteen's big hits are \"Man this place sucks, I should leave\"\n\nThus cementing the theory that Bruce Springsteen, is a Pop Punk artist.",
            "title_similarity": "0.63354576",
            "sentiment_compound": -0.4019
        },
        {
            "id": "i0607qt",
            "score": 2,
            "text": "Meanwhile, not only does Bruce still live in Jersey, he still lives in Monmouth County.",
            "title_similarity": "0.39119625",
            "sentiment_compound": 0.0
        },
        {
            "id": "i0616ts",
            "score": 2,
            "text": "It's a town full of losers, but we're pulling out of here to win",
            "title_similarity": "0.5243891",
            "sentiment_compound": 0.6124
        },
        {
            "id": "i062cxu",
            "score": 1,
            "text": "Started by Carol Miller (WPLJ). I remember her talking this up on my radio every morning while I got ready for school. I’m old.",
            "title_similarity": "0.4686447",
            "sentiment_compound": 0.3612
        },
        {
            "id": "i062xa8",
            "score": 4,
            "text": "Wouldn’t be the first time government officials failed to realize the sarcasm of a Springsteen song",
            "title_similarity": "0.6186998",
            "sentiment_compound": -0.6369
        },
        {
            "id": "i0638io",
            "score": 2,
            "text": "AMEN BROTHER!",
            "title_similarity": "0.1247592",
            "sentiment_compound": 0.0
        },
        {
            "id": "i063jet",
            "score": 2,
            "text": "[Reminds me of the Trump supporters dancing to Rage Against the Machine](https://www.youtube.com/watch?v=ddrFt1BHkUQ)",
            "title_similarity": "0.44484872",
            "sentiment_compound": -0.1779
        },
        {
            "id": "i064i2p",
            "score": 1,
            "text": "Now that is funny.. lol",
            "title_similarity": "-0.046754804",
            "sentiment_compound": 0.6908
        },
        {
            "id": "i0650yx",
            "score": 2,
            "text": "Grew up in NJ. They gave me a driver's license, and I considered it permission to leave.",
            "title_similarity": "0.5705514",
            "sentiment_compound": -0.0516
        },
        {
            "id": "i065uq4",
            "score": 3,
            "text": "Idk if this happens to people born and raised outside of New Jersey, but if a Bruce song comes on that I’ve never heard before, I automatically know it’s Bruce, even if he hasn’t started signing yet.\n\nAlso my fourth grade teacher had a life size cardboard cutout of Bruce that she kept in a closet and took out to “keep an eye on us” when she had to use the bathroom or talk to another teacher. None of us disrespected Bruce or his authority.",
            "title_similarity": "0.6192732",
            "sentiment_compound": 0.5377
        },
        {
            "id": "i065ymj",
            "score": 2,
            "text": "[deleted]",
            "title_similarity": "0.14549185"
        },
        {
            "id": "i0662za",
            "score": 2,
            "text": "Didn't a president use \"Born In The USA\" at their campaign not realizing it doesn't mean what they think it means?",
            "title_similarity": "0.68257725",
            "sentiment_compound": 0.0
        },
        {
            "id": "i066gr7",
            "score": 2,
            "text": "They cant even use \"Thunder Road\" as its essentially the same message 🤣",
            "title_similarity": "0.49613017",
            "sentiment_compound": 0.4939
        },
        {
            "id": "i067i20",
            "score": 2,
            "text": "This is the perfect analogy for American Politics in a Nutshell",
            "title_similarity": "0.2657198",
            "sentiment_compound": 0.5719
        },
        {
            "id": "i068yak",
            "score": 1,
            "text": "I think NJ's rock theme should be Jump by American/Dutch band Van Halen. In honor of the Dutch origins of New Jersey.",
            "title_similarity": "0.652704",
            "sentiment_compound": 0.4939
        },
        {
            "id": "i0692kk",
            "score": 3,
            "text": "Incidentally, if you've never heard it before, there is a fantastic acoustic version of this song he did live a number of years ago -\n\nhttps://www.youtube.com/watch?v=dONEgrsYoOk",
            "title_similarity": "0.51849204",
            "sentiment_compound": 0.5994
        },
        {
            "id": "i0694zs",
            "score": 1,
            "text": "And yet today Bruce currently lives 10 minutes from Freehold.  Born to come back?",
            "title_similarity": "0.44626236",
            "sentiment_compound": 0.1779
        },
        {
            "id": "i069gjh",
            "score": 2,
            "text": "Why would anybody want to run away from New Jersey?",
            "title_similarity": "0.619144",
            "sentiment_compound": 0.0772
        },
        {
            "id": "i06a1b5",
            "score": 2,
            "text": "I never paid attention to Brice Springsteen lyrics until I saw the movie Blinded by the Light. Now I like Springsteen a lot more",
            "title_similarity": "0.6080493",
            "sentiment_compound": 0.3612
        },
        {
            "id": "i06a421",
            "score": 1,
            "text": "I've always thought the best thing about NJ was NY",
            "title_similarity": "0.34835282",
            "sentiment_compound": 0.6369
        },
        {
            "id": "i06a98y",
            "score": 2,
            "text": "\"Y'all don't want to hear me, you just want to dance\"",
            "title_similarity": "0.38414973",
            "sentiment_compound": 0.0201
        },
        {
            "id": "i06c3qm",
            "score": 1,
            "text": "Springsteen was never my jam. All his stuff is so fucking depressing.",
            "title_similarity": "0.53865093",
            "sentiment_compound": -0.489
        },
        {
            "id": "i06d8i9",
            "score": 2,
            "text": "Next we should make Born in the USA the new national anthem.",
            "title_similarity": "0.5536399",
            "sentiment_compound": 0.0
        },
        {
            "id": "i06edua",
            "score": 1,
            "text": "Yeah, but it’s still an unofficial anthem.",
            "title_similarity": "0.2598616",
            "sentiment_compound": 0.1531
        },
        {
            "id": "i06hjal",
            "score": 1,
            "text": "I wish the Republican Party would make a similar realization when listening to C.C.R.’s “Fortunate Son”.",
            "title_similarity": "0.47037187",
            "sentiment_compound": 0.6597
        },
        {
            "id": "i06hrzo",
            "score": 2,
            "text": "Reminds me of all of the people who think Born in the USA is a pro USA song.",
            "title_similarity": "0.40132356",
            "sentiment_compound": 0.0
        },
        {
            "id": "i06j9fy",
            "score": 1,
            "text": "President Reagan tried to use the Bruce Springsteen song' \"Born in the USA\" during his run for office.   Until #1 someone actually listened to the song beyond the title and discovered it wasn't about what they thought it was and #2 Springsteen made it known that he never gave Reagan permission to use his song and to stop.",
            "title_similarity": "0.8554374",
            "sentiment_compound": -0.296
        },
        {
            "id": "i06jo4p",
            "score": 1,
            "text": "\"TIL New State\" ==> \"TIL New Jersey State\", correct?",
            "title_similarity": "0.46865922",
            "sentiment_compound": 0.0
        },
        {
            "id": "i06ke96",
            "score": 1,
            "text": "What is it with politicians and not listening to lyrics?",
            "title_similarity": "0.5044281",
            "sentiment_compound": 0.0
        },
        {
            "id": "i06l7q6",
            "score": 2,
            "text": "So I guess it should be the state song of that place where we really wanna go and we'll walk in the sun.",
            "title_similarity": "0.46507633",
            "sentiment_compound": 0.0
        },
        {
            "id": "i06lcit",
            "score": 1,
            "text": "New Jersey, the filthy armpit of America",
            "title_similarity": "0.41633034",
            "sentiment_compound": 0.0
        },
        {
            "id": "i06lid2",
            "score": 1,
            "text": "Beats a Saturday night in Nutley.",
            "title_similarity": "0.28951845",
            "sentiment_compound": 0.0
        },
        {
            "id": "i06nfx2",
            "score": 2,
            "text": "You are totally destroying my PhD thesis, “ Bruce Springsteen, the most misunderstood songwriter in American history”.  It doesn’t have any weight now. Now it’s just gonna be “Bruce Springsteen, The greatest American songwriter”.  As it should be. Darkness on the edge of town is reason enough to completely ignore everyone else.\n   And also, I have spent the last 20 years in Florida like 100 feet or so from the beach, I’d kind of rather live in Jersey. My dad lived there for a long time, and at least there was shit to do and you weren’t surrounded by old goobers.  Florida deserves a Bruce Springsteen to make people realize how much it sucks here,  But the people that are born here are too classless and stupid to write a song that has any meaning.  So… Go dirty jers",
            "title_similarity": "0.76665485",
            "sentiment_compound": -0.9305
        },
        {
            "id": "i06okj8",
            "score": 2,
            "text": "The amount of people in this country that fundamentally misunderstand Springsteen songs is staggering actually.",
            "title_similarity": "0.40000737",
            "sentiment_compound": -0.3612
        },
        {
            "id": "i06scqb",
            "score": 1,
            "text": "Guess what? *Born in the USA* isn't a rah-rah-pro 'merica! Song, either.\n\nWhen Reagan was running for president, either the first or the millionth time, I get a bit hazy, someone asked Bruce if they could use \"Born in the USA\" as theme song.\n\n\"No thanks, Mister.\" Was all The Boss said.",
            "title_similarity": "0.7560465",
            "sentiment_compound": 0.4926
        },
        {
            "id": "i06swc9",
            "score": 2,
            "text": "Instead they went with their other favorite Springsteen hit “ Born in the USA”🤦‍♂️",
            "title_similarity": "0.5848093",
            "sentiment_compound": 0.4588
        },
        {
            "id": "i06t0l6",
            "score": 1,
            "text": "I, too, don't really listen to lyrics, Jersey state senate. It can cause awkward situations.",
            "title_similarity": "0.62904453",
            "sentiment_compound": -0.1531
        },
        {
            "id": "i06tvm8",
            "score": 1,
            "text": "This story isn’t true: a conservative legislator objected to the phrase “tramps like us”.",
            "title_similarity": "0.60456824",
            "sentiment_compound": 0.6486
        },
        {
            "id": "i06w4dz",
            "score": 2,
            "text": "Wait until they find out what “Born in the USA” is really about…",
            "title_similarity": "0.46048057",
            "sentiment_compound": 0.0
        },
        {
            "id": "i06wh0b",
            "score": 2,
            "text": "My username checks out",
            "title_similarity": "0.003963176",
            "sentiment_compound": 0.0
        },
        {
            "id": "i06wnly",
            "score": 1,
            "text": "\"Fine, we won't use it. What about Thunder Road? What's that about? Oh. What about....\"",
            "title_similarity": "0.4851006",
            "sentiment_compound": 0.2869
        },
        {
            "id": "i06zlds",
            "score": 1,
            "text": "Comedian Robert Wohl had a whole bit about this back in the 90's\n\nhttps://www.youtube.com/watch?v=8sbhGggvCRI",
            "title_similarity": "0.39931503",
            "sentiment_compound": 0.3818
        },
        {
            "id": "i070wyd",
            "score": 2,
            "text": "All that classic rock trivia taking up room in my brain just might be useful in a job situation after all!",
            "title_similarity": "0.42673203",
            "sentiment_compound": 0.4926
        },
        {
            "id": "i073nwi",
            "score": 1,
            "text": "Well, maybe Pennsylvania could use it!",
            "title_similarity": "0.17284587",
            "sentiment_compound": 0.3382
        },
        {
            "id": "i0747wg",
            "score": 3,
            "text": "There are still people who think Born in the USA is pure patriotism",
            "title_similarity": "0.34740117",
            "sentiment_compound": 0.0
        },
        {
            "id": "i077ket",
            "score": 2,
            "text": "I’ve noticed a lot of folks that claim to love Bruce don’t know what his songs are really about.",
            "title_similarity": "0.49085957",
            "sentiment_compound": 0.6369
        },
        {
            "id": "i07922t",
            "score": 1,
            "text": "May I nominate, \"We're having a party\"?  Southside Johnny & the Asbury Jukes",
            "title_similarity": "0.46830392",
            "sentiment_compound": 0.4019
        },
        {
            "id": "i07btvu",
            "score": 1,
            "text": "Ooooooh fuckin' Maddon! What? No gabagol? It fell off the back of truck. Fuuuugettaboutit!",
            "title_similarity": "0.4995078",
            "sentiment_compound": -0.528
        },
        {
            "id": "i07dlj4",
            "score": 2,
            "text": "People still get surprised when they read the lyrics to Born in the USA",
            "title_similarity": "0.4939493",
            "sentiment_compound": 0.2263
        },
        {
            "id": "i07h8dy",
            "score": 1,
            "text": "LMAO king",
            "title_similarity": "0.09419764",
            "sentiment_compound": 0.6841
        },
        {
            "id": "i07hbr6",
            "score": 1,
            "text": "Question…it’s it a pork roll or Taylor ham, egg and cheese?!?!",
            "title_similarity": "0.26050705",
            "sentiment_compound": 0.0
        },
        {
            "id": "i07i77d",
            "score": 1,
            "text": "He mumbles his lyrics and moans anyway! Who know what he was singing about?",
            "title_similarity": "0.43039876",
            "sentiment_compound": -0.2244
        },
        {
            "id": "i07mow4",
            "score": 1,
            "text": "Yeah, I guess so",
            "title_similarity": "-0.1101856",
            "sentiment_compound": 0.296
        },
        {
            "id": "i07p0il",
            "score": 2,
            "text": "The only thing that runs in NJ is diabetes and poverty.",
            "title_similarity": "0.37483984",
            "sentiment_compound": -0.5106
        },
        {
            "id": "i07ro7w",
            "score": 1,
            "text": "A laugh emoji is desperately needed.",
            "title_similarity": "0.13304165",
            "sentiment_compound": 0.25
        },
        {
            "id": "i07uz0q",
            "score": 2,
            "text": "Haha but most only make it as far as Philly.",
            "title_similarity": "0.2943623",
            "sentiment_compound": 0.25
        },
        {
            "id": "i07vzo3",
            "score": 1,
            "text": "Why would New York State vote on the official song of the State of New Jersey?",
            "title_similarity": "0.69154334",
            "sentiment_compound": 0.0
        },
        {
            "id": "i07xp9x",
            "score": 3,
            "text": "Similar thing happened with born in the USA. A presidential candidate [I want to say Reagan but could be wrong] looked into using it as their campaign song until they realized it was outright condemning the US government and how they had handled the war in Vietnam.",
            "title_similarity": "0.7417136",
            "sentiment_compound": -0.8847
        },
        {
            "id": "i07y5p4",
            "score": 1,
            "text": "Great song.",
            "title_similarity": "0.055372674",
            "sentiment_compound": 0.6249
        },
        {
            "id": "i081yn7",
            "score": 1,
            "text": "Comedian Robert Wuhl (best known for the 1989 Tim Burton Batman movie) had a great bit about this...\n\nThe song mentions suicide a couple of times which really not what you want in a state song.",
            "title_similarity": "0.6822724",
            "sentiment_compound": 0.7334
        },
        {
            "id": "i0840w0",
            "score": 1,
            "text": "Bruce himself has noted the irony of the fact that he is “Mister Born to Run” and currently lives less than ten miles from his hometown.",
            "title_similarity": "0.5044709",
            "sentiment_compound": -0.0516
        },
        {
            "id": "i084qo7",
            "score": 1,
            "text": "Jersey; the only state you can enter for free, but gotta pay to get the FUCK OUT. Also Fuck \"Loose Bedspring\"",
            "title_similarity": "0.5737552",
            "sentiment_compound": -0.9325
        },
        {
            "id": "i08as7i",
            "score": 1,
            "text": "I'm pretty sure it should be the theme song now. Most of the people I know are transplants from NJ.",
            "title_similarity": "0.48955342",
            "sentiment_compound": 0.6705
        },
        {
            "id": "i08bwzg",
            "score": 1,
            "text": "I like the skynyrd version better",
            "title_similarity": "0.11845682",
            "sentiment_compound": 0.6597
        },
        {
            "id": "i08d1s2",
            "score": 1,
            "text": "New Jersey. The only state where it's free to enter but you have to pay to leave.",
            "title_similarity": "0.5129777",
            "sentiment_compound": 0.0644
        },
        {
            "id": "i08d275",
            "score": 1,
            "text": "New Jersey. The only state where it's free to enter but you have to pay to leave.",
            "title_similarity": "0.5129777",
            "sentiment_compound": 0.0644
        },
        {
            "id": "i08k7on",
            "score": 1,
            "text": "And that’s why we have two houses for legislation. I think…",
            "title_similarity": "0.24144058",
            "sentiment_compound": 0.0
        },
        {
            "id": "i08mjnj",
            "score": 1,
            "text": "I hope they don't actually look at the words in \"Born in the USA\"",
            "title_similarity": "0.6020197",
            "sentiment_compound": 0.4404
        },
        {
            "id": "i09x7b9",
            "score": 1,
            "text": "Leave it to legislators not to read anything before they vote on it.",
            "title_similarity": "0.5533577",
            "sentiment_compound": -0.0516
        },
        {
            "id": "i0bw8y2",
            "score": 2,
            "text": "A song by a singer from New Jersey, singing about leaving/running from New Jersey, but still lives in New Jersey is more New Jerseyan than you think it is and therefore should be the rock song of New Jersey.",
            "title_similarity": "0.7900951",
            "sentiment_compound": 0.0
        },
        {
            "id": "i0ez7sz",
            "score": 1,
            "text": "This post title is full of shit. The article just says the song was considered but not chosen, then they speculate that this might be why.",
            "title_similarity": "0.6808462",
            "sentiment_compound": -0.3182
        },
        {
            "id": "i14pie3",
            "score": 1,
            "text": "Do your homework...\nNext the NYC police want *American Skin (41 Shots)* to be their official song.",
            "title_similarity": "0.57442236",
            "sentiment_compound": 0.0772
        },
        {
            "id": "i1gm3ts",
            "score": 1,
            "text": "He has said so much shite about it (I agree, but I'm not from there) but had no problem filling Meadowlands...so maybe that makes him a true New Jerseyite!",
            "title_similarity": "0.528393",
            "sentiment_compound": 0.8238
        }
    ]
}