{
    "TIL that after Lance Armstrong was stripped of his wins, seven successive Tour de France races (1999-2005) were officially declared without winners because so many riders who finished behind Armstrong were also associated with doping offences.\n": [
        {
            "id": "i59z0ce",
            "score": -4,
            "text": "Anyone with any sense knows Lance won and don't begrudge it.\n\nBecause the fact is, he was just the best athlete and doper, in a field of athletes and dopers.\n\nThey really should legalise doping in cycling.",
            "title_similarity": "0.5869786",
            "sentiment_compound": 0.836
        },
        {
            "id": "i59s087",
            "score": -13,
            "text": "Lance Armstrong is the baddest mf to ever race on a bicycle. Period.",
            "title_similarity": "0.67294925",
            "sentiment_compound": 0.0
        },
        {
            "id": "i59rd77",
            "score": 33,
            "text": "I personally still think that Lance Armstrong is a badass regardless of the doping. I wonder if the other riders who were guilty of doing the same thing received even close to the amount of ridicule that he has over the years.",
            "title_similarity": "0.76956034",
            "sentiment_compound": -0.5267
        },
        {
            "id": "i59waf6",
            "score": 2,
            "text": "Name a clean sport.\n\nAll sport is dirty or dangerous, and kids know it.  Whether it's drugs, steroids, brain injuries (football, rugby), race/fight  fixing, sledging (cricket), advertising alcohol or gambling, glorifying dangerous speed, ripping off the fans with overpriced merch... Or simply killing thousands of slaves to build stadia in the Middle East or the use of child slave labour to make running shoes for pennies and selling them for $100s, the whole fucking thing stinks.\n\nFuck sport and those that profit from it.\n\nGo for a run if you want to keep fit.",
            "title_similarity": "0.633171",
            "sentiment_compound": -0.829
        },
        {
            "id": "i59pjn4",
            "score": 21,
            "text": "Cycling is probably the dirtiest sport around, and it's always been that way.",
            "title_similarity": "0.5396682",
            "sentiment_compound": -0.5267
        },
        {
            "id": "i5a02f5",
            "score": 0,
            "text": "I would highly recommend checking out Bill Burr on Conan on this exact topic.",
            "title_similarity": "0.1907056",
            "sentiment_compound": 0.4201
        },
        {
            "id": "i5a3c6a",
            "score": -10,
            "text": "He won those tours. Period.",
            "title_similarity": "0.17788696",
            "sentiment_compound": 0.5719
        },
        {
            "id": "i5a8j3m",
            "score": -1,
            "text": "Lol if that’s true then they may as well have just left Armstrong the winner. What difference does it make when everyone is cheating",
            "title_similarity": "0.4943167",
            "sentiment_compound": 0.7845
        },
        {
            "id": "i5a5v3i",
            "score": -5,
            "text": "This is why I honestly can't hate Armstrong. He's still a great athlete who overcame cancer and did amazing things.",
            "title_similarity": "0.41823047",
            "sentiment_compound": 0.859
        },
        {
            "id": "i59rsjw",
            "score": -9,
            "text": "So, why not give him back the wins? I mean, I *guess* I can see it as some kind of merit thing but, in the end, it's sports, and sports has only one purpose: entertainment. I don't give a fuck if those involved are on drugs. It's like complaining an action star doesn't do their own stunts, IMO.",
            "title_similarity": "0.4936423",
            "sentiment_compound": 0.9123
        },
        {
            "id": "i5a5xqu",
            "score": -5,
            "text": "Unpopular opinion: if that many riders were doping, he won fair and square as that was the ‘normal’ approach. Say what you want about the man, but in that environment, he was the hands down best. \n\nWasn’t Armstrong also never caught but only admitted fault in the end?",
            "title_similarity": "0.69294757",
            "sentiment_compound": 0.7906
        },
        {
            "id": "i59zsnh",
            "score": -5,
            "text": "At this point let's stop giving a shit about doping. \n\nI want to see peak human performance. Performance enhancing drugs are needed to achieve that.",
            "title_similarity": "0.3269193",
            "sentiment_compound": -0.4767
        },
        {
            "id": "i5a7iew",
            "score": 10,
            "text": "And so, Lance Armstrong won all those races pretty much fairly because that was what you needed to do to compete at that time.",
            "title_similarity": "0.5295228",
            "sentiment_compound": 0.7845
        },
        {
            "id": "i59v9o3",
            "score": -2,
            "text": "A few years ago I heard an expert say it’s literally healthier to compete in the Tour de France on steroids than clean because of all the wear on a body.",
            "title_similarity": "0.6735029",
            "sentiment_compound": 0.4019
        },
        {
            "id": "i5a9ye0",
            "score": -3,
            "text": "Why not just legalize it?   Fuck it.   I wanna see a new Tour de France record every year.  They wanna die at 42 for glory... who am I?  Stop wasting taxpayer dollars trying to crucify these cheating losers and just legalize.",
            "title_similarity": "0.68397415",
            "sentiment_compound": -0.9447
        },
        {
            "id": "i5a3pes",
            "score": -5,
            "text": "Which is why I just roll my eyes when people get so down on him for cheating.  He didn't do anything that everyone else wasn't already doing.  He just got caught.",
            "title_similarity": "0.61758834",
            "sentiment_compound": -0.5574
        },
        {
            "id": "i5a7bxa",
            "score": 2,
            "text": "Our doped up guy beat your doped up guy: Who gives a shit?",
            "title_similarity": "0.38159287",
            "sentiment_compound": -0.5574
        },
        {
            "id": "i5a9wsi",
            "score": 2,
            "text": "To quote Bill Burr: Who gives a shit anymore, Our 'roided up guy beat your 'roided up guy.",
            "title_similarity": "0.48410368",
            "sentiment_compound": -0.5574
        },
        {
            "id": "i5a4dsy",
            "score": -2,
            "text": "bill burr was right",
            "title_similarity": "0.0025437865",
            "sentiment_compound": 0.0
        },
        {
            "id": "i5b0lax",
            "score": 1,
            "text": "So, in other words, Lance won 7 Tour De Frances on a. level  playing field?",
            "title_similarity": "0.42822433",
            "sentiment_compound": 0.6705
        },
        {
            "id": "i59wk8a",
            "score": 2,
            "text": "They should just allow all types of doping on all sports.  Call it the unlimited class.",
            "title_similarity": "0.3247858",
            "sentiment_compound": 0.2263
        },
        {
            "id": "i5a7b91",
            "score": -2,
            "text": "[Our roided up guy, beat your roided up guy.](https://youtu.be/O9YL04v-J5U)",
            "title_similarity": "0.344982",
            "sentiment_compound": 0.0
        },
        {
            "id": "i5a35wk",
            "score": 16,
            "text": "He is such a horrible human, he destroyed people who claimed he was doping.\n\nHe deserves to burn in whatever hell he believes in.",
            "title_similarity": "0.56224334",
            "sentiment_compound": -0.9062
        },
        {
            "id": "i5aea1b",
            "score": 0,
            "text": "I just bought a bunch of stuff at his shop in Austin.  I got some good deals. The yellow jerseys are still on the wall in there.",
            "title_similarity": "0.35122988",
            "sentiment_compound": 0.4404
        },
        {
            "id": "i5akp7r",
            "score": 0,
            "text": "Bill Burr said it best \"Our roided up guy beat your roided up guy.  What is the problem?\"",
            "title_similarity": "0.41426048",
            "sentiment_compound": 0.3612
        },
        {
            "id": "i59pnqu",
            "score": -2,
            "text": "Didn’t they know he had cancer and not tell him too?",
            "title_similarity": "0.51583475",
            "sentiment_compound": -0.6597
        },
        {
            "id": "i59u1uv",
            "score": -3,
            "text": "Our doped up guy beat your doped up guy.",
            "title_similarity": "0.3653003",
            "sentiment_compound": 0.0
        },
        {
            "id": "i5a6qd2",
            "score": 1,
            "text": "If there were that many other offenders,  they should've just let him keep the victories",
            "title_similarity": "0.41612756",
            "sentiment_compound": -0.3612
        },
        {
            "id": "i5a70u6",
            "score": 2,
            "text": "At that point give him the awards since he was the best of all the dopers",
            "title_similarity": "0.27192277",
            "sentiment_compound": 0.802
        },
        {
            "id": "i5a79dw",
            "score": 0,
            "text": "So if everybody doing it, he's the best at it. That means he's the champ right??  IMO he still is.",
            "title_similarity": "0.2534725",
            "sentiment_compound": 0.8253
        },
        {
            "id": "i5ahc6u",
            "score": 2,
            "text": "Professional Road Biking is as doped now as it ever was. The professional anti doping authorities will tell you it’s always been and always will be a case of the hunted (doping) trying to stay one step ahead of the hunters (doping police). The dopers doctors are always finding new synthetic performance enhancers and ways to mask them, so they’re always a few years ahead of the doping control police as the police learn of ways to catch and stop the latest techniques, which by the time they do, the dopers doctors are already using the newer techniques. It’s a never ending cycle. Todays cyclists are as doped as Lance Armstrong ever was….they’re just using the latest technology!",
            "title_similarity": "0.6634691",
            "sentiment_compound": -0.5848
        },
        {
            "id": "i5ajffa",
            "score": -2,
            "text": "So it’s like Lance won these fair and square, right?",
            "title_similarity": "0.17737257",
            "sentiment_compound": 0.8307
        },
        {
            "id": "i59q076",
            "score": -17,
            "text": "There’s no reason not to allow doping in professional athletics. They are adults, let them do whatever. Makes sports fun again.",
            "title_similarity": "0.3702589",
            "sentiment_compound": 0.1114
        },
        {
            "id": "i59xikn",
            "score": 18,
            "text": "To be fair to Tour de France, this isn't primarily their fault.\n\nLance Armstrong got caught running a large sophisticated drug running ring to carry out and cover up widespread criminal fraud. That's at least a decade in jail, if not several.\n\nHas he spent a minute in jail? No.",
            "title_similarity": "0.75850785",
            "sentiment_compound": -0.0108
        },
        {
            "id": "i59th3w",
            "score": 6,
            "text": "Tour de Dope should be done on kids' tricycles.",
            "title_similarity": "0.17376289",
            "sentiment_compound": 0.0
        },
        {
            "id": "i59rc5f",
            "score": 4,
            "text": "Cheating just so you can level the playing field",
            "title_similarity": "0.22670516",
            "sentiment_compound": -0.4215
        },
        {
            "id": "i5a4mpr",
            "score": -3,
            "text": "The man beat bunch of other doped up people. That makes it a leveled playing field",
            "title_similarity": "0.36490244",
            "sentiment_compound": 0.2023
        },
        {
            "id": "i5acmzd",
            "score": -2,
            "text": "Fuck everyone was on, he should still be champ but with an asterisks. But above all that the ridicule he got was unnecessary, he raised around a half of a billion dollars for cancer research.",
            "title_similarity": "0.66407895",
            "sentiment_compound": -0.9062
        },
        {
            "id": "i5a53gt",
            "score": 1,
            "text": "So therefore, since damn near everyone was cheating, he was the best (amongst the cheaters). that's gotta count for something, right? 🤣",
            "title_similarity": "0.4689774",
            "sentiment_compound": -0.2648
        },
        {
            "id": "i5a79vy",
            "score": -1,
            "text": "... why not just let people fucking dope for the silly race?",
            "title_similarity": "0.44050735",
            "sentiment_compound": 0.0258
        },
        {
            "id": "i5ad9sc",
            "score": -1,
            "text": "I heard somewhere that it wasn't until they got to the forty-some odd placed riders where they found no signs of doping. To be fair, a large portion of sports would have the same result if drug-testing was actually implemented. But of course, Lance had to be the one thrown under the bus.",
            "title_similarity": "0.6307327",
            "sentiment_compound": -0.1531
        },
        {
            "id": "i5afbwk",
            "score": -1,
            "text": "Wouldn't that mean that it was a level playing field after all and his medals should be returned?",
            "title_similarity": "0.24908617",
            "sentiment_compound": 0.2023
        },
        {
            "id": "i5ah8iy",
            "score": -1,
            "text": "At this point what's the point of fotbidding it? The cheats now just become more sophisticated. Definitely, there is not a clear answer to that problem.",
            "title_similarity": "0.37741262",
            "sentiment_compound": 0.0483
        },
        {
            "id": "i5ahf35",
            "score": -1,
            "text": "\"Our roided up guy beat your roided up guy.\"",
            "title_similarity": "0.37961084",
            "sentiment_compound": 0.0
        },
        {
            "id": "i5ahiua",
            "score": -1,
            "text": "In that case, Lance Armstrong is still the winner in my books.",
            "title_similarity": "0.39438438",
            "sentiment_compound": 0.5859
        },
        {
            "id": "i5ai2b8",
            "score": -1,
            "text": "Just let them all dope anyway. People still think lance is the best of all time so what’s the diff",
            "title_similarity": "0.42377168",
            "sentiment_compound": 0.6369
        },
        {
            "id": "i5aiv2b",
            "score": -1,
            "text": "\"Our roided guy beat your roided guy\" - Bill Burr",
            "title_similarity": "0.44990057",
            "sentiment_compound": 0.0
        },
        {
            "id": "i5ajyfh",
            "score": -1,
            "text": "If they were all doping, does that not make it a fair race hence a fair win?",
            "title_similarity": "0.53990966",
            "sentiment_compound": 0.8126
        },
        {
            "id": "i5anxl5",
            "score": -1,
            "text": "Personally I feel Lance got thrown to the wolves because of his behavior out of the saddle.  Cycling a Eurocentric sport.  Many in the ISO hated the cocky attitude he brought to what they considered a sport of traditions.  It doesn't help that Lance burned bridges by attacking individuals and organizations that distanced themselves (not that I'm excusing his behavior).\n\nIf you look into professional cycling's history you'll find it was and never really will be a pure sport.  It started as a publicity stunt to make money for newspapers.",
            "title_similarity": "0.76577383",
            "sentiment_compound": -0.8738
        },
        {
            "id": "i5ao6i0",
            "score": -1,
            "text": "Lol, so what was even the point of “stripping his titles “?  Everyone still knows that he won over half a dozen TDFs, and if no one else was proclaimed to be the winner because they all doped, he uh…. Is still the winner.\n\nWhy not just nullify the entire tour all those years and say there was no TDF while at it.\n\nThe guy is a conceited dick apparently, but he was a freak athlete and would have won those titles off stuff if everyone else were clean too.  Stripping him was a reaction from the butthurt French because Lance DOMINATED.",
            "title_similarity": "0.78308856",
            "sentiment_compound": 0.8573
        },
        {
            "id": "i5aor4b",
            "score": -1,
            "text": "\"Our roided up guy, beat your roided up guy\" -Bill Burr",
            "title_similarity": "0.3818357",
            "sentiment_compound": 0.0
        },
        {
            "id": "i5b1zr4",
            "score": 1,
            "text": "That’s why it’s stupid to strip him. Everyone was cheating, everyone. The playing field was level",
            "title_similarity": "0.48765993",
            "sentiment_compound": -0.7351
        },
        {
            "id": "i5blh0h",
            "score": -1,
            "text": "Let him keep the medal if everyone is doing it lmao.",
            "title_similarity": "0.18604296",
            "sentiment_compound": 0.7906
        },
        {
            "id": "i5a9inn",
            "score": -6,
            "text": "Lance broke the rules, but he didn't cheat. Cheating would imply he had an unfair advantage against his competitors. Everyone was doping in that era. Level playing field. Lance is the greatest to ever do it. I will die on this hill.",
            "title_similarity": "0.6831968",
            "sentiment_compound": 0.7356
        },
        {
            "id": "i59ud5g",
            "score": 15,
            "text": "[Our 'roided Up guy beat your 'roided up guy](https://www.youtube.com/watch?v=O9YL04v-J5U)",
            "title_similarity": "0.40513724",
            "sentiment_compound": 0.0
        },
        {
            "id": "i59p60e",
            "score": 346,
            "text": "They should just let cyclists take steroids and name it Tour de Roids. I'm curious as how far can we push the limits using stimulants and steroids.",
            "title_similarity": "0.3772898",
            "sentiment_compound": 0.3182
        },
        {
            "id": "i5b1xpx",
            "score": 8,
            "text": "And that is how I became completely uninterested in the Tour de France.",
            "title_similarity": "0.54281014",
            "sentiment_compound": 0.0
        },
        {
            "id": "i5a15qg",
            "score": 0,
            "text": "Yeah no shit. Literally everyone is on gear",
            "title_similarity": "0.038433436",
            "sentiment_compound": 0.6278
        },
        {
            "id": "i5a379s",
            "score": 0,
            "text": "Let em dope, let ‘em ride baby",
            "title_similarity": "0.02795697",
            "sentiment_compound": 0.0
        },
        {
            "id": "i5a4gfv",
            "score": 0,
            "text": "At this point they should just make a pro doping league.",
            "title_similarity": "0.27770856",
            "sentiment_compound": 0.0
        },
        {
            "id": "i5a56dd",
            "score": 0,
            "text": "His Strava profile still says seven time tour de france winner\n\n[screenshot](https://i.imgur.com/VqMDQc1.png)",
            "title_similarity": "0.5894159",
            "sentiment_compound": 0.5859
        },
        {
            "id": "i5a5byu",
            "score": 0,
            "text": "In the words of the immortal Bill Burr:\n\n> OUR roided up guy beat YOUR roided up guy!\n\nStill have my “Live Strong” bands. Fuck the dumb shit",
            "title_similarity": "0.54614085",
            "sentiment_compound": -0.8655
        },
        {
            "id": "i5a5m12",
            "score": 0,
            "text": "Mega whatever. He won.",
            "title_similarity": "0.06970337",
            "sentiment_compound": 0.5719
        },
        {
            "id": "i5a5tw6",
            "score": 0,
            "text": "If everyone is cheating…. Is it cheating?",
            "title_similarity": "0.27253968",
            "sentiment_compound": -0.5574
        },
        {
            "id": "i5a5u2c",
            "score": 0,
            "text": "7 races had no wieners. Wow!",
            "title_similarity": "0.4986991",
            "sentiment_compound": -0.6771
        },
        {
            "id": "i5a6rmh",
            "score": 0,
            "text": "Our cheater was better than your cheaters!",
            "title_similarity": "0.3194856",
            "sentiment_compound": -0.5848
        },
        {
            "id": "i5a6wvh",
            "score": 0,
            "text": "Bill Burr has a good bit about this",
            "title_similarity": "0.025035344",
            "sentiment_compound": 0.4404
        },
        {
            "id": "i5a725n",
            "score": 0,
            "text": "I love how Road Bike ~~Action~~ Rectum fawned over these cheats.\n\nFloyd Landis that sack of crap got a free article about his dope growing business.",
            "title_similarity": "0.4977158",
            "sentiment_compound": 0.5859
        },
        {
            "id": "i5a7k9c",
            "score": 0,
            "text": "UCI: Yes yes, only THESE SEVEN TOURS were found to have entrants using banned substances.\n\nSelective application of a fair rule isn't all that fair imo.",
            "title_similarity": "0.7230283",
            "sentiment_compound": 0.4094
        },
        {
            "id": "i5a7qux",
            "score": 0,
            "text": "An overwhelming vast majority of professional athletes take performance enhancing drugs and dope. it's the reason they are professionals.\n\nNobody wants to watch regular people compete.",
            "title_similarity": "0.6968703",
            "sentiment_compound": 0.0
        },
        {
            "id": "i5a7tbp",
            "score": 0,
            "text": "The perfect way to describe this is how Bill Burr said it in his Conan interview. Our roided up guy beat your roided up guy.",
            "title_similarity": "0.45763382",
            "sentiment_compound": 0.5719
        },
        {
            "id": "i5a826y",
            "score": 0,
            "text": "So he still won. I call that a fair and level playing field",
            "title_similarity": "0.07981023",
            "sentiment_compound": 0.7943
        },
        {
            "id": "i5a8b5s",
            "score": 0,
            "text": "Sounds like it was an even playing field?",
            "title_similarity": "-0.034319546",
            "sentiment_compound": 0.5106
        },
        {
            "id": "i5a8du7",
            "score": 0,
            "text": "They are still Lance Armstrongs victories.",
            "title_similarity": "0.2628398",
            "sentiment_compound": 0.0
        },
        {
            "id": "i5a8h1l",
            "score": 0,
            "text": "\"Our roided up guy beat your roided up guy!\"",
            "title_similarity": "0.39164978",
            "sentiment_compound": 0.0
        },
        {
            "id": "i5a8hna",
            "score": 0,
            "text": "\"hah, our roided up guy beat your roided up guys\" - B. Burr",
            "title_similarity": "0.42606086",
            "sentiment_compound": 0.0
        },
        {
            "id": "i5a8px8",
            "score": 0,
            "text": "“Our roided up guy beat your roided up guy”",
            "title_similarity": "0.36471826",
            "sentiment_compound": 0.0
        },
        {
            "id": "i5a8sr6",
            "score": 0,
            "text": "If they’re all drugged, isn’t it fair?",
            "title_similarity": "0.22573644",
            "sentiment_compound": 0.3182
        },
        {
            "id": "i5a8tsr",
            "score": 0,
            "text": "So when everyone cheats no one cheats. He won lol",
            "title_similarity": "0.41781467",
            "sentiment_compound": 0.5527
        },
        {
            "id": "i5a8woh",
            "score": 0,
            "text": "YEAH! CHEATING!! USA IS #1!!!!!!",
            "title_similarity": "0.34802333",
            "sentiment_compound": -0.5526
        },
        {
            "id": "i5a9nrh",
            "score": 0,
            "text": "Like bill burr said, ‘our roided up guy beat your roided up guys!’",
            "title_similarity": "0.44475362",
            "sentiment_compound": 0.4199
        },
        {
            "id": "i5aa8q5",
            "score": 0,
            "text": "Lance > Neil\n\n/r/LANCESTRONG",
            "title_similarity": "0.05938004",
            "sentiment_compound": 0.0
        },
        {
            "id": "i5aaatd",
            "score": 0,
            "text": "So if everyone was using dropping, Lance is still the better cyclist and technically won.",
            "title_similarity": "0.45029676",
            "sentiment_compound": 0.765
        },
        {
            "id": "i5aadem",
            "score": 0,
            "text": "So it was a fair race after all. I don't see the problem.",
            "title_similarity": "0.19913512",
            "sentiment_compound": 0.5511
        },
        {
            "id": "i5aae0e",
            "score": 0,
            "text": "Lance Armstrong still rocks in my book. Go you one balled crazy bastard.",
            "title_similarity": "0.5384964",
            "sentiment_compound": -0.7096
        },
        {
            "id": "i5aaeou",
            "score": 0,
            "text": "[deleted]",
            "title_similarity": "0.10165896"
        },
        {
            "id": "i5aag0s",
            "score": 0,
            "text": "Just give him back the credit for winning them then.  It's not like anyone had an unfair advantage if they were all using them.",
            "title_similarity": "0.29335612",
            "sentiment_compound": 0.4195
        },
        {
            "id": "i5aarjt",
            "score": 0,
            "text": "“So our roid’ed up guys beat your roid’ed up guys.” -Bill Burr",
            "title_similarity": "0.45045516",
            "sentiment_compound": 0.0
        },
        {
            "id": "i5aawxg",
            "score": 0,
            "text": "At that point it sounds like they were all still competing on a level playing field. They should have just reinstated his winning titles.",
            "title_similarity": "0.43451053",
            "sentiment_compound": 0.7717
        },
        {
            "id": "i5abd7i",
            "score": 0,
            "text": "Bill Burr. Our roided up guy beat your roided up guys",
            "title_similarity": "0.43144044",
            "sentiment_compound": 0.0
        },
        {
            "id": "i5abk69",
            "score": 0,
            "text": "so.. if theyre all doped doesnt that mean he actually really won?",
            "title_similarity": "0.38347858",
            "sentiment_compound": 0.6115
        },
        {
            "id": "i5abtxy",
            "score": 0,
            "text": "Best cheater in a field of cheaters = rightful winner?  I mean, if everyone was doing it (hindsight suggests they were), then doesn’t that make him the best of that era?",
            "title_similarity": "0.50345206",
            "sentiment_compound": 0.7998
        },
        {
            "id": "i5acils",
            "score": 0,
            "text": "They all do it . And let them dope . I even’s the field",
            "title_similarity": "0.11072484",
            "sentiment_compound": 0.0
        },
        {
            "id": "i5acjqz",
            "score": 0,
            "text": "People are only upset with Armstrong because he was better at hiding the doping. With everybody doping, the races were fair.",
            "title_similarity": "0.6171688",
            "sentiment_compound": 0.1027
        },
        {
            "id": "i5acrpu",
            "score": 0,
            "text": "So He's still Champ then...... if everyone was doing it = equal terms.",
            "title_similarity": "0.1725212",
            "sentiment_compound": 0.5209
        },
        {
            "id": "i5adnxh",
            "score": 0,
            "text": "I still think he’s innocent",
            "title_similarity": "-0.008251011",
            "sentiment_compound": 0.34
        },
        {
            "id": "i5aduz9",
            "score": 0,
            "text": "\"Our roided up guy beat your roided up guy!\" - Bill Burr",
            "title_similarity": "0.4627511",
            "sentiment_compound": 0.0
        },
        {
            "id": "i5aejuh",
            "score": 0,
            "text": "most people are completely delusional to the fact that ALL professional athletes are doping. Even collegiate",
            "title_similarity": "0.7139364",
            "sentiment_compound": 0.0
        },
        {
            "id": "i5aem39",
            "score": 0,
            "text": "We know",
            "title_similarity": "-0.22094548",
            "sentiment_compound": 0.0
        },
        {
            "id": "i5aexne",
            "score": 0,
            "text": "So sounds like he was on an even playing field... Whether you like or hate lance, it's impossible to deny his riding ability and toughness. He may not have the official titles but he is the riding GOAT.",
            "title_similarity": "0.4152643",
            "sentiment_compound": 0.1379
        },
        {
            "id": "i5afgfk",
            "score": 0,
            "text": "Lance won.  If everyone is on a level field, and he dominated, he still won.",
            "title_similarity": "0.3080691",
            "sentiment_compound": 0.8126
        },
        {
            "id": "i5afgsu",
            "score": 0,
            "text": "I don't follow. Are they saying that for those races there was not ONE dude who was clean? He's your winner then, no?",
            "title_similarity": "0.6101255",
            "sentiment_compound": 0.782
        },
        {
            "id": "i5afihx",
            "score": 0,
            "text": "That's what I kept saying.  It should have been very easy for them to say \"OK, *this* guy came in second place, so he's the legitimate winner now.\"  The fact that they didn't even try just proves that it really was just about getting \"revenge\" on the American all along.",
            "title_similarity": "0.54144835",
            "sentiment_compound": 0.5563
        },
        {
            "id": "i5afjwc",
            "score": 0,
            "text": "So he's a champion after all best dope fiend around",
            "title_similarity": "0.41050762",
            "sentiment_compound": 0.8542
        },
        {
            "id": "i5afp52",
            "score": 0,
            "text": "So Lance Armstrong still won the right? If everyone is a cyborg at the human boxing match, then technically, at the end you still have a winner right?",
            "title_similarity": "0.6145619",
            "sentiment_compound": 0.8343
        },
        {
            "id": "i5ag2hu",
            "score": 0,
            "text": "This is why I don't agree with him being stripped of his titles.\n\nIf all the elite level riders were doping and he still smoked them, then doesn't that only strengthen his case as being the absolute best?",
            "title_similarity": "0.6743263",
            "sentiment_compound": 0.2796
        },
        {
            "id": "i5ag4yu",
            "score": 0,
            "text": "Our roided up guy beat your roided up guys.",
            "title_similarity": "0.3904225",
            "sentiment_compound": 0.0
        },
        {
            "id": "i5agauq",
            "score": 0,
            "text": "I don't understand why we don't have a league of sports that allows all drugs and enhancements. My arguments are:\n\nA) it would be fucking awesome to see what a human body is capable of when pushed to the absolute limits\n\nAnd\n\nB) it literally has absolutely no effect on your life so fuck off",
            "title_similarity": "0.54732966",
            "sentiment_compound": -0.4002
        },
        {
            "id": "i5agfds",
            "score": 0,
            "text": "So that was a level playing field",
            "title_similarity": "-0.07188345",
            "sentiment_compound": 0.2023
        },
        {
            "id": "i5ahkyd",
            "score": 0,
            "text": "I mean, if everyone else was doing it….shouldn’t he just keep the wins?",
            "title_similarity": "0.27000952",
            "sentiment_compound": 0.5719
        },
        {
            "id": "i5aihji",
            "score": 0,
            "text": "now they piss clean but have little engines in their bikes.. its crazy how much cheating goes on in that sport.",
            "title_similarity": "0.58198357",
            "sentiment_compound": -0.8402
        },
        {
            "id": "i5aijxx",
            "score": 0,
            "text": "The irony that Armstrong was just the best. If he didn’t dope, he would have been a nobody.",
            "title_similarity": "0.50664616",
            "sentiment_compound": 0.6124
        },
        {
            "id": "i5aim2d",
            "score": 0,
            "text": "He just did it the best!  \n\nHow about a doping metal.",
            "title_similarity": "0.30189067",
            "sentiment_compound": 0.6696
        },
        {
            "id": "i5aj44u",
            "score": 0,
            "text": "Our roided  up guy beat your roided  up guy",
            "title_similarity": "0.3794711",
            "sentiment_compound": 0.0
        },
        {
            "id": "i5ajdvi",
            "score": 0,
            "text": "“Our best doped up guy beat your best doped up guy” -Bill Burr",
            "title_similarity": "0.5008583",
            "sentiment_compound": 0.8555
        },
        {
            "id": "i5ajk1t",
            "score": 0,
            "text": "“Our roided up guy beat your roided up guy”",
            "title_similarity": "0.36471826",
            "sentiment_compound": 0.0
        },
        {
            "id": "i5ajmix",
            "score": 0,
            "text": "They ain’t giving those cancer donation checks back, I know that",
            "title_similarity": "0.42180547",
            "sentiment_compound": -0.4588
        },
        {
            "id": "i5akk6a",
            "score": 0,
            "text": "\"so our roided up guy beat your roided up guy!\"",
            "title_similarity": "0.3844854",
            "sentiment_compound": 0.0
        },
        {
            "id": "i5aktg2",
            "score": 0,
            "text": "All non-contact sports should allow PEs",
            "title_similarity": "0.10961917",
            "sentiment_compound": 0.2263
        },
        {
            "id": "i5alhok",
            "score": 0,
            "text": "You just learned this today? What are you, twelve?",
            "title_similarity": "0.21683365",
            "sentiment_compound": 0.0
        },
        {
            "id": "i5alxg6",
            "score": 0,
            "text": "It's like Bill Burr said. \n\nOur roided out guy beat your roided out guy",
            "title_similarity": "0.46881038",
            "sentiment_compound": 0.3612
        },
        {
            "id": "i5am0rq",
            "score": 0,
            "text": "As Bill Burr said, “Our roided up guy beat your roided up guy.”",
            "title_similarity": "0.41243038",
            "sentiment_compound": 0.0
        },
        {
            "id": "i5amle0",
            "score": 0,
            "text": "As Bill Burr said \"who cares? Our roided up guy beat all their roided up guys. Do you think it's normal for a guy to be able to peddle up a hill at 60 miles an hour?\"",
            "title_similarity": "0.60526955",
            "sentiment_compound": 0.5204
        },
        {
            "id": "i5ampns",
            "score": 0,
            "text": "This makes me respect Lance Armstrong MORE honestly. If everyone was doping then he really was the real winner.",
            "title_similarity": "0.52888703",
            "sentiment_compound": 0.8985
        },
        {
            "id": "i5an0f3",
            "score": 0,
            "text": "\"Our roided up guy beat your roided up guy.\" Bill Burr",
            "title_similarity": "0.44198436",
            "sentiment_compound": 0.0
        },
        {
            "id": "i5anajk",
            "score": 0,
            "text": "I mean... if everyone was doping doesn't that mean Armstrong was still the winner? \n\nThe playing field was level, after all.",
            "title_similarity": "0.50256366",
            "sentiment_compound": 0.6808
        },
        {
            "id": "i5ansxp",
            "score": 0,
            "text": "If everyone cheated, and he was the best cheater, he's still the winner in my eyes",
            "title_similarity": "0.5169111",
            "sentiment_compound": 0.296
        },
        {
            "id": "i5ao488",
            "score": 0,
            "text": "He won them.",
            "title_similarity": "0.0342579",
            "sentiment_compound": 0.5719
        },
        {
            "id": "i5aoied",
            "score": 0,
            "text": "I love when Bill Burr said something like:\n\nI say just give it to him, our roided up dude beat all the other roided up dudes. Fair is fair",
            "title_similarity": "0.44580385",
            "sentiment_compound": 0.8834
        },
        {
            "id": "i5aojls",
            "score": 0,
            "text": "This is why Bill Burr's bit about this is so great. \"Our roided up guy, beat your roided up guy.\"\n\nNever gets old haha\nhttps://youtu.be/O9YL04v-J5U",
            "title_similarity": "0.4649731",
            "sentiment_compound": 0.5805
        },
        {
            "id": "i5aom1m",
            "score": 0,
            "text": "\"so our roided up guy beat your roided up guy\"\n\n-Bill Burr",
            "title_similarity": "0.43925926",
            "sentiment_compound": 0.0
        },
        {
            "id": "i5aopyu",
            "score": 0,
            "text": "lance did what it took to win and for that i respect him. you play to win the game",
            "title_similarity": "0.2855566",
            "sentiment_compound": 0.9201
        },
        {
            "id": "i5apmit",
            "score": 0,
            "text": "I mean if everyone’s cheating and he won 7 times in a row isn’t it safe to say the same exact thing would happen if nobody was cheating?",
            "title_similarity": "0.6195874",
            "sentiment_compound": -0.1531
        },
        {
            "id": "i5apnsz",
            "score": 0,
            "text": "crazy how only the winner's name is infamous when they all doped",
            "title_similarity": "0.5978123",
            "sentiment_compound": -0.34
        },
        {
            "id": "i5apoil",
            "score": 0,
            "text": "Our drugged up guy beat your drugged up guys.\n-Bill Burr",
            "title_similarity": "0.48941845",
            "sentiment_compound": 0.0
        },
        {
            "id": "i5apwec",
            "score": 0,
            "text": "[\"Our roided up guy beat your roided up guy\" - Bill Burr](https://youtu.be/O9YL04v-J5U)",
            "title_similarity": "0.4419968",
            "sentiment_compound": 0.0
        },
        {
            "id": "i5aq0th",
            "score": 0,
            "text": "#losers!",
            "title_similarity": "0.1820198",
            "sentiment_compound": -0.5707
        },
        {
            "id": "i5aq6tq",
            "score": 0,
            "text": "As Bill Burr said \"our roided up guy beats your roided up guy\"\nEdit: so many Bill Burr quotes, I'm not disappointed",
            "title_similarity": "0.43767208",
            "sentiment_compound": 0.3724
        },
        {
            "id": "i5aqazn",
            "score": 0,
            "text": "Our roided up guy beat their roided up guy - Bill Burr.",
            "title_similarity": "0.47231823",
            "sentiment_compound": 0.0
        },
        {
            "id": "i5aqztu",
            "score": 0,
            "text": "Let them dope. Watching people ride bikes is boring enough",
            "title_similarity": "0.38997155",
            "sentiment_compound": -0.3182
        },
        {
            "id": "i5ar97w",
            "score": 0,
            "text": "And that's why he should have been able to keep his wins.",
            "title_similarity": "0.17773959",
            "sentiment_compound": 0.5719
        },
        {
            "id": "i5as908",
            "score": 0,
            "text": "Soooo our steroid cyclist beat your steroid cyclist",
            "title_similarity": "0.49503452",
            "sentiment_compound": 0.0
        },
        {
            "id": "i5asde8",
            "score": 0,
            "text": "If everyone cheat then it’ll be fair again",
            "title_similarity": "0.24291748",
            "sentiment_compound": -0.1779
        },
        {
            "id": "i5asp8l",
            "score": 0,
            "text": "“Our roided up guy beat your roided up guy” - Bill Burr",
            "title_similarity": "0.44764748",
            "sentiment_compound": 0.0
        },
        {
            "id": "i5aszom",
            "score": 0,
            "text": "*Our doped up guy beat your doped up guy*",
            "title_similarity": "0.4085201",
            "sentiment_compound": 0.0
        },
        {
            "id": "i5axf8y",
            "score": 0,
            "text": "This just tells me he really was the best.",
            "title_similarity": "0.107536264",
            "sentiment_compound": 0.6666
        },
        {
            "id": "i5az0ks",
            "score": 0,
            "text": "Then the wins should’ve defaulted to Armstrong. If the problem is a doping advantage and they all were doping, then there was no advantage.",
            "title_similarity": "0.67990166",
            "sentiment_compound": 0.3094
        },
        {
            "id": "i5b4oy6",
            "score": 0,
            "text": "Let's be honest: everyone is using it. There have been guys literally dropping dead from their bikes. Maybe it's time to critically look at the event. Maybe the event is just too much to ask of people, I don't even understand why it is as it is. People keep wanting to break records but there is only so much you can do as a human.",
            "title_similarity": "0.72282183",
            "sentiment_compound": -0.128
        },
        {
            "id": "i5b6125",
            "score": 0,
            "text": "Dope fo life! I want superhuman Olympics. Makes running with the able feel like running with Paralympics. Fokin racists",
            "title_similarity": "0.4489276",
            "sentiment_compound": -0.2481
        },
        {
            "id": "i5b7k1z",
            "score": 0,
            "text": "I still want my money back that I wasted on his two non-fiction autobiography books. It was totally fiction! But I'll give him this, he gave people hope especially people suffering from cancer when they really needed it. And his efforts with the cancer community seemed genuine. Too bad his ability to regain his elite cycling ability through hard work was only partly true. He scammed us good.",
            "title_similarity": "0.69570744",
            "sentiment_compound": -0.8885
        },
        {
            "id": "i5b7s01",
            "score": 0,
            "text": "Best one was one of the cyclists used as defence, that it was the cow he had eaten the day before the test, the one that had given him the steroids found in his system.",
            "title_similarity": "0.6192889",
            "sentiment_compound": 0.6808
        },
        {
            "id": "i5bek9h",
            "score": 0,
            "text": "“Our roided up guy beat your roided up guy”",
            "title_similarity": "0.36471826",
            "sentiment_compound": 0.0
        },
        {
            "id": "i5bewr5",
            "score": 0,
            "text": "tour de france should just admit doping is a fact of life and stop fighting it.",
            "title_similarity": "0.56037587",
            "sentiment_compound": -0.4404
        },
        {
            "id": "i5bkzm8",
            "score": 0,
            "text": "And people still believe elite sport nowadays is clean LMAO",
            "title_similarity": "0.21278211",
            "sentiment_compound": 0.8091
        },
        {
            "id": "i5bog95",
            "score": 0,
            "text": "Why can’t they just allow them to prepare for the race however they want? Why do we care?",
            "title_similarity": "0.35927415",
            "sentiment_compound": 0.6966
        },
        {
            "id": "i5bsi3e",
            "score": 0,
            "text": "Why not just let them dope. Who cares. Everyone does it, they all will continue to do it no matter what they try and do about it.",
            "title_similarity": "0.23406416",
            "sentiment_compound": 0.4453
        },
        {
            "id": "i5bzomq",
            "score": 0,
            "text": "Sorry… this is “news”?",
            "title_similarity": "0.15917477",
            "sentiment_compound": 0.0
        },
        {
            "id": "i5cdp3t",
            "score": 0,
            "text": "Here's the part that people who haven't competed at a high level don't seem to get, CHEATING IS A NORMAL PART OF SPORTS! It's an important part of it. You're supposed to cheat the rules as best you can and if you get caught you failed and you suffer the consequences. Every good athlete cheats in some way. The best don't get caught.",
            "title_similarity": "0.5867791",
            "sentiment_compound": -0.628
        },
        {
            "id": "i5cxoev",
            "score": 0,
            "text": "He won. He’s the best cyclist of all time, surely. \n\nHe may not be the nicest winner, but it’s sports. \n\nThe real crime is professional sports making people celebrities.",
            "title_similarity": "0.5744654",
            "sentiment_compound": 0.1867
        },
        {
            "id": "i5dynt1",
            "score": 0,
            "text": "I’ll say this till the cows come home. Armstrong was unfairly treated by the UCI because he’s American.",
            "title_similarity": "0.597982",
            "sentiment_compound": 0.0
        },
        {
            "id": "i59xqft",
            "score": 70,
            "text": "Bill burr said this lol and thought lance did nothing wrong cause essentially our roided up guy beat their roided up guys.",
            "title_similarity": "0.5071957",
            "sentiment_compound": 0.7007
        },
        {
            "id": "i5a3673",
            "score": 43,
            "text": "I guess that means he won them fair and square! It was a level playing field after all!",
            "title_similarity": "0.22026661",
            "sentiment_compound": 0.8118
        },
        {
            "id": "i59ws37",
            "score": -1,
            "text": "So cutting off your balls does work?",
            "title_similarity": "0.0742616",
            "sentiment_compound": -0.2006
        },
        {
            "id": "i5a2euw",
            "score": 1,
            "text": "He was the dopest doper of all the dope dopers",
            "title_similarity": "0.452298",
            "sentiment_compound": 0.0
        },
        {
            "id": "i5a2zmp",
            "score": -1,
            "text": "As Bill Burr said, \"our roided up guy beat your roided up guy.\"",
            "title_similarity": "0.41990995",
            "sentiment_compound": 0.0
        },
        {
            "id": "i5a32ol",
            "score": -1,
            "text": "[deleted]",
            "title_similarity": "0.10165896"
        },
        {
            "id": "i5a7nkf",
            "score": 1,
            "text": "Doping meaning what?",
            "title_similarity": "0.1950824",
            "sentiment_compound": 0.0
        },
        {
            "id": "i5a7xuk",
            "score": -1,
            "text": "So dumb. Doping should be legal",
            "title_similarity": "0.3325896",
            "sentiment_compound": -0.4754
        },
        {
            "id": "i5a84kl",
            "score": -1,
            "text": "So if they were all doping then what’s the problem?",
            "title_similarity": "0.39936888",
            "sentiment_compound": -0.4019
        },
        {
            "id": "i5a8xhn",
            "score": 1,
            "text": "Bill Burr: “it’s was our doped up guy vs your doped up guys and ours won.”",
            "title_similarity": "0.44932967",
            "sentiment_compound": 0.0
        },
        {
            "id": "i5a94q0",
            "score": 1,
            "text": "All he wanna do was have some fun before the sun came up over Santa Monica boulevard. 🎶",
            "title_similarity": "0.30300772",
            "sentiment_compound": 0.5106
        },
        {
            "id": "i5a9gl9",
            "score": 1,
            "text": "Isn't it fair if they're all doping?",
            "title_similarity": "0.29951933",
            "sentiment_compound": -0.2411
        },
        {
            "id": "i5a9jp9",
            "score": 1,
            "text": "So it was a fair race...",
            "title_similarity": "0.06769679",
            "sentiment_compound": 0.3182
        },
        {
            "id": "i5aa9ub",
            "score": 1,
            "text": "He is a national embarrassment and a bully.",
            "title_similarity": "0.38589936",
            "sentiment_compound": -0.7269
        },
        {
            "id": "i5actdh",
            "score": 1,
            "text": "Everyone was doping = everyone was on an even playing field.  It's not hard to figure out.",
            "title_similarity": "0.29835248",
            "sentiment_compound": 0.2723
        },
        {
            "id": "i5adn74",
            "score": 1,
            "text": "To hell with gendered sports, if so many are going to dope to win just make a doping league and a non-doping league. It makes sports so much less interesting knowing that some worked hard, and some had a lot of help. That there is no pure result just “pure for now”. It’ll be better regulated than under the table as it is now.",
            "title_similarity": "0.57390153",
            "sentiment_compound": 0.5955
        },
        {
            "id": "i5af32r",
            "score": -1,
            "text": "Our doped up guy beat their doped up guy",
            "title_similarity": "0.3684706",
            "sentiment_compound": 0.0
        },
        {
            "id": "i5agzsb",
            "score": 1,
            "text": "So... you name the first person that wasn't doping as winner. How fucking hard is this.",
            "title_similarity": "0.57412785",
            "sentiment_compound": -0.581
        },
        {
            "id": "i5ahphj",
            "score": -1,
            "text": "“It was as common as the air in our tires.” \n\n—Lance\n\nFar as I’m concerned…he just cheated the best.",
            "title_similarity": "0.48695523",
            "sentiment_compound": 0.2263
        },
        {
            "id": "i5ahyvq",
            "score": 1,
            "text": "He was the best doper in a sport of dopers. But he also raised hundreds of millions of dollars for cancer research.",
            "title_similarity": "0.5938764",
            "sentiment_compound": -0.6705
        },
        {
            "id": "i5aibvl",
            "score": 1,
            "text": "Why isn't he in jail?",
            "title_similarity": "0.2181479",
            "sentiment_compound": 0.0
        },
        {
            "id": "i5aim2j",
            "score": -1,
            "text": "If they were all on dope and he still came out on top, shouldn’t he win anyway?",
            "title_similarity": "0.3975754",
            "sentiment_compound": 0.6808
        },
        {
            "id": "i5aixee",
            "score": -1,
            "text": "I mean shit, if everyone was doping then Lance is the legitimate winner.",
            "title_similarity": "0.49408022",
            "sentiment_compound": 0.0516
        },
        {
            "id": "i5aj0i6",
            "score": -1,
            "text": "Everybody in cycling knew that. People just wanted a scapegoat. I think of Lance Armstrong more for the cancer fundraising nowadays anyway.\n\nStill wear my LiveStrong yellow bracelet to this day.",
            "title_similarity": "0.5760977",
            "sentiment_compound": -0.8107
        },
        {
            "id": "i5aj0qf",
            "score": -1,
            "text": "And he still beat them.",
            "title_similarity": "0.121224195",
            "sentiment_compound": 0.0
        },
        {
            "id": "i5akeve",
            "score": -1,
            "text": "So everyone was on an even playing field?",
            "title_similarity": "0.03251059",
            "sentiment_compound": 0.2023
        },
        {
            "id": "i5al6pi",
            "score": -1,
            "text": "So… He won fair and square",
            "title_similarity": "0.11760943",
            "sentiment_compound": 0.7184
        },
        {
            "id": "i5al6so",
            "score": -1,
            "text": "Therefore lance was the champ.  Pound is an ass.",
            "title_similarity": "0.299801",
            "sentiment_compound": -0.1027
        },
        {
            "id": "i5aluk5",
            "score": -1,
            "text": "So the question is… is it really cheating if everyone else is doing the same shit?",
            "title_similarity": "0.28518963",
            "sentiment_compound": -0.8173
        },
        {
            "id": "i5alvga",
            "score": 1,
            "text": "The scariest part about this whole thing is how coercive and intimidating Armstrong was. He got away with it for a long time because they were basically too scared to speak out. \n\nIt's a strange situation though because Armstrong does deserve accolades for his sporting performance in some sense. If you take drugs out of the equation, he would probably have dominated anyway. But you also can't reward cheating even when it's utterly endemic.",
            "title_similarity": "0.67395365",
            "sentiment_compound": -0.5285
        },
        {
            "id": "i5alzpq",
            "score": -1,
            "text": "So it sounds like he still won",
            "title_similarity": "0.026132919",
            "sentiment_compound": 0.7553
        },
        {
            "id": "i5ano71",
            "score": 1,
            "text": "Related, but at least this one has a good guy:\n\nOf the 30 fastest 100m times ever recorded, 21 of them were run by people caught using performance enhancing drugs. The other 9 are Usain Bolt.",
            "title_similarity": "0.646332",
            "sentiment_compound": 0.5927
        },
        {
            "id": "i5anxeb",
            "score": -1,
            "text": "Yes, so Lance won. Like we all know it. Dude crushed jt, and he crushed the tattle tails who tried to rat him out! Dude just crushes!",
            "title_similarity": "0.5632261",
            "sentiment_compound": 0.3666
        },
        {
            "id": "i5aoqae",
            "score": -1,
            "text": "So Lance was the actual winner. He was cancelled for raising money for cancer? I don't understand my friend. Double standard society yes?",
            "title_similarity": "0.70911014",
            "sentiment_compound": -0.4382
        },
        {
            "id": "i5aovg8",
            "score": 1,
            "text": "Sounds like the whole sport is broken.",
            "title_similarity": "0.3829983",
            "sentiment_compound": -0.1531
        },
        {
            "id": "i5ap1sv",
            "score": 1,
            "text": "All elite athletes across all sports (except maybe ping pong and such) are all doping. \n\nIf anti doping agency were serious about stop it they’d be carbon isotope ratio testing everyone, but they don’t because everyone would be busted, no chance of getting past it.\n\nCarbon isotope ratio tests test exactly what kind of testosterone is in your system. Standard testing only tests for your level of testosterone, meaning you can ween yourself off of it to make it look like you haven’t been doping while still retaining the benefits of training while doping.\n\nThere is also various corruption on all sports where they let favoured athletes know when testing is going to be happening etc.",
            "title_similarity": "0.6619234",
            "sentiment_compound": 0.7808
        },
        {
            "id": "i5aqljb",
            "score": 1,
            "text": "I’ve always made the case that Lance won on an even playing field.",
            "title_similarity": "0.21797031",
            "sentiment_compound": 0.6705
        },
        {
            "id": "i5aqlqa",
            "score": 1,
            "text": "Wwwaaaaiiiitttttttt just a goddamn mother fuxking minute.... Are you implyong professional sports have peoplethat use PEDs in them‽‽‽‽‽‽‽",
            "title_similarity": "0.40711766",
            "sentiment_compound": -0.4767
        },
        {
            "id": "i5ase5f",
            "score": 1,
            "text": "Well he made cycling extremely relevant so I’m not hating.",
            "title_similarity": "0.17924112",
            "sentiment_compound": 0.6207
        },
        {
            "id": "i5asw3i",
            "score": 1,
            "text": "Futurama made a joke like this once, but I'm being serious: maybe we should just make doping mandatory for competitive sports.",
            "title_similarity": "0.49975643",
            "sentiment_compound": 0.5267
        },
        {
            "id": "i5atkkh",
            "score": 1,
            "text": "Say what you want about Armstrong. But he made a lot of people a lot of money and brought the Tour De France to the mainstream.   \n  \nI didn’t watch it before Armstrong raced and didn’t watch it after he quit/caught cheating.",
            "title_similarity": "0.7232868",
            "sentiment_compound": -0.6956
        },
        {
            "id": "i5ault8",
            "score": 1,
            "text": "I’ve spoken to a now retired pro rider. They get trainers that offer to make them the best, for a price. The person I spoke to refused and never was able to be competitive with leaders. Doping/cheating is the only way to even get close to winning in pro tours. 100% guaranteed winners are doing some form of what we call cheating. The sport will not change until participants start dying.",
            "title_similarity": "0.71908224",
            "sentiment_compound": 0.765
        },
        {
            "id": "i5axn0e",
            "score": 1,
            "text": "I wish there was a version of Olympics that has legal dopping. To see the peak of human and science capabilities. There could be limitations about health safety, which wouldn't have to be compromised by having to hide dopping.",
            "title_similarity": "0.43612638",
            "sentiment_compound": 0.6486
        },
        {
            "id": "i5ay7oj",
            "score": -1,
            "text": "Cyclists are the scum of the earth",
            "title_similarity": "0.36659908",
            "sentiment_compound": 0.0
        },
        {
            "id": "i5azw67",
            "score": 1,
            "text": "The problem with Lance wasn’t the doping. It was he went to great lengths to protect himself from the idea that he was even doping.  In doing so ruining careers, families, and robbing the public in the process.   I believe in redemption for everyone but to this day had he not gotten caught he would still be denying it.  I believe he’s even said as much on his podcast.",
            "title_similarity": "0.6728711",
            "sentiment_compound": -0.3417
        },
        {
            "id": "i5b06nr",
            "score": 1,
            "text": "If they’re all cheating then no one’s cheating",
            "title_similarity": "0.25096014",
            "sentiment_compound": -0.4359
        },
        {
            "id": "i5b3igq",
            "score": -1,
            "text": "Cheaters never win. He wasted 7 yrs. of his life. I think the fact that he went after and ruined the lives of the people who spoke up against the doping makes what he did even worse.",
            "title_similarity": "0.80016416",
            "sentiment_compound": -0.8606
        },
        {
            "id": "i5b3nti",
            "score": 1,
            "text": "This is a public service announcement to everyone in this thread: every single person in every single professional sport is on some form of PED. I'm sorry if this shatters your view of professional athletes, but it's the truth. It's impossible for the human body to recover or perform at these levels without anabolics. Baseball, football, American football, tennis, cycling, track, swimming, hell, even esports. But, guess what? There's absolutely nothing wrong with that. You would honestly be shocked how many people are taking PEDs *at your local gym and on your local teams*. It's so pervasive, you don't even notice it.",
            "title_similarity": "0.594156",
            "sentiment_compound": 0.0512
        },
        {
            "id": "i5b3o8x",
            "score": 1,
            "text": "It was a witch hunt. Current cyclists ride up those mountain stages significantly faster than peak Armstrong. They’re all doped up.",
            "title_similarity": "0.646207",
            "sentiment_compound": -0.3612
        },
        {
            "id": "i5b433k",
            "score": 1,
            "text": "This story is the biggest shame in sport history, for our generation Lance will be the king of Tour de France. They can remove his name backward in the history but it wont justify anything.",
            "title_similarity": "0.7188797",
            "sentiment_compound": -0.2617
        },
        {
            "id": "i5b629z",
            "score": 1,
            "text": "I remember when this story first broke, a coworker of mine said, “You know what? Give him back those wins, because if he won, but everybody in the race was cheating, then…he won.”",
            "title_similarity": "0.6831965",
            "sentiment_compound": -0.4767
        },
        {
            "id": "i5bewag",
            "score": -1,
            "text": "So stupid, if they were all cheating then it was a fair competition and they should just asterisk those years as doping years and move on.",
            "title_similarity": "0.56648177",
            "sentiment_compound": -0.7178
        },
        {
            "id": "i5beyoc",
            "score": 0,
            "text": "Clearly he has hired a publicist to rehab his image. They even bought reddit accounts to up vote.\nI wonder what his next endeavor will be... I'm assuming something fitness related.",
            "title_similarity": "0.41712302",
            "sentiment_compound": 0.5859
        },
        {
            "id": "i5bg5nr",
            "score": 1,
            "text": "Shouldn't they have just left him his prizes then?",
            "title_similarity": "0.265398",
            "sentiment_compound": 0.4588
        },
        {
            "id": "i5bgc9n",
            "score": 1,
            "text": "If that's the case they should've just let Lance keep his wins.",
            "title_similarity": "0.22925918",
            "sentiment_compound": 0.5719
        },
        {
            "id": "i5bij87",
            "score": 1,
            "text": "Yeah I know that it's why lance Armstrong was and is the Tour Champion in my eyes.",
            "title_similarity": "0.3924729",
            "sentiment_compound": 0.7269
        },
        {
            "id": "i5bjehv",
            "score": 1,
            "text": "That is a big reason why I believe it was very wrong to strip Armstrong of his titles. \n\nHe still proved himself to be the best on the day (well, over ***three weeks!*** Not just one day), against the competition which were mostly in the same boat (bike?) as him and doing more or less the same shenanigans as himself. \n\nHe deserves those wins.",
            "title_similarity": "0.63894093",
            "sentiment_compound": 0.7845
        },
        {
            "id": "i5bmc7f",
            "score": 1,
            "text": "If everybody is doped no-one is.\n\nGive this man his trophies back.",
            "title_similarity": "0.4300055",
            "sentiment_compound": 0.0
        },
        {
            "id": "i5bp610",
            "score": 1,
            "text": "This just shows using EPO just leveled the playing field, it might have been doping but it wasn't cheating. Lance gave me 7 years of the most exciting years of bicycle racing ever. I'll always be grateful for the joy he gave me. I'll never forget those races. As far as I'm concerned, he's the best cyclist ever.  Eddy Merckx, Miguel Indurain, Pantani and everyone else doped. Everyone used whatever was available in their day.",
            "title_similarity": "0.7058015",
            "sentiment_compound": 0.9818
        },
        {
            "id": "i5d6415",
            "score": 1,
            "text": "Makes no sense to strip him of the wins. If everyone below him was using peds as well, he still was the best racer and won legitimately.",
            "title_similarity": "0.527372",
            "sentiment_compound": 0.91
        },
        {
            "id": "i5d91kt",
            "score": 1,
            "text": "At that point, if everyone was doping and he still won they should have just let him keep those wins since technically he was at a level playing field with the rest of the competitors.",
            "title_similarity": "0.5079261",
            "sentiment_compound": 0.8481
        },
        {
            "id": "i5da660",
            "score": 1,
            "text": "In other words, Lance the cheater was just trying to compete with the other roidheads and was just better.  SMH.",
            "title_similarity": "0.3992466",
            "sentiment_compound": -0.5622
        },
        {
            "id": "i5a4kug",
            "score": 7,
            "text": "If doping is more accepted I bet it would fast track humanity's performance enhancing industries and even bio/cybernetic mods could become a big focus",
            "title_similarity": "0.36024457",
            "sentiment_compound": 0.3384
        },
        {
            "id": "i5a11ib",
            "score": -2,
            "text": "Sounds like he just had the best drugs. The other fellas should have upped their chemistry game.",
            "title_similarity": "0.502929",
            "sentiment_compound": 0.7717
        },
        {
            "id": "i5a39sa",
            "score": -2,
            "text": "I don't understand doping. It's a bike ride. A long, fast bikeride. It's not like you win much money and doesn't most of it go to charity anyways.",
            "title_similarity": "0.5592046",
            "sentiment_compound": -0.3361
        },
        {
            "id": "i5a9x8p",
            "score": 2,
            "text": "In my head, Lance still won those Tours since every one of his nearest competitors were all doping as well.  It was just a function of that era of cycling.",
            "title_similarity": "0.6840258",
            "sentiment_compound": 0.7003
        },
        {
            "id": "i5aa2wm",
            "score": 2,
            "text": "I don't give a shit if he cheated against a bunch of weirdos in skin tight suits. He raised millions for cancer research.",
            "title_similarity": "0.610211",
            "sentiment_compound": -0.783
        },
        {
            "id": "i5aerfp",
            "score": 2,
            "text": "Well then just give them back to Lance.  They were all cheating",
            "title_similarity": "0.4480313",
            "sentiment_compound": -0.3612
        },
        {
            "id": "i5ahqdv",
            "score": 2,
            "text": "Watched the tour religiously from 2003 to 2005.. and for what..",
            "title_similarity": "0.33067307",
            "sentiment_compound": 0.0
        },
        {
            "id": "i5akt24",
            "score": 2,
            "text": "~~Livestrong~~ Dopestrong",
            "title_similarity": "0.08871064",
            "sentiment_compound": 0.0
        },
        {
            "id": "i5ask31",
            "score": 2,
            "text": "They had to make an example out of him, and he deserved every minute of the punishment. Not only was he a total asshole, he used his wealth to buy better drugs than the other dopers, so it still was not a level playing field. He was hands-down the best doper, with the best doped team.",
            "title_similarity": "0.59694844",
            "sentiment_compound": 0.8935
        },
        {
            "id": "i5atxc6",
            "score": -2,
            "text": "You just found out about this? You 12 years old or something?",
            "title_similarity": "0.21322528",
            "sentiment_compound": 0.0
        },
        {
            "id": "i5avitb",
            "score": 2,
            "text": "“Our Roided out guy beat your roided out guys!” -Bill Burr\n  \nOne of my favorite bits from Bill Burr",
            "title_similarity": "0.4399874",
            "sentiment_compound": 0.5093
        },
        {
            "id": "i5avufh",
            "score": 2,
            "text": "So then who even cares? He was still the best. Give him back his titles",
            "title_similarity": "0.30413103",
            "sentiment_compound": 0.802
        },
        {
            "id": "i5b15pb",
            "score": 2,
            "text": "So he's the best of all the dopers which means he's still the best.",
            "title_similarity": "0.26066712",
            "sentiment_compound": 0.8646
        },
        {
            "id": "i5b1hwe",
            "score": 2,
            "text": "Alright, I’m sick of this rollercoaster of our favorite athletes getting busted for doping and losing their titles. What we really need is a doping Olympics. All drugs permitted, cybernetics, genetic engineering, graft some fins onto a human torso to swim faster, you name it. Unlock the full potential of science and human survivability!",
            "title_similarity": "0.64200765",
            "sentiment_compound": -0.2942
        },
        {
            "id": "i5b99p7",
            "score": 2,
            "text": "if everyone was cheating then was anyone really cheating?",
            "title_similarity": "0.34173194",
            "sentiment_compound": -0.8173
        },
        {
            "id": "i59vqv8",
            "score": 25,
            "text": "it's so fucked up. they screwed over the people who WEREN'T doping just cause they finished so far behind... yea cause they were the only ones playing fair. fucking ridiculous.",
            "title_similarity": "0.669767",
            "sentiment_compound": -0.8218
        },
        {
            "id": "i5a0iq9",
            "score": 4,
            "text": "“Since every rider has been officially disqualified from Tour de France, we have no choice but to declare Greg the Tour de France champion, the volunteer who decided to ride his bike to the event.”",
            "title_similarity": "0.74046004",
            "sentiment_compound": 0.5927
        },
        {
            "id": "i5a2aq7",
            "score": -3,
            "text": "My opinion, let everyone and Anyone use whatever enhancements they want.  \nLet there be no limits to human achievement and excellence.",
            "title_similarity": "0.045549642",
            "sentiment_compound": 0.4939
        },
        {
            "id": "i5a7rsz",
            "score": 4,
            "text": "[\"Are they going to give back their yachts?!\"](https://www.youtube.com/watch?v=O9YL04v-J5U)",
            "title_similarity": "0.27020526",
            "sentiment_compound": 0.0
        },
        {
            "id": "i5aj4a5",
            "score": 3,
            "text": "Absolute fucker, ruined my passion for cycling, has not the slightest remorse, can go straight to hell. Not that this will happen or that anyone cares about the opinion of an old road rider with no particular talent.",
            "title_similarity": "0.6179705",
            "sentiment_compound": -0.8324
        },
        {
            "id": "i5b10xz",
            "score": 3,
            "text": "Yeah many were saying it's dumb to punish just Armstrong when it's an open secret that doping was widespread amongst cyclists at that time",
            "title_similarity": "0.7182047",
            "sentiment_compound": -0.6705
        },
        {
            "id": "i5b6eje",
            "score": 3,
            "text": "Shower thought: So if they were all doping and he was the best, maybe he should have kept his titles after all.",
            "title_similarity": "0.52577114",
            "sentiment_compound": 0.6369
        },
        {
            "id": "i5bwafv",
            "score": 3,
            "text": "Lance Armstrong was one of the biggest pieces of shit in entertainment/sports. Chris Brown beat people to within an inch of their life, but this guy did worse if I'm being honest. He sued people who wrote the truth into oblivion.  \n\n\nStill, the wins should be restored. The WADA, Dick Pound, and the witch hunt for PEDs is worse than the actual cheating. Many other riders doped, and Lance Armstrong had the most willpower, and will to win. He is a cycling champion and a human piece of trash.",
            "title_similarity": "0.76710474",
            "sentiment_compound": 0.5994
        },
        {
            "id": "i59xq8v",
            "score": 56,
            "text": "Is Lance redeploying his social media hype squad?",
            "title_similarity": "0.27849844",
            "sentiment_compound": 0.0
        },
        {
            "id": "i5ald7w",
            "score": 13,
            "text": "Didn’t he sue the fuck out of people who threatened to snitch on him for doping?",
            "title_similarity": "0.5909957",
            "sentiment_compound": -0.7579
        },
        {
            "id": "i5a5rv7",
            "score": 109,
            "text": "I always found it weird that only Lance's years are the \"no winner\" years. Many of the winners subsequently eventually tested positive or came out after retirement/later in their career yet their jerseys still remain. Even green/polka dot jersey winners that tested positive later still remain as the winners.\n\nIf you want to erase the name/legacy of dopers and eliminate their victories retro actively why not do it for all of them instead of just Lance Armstrong?",
            "title_similarity": "0.7355901",
            "sentiment_compound": 0.969
        },
        {
            "id": "i5ag99a",
            "score": 4,
            "text": "Doping is one of the least worst thing Armstrong has done. He made sure that anyone who would go against him would never find work again.",
            "title_similarity": "0.67759573",
            "sentiment_compound": 0.6802
        },
        {
            "id": "i5alry4",
            "score": -4,
            "text": "I know I'm probably in the minority here, but I personally don't give a fuck what athletes are taking to \"enhance their performance.\" I suppose an exception could be made for MMA, boxing, and other combat sports, but these guys are riding bikes. It's fucking meaningless entertainment. Let them take all the steroids they want in the middle of a leg of a race. Who cares?",
            "title_similarity": "0.5952518",
            "sentiment_compound": 0.7143
        },
        {
            "id": "i5anzfz",
            "score": -5,
            "text": "lance armstrong is a hero",
            "title_similarity": "0.20351925",
            "sentiment_compound": 0.5574
        },
        {
            "id": "i5bpxvc",
            "score": 5,
            "text": "If EVERYONE Was doping surely that means it was a fair race?",
            "title_similarity": "0.40327024",
            "sentiment_compound": 0.6369
        },
        {
            "id": "i5ab7t1",
            "score": 72,
            "text": "The tour organizers were corrupt and duplicitous, just like the teams and riders.\n\nThey said they were \"building a case,\" \"had no evidence,\" and \"had overwhelming evidence,\" regarding Lance Armstrong interchangeably, and varyingly depending on when. By the time he retired, they had already milked his image and legacy dry for viewership and money, so they \"cracked down\" on him and others.\n\nIf they had done it when he was winning, and not retired, I would have given them credit for trying to clean up the sport. The fact that they knew he was guilty, and had proof for all that time, and waited to ban and strip him until after retirement, shows they had no interest in cleaning up the sport; they only cared about money.",
            "title_similarity": "0.74439",
            "sentiment_compound": 0.4442
        },
        {
            "id": "i59t1z2",
            "score": 614,
            "text": "*Our roided up guy beat your roided up guy!* - Bill Burr\n\nEdit: [CONTEXT](https://www.youtube.com/watch?v=O9YL04v-J5U)",
            "title_similarity": "0.46130326",
            "sentiment_compound": 0.0
        },
        {
            "id": "i5a4h0r",
            "score": 358,
            "text": "I get that but I can't forgive what a complete arse he was to anyone who accused him (rightly as we now know), such vitriol, trying to destroy their careers. A nasty man in my opinion",
            "title_similarity": "0.5623375",
            "sentiment_compound": -0.94
        },
        {
            "id": "i5asmcl",
            "score": 15,
            "text": "They can take away his medals, his records and his race times, but they'll never take away his greatest achievement: the inspirational speech to Peter LaFluer that made him return and beat Globo Gym in the Dodgeball Finals in Las Vegas",
            "title_similarity": "0.65421456",
            "sentiment_compound": 0.9052
        },
        {
            "id": "i5a2x6k",
            "score": 23,
            "text": "Lemond called it out. You can just look at when power numbers suddenly spiked to know when doping took over.",
            "title_similarity": "0.4351411",
            "sentiment_compound": 0.0
        },
        {
            "id": "i59vra7",
            "score": 1455,
            "text": "I worked in the bike industry during his run (at a trek dealer no less) and everyone assumed he was doping. It was like an unspoken running joke, because it was a huge fuckin boon to road bike sales and you didn’t dare disparage him. I said as much once and damn near got fired on the spot. To be fair, everyone at that level dopes (obvious now, back then it not quite as much I guess). He was still pretty amazing honestly. The one holdout I have is Lemond. I honestly don’t think he doped and if I found out he did I think it would break my heart.",
            "title_similarity": "0.72202694",
            "sentiment_compound": 0.9325
        },
        {
            "id": "i5a4sj8",
            "score": 598,
            "text": "Also Amstrong and his legal team came down HARD on anyone implying he was doping, often crippling their careers",
            "title_similarity": "0.69034815",
            "sentiment_compound": -0.1613
        },
        {
            "id": "i59stxt",
            "score": 2103,
            "text": "Everyone should watch Tour De Pharmacy.\n\nHilarious, and Lance is a great sport about all of it.",
            "title_similarity": "0.33845603",
            "sentiment_compound": 0.7783
        },
        {
            "id": "i59qd0i",
            "score": 11912,
            "text": "So if EVERYONE was doping, sounds like he still won, right?",
            "title_similarity": "0.38338214",
            "sentiment_compound": 0.7351
        },
        {
            "id": "i5a6tzq",
            "score": 266,
            "text": "Could have forgiven Lance for doping, but attacking people like Frankie Andreu to ruin his career because he told the truth showed Lance for what he was, a punk who is unworthy of anyone's sympathy. Sad to find out one of my sports heroes was such a bellend. Hasn't done anything since to change that.",
            "title_similarity": "0.73406315",
            "sentiment_compound": -0.5647
        },
        {
            "id": "i5a5a3q",
            "score": 2114,
            "text": "Would it be possible to have a designated survivor type of setup for this? \n\n\"Hey, Tim? Good news. You won the Tour.\"\n\n\"I didn't even compete?\"\n\n\"You're the designated straight man. You're literally the only person we could find who didn't dope.\"\n\n\"I wasn't even in France.\"\n\n\"Even better.\"",
            "title_similarity": "0.5977848",
            "sentiment_compound": 0.9252
        },
        {
            "id": "i5a42sx",
            "score": 2126,
            "text": "Relevant The Onion from back then: [Non-Doping Cyclists Finish Tour De France](https://www.theonion.com/non-doping-cyclists-finish-tour-de-france-1819569297)\n\n> Kvistik's overall time for the Tour was 571 hours, 22 minutes, and 33 seconds, beating by over an hour the previous record for a non-enhanced rider, set by Albrect Påart during 1923's infamous ether-and-morphine-shortened race. Kvistik finished a mere 480 hours behind Alberto Contador, the overall winner, making 2007's margin between doping and non-doping riders the closest in history.",
            "title_similarity": "0.73365414",
            "sentiment_compound": 0.2023
        },
        {
            "id": "i59oezc",
            "score": 11023,
            "text": "They couldn't find any \"clean\" riders to award the wins to. Six of the seven overall runners-up to Armstrong (all except Joseba Beloki in 2002) have either admitted to or been found guilty of doping.",
            "title_similarity": "0.8630761",
            "sentiment_compound": 0.5487
        },
        {
            "id": "i59ubqc",
            "score": 1,
            "text": "Sounds like the judges won",
            "title_similarity": "0.1101903",
            "sentiment_compound": 0.7351
        },
        {
            "id": "i59zhfp",
            "score": 1,
            "text": "meanwhile our NLF still has winning cheaters",
            "title_similarity": "0.27440244",
            "sentiment_compound": 0.128
        },
        {
            "id": "i5a1vo9",
            "score": 1,
            "text": "That's the worst of Armstrong's offenses.",
            "title_similarity": "0.40506226",
            "sentiment_compound": -0.765
        },
        {
            "id": "i5a4zlm",
            "score": 1,
            "text": "But Armstrong was the BEST doper!\n\n\n/s",
            "title_similarity": "0.24669401",
            "sentiment_compound": 0.8478
        },
        {
            "id": "i5a5jic",
            "score": 1,
            "text": "Jesus wept. What a disgrace.",
            "title_similarity": "0.29909515",
            "sentiment_compound": -0.7351
        },
        {
            "id": "i5a5knn",
            "score": 1,
            "text": "Wouldn’t the go to the guy who didn’t dope and finished?",
            "title_similarity": "0.22646144",
            "sentiment_compound": 0.0
        },
        {
            "id": "i5a5rj8",
            "score": 3,
            "text": "I say let them take all the performance enhancing drugs and have a superhuman cycling race",
            "title_similarity": "0.5416992",
            "sentiment_compound": 0.0
        },
        {
            "id": "i5a62jg",
            "score": 1,
            "text": "Watch the documentary Tour de Pharmacy on HBO.",
            "title_similarity": "0.27562797",
            "sentiment_compound": 0.0
        },
        {
            "id": "i5a6pyo",
            "score": 1,
            "text": "I say make it mandatory to take steroids and dope and all of that shit in professional  sports.  How exciting would it be to watch a bunch of steroid freaks battling it out.  Way more entertaining in my opinion.",
            "title_similarity": "0.47810692",
            "sentiment_compound": 0.1513
        },
        {
            "id": "i5a6rz9",
            "score": 1,
            "text": "But it is funny so who cares",
            "title_similarity": "0.046055377",
            "sentiment_compound": 0.8507
        },
        {
            "id": "i5a6wck",
            "score": 1,
            "text": "I've said it before & I'll say it again, we need dope sports.",
            "title_similarity": "0.2128075",
            "sentiment_compound": 0.0
        },
        {
            "id": "i5a6xkh",
            "score": 1,
            "text": "Another fun fact is all the companies that sponsored him and gave him bikes took the bikes back from lance",
            "title_similarity": "0.62432444",
            "sentiment_compound": 0.5106
        },
        {
            "id": "i5a6z72",
            "score": 1,
            "text": "Like Bill Burr said, like, the top twenty competitors all tested positive, so our roided up guy, beat your roided up guy",
            "title_similarity": "0.57307136",
            "sentiment_compound": 0.8555
        },
        {
            "id": "i5a6zbg",
            "score": 5,
            "text": "where's the \"dope all you want\" olympics\n\nI want to see the real limits",
            "title_similarity": "0.30963415",
            "sentiment_compound": 0.1531
        },
        {
            "id": "i5a70sg",
            "score": 1,
            "text": "For any of you who were too young or not alive during his peak it was wild. Every race would seemingly have half the riders disqualified during it and have a bunch after except for the winner (Armstrong) who was also dominating the field that was testing positive.\n\nAnd yet the majority of American fans could not fathom that he was cheating.",
            "title_similarity": "0.7854639",
            "sentiment_compound": -0.3365
        },
        {
            "id": "i5a72oa",
            "score": 1,
            "text": "what a fall from grace.   having a foundation based on health related stuff to getting called out for doping (not sure what he was using) for your wins.",
            "title_similarity": "0.6311401",
            "sentiment_compound": 0.6745
        },
        {
            "id": "i5a7gh4",
            "score": 1,
            "text": "The villain from 'The Incredibles' had it right. Just make everyone super, so that no one is super.",
            "title_similarity": "0.47649485",
            "sentiment_compound": 0.4062
        },
        {
            "id": "i5a7hhg",
            "score": 1,
            "text": "Still better than what the MLB did with the Cheatin' Astros, who will forever be referred to as The Cheatin' Astros.",
            "title_similarity": "0.43271428",
            "sentiment_compound": 0.4404
        },
        {
            "id": "i5a7hrv",
            "score": 1,
            "text": "Yeah, but he walked on the moon for goodness sakes.",
            "title_similarity": "0.28831893",
            "sentiment_compound": 0.6808
        },
        {
            "id": "i5a7i8x",
            "score": 1,
            "text": "[Judges reaction, probably](https://www.youtube.com/watch?v=FDyxa0k0jg0)",
            "title_similarity": "0.13291669",
            "sentiment_compound": 0.0
        },
        {
            "id": "i5a7tje",
            "score": 1,
            "text": "So you're telling me in cycling it's not the super expensive carbon bike, shoes, bib that cost a fortune?",
            "title_similarity": "0.4172092",
            "sentiment_compound": -0.4847
        },
        {
            "id": "i5a7uov",
            "score": 1,
            "text": "Everyone does it",
            "title_similarity": "-0.07125114",
            "sentiment_compound": 0.0
        },
        {
            "id": "i5a81vs",
            "score": 1,
            "text": "So did the lack of integrity of the competitors destroy the integrity of the sport?",
            "title_similarity": "0.47138292",
            "sentiment_compound": -0.2177
        },
        {
            "id": "i5a89aq",
            "score": 5,
            "text": "There's a documentary of Greg Lemond (edit per comment below), the only other American to win the Tour de France. He was out for a couple years, then went back in. \n\nWhen he found himself finishing in the bottom quarter, he knew something was up. He told all of us, but we didn't listen.",
            "title_similarity": "0.79259884",
            "sentiment_compound": 0.34
        },
        {
            "id": "i5a89hv",
            "score": 2,
            "text": "All of a sudden that Dodgeball scene hits so differently.",
            "title_similarity": "0.32920298",
            "sentiment_compound": 0.0
        },
        {
            "id": "i5a89nx",
            "score": 2,
            "text": "I know this isn’t the right way but if there were that many top athletes also guilty of doing the same thing, just let him keep his wins. His doped out body beat their doped body.",
            "title_similarity": "0.5603659",
            "sentiment_compound": 0.5499
        },
        {
            "id": "i5a89p7",
            "score": 1,
            "text": "Embrasssing. Its like if u finish legally u can't win and if u finish illegally u can't win either. Idiotic.",
            "title_similarity": "0.39922088",
            "sentiment_compound": -0.0823
        },
        {
            "id": "i5a8a9g",
            "score": 2,
            "text": "Sounds like he was still at the top of his class then",
            "title_similarity": "0.2123231",
            "sentiment_compound": 0.5106
        },
        {
            "id": "i5a8fau",
            "score": 1,
            "text": "They should turn in their yachts.",
            "title_similarity": "0.086719036",
            "sentiment_compound": 0.0
        },
        {
            "id": "i5a8fev",
            "score": 1,
            "text": "No shit.",
            "title_similarity": "-0.01463666",
            "sentiment_compound": 0.4449
        },
        {
            "id": "i5a8fu7",
            "score": 1,
            "text": "SEVEN!",
            "title_similarity": "0.04597973",
            "sentiment_compound": 0.0
        },
        {
            "id": "i5a8g5i",
            "score": 2,
            "text": "It’s like 2000s MLB",
            "title_similarity": "0.17117475",
            "sentiment_compound": 0.3612
        },
        {
            "id": "i5a8z1s",
            "score": 1,
            "text": "I used to race, when I was still a junior I got the talk from one of the older riders. The only way to stay competitive was to start using PEDs and if I didn't I'd be left behind everyone else. At that time I was 14 years old and it crushed my desires to take cycling serious. The older kid who gave me the talk went on to have an extremely successful career on the pro circuit.",
            "title_similarity": "0.6908902",
            "sentiment_compound": 0.4005
        },
        {
            "id": "i5a909e",
            "score": 1,
            "text": "it’s like that comedian stand up bit where he talks about having a separate olympics for people who are doping, let’s see what the human body can REALLY do! i think it was bill burr",
            "title_similarity": "0.57072806",
            "sentiment_compound": 0.6588
        },
        {
            "id": "i5a96wz",
            "score": 1,
            "text": "Toke de France?",
            "title_similarity": "0.05274214",
            "sentiment_compound": 0.0
        },
        {
            "id": "i5a9800",
            "score": 1,
            "text": "good They couldn't find any \"clean\" riders to award the wins to",
            "title_similarity": "0.52256733",
            "sentiment_compound": 0.8335
        },
        {
            "id": "i5a99ay",
            "score": 1,
            "text": "No problem here.......🤣",
            "title_similarity": "-0.12915157",
            "sentiment_compound": 0.666
        },
        {
            "id": "i5a9bq2",
            "score": 1,
            "text": "I heard it would b the guy who finished 23rd actually was dope free.",
            "title_similarity": "0.41684616",
            "sentiment_compound": 0.5106
        },
        {
            "id": "i5a9jtr",
            "score": 3,
            "text": "I have a question: were people truly shocked when the news broke that Lance Armstrong had been doping the whole time. Or was it something that people always suspected. I always thought that Lance Armstrong was a incredible athlete and was shocked.",
            "title_similarity": "0.7173145",
            "sentiment_compound": -0.6597
        },
        {
            "id": "i5a9jvx",
            "score": 1,
            "text": "Everyone should watch the documentary Icarus; it’s on Netflix, I believe. Touches on this subject and expands on it in surprising ways. One of the best docs of all time.",
            "title_similarity": "0.35854518",
            "sentiment_compound": 0.7717
        },
        {
            "id": "i5a9kmt",
            "score": 2,
            "text": "Just give them to the car park attendant",
            "title_similarity": "0.05116854",
            "sentiment_compound": 0.0
        },
        {
            "id": "i5a9l9c",
            "score": 1,
            "text": "Good.",
            "title_similarity": "-0.22668527",
            "sentiment_compound": 0.4404
        },
        {
            "id": "i5a9paw",
            "score": 1,
            "text": "*”When everyone is super… no one will be.”*",
            "title_similarity": "0.32108164",
            "sentiment_compound": -0.296
        },
        {
            "id": "i5a9v34",
            "score": 1,
            "text": "Where have you been?????",
            "title_similarity": "-0.05678419",
            "sentiment_compound": 0.0
        },
        {
            "id": "i5aa4fk",
            "score": 1,
            "text": "Finding an athlete who doesn't have a helper is hard to do.",
            "title_similarity": "0.22708169",
            "sentiment_compound": -0.3476
        },
        {
            "id": "i5aa542",
            "score": 1,
            "text": "Lance Armstrong's doping thing is already a TIL? It just happened a few years ago. Has everyone been living under a rock?",
            "title_similarity": "0.6080118",
            "sentiment_compound": 0.0
        },
        {
            "id": "i5aabvi",
            "score": 1,
            "text": "If all of them are gonna dope, you might as well just allow it and have doctors supervise them during the process. Cycling isn’t necessarily a super healthy sport to begin with.",
            "title_similarity": "0.5869204",
            "sentiment_compound": 0.8625
        },
        {
            "id": "i5aad2c",
            "score": 1,
            "text": "So if everyone is doing it, does it give anyone an advantage?",
            "title_similarity": "0.012112392",
            "sentiment_compound": 0.25
        },
        {
            "id": "i5aae0n",
            "score": 1,
            "text": "Damn, first he faked the moon landing and then he got all his bike race wins pulled? \n\nTalk about failing.",
            "title_similarity": "0.7485608",
            "sentiment_compound": -0.3182
        },
        {
            "id": "i5aaevv",
            "score": 1,
            "text": "Pro sports needs to embace PED's. Your favorite athlete is likely on something.",
            "title_similarity": "0.22926708",
            "sentiment_compound": 0.4588
        },
        {
            "id": "i5aam8v",
            "score": 2,
            "text": "I forgot which year it was, but in one of his stripped titles, the next 11 in line all got busted for doping. \n\nOther than the pure strength sports, where they don't even bother testing, its almost entirely doped at the top.",
            "title_similarity": "0.8238238",
            "sentiment_compound": 0.8424
        },
        {
            "id": "i5aap35",
            "score": 1,
            "text": "Do this to any pro athlete/athletic team and you the same results will happen",
            "title_similarity": "0.2276308",
            "sentiment_compound": 0.0
        },
        {
            "id": "i5aatoj",
            "score": 1,
            "text": "And the cycling organizations let it happen because money. Which if course everyone involved kept despite doing things after the fact.",
            "title_similarity": "0.4107392",
            "sentiment_compound": 0.0
        },
        {
            "id": "i5abeo7",
            "score": 2,
            "text": "These elite sports has the dope friends and cheaters ever. Looking at you, Olympics, that's why I get sooooo mad when I hear parents say, I put my kids in sports to keep them away from drugs. Ha! Fastest Tracy to get into steroids and other enhancements.",
            "title_similarity": "0.62536967",
            "sentiment_compound": -0.5093
        },
        {
            "id": "i5abmeh",
            "score": 1,
            "text": "How sad.",
            "title_similarity": "0.11581258",
            "sentiment_compound": -0.4767
        },
        {
            "id": "i5absw6",
            "score": 1,
            "text": "Ironically it may have been the case Lance really was the best. Literally everyone was cheating and he cheated the best.",
            "title_similarity": "0.5385169",
            "sentiment_compound": 0.4144
        },
        {
            "id": "i5abyhp",
            "score": 1,
            "text": "I love how the documentaries, including Icarus, are more popular than the sport.",
            "title_similarity": "0.38866112",
            "sentiment_compound": 0.807
        },
        {
            "id": "i5ac5yb",
            "score": 1,
            "text": "[Like the great Bill Burr said “Our roided guy beat your roided guy](https://youtu.be/O9YL04v-J5U)",
            "title_similarity": "0.49108452",
            "sentiment_compound": 0.765
        },
        {
            "id": "i5ac6vi",
            "score": 1,
            "text": "I don't really get this whole \"doping\" thing. I want to see how fast a person can REALLY ride that bike.",
            "title_similarity": "0.3770936",
            "sentiment_compound": 0.0772
        },
        {
            "id": "i5acijk",
            "score": 1,
            "text": "Do you live under a rock?",
            "title_similarity": "0.032126445",
            "sentiment_compound": 0.0
        },
        {
            "id": "i5ackvr",
            "score": 1,
            "text": "What's really amazing is the 7 years without Tour de France prior to stripping Armstrong were 1940-1944 and 1915-1918... the world wars. There was a winner in 1914 because the race happens in spring and the war started in August",
            "title_similarity": "0.7408378",
            "sentiment_compound": 0.101
        },
        {
            "id": "i5acs8m",
            "score": 6,
            "text": "The only rider who ever looked clean to me was Cadel Evans. I mainly think this because he was the only at at the end of riding at 50kmph for 4 hours then climbing up Mt Olympus actually looked stuffed.",
            "title_similarity": "0.6836822",
            "sentiment_compound": 0.4019
        },
        {
            "id": "i5actrx",
            "score": 1,
            "text": "You know the name of the best clean cyclist from that era? \n\nNeither does anyone else, because he didn’t win jack.",
            "title_similarity": "0.6664798",
            "sentiment_compound": 0.8934
        },
        {
            "id": "i5acway",
            "score": 1,
            "text": "ELI5 is doping bad for you at all? You have like extra blood and it behaves differently than your heart is used to",
            "title_similarity": "0.5811006",
            "sentiment_compound": 0.4939
        },
        {
            "id": "i5aczn2",
            "score": 1,
            "text": "As much as you have to be a good cyclist it nearly comes down to who's a better doper",
            "title_similarity": "0.30104762",
            "sentiment_compound": 0.7003
        },
        {
            "id": "i5ad0q9",
            "score": 2,
            "text": "Those were exciting times before it all imploded, loved Cipollini!",
            "title_similarity": "0.3826936",
            "sentiment_compound": 0.8122
        },
        {
            "id": "i5ad5om",
            "score": 2,
            "text": "Lance knows. We know. All that matters.",
            "title_similarity": "-0.05012529",
            "sentiment_compound": 0.0258
        },
        {
            "id": "i5ad9wj",
            "score": 1,
            "text": "Legacies don't matter to many cyclists. Becoming super rich does.",
            "title_similarity": "0.42975014",
            "sentiment_compound": 0.8139
        },
        {
            "id": "i5adj0f",
            "score": 2,
            "text": "The ones that were clean just didn't get caught",
            "title_similarity": "0.25003886",
            "sentiment_compound": 0.4019
        },
        {
            "id": "i5adjam",
            "score": 1,
            "text": "Public interest in cycling really plummeted when it became clear how rampant doping was. Seems like no one gives the Tour de France a passing thought when it’s on.",
            "title_similarity": "0.7886529",
            "sentiment_compound": 0.7096
        },
        {
            "id": "i5adsl2",
            "score": 2,
            "text": "So basically \"Tour de Pharmacy\" was real",
            "title_similarity": "0.07479925",
            "sentiment_compound": 0.0
        },
        {
            "id": "i5aemmb",
            "score": 1,
            "text": "Not sure which timeline was better: livestrong bracelets or Kony2012",
            "title_similarity": "0.25344694",
            "sentiment_compound": 0.2354
        },
        {
            "id": "i5aexqh",
            "score": 3,
            "text": "Give em a break , I couldn't even find my bike when I was on drugs .",
            "title_similarity": "0.6124977",
            "sentiment_compound": 0.0
        },
        {
            "id": "i5afkip",
            "score": 2,
            "text": "Definition of a scapegoat. \n\nIt didn’t help that he, like most (if not all) athletes in his position defended himself vigorously with lawsuits.",
            "title_similarity": "0.5231648",
            "sentiment_compound": 0.34
        },
        {
            "id": "i5aflar",
            "score": 1,
            "text": "Greg Lamond: I'm Greg LeMond, the first American cyclist to win the Tour de France. Three times, actually.\n\nBaljeet: So, like recently?\n\nGreg LeMond: That's not the point. ",
            "title_similarity": "0.63544655",
            "sentiment_compound": 0.743
        },
        {
            "id": "i5afluj",
            "score": 1,
            "text": "Is the person writing this 7?! This was recent…I’m not old…",
            "title_similarity": "0.25064605",
            "sentiment_compound": 0.0
        },
        {
            "id": "i5afzg6",
            "score": 1,
            "text": "You think they’d show a little more respect to the first man on the moon",
            "title_similarity": "0.29459754",
            "sentiment_compound": 0.4792
        },
        {
            "id": "i5afzg7",
            "score": 1,
            "text": "I felt such glee to see my hardcore “tour de france” fanboys having to face the fact that all their passionate discussions regarding the relative merits of various riders were all down to how brazenly pill-popping they were.",
            "title_similarity": "0.5593252",
            "sentiment_compound": 0.8834
        },
        {
            "id": "i5ag3nm",
            "score": 1,
            "text": "It's just wake up call find out that athletes performing at world class events are most likely doping. Not just cycling, but any sport. They work stuff their training regimen around when will the best drug testing will be.",
            "title_similarity": "0.6228275",
            "sentiment_compound": 0.7783
        },
        {
            "id": "i5agf1s",
            "score": 1,
            "text": "what is the point of competitive sports anymore?",
            "title_similarity": "0.109271035",
            "sentiment_compound": 0.1779
        },
        {
            "id": "i5agfnu",
            "score": 1,
            "text": "If there was so much doping that no one wins I feel like you should just give them back to him. Crown him the dope king",
            "title_similarity": "0.57853985",
            "sentiment_compound": -0.4015
        },
        {
            "id": "i5agklk",
            "score": 1,
            "text": "Lots of tailwinds during that era.",
            "title_similarity": "0.18555449",
            "sentiment_compound": 0.0
        },
        {
            "id": "i5agpo1",
            "score": 1,
            "text": "You think I go home to Starla every night dressed like Peter Pan here? Forget about it.",
            "title_similarity": "0.45156038",
            "sentiment_compound": 0.1531
        },
        {
            "id": "i5agq5l",
            "score": 1,
            "text": "Nanomachines son",
            "title_similarity": "0.22312471",
            "sentiment_compound": 0.0
        },
        {
            "id": "i5ah3qa",
            "score": 1,
            "text": "The Program (2015), starring Medivh, is a pretty nice dramatized look into Lance Armstrong and the doping that went on in competitive cycling. \n\nIronically, I think there's also a 1993 film called The Program that deals with doping (among many other things like recreational drugs) in college football.",
            "title_similarity": "0.6728424",
            "sentiment_compound": 0.8481
        },
        {
            "id": "i5ah3re",
            "score": 1,
            "text": "I'm pretty sure I rode a bike in 2003.\n\nDeclare me winner.",
            "title_similarity": "0.4878747",
            "sentiment_compound": 0.8519
        },
        {
            "id": "i5ah56m",
            "score": 2,
            "text": "He was beyond the statute of limitations. But he just HAD to try for a comeback. Which made him an active competitor. And reset the clock so the statue of limitations no longer applied. Should have faded into the sunset.\n\nNot saying he wasn't guilty, and a total jerk about it...",
            "title_similarity": "0.5345765",
            "sentiment_compound": 0.0538
        },
        {
            "id": "i5ah8co",
            "score": 1,
            "text": "Everyone should watch ***Icarus***. Netflix. GO NOW",
            "title_similarity": "0.2178842",
            "sentiment_compound": 0.0
        },
        {
            "id": "i5ahbgo",
            "score": 1,
            "text": "May the best doper win…",
            "title_similarity": "0.11753254",
            "sentiment_compound": 0.6369
        },
        {
            "id": "i5ahes6",
            "score": 1,
            "text": "Sounds about right.",
            "title_similarity": "-0.22758338",
            "sentiment_compound": 0.0
        },
        {
            "id": "i5ahpz1",
            "score": 1,
            "text": "They should drug test themselves at that point.",
            "title_similarity": "0.16102636",
            "sentiment_compound": 0.0
        },
        {
            "id": "i5ahu9l",
            "score": 1,
            "text": "That’s when I stopped watching cycling. With most of the riders doping, there’s no point.",
            "title_similarity": "0.6487103",
            "sentiment_compound": -0.4767
        },
        {
            "id": "i5ahxo9",
            "score": 1,
            "text": "Should just announce the win for Slim Robinson.  Jackie Robinson is just Slim’s uncle.",
            "title_similarity": "0.39200023",
            "sentiment_compound": 0.5859
        },
        {
            "id": "i5ai2l0",
            "score": 2,
            "text": "If we are to assume that nobody is doping nowadays, how would riders from that era(even the cheaters) compare to the top riders currently?",
            "title_similarity": "0.5904132",
            "sentiment_compound": -0.2732
        },
        {
            "id": "i5aigc2",
            "score": 1,
            "text": "[tour de france champion ](https://youtu.be/VeTCC9B2ktk)",
            "title_similarity": "0.4338902",
            "sentiment_compound": 0.5994
        },
        {
            "id": "i5aijb7",
            "score": 1,
            "text": "With Nugenix, S’HELL like the difference too",
            "title_similarity": "0.16692159",
            "sentiment_compound": 0.3612
        },
        {
            "id": "i5aiubg",
            "score": 1,
            "text": "My dad was a fairly competitive cyclist in the 70-80s. I remember when Armstrong started winning he said, \"He's cheating\", \"I was like damn pop, why do you say that?\"   \n\"He's winning at that level of cycling.\"",
            "title_similarity": "0.6765119",
            "sentiment_compound": 0.5719
        },
        {
            "id": "i5aj26u",
            "score": 1,
            "text": "Shit like this is why Cheating has to be taken seriously at every level.\n\nYou cannot allow a culture that accepts cheating as a part of life.\n\nIt ruins the integrity of not just sports, but ethics, morality. It creeps into family life, it is such a detrimental aspect of culture that has to be rooted out and condemned.\n\nBe wary of people who don't care about cheating, and watch your back when you are around them so to speak.",
            "title_similarity": "0.47856438",
            "sentiment_compound": -0.8289
        },
        {
            "id": "i5aja7b",
            "score": 1,
            "text": "IMHO, for endurance sports like this, there should be a handicapping system that basically makes doping pointless. I own a sailboat, and if I choose to race her, she will be assigned a PHRF rating. This basically means that I can realistically race my slow little 27’ cruising boat against someone sailing a 38 foot race boat. The handicapping system factors out the boat’s characteristics and leaves it to the skill of the skipper. \n\nIn the case of endurance sports like cycling, change it so that everyone is effectively racing against themselves. That will dramatically reduce the incentive to dope.",
            "title_similarity": "0.5864041",
            "sentiment_compound": 0.8555
        },
        {
            "id": "i5ajrlk",
            "score": 1,
            "text": "Imagine coming in 57th place and winning because everybody else in the Tour de France was doping",
            "title_similarity": "0.8206852",
            "sentiment_compound": 0.5267
        },
        {
            "id": "i5ajurm",
            "score": 1,
            "text": "[ officials be like in Australia ](https://getyarn.io/yarn-clip/7196d986-deaa-4ac5-986e-8efe9cbe1a52)",
            "title_similarity": "0.15100618",
            "sentiment_compound": 0.3612
        },
        {
            "id": "i5akbm1",
            "score": 1,
            "text": "Why didn't the win go to the first non-doper? Was it really all of them?",
            "title_similarity": "0.39050823",
            "sentiment_compound": -0.5318
        },
        {
            "id": "i5akkhn",
            "score": 1,
            "text": "Tour de Force is a great mockumentory on this. Lance Armstrong is even in it",
            "title_similarity": "0.3066665",
            "sentiment_compound": 0.6249
        },
        {
            "id": "i5akqoe",
            "score": 1,
            "text": "Surprisingly enough I was just thinking about this",
            "title_similarity": "-0.055933",
            "sentiment_compound": 0.296
        },
        {
            "id": "i5akuzx",
            "score": 1,
            "text": "Or as Bill Burr would put it \"our roided up guy beat your roided up guy\"",
            "title_similarity": "0.41202176",
            "sentiment_compound": 0.0
        },
        {
            "id": "i5akvdb",
            "score": 1,
            "text": "Maybe they should have done like strongman and let people use PEDs. Because this sounds ridiculous, having no winners lol",
            "title_similarity": "0.4754942",
            "sentiment_compound": -0.4915
        },
        {
            "id": "i5al3oc",
            "score": 1,
            "text": "I don’t think I’d want to see an absolute clean tour de anything.",
            "title_similarity": "0.33741644",
            "sentiment_compound": 0.4588
        },
        {
            "id": "i5al4i3",
            "score": 1,
            "text": "Crazy how hard it is to have fair/safe athletic competitions",
            "title_similarity": "0.36835605",
            "sentiment_compound": -0.4215
        },
        {
            "id": "i5al7c0",
            "score": 3,
            "text": "I have just as many tour de France wins and twice as many testicles as Lance Armstrong",
            "title_similarity": "0.5903039",
            "sentiment_compound": 0.5719
        },
        {
            "id": "i5alv6u",
            "score": 1,
            "text": "This is why we need a free for all version of the Olympics.\n\nWanna dope up? Sure. Want robot legs? Sure. Let's see what's possible.\n\nBut the REAL Olympics and Tour de France should never be tainted with this nonesense.\n\nAnd yes I get it's the Tour de France not the Olympics, but any contest of human fortitude or endurance should be given the same respect.",
            "title_similarity": "0.47295147",
            "sentiment_compound": 0.9129
        },
        {
            "id": "i5am59i",
            "score": 2,
            "text": "I shook Lance Armstrong’s hand at an exhibition event in Colorado Springs one week before he revealed his diagnosis. I was so happy for him to be able to beat cancer and become so dominant in the the sport. It truly was inspiring. \n\nFucking cheater.",
            "title_similarity": "0.65454245",
            "sentiment_compound": 0.6185
        },
        {
            "id": "i5amers",
            "score": 1,
            "text": "So, the classic 'everyone's a winner' trope...huh interesting",
            "title_similarity": "0.16445908",
            "sentiment_compound": 0.7579
        },
        {
            "id": "i5amkee",
            "score": 1,
            "text": "Has the Bill Burr bit been posted yet?",
            "title_similarity": "0.15718096",
            "sentiment_compound": 0.0
        },
        {
            "id": "i5an6r3",
            "score": 1,
            "text": "He also lost a race to a pedicabber",
            "title_similarity": "0.67152405",
            "sentiment_compound": -0.3182
        },
        {
            "id": "i5anc3d",
            "score": 2,
            "text": "Our roided up guy beat your roided up guy!",
            "title_similarity": "0.3864104",
            "sentiment_compound": 0.0
        },
        {
            "id": "i5angt8",
            "score": 1,
            "text": "So he was still the best, just the best of all the dopers…!",
            "title_similarity": "0.2234844",
            "sentiment_compound": 0.8655
        },
        {
            "id": "i5anocb",
            "score": 1,
            "text": "I can't quite figure out the message intended by not making the first clean finish the winner outside of the people behind it all being complete cowards.",
            "title_similarity": "0.5910497",
            "sentiment_compound": 0.7579
        },
        {
            "id": "i5anwca",
            "score": 1,
            "text": "\"Hey maybe we should talk about how there was a widespread issue within our sport that we addressed to make cycling better.\"\n\nNah let's go with it was 'Tour de never happened and call it a day'.",
            "title_similarity": "0.55304146",
            "sentiment_compound": 0.3612
        },
        {
            "id": "i5ao3fz",
            "score": 2,
            "text": "Hell if everyone was doping then give him back the wins. He was the best of all the dopers.",
            "title_similarity": "0.52726746",
            "sentiment_compound": 0.5106
        },
        {
            "id": "i5ao6kd",
            "score": 1,
            "text": "The 2 minute bit Bill Burr said on the matter from Conans show https://youtu.be/O9YL04v-J5U",
            "title_similarity": "0.31482756",
            "sentiment_compound": 0.0258
        },
        {
            "id": "i5ao9sb",
            "score": 1,
            "text": "I think everyone should be allowed to take them, the reason being a majority of athletes use them already. I’d like a clean playing field but everyone is looking for an advantage, especially in professional, international sports.",
            "title_similarity": "0.36243278",
            "sentiment_compound": 0.6705
        },
        {
            "id": "i5aoegd",
            "score": 2,
            "text": "This is why it’s hard to respect sports on that level - everyone is cheating despite having worked really hard",
            "title_similarity": "0.5079142",
            "sentiment_compound": -0.3804
        },
        {
            "id": "i5aogw2",
            "score": 2,
            "text": "They should have upheld his previous wins and just massively changed things going forward. That, or just straight up have sports leagues that allow steroids and ones that don't.",
            "title_similarity": "0.49082446",
            "sentiment_compound": 0.7579
        },
        {
            "id": "i5aohfe",
            "score": 1,
            "text": "Best doper i guess",
            "title_similarity": "-0.025045166",
            "sentiment_compound": 0.6369
        },
        {
            "id": "i5aoly2",
            "score": 1,
            "text": "Free the horses!",
            "title_similarity": "0.06280844",
            "sentiment_compound": 0.5562
        },
        {
            "id": "i5apb7y",
            "score": 1,
            "text": "I've always believed Armstrong should not have lost his titles and Mark Mcguire should be in the HOF. You still have to actually perform the task.  Drugs don't do it for you.",
            "title_similarity": "0.3876291",
            "sentiment_compound": 0.2411
        },
        {
            "id": "i5apyg0",
            "score": 2,
            "text": "Same with mlb. All the big sluggers got in trouble but all the pitchers were on roids",
            "title_similarity": "0.59045863",
            "sentiment_compound": -0.2144
        },
        {
            "id": "i5aq275",
            "score": 1,
            "text": "I’m betting the ones who didn’t do drugs are pretty fucking pissed",
            "title_similarity": "0.49013132",
            "sentiment_compound": -0.3167
        },
        {
            "id": "i5aq4v7",
            "score": 1,
            "text": "You just learned that today??",
            "title_similarity": "0.05985859",
            "sentiment_compound": 0.0
        },
        {
            "id": "i5aq8hu",
            "score": 1,
            "text": "To be perfectly honest, I cared more about him throwing people under the bus than I did him doping.",
            "title_similarity": "0.5706026",
            "sentiment_compound": 0.8834
        },
        {
            "id": "i5aqscn",
            "score": 2,
            "text": "So the core problem in all of this is money in sport, and what drives that is corporate greed. No money and the athletes are all doing it for glory not endorsements, 99% of problem solved.",
            "title_similarity": "0.6404579",
            "sentiment_compound": -0.6077
        },
        {
            "id": "i5ar92r",
            "score": 1,
            "text": "They all dope",
            "title_similarity": "0.09535244",
            "sentiment_compound": 0.0
        },
        {
            "id": "i5arppz",
            "score": 1,
            "text": "Cycling is a joke.",
            "title_similarity": "0.29466373",
            "sentiment_compound": 0.296
        },
        {
            "id": "i5art16",
            "score": 1,
            "text": "The Tour de France is a joke now. Everyone dopes. You can't win without doping.",
            "title_similarity": "0.7257213",
            "sentiment_compound": -0.2197
        },
        {
            "id": "i5aruka",
            "score": 1,
            "text": "The problem with Armstrong wasn’t the doping — everyone was doing it. The problem was his absolute ruthlessness in protecting his reign, destroying anyone who threatened him.",
            "title_similarity": "0.589988",
            "sentiment_compound": -0.9001
        },
        {
            "id": "i5as5yj",
            "score": 1,
            "text": "Just open it up, have a doping event and a non doping.",
            "title_similarity": "0.19397974",
            "sentiment_compound": 0.0
        },
        {
            "id": "i5asdpc",
            "score": 2,
            "text": "They should have just left the wins as they were. They were all doping. It was fair.",
            "title_similarity": "0.43705326",
            "sentiment_compound": 0.7184
        },
        {
            "id": "i5aslzs",
            "score": 1,
            "text": "There’s a reason being on a steroid cycle is called “riding the bicycle”. \n\nEveryone, and I mean EVERYONE, in professional cycling dopes.  And it’s not a substitute for the countless hours of training these genetically gifted cyclists do to be elite, just part of what it takes.",
            "title_similarity": "0.5833778",
            "sentiment_compound": 0.0
        },
        {
            "id": "i5ast6h",
            "score": 1,
            "text": "Unpopular opinion, but they should all just be allowed to be on the gear. They all do it anyway and then we wouldn’t have to pretend to be outraged when someone gets caught.",
            "title_similarity": "0.32312843",
            "sentiment_compound": -0.7469
        },
        {
            "id": "i5atakm",
            "score": 1,
            "text": "I always felt Lance had an edge because he had one testicle.\n\n&#x200B;\n\nLess friction down there.",
            "title_similarity": "0.36786288",
            "sentiment_compound": 0.0
        },
        {
            "id": "i5atdi2",
            "score": 1,
            "text": "Yes. Tour de Pharmacy.....",
            "title_similarity": "0.022742076",
            "sentiment_compound": 0.4019
        },
        {
            "id": "i5atedd",
            "score": 1,
            "text": "How much do you want to bet they never stopped they just use something else.  Same with Footraces and MMA, Boxing, Basketball, Football, ping pong ;)",
            "title_similarity": "0.37235034",
            "sentiment_compound": 0.434
        },
        {
            "id": "i5atnb5",
            "score": 1,
            "text": "Almost like the whole reveal didn’t need to happen.",
            "title_similarity": "0.17109805",
            "sentiment_compound": 0.2975
        },
        {
            "id": "i5au38z",
            "score": 1,
            "text": "If everyone is cheating is it still cheating?",
            "title_similarity": "0.28603768",
            "sentiment_compound": -0.802
        },
        {
            "id": "i5au6n3",
            "score": 1,
            "text": "\"Our roided out guy beat your roided out guy\" - bill burr",
            "title_similarity": "0.4667623",
            "sentiment_compound": 0.0
        },
        {
            "id": "i5aujme",
            "score": 1,
            "text": "Open secret, people still do it to this day. \n\nElite athletes declare themselves as having asthma, so they can take some mild performance enhancing drugs openly. \n\nhttps://www.theguardian.com/sport/2016/apr/29/elite-athletes-asthma-simon-yates-team-sky-swimmers",
            "title_similarity": "0.56025565",
            "sentiment_compound": 0.0
        },
        {
            "id": "i5auk3q",
            "score": 1,
            "text": "The very first Tour De France was drug effect as people took stimulants to ride all night.\n\nIf it's so hard and impossible without drugs why not change it so it's fair and competitive ?",
            "title_similarity": "0.67662084",
            "sentiment_compound": 0.3425
        },
        {
            "id": "i5aukze",
            "score": 1,
            "text": "Cheating in cycling has eras. Before EPO and HGH there was steroids, before that it was amphetamines and alcohol. Tom Simpson died on Mt. Ventoux, his heart blew up, and they later found amphetamine and alcohol in his blood. \n\nRight now, if you believe Taylor Phinney, it's prescription opiates and other pain blockers. There's also been instances of 'mechanical doping' where bikes are found to have *literal motors* hidden in them. \n\nLance may have been brutal to the people around him, but his cheating was part of a broader, systemic problem in the sport. Though his era was particularly flagrant, professional cycling has an incentive problem, in an endurance sport where your output is your talent, if anyone is cheating and getting away with it, everyone must cheat.",
            "title_similarity": "0.7745451",
            "sentiment_compound": -0.9668
        },
        {
            "id": "i5aup1k",
            "score": 1,
            "text": "But didn’t he have cancer?",
            "title_similarity": "0.34029114",
            "sentiment_compound": -0.7964
        },
        {
            "id": "i5autn0",
            "score": 1,
            "text": "I can't remember which year, but it was a situation where if they were to award the yellow jersey to someone that HAD NOT been associated with doping, it would have been the 37th place finisher.",
            "title_similarity": "0.6141651",
            "sentiment_compound": 0.6956
        },
        {
            "id": "i5avgyw",
            "score": 1,
            "text": "Seeing this on TIL makes me feel old.",
            "title_similarity": "0.18365863",
            "sentiment_compound": 0.0
        },
        {
            "id": "i5awe0v",
            "score": 1,
            "text": "Well, duh. What do they think separates the upper echelon from other competitors in sport?",
            "title_similarity": "0.3392926",
            "sentiment_compound": 0.2732
        },
        {
            "id": "i5awf6m",
            "score": 1,
            "text": "He shouldn’t have been stripped of his wins",
            "title_similarity": "0.36400634",
            "sentiment_compound": 0.5719
        },
        {
            "id": "i5awft8",
            "score": 1,
            "text": "And nobody is giving back their yachts.",
            "title_similarity": "0.4014738",
            "sentiment_compound": 0.34
        },
        {
            "id": "i5awk14",
            "score": 1,
            "text": "So if everyone in the race was doping…it was an even race and Lance still out performed?",
            "title_similarity": "0.5755839",
            "sentiment_compound": 0.0
        },
        {
            "id": "i5awk9t",
            "score": 1,
            "text": "\"Our roided up guy , beat your roided up guy...\"",
            "title_similarity": "0.31809622",
            "sentiment_compound": 0.0
        },
        {
            "id": "i5awsaj",
            "score": 1,
            "text": "Sounds like he won fair and square then",
            "title_similarity": "0.15698093",
            "sentiment_compound": 0.8176
        },
        {
            "id": "i5awvhp",
            "score": 1,
            "text": "“Did all those guys return the money they made off that guy?. NO. Our roided-up guy beat your roided-up guy.” -Bull Burr (rough translation)",
            "title_similarity": "0.57839835",
            "sentiment_compound": 0.0
        },
        {
            "id": "i5awxy5",
            "score": 1,
            "text": "Ok so the stripped him and all the riders who finished behind him of all titles but will the organizer of this even ever give back the money they made off of his success?? \n\nOf course not.",
            "title_similarity": "0.71382636",
            "sentiment_compound": 0.7912
        },
        {
            "id": "i5awz86",
            "score": 1,
            "text": "Our roided up guy beat your roided up guy",
            "title_similarity": "0.3794711",
            "sentiment_compound": 0.0
        },
        {
            "id": "i5ax9a7",
            "score": 1,
            "text": "What a true trailblazer!",
            "title_similarity": "-0.0033329502",
            "sentiment_compound": 0.4753
        },
        {
            "id": "i5axcik",
            "score": 1,
            "text": "Go to the moon and this is the thanks you get",
            "title_similarity": "0.12913649",
            "sentiment_compound": 0.4404
        },
        {
            "id": "i5axpe4",
            "score": 1,
            "text": "It has been mentioned that Australian cyclist Cadel Evans should have won more than one tour. He came 8th in his first race in 2005 and all 7 riders that were ahead of him had all been eventually busted for doping. His subsequent races over the next few years were fairly similar.",
            "title_similarity": "0.8474004",
            "sentiment_compound": 0.5719
        },
        {
            "id": "i5ay0yf",
            "score": 1,
            "text": "I don’t know if it’s an unpopular opinion, but imo cycling is the most boring sport to watch.",
            "title_similarity": "0.5650381",
            "sentiment_compound": -0.5251
        },
        {
            "id": "i5ay2nh",
            "score": 1,
            "text": "Gotta say, there’s somethin real suspicious about a dude cycling circles around and beating the fuck out of dudes that were doping. No wonder he got caught.",
            "title_similarity": "0.6430805",
            "sentiment_compound": -0.8807
        },
        {
            "id": "i5ayac2",
            "score": 1,
            "text": "The Tour de France was clearly infiltrated by vampires during these years.",
            "title_similarity": "0.52795327",
            "sentiment_compound": 0.4019
        },
        {
            "id": "i5ayaif",
            "score": 1,
            "text": "White American athletes only know how to cheat",
            "title_similarity": "0.4483121",
            "sentiment_compound": -0.4588
        },
        {
            "id": "i5ayh00",
            "score": 1,
            "text": "If they were all doping then he should still be the winner lol",
            "title_similarity": "0.45944482",
            "sentiment_compound": 0.765
        },
        {
            "id": "i5ayjbl",
            "score": 1,
            "text": "I read an article a while back and if I remember correctly the top 30 were eventually associated with doping. Might have been the one Pantini won in '98.",
            "title_similarity": "0.6366186",
            "sentiment_compound": 0.6705
        },
        {
            "id": "i5ayk45",
            "score": 1,
            "text": "Just make it mandatory and even the playing field",
            "title_similarity": "-0.023048036",
            "sentiment_compound": 0.2732
        },
        {
            "id": "i5ayred",
            "score": 1,
            "text": "Member dat",
            "title_similarity": "-0.20350134",
            "sentiment_compound": 0.0
        },
        {
            "id": "i5ayx0u",
            "score": 1,
            "text": "So how was it an advantage?",
            "title_similarity": "-0.141269",
            "sentiment_compound": 0.25
        },
        {
            "id": "i5ayxg5",
            "score": 1,
            "text": "The pervasive doing in cycling always made me think “if everyone is cheating…then no one is?”\n\nI know we don’t want people using performance enhancing techniques, but if essentially the entire field is doping, then isn’t it a level playing field? Obviously this is shaky, but I always thought it was an interesting viewpoint.",
            "title_similarity": "0.60249096",
            "sentiment_compound": 0.5122
        },
        {
            "id": "i5az508",
            "score": 1,
            "text": "Genuinely surprised to this day that the scandal and subsequent fallout with so many doping that the sport just didn’t die in the arse.",
            "title_similarity": "0.6638911",
            "sentiment_compound": -0.7096
        },
        {
            "id": "i5azadh",
            "score": 1,
            "text": "If everyone else was using as well, why bother remove the wins? Lance was the best dopehead.",
            "title_similarity": "0.45212847",
            "sentiment_compound": 0.8225
        },
        {
            "id": "i5azai0",
            "score": 1,
            "text": "Sounds like he won then.",
            "title_similarity": "0.040389948",
            "sentiment_compound": 0.7351
        },
        {
            "id": "i5azbrl",
            "score": 1,
            "text": "They did Lance dirty... from what I’ve heard, finding new and covert ways to dope and cheat is basically part of the sport at that level. \n\nEdit: he was kind of a douche regardless",
            "title_similarity": "0.512048",
            "sentiment_compound": -0.8126
        },
        {
            "id": "i5azdjn",
            "score": 2,
            "text": "If everybody is juiced then he’s still better than them??",
            "title_similarity": "0.23440197",
            "sentiment_compound": 0.504
        },
        {
            "id": "i5azhxa",
            "score": 1,
            "text": "That picture looked liked Jerome Powell for a second and I was surprised to find out he didnt even place in the tour de france. Should have doped",
            "title_similarity": "0.6582835",
            "sentiment_compound": 0.5719
        },
        {
            "id": "i5azkas",
            "score": 2,
            "text": "Imagine not already knowing this. Fucking zoomers.",
            "title_similarity": "0.16328764",
            "sentiment_compound": 0.0
        },
        {
            "id": "i5azmjs",
            "score": 1,
            "text": "He says in his interviews that everyone was doing it. Just about every team. So you either did it or lost sponsors because you couldn't compete. I think he should get his wins back and that they should just let them all dope to the max.",
            "title_similarity": "0.6110935",
            "sentiment_compound": 0.34
        },
        {
            "id": "i5azrzn",
            "score": 1,
            "text": "So….it was a fair race all around then and he won, lol.",
            "title_similarity": "0.339466",
            "sentiment_compound": 0.8316
        },
        {
            "id": "i5b08cb",
            "score": 1,
            "text": "They should just legalise it at this point and invite the professional medical teams on like the engineering teams in F1 you would pfizer going agains novo and so on.",
            "title_similarity": "0.40322697",
            "sentiment_compound": 0.4767
        },
        {
            "id": "i5b0slo",
            "score": 1,
            "text": "Might as well give it back to him if everyone else was on the juice",
            "title_similarity": "0.1513669",
            "sentiment_compound": 0.2732
        },
        {
            "id": "i5b0st6",
            "score": 1,
            "text": "Tour de Farce",
            "title_similarity": "0.21700394",
            "sentiment_compound": -0.4019
        },
        {
            "id": "i5b0ytf",
            "score": 1,
            "text": "Remember the days back then (before they get caught) in a mma forum (not sherdog) where i was saying that Armstrong, Thorpe, Marion Jones, Randy Couture,NBA players and several if not ALL elite athletes are all doped..and the other guys were like \"no way, that is not true, you are not from USA , etc\" \nThis discussion continued until Phelps appeared where i told them he is a specimen but there is no chance he aint doped and they continued to disagree until i stopped talking about it. \nAnd i ll say it again watch out for your role models, especially the ones who do hairtransplants and the hair do not stick to their heads due to the hormones they take.😂",
            "title_similarity": "0.6759225",
            "sentiment_compound": -0.4453
        },
        {
            "id": "i5b13um",
            "score": 1,
            "text": "If everyone cheated just give them back to him maybe",
            "title_similarity": "0.29580456",
            "sentiment_compound": -0.5106
        },
        {
            "id": "i5b1orw",
            "score": 2,
            "text": "The real winner is dope",
            "title_similarity": "0.23766735",
            "sentiment_compound": 0.5859
        },
        {
            "id": "i5b2b6b",
            "score": 1,
            "text": "\"Our roided up guy beat your roided up guy!\"\n- Bill Burr",
            "title_similarity": "0.4627511",
            "sentiment_compound": 0.0
        },
        {
            "id": "i5b2f4q",
            "score": 1,
            "text": "\"Our roided up guy beat your roided up guy\" ol' Billy 🐐",
            "title_similarity": "0.4543374",
            "sentiment_compound": 0.0
        },
        {
            "id": "i5b2ley",
            "score": 1,
            "text": "So our roided competitor beat your roided competitor. At that point they should have just let him keep the medals. It was an even playing field lol.",
            "title_similarity": "0.5522025",
            "sentiment_compound": 0.5574
        },
        {
            "id": "i5b2mgt",
            "score": 1,
            "text": "This reminds me of dieselgate. My dad is a mechanic after he heard about it he just laughed and said \"you think they're the only ones? They're just the ones who got caught. \"",
            "title_similarity": "0.5460463",
            "sentiment_compound": 0.4588
        },
        {
            "id": "i5b2p19",
            "score": 1,
            "text": "Our roided up guy beat your roided up guy",
            "title_similarity": "0.3794711",
            "sentiment_compound": 0.0
        },
        {
            "id": "i5b2re4",
            "score": 1,
            "text": "Why don’t we just allow doping? \nWe could have an extreme tournament which allows it. And the boring tournaments which don’t.",
            "title_similarity": "0.50850797",
            "sentiment_compound": -0.1027
        },
        {
            "id": "i5b2wao",
            "score": 2,
            "text": "Tour de Dope",
            "title_similarity": "0.11631933",
            "sentiment_compound": 0.0
        },
        {
            "id": "i5b31fx",
            "score": 1,
            "text": "Just make it like the All Steroid Olympics....\n\nhttps://youtu.be/jAdG-iTilWU",
            "title_similarity": "0.30855182",
            "sentiment_compound": 0.3612
        },
        {
            "id": "i5b37vh",
            "score": 1,
            "text": "They just couldn't find the clean one. Nowadays they just stopped looking for them",
            "title_similarity": "0.43852663",
            "sentiment_compound": -0.4867
        },
        {
            "id": "i5b3c20",
            "score": 1,
            "text": "Just let them all dope! Sports would be Soo much cooler if they were all super heroes!",
            "title_similarity": "0.38623273",
            "sentiment_compound": 0.8309
        },
        {
            "id": "i5b3dre",
            "score": 1,
            "text": "honestly, i am in the camp of treating these people like entertainers rather than heroes. i really don't care what cocktail they use to get the results so long as it ends up entertaining. people go on and on about how it is an unfair advantage, but if everyone is using it, and in many pro sports competitions they are, then i think it is perfectly fair. \n\nit is also a matter similar to legalizing prostitution too. if we made it okay for athletes to use these substances, then we could work harder to make sure it was safe. instead of these athletes sourcing their drugs from possibly dodgy sources and hiding potentially life threatening symptoms, they could be up front and honest and be properly monitored by medical profesionals.\n\nthis would also put an end to pro athletes being used to advertise products by duping people into believing all you need is hard work and dedication... and this product they are selling.",
            "title_similarity": "0.5433364",
            "sentiment_compound": 0.9516
        },
        {
            "id": "i5b3fmq",
            "score": 1,
            "text": "I consider the first one to be won by Christophe Bassons.",
            "title_similarity": "0.12365106",
            "sentiment_compound": 0.5719
        },
        {
            "id": "i5b3tzw",
            "score": 1,
            "text": "“Our juiced up guy beat your juiced up guy!”\n-Bill Burr",
            "title_similarity": "0.42088962",
            "sentiment_compound": 0.0
        },
        {
            "id": "i5b3zv2",
            "score": 2,
            "text": "If everyone's cheating is anyone really cheating?",
            "title_similarity": "0.3158519",
            "sentiment_compound": -0.8173
        },
        {
            "id": "i5b40dh",
            "score": 1,
            "text": "Not to even mention the electric pedal assist devices they found in some bike frames.",
            "title_similarity": "0.37872386",
            "sentiment_compound": 0.0
        },
        {
            "id": "i5b4aci",
            "score": 1,
            "text": "Back when cycling was fair apparently",
            "title_similarity": "0.13153705",
            "sentiment_compound": 0.3182
        },
        {
            "id": "i5b4dpf",
            "score": 1,
            "text": "Can't even qualify without being doped.\n\nThat's what happens when everyone is on the juice.",
            "title_similarity": "0.2992102",
            "sentiment_compound": 0.0
        },
        {
            "id": "i5b4g6l",
            "score": 1,
            "text": "Cycling is crazy dirty.\n\nThey also have little motors that hide in the frame that give riders a speed boost up hills. People have been caught after falling but their back wheel keeps accelerating. https://www.cbsnews.com/news/60-minutes-investigates-hidden-motors-and-pro-cycling/",
            "title_similarity": "0.5900943",
            "sentiment_compound": -0.3222
        },
        {
            "id": "i5b4hwm",
            "score": 1,
            "text": "So you're saying he won fair and square? Cool. \n\n\nThe US drug war fueled hysteria around so called \"doping\" is so fucking insane, yet so typical for the land of moral panic and mass hysteria. \n\nThe US invented doping and state sponsored doping programs. Look it up.  Thank you Dr. Zeigler and Dianabol. Of course their excuse was \"well we have exactly zero evidence but we suspect the big bad (insert some foreign country we're supposed to hate) are doing it!\" Then when other countries actually caught on and caught up, here comes the US to invent this religious crusade called \"anti doping\" and imposed that regime on the rest of the world by force. Most other countries don't think about this stuff the way we do. They're certainly aren't stopping their legislative bodies to have hearings on pro athletes using, gasp, performance enhancers! What?  Why would a professional athlete want to enhance their performance? And why would we, the audience accept such a thing? It's not like it objectively makes injuries heal faster and makes brutal events like the tour de France SAFER. I'll stop the rant there cuz I can keep going on this track for a long time. I haven't even scratched the surface of what I have to say on this.",
            "title_similarity": "0.65395206",
            "sentiment_compound": -0.9619
        },
        {
            "id": "i5b4iy1",
            "score": 2,
            "text": "Well if everyone was on it, just let him be the winner then",
            "title_similarity": "0.1899953",
            "sentiment_compound": 0.7096
        },
        {
            "id": "i5b4zxp",
            "score": 1,
            "text": "It wasn't so much the crime as the cover up with Lance. Hero to less than zero. He shit on everyone",
            "title_similarity": "0.5108989",
            "sentiment_compound": -0.5809
        },
        {
            "id": "i5b5mbk",
            "score": 1,
            "text": "I actually thought this was common knowledge. I am from Austin TX where he lived at the time so most of the city knew there were no declared winners.",
            "title_similarity": "0.5753209",
            "sentiment_compound": -0.1333
        },
        {
            "id": "i5b64ls",
            "score": 2,
            "text": "Tour de France and everyone cheating... Like always France.",
            "title_similarity": "0.5766782",
            "sentiment_compound": -0.2732
        },
        {
            "id": "i5b6id9",
            "score": 1,
            "text": "holy shit I just got the Tour de France medal and I was like 12 years old at the time .. sweet.  Ebay here I come",
            "title_similarity": "0.5169828",
            "sentiment_compound": 0.6124
        },
        {
            "id": "i5b6mkv",
            "score": 1,
            "text": "Is nobody going to point out that you just can't cycle uphill the way they do without chemical enhancements?",
            "title_similarity": "0.43823197",
            "sentiment_compound": 0.0
        },
        {
            "id": "i5b6ol5",
            "score": 1,
            "text": "Live strong.",
            "title_similarity": "-0.16308162",
            "sentiment_compound": 0.5106
        },
        {
            "id": "i5b6wfv",
            "score": 1,
            "text": "He beat the Euros at their own game. it didn't help that he was a complete asswipe off the bike.\nIt's weird to watch the race anymore as they try to avoid saying his name at all costs.",
            "title_similarity": "0.67558324",
            "sentiment_compound": -0.6319
        },
        {
            "id": "i5b8l06",
            "score": 1,
            "text": "smh, that means all the bicycling he did on the moon meant nothing.",
            "title_similarity": "0.5431886",
            "sentiment_compound": -0.3182
        },
        {
            "id": "i5b8rr2",
            "score": 1,
            "text": "Basically baseball in the 70-00s",
            "title_similarity": "0.18992865",
            "sentiment_compound": 0.0
        },
        {
            "id": "i5b91a7",
            "score": 1,
            "text": "And the pace car wins!",
            "title_similarity": "0.22922084",
            "sentiment_compound": 0.6114
        },
        {
            "id": "i5b93yi",
            "score": 1,
            "text": "anyway funfact, He is named after a Dallas Cowboys wide receiver Lance Rentzel.",
            "title_similarity": "0.34211332",
            "sentiment_compound": 0.0
        },
        {
            "id": "i5b9oxh",
            "score": 1,
            "text": "Sounds like a winner to me",
            "title_similarity": "0.016565153",
            "sentiment_compound": 0.743
        },
        {
            "id": "i5b9ydw",
            "score": 2,
            "text": "So, he won then.",
            "title_similarity": "0.03540521",
            "sentiment_compound": 0.5719
        },
        {
            "id": "i5ba5xu",
            "score": 1,
            "text": "I remember reading a Sports Illustrated where it was all a sob story piece about how poor lance armstrong was being treated like a cheater, and how someone threw a clump of dirt in his face and what if it was laced with something that would make him fail a test (what?). \n\nI wonder what that writer is doing now.",
            "title_similarity": "0.73071826",
            "sentiment_compound": -0.9001
        },
        {
            "id": "i5baae9",
            "score": 2,
            "text": "His website [livestrong.com](https://livestrong.com) is excellent though.",
            "title_similarity": "0.15376894",
            "sentiment_compound": 0.5719
        },
        {
            "id": "i5bacv4",
            "score": 1,
            "text": "Can’t cheat at Chess",
            "title_similarity": "0.16962215",
            "sentiment_compound": -0.4588
        },
        {
            "id": "i5bags2",
            "score": 1,
            "text": "Pretty sure there is big doping in European football but it is not tied about for money purposes",
            "title_similarity": "0.5763215",
            "sentiment_compound": 0.4118
        },
        {
            "id": "i5bakab",
            "score": 1,
            "text": "Steroids are so prevalent in sports, fitness, bodybuilding, etc. Its more rare that someone wouldn’t be on steroids than they would be on them. Should just be legal.",
            "title_similarity": "0.41976112",
            "sentiment_compound": 0.3818
        },
        {
            "id": "i5baklw",
            "score": 1,
            "text": "“Our roided up guy beat your roided up guy” - Bill Burr on Conan",
            "title_similarity": "0.4891389",
            "sentiment_compound": 0.0
        },
        {
            "id": "i5bap4t",
            "score": 1,
            "text": "It seemed obvious to me he was on the sauce, however he was the best out of all of them.\n\nHis behaviour was abhorrent but that can't change that his efforts were incredible to finish first seven times in a row.\n\nA very unfortunate set of circumstances.",
            "title_similarity": "0.6370475",
            "sentiment_compound": -0.6586
        },
        {
            "id": "i5baqsg",
            "score": 1,
            "text": "No ball foul",
            "title_similarity": "0.12091397",
            "sentiment_compound": -0.296
        },
        {
            "id": "i5bawvn",
            "score": 1,
            "text": "Wait a second... athletes use drugs to enhance performance??",
            "title_similarity": "0.27344513",
            "sentiment_compound": 0.0
        },
        {
            "id": "i5bb01f",
            "score": 1,
            "text": "Cycling has always had cheating.",
            "title_similarity": "0.5528104",
            "sentiment_compound": -0.5574
        },
        {
            "id": "i5bb81q",
            "score": 1,
            "text": "I'm really torn on this because he did so much for cancer with the money didn't he?",
            "title_similarity": "0.5945879",
            "sentiment_compound": -0.788
        },
        {
            "id": "i5bbcu5",
            "score": 1,
            "text": "If doping gives u a huge advantage, there is no way any of the top riders are clean, since if they were clean they wouldnt be in the top, bearing in mind that there are doped riders.",
            "title_similarity": "0.64618874",
            "sentiment_compound": 0.8442
        },
        {
            "id": "i5bbdxo",
            "score": 1,
            "text": "I never vilified Armstrong because the whole sport is a joke. Same with athletics. Full of dope cheats so it becomes the only way to actually \"compete\".",
            "title_similarity": "0.6684437",
            "sentiment_compound": -0.1531
        },
        {
            "id": "i5bbg0f",
            "score": 1,
            "text": "Our doped up guy beat your doped up guy.",
            "title_similarity": "0.3653003",
            "sentiment_compound": 0.0
        },
        {
            "id": "i5bcc71",
            "score": 1,
            "text": "I bet the sport is still dity af.",
            "title_similarity": "-0.023708815",
            "sentiment_compound": 0.0
        },
        {
            "id": "i5bcmok",
            "score": 1,
            "text": "Just let EVERYONE juice up then see just how far the human body can go, fuck it",
            "title_similarity": "0.20290473",
            "sentiment_compound": -0.5423
        },
        {
            "id": "i5bcrgl",
            "score": 1,
            "text": "Wow I thought the term cheaters never prosper but boy was I wrong lol",
            "title_similarity": "0.51547134",
            "sentiment_compound": 0.0
        },
        {
            "id": "i5bdduw",
            "score": 1,
            "text": "Can we please justget a sports league that allows drugs?? That would be awesome.",
            "title_similarity": "0.25239006",
            "sentiment_compound": 0.7757
        },
        {
            "id": "i5beai4",
            "score": 1,
            "text": "I really wish he had come clean with his book and called it something like “Yeah man! I was doped to the eyeballs! Everyone was.”\n\nWould have sold more copies for a start.",
            "title_similarity": "0.5683928",
            "sentiment_compound": 0.8306
        },
        {
            "id": "i5beeie",
            "score": 1,
            "text": "Sports need two classes: augmented and regular. In the augmented league anything goes, doping, cybernetics, gene therapy, whatever.",
            "title_similarity": "0.34044185",
            "sentiment_compound": 0.0
        },
        {
            "id": "i5bejc8",
            "score": 1,
            "text": "\"OUR roided up guy, beat YOUR roided up guy.\" - Bill Burr talking about Lance Armstrong",
            "title_similarity": "0.49141937",
            "sentiment_compound": 0.0
        },
        {
            "id": "i5bejpm",
            "score": 1,
            "text": "Bill burr has a great rant about this on conan's show. Just search 'bill burr lance armstrong\". Dont think sub allows links.",
            "title_similarity": "0.5625472",
            "sentiment_compound": 0.4019
        },
        {
            "id": "i5beo55",
            "score": 1,
            "text": "Why do people honestly care?",
            "title_similarity": "-0.08984103",
            "sentiment_compound": 0.7351
        },
        {
            "id": "i5bfahp",
            "score": 2,
            "text": "Our roided up guys beat your roided up guys!\n\n\\- Bill Burr",
            "title_similarity": "0.474387",
            "sentiment_compound": 0.0
        },
        {
            "id": "i5bffl6",
            "score": 2,
            "text": "[\"Our roided-up guy beat your roided-up guy.\" - Bill Burr](https://youtu.be/O9YL04v-J5U)",
            "title_similarity": "0.46669382",
            "sentiment_compound": 0.0
        },
        {
            "id": "i5bfiv8",
            "score": 1,
            "text": "Damm this is what a man gets for landing on the moon",
            "title_similarity": "0.24229312",
            "sentiment_compound": 0.0
        },
        {
            "id": "i5bfnfa",
            "score": 1,
            "text": "Watch Icarus on Netflix, great doc about this topic.",
            "title_similarity": "0.20694426",
            "sentiment_compound": 0.6249
        },
        {
            "id": "i5bfshs",
            "score": 1,
            "text": "Looking forward to when some average guy finishes hours after everyone but still wins because he didn't dope",
            "title_similarity": "0.5339146",
            "sentiment_compound": 0.7227
        },
        {
            "id": "i5bfwde",
            "score": 1,
            "text": "If it's about money, it involves doping.\nEveryone is doped, but he was one of the few who had the balls to admit and talk about it.",
            "title_similarity": "0.54655564",
            "sentiment_compound": 0.296
        },
        {
            "id": "i5bgosp",
            "score": 1,
            "text": "Dope De France",
            "title_similarity": "0.030960307",
            "sentiment_compound": 0.0
        },
        {
            "id": "i5bgtye",
            "score": 1,
            "text": ">!!<So basically our roided up guy beat your roided up guy>!!<",
            "title_similarity": "0.38711795",
            "sentiment_compound": 0.0
        },
        {
            "id": "i5bh14d",
            "score": 1,
            "text": "I wish society would just get over its problem with drug enhancement in sport, it's so stupid, just let people dope!",
            "title_similarity": "0.60087943",
            "sentiment_compound": -0.6867
        },
        {
            "id": "i5bhfbh",
            "score": 1,
            "text": "That was some hefty times. Tour of 99 should've gona to the last Belgian tour winner. Kurt Van De Wouwer came in p11, all 10 riders before him  got caught.  Cheating in the grand tours was always there. If I remember correct the winner of the first Tour De France in 1903 Maurice Garin was disqualified in 1904 because he and some other riders took the train during some stages to get an advantage. \n\nStages at that time were long and cruel and they often left in the dark, with not many people around. So taking a train was rather easy. The win was for number 4 in the classifications, Henri Cornet who is still the youngest winner ever, as the others before him were also taking the train.",
            "title_similarity": "0.82242286",
            "sentiment_compound": 0.9217
        },
        {
            "id": "i5bidef",
            "score": 3,
            "text": "If everyone was doping, it sounds like a fair race.",
            "title_similarity": "0.33542174",
            "sentiment_compound": 0.5859
        },
        {
            "id": "i5bj6jj",
            "score": 1,
            "text": "I used to watch the tour, but stopped when it was clear \"everyone\" was cheating. Haven't watched a single one since.",
            "title_similarity": "0.6885705",
            "sentiment_compound": -0.5927
        },
        {
            "id": "i5bj7b5",
            "score": 2,
            "text": "'..our doped up guy beat your doped up guy..'",
            "title_similarity": "0.3656809",
            "sentiment_compound": 0.0
        },
        {
            "id": "i5bjne9",
            "score": 1,
            "text": "I've seen people say cycling is relatively clean these days. I doubt it, but the fact that the average speed in tdf has gone down a bit leads credibility to it. Maybe they just dope less.",
            "title_similarity": "0.4724251",
            "sentiment_compound": 0.0258
        },
        {
            "id": "i5bkarx",
            "score": 2,
            "text": "There's a bit by [Bill Burr on Conan O'Brien](https://www.youtube.com/watch?v=O9YL04v-J5U) about this and how everyone acted so outraged at Armstrong for doping, even though every cyclist was doing it and the people outraged by that had also done terrible things to get ahead.",
            "title_similarity": "0.75370514",
            "sentiment_compound": -0.902
        },
        {
            "id": "i5bkb56",
            "score": 2,
            "text": "That’s completely nut",
            "title_similarity": "0.069884464",
            "sentiment_compound": 0.0
        },
        {
            "id": "i5bl1q8",
            "score": 2,
            "text": "I have a question, if everyone was doping and lance Armstrong still won, does that mean that he still would have won if everyone didn't dope?",
            "title_similarity": "0.6459851",
            "sentiment_compound": 0.8126
        },
        {
            "id": "i5bl701",
            "score": 1,
            "text": "makes me feel old that something I consider relatively recent as the last armstrong controversy is. TIL",
            "title_similarity": "0.30005383",
            "sentiment_compound": 0.0
        },
        {
            "id": "i5blab8",
            "score": 1,
            "text": "They should do one where you're allowed to dope. Tour de dope. You've still gotta train even if you do dope, it's not like a get fit quick thing.",
            "title_similarity": "0.36447227",
            "sentiment_compound": 0.1002
        },
        {
            "id": "i5blr32",
            "score": 2,
            "text": "Legalize it all!",
            "title_similarity": "-0.004002126",
            "sentiment_compound": 0.0
        },
        {
            "id": "i5bmky2",
            "score": 1,
            "text": "Wow, what a legitimate sport!",
            "title_similarity": "-0.04711175",
            "sentiment_compound": 0.6239
        },
        {
            "id": "i5bmrzi",
            "score": 1,
            "text": "all the cool kids were doing it",
            "title_similarity": "0.047334656",
            "sentiment_compound": 0.3182
        },
        {
            "id": "i5bmtyj",
            "score": 1,
            "text": "So much drugs, looks like it is a fun sport.",
            "title_similarity": "0.22960716",
            "sentiment_compound": 0.7003
        },
        {
            "id": "i5bn6wc",
            "score": 2,
            "text": "The solution here would've been to just let everyone dope. Then it would've been an even playing field",
            "title_similarity": "0.26375073",
            "sentiment_compound": 0.4767
        },
        {
            "id": "i5bo3th",
            "score": 1,
            "text": "As Bill Burr said: “our roided up guy beat your roided up guys”.",
            "title_similarity": "0.43345416",
            "sentiment_compound": 0.0
        },
        {
            "id": "i5boam9",
            "score": 1,
            "text": "Not to mention the Spanish rider, Miguel Indurain, win five consecutive races immediately prior to the Lance era.",
            "title_similarity": "0.62036324",
            "sentiment_compound": 0.5859
        },
        {
            "id": "i5bonro",
            "score": 2,
            "text": "It’s what needed to be done. At the time the sport was so rife with cheating that it had become a joke.",
            "title_similarity": "0.4289418",
            "sentiment_compound": -0.3947
        },
        {
            "id": "i5bpdt2",
            "score": 1,
            "text": "Nothing new right? Different years, different techniques… The game goes on…",
            "title_similarity": "0.24330269",
            "sentiment_compound": 0.0
        },
        {
            "id": "i5bpng8",
            "score": 2,
            "text": "I guarantee that all riders finished were doping, whether they found out or not. It's amazing how they pretend to be so oblivious, ofc they know.",
            "title_similarity": "0.5329077",
            "sentiment_compound": -0.3553
        },
        {
            "id": "i5bpr1i",
            "score": 2,
            "text": "Should’ve been the outcome of the mens 100m race at Seoul in ‘88 as well.",
            "title_similarity": "0.36263305",
            "sentiment_compound": 0.2732
        },
        {
            "id": "i5bpzv5",
            "score": 1,
            "text": "Anyone who still tunes in to this monumental sham of a sport is only fooling themselves",
            "title_similarity": "0.40609127",
            "sentiment_compound": -0.4019
        },
        {
            "id": "i5bqdsb",
            "score": 1,
            "text": " The reason why no winner was because almost everyone was doping. If they gave it to the 2nd place finishers, he was likely doping too, just not as good as Lance. \n\n I thought at the time they should have given it to the last place finisher since he was the least likely to be doping.",
            "title_similarity": "0.73456603",
            "sentiment_compound": -0.6681
        },
        {
            "id": "i5bqrxl",
            "score": 1,
            "text": "Hasn’t doping and cycling gone hand in hand since they first trundled up that cobbly old road in Paris?",
            "title_similarity": "0.5760056",
            "sentiment_compound": 0.7506
        },
        {
            "id": "i5brwec",
            "score": 1,
            "text": "If everyone was taking them... then he technically won",
            "title_similarity": "0.16923158",
            "sentiment_compound": 0.5719
        },
        {
            "id": "i5bs1d3",
            "score": 1,
            "text": "My science teacher called this five years before he was caught doping. I thought she was crazy. I reached out to her years later and told her she was a genius.",
            "title_similarity": "0.66008323",
            "sentiment_compound": -0.25
        },
        {
            "id": "i5bsnll",
            "score": 1,
            "text": "Duh, all the elites cheat.",
            "title_similarity": "0.4496207",
            "sentiment_compound": -0.4588
        },
        {
            "id": "i5bt4xq",
            "score": 1,
            "text": "Does he has at last one?",
            "title_similarity": "0.010899634",
            "sentiment_compound": 0.0
        },
        {
            "id": "i5btbpj",
            "score": 1,
            "text": "But there must be someone who didn't dope?  Even last place.  Make him the winner.",
            "title_similarity": "0.3887711",
            "sentiment_compound": 0.7351
        },
        {
            "id": "i5btcee",
            "score": 1,
            "text": "So Tour de France is a hoax tournament after all? What a shame to all cyclists around the world.",
            "title_similarity": "0.7189145",
            "sentiment_compound": -0.6369
        },
        {
            "id": "i5btiar",
            "score": 2,
            "text": "Watch Pantani: The Accidental Death of a Cyclist (from 2014) if you can, it'll break your heart.",
            "title_similarity": "0.6491517",
            "sentiment_compound": 0.0
        },
        {
            "id": "i5btrdb",
            "score": 1,
            "text": "If everyone was doing it then why does it matter",
            "title_similarity": "0.06859996",
            "sentiment_compound": 0.0258
        },
        {
            "id": "i5btysg",
            "score": 1,
            "text": "I don’t understand why we can’t have sports that allow doping. They’re already doing it so it isn’t about health issues to them.",
            "title_similarity": "0.4262088",
            "sentiment_compound": 0.2263
        },
        {
            "id": "i5buf3e",
            "score": 1,
            "text": "He wasn't the only cheater, he was the best cheater",
            "title_similarity": "0.3924405",
            "sentiment_compound": 0.5499
        },
        {
            "id": "i5buo7t",
            "score": 1,
            "text": "Our roided up guy beat your roided up guy -Bill Burr.",
            "title_similarity": "0.45765203",
            "sentiment_compound": 0.0
        },
        {
            "id": "i5bupxw",
            "score": 1,
            "text": "Armstrong won… the way he handled getting exposed was bad though",
            "title_similarity": "0.40297416",
            "sentiment_compound": -0.5859
        },
        {
            "id": "i5buvdx",
            "score": 1,
            "text": "Our roided up guy beat their roided up guys.     \n\nIt was a shitshow.",
            "title_similarity": "0.47982702",
            "sentiment_compound": 0.0
        },
        {
            "id": "i5bv1mw",
            "score": 2,
            "text": "Yeah he should still be the winner, dude was the best out of everyone who was also cheating, that’s why Barry Bonds records still count lmao everyone wanted to act like no one suspected McGwire was juicing when he broke the record because they liked him",
            "title_similarity": "0.6018232",
            "sentiment_compound": 0.9094
        },
        {
            "id": "i5bvaij",
            "score": 2,
            "text": "lol @ all the room temperature iq comments saying this makes lance still a winner\n\nthis is how morons like trump and biden get elected",
            "title_similarity": "0.4649672",
            "sentiment_compound": 0.7783
        },
        {
            "id": "i5bvdim",
            "score": 2,
            "text": "It was those races that ended me watching pro cycling.\n\nNot Lance; like many American cyclists, I wasn’t a huge fan, and like most of them, I was more upset about how he brutally took down others who tried to open up the truth than by his doping.\n\nIt was that every single supposed “clean” rider turned out to be a doper in that age. When Jonathan Vaughters, supposedly the poster boy for clean cycling, admitted it, it was the last straw in a huge pile of straws. I went on with cycling as an enthusiast; I ended watching it as a sport.",
            "title_similarity": "0.7892398",
            "sentiment_compound": 0.7428
        },
        {
            "id": "i5bvgao",
            "score": 1,
            "text": "Did he have to give up his prizemoney?\nDoesnt hurt much if you get to keep it right?",
            "title_similarity": "0.28729925",
            "sentiment_compound": 0.4829
        },
        {
            "id": "i5bvnf4",
            "score": 2,
            "text": "Which makes his wins still legit. If everyone was cheating, no one was. He’s still the greatest ever by a 1,000 miles. Idc what anyone says.",
            "title_similarity": "0.5213229",
            "sentiment_compound": 0.4767
        },
        {
            "id": "i5bvsbq",
            "score": 2,
            "text": "Hey if everyone was equally doped up and he still won, I say he deserves his medal",
            "title_similarity": "0.33319008",
            "sentiment_compound": 0.7783
        },
        {
            "id": "i5bvtq1",
            "score": 2,
            "text": "Just call them the dopest race’s ever and give lance the W",
            "title_similarity": "0.3885926",
            "sentiment_compound": 0.0
        },
        {
            "id": "i5bvxf3",
            "score": 1,
            "text": "Just allow full blown substance abuse and doping in all sports. Rip the bandaid off. \n\nLet them freakin die for the sport.",
            "title_similarity": "0.5251126",
            "sentiment_compound": -0.802
        },
        {
            "id": "i5bvztc",
            "score": 1,
            "text": "wow he was in my mind 3-6 days ago. (who got the wins? everyone was doing similar stuff in order to beat him)",
            "title_similarity": "0.5834969",
            "sentiment_compound": 0.8176
        },
        {
            "id": "i5bw28u",
            "score": 1,
            "text": "I'd hate to be the wife of any one of those cyclists.",
            "title_similarity": "0.5029843",
            "sentiment_compound": -0.5719
        },
        {
            "id": "i5bw4fm",
            "score": 2,
            "text": "\"Our doped up guy beat your doped up guy\"\n\nBill Burr was so right",
            "title_similarity": "0.39180213",
            "sentiment_compound": 0.0
        },
        {
            "id": "i5bw569",
            "score": 3,
            "text": "Sound like the wins should still count then haha",
            "title_similarity": "0.09668845",
            "sentiment_compound": 0.8481
        },
        {
            "id": "i5bx02j",
            "score": 1,
            "text": "He was also the only who got banned from the sport,  a lot of others are now commentators, hosts and analysts.",
            "title_similarity": "0.5974711",
            "sentiment_compound": -0.4588
        },
        {
            "id": "i5bxija",
            "score": 2,
            "text": "“Our roided up guy beat your roided up guy!” - Bill Burr",
            "title_similarity": "0.44654074",
            "sentiment_compound": 0.0
        },
        {
            "id": "i5bxl66",
            "score": 1,
            "text": "I mean that's probably more fair than just giving it to who was next in line anyway because the race likely would have been completely different had lance not been there, it's most fair the either rule nobody won, or re-run entirely",
            "title_similarity": "0.56128585",
            "sentiment_compound": 0.883
        },
        {
            "id": "i5bxnio",
            "score": 1,
            "text": "Lol",
            "title_similarity": "-0.17716873",
            "sentiment_compound": 0.4215
        },
        {
            "id": "i5bxnj3",
            "score": 1,
            "text": "Our local bike shop here in Wollongong, Australia has/had a signed Jersey by Lance Armstrong. After the doping scandal, they kept it in a corner of the bathroom near the toilet. Its amazing how the value of something can diminish so rapidly.",
            "title_similarity": "0.68452716",
            "sentiment_compound": 0.5106
        },
        {
            "id": "i5bxsbp",
            "score": 3,
            "text": "So he won fair and square",
            "title_similarity": "0.11428806",
            "sentiment_compound": 0.7609
        },
        {
            "id": "i5bz2am",
            "score": 3,
            "text": "If everyone was doping doesn’t it mean the race was fair and Armstrong is still the winner?",
            "title_similarity": "0.56508815",
            "sentiment_compound": 0.7269
        },
        {
            "id": "i5bzge5",
            "score": 2,
            "text": "Doesn't that mean the playing field was level?",
            "title_similarity": "-0.044382077",
            "sentiment_compound": 0.2023
        },
        {
            "id": "i5c04ct",
            "score": 2,
            "text": "I'm convinced that the committee came down hard on him because they were pissed off that an American was stealing all their thunder. I remember officials coming out and requesting that Lance chill out and let somebody else win.",
            "title_similarity": "0.640189",
            "sentiment_compound": -0.4215
        },
        {
            "id": "i5c0uef",
            "score": 1,
            "text": "If Lance wasn’t such an asshole he wouldn’t have been raked over the coals so bad. Man should have just come out and said yeah, I cheated so did everyone, it’s just what you did in cycling. Trying to ego his way through this just made it so much worse for him.",
            "title_similarity": "0.6921085",
            "sentiment_compound": -0.8741
        },
        {
            "id": "i5c0ulr",
            "score": 1,
            "text": "Bill Burr: \"Hey, our roided up guy beat your roided up guy.\"",
            "title_similarity": "0.42591894",
            "sentiment_compound": 0.0
        },
        {
            "id": "i5c13vj",
            "score": 2,
            "text": "And now the race is actually boring, if people want to safe use steroids for certain sports. Let them, the rest of us don't care.",
            "title_similarity": "0.5582362",
            "sentiment_compound": 0.0956
        },
        {
            "id": "i5c19e7",
            "score": 3,
            "text": "If you’re interested, Tyler Hamilton’s book about riding on USPS with Armstrong and the details of the world of doping is pretty fascinating. “The Secret Race.”\n\nOne of the things he says is that Armstrong honestly believed he wasn’t cheating, that everyone else was doing it. He also wrote that doping doesn’t make you faster, or hurt less, it just makes you able to ride longer and harder, and recover more quickly.",
            "title_similarity": "0.6018581",
            "sentiment_compound": 0.6597
        },
        {
            "id": "i5c1aid",
            "score": 1,
            "text": "Did he take steroids or did he just reoxygenate his blood?",
            "title_similarity": "0.3256083",
            "sentiment_compound": 0.0
        },
        {
            "id": "i5c1h2c",
            "score": 1,
            "text": "Every cyclist is a cheating cunt",
            "title_similarity": "0.49878025",
            "sentiment_compound": -0.7783
        },
        {
            "id": "i5c2bdy",
            "score": 6,
            "text": "So... he won fair and square.",
            "title_similarity": "0.11816063",
            "sentiment_compound": 0.7184
        },
        {
            "id": "i5c2enx",
            "score": 2,
            "text": "Hey why not just make it official?",
            "title_similarity": "-0.013762139",
            "sentiment_compound": 0.0
        },
        {
            "id": "i5c2k1r",
            "score": 1,
            "text": "SPOILE ALERT: EVERY PROFESSIONAL AND OLYMPIC ATHLETE IS ON PEDS",
            "title_similarity": "0.34716728",
            "sentiment_compound": 0.296
        },
        {
            "id": "i5c2kmb",
            "score": 2,
            "text": "I mean, if everyone was doped up, then it was fair, right?",
            "title_similarity": "0.122201696",
            "sentiment_compound": 0.3182
        },
        {
            "id": "i5c2sw5",
            "score": 1,
            "text": "Longer. Faster. Higher.",
            "title_similarity": "-0.016488604",
            "sentiment_compound": 0.0
        },
        {
            "id": "i5c31v9",
            "score": 1,
            "text": "Bill Burr say it better",
            "title_similarity": "0.06766814",
            "sentiment_compound": 0.4404
        },
        {
            "id": "i5c3ch6",
            "score": 1,
            "text": "I don’t care what anyone says. Juice these bikers tf up I wanna see how fast they can go",
            "title_similarity": "0.3619837",
            "sentiment_compound": 0.4939
        },
        {
            "id": "i5c3sa9",
            "score": 4,
            "text": "What a joke.. I’m sure all of the champions before and since are squeaky clean, right? This was one man’s vendetta. Lance is the best Tour de France cyclist in history.",
            "title_similarity": "0.70089126",
            "sentiment_compound": 0.93
        },
        {
            "id": "i5c3spb",
            "score": 3,
            "text": "So Armstrong won in a level plying field then",
            "title_similarity": "0.1768263",
            "sentiment_compound": 0.6096
        },
        {
            "id": "i5c3xkt",
            "score": 1,
            "text": "cycling got ruined by the fashion industry & drug dealers.",
            "title_similarity": "0.62905455",
            "sentiment_compound": -0.4767
        },
        {
            "id": "i5c4343",
            "score": 1,
            "text": "“Our roided up guy beat your roided up guy.” - Bill Burr",
            "title_similarity": "0.43637574",
            "sentiment_compound": 0.0
        },
        {
            "id": "i5c4g1g",
            "score": 2,
            "text": "What I always hate most about all the doping scandals is that people go \"well it's ok because everyone did it\". It's shitting HARD on the athletes that gave it their all and stayed clean, only to end somewhere on the bottom of the rankings.",
            "title_similarity": "0.7530198",
            "sentiment_compound": -0.7034
        },
        {
            "id": "i5c4sb1",
            "score": 2,
            "text": "I love that cycling is so boring and lame that this is the only thing any of us know about it.",
            "title_similarity": "0.54654",
            "sentiment_compound": -0.2156
        },
        {
            "id": "i5c5m3p",
            "score": 1,
            "text": "More of a reason to make a league filled with fully doped up and coked out riders just to see what happens",
            "title_similarity": "0.4601114",
            "sentiment_compound": 0.0
        },
        {
            "id": "i5c5ndy",
            "score": 1,
            "text": "And yet I’m told I’m conspiratorial for saying every Oly Athlete is on the juice lol",
            "title_similarity": "0.3833934",
            "sentiment_compound": 0.4215
        },
        {
            "id": "i5c63u8",
            "score": 3,
            "text": "I'm still of the belief they should just make all results from 1999-2005 stand and just add an asterisk stating that they were doping at the time.  Same with a lot of the baseball records set in that era, most of the top guys were on steroids.",
            "title_similarity": "0.68104637",
            "sentiment_compound": 0.2648
        },
        {
            "id": "i5c69xi",
            "score": 1,
            "text": "Everyone is on gear. NFL, NBA, MLB, gymnastics, all these physical sport athletes are on gear. Wada is pathetic and pointless.",
            "title_similarity": "0.44763115",
            "sentiment_compound": -0.5719
        },
        {
            "id": "i5c6z6y",
            "score": 1,
            "text": "Took me a minute to realize that this article was written in 2012.",
            "title_similarity": "0.31613714",
            "sentiment_compound": 0.0
        },
        {
            "id": "i5c7b9o",
            "score": 1,
            "text": "So can we give it to his missing testicle?",
            "title_similarity": "0.23904261",
            "sentiment_compound": -0.296
        },
        {
            "id": "i5c7rmd",
            "score": 1,
            "text": "I learned probably 20 years ago that there hasn't been a clean Tour de France rider finish in the top 40 in living memory.",
            "title_similarity": "0.6828059",
            "sentiment_compound": -0.1174
        },
        {
            "id": "i5c84i2",
            "score": 1,
            "text": "let them dope, who gives a shit",
            "title_similarity": "0.14159957",
            "sentiment_compound": -0.5574
        },
        {
            "id": "i5c8dam",
            "score": 1,
            "text": "If everyone was doping let him keep his award, he's the best of the dopers.",
            "title_similarity": "0.42521673",
            "sentiment_compound": 0.8271
        },
        {
            "id": "i5c8wxd",
            "score": 1,
            "text": "Yea that's why I wouldn't really care that he was doping because everyone was, if he wasn't such a total asshole and go to lengths to destroy people's professional reputation/lives to keep his cheating secret.",
            "title_similarity": "0.61668074",
            "sentiment_compound": -0.8734
        },
        {
            "id": "i5c93ao",
            "score": 1,
            "text": "So if everyone was roided they were on an even playing field with the competition",
            "title_similarity": "0.17669621",
            "sentiment_compound": 0.2023
        },
        {
            "id": "i5c9cax",
            "score": 3,
            "text": "#So then give him his shit back. If everyone was cheating....Lance still whooped them all!",
            "title_similarity": "0.53139305",
            "sentiment_compound": -0.5983
        },
        {
            "id": "i5c9ebg",
            "score": 1,
            "text": "> because so many riders who finished behind Armstrong were also associated with doping offences.\n\nIt's almost like there was a level playing field... but with drugs.",
            "title_similarity": "0.7215903",
            "sentiment_compound": 0.0781
        },
        {
            "id": "i5c9p1g",
            "score": 2,
            "text": "If they were all at it then wasn't it a level playing field of sortz?",
            "title_similarity": "0.006231103",
            "sentiment_compound": 0.2023
        },
        {
            "id": "i5cb4u6",
            "score": 1,
            "text": "The entire sport is a joke. After the doping, they started getting caught with little electronic motors built into the frame. Pro-wrestling has more respect than cycling.",
            "title_similarity": "0.5888872",
            "sentiment_compound": 0.6801
        },
        {
            "id": "i5cbm61",
            "score": 2,
            "text": "Everyone knows he won. He stomped all over the rest of the dopers, created a ton of excitement for the tour for a decade, and sold a ton of Treks. I was working at a bike shop during this run and we couldn’t keep road bikes in stock. Travis Tygart wanted to make a name for himself and all he did was put a gap in Lance’s trophy case.",
            "title_similarity": "0.71116924",
            "sentiment_compound": 0.836
        },
        {
            "id": "i5cbugu",
            "score": 1,
            "text": "There is an amazing book by Journalist David Walsh called 7 deadly sins about the whole lance saga. An amazing piece of journalism and it really showed you what a horrible person lance is. Think they also made it into a film",
            "title_similarity": "0.61588967",
            "sentiment_compound": 0.2732
        },
        {
            "id": "i5cbvhe",
            "score": 2,
            "text": "What defines “doping” exactly? Caffeine? Adderrall?",
            "title_similarity": "0.19868731",
            "sentiment_compound": 0.0
        },
        {
            "id": "i5ccadl",
            "score": 2,
            "text": "He is still the winner, the goat",
            "title_similarity": "0.24689133",
            "sentiment_compound": 0.5859
        },
        {
            "id": "i5ccj86",
            "score": 1,
            "text": "Yup. Toxic sport. From the top to the bottom. It breeds NPD.",
            "title_similarity": "0.3261901",
            "sentiment_compound": 0.2023
        },
        {
            "id": "i5ccjw0",
            "score": 2,
            "text": "the win isnt tainted if all the competitors were dopers, twas a fair fight",
            "title_similarity": "0.36968803",
            "sentiment_compound": 0.5423
        },
        {
            "id": "i5ccr1s",
            "score": 2,
            "text": "Give this man his titles back… everybody done gone and cheated lol… smh…",
            "title_similarity": "0.524596",
            "sentiment_compound": -0.5106
        },
        {
            "id": "i5cd2ok",
            "score": 1,
            "text": "Tells one everything they need to know about this \"sport\".",
            "title_similarity": "-0.0026290135",
            "sentiment_compound": 0.0
        },
        {
            "id": "i5cd6lg",
            "score": 2,
            "text": "If everybody else was cheating then let him have the wins. He obviously earned it, the drugs just evened out the playing field.",
            "title_similarity": "0.46717742",
            "sentiment_compound": 0.2263
        },
        {
            "id": "i5cdju4",
            "score": 1,
            "text": "Yet they are declaring winners today and they are all still doping. Go figure.",
            "title_similarity": "0.47893795",
            "sentiment_compound": 0.4767
        },
        {
            "id": "i5cdkc4",
            "score": 1,
            "text": "😂 no winners. That’s a good look for the sport. Not that anyone cares about cycling but ya know",
            "title_similarity": "0.42990378",
            "sentiment_compound": 0.0984
        },
        {
            "id": "i5cds8t",
            "score": 1,
            "text": "Makes me feel bad for the first legit natty guy to cross the finish line. He will never know or be recognized as the true victor",
            "title_similarity": "0.627844",
            "sentiment_compound": -0.1779
        },
        {
            "id": "i5cdw8h",
            "score": 2,
            "text": "Why not have two leagues, a doping league and a clean league. Have two sets of records. I know people would probably try to dope in the clean league, but at least the the world could give a collective \"really guy?\"\n\nIn that system, racers have to choose up front how they want to be remembered. It's completely within the rules to be a doper and win the doper league, but that obviously detracts from the feeling of success.",
            "title_similarity": "0.62084246",
            "sentiment_compound": 0.9446
        },
        {
            "id": "i5ce838",
            "score": 1,
            "text": "Good, fuckin’ cheaters",
            "title_similarity": "0.22607914",
            "sentiment_compound": 0.0
        },
        {
            "id": "i5ceigz",
            "score": 2,
            "text": "... Which means Lance IS THE WINNER  since they all were cheating, it was a level playing field.",
            "title_similarity": "0.43326384",
            "sentiment_compound": 0.4084
        },
        {
            "id": "i5cel9a",
            "score": 2,
            "text": "The doping committee's decision to save samples until more accurate testing was available made the difference. It took years, but the cheats were caught and stripped of records and titles.",
            "title_similarity": "0.7331952",
            "sentiment_compound": -0.3818
        },
        {
            "id": "i5cez2y",
            "score": 1,
            "text": "I just read up on HGH and EPO that stuff is crazy! This guy said that the HGH cleared up sun spots and even a scar on his forehead. The EPO he could ride 200 miles and still feel fresh. Lost 6lbs of fat and put on 12lbs of muscle without even wanting to put the muscle on",
            "title_similarity": "0.6751396",
            "sentiment_compound": -0.3164
        },
        {
            "id": "i5cf1la",
            "score": 1,
            "text": "It was a perfect opportunity to go “yea, this can just be a hobby instead of a sport”. But they didn’t go with my suggestion.",
            "title_similarity": "0.29919153",
            "sentiment_compound": 0.5023
        },
        {
            "id": "i5cfnzn",
            "score": 1,
            "text": "[I’m with Bill Burr on this one.](https://youtu.be/O9YL04v-J5U)",
            "title_similarity": "0.09690791",
            "sentiment_compound": 0.0
        },
        {
            "id": "i5chjr9",
            "score": 1,
            "text": "Kind of like Ben Johnson and his 9.79 world record, pulling Carl Lewis across in the second fastest world time ever.  Lewis played the innocent but he was just as dirty.",
            "title_similarity": "0.60433304",
            "sentiment_compound": -0.1779
        },
        {
            "id": "i5chou7",
            "score": 1,
            "text": "Now do American football!",
            "title_similarity": "0.12471178",
            "sentiment_compound": 0.0
        },
        {
            "id": "i5ci3gz",
            "score": 1,
            "text": "Our doped up guy beat their doped up guys in seven straight Tour de France wins.",
            "title_similarity": "0.72685903",
            "sentiment_compound": 0.6808
        },
        {
            "id": "i5ci69m",
            "score": 1,
            "text": "Well if everyone is doing it wouldn't it be fair? The Armstrong Paradox",
            "title_similarity": "0.1726991",
            "sentiment_compound": -0.0675
        },
        {
            "id": "i5cibgx",
            "score": 1,
            "text": "So there exists a person who was clean and finished the race but we'll never know",
            "title_similarity": "0.46080253",
            "sentiment_compound": 0.2144
        },
        {
            "id": "i5cij25",
            "score": 1,
            "text": "Our roided up guy beat your roided up guy",
            "title_similarity": "0.3794711",
            "sentiment_compound": 0.0
        },
        {
            "id": "i5cj0am",
            "score": 1,
            "text": "That means that Earl Edwards who finished in 124134th place but was the only non-doper is the winner for those 7 years",
            "title_similarity": "0.6406491",
            "sentiment_compound": 0.7351
        },
        {
            "id": "i5cj2y4",
            "score": 1,
            "text": "Good.",
            "title_similarity": "-0.22668527",
            "sentiment_compound": 0.4404
        },
        {
            "id": "i5cjh3i",
            "score": 1,
            "text": "That's what you get with too famous name. People'll do anything to be as good as Neil or Louis Armstrong. So sad, really.",
            "title_similarity": "0.5307719",
            "sentiment_compound": -0.2712
        },
        {
            "id": "i5cjp31",
            "score": 2,
            "text": "If everyone is doping, is it cheating? There should just be two categories, on drugs, off drugs.",
            "title_similarity": "0.41297647",
            "sentiment_compound": -0.5574
        },
        {
            "id": "i5cjxel",
            "score": 1,
            "text": "Bicyclists Are Untrustworthy\n\n- Jeremy Clarkson",
            "title_similarity": "0.4198585",
            "sentiment_compound": 0.0
        },
        {
            "id": "i5ck593",
            "score": 1,
            "text": "If everyone is on drugs then no one is on drugs.",
            "title_similarity": "0.3561133",
            "sentiment_compound": -0.296
        },
        {
            "id": "i5ck59t",
            "score": 2,
            "text": "If he was \"beating\" other doped riders, that's got to count for something.",
            "title_similarity": "0.32831317",
            "sentiment_compound": -0.4588
        },
        {
            "id": "i5ckhji",
            "score": 2,
            "text": "nobody should take this cheater-event serious anymore.",
            "title_similarity": "0.3668881",
            "sentiment_compound": -0.0772
        },
        {
            "id": "i5ckzjn",
            "score": 2,
            "text": "Bill Burr addresses this perfectly in a classic Conan clip [https://youtu.be/O9YL04v-J5U](https://youtu.be/O9YL04v-J5U)",
            "title_similarity": "0.23082227",
            "sentiment_compound": 0.7184
        },
        {
            "id": "i5cmit3",
            "score": 3,
            "text": "That's the reason why I found it hilarious people believed Lance was drug free. There were tons of dudes behind him getting popped. He was surrounded by drug users. People honestly thought that this guy was *smoking* the competition without PEDs. It was absurd.",
            "title_similarity": "0.6387423",
            "sentiment_compound": 0.8402
        },
        {
            "id": "i5cmsfw",
            "score": 2,
            "text": "Cheaters suck. Way to ruin your own sport and make everyone lose interest in you. \n\nFuck Armstrong",
            "title_similarity": "0.5817169",
            "sentiment_compound": -0.9153
        },
        {
            "id": "i5cnqzw",
            "score": 3,
            "text": "Lance tried to ruin people's lives. Fuck him.",
            "title_similarity": "0.49216643",
            "sentiment_compound": -0.8074
        },
        {
            "id": "i5cnvpx",
            "score": 2,
            "text": "So Lance is the winner? He's the best doper?",
            "title_similarity": "0.30039814",
            "sentiment_compound": 0.8541
        },
        {
            "id": "i5cod1k",
            "score": 1,
            "text": "TLDR all cyclists dope. Crucifying Lance isn’t going to change anything. You can’t strip history. He won and he cheated. All athletes are cheaters. Under this premise you won’t be disappointed.",
            "title_similarity": "0.5936786",
            "sentiment_compound": -0.6808
        },
        {
            "id": "i5cow9z",
            "score": 1,
            "text": "If they all took dope and he won doesn’t that still make him the winner?",
            "title_similarity": "0.4669755",
            "sentiment_compound": 0.8176
        },
        {
            "id": "i5coxtr",
            "score": 1,
            "text": "That was always the dumbest part of this \"scandal.\" Lance maintained his innocence *even as* everyone around him was getting tagged for doping.\n\n\"So you're not doing, Lance?\"\n\n\"No way, bro.\"\n\n\"Cuz you beat Ullrich, and Contador, and Leiphemier, and they were all cheating a lot.\"\n\n\"Wild story, man, my dedication to the sport is just that extreme.\"\n\n\"Well, ok, but you also were the strongest team rider and your team was *all* cheating.\"\n\n\"Yeah man, I'm just real good at riding bikes... man\"\n\n\"They also all said you got them started.\"\n\n\"Crazy times, friend, crazy times.\"",
            "title_similarity": "0.70649916",
            "sentiment_compound": 0.1429
        },
        {
            "id": "i5cpaor",
            "score": 1,
            "text": "If everyone was doping, doesn’t that make it fair?",
            "title_similarity": "0.3635469",
            "sentiment_compound": 0.3182
        },
        {
            "id": "i5cpgl8",
            "score": 1,
            "text": "I'm glad we all collectively realized that bike racing is a sport for rich dope fiends... and also boring to watch.",
            "title_similarity": "0.51307905",
            "sentiment_compound": 0.6486
        },
        {
            "id": "i5cppe7",
            "score": 1,
            "text": "All them mfs were cheating at riding bikes dawg lmao",
            "title_similarity": "0.64657724",
            "sentiment_compound": 0.0772
        },
        {
            "id": "i5cpvb3",
            "score": 2,
            "text": "I recall a time I was on a longer ride with someone who competed in the Sydney Olympics and placed in the mid teens in the road race. He jokingly theorized he could almost make the podium if all of the dopers were actually dq'd. This was a year or two before the Lance debacle. It was a silly conversation, but was actually a pretty serious topic.",
            "title_similarity": "0.72305006",
            "sentiment_compound": 0.5994
        },
        {
            "id": "i5cqmtm",
            "score": 1,
            "text": "I think it's very arguable that Armstrong did, in fact, earn those wins if everyone else was doping too.",
            "title_similarity": "0.5758025",
            "sentiment_compound": 0.3415
        },
        {
            "id": "i5cqrxv",
            "score": 1,
            "text": "Was it before or after he went to Moon?",
            "title_similarity": "0.2508827",
            "sentiment_compound": 0.0
        },
        {
            "id": "i5cqzca",
            "score": 2,
            "text": "There has been rampant doping at the TdF since at least the 1930s. There is pretty much no winner that has had a wholly clean career that I've ever heard about. Doping has changed dramatically over the years but it's always been there in all professional sports.",
            "title_similarity": "0.7557089",
            "sentiment_compound": 0.2297
        },
        {
            "id": "i5cr25c",
            "score": 2,
            "text": "So then he still won - a doper beat other dopers. That just levels the field (not an Armstrong fan but this seems logical in a sport where apparently no one had any integrity).",
            "title_similarity": "0.519362",
            "sentiment_compound": 0.3546
        },
        {
            "id": "i5crau4",
            "score": 1,
            "text": "Good. Fuck Armstrong and fuck professional bike riding.",
            "title_similarity": "0.38003546",
            "sentiment_compound": -0.6249
        },
        {
            "id": "i5crofj",
            "score": 3,
            "text": "At this point we should just have a league dedicated to athletes being doped in as possible and see what happens. Their records won’t count because they’re enhanced, but just for entertainment reasons",
            "title_similarity": "0.44242",
            "sentiment_compound": 0.6908
        },
        {
            "id": "i5cruxi",
            "score": 1,
            "text": "Lie Strong…",
            "title_similarity": "-0.06758271",
            "sentiment_compound": 0.0
        },
        {
            "id": "i5csm79",
            "score": 1,
            "text": "Still impressive to win that many considering everyone was doping.",
            "title_similarity": "0.46756625",
            "sentiment_compound": 0.7964
        },
        {
            "id": "i5csx3p",
            "score": 1,
            "text": "Neat how they heaped it all on Armstrong and got away without having to do any public introspection",
            "title_similarity": "0.3405526",
            "sentiment_compound": 0.4588
        },
        {
            "id": "i5ct2y7",
            "score": 1,
            "text": "I got into amateur races in cycling and it was terrible. Everyone was on every kind of drug for every kind of thing, uppers, pain killers, IVs, drugs for the drugs. It sucked any fun to be had out of it.",
            "title_similarity": "0.73672926",
            "sentiment_compound": -0.886
        },
        {
            "id": "i5ctbcv",
            "score": 1,
            "text": "Then just allow doping and consider it part of the sport",
            "title_similarity": "0.20440266",
            "sentiment_compound": 0.2263
        },
        {
            "id": "i5ctiky",
            "score": 1,
            "text": "How crazy is doping in cycling still? At least every few months we get a press release from USA Cycling about a masters amateur cyclist, like in their 50s being popped for PEDs.\n\nLike dentists who race on weekends so into it that they're shooting up.",
            "title_similarity": "0.72726357",
            "sentiment_compound": 0.3818
        },
        {
            "id": "i5ctnlg",
            "score": 1,
            "text": "yep, everybody forgets that part. Cycling is notorious for drug use. I remember someone at the time saying that it really changed nothing because of that. Everybody else had access to the same drugs he was using and he still beat them, but they were after him for years because being beat by an American over and over again really pissed them off.",
            "title_similarity": "0.75153255",
            "sentiment_compound": -0.822
        },
        {
            "id": "i5ctqny",
            "score": 1,
            "text": "If everyone is cheating, is it even cheating anymore?",
            "title_similarity": "0.32076198",
            "sentiment_compound": -0.802
        },
        {
            "id": "i5cttdm",
            "score": 1,
            "text": "So them why is it even a problem. Looks like an even playing field to me?",
            "title_similarity": "0.07680241",
            "sentiment_compound": 0.1531
        },
        {
            "id": "i5cunqp",
            "score": 1,
            "text": "[According to NBC News, the report said of Armstrong that “it was not enough that his teammates give maximum effort on the bike, he also required that they adhere to the doping program outlined for them or be replaced.”](https://bleacherreport.com/articles/1516420-lance-armstrong-is-the-dirtiest-cheater-in-sports-history)",
            "title_similarity": "0.73786116",
            "sentiment_compound": 0.0
        },
        {
            "id": "i5cv7yg",
            "score": 3,
            "text": "\"Our roided up guy beat your roided up guy\"\n\n-Bill Burr",
            "title_similarity": "0.44474432",
            "sentiment_compound": 0.0
        },
        {
            "id": "i5cvg6j",
            "score": 1,
            "text": "All pro athletes are juicing almost literally all of them. We need to start being realistic about this because it's creating issues with expectations on health and fitness. Every single body builder beyond an entry level is juicing but we don't address it because they can pass a test. Every muscled out actor we grew up watching, juiced to the gills and we just pretend it's \"good genetics\" and \"advanced training\". Medical science is clear on the ability for the body too synthesize protein into muscle. Unless you have a very unique hormone issue that creates big weak muscles you do not gain lean muscle at these accelerated rates. We're just lying to people growing up thinking this is natural.",
            "title_similarity": "0.58855677",
            "sentiment_compound": 0.7956
        },
        {
            "id": "i5cwuc3",
            "score": 1,
            "text": "Lol, they all dope....but it's not the type that people associate steroids with.... It's recovery roids, everyone should watch the documentary \"Bigger, Stronger, Faster\". You'll learn a lot",
            "title_similarity": "0.49384683",
            "sentiment_compound": 0.6597
        },
        {
            "id": "i5cxds1",
            "score": 2,
            "text": "We can thank Greg Lamond for exposing Armstrong for the colossal asshole that he is. The way he went after Lamond was disgusting. Glad he got his come upping.",
            "title_similarity": "0.5306623",
            "sentiment_compound": 0.0
        },
        {
            "id": "i5cxgsv",
            "score": 2,
            "text": "Hey, a guy who comes into my Local Bike Shop says he rode bikes on the moon with Lance Armstrong",
            "title_similarity": "0.41905373",
            "sentiment_compound": 0.0
        },
        {
            "id": "i5cygv4",
            "score": 1,
            "text": "Then why strip him of the titles if he didn’t have an unfair advantage over his also doped up peers? That’s the whole purpose of the rule is it not?",
            "title_similarity": "0.48192784",
            "sentiment_compound": -0.3527
        },
        {
            "id": "i5cyi6x",
            "score": 1,
            "text": "Ah yes. The infamous 7 times no one won Tour de France",
            "title_similarity": "0.7897732",
            "sentiment_compound": -0.3607
        },
        {
            "id": "i5czbo2",
            "score": 2,
            "text": "Sports should just allow cheating, create a new category for people to cheat all they want, then a separate clean category. Have a drug category, cybernetic category, another category where they're powered by gods and other magic...",
            "title_similarity": "0.46630603",
            "sentiment_compound": -0.1531
        },
        {
            "id": "i5czniy",
            "score": 1,
            "text": "If every winner is a cheater, is it really cheating or just being a competitor?",
            "title_similarity": "0.46719393",
            "sentiment_compound": -0.5563
        },
        {
            "id": "i5d0tky",
            "score": 1,
            "text": "since they were all doping seems like an even playing field. You don't see MLB taking away HR",
            "title_similarity": "0.49914664",
            "sentiment_compound": 0.5106
        },
        {
            "id": "i5d1cek",
            "score": 2,
            "text": "I remember Greg LeMond being vilified and Trek yanking his bikes because he was so adamant about Lance cheating",
            "title_similarity": "0.5810974",
            "sentiment_compound": -0.5574
        },
        {
            "id": "i5d1hxp",
            "score": 1,
            "text": "In the 80's a sprinter Ben Johnson lost his world record and gold in the 100 meter sprint due to a positive test.\n\nHis coach later testified:\n\nFrancis, a former Canadian track champion in the early 1970s, testified that he himself had used steroids in competition in 1973, and again in 1985 to see what effect they were having on his athletes.\n\nAs a coach, Francis said, he had concluded by the late 1970s that steroid use was epidemic in international competition and that Canadian runners had no choice but to begin using the banned substances if they expected to keep up.\n\nHere's the race:\n\nhttps://youtu.be/gPTYbZvURl4",
            "title_similarity": "0.7590201",
            "sentiment_compound": -0.3612
        },
        {
            "id": "i5d2ide",
            "score": 1,
            "text": "Everyone is on gear in almost every pro sport, he just won the most",
            "title_similarity": "0.39678383",
            "sentiment_compound": 0.5719
        },
        {
            "id": "i5d2sqe",
            "score": 1,
            "text": "So the races were fair... if the other top competitors were on the same stuff. \n\nIt was even field, he still was the best.",
            "title_similarity": "0.3362198",
            "sentiment_compound": 0.8074
        },
        {
            "id": "i5d2z20",
            "score": 1,
            "text": "I mean. If they all dopped and he beat them all. Didn't he win fairly?",
            "title_similarity": "0.52386355",
            "sentiment_compound": -0.4717
        },
        {
            "id": "i5d4hy3",
            "score": 1,
            "text": "In other words, he still won.",
            "title_similarity": "0.0497064",
            "sentiment_compound": 0.5719
        },
        {
            "id": "i5d4pbw",
            "score": 1,
            "text": "“Our best doped up guy beat your best doped up guy, fair and square!”\n\n-Bill Burr",
            "title_similarity": "0.5405119",
            "sentiment_compound": 0.8999
        },
        {
            "id": "i5d795n",
            "score": 1,
            "text": "Really feel bad for the athletes that do it the right way. Some assholes who cheated their way to glory, get all the accolades, money, sponsorship. Not sure what is a possible legally, but whenever anyone is found to be doping, they should be forced to hand over atleast a percentage of of their networth to the honest finishers. Cheat your way to the top, get stripped of your titles, do an interview and write a book, star in a Netflix movie maybe is their MO.  Seriously my blood boils.",
            "title_similarity": "0.6929944",
            "sentiment_compound": -0.4714
        },
        {
            "id": "i5d8fwr",
            "score": 1,
            "text": "Just put an asterisk by their name and be done with it. They’re almost all using something.",
            "title_similarity": "0.2036401",
            "sentiment_compound": 0.0
        },
        {
            "id": "i5d8llk",
            "score": 1,
            "text": "Guess what, most top athletes take PEDs if they can avoid detection. We've only got an illusion of some sports being free of it, because a good portion of the viewers wouldn't like it.\n\nI'm with the team that them being doped up would be more fun to watch. Break the human limits, do what's not supposed to be possible. That's fun.\n\nI wanna watch World's strongest man with 200kg dudes, not 140kg ones.",
            "title_similarity": "0.5329555",
            "sentiment_compound": 0.9297
        },
        {
            "id": "i5d8st8",
            "score": 1,
            "text": "So stupid. Like confiscating Reggie Bush’s Heisman cause of him getting benefits, when we all *saw* him dominate that season and deserve that Heisman, and plenty (if not all) other top players were getting those same benefits at their schools.",
            "title_similarity": "0.647333",
            "sentiment_compound": 0.2945
        },
        {
            "id": "i5dhbjj",
            "score": 1,
            "text": "I quit watching it after that. It's all a dirty sport to me now.",
            "title_similarity": "0.42782462",
            "sentiment_compound": -0.4404
        },
        {
            "id": "i5dq0d4",
            "score": 1,
            "text": "I look at him like I look at Barry Bonds. Did he cheat? yes. Was everyone cheating? yes was he the best out of all the cheaters? Yes. does he belong in the convo for the best ever? yes. I cant tell you who had more of an advantage from doping but I know everyone was doing it.",
            "title_similarity": "0.6670231",
            "sentiment_compound": 0.8268
        },
        {
            "id": "i5drti2",
            "score": 1,
            "text": "This is why I still consider him a winner. If everyone is cheating and he cheated best of all... Well that's worth something. Maybe baseball should take a hint from cycling. People might actually watch it.",
            "title_similarity": "0.5468442",
            "sentiment_compound": 0.6249
        },
        {
            "id": "i5dvucz",
            "score": 1,
            "text": "It was a time everyone was doing it. Thé ones who not, had absolutely no chances.",
            "title_similarity": "0.2510619",
            "sentiment_compound": -0.2703
        },
        {
            "id": "i5e1rz7",
            "score": 2,
            "text": "TIL the grass is green. Come on this is such basic common knowledge, anyone who has seen this topic knows this happened. As far as Lance is concerned he didn't deserve the scrutiny he got.",
            "title_similarity": "0.36677286",
            "sentiment_compound": 0.0
        },
        {
            "id": "i5ed1l8",
            "score": 1,
            "text": "Cheaters always going to cheat!",
            "title_similarity": "0.35905263",
            "sentiment_compound": -0.7345
        },
        {
            "id": "i5edxqk",
            "score": 2,
            "text": "It reminds me about this story by Albert Londres, where he met some cyclists on the Tour de France showing the various drugs they're using in the run.",
            "title_similarity": "0.5317532",
            "sentiment_compound": 0.0
        },
        {
            "id": "i5ekgqd",
            "score": 1,
            "text": "I mean at that point it’s a fair fight, no?",
            "title_similarity": "0.102875136",
            "sentiment_compound": -0.0772
        },
        {
            "id": "i5ewqq5",
            "score": 2,
            "text": "\"Our roided up guy beat your roided up guy!\"\n\n-Bill Burr",
            "title_similarity": "0.4627511",
            "sentiment_compound": 0.0
        },
        {
            "id": "i5fc5it",
            "score": 1,
            "text": "How did I just learn this?",
            "title_similarity": "-0.06577729",
            "sentiment_compound": 0.0
        },
        {
            "id": "i5ha99r",
            "score": 1,
            "text": "I say let them do whatever drugs they want. I wanna see what humans are really capable of physically.",
            "title_similarity": "0.1447763",
            "sentiment_compound": 0.4927
        },
        {
            "id": "i5pn9wx",
            "score": 1,
            "text": "Damn, what a clusterfuck of epic proportions",
            "title_similarity": "0.24518916",
            "sentiment_compound": -0.4019
        },
        {
            "id": "i5qbe0u",
            "score": 1,
            "text": "You cant even compete in pro sports because everyone is juicing",
            "title_similarity": "0.5866642",
            "sentiment_compound": 0.0
        },
        {
            "id": "i5rp14m",
            "score": 2,
            "text": "Don’t get blinded to the fact Armstrong was a piece of shit who was happy to destroy lives to hide his career of cheating, that line of well he did what the others was doing just doesn’t wash",
            "title_similarity": "0.5746834",
            "sentiment_compound": -0.765
        },
        {
            "id": "i5tf7dt",
            "score": 3,
            "text": "Is nobody going to talk about how unfair and misleading it was that the UCI didn’t award the fastest non-doping riders. The committee rationalizes “while this might appear harsh for those who rode clean, they would understand there was little honor to be gained in reallocating places.”\n\n*“Little honor”*! By not honoring the clean winners, they’re honoring the cheaters! It makes everybody think that literally nobody was clean and Armstrong won in spirit!",
            "title_similarity": "0.6750927",
            "sentiment_compound": 0.8891
        },
        {
            "id": "i5tkz42",
            "score": 1,
            "text": "Just allow it! Who cares?! Let everyone do as they please. They can deal with the problems later in their life.",
            "title_similarity": "0.14385694",
            "sentiment_compound": 0.6229
        },
        {
            "id": "i62qw24",
            "score": 1,
            "text": "The officials: \"What kind of fool do you take me for? He's Squidward, he's Squidward, you're Squidward? *I'm* Squidward! Are there any other 'Squidwards' I should know about?\n\nGary: *baritone meow*.\n\nThe officials: I'm out of here.",
            "title_similarity": "0.50496435",
            "sentiment_compound": -0.6155
        },
        {
            "id": "i63di0h",
            "score": 1,
            "text": "Wouldn’t the go to the guy who didn’t dope and finished?",
            "title_similarity": "0.22646144",
            "sentiment_compound": 0.0
        },
        {
            "id": "i6v9ftm",
            "score": 1,
            "text": "But... He raised millions for cancer, right? Did the end justify the means?",
            "title_similarity": "0.5588979",
            "sentiment_compound": -0.8156
        }
    ]
}