{
    "TIL that Outback Steakhouse was founded in Tampa, FL by four Americans who had never visited Australia. They simply saw an opportunity to ride the wave of popularity of all things Australian following the 1986 film Crocodile Dundee. Their concept was “American food and Australian fun.”\n": [
        {
            "id": "i5zuhho",
            "score": 3,
            "text": "What I'm more confused about is that there are some franchises in Australia still... Their steaks are shit. I've had better steaks at shitty hole in the wall pubs up in the NT while I was out on the piss.",
            "title_similarity": "0.67194414",
            "sentiment_compound": -0.8622
        },
        {
            "id": "i5zyjg6",
            "score": -5,
            "text": "The \"Australian\" accent of the voiceover in the 1990s commercials was horrendously bad.",
            "title_similarity": "0.42698613",
            "sentiment_compound": -0.7506
        },
        {
            "id": "i60b1aa",
            "score": -1,
            "text": "The recipes are all cajun/creole, the house wine is The Federalist, and the only Australian anything on the menu is the Foster's\n\n*Lmao nvm",
            "title_similarity": "0.6366689",
            "sentiment_compound": 0.5994
        },
        {
            "id": "i60gwh7",
            "score": 1,
            "text": "This is one of the reasons I despise Outback steakhouse. This and its too damn dark in those restaurants.  I want to be able to see the shitty food they charge too much for.",
            "title_similarity": "0.47840288",
            "sentiment_compound": -0.8126
        },
        {
            "id": "i5zvigk",
            "score": 46,
            "text": "The bloomin' onion is Outbacks only redeemable quality.",
            "title_similarity": "0.35398743",
            "sentiment_compound": 0.0
        },
        {
            "id": "i5zz7ih",
            "score": -4,
            "text": "I worked there for twenty years and never got a paid break.",
            "title_similarity": "0.43479073",
            "sentiment_compound": 0.0
        },
        {
            "id": "i60z42w",
            "score": -2,
            "text": "I don’t particularly like their steaks but I’ll agree they’re cheap. My gf loves the place. I use outback for one thing and one thing only. Go there and have a decent steak, steamed broccoli and dark beer. I only go to it in Las Vegas. That combo gives me the smelliest farts you could ever imagine. Then I hit the poker tables and the bad gas throws everyone off their game and I usually make a killing.",
            "title_similarity": "0.66723704",
            "sentiment_compound": -0.3926
        },
        {
            "id": "i60m1mv",
            "score": 0,
            "text": "And microwaved steaks! \n\nWorst steak I have ever had",
            "title_similarity": "0.49908623",
            "sentiment_compound": -0.6588
        },
        {
            "id": "i605omo",
            "score": 7,
            "text": "this is obvious to any Australian visiting the franchise\n\nI was in japan and went for a laugh, the menu stated \"Queensland Salad\" there's nothing about Queensland notable for salads other than maybe methamphetamines",
            "title_similarity": "0.7550832",
            "sentiment_compound": 0.5574
        },
        {
            "id": "i60dby1",
            "score": 2,
            "text": "Best steak I’ve ever had was at one of these in Orlando. Admittedly I haven’t had it in many American restaurants as I’ve only been cpl of times. But I’ve had many across the UK. And that one in the Outback Steakhouse was by far the best. I’m no fan of America, but you yanks really do know your stuff when it comes to red meat.",
            "title_similarity": "0.7430482",
            "sentiment_compound": 0.788
        },
        {
            "id": "i60uvjd",
            "score": -3,
            "text": "Story time!\n\nI once went to outback and ordered a steak cooked medium well. About 5 minutes later the server returns and tells me, and I quote: \"I'm sorry sir, we don't have any medium well steaks. \" \n\nAs you can imagine, I was completely confused. I asked what they were talking about and was told that all the steaks are precooked to a certain level of doneness then frozen and are not cooked fresh onsite. \n\nWe left and never went back. My life is as lie. I can't help but wonder if all steakhouses are that way.",
            "title_similarity": "0.7000238",
            "sentiment_compound": -0.1775
        },
        {
            "id": "i608f3l",
            "score": 1,
            "text": "This was also(supposedly) predated by a restaurant with the same theme and name located in Branson, MO. Though their steaks are all grass fed cattle raised locally, so they are both a little more expensive but definitely worth it if you are for some reason stuck in that jesus freak tourist trap of a town.",
            "title_similarity": "0.6012419",
            "sentiment_compound": -0.4596
        },
        {
            "id": "i60d01x",
            "score": -1,
            "text": "Texas Roadhouse has nothing to do with Texas",
            "title_similarity": "0.3626693",
            "sentiment_compound": 0.0
        },
        {
            "id": "i5zwvuo",
            "score": 5,
            "text": "[deleted]",
            "title_similarity": "-0.016461087"
        },
        {
            "id": "i5zyo51",
            "score": 32,
            "text": "And that’s exactly what it feels like when you’re there. An American business where American staff serve American food to American customers… but with our country’s name on the sign outside.\n\nMost of the things on the menu like “shrimp” and “fries” aren’t called that in Australia by the way 😂",
            "title_similarity": "0.69285375",
            "sentiment_compound": 0.8338
        },
        {
            "id": "i605i6m",
            "score": 6,
            "text": "Outback used to have legitimately good food. I remember I had a friend who worked there as a line cook and he said everything there was made from scratch. By the time he left, they were making more and more stuff from a bag. Now, if I walked in and ordered from the menu not knowing where it was, I would’ve thought it was an Applebee’s. Huge disappointment because their food used to be good.",
            "title_similarity": "0.5777087",
            "sentiment_compound": 0.7906
        },
        {
            "id": "i605wev",
            "score": 4,
            "text": "Can confirm, growing up in the US late 80s early 90s, Australia was the shit",
            "title_similarity": "0.5049136",
            "sentiment_compound": 0.6908
        },
        {
            "id": "i6013zh",
            "score": 0,
            "text": "[deleted]",
            "title_similarity": "-0.016461087"
        },
        {
            "id": "i60e9ji",
            "score": 0,
            "text": "No wonder the VO guy on the commercials sounds like a caricature and not any real Aussie I've ever heard",
            "title_similarity": "0.46198088",
            "sentiment_compound": 0.0772
        },
        {
            "id": "i60h6re",
            "score": 0,
            "text": "I’ve never actually thought any of the food was “Australian food” I just thought maybe an Australian founded it. Actually I never put much thought into it, I just knew I loved the blooming onion and the way they season their steaks.",
            "title_similarity": "0.7522131",
            "sentiment_compound": 0.5994
        },
        {
            "id": "i60hb84",
            "score": 0,
            "text": "So another complete fraud",
            "title_similarity": "0.09708044",
            "sentiment_compound": -0.6204
        },
        {
            "id": "i60jztu",
            "score": 0,
            "text": "Eaten there three times, disappointed each time. Not going back",
            "title_similarity": "0.34591556",
            "sentiment_compound": -0.4767
        },
        {
            "id": "i60qino",
            "score": 0,
            "text": "Outback steak house: come for the Australian theme, stay because your a racist American and we don't hire or work with Australians.",
            "title_similarity": "0.7013284",
            "sentiment_compound": -0.6124
        },
        {
            "id": "i60tp2s",
            "score": 0,
            "text": "As a university of Kentucky business school graduate, that school is still riding this shit. I believe Sullivan graduated from UK and they tout the shit out of that. \n\nLike, it was given to us as a case study in how to be good at marketing. \n\nThis is why humanity is on the way out lol",
            "title_similarity": "0.557024",
            "sentiment_compound": 0.7543
        },
        {
            "id": "i60xz1u",
            "score": 0,
            "text": "Op listens to cumtown",
            "title_similarity": "0.0023384467",
            "sentiment_compound": 0.0
        },
        {
            "id": "i611gnk",
            "score": 0,
            "text": "This is peak American capitalism.",
            "title_similarity": "0.32209736",
            "sentiment_compound": 0.0
        },
        {
            "id": "i618mq8",
            "score": 0,
            "text": "Just realized Outback Steakhouse is supposed to be Australian \n\nI’ve been to them multiple times and always thought it was some kinda of Texan thing lol",
            "title_similarity": "0.7215706",
            "sentiment_compound": 0.4215
        },
        {
            "id": "i62fid9",
            "score": 0,
            "text": "I had an Australian email pen pal in the 90s, and told him about it. He couldn’t believe “Sheilas” was on the ladies bathroom door because it was a pretty offensive term for women at the time. Other than that, he thought it was hilarious how not Australian it was.",
            "title_similarity": "0.61173433",
            "sentiment_compound": 0.4404
        },
        {
            "id": "i62hkvx",
            "score": 0,
            "text": "I had no idea outback was even Australian themed",
            "title_similarity": "0.41036946",
            "sentiment_compound": -0.296
        },
        {
            "id": "i62yqys",
            "score": 0,
            "text": "that explains the trashy tastes and textures of the food.",
            "title_similarity": "0.21404815",
            "sentiment_compound": 0.0
        },
        {
            "id": "i63esob",
            "score": 0,
            "text": "This sort of thing pisses me off. Same with Hagen Daz ice cream, which is an American brand that has nothing to do with Europe and has a fake Germanic sounding name. Same with SuperDry, which takes being Japanese but is a British clothing brand. Same with Paul Fleming's Chinese restaurant, P.F. Chang's.\n\nThis isn't even \"cultural appropriation\", it's cultural identity appropriation, but without actually having any standing to represent the culture whose identity is being appropriated.",
            "title_similarity": "0.5950016",
            "sentiment_compound": -0.4398
        },
        {
            "id": "i64chi7",
            "score": 0,
            "text": "The very first KFC was established in Salt Lake City, Utah. I always think of this fact when I hear factoids like yours.",
            "title_similarity": "0.49875268",
            "sentiment_compound": 0.3612
        },
        {
            "id": "i64crtq",
            "score": 0,
            "text": "My vote for the most unsurprising news of the day.",
            "title_similarity": "0.29802358",
            "sentiment_compound": 0.0
        },
        {
            "id": "i5zu2tv",
            "score": 23,
            "text": "still waiting for them to do rotisserie koala",
            "title_similarity": "0.38993806",
            "sentiment_compound": 0.0
        },
        {
            "id": "i601d8s",
            "score": -13,
            "text": "C+ food, except for the steaks which seem more like D+ quality.  Even the bloomin onion always seems too doughy.",
            "title_similarity": "0.4951883",
            "sentiment_compound": 0.4201
        },
        {
            "id": "i60a4c1",
            "score": -1,
            "text": "Haven't been there in like 10 years. Stopped going when I went there for a steak and they didn't have any on the menu. If I wanted sirloin I'd order a burger.",
            "title_similarity": "0.62295926",
            "sentiment_compound": 0.1531
        },
        {
            "id": "i60dbhj",
            "score": 1,
            "text": "I never made the connection that it related in any way to Australia.",
            "title_similarity": "0.3801093",
            "sentiment_compound": 0.0
        },
        {
            "id": "i60dm2o",
            "score": 1,
            "text": "Why is this not surprising? Just like most things in America, it’s fucking fake.",
            "title_similarity": "0.29120913",
            "sentiment_compound": -0.7443
        },
        {
            "id": "i614lni",
            "score": 1,
            "text": "If you want food worse than Chili's and more expensive, then go to outback and buy a fosters like a fucking tourist",
            "title_similarity": "0.52007574",
            "sentiment_compound": -0.0772
        },
        {
            "id": "i61rwin",
            "score": 1,
            "text": "As a Brit, Outback is the one chain I always seek out when I’m in the US. I think about Bloomin Onions daily!!\n\nWas in Ft Lauderdale in February and we went to an expensive restaurant on the water for my Mum’s birthday. Fillet Steak was $60 and we sent it back. Tough, tasteless and weird texture. Went to Outback the next day and paid less than $25 for a fillet that was far superior.",
            "title_similarity": "0.7430833",
            "sentiment_compound": 0.4374
        },
        {
            "id": "i62iu6s",
            "score": 1,
            "text": "So.... typical American bullshit scam . Got it .",
            "title_similarity": "0.29912728",
            "sentiment_compound": -0.8176
        },
        {
            "id": "i6358zg",
            "score": 1,
            "text": "As an Australian, the one time I ate at outback steakhouse felt like the most American cuisine ever. I felt so fucking sick the next day.",
            "title_similarity": "0.7283446",
            "sentiment_compound": -0.3338
        },
        {
            "id": "i606m5u",
            "score": 2,
            "text": "I’ve been to Outback Steakhouse. There’s no Australian fun.",
            "title_similarity": "0.6709935",
            "sentiment_compound": -0.5996
        },
        {
            "id": "i60dbx1",
            "score": 2,
            "text": "Go to an Outback and ask your server if they have Vegemite.   \n\nGuarantee you'll get a look like you are a Martian.",
            "title_similarity": "0.5032003",
            "sentiment_compound": 0.5423
        },
        {
            "id": "i61psi0",
            "score": 2,
            "text": "I hope Australians eat bloomin’ onions.",
            "title_similarity": "0.4712479",
            "sentiment_compound": 0.4404
        },
        {
            "id": "i602lif",
            "score": 4,
            "text": "Wish they still had lambchops on the menu. :(",
            "title_similarity": "0.42011178",
            "sentiment_compound": -0.0516
        },
        {
            "id": "i609cnu",
            "score": 3,
            "text": "I taught my local outbacks on how to make a *proper* Lemon-Lime & Bitters.",
            "title_similarity": "0.42807424",
            "sentiment_compound": -0.1027
        },
        {
            "id": "i60a091",
            "score": 2,
            "text": "Hagen Dass was also founded by an American",
            "title_similarity": "0.29783964",
            "sentiment_compound": 0.0
        },
        {
            "id": "i60hqqh",
            "score": 3,
            "text": "I feel better now, thanks. I lived in the US for a few years and even had one of these less than 5km down the road but something about them was totally offputting, never went into one, now I’m glad.",
            "title_similarity": "0.5532943",
            "sentiment_compound": 0.7845
        },
        {
            "id": "i60i3z9",
            "score": 3,
            "text": "American food? Yeah that fucken well explains a lot.",
            "title_similarity": "0.41807395",
            "sentiment_compound": 0.5106
        },
        {
            "id": "i60ihs6",
            "score": 4,
            "text": "A friend of mine got laid off with three days notice when Outback closed here a few years back. \n\nFuck Outback.",
            "title_similarity": "0.3882139",
            "sentiment_compound": -0.0772
        },
        {
            "id": "i5zurrl",
            "score": 592,
            "text": "This chain represents a moment in our cultural history for sure. A moment when Americans were fascinated enough with Australia to flock to a theme restaurant like this but not enough to think about (or care about) the authenticity or lack thereof at all. \n\nI can’t imagine someone thinking of and selling this concept in 2022, either to investors or to customers.",
            "title_similarity": "0.73402894",
            "sentiment_compound": 0.7003
        },
        {
            "id": "i602t29",
            "score": 3,
            "text": "I would love it if they would just bring chicken salt to the states.\n\nStill very much a hard pass on the vegimite though.",
            "title_similarity": "0.57908976",
            "sentiment_compound": 0.5478
        },
        {
            "id": "i60fee2",
            "score": 6,
            "text": "So culture appropriation. The American way",
            "title_similarity": "0.24810788",
            "sentiment_compound": 0.0
        },
        {
            "id": "i60giq4",
            "score": 3,
            "text": "Subaru Outback’s are made in Japan :)\n\nPaul Hogan was featured in commercials for station wagons for years…",
            "title_similarity": "0.44099808",
            "sentiment_compound": 0.4588
        },
        {
            "id": "i602thb",
            "score": 114,
            "text": "Is this news/surprise to anyone? Are people out there like \"so this is what food is like in australia\".   Taco bell is also not from mexico.",
            "title_similarity": "0.58236694",
            "sentiment_compound": 0.6124
        },
        {
            "id": "i5zzg3s",
            "score": -19,
            "text": "Garbage food for people who don't know any better.",
            "title_similarity": "0.20884746",
            "sentiment_compound": -0.3412
        },
        {
            "id": "i60ae6j",
            "score": 18,
            "text": "AMERICAN: So, wanna put another shrimp on the /\nAUSTRALIAN: PRAWNS! PRAWNS! WE SAY PRAWNS YOU INSUFFERABLE CUNT!",
            "title_similarity": "0.5874475",
            "sentiment_compound": -0.7012
        },
        {
            "id": "i60i4ke",
            "score": 19,
            "text": "Chipotle was created by a gringo, and Haagen-Dazs is a Nestle brand, the name was created to sound fancy.",
            "title_similarity": "0.40748155",
            "sentiment_compound": 0.4588
        },
        {
            "id": "i5zzkbf",
            "score": 51,
            "text": "Had a coworker who quit to move out of state. We decided as a group to treat her to lunch. She chose outback. Ok. Not one person ordered steak or a bloomin onion. Wtf.",
            "title_similarity": "0.6478635",
            "sentiment_compound": -0.2732
        },
        {
            "id": "i60gyp1",
            "score": 7,
            "text": "Now it's just American food, with.... Children crying about French fries touching a hotdog.",
            "title_similarity": "0.56064284",
            "sentiment_compound": -0.4767
        },
        {
            "id": "i60s9gl",
            "score": 7,
            "text": "/u/euro-dan on the emotional resonance of Outback Steakhouse: \n\n\"Erur-Dan 3541 points 1 year ago4& 27 more \n\nApplebee's and Chili's are the restaurants of sadness and apathy. The emotion of Outback is rage.\n\nYou're a 53 year old father of two working in commercial truck leasing. You've been working your ass off to repay the vacation money you took from the college fund, and you've been neglecting the wife. You want to give her a nice meal. She likes that guy from animal planet what got shish-kabobed by a stingray, so why not outback? You've been everywhere else in the last few years.\n\nShe wants to spend eight American dollars on an onion, and you let her because the fucking point of the night is to make her happy, but you can't fucking stand it. The cheapest fucking vegetable in the world and she thinks it's god damn special.\n\nYou both get steak. Your first bite tastes fine, but you keep chewing. You again continue chewing. You're genuinely confused by the amount of gristle still in your mouth. What few grains of beef that manage to slip out are more an insult than a reward. What the fuck are you supposed to do with the fucking gristle? You fake a cough and drop the wad of gristle on the ground so the wife doesn't complain about it being on your plate. That's when you see. She's staring at you. She doesn't know what to do with her own gristle, and she's noticed you somehow don't have gristle. Whatever she decides you did, you know you're not getting your blow job this month.\n\nThe smug prick of a waiter offers you desert. It's probably some dumbass name like Kangaroo cheesecake, but you don't hear a word of it. The wife orders one for each of you. You drive home. She thanks you for taking her out. She goes to bed. You get a beer and turn on Fox News. You hear her softly crying, and you're just too fucking tired to care anymore. Maybe she'll fuck that guy from church again and get a little happiness in her life. All you know for sure is that Outback steakhouse should be burned to the ground.\"",
            "title_similarity": "0.69953483",
            "sentiment_compound": -0.8858
        },
        {
            "id": "i5zys3n",
            "score": 214,
            "text": "I love Outback, it’s a cool little spot and pretty affordable. I don’t think I’ve ever had anything there that was bad.",
            "title_similarity": "0.39989692",
            "sentiment_compound": 0.7128
        },
        {
            "id": "i60c03h",
            "score": 27,
            "text": "I spent a decade of my life in fine dining working for some very well respected chefs.\n\nI like Outback. They have a decent steak for their price point and I can't stand food snobs. Also not everyone can afford to go out and drop $50 on a single plate of food.",
            "title_similarity": "0.6408161",
            "sentiment_compound": 0.8405
        },
        {
            "id": "i60ap4j",
            "score": 10,
            "text": "That would makes sense, took my friend from Australia there for a laugh and the first thing she noticed was the Australian flag was wrong",
            "title_similarity": "0.56981647",
            "sentiment_compound": 0.5719
        },
        {
            "id": "i60a0ss",
            "score": 35,
            "text": "Creedence Clearwater Revival was also from southern california, were surfers, and had never even seen a bayou, much less been born on one. I still like them though.",
            "title_similarity": "0.65394557",
            "sentiment_compound": 0.3612
        },
        {
            "id": "i5zzkdq",
            "score": 113,
            "text": "I spent a month on the East coast of Australia in 2005. If Outbacks were serving 14lb lobsters in the states like the ones in Manly, I would eat nowhere else. I also would be broke and have gout. So, once again I would be back to classic American problems. I need to get back there, what an amazing place. My kids would never want to leave.",
            "title_similarity": "0.7610418",
            "sentiment_compound": 0.1842
        },
        {
            "id": "i609bde",
            "score": 13,
            "text": "As an Australian my first experience with outback steakhouse was a restaurant they opened in Sydney. We didn't know it was an American chain and tried it out. It was awful and went out of business in a few months. I eat there occasionally now I live in the US and recognize that the \"Australian\" stuff is just marketing. \nThe same with the shampoos, yogurts, dog supplies, etc.  with Aussie labels.",
            "title_similarity": "0.7798926",
            "sentiment_compound": -0.4588
        },
        {
            "id": "i6148sv",
            "score": 14,
            "text": "My family moved from Adelaide, Australia, to Dallas, TX. My parents loved to entertain and dreamed of opening an Australian-style pub. Shortly after the titular release of Crocodile Dundee,  they opened \"The Outback Pub\" in Dallas's old warehouse district in 1986.\n\nThe restaurant and bar were pretty popular and served Australian specialties like meat pies, pavlova, and Vegemite on toast. Shortly after opening, a couple from Florida asked for menus, t-shirts, and more to be sent to them. I think my parents innocently thought they were huge fans of the Outback Pub.\n\nJust a year later, the Outback Steakhouse launched in Florida. It was crazy; they even used the same wording on their menu (like describing the pavlova as: \"The sweetest thing to come from Australia since Olivia Newton-John\" (This was the 80s).\n\nFast forward a few years, and these DHs sued my parents for trademark infringement.\n\nNot a fan.",
            "title_similarity": "0.8343557",
            "sentiment_compound": 0.9317
        },
        {
            "id": "i5zutq2",
            "score": 70,
            "text": "I'm sure they've been to Australia since they opened.",
            "title_similarity": "0.42062974",
            "sentiment_compound": 0.3182
        },
        {
            "id": "i607kgg",
            "score": 74,
            "text": "Next thing you're going to tell me is that Olive Garden isn't authentic Italian food.",
            "title_similarity": "0.29235184",
            "sentiment_compound": 0.0
        },
        {
            "id": "i603yzc",
            "score": 132,
            "text": "My tinder profile used to be, \"I'm only on here because the bartenders at Outback are tired of watching me eat Bloomin onions by myself.\" and that worked quite well as an online dating ice breaker",
            "title_similarity": "0.617115",
            "sentiment_compound": -0.1298
        },
        {
            "id": "i60j6q7",
            "score": 22,
            "text": "The original Outback was so good, now it's just another chain restaurant.\n\nI remember when they only opened at 4 pm and everything they used to make was made in house with ingredients from their own farms. They were also the first people to really have blue bell, before that also turned into shit",
            "title_similarity": "0.65999174",
            "sentiment_compound": 0.3488
        },
        {
            "id": "i60d1y5",
            "score": 25,
            "text": "And the Texas Roadhouse restaurant chain was created in Indiana by a guy from Kentucky who started the Texas-themed steakhouse after his Colorado-themed restaurant didn't work out.",
            "title_similarity": "0.64336944",
            "sentiment_compound": 0.25
        },
        {
            "id": "i6020na",
            "score": 64,
            "text": "It’s also very affordable and I appreciate that about outback",
            "title_similarity": "0.19160217",
            "sentiment_compound": 0.4019
        },
        {
            "id": "i606qtg",
            "score": 1193,
            "text": "Well yeah. And Texas Roadhouse was founded in Indiana. restaurants are sold on the idea of a place, not necessarily actually coming from that place.\n\nMy favorite foundation story was a local pizza shop's. It went something like this: We were founded by someone from Italy! ^(He moved to America at age 9 and sold his business to a giant corporation who has run it ever since)",
            "title_similarity": "0.71833384",
            "sentiment_compound": 0.8439
        },
        {
            "id": "i5zz3k3",
            "score": 3020,
            "text": "To be honest… I thought their steaks were pretty good for their price point.  Not many chain restaurants sell good steaks for under $40.  Certainly better than Chili’s, Applebees, Bennigan’s, etc.  Obviously not as good as Morton’s, Ruth’s Chris, but far cheaper.\n\nAnd before i get “well don’t go to chains”… non-chain places with good affordable steaks aren’t that common, and not that easy to find for frequent business travelers.\n\nEdit: A lot of commenters mentioning Texas Roadhouse.  Yes, they have good quality affordable steaks too!  But 15-20 years ago, back when I traveled a lot, I rarely saw those and I did see Outbacks a lot.  And I don't really know what the current steak-chain scene is like these days.  I don't travel much for work anymore, and I cook my own steaks more often, or else spring for a fancy-schmancy place.",
            "title_similarity": "0.57463646",
            "sentiment_compound": 0.9561
        },
        {
            "id": "i5zyvar",
            "score": 97,
            "text": "Same goes for Hooters. The man who conceived it doesn’t have any",
            "title_similarity": "0.40844595",
            "sentiment_compound": 0.0
        },
        {
            "id": "i6064xa",
            "score": 813,
            "text": "Turns out it was a fucking great idea.",
            "title_similarity": "0.062364176",
            "sentiment_compound": 0.659
        },
        {
            "id": "i60eewh",
            "score": 190,
            "text": "I don’t think anyone confused Outback for an Australian restaurant",
            "title_similarity": "0.5651928",
            "sentiment_compound": -0.3182
        },
        {
            "id": "i5zym04",
            "score": 405,
            "text": "The BBQ sauce they use for their ribs and other meats is purchased from Diversified Foods and Seasonings, which is a subsidiary of Al Copeland Investments; you may know that name as the founder of Popeyes",
            "title_similarity": "0.5663876",
            "sentiment_compound": 0.0
        },
        {
            "id": "i5ztn6a",
            "score": 79,
            "text": "Yep! I pass by their headquarters all the time. Bonefish Grill was founded here too.",
            "title_similarity": "0.5559255",
            "sentiment_compound": 0.3595
        },
        {
            "id": "i5zzjzm",
            "score": 3896,
            "text": "So your telling me bloomin' onions aren't a native Australian delicacy?",
            "title_similarity": "0.43775213",
            "sentiment_compound": 0.0
        },
        {
            "id": "i60ek7w",
            "score": 247,
            "text": "Storry time.  After the issue with the nuclear site in Japan, some Australian aborigines send Japan donations.  Japan doesn’t really need or want those donations so politely declined.  But flew a bunch of the folks to thank them for the thought…evidently.  \n\nI was in the middle of a trip to Tokyo and me and my friend decided that we needed a small break from Japanese food.  So wandered into an Outback.  There was some sort of a meeting/presentation going on. \n\nSo evidently the Japanese decided the perfect place to officially host and thank these aborigines from Australian was Outback.  The aborigines looked very confused.",
            "title_similarity": "0.66548204",
            "sentiment_compound": 0.9293
        },
        {
            "id": "i60fk9e",
            "score": 310,
            "text": "Can confirm. I did a short exchange trip way back in middle school to a place in Anaheim CA. My lovely host family excitedly took me to an Outback Steakhouse sincerely thinking it was the food of my people. I had no clue what a bloomin’ onion was but I remember it was delicious.",
            "title_similarity": "0.7216886",
            "sentiment_compound": 0.8765
        },
        {
            "id": "i5zx7vw",
            "score": 8376,
            "text": "This feels like an excellent moment to remind people that the original Crocodile Dundee was nominated for Best Original Screenplay at the 1987 Oscars (though it lost to Hannah and Her Sisters)",
            "title_similarity": "0.63601017",
            "sentiment_compound": 0.9136
        },
        {
            "id": "i604120",
            "score": 1028,
            "text": "Imagine the dining experience if they saw The Road Warrior instead of Crocodile Dundee",
            "title_similarity": "0.5271048",
            "sentiment_compound": 0.0
        },
        {
            "id": "i60gelw",
            "score": 710,
            "text": "I can still hear my 16 year old southern girl self answering the phones with \"G'day! Thank you for calling Outback...\"\n\nI sounded rediculous",
            "title_similarity": "0.49233574",
            "sentiment_compound": 0.4199
        },
        {
            "id": "i60g966",
            "score": 3183,
            "text": "Every time I think about Outback, I vividly remember the time that I went there and the family next to us got a blooming onion EACH, entrees and dessert. It was simultaneously impressive and kind of gross to witness.",
            "title_similarity": "0.5754825",
            "sentiment_compound": -0.024
        },
        {
            "id": "i609403",
            "score": 835,
            "text": "If it has Australian fun, they should have goon on a clothesline out the back, just saying.",
            "title_similarity": "0.53542864",
            "sentiment_compound": 0.5106
        },
        {
            "id": "i602psh",
            "score": 2,
            "text": "[deleted]",
            "title_similarity": "-0.016461087"
        },
        {
            "id": "i6087wg",
            "score": 2,
            "text": "I still stand by their Caesar dressing being the best I've ever had.",
            "title_similarity": "0.41711968",
            "sentiment_compound": 0.6369
        },
        {
            "id": "i609wgh",
            "score": 2,
            "text": "And thus, Timberlodge Steakhouse was doomed to die.\n\nYou used to be able to find them all across Minnesota, then in the blink of an eye, there were three, then two, and now there is only one left.\n\nThe saddest part was, we didn't even notice our local one was gone. We had been to the new Sonic, didn't think much of that. But then we were driving down the road and thought, **Let's go to Timberlodge.** So we drive down the road that our mental autopilots told us to go, but we didn't see it. We drove down the road again the other way, brains still telling us, **it's here.** We don't see it again, so we take one more trip down the road. **Sonic.**\n\nTimberlodge had somehow closed and been demolished without us even noticing. That hurt us the most.",
            "title_similarity": "0.6454034",
            "sentiment_compound": -0.9032
        },
        {
            "id": "i60a4xn",
            "score": 1,
            "text": "https://en.m.wikipedia.org/wiki/Australian_cuisine",
            "title_similarity": "0.40026295",
            "sentiment_compound": 0.0
        },
        {
            "id": "i60aaec",
            "score": 2,
            "text": "A friend visiting from Australia was desperate to visit an Outback Steakhouse and then ordering something in the most over the top Aussie accent he could muster (His default one was pretty intense as it was).\n\nWhen he finally got his chance the waitresses didn't blink an eye.  Poor guy was heartbroken.",
            "title_similarity": "0.74484193",
            "sentiment_compound": 0.0164
        },
        {
            "id": "i60an5p",
            "score": 2,
            "text": "Everyone is always on about thier steaks. But have you had thier wings? Fucking perfect balance of heat and flavor.",
            "title_similarity": "0.5908129",
            "sentiment_compound": 0.7572
        },
        {
            "id": "i60apvf",
            "score": 1,
            "text": "The only thing I remember about Outback Steakhouse is the free ice cream I got once.",
            "title_similarity": "0.5720625",
            "sentiment_compound": 0.5106
        },
        {
            "id": "i60b17k",
            "score": 2,
            "text": "they also stole the blooming onion recipe from Russell's Marina Grill in New Orleans",
            "title_similarity": "0.5875226",
            "sentiment_compound": 0.0
        },
        {
            "id": "i60bybt",
            "score": 2,
            "text": "So you're telling me that Australia does not have Queensland Chicken and Shrimp? That's it, I'm never going.",
            "title_similarity": "0.51632804",
            "sentiment_compound": 0.0
        },
        {
            "id": "i60c5z7",
            "score": 2,
            "text": "In their defense - we once took our Australian friend there as a joke and he had a grand ol time lol",
            "title_similarity": "0.6131407",
            "sentiment_compound": 0.8934
        },
        {
            "id": "i60c7fp",
            "score": 1,
            "text": "I believe two of the guys were area managers for steak and ale and saw that the company was being run into the ground.  They took several of the recipes with them to Outback",
            "title_similarity": "0.6095264",
            "sentiment_compound": 0.0
        },
        {
            "id": "i60ca7c",
            "score": 2,
            "text": "The American dream right here.",
            "title_similarity": "0.27469528",
            "sentiment_compound": 0.25
        },
        {
            "id": "i60cxb9",
            "score": 1,
            "text": "Where are the crocodiles ?",
            "title_similarity": "0.34309164",
            "sentiment_compound": 0.0
        },
        {
            "id": "i60di7l",
            "score": 1,
            "text": "Makes perfect sense actually.",
            "title_similarity": "-0.07026827",
            "sentiment_compound": 0.5719
        },
        {
            "id": "i60dilr",
            "score": 6,
            "text": "Not sure this surprised anyone. Even without this specific knowledge this is obvious. I didn’t know this but could tell it was “American”. A Bloomin’ Onion FFS?",
            "title_similarity": "0.49133068",
            "sentiment_compound": -0.803
        },
        {
            "id": "i60dl7a",
            "score": 1,
            "text": "NO RULES JUST RIGHT",
            "title_similarity": "0.059485324",
            "sentiment_compound": -0.296
        },
        {
            "id": "i60dlhd",
            "score": 2,
            "text": "My neighbor I grew up next to, his son did a couple failed ventures with the same people who own outback now, and when offered to be the first chef and part owner of Outback,  he said no. Should of stuck it out once more",
            "title_similarity": "0.68341",
            "sentiment_compound": -0.6486
        },
        {
            "id": "i60dqf9",
            "score": 7,
            "text": "So you’re telling me that the bloomin onion isn’t even Australian. I will never recover from this.",
            "title_similarity": "0.4944749",
            "sentiment_compound": 0.0
        },
        {
            "id": "i60dx5a",
            "score": 2,
            "text": "> Opening day was as desolate as a sun-baked highway stretching to the horizon. Employees at the Tampa, Florida location had to park in the lot to make it look busy and call their friends and family and invite them to come in. To drum up business, the founders invested in ads and promotions, and eventually word got around.\n\n“Shit, we gotta *advertise*?!”\n\n~The owners, apparently.",
            "title_similarity": "0.7131276",
            "sentiment_compound": 0.6114
        },
        {
            "id": "i60e09r",
            "score": 1,
            "text": "I live like 5 mins from the bloomin brands building in tampa.  Right across the street pretty much is an outback that looks high class but…it’s still an outback haha.",
            "title_similarity": "0.54600227",
            "sentiment_compound": 0.8271
        },
        {
            "id": "i60e2sg",
            "score": 1,
            "text": "Outback Steakhouse in Florida in the 90s was amazing. The crap one we have in Enfield just doesn’t even compare.",
            "title_similarity": "0.72480696",
            "sentiment_compound": 0.296
        },
        {
            "id": "i60e66d",
            "score": 2,
            "text": "I feel like I inherently understood this fact despite never having explicitly learned it. Now it's just confirmed.",
            "title_similarity": "0.21932349",
            "sentiment_compound": 0.3612
        },
        {
            "id": "i60ercz",
            "score": 2,
            "text": "What's funny is that real Australian food is *fantastic*. Seasoned wedges with sweet chili and sour cream? Savory pumpkin soup? Rosemary roasted lamb? \n\nPAVLOVA.\n\nFrickin delicious stuff.",
            "title_similarity": "0.4978128",
            "sentiment_compound": 0.9329
        },
        {
            "id": "i60esco",
            "score": 1,
            "text": "Probably why they won't hire a really aussy to do the commercials, even though Jason Ellis is dying for the role haha.",
            "title_similarity": "0.48276442",
            "sentiment_compound": 0.4588
        },
        {
            "id": "i60et9g",
            "score": 1,
            "text": "Texas Roadhouse was founded in Louisville Kentucky \n\nFwiw T-roadie kinda rocks as a chain restaurant.  Shits good",
            "title_similarity": "0.6464726",
            "sentiment_compound": -0.0516
        },
        {
            "id": "i60etc6",
            "score": 6,
            "text": "One of the VPs named their kids \"Tucker\" and \"Sydney\" to show how much they believed in the restaurant. 🤦🏼‍♀️",
            "title_similarity": "0.5357312",
            "sentiment_compound": 0.0
        },
        {
            "id": "i60eu25",
            "score": 2,
            "text": "You should see the videos of Australians trying outback steakhouse and how not even remotely close they are to Australian food",
            "title_similarity": "0.73902106",
            "sentiment_compound": 0.0
        },
        {
            "id": "i60evu5",
            "score": 1,
            "text": "Saw they just had to drop their sponsorship of the Outback Bowl. I wonder who was the last Outback Bowl winner?",
            "title_similarity": "0.51305354",
            "sentiment_compound": 0.4019
        },
        {
            "id": "i60ez9r",
            "score": 2,
            "text": "My favorite thing to come out of Outback Steakhouse was the theoretical restaurant Outback Stabhouse where payment is via stabbing. The better the meal the deeper the wound. Though, gift cards are accepted.",
            "title_similarity": "0.5639351",
            "sentiment_compound": 0.872
        },
        {
            "id": "i60f9hz",
            "score": 1,
            "text": "> Their concept was “American food and Australian fun.”\n\nI thought that was the description of the Engadine Maccas!",
            "title_similarity": "0.60628235",
            "sentiment_compound": 0.0
        },
        {
            "id": "i60ffzh",
            "score": 3,
            "text": "This is as good a place as any to leave these here:\n\nhttps://www.youtube.com/playlist?list=PLK3qcRT3hMV_I1JrYimJaENAe2H6DTFpW",
            "title_similarity": "0.2836411",
            "sentiment_compound": 0.4019
        },
        {
            "id": "i60fj7a",
            "score": 3,
            "text": "$14.99 gets you an 8oz steak, side and a salad. Can’t beat that. \n\nThe original is right down the street from here… friend of mine used to nanny for one of the owners and he had a smaller version of the bar area in his house.",
            "title_similarity": "0.65075433",
            "sentiment_compound": 0.6705
        },
        {
            "id": "i60fjkl",
            "score": 12,
            "text": "Wait until you find out about the origin of Medieval Times",
            "title_similarity": "0.06801961",
            "sentiment_compound": 0.0
        },
        {
            "id": "i60fqlo",
            "score": 2,
            "text": "Ngl, I loved their brown bread, bloomin onion and caesar salad.",
            "title_similarity": "0.36123383",
            "sentiment_compound": 0.5994
        },
        {
            "id": "i60fyss",
            "score": 3,
            "text": "Does anyone remember the Reddit AMA of an Outback cook that  claimed they  used beef tallow to deep fry all their stuff and then the user deleted their whole AMA afterwards...?  Does anyone know what they use?",
            "title_similarity": "0.64731026",
            "sentiment_compound": 0.0
        },
        {
            "id": "i60fzp3",
            "score": 3,
            "text": "As an Aussie that place just seems surreal to me.",
            "title_similarity": "0.21391308",
            "sentiment_compound": 0.0
        },
        {
            "id": "i60g1bd",
            "score": 4,
            "text": "Holy crap is this why I remember an Outback commercial jingle that no one else does? I’m from Tampa Bay and they were radio commercials. The jingle isn’t even good, they just played it constantly so I can’t forget it. \n\nA part of it was:\n\n“Outback Steakhouse, cold beer and a juicy steak, where the boomerang goes it comes back, you will too (Outback), Outback Steakhouse, steakhouse from the land down under” (end with pan flutes).\n\nDoes anyone else recognize this song? (I lived there mid-80s to late 90s).",
            "title_similarity": "0.78305674",
            "sentiment_compound": -0.2555
        },
        {
            "id": "i60g23i",
            "score": 1,
            "text": "What would an Australian restaurant consist of?",
            "title_similarity": "0.42255366",
            "sentiment_compound": 0.0
        },
        {
            "id": "i60gt7r",
            "score": 2,
            "text": "I went to an Australian fast casual restaurant once and they had kangaroo meat pies (years ago). Pretty sure that’s not on the menu at Outback….",
            "title_similarity": "0.70510197",
            "sentiment_compound": 0.743
        },
        {
            "id": "i60gzdc",
            "score": 47,
            "text": "What, deep fried battered onions with 2000 calories each aren’t traditional Australian food????",
            "title_similarity": "0.510063",
            "sentiment_compound": 0.0
        },
        {
            "id": "i60h6g9",
            "score": 3,
            "text": "And since the vast majority of Americans will never visit Australia, they’ll never know the difference.",
            "title_similarity": "0.54048336",
            "sentiment_compound": 0.0
        },
        {
            "id": "i60h76e",
            "score": 2,
            "text": "I’ve never actually thought any of the food was “Australian food” I just thought maybe an Australian founded it. Actually I never put much thought into it, I just knew I loved the blooming onion and the way they season their steaks.",
            "title_similarity": "0.7522131",
            "sentiment_compound": 0.5994
        },
        {
            "id": "i60h8mb",
            "score": 6,
            "text": "Yeah you can tell they had never been to Australia for sure. This actually explains a lot 😂",
            "title_similarity": "0.57479167",
            "sentiment_compound": 0.7506
        },
        {
            "id": "i60hdmq",
            "score": 3,
            "text": "Isn't ACDC founded in Australia. Man 80s were an interesting time. English invasion and the less remembered Australian invasion.",
            "title_similarity": "0.53189355",
            "sentiment_compound": 0.4019
        },
        {
            "id": "i60hip7",
            "score": 17,
            "text": "The Subaru Outback Steakhouse- Australian for beer.",
            "title_similarity": "0.6156157",
            "sentiment_compound": 0.0
        },
        {
            "id": "i60icy8",
            "score": 2,
            "text": "well duh anyone whos ever been to australia would known that if it was an ausrtialian restaurant that atleast half the menu would feature vegemite dishes",
            "title_similarity": "0.6661879",
            "sentiment_compound": 0.2732
        },
        {
            "id": "i60idog",
            "score": 1,
            "text": "What is the definition of Australian fun",
            "title_similarity": "0.26301616",
            "sentiment_compound": 0.5106
        },
        {
            "id": "i60ifhg",
            "score": 1,
            "text": "Only ate there once, didn't try the blooming onion.\n\nTried to order toast with Vegemite, they didn't know what that was.",
            "title_similarity": "0.51746523",
            "sentiment_compound": 0.0
        },
        {
            "id": "i60iuui",
            "score": 1,
            "text": "Wait - are you telling me Toowoomba doesn't have killer pasta?",
            "title_similarity": "0.3985666",
            "sentiment_compound": 0.5334
        },
        {
            "id": "i60izfx",
            "score": 1,
            "text": "I have never been to an outback, but I never associated with Australia either.",
            "title_similarity": "0.4889338",
            "sentiment_compound": 0.0
        },
        {
            "id": "i60izyu",
            "score": 1,
            "text": "Those kookaburra wings fire",
            "title_similarity": "0.2699622",
            "sentiment_compound": -0.34
        },
        {
            "id": "i60j272",
            "score": 2,
            "text": "This is very unsurprising for anyone who has ever eaten at an Outback Steakhouse",
            "title_similarity": "0.62213767",
            "sentiment_compound": 0.0
        },
        {
            "id": "i60jcat",
            "score": 1,
            "text": "Not going to lie outback has the best steaks!",
            "title_similarity": "0.5387852",
            "sentiment_compound": 0.6696
        },
        {
            "id": "i60jfgc",
            "score": 2,
            "text": "I had the worst burger of my life at Outback Steakhouse. They cooked it on the same grill they used for fish so the beef had a nasty fish flavor. Nasty.",
            "title_similarity": "0.6091257",
            "sentiment_compound": -0.9062
        },
        {
            "id": "i60jh60",
            "score": 6,
            "text": "Australians don't say \"shrimp on the barbi.\"  They say prawns.  And they don't drink Fosters beer.\n\nsource:\n\nConan leans to speak Australian\n\nhttps://www.youtube.com/watch?v=L94M4xQcPYk",
            "title_similarity": "0.5969756",
            "sentiment_compound": 0.0
        },
        {
            "id": "i60jjl9",
            "score": 2,
            "text": "But the Chinese food we get in America is authentic.",
            "title_similarity": "0.40317336",
            "sentiment_compound": 0.0
        },
        {
            "id": "i60jqya",
            "score": 2,
            "text": "I mean their beef industry was influenced by ranchers in Central America and the southwest United States, but probably not to the degree that people with misconceptions about the restaurant being authentic Australian food is would likely assume",
            "title_similarity": "0.5871426",
            "sentiment_compound": 0.2263
        },
        {
            "id": "i60jtji",
            "score": 1,
            "text": "Those damn wings are so good.",
            "title_similarity": "0.11643122",
            "sentiment_compound": 0.2596
        },
        {
            "id": "i60jupq",
            "score": 1,
            "text": "Fake it till you make it",
            "title_similarity": "0.11279003",
            "sentiment_compound": -0.4767
        },
        {
            "id": "i60k1qb",
            "score": 1,
            "text": "I had never been to an Outback Steakhouse, by choice, until recently. Once my boyfriend’s family in Tampa found out I had never been, they made it a point to get me there as soon as we got in town. The waiters all came by to meet the California kid that had never eaten at Outback. 🤷🏻‍♂️",
            "title_similarity": "0.80220884",
            "sentiment_compound": 0.0
        },
        {
            "id": "i60kf6i",
            "score": 1,
            "text": "Everything is fake and a lie, or built off of falsehood and lies. That’s the world we live in.",
            "title_similarity": "0.22927338",
            "sentiment_compound": -0.7096
        },
        {
            "id": "i60km11",
            "score": 1,
            "text": "Are you telling me the Bloomin' Onion isn't authentic Australian cuisine?",
            "title_similarity": "0.41871756",
            "sentiment_compound": 0.0
        },
        {
            "id": "i60kmu5",
            "score": 2,
            "text": "We took my Australian friend there once while he was visiting the states. He thought bloomin onion wss the funniest thing in the world. Guess blooming pretty much means fucking so he has to have that fucking onion.",
            "title_similarity": "0.66630745",
            "sentiment_compound": 0.875
        },
        {
            "id": "i60ktqb",
            "score": 2,
            "text": "Next you’re going to tell me that the people who did Mars 2112 aren’t actually from Mars",
            "title_similarity": "0.34180355",
            "sentiment_compound": 0.0
        },
        {
            "id": "i60kuud",
            "score": 1,
            "text": "I’m still surprised Of Montreal did a commercial jingle for Outback \n\nhttps://youtu.be/0Mvm6KfJDE0",
            "title_similarity": "0.47360316",
            "sentiment_compound": 0.2263
        },
        {
            "id": "i60l4z5",
            "score": 1,
            "text": "As someone only familiar with the name of the restaurant, I always thought the \"outback\" just referred to a field \"out back\", presumably where cows live. Never occurred to me that they were referring to the Australian outback. In retrospect, I'm not sure why I never figured it out.",
            "title_similarity": "0.6667773",
            "sentiment_compound": -0.2411
        },
        {
            "id": "i60lere",
            "score": 1,
            "text": "Just like every Italian or Mexican restaurant chain",
            "title_similarity": "0.50905156",
            "sentiment_compound": 0.3612
        },
        {
            "id": "i60lns2",
            "score": 1,
            "text": "If you have eaten there then you should know it’s all garbage.",
            "title_similarity": "0.32564706",
            "sentiment_compound": 0.0
        },
        {
            "id": "i60lwc5",
            "score": 1,
            "text": "FWIW, another giant chain restaurant was started just an hour away in Winter Park, Fl... Olive Garden. It was the best Italian restaurant in town and I took my first ever homecoming date there as it was this very classy restaurant at the time when there was only one of them. Now I get to tell people I took my first homecoming date to Olive Garden and for some reason I get a totally different reaction. Haha.",
            "title_similarity": "0.7117089",
            "sentiment_compound": 0.8923
        },
        {
            "id": "i60lx9v",
            "score": 1,
            "text": "Ok but can we acknowledge that this place somehow has the most amazing chicken wings??? They call them \"Kookaburra Wings\" but I can't find anywhere else that can come close to the sauce / rub they put on there wings. All time favorite .",
            "title_similarity": "0.62045693",
            "sentiment_compound": 0.9149
        },
        {
            "id": "i60lyqi",
            "score": 1,
            "text": "Yes they were Bennigans alumni I believe",
            "title_similarity": "0.15536743",
            "sentiment_compound": 0.4019
        },
        {
            "id": "i60m39j",
            "score": 1,
            "text": "Their cheese fries slap tho",
            "title_similarity": "0.36616647",
            "sentiment_compound": 0.1531
        },
        {
            "id": "i60mcq1",
            "score": 1,
            "text": "I have been to the Outback Steakhouse in Australia (more than a decade ago now). They are different than those in the US - at least they were at that time (Oct 2010). My ex-husband really wanted to knock that off our honeymoon bucket list and it was an okay time. We had better food in other places in the country, though (Colonial Tram Car in Melbourne was a high point).\n\nEdited post with the photo of me in front of the restaurant during that trip. It’s marked as NSFW for some reason but it’s not.\n\nhttps://www.reddit.com/user/grmrgurl/comments/uayhkq/outback_australia_experience/?utm_source=share&utm_medium=ios_app&utm_name=iossmf",
            "title_similarity": "0.7572244",
            "sentiment_compound": 0.34
        },
        {
            "id": "i60mcuu",
            "score": 7,
            "text": "> In the late 1980s, the US experienced a short-lived infatuation with Australian culture. For some bizarre reason, the Aussies thought this would be a permanent thing. Of course, it wasn't.\n\n[Yahoo Serious Film Festival](https://imgur.com/gallery/t4GnpHB)",
            "title_similarity": "0.6626228",
            "sentiment_compound": -0.1225
        },
        {
            "id": "i60me0a",
            "score": 2,
            "text": "That’s knowing your market. Most Americans will never travel down under so won’t know an authentic Aussie fare if it hit them in the head.",
            "title_similarity": "0.59190303",
            "sentiment_compound": 0.0
        },
        {
            "id": "i60mhj0",
            "score": 1,
            "text": "Outbacks branched into Australia, lol. Seriously.",
            "title_similarity": "0.4014305",
            "sentiment_compound": 0.2732
        },
        {
            "id": "i60mklr",
            "score": 1,
            "text": "no rules",
            "title_similarity": "0.044248097",
            "sentiment_compound": -0.296
        },
        {
            "id": "i60mlli",
            "score": 1,
            "text": "Same founder of MISSION BBQ, too.  They ride the military theme coat tails to popularity.  Their food isn't cooked onsite, it's trucked in and reheated.",
            "title_similarity": "0.69236284",
            "sentiment_compound": 0.4767
        },
        {
            "id": "i60mqm9",
            "score": 1,
            "text": "Glad they didn’t watch Hellraiser",
            "title_similarity": "0.30152637",
            "sentiment_compound": 0.4588
        },
        {
            "id": "i60mx88",
            "score": 1,
            "text": "Pizza wasn't invented in Italy.",
            "title_similarity": "0.3856402",
            "sentiment_compound": 0.0
        },
        {
            "id": "i60mxk4",
            "score": 4,
            "text": "Slop em up boys",
            "title_similarity": "0.11748412",
            "sentiment_compound": 0.0
        },
        {
            "id": "i60n4ar",
            "score": 8,
            "text": "I'm from the midwest US and dated someone from Sydney, Aus back in the 2000s. While she was visiting one of my best friends had a birthday. Being a little troll, he asked for us all to go to Outback for his birthday.\n\nShe got carded for getting a beer, and they were all super amused by her Australian ID, calling over other servers to gawk at it (and her).\n\nShe was mortified, also annoyed that nothing was genuinely Australian, especially the beer selection.\n\nMy friend was entirely too pleased with himself.",
            "title_similarity": "0.71327996",
            "sentiment_compound": 0.957
        },
        {
            "id": "i60nfp5",
            "score": 1,
            "text": "I just watched a vid about this on you tube yesterday!",
            "title_similarity": "0.37160623",
            "sentiment_compound": 0.0
        },
        {
            "id": "i60nk4r",
            "score": 1,
            "text": "As a Kid I did this the Australian Outback was more like Mad Max - Mel Gibson style.",
            "title_similarity": "0.51548487",
            "sentiment_compound": -0.1742
        },
        {
            "id": "i60nlej",
            "score": 1,
            "text": "Florida men at it again",
            "title_similarity": "0.3309952",
            "sentiment_compound": 0.0
        },
        {
            "id": "i60noyq",
            "score": 4,
            "text": "Texas Roadhouse is from Indiana",
            "title_similarity": "0.32778996",
            "sentiment_compound": 0.0
        },
        {
            "id": "i60np6k",
            "score": 1,
            "text": "A funny thing was, with the mad cow scare and some anti-American feelings following a US armored vehicle accident that killed a couple of girls in Korea, Koreans boycotted done American- sounding businesses and instead started going to Outback.",
            "title_similarity": "0.51426816",
            "sentiment_compound": -0.93
        },
        {
            "id": "i60npz0",
            "score": 1,
            "text": "Fun fact: I went to high school with the founder’s son. A few of my classmates tried to break into their house and steal an Xbox. Dad came down with a loaded gun, luckily did not shoot as they revealed themselves. But all the kids who broke in got expelled…obviously for good reason.",
            "title_similarity": "0.5964141",
            "sentiment_compound": 0.2887
        },
        {
            "id": "i60nt8b",
            "score": 1,
            "text": "Ummm… I thought “Outback” meant out back like in the back yard, on a grill. Not Australia 🤭",
            "title_similarity": "0.52310854",
            "sentiment_compound": 0.6908
        },
        {
            "id": "i60nte2",
            "score": 1,
            "text": "They were also ex Steak and Ale execs",
            "title_similarity": "0.39855433",
            "sentiment_compound": 0.0
        },
        {
            "id": "i60nvgs",
            "score": 2,
            "text": "Fun fact: Carrabba’s Italian Grill is owned by the same company as Outback and was founded in Texas by a family who settled there from Sicily.",
            "title_similarity": "0.67417",
            "sentiment_compound": 0.5106
        },
        {
            "id": "i60o3wg",
            "score": 1,
            "text": "I feel like it was also founded by people who had never been to a steakhouse.  An over seasoned sirloin as your signature cut? Yikes.",
            "title_similarity": "0.7056577",
            "sentiment_compound": 0.1027
        },
        {
            "id": "i60o54u",
            "score": 1,
            "text": "Didn’t think it was Australian. The food is horribly bad. Ugh.",
            "title_similarity": "0.4205768",
            "sentiment_compound": -0.8658
        },
        {
            "id": "i60o9sm",
            "score": 1,
            "text": "The Orlando Bloomin’ Onion is still pretty good.",
            "title_similarity": "0.30590677",
            "sentiment_compound": 0.7269
        },
        {
            "id": "i60oa3y",
            "score": 1,
            "text": "My wife and I had our first date at an Outback so I'll always like them.",
            "title_similarity": "0.5420612",
            "sentiment_compound": 0.4144
        },
        {
            "id": "i60obp1",
            "score": 1,
            "text": "Ever get the feeling that you've been cheated?",
            "title_similarity": "0.026265364",
            "sentiment_compound": -0.4215
        },
        {
            "id": "i60obqu",
            "score": 1,
            "text": "I knew it had to be from Florida when I saw they had Blue Bunny ice cream in the menu,",
            "title_similarity": "0.56521416",
            "sentiment_compound": 0.0
        },
        {
            "id": "i60obvu",
            "score": 3,
            "text": "I worked at Outback for years.\n\nDuring the fires in Australia I had one customer ask me if we were having a hard time receiving our orders. I kindly explained that we don’t order from Australia, we just have a theme.",
            "title_similarity": "0.67537546",
            "sentiment_compound": 0.4215
        },
        {
            "id": "i60ocz8",
            "score": 1,
            "text": "The owners also used to be part of the Chili's ownership. They wanted Chili's to do more steaks, Chili's wanted to stay more of a catch all.  So they formed their own steakhouse around a Australian concept to be unique.",
            "title_similarity": "0.69925654",
            "sentiment_compound": 0.0
        },
        {
            "id": "i60oi1x",
            "score": 1,
            "text": "When I still had six-figures worth of student loan debt and didn’t feel like brown bagging it, l loved going to Outback from time-to-time for their endless soup and salad for $6.00.",
            "title_similarity": "0.61580575",
            "sentiment_compound": 0.8316
        },
        {
            "id": "i60on4r",
            "score": 1,
            "text": "Worked there for almost a decade. Food wasn’t bad.",
            "title_similarity": "0.24808134",
            "sentiment_compound": -0.5423
        },
        {
            "id": "i60ovv4",
            "score": 1,
            "text": "This makes me wonder if there are any authentic Australian restaurants at all here.",
            "title_similarity": "0.5283412",
            "sentiment_compound": 0.0
        },
        {
            "id": "i60p0fl",
            "score": 6,
            "text": "What about Bennigan’s? I used to work at Bennigan’s. \n\nI had two Irish backpackers as guests once and they looked at the menu and said “There isn’t a damn thing on this menu that is Irish!”\n\nOne of them ordered the Big Irish Burger and when it arrived he said “For fucks sake! Would you look at the size of that thing! It’s bigger than both me fists!”\n\nGood times",
            "title_similarity": "0.6828388",
            "sentiment_compound": -0.6209
        },
        {
            "id": "i60p0qh",
            "score": 2,
            "text": "I am shocked — SHOCKED — to learn that Outback Steakhouse is not authentically Australian.",
            "title_similarity": "0.4189719",
            "sentiment_compound": -0.6523
        },
        {
            "id": "i60p16k",
            "score": 2,
            "text": "I randomly thought of Yahoo Serious in Young Einstein last night. He’s Australian",
            "title_similarity": "0.62366027",
            "sentiment_compound": -0.0772
        },
        {
            "id": "i60p34c",
            "score": 2,
            "text": "Aussie here, no one eats at Outback Steakhouse. Place is shit! Food is shit! And not one thing on the menu is Aussie either lol.",
            "title_similarity": "0.57957506",
            "sentiment_compound": -0.8011
        },
        {
            "id": "i60pja2",
            "score": 2,
            "text": "Next you'll tell me that the original Rainforest Cafe location wasn't even in the rainforest!",
            "title_similarity": "0.49134654",
            "sentiment_compound": 0.3802
        },
        {
            "id": "i60pkdf",
            "score": 1,
            "text": "*That's not* a *steak knife*...",
            "title_similarity": "0.35451427",
            "sentiment_compound": 0.0
        },
        {
            "id": "i60pmkk",
            "score": 1,
            "text": "Well, it certainly worked.",
            "title_similarity": "-0.0517291",
            "sentiment_compound": 0.5423
        },
        {
            "id": "i60pnp2",
            "score": 3,
            "text": "We don’t actually do blooming onions in oz - we do onion rings on the bbq - no batter",
            "title_similarity": "0.57934874",
            "sentiment_compound": -0.296
        },
        {
            "id": "i60ps8f",
            "score": 2,
            "text": "The bread from outback is delicious I always eat too much of it before my meal and fill up. “You can just wrap that 60$ meal up please I’m full on the free bread”. Too bad they closed the one near me",
            "title_similarity": "0.5472841",
            "sentiment_compound": 0.7003
        },
        {
            "id": "i60pw1s",
            "score": 2,
            "text": "Chayze froyz plays ... and uh blewmin onyun.",
            "title_similarity": "0.09218042",
            "sentiment_compound": 0.25
        },
        {
            "id": "i60pyh0",
            "score": 1,
            "text": "The last time we went to that restaurant, it took 45 minutes for the food to arrive and it was cold. Never went back. Sizzler runs circles around Outback Steakhouse.",
            "title_similarity": "0.64145184",
            "sentiment_compound": 0.0
        },
        {
            "id": "i60pz09",
            "score": 1,
            "text": "It's also where merideth palmer gets her sirloin steak with coupons after sleeping with bruce myers for discounts on paper supplies",
            "title_similarity": "0.5849322",
            "sentiment_compound": 0.0
        },
        {
            "id": "i60q08e",
            "score": 10,
            "text": "As an Australian, until this post I honestly didn’t know Outback Steakhouse was meant to be Australia themed.",
            "title_similarity": "0.5854994",
            "sentiment_compound": 0.4588
        },
        {
            "id": "i60q0d8",
            "score": 1,
            "text": "Does this count as gentrification? Lol",
            "title_similarity": "0.07592511",
            "sentiment_compound": 0.4215
        },
        {
            "id": "i60q1kb",
            "score": 2,
            "text": "For some reason I always knew this. Idk why.",
            "title_similarity": "0.11605598",
            "sentiment_compound": -0.128
        },
        {
            "id": "i60q49z",
            "score": 1,
            "text": "And their food fucking sucks",
            "title_similarity": "0.1761955",
            "sentiment_compound": -0.4201
        },
        {
            "id": "i60q8xl",
            "score": 2,
            "text": "I met Crocodile Dundee (Paul Hogan) and got his autograph on a menu when I was like 10 in Aruba. Apparently he went to all the openings of new Outbacks for publicity? Cheesy but cool for a kid!",
            "title_similarity": "0.7474699",
            "sentiment_compound": 0.6114
        },
        {
            "id": "i60qa9v",
            "score": 1,
            "text": "That’s pretty fuckin American",
            "title_similarity": "0.21939695",
            "sentiment_compound": 0.4939
        },
        {
            "id": "i60qmr2",
            "score": 5,
            "text": "You’re trying to tell me the Bloomin’ Onion isn’t authentic Aussie cuisine?",
            "title_similarity": "0.36766994",
            "sentiment_compound": 0.0
        },
        {
            "id": "i60qwq5",
            "score": 2,
            "text": "I mean that's the exact vibe I get when going in there, maybe I'm wrong but I don't think Australia is known for its fantastic steaks in the Outback.",
            "title_similarity": "0.65612775",
            "sentiment_compound": 0.5927
        },
        {
            "id": "i60r6cu",
            "score": 1,
            "text": "I'm glad I go outside and use a grill and cook my steak. Can't imagine going to any themed restaurant. Long horns is so busy too. I don't get it.",
            "title_similarity": "0.6761453",
            "sentiment_compound": 0.4588
        },
        {
            "id": "i60r7dc",
            "score": 1,
            "text": "Well damn, that just ruins it! (so not the food , or service ..yeah not that)",
            "title_similarity": "0.21775682",
            "sentiment_compound": -0.3802
        },
        {
            "id": "i60rbat",
            "score": 5,
            "text": "Are you telling me that battering and deep-frying an entire onion then dipping it in mayonnaise was an American idea and not authentic Australian cuisine??? Preposterous",
            "title_similarity": "0.576717",
            "sentiment_compound": 0.0
        },
        {
            "id": "i60rce3",
            "score": 1,
            "text": "No rules ...\n\nJuz-Rih",
            "title_similarity": "0.12987696",
            "sentiment_compound": -0.296
        },
        {
            "id": "i60rfsr",
            "score": 1,
            "text": "Outback has amazing food allergy standards. I've heard from multiple people it's one of the few places they know will be safe to eat and treated allergens seriously.",
            "title_similarity": "0.4732319",
            "sentiment_compound": 0.7184
        },
        {
            "id": "i60rg4d",
            "score": 1,
            "text": "Nye rules, jist roit",
            "title_similarity": "0.08939839",
            "sentiment_compound": 0.0
        },
        {
            "id": "i60rsxl",
            "score": 1,
            "text": "A friend of mine called Outback as Outhouse by mistake one time and we've called it as such since then.  \n  \nI've never been but I'd be curious to try.   The restaurant, I mean.",
            "title_similarity": "0.658594",
            "sentiment_compound": 0.5187
        },
        {
            "id": "i60rxrn",
            "score": 1,
            "text": "We have a \"Brazilian\" restaurant chain that's also made by a couple college dudes that never stepped outside the united states. They serve tacos that have mac and cheese, and sushi inside their tacos. They have enchiladas mozzarella sauce.",
            "title_similarity": "0.7240633",
            "sentiment_compound": 0.4215
        },
        {
            "id": "i60sjl2",
            "score": 2,
            "text": "There is a popular and widespread chain in Canada called Boston Pizza. It was founded in Edmonton by Greek immigrants in the 1960s… My brother’s ex-girlfriend was from Boston, the first time she saw one of those restaurant she was confused.",
            "title_similarity": "0.7113111",
            "sentiment_compound": 0.128
        },
        {
            "id": "i60sm3s",
            "score": 1,
            "text": "I don’t get why my Covid 19 flavors ice cream parlor failed and Outback was successful 🤔🤷‍♂️🫠",
            "title_similarity": "0.5157253",
            "sentiment_compound": 0.128
        },
        {
            "id": "i60smcg",
            "score": 1,
            "text": "I have worked at an Outback for almost 3 years and never had Australian fun just Karen’s who say their steak is still bleeding even though it looks like charcoal…",
            "title_similarity": "0.6549212",
            "sentiment_compound": -0.0521
        },
        {
            "id": "i60sow8",
            "score": 2,
            "text": "My Singaporean friends were gobsmacked that \"Texas Chicken\" was a Singaporean invention.",
            "title_similarity": "0.6484081",
            "sentiment_compound": 0.4767
        },
        {
            "id": "i60ssl5",
            "score": 1,
            "text": "“American food and Australian fun.”\n\nSeems like a reasonable enough theme for a chain store tbh.",
            "title_similarity": "0.5653057",
            "sentiment_compound": 0.3612
        },
        {
            "id": "i60sze8",
            "score": 1,
            "text": "Also all the Outback’s in CA are owned by a separate group. Around the housing crisis they went from cutting own fries/making literally everything from scratch, to buying it canned/pre made to save on labor. The most expensive part of any restaurant. \n\nThey still make a lot of things from scratch, but the cheese fries and burgers were never the same. If I log it had a time machine, my first stop would be outback 1999 New Year’s Eve. 🤤 also I need to punch someone that night, so really it’s a two stone stop.",
            "title_similarity": "0.6770026",
            "sentiment_compound": -0.743
        },
        {
            "id": "i60t2cs",
            "score": 2,
            "text": "And Texas Roadhouse was created in New York.",
            "title_similarity": "0.37737983",
            "sentiment_compound": 0.25
        },
        {
            "id": "i60t7oq",
            "score": 1,
            "text": "My go to under $100 for two people “fancy dinner”",
            "title_similarity": "0.4370879",
            "sentiment_compound": 0.0
        },
        {
            "id": "i60t93b",
            "score": 1,
            "text": "One of them has a bombass mansion right off Bayshore Blvd.  At least they used too.\n\nI remember driving by in Friday/Saturday nights and they would have millions of dollars worth of cars sitting in the driveway (they were throwing a party or whatever.  So all their rich friends would come over).",
            "title_similarity": "0.6224401",
            "sentiment_compound": 0.8901
        },
        {
            "id": "i60tdeo",
            "score": 1,
            "text": "The raspberry butter is so good and a must at outbacks!",
            "title_similarity": "0.3283239",
            "sentiment_compound": 0.6166
        },
        {
            "id": "i60tkq5",
            "score": 1,
            "text": "I wish Outback would have gotten more elaborate with their theme instead of watering it down like they did. There's not much theming left anymore. I think they would do better with more decorations, Australian music, and animal statues to really push the theme.",
            "title_similarity": "0.49344856",
            "sentiment_compound": 0.7964
        },
        {
            "id": "i60ubpt",
            "score": 1,
            "text": "FAIR DINKUM",
            "title_similarity": "0.00044171885",
            "sentiment_compound": 0.3182
        },
        {
            "id": "i60ueo7",
            "score": 1,
            "text": "lol what is **real** in capitalism. You go to one Outback you’ve been to all Outback’s. Why do we feel the need to homogenize everything?",
            "title_similarity": "0.46844563",
            "sentiment_compound": 0.4215
        },
        {
            "id": "i60uiii",
            "score": 1,
            "text": "I bet most foreign themed places in america have very similar stories",
            "title_similarity": "0.3170228",
            "sentiment_compound": 0.0
        },
        {
            "id": "i60up97",
            "score": 1,
            "text": "My middle school was sponsored by our local Outback, and every year there was a field trip to the restaurant. It included a tour of the kitchen and the servers showing us an upside down map.",
            "title_similarity": "0.63457155",
            "sentiment_compound": 0.0
        },
        {
            "id": "i60ur34",
            "score": 1,
            "text": "Outback steakhouse : PUNISH  YOUR TOILET",
            "title_similarity": "0.48931414",
            "sentiment_compound": -0.6289
        },
        {
            "id": "i60urxi",
            "score": 1,
            "text": "I had the pleasure of first eating at this place in the mid '90s with my girlfriend who was a dual citizenship Aussie and her mother - who was from Australia. They were all very vocal, but humorous, about the inauthenticity of every single item on the menu.",
            "title_similarity": "0.7079644",
            "sentiment_compound": 0.7307
        },
        {
            "id": "i60usts",
            "score": 26,
            "text": "Wow, this is pretty amazing to read.\n\nI live in Tampa, FL and I used to work at a restaurant (not Outback) that’s owned by these 4 people. They are some incredible people. They even have trinkets around the restaurant that allude to Outback.  At the start of the 2020 lockdown, they sat all of us down on March 15th, and laid all of us off while telling us to get a head-start on filing unemployment.\n\nFor the rest of lockdown, these owners cooked lunch and dinner for all of us (pickup only, non contact, etc.) every single Monday, Wednesday and Friday. They let us come into the restaurant and get whatever we needed from the cooler, let us take extra toilet paper home, offered us more homemade masks…they are wonderful people.",
            "title_similarity": "0.72153366",
            "sentiment_compound": 0.9118
        },
        {
            "id": "i60uyw4",
            "score": 1,
            "text": "Americo-Australianian relations are at an all-time low. \n\nAs I'm sure you remember, in the late 1980s, the US experienced a short-lived infatuation with Australian culture. For some bizarre reason, the Aussies thought this would be a permanent thing. Of course, it wasn't.",
            "title_similarity": "0.5492201",
            "sentiment_compound": -0.128
        },
        {
            "id": "i60v8sb",
            "score": 2,
            "text": "My whole life is a lie.",
            "title_similarity": "0.16983454",
            "sentiment_compound": 0.0
        },
        {
            "id": "i60vp59",
            "score": 2,
            "text": "As someone who had worked in the kitchen of this hell hole for 10 years before a career reboot...no shit!\n\nIt's a basic steakhouse where the only real innovation is every quarter they make something simple into something complicated.  Also every 6 months they come out with a new 5,000,000 calorie appetizer that i can only imagine the creation process sounding like a early 2000s stoner conversation.\n\n\"Dude, what if we, like, put the cheese fries...ON TOP of the bloomin' onion?\n\n\"Bruuuuuuuuuuh\"",
            "title_similarity": "0.6444004",
            "sentiment_compound": 0.1091
        },
        {
            "id": "i60vpwo",
            "score": 1,
            "text": "Still my husband’s favorite restaurant. I remember when the first Outback restaurants opened my county. I think there were two. One north and one south. The wait was over 3 hours on any given Friday or Saturday. Now there’s one or two in every city and some still have a wait.",
            "title_similarity": "0.62859815",
            "sentiment_compound": 0.4588
        },
        {
            "id": "i60vz8e",
            "score": 2,
            "text": "No wonder Australia never heard of bloomin onion lol",
            "title_similarity": "0.56790686",
            "sentiment_compound": 0.1531
        },
        {
            "id": "i60w8rx",
            "score": 1,
            "text": "That’s fine. If you’re looking for a better steak in an Australian setting you’re shit out of luck",
            "title_similarity": "0.5758194",
            "sentiment_compound": 0.4767
        },
        {
            "id": "i60wu4j",
            "score": 15,
            "text": "I worked at Outback Steakhouse for over 10 years.  Loved it.  If you enjoy their ranch dressing, here's how to make it.  I had to modify the amounts, since their actual recipe is for literally making gallons of it:\n\nCombine:\n1 cup buttermilk\n1/2 Teaspoon salt\n1/2 Teaspoon black pepper\n1/2 Teaspoon granulated/powdered onion\n1/2 Teaspoon granulated/powdered garlic\n1/3 Teaspoon cayenne pepper\n\nOnce mixed, add:\n2 cups mayo\n\nEnjoy!",
            "title_similarity": "0.5999518",
            "sentiment_compound": 0.9117
        },
        {
            "id": "i60wukx",
            "score": 1,
            "text": "The only reason I want to go there is to get the blooming onion. Is a Testament of American ingenuity",
            "title_similarity": "0.48867795",
            "sentiment_compound": 0.0772
        },
        {
            "id": "i60wxz8",
            "score": 1,
            "text": "When I (Aussie) lived in America, everyone wanted to know if I liked “bloomin’ onions”. Apparently it’s like some sort of fried onion ring situation. I had to explain that this not actually an Australian dish.",
            "title_similarity": "0.67592424",
            "sentiment_compound": 0.6486
        },
        {
            "id": "i60wy4p",
            "score": 1,
            "text": "As an Australian who visited outback steakhouse for the first time about a year ago (in Australia), I was shocked by how good it was. \n\nBeen a couple times since. As good as any other steakhouse and no worse on pricing.",
            "title_similarity": "0.7117206",
            "sentiment_compound": 0.7231
        },
        {
            "id": "i60wza3",
            "score": 3,
            "text": "You mean to tell me Blooming Onions are not Australian cuisine?",
            "title_similarity": "0.35507208",
            "sentiment_compound": 0.0
        },
        {
            "id": "i60xee4",
            "score": 2,
            "text": "Didn't know this but not surprised. They Don't even call it shrimp over there; it's prawns (according to a cooking show).",
            "title_similarity": "0.55438447",
            "sentiment_compound": -0.2498
        },
        {
            "id": "i60xk0x",
            "score": 1,
            "text": "Grew up in florida now live across the country. Used to love outback and interesting enoufh Also from the tampa bay area are hootes, firehouse subs,bone fish grill and red losbster. Florida is a silly place",
            "title_similarity": "0.6467358",
            "sentiment_compound": 0.7906
        },
        {
            "id": "i60xppl",
            "score": 1,
            "text": "I got horrible diarrhea every time I ate there. Finish eating, shitting yoohoo within 20 mins. Never found out what it was but not going there sure has helped.",
            "title_similarity": "0.5522503",
            "sentiment_compound": -0.6801
        },
        {
            "id": "i60xy70",
            "score": 1,
            "text": "I had dinner with one of these owners in Tampa at one of their restaurants near the office headquarters.  Very nice guy.  The company is called Bloomin' brands.  I worked on their computer systems about 8 years ago.  A bunch of the office people and the owner took us out for dinner at one of his restaurants.  Good food, and great people.",
            "title_similarity": "0.6318557",
            "sentiment_compound": 0.8777
        },
        {
            "id": "i60y3tp",
            "score": 1,
            "text": "Outback is hit or miss these days.",
            "title_similarity": "0.23243779",
            "sentiment_compound": -0.1531
        },
        {
            "id": "i60yd0b",
            "score": 1,
            "text": "I knew it was fake Australian but I thought it was at least some approximation of Australian food. What do Australian eat? Is it actually only Vegemite?",
            "title_similarity": "0.57193756",
            "sentiment_compound": -0.3421
        },
        {
            "id": "i60ykfm",
            "score": 2,
            "text": "Prior to deploying for 14 months at the South Pole, Outback was only option.  One of the science team was from OZ.  She found the entire experience hysterically funny and not a bit Aussie.",
            "title_similarity": "0.65698755",
            "sentiment_compound": 0.4404
        },
        {
            "id": "i60yyya",
            "score": 1,
            "text": "hey I live there haha",
            "title_similarity": "0.07692824",
            "sentiment_compound": 0.4588
        },
        {
            "id": "i60z119",
            "score": 1,
            "text": "And achieved neither.",
            "title_similarity": "-0.007728869",
            "sentiment_compound": 0.0
        },
        {
            "id": "i60zbnt",
            "score": 2,
            "text": "I remember often seeing these 2 Aussie dudes always around the local bar scene back in the 80s. I dont think they ever had to buy their own drinks.",
            "title_similarity": "0.64339346",
            "sentiment_compound": 0.0
        },
        {
            "id": "i60zq2g",
            "score": 2,
            "text": "It reminds me a bit of the origin of Tiki Bars, except the cultural appropriation is significantly less egregious.",
            "title_similarity": "0.2991836",
            "sentiment_compound": 0.0
        },
        {
            "id": "i60zz5s",
            "score": 1,
            "text": "I know two people who own Irish pubs that have never been to Ireland. That doesn’t make the beer any less good!",
            "title_similarity": "0.55774486",
            "sentiment_compound": 0.4402
        },
        {
            "id": "i6100vb",
            "score": 2,
            "text": "TIL Outback Steakhouse is Australian themed. Never could afford going haha",
            "title_similarity": "0.67984873",
            "sentiment_compound": 0.4588
        },
        {
            "id": "i61019c",
            "score": 1,
            "text": "Explains why everything seems so forced.",
            "title_similarity": "0.022541739",
            "sentiment_compound": -0.5949
        },
        {
            "id": "i6109sh",
            "score": 2,
            "text": "In all fairness, Florida is basically the Australia of America. All of the wildlife and a good portion of the plant life are trying to kill you there.",
            "title_similarity": "0.6205243",
            "sentiment_compound": -0.4215
        },
        {
            "id": "i610mw3",
            "score": 1,
            "text": "Man could they cook an onion",
            "title_similarity": "0.24995108",
            "sentiment_compound": 0.0
        },
        {
            "id": "i610qj7",
            "score": 1,
            "text": "I wouldn't imagine anyone would think outback is Australian food. Like, nobody thinks taco bell is Mexican right?",
            "title_similarity": "0.6007644",
            "sentiment_compound": 0.3612
        },
        {
            "id": "i610r37",
            "score": 1,
            "text": "If anyone really needed an example, this is classic cultural appropriation. Superficial mimicry for costume or popularity.",
            "title_similarity": "0.2912318",
            "sentiment_compound": 0.4767
        },
        {
            "id": "i610uwn",
            "score": 1,
            "text": "True I had pasta there. Not sure how that’s Australian lol",
            "title_similarity": "0.5164625",
            "sentiment_compound": 0.5629
        },
        {
            "id": "i610w60",
            "score": 1,
            "text": "Dive on in!",
            "title_similarity": "0.12683706",
            "sentiment_compound": 0.0
        },
        {
            "id": "i610ybv",
            "score": 1,
            "text": "My folks and I were at one in Orlando one night while on vacation.  An Australian family was sitting behind us, and we were adjacent to the kitchen.  The whole time we were there we heard giggles in the back from staff with phrases like, “You’re kidding me, are they really?” and, “They get it though right?  Like, they know where they are?  They don’t?!”",
            "title_similarity": "0.70802325",
            "sentiment_compound": 0.8152
        },
        {
            "id": "i611c9d",
            "score": 1,
            "text": "And Arizona Tea was founded in Brooklyn with no connection to the state of Arizona. I've been scammed.",
            "title_similarity": "0.5565918",
            "sentiment_compound": -0.296
        },
        {
            "id": "i611ddw",
            "score": 1,
            "text": "Yeah? You know where Philadelphia cream cheese be from? Huh, do ya?",
            "title_similarity": "0.29895183",
            "sentiment_compound": 0.4098
        },
        {
            "id": "i611e82",
            "score": 2,
            "text": "As an Australian I would like my royalties check please.",
            "title_similarity": "0.38061503",
            "sentiment_compound": 0.5859
        },
        {
            "id": "i611g9c",
            "score": 1,
            "text": "That’s why I don’t eat there because it’s not authentic",
            "title_similarity": "0.23518279",
            "sentiment_compound": 0.0
        },
        {
            "id": "i611i34",
            "score": 1,
            "text": "Crocodile Dundee Sheila scene",
            "title_similarity": "0.47663513",
            "sentiment_compound": 0.0
        },
        {
            "id": "i611m99",
            "score": 1,
            "text": "When I served and bartended at the OB, both stores closed now, I would lead in with welcome to Outback Steakhouse, we are all Australian. I always thought it was funny. You’re a block and she’s a shelia. Lol",
            "title_similarity": "0.7677363",
            "sentiment_compound": 0.7003
        },
        {
            "id": "i611mb2",
            "score": 1,
            "text": "IDC this place slaps",
            "title_similarity": "0.064071864",
            "sentiment_compound": 0.0
        },
        {
            "id": "i611mdu",
            "score": 1,
            "text": "This is the origin story of most American and Mexican food places in Europe.",
            "title_similarity": "0.41297883",
            "sentiment_compound": 0.0
        },
        {
            "id": "i611xf5",
            "score": 1,
            "text": "Every time I leave there I feel like it was a good day mate",
            "title_similarity": "0.2700395",
            "sentiment_compound": 0.6369
        },
        {
            "id": "i611xu9",
            "score": 1,
            "text": "Similar to the Norte Dame Fighting Irish",
            "title_similarity": "0.21554649",
            "sentiment_compound": -0.3612
        },
        {
            "id": "i6120nl",
            "score": 2,
            "text": "Boston Pizza is Canadian and has absolutely nothing to do with Boston.",
            "title_similarity": "0.5481209",
            "sentiment_compound": 0.0
        },
        {
            "id": "i6122ee",
            "score": 1,
            "text": "As someone from the Tampa area, you can also congratulate on Hooters and like 5 other major chains that started throughout the state like Olive Garden.",
            "title_similarity": "0.4887703",
            "sentiment_compound": 0.802
        },
        {
            "id": "i6125w3",
            "score": 2,
            "text": "My ex husband's parents lived in Australia for a few years. While home visiting, we went out to eat with them at Outback. My FIL had Australian cash in his wallet and decided to get the manager in on a prank on our server. She came to pick up the bill asked saw it was not US cash and explained that they only take US currency or credit. My FIL asked her to get the manager. The manager came over and explained the same thing, and my FIL said he didn't have any other way to pay. The manager told the server she was going to have to cover it since we couldn't pay. Her face went white and my FIL immediately told her they were just kidding. They tipped her very well and she was a good sport.",
            "title_similarity": "0.7192878",
            "sentiment_compound": 0.8014
        },
        {
            "id": "i612df6",
            "score": 1,
            "text": "Favolis was started in Kentucky by a business dude from Japan.",
            "title_similarity": "0.5145069",
            "sentiment_compound": 0.0
        },
        {
            "id": "i612e42",
            "score": 3,
            "text": "Has nothing to do with Australia but still has pretty decent food imo. They’re a guilty pleasure of mine",
            "title_similarity": "0.5432567",
            "sentiment_compound": 0.7684
        },
        {
            "id": "i612fqi",
            "score": 2,
            "text": "Texas Roadhouse is based out of Kentucky and Moe's Southwest Grill is from Atlanta.\n\nI will say that Texas Roadhouse is at least reasonably close to the kinds of things people eat in Texas. Moe's is only slightly more southwestern than New England Clam Chowder.",
            "title_similarity": "0.55386126",
            "sentiment_compound": 0.0
        },
        {
            "id": "i612ifd",
            "score": 1,
            "text": "Now explain Yahoo Serious",
            "title_similarity": "0.14308974",
            "sentiment_compound": -0.0772
        },
        {
            "id": "i612msr",
            "score": 2,
            "text": "i fucking love Outback",
            "title_similarity": "0.2585345",
            "sentiment_compound": 0.6697
        },
        {
            "id": "i612psh",
            "score": 3,
            "text": "My favorite example of the whole \"this brand is not from where you think it is\" has to be Häagen-Dazs. Founded by Reuben Mattus, a polish jew in the Bronx, and named such because \"it sounded danish\". Apparently, Mattus wanted the name to be danish-sounding to honor the danes and their treatment of the jews during WWII. Undortunately, the letter \"ä\" and digraphs like \"zs\" do not exist in the danish language.\n\nSo the intention was nice, but the execution was less than ideal.",
            "title_similarity": "0.5140714",
            "sentiment_compound": 0.873
        },
        {
            "id": "i612rp1",
            "score": 1,
            "text": "They used to be pretty quality too. Haven't been in like 10 years though",
            "title_similarity": "0.16698363",
            "sentiment_compound": 0.2709
        },
        {
            "id": "i612u63",
            "score": 1,
            "text": "When Australians visit America, do they go to Outback? You know for the lols.",
            "title_similarity": "0.51890033",
            "sentiment_compound": 0.0
        },
        {
            "id": "i612w5f",
            "score": 1,
            "text": "Great, next you're gonna tell me Foster's isn't Australian for beer.",
            "title_similarity": "0.40617457",
            "sentiment_compound": 0.6249
        },
        {
            "id": "i612yla",
            "score": 1,
            "text": "The best thing about Outback Steakhouse is the bathrooms.  They don't have toilets.  They have a BIDET MATE!",
            "title_similarity": "0.62457764",
            "sentiment_compound": 0.6696
        },
        {
            "id": "i612yy6",
            "score": 1,
            "text": "you would also learn this if you ate there",
            "title_similarity": "0.11761229",
            "sentiment_compound": 0.0
        },
        {
            "id": "i6132ko",
            "score": 1,
            "text": "Also the Subaru Outback. Subaru is a company owned by Fuji heavy industries out of Japan.",
            "title_similarity": "0.36260808",
            "sentiment_compound": 0.0
        },
        {
            "id": "i6136xu",
            "score": 1,
            "text": "Such a Florida story lol",
            "title_similarity": "0.28875512",
            "sentiment_compound": 0.4215
        },
        {
            "id": "i6139wv",
            "score": 1,
            "text": "Only been there once and the shrimp was some of the worst I've ever had.\n\nNever been back since.  \n\nThis was also almost 15 years ago, so it could have just been a shitty day to go.",
            "title_similarity": "0.5764052",
            "sentiment_compound": -0.8271
        },
        {
            "id": "i613e3z",
            "score": 2,
            "text": "And every January 1st we celebrate this with the Outback Bowl.\n\nRIP outback bowl.",
            "title_similarity": "0.49722305",
            "sentiment_compound": 0.5719
        },
        {
            "id": "i613ryg",
            "score": 1,
            "text": "Yeah, any cartoon in the late 80s, early 90s had boomerangs. It was the ultimate precision weapon. When they started showing up to toy stores around the US, I was so disappointed about how hard they were to use.",
            "title_similarity": "0.5722226",
            "sentiment_compound": -0.6588
        },
        {
            "id": "i613v93",
            "score": 2,
            "text": "I mean Outback Steakhouse actually has pretty decent food compared to other chains, imo. Their steaks are really good",
            "title_similarity": "0.46516252",
            "sentiment_compound": 0.7501
        },
        {
            "id": "i613xdo",
            "score": 1,
            "text": "you mean to tell me the bloomin’ onion isn’t a naturally found vegetable in the ol’ outback",
            "title_similarity": "0.44135427",
            "sentiment_compound": 0.0
        },
        {
            "id": "i613xil",
            "score": 1,
            "text": "And all this time ive been saying how I love Australian food",
            "title_similarity": "0.5041617",
            "sentiment_compound": 0.6369
        },
        {
            "id": "i613z4q",
            "score": 2,
            "text": "Reminds me of the whole \"japa ese steakhouse\" idea, where you get American food cooked in front of you with a splash of teriyaki",
            "title_similarity": "0.6277065",
            "sentiment_compound": 0.0
        },
        {
            "id": "i613zqd",
            "score": 1,
            "text": "Can I r/copypasta this?",
            "title_similarity": "-0.021700718",
            "sentiment_compound": 0.0
        },
        {
            "id": "i6143aa",
            "score": 1,
            "text": "Worked there for a number of years. “Do you have an Auuuussstralllliannnn Aaaccccceeeennnttt?” gets old very quickly…..",
            "title_similarity": "0.20073056",
            "sentiment_compound": 0.0772
        },
        {
            "id": "i61476j",
            "score": 2,
            "text": "Texas Roadhouse was started in Kentucky.",
            "title_similarity": "0.34856695",
            "sentiment_compound": 0.0
        },
        {
            "id": "i6149j3",
            "score": 2,
            "text": "I had an Australian friend who when I jokingly asked if they had Outbacks in Australia she said \"oh yeah! But they're American themed, so what are they like over there?\" And I still don't know whether she was kidding or not",
            "title_similarity": "0.6025001",
            "sentiment_compound": 0.7809
        },
        {
            "id": "i614i18",
            "score": 4,
            "text": "Alice Springs Chicken from Outback is 🔥",
            "title_similarity": "0.47102058",
            "sentiment_compound": -0.34
        },
        {
            "id": "i614pld",
            "score": 1,
            "text": "I ate at an Outback Steakhouse around 1996.  The server and manger were so rude, I’ve never gone back to any Outback location. I can’t shake how poorly we were treated for simply being young (we were all 18-20) at the time.",
            "title_similarity": "0.67775536",
            "sentiment_compound": -0.6774
        },
        {
            "id": "i614w8f",
            "score": 1,
            "text": "Just like the Filipino Japanese hibachi places in Appalachia.",
            "title_similarity": "0.40214598",
            "sentiment_compound": 0.3612
        },
        {
            "id": "i614wek",
            "score": 1,
            "text": "Just like Olive Garden has nothing to do with actual Italian food. It was founded in Florida by relocated New York Jews",
            "title_similarity": "0.6879063",
            "sentiment_compound": 0.3612
        },
        {
            "id": "i6152ld",
            "score": 1,
            "text": "In the late 80s, America went through its \"Aussie\" phase.",
            "title_similarity": "0.30451158",
            "sentiment_compound": 0.0
        },
        {
            "id": "i615471",
            "score": 1,
            "text": "Kinda similar story to Texas roadhouse",
            "title_similarity": "0.28631014",
            "sentiment_compound": 0.0
        },
        {
            "id": "i6154cr",
            "score": 1,
            "text": "There are many Americans who consider themselves \"rugged individualists\".\n Crocodile Dundee was the embodiment of such rugged individualism,with a exotic twist. Americans latched onto a person(character) and a culture that they could relate to and and also inspire to. \nOf course it's all flights of fantasy. Most people would hate being in the environment Dundee is portrayed living in.",
            "title_similarity": "0.5866722",
            "sentiment_compound": -0.0679
        },
        {
            "id": "i615aab",
            "score": 1,
            "text": "TIL Outback Steakhouse was supposed to be Australian themed. As a Canadian I just assumed it was wild west themed",
            "title_similarity": "0.66436195",
            "sentiment_compound": 0.0
        },
        {
            "id": "i615y6b",
            "score": 1,
            "text": "And it worked!",
            "title_similarity": "-0.06140863",
            "sentiment_compound": 0.0
        },
        {
            "id": "i6167t6",
            "score": 1,
            "text": "The bottom line w/ Outback is the Mad Max burger was F-ing awesome. \n\nThen they just randomly took it off the menu one day. \n\nSo they can just go fuck themselves.",
            "title_similarity": "0.6785402",
            "sentiment_compound": -0.3818
        },
        {
            "id": "i6168vv",
            "score": 1,
            "text": "Interesting. I've lived in Tampa Bay area all my life and never knew that.",
            "title_similarity": "0.53805006",
            "sentiment_compound": 0.4019
        },
        {
            "id": "i616dy7",
            "score": 1,
            "text": "I know how you Aussies must feel, after being in korea for so long and being back in America, it’s so hard to find decent korean restaurants that aren’t some fusion food or BBQ place that serves absolute crap",
            "title_similarity": "0.57415247",
            "sentiment_compound": -0.5371
        },
        {
            "id": "i616ssn",
            "score": 2,
            "text": "But...but...I've had their Melbourne steak and it was friggin' outSTANDing.",
            "title_similarity": "0.56942606",
            "sentiment_compound": 0.6478
        },
        {
            "id": "i617djg",
            "score": 3,
            "text": "At least they have authentic Australian beer! And the food is pretty good tbh",
            "title_similarity": "0.43131465",
            "sentiment_compound": 0.75
        },
        {
            "id": "i617glx",
            "score": 3,
            "text": "3403 Henderson Blvd, Tampa, FL 33609 if you're looking to visit",
            "title_similarity": "0.3892978",
            "sentiment_compound": 0.0
        },
        {
            "id": "i617maj",
            "score": 1,
            "text": "Take that blooming onion, throw it against a wall... a hot mess of grease.",
            "title_similarity": "0.3312747",
            "sentiment_compound": -0.3612
        },
        {
            "id": "i617x3n",
            "score": 4,
            "text": "Helped create the new app for Outback, great people to work with! They are really trying to enhance their ordering ahead and digital app sales, some cool stuff should be coming out in the near future!",
            "title_similarity": "0.42150003",
            "sentiment_compound": 0.8436
        },
        {
            "id": "i617ymj",
            "score": 1,
            "text": "So posers",
            "title_similarity": "-0.121687636",
            "sentiment_compound": 0.0
        },
        {
            "id": "i6183a6",
            "score": 1,
            "text": "So I’m American, but my maternal grandmother grew up in Australia. This makes Outback a hilarious subject of discussion in my family. The burgers are good, and I’ll play along with the Disneygeographic kitsch if it gets a second order of pumpernickel bread",
            "title_similarity": "0.72575974",
            "sentiment_compound": 0.8885
        },
        {
            "id": "i618iv0",
            "score": 1,
            "text": "I can clearly remember being at a street fair in my youth and some outback place was serving deep fried onion. \"Who the fuck wants *that*?\" I remember thinking. Few years later these motherfuckers had a chain. Some people will eat any old fucking thing. Goddamn goats.",
            "title_similarity": "0.64431685",
            "sentiment_compound": -0.4364
        },
        {
            "id": "i618v5e",
            "score": 1,
            "text": "Lol just learned last night that Red Stripe beer is originally from Galena,Illinois.",
            "title_similarity": "0.5251336",
            "sentiment_compound": 0.4215
        },
        {
            "id": "i618wnn",
            "score": 1,
            "text": "The best part is that they refused to ever visit Australia when Outback blew up and they got rich",
            "title_similarity": "0.6330079",
            "sentiment_compound": 0.765
        },
        {
            "id": "i6195cx",
            "score": 1,
            "text": "Two friends from Australia after going there: The only Australian things about that place are the beer, and the option to get your steak done on the barbie.",
            "title_similarity": "0.74861515",
            "sentiment_compound": 0.4767
        },
        {
            "id": "i6197x6",
            "score": 1,
            "text": "“American food and Australian fun” ok I’m sorry but the last two times I went to outback nothing about it was “Australian fun” there was a damn balloon maker lmao",
            "title_similarity": "0.7455548",
            "sentiment_compound": 0.5023
        },
        {
            "id": "i619akc",
            "score": 1,
            "text": "Crocodile Dundee, of those movies everyone knows but it’s actually a pretty lame ass movie.",
            "title_similarity": "0.54058516",
            "sentiment_compound": -0.631
        },
        {
            "id": "i619ggo",
            "score": 1,
            "text": "Outback is exactly a Floridian idea of a good restaurant.",
            "title_similarity": "0.46273082",
            "sentiment_compound": 0.4404
        },
        {
            "id": "i619kxq",
            "score": 1,
            "text": "As someone who lives in Tampa I Was today years old when I found out it was founded here",
            "title_similarity": "0.39584428",
            "sentiment_compound": 0.0
        },
        {
            "id": "i619w9t",
            "score": 1,
            "text": "And shitty pan fried steaks.",
            "title_similarity": "0.41598332",
            "sentiment_compound": -0.5574
        },
        {
            "id": "i61aw70",
            "score": 1,
            "text": "Like the movie... The Shrimp on the Barbie.",
            "title_similarity": "0.41928405",
            "sentiment_compound": 0.3612
        },
        {
            "id": "i61b6tz",
            "score": 1,
            "text": "Great place to go after catching the Yahoo Serious film festival.",
            "title_similarity": "0.45908797",
            "sentiment_compound": 0.7906
        },
        {
            "id": "i61boa5",
            "score": 1,
            "text": "I miss their chicken tacos, otherwise the food isn’t that great.",
            "title_similarity": "0.45221943",
            "sentiment_compound": 0.5423
        },
        {
            "id": "i61bvtq",
            "score": 1,
            "text": "They actually tell you this as part of the hiring process.",
            "title_similarity": "0.12057252",
            "sentiment_compound": 0.0
        },
        {
            "id": "i61c0fw",
            "score": 1,
            "text": "Not unlike Taco Bell then... 'Wait, they serve different food in Mexico?\"",
            "title_similarity": "0.4683769",
            "sentiment_compound": 0.0
        },
        {
            "id": "i61caht",
            "score": 1,
            "text": "Spent 20 years under the osi umbrella, fuck them and that shit company.",
            "title_similarity": "0.45434165",
            "sentiment_compound": -0.7964
        },
        {
            "id": "i61cbio",
            "score": 3,
            "text": "No way!\n\nNow if only someone were to tell me that Fosters is not Australian for beer, i am not sure what i will have left to base my life on.",
            "title_similarity": "0.41619074",
            "sentiment_compound": -0.5352
        },
        {
            "id": "i61cc78",
            "score": 1,
            "text": "I knew the guy that made the little wooden boomerangs the servers used to wear. They were really cool. Still not sure why outback decided to discontinue them.",
            "title_similarity": "0.4628805",
            "sentiment_compound": 0.1608
        },
        {
            "id": "i61cesh",
            "score": 1,
            "text": "When I was 7 or 8 there was an OutBack commercial where the people in the restaurant finished eating and ran out a back door to a private surf beach. I had seen the commercial before ever visiting so when my parents were bringing me for the first time, they let me show up in a swim suit 😂",
            "title_similarity": "0.76660347",
            "sentiment_compound": 0.4404
        },
        {
            "id": "i61cjwr",
            "score": 1,
            "text": "I eat at the first outback a few times a year it’s off Henderson in Tampa they have a little plaque up there that’s says it was the OG outback it is attached to a strip mall",
            "title_similarity": "0.6234625",
            "sentiment_compound": 0.0
        },
        {
            "id": "i61clcu",
            "score": 1,
            "text": "I'd say the did a pretty good job for people who never been to Australia nailing the national dish, The Blooming Onion.",
            "title_similarity": "0.6572489",
            "sentiment_compound": 0.7269
        },
        {
            "id": "i61csw9",
            "score": 1,
            "text": "Sounds like the Hanggen Daz ice cream, which means absolutely nothing in german/dutch/whatever and iirc was made by an american  with zero relation to the implied country of origin too.",
            "title_similarity": "0.5851575",
            "sentiment_compound": 0.3612
        },
        {
            "id": "i61cvds",
            "score": 1,
            "text": "There was Australia fever in the 80s, that includes the kids shows Noozles.",
            "title_similarity": "0.4694708",
            "sentiment_compound": 0.0
        },
        {
            "id": "i61d0q1",
            "score": 2,
            "text": "I lived going to the Outback in Ebina, Japan when I lived there. Reminded me of home. 🇺🇲",
            "title_similarity": "0.46551785",
            "sentiment_compound": 0.0
        },
        {
            "id": "i61dei1",
            "score": 2,
            "text": "Yep, I lived in New Port Richey and it was a huge deal. Eventually a second one opened a tiny bit north of Gulf View Square mall, in the parking of a Pharmor and Walmart.  . Anyone remember that? Is it still there? I think there was an Olive Garden too. New Port Richey was a perfect place for the new chains. Options were new!",
            "title_similarity": "0.5177735",
            "sentiment_compound": 0.8339
        },
        {
            "id": "i61dkdo",
            "score": 3,
            "text": "I was dating an Australian guy back when I lived in Vail. There was an outback in the next town, Avon. For a kick, I took him there. When we walked in, the first thing he saw was the Australian flag was upside down. God, the look on his face at all the Aussie shit was priceless",
            "title_similarity": "0.6958802",
            "sentiment_compound": -0.3612
        },
        {
            "id": "i61drjo",
            "score": 12,
            "text": "As an Australian, I’ve seen their menu. Apart from a few Australian wines, there’s absolutely nothing on the menu that’s remotely Australian. Simple as that.",
            "title_similarity": "0.5966245",
            "sentiment_compound": 0.0
        },
        {
            "id": "i61ec4r",
            "score": 1,
            "text": "Honestly I wouldn't mind a restaurant that actually sold Australian food. Especially meat pies.",
            "title_similarity": "0.6276858",
            "sentiment_compound": 0.4588
        },
        {
            "id": "i61efc3",
            "score": 6,
            "text": "Australians should retaliate by opening a chain called Florida Crackhouse.",
            "title_similarity": "0.6225616",
            "sentiment_compound": 0.0
        },
        {
            "id": "i61etpr",
            "score": 1,
            "text": "There is an Outback restaurant in Coober Pedy, Australia (small, touristy mining town between Adelaide and Uluru) that bears some resemblance to the US chain. \n\nSomething very meta going on here. Australian restaurant emulating an American restaurant based on Australia.",
            "title_similarity": "0.66702193",
            "sentiment_compound": 0.0
        },
        {
            "id": "i61f893",
            "score": 2,
            "text": "Next ur gonna tell me Olive Garden isn't an authentic Italian eatery who cornered the market entirely on the quality of their nona's family recipes",
            "title_similarity": "0.5690871",
            "sentiment_compound": -0.2732
        },
        {
            "id": "i61fxio",
            "score": 2,
            "text": "Conan learns Australian slang\n\nhttps://youtu.be/L94M4xQcPYk",
            "title_similarity": "0.45749754",
            "sentiment_compound": 0.0
        },
        {
            "id": "i61g3cm",
            "score": 1,
            "text": "Back in 1998 some friends of mine went to Outback with some Australian Exchange Students. The Aussies politely pointed out that they had the Australian flag upside down as part of their: let's throw a bunch of random crap on the wall\" decor style that all those stupid chains do.",
            "title_similarity": "0.7358462",
            "sentiment_compound": -0.4404
        },
        {
            "id": "i61g9fw",
            "score": 1,
            "text": "You call that an onion ring, that's not an onion, this is a bloomin' onion.  Pardon my French.",
            "title_similarity": "0.3210895",
            "sentiment_compound": 0.3182
        },
        {
            "id": "i61go68",
            "score": 1,
            "text": "And it worked.",
            "title_similarity": "-0.09704949",
            "sentiment_compound": 0.0
        },
        {
            "id": "i61gth4",
            "score": 1,
            "text": "Checks out",
            "title_similarity": "-0.1408081",
            "sentiment_compound": 0.0
        },
        {
            "id": "i61h40f",
            "score": 1,
            "text": "\"You see, Bart's childish prank couldn't have come at a worst time  Amarican and Australia relationship are at a all time low.\"",
            "title_similarity": "0.4924129",
            "sentiment_compound": -0.8126
        },
        {
            "id": "i61h4lg",
            "score": 1,
            "text": "I used to work at Outback. When I would get to 40 hours a week, they would have me shave hours because they, “**couldn’t afford to pay 1 1/2 times the $2.13/hour I made an hour.**”\n\nAlso, nothing is fresh there anymore. It’s a bummer.",
            "title_similarity": "0.54931056",
            "sentiment_compound": -0.6075
        },
        {
            "id": "i61hbjc",
            "score": 1,
            "text": "Most Australians call shrimp, prawns. So the whole throw another shrimp on the barby is pretty insulting.",
            "title_similarity": "0.5355844",
            "sentiment_compound": 0.0
        },
        {
            "id": "i61hf2e",
            "score": 1,
            "text": "What the fuck man! Now I have to appreciate Florida for something",
            "title_similarity": "0.33905745",
            "sentiment_compound": -0.2714
        },
        {
            "id": "i61hhxf",
            "score": 1,
            "text": "Lmfao, that's great.",
            "title_similarity": "-0.018235642",
            "sentiment_compound": 0.8225
        },
        {
            "id": "i61hyq7",
            "score": 2,
            "text": "Similarly, in Alberta we have a restaurant chain called Boston Pizza that sells nothing related to Boston.",
            "title_similarity": "0.6272472",
            "sentiment_compound": 0.0
        },
        {
            "id": "i61i75f",
            "score": 2,
            "text": "They serve Aussie food or just dress the place up with outdated Aussie stereotypes while selling steak?",
            "title_similarity": "0.56071365",
            "sentiment_compound": 0.0
        },
        {
            "id": "i61ibjc",
            "score": 1,
            "text": "When I visited Australia a few years ago, I was absolutely SHOCKED to see they had an Outback Steakhouse in one of towns we passed through",
            "title_similarity": "0.715924",
            "sentiment_compound": -0.5149
        },
        {
            "id": "i61iliy",
            "score": 1,
            "text": "It’s the same thing as Pollo Tropocal created by Larry and Stuart Harris. Or Chipotle created by another white dude, Steve Ells.",
            "title_similarity": "0.41537255",
            "sentiment_compound": 0.4588
        },
        {
            "id": "i61imjf",
            "score": 1,
            "text": "I have consumed so many blooming onions and coconut shrimp and it's all been culturally appropriated. \n\nMy tummy knows no shame!",
            "title_similarity": "0.56785357",
            "sentiment_compound": 0.4303
        },
        {
            "id": "i61j90k",
            "score": 1,
            "text": "I heard it started as out back stake haus. A clandestine vampire hunter club behind a reno Nevada 7-11. That's what I heard anyway.",
            "title_similarity": "0.52417374",
            "sentiment_compound": 0.0
        },
        {
            "id": "i61jgjl",
            "score": 2,
            "text": "I worked at Outback for a year. During my training they specifically told me it was a \"creole style\" because of the steak seasoning and because they knew people would ask.\n\nI can't say if this is still the same now, but when I worked there it was a 70% scratch kitchen which for a chain was impressive.  The head chef would also cut the steaks himself from sides of beef. The only things that I know came in pre-made or frozen were some of the salad dressings, the fish, and the bread.\n\nIn the other chains I had worked for (Applebees and Olive Garden) it wasnt even close to being the case.",
            "title_similarity": "0.674912",
            "sentiment_compound": 0.4215
        },
        {
            "id": "i61jrq1",
            "score": 1,
            "text": "I had one of the best filet mignon dinners ever at Outback.  And the price was reasonable.",
            "title_similarity": "0.4951542",
            "sentiment_compound": 0.6369
        },
        {
            "id": "i61jvkq",
            "score": 2,
            "text": "[deleted]",
            "title_similarity": "-0.016461087"
        },
        {
            "id": "i61k1ur",
            "score": 1,
            "text": "Their \"Blooming Onion\" was an awesome starter dish, though.",
            "title_similarity": "0.37427872",
            "sentiment_compound": 0.6249
        },
        {
            "id": "i61kkaq",
            "score": 1,
            "text": "A few years ago, they ran an Australia Day ad campaign where they used the Union Jack in the shape of Australia, minus Tasmania. Wrong flag and they forgot a whole state. Well done, Outback!",
            "title_similarity": "0.66763324",
            "sentiment_compound": -0.3164
        },
        {
            "id": "i61kua8",
            "score": 1,
            "text": "Yeah, I grew up in Tampa when these started opening. Shrimp on the barbie...err....ok. Maybe prawns over the fire instead?",
            "title_similarity": "0.60399777",
            "sentiment_compound": -0.0516
        },
        {
            "id": "i61kwly",
            "score": 2,
            "text": "I used to work at Outback Steakhouse. One day we found out a customer was going to propose.  Upon learning this information all of the servers were like, “Marriage proposal here, really? That’s not going to go well.”  But we watched it all go down anyway. The desert came out with a wedding ring atop of a chocolate cake. He got down on one knee. She said no, walked out and left him alone at the table to eat the saddest cake he’s ever eaten.",
            "title_similarity": "0.6250765",
            "sentiment_compound": -0.8047
        },
        {
            "id": "i61kzqm",
            "score": 1,
            "text": "Yep, I had often suspected as much. It’s definitely not a chain that started in Australia and spread over there. We have zero Outback Steakhouses in Australia.\n\nEDIT: Okay, we have very few Outback Steakhouses here. I meant that I’d never seen one in person.",
            "title_similarity": "0.70058453",
            "sentiment_compound": 0.5994
        },
        {
            "id": "i61l3lf",
            "score": 1,
            "text": "I remember when it opened.  I lived in Tampa. (Ybor City)",
            "title_similarity": "0.43807888",
            "sentiment_compound": 0.0
        },
        {
            "id": "i61lhot",
            "score": 1,
            "text": "I was served my first underage beer in a Florida outback. Had just graduated middle school.",
            "title_similarity": "0.6150721",
            "sentiment_compound": 0.0
        },
        {
            "id": "i61m9fg",
            "score": 1,
            "text": "I mean this in the nicest way, but this is strikes me as such an American thing to do lol",
            "title_similarity": "0.32164896",
            "sentiment_compound": 0.3716
        },
        {
            "id": "i61mggc",
            "score": 1,
            "text": "That's explains why my Australian friend had no earthly idea what in hell a Bloomin' Onion was.",
            "title_similarity": "0.6189562",
            "sentiment_compound": -0.5574
        },
        {
            "id": "i61n3i0",
            "score": 1,
            "text": "Love those blooming onions until the heartburn sets in.",
            "title_similarity": "0.34270602",
            "sentiment_compound": 0.6369
        },
        {
            "id": "i61nhgp",
            "score": 3,
            "text": "I lived in Australia for 10 years and have Australian Citizenship.\n\nWhen my American Mother-in-Law brought me to an Outback Steakhouse here in the US I had a visceral reaction to seeing their menu call Sandwiches \"Sangies\"\n\nWhat the fucking shit is this 🤣",
            "title_similarity": "0.7588134",
            "sentiment_compound": -0.1761
        },
        {
            "id": "i61o0b3",
            "score": 1,
            "text": "Just like how Texas Roadhouse was founded in Kentucky.",
            "title_similarity": "0.37739018",
            "sentiment_compound": 0.3612
        },
        {
            "id": "i61ojd8",
            "score": 1,
            "text": "This week's Atlanta episode in a nutshell.",
            "title_similarity": "0.3895281",
            "sentiment_compound": 0.0
        },
        {
            "id": "i61olky",
            "score": 1,
            "text": "It's surprising that this is surprising. Any Australian would look at out back steakhouse and instantly tell no Australian had anything to do with it",
            "title_similarity": "0.67105544",
            "sentiment_compound": 0.25
        },
        {
            "id": "i61p011",
            "score": 1,
            "text": "Like Godfather's Pizza, worst chain restaurant in the country",
            "title_similarity": "0.5350533",
            "sentiment_compound": -0.3818
        },
        {
            "id": "i61pzxy",
            "score": 1,
            "text": "I thought their original shtick was \"throw another shrimp on the barbie!\" style grilled food. I've never been.",
            "title_similarity": "0.6164371",
            "sentiment_compound": 0.3802
        },
        {
            "id": "i61qpvk",
            "score": 1,
            "text": "Remember those Subaru Outback commercials with crocodile Dundee?",
            "title_similarity": "0.5501542",
            "sentiment_compound": 0.0
        },
        {
            "id": "i61r2wq",
            "score": 1,
            "text": "This reminds me of when a friend of mine from USA showed me Calypso Lemonade, a Caribbean lemonade fruit juice brand. Being from the Caribbean myself, I had never heard of it so I looked into it. It was make in Milwaukee, Wisconsin and has no connection at all to the Caribbean outside of marketing. Makes it even worse when they have flavours like blueberry, a very American fruit being marketed as 'The flavours of the Islands'.",
            "title_similarity": "0.6892297",
            "sentiment_compound": 0.1027
        },
        {
            "id": "i61r6g3",
            "score": 1,
            "text": "Cultural appropriation",
            "title_similarity": "-0.06523081",
            "sentiment_compound": 0.0
        },
        {
            "id": "i61rh0v",
            "score": 1,
            "text": "Also, Texas Roadhouse is from Kentucky.",
            "title_similarity": "0.3073328",
            "sentiment_compound": 0.0
        },
        {
            "id": "i61rqax",
            "score": 1,
            "text": "Gonna be honest, I didn't even know it was supposed to be Australian themed. thought it was just Texan.",
            "title_similarity": "0.5630878",
            "sentiment_compound": 0.5106
        },
        {
            "id": "i61rv1k",
            "score": 1,
            "text": "I love how the bloomin onion is the signature of the outback steakhouse, but 99% of Aussie have zero idea of what the fuck it even is",
            "title_similarity": "0.7231731",
            "sentiment_compound": -0.4854
        },
        {
            "id": "i61s3fx",
            "score": 1,
            "text": "IDGAF their bloomin’ onion is fire.",
            "title_similarity": "0.29180977",
            "sentiment_compound": -0.34
        },
        {
            "id": "i61s7fq",
            "score": 1,
            "text": "I don’t think this claim is accurate. I’ve been high out of my mind on a cross joint and the place was incredible. I’d bet there had to be a portal connecting the place to Australia 🤔",
            "title_similarity": "0.5475554",
            "sentiment_compound": 0.0
        },
        {
            "id": "i61seg0",
            "score": 1,
            "text": "I mean, I kind of just assumed this since childhood",
            "title_similarity": "0.15829548",
            "sentiment_compound": 0.0
        },
        {
            "id": "i61sksm",
            "score": 1,
            "text": "Makes 100% complete sense.",
            "title_similarity": "0.060754374",
            "sentiment_compound": 0.0
        },
        {
            "id": "i61t4xf",
            "score": 1,
            "text": "Not enough cunts for it to really be Australian",
            "title_similarity": "0.24946843",
            "sentiment_compound": 0.4847
        },
        {
            "id": "i61t80l",
            "score": 1,
            "text": "Their bread slaps though, and so does that french onion soup.",
            "title_similarity": "0.41321072",
            "sentiment_compound": 0.0
        },
        {
            "id": "i61t8ld",
            "score": 1,
            "text": "And now there are Outback Steakhouses in Australia",
            "title_similarity": "0.54634655",
            "sentiment_compound": 0.0
        },
        {
            "id": "i61tatw",
            "score": 1,
            "text": "Nowadays I’d say it’s more associated with Texas, hell even the company itself seems to make the same association",
            "title_similarity": "0.40794486",
            "sentiment_compound": -0.6808
        },
        {
            "id": "i61temh",
            "score": 1,
            "text": "Outback is one step up from Apple Bees which is one step up from McDonalds.",
            "title_similarity": "0.42087832",
            "sentiment_compound": 0.0
        },
        {
            "id": "i61tgvm",
            "score": 1,
            "text": "No wonder why the food sucks",
            "title_similarity": "0.18634798",
            "sentiment_compound": -0.5719
        },
        {
            "id": "i61twk2",
            "score": 1,
            "text": "I should probably stop feeding my kangaroo fried onions.",
            "title_similarity": "0.47429436",
            "sentiment_compound": -0.296
        },
        {
            "id": "i61twr0",
            "score": 1,
            "text": "I had no idea it had anything whatsoever to do with Australia.  We have our own outbacks.",
            "title_similarity": "0.481754",
            "sentiment_compound": -0.296
        },
        {
            "id": "i61ud2r",
            "score": 1,
            "text": "Lol, I went in to watch the NRL grand final once, what is NRL was the comment.",
            "title_similarity": "0.6075931",
            "sentiment_compound": 0.7003
        },
        {
            "id": "i61v274",
            "score": 1,
            "text": "Makes sense, the place seems like it was designed with the knowledge of a Australia you'd get from a one time watch of Crocodile Dundee on VHS.",
            "title_similarity": "0.6195316",
            "sentiment_compound": 0.3612
        },
        {
            "id": "i61v7wp",
            "score": 1,
            "text": "Good ole Tampa 😆",
            "title_similarity": "0.22871217",
            "sentiment_compound": 0.6597
        },
        {
            "id": "i61vghw",
            "score": 1,
            "text": "Went to college in the early 2000s.   The only time I ever went here was when my dad came to visit.    It was like the highlight of his trip.  He fuckin loves Outback.",
            "title_similarity": "0.6918117",
            "sentiment_compound": 0.8357
        },
        {
            "id": "i61vhtr",
            "score": 1,
            "text": "Does Outback Steakhouse still exist? Havent seen it since I was a child",
            "title_similarity": "0.55367863",
            "sentiment_compound": 0.0
        },
        {
            "id": "i61vqnq",
            "score": 1,
            "text": "Do people actually think that Outback Steakhouse is Australian in anything but outward theming? Do they also think the Rainforest Cafe is cuisine from \"the jungle\"?",
            "title_similarity": "0.6338624",
            "sentiment_compound": 0.0
        },
        {
            "id": "i61vw95",
            "score": 1,
            "text": "Florida on holiday from the UK, 2012. We went to Outback and I fond memories of polishing off my wife's steak and all of our shared crab because she had morning sickness. Wonder if it'll taste as good when we go back this summer?",
            "title_similarity": "0.7042598",
            "sentiment_compound": 0.872
        },
        {
            "id": "i61vyy6",
            "score": 1,
            "text": "Guess where Texas Roadhouse started (hint: not Texas)",
            "title_similarity": "0.37477577",
            "sentiment_compound": 0.0
        },
        {
            "id": "i61w3zb",
            "score": 1,
            "text": "No one's surprised by this, right? Coming from the country where [Taco Bell is voted the best Mexican food](https://abc7news.com/amp/taco-bell-food-tuesday-tacos/4225078/)",
            "title_similarity": "0.63085926",
            "sentiment_compound": 0.3257
        },
        {
            "id": "i61wh1q",
            "score": 1,
            "text": "OUTBACK STAKEHOUSE: \n\nPUNISH. YOUR. TOILET.",
            "title_similarity": "0.32373843",
            "sentiment_compound": -0.5267
        },
        {
            "id": "i61wigg",
            "score": 3,
            "text": "I went to a restaurant in Cairo years ago called \"The American Bar\" and it was a similar concept. They had obviously never ever been to America but they did what they thought America was. Lots of pictures of Marilyn Monroe and Al Capone",
            "title_similarity": "0.7558033",
            "sentiment_compound": 0.0
        },
        {
            "id": "i61wjk2",
            "score": 1,
            "text": "My first trip to the US was in the 80's and it was a wonderful time to be an Australian abroad. More recently I would tack on several extra days to my annual company conference in Vegas and spend time exploring Grand Staircase, Moab, Zion, Grand Canyon and some of the more remote places in the western deserts. I especially love the hospitality of small towns and can honestly say I have felt welcome in every single one. Many people I meet are nostalgic for Croc Dundee and the Australian stereotype. During my last trip (pre-covid) I went into a post office to buy stamps in a tiny town in Nevada. I chatted for nearly an hour with the lovely lady behind the counter. She even made me a cup of coffee!\n\nBTW, I do enjoy the occasional Outback Steakhouse meal",
            "title_similarity": "0.665836",
            "sentiment_compound": 0.9781
        },
        {
            "id": "i61wqoe",
            "score": 1,
            "text": "There is one in Brisbane, which suddenly seems absurd. An American chain restaurant selling an Aussie outback concept to Australians.",
            "title_similarity": "0.7277105",
            "sentiment_compound": 0.0
        },
        {
            "id": "i61wu7h",
            "score": 1,
            "text": "It's like the Canadian Pi, za chain Boston Pizza... It's named that only because at the time, Boston sounded good in names because of its successful sports teams",
            "title_similarity": "0.5951836",
            "sentiment_compound": 0.8481
        },
        {
            "id": "i61wyp5",
            "score": 1,
            "text": "Can confirm; am an Australian and we have this wonderful irony in that there’s an Outback Steakhouse near me (Australian name selling American food), and also a Lone Star Steakhouse near me (American name selling Australian food).\n\nUnsurprisingly, I prefer the latter to the former due at least partially to my familiarity to my own local cuisine, so I can understand why those executives did what they did in the 80s!",
            "title_similarity": "0.7404283",
            "sentiment_compound": 0.5215
        },
        {
            "id": "i61xs3v",
            "score": 3,
            "text": "FOSTERS, AUSTRALIAN FOR BEER!",
            "title_similarity": "0.4232007",
            "sentiment_compound": 0.0
        },
        {
            "id": "i61y52m",
            "score": 1,
            "text": "Here's a question. Where CAN someone find authentic Aussie food in the states? I'd love to try some of these things prepared as intended!",
            "title_similarity": "0.46523517",
            "sentiment_compound": 0.75
        },
        {
            "id": "i61ywhw",
            "score": 2,
            "text": "As an Australian, I love Outback Steakhouse",
            "title_similarity": "0.5428333",
            "sentiment_compound": 0.6369
        },
        {
            "id": "i61yxz7",
            "score": 1,
            "text": "I have just lunched there today LOL",
            "title_similarity": "0.36663735",
            "sentiment_compound": 0.5473
        },
        {
            "id": "i61z6n9",
            "score": 1,
            "text": "I feel Australia is so relatable to Americans because it basically is the british version of american cowboys, and there's a fascination with the perceived rugged bravado of these British prisoner descendants that Americans like to think they have as well.",
            "title_similarity": "0.5136056",
            "sentiment_compound": 0.5106
        },
        {
            "id": "i61zb5k",
            "score": 1,
            "text": "Never felt Australian eating there",
            "title_similarity": "0.4987954",
            "sentiment_compound": 0.0
        },
        {
            "id": "i61zbgj",
            "score": 1,
            "text": "That makes a lot of sense. Never been to murica but one day.",
            "title_similarity": "0.41750982",
            "sentiment_compound": 0.0
        },
        {
            "id": "i61zfyx",
            "score": 1,
            "text": "easily one of the most unspectacular restaurant chains ive ever ate. down there with sizzler\n\ndont waste your money oh shitty food",
            "title_similarity": "0.54075956",
            "sentiment_compound": 0.0341
        },
        {
            "id": "i61zgvo",
            "score": 1,
            "text": "I didn't attribute it to Australia as more of the steak house out back, in the yard....",
            "title_similarity": "0.6113523",
            "sentiment_compound": 0.0
        },
        {
            "id": "i61zoda",
            "score": 1,
            "text": "America loves Australia because they're different enough so you can laugh at them, but they're white so it's not racist.\n\nLike, you want your mascot to be an [animated kangaroo](https://youtu.be/IU5IPtMpGjU) with an Australian accent? Go nuts. But don't make it a panda with a Chinese accent or you're racist.",
            "title_similarity": "0.55987835",
            "sentiment_compound": -0.2864
        },
        {
            "id": "i61zz13",
            "score": 1,
            "text": "Still the best deal on a damn decent porterhouse",
            "title_similarity": "0.21216844",
            "sentiment_compound": 0.3612
        },
        {
            "id": "i620ekv",
            "score": 1,
            "text": "What's Australian fun about this place? They've gone some of the most expensive and average steaks I've seen",
            "title_similarity": "0.60597",
            "sentiment_compound": 0.5106
        },
        {
            "id": "i620uf9",
            "score": 1,
            "text": "You are telling me 12,000 calorie fried onions with dipping sauce isn't Australian?",
            "title_similarity": "0.4985061",
            "sentiment_compound": 0.0
        },
        {
            "id": "i621b97",
            "score": 1,
            "text": "And I’m still riding that wave. I love all things Australia, authentic or completely made up by American businessmen. I’m still waiting for a sequel to Young Einstein. More Yahoo Serious, please.",
            "title_similarity": "0.6838284",
            "sentiment_compound": 0.734
        },
        {
            "id": "i6221xy",
            "score": 1,
            "text": "And the bloomin onion was stolen from a mom n pop restaurant in New Orleans.",
            "title_similarity": "0.57674384",
            "sentiment_compound": -0.4939
        },
        {
            "id": "i6222s1",
            "score": 1,
            "text": "W.T.F. Mate?...",
            "title_similarity": "0.07530812",
            "sentiment_compound": 0.0
        },
        {
            "id": "i622bb1",
            "score": 1,
            "text": "Come back anytime. Seriously, we need the tourism.",
            "title_similarity": "0.31570894",
            "sentiment_compound": -0.1779
        },
        {
            "id": "i622neb",
            "score": 1,
            "text": "My family and I moved to Australia from the States many moons ago.  My parents still love going to Outback Steakhouse here - which is super weird to me.  Food is average, service is worse.",
            "title_similarity": "0.7782077",
            "sentiment_compound": 0.6486
        },
        {
            "id": "i622r5d",
            "score": 1,
            "text": "BLOOMING MOF’IN ONION",
            "title_similarity": "0.17792672",
            "sentiment_compound": 0.0
        },
        {
            "id": "i622vxx",
            "score": 1,
            "text": "My wife and I ate at restaurant #2 for our first Thanksgiving in '87. We were relatively newly wed and new to Tampa. We hadn't made plans and just drove up Dale Mabry until we found an opened place - I think in Carrollwood. We didn't know that #1 was 2 miles from our apartment but not facing Dale Mabry. The food was fantastic, the menu was fun, and they had comically large flatware which was also fun. Fans for life.",
            "title_similarity": "0.7418715",
            "sentiment_compound": 0.9413
        },
        {
            "id": "i622x75",
            "score": 1,
            "text": "That's not a steakhouse!",
            "title_similarity": "0.24118933",
            "sentiment_compound": 0.0
        },
        {
            "id": "i623558",
            "score": 1,
            "text": "Ahhh the Outback Steakhouse. Would you like some steak and mashed potatoes with your SALT AND GARLIC???",
            "title_similarity": "0.50942445",
            "sentiment_compound": 0.466
        },
        {
            "id": "i623en1",
            "score": 1,
            "text": "Was really bummed that one closest to our home closed during the first year of the pandemic, really liked their Blooming Onion. We've DIY'ed it before but it's not the same.",
            "title_similarity": "0.5732515",
            "sentiment_compound": 0.2609
        },
        {
            "id": "i623gnd",
            "score": 1,
            "text": "The funny thing is most Australians have never been to the outback",
            "title_similarity": "0.534231",
            "sentiment_compound": 0.4404
        },
        {
            "id": "i623mb5",
            "score": 2,
            "text": "What made them super popular at the time, was they were one of the first to offer coconut shrimp as well as the bloomin onion and everyone up north couldn't wait til they had an outback. The food quality was better then too, unlike now where it's the same as Chilis",
            "title_similarity": "0.5771337",
            "sentiment_compound": 0.8934
        },
        {
            "id": "i623svb",
            "score": 1,
            "text": "Mick Dundee: Let see a lot of him in a short period of time; and then none of him for the rest of our lives.",
            "title_similarity": "0.5028495",
            "sentiment_compound": 0.0
        },
        {
            "id": "i624kck",
            "score": 1,
            "text": "Living in Australia, everytime I visited an Outback outside of Australia, California, Japan etc, I would always question why there was not any kangaroo or emu or crocodile on the menu",
            "title_similarity": "0.6426191",
            "sentiment_compound": 0.0
        },
        {
            "id": "i624kmt",
            "score": 1,
            "text": "Yeah we don't even do steakhouses that much",
            "title_similarity": "0.44707882",
            "sentiment_compound": 0.296
        },
        {
            "id": "i624pxw",
            "score": 1,
            "text": "You're welcome America, we gave you: Hooters, Outback, Publix, Alienware, Burger King, Firehouse Subs, Winn-Dixie, and Office Depot.",
            "title_similarity": "0.54739296",
            "sentiment_compound": 0.4588
        },
        {
            "id": "i624qs8",
            "score": 2,
            "text": "Its ok, we could've guessed that by going there.",
            "title_similarity": "0.0962909",
            "sentiment_compound": 0.0
        },
        {
            "id": "i6256e5",
            "score": 1,
            "text": "I worked at Outback 20 years ago now. Like most of these places, the quality of food has gone down so dramatically it’s almost not the same restaurant anymore.",
            "title_similarity": "0.46322805",
            "sentiment_compound": 0.3612
        },
        {
            "id": "i625cs8",
            "score": 1,
            "text": "Wait until I tell you that longhorn steakhouse has nothing to do with Texas",
            "title_similarity": "0.5522498",
            "sentiment_compound": 0.0
        },
        {
            "id": "i625smj",
            "score": 1,
            "text": "When we first heard of Outback from our American stepdad we pissed ourselves laughing. Some of the things on the menu obviously just grabbed random place names and put them next to a dish even though it made zero sense. The best being a Toowoomba Pasta which was a seafood pasta, yet Toowoomba is landlocked about 2.5-3 hours from the coast and is a regional farming city hub.\n\nThat said.. Now Outback is in Aus. And after having had it both in the US and in Aus. Sorry Americans, but we do it better..",
            "title_similarity": "0.7415556",
            "sentiment_compound": 0.7003
        },
        {
            "id": "i62642g",
            "score": 1,
            "text": "That's like the most American shit ever lol",
            "title_similarity": "0.34976977",
            "sentiment_compound": 0.1082
        },
        {
            "id": "i6264jc",
            "score": 1,
            "text": "I’m Australian, was in Miami for work. My team took me to Outback. \n\n1 - it was shit. I can’t even remember what I ate now, just that the entire experience was underwhelming. \n\n2 - “Toowoomba Shrimp” on the menu. Toowoomba is a few hundred miles inland. I wouldn’t count on its freshness.",
            "title_similarity": "0.80151296",
            "sentiment_compound": -0.5574
        },
        {
            "id": "i626k5r",
            "score": 1,
            "text": "Am Australian and we do not have outback steak house. We want american food we eat maccas",
            "title_similarity": "0.69318825",
            "sentiment_compound": 0.0772
        },
        {
            "id": "i626w7o",
            "score": 1,
            "text": "As someone from Tampa Bay, I apologize for the hardened arteries",
            "title_similarity": "0.29682598",
            "sentiment_compound": 0.1027
        },
        {
            "id": "i62752e",
            "score": 1,
            "text": "Eating at Outback gives your poop a specific stank",
            "title_similarity": "0.4264437",
            "sentiment_compound": -0.4404
        },
        {
            "id": "i627dko",
            "score": 1,
            "text": "What's worse is 'Ugg Australia'. American company (Dekkers) that makes shitty knock-off Uggs in China and successfully sued Australian companies trying to export the real thing to the US.\n\nNever buy Ugg Australia fake Uggs. The real thing is so much better.",
            "title_similarity": "0.66220045",
            "sentiment_compound": -0.5302
        },
        {
            "id": "i628473",
            "score": 1,
            "text": "And I literally lived within rock throwing distance to that original restaurant in Tampa.",
            "title_similarity": "0.6219344",
            "sentiment_compound": 0.3182
        },
        {
            "id": "i6287fm",
            "score": 1,
            "text": "One actually opened here in Australia, I'm pretty keen to go and try it out tbh.",
            "title_similarity": "0.4959096",
            "sentiment_compound": 0.6908
        },
        {
            "id": "i628qzs",
            "score": 1,
            "text": "Some of the best service in the business",
            "title_similarity": "0.09901903",
            "sentiment_compound": 0.6369
        },
        {
            "id": "i628z42",
            "score": 1,
            "text": "In Canada there’s a chain of mediocre mall pizza places called Boston Pizza, with no locations in the US",
            "title_similarity": "0.5800203",
            "sentiment_compound": -0.296
        },
        {
            "id": "i629057",
            "score": 1,
            "text": "Depressingly large swaths of central FL are essentially just themed chain restaurants.",
            "title_similarity": "0.5354637",
            "sentiment_compound": -0.5106
        },
        {
            "id": "i629osm",
            "score": 1,
            "text": "P",
            "title_similarity": "-0.16122912",
            "sentiment_compound": 0.0
        },
        {
            "id": "i62a715",
            "score": 1,
            "text": "I've never once gone to Outback Steakhouse and thought it was anything but a steakhouse.",
            "title_similarity": "0.61332667",
            "sentiment_compound": 0.0
        },
        {
            "id": "i62af9k",
            "score": 1,
            "text": "Outhouse",
            "title_similarity": "0.016735287",
            "sentiment_compound": 0.0
        },
        {
            "id": "i62axrb",
            "score": 1,
            "text": "Does it have a chicken parmy with gravy, a burger with beetroot and a room full of pokies?",
            "title_similarity": "0.4360134",
            "sentiment_compound": 0.0
        },
        {
            "id": "i62ay3d",
            "score": 2,
            "text": "I love the fact that one of their TV commercials had Jermaine Clement from Flight of the Conchords, a Kiwi, doing a ridiculous Australian accent. I know lots of people think the accents are indistinguishable, but if you’re familiar with Jermaine’s natural voice, this really illustrates how different they are…\n\nhttps://youtu.be/v47jHmstJcw",
            "title_similarity": "0.5862231",
            "sentiment_compound": 0.6249
        },
        {
            "id": "i62b03t",
            "score": 3,
            "text": "I'm Australian and my family went to an outback steakhouse in the states when I was a kid. My dad loves to tell the story of how he asked the waitress where the \"loo\" was... She looked at him blankly and so he asked again, and again and then realised that of course she'd have no idea what a \"loo\" is so he asked where the \"bathroom\" was in his most over-the-top American accent ever.\n\nAlso, they brought outback to Australia a few years after that and I was relieved that they didn't bring all their menu items over, namely their incredibly racist \"Abo-riginal Burger\". \"Abo\" being a derogatory term for Australia's First Nations people. That would have gotten them in a lot of hot water.",
            "title_similarity": "0.8221794",
            "sentiment_compound": -0.0498
        },
        {
            "id": "i62b3p9",
            "score": 1,
            "text": "This might be the most American thing I have ever heard",
            "title_similarity": "0.31052443",
            "sentiment_compound": 0.0
        },
        {
            "id": "i62b3zl",
            "score": 1,
            "text": "Every single time I have gone to outback, I have had explosive diarrhea within 4 hours.",
            "title_similarity": "0.48773706",
            "sentiment_compound": 0.0
        },
        {
            "id": "i62bajz",
            "score": 2,
            "text": "Chuck E Cheese also wasn't started by giant animatronic mice.",
            "title_similarity": "0.35973054",
            "sentiment_compound": 0.0
        },
        {
            "id": "i62baqc",
            "score": 9,
            "text": "As an Aussie, to me the most amusing thing on the menu was the Toowoomba Shrimp Pasta.\n\nWhy? Because this is Toowoomba: https://www.rickardsphotography.com.au/images/gallery/drones/DJI\\_0430.jpg\n\nSo you have a seafood dish ... named after a city that's a 2-hour drive from the sea ... which has no rivers or lakes ... which has no fishing at all ... where the main industries are grain and cattle farming ... and which is on top of a 2000-foot ridgeline.\n\nIt's as daft as having \"Traditional El Paso clam bake\".",
            "title_similarity": "0.7360277",
            "sentiment_compound": 0.0754
        },
        {
            "id": "i62bgc1",
            "score": 1,
            "text": "It sounds like a dumb trend to ride, but apparently it worked.",
            "title_similarity": "0.20072144",
            "sentiment_compound": -0.1027
        },
        {
            "id": "i62br74",
            "score": 1,
            "text": "In the 80's I was a bouncer at a club. The bartenders both male and female started using fake Australian accents. They swore there tips increased greatly.",
            "title_similarity": "0.59207463",
            "sentiment_compound": -0.25
        },
        {
            "id": "i62cb06",
            "score": 1,
            "text": "Wow. What do I do with this sudden wave of disappointment that I was not eating authentic colonial genocide cuisine all these years?",
            "title_similarity": "0.50259596",
            "sentiment_compound": 0.128
        },
        {
            "id": "i62cj9u",
            "score": 2,
            "text": "Laughed my ass off when I passed an Outback Steakhouse in a suburb of Sydney.  Americans selling Australia to Australians!",
            "title_similarity": "0.74918556",
            "sentiment_compound": -0.2003
        },
        {
            "id": "i62d1fo",
            "score": 2,
            "text": "I guess the Canadian equivalent is Swiss Chalet.",
            "title_similarity": "0.23609819",
            "sentiment_compound": 0.0
        },
        {
            "id": "i62dvu7",
            "score": 2,
            "text": "SHTEAK AND LOIBSTAH NOW ONLY FOR A LEEMETID TOIME",
            "title_similarity": "0.31690782",
            "sentiment_compound": 0.0
        },
        {
            "id": "i62ee6c",
            "score": 1,
            "text": "Really? Outback Steakhouse doesn't serve shrimp with Joey steak on the barbie in your area?",
            "title_similarity": "0.621424",
            "sentiment_compound": 0.0
        },
        {
            "id": "i62ej5h",
            "score": 1,
            "text": "Outback steakhouse is absolute garbage.",
            "title_similarity": "0.43578857",
            "sentiment_compound": 0.0
        },
        {
            "id": "i62fgdh",
            "score": 1,
            "text": "Interesting",
            "title_similarity": "-0.16205384",
            "sentiment_compound": 0.4019
        },
        {
            "id": "i62g3t4",
            "score": 2,
            "text": "Anything is possible",
            "title_similarity": "-0.044241063",
            "sentiment_compound": 0.0
        },
        {
            "id": "i62gcyd",
            "score": 4,
            "text": "Is this why Americans keep coming here and asking me where they can eat a blooming onion? Never understood WTF they were on about",
            "title_similarity": "0.5523281",
            "sentiment_compound": 0.5595
        },
        {
            "id": "i62ha5g",
            "score": 2,
            "text": "*Didgeridoo noises intensify",
            "title_similarity": "0.05976952",
            "sentiment_compound": 0.0
        },
        {
            "id": "i62hcyt",
            "score": 1,
            "text": "All they eat in Australia is roo burgers duh",
            "title_similarity": "0.68379843",
            "sentiment_compound": 0.0
        },
        {
            "id": "i62hpfb",
            "score": 2,
            "text": "That’s like Texas Roadhouse that started in a mall in Clarksville Indiana",
            "title_similarity": "0.51181006",
            "sentiment_compound": 0.3612
        },
        {
            "id": "i62hr1b",
            "score": 1,
            "text": "Wot you mean they neva been downundah?",
            "title_similarity": "0.050973915",
            "sentiment_compound": 0.0
        },
        {
            "id": "i62j25a",
            "score": 1,
            "text": "I haven't heard an Aussie use the word \"outback\" in conversation, and it's been over three decades here so far",
            "title_similarity": "0.42478967",
            "sentiment_compound": 0.0
        },
        {
            "id": "i62jp0n",
            "score": 2,
            "text": "Bringing me a Blooming Onion with a Wallaby Darned mate!",
            "title_similarity": "0.4691829",
            "sentiment_compound": 0.0
        },
        {
            "id": "i62kpvo",
            "score": 3,
            "text": "They should make the waiters all speak like Paul Hogan.",
            "title_similarity": "0.40167284",
            "sentiment_compound": 0.3612
        },
        {
            "id": "i62m58k",
            "score": 1,
            "text": "Last time a went a few years ago I learned they stopped doing the rack of lamb,  that was my go to bday dinner for a while I really enjoyed it and was disappointed they stopped.",
            "title_similarity": "0.5744548",
            "sentiment_compound": -0.3197
        },
        {
            "id": "i62o288",
            "score": 1,
            "text": "And hooters started in Clearwater. I loved Clearwater, Tampa's alright lol",
            "title_similarity": "0.40054736",
            "sentiment_compound": 0.8271
        },
        {
            "id": "i62oegp",
            "score": 1,
            "text": "And Haagen Dazs is American 😂",
            "title_similarity": "0.291927",
            "sentiment_compound": 0.4404
        },
        {
            "id": "i62os2j",
            "score": 1,
            "text": "I’m not much for franchises, but their food is goddamn phenomenal",
            "title_similarity": "0.4623086",
            "sentiment_compound": -0.631
        },
        {
            "id": "i62q7zi",
            "score": 1,
            "text": "Today I, an Australian, learnt that Outback Steakhouse which I’ve only heard about watching American tv is Australian themed.",
            "title_similarity": "0.7524552",
            "sentiment_compound": 0.0
        },
        {
            "id": "i62rt3o",
            "score": 2,
            "text": "My whole life is a fucking lie",
            "title_similarity": "0.18802458",
            "sentiment_compound": 0.0
        },
        {
            "id": "i62rz3n",
            "score": 1,
            "text": "Bring back the Mad Max Burger!",
            "title_similarity": "0.549122",
            "sentiment_compound": -0.5411
        },
        {
            "id": "i62sf06",
            "score": 1,
            "text": "Went to Outback way back in 2017 during a hiking trip. So much salt on all the food, couldn’t finish my meal",
            "title_similarity": "0.60093987",
            "sentiment_compound": 0.0
        },
        {
            "id": "i62srhs",
            "score": 1,
            "text": "Literally worst steak ever",
            "title_similarity": "0.38046992",
            "sentiment_compound": -0.6249
        },
        {
            "id": "i62su9w",
            "score": 1,
            "text": "I saw an interview in regards to them coming up with the concept and basically it was, nobody in America really knows what Australian food is, so that meant they had freedom to do whatever they wanted and they weren't going to be 'wrong'.",
            "title_similarity": "0.6851358",
            "sentiment_compound": 0.2732
        },
        {
            "id": "i62swpo",
            "score": 1,
            "text": "If anyone is wondering, there are several Outback locations in Australia.  It's where I go when I want American-style chain restaurant food.  I've gotta get my Alice Springs Chicken fix every now and then!",
            "title_similarity": "0.69717264",
            "sentiment_compound": 0.1511
        },
        {
            "id": "i62t2u2",
            "score": 1,
            "text": "I live in Iowa...have never ever eaten at one.",
            "title_similarity": "0.48166534",
            "sentiment_compound": 0.0
        },
        {
            "id": "i62ti23",
            "score": 1,
            "text": "I'll never forget when they tried to open here in Australia and only tourists went. It's really disgusting food to most Australian pallets.",
            "title_similarity": "0.6656382",
            "sentiment_compound": -0.4637
        },
        {
            "id": "i62tkuw",
            "score": 1,
            "text": "Outback is like an Irish steakhouse. But things are called “bloomin” or the size of your beer is called “middy”",
            "title_similarity": "0.581131",
            "sentiment_compound": 0.1901
        },
        {
            "id": "i62ts95",
            "score": 1,
            "text": "I imagine the production people telling the Australian commercial voice-over actor to “sound more Australian. “\nInsipid moronic bullshit",
            "title_similarity": "0.53153646",
            "sentiment_compound": -0.8948
        },
        {
            "id": "i62tyoa",
            "score": 1,
            "text": "When I lived in Tampa, the founder used to live across the street from me - I grew up thinking this was common knowledge.",
            "title_similarity": "0.52310586",
            "sentiment_compound": 0.0
        },
        {
            "id": "i62u48f",
            "score": 1,
            "text": "Ngl for a chain restaurant their Victoria filet (cooked rare of course) is banging.",
            "title_similarity": "0.5620579",
            "sentiment_compound": 0.0
        },
        {
            "id": "i62ub8t",
            "score": 1,
            "text": "Gee, who would guessed that. and there was me thinkin' it was sooo authentically Antipodean.",
            "title_similarity": "0.1656704",
            "sentiment_compound": 0.0
        },
        {
            "id": "i62ubbu",
            "score": 1,
            "text": "and they originally opened the doors at 4pm so the founders could get in a full game of golf each morning.",
            "title_similarity": "0.5700246",
            "sentiment_compound": 0.0
        },
        {
            "id": "i62v1j8",
            "score": 1,
            "text": "Sort of how the Texas Roadhouse restaurant has literally no connection to Texas what-so-ever.",
            "title_similarity": "0.59217936",
            "sentiment_compound": -0.296
        },
        {
            "id": "i62va8l",
            "score": 1,
            "text": "Supposedly, the guy who successfully pitched the Outback’s idea to investors hitchhiked to the presentation.",
            "title_similarity": "0.49221626",
            "sentiment_compound": 0.4939
        },
        {
            "id": "i62vqsc",
            "score": 1,
            "text": "Worst steak I’ve ever had, and that’s not hyperbole.",
            "title_similarity": "0.53513765",
            "sentiment_compound": -0.6249
        },
        {
            "id": "i62w1fv",
            "score": 1,
            "text": "You mean the Bloomin Onion isn't a staple of the traditional Australian diet??",
            "title_similarity": "0.49830472",
            "sentiment_compound": 0.0
        },
        {
            "id": "i62wl73",
            "score": 1,
            "text": "Wait into you find out Chinese take out are not Chinese food.",
            "title_similarity": "0.30249324",
            "sentiment_compound": 0.0
        },
        {
            "id": "i62wot1",
            "score": 1,
            "text": "Makes sense. Lived here 40+ years, never once have I eaten a Bloomin Onion.",
            "title_similarity": "0.5743815",
            "sentiment_compound": 0.0
        },
        {
            "id": "i62wrkq",
            "score": 1,
            "text": "What assholes",
            "title_similarity": "-0.023434682",
            "sentiment_compound": -0.5859
        },
        {
            "id": "i62wzoq",
            "score": 1,
            "text": "This reminds me that when I was a kid I thought Subaru was an Australian car company because of their “Australian” Crocodile Dundee commercials haha",
            "title_similarity": "0.68850684",
            "sentiment_compound": 0.4588
        },
        {
            "id": "i62xtvl",
            "score": 1,
            "text": "Used to go to the original one on Henderson after work with my GF, now wife.  Would share the cheese fries or a bloomin onion, then each have a side salad (so we could say we had something “healthy”, then I’d get a Thunder and she’d get the cheesecake.",
            "title_similarity": "0.503562",
            "sentiment_compound": 0.5423
        },
        {
            "id": "i62y617",
            "score": 1,
            "text": "This makes perfect sense.",
            "title_similarity": "-0.092123404",
            "sentiment_compound": 0.5719
        },
        {
            "id": "i62ysbt",
            "score": 1,
            "text": "I’ve never eaten anything from Outback that has tasted good (last visit was years ago).  They manage to make stuff filled with calories and fat taste bad which is more difficult than it sounds.",
            "title_similarity": "0.623279",
            "sentiment_compound": -0.5256
        },
        {
            "id": "i62yu4u",
            "score": 1,
            "text": "I love the blooming onion but feel nauseous 10 minutes after eating a few bites. Like, I wanna sprint to the bathroom and vomit the whole thing up. I’m sure there is nothing to be concerned about.",
            "title_similarity": "0.55766225",
            "sentiment_compound": 0.8316
        },
        {
            "id": "i62yz7e",
            "score": 2,
            "text": "Nruh I'm from Tampa and didn't know that. I know Hooters started out in Cleawater and beef o bradies also started in tampa",
            "title_similarity": "0.6840118",
            "sentiment_compound": 0.0
        },
        {
            "id": "i62z9pj",
            "score": 1,
            "text": "Can confirm no blooming onions in Australia.",
            "title_similarity": "0.53401554",
            "sentiment_compound": -0.296
        },
        {
            "id": "i62zdro",
            "score": 1,
            "text": "Holy shit mate, bloody oath…",
            "title_similarity": "0.13438293",
            "sentiment_compound": -0.7579
        },
        {
            "id": "i62zkdk",
            "score": 1,
            "text": "Bring back the chicken tenders. The new ones suck. That is all.",
            "title_similarity": "0.46392164",
            "sentiment_compound": -0.3182
        },
        {
            "id": "i62zros",
            "score": 1,
            "text": "The most American thing I’ve heard 🇺🇸 ♥️",
            "title_similarity": "0.31448135",
            "sentiment_compound": 0.6369
        },
        {
            "id": "i6303c0",
            "score": 1,
            "text": "Somehow these fucking restaurants ended up in Australia but the menu is basically a clone of Lonestar restaurants which try to be American. Da fuck is going on?",
            "title_similarity": "0.66560256",
            "sentiment_compound": -0.6956
        },
        {
            "id": "i630xfl",
            "score": 1,
            "text": "As an Aussie, I had always thought Greg Norman was part owner in starting up the restaurant chain in the US? Have I been lied to all these years?",
            "title_similarity": "0.67243993",
            "sentiment_compound": -0.4515
        },
        {
            "id": "i631144",
            "score": 1,
            "text": "Hahaha",
            "title_similarity": "-0.14834622",
            "sentiment_compound": 0.5574
        },
        {
            "id": "i631ie9",
            "score": 1,
            "text": "Outback had been around prior to the first Dundee movie as Paul Hogan was Australia’s spokesman for their tourism board and country’s TV personality before hand.",
            "title_similarity": "0.64689314",
            "sentiment_compound": 0.4939
        },
        {
            "id": "i6320gp",
            "score": 1,
            "text": "I’ve never had a good meal at an Outback Steakhouse",
            "title_similarity": "0.5662501",
            "sentiment_compound": -0.3412
        },
        {
            "id": "i6327tl",
            "score": 1,
            "text": "I don’t even know what “Australian food” is.",
            "title_similarity": "0.35951892",
            "sentiment_compound": 0.0
        },
        {
            "id": "i632eel",
            "score": 1,
            "text": "That would explain why the food is so awful.",
            "title_similarity": "0.21326156",
            "sentiment_compound": -0.5949
        },
        {
            "id": "i633nro",
            "score": 1,
            "text": "No kangaroo or koala on the menu and you just now figured it out?",
            "title_similarity": "0.5200385",
            "sentiment_compound": -0.296
        },
        {
            "id": "i634dof",
            "score": 1,
            "text": "Worked there for almost ten years. Founders were golfers. They wanted to open a steakhouse where the prep crew could get there at 7am to make fresh quality food but they didn’t have to be there until after they shot 18 holes. Lots of steakhouses at the time didn’t open until 4. When they were in their heyday literally everything was from scratch unless it was A1 or Heinz 57 or some other condiment. I left when they got bags of dressing and frozen fries.",
            "title_similarity": "0.70181334",
            "sentiment_compound": 0.1655
        },
        {
            "id": "i634q2r",
            "score": 1,
            "text": "They forgot to make the food good though",
            "title_similarity": "0.2597283",
            "sentiment_compound": 0.4404
        },
        {
            "id": "i634s8g",
            "score": 1,
            "text": "As chain restaurants go, I’d rather eat Outback than the others….Olive Garden is alright I guess.",
            "title_similarity": "0.5093721",
            "sentiment_compound": 0.25
        },
        {
            "id": "i634x62",
            "score": 1,
            "text": "I’m an Aussie immigrant in the States. Australia really doesn’t have much in the way of a distinctive cuisine, although we have some good food. \n\nMy American friends took me to the Outback Steakhouse as a goof. We thought we could make fun of it, but the food turned out to be pretty decent. \n\nOddly, they had good Australian artists on the wall as well. Still couldn’t work myself up to tackling that onion, though.",
            "title_similarity": "0.7292805",
            "sentiment_compound": 0.9428
        },
        {
            "id": "i6355a7",
            "score": 1,
            "text": "I've never even been to Outback (I think I might've gone once when I was a kid) and I am so disappointed, goddammit lol.",
            "title_similarity": "0.4809412",
            "sentiment_compound": -0.2329
        },
        {
            "id": "i635aad",
            "score": 1,
            "text": "Worked at an Outback steakhouse in my city . Quality of food was great first year they were open , second year an quality went to shit , size of portions cut in half and price increases too . Knew little trick to keep from waiting on a table . You could order off menu at the bar , no waiting .",
            "title_similarity": "0.68999946",
            "sentiment_compound": -0.4033
        },
        {
            "id": "i635hof",
            "score": 1,
            "text": "DUH lol",
            "title_similarity": "-0.10187899",
            "sentiment_compound": 0.4215
        },
        {
            "id": "i635q70",
            "score": 1,
            "text": "First time I saw this chain was in South Korea. This thing is about as Aussie as Fosters",
            "title_similarity": "0.45467204",
            "sentiment_compound": 0.0
        },
        {
            "id": "i6365bu",
            "score": 2,
            "text": "Me and a friend were thinking about going to outback some years back. We were saying how it would be funny if they had Australian servers there joking around. We call up to check the hours or something and the person who answered had the thickest Australian accent you ever heard. We both started laughing hysterically.\n\nOf course it ended up being an automated recording or whatever but it caught us at first",
            "title_similarity": "0.6807677",
            "sentiment_compound": 0.6808
        },
        {
            "id": "i636fcd",
            "score": 1,
            "text": "Idk mate IME they’ve always delivered in taste for the price. Probably my favorite affordable steak house.",
            "title_similarity": "0.55636275",
            "sentiment_compound": 0.3818
        },
        {
            "id": "i636vlv",
            "score": 1,
            "text": "TIMU. The blooming onion was an inside joke between the original owners. It is a euphemism.",
            "title_similarity": "0.4087608",
            "sentiment_compound": 0.5423
        },
        {
            "id": "i636w9h",
            "score": 1,
            "text": "No shit",
            "title_similarity": "-0.026565364",
            "sentiment_compound": 0.4449
        },
        {
            "id": "i638nze",
            "score": 1,
            "text": "I'm honestly shocked that this didn't quickly devolve into a 3,000+ comment circle jerk of pretentious non Americans screaming about how all Americans are stupid and fat and think that this is legitimate Australian cuisine and self-flagellating Americans trying to earn brownie points with the first group saying the same thing.",
            "title_similarity": "0.6653905",
            "sentiment_compound": -0.7717
        },
        {
            "id": "i639a1q",
            "score": 1,
            "text": "It was very confusing working at an Outback Steakhouse in Australia. Like that ain’t what we eat at all.",
            "title_similarity": "0.5960977",
            "sentiment_compound": 0.079
        },
        {
            "id": "i63ar7u",
            "score": 1,
            "text": "Andres Steakhouse intelligent dining solutions",
            "title_similarity": "0.39638814",
            "sentiment_compound": 0.5719
        },
        {
            "id": "i63av1j",
            "score": 1,
            "text": "When I was in Australia a few years ago I saw an Outback Steakhouse. I’m trying to remember if it was on the outskirts of Sydney or Melbourne that I saw it. I was curious if it was the same as here. I thought about going, but I didn’t have a rental car and it would be been like a $30 each way Uber. I wasn’t that curious.",
            "title_similarity": "0.7119473",
            "sentiment_compound": 0.7814
        },
        {
            "id": "i63b4t9",
            "score": 1,
            "text": "Their potato soup is good",
            "title_similarity": "0.23004925",
            "sentiment_compound": 0.4404
        },
        {
            "id": "i63b6zf",
            "score": 1,
            "text": "I worked at an outback, worst job I ever had. I was later a part of a class action lawsuit against the company for making employees work off the clock. What a nightmare, I could tell so many stories.",
            "title_similarity": "0.44964778",
            "sentiment_compound": -0.7184
        },
        {
            "id": "i63ce7j",
            "score": 1,
            "text": "Ate here in Vegas. As an Australian, I giggled. We don't eat or say anything on the menu",
            "title_similarity": "0.5926771",
            "sentiment_compound": 0.3612
        },
        {
            "id": "i63cee0",
            "score": 2,
            "text": "Fun fact. My dad knew that guy and he was on his last string. He started as a chef in New Orleans. He had maybe $40 in his pocket. He was given an opportunity by his friends who backed his idea. I’d say it’s a success. Btw, that’s why they used to have a remoulade sauce which is distinctly Louisianan.",
            "title_similarity": "0.6302197",
            "sentiment_compound": 0.9186
        },
        {
            "id": "i63kmni",
            "score": 1,
            "text": "TIL that Australia was founded by people who had never gone to an Outback Steakhouse.\n\nExplains the differences.",
            "title_similarity": "0.74339074",
            "sentiment_compound": 0.0
        },
        {
            "id": "i63l8am",
            "score": 1,
            "text": "I go there specifically for their prime rib. It has a such a great turnover rate that they make it everyday and the slice is perfect each time. Plus it’s at a decent price. \n\nProtip- add some A-1 sauce to the au jus for the greatest steak dip ever.",
            "title_similarity": "0.5846132",
            "sentiment_compound": 0.9186
        },
        {
            "id": "i63m60y",
            "score": 1,
            "text": "The “Blooming Onion” inspired Nirvana’s hit song “In Bloom”.",
            "title_similarity": "0.38326797",
            "sentiment_compound": 0.4939
        },
        {
            "id": "i63mi2h",
            "score": 1,
            "text": "Classic american move.",
            "title_similarity": "0.24347374",
            "sentiment_compound": 0.0
        },
        {
            "id": "i63oycf",
            "score": 1,
            "text": "No wonder it seems like it's trying way too hard.  \nNo wonder it pushes the cliches so hard lol",
            "title_similarity": "0.18311921",
            "sentiment_compound": -0.0227
        },
        {
            "id": "i63td6j",
            "score": 1,
            "text": "This is probably more interesting if you were under the impression that Outback was founded by Australians.",
            "title_similarity": "0.28337976",
            "sentiment_compound": 0.5984
        },
        {
            "id": "i63xgpd",
            "score": 1,
            "text": "Love it! I’m Australian and I’ve always wondered why the menu is very American rather than Australian!",
            "title_similarity": "0.6750277",
            "sentiment_compound": 0.6988
        },
        {
            "id": "i64186t",
            "score": 1,
            "text": "This kinda thing happens all the time. I live in Germany, and a few years back a group of Arabs decided to open a \"Mexican\" restaurant in my town. There was not a single chili on the whole building. The entire menu was basically just chicken and tomato. Suggestions that they actually sell something resembling Mexican food were laughed at.\n\nThey were in business for only like 6 months though, so that's good.",
            "title_similarity": "0.7559762",
            "sentiment_compound": 0.8261
        },
        {
            "id": "i641qmb",
            "score": 1,
            "text": "I never knew they were out of Tampa, but what I saw this weekend makes some sense maybe.  I was in the Tampa area and saw a place I never heard of before, Aussie Grill.  Apparently it’s a new fast food drive through Outback chain.  Not sure if it’s many places yet, but I’d never seen it or heard about it before.",
            "title_similarity": "0.745951",
            "sentiment_compound": -0.3491
        },
        {
            "id": "i641t62",
            "score": 1,
            "text": "TIL Outback Steakhouse is meant to be Australian.",
            "title_similarity": "0.57795215",
            "sentiment_compound": 0.0
        },
        {
            "id": "i6452ur",
            "score": 1,
            "text": "I always thought Subaru was an Australian car company because of the crocodile Dundee commercials for the Subaru Outback. The ad campaign made so much of an impression that even though I know it’s not Australian, my mind still thinks of Australia involuntarily whenever I see a Subaru to this day.",
            "title_similarity": "0.7322917",
            "sentiment_compound": 0.2263
        },
        {
            "id": "i646919",
            "score": 1,
            "text": "As an Australian I would design the menu including, Vegemite options for breakfast, meat pies for lunch and roast lamb with veges for dinner",
            "title_similarity": "0.553542",
            "sentiment_compound": 0.0
        },
        {
            "id": "i6476ja",
            "score": 1,
            "text": "I worked at an Outback in Tampa a while ago, not the original one though. The VP (or some one else very important don’t quote me) care to visit and he was, to my surprise, actually Australian.",
            "title_similarity": "0.66264987",
            "sentiment_compound": 0.6631
        },
        {
            "id": "i648pks",
            "score": 1,
            "text": "I’m from the Tampa Bay Area so I have always known Blooming Brands was HQ’ed in Tampa. I lived in Tokyo for years and I took an Aussie friend to the Outback in Yokohama. You should have seen his face when he walked in. Also, ask an Aussie who has seen their commercials about “throw another shrimp on the Barbie.” Their head explodes screaming that they are called “prawns!”",
            "title_similarity": "0.77356017",
            "sentiment_compound": 0.2244
        },
        {
            "id": "i649y5z",
            "score": 1,
            "text": "I dined there a few years back when I visited from Australia. My first thought when I read the menu was \"whoever invented this has clearly never been to Australia\".",
            "title_similarity": "0.7206125",
            "sentiment_compound": 0.4019
        },
        {
            "id": "i64csbj",
            "score": 1,
            "text": "Never heard of it and Im from aus",
            "title_similarity": "0.2556442",
            "sentiment_compound": 0.0
        },
        {
            "id": "i64fltk",
            "score": 1,
            "text": "Do they serve Foster’s",
            "title_similarity": "-0.02916969",
            "sentiment_compound": 0.0
        },
        {
            "id": "i651ett",
            "score": 1,
            "text": "Crikey",
            "title_similarity": "-0.068912506",
            "sentiment_compound": 0.0
        },
        {
            "id": "i65mf79",
            "score": 1,
            "text": "That explains a bit",
            "title_similarity": "-0.15953642",
            "sentiment_compound": 0.0
        },
        {
            "id": "i6795oi",
            "score": 1,
            "text": "There are Outback Steakhouses in Australia.  You have an American Australian restaurant chain in Australia.",
            "title_similarity": "0.66184974",
            "sentiment_compound": 0.0
        },
        {
            "id": "i682bz6",
            "score": 1,
            "text": "My great uncle is one of those 4 guys. I’ve only met him once for my grandpa’s (his brother’s) funeral. My dad has more memories of him, and according to him, he’s very generous however doesn’t like to joke around a lot. We have a rule in the family that says that nobody treat him like he’s a millionaire.",
            "title_similarity": "0.5956774",
            "sentiment_compound": 0.9336
        },
        {
            "id": "i6jpe1e",
            "score": 1,
            "text": "Tampa native here. The four guys founded Bloomin‘ Brands, and are responsible for Bonefish Grill, Fleming’s, and Carrabba’s. The original location is still open today, and has since acted as a testing ground for food items, and drink options.",
            "title_similarity": "0.6443351",
            "sentiment_compound": 0.5574
        },
        {
            "id": "i6rqaqn",
            "score": 1,
            "text": "\"That's not a knife\"",
            "title_similarity": "-0.0043964847",
            "sentiment_compound": 0.0
        },
        {
            "id": "i725cw7",
            "score": 1,
            "text": "Haha I thought so. There was a wave in the 80s to 90s I would say. I think the founders should have tried to be a little more kitschy. They don't seem to have anything that distinguishes them from Applebees or something. Also I made a playlist on Spotify with Australian artists about hearing someone say Australia only has AC DC and the Wiggles. Blasphemy, I say!  80s Australia is definitely a vibe I wish we had. It seemed so fun,not only did we get Crocodile Dundee and Young Einstein ( who taught me in a TV spot about the reversed seasons- \" when it's winter here, it's summer there.\") I still remember! We also got to listen to such gems as Men at Work. Late 80s saw the release of Rescuers Down Under, but no Australian artists on the sound track, so couldn't put it in my playlist. I've get plenty of INXS though. 90s saw Kylie and Savage Garden make a breakthrough. 2000s primarily Silverchair. Anyway, I'm rambling. I'm trying to think what I'll play at my Aussie themed bar to compete with Outback Steakhouse. Also, I know no one drinks Fosters, but they had a damn good ad campaign here. 🤣🤣🤣 https://open.spotify.com/playlist/4Ng7y9wRMVRSom2VdRJuDS?si=2CvWeEFXSJ-P8sKqSwv1VA&utm_source=copy-link.  Playlist for said bar.",
            "title_similarity": "0.7510798",
            "sentiment_compound": 0.9183
        },
        {
            "id": "i7cv40a",
            "score": 1,
            "text": "I used to live about a mile away from the first Outback Steakhouse restaurant when I was growing up.  My mother is Australian so she was super pleased!",
            "title_similarity": "0.7550694",
            "sentiment_compound": 0.8424
        },
        {
            "id": "i7qvxan",
            "score": 1,
            "text": "Wasn't there an episode of Atlanta about this a few weeks back but with a Nigerian restaurant in Holland?",
            "title_similarity": "0.5393878",
            "sentiment_compound": 0.0
        },
        {
            "id": "i88tvun",
            "score": 1,
            "text": "Cultural appropriation, mate.",
            "title_similarity": "0.062881835",
            "sentiment_compound": 0.0
        }
    ]
}