{
    "TIL in 2000, an art exhibition in Denmark featured ten functional blenders containing live goldfish. Visitors were given the option of pressing the “on” button. At least one visitor did, killing two goldfish. This led to the museum director being charged with and, later, acquitted of animal cruelty.\n": [
        {
            "id": "i8301uv",
            "score": -2,
            "text": "ITT: pearl-clutching from people who are very likely meat-eaters. \n\nYou don't want animals to die? How about try not eating them?",
            "title_similarity": "0.5368756",
            "sentiment_compound": -0.6686
        },
        {
            "id": "i827jd3",
            "score": 48,
            "text": "I hate this wave of art where people just dare passers by to do dumb shit. Like that lady who does those exhibits where she just stands still and puts a bunch of tools in front of her and let’s people do whatever they want, and she’s got scissors and a gun and shit. \n\nIt’s not just that humans suck, it’s that they want to be part of it. Buttons are to be pressed, guns are to be fired, there’s this implication that there’s a point to the whole thing. When there’s not, and the end result is “wow I can’t believe they did that”, idk….just seems dumb.",
            "title_similarity": "0.46822986",
            "sentiment_compound": -0.9729
        },
        {
            "id": "i826fsl",
            "score": 10,
            "text": "Why didn’t they just deactivate the button so even if an idiot pressed it, the fish wouldn’t die, but you would still know what a piece of shit that person was. Hook the button up instead to flashing lights and a siren letting everyone know that the person is an asshole.",
            "title_similarity": "0.60944545",
            "sentiment_compound": -0.8591
        },
        {
            "id": "i82vzla",
            "score": -3,
            "text": "The museum director should have been convicted. What did they expect would happen. Blended goldfish is a foreseeable consequence of setting up the display.",
            "title_similarity": "0.62920487",
            "sentiment_compound": 0.0
        },
        {
            "id": "i82dvv8",
            "score": 8,
            "text": "“Some people are terrible when given the opportunity” is a shit art statement.\n\nIt’s not exactly a novel concept *gestures at all of human history*",
            "title_similarity": "0.2876259",
            "sentiment_compound": -0.8254
        },
        {
            "id": "i82myqb",
            "score": -2,
            "text": "People are monsters. We don't need \"art\" to constantly try and prove that.",
            "title_similarity": "0.24279775",
            "sentiment_compound": 0.0
        },
        {
            "id": "i82zcla",
            "score": 0,
            "text": "God I hate modern art.",
            "title_similarity": "0.18920104",
            "sentiment_compound": -0.3818
        },
        {
            "id": "i82g61w",
            "score": 3,
            "text": "[removed]",
            "title_similarity": "-0.07756862"
        },
        {
            "id": "i82z3gd",
            "score": -1,
            "text": "That's not art and anyone who says it is is a fucking sociopath.",
            "title_similarity": "0.24526748",
            "sentiment_compound": 0.0
        },
        {
            "id": "i829dr3",
            "score": 4,
            "text": "How is this art?",
            "title_similarity": "-0.12713307",
            "sentiment_compound": 0.0
        },
        {
            "id": "i82sdrq",
            "score": 4,
            "text": "How is it animal \"cruelty\" though, those fish died in like less than a second.",
            "title_similarity": "0.60996157",
            "sentiment_compound": -0.7184
        },
        {
            "id": "i82xw54",
            "score": 1,
            "text": "Anyone who thinks it's wrong to kill a fish unnecessarily, I hope you're vegan",
            "title_similarity": "0.51356864",
            "sentiment_compound": -0.7096
        },
        {
            "id": "i839gxz",
            "score": -6,
            "text": "Lmao everyone here hating on the reported. Yes i would've pressed the button too. It's just some stupid gold fish, who cares. And please don't come at me with \"but gold fish have souls\" or whatever PETA bullshit, everyone hurt animals in one way or another.",
            "title_similarity": "0.69469804",
            "sentiment_compound": -0.8481
        },
        {
            "id": "i835rbb",
            "score": 0,
            "text": "Yet when people unnecessarily catch fish and eat them, thats not animal cruelty?",
            "title_similarity": "0.5114659",
            "sentiment_compound": 0.4847
        },
        {
            "id": "i837he3",
            "score": 13,
            "text": "I don't get the outrage. Anyone eating meat in a industrial society is contributing to far more suffering than the near instantaneous dead of the goldfish. \n\nAnd no, you are not eating meat to survive. Living in a industrial society means that meat consumption is for pleasure not sustenance.",
            "title_similarity": "0.6279871",
            "sentiment_compound": -0.3162
        },
        {
            "id": "i82oban",
            "score": 2,
            "text": "As an avid fishkeeper hobbyist, this makes me unnecessarily livid.",
            "title_similarity": "0.43602973",
            "sentiment_compound": -0.3182
        },
        {
            "id": "i82yzsd",
            "score": 2,
            "text": "It would be better if it just turned a spotlight on the person who did it",
            "title_similarity": "0.080421895",
            "sentiment_compound": 0.4404
        },
        {
            "id": "i85ufkk",
            "score": 0,
            "text": "This logic has always annoyed me, the director did not in any way shape or form commit a crime. The fish were only ever in danger if someone else decided to kill them. \n\nIt's like the logic that it's your fault your house got robbed because you forgot to close the front door when leaving... like no!? Someone decided to commit a crime!",
            "title_similarity": "0.5982711",
            "sentiment_compound": -0.9272
        },
        {
            "id": "i826ce7",
            "score": -3,
            "text": "Why does it say \"Atleast One\".. That's a very open ended phrasing. Also how the heck was the director acquitted? Like he directly, and purposefully created that scenario. Yeah.. he didn't press the button. But he pretty much enticed people to do it.",
            "title_similarity": "0.39354658",
            "sentiment_compound": 0.8248
        },
        {
            "id": "i83h7ir",
            "score": 5,
            "text": "Unpopular opinion but… it’s a goldfish. I’d be willing to bet half of this sub have eaten fish in the past month. Whether or not you kill a fish is *not* a moral issue. No, I don’t think we should go around destroying fish just because, but I also think we need to prioritize our outrage.",
            "title_similarity": "0.74546355",
            "sentiment_compound": -0.6576
        },
        {
            "id": "i84fck5",
            "score": 2,
            "text": "I am vegan and I approve of this work of art. \n\nWe literally kill billions of animals everyday on purpose. And not just for food.\n\nWho cares?\n\nIt is just TWO fish?\n\nYou probably ate more animals today. \n\nDid you have two kinds of meat today? That is at least two animals.\n\nFor fucks sake.",
            "title_similarity": "0.7060077",
            "sentiment_compound": -0.7461
        },
        {
            "id": "i8257y5",
            "score": 115,
            "text": "And it proved the exhibits point: humans bad",
            "title_similarity": "0.18452632",
            "sentiment_compound": -0.5423
        },
        {
            "id": "i82byf9",
            "score": 10,
            "text": "Blender on button should shock whomever tries to turn it on.",
            "title_similarity": "0.285643",
            "sentiment_compound": -0.3818
        },
        {
            "id": "i82qgyk",
            "score": -2,
            "text": "TIL you can publicly be a sociopath as long as you present it as a social experiment/museum art",
            "title_similarity": "0.31165472",
            "sentiment_compound": 0.0
        },
        {
            "id": "i82wpdl",
            "score": 2,
            "text": "> The fish were killed \"instantly\" and \"humanely\", said Judge Preben Bagger.\n\nHaha blender go brrrr\n - the guy who made a fish smoothie, probably",
            "title_similarity": "0.72357947",
            "sentiment_compound": -0.3612
        },
        {
            "id": "i82yk8o",
            "score": 2,
            "text": "Man, you don't want to come to one of my crawfish boils. I'm like Hitler for crawfish.",
            "title_similarity": "0.6196805",
            "sentiment_compound": 0.3134
        },
        {
            "id": "i83badu",
            "score": -2,
            "text": "[removed]",
            "title_similarity": "-0.07756862"
        },
        {
            "id": "i831us4",
            "score": 20,
            "text": "ITT: meat-eating hypocrites",
            "title_similarity": "0.45887518",
            "sentiment_compound": 0.0
        },
        {
            "id": "i8377cx",
            "score": -3,
            "text": "I would have pressed. By the time you eat your next cheeseburger, you would have indirectly killed one cow and enslaved (and soon killed) another.\n\nIm keeping it real.",
            "title_similarity": "0.6177105",
            "sentiment_compound": -0.9136
        },
        {
            "id": "i83a4q2",
            "score": -3,
            "text": "Last week: women should abort babies.\nThis week: aborting goldfish is cruel.",
            "title_similarity": "0.6648066",
            "sentiment_compound": -0.5859
        },
        {
            "id": "i83loge",
            "score": -4,
            "text": "I don’t like how people are comparing this to meat. These animals are dying for a stupid art piece. It’s not the same as killing for food. Plus many people don’t even eat meat.",
            "title_similarity": "0.50418276",
            "sentiment_compound": -0.743
        },
        {
            "id": "i82z4kt",
            "score": 1,
            "text": "I hate most people.",
            "title_similarity": "0.23249555",
            "sentiment_compound": -0.5719
        },
        {
            "id": "i834xoy",
            "score": 1,
            "text": "And not a person will state the obvious?\n\nThe \"artist\" and horrible person pressing the button are both fucking assholes and belong in a mental institution.",
            "title_similarity": "0.38443175",
            "sentiment_compound": -0.8221
        },
        {
            "id": "i83668r",
            "score": 1,
            "text": "They could have made it so that it recorded that someone pressed the button without actually *blending the poor live goldfish!*  WTF? The museum could make the point they were trying to make *without* actually being cruel to the fish. Honestly, whoever set that up as an exhibit must be some kind of psychopath.",
            "title_similarity": "0.66377115",
            "sentiment_compound": -0.4316
        },
        {
            "id": "i838y40",
            "score": 1,
            "text": "Why wouldn't they just make the blenders not work, so you only find out after outing yourself as a psychopath?",
            "title_similarity": "0.4137753",
            "sentiment_compound": 0.0
        },
        {
            "id": "i83veak",
            "score": 1,
            "text": "Every day billions of fish are left to die of asphyxia. Others are gutted while still alive to make your food \"fresher\".   \nWeird that we think the guy who instantly killed a couple of goldfish is the bad guy while we're happily munching down on a filet-o-fish and negligently sponsoring the wholesale destruction of ocean web of life.   \nI guess, maybe, that was the point of the art display...?",
            "title_similarity": "0.83039486",
            "sentiment_compound": -0.9022
        },
        {
            "id": "i84i2el",
            "score": -1,
            "text": "This is fucking ridiculous.  A goldfish . It's a damn goldfish.",
            "title_similarity": "0.505319",
            "sentiment_compound": -0.6697
        },
        {
            "id": "i829qrp",
            "score": 260,
            "text": "Maybe he pressed it thinking it wouldnt actually turn on",
            "title_similarity": "0.016166093",
            "sentiment_compound": 0.0
        },
        {
            "id": "i83esci",
            "score": 4,
            "text": "The real art here are all the comments from people wishing harm on the person who killed a goldfish but eat animals daily, fish recreationally, and so on",
            "title_similarity": "0.7707063",
            "sentiment_compound": -0.5499
        },
        {
            "id": "i8299al",
            "score": 352,
            "text": "Millions of fish are killed every year for food, so it's hypocritical that killing goldfish is animal cruelty but killing salmon is fine. I eat meat, I'm just pointing out the hypocrisy.",
            "title_similarity": "0.7897862",
            "sentiment_compound": -0.9318
        },
        {
            "id": "i82bsgn",
            "score": -1,
            "text": "Reminds me of the siren that went of in the bar when somebody opened the door above the crotch of a naked man's picture. Probably because the same thing should have happened here, blenders unplugged and sirens hooked up, because at least one person thinks they're smarter and that blenders aren't hooked up.",
            "title_similarity": "0.57253516",
            "sentiment_compound": 0.4588
        },
        {
            "id": "i82wo15",
            "score": 2,
            "text": "Perfectly legal and you get paid to do that to male chicks though in the egg industry, humans are very morally inconsistent.",
            "title_similarity": "0.49386555",
            "sentiment_compound": 0.6908
        },
        {
            "id": "i82xkzp",
            "score": 1,
            "text": "convict........the person who actually chose to blend the goldfish??",
            "title_similarity": "0.574316",
            "sentiment_compound": 0.0
        },
        {
            "id": "i830aga",
            "score": -2,
            "text": "The museam is at fault. Most people are good but its just a matter of when. You can only roll the dice so long",
            "title_similarity": "0.3056156",
            "sentiment_compound": 0.0981
        },
        {
            "id": "i833g3s",
            "score": 2,
            "text": "\"High art \"lover are the biggest douchebags on the planet",
            "title_similarity": "0.37850136",
            "sentiment_compound": 0.5859
        },
        {
            "id": "i836ydl",
            "score": 2,
            "text": "The button should just shock the fuck out of the person pressing it.  Would have made the artist's point just fine and been way more satisfying.",
            "title_similarity": "0.26362246",
            "sentiment_compound": -0.2516
        },
        {
            "id": "i836yy5",
            "score": -1,
            "text": "I mean, I would also do it. Just to prove such an \"art\" is just stupid bs.",
            "title_similarity": "0.24127796",
            "sentiment_compound": -0.5267
        },
        {
            "id": "i83ox54",
            "score": -1,
            "text": "They should do this but with pitbulls",
            "title_similarity": "0.17296773",
            "sentiment_compound": 0.0
        },
        {
            "id": "i83vqy7",
            "score": 2,
            "text": "The museum director might be an idiot but the button presser is an A-grade asshole.",
            "title_similarity": "0.46093935",
            "sentiment_compound": -0.2846
        },
        {
            "id": "i85yhtm",
            "score": -3,
            "text": "Who gives a fuck they're gold fish, it's pretty fucked up they would charge someone for that",
            "title_similarity": "0.5338459",
            "sentiment_compound": -0.6908
        },
        {
            "id": "i82y9qk",
            "score": 23,
            "text": "I bet that person was like \"theres no way they'd put goldfish in an actual functioning blender\" just before pressing the button",
            "title_similarity": "0.60284734",
            "sentiment_compound": 0.0772
        },
        {
            "id": "i82nx5h",
            "score": 38,
            "text": "Whats more cruel, instant death from a blender, or being boiled alive like most shellfish in the US?",
            "title_similarity": "0.717282",
            "sentiment_compound": -0.6318
        },
        {
            "id": "i82gm5i",
            "score": 10,
            "text": "All they had to do was not plug them in!",
            "title_similarity": "0.031280283",
            "sentiment_compound": 0.0
        },
        {
            "id": "i82su0r",
            "score": 3,
            "text": "Why was the director charged with animal cruekty. A visitor made the decision to push the button an shred two goldfish, not the director.",
            "title_similarity": "0.77160835",
            "sentiment_compound": -0.2023
        },
        {
            "id": "i8314my",
            "score": 3,
            "text": "In the early 80s, my middle school science teacher bred lab rats. At the end of the year, he sedated a few with chloroform and performed a vivisection: the rat's heart was still beating and lungs still breathing. After the vivisection was over, I skinned the rat, took its pelt home, and tried to tan it because I read about it in the book *My Side of the Mountain*. My mom wasn't happy but dad was.",
            "title_similarity": "0.620757",
            "sentiment_compound": -0.1025
        },
        {
            "id": "i835uon",
            "score": 2,
            "text": "This is a rip off of a piece i saw years ago. It was a goldfish in a blender, plugged into a wall outlet with a tempting switch. It put the **idea** of “would I or not?” in a person’s mind, which was the point of it.        \n\nWhether the blender can *actually* kill the goldfish is not the point (which the Denmark exhibition misses completely ) and seems stupid",
            "title_similarity": "0.76551867",
            "sentiment_compound": -0.875
        },
        {
            "id": "i8420mv",
            "score": 4,
            "text": "The artist should have made the blender not work and instead connect the button to sign that flips up and says “congratulations you’re a monster” that way the fish wouldn’t be in danger at all but pressing the button would show everyone their true intentions",
            "title_similarity": "0.5737933",
            "sentiment_compound": 0.3612
        },
        {
            "id": "i84qp5j",
            "score": 3,
            "text": "Fuck everyone involved in that. \n\nSigned,\nAn art dealer",
            "title_similarity": "0.32957858",
            "sentiment_compound": -0.5423
        },
        {
            "id": "i82zsns",
            "score": 8,
            "text": "Should have just said they were on, and then shock anyone who tried to turn them on and drop some slime on them nickelodeon style.",
            "title_similarity": "0.4794236",
            "sentiment_compound": -0.5719
        },
        {
            "id": "i82puj1",
            "score": 89,
            "text": "I don't know how cruel it was.\n\nBlender's pretty quick compared to most people's methods of disposing of a fish.  My dorm floor went through a fish craze for about a year and there was this fish that kept getting passed around, something called a \"grommy,\" kept killing other fish.  Much debate was had on how to kill the fish.  Flush?  Flip it out of the tank?  Crush it with a rock?  I eventually won out with the \"protraction is the essence of suffering\" argument and we ended up, well, blending said fish.  It was more or less instant.  One second there was a fish and the next there was soup.  Only thing that could have been faster would be a firecracker, but then there would be a period where it was not in water and therefore unhappy.",
            "title_similarity": "0.7754218",
            "sentiment_compound": -0.7994
        },
        {
            "id": "i835l3g",
            "score": 27,
            "text": "Aquarium hobbyist here. Food for thought:\n\nHow long was this art installation/exhibition in place for?\n\nKeeping goldfish in unheated water it fine in most indoor room temperatures, but did these functional blenders have airstones or filtration. Were the fish being fed, were the ammonia, nitrite and nitrate levels being monitored. Were the blenders being cleaned? How large were the pitchers of these blenders, 4 liters?\n\nI'd wager the living conditions were suboptimal for these fish and the cruelty was occurring before the button was pressed.",
            "title_similarity": "0.69337845",
            "sentiment_compound": -0.7572
        },
        {
            "id": "i82xkni",
            "score": 32,
            "text": "Seems reasonable. Literally the entire point of the exhibit is tempting people to kill an animal (hence why the blenders are still functional) so in a way it is inviting animal cruelty.",
            "title_similarity": "0.5634371",
            "sentiment_compound": -0.8074
        },
        {
            "id": "i82trsv",
            "score": 0,
            "text": "I would press the button, more to see if it actually did anything than any intent of violence. I’m not the one putting fish in a blender, I’m not a monster.\nOr I’ll tell myself that.",
            "title_similarity": "0.3634942",
            "sentiment_compound": -0.6249
        },
        {
            "id": "i82vc8c",
            "score": 0,
            "text": "On some not-distant future those actions will be permanently on your citizen profile.",
            "title_similarity": "0.11610675",
            "sentiment_compound": 0.0
        },
        {
            "id": "i82wh5f",
            "score": 0,
            "text": "This was about the poor fish but everyone is talking about Abramovich performance. I weep for the poor innocent animals who got cruelly killed because humans are dicks.",
            "title_similarity": "0.67295015",
            "sentiment_compound": -0.9705
        },
        {
            "id": "i82z0t1",
            "score": -4,
            "text": "I'm sorry, acquitted?\n\nFuck that. The director and asshole who set it up should be in fucking jail.",
            "title_similarity": "0.45956218",
            "sentiment_compound": -0.4215
        },
        {
            "id": "i835dss",
            "score": 0,
            "text": "The fish would have died faster than any fish you fish out of a pond does. Is it really animal cruelty?",
            "title_similarity": "0.6114135",
            "sentiment_compound": -0.8307
        },
        {
            "id": "i835x3i",
            "score": 4,
            "text": "I genuinely hate this shit. Tell your story or make your point without being a cunt to other species.",
            "title_similarity": "0.24837044",
            "sentiment_compound": -0.7447
        },
        {
            "id": "i836gs4",
            "score": 0,
            "text": "IDK why I just laughed at that story and thought hood for the person who pushed on. I need help.",
            "title_similarity": "0.2691035",
            "sentiment_compound": 0.5525
        },
        {
            "id": "i83d6mw",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "-0.07756862"
        },
        {
            "id": "i83eux9",
            "score": 0,
            "text": "The only true justice here would be to blend the artist.",
            "title_similarity": "0.09163603",
            "sentiment_compound": 0.7351
        },
        {
            "id": "i83ga10",
            "score": 0,
            "text": "First rule of Mueseums is don’t touch the art.",
            "title_similarity": "0.05913738",
            "sentiment_compound": 0.0
        },
        {
            "id": "i83hc9t",
            "score": 0,
            "text": "Right because keeping fish that need 50+ gallons of water in a blender isn’t prolonged suffering by ammonia poisoning.\n\nOh right if they acknowledge that they have to charge everyone with a fish bowl.\n\nDo it.",
            "title_similarity": "0.63191634",
            "sentiment_compound": -0.7845
        },
        {
            "id": "i83j2tk",
            "score": 0,
            "text": "I was an intern here in Denmark at a medium-ish sized company. The owner was an art collector so the office was super artistic, almost like an exhibition. In one of the meeting rooms there was one of the “art pieces” from this exhibition. Mind you, one of the blended ones… It was mostly clear water with a few pieces of… orange goo.",
            "title_similarity": "0.4943452",
            "sentiment_compound": 0.8275
        },
        {
            "id": "i83kshl",
            "score": 0,
            "text": "Ok so blending a goldfish is animal cruelty but putting a chicken in a cage for its whole life then cutting it's throat while it's slung upside down isn't?",
            "title_similarity": "0.7066109",
            "sentiment_compound": -0.3818
        },
        {
            "id": "i83kukl",
            "score": 0,
            "text": "Goldfish are sadly abused all the time. Some morons still think they have a five second memory and live less than a month. Tell that to my goldfish, Angus, who is three years old and has a daily routine. He even recognises me from other people.",
            "title_similarity": "0.7078901",
            "sentiment_compound": -0.8126
        },
        {
            "id": "i83lf2n",
            "score": 0,
            "text": "Good! Fuck that museum director.  Obliterating animals with blender is not \"art\", it's fucking monstrous cruelty.  The director, artist, and button pusher should be charged.",
            "title_similarity": "0.557874",
            "sentiment_compound": -0.7827
        },
        {
            "id": "i83ro4v",
            "score": 0,
            "text": "Shoot, I know y’all won’t believe me but in high school some students put many live gold fish in a blender and ran it on frappe to have another student drink it, which they did \n\nThat was a wild talent show assembly",
            "title_similarity": "0.7350434",
            "sentiment_compound": 0.4588
        },
        {
            "id": "i83tbc1",
            "score": 0,
            "text": "This kind of \"Art\" sucks. I'm sure there's a specific name for it. Like those websites that showed you a button and if you clicked the button it would destroy the website. Only this involved killing vertebrate animals. \n\nThe museum director and/or artist should have been convicted.",
            "title_similarity": "0.66798264",
            "sentiment_compound": -0.765
        },
        {
            "id": "i83wi70",
            "score": 0,
            "text": "Idk what y’all are on but I would not have hesitated to turn on a blender. If I didn’t sign a release form to participate in an experiment, then I fully expect pressing that button to do something other than kill a fish. I’m the guy that presses it to reveal the artists hidden message, which in this case I guess was a dead fish.",
            "title_similarity": "0.6338015",
            "sentiment_compound": -0.9225
        },
        {
            "id": "i83yxeu",
            "score": 0,
            "text": "This is similar to Marina Abramovic's \"Rhythm 0\" performance. The only difference is that at the centre of such experiment was herself. \n\nCheck it out: [M.Abramovic \"Rhythm 0\" - Wikipedia](https://en.m.wikipedia.org/wiki/Rhythm_0)",
            "title_similarity": "0.22687194",
            "sentiment_compound": 0.0
        },
        {
            "id": "i844zth",
            "score": 0,
            "text": "I blame the “artist,” not the audience. \n\nGiven the opportunity, crowds always find a way to do stupid stuff, and most aren’t really thinking in terms of life and death when they attend these types of events. \n\nWhy put animals needlessly in danger for the sake of making your “artistic point”? It just seems reckless and cruel to even risk it in the first place. I don’t buy the argument that they didn’t think someone would press a button on an art exhibit. Nonsense. \n\nWould the artist have done the same with a family pet?\n\nObviously not.",
            "title_similarity": "0.5127893",
            "sentiment_compound": -0.9734
        },
        {
            "id": "i8487dp",
            "score": 0,
            "text": "I know guys that would wipe the floor with the person that pressed that button.",
            "title_similarity": "0.294885",
            "sentiment_compound": 0.0
        },
        {
            "id": "i848m6h",
            "score": 0,
            "text": "What a sick fuk...",
            "title_similarity": "0.069604926",
            "sentiment_compound": -0.5106
        },
        {
            "id": "i848uho",
            "score": 0,
            "text": "I once took my 2 goldfish out of the aquarium and placed them side by side on a kleenex and watched if they would stop breathing at the same time… I was very young but I still remember how cruel that was.",
            "title_similarity": "0.73459774",
            "sentiment_compound": -0.7783
        },
        {
            "id": "i84e6hz",
            "score": 0,
            "text": "It’s normal to put hooks in their mouth and then throw them back in the water, but killing one instantly in a blender is apparently cruel.",
            "title_similarity": "0.5801065",
            "sentiment_compound": -0.9231
        },
        {
            "id": "i84fkut",
            "score": 0,
            "text": "I would of pressed it too 🤷🏻‍♀️",
            "title_similarity": "-0.058463015",
            "sentiment_compound": 0.0
        },
        {
            "id": "i84idap",
            "score": 0,
            "text": "Dunno how they could get the museum director for anything.\n\nIf i put an aquarium on a stand and some guy comes and knocks it over, i'm not guilty of animal cruelty, the guy who knocked it over is. \n\nSame thing here - button or no, the person in the wrong is the one who pushed it.",
            "title_similarity": "0.63431334",
            "sentiment_compound": -0.6876
        },
        {
            "id": "i84j6wh",
            "score": 0,
            "text": "Mmmm sushi",
            "title_similarity": "0.17789267",
            "sentiment_compound": 0.0
        },
        {
            "id": "i84kvuk",
            "score": 0,
            "text": "Dang imagine bringing your kid to see goldfish and some jackass blends them up infront of your kids. They’d never drink any red smoothie or eat salsa again.",
            "title_similarity": "0.74535096",
            "sentiment_compound": -0.4215
        },
        {
            "id": "i84pnkg",
            "score": 0,
            "text": "I mean, tons of people pay for equipment and permits to shoot wildlife for sport. \n\nI'd say getting blended by a giant blender >>> getting a hole in your stomach and then bleed out over the course of hours.",
            "title_similarity": "0.65609616",
            "sentiment_compound": -0.4215
        },
        {
            "id": "i84q04f",
            "score": 0,
            "text": "I was in a daze mode for about an hour afterwards kind of like eating too many edibles on it.",
            "title_similarity": "0.50689167",
            "sentiment_compound": 0.1298
        },
        {
            "id": "i84rx88",
            "score": 0,
            "text": "\"art\"",
            "title_similarity": "-0.14018525",
            "sentiment_compound": 0.0
        },
        {
            "id": "i859mg4",
            "score": 0,
            "text": "imo, they should have been for animal cruelty alongside the artist. They could have made the same point by a siren going off or something without killing some innocent fish.",
            "title_similarity": "0.5070314",
            "sentiment_compound": -0.3442
        },
        {
            "id": "i85br90",
            "score": 0,
            "text": "I find the outrage about a dead goldfish in the comments really amusing. Not just due to the fact that fish with much more developed nervous systems are routinely caught en masse and slowly die on the deck of a boat for people to eventually eat (as has already been mentioned), but because this particular animal in question is bred to just sit in pet stores and handed out to children in literal bags at carnivals. Honestly, it seems more humane to kill the thing in a blender than to keep it as a “pet” in a small bowl.",
            "title_similarity": "0.7750021",
            "sentiment_compound": -0.8732
        },
        {
            "id": "i85kivv",
            "score": 0,
            "text": "Ngl I would have absolutely pressed that button not thinking it was real",
            "title_similarity": "0.19946012",
            "sentiment_compound": 0.0
        },
        {
            "id": "i85o5u4",
            "score": 0,
            "text": "North Europeans, to a certain degree, have no regard for life in general, like Chinese. Their kitchen culture, their social habits, their isolationist obsessiveness and the work ethic is just not right. It is at the best damaging mental health for sure. Weirdos...",
            "title_similarity": "0.4242683",
            "sentiment_compound": 0.4588
        },
        {
            "id": "i85ool6",
            "score": 0,
            "text": "Only 2 of the 10 buttons were pushed? I'm impressed. Try that in a lot of other countries, and all 10 of them will be pushed several times.",
            "title_similarity": "0.4832865",
            "sentiment_compound": 0.4767
        },
        {
            "id": "i85qsa8",
            "score": 0,
            "text": "The guy got paid by a tabloid so they could get their front page story.",
            "title_similarity": "0.3815782",
            "sentiment_compound": 0.0
        },
        {
            "id": "i8629rk",
            "score": 0,
            "text": "Am I a bad person for thinking that I probably would do it? Just like, it's right there, and I want to know it's real.",
            "title_similarity": "0.0069359127",
            "sentiment_compound": -0.1779
        },
        {
            "id": "i82y8hg",
            "score": 9,
            "text": "Who cares? Think about how much meat gets wasted and thrown out everyday? People cry about shit like this and a dog dying and then go eat bacon from an animal more intelligent. Omnivores are fucking weird.",
            "title_similarity": "0.6753922",
            "sentiment_compound": -0.5362
        },
        {
            "id": "i82v1fc",
            "score": 46,
            "text": "It’s an interesting argument by the artist. A more compelling exhibit would be one where, every hour, someone had to press the button so as to ensure the blender did not start.\n\nHow many hours would the fish live? How many people would take actions to save the lives of these fish, and to what level would they coordinate, as a single hour loss of coverage would result in their death? What would it say about us as a race that we don’t do all we can to save our fellow humans, but might coordinate (or not) to save a fish?\n\nMaybe even change the complexity of the task required on five different fish. How long would each live?\n\nI don’t think I could actually pull the trigger on such an exhibit, but it would be interesting to see what it revealed about humanity.",
            "title_similarity": "0.6607344",
            "sentiment_compound": 0.5854
        },
        {
            "id": "i825c7o",
            "score": 170,
            "text": "I mean….why???",
            "title_similarity": "-0.19161126",
            "sentiment_compound": 0.0
        },
        {
            "id": "i82kt5a",
            "score": 445,
            "text": "This isn't an art exhibit its a sociology experiment",
            "title_similarity": "0.12605831",
            "sentiment_compound": 0.0
        },
        {
            "id": "i82qxqj",
            "score": 37,
            "text": "Im danish, I remember when this took place. On the danish news it only took up like one minute. Surprised that it even qualifies for this subreddit, seems pretty boring to me. \nI can appreciate that only one weirdo used the installation in Denmark during it’s run in 2000. \n\nHowever, the piece has also travelled other museums in foreign countries; in Austria in 2006 while on exhibition, all the fish got kidnapped by unknown bullies, who managed to kill one of them in a blender before taking off with the rest of them. And in Chile in 2002 activists tried to break in and free the fish. \n\nSo I guess it did spawn some serious reactions, and that might qualify as art. I dunno. To me it’s too simple and sort of crappy any way around x)",
            "title_similarity": "0.8114531",
            "sentiment_compound": -0.3384
        },
        {
            "id": "i830sw3",
            "score": 4,
            "text": "meat eaters mad lol",
            "title_similarity": "0.40168545",
            "sentiment_compound": -0.1027
        },
        {
            "id": "i82lzgc",
            "score": 12,
            "text": "Danish citizen here.. actually quite many wanted to push the “on” button. As a result the museum had to unplug some of the blenders, otherwise there would be no goldfish left😳",
            "title_similarity": "0.61260134",
            "sentiment_compound": -0.296
        },
        {
            "id": "i83e95f",
            "score": 6,
            "text": "Everyone being aghast after reading this.\n\nNot realizing that for every egg laying chicken there was a roughly equal amount of pretty yellow male chicken babies thrown in a blender after being checked they've of wrong sex and cannot lay eggs.\n\nHow does your breakfast eggs taste now? Remember, if you eat eggs, you're pressing the \"blend a cute yellow chick\" button. Yummy yummy.",
            "title_similarity": "0.6955487",
            "sentiment_compound": 0.7906
        },
        {
            "id": "i826dy2",
            "score": -14,
            "text": "Why didn’t they just deactivate the button so even if an idiot pressed it, the fish wouldn’t die, but you would still know what a piece of shit that person was. Hook the button up instead to flashing lights and a siren letting everyone know that the person is an asshole.",
            "title_similarity": "0.60944545",
            "sentiment_compound": -0.8591
        },
        {
            "id": "i82dxug",
            "score": 1,
            "text": "My curiosity would be that it did something besides blend the goldfish up like shoot some confetti or something, then I’d feel completely terrible when it actually killed the thing.",
            "title_similarity": "0.68228155",
            "sentiment_compound": -0.8313
        },
        {
            "id": "i82gzs2",
            "score": 1,
            "text": "I see the will it blend guy has been here",
            "title_similarity": "-0.008341597",
            "sentiment_compound": 0.0
        },
        {
            "id": "i82vldr",
            "score": 1,
            "text": "that director is naive...",
            "title_similarity": "-0.0077461535",
            "sentiment_compound": -0.2732
        },
        {
            "id": "i82vzuf",
            "score": 1,
            "text": "how long would a goldfish have to swim around unattended in a small blender confinement before that alome would also be comsidered animal cruelty?",
            "title_similarity": "0.7310377",
            "sentiment_compound": -0.5994
        },
        {
            "id": "i82xdyy",
            "score": 1,
            "text": "How idiotic is this?  Firing over 2 gold fish. Stupidity at it's highest!",
            "title_similarity": "0.6151316",
            "sentiment_compound": -0.8478
        },
        {
            "id": "i82z13y",
            "score": 1,
            "text": "He shouldn't have been acquitted.",
            "title_similarity": "0.1188021",
            "sentiment_compound": -0.1877
        },
        {
            "id": "i82z5w8",
            "score": 1,
            "text": "\"nature's fate IS at our fingertips\" what a narcissistic point of view.",
            "title_similarity": "0.101261094",
            "sentiment_compound": 0.0
        },
        {
            "id": "i8305j6",
            "score": -1,
            "text": "Honestly it sounds like that exhibit had zero artistic merit. \"SoMe PeOpLe ArE pSyChOpAtHs\" like.. no shit.",
            "title_similarity": "0.30294424",
            "sentiment_compound": 0.914
        },
        {
            "id": "i831s0h",
            "score": 1,
            "text": "Wonder if this is where the old Joe Cartoon website got the idea from.",
            "title_similarity": "0.28050423",
            "sentiment_compound": 0.0
        },
        {
            "id": "i834lod",
            "score": 1,
            "text": "I would have done it because I thought the guy was fucking with me.",
            "title_similarity": "0.23549843",
            "sentiment_compound": 0.0
        },
        {
            "id": "i835niw",
            "score": 1,
            "text": "“Some humans would do anything to see if it was possible to do it. If you put a large switch in some cave somewhere, with a sign on it saying 'End-of-the-World Switch. PLEASE DO NOT TOUCH', the paint wouldn't even have time to dry.”\n\n-Terry Pratchett",
            "title_similarity": "0.46660146",
            "sentiment_compound": 0.4648
        },
        {
            "id": "i835xq6",
            "score": 1,
            "text": "Then, after someone does press it, make them drink it as to not let it go to waste.",
            "title_similarity": "0.08418886",
            "sentiment_compound": -0.4215
        },
        {
            "id": "i83633l",
            "score": -1,
            "text": "I've eaten live goldfish before, this is not that different",
            "title_similarity": "0.6088232",
            "sentiment_compound": 0.0
        },
        {
            "id": "i8373nv",
            "score": 1,
            "text": "Bruh wtf",
            "title_similarity": "-0.17534944",
            "sentiment_compound": -0.5859
        },
        {
            "id": "i839fkr",
            "score": 1,
            "text": "This is way more humane than letting the thousands of fish in the Danish fishing industry suffocate to death every year for people to eat. But that’s not animal cruelty. People are strange.",
            "title_similarity": "0.70951134",
            "sentiment_compound": 0.1454
        },
        {
            "id": "i839mp7",
            "score": 1,
            "text": "That’s a fucked up art exhibition. Especially for the fish.",
            "title_similarity": "0.5078843",
            "sentiment_compound": -0.6597
        },
        {
            "id": "i83ay9f",
            "score": 1,
            "text": "It's really shocking and upsetting that the artist was acquitted. This is very obviously animal cruelty. Calling animal cruelty \"art\" is just sickening.",
            "title_similarity": "0.48285735",
            "sentiment_compound": -0.9503
        },
        {
            "id": "i83f5bc",
            "score": 1,
            "text": "Poor fishies :((((",
            "title_similarity": "0.2721649",
            "sentiment_compound": -0.4767
        },
        {
            "id": "i83fhro",
            "score": 1,
            "text": "I swear some people i know must have been chewing lead weights as children. Fucking idiots.",
            "title_similarity": "0.5246709",
            "sentiment_compound": -0.0516
        },
        {
            "id": "i83hlzr",
            "score": 1,
            "text": "I hate art like this. It’s too reliant on the shock value of the situation. What is the messaging here? That at any given moment, anybody can simply decide to harm people/things around them? Is there anyone who isn’t already aware of that? I feel like we’ve moved past this.",
            "title_similarity": "0.34159493",
            "sentiment_compound": -0.533
        },
        {
            "id": "i83mhvj",
            "score": 1,
            "text": "Shouldn't have been acquitted. Abuse is abuse, no matter if you're a fish or any other living being. If the point of the installation was to prove that people are major assholes who don't hesitate to kill if they aren't held liable, then congrats, you didn't need to blend a fish to prove that point. The way some people treat their kids or indulge in terror activities or abuse is example enough.",
            "title_similarity": "0.5335977",
            "sentiment_compound": -0.9053
        },
        {
            "id": "i83n8tg",
            "score": 1,
            "text": "Bet you if there was puppies in that blender someone would have got charged. This is a clear case of goldfish discrimination! #goldfishlivesmatter 😂",
            "title_similarity": "0.64382124",
            "sentiment_compound": 0.6114
        },
        {
            "id": "i83nasm",
            "score": 1,
            "text": "It’s almost as bad as taking a dump in Johny Depp’s bed.",
            "title_similarity": "0.32250032",
            "sentiment_compound": -0.7024
        },
        {
            "id": "i83o0ih",
            "score": 1,
            "text": "Blending a goldfish is animal cruelty, but sterilizing the ocean or burning the forest is good business.",
            "title_similarity": "0.5992032",
            "sentiment_compound": 0.34
        },
        {
            "id": "i83r5a1",
            "score": -1,
            "text": "as an extreme bee enthusiast, this is anatomically incorrect. I shall take a moment to teach the people about bee excrement.\n\nFirstly, to the woe of those into both pee and bee, bees do not pee. Insects entirely lack kidneys, bladders, livers, and more.\n\nNow, to the question , do bees fart, and if they do, is it an extremely dirty fart at that? Well, lets first discuss bee poop.\n\nbees mostly use everything when making honey, which is basically pure energy and nutrients. Bee poop is mostly undigested pollen grains and more complex sugars. \n\nA bee could poop in your ice cream, and you would be none the wiser. you might even like, it better, for reasons ranging from \"culinary\" to sexual. \n\nBees are surprisingly clean creatures, and despite bee poop basically being failed candy, bees always leave the hive to poop, they do not poop inside the hive. As for the farting part, it is without a doubt that any animal could potentially have air trapped inside it, and therefore must expel it, however farting as we know it is much more than that. Regardless, a bee would not \"fart\", and if they did, it would be more akin to a floral perfume than a burst of sulfur and feces.",
            "title_similarity": "0.52208066",
            "sentiment_compound": -0.4377
        },
        {
            "id": "i83rst0",
            "score": 1,
            "text": "In America, those goldfish would all be dead by the end of the day",
            "title_similarity": "0.58345586",
            "sentiment_compound": -0.6486
        },
        {
            "id": "i83sbw5",
            "score": 1,
            "text": "I mean I'd press it thinking \"no way is this going to work\" and then I'd be absolutely horrified with myelf when it does work... I don't think I could cope with that kind of guilt after...\n\nEdit: even the thought of this situation is making me feel really horrible",
            "title_similarity": "0.37758735",
            "sentiment_compound": -0.8744
        },
        {
            "id": "i83suo5",
            "score": -1,
            "text": "I remember this.\n\nI visited the museum with my high school class after the first incident. They had unplugged the blenders and chained them together. Of course, that stopped nobody; three guys carried the blenders to the nearest power outlet, plugged in the blenders and shredded the fish. \n\nNobody told the press about this because actually nobody cared.",
            "title_similarity": "0.71390337",
            "sentiment_compound": 0.2263
        },
        {
            "id": "i83ttq5",
            "score": 1,
            "text": "I'd press the button because I'd doubt their sincerity to actually have it working.",
            "title_similarity": "0.16067469",
            "sentiment_compound": -0.3612
        },
        {
            "id": "i83twst",
            "score": -1,
            "text": "Why was he aquitted? \n\nSame logic as nazi apologists. \n\nOh I didn't kill all those jews, I just ordered the people with guns to!",
            "title_similarity": "0.5349271",
            "sentiment_compound": 0.6162
        },
        {
            "id": "i8434yg",
            "score": -1,
            "text": "I probably would have pushed it. More to test the artist's resolve than anything else.",
            "title_similarity": "0.1075411",
            "sentiment_compound": 0.3818
        },
        {
            "id": "i84901l",
            "score": -1,
            "text": "Oh no, your goldfish lived 2 days instead of 4!!!\n\nI had a friend that won 5 goldfish and put them in his pool (I think saltwater). We put on goggles and swam with them until they died. \n4 died within 10 minutes, 1 survived for like 40 min. \n\nI told him he shouldn’t take the goldfish if he wasn’t going to keep them. It was fun though. I’ve also never had a goldfish from the fair live for more than a week.",
            "title_similarity": "0.77917457",
            "sentiment_compound": 0.8996
        },
        {
            "id": "i84g0h3",
            "score": 1,
            "text": "I saw that exhibit. Didn’t push the on button. I went away satisfied in my knowledge that those poor fishies gained at least a few minutes thanks to me.",
            "title_similarity": "0.45444798",
            "sentiment_compound": 0.6369
        },
        {
            "id": "i84kv3w",
            "score": 1,
            "text": "Every time a post like this comes up I'm just further convinced that the only arguments vegans know how to make are false-equivalencies",
            "title_similarity": "0.47817898",
            "sentiment_compound": 0.3612
        },
        {
            "id": "i84oivj",
            "score": 1,
            "text": "Bizarre considering they do this to male chickens every single day. You're voting to hurt animals every time you eat them. It just makes people uncomfortable when they see it in real time.",
            "title_similarity": "0.6369536",
            "sentiment_compound": -0.8074
        },
        {
            "id": "i84pf8d",
            "score": 1,
            "text": "Today, I learned that you can italicize and strike through emojis.\n\n*~~🤨🤏🚽🥔🤔😃🥱🤮🤢~~*",
            "title_similarity": "0.22126104",
            "sentiment_compound": 0.25
        },
        {
            "id": "i84rxiu",
            "score": 1,
            "text": "That is not art.",
            "title_similarity": "-0.12156813",
            "sentiment_compound": 0.0
        },
        {
            "id": "i85647s",
            "score": 1,
            "text": ">He told the court that artistic freedom was at stake.\n\nFuck off you are playing with living animals you prick",
            "title_similarity": "0.45919713",
            "sentiment_compound": 0.0258
        },
        {
            "id": "i857krn",
            "score": 1,
            "text": "I'm going to go ahead and say he shouldn't have been acquitted, at least morally speaking if not legally. This is messed up.",
            "title_similarity": "0.2716507",
            "sentiment_compound": -0.5324
        },
        {
            "id": "i85ljfr",
            "score": 1,
            "text": "I remember a gallery owner telling me about a Dutch artist he worked with called Tinkerbell or something.\nShe made really extreme art pieces involving things like this. For example, she filled a gallery space with chicks and then said that at the end she would put them all in an industrial blender. \nOf course, everyone was shocked and disgusted and people were doing everything they could to stop it.\nWhich was all exactly what the artist was aiming for as her point was to show that people turn a blind eye to this happening in the egg-laying industry where male chicks are disposed of in that way, but freak out when it happens in front of them.\nI remember being shocked but also thinking how effectively she forced myself and other people to consider our double standards.\n(I think, and hope, that the chicks weren’t actually harmed in the end)",
            "title_similarity": "0.68754643",
            "sentiment_compound": -0.8957
        },
        {
            "id": "i826d7e",
            "score": 2394,
            "text": "Why didn’t they just deactivate the button so even if an idiot pressed it, the fish wouldn’t die, but you would still know what a piece of shit that person was. Hook the button up instead to flashing lights and a siren letting everyone know that the person is an asshole.",
            "title_similarity": "0.60944545",
            "sentiment_compound": -0.8591
        },
        {
            "id": "i82d8jz",
            "score": 8,
            "text": "Reminds me of the [SNL Bass-o-matic skit](https://www.nbc.com/saturday-night-live/video/bassomatic/n8631).",
            "title_similarity": "0.38248354",
            "sentiment_compound": 0.0
        },
        {
            "id": "i82v9rn",
            "score": 7,
            "text": "How is that animal cruelty but people boil lobsters alive all the time",
            "title_similarity": "0.7144412",
            "sentiment_compound": 0.2382
        },
        {
            "id": "i834zi8",
            "score": 9,
            "text": "I don’t eat meat but most people do.  The fish would have been killed instantly so how is this worse than killing a cow or a pig or whatever? Because it’s not for profit it’s a crime?",
            "title_similarity": "0.6287636",
            "sentiment_compound": -0.9826
        },
        {
            "id": "i82n1w4",
            "score": 2,
            "text": "But the art was a valuable lesson showing some people prefer to see others suffer.",
            "title_similarity": "0.15408817",
            "sentiment_compound": -0.1531
        },
        {
            "id": "i82v70t",
            "score": -2,
            "text": "That’s not art that’s sadism. Fuck everyone involved with this",
            "title_similarity": "0.21333316",
            "sentiment_compound": -0.5423
        },
        {
            "id": "i82zd2t",
            "score": 2,
            "text": "I miss modern art when it was just a button they told you to press and if you press it it says the n-word. And when people start yelling at you for saying the n-word you try to prove to them it was just the button, but each subsequent button press just says other benign words.\n\nNow that's art.",
            "title_similarity": "0.41732472",
            "sentiment_compound": 0.3919
        },
        {
            "id": "i833tjm",
            "score": 2,
            "text": "I think Bob Berdella did something similar in art school. He created a maze and everyone who entered was given a baby chick to hold. When they made it to the center of the maze, the participants were confronted with a video of an animal being shot with a shotgun. Some people hurt or even killed the chicks when they reflexively clenched their hands when they were startled.",
            "title_similarity": "0.6781872",
            "sentiment_compound": -0.8555
        },
        {
            "id": "i838tmq",
            "score": 2,
            "text": "Since when does everyone in the comments give a fuck about fish?",
            "title_similarity": "0.5181204",
            "sentiment_compound": -0.5423
        },
        {
            "id": "i839dm6",
            "score": 2,
            "text": "Should have sprayed ink on him and lit up a sign that says \"this dickhead killed the fish\"",
            "title_similarity": "0.6469595",
            "sentiment_compound": -0.8853
        },
        {
            "id": "i83shnp",
            "score": 2,
            "text": "A better way would be to place fake blenders and when people do press the button it would play, \"on a highway to hell\".",
            "title_similarity": "0.3452105",
            "sentiment_compound": -0.5267
        },
        {
            "id": "i83wrr7",
            "score": 2,
            "text": "There’s always one… We will NEVER have nice things. Pack it in folks…",
            "title_similarity": "0.1739096",
            "sentiment_compound": -0.3252
        },
        {
            "id": "i83zfjy",
            "score": 2,
            "text": "I mean how could you even charge them of animal cruelty when you look at what the meat, dairy & fishing industry does, near instant death in a blender? Shit the trillions of animals killed every year would **beg** to have that happen to them instead of being raped and tortured for weeks/months/years on end.",
            "title_similarity": "0.7625839",
            "sentiment_compound": -0.9779
        },
        {
            "id": "i840o1e",
            "score": 2,
            "text": "Good thing artistic freedom is more important than a non-humans freedom from being fucking blended. \n\nOnly good thing to come free this, is one sociopath has been outed.",
            "title_similarity": "0.2522907",
            "sentiment_compound": 0.9631
        },
        {
            "id": "i843224",
            "score": 2,
            "text": "That’s evil. Poor fish.",
            "title_similarity": "0.2576396",
            "sentiment_compound": -0.8176
        },
        {
            "id": "i843cf5",
            "score": 2,
            "text": "Make chicks are killed in a very similar way in much of the world. I don’t see the big deal",
            "title_similarity": "0.5414035",
            "sentiment_compound": -0.6705
        },
        {
            "id": "i848ypd",
            "score": 2,
            "text": "I want this art piece / experiment done again, but instead of killing the fish, the button emits enough of a shock to kill the button pusher.\n\nIt'd be neat.",
            "title_similarity": "0.57478744",
            "sentiment_compound": -0.9313
        },
        {
            "id": "i84aytk",
            "score": 2,
            "text": "What would have been a good idea would be to have the blend button activate a hidden camera instead. Whoever presses the button gets their picture taken and posted to a massive billboard outside the gallery with a nice big flashing \"animal abuser\" sign.",
            "title_similarity": "0.5106119",
            "sentiment_compound": 0.2732
        },
        {
            "id": "i84fwmy",
            "score": -2,
            "text": "It was goldfish… why are people acting like it’s a dog or something.",
            "title_similarity": "0.56820273",
            "sentiment_compound": 0.3612
        },
        {
            "id": "i84pgn2",
            "score": -2,
            "text": "Dumb. People kill fish every day, how is this different.",
            "title_similarity": "0.63508093",
            "sentiment_compound": -0.8402
        },
        {
            "id": "i84stsu",
            "score": 2,
            "text": "About 1 in 100 people are supposed to have sociopathic traits. So it's just a matter of time.",
            "title_similarity": "0.44430912",
            "sentiment_compound": 0.0258
        },
        {
            "id": "i82g4b8",
            "score": -17,
            "text": "I would have used baby chickens to represent all the birds killed by wind turbines. A thousand endangered owls/eagles killed every year, and that’s just one site.",
            "title_similarity": "0.71442616",
            "sentiment_compound": -0.875
        },
        {
            "id": "i831im0",
            "score": 9,
            "text": "Hey fun fact: male baby chicks are thrown into what is an industrial meat grinder as soon as their sex is verified inorder to not have to raise a rooster to maturity. They get the goldfish treatment all day, everyday, across the country.",
            "title_similarity": "0.750623",
            "sentiment_compound": 0.5106
        },
        {
            "id": "i83oryn",
            "score": 11,
            "text": "People here acting all disgusted at the guy who blended them, how do you reconcile that with the fact we kill and eat fish on an industrial scale?",
            "title_similarity": "0.6512159",
            "sentiment_compound": -0.8442
        },
        {
            "id": "i82v5aw",
            "score": 2,
            "text": "Don't goldfish cost like a $1 at a pet store and they bred those suckers like they are going out of style cause they don't really live all that long to begin with?",
            "title_similarity": "0.6257118",
            "sentiment_compound": -0.4423
        },
        {
            "id": "i82vxmr",
            "score": 2,
            "text": "if the resulting soup had been cooked and eaten there would have been no problem",
            "title_similarity": "0.27042276",
            "sentiment_compound": 0.3089
        },
        {
            "id": "i82wvxd",
            "score": 2,
            "text": "Thats disgusting\n\nLink to a video?",
            "title_similarity": "0.16956377",
            "sentiment_compound": -0.5267
        },
        {
            "id": "i82yvs6",
            "score": 2,
            "text": "Where is the line on \"animal cruelty\"? With this logic, going fishing is an act of animal cruelty...",
            "title_similarity": "0.4276436",
            "sentiment_compound": -0.8316
        },
        {
            "id": "i82z1uf",
            "score": -2,
            "text": "This is literally Donald Trump's America",
            "title_similarity": "0.17014828",
            "sentiment_compound": 0.0
        },
        {
            "id": "i832i1e",
            "score": 3,
            "text": "It’s amazing that this is the thing that outrages people. And yet, [this shit is considered standard practice.](https://youtu.be/LQRAfJyEsko)\n\nPeople crying about a blended goldfish, while they gobble up the flesh of tortured animals that they pay to be killed. It’s crazy.",
            "title_similarity": "0.6988887",
            "sentiment_compound": -0.9568
        },
        {
            "id": "i837qob",
            "score": 3,
            "text": "In America those fish would all be dead within the first couple of hours",
            "title_similarity": "0.52009106",
            "sentiment_compound": -0.6486
        },
        {
            "id": "i838frl",
            "score": 3,
            "text": "how many people scandalized by this eat meat every day? Those cows and chickens and pigs you buy in pieces from the store have way worse lives and die in more pain than these goldfish",
            "title_similarity": "0.6913553",
            "sentiment_compound": -0.8908
        },
        {
            "id": "i83b5uc",
            "score": 2,
            "text": "it’s odd to me that people in this thread are getting so defensive of goldfish.\n\nIt’s not like they died of slow suffocation in an unfiltered glass bowl. They were swiftly executed, much like billions of other fish in the meat industry.\n\nWhy is these two-fish dying for modern art a scandal, but billions of other fish dying for profit & convenience gets the seal-of-approval? Weird standards.",
            "title_similarity": "0.79816234",
            "sentiment_compound": 0.4944
        },
        {
            "id": "i83fk6n",
            "score": 2,
            "text": "Could've been fake blenders that the visitors believed were real. Would've been enough.",
            "title_similarity": "0.26307446",
            "sentiment_compound": -0.4767
        },
        {
            "id": "i83ok1c",
            "score": 3,
            "text": "Only 2? Yeah, just try and do this in America.",
            "title_similarity": "0.0771126",
            "sentiment_compound": 0.296
        },
        {
            "id": "i83zms4",
            "score": 3,
            "text": "Would have been cool if the button actually kicked you in the cock instead of blending the fish",
            "title_similarity": "0.457433",
            "sentiment_compound": 0.1779
        },
        {
            "id": "i84mz87",
            "score": 2,
            "text": "My physics teacher in high school told us he had a glass jar at the back of the class that he didn't want anyone disturbing, because as an amorphous solid, it can fuse together if left alone long enough, and that was his goal.\n\nAt the end of the year he admitted he knew people messed with it. He said that to test people. He wanted the kids intent on causing trouble focused on how to get into his locked cabinet at the back of the room (across the lab section, so not easy to get to 4/5 days of the week) instead of playing with the bunsen burners",
            "title_similarity": "0.55031264",
            "sentiment_compound": -0.2742
        },
        {
            "id": "i85ktjv",
            "score": -2,
            "text": "I'd press the button. 100%. We're supposed to care about 2 fish instantly dying while enjoying a beef starter and piece of salmon for dinner?",
            "title_similarity": "0.74083745",
            "sentiment_compound": 0.765
        },
        {
            "id": "i838do7",
            "score": 4,
            "text": "Bitches in the comments crying abuse when every day they eat animals that were submitted to more torture than these guppies, lmao",
            "title_similarity": "0.5926986",
            "sentiment_compound": -0.9099
        },
        {
            "id": "i83muek",
            "score": 4,
            "text": "I wonder how many people calling this cruel eat meat from factory farming (or honestly, just meat period). If they'd eaten the goldfish, would that make it okay? Would you push the button to kill the cow whose flesh you'll end up eating? Someone has to. Is it that different?\n\nLove reddit for crazy hypocritical stuff like this. Btw, I eat meat, lots of it. Not some vegan propogandist.",
            "title_similarity": "0.73767877",
            "sentiment_compound": -0.6747
        },
        {
            "id": "i84u8eb",
            "score": 5,
            "text": "Man, reading that article made me hate that artist. His thinking is super pretentious and full of self righteous dick sucking.",
            "title_similarity": "0.44200325",
            "sentiment_compound": -0.4767
        },
        {
            "id": "i83285x",
            "score": 34,
            "text": "Oh Man, wait until you hear about modern industrial meat farming.",
            "title_similarity": "0.4328317",
            "sentiment_compound": 0.0
        },
        {
            "id": "i83627g",
            "score": -4,
            "text": "[removed]",
            "title_similarity": "-0.07756862"
        },
        {
            "id": "i83bwuj",
            "score": 4,
            "text": "lol, should have had the buttons wired up too shock the ever loving fuck outta the person ballsy enough ta press.",
            "title_similarity": "0.3564723",
            "sentiment_compound": 0.1531
        },
        {
            "id": "i82vba3",
            "score": 327,
            "text": "I mean, if art is about making a statement about humanity, this is great art",
            "title_similarity": "0.12710932",
            "sentiment_compound": 0.6249
        },
        {
            "id": "i82mi04",
            "score": 5,
            "text": "Would it be okay if the visitor had drunk the goldfish smoothie?",
            "title_similarity": "0.56916237",
            "sentiment_compound": -0.128
        },
        {
            "id": "i831tc9",
            "score": 7,
            "text": "I might push the button just thinking it wasn’t actually powered because who would actually put live fish in a blender and let you turn it on.",
            "title_similarity": "0.59975827",
            "sentiment_compound": 0.0
        },
        {
            "id": "i8417bn",
            "score": 6,
            "text": "Doesn’t people pay for killing animals when they buy meat/fish etc?",
            "title_similarity": "0.5816676",
            "sentiment_compound": -0.7003
        },
        {
            "id": "i831fds",
            "score": 188,
            "text": "I would love to do this again, but have the 'ON' button emit an electric shock to the person pressing it.",
            "title_similarity": "0.33287415",
            "sentiment_compound": -0.2023
        },
        {
            "id": "i829dbd",
            "score": 28,
            "text": "\"Spicy.\" -Antoine Laconte",
            "title_similarity": "0.05719815",
            "sentiment_compound": 0.0
        },
        {
            "id": "i83fxcu",
            "score": 10,
            "text": "Honestly I wouldn’t have believed it would do anything. More of a statement on the humanity of anyone who pressed the button. I didn’t even believe it would turn on reading the title until it got to the part where it said they were killed.",
            "title_similarity": "0.48019195",
            "sentiment_compound": -0.3612
        },
        {
            "id": "i83h4is",
            "score": 11,
            "text": "how many people fired up about this subject eat meat, dairy or eggs? how many people fired up about this subject wear leather or fur?",
            "title_similarity": "0.53501964",
            "sentiment_compound": -0.8205
        },
        {
            "id": "i832dmg",
            "score": 84,
            "text": "/r/ShittyAquariums",
            "title_similarity": "0.06933834",
            "sentiment_compound": 0.0
        },
        {
            "id": "i82xv2d",
            "score": 123,
            "text": "Why was Meyer sued and not Evaristi? Evaristi was the one who made the exhibit.",
            "title_similarity": "0.39878184",
            "sentiment_compound": 0.0
        },
        {
            "id": "i831451",
            "score": 546,
            "text": ">\"It's a question of principle. An artist has the right to create works which defy our concept of what is right and what is wrong,\" he told the court in Kolding. \n\ndoesn't this suggest that any act is permissible if you dress it up as art?",
            "title_similarity": "0.3280134",
            "sentiment_compound": -0.25
        },
        {
            "id": "i83cv7l",
            "score": 233,
            "text": "I like how it started out as a \"nature's fate is at your fingertips, its up to you not to kill it\" to \"nothing you do matters\" after they unplugged all of the blenders and left the exhibit open. \n\nAlso fun to note that the one person who did blend the fish was a reporter looking for a shock story. \n>The only person with a financial incentive to blend the fish.",
            "title_similarity": "0.5795846",
            "sentiment_compound": 0.8542
        },
        {
            "id": "i82d2wp",
            "score": 563,
            "text": "1? Way better than I woulda guessed.",
            "title_similarity": "0.072855905",
            "sentiment_compound": 0.4404
        },
        {
            "id": "i827ynk",
            "score": 3433,
            "text": "In HS biology, we were doing a project.  The example project that the teacher showed us had been someone (from her class previously) who studied the effects of various household items on guppies, like detergents, cleaners, and so on.  Supposed to illustrate the effect of pollution, if I recall.  In her experiment, she mentioned that many of the guppies died from the exposure.  I, not being very original, did an experiment with guppies and the effect of water temperature on them.  She told me the experiment was cruel.",
            "title_similarity": "0.610456",
            "sentiment_compound": -0.7952
        },
        {
            "id": "i8278x6",
            "score": 12096,
            "text": "I mean….did we not learn anything from Marina Abramovic performance piece? If you give people the option to physically harm a person there’s gonna be one person that does it, wtf did they think would happen to GOLDFISH ffs",
            "title_similarity": "0.5985915",
            "sentiment_compound": -0.9022
        },
        {
            "id": "i82q4zw",
            "score": 21447,
            "text": "The guy who turned on the blender was a journalist from one of the more colorful papers in Denmark. Before he did so he made several attempts to persuade other visitors to do so to no avail, so he had to do it himself so his photographer could get his pictures. \n\nThe artist whose idea was something like \"Their Fate At Your Fingertips\" to illustrate that nature's fate IS at our fingertips never expected anyone to actually blend a fish. The blenders had to be live to illustrate the gravity of the situation and to make the visitor ponder \"Is this what I want to happen?\" (on a grand scale), and the only one who did so was a cave dwelling reporter hunting for a shocker.\n\nEdit: formatting, typo\n\nEdit 2: Whoa, this blew up beyond my expectations. I've been offline for a some hours, and I will try to respond to as much as possible. This should teach me not to write anything before I go to work. Thanks for the awards!\n\nEdit 3: I have been challenged for source and I must admit that I wrote the above purely from memory, and it seems that I cannot find anything on the internet that supports it. I cannot find the original article that featured closeups of a red tailfin (not goldfish) going from live to chunks to smoothie either, sorry. I feel compelled to hunt for the original article on paper. It must still exist in some archive. I will get back on this if I find anything. \n\n*swordtail",
            "title_similarity": "0.6566181",
            "sentiment_compound": 0.8922
        },
        {
            "id": "i82vlly",
            "score": 25423,
            "text": "“Some humans would do anything to see if it was possible to do it. If you put a large switch in some cave somewhere, with a sign on it saying 'End-of-the-World Switch. PLEASE DO NOT TOUCH', the paint wouldn't even have time to dry.”\n\n-Sir Terry Pratchett\n\n\nEdit: 'Sir' because I forgot about it originally and he deserves it",
            "title_similarity": "0.5184387",
            "sentiment_compound": 0.4648
        },
        {
            "id": "i82kr4u",
            "score": 1,
            "text": "Why not have it track the number of times the button was pressed?",
            "title_similarity": "0.124223195",
            "sentiment_compound": 0.0772
        },
        {
            "id": "i82lbzc",
            "score": 1,
            "text": "Ah yes, the old [Bass-O-Matic](https://www.youtube.com/watch?v=2HKTx5WFcs0) is alive and well!",
            "title_similarity": "0.2947898",
            "sentiment_compound": 0.7712
        },
        {
            "id": "i82odcy",
            "score": 1,
            "text": "Yeah .... Wtf",
            "title_similarity": "-0.1877868",
            "sentiment_compound": -0.3818
        },
        {
            "id": "i82sn7t",
            "score": 1,
            "text": "LOL",
            "title_similarity": "-0.18407387",
            "sentiment_compound": 0.4215
        },
        {
            "id": "i82uwda",
            "score": 1,
            "text": "Goldfish turned into a Jackson pollack.",
            "title_similarity": "0.55338925",
            "sentiment_compound": 0.0
        },
        {
            "id": "i82v0wz",
            "score": 1,
            "text": "I wonder if you'd be charged if you're a museum-goer and just took the blender and left? It's an interactive exhibit. I want to interact by saving the fish.",
            "title_similarity": "0.5737189",
            "sentiment_compound": -0.128
        },
        {
            "id": "i82x99q",
            "score": 1,
            "text": "Am I a sociopath if I hit blend on all of them?",
            "title_similarity": "0.3102386",
            "sentiment_compound": 0.0
        },
        {
            "id": "i82yjn4",
            "score": 2,
            "text": "... carnival games operators \"whatever\"",
            "title_similarity": "0.081538744",
            "sentiment_compound": 0.0
        },
        {
            "id": "i82ylkt",
            "score": 4,
            "text": "I'm actually surprised only one incident? How long did the exhibit run and how many people viewed it? Did they record how often the buttons were pushed after the blenders were disabled? (Yes I read the article, it did not answer those questions tho it appears the exhibit continued after detaching the blenders from visitor input). Because my guess would be somewhere around 10% of visitors would indeed punch the buttons.",
            "title_similarity": "0.6569513",
            "sentiment_compound": 0.6298
        },
        {
            "id": "i82z163",
            "score": 1,
            "text": "\"That's good bass!\"",
            "title_similarity": "0.116083376",
            "sentiment_compound": 0.4926
        },
        {
            "id": "i82z1d1",
            "score": 1,
            "text": "The museum kept those goldfish and blenders around for ages afterward lol. Not sure how they preserved em, but it was kinda gross and neat.",
            "title_similarity": "0.61072564",
            "sentiment_compound": 0.0805
        },
        {
            "id": "i82z1ps",
            "score": 1,
            "text": "And the one who did was a serial killer",
            "title_similarity": "0.26246834",
            "sentiment_compound": -0.6486
        },
        {
            "id": "i82zb7k",
            "score": 1,
            "text": "[It says: “Press”](https://youtu.be/0maYbn8ED-A)",
            "title_similarity": "0.033316724",
            "sentiment_compound": 0.0
        },
        {
            "id": "i8307gv",
            "score": 2,
            "text": "Its hard to believe the artist actually believed no one would press the on button",
            "title_similarity": "0.14948373",
            "sentiment_compound": -0.3818
        },
        {
            "id": "i830mfy",
            "score": 1,
            "text": "In junior high school my friends and I liked to make horror movies. We would use them as class projects. It was really just an excuse to do gore special effects. In this one gag a demon is terrorizing a household and one of the random things he does is toss two goldfish into a food processor and blend them up then drink the mix. There was an immediate uproar at our school! We had to explain that we'd swapped out the goldfish for two similarly sized carrot slices and a ketchup packet (for blood), and that the two goldfish were still safe and sound swimming around in Travis' sister's aquarium.",
            "title_similarity": "0.74502945",
            "sentiment_compound": 0.3084
        },
        {
            "id": "i830o2g",
            "score": 1,
            "text": "“Today on ‘Find the Serial Killer…’”",
            "title_similarity": "0.2855804",
            "sentiment_compound": 0.0
        },
        {
            "id": "i830tfn",
            "score": 1,
            "text": "Only for the shock value. Why not keep them off and just tell everyone they're on? Or is that a different social experiment altogether?",
            "title_similarity": "0.27265784",
            "sentiment_compound": -0.1431
        },
        {
            "id": "i830zjl",
            "score": 1,
            "text": "Humans. Right bastards.",
            "title_similarity": "-0.052401498",
            "sentiment_compound": -0.6124
        },
        {
            "id": "i8310qq",
            "score": 2,
            "text": "I’m surprised only one did it. I’d assume the point of the art is to have someone push it and it would be nonfunctional or something and you have an emotional experience.\n\nMaybe I give modern art too much credit.",
            "title_similarity": "0.21805316",
            "sentiment_compound": 0.6249
        },
        {
            "id": "i8312n8",
            "score": 1,
            "text": "[I believe the whole thing was caught on film.](https://youtu.be/jbIbyUdA_B4)",
            "title_similarity": "0.19974694",
            "sentiment_compound": 0.0
        },
        {
            "id": "i8319po",
            "score": 2,
            "text": "Let me build a black box that, on the push of a button, might or might not burn a famous book.",
            "title_similarity": "0.43718",
            "sentiment_compound": 0.0
        },
        {
            "id": "i831m0f",
            "score": 1,
            "text": "I wouldn't kill a goldfish but testing If the museum is stupid enough to trust me not doing it is another story...\n\nJust loud thinking, don't blend goldfish.",
            "title_similarity": "0.47618085",
            "sentiment_compound": 0.3002
        },
        {
            "id": "i831nbr",
            "score": 1,
            "text": "The event in Canada was much worse. A student skinned a cat alive and filmed it for art class.",
            "title_similarity": "0.58762896",
            "sentiment_compound": -0.128
        },
        {
            "id": "i831poa",
            "score": 2,
            "text": "Artist definitely deserves half the blame. That's pretty fucked.",
            "title_similarity": "0.32130635",
            "sentiment_compound": -0.2263
        },
        {
            "id": "i831rag",
            "score": 2,
            "text": "as if the fish can survive in that tiny amount of water for more than half a day",
            "title_similarity": "0.3754381",
            "sentiment_compound": 0.0
        },
        {
            "id": "i8329wa",
            "score": 1,
            "text": "It was an accident. I did not mean to make a fish smoothie.",
            "title_similarity": "0.31576943",
            "sentiment_compound": -0.4767
        },
        {
            "id": "i832bgi",
            "score": 2,
            "text": "What exactly did they think was going to happen?",
            "title_similarity": "-0.14077719",
            "sentiment_compound": 0.0
        },
        {
            "id": "i832icn",
            "score": 2,
            "text": "That's  fucked up. I'm all for artistic freedom but that artist should have never been allowed to do this.",
            "title_similarity": "0.25474843",
            "sentiment_compound": -0.0258
        },
        {
            "id": "i832n3q",
            "score": 4,
            "text": "In my ethics class we had this exhibition as a thought experiment. I was the first student tonsay to the teacher that I would have taken the fish out of the  blenders and try to save them.",
            "title_similarity": "0.5804093",
            "sentiment_compound": 0.4939
        },
        {
            "id": "i832nli",
            "score": 9,
            "text": "It's only recently that people are pushing back on the idea that goldfish are barely living creatures. Growing up, it was a-ok to torture them into an extremely young death by keeping them in a tiny bowl or sitting out in bags at a fair. We are just starting to learn how bad that actually is and most people still don't know. I'm honestly surprised MORE people didn't push the buttons.",
            "title_similarity": "0.6961332",
            "sentiment_compound": -0.8866
        },
        {
            "id": "i8332la",
            "score": 2,
            "text": "Can he withstand the temptation, to push the button that, even now, beckons him closer?  \nWill he succumb to the maddening urge to eradicate history?  \nAt the MERE PUSH of a SINGLE BUTTON!?  \nThe beeyootiful shiny button!  \nThe jolly candy-like button!  \nWill he hold out, folks?  \nCAN he hold out?",
            "title_similarity": "0.35409537",
            "sentiment_compound": 0.4471
        },
        {
            "id": "i8336hu",
            "score": 2,
            "text": "> \"It's a question of principle. An artist has the right to create works which defy our concept of what is right and what is wrong,\" he told the court in Kolding.\n\nGot it. This has inspired me to create a human pain exhibit. It'll be a person impaled on a huge pole, but kept alive with medical intervention. Should really shake up morality artistically.",
            "title_similarity": "0.57436377",
            "sentiment_compound": 0.3737
        },
        {
            "id": "i833d7e",
            "score": 1,
            "text": "stock: uone. juneteenth",
            "title_similarity": "0.13531831",
            "sentiment_compound": 0.0
        },
        {
            "id": "i833dob",
            "score": 2,
            "text": "What you mean \"at least one\"? They do this dumb experiment and don't even record properly. Poor fish died for nuthin.",
            "title_similarity": "0.5784029",
            "sentiment_compound": -0.8904
        },
        {
            "id": "i833e97",
            "score": 1,
            "text": "what the fuck",
            "title_similarity": "-0.120424196",
            "sentiment_compound": -0.5423
        },
        {
            "id": "i833i59",
            "score": 2,
            "text": "that MONSTER",
            "title_similarity": "0.12258276",
            "sentiment_compound": 0.0
        },
        {
            "id": "i833nfs",
            "score": 2,
            "text": "What a Chad",
            "title_similarity": "-0.07023856",
            "sentiment_compound": 0.0
        },
        {
            "id": "i833sgu",
            "score": 1,
            "text": "I was at that exhibit as a kid!",
            "title_similarity": "0.049553126",
            "sentiment_compound": 0.0
        },
        {
            "id": "i833won",
            "score": 1,
            "text": "I’m positive Elon and Bezos hit this button everyday…",
            "title_similarity": "0.11199168",
            "sentiment_compound": 0.5574
        },
        {
            "id": "i8342c0",
            "score": 1,
            "text": "Yeahbthat guy was pretty trippy. Had him as a guest, at a ski resort a few years after the incident. He did like being the center of attention.",
            "title_similarity": "0.3939356",
            "sentiment_compound": 0.6908
        },
        {
            "id": "i8346u3",
            "score": 2,
            "text": "Reminds me of [the Milgram experiment](https://en.wikipedia.org/wiki/Milgram_experiment)",
            "title_similarity": "0.13104519",
            "sentiment_compound": 0.0
        },
        {
            "id": "i834t1w",
            "score": 1,
            "text": "In everyday life, we constantly have the option to be cruel and monstrous and we're usually so unaware of the decision we're making we don't realize it's there. This piece took that decision and turned it into a physical artifact. It's very jarring because presenting the decision in this manner seems to invite the cruelty, while simultaneously amplifying the type of intrusive thought brought about by high ledges and oncoming cars. But there's nothing that exists in those blenders that we don't carry with us already. We have our finger on that button from birth to the grave.",
            "title_similarity": "0.47717205",
            "sentiment_compound": -0.824
        },
        {
            "id": "i8359gj",
            "score": 1,
            "text": "No one had the stones to pull the blenders from the bases just in case?  I would have been that person, art work or not, I'd be walking around that museum with ten blender tops full of goldfish.",
            "title_similarity": "0.7549077",
            "sentiment_compound": 0.2732
        },
        {
            "id": "i835apy",
            "score": 1,
            "text": "Unrelated but I really liked this website interface from 2003.\n\nQuick to load, content is clear, no popups, cookies, annoying ads, fancy stuff",
            "title_similarity": "0.32278147",
            "sentiment_compound": 0.2936
        },
        {
            "id": "i835z6n",
            "score": 1,
            "text": "Imagine the peoples horror when they hear the blender turn on.",
            "title_similarity": "0.43649054",
            "sentiment_compound": -0.5719
        },
        {
            "id": "i8361rj",
            "score": 1,
            "text": "were they at least energy-efficient blenders?",
            "title_similarity": "-0.0063549224",
            "sentiment_compound": 0.0
        },
        {
            "id": "i836lxd",
            "score": 1,
            "text": "Reminds me of that Black Mirror episode, “Black Museum”",
            "title_similarity": "0.22756241",
            "sentiment_compound": 0.0
        },
        {
            "id": "i836mng",
            "score": 1,
            "text": "Stanley liked to push buttons every day, on every month, on every year.",
            "title_similarity": "0.3133105",
            "sentiment_compound": 0.4215
        },
        {
            "id": "i8375iw",
            "score": 3,
            "text": "r/shittyaquariums",
            "title_similarity": "0.05099339",
            "sentiment_compound": 0.0
        },
        {
            "id": "i8377qu",
            "score": 3,
            "text": "Honestly, surprised it was only one, but I guess that's Denmark for you. Put something like that in the UK and all of the goldfish would be shredded in five minutes or less.",
            "title_similarity": "0.67814636",
            "sentiment_compound": 0.6908
        },
        {
            "id": "i837bqn",
            "score": 2,
            "text": "> After the complaints, the blenders were unplugged and the exhibit continued without the possibility of killing the fish.\n\n\\*plugs blender back in\\*",
            "title_similarity": "0.46117502",
            "sentiment_compound": -0.7964
        },
        {
            "id": "i837tfq",
            "score": 1,
            "text": "Crazy bastards",
            "title_similarity": "0.07500017",
            "sentiment_compound": -0.7506
        },
        {
            "id": "i837umi",
            "score": 2,
            "text": "They wouldn't *REALLY* allow us to-\n\n\n**BRRRRRRRRRRRRRRRR**",
            "title_similarity": "0.10940839",
            "sentiment_compound": -0.3454
        },
        {
            "id": "i83835j",
            "score": 2,
            "text": "You won’t truly know yourself until you have that kind of authority/power.",
            "title_similarity": "0.024278779",
            "sentiment_compound": 0.4404
        },
        {
            "id": "i838ci4",
            "score": 1,
            "text": "I mean, that‘s just art!",
            "title_similarity": "-0.042541552",
            "sentiment_compound": 0.0
        },
        {
            "id": "i838tnk",
            "score": 1,
            "text": "Maybe next time just have the switch activate a light indicating that someone tried to kill the fish?",
            "title_similarity": "0.5929099",
            "sentiment_compound": -0.6908
        },
        {
            "id": "i83a259",
            "score": 1,
            "text": "I probably would have pushed the on button, but  I would have been shocked if it actually killed the fish. I would have assumed that the motors were not actually hooked up, despite any signs or lights, and that the buttons would have no affect.",
            "title_similarity": "0.508437",
            "sentiment_compound": -0.9186
        },
        {
            "id": "i83afkk",
            "score": 2,
            "text": "Would it be animal cruelty if the presser of the button had been made to drink the contents after killing it?",
            "title_similarity": "0.49275684",
            "sentiment_compound": -0.8519
        },
        {
            "id": "i83bjf5",
            "score": 1,
            "text": "If I was there I would have pressed on after the first one 9 more times just to be sure that it was not a fluke",
            "title_similarity": "0.32257473",
            "sentiment_compound": 0.3182
        },
        {
            "id": "i83bnz1",
            "score": 1,
            "text": "I remember writing a paper on this for my philosophy course. I don’t remember dick about it but I’m pretty sure the theory was “people truly aren’t capable of evil.” It’s been a few years and I tend to shove out Gen Eds the second I finish the final.",
            "title_similarity": "0.37208778",
            "sentiment_compound": 0.9239
        },
        {
            "id": "i83cfsd",
            "score": 1,
            "text": "I'd blend them and I blame the artist.",
            "title_similarity": "0.24570028",
            "sentiment_compound": -0.34
        },
        {
            "id": "i83cstj",
            "score": 1,
            "text": "I would have pressed them all ngl",
            "title_similarity": "0.045254767",
            "sentiment_compound": 0.0
        },
        {
            "id": "i83cupy",
            "score": 1,
            "text": "Thus affirming my membership of [r/misanthropy](http://reddit.com/r/misanthropy)",
            "title_similarity": "0.11634368",
            "sentiment_compound": 0.0
        },
        {
            "id": "i83d803",
            "score": 1,
            "text": ">Kolding, 200 kilometres (125 miles) west of Copenhagen\n\nWell yea, it's like almost the entire size of the country away from Copenhagen. Weird way they describe it",
            "title_similarity": "0.4057129",
            "sentiment_compound": 0.4404
        },
        {
            "id": "i83di7i",
            "score": 1,
            "text": "Horrible practices",
            "title_similarity": "0.05888792",
            "sentiment_compound": -0.5423
        },
        {
            "id": "i83dkyv",
            "score": 1,
            "text": "Was it the same fuckwit from the Copenhagen zoo?",
            "title_similarity": "0.43168533",
            "sentiment_compound": 0.0
        },
        {
            "id": "i83dowb",
            "score": 1,
            "text": "Sounds like an uninspired ripoff of [https://en.wikipedia.org/wiki/Rhythm\\_0](https://en.wikipedia.org/wiki/Rhythm_0) except with more unnecessary animal cruelty",
            "title_similarity": "0.38420135",
            "sentiment_compound": -0.3947
        },
        {
            "id": "i83e3pb",
            "score": 1,
            "text": "This should surprise no one. Literally, a huge portion of electronics is a product of slavery. Literally, your average Redditor is directly contributing to slavery by simply owning a mobile device and no one is slowing down their purchase of mobile devices.\n\nThis gives you exactly the mount of fucks humans give for the suffering of other living creatures and beings.",
            "title_similarity": "0.45638308",
            "sentiment_compound": -0.9501
        },
        {
            "id": "i83e65c",
            "score": 2,
            "text": "I mean it could have been some kid lol child me would have definitely smashed that blend button and pikachu face after murdering those fish like I didn’t know what blenders do.",
            "title_similarity": "0.66138947",
            "sentiment_compound": 0.4019
        },
        {
            "id": "i83e6of",
            "score": 1,
            "text": "\"art\" had stooped so low. maybe because we don't want another world war because of it, i guess?",
            "title_similarity": "0.20848885",
            "sentiment_compound": -0.7822
        },
        {
            "id": "i83ejl0",
            "score": 1,
            "text": "It reminded me of Пятачок раздает подарки in Russia, 1992.\nCan I please unknow it?",
            "title_similarity": "0.23008467",
            "sentiment_compound": 0.3182
        },
        {
            "id": "i83erfi",
            "score": 2,
            "text": "\"Art\"",
            "title_similarity": "-0.14018525",
            "sentiment_compound": 0.0
        },
        {
            "id": "i83ew6l",
            "score": 1,
            "text": "That is heartbreaking.\n\nIt reminds me of that performance artist who sat and said that people had permission to do whatever they wanted to her. She was mostly sexually assaulted, humiliated and abused.",
            "title_similarity": "0.47236702",
            "sentiment_compound": -0.9022
        },
        {
            "id": "i83excu",
            "score": 2,
            "text": "Well some people just want to know \"Will it Blend?\"",
            "title_similarity": "-0.05353172",
            "sentiment_compound": 0.34
        },
        {
            "id": "i83f2yp",
            "score": 1,
            "text": "This exhibit with the following modification would be interesting: only one person can see the exhibit at anyone time. Occasionally, false blender noises can be heard from outside the viewing area. When you are viewing the exhibit, you have to option to blend or not. The blend option does nothing.",
            "title_similarity": "0.35834056",
            "sentiment_compound": 0.4019
        },
        {
            "id": "i83fbc9",
            "score": 1,
            "text": "Why does it seem like this type of performance art is just another Milgram's experiment without having to call it psychology?",
            "title_similarity": "0.16246898",
            "sentiment_compound": 0.3612
        },
        {
            "id": "i83fxic",
            "score": 1,
            "text": "This is a blender, if you push the button the fish die, * shocked pickachu face *",
            "title_similarity": "0.6654749",
            "sentiment_compound": -0.7351
        },
        {
            "id": "i83g035",
            "score": 1,
            "text": "That's too sadistic.",
            "title_similarity": "0.025874764",
            "sentiment_compound": 0.0
        },
        {
            "id": "i83gafw",
            "score": 1,
            "text": "\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"art\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"",
            "title_similarity": "0.0015464872",
            "sentiment_compound": 0.0
        },
        {
            "id": "i83gdt1",
            "score": 2,
            "text": "I'm gunna be honest, I would have pushed that button the moment I saw it.\nI",
            "title_similarity": "0.14985688",
            "sentiment_compound": 0.5106
        },
        {
            "id": "i83ghyv",
            "score": 1,
            "text": "With it being 2000, disappointed it wasn’t a frog.  Great early internet moments",
            "title_similarity": "0.41814816",
            "sentiment_compound": 0.25
        },
        {
            "id": "i83gzsu",
            "score": 1,
            "text": "That's not art, that's just fucking stupid.",
            "title_similarity": "0.057366688",
            "sentiment_compound": -0.5709
        },
        {
            "id": "i83h2ii",
            "score": 2,
            "text": "Yeah, I remember this. Shitty but not quite as bad as the a-hole that tethered a starving dog just out of reach of food and called it \"art.\"",
            "title_similarity": "0.45486695",
            "sentiment_compound": -0.1258
        },
        {
            "id": "i83h752",
            "score": 1,
            "text": "The artist also made a painting of his ex called No Tampax with her menstrual blood.",
            "title_similarity": "0.46466428",
            "sentiment_compound": -0.296
        },
        {
            "id": "i83hcct",
            "score": 1,
            "text": "It's already animal cruelty to put Goldfish into tiny blenders. People see these weird ass fish bowls on TV and think it's okay to put a fish into like 5 litres of water with nothing else",
            "title_similarity": "0.75888884",
            "sentiment_compound": -0.6908
        },
        {
            "id": "i83hdan",
            "score": 1,
            "text": "I kill fish all the time",
            "title_similarity": "0.5613389",
            "sentiment_compound": -0.6908
        },
        {
            "id": "i83hdgl",
            "score": 1,
            "text": "\"WHY DID YOU PRESS THE BUTTON?!\"\n\n\"WHY WOULD YOU LET ME PRESS THE BUTTON?!\"",
            "title_similarity": "0.16861008",
            "sentiment_compound": 0.0
        },
        {
            "id": "i83helv",
            "score": 1,
            "text": "“Art”",
            "title_similarity": "-0.12725502",
            "sentiment_compound": 0.0
        },
        {
            "id": "i83hoae",
            "score": 2,
            "text": "This is animal cruelty,  but the fishing industry isn't?",
            "title_similarity": "0.4096827",
            "sentiment_compound": -0.3506
        },
        {
            "id": "i83hsn4",
            "score": 1,
            "text": "I would of totally pushed the button thinking it's not plugged in just to make it blow up in the artist face. I would of had fish blood on my hands",
            "title_similarity": "0.5149809",
            "sentiment_compound": 0.0
        },
        {
            "id": "i83iht8",
            "score": 1,
            "text": "Last thing I would’ve said before hitting the button:\n\nC’mon. Nobody’s actually stupid enough to put live fish in a working blender….BBBBRRRRRRRTTT!  😯",
            "title_similarity": "0.55820084",
            "sentiment_compound": -0.5707
        },
        {
            "id": "i83ihxi",
            "score": 3,
            "text": "Would have been nice to instead of actually blending the fish, the on button took a photo of the \"blender\" and at the end of the exhibition there would be a \"hall of culprits\" with the inscription \"i tried to blend live fish\"",
            "title_similarity": "0.6810705",
            "sentiment_compound": 0.4215
        },
        {
            "id": "i83imwf",
            "score": 1,
            "text": "The pain inflicted on the goldfish was \"Art\". So the guy who walked out from behind the exhibit and beat the \"patron\" senseless should also have been part of the \"Art\".",
            "title_similarity": "0.7005501",
            "sentiment_compound": -0.5106
        },
        {
            "id": "i83j0sl",
            "score": 2,
            "text": "Should have had the actual button hooked to a pie in the face mechinism",
            "title_similarity": "0.38373736",
            "sentiment_compound": 0.0
        },
        {
            "id": "i83j150",
            "score": 1,
            "text": "And I would do it again. He side eyed me hard.",
            "title_similarity": "0.14549485",
            "sentiment_compound": -0.1027
        },
        {
            "id": "i83j6cy",
            "score": 1,
            "text": "r/shittyaquariums",
            "title_similarity": "0.05099339",
            "sentiment_compound": 0.0
        },
        {
            "id": "i83jbe0",
            "score": 1,
            "text": "\"There was a button, I pushed it.\"\n\n\"Jesus Christ. That really is how you go through life, isn't it?\".",
            "title_similarity": "0.17443462",
            "sentiment_compound": 0.0
        },
        {
            "id": "i83jcik",
            "score": 1,
            "text": "Did they ever say what it tasted like?",
            "title_similarity": "0.04719509",
            "sentiment_compound": 0.3612
        },
        {
            "id": "i83jec3",
            "score": 1,
            "text": "Why would he be charged with animal cruelty in the first place? There is *an option* of pressing the on button and people know that if you put fish in a blender and turn it on, they die.",
            "title_similarity": "0.6976173",
            "sentiment_compound": -0.8625
        },
        {
            "id": "i83jt7z",
            "score": 1,
            "text": "\"Some men just want to watch the goldfish blend.\"\n\n-from Badman the Shark Knight I believe.",
            "title_similarity": "0.64927983",
            "sentiment_compound": 0.0772
        },
        {
            "id": "i83jwaw",
            "score": 1,
            "text": "This is pretty awful!",
            "title_similarity": "0.035085488",
            "sentiment_compound": 0.126
        },
        {
            "id": "i83jzv0",
            "score": 1,
            "text": "Did they have one with a frog?\n\n[Joe Cartoon - Frog in a blender video](https://www.youtube.com/watch?v=zC2t4EQsnzM)",
            "title_similarity": "0.4177784",
            "sentiment_compound": 0.0
        },
        {
            "id": "i83kaej",
            "score": 1,
            "text": "Hey, a post mentioning my country :D\n\nIt's about people killing Goldfish :ᗡ",
            "title_similarity": "0.72913694",
            "sentiment_compound": -0.0943
        },
        {
            "id": "i83kei5",
            "score": 1,
            "text": "‘Art’",
            "title_similarity": "-0.12567458",
            "sentiment_compound": 0.0
        },
        {
            "id": "i83kgf2",
            "score": 1,
            "text": "I really don't see the point in art that says \"see, I created a display that made it *very easy* for someone to do something terrible, and oh my god, I can't believe someone did something terrible!\"\n\nNo kidding! It turns out the opportunity to do something scummy tends to attract scumbags! This is meaningless commentary.",
            "title_similarity": "0.43726474",
            "sentiment_compound": 0.4719
        },
        {
            "id": "i83kpqr",
            "score": 2,
            "text": "It's an interesting message, very neat but fish are not props. It's a living creature and deserves at least some respect.",
            "title_similarity": "0.24768999",
            "sentiment_compound": 0.799
        },
        {
            "id": "i83l6nx",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "-0.07756862"
        },
        {
            "id": "i83llgn",
            "score": 2,
            "text": "If he had drank the goldfish juice after would it have been justified?",
            "title_similarity": "0.49418312",
            "sentiment_compound": 0.4019
        },
        {
            "id": "i83lm3q",
            "score": 1,
            "text": "I fucking hate this world.",
            "title_similarity": "0.13906735",
            "sentiment_compound": -0.6115
        },
        {
            "id": "i83lnbr",
            "score": 1,
            "text": "*Someone* should have been charged with animal cruelty. unless it was somehow impossible to tell that these were real fish. I'd probably pick the artist or someone in charge of the museum or exhibit, maybe that person *and* the person that killed the fish if the person who pushed the button could be found.",
            "title_similarity": "0.6933601",
            "sentiment_compound": -0.8807
        },
        {
            "id": "i83lne8",
            "score": 1,
            "text": "This kills the fish.",
            "title_similarity": "0.4464455",
            "sentiment_compound": -0.5423
        },
        {
            "id": "i83lsjd",
            "score": 1,
            "text": "I can't believe there isn't a single Deuce Bigelow male gigolo reference here.",
            "title_similarity": "0.3168887",
            "sentiment_compound": 0.0
        },
        {
            "id": "i83lx0x",
            "score": 1,
            "text": "Not sure if already mentioned, but someone did an “art” piece where they and various items people could use on her and let her audience do literally anything. She was stripped naked, assaulted a lot, and if I remember correctly it had to be stopper because someone legit tried to use the gun.. =/",
            "title_similarity": "0.55767727",
            "sentiment_compound": -0.9058
        },
        {
            "id": "i83m3pj",
            "score": 1,
            "text": "Honestly the last thing i would expect to happen if i hit that button was for it to turn on.",
            "title_similarity": "0.12864631",
            "sentiment_compound": 0.4588
        },
        {
            "id": "i83m9qw",
            "score": 1,
            "text": "What the fuck are us humans doing, this is a disgrace not fucking art",
            "title_similarity": "0.13387942",
            "sentiment_compound": -0.7717
        },
        {
            "id": "i83muo3",
            "score": 2,
            "text": "We need the name of the MF that pressed on please.",
            "title_similarity": "0.04958459",
            "sentiment_compound": 0.3182
        },
        {
            "id": "i83n0rk",
            "score": 1,
            "text": "That’s not how you make fish soup",
            "title_similarity": "0.36860594",
            "sentiment_compound": 0.0
        },
        {
            "id": "i83noac",
            "score": 1,
            "text": "It is BS that he was acquitted.",
            "title_similarity": "0.10855307",
            "sentiment_compound": 0.25
        },
        {
            "id": "i83nu22",
            "score": 1,
            "text": "Now…had there been kittens in the blenders…",
            "title_similarity": "0.25798523",
            "sentiment_compound": 0.0
        },
        {
            "id": "i83nw4s",
            "score": 1,
            "text": "TIL ese weón era chileno",
            "title_similarity": "-0.014438577",
            "sentiment_compound": 0.0
        },
        {
            "id": "i83nxdl",
            "score": 5,
            "text": "Was that scene in moon knight a reference to the art exhibit?",
            "title_similarity": "0.2900934",
            "sentiment_compound": 0.0
        },
        {
            "id": "i83o1f4",
            "score": 2,
            "text": "Honestly if it were me, I would press the button jokingly, thinking it's not REALLY going to kill them, it's just to see if you would. Then I would feel awful when it actually happened",
            "title_similarity": "0.28544402",
            "sentiment_compound": -0.7666
        },
        {
            "id": "i83o4q4",
            "score": 2,
            "text": "In college for a talent show fundraiser my friend swallowed 10 goldfish.",
            "title_similarity": "0.7600508",
            "sentiment_compound": 0.7184
        },
        {
            "id": "i83o568",
            "score": 1,
            "text": "Honestly, I think I would have pressed it. Now before you judge, I would assume that something else would happen, because surely no “artist” would be stupid enough to make that. It’s not surprising it happened, it’s human nature, cause how else would humans have evolved to be as smart as they are",
            "title_similarity": "0.28704014",
            "sentiment_compound": 0.2928
        },
        {
            "id": "i83oc11",
            "score": 1,
            "text": "Shouldn't the person who pressed the on button be charged?  And the artist for deciding to put live animals inside functional blenders in the first place?",
            "title_similarity": "0.59595376",
            "sentiment_compound": -0.2869
        },
        {
            "id": "i83oi0t",
            "score": 2,
            "text": "Must have been the [Bass-o-matic™!](https://www.youtube.com/watch?v=2HKTx5WFcs0)",
            "title_similarity": "0.3486045",
            "sentiment_compound": 0.0
        },
        {
            "id": "i83oigt",
            "score": 2,
            "text": "Better fate than most goldfishes honestly",
            "title_similarity": "0.42725345",
            "sentiment_compound": 0.7334
        },
        {
            "id": "i83on5x",
            "score": 2,
            "text": "This is interesting as I've heard of viking reenactments where they slaughter a live goat.",
            "title_similarity": "0.64514613",
            "sentiment_compound": 0.4019
        },
        {
            "id": "i83pcvm",
            "score": 1,
            "text": "Idiots. Emphasis on the 'S'.",
            "title_similarity": "0.13118687",
            "sentiment_compound": 0.0
        },
        {
            "id": "i83pjsg",
            "score": 1,
            "text": "Only 1 out of 10? I call bs.",
            "title_similarity": "0.31445837",
            "sentiment_compound": 0.0
        },
        {
            "id": "i83q0ls",
            "score": 1,
            "text": "What an asshole move. I would have made it so that if you press the button a spotlight shines on you.",
            "title_similarity": "0.28683028",
            "sentiment_compound": 0.0
        },
        {
            "id": "i83qo6j",
            "score": 1,
            "text": "They blended Frederick?",
            "title_similarity": "-0.06175445",
            "sentiment_compound": 0.0
        },
        {
            "id": "i83qq2v",
            "score": 1,
            "text": ">The court had earlier heard an **expert** witness from the blenders' maker, Moulinex, \n\n\"Hey. Pierre. C'mere.\"\n\n\"Qui moi?\"\n\n\"Yes, 'moi'. Jeez. Listen. I want you to go be an 'Expert Witness'.\"\n\n\"Certainement! But I will need wine and a baguette.\"",
            "title_similarity": "0.3947268",
            "sentiment_compound": 0.3164
        },
        {
            "id": "i83qt2b",
            "score": 1,
            "text": "I spray painted an old blender base black, put fish tank chatchkeys in there, with the fish.  I had cut off the wire, I'm not a monster.",
            "title_similarity": "0.61475813",
            "sentiment_compound": -0.2732
        },
        {
            "id": "i83qxnh",
            "score": 3,
            "text": "My personal favorite factoid involving this event, which I have heard of before now, is that during the trial they actually brought in a representative from the blender company to demonstrate how quickly the goldfish would have died. It was the speed at which the blender would have killed the fish that actually determined that it was not animal cruelty.",
            "title_similarity": "0.7223906",
            "sentiment_compound": -0.1416
        },
        {
            "id": "i83qzbc",
            "score": 1,
            "text": "Another artist also tied up a street dog in a gallery so people could watch it starve to death. No one helped it, and supposedly it died. People are shit, as are artists like this.",
            "title_similarity": "0.6149136",
            "sentiment_compound": -0.9287
        },
        {
            "id": "i83r3tm",
            "score": 1,
            "text": "When I was in highschool, we had a fair. There I watched someone win and eat a goldfish.\n\nSo yeah, people are animals.",
            "title_similarity": "0.70681757",
            "sentiment_compound": 0.8388
        },
        {
            "id": "i83r7l3",
            "score": 1,
            "text": "Denmark ... Again.  I remember something about a baby giraffe a while ago.",
            "title_similarity": "0.3307605",
            "sentiment_compound": 0.0
        },
        {
            "id": "i83ra4i",
            "score": 1,
            "text": ">After the complaints, the blenders were unplugged and the exhibit continued without the possibility of killing the fish.\n\nI'm guessing that probably means they also removed the one blender containing the fish smoothie.",
            "title_similarity": "0.53654253",
            "sentiment_compound": -0.7964
        },
        {
            "id": "i83reim",
            "score": 2,
            "text": "Should have been wired to deliver a shock to the person pressing the button.",
            "title_similarity": "0.17385164",
            "sentiment_compound": -0.3818
        },
        {
            "id": "i83rpw0",
            "score": 1,
            "text": "Part of me thinks the more adamantly people insist something isn’t art, the more it is art",
            "title_similarity": "0.17315376",
            "sentiment_compound": 0.0
        },
        {
            "id": "i83rryl",
            "score": 1,
            "text": "That's not art, that's a science experiment.",
            "title_similarity": "0.13061458",
            "sentiment_compound": 0.0
        },
        {
            "id": "i83siov",
            "score": 1,
            "text": "One thing I never needed to know",
            "title_similarity": "-0.027392214",
            "sentiment_compound": 0.0
        },
        {
            "id": "i83sz7g",
            "score": 2,
            "text": "NGL, I would have pressed out of curiosity if it was legit or not.",
            "title_similarity": "0.044319343",
            "sentiment_compound": 0.0
        },
        {
            "id": "i83t02g",
            "score": 1,
            "text": "That's hilarious",
            "title_similarity": "-0.10390207",
            "sentiment_compound": 0.4019
        },
        {
            "id": "i83to42",
            "score": 1,
            "text": "If I recall correctly, it was a Danish newspaper, the gossip kind, that gave a random visitor 5000 DKK, which probably equates to over a 1000 USD in todays money to press the button. Because, you know, gotta sell some newspapers.",
            "title_similarity": "0.61319876",
            "sentiment_compound": 0.4019
        },
        {
            "id": "i83toxz",
            "score": 1,
            "text": "That visitor woke up and chose violence",
            "title_similarity": "0.24260499",
            "sentiment_compound": -0.6249
        },
        {
            "id": "i83u8sp",
            "score": 1,
            "text": ":( r/shittyaquariums",
            "title_similarity": "0.07320936",
            "sentiment_compound": -0.4404
        },
        {
            "id": "i83udlv",
            "score": 1,
            "text": "Isn’t the world cruel enough?",
            "title_similarity": "0.14079452",
            "sentiment_compound": -0.5859
        },
        {
            "id": "i83ujxv",
            "score": 2,
            "text": "He could've just not plugged them in",
            "title_similarity": "0.057132546",
            "sentiment_compound": 0.0
        },
        {
            "id": "i83unnm",
            "score": 1,
            "text": "You gotta be a special kind of fucked up to be the one who hit the button",
            "title_similarity": "0.11873555",
            "sentiment_compound": -0.4019
        },
        {
            "id": "i83usvh",
            "score": 1,
            "text": "Fucked around, found out",
            "title_similarity": "0.09953837",
            "sentiment_compound": -0.6597
        },
        {
            "id": "i83v1od",
            "score": 2,
            "text": "It is estimated that between 3-5% of people are sociopaths. They were going to run into one of them eventually.",
            "title_similarity": "0.3142751",
            "sentiment_compound": 0.0
        },
        {
            "id": "i83w3g7",
            "score": 1,
            "text": "\"art\"",
            "title_similarity": "-0.14018525",
            "sentiment_compound": 0.0
        },
        {
            "id": "i83wk10",
            "score": 2,
            "text": "Why didn’t they just leave the blenders unplugged? U can still press the button and the metaphor still fits",
            "title_similarity": "0.34230524",
            "sentiment_compound": -0.0516
        },
        {
            "id": "i83wkrm",
            "score": 1,
            "text": "What's so artsy about a blender with fish in it?",
            "title_similarity": "0.4052235",
            "sentiment_compound": 0.0
        },
        {
            "id": "i83y4k0",
            "score": 1,
            "text": "Art.",
            "title_similarity": "-0.12388168",
            "sentiment_compound": 0.0
        },
        {
            "id": "i83ynuo",
            "score": 2,
            "text": "So blending a fish is animal cruelty, but when we kill billions every day its perfectly fine? (I originally put millions, but after a quick google, its 2.1 billion per DAY)",
            "title_similarity": "0.73576343",
            "sentiment_compound": -0.25
        },
        {
            "id": "i83yqh9",
            "score": 1,
            "text": "You'd wonder how many more fish would have been blended, if the exhibit would have been allowed to continue after the first time.  Conveniently, people can blame the journalist for creating their own story, because it stopped after he did it.  There were no more opportunities for copycats, people looking to do something violently random, or just random people looking to prove some artist wrong.",
            "title_similarity": "0.6351391",
            "sentiment_compound": -0.9132
        },
        {
            "id": "i83yt2t",
            "score": 1,
            "text": "Why not construct a trick blender that \"blends\" water within a cavity along the outside of the 'blender'?\n\nLike, it's an art installation that likely gets the artist a lot of money - they're fucking tools is they only spend up to $100 in materials, especially if it uses live animals. Put some actual work into it.",
            "title_similarity": "0.6717414",
            "sentiment_compound": 0.3915
        },
        {
            "id": "i83zkds",
            "score": 2,
            "text": "Reading the title, all I could think of was that meme where the one pastor says, \"why?\" over and over again.",
            "title_similarity": "0.41565004",
            "sentiment_compound": 0.0
        },
        {
            "id": "i83zku6",
            "score": 1,
            "text": "While they may have died within a second as the article suggests, I think killing an animal for fun is also animal cruelty personally.\n\nPutting them in functioning blenders and telling people they could turn them on, also animal cruelty imo.\n\nIt was the intent to be cruel and malicious to a fish (which did not guarantee a death result but Jeez).",
            "title_similarity": "0.6403161",
            "sentiment_compound": -0.815
        },
        {
            "id": "i83zuoi",
            "score": 1,
            "text": "Bass-o-matic",
            "title_similarity": "0.14013007",
            "sentiment_compound": 0.0
        },
        {
            "id": "i840ejl",
            "score": 1,
            "text": "I probably would have done it because I didn’t believe they were live. (The blenders I mean, not the goldfish)",
            "title_similarity": "0.5071058",
            "sentiment_compound": 0.0
        },
        {
            "id": "i840j2p",
            "score": 2,
            "text": "Why didn't they just make the ON button shock the person pressing it?",
            "title_similarity": "0.27273554",
            "sentiment_compound": -0.3818
        },
        {
            "id": "i841itn",
            "score": 2,
            "text": "I wonder how long it'll be until someone makes an exhibit that executes the person who pushes the button. Warning them beforehand, of course.",
            "title_similarity": "0.35758024",
            "sentiment_compound": -0.34
        },
        {
            "id": "i842ca7",
            "score": 2,
            "text": "I never understood why it took so long to get your gold fish.",
            "title_similarity": "0.43359125",
            "sentiment_compound": 0.0
        },
        {
            "id": "i842krf",
            "score": 1,
            "text": "Good cunt",
            "title_similarity": "-0.010800799",
            "sentiment_compound": -0.0772
        },
        {
            "id": "i8438fs",
            "score": 2,
            "text": "Okay this is fun if it turns out the button *doesn’t actually work*. There are a lot of ways they could’ve handled this project in a way that wouldn’t end in fish death.",
            "title_similarity": "0.3015328",
            "sentiment_compound": 0.0772
        },
        {
            "id": "i844aov",
            "score": 2,
            "text": "In high school, our student body officers would do a unity skit in the assembly on the first day of school where they would assemble a gross smoothie one ingredient at a time and then drink. Each officer in turn, starting at treasurer, then secretary, Vice President, and then president would bring something gross, add it to the blender, blend, drink and then it went to the next person.\n\nOne year, someone brought a live goldfish, blended it in front of the entire student body and drank the resulting smoothie. Since our hs rivals were the Jackson Hole broncs, someone brought horse meat once. As far as i know, the tradition is ongoing although it may be prone to a little more supervision and approval.\n\nOur high school was rural, and our town had very little to do, so when snow melted off and spring elections came around, our school went hard. Water slides. Barbecues in the parking lot. Airplanes flying over dropping candy and election propaganda. It was really fun for a few days.\n\nAnother incidence of goldfish violence was in 8th grade when the science teacher put a goldfish in liquid nitrogen and was going to drop it in water to demonstrate reanimation… anyway he dropped the fish and that lil mofo shattered all over the lab floor.",
            "title_similarity": "0.73231024",
            "sentiment_compound": -0.916
        },
        {
            "id": "i844nm3",
            "score": 1,
            "text": "Trigger warning next time jfc",
            "title_similarity": "0.057039358",
            "sentiment_compound": -0.34
        },
        {
            "id": "i845vly",
            "score": 1,
            "text": "Who cares? Worse shit happens on farms every minute of every day",
            "title_similarity": "0.37836984",
            "sentiment_compound": -0.5719
        },
        {
            "id": "i845yj2",
            "score": 1,
            "text": "But… that guy did it",
            "title_similarity": "-0.075905204",
            "sentiment_compound": 0.0
        },
        {
            "id": "i845yor",
            "score": 1,
            "text": "Listen imma say this out of respect, as a little kid i used to press ALL the buttons i could find, no joke they took me to a museum that was full of buttons and i had my index finger ready to go.\n\nSo chances are if i had been to this exhibit as a child i would have probably pressed the button because haha buttons were interesting to me.\n\nIn general a terrible idea.",
            "title_similarity": "0.53198665",
            "sentiment_compound": 0.8261
        },
        {
            "id": "i846ezw",
            "score": 1,
            "text": "\"I saw a button so I pushed it\"\n\n\"Jesus, that really is how you go through life isn't it?\"",
            "title_similarity": "0.1500422",
            "sentiment_compound": 0.0
        },
        {
            "id": "i846i9n",
            "score": 1,
            "text": "Sounds more like a psychological experiment. Why is it in a museum?",
            "title_similarity": "0.17560199",
            "sentiment_compound": 0.4201
        },
        {
            "id": "i846ncw",
            "score": 1,
            "text": "Based af",
            "title_similarity": "-0.28046396",
            "sentiment_compound": 0.0
        },
        {
            "id": "i846nwq",
            "score": 1,
            "text": "Real life Joe Cartoon.",
            "title_similarity": "0.049693085",
            "sentiment_compound": 0.0
        },
        {
            "id": "i847p5k",
            "score": 2,
            "text": "Reminds me of Marina Abramović and her piece \"*Rythm 0*\". People can be monsters.  \n\n\nhttps://vimeo.com/71952791",
            "title_similarity": "0.35273576",
            "sentiment_compound": 0.0
        },
        {
            "id": "i848ced",
            "score": 1,
            "text": "Bassamatic!",
            "title_similarity": "0.095374554",
            "sentiment_compound": 0.0
        },
        {
            "id": "i8494ym",
            "score": 1,
            "text": "Couldn't they have just rigged it with an alarm that makes loud noises, instead of blending, when someone turned it on. Everyone would know who did it and no gold fish would have to die.",
            "title_similarity": "0.5431817",
            "sentiment_compound": -0.875
        },
        {
            "id": "i84akvb",
            "score": 1,
            "text": "I definitely would have done it fully expecting something completely other than actually blending the fish to happen.",
            "title_similarity": "0.3618714",
            "sentiment_compound": 0.4019
        },
        {
            "id": "i84b86t",
            "score": 2,
            "text": "Button should have been connected to a buzzer or something to draw attention to the person pushing it",
            "title_similarity": "0.128459",
            "sentiment_compound": 0.0
        },
        {
            "id": "i84b8l1",
            "score": 1,
            "text": "One time a guy ate a fish out of the tank in the back of the room in my marine biology class in high school.",
            "title_similarity": "0.66073173",
            "sentiment_compound": 0.0
        },
        {
            "id": "i84biy9",
            "score": 1,
            "text": "More interesting would be a digital scoreboard that increases with each button press. No harm needed, but a far more interesting measure.",
            "title_similarity": "0.22509791",
            "sentiment_compound": 0.7852
        },
        {
            "id": "i84bxdb",
            "score": 1,
            "text": "More like belongs on r/WTF bc that's F-ing rediculous!",
            "title_similarity": "0.08605216",
            "sentiment_compound": 0.474
        },
        {
            "id": "i84bzcc",
            "score": 1,
            "text": "I’m sorry, why did anyone think that was going to be a good idea? People *suck* and you’re bound to be around one of the ones who does suck at any given moment.",
            "title_similarity": "0.28110313",
            "sentiment_compound": -0.4939
        },
        {
            "id": "i84c90f",
            "score": 1,
            "text": "\"They're just two lost souls swimming in a fish bowl\"",
            "title_similarity": "0.48610556",
            "sentiment_compound": -0.3182
        },
        {
            "id": "i84cbxo",
            "score": 1,
            "text": "What a twist it would've been if the switch did nothing, and the person has to live knowing they were *this close* to committing animal cruelty.",
            "title_similarity": "0.43628114",
            "sentiment_compound": -0.5574
        },
        {
            "id": "i84ck3i",
            "score": 1,
            "text": "Then you will see what people really are.",
            "title_similarity": "-0.08332087",
            "sentiment_compound": 0.0
        },
        {
            "id": "i84d9f5",
            "score": 1,
            "text": "Reminds me of that Deuce Bigelow scene.",
            "title_similarity": "0.13978198",
            "sentiment_compound": 0.0
        },
        {
            "id": "i84dq34",
            "score": 1,
            "text": "I’m trying to figure out how all butchers and farmers don’t get charged with animal cruelty then… make it make sense, no?",
            "title_similarity": "0.4803704",
            "sentiment_compound": -0.6908
        },
        {
            "id": "i84dunl",
            "score": 1,
            "text": "Let's put the artist in a blender and invite folks to decide if they want to push the button.  See what he thinks about his fucked up then.",
            "title_similarity": "0.42257288",
            "sentiment_compound": -0.5423
        },
        {
            "id": "i84dux1",
            "score": 2,
            "text": "The 'artist' could have just had dead blenders and instead a sign pop upon telling you that you're an asshole, and take your photo. Absolutely no need to kill living animals for 'art'.",
            "title_similarity": "0.5482681",
            "sentiment_compound": -0.9099
        },
        {
            "id": "i84enua",
            "score": 5,
            "text": "What actually would have been great is if the on button was like one of the joke gumpacks where it shocks the hell out of you.",
            "title_similarity": "0.31313",
            "sentiment_compound": 0.1531
        },
        {
            "id": "i84eylt",
            "score": 1,
            "text": "I want to find this artist, dress them up as a goldfish, and put them in a blender.",
            "title_similarity": "0.6549467",
            "sentiment_compound": 0.0772
        },
        {
            "id": "i84ezcd",
            "score": 2,
            "text": "ill argue that a gold fish being instantaneously blended at 20,000 rpm's is more humane than most ways a goldfish is going to die.",
            "title_similarity": "0.64818627",
            "sentiment_compound": -0.8442
        },
        {
            "id": "i84f24u",
            "score": 1,
            "text": "The original r/thebutton",
            "title_similarity": "0.07917593",
            "sentiment_compound": 0.3182
        },
        {
            "id": "i84feea",
            "score": 1,
            "text": "God, imagine if he did this with kittens or puppies. The majority of people likely wouldn't harm the animals but like with these poor goldfishes someone with enough morbid curiosity will do it.\n\nHell, probably more people would hit the button today feels like people nowadays more more disconnected from reality, and more cruel than before. Do anything for attention and internet fame.",
            "title_similarity": "0.5764345",
            "sentiment_compound": -0.748
        },
        {
            "id": "i84ho3v",
            "score": 1,
            "text": "Reminded of this scene from louie https://youtu.be/0maYbn8ED-A",
            "title_similarity": "0.10462506",
            "sentiment_compound": 0.0
        },
        {
            "id": "i84hopv",
            "score": 1,
            "text": "Had to read this a couple times.  I really thought there was software called blender and the fish were like, computer generated.  Then the second half of the header confused me.  I'll shut up now",
            "title_similarity": "0.52975225",
            "sentiment_compound": 0.0516
        },
        {
            "id": "i84i97t",
            "score": 1,
            "text": "If you make a button and make it accessible to the public you are responsible",
            "title_similarity": "0.060188983",
            "sentiment_compound": 0.3182
        },
        {
            "id": "i84ihzq",
            "score": 1,
            "text": "The exhibit was a success then.",
            "title_similarity": "0.0629929",
            "sentiment_compound": 0.5719
        },
        {
            "id": "i84ijhc",
            "score": 2,
            "text": "You know it’s 22 years ago in Scandinavia because only one blender got turned on. Present day United States, you’d have a queue of people out the door fighting about who gets to livestream more blenders.",
            "title_similarity": "0.52042216",
            "sentiment_compound": 0.0772
        },
        {
            "id": "i84j7kv",
            "score": 1,
            "text": "Goldfish roulette...",
            "title_similarity": "0.40727538",
            "sentiment_compound": 0.0
        },
        {
            "id": "i84jzyg",
            "score": 1,
            "text": "Holy smokes",
            "title_similarity": "-0.058789283",
            "sentiment_compound": 0.0
        },
        {
            "id": "i84k2ly",
            "score": 1,
            "text": "Reminds me of that one Black Mirror episode with the “Dark Museum”",
            "title_similarity": "0.2846715",
            "sentiment_compound": 0.0
        },
        {
            "id": "i84kiyv",
            "score": 1,
            "text": "This was something I did not think I’d read today.",
            "title_similarity": "-0.032887444",
            "sentiment_compound": 0.0
        },
        {
            "id": "i84kn16",
            "score": 2,
            "text": "Is it really art if it's something an angsty teenager would do?  Art should involve _some_ talent.",
            "title_similarity": "0.20327714",
            "sentiment_compound": 0.4215
        },
        {
            "id": "i84kndp",
            "score": 1,
            "text": "For art, unforgivable. For lunch, sure no problem.",
            "title_similarity": "0.21532404",
            "sentiment_compound": 0.5511
        },
        {
            "id": "i84l14s",
            "score": 2,
            "text": "Average psychopath teenager science project",
            "title_similarity": "0.31616542",
            "sentiment_compound": 0.0
        },
        {
            "id": "i84lu1p",
            "score": 1,
            "text": "This is one of the most disturbing things I’ve ever read.",
            "title_similarity": "0.20355415",
            "sentiment_compound": -0.5563
        },
        {
            "id": "i84m265",
            "score": 1,
            "text": "I would be tempted to see if they actually have it working. \"They wouldn't just put these here if they actually worked... Right?\"",
            "title_similarity": "0.059870638",
            "sentiment_compound": 0.0
        },
        {
            "id": "i84mdrg",
            "score": 1,
            "text": "I know some people that should have been in that blender.",
            "title_similarity": "0.13611129",
            "sentiment_compound": 0.0
        },
        {
            "id": "i84ml5j",
            "score": 1,
            "text": "Id love to read the Gold Fish Killers “AITA” post.",
            "title_similarity": "0.4813912",
            "sentiment_compound": -0.0258
        },
        {
            "id": "i84n8g7",
            "score": 2,
            "text": "I was at an art gallery in Canada and one of the installations was a pile of wrapped candy in a corner. I horrified the people I was with by taking a piece of candy off the pile. \n\nIn my defense, it turned out that people taking pieces of candy was part of the concept.",
            "title_similarity": "0.5449671",
            "sentiment_compound": -0.4588
        },
        {
            "id": "i84nqgj",
            "score": 1,
            "text": "I remember we used this exact topic in my “Theory of Knowledge” class to kick off a discussion on the question, “What is art?”\n\nFun times",
            "title_similarity": "0.2755711",
            "sentiment_compound": 0.5106
        },
        {
            "id": "i84nry6",
            "score": 3,
            "text": "Damn. Why make the buttons live? Attach them to a buzzer that screams at someone for being a POS if they push it. Don't actually slaughter the fish.",
            "title_similarity": "0.6005602",
            "sentiment_compound": -0.5994
        },
        {
            "id": "i84o96i",
            "score": 1,
            "text": "Homer …. Push .. the button … kill us all",
            "title_similarity": "0.4652412",
            "sentiment_compound": -0.6908
        },
        {
            "id": "i84oich",
            "score": 1,
            "text": "Poor things… the size of the blender must have been very small for them and stressful",
            "title_similarity": "0.29178184",
            "sentiment_compound": -0.7506
        },
        {
            "id": "i84oky6",
            "score": 1,
            "text": "Now kit",
            "title_similarity": "-0.2375269",
            "sentiment_compound": 0.0
        },
        {
            "id": "i84onb0",
            "score": 1,
            "text": "Is that the right use of commas?",
            "title_similarity": "-0.13384978",
            "sentiment_compound": 0.0
        },
        {
            "id": "i84p1ih",
            "score": 1,
            "text": "Sounds like he’s probably at about year 22 of a lifetime sentence",
            "title_similarity": "0.1267274",
            "sentiment_compound": 0.4215
        },
        {
            "id": "i84pmv3",
            "score": 2,
            "text": "What is it with Danes hating animals?",
            "title_similarity": "0.30882165",
            "sentiment_compound": -0.5106
        },
        {
            "id": "i84pqdo",
            "score": 1,
            "text": "Good soup",
            "title_similarity": "0.07027475",
            "sentiment_compound": 0.4404
        },
        {
            "id": "i84qrqo",
            "score": 1,
            "text": "Ooooo what does THIS button do?\n\n--Deedee",
            "title_similarity": "0.028410923",
            "sentiment_compound": 0.0
        },
        {
            "id": "i84r2ok",
            "score": 1,
            "text": "mmm, smoothie",
            "title_similarity": "-0.085363954",
            "sentiment_compound": 0.0
        },
        {
            "id": "i84r4ex",
            "score": 2,
            "text": "So my question is,\n\nWhat did each of these goldfish take for granted to be placed in a real life saw trap?",
            "title_similarity": "0.70918655",
            "sentiment_compound": -0.0772
        },
        {
            "id": "i84s6g1",
            "score": 2,
            "text": "Of course this was in Denmark. If it was in America, they'd be selling Goldfish smoothies by the end of the exhibition.",
            "title_similarity": "0.6136985",
            "sentiment_compound": 0.0
        },
        {
            "id": "i84snpe",
            "score": 2,
            "text": "The cunt that pressed the button should have been charged also.But in the end, when we catch a fish with a barbed hook, throw a live lobster, crab, mussel, etc into boiling water, pen, capture and slaughter intelligent dolphins ( Japan, Iceland).Is that any better?",
            "title_similarity": "0.7587035",
            "sentiment_compound": 0.2263
        },
        {
            "id": "i84srof",
            "score": 3,
            "text": "I didn't need to know this.\n\nFuck people.",
            "title_similarity": "0.030771691",
            "sentiment_compound": -0.628
        },
        {
            "id": "i84t0fu",
            "score": 1,
            "text": "Wtf!!",
            "title_similarity": "-0.1291967",
            "sentiment_compound": -0.658
        },
        {
            "id": "i84t9jx",
            "score": 1,
            "text": "Man, some people in this thread need to drink a MUG root beer",
            "title_similarity": "0.29396313",
            "sentiment_compound": 0.0
        },
        {
            "id": "i84tjhq",
            "score": 2,
            "text": "But people are cutting, chopping, boiling, gutting, biting fish all the time.",
            "title_similarity": "0.52956474",
            "sentiment_compound": -0.1901
        },
        {
            "id": "i84ttke",
            "score": 1,
            "text": "What smells like blue?",
            "title_similarity": "0.027068216",
            "sentiment_compound": 0.3612
        },
        {
            "id": "i84u4ra",
            "score": 1,
            "text": "Look up what the did to the giraffe in Denmark those people have no respect for life other than humans",
            "title_similarity": "0.57957035",
            "sentiment_compound": -0.3724
        },
        {
            "id": "i84uvll",
            "score": 1,
            "text": "Should've put a small shock mechanism in each button, many good lessons yet to be learned.",
            "title_similarity": "0.2710867",
            "sentiment_compound": 0.0772
        },
        {
            "id": "i84vqa3",
            "score": 1,
            "text": "A lot of people are crucifying the journalist who wanted a full story, but it’s 100% the artist’s fault. They probably wanted to know what would happen for the story, and didn’t expect some crazy artist to actually let you blend up fish in public. \n\nIf it was me I would just expect a sound to play, or something to show up, highlighting the cruel curiosity of humanity.",
            "title_similarity": "0.62801564",
            "sentiment_compound": -0.8674
        },
        {
            "id": "i84w9lz",
            "score": 1,
            "text": "I mean if you eat fish, why would this minor thing be animal cruelty? Doesn’t the fish you eat suffer more?\n\nAlso, people will sell goldfish in cruel ways at amusement parks in bags, with the expectation that they’ll die soon anyway. They’re not treated that great in commercial pet stores either. Why do we pick and choose what is cruelty and what is normal?",
            "title_similarity": "0.74326134",
            "sentiment_compound": -0.9696
        },
        {
            "id": "i84wafz",
            "score": 1,
            "text": "imagine going to prison for killing a goldfish",
            "title_similarity": "0.7511499",
            "sentiment_compound": -0.8271
        },
        {
            "id": "i84wh7z",
            "score": 1,
            "text": "Did no one think of just not plugging the blenders in?",
            "title_similarity": "0.2421987",
            "sentiment_compound": -0.296
        },
        {
            "id": "i84y4xh",
            "score": 1,
            "text": "The F is wrong with people?",
            "title_similarity": "0.00070582423",
            "sentiment_compound": -0.4767
        },
        {
            "id": "i84yont",
            "score": 1,
            "text": "\"Honey, what happened to Jeremy and Fiona?\"",
            "title_similarity": "0.12721157",
            "sentiment_compound": 0.0
        },
        {
            "id": "i84ysbf",
            "score": 1,
            "text": "The Button: https://youtu.be/LJQ-LZYAMBQ",
            "title_similarity": "0.007884476",
            "sentiment_compound": 0.0
        },
        {
            "id": "i84ywq7",
            "score": 1,
            "text": "I’m surprised more people didn’t turn on the blenders",
            "title_similarity": "0.29731023",
            "sentiment_compound": 0.2263
        },
        {
            "id": "i84ztnx",
            "score": 1,
            "text": "i'm confused why everyones point is that they had to be blended to show the consequence, instead of just doingaomething that showed the person was an asshole? all are saying that would ruin the point of the art and everyone would just keep pushing the button cause they knew it wouldn't do anything; but if one person pushes the button and it DOES something then is that not the same result? now everyone knows it will? so why can you just not make it fake? suuuper confused",
            "title_similarity": "0.3843873",
            "sentiment_compound": -0.5616
        },
        {
            "id": "i8502nt",
            "score": 1,
            "text": "Only one?",
            "title_similarity": "-0.17212173",
            "sentiment_compound": 0.0
        },
        {
            "id": "i850nbg",
            "score": 1,
            "text": "What should have been done was have the blenders but rig them so pushing the button sets off an alarm instead of making Goldfish puree.\n\nThe blenders shouldn't have been functional at any rate.",
            "title_similarity": "0.5215299",
            "sentiment_compound": -0.5927
        },
        {
            "id": "i850zfy",
            "score": 1,
            "text": "Humans are shit, we are such a fucking pest, if you love animals its impossible not to hate humans",
            "title_similarity": "0.41305715",
            "sentiment_compound": 0.5571
        },
        {
            "id": "i850zhn",
            "score": 2,
            "text": "How do I hang this on my wall?",
            "title_similarity": "0.04720595",
            "sentiment_compound": 0.0
        },
        {
            "id": "i852055",
            "score": 1,
            "text": "So they wanted to be the next Marina Abramovic, did they?",
            "title_similarity": "0.09568825",
            "sentiment_compound": 0.0
        },
        {
            "id": "i852f05",
            "score": 2,
            "text": "Just go on YouTube. Lots of channels promoting animal abuse and facing no repercussions. God forbid you type two types of animals expecting some cute video of them being friends.",
            "title_similarity": "0.48334596",
            "sentiment_compound": -0.2297
        },
        {
            "id": "i852hms",
            "score": 2,
            "text": "you have to wonder how many people would press it today?  Has the world gotten shittier in the last 22 years?",
            "title_similarity": "0.3053551",
            "sentiment_compound": -0.5362
        },
        {
            "id": "i852vgk",
            "score": 3,
            "text": "\"This can't possibly-\"\n\nBRRRRRRT\n\n\"JESUS!\"",
            "title_similarity": "0.006186951",
            "sentiment_compound": 0.0
        },
        {
            "id": "i8533p0",
            "score": 1,
            "text": "Theirs a lesson their that it's the responsibility of who employed him, even if it was a mistake.",
            "title_similarity": "0.070593774",
            "sentiment_compound": -0.34
        },
        {
            "id": "i853h2v",
            "score": 1,
            "text": "I would've pressed the button on every blender. it's what i would hope the goldfish would do to me",
            "title_similarity": "0.63477486",
            "sentiment_compound": 0.4404
        },
        {
            "id": "i853j53",
            "score": 1,
            "text": "FAFO",
            "title_similarity": "-0.20246416",
            "sentiment_compound": 0.0
        },
        {
            "id": "i854khl",
            "score": 1,
            "text": "Why the fuck would you put fish in a blender and leave it to random assholes to turn it on",
            "title_similarity": "0.58115274",
            "sentiment_compound": -0.8176
        },
        {
            "id": "i855gaf",
            "score": 2,
            "text": "Why would that be animal cruelty? It'd be basically instant. We literally boil lobsters alive",
            "title_similarity": "0.6801227",
            "sentiment_compound": -0.3182
        },
        {
            "id": "i8565d7",
            "score": 1,
            "text": "Instead of having it be a working blender capable of killing fish, a strong with a buzzing sound that people think is a shock would serve them right.",
            "title_similarity": "0.48180813",
            "sentiment_compound": -0.2732
        },
        {
            "id": "i856ews",
            "score": 1,
            "text": "I would have personally walked by and slapped all them buttons, just because they’re buttons. Keep me away from those cool looking Cold War era launch key setups.",
            "title_similarity": "0.41288593",
            "sentiment_compound": -0.3818
        },
        {
            "id": "i857y50",
            "score": 1,
            "text": "That's fucked. I could see people pushing the button thinking there's NO WAY it would actually turn the blender on and must activate some other hidden piece of art.",
            "title_similarity": "0.3991502",
            "sentiment_compound": -0.8091
        },
        {
            "id": "i858g17",
            "score": 1,
            "text": "haha",
            "title_similarity": "-0.24142624",
            "sentiment_compound": 0.4588
        },
        {
            "id": "i858y8g",
            "score": 1,
            "text": "Of your first thought is fuck yeah I would have pushed the button, you are living with hate in your heart and need to seek shrooms or something.",
            "title_similarity": "0.30140924",
            "sentiment_compound": -0.2023
        },
        {
            "id": "i859o6d",
            "score": 1,
            "text": "Hold my beer",
            "title_similarity": "0.029627236",
            "sentiment_compound": 0.0
        },
        {
            "id": "i85bdti",
            "score": 1,
            "text": "I don’t know what’s worse, a journalist, a lawyer, or a tax collector.",
            "title_similarity": "0.27843368",
            "sentiment_compound": -0.4767
        },
        {
            "id": "i85bsso",
            "score": 1,
            "text": "I can only hope this shattered whatever sense of detachment that one visitor had.",
            "title_similarity": "0.22892906",
            "sentiment_compound": -0.184
        },
        {
            "id": "i85dia0",
            "score": 1,
            "text": "Should have made the \"artist\" put his hands into the blender as well. Sick fuck.",
            "title_similarity": "0.44948822",
            "sentiment_compound": -0.6908
        },
        {
            "id": "i85dngb",
            "score": 1,
            "text": "11",
            "title_similarity": "-0.10218145",
            "sentiment_compound": 0.0
        },
        {
            "id": "i85e1wy",
            "score": 1,
            "text": "What they should have done, rather than having the button blend, to make it sound out an alarm “warning animal cruelty in the vicinity”.",
            "title_similarity": "0.32423684",
            "sentiment_compound": -0.743
        },
        {
            "id": "i85e84q",
            "score": 2,
            "text": ">The court had earlier heard an expert witness from the blenders' maker, Moulinex, that the fish had probably died within one second of the blender being switched on.\n\nThere you are, sitting at your desk working at the Moulinex headquarters. Business is booming, life is good. Your receptionist informs you that a Danish judge is calling in asking how effective your blenders are at killing goldfish. Just another day at the job.",
            "title_similarity": "0.81122905",
            "sentiment_compound": -0.4588
        },
        {
            "id": "i85fbj4",
            "score": 3,
            "text": "I really dislike the concept of willfully putting animals in harm’s way to illustrate a point, it doesn’t matter if it’s a goldfish, bird, dog, or monkey. \n\nIt doesn’t matter if they were fancy goldfish or feeder goldfish, killing without purpose or just for amusement is grotesque",
            "title_similarity": "0.53581905",
            "sentiment_compound": -0.6801
        },
        {
            "id": "i85ffxs",
            "score": 1,
            "text": "Reminds me of a piece I saw in a NY gallery in 2000. There were several tanks with a fish in them, and another tank in the middle with some sort of fish that ate goldfish. You played a video game at a console and picked which fish you were playing for. If you lost your fish’s tank would be flushed into the center tank.",
            "title_similarity": "0.74210864",
            "sentiment_compound": 0.2263
        },
        {
            "id": "i85g4cn",
            "score": 1,
            "text": "Everyone’s a critic.",
            "title_similarity": "0.092374794",
            "sentiment_compound": -0.2732
        },
        {
            "id": "i85heel",
            "score": 2,
            "text": "That \"artist\" is giving me some serious r/im14andthisisdeep vibes.",
            "title_similarity": "0.15960336",
            "sentiment_compound": 0.2732
        },
        {
            "id": "i85j8qd",
            "score": 1,
            "text": "Could turn it into a game called, spot the serial killer.",
            "title_similarity": "0.2908444",
            "sentiment_compound": -0.6486
        },
        {
            "id": "i85kcbl",
            "score": 2,
            "text": "I'm reminded of the psychological experiment where people were given a button that would supposedly deliver shocks to someone isolated in a room that they were observing. They were told that past a certain level the shocks would probably kill the person so they needed to be careful.\n\nThey then engaged in a series of question/answer situations and if the \"subject\" got the question wrong, the person was instructed to give them a shock, or turn up the shock level. The \"subject\" wasn't actually getting shocked, they were basically an actor that was responding to prompts given about the settings of the device.\n\nIt was shockingly easy to get people to push the system that they fully believed worked into deadly territory while the \"subject\" sobbed and begged for their lives.",
            "title_similarity": "0.4451919",
            "sentiment_compound": -0.9305
        },
        {
            "id": "i85myfy",
            "score": 1,
            "text": "Actually, I think the typical person would probably be much more likely to press that button than the blender button.",
            "title_similarity": "0.19483149",
            "sentiment_compound": 0.0
        },
        {
            "id": "i85t4g5",
            "score": 2,
            "text": "If i made that piece, I’d try to put a hidden camera somewhere in the blenders, and when you press the button it just takes a picture of you that gets projected onto a wall with just „WHY?“ in big letters over it. Would be kinda cathartic.",
            "title_similarity": "0.4291658",
            "sentiment_compound": 0.0
        },
        {
            "id": "i85u089",
            "score": 2,
            "text": "I really hate this",
            "title_similarity": "0.048310466",
            "sentiment_compound": -0.6115
        },
        {
            "id": "i85v7wd",
            "score": 1,
            "text": "did nobody think of moon knight even for a second",
            "title_similarity": "0.2483935",
            "sentiment_compound": 0.0
        },
        {
            "id": "i85vqxg",
            "score": 1,
            "text": "Sushi soup",
            "title_similarity": "0.2791438",
            "sentiment_compound": 0.0
        },
        {
            "id": "i85wwed",
            "score": 1,
            "text": "Bass o matic",
            "title_similarity": "0.10988676",
            "sentiment_compound": 0.0
        },
        {
            "id": "i85yph3",
            "score": 1,
            "text": "It was a test to find a psychopath",
            "title_similarity": "0.21253195",
            "sentiment_compound": 0.0
        },
        {
            "id": "i862elz",
            "score": 2,
            "text": "One percent of the population is a psychopath.",
            "title_similarity": "0.34491217",
            "sentiment_compound": 0.0
        },
        {
            "id": "i863uar",
            "score": 5,
            "text": "They should have made the button electric shock the person and maybe even a siren or light to draw attention to them and disconnected the blades. FISH KILLER!!!",
            "title_similarity": "0.51157856",
            "sentiment_compound": -0.8594
        },
        {
            "id": "i865rvj",
            "score": 3,
            "text": "TIL that most anything can be called “art”, even if it isn’t. \n\nAlso that one visitor was an ass.",
            "title_similarity": "0.27544034",
            "sentiment_compound": -0.5423
        },
        {
            "id": "i866zfr",
            "score": 3,
            "text": "Ig curiousity is the one to blame.",
            "title_similarity": "0.028746307",
            "sentiment_compound": -0.34
        },
        {
            "id": "i869dh6",
            "score": 1,
            "text": "...Assholes",
            "title_similarity": "0.004135783",
            "sentiment_compound": -0.5859
        },
        {
            "id": "i86c0vl",
            "score": 2,
            "text": "Only once is the surprising part.",
            "title_similarity": "-0.025347745",
            "sentiment_compound": 0.2732
        },
        {
            "id": "i86hjk5",
            "score": 2,
            "text": "Reminds me of that one art exhibition with a starving dog standing amidst dog food posted out of reach all around the wall. \n\nI’m all for a meta analysis of human nature in art, but don’t actually use animal cruelty to accomplish it.",
            "title_similarity": "0.5413255",
            "sentiment_compound": -0.5423
        },
        {
            "id": "i86oyir",
            "score": 3,
            "text": "Isn't about 1% of the human race born a literal psychopath? I trust most people, and I think most would be inclined to help when nudged a little, but this single statistic would keep me from making this kind of art or statements. Some people are not to be trusted.",
            "title_similarity": "0.4225671",
            "sentiment_compound": -0.0852
        },
        {
            "id": "i86y47v",
            "score": 1,
            "text": "He did it for all of us",
            "title_similarity": "0.0601819",
            "sentiment_compound": 0.0
        },
        {
            "id": "i8f7m52",
            "score": 1,
            "text": "I'm going to keep it 💯 with you guys. I'd press the button just to see people's reactions.",
            "title_similarity": "0.13025409",
            "sentiment_compound": 0.0
        },
        {
            "id": "i8onirz",
            "score": 1,
            "text": "except visitors didn't press the button, it was a news reporter who turned up and tried to encourage folk to press it and when noone would eventually did it himself to get the story.",
            "title_similarity": "0.38133353",
            "sentiment_compound": 0.5106
        }
    ]
}