{
    "Pandora will no longer sell mined diamonds and will switch to exclusively laboratory-made diamonds.\n": [
        {
            "id": "gww2sv4",
            "score": -15,
            "text": "about 30 years to0 late for this decision to have been made on an ethical basis",
            "title_similarity": "0.29070246",
            "sentiment_compound": 0.5106
        },
        {
            "id": "gww4cku",
            "score": 13,
            "text": "Well it’s a good start, but I’ll still never buy one. They’re genuinely worthless beyond industrial applications IMO.",
            "title_similarity": "0.6377946",
            "sentiment_compound": -0.3291
        },
        {
            "id": "gww7sdm",
            "score": -5,
            "text": "Diamonds are still worthless so whatever",
            "title_similarity": "0.5736222",
            "sentiment_compound": -0.4404
        },
        {
            "id": "gwwag4q",
            "score": 4,
            "text": "As with any manufacturing process, this should drastically reduce the price over time. \n\nHowever, diamonds are basically worthless anyways. The high price has been artificially kept high by companies that directly benefit from the high price. The quicker monopolies like this lose power the better for everyone. \n\nStill jewelry is totally stupid and no one should care about it at all.",
            "title_similarity": "0.59028316",
            "sentiment_compound": -0.1485
        },
        {
            "id": "gwwe54l",
            "score": 0,
            "text": "I doubt they're going to drop their prices accordingly.",
            "title_similarity": "0.3416519",
            "sentiment_compound": -0.5574
        },
        {
            "id": "gwwcela",
            "score": 2,
            "text": "Pto tip: diamonds arent worth shit :)",
            "title_similarity": "0.55881345",
            "sentiment_compound": -0.0572
        },
        {
            "id": "gwwh2nj",
            "score": 1,
            "text": "Cheap tacky shop commits to being cheap and tacky",
            "title_similarity": "0.30096152",
            "sentiment_compound": 0.0258
        },
        {
            "id": "gww008r",
            "score": -9,
            "text": "Pandora realises they can't mark up mined diamonds like they can synthetics. Will try and sell them for the same price though, will do the whole celebrity influencer to sell them but will realise it was a mistake in 12 to 18 months.",
            "title_similarity": "0.6270119",
            "sentiment_compound": -0.3291
        },
        {
            "id": "gwwefiv",
            "score": 0,
            "text": "It fucking would 2 weeks after I bought a diamond engagement ring.",
            "title_similarity": "0.45223743",
            "sentiment_compound": 0.6597
        },
        {
            "id": "gwweuqg",
            "score": 4,
            "text": "Pandora is so tacky",
            "title_similarity": "0.2330081",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwwess6",
            "score": -7,
            "text": "Diamonds are the most useless gem there is. They're not even rare yet the gullible masses bought right into it.",
            "title_similarity": "0.5633488",
            "sentiment_compound": -0.6801
        },
        {
            "id": "gwwat7q",
            "score": 5,
            "text": "We are starting to see the beginning of the end for mines diamonds. This has been said for years but the diamond industry is about to seriously implode because of lab grown diamonds. Diamond engagement rings that used to cost $10,000 will not only cost $1,000 or 2,000. Even natural big diamonds that cost $1 million can be bought from labs for $100,000.\n\nOf course, there’s elitists who say you can’t beat natural diamonds but the funny thing is, lab grown diamonds are still diamonds and will test positive as such. This of course has caused serious panic in the jewelry industry and are now demanding that all lab grown diamonds must be labeled as such since they are indistinguishable and will cause the prices to rank.",
            "title_similarity": "0.57405436",
            "sentiment_compound": 0.9528
        },
        {
            "id": "gww75t8",
            "score": 0,
            "text": "Why does this remind me of the European Super League?",
            "title_similarity": "0.20252158",
            "sentiment_compound": 0.5994
        },
        {
            "id": "gwwdh1j",
            "score": 0,
            "text": "So even more inflated markup? Got it.",
            "title_similarity": "0.09369023",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwzd6k1",
            "score": 0,
            "text": "Why on earth would i pay the price of mined diamonds for lab grown?\n\nFuck that. Scam artists.",
            "title_similarity": "0.5967069",
            "sentiment_compound": -0.8225
        },
        {
            "id": "gwx84ra",
            "score": -5,
            "text": "If my husband ever got me a Pandora anything I would know we are headed towards divorce. It’s some serious Basic bitch shit. I’d rather be alone than have the same shit every other woman has. \n\n“Don’t know anything about the special woman in your life other than she can make babies and feels good when you put it in? Shop Pandora! We have everything to keep her from discovering a personal identity.”\n\nEdit: \n\nWell I thought the facetiousness of this statement was obvious. But clearly there are some basic ass men who in between lights out missionary also pop by the mall to acquire garbage as a sign of love.",
            "title_similarity": "0.5928643",
            "sentiment_compound": 0.3802
        },
        {
            "id": "gww50z5",
            "score": -11,
            "text": "Unfortunately, I see a very small win. From natural resources, human exploitation in Africa to resource, power wastage and co2 boom to create useless, overpriced shiny pieces of rock for jewellery when people can't put food on the table and global warming in full swing. \n\nPeople need to stop buying into their bs slogan and abandon this worthless piece of crap for their own and the planet's good.",
            "title_similarity": "0.5662711",
            "sentiment_compound": -0.4761
        },
        {
            "id": "gww06tj",
            "score": 788,
            "text": "[removed]",
            "title_similarity": "0.31204215"
        },
        {
            "id": "gwwda6i",
            "score": 3,
            "text": "So, they’ll buy them way cheaper and sell them for the same price. Because they are just good people.",
            "title_similarity": "0.22080664",
            "sentiment_compound": 0.4404
        },
        {
            "id": "gwxoboq",
            "score": 4,
            "text": "What's funny about these threads is that 95% of the commenters haven't reached the age or stage in life where they're shopping for diamond rings yet for engagement, and so are generally talking out of their asses. As for the other 5%, it's understandable diamonds aren't for everyone and you don't want to partake in this. There are more sensible ways to spend money--some couples agree instead of blowing money on rings and weddings, spend it on the honeymoon where you can savor the experience over days/weeks or save up for a home together. Ultimately that's for the couple to decide. However, if you do feel a diamond ring is right, do your research. There's nothing wrong with it if you can afford it and can spend that kind of money.\n\nThe most disappointing is the sheer amount of misinformation on this sub. DeBeers doesn't have a monopoly anymore and is nowhere close to being a monopoly (marketshare currently is in the ~30% range). Since the fall of the USSR, Russia mines are a huge source of diamonds so that diamonds from Africa are no longer that big of a source. Moreover, Canadian mines also grew in output. Most posters here seem to think that diamonds are blood diamonds whereas it's extremely hard to even get blood diamonds these days. Major jewelers whether it's Kay, Pandora, or even online sources like Blue Nile make it very clear their diamonds are sourced in ethical ways and there are [certification processes](https://en.wikipedia.org/wiki/Kimberley_Process_Certification_Scheme) to assure this. Anyone who has experience in working with material regulations like 3TGs, etc. may be familiar with these kinds of certification. You have to actually go out of your way to get a blood diamond these days like trading old stones, but generally everything in stores these days is ethically mined / lab grown.",
            "title_similarity": "0.52738464",
            "sentiment_compound": 0.9227
        },
        {
            "id": "gwwagch",
            "score": 3,
            "text": "DeBeers and the world trade body artificially hold back mined diamonds which are in huge abundance to create a pricing cartel. This is the right thing to do to disrupt a thoroughly corrupt industry that turns a blind eye to poverty and conflict in the pursuit of shiny things that make obscene profits from a virtually valueless item at the sales end of the supply chain.",
            "title_similarity": "0.52788156",
            "sentiment_compound": -0.7003
        },
        {
            "id": "gwwrve3",
            "score": -4,
            "text": "[removed]",
            "title_similarity": "0.31204215"
        },
        {
            "id": "gww4t4w",
            "score": -1,
            "text": "De Beers assassins have been mobilized.",
            "title_similarity": "0.27313066",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwwf8lj",
            "score": 1,
            "text": "Good, the diamond industry is controlled by one organization and is a scam anyway.",
            "title_similarity": "0.554669",
            "sentiment_compound": 0.1531
        },
        {
            "id": "gwwg5q2",
            "score": 1,
            "text": "I bet the prices are not changing though. Smart business move, cheapen the source materials but maintain or increase prices. I am sure people will continue to buy anyways because Pandora is Pandora.",
            "title_similarity": "0.38100958",
            "sentiment_compound": 0.6452
        },
        {
            "id": "gwwo4cu",
            "score": 1,
            "text": "Why the fuck are diamonds even a thing anymore.\n\nI'm quite sure millennials would much rather buy a car or pay their rent instead of putting up an obscene amount of money for a shiny boi.",
            "title_similarity": "0.53565323",
            "sentiment_compound": -0.7275
        },
        {
            "id": "gwzs6rl",
            "score": -1,
            "text": "So fake diamonds?",
            "title_similarity": "0.4256243",
            "sentiment_compound": -0.5256
        },
        {
            "id": "gww7usq",
            "score": 38,
            "text": "Blood diamonds are sooooo 20th century. It's all about blood minerals now.\n\n[https://www.androidauthority.com/conflict-minerals-883973/](https://www.androidauthority.com/conflict-minerals-883973/)\n\nSo before anyone gets high and mighty about diamonds have a think about what you and I are typing on right now because Tantalum is mainly found in two places, Australia and Rwanda. And it is mostly coming out of Rwanda.",
            "title_similarity": "0.48061606",
            "sentiment_compound": 0.0
        },
        {
            "id": "gww1kv7",
            "score": -19,
            "text": "Let me guess, those labs are in Europe or the US who will take business away from Africa...",
            "title_similarity": "0.4919905",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwwgr3i",
            "score": 17,
            "text": "The number of decades the De Beers scam has thrived is a monument to consumer stupidity.",
            "title_similarity": "0.3065339",
            "sentiment_compound": -0.743
        },
        {
            "id": "gwvysgy",
            "score": 968,
            "text": "I bet they wont drop the prices though",
            "title_similarity": "0.31418192",
            "sentiment_compound": 0.2057
        },
        {
            "id": "gwwf9uq",
            "score": -15,
            "text": "I’m sure your fiancé will be so happy to learn you got her cheap engagement ring with a fake diamond.",
            "title_similarity": "0.42978078",
            "sentiment_compound": 0.8534
        },
        {
            "id": "gww9v2l",
            "score": 7,
            "text": "[deleted]",
            "title_similarity": "0.3195309"
        },
        {
            "id": "gww76zf",
            "score": 2,
            "text": "\"I hope that we can become a low carbon business \" selling diamonds, which are pure carbon. \n\nDe Beers cut a deal with Russia, which was first into the synthetics field. It was to take 1 ct stones in bulk, and so protect its cartel. To get rid of the vaguely brown stones, they invented the \"eternity ring\", mounted in gold, which hid the brown tint. \n\nDiamonds, like oil, have a price which is a long way from its cost of production. The reason is supply restriction by a cartel, in the one case OPEC, in the other De Beers.",
            "title_similarity": "0.6210688",
            "sentiment_compound": 0.4707
        },
        {
            "id": "gwwgaw9",
            "score": -2,
            "text": "Cheapening an already garbage brand with fake stones won't stop me from not buying them, so good on him, I guess?",
            "title_similarity": "0.45864528",
            "sentiment_compound": 0.3673
        },
        {
            "id": "gwwp81c",
            "score": 2,
            "text": "Just don't buy diamonds. I never needed them. My women never needed or asked them. And it would be a really bad move for them to ask them, as I barely could stand her lack of values.",
            "title_similarity": "0.59537446",
            "sentiment_compound": -0.5256
        },
        {
            "id": "gwwq2xl",
            "score": -3,
            "text": "[deleted]",
            "title_similarity": "0.3195309"
        },
        {
            "id": "gwwsl2q",
            "score": -2,
            "text": "Upload all of your assets to https://www.thegamecrafter.com/ and publish it that way.  People can then buy the game if they really want to, and you won't have to do any work to sell it.  The game will probably retail over $100.  When your parents complain, tell them you don't have the money to order 5,000 copies, which is the minimum necessary for mass production and retail sale.",
            "title_similarity": "0.5027051",
            "sentiment_compound": -0.0534
        },
        {
            "id": "gwwv9j6",
            "score": 3,
            "text": "There was never any point in diamonds. A lab-made diamond is just as good as a natural one. Without the human suffering. When you think about it, we are putting value in a Shiny Rock.",
            "title_similarity": "0.678077",
            "sentiment_compound": 0.8946
        },
        {
            "id": "gwwyr2m",
            "score": -2,
            "text": "Only rich idiots buy this crap..\n\nNo girl I know actually sees others wearing one and be like shit I need that...",
            "title_similarity": "0.49146786",
            "sentiment_compound": -0.4019
        },
        {
            "id": "gwxi6jf",
            "score": 2,
            "text": "Diamonds are such a boomer thing",
            "title_similarity": "0.3422383",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwwklhc",
            "score": -6,
            "text": "[deleted]",
            "title_similarity": "0.3195309"
        },
        {
            "id": "gwwcvzj",
            "score": 40,
            "text": "Diamonds are a scam",
            "title_similarity": "0.41340846",
            "sentiment_compound": -0.5719
        },
        {
            "id": "gwwc07q",
            "score": -9,
            "text": "[deleted]",
            "title_similarity": "0.31953087"
        },
        {
            "id": "gww6xrq",
            "score": 0,
            "text": "Yeah, they'll probably start using Unobtanium and force the Na'vi off their native lands instead!",
            "title_similarity": "0.54895645",
            "sentiment_compound": 0.3595
        },
        {
            "id": "gww9fdc",
            "score": 0,
            "text": "I'm happy for the slaves having to mine all this shit. Then again, I would bever buy diamonds regardless.",
            "title_similarity": "0.39178592",
            "sentiment_compound": -0.1406
        },
        {
            "id": "gww9nql",
            "score": 0,
            "text": "It will still be gouged prices for synthetic diamonds. We have always known the scarcity is controlled by the real Dimond companies. I wonder how hard Dimond prices will fall...",
            "title_similarity": "0.5421545",
            "sentiment_compound": -0.1027
        },
        {
            "id": "gwwdya4",
            "score": -4,
            "text": "Amazing to me that a lab would waste its time making shiney rocks instead of something truly valuable. History will look back and wonder why they didn’t just mine bitcoin instead",
            "title_similarity": "0.6310487",
            "sentiment_compound": 0.7906
        },
        {
            "id": "gwweagg",
            "score": 0,
            "text": "De Beers just shit themselves.",
            "title_similarity": "0.3884696",
            "sentiment_compound": -0.5574
        },
        {
            "id": "gwwffi9",
            "score": 0,
            "text": "Now bring back Pandora radio outside the US. \n\n/s",
            "title_similarity": "0.46513695",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwwfx2c",
            "score": 0,
            "text": "Who?",
            "title_similarity": "0.060302787",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwwjulv",
            "score": 0,
            "text": "Mined diamonds is more valuable.",
            "title_similarity": "0.36210555",
            "sentiment_compound": 0.5256
        },
        {
            "id": "gwwpea8",
            "score": 0,
            "text": "Boooooo",
            "title_similarity": "0.06849748",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwwrxgf",
            "score": 0,
            "text": "Not gonna be getting pandora anymore. I only want the OG diamonds",
            "title_similarity": "0.7162583",
            "sentiment_compound": 0.0772
        },
        {
            "id": "gwwtzn8",
            "score": 0,
            "text": "Good.  They should stick to streaming music back in the early 2000's like Zeus intended.",
            "title_similarity": "0.3682489",
            "sentiment_compound": 0.6597
        },
        {
            "id": "gwwugdu",
            "score": 0,
            "text": "Wow, that’s pretty ESG. Wished I had Pandora on the radar much earlier",
            "title_similarity": "0.4657892",
            "sentiment_compound": 0.7906
        },
        {
            "id": "gwwumv2",
            "score": 0,
            "text": "Shiny rocks are for morons.",
            "title_similarity": "0.34808972",
            "sentiment_compound": -0.3182
        },
        {
            "id": "gwwv1eb",
            "score": 0,
            "text": "So now you can only buy fake diamonds?",
            "title_similarity": "0.6079631",
            "sentiment_compound": -0.4767
        },
        {
            "id": "gwwvmj7",
            "score": 0,
            "text": "Still not buying diamonds tho. What's the point of jewellery which is grossly overpriced, could probably have blood on it and instantly loses a mojority or resale value once I buy it?",
            "title_similarity": "0.59484184",
            "sentiment_compound": -0.2023
        },
        {
            "id": "gwwxd3p",
            "score": 0,
            "text": "Why is an online radio company selling diamonds?",
            "title_similarity": "0.4518807",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwwxfjh",
            "score": 0,
            "text": "Still, diamonds are boring as hell, (at least clear white ones) good to know they'll loose their value",
            "title_similarity": "0.5899869",
            "sentiment_compound": -0.7256
        },
        {
            "id": "gwwxn9u",
            "score": 0,
            "text": "It would be faster for scientists to develop a mechanism for producing food and water in test tubes to get rid of the many problems in our world. We can only believe it.",
            "title_similarity": "0.37916243",
            "sentiment_compound": -0.4019
        },
        {
            "id": "gwwyl32",
            "score": 0,
            "text": "or that's at least what they say.",
            "title_similarity": "0.089552045",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwwzmz3",
            "score": 0,
            "text": "Diamonds are worthless",
            "title_similarity": "0.5474027",
            "sentiment_compound": -0.4404
        },
        {
            "id": "gwx0wa3",
            "score": 0,
            "text": "How big are they?",
            "title_similarity": "-0.01958118",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwx1le6",
            "score": 0,
            "text": "I wish rubies and emeralds were more popular than diamonds. . .  I wanted a ruby ring once, but my wife said \"*thats gay*\".",
            "title_similarity": "0.47370222",
            "sentiment_compound": 0.4398
        },
        {
            "id": "gwx3c4k",
            "score": 0,
            "text": "The reason they're doing it is simple: money.\n\nLab diamond are priced approximately 40% cheaper then naturals but have no resale value, they are very bad for the environment, you'll need a huge amount of energy to make them. \n\nYes the natural diamond industry is \"shady\" but it supports millions of people including the thousands and thousands of small artisanal miners in Africa.",
            "title_similarity": "0.432247",
            "sentiment_compound": 0.8363
        },
        {
            "id": "gwx5f36",
            "score": 0,
            "text": "Yet, since these are CONSIDERABLY cheaper to produce, bet their prices won't go down.",
            "title_similarity": "0.25676012",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwx6gpm",
            "score": 0,
            "text": "I don't know how I feel about this. Like on one hand the method they get the diamonds will be a lot more ethical, but on the other hand it's not as special as getting it from Mother Earth herself.",
            "title_similarity": "0.50037694",
            "sentiment_compound": 0.7748
        },
        {
            "id": "gwxf3va",
            "score": 0,
            "text": "Of course since they have stripped the planet of most of its resources already.",
            "title_similarity": "0.5097616",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwxflf1",
            "score": 0,
            "text": "I cannot get behind lab-grown meat but I can get behind this. The inflated price of diamonds is wholly due to genius marketing and hoarding by Debeers.",
            "title_similarity": "0.5289649",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwxm6a1",
            "score": 0,
            "text": "Good thing their jewelry was already cheap crap or I'd give a fuck.",
            "title_similarity": "0.4594513",
            "sentiment_compound": -0.4939
        },
        {
            "id": "gwxm6pj",
            "score": 0,
            "text": "Good thing their jewelry was already cheap crap or I'd give a fuck.",
            "title_similarity": "0.4594513",
            "sentiment_compound": -0.4939
        },
        {
            "id": "gwxn5ev",
            "score": 0,
            "text": "Sad that people spend money on worthless materials like diamonds anyways — gold is a much better hedge",
            "title_similarity": "0.45328113",
            "sentiment_compound": -0.1531
        },
        {
            "id": "gwxp2ve",
            "score": 0,
            "text": "And whilst we’re at it (seriously) can we stop spending tens of thousands on weddings and dresses only worn once and having ceremonies in the pedos head quarters in the area (church). Have a small tasteful wedding, nice little after party, cheap but fun honeymoon and put the rest of the money to good use like a deposit on a house or your kids education etc etc and on and on. The wedding industry is just one big rip off..!!! Love, your friendly neighbourhood Spider-Man.... lol 🤷🏻‍♂️😂❤️",
            "title_similarity": "0.46456045",
            "sentiment_compound": 0.9863
        },
        {
            "id": "gwxvsst",
            "score": 0,
            "text": "Will it still play music?",
            "title_similarity": "0.17368981",
            "sentiment_compound": 0.34
        },
        {
            "id": "gwy3rbh",
            "score": 0,
            "text": ">Between 50% and 60% of them come from China, where they are made in a process known as \"high-pressure, high-temperature technology\". The use of coal powered electricity is widespread.\n\n>The largest US producer, Diamond Foundry, says its process is \"100% hydro-powered, meaning zero emissions\".\n\nOnce again, China sucks.  Making diamonds with coal.  Fucking awesome",
            "title_similarity": "0.41622764",
            "sentiment_compound": 0.6478
        },
        {
            "id": "gwy3vlc",
            "score": 0,
            "text": "MIIIIIINNNEEE DDDIIIIAMONNDSS",
            "title_similarity": "0.17538953",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwy3vs5",
            "score": 0,
            "text": "MIIIIIINNNEEE DDDIIIIAMONNDSS",
            "title_similarity": "0.17538953",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwy63kb",
            "score": 0,
            "text": "Selling fake diamonds at high prices well that is a good business strategy for Pandora but no so for the consumers who get nothing if they ever want to sell the fake stuff one day!",
            "title_similarity": "0.51821804",
            "sentiment_compound": -0.7463
        },
        {
            "id": "gwydmcr",
            "score": 0,
            "text": "Not buying from them anymore lol",
            "title_similarity": "0.45356977",
            "sentiment_compound": 0.4215
        },
        {
            "id": "gwyhf83",
            "score": 0,
            "text": "So they might as well sell cubic zirconia.",
            "title_similarity": "0.3450541",
            "sentiment_compound": 0.2732
        },
        {
            "id": "gwyl3dh",
            "score": 0,
            "text": "Or people could start looking at moissanite.\n\nLess pretentious. Lab-made. Shinier. More affordable.",
            "title_similarity": "0.21301991",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwz199m",
            "score": 0,
            "text": "Why haven’t we come up with something cooler than a transparent reflective rock on top of a metal circle yet? Ohhhhh wow different kinds of circles and different shape rocks whoooaaaaa omg does that one have more than one rock holy shit",
            "title_similarity": "0.47760597",
            "sentiment_compound": 0.25
        },
        {
            "id": "gwz4eez",
            "score": 0,
            "text": "I didn’t know Pandora sold diamonds\n\nThis feels a bit like Red Lobster announcing they’ll only be sourcing lab grown beef",
            "title_similarity": "0.5210868",
            "sentiment_compound": 0.3612
        },
        {
            "id": "gwzcjvc",
            "score": 0,
            "text": "Use my code in tiktok 9233677601",
            "title_similarity": "0.24685362",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwwbueg",
            "score": 15,
            "text": "I refuse to buy a diamond unless SOMEONE suffered before it got to me. That's what gives it it's shine.",
            "title_similarity": "0.6191022",
            "sentiment_compound": -0.4588
        },
        {
            "id": "gwwefnp",
            "score": -4,
            "text": "They rather sell cheaper fake Diamonds than contributing for a fair industry respecting the human rights of miners.\n\nSays a lot about how fake hoke companies act.",
            "title_similarity": "0.513141",
            "sentiment_compound": -0.1779
        },
        {
            "id": "gwwtdld",
            "score": -6,
            "text": "A rather short-sighted view of the world.   First, man-made diamonds take huge amounts of energy to produce.  Solar and wind power, need not apply. So your not saving the planet with these. Additionally, unlike copper, cobalt, or lithium, they don't require smelting or other toxic, high-energy processing.   Sort of ironic that the group screaming for man-made diamonds is doing so from their Tesla. (Look at what it takes to make those batteries....) \nFurther, most of the world's diamond mines already exist.  The damage to the earth is done. No filling in those holes. Good luck getting Putin to do so.\n\nMoving the production of diamonds to a lab in Miami or Singapore, does nothing for the millions in Russia, Africa, Canada, Australia, etc, who rely on these for existence.",
            "title_similarity": "0.7050108",
            "sentiment_compound": 0.1796
        },
        {
            "id": "gwwccw2",
            "score": -1,
            "text": "I saw a fake diamond ring. It looked 10 times more beautiful than a real diamond ring.... why the fuck people still want to those ugly shits I wonder....",
            "title_similarity": "0.442532",
            "sentiment_compound": -0.5729
        },
        {
            "id": "gwwckpd",
            "score": 1,
            "text": "And I will do my duty by continuing to not buy useless shiny objects.",
            "title_similarity": "0.4035195",
            "sentiment_compound": 0.3252
        },
        {
            "id": "gwwd69n",
            "score": 1,
            "text": "Who actually buys this stuff? It just seems trashy.",
            "title_similarity": "0.3207997",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwwdgur",
            "score": 1,
            "text": "I thought they streamed music playlists with ads wtf",
            "title_similarity": "0.23002975",
            "sentiment_compound": -0.5859
        },
        {
            "id": "gwweduw",
            "score": 1,
            "text": "Can women please want something else for engagement?  Like something not so bullshit and overpriced?   Like a nice cheese wheel or something?",
            "title_similarity": "0.3591479",
            "sentiment_compound": 0.9501
        },
        {
            "id": "gwwevmz",
            "score": 1,
            "text": "It’s gonna cost less too right",
            "title_similarity": "0.24502748",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwwfjph",
            "score": -1,
            "text": "DeBeers sweating profusely",
            "title_similarity": "-0.00073344633",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwwfr4g",
            "score": -1,
            "text": "Diamonds, and the useless people who covet them.  Whooopdeeedooo!",
            "title_similarity": "0.49897343",
            "sentiment_compound": -0.4753
        },
        {
            "id": "gwwghqz",
            "score": -1,
            "text": "https://www.forbes.com/sites/quora/2017/07/03/why-smart-people-buy-cubic-zirconia-engagement-rings\n\nI think everyone should just artificial diamonds.",
            "title_similarity": "0.58710355",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwwhaxr",
            "score": 1,
            "text": "And the prices won't go down for us because they've been artificial the whole time.",
            "title_similarity": "0.50520384",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwwhbdo",
            "score": -1,
            "text": "Pffffffftttt, lab made??? No thx, i want the diamonds that have a story...you know where a trex 3 million yrs ago ate a piece of kimberlite and shat it out later to be found as a coprolite by some 2nd yr geology student in a field camp run by uc davis",
            "title_similarity": "0.5776218",
            "sentiment_compound": -0.3291
        },
        {
            "id": "gwwj7cq",
            "score": 1,
            "text": "Diamonds are so fucking dumb. ooooh shiny rock",
            "title_similarity": "0.49926582",
            "sentiment_compound": -0.5956
        },
        {
            "id": "gwwj8yq",
            "score": 1,
            "text": "Diamonds are so weird as an overall item. Diamonds are super expensive because humans think they look pretty and there’s a stigma of if you love a woman give her diamonds. Diamonds have a lot of uses other than for jewelry and they aren’t really all that limited in supply if we exclude their use in jewelry. \n\nSo since there is so much demand for diamonds that is larger than our natural supply, being able to form them in labs is  very useful. In addition to that it’s not that expensive to form so it’s actually cheaper than your natural diamonds. Which makes things like diamonds tipped saw blades much more accessible. \n\nThe funny part is there is still a stigma of naturally occurring vs lab formed diamonds. When it comes to buying hour lady a diamond ring, it’s usually considered to be more high end to have a natural diamond (100% the work of those that mine diamonds).  If you buy a lab diamond most people look at you as cheap because they are cheaper and considered less desirable. The funny part though is the way you can generally tell the difference between a natural and lab formed diamond is the fact that diamonds made in the lab are “too perfect” with no flaws. \n\nThat’s right if you have a perfect diamond it’s less desirable and cheaper than a natural diamond with imperfections and flaws. It’s a total conspiracy lol.",
            "title_similarity": "0.43868664",
            "sentiment_compound": 0.992
        },
        {
            "id": "gwwjayl",
            "score": -1,
            "text": "I love when there’s a post about diamonds because undoubtably it’s full of poor people trying to tell everyone else how shit diamonds are because they know their broke ass wedding ring is gonna have a CZ in it lmao",
            "title_similarity": "0.4482481",
            "sentiment_compound": -0.5994
        },
        {
            "id": "gwwkbr6",
            "score": 1,
            "text": "Diamonds are bullshit.",
            "title_similarity": "0.41913697",
            "sentiment_compound": -0.5859
        },
        {
            "id": "gwwlcah",
            "score": 1,
            "text": "In 1990 I came home from having dinner out and walked in on a burglary in progress. No one was hurt but the burglar got away with all my jewelry. I had built up a nice collection of jewelry starting with my engagement and wedding ring and added additional pieces received as gifts for anniversaries, birthdays, Christmas. Over the years since the burglary, I’ve only purchased lab created diamonds and gemstones. They are just as beautiful, I love wearing them. No ridiculous insurance premiums to pay and no fear of having them stolen or getting lost. I’ll never go back to mined stones. They’re not good for the planet, humanity or myself.",
            "title_similarity": "0.53966904",
            "sentiment_compound": 0.9485
        },
        {
            "id": "gwwn1hd",
            "score": -1,
            "text": "How much environmental destruction does diamond mining cause? You’d expect shit like diamonds to be the worst thing for the environment but nah it’s food staples like beef/dairy, coffee and chocolate...",
            "title_similarity": "0.5231848",
            "sentiment_compound": -0.2732
        },
        {
            "id": "gwwna1e",
            "score": -1,
            "text": "And I’m assuming they’re nearly the same price, yea?\n\nJust like imitation leather or anything else of the sort. Sure it’s nice. But it’s just not the same.",
            "title_similarity": "0.29960972",
            "sentiment_compound": 0.5106
        },
        {
            "id": "gwwnkj4",
            "score": 1,
            "text": "Diamonds are worthless. They are not scarce and have never been. It's all due to a cartel turning a common material into a scarce one artificially. Don't waste your money.",
            "title_similarity": "0.6797338",
            "sentiment_compound": -0.1451
        },
        {
            "id": "gwwo3b5",
            "score": 1,
            "text": "Are diamonds even necessary today?  Unless they are being used in an industrial application such as drilling they just seem like an absolute pretentious ornament from a different era.  Whenever I think of diamond jewelry, all I think of are my boomer parents. I am not trying to turn this into a boomer hate. I just think diamond jewellery represents a different time era, and if you like diamonds today that is great. It’s a free world out there, but there are plenty of places to purchase Diamonds which were ethically mined.",
            "title_similarity": "0.66549706",
            "sentiment_compound": 0.7391
        },
        {
            "id": "gwwp4qa",
            "score": -1,
            "text": "So more real or fake looking? 🤔🥴",
            "title_similarity": "0.25465548",
            "sentiment_compound": -0.5209
        },
        {
            "id": "gwwpsng",
            "score": -1,
            "text": "My girlfriend is not going to get a diamond, not even a fake diamond, when I propose. I have no interest in contributing to the myth that you have to buy a diamond engagement ring.",
            "title_similarity": "0.63490784",
            "sentiment_compound": 0.8509
        },
        {
            "id": "gwwtb63",
            "score": -1,
            "text": "Spending my kid's college fund on a worthless piece of carbon so I can become legally enslaved to my wife moment.",
            "title_similarity": "0.5152718",
            "sentiment_compound": -0.6369
        },
        {
            "id": "gwwtuox",
            "score": 1,
            "text": "I never would have thought that Pandora used real diamonds to begin with.  They sell cheap garbage, why were they using real stones at all?",
            "title_similarity": "0.5919814",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwwv1rh",
            "score": 1,
            "text": "Why is a music app selling diamonds anyway?",
            "title_similarity": "0.5414676",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwwvkin",
            "score": 1,
            "text": "Only because its cheaper to make lab made LMAO\n\n\n\"i know we have practiced slavery the past few decades but now with laboratory made, we choose that instead\"\n\n\nthese people should go to prison wtf how do we allow this?",
            "title_similarity": "0.5150049",
            "sentiment_compound": -0.8549
        },
        {
            "id": "gwww64a",
            "score": 1,
            "text": "Diamonds are hard coal, change my mind.",
            "title_similarity": "0.46999073",
            "sentiment_compound": -0.1027
        },
        {
            "id": "gwwwe0e",
            "score": -1,
            "text": "I don’t agree with the expensive diamond per se, but asking someone to marry you in the most important guesture you will ever make to your significant other.  People that blow it off or make light of it tend to make really bad partners.",
            "title_similarity": "0.3919067",
            "sentiment_compound": 0.0258
        },
        {
            "id": "gwwwq29",
            "score": 1,
            "text": "God people are dumb. Why give gf a fancy ring? I just funded her buying a damn house solely in her name for about the same money a DECENT ring would be. She gets a ring pop to go with her 2 bed 1 bath\n\nRental property is a better bragging point than a shiny rock ladies don’t waste money to impress your friends",
            "title_similarity": "0.4941516",
            "sentiment_compound": 0.296
        },
        {
            "id": "gwwynhh",
            "score": 1,
            "text": "All my friends who are thinking of marriage already plan on not getting a diamond to pop the question. Zoomers have evolved past the need for shiny rock",
            "title_similarity": "0.65620375",
            "sentiment_compound": 0.2649
        },
        {
            "id": "gwx80rg",
            "score": 1,
            "text": "Holy shit, this is fantastic. This should be on uplifting news.\n\nThe Diamond industry has always been a cartel with way too much blood on its hand. The idea that diamonds ever had 'value' is truly the greatest con job ever perpetuated on humandkind. Bernie maddoff scammed what, $60B? He is like little baby. The diamond cartel scams that much every year, for centuries, with child slaves on top of it.",
            "title_similarity": "0.4354661",
            "sentiment_compound": 0.9407
        },
        {
            "id": "gwxd397",
            "score": 1,
            "text": "Isn’t Pandora known for trinkets? Selling real diamonds doesn’t make sense.",
            "title_similarity": "0.53609407",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwxj6p2",
            "score": 1,
            "text": "Well, jeWelers will not be happy since this will bring down price of diamond. But what a way to destroy the image with cheap knockoffs.",
            "title_similarity": "0.540184",
            "sentiment_compound": -0.6704
        },
        {
            "id": "gwxk6b1",
            "score": 1,
            "text": "So ..... not diamonds then",
            "title_similarity": "0.42325974",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwxk92w",
            "score": 1,
            "text": "Women don’t like laboratory diamonds",
            "title_similarity": "0.52284753",
            "sentiment_compound": 0.3612
        },
        {
            "id": "gwxmcxi",
            "score": -1,
            "text": "I hate lab shit, I only use organics. Bye bye Pandora, this nig ain’t buying his blings from ya no mor..",
            "title_similarity": "0.6615751",
            "sentiment_compound": -0.8591
        },
        {
            "id": "gwxvk49",
            "score": 1,
            "text": "We need a grass roots campaign to get people to stop buying diamonds.  What's the appeal?  I'd much rather buy an actual precious gem than a diamond...",
            "title_similarity": "0.650141",
            "sentiment_compound": 0.5994
        },
        {
            "id": "gwxwxvm",
            "score": 1,
            "text": "I remember when Pandora just made playlists.",
            "title_similarity": "0.31858593",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwz7ge7",
            "score": -1,
            "text": "Hey everybody! So I made a new account, but reddit wont let me post any cool stuff because I don't have 75 karma! :( can you please give me an upvote so I can can join the reddit community? I love you! <3<3<3<3",
            "title_similarity": "0.5730057",
            "sentiment_compound": 0.9105
        },
        {
            "id": "gww46ft",
            "score": 2,
            "text": "Great news!",
            "title_similarity": "-0.026774805",
            "sentiment_compound": 0.6588
        },
        {
            "id": "gwwevcl",
            "score": -2,
            "text": "[deleted]",
            "title_similarity": "0.3195309"
        },
        {
            "id": "gwwfggm",
            "score": 2,
            "text": "Who knew music streaming requires so many diamonds",
            "title_similarity": "0.4180278",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwwikun",
            "score": 2,
            "text": "I bought my wife a lab-made diamond engagement ring and both of us have been absolutely thrilled with it. I had told her that I had a budget in mind and asked if she’d rather have a mined diamond, or lab but it would be 30-40% bigger and flawless quality. She was on board and is still gushing over the ring years later. \n\nIt’s amazing the things we do out of ego and pride, like blow a ton of extra money for an inferior product that likely involved exploited human labor and severe ecological damage from blasting into the earth while mining. All for the sake of fulfilling some ridiculous expectations created by the very companies profiting from people over-spending on something that doesn’t make their life better compared to an absolutely perfect alternative. \n\nI don’t mean anything against the many people that buy mined diamonds, I just want to help erase the stigma against lab diamonds and hopefully encourage others to go for it. You will never, ever, look back and will quickly realize that nobody will notice or care. They will see a gorgeous ring and you and your fiancé/spouse will be ecstatic with what you come out of it with.",
            "title_similarity": "0.48977128",
            "sentiment_compound": 0.9931
        },
        {
            "id": "gwwjks8",
            "score": 2,
            "text": "I bought a lab grown diamond for my partner's engagement ring as I didn't want to risk contributing to conflict diamonds / slave labour (even those marketed as not cannot be 100% verified).  \n\nWhen comparing they were 50-60% the cost of natural ones, so I kept my budget the same and just got a much better size/clarity/cut. My partner loves it.",
            "title_similarity": "0.51358956",
            "sentiment_compound": 0.9151
        },
        {
            "id": "gwwjmie",
            "score": 2,
            "text": "Got my wife's engagement ring and wedding band from Brilliant Earth because they had an extensive selection of lab-created diamonds. Glad to see a push entirely away from mined/blood diamonds.",
            "title_similarity": "0.58640945",
            "sentiment_compound": 0.8689
        },
        {
            "id": "gwwjtzl",
            "score": 2,
            "text": "I didn’t see the thumbnail and thought “did pandora radio add some kind of premium currency, and they physically make it?",
            "title_similarity": "0.5268307",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwwkql7",
            "score": -2,
            "text": "Blood diamonds aren't really a thing anymore this is a puff piece for good PR. Debeers like most producers already have synthetic diamond subsidiaries/interests just like big tobacco have in vaping. They aren't cheaper for the consumer because producers restrict the output to drive up the price. \n\nThe real issue is blood minerals such as rare earth metals considering they are cheaper to mine and are needed in all electronics but decimates the environment.",
            "title_similarity": "0.57683754",
            "sentiment_compound": 0.5187
        },
        {
            "id": "gwwrdcg",
            "score": 2,
            "text": "It baffles me that Americans pay so much for this shitty rock. Why not buy a marriage ps5 or marriage japanese hi-tech toilet?",
            "title_similarity": "0.3999443",
            "sentiment_compound": -0.6858
        },
        {
            "id": "gwwrv2r",
            "score": 2,
            "text": "Good, diamonds arent that rare anyway, the prices are artificially inflated by debeers, so may as well use artificial diamonds to tell debeers to fuck off.",
            "title_similarity": "0.50274837",
            "sentiment_compound": 0.1935
        },
        {
            "id": "gwwstp5",
            "score": 2,
            "text": "Our species can be so fucking stupid sometimes. It's a fucking piece of coal and [Diamonds aren't special. Neither is your ring.](https://www.theatlantic.com/family/archive/2021/01/diamonds-arent-special-and-neither-is-your-love/617859/)",
            "title_similarity": "0.60926056",
            "sentiment_compound": -0.7375
        },
        {
            "id": "gwwtu7t",
            "score": 2,
            "text": "When lab made diamonds first hit the market, pawn shops and jewelers lost millions.\n\nHow do they determine if a diamond is lab created in modern times?\n\nLab created diamonds are too perfect and pretty, compared to their natural counterparts. The less pretty and perfect diamonds are worth many many times more. \n\n*Diamonds are worthless.*\n\nThis is why I say the diamond business is an absolute and complete scam, and any heist movie featuring diamonds is laughable.\n\nDon't even get me started on \"chocolate diamond jewelry,\" AKA, companies selling you shit grade diamonds at premium prices and laughing at you for it.",
            "title_similarity": "0.5727358",
            "sentiment_compound": 0.9475
        },
        {
            "id": "gwwul23",
            "score": 2,
            "text": "Diamonds are already worthless, these synthetic ones will be more pure than their natural counterparts. Diamonds should get insanely cheap",
            "title_similarity": "0.6270784",
            "sentiment_compound": -0.1027
        },
        {
            "id": "gwwyaws",
            "score": 2,
            "text": "Great. So we can start selling them for prices that they are actually worth.\n\nIts like. What. 50¢ worth of carbon and maybe 50$ worth of labour including over head.\n\nSo we should expect barbies accessories to start containing the real thing any day now.\n\n\nOh. Wait. They still wanna mark them up 5000%\n\nNever mind.",
            "title_similarity": "0.4855047",
            "sentiment_compound": 0.8834
        },
        {
            "id": "gwwz6fs",
            "score": 2,
            "text": "Don't expect any discounts... useless item for vain people.",
            "title_similarity": "0.46302897",
            "sentiment_compound": -0.6808
        },
        {
            "id": "gwx0eaf",
            "score": 2,
            "text": "The whole diamond obsession is ridiculous at this point.",
            "title_similarity": "0.34479663",
            "sentiment_compound": -0.3612
        },
        {
            "id": "gwx2jvq",
            "score": 2,
            "text": "[deleted]",
            "title_similarity": "0.31953087"
        },
        {
            "id": "gwx71gl",
            "score": 2,
            "text": "Artificial stones are generally a better quality anyways. Cheaper, better product which doesn't risk encouraging slavery? Sign me up!",
            "title_similarity": "0.36650342",
            "sentiment_compound": 0.8378
        },
        {
            "id": "gwx7i9v",
            "score": 2,
            "text": "Good. We need a massive cultural shift to stop this obsession with this terrible rock. And with displays of ostentatious wealth as a whole.",
            "title_similarity": "0.45457205",
            "sentiment_compound": -0.2382
        },
        {
            "id": "gwxdh0o",
            "score": -2,
            "text": "So.... fake diamonds?",
            "title_similarity": "0.42019814",
            "sentiment_compound": -0.4767
        },
        {
            "id": "gww097z",
            "score": 27,
            "text": "They are going to focus on Unobtanium.",
            "title_similarity": "0.4709786",
            "sentiment_compound": 0.0
        },
        {
            "id": "gww3idt",
            "score": -9,
            "text": "In another story Peoples jeweler's will no longer be offering gold but instead gold foil wrapped chocolate.",
            "title_similarity": "0.69234896",
            "sentiment_compound": -0.1531
        },
        {
            "id": "gww8sdd",
            "score": 3,
            "text": "Not surprised. The Na'vi have never been fans of resource extraction.",
            "title_similarity": "0.5243839",
            "sentiment_compound": -0.1695
        },
        {
            "id": "gwwenu6",
            "score": 4,
            "text": "Honestly I’m glad. I dislike social pressure to purchase overpriced translucent rocks. My spouse still doesn’t accept lab made gems as any good and sees them as inferior. I want that mentality to change and mainstream jewelry retailers can shape that.",
            "title_similarity": "0.6039196",
            "sentiment_compound": 0.6486
        },
        {
            "id": "gwwetde",
            "score": 3,
            "text": "Moissanite is way better anyway",
            "title_similarity": "0.121659644",
            "sentiment_compound": 0.4404
        },
        {
            "id": "gwwg8ee",
            "score": 4,
            "text": "Feels bad for all the clown rappers dropping millions on ugly ass chains.",
            "title_similarity": "0.33526045",
            "sentiment_compound": -0.8834
        },
        {
            "id": "gwwikxd",
            "score": 4,
            "text": "TIL Pandora sold diamonds. Thought they just sold overpriced trinkets/bracelets \n\nHow much will they lower the price by to reflect much cheaper lab grown diamonds?",
            "title_similarity": "0.56271875",
            "sentiment_compound": -0.296
        },
        {
            "id": "gwwizzm",
            "score": 3,
            "text": "Lab made diamonds are great. My ring has them and always gets compliments. Most people won’t be able to tell without a microscope.",
            "title_similarity": "0.3979364",
            "sentiment_compound": 0.7783
        },
        {
            "id": "gwwjg69",
            "score": 2,
            "text": "Pandora is the beanie babies of tacky costume jewelry.",
            "title_similarity": "0.30818534",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwwjy8y",
            "score": -3,
            "text": "This kind of takes the heart and soul out of it all. Part of gifting someone a diamond is understanding the great sacrifices behind it. I’m sorry but lab-grown just doesn’t embody what a diamond truly means to those you love most.",
            "title_similarity": "0.56895524",
            "sentiment_compound": 0.961
        },
        {
            "id": "gwwsub8",
            "score": 2,
            "text": "I can’t wait for De Beers to finally produce beer",
            "title_similarity": "0.38124162",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwwxrih",
            "score": 2,
            "text": "When diamonds are man-made in a lab, it shouldn't deserve to be expensive.",
            "title_similarity": "0.5243987",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwwcs2o",
            "score": 47,
            "text": "I dont get pandora appeal at all. Very overpriced and didnt't even know they sold diamond jewelry at all. I am sure switch is cost motivated.",
            "title_similarity": "0.5843312",
            "sentiment_compound": 0.7717
        },
        {
            "id": "gwwarcr",
            "score": 128,
            "text": "Lab diamonds aren’t that much cheaper than “real diamonds” the FTC stated they are chemically identical and therefore lab diamonds ARE diamonds",
            "title_similarity": "0.58463717",
            "sentiment_compound": 0.0
        },
        {
            "id": "gww0sav",
            "score": 12,
            "text": "This is the best tl;dr I could make, [original](https://www.bbc.co.uk/news/business-56972562) reduced by 91%. (I'm a bot)\n*****\n> The world&#039;s biggest jeweller, Pandora, says it will no longer sell mined diamonds and will switch to exclusively laboratory-made diamonds.\n\n> For the World Diamond Council, which represents the mined diamond industry, lab-made diamonds are not the answer.\n\n> The WDC adds that for people living in artisanal and small-scale diamond mining communities stopping the mining of diamonds &quot;Would remove a primary source of income&quot; and &quot;Would have devastating impacts on their livelihoods, causing poverty and further unrest&quot;.\n\n\n*****\n[**Extended Summary**](http://np.reddit.com/r/autotldr/comments/n4km1m/pandora_will_no_longer_sell_mined_diamonds_and/) | [FAQ](http://np.reddit.com/r/autotldr/comments/31b9fm/faq_autotldr_bot/ \"Version 2.02, ~574754 tl;drs so far.\") | [Feedback](http://np.reddit.com/message/compose?to=%23autotldr \"PM's and comments are monitored, constructive feedback is welcome.\") | *Top* *keywords*: **diamond**^#1 **mined**^#2 **Pandora**^#3 **year**^#4 **more**^#5",
            "title_similarity": "0.70519984",
            "sentiment_compound": 0.6908
        },
        {
            "id": "gww40p3",
            "score": -13,
            "text": "[deleted]",
            "title_similarity": "0.3195309"
        },
        {
            "id": "gww79wu",
            "score": -14,
            "text": "Weird concept , jewellery , like decorating a Christmas tree. Look at me , I sparkle . Twat.",
            "title_similarity": "0.24927492",
            "sentiment_compound": -0.2023
        },
        {
            "id": "gwwadi1",
            "score": -14,
            "text": "Why would anyone buy “fake” diamonds produced in a lab?",
            "title_similarity": "0.58704984",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwwpsg3",
            "score": -4,
            "text": "Welp, no buying Pandora anymore",
            "title_similarity": "0.6132095",
            "sentiment_compound": -0.296
        },
        {
            "id": "gwwrwpp",
            "score": 5,
            "text": "Diamonds are not rare. Diamonds are hoarded to drive the price up.",
            "title_similarity": "0.43294182",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwwulhv",
            "score": -5,
            "text": "Eurrgh, i dont want no fake ass diamonds.",
            "title_similarity": "0.5823499",
            "sentiment_compound": 0.1225
        },
        {
            "id": "gwxtrji",
            "score": -4,
            "text": "Im sick of everything being made in a lab. I don't trust any of those people. Idc about diamonds but if we keep going on like this then everything is going to be made inside a lab and nothing is going to be real anymore. Its all fake bullshit.",
            "title_similarity": "0.62215674",
            "sentiment_compound": -0.8779
        },
        {
            "id": "gww79oc",
            "score": 15,
            "text": "Didn’t even know they ever sold the real thing",
            "title_similarity": "0.44631428",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwx54wt",
            "score": 5,
            "text": "Both my wife and I came from poor upbringing, so when we decided to get married, she told she didn’t want a diamond engagement ring. To her a diamond is just another god damn rock. Being happily married 39 years this August.",
            "title_similarity": "0.50669193",
            "sentiment_compound": 0.7906
        },
        {
            "id": "gwwhvd1",
            "score": 16,
            "text": "So they went from overcharging for blood diamonds to massively overcharging for synthetic stuff.",
            "title_similarity": "0.48962367",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwwhfhk",
            "score": 7,
            "text": "Recently got engaged and bought a lab created diamond.  It looks great and my fiancé loves that it wasn’t mined.  Hopefully perception on lab v mined will continue to change.  This is good overall I think.",
            "title_similarity": "0.50091946",
            "sentiment_compound": 0.9612
        },
        {
            "id": "gww8dz9",
            "score": 168,
            "text": "[deleted]",
            "title_similarity": "0.3195309"
        },
        {
            "id": "gwwgkjy",
            "score": 63,
            "text": "Fun fact! You know how the company De Beers have artificially inflated the value of mined diamonds by controlling ~~80%~~ (Edit: sorry, I mistakenly skipped over the “historically” that applied to 80%. I’m struggling to find exact figures but it seems they’re closer to 35%. Sorry about that :/) of the supply? And how people are turning against their horrible practices by buying lab-grown diamonds? Well De Beers also knows! And that’s why De Beers is opening factories to make diamonds\n\nSecond fun fact! You know how a lot of people buying lab grown diamonds are also doing it because it’s much cheaper? De Beers also knows! And that’s why they’re using the cash from their almost monopoly (see edit. Still rich though) to be able to undercut other diamond manufacturers.\n\nBecause that way you’re either buying a mined diamond (most likely from De Beers) or you’re buying a lab grown diamond (and unless you want to spend five times as much for the same diamond, very likely from De Beers)\n\nAs a caveat, they don’t yet sell lab grown engagement rings. So yay! They’ll be able to make even more of a profit down the line!\n\nEdit to include sources:\n\n[“Lab-made diamonds for less: Why De Beers' plan worries rivals”](https://m.economictimes.com/markets/commodities/news/lab-made-diamonds-for-less-why-de-beerss-plan-worries-rivals/amp_articleshow/65674785.cms), The Economic Times, 2018\n\n[“De Beers to Sell Diamonds Made in a Lab”](https://www.bloomberg.com/news/articles/2018-05-29/de-beers-is-said-to-make-u-turn-by-selling-man-made-diamonds), Bloomberg, 2018\n\n[“De Beers will manufacture up to 400,000 ‘lab-grown’ diamonds in new Gresham factory”](https://www.oregonlive.com/business/2020/10/gresham-factory-will-manufacture-up-to-400000-diamonds-a-year-for-de-beers-will-people-want-them.html), Oregon Live, updated 2020",
            "title_similarity": "0.4872094",
            "sentiment_compound": 0.9863
        },
        {
            "id": "gwx23cx",
            "score": 10,
            "text": "Let’s be the generation that ends this 3 month salary for an unremarkable rock bullshit",
            "title_similarity": "0.44946694",
            "sentiment_compound": -0.5859
        },
        {
            "id": "gwwbm22",
            "score": 130,
            "text": "Well, my good man, you’ll see none of my business if the diamonds are not millions of years old & excavated by the underclass! 🎩",
            "title_similarity": "0.60182637",
            "sentiment_compound": 0.7263
        },
        {
            "id": "gwwwfe0",
            "score": 139,
            "text": "Okay I’m sorry but laboratory created Diamonds aren’t real diamonds. How am I supposed to enjoy my marriage if no african children died during my engagement ring’s production?",
            "title_similarity": "0.6495829",
            "sentiment_compound": 0.5267
        },
        {
            "id": "gwvyczx",
            "score": 553,
            "text": "Largest Jeweller in the world, will make the diamonds in the UK.",
            "title_similarity": "0.3554231",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwwjaof",
            "score": 1026,
            "text": "My engagement ring is moissanite and literally NO ONE can tell and I get so many compliments on it. \n\nUNTIL I tell them “thanks, it was only a few hundred dollars because it’s synthetic!” Then all of a sudden there’s problems with the purity, cut, flash, whatever. I think natural diamond lovers are getting insecure that their gems are no longer distinguished compared to lab grown gems. \n\nRegardless, I still love my moissanite. I have a gem as big as my knuckle and didn’t have to gaslight my fiancé into spending thousands for it.",
            "title_similarity": "0.5465983",
            "sentiment_compound": 0.7928
        },
        {
            "id": "gwwoh46",
            "score": 17,
            "text": "This is why I'm glad I use Spotify.",
            "title_similarity": "0.0993864",
            "sentiment_compound": 0.4588
        },
        {
            "id": "gww5y6s",
            "score": 606,
            "text": "I’m a moron and for a split second thought this was about the streaming music service.",
            "title_similarity": "0.35444495",
            "sentiment_compound": -0.4939
        },
        {
            "id": "gwwi1jv",
            "score": 21,
            "text": ">But for the World Diamond Council (WDC), which represents the mined diamond industry, lab-made diamonds are not the answer [to the trade in blood and slave-mined diamonds].\n\n>It says any suggestion they \"would have a role in preventing trade in conflict diamonds is spurious and not based on fact\".\n\nRight. Why, after all, would the World Diamond Council have any role in setting labor and ethical standards for diamond mining and trading? A completely absurd idea, whatever were we thinking?",
            "title_similarity": "0.66359967",
            "sentiment_compound": 0.9338
        },
        {
            "id": "gwvztil",
            "score": 850,
            "text": "I guess this will increase the elite status of luxury brands like Harry Winston that own their own mine in Canada.",
            "title_similarity": "0.37111267",
            "sentiment_compound": 0.5859
        },
        {
            "id": "gwwe8fx",
            "score": 2443,
            "text": "This is great and all but as someone who used to work there, 99% of the jewelry is cubic zirconia already. There was only diamonds in a handful of charms or rings and they were just chips",
            "title_similarity": "0.53764665",
            "sentiment_compound": 0.7506
        },
        {
            "id": "gww5r01",
            "score": 16284,
            "text": "> He said the firm was pursuing it because \"it's the right thing to do\". \n\nUh-huh.\n> They are also cheaper.\n\nThere we go.",
            "title_similarity": "0.22420256",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwx29fd",
            "score": 40,
            "text": "Damn, what about people who *want* blood diamonds? My gf won't accept a ring unless someone murdered their whole family for it. She has standards",
            "title_similarity": "0.5253826",
            "sentiment_compound": -0.8395
        },
        {
            "id": "gwwmjbj",
            "score": 926,
            "text": "[deleted]",
            "title_similarity": "0.3195309"
        },
        {
            "id": "gwwahfo",
            "score": 5726,
            "text": "A sign never ever seen in a Jewelry store window:\n\nDIAMONDS: SOLD OUT",
            "title_similarity": "0.5835634",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwwq4i2",
            "score": 358,
            "text": "Meanwhile, Spotify continues to deal in blood diamonds.",
            "title_similarity": "0.38436246",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwwc7o0",
            "score": 1588,
            "text": "Can other stones like ruby, sapphire, emerald (anything colored) also be made in a lab? Or only diamond because its only carbon?",
            "title_similarity": "0.6086211",
            "sentiment_compound": 0.644
        },
        {
            "id": "gwwejex",
            "score": 14454,
            "text": "\"But for the World Diamond Council (WDC), which represents the mined diamond industry, lab-made diamonds are not the answer.\"\n\nThe turkeys say Christmas is not the answer",
            "title_similarity": "0.6142913",
            "sentiment_compound": 0.7351
        },
        {
            "id": "gww1l06",
            "score": 1,
            "text": "Shitty diamonds for a shitty company LOL",
            "title_similarity": "0.39841712",
            "sentiment_compound": -0.5672
        },
        {
            "id": "gwwanu9",
            "score": 1,
            "text": "this is just now happening?!?",
            "title_similarity": "0.11323126",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwwcbtl",
            "score": 1,
            "text": "What is DeBeers gonna do?",
            "title_similarity": "0.21992375",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwwcffr",
            "score": 1,
            "text": "until i saw the subreddit i thought this would be some weird Borderlands joke... i am not a smart man.",
            "title_similarity": "0.35896063",
            "sentiment_compound": -0.1921
        },
        {
            "id": "gwwdg1b",
            "score": 1,
            "text": "Great, now they can make them cheaper too since diamonds are actually very common and not scarce at all?",
            "title_similarity": "0.40318805",
            "sentiment_compound": 0.6249
        },
        {
            "id": "gwwdmrh",
            "score": 1,
            "text": "This is the start of something big- and good.",
            "title_similarity": "0.05609475",
            "sentiment_compound": 0.4404
        },
        {
            "id": "gwwdsjt",
            "score": 1,
            "text": "Whooptee woo",
            "title_similarity": "0.037582275",
            "sentiment_compound": 0.4767
        },
        {
            "id": "gwwe4p1",
            "score": 1,
            "text": "It would be cool to see these companies start making moissanite more mainstream. It has a nicer dazzle and is also an economical alternative",
            "title_similarity": "0.23921856",
            "sentiment_compound": 0.6369
        },
        {
            "id": "gwwe75p",
            "score": 1,
            "text": "Well, there’s some good news",
            "title_similarity": "-0.05166525",
            "sentiment_compound": 0.6124
        },
        {
            "id": "gwwea78",
            "score": 1,
            "text": "This is the way!",
            "title_similarity": "0.085846566",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwweags",
            "score": 1,
            "text": "What does that mean about cost?",
            "title_similarity": "0.052228004",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwwedd0",
            "score": 1,
            "text": "I mean, good, I guess.\n\nI remember shopping for rings, and you should have seen how many diamonds looked like TV static.\n\nUh, no, that thing isn't done being coal-- you should have left that one in the crushing pressure and heat for another few hundred years, buddy.",
            "title_similarity": "0.6262408",
            "sentiment_compound": 0.1779
        },
        {
            "id": "gwwei1a",
            "score": 1,
            "text": "Really happy to hear this. I was planning on buying an engagement ring relatively soon, but the whole diamond industry turned me off because of the ethics behind mining. This is a big boost for me to buy a real diamond (rather than another gemstone or moissanite)",
            "title_similarity": "0.5928701",
            "sentiment_compound": 0.9224
        },
        {
            "id": "gwwepsf",
            "score": 1,
            "text": "I don't think Lab created diamonds are bad",
            "title_similarity": "0.4420501",
            "sentiment_compound": -0.6416
        },
        {
            "id": "gwweqj1",
            "score": 1,
            "text": "It’s funny that now that there’s an alternative it’s suddenly the right thing to do. But until now they didn’t have any problems financing the diamond cartels.",
            "title_similarity": "0.51774687",
            "sentiment_compound": 0.128
        },
        {
            "id": "gwweyx0",
            "score": 1,
            "text": "OOOh, at their price point, a non-issue. They only sold kinda diamonds, kinda coal.",
            "title_similarity": "0.62011516",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwwf0vz",
            "score": 1,
            "text": "Wait until people go and sell them back! Worth noting",
            "title_similarity": "0.36801273",
            "sentiment_compound": 0.2942
        },
        {
            "id": "gwwf2zk",
            "score": 1,
            "text": "*sad steve noises*",
            "title_similarity": "0.15290356",
            "sentiment_compound": -0.4767
        },
        {
            "id": "gwwfhhp",
            "score": 1,
            "text": "It’s about time!",
            "title_similarity": "0.08530931",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwwfmey",
            "score": 1,
            "text": "Diamonds are worthless",
            "title_similarity": "0.5474027",
            "sentiment_compound": -0.4404
        },
        {
            "id": "gwwfo08",
            "score": 1,
            "text": "Guess I'll buy Pandora if my wife ever gives a shit about jewelry",
            "title_similarity": "0.56228775",
            "sentiment_compound": -0.5574
        },
        {
            "id": "gwwfuuw",
            "score": 2,
            "text": "These “diamonds” have been around for years and years in the engagement market, I remember when I was getting engaged going on 11 years ago now, women were raving about their lab diamonds that their fiancé got them, they were just as sparky and pretty as the next but at a fraction of the cost and without buying into blood diamonds, so it felt more ethical.\n\nSo the concept of these is nothing new but the fact is, there will always be a market for “real” diamonds, and may even up the attraction of them now it’s become more mainstream. \n\nThese are REAL diamonds will become the quote. Just like anything else, you can buy a product (tv, sound system, car etc) but the status of having the best to keep up with the Jones is never going away sadly. It’s just human nature.",
            "title_similarity": "0.4983353",
            "sentiment_compound": 0.9796
        },
        {
            "id": "gwwfxuo",
            "score": 54,
            "text": "How ironic. I remember well over a decade ago when lab diamonds started being sold to consumers and the \"industry\" definitely labeled them as fake.",
            "title_similarity": "0.5852852",
            "sentiment_compound": 0.0516
        },
        {
            "id": "gwwg1rt",
            "score": 1,
            "text": "If I'd tell you \"there is a stock with a price-to-earnings ratio twice as high as it's competitors that heavily buys back it's own stock to keep the price up\" would you buy that stock?\n\nOnly in this case it's diamonds vs  other jewels and the company is De Beers.\n\nGet a lab diamond or white saphire instead. Diamonds are a scam.",
            "title_similarity": "0.42964932",
            "sentiment_compound": 0.1779
        },
        {
            "id": "gwwgaxw",
            "score": 2,
            "text": "\\>low carbon business\n\nNot exactly.",
            "title_similarity": "0.25832215",
            "sentiment_compound": -0.2732
        },
        {
            "id": "gwwgk55",
            "score": 1,
            "text": "This should cause diamond prices to drop significantly but it won't....Im still glad to see maybe this will cut out a lot of slave labor in other countries..",
            "title_similarity": "0.5160018",
            "sentiment_compound": -0.6927
        },
        {
            "id": "gwwgore",
            "score": 3,
            "text": "They also make a MUCH BIGGER profit margin.",
            "title_similarity": "0.11981222",
            "sentiment_compound": 0.4404
        },
        {
            "id": "gwwgvuc",
            "score": 2,
            "text": "The trick is getting people to believe diamonds in the market were  never lab made.",
            "title_similarity": "0.6735188",
            "sentiment_compound": -0.0516
        },
        {
            "id": "gwwgy4d",
            "score": 2,
            "text": "Baffles me we still put value in compressed carbon that is not rare or expensive.",
            "title_similarity": "0.22701386",
            "sentiment_compound": 0.34
        },
        {
            "id": "gwwh02a",
            "score": 1,
            "text": "Real diamond prices are strictly articficially controlled. This is just a move by them to keep the price where they want to, long term. Don’t have to worry when the real diamond price crashes. If we let everyone mine diamonds and flood the market they’d be nearly worthless.",
            "title_similarity": "0.6460441",
            "sentiment_compound": -0.1779
        },
        {
            "id": "gwwh15x",
            "score": 1,
            "text": "They don’t sell real jewelry, why use real diamonds?",
            "title_similarity": "0.6268175",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwwh1sv",
            "score": 1,
            "text": "Do the younger generations have any interest in purchasing diamonds? I can imagine their value will go down a lot at some point.",
            "title_similarity": "0.50263524",
            "sentiment_compound": 0.6597
        },
        {
            "id": "gwwh1uz",
            "score": 1,
            "text": "Great another Swarovski is born",
            "title_similarity": "0.21190965",
            "sentiment_compound": 0.6249
        },
        {
            "id": "gwwh4ur",
            "score": 1,
            "text": "Now Nike and apple need to make products off American labor to follow suit.",
            "title_similarity": "0.50904995",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwwh9uq",
            "score": 1,
            "text": "So pushing the price of mined diamonds sky high in turn making them a bigger prophet sounds a bit fishy to me and lab made diamonds are not worth anything.",
            "title_similarity": "0.53924835",
            "sentiment_compound": -0.1695
        },
        {
            "id": "gwwhgbi",
            "score": 1,
            "text": "They either ran out of diamonds to mine or the children refused to do the work anymore",
            "title_similarity": "0.6330105",
            "sentiment_compound": -0.296
        },
        {
            "id": "gwwhhjb",
            "score": 1,
            "text": "No wonder Atlas went out of business.",
            "title_similarity": "0.47003546",
            "sentiment_compound": -0.296
        },
        {
            "id": "gwwhlgz",
            "score": 1,
            "text": "Me a",
            "title_similarity": "0.040037367",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwwhoo3",
            "score": 3,
            "text": "I had no idea Pandora even used diamonds in their jewelry... always seemed like cheap junk",
            "title_similarity": "0.59106654",
            "sentiment_compound": 0.0772
        },
        {
            "id": "gwwhosl",
            "score": 1,
            "text": "Stocks gonna tank.",
            "title_similarity": "0.15946338",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwwht8b",
            "score": 2,
            "text": "Why make something when you can fake it instead.\n\nDiamonds are phony anyway. Let me know when they can make gold.",
            "title_similarity": "0.5976712",
            "sentiment_compound": -0.4767
        },
        {
            "id": "gwwhwhc",
            "score": 3,
            "text": "If we can make these in a lab, there should be no more thousands of dollar diamonds.",
            "title_similarity": "0.71384096",
            "sentiment_compound": -0.296
        },
        {
            "id": "gwwi2rg",
            "score": 1,
            "text": "Alright, alright, alriiight. The operational cost just keeps getting cheaper but the customer facing price stays the same.",
            "title_similarity": "0.2305875",
            "sentiment_compound": 0.25
        },
        {
            "id": "gwwi5c1",
            "score": 1,
            "text": "Too little. Too late. Fuck your entire stupid industry.",
            "title_similarity": "0.42269537",
            "sentiment_compound": -0.7675
        },
        {
            "id": "gwwid7d",
            "score": 3,
            "text": "Diamond industry is due for a crash.  They’re not rare they’re not particularly special.  You want a fancy gemstone?  Get a lab grown one, they’re better in just about every way.  You want diamond dust for sandpaper, files, tooling, etc...use mined diamonds, they’re better for that purpose and don’t need to be any particular quality, clarity, color, etc.",
            "title_similarity": "0.62644976",
            "sentiment_compound": 0.8397
        },
        {
            "id": "gwwij64",
            "score": 1,
            "text": "Maybe they can cut down on the spanish commercials on my station too",
            "title_similarity": "0.50884205",
            "sentiment_compound": -0.2732
        },
        {
            "id": "gwwikvh",
            "score": 1,
            "text": "TIL Pandora sells diamond products. I thought their whole thing was crystal glass.",
            "title_similarity": "0.50185466",
            "sentiment_compound": 0.34
        },
        {
            "id": "gwwirrg",
            "score": 1,
            "text": "Love it.",
            "title_similarity": "-0.040961187",
            "sentiment_compound": 0.6369
        },
        {
            "id": "gwwisuf",
            "score": 1,
            "text": "3d printing diamonds",
            "title_similarity": "0.40878677",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwwit7m",
            "score": 1,
            "text": "If it means a more ethical product then it should be welcomed. I'm not sure they should be seen as equal to the value of a mined diamond though.",
            "title_similarity": "0.4333737",
            "sentiment_compound": 0.833
        },
        {
            "id": "gwwixhx",
            "score": 1,
            "text": "Take notes, minecraft! I don't want any more slaving away in the mines if I can synthetically produce better diamonds for cheaper!",
            "title_similarity": "0.6536846",
            "sentiment_compound": 0.5043
        },
        {
            "id": "gwwiybl",
            "score": 1,
            "text": "Will they pass the savings on the customer? Nope",
            "title_similarity": "0.32483053",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwwiyem",
            "score": 2,
            "text": "So they went from overcharging for blood diamonds to overcharging for synthetic things.",
            "title_similarity": "0.53305006",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwwj2cs",
            "score": 3,
            "text": "I'm not sure what took them so long. I'd rather pay extra for cheaper lab made diamonds than buy a slavery diamond. The same goes for electric cars vs. carbon emitting ones, vegan meat over factory farmed meat, vegan leather over real leather, tap water over bottled water, etc.\n\nAlso, here is a great article from 1982 about how much a scam diamonds are: https://www.theatlantic.com/magazine/archive/1982/02/have-you-ever-tried-to-sell-a-diamond/304575/",
            "title_similarity": "0.5451663",
            "sentiment_compound": -0.6555
        },
        {
            "id": "gwwj5hv",
            "score": 1,
            "text": "The only problem I ever had with lab grown was getting it insured. For some silly reason the major jewelry insurance companies don’t value them the same regardless of chemistry being equivalent.",
            "title_similarity": "0.6351135",
            "sentiment_compound": -0.0516
        },
        {
            "id": "gwwj7ez",
            "score": 1,
            "text": "So will diamonds be cheaper or still artificially inflated to customers?",
            "title_similarity": "0.39874664",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwwj8s1",
            "score": 1,
            "text": "thousands of minecrafters out of job god damn it ....",
            "title_similarity": "0.26088798",
            "sentiment_compound": -0.1531
        },
        {
            "id": "gwwj90r",
            "score": 1,
            "text": "So the prices will drop significantly as well of course? Yeah didn't think so.",
            "title_similarity": "0.4016655",
            "sentiment_compound": 0.296
        },
        {
            "id": "gwwjb9l",
            "score": 1,
            "text": "Good. I don’t care if they’re only doing it because it’s cheaper. Fuck “real” diamonds and the people who own diamond mines. Younger generations don’t need or want the shit you’re slinging. Go back to school for HVAC or something and leave the local populations alone. \n\nI don’t know how this will change the economies of the local populations of people who do the mining, but I hope they’re able to recover and find different ways to generate income. They shouldn’t have to be stuck in these asymmetric and abusive relationships with the blood diamond dealers.",
            "title_similarity": "0.6095214",
            "sentiment_compound": 0.296
        },
        {
            "id": "gwwjd6i",
            "score": 1,
            "text": "Aren't they little late on this???? Wasn't blood diamond made like 15 years ago? Better late than never is their logic, right?",
            "title_similarity": "0.41970462",
            "sentiment_compound": 0.6513
        },
        {
            "id": "gwwjdaa",
            "score": 1,
            "text": "It will still be stupid to buy them, but at least it won’t be evil",
            "title_similarity": "0.35443068",
            "sentiment_compound": -0.8519
        },
        {
            "id": "gwwjftj",
            "score": 1,
            "text": "Bet their prices won't come down, though.",
            "title_similarity": "0.30471304",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwwjh4h",
            "score": 1,
            "text": "Mustve figured out slave labour isnt popular.",
            "title_similarity": "0.50966734",
            "sentiment_compound": -0.3252
        },
        {
            "id": "gwwjh6t",
            "score": 1,
            "text": "How would anyone tell the difference?",
            "title_similarity": "0.2043629",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwwjkm4",
            "score": 1,
            "text": "> ask how come you need to enter anyways",
            "title_similarity": "0.24457483",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwwjks5",
            "score": 1,
            "text": "Not Bad",
            "title_similarity": "-0.015764203",
            "sentiment_compound": 0.431
        },
        {
            "id": "gwwjqno",
            "score": 1,
            "text": "People still buy diamonds?",
            "title_similarity": "0.40454233",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwwjqq9",
            "score": 1,
            "text": "Fuck the De Beers family.",
            "title_similarity": "0.3932243",
            "sentiment_compound": -0.5423
        },
        {
            "id": "gwwjt63",
            "score": 1,
            "text": "\"But they're not *real* diamonds then!\" /s",
            "title_similarity": "0.48126766",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwwjtbz",
            "score": 1,
            "text": "So now there is no reason for diamonds to be expensive, right? We can all agree they should cost as much as marbles?",
            "title_similarity": "0.5188767",
            "sentiment_compound": 0.168
        },
        {
            "id": "gwwjtc8",
            "score": 1,
            "text": "That's great but I highly doubt this will make them better than Spotify.",
            "title_similarity": "0.34469134",
            "sentiment_compound": 0.404
        },
        {
            "id": "gwwjtk7",
            "score": 1,
            "text": "Next news: to make lab diamonds you need some special ingredient from bangladesh that people have to pick by hand from the inside of a volcano",
            "title_similarity": "0.56824327",
            "sentiment_compound": 0.7096
        },
        {
            "id": "gwwjy4g",
            "score": 1,
            "text": "Buy cthr",
            "title_similarity": "0.24080646",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwwjzo1",
            "score": 1,
            "text": "Sounds like they will spend more money advertising it than this change will actually cost them as a company.  Corporations suck - ughhh",
            "title_similarity": "0.34429663",
            "sentiment_compound": -0.1027
        },
        {
            "id": "gwwk234",
            "score": 2,
            "text": "So that means artificial diamonds are finally cheaper than natural ones.",
            "title_similarity": "0.43210804",
            "sentiment_compound": 0.3612
        },
        {
            "id": "gwwk38p",
            "score": 1,
            "text": "who needs jewelry when you have looks like mine?",
            "title_similarity": "0.41453537",
            "sentiment_compound": 0.3612
        },
        {
            "id": "gwwk3os",
            "score": 1,
            "text": "Oh cool! So diamonds will be affordable now? Great.",
            "title_similarity": "0.33503908",
            "sentiment_compound": 0.7712
        },
        {
            "id": "gwwk4rc",
            "score": 1,
            "text": "Their jewelry is fug, why is that place popular?",
            "title_similarity": "0.3284065",
            "sentiment_compound": 0.4215
        },
        {
            "id": "gwwk7as",
            "score": 1,
            "text": "Good. Break the De Beers diamond monopoly.",
            "title_similarity": "0.50176656",
            "sentiment_compound": 0.6486
        },
        {
            "id": "gwwk9ye",
            "score": 1,
            "text": "Lab made diamonds are 90% cheaper. But guess what these companies even charge a premium for 100% no blood diamond, no human suffering. So when a real diamond costs $1000, a lab made costs only $100 (yes it's this much cheaper), but they will sell them for $1100!! Greedy bastards!\n\nTipp: Buy lab diamonds of ebay and go to your local trinket smith with a picture of what you want. You get a unique jewelry at a lower cost!",
            "title_similarity": "0.5143616",
            "sentiment_compound": -0.879
        },
        {
            "id": "gwwkaqm",
            "score": 1,
            "text": "Of course they do it. Keep the prices high but sell cheap lab made diamonds.",
            "title_similarity": "0.43088958",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwwkf90",
            "score": 1,
            "text": "If it's not a blood diamond i don't want it",
            "title_similarity": "0.43989247",
            "sentiment_compound": -0.3089
        },
        {
            "id": "gwwkin7",
            "score": 1,
            "text": "If you buy a diamond, you’re already a schmuck so I don’t exactly know what this makes you. A sucker and a schmuck? A schmucker?",
            "title_similarity": "0.5470766",
            "sentiment_compound": -0.3313
        },
        {
            "id": "gwwkk3o",
            "score": 1,
            "text": "Now they will charge even more for a Lab Made Diamond...",
            "title_similarity": "0.47619638",
            "sentiment_compound": 0.34
        },
        {
            "id": "gwwkp6u",
            "score": 1,
            "text": "Can't load the rest of the page other than the first two paragraphs. Did the article mention whether the prices charged to the end buyer would go down?",
            "title_similarity": "0.4545906",
            "sentiment_compound": -0.2023
        },
        {
            "id": "gwwl0hx",
            "score": 1,
            "text": "And people will still go into debt for decades just for this trash.",
            "title_similarity": "0.30501902",
            "sentiment_compound": -0.3612
        },
        {
            "id": "gwwl3ti",
            "score": 2,
            "text": "Are they gonna lower the price?",
            "title_similarity": "0.27551314",
            "sentiment_compound": -0.296
        },
        {
            "id": "gwwl6e8",
            "score": 2,
            "text": "Can't wait to see their prices either not change at all or increase. Even tho lab diamonds are a quarter of the price and value",
            "title_similarity": "0.5676615",
            "sentiment_compound": 0.5719
        },
        {
            "id": "gwwlck6",
            "score": 1,
            "text": "So you are telling me there is a Diamond mining company called Pandora? Avatar 2 is already here.",
            "title_similarity": "0.5425689",
            "sentiment_compound": 0.34
        },
        {
            "id": "gwwlgz5",
            "score": 1,
            "text": "All work steve had been mining and crafting jewelery will now be for naught...",
            "title_similarity": "0.69410247",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwwliiz",
            "score": 1,
            "text": "I don’t understand why so many women line up to buy this stuff...",
            "title_similarity": "0.27686724",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwwltjz",
            "score": 1,
            "text": "Holy shit diamonds are now more worthless than before",
            "title_similarity": "0.50813997",
            "sentiment_compound": -0.7778
        },
        {
            "id": "gwwlzzy",
            "score": 1,
            "text": "Idk.. seems like they are opening a pandoras box",
            "title_similarity": "0.32480583",
            "sentiment_compound": 0.2732
        },
        {
            "id": "gwwm2l9",
            "score": 2,
            "text": "You DO understand the price of Diamonds is totally artificial right, diamonds are NOT rare. Diamond minors mine and KEEP 99.999% of ALL diamonds they find and do not sell them.",
            "title_similarity": "0.65805304",
            "sentiment_compound": -0.2584
        },
        {
            "id": "gwwm37k",
            "score": 2,
            "text": "After they've milked it for all it's worth and now there's too much backlash to ignore.",
            "title_similarity": "0.36502025",
            "sentiment_compound": -0.1531
        },
        {
            "id": "gwwm4s3",
            "score": 2,
            "text": "So would this be like sustainable “farmed” diamonds vs wild-caught diamonds?… should be cheaper I’d assume.",
            "title_similarity": "0.43656838",
            "sentiment_compound": 0.3612
        },
        {
            "id": "gwwm8iu",
            "score": 1,
            "text": "And prices will go up to reflect their good deed s/",
            "title_similarity": "0.07687028",
            "sentiment_compound": 0.4404
        },
        {
            "id": "gwwmb4w",
            "score": 1,
            "text": "My first instinct when I read this headline was pandora the online radio so I was very confused",
            "title_similarity": "0.37601686",
            "sentiment_compound": -0.3804
        },
        {
            "id": "gwwmcb9",
            "score": 1,
            "text": "Why?",
            "title_similarity": "0.07371784",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwwmiog",
            "score": 1,
            "text": "That's good and all, no more conflict diamonds and such but why am I going to pay out the ass for something fabricated in a lab? That's like saying no more killing cows for beef but the beef flavored tofu is going to be the same price. Why? It's cheaper to make tofu than beef.",
            "title_similarity": "0.4493978",
            "sentiment_compound": 0.3921
        },
        {
            "id": "gwwmipw",
            "score": 3,
            "text": "Thought everything in Pandora was fake anyway. Only see this store in shit malls.",
            "title_similarity": "0.5450755",
            "sentiment_compound": -0.7717
        },
        {
            "id": "gwwmoxz",
            "score": 1,
            "text": "I didn't even know they had diamonds. Where can I find them in the app? Do I need premium?",
            "title_similarity": "0.53125596",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwwmxnq",
            "score": 1,
            "text": "Oh yay\n\nI dont buy much jewelry but I've been eyeing a few Pandora rings and this news encourages me towards buying them",
            "title_similarity": "0.5076652",
            "sentiment_compound": 0.7227
        },
        {
            "id": "gwwmzwh",
            "score": 1,
            "text": "Are the artificial diamonds priced less?",
            "title_similarity": "0.47895437",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwwn3af",
            "score": 1,
            "text": "Hmm. Is this why I've been seeing ads for \"natural diamonds\" paid for by the \"diamond council\"?",
            "title_similarity": "0.47427523",
            "sentiment_compound": 0.5994
        },
        {
            "id": "gwwn85u",
            "score": 1,
            "text": "Possibly the worst name for a diamond company ever.",
            "title_similarity": "0.47607702",
            "sentiment_compound": -0.4019
        },
        {
            "id": "gwwnoyu",
            "score": 2,
            "text": "In the world where you can easily make a crystal-clear stone in a lab, clear natural stones are not special. \nGive me a boulder opal, or an emerald with a nice structure and interesting inclusions...",
            "title_similarity": "0.5166582",
            "sentiment_compound": 0.8671
        },
        {
            "id": "gwwnp1y",
            "score": 1,
            "text": "Whelp I guess I’m switching to Spotify.",
            "title_similarity": "0.27515894",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwwnpgq",
            "score": 1,
            "text": "Ok now idk what there margins were before but I'm sure a 99999% markup is not gunna be appropriate now",
            "title_similarity": "0.45285055",
            "sentiment_compound": 0.5187
        },
        {
            "id": "gwwnr3c",
            "score": 6,
            "text": "If there was an industry I wish Millennials and younger generations would get blamed for killing, it's the diamond industry.",
            "title_similarity": "0.60491765",
            "sentiment_compound": -0.5267
        },
        {
            "id": "gwwns2o",
            "score": 2,
            "text": "Lol, they ever sold diamonds? 🧐🧐",
            "title_similarity": "0.43380827",
            "sentiment_compound": 0.4215
        },
        {
            "id": "gwwo1sd",
            "score": 1,
            "text": "I just wanted to listen to some music online, but w/e",
            "title_similarity": "0.33300304",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwwo4x6",
            "score": 1,
            "text": "One gear in the romance industry machine. Prove your love with money. Compare your love to others. In a country where half of these marriages end within 5 years.",
            "title_similarity": "0.28589186",
            "sentiment_compound": 0.9186
        },
        {
            "id": "gwwo9eu",
            "score": 2,
            "text": "Any geologist here who knows if lab made diamonds are as strong as natural diamonds? Just curious since diamonds are used in a variety of cutting tools.",
            "title_similarity": "0.48655707",
            "sentiment_compound": 0.765
        },
        {
            "id": "gwwodmb",
            "score": 2,
            "text": "In other news,  even knowing the horror caused by the diamond industry, dumb or uncaring people in the general population will continue to buy diamonds from any source anyway\n\nThis is nice tho. Since the gen pop rarely ever does anything to fix what's broken, it's always cool to see a company do it for them.\n\nKudos to all those who shed light on the issue to get things to here.\n\nThe gen pop might be crap but some people in the gen pop can make change occur",
            "title_similarity": "0.5595254",
            "sentiment_compound": -0.2382
        },
        {
            "id": "gwwofgl",
            "score": 1,
            "text": "I suspect this comes with a lower price? Not that they're worth anything anyways.",
            "title_similarity": "0.37483013",
            "sentiment_compound": -0.6207
        },
        {
            "id": "gwwotb5",
            "score": 2,
            "text": "Proving once and for all what a worthless and vile business trade diamonds are.",
            "title_similarity": "0.50124824",
            "sentiment_compound": -0.7906
        },
        {
            "id": "gwwow4u",
            "score": 1,
            "text": "Mossanite just needs to become the norm",
            "title_similarity": "0.37623322",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwwp0gt",
            "score": 1,
            "text": "I've bought plenty of their products, but at what point do I just think... it's cubic z with zinc plating and contains no gold or real gems? Isn't that basically dollar store crap at that point?",
            "title_similarity": "0.6336176",
            "sentiment_compound": -0.7622
        },
        {
            "id": "gwwp0jq",
            "score": 1,
            "text": "Does that mean the price of diamonds will diminish?",
            "title_similarity": "0.45826143",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwwp1m6",
            "score": 2,
            "text": "Still will cost an absurd amount. Diamonds aren't scarce, their price is artificial.",
            "title_similarity": "0.51164407",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwwp24u",
            "score": 1,
            "text": "I would expect a price drop but I won’t hold my breath",
            "title_similarity": "0.44485343",
            "sentiment_compound": -0.1406
        },
        {
            "id": "gwwp9er",
            "score": 2,
            "text": "Cool! Now quit artificially inflating the price",
            "title_similarity": "0.4061028",
            "sentiment_compound": 0.3802
        },
        {
            "id": "gwwpd1q",
            "score": 2,
            "text": "So pandora are going to start using dimonds",
            "title_similarity": "0.4401033",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwwppvo",
            "score": 1,
            "text": "Sooo they should be CHEAPER right?",
            "title_similarity": "0.17585734",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwwpupd",
            "score": 1,
            "text": "So does that mean they’ll stop costing so much?",
            "title_similarity": "0.37810934",
            "sentiment_compound": -0.296
        },
        {
            "id": "gwwq13q",
            "score": 1,
            "text": "Rappers: “all my VVS’s engineered”",
            "title_similarity": "0.40920582",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwwq9d3",
            "score": 1,
            "text": "Well diamonds are pretty but if the lab grown ones are identical if not better, why would anyone buy a real diamond? My understanding is you can only tell if it’s a lab one under an eye lenses.",
            "title_similarity": "0.57433337",
            "sentiment_compound": 0.3901
        },
        {
            "id": "gwwqc0k",
            "score": 3,
            "text": "I mean, they could jus stop selling over priced tack full stop",
            "title_similarity": "0.5552303",
            "sentiment_compound": -0.5267
        },
        {
            "id": "gwwqgt4",
            "score": 1,
            "text": "Breaking news",
            "title_similarity": "0.227476",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwwqjd7",
            "score": 2,
            "text": "I’m happy to see this occurring; I’ve been an anti-fan of DeBeers for a long time. \n\nWhen my (now) wife and I talked about marriage and jewelry and such, it wasn’t going to be a first marriage for either of us. She wasn’t stuck on diamonds as a must-have, and she knew how I felt about diamonds, so she was perfectly happy to be surprised with a nice sapphire for an engagement ring. :)",
            "title_similarity": "0.5097087",
            "sentiment_compound": 0.9664
        },
        {
            "id": "gwwqjsq",
            "score": 2,
            "text": "Then their prices should drop…..",
            "title_similarity": "0.4042493",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwwqogb",
            "score": 42,
            "text": "My first reaction to hearing this story: Pandora sold anything with actual diamonds?",
            "title_similarity": "0.49578685",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwwqrq4",
            "score": 2,
            "text": "I have a lab grown sapphire, and get complimented on it regularly. You can't tell it's lab grown unless you're a jeweler. The cost difference was insane.",
            "title_similarity": "0.50096273",
            "sentiment_compound": 0.0258
        },
        {
            "id": "gwwqw0h",
            "score": 1,
            "text": "Is there any negatives with this? I don't see any.",
            "title_similarity": "0.3046229",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwwr0w8",
            "score": 1,
            "text": "First time I've ever heard of Pandora..... Nice ad post....Pandora",
            "title_similarity": "0.32152396",
            "sentiment_compound": 0.4215
        },
        {
            "id": "gwwr8ah",
            "score": 1,
            "text": "Good cause the naavi have been far too long been displaced by the mining.",
            "title_similarity": "0.43899083",
            "sentiment_compound": 0.4404
        },
        {
            "id": "gwwr95j",
            "score": 2,
            "text": "Funny how retailers for decades claimed that lab-made diamonds were just not as good and turned that whole category of diamonds into some kind of taboo.",
            "title_similarity": "0.57659334",
            "sentiment_compound": 0.1265
        },
        {
            "id": "gwwra0p",
            "score": 2,
            "text": "Diamonds are such a scam anyway.",
            "title_similarity": "0.44270188",
            "sentiment_compound": -0.5719
        },
        {
            "id": "gwwrafq",
            "score": 2,
            "text": "First music now diamonds!",
            "title_similarity": "0.3976738",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwwrb9q",
            "score": 1,
            "text": "I’m sure they’ll lower their prices accordingly lol",
            "title_similarity": "0.37081984",
            "sentiment_compound": 0.4404
        },
        {
            "id": "gwwrbql",
            "score": 2,
            "text": "That's great - then they can pass on all the savings to ... themselves.",
            "title_similarity": "0.2955958",
            "sentiment_compound": 0.6249
        },
        {
            "id": "gwwrgzp",
            "score": 1,
            "text": "ABOUT FUCKING TIME PANDORA 🤦🏻‍♀️🤷🏻‍♀️",
            "title_similarity": "0.27363265",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwwrjt6",
            "score": 1,
            "text": "So won’t this make diamonds more valuable? Mined diamonds I mean.",
            "title_similarity": "0.48819095",
            "sentiment_compound": 0.5256
        },
        {
            "id": "gwwrnq0",
            "score": 3,
            "text": ">They are also cheaper: \"We can essentially create the same outcome as nature has created, but at a very, very different price.\"\n\nBut will they actually lower the price of their jewelry?\n\n>The new diamond jewellery will start at £250 ($350). Although diamonds have traditionally only been a very small share of the 100 million pieces Pandora sells worldwide each year, Mr Lacik believes that will be boosted by lower prices.\n\nI have no idea how much it normally costs but that sounds like they are",
            "title_similarity": "0.43741375",
            "sentiment_compound": 0.7556
        },
        {
            "id": "gwwrtz6",
            "score": 1,
            "text": "Are they going to be super cheap in comparison? Mined diamonds are expensive almost entirely artificially.",
            "title_similarity": "0.46188468",
            "sentiment_compound": 0.5994
        },
        {
            "id": "gwwrvta",
            "score": 20,
            "text": "If there are two items that are identical in appearance and (lack of) function, cannot be distinguished even by experts even when they use microscopes, and you still want the one that costs three times as much and relies on human exploitation and environmentally unsound practices: fuck you.",
            "title_similarity": "0.49468213",
            "sentiment_compound": -0.6705
        },
        {
            "id": "gwwrysc",
            "score": 1,
            "text": "Any diamond experts around here? I’m wondering why lab grown diamonds are so close in price to the mines type. Of course there are costs associated with growing them but I can’t imagine they’re comparable to having to search for, mine, secure, and transport diamonds from the earth all the while dealing with foreign governments and multiple levels of taxes.",
            "title_similarity": "0.5398512",
            "sentiment_compound": 0.631
        },
        {
            "id": "gwws1k7",
            "score": 2,
            "text": "Blood diamonds only. Lab diamonds are nerd diamonds",
            "title_similarity": "0.67527026",
            "sentiment_compound": -0.296
        },
        {
            "id": "gwws740",
            "score": 1,
            "text": "Damn millennials.",
            "title_similarity": "0.24649861",
            "sentiment_compound": -0.4019
        },
        {
            "id": "gwwscqd",
            "score": 2,
            "text": "Counterpoint from the Onion:\n\n[Report: Baby Skull Jewelry May Be Linked To Violence](https://www.youtube.com/watch?v=RKccr8g1xCU)",
            "title_similarity": "0.38589",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwwsigh",
            "score": 1,
            "text": "and where does the material to make the artificial diamonds come from again?",
            "title_similarity": "0.57472456",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwwsl67",
            "score": 1,
            "text": "But do you even love her if dozens of children didnt die to procure that stone?",
            "title_similarity": "0.47024938",
            "sentiment_compound": 0.9005
        },
        {
            "id": "gwwsrjj",
            "score": 1,
            "text": "We spent $900 dollars with a local ring maker and he made 2 rings one completely custom with our ragged engagement diamond. Anyone going beyond that is just trying to spend money.",
            "title_similarity": "0.42415103",
            "sentiment_compound": 0.6597
        },
        {
            "id": "gwwswv8",
            "score": 1,
            "text": "Man-made diamonds are way cheaper at scale. So, it won't hurt their bottom line, in fact it might improve it in market where many people are waking up that to the fact that the diamond industry for marriages has always been a scam. \n\nThis is what we call great marketing and PR, under a pretense, and hoping you don't notice with a different spin. Sin e they could have done rhis gears ago, if they really have wanted to. Don't fall for it.",
            "title_similarity": "0.48735267",
            "sentiment_compound": 0.7701
        },
        {
            "id": "gwwt4n3",
            "score": 1,
            "text": "Blood diamonds shine brighter though",
            "title_similarity": "0.2652424",
            "sentiment_compound": 0.3818
        },
        {
            "id": "gwwt7bb",
            "score": 1,
            "text": "Selling CVD diamonds but paying the price of mined diamonds. Watch.",
            "title_similarity": "0.5473632",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwwteeo",
            "score": 1,
            "text": "fuck diamonds",
            "title_similarity": "0.42784655",
            "sentiment_compound": -0.5423
        },
        {
            "id": "gwwtfo2",
            "score": 1,
            "text": "FINALLY!!",
            "title_similarity": "0.07785285",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwwths7",
            "score": 1,
            "text": "Where would I, the average shopper, go to buy a lab diamond. I'd love to buy my wife a nice pair of earrings but if I went to any jeweler I'd find nothing but mined ones",
            "title_similarity": "0.5993581",
            "sentiment_compound": 0.6369
        },
        {
            "id": "gwwtkhy",
            "score": 1,
            "text": "I don’t see the problem consumers wise",
            "title_similarity": "0.27898422",
            "sentiment_compound": 0.1027
        },
        {
            "id": "gwwtm4u",
            "score": 2,
            "text": "Any lady who has wanted a diamond on her finger has supported the blood diamond trade.  \n\n\nIt's not even a secret.",
            "title_similarity": "0.5008453",
            "sentiment_compound": 0.7269
        },
        {
            "id": "gwwtvnh",
            "score": 1,
            "text": "Duh, pandora is twinkle jewelry.  The prices will go down 5% while being \"reaponsible\" and costs will go down 80% with skyrocketing margins.",
            "title_similarity": "0.35458153",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwwu3dz",
            "score": 11,
            "text": "If you really want to impress the wife, mount a 3090.",
            "title_similarity": "0.26794955",
            "sentiment_compound": 0.5799
        },
        {
            "id": "gwwu6fm",
            "score": 1,
            "text": "How can they name themselves Pandora and not sell boxes?",
            "title_similarity": "0.58883667",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwwufax",
            "score": 1,
            "text": "The only thing I mentioned was that I liked a wide band, the rest was up to him.   I love my ring.",
            "title_similarity": "0.30365646",
            "sentiment_compound": 0.7906
        },
        {
            "id": "gwwug96",
            "score": 1,
            "text": "The rich are still prefer those precious blood sweat and tears of hardworking people on their diamonds",
            "title_similarity": "0.31978738",
            "sentiment_compound": 0.7506
        },
        {
            "id": "gwwuugl",
            "score": 2,
            "text": "Cheaper for them, same price for you",
            "title_similarity": "0.14979349",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwwuuqf",
            "score": 1,
            "text": "As if it matters lol. Exploit the poor for a thousand years and then pull of a stunt to look good",
            "title_similarity": "0.35296372",
            "sentiment_compound": 0.3182
        },
        {
            "id": "gwwuzw6",
            "score": 1,
            "text": "That's stupid. What's the point of diamonds then",
            "title_similarity": "0.47633275",
            "sentiment_compound": -0.5267
        },
        {
            "id": "gwwv3bn",
            "score": 1,
            "text": "Carbon Sequestration?",
            "title_similarity": "0.32418886",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwwvdgg",
            "score": 1,
            "text": "Will there be a price change to reflect this?",
            "title_similarity": "0.25742662",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwwvqe8",
            "score": 1,
            "text": "But, Jack needs a pony.",
            "title_similarity": "0.21653152",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwwvx50",
            "score": 1,
            "text": "Remember \n\"Diamonds are forever\"\n- De Beers\n\nAlso remember\n\n  “diamonds are intrinsically worthless.”\n Former De Beers chairman Nicky Oppenheimer",
            "title_similarity": "0.65131015",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwwwcjw",
            "score": 1,
            "text": "Huh",
            "title_similarity": "-0.0240287",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwwwhfx",
            "score": 2,
            "text": "This is the way...",
            "title_similarity": "0.07204454",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwwwmwr",
            "score": 2,
            "text": "it might be important to say that fake and real diamonds have virtually no difference. they are exactly the same thing. the only thing how you can detect a \"real\" diamond is that it has flaws. so the fake diamond is basically superior in every way, yet everyone wants the \"real\" diamond",
            "title_similarity": "0.5798949",
            "sentiment_compound": 0.4741
        },
        {
            "id": "gwwwy6b",
            "score": 2,
            "text": "Fuck DeBeers",
            "title_similarity": "0.27473783",
            "sentiment_compound": -0.5423
        },
        {
            "id": "gwwx7d5",
            "score": 1,
            "text": "I thought Pandora sold unobtainium",
            "title_similarity": "0.52672434",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwwx80b",
            "score": 1,
            "text": "Why?",
            "title_similarity": "0.07371784",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwwxi8j",
            "score": 1,
            "text": "\".... while continuing to charge the same price.\"",
            "title_similarity": "0.16916108",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwwxjsi",
            "score": 1,
            "text": "My uncle made custom jewellery and shared some wisdom (pre-pandemic wisdom). \n\nArtificial diamonds are so good these days that they fool the best experts. Why the hell would you buy a real one? Buy her an artificial stone and 2 tickets to Thailand (or wherever) with the difference. Be honest about that.\n\nThat trip will give you a thousand better memories than the quality of a rock. And if she gets all stuck up about this, RUN AWAY. You just dodged a bullet.\n\nAnd the quality of the artificial rock is actually better than the real version. The lab grown rocks main flaws now is being too perfect.",
            "title_similarity": "0.52642494",
            "sentiment_compound": 0.9659
        },
        {
            "id": "gwwxo42",
            "score": 2,
            "text": "Everybody is always talking about normalizing this or normalizing that, we need to normalize not paying into bullshit like the diamond industry. Engineered scarcity just so you can inflate your narcissism and “flex” on people around you. Fuck outta here.",
            "title_similarity": "0.6205474",
            "sentiment_compound": 0.538
        },
        {
            "id": "gwwxpne",
            "score": 1,
            "text": "I thought they meant the music app at first and I was very confused",
            "title_similarity": "0.33148378",
            "sentiment_compound": -0.3804
        },
        {
            "id": "gwwy0uj",
            "score": 3,
            "text": "Probably a pure money making choice. The spread they will make on lab made diamonds will be far greater than that of real diamonds",
            "title_similarity": "0.4493389",
            "sentiment_compound": 0.3612
        },
        {
            "id": "gwwygo0",
            "score": 2,
            "text": "Shit better be like 100 dollars for a 5 carat rock then",
            "title_similarity": "0.32756194",
            "sentiment_compound": 0.2023
        },
        {
            "id": "gwwykvz",
            "score": 2,
            "text": "They still mining that unobtanium tho.",
            "title_similarity": "0.43243885",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwwymt6",
            "score": 2,
            "text": "I prefer my diamonds to come with blood directly on them.",
            "title_similarity": "0.45792085",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwwypqk",
            "score": 3,
            "text": "moissanite is a thing.  a fraction of the price of diamonds and virtually indistinguishable unless you're an expert at that type of thing.",
            "title_similarity": "0.45260963",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwwz2jd",
            "score": 5,
            "text": "...Pandora sells diamonds?! Where is this in all their cubic zirconia shit",
            "title_similarity": "0.5062913",
            "sentiment_compound": -0.5983
        },
        {
            "id": "gwwz2zz",
            "score": 4,
            "text": "I'm sure they'll pass the savings on to customers. /s",
            "title_similarity": "0.19829431",
            "sentiment_compound": 0.3182
        },
        {
            "id": "gwwzazu",
            "score": 1,
            "text": ">How much longer does the human race.",
            "title_similarity": "0.21097757",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwwzciw",
            "score": 1,
            "text": "Cheap-ass rocks that are cheap to dig up are now cheaper to make.\n\nStill gonna over inflate the price.\n\nBut at least less kids will die in the mines, so that's good!",
            "title_similarity": "0.3902164",
            "sentiment_compound": -0.2451
        },
        {
            "id": "gwwzf3t",
            "score": 1,
            "text": "Man made diamonds dramatically cheaper, so dont act like they are doing for moral reasons.",
            "title_similarity": "0.46431443",
            "sentiment_compound": -0.3343
        },
        {
            "id": "gwwzhgb",
            "score": 2,
            "text": "Precisely at the moment lab diamonds became cheaper\n\nSuch moral leadership",
            "title_similarity": "0.4076997",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwwzkpx",
            "score": 3,
            "text": "I can’t be the only person who first thought “why is a music streaming service selling diamonds?” Right?",
            "title_similarity": "0.5014711",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwwzojc",
            "score": 2,
            "text": "Split second had me confused as hell. What kind of music subscription????",
            "title_similarity": "0.2807447",
            "sentiment_compound": -0.8343
        },
        {
            "id": "gwwzq6x",
            "score": 1,
            "text": "I love my lab created diamond ring. My husband proposed with a cheapy ring from Amazon so we could go together to pick out a lab created diamond ring. He knew I would never wear a mined gemstone, and he wanted me to have something I loved.",
            "title_similarity": "0.59139174",
            "sentiment_compound": 0.9485
        },
        {
            "id": "gwwzsk0",
            "score": 2,
            "text": "if we making these bitches in the laboratory 1) why aren’t all future diamonds the best possible diamonds 2) why the fuck are diamonds expensive? make it $50 for a carat so everyone can be happy",
            "title_similarity": "0.45702603",
            "sentiment_compound": 0.128
        },
        {
            "id": "gwx08xh",
            "score": 1,
            "text": "They'll still find a way to make it unethical",
            "title_similarity": "0.2885208",
            "sentiment_compound": -0.5106
        },
        {
            "id": "gwx0ay1",
            "score": 2,
            "text": "I just love the fact that these man-made diamonds will be worth more",
            "title_similarity": "0.26261082",
            "sentiment_compound": 0.7269
        },
        {
            "id": "gwx0bg9",
            "score": 2,
            "text": "The entire diamond industry is a scam anyway. Artificial scarcity and sky high prices",
            "title_similarity": "0.41758108",
            "sentiment_compound": -0.3182
        },
        {
            "id": "gwx0kag",
            "score": 1,
            "text": "Bruh i read this headline and thought they were talking about the music player and was really confused why pandora radio was selling diamonds.",
            "title_similarity": "0.4876329",
            "sentiment_compound": -0.3804
        },
        {
            "id": "gwx0vtl",
            "score": 1,
            "text": "Bought a lab created diamond engagement ring. Got way more bang for my buck. Someone told me that lab created diamonds had no resale value. Bruh, I'm not buying an engagement ring with plans to sell the ring later. The cost is 100% a sunk cost in my mind.",
            "title_similarity": "0.68247783",
            "sentiment_compound": 0.3987
        },
        {
            "id": "gwx14ct",
            "score": 1,
            "text": "Remember diamonds are not forever, they will eventually turn into graphite as they lose energy.",
            "title_similarity": "0.60893583",
            "sentiment_compound": -0.1531
        },
        {
            "id": "gwx157e",
            "score": 1,
            "text": "Price increases incoming due to...*checks notes* covid I guess.",
            "title_similarity": "0.18152335",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwx1gdr",
            "score": 1,
            "text": "Or you know, just NO diamonds at all.",
            "title_similarity": "0.53850025",
            "sentiment_compound": -0.4466
        },
        {
            "id": "gwx1gut",
            "score": 1,
            "text": "in 6 months... \"Pandora files for chapter 11\"",
            "title_similarity": "0.34559563",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwx1k87",
            "score": 1,
            "text": "Good, they look better anyway and aren't soaked in blood. Not saying Pandora uses blood diamonds, but the whole industry is horrific.",
            "title_similarity": "0.58087844",
            "sentiment_compound": -0.6369
        },
        {
            "id": "gwx1os2",
            "score": 1,
            "text": "Bets on the CEO of Pandora having a fatal shaving accident?",
            "title_similarity": "0.41107816",
            "sentiment_compound": -0.765
        },
        {
            "id": "gwx1ozn",
            "score": 1,
            "text": "What about Minecraft?",
            "title_similarity": "0.32861072",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwx20cn",
            "score": 1,
            "text": "So the prices should decrease also?",
            "title_similarity": "0.36945003",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwx20il",
            "score": 1,
            "text": "Good now I can use the mined diamonds to throw at rich people.",
            "title_similarity": "0.34065837",
            "sentiment_compound": 0.7579
        },
        {
            "id": "gwx22a7",
            "score": 1,
            "text": "So their stuff will now be cheaper? If yes that would be great of no they are just increasing their revenue",
            "title_similarity": "0.19791815",
            "sentiment_compound": 0.6808
        },
        {
            "id": "gwx27f7",
            "score": 2,
            "text": "Another word for “lab grown diamond” is “diamond”, something the mines diamond industry cannot stand",
            "title_similarity": "0.58725786",
            "sentiment_compound": 0.34
        },
        {
            "id": "gwx2iod",
            "score": 5,
            "text": "I hope I'm not the only person that, for a brief second, was confused why an internet music company sold diamonds at all",
            "title_similarity": "0.53413224",
            "sentiment_compound": 0.1531
        },
        {
            "id": "gwx2jd7",
            "score": 2,
            "text": "Pandora sells diamonds??",
            "title_similarity": "0.4356358",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwx2njz",
            "score": 1,
            "text": "This is the way",
            "title_similarity": "0.07533666",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwx2qbk",
            "score": 2,
            "text": "Funny because Lab diamonds are more rare than natural diamonds lol.",
            "title_similarity": "0.453714",
            "sentiment_compound": 0.8158
        },
        {
            "id": "gwx2t3f",
            "score": 2,
            "text": "I thought Unobtanium came from Pandora",
            "title_similarity": "0.5136798",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwx2uy9",
            "score": 1,
            "text": "And charge exactly the same prices?",
            "title_similarity": "0.20965421",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwx2xwt",
            "score": 2,
            "text": "Yea but when will they start making decent playlists?",
            "title_similarity": "0.26337904",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwx325e",
            "score": 1,
            "text": "So not diamonds",
            "title_similarity": "0.43176562",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwx3bx6",
            "score": 1,
            "text": "That's it, I'm getting spotify.",
            "title_similarity": "0.10692583",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwx3e0n",
            "score": 2,
            "text": "Considering they mostly sell sterling silver marked up to ridiculous prices this is the tiniest amount of change and it doesn’t mean they will be cheaper . Just less blood diamonds, yay. A crumb of decency.",
            "title_similarity": "0.51035875",
            "sentiment_compound": 0.1621
        },
        {
            "id": "gwx3g84",
            "score": 1,
            "text": "There is no way a person without formally training can see the difference between a lab diamond and a natural diamond. Even if they could they wouldn't likely think the lab diamond is better.",
            "title_similarity": "0.59891087",
            "sentiment_compound": 0.8555
        },
        {
            "id": "gwx3h8h",
            "score": 1,
            "text": "This is cool news but shame its Pandora, boring and badly made.\nSpend your money with independent jewellery makers. You will get more for your money and a better product. Plus you or the person you're gifting to won't have the same piece of jewellery that a million other people have.",
            "title_similarity": "0.4984787",
            "sentiment_compound": -0.775
        },
        {
            "id": "gwx3heu",
            "score": 1,
            "text": "Women aren’t gonna be happy about this now they won’t be so expensive so now men will have to empty their wallets for them for some overpriced other stuff",
            "title_similarity": "0.40564325",
            "sentiment_compound": 0.4404
        },
        {
            "id": "gwx3jzy",
            "score": 2,
            "text": "Can’t wait for them to drop the price! \n\n/s",
            "title_similarity": "0.3803839",
            "sentiment_compound": -0.3382
        },
        {
            "id": "gwx3neh",
            "score": 3,
            "text": ">He said the firm was pursuing it because \"it's the right thing to do\". \n\nHorseshit, they're pursuing it because DeBeers has a monopoly on the diamond market and artificial diamonds gets Pandora out from under their controlling thumb.",
            "title_similarity": "0.5403074",
            "sentiment_compound": 0.34
        },
        {
            "id": "gwx3po2",
            "score": 3,
            "text": "Diamonds are literally a scheme ran by a small group lol there priced accordingly, and lab grown diamonds are even better than normal diamonds bc you can get super clarity I believe? Plus it’s literally diamonds so it doesn’t make a shit if lab grown or not it’s the same shit with less oil used if you get me",
            "title_similarity": "0.5230891",
            "sentiment_compound": 0.6249
        },
        {
            "id": "gwx3qja",
            "score": 1,
            "text": "I wonder if prices will go down? 🤔",
            "title_similarity": "0.26205766",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwx45u4",
            "score": 1,
            "text": "Jokes on them. My wife and I's rings stay on our dressers most days. We put them on for special occasions but day to day we wear silicone rings. The ring isn't our marriage, it's just a symbol.",
            "title_similarity": "0.49008378",
            "sentiment_compound": 0.3291
        },
        {
            "id": "gwx47wh",
            "score": 1,
            "text": "Honestly good",
            "title_similarity": "-0.042022385",
            "sentiment_compound": 0.7096
        },
        {
            "id": "gwx48ei",
            "score": 1,
            "text": "So my diamond cost 7 cents to make and they charged me how much for it?",
            "title_similarity": "0.40175298",
            "sentiment_compound": 0.2212
        },
        {
            "id": "gwx490l",
            "score": 2,
            "text": "Labs and Moissanite alike are about to have their day in the sun. Wonder if the price of either will shoot up with demand (opportunistically) or shrink even further with an over-saturated market. This is long overdue. Next up will be the campaigns about how this is killing local economies in mining areas as if we have all forgotten about the horrors of earth mining.",
            "title_similarity": "0.5162071",
            "sentiment_compound": -0.9001
        },
        {
            "id": "gwx4923",
            "score": 2,
            "text": "Colored stones are where it’s at anyways. Preferably vintage or antique. Also, fuck Debeers.",
            "title_similarity": "0.42890832",
            "sentiment_compound": -0.5423
        },
        {
            "id": "gwx4ggy",
            "score": 1,
            "text": "say good bye to 6 months of paychecks to lab diamonds",
            "title_similarity": "0.43646935",
            "sentiment_compound": 0.4404
        },
        {
            "id": "gwx4lcy",
            "score": 1,
            "text": "Fine, guess I'm going elsewhere for my blood diamonds from now on.",
            "title_similarity": "0.5793689",
            "sentiment_compound": 0.2023
        },
        {
            "id": "gwx4lgi",
            "score": 2,
            "text": "People still horny for rocks huh?",
            "title_similarity": "0.1793562",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwx4pbq",
            "score": 1,
            "text": "lost so bad to Spotify they're now selling diamonds",
            "title_similarity": "0.5051594",
            "sentiment_compound": -0.7264
        },
        {
            "id": "gwx4qvo",
            "score": 1,
            "text": "I like diamonds personally, but I don't care if they're from a lab or mined.",
            "title_similarity": "0.61707",
            "sentiment_compound": -0.4003
        },
        {
            "id": "gwx4rkv",
            "score": 2,
            "text": "Never, ever, buy a \"real\" diamond for anywhere close to what the market prices it at.  One of the most abundant stones that is only rare because the market makes it rare.",
            "title_similarity": "0.5923817",
            "sentiment_compound": 0.34
        },
        {
            "id": "gwx4wjz",
            "score": 2,
            "text": "AKA: Alright boyz we've sold off the conflict diamonds and made our profit, time to do the right thing!",
            "title_similarity": "0.41271776",
            "sentiment_compound": 0.4389
        },
        {
            "id": "gwx4yxo",
            "score": 2,
            "text": "The question is how long until Spotify follows suit?",
            "title_similarity": "0.20259851",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwx4z4f",
            "score": 1,
            "text": "i really don’t understand why you would buy from pandora unless you are 1) a man buying his girlfriend heart shaped jewellery and you have no idea what you’re doing or 2) you’re 15",
            "title_similarity": "0.45571032",
            "sentiment_compound": 0.4588
        },
        {
            "id": "gwx529q",
            "score": 1,
            "text": "That must be so much more profitable. Are diamonds artificially expensive?",
            "title_similarity": "0.34622312",
            "sentiment_compound": 0.5356
        },
        {
            "id": "gwx52cv",
            "score": 1,
            "text": "I thought pandora was an internet radio site?",
            "title_similarity": "0.2969402",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwx53lw",
            "score": 2,
            "text": "My first thought was “why is a music streaming service dealing in diamonds?”.",
            "title_similarity": "0.46052828",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwx56xp",
            "score": 1,
            "text": "Pandora the music streaming company?",
            "title_similarity": "0.31398845",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwx5gv0",
            "score": 1,
            "text": "Oh no! The economy of my minecraft server's gonna crash!",
            "title_similarity": "0.4544644",
            "sentiment_compound": -0.508
        },
        {
            "id": "gwx5ijs",
            "score": 1,
            "text": "Years too late.",
            "title_similarity": "0.21010011",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwx5l7g",
            "score": 2,
            "text": "Lower their cost 80 percent but will only lower prices by 10 percent. Only people this benefits is the share holders",
            "title_similarity": "0.4083434",
            "sentiment_compound": 0.5267
        },
        {
            "id": "gwx5p9y",
            "score": 1,
            "text": "Wow taking the natural out of the beautiful thing s",
            "title_similarity": "0.36270452",
            "sentiment_compound": 0.8807
        },
        {
            "id": "gwx5sup",
            "score": 1,
            "text": "Do lab made diamonds also belong to De beers like all the mined diamonds seem to?",
            "title_similarity": "0.5756671",
            "sentiment_compound": 0.3612
        },
        {
            "id": "gwx5tgw",
            "score": 1,
            "text": "*and charge just as much or more.",
            "title_similarity": "0.13881946",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwx5xxb",
            "score": 1,
            "text": "So is it cheaper?",
            "title_similarity": "0.08222744",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwx61m4",
            "score": 2,
            "text": "I wonder if they’ll be valued lower because their acquisition required no death or human suffering",
            "title_similarity": "0.48333442",
            "sentiment_compound": 0.1891
        },
        {
            "id": "gwx65e0",
            "score": 1,
            "text": "I have a stack of rembrandt prints for sale. You dummies who dont understand how value is assessed will be happy to know im selling them for 5% cheaper than their originals. What a deal!",
            "title_similarity": "0.29587418",
            "sentiment_compound": 0.4508
        },
        {
            "id": "gwx6bo8",
            "score": 1,
            "text": "To anyone who knows. Are there any visual differences between a lab made diamond and a naturally occurring one? Or are they indistinguishable?",
            "title_similarity": "0.5672642",
            "sentiment_compound": 0.4137
        },
        {
            "id": "gwx6is1",
            "score": 2,
            "text": "Pandora is junk jewelry. No one is going there for fine jewelry, period. This was likely a cost cutting measure, disguised as a good PR call",
            "title_similarity": "0.6528835",
            "sentiment_compound": -0.0258
        },
        {
            "id": "gwx6ja8",
            "score": 1,
            "text": "How much though. Cause they used to be cheap",
            "title_similarity": "0.20300084",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwx6m9u",
            "score": 2,
            "text": "Sounds like this may open a Pandora’s box of better, cheaper diamonds",
            "title_similarity": "0.37580627",
            "sentiment_compound": 0.6597
        },
        {
            "id": "gwx6n77",
            "score": 1,
            "text": "And the prices will rise despite them abandoning the forced scarcity of a natural resource business model.",
            "title_similarity": "0.35702252",
            "sentiment_compound": 0.1739
        },
        {
            "id": "gwx6vqd",
            "score": 2,
            "text": "They also committed that by 2025 they will only use recycled gold and silver. I think it’s already pretty high now at 95% or 98% anyway",
            "title_similarity": "0.5620801",
            "sentiment_compound": 0.6486
        },
        {
            "id": "gwx70na",
            "score": 2,
            "text": "I know nothing about diamonds but I sure hope they help the communities that live off of being exploited for mined diamonds transition to some kind of sustainable export.",
            "title_similarity": "0.60788906",
            "sentiment_compound": 0.7469
        },
        {
            "id": "gwx7a0t",
            "score": 2,
            "text": "My wife specifically wanted a moissanite for an engagement ring to avoid mined diamonds and all the bad things involved with them. This was 10 years ago.\n\nI got it delivered at work, an office comprised primarily of 20s women. When they discovered I bought a synthetic diamond, their faces quickly turned from happy to shocked revulsion. My reputation took a major hit. I can only imagine what was said behind my back.\n\nIt was fucking insane what the meaning of a real or fake diamond meant to them. Thankfully, we moved away six months later. I’m hoping the general feelings towards synthetics have changed a decade later. It’s good to see some evidence of that.",
            "title_similarity": "0.57080364",
            "sentiment_compound": 0.7102
        },
        {
            "id": "gwx7ipl",
            "score": 1,
            "text": "Why do people even want diamonds? I've never understood the fascination.",
            "title_similarity": "0.5051743",
            "sentiment_compound": -0.3244
        },
        {
            "id": "gwx7p5y",
            "score": 3,
            "text": "I have been so good at not buying jewelry in general I was confused why a music streaming service sold diamonds.",
            "title_similarity": "0.5192682",
            "sentiment_compound": 0.3488
        },
        {
            "id": "gwx7q9q",
            "score": 1,
            "text": "Pandora sells diamonds? I though they just sold gaudy shit charms in tourist traps.",
            "title_similarity": "0.54308593",
            "sentiment_compound": -0.1779
        },
        {
            "id": "gwx7qql",
            "score": 1,
            "text": "Soooo prices should go down? Right?",
            "title_similarity": "0.35426974",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwx7rxy",
            "score": 2,
            "text": "doesnt that take all the value out of diamond jewelry?",
            "title_similarity": "0.5311043",
            "sentiment_compound": 0.5859
        },
        {
            "id": "gwx8bxd",
            "score": 1,
            "text": "I didn't even know they sold real diamond jewelry, I always thought all their stuff was cubic zirconia.",
            "title_similarity": "0.57040197",
            "sentiment_compound": 0.34
        },
        {
            "id": "gwx8doe",
            "score": 1,
            "text": "Ethical and the right choice",
            "title_similarity": "0.04913617",
            "sentiment_compound": 0.5106
        },
        {
            "id": "gwx8dro",
            "score": 1,
            "text": "BuT iF yoU inCrEasE EthIcAL pRoDucTioN hOw wiLL wE mAinTaiN oUR aRTifiCiaL scArCiTy??",
            "title_similarity": "0.348658",
            "sentiment_compound": 0.8299
        },
        {
            "id": "gwx8irt",
            "score": 1,
            "text": "Whats the difference?",
            "title_similarity": "0.10519698",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwx8kln",
            "score": 1,
            "text": "What about legendary weapons for vault hunters?",
            "title_similarity": "0.39222664",
            "sentiment_compound": -0.4404
        },
        {
            "id": "gwx8n75",
            "score": 2,
            "text": "I remember earlier this year I saw an ad by the WDC to buy real diamonds. Instant market signal that real diamonds were in trouble.",
            "title_similarity": "0.46738386",
            "sentiment_compound": -0.4019
        },
        {
            "id": "gwx8q43",
            "score": 2,
            "text": "Either way people who buy them are getting ripped off by a lot",
            "title_similarity": "0.20267838",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwx8r7f",
            "score": 1,
            "text": "Pandora switched to creative mode",
            "title_similarity": "0.38239342",
            "sentiment_compound": 0.4404
        },
        {
            "id": "gwx8srz",
            "score": 2,
            "text": "Or just dont sell diamonds because their value instantaneously depletes after purchase.",
            "title_similarity": "0.53435963",
            "sentiment_compound": 0.34
        },
        {
            "id": "gwx8u6s",
            "score": 1,
            "text": "I understand why, but as you are all aware, diamonds are plentiful to the point of being considered glass if it weren't for the dilligent efforts of the diamond merchants to keep the prices up.\n\nAfter all, gemstones are little more than colored glass - no longer rare due to the massive amount of them unearthed in the past 100 years.\n\nPandora would make a REAL statement had they said they were going to the mines to make sure the diamond miners were safe doing their jobs and were well paid for what they were doing.\n\nSimply turning to another income stream while \"complaining\" about the forced labor to mine something like diamonds is a public relations sham that affects nothing and makes no positive change.\n\nThis is yet another corporation that puts out massive PR campaigns whenever economic pressure is put on them - the PR campaign being both useless towards the cause and dishonest nonsense.",
            "title_similarity": "0.51134384",
            "sentiment_compound": -0.8775
        },
        {
            "id": "gwx8uff",
            "score": 1,
            "text": "Mining away...in this Minecraft day, so beautiful!",
            "title_similarity": "0.25678366",
            "sentiment_compound": 0.7417
        },
        {
            "id": "gwx8w3g",
            "score": 1,
            "text": "that will just make mined diamonds cost more in other areas though i bet.",
            "title_similarity": "0.4814735",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwx8wrr",
            "score": 2,
            "text": "This is kind of a useless gesture since diamonds are already fairly cheap and abundant, its just a market manipulation strangle hold that lead to their value",
            "title_similarity": "0.49791318",
            "sentiment_compound": -0.3818
        },
        {
            "id": "gwx90d7",
            "score": 1,
            "text": "I was expecting this article to be about Pandora the streaming service, so I was VERY CONFUSED about the rest of the headline...",
            "title_similarity": "0.43579584",
            "sentiment_compound": -0.6198
        },
        {
            "id": "gwx94k4",
            "score": 1,
            "text": "They gonna lower the price 100000000% now? Lol. Diamonds are worthless",
            "title_similarity": "0.6263844",
            "sentiment_compound": -0.3182
        },
        {
            "id": "gwx9hah",
            "score": 2,
            "text": "The amount of misinformation in these comments is astounding.",
            "title_similarity": "0.078959696",
            "sentiment_compound": 0.128
        },
        {
            "id": "gwx9n4c",
            "score": 3,
            "text": "Naw won't work.  People need the diamonds to contain suffering.  If the diamonds don't include the suffering involved in extracting them from the ground they are not real and don't have the same value.  Which is the only explanation to the difference in price between \"natural\" and lab created diamonds which are exactly the same substance at the atomic level.  No other element would be treated this way.  If you made gold in a lab it would have the exact same properties and value of \"natural\" gold.  But this logic doesn't apply to diamonds because of the lack of suffering.",
            "title_similarity": "0.65963227",
            "sentiment_compound": -0.5534
        },
        {
            "id": "gwx9nf0",
            "score": 2,
            "text": "Fuck diamonds altogether. And gold and silver. Tungsten carbide and other shiny metals are the way to go. $30 for couples rings vs $3000+",
            "title_similarity": "0.51143336",
            "sentiment_compound": -0.5423
        },
        {
            "id": "gwx9si2",
            "score": 2,
            "text": "They're making this change now because it's finally cost efficient. Make no mistake, they're not doing it out of the kindness if their corporate hearts.",
            "title_similarity": "0.3481844",
            "sentiment_compound": 0.9029
        },
        {
            "id": "gwx9zbo",
            "score": 1,
            "text": "Diamonds are overpriced briquettes. There I said it.",
            "title_similarity": "0.35880792",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwxa35u",
            "score": 1,
            "text": "Lol fuck diamonds",
            "title_similarity": "0.41503072",
            "sentiment_compound": -0.1779
        },
        {
            "id": "gwxaaus",
            "score": 1,
            "text": "That is good to hear.",
            "title_similarity": "-0.09717403",
            "sentiment_compound": 0.4404
        },
        {
            "id": "gwxac7y",
            "score": 1,
            "text": "Financially and ethically it’s a win for them, great news",
            "title_similarity": "0.07652557",
            "sentiment_compound": 0.836
        },
        {
            "id": "gwxahh8",
            "score": 2,
            "text": "I had no idea we could make diamonds in laboratories.. does that mean diamonds are worthless now?",
            "title_similarity": "0.67632806",
            "sentiment_compound": -0.6249
        },
        {
            "id": "gwxanit",
            "score": 1,
            "text": "Lab grown diamonds for me until those slave traders - mine operators like DeBeers Stop treating people like animals and become a more ethical company. This type of market pressure from lab grown diamonds I think will affect the natural gemstone mining industry. They need to treat people who work in the mines better, and pay them more! Or we won’t buy their blood diamonds simple as that.",
            "title_similarity": "0.59044623",
            "sentiment_compound": 0.9039
        },
        {
            "id": "gwxaqqi",
            "score": 1,
            "text": "Isn't that cheating?",
            "title_similarity": "0.13004886",
            "sentiment_compound": 0.4449
        },
        {
            "id": "gwxasvq",
            "score": 7,
            "text": "should switch to unobtanium",
            "title_similarity": "0.47583407",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwxatpb",
            "score": 1,
            "text": "Bullish or bearish for diamonds?",
            "title_similarity": "0.41100317",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwxav20",
            "score": 1,
            "text": "This just proves diamonds don’t hold much value at all if we just create them in the lab. That and the fact the Diamond industry tries to hide how many they actually have in supply don’t they?",
            "title_similarity": "0.6725229",
            "sentiment_compound": 0.6369
        },
        {
            "id": "gwxb09j",
            "score": 2,
            "text": "Oh yeah diamonds, probably the biggest con ever known.\nThe price is entirely set by one company that pretended diamonds were scarce and therefore valuable.[diamonds are a con](https://greyjournal.net/work/money/why-diamond-rings-are-a-huge-scam/)",
            "title_similarity": "0.5180498",
            "sentiment_compound": 0.296
        },
        {
            "id": "gwxb8et",
            "score": 2,
            "text": "On a universal scale, pearl is the rarest jewelry, since it requires life.\n\nCan't wait for aliens to dump diamonds and buy up pearl",
            "title_similarity": "0.61553687",
            "sentiment_compound": -0.3818
        },
        {
            "id": "gwxbcx9",
            "score": 1,
            "text": "Will this make their prices go down?",
            "title_similarity": "0.31319457",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwxbjc9",
            "score": 1,
            "text": "Just push them all in a big safe so the offer never grows.",
            "title_similarity": "0.53266",
            "sentiment_compound": 0.4404
        },
        {
            "id": "gwxcez9",
            "score": 1,
            "text": "Pandora is going to lose a lot of clout.",
            "title_similarity": "0.34717327",
            "sentiment_compound": -0.4019
        },
        {
            "id": "gwxcovn",
            "score": 1,
            "text": "If it makes their music suggesting algorithm better I'm all for it",
            "title_similarity": "0.28054145",
            "sentiment_compound": 0.4404
        },
        {
            "id": "gwxcqkc",
            "score": 1,
            "text": "No wonder their music app sucks..",
            "title_similarity": "0.34068078",
            "sentiment_compound": -0.5719
        },
        {
            "id": "gwxcuy8",
            "score": 1,
            "text": "This is going to make the “authentic” mines diamond market explode decades in the future.",
            "title_similarity": "0.4912601",
            "sentiment_compound": 0.34
        },
        {
            "id": "gwxd18w",
            "score": 1,
            "text": "How’s this going to affect miners like South Africa?",
            "title_similarity": "0.36240816",
            "sentiment_compound": 0.3612
        },
        {
            "id": "gwxd2q8",
            "score": 3,
            "text": "This certainly won’t backfire",
            "title_similarity": "0.28936583",
            "sentiment_compound": 0.34
        },
        {
            "id": "gwxd4xh",
            "score": 1,
            "text": "And they’re gonna lower the price right? Right??? Please?????",
            "title_similarity": "0.35908404",
            "sentiment_compound": 0.264
        },
        {
            "id": "gwxdad4",
            "score": 1,
            "text": "Anyone else think, at first, this was Pandora radio and was confused about the diamonds?",
            "title_similarity": "0.48040015",
            "sentiment_compound": -0.3182
        },
        {
            "id": "gwxdb4a",
            "score": 1,
            "text": "They'll be making money hand over fist. They'll control everything from production to sale. They'll market towards the lower end buyer. They'll probably have \"tiers\" (even though they'll be essentially the same). They'll probably have some made up brand name for each tier, something like Champagne Diamonds™ (a name a lower end buyer will consider fancy), something like Jean Pierre™ Diamonds (a name a mid range buyer would consider \"exclusive\") and Marcus Thompson™ Diamonds for the higher range buyer (a name sounding WASPy enough to give a ring of authenticity and craftsmanship).",
            "title_similarity": "0.50660765",
            "sentiment_compound": 0.7579
        },
        {
            "id": "gwxdd4s",
            "score": 2,
            "text": "Too bad they will still charge mined diamond prices.",
            "title_similarity": "0.49360943",
            "sentiment_compound": -0.2732
        },
        {
            "id": "gwxdz23",
            "score": 1,
            "text": "There is absolutely no reason to mine diamonds, save self centered hubris and the willingness to destroy the planet.\n\nIf you own a mined diamond, you are part of the problem.",
            "title_similarity": "0.669768",
            "sentiment_compound": -0.2484
        },
        {
            "id": "gwxe0ja",
            "score": 1,
            "text": "That title hurt my brain.  When I saw Pandora I thought it was the streaming service, and then when I saw mined I thought cryptocurrency, and then when I saw diamonds I thought about doulingo, because I'm doing that and it h as gems and such.  It just wasn't making any sense.",
            "title_similarity": "0.5147946",
            "sentiment_compound": -0.5267
        },
        {
            "id": "gwxe12t",
            "score": 1,
            "text": "*minecraft joke*",
            "title_similarity": "0.3254417",
            "sentiment_compound": 0.296
        },
        {
            "id": "gwxe27v",
            "score": 1,
            "text": "Aaaaaannnnd Pandora goes out of business in 2022.",
            "title_similarity": "0.57643193",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwxe4ic",
            "score": 1,
            "text": "So lab diamonds have become way cheaper than mined ones, you say?",
            "title_similarity": "0.41686416",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwxeau7",
            "score": 1,
            "text": "I do so wonder if they will lower their price to match factory made ones or just pocket the difference?",
            "title_similarity": "0.41230038",
            "sentiment_compound": -0.296
        },
        {
            "id": "gwxeb5e",
            "score": 1,
            "text": "And here I thought they only streamed music.",
            "title_similarity": "0.40223098",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwxedgg",
            "score": 1,
            "text": "Jewelry...some of the dumbest shit ever invented by human beings.",
            "title_similarity": "0.43704212",
            "sentiment_compound": -0.7845
        },
        {
            "id": "gwxeefj",
            "score": 1,
            "text": "But the price will remain artificially high because you don't love her unless you drop a paycheck on a ring to say \"I intend to marry you and give you a normal ring once I do but this'll work until then\".",
            "title_similarity": "0.5403063",
            "sentiment_compound": -0.8021
        },
        {
            "id": "gwxeezk",
            "score": 1,
            "text": "Thought this was about the pandora radio app and was very confused lol",
            "title_similarity": "0.37532023",
            "sentiment_compound": 0.1243
        },
        {
            "id": "gwxek0e",
            "score": 1,
            "text": "Wouldn’t that drive the cost of diamonds down and make them significantly cheaper?",
            "title_similarity": "0.40254644",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwxerbj",
            "score": 1,
            "text": "I don't think anyone buying from Pandora is expecting high CCC diamond anyway.",
            "title_similarity": "0.5967343",
            "sentiment_compound": 0.34
        },
        {
            "id": "gwxexr0",
            "score": 2,
            "text": "Bet the price stays the same",
            "title_similarity": "0.19084224",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwxf3rt",
            "score": 1,
            "text": "From radio to diamonds. Fascinating!",
            "title_similarity": "0.31147122",
            "sentiment_compound": 0.5848
        },
        {
            "id": "gwxf4iv",
            "score": 1,
            "text": "Stop all Trump emporium sales too and some human trafficking could be dented.",
            "title_similarity": "0.60955876",
            "sentiment_compound": -0.296
        },
        {
            "id": "gwxf5ql",
            "score": 1,
            "text": "I am now more likely to buys diamonds from pandora.",
            "title_similarity": "0.5313873",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwxf89k",
            "score": 2,
            "text": "Diamonds don't even look good. Diamonds look like crystal or glass. Just get that instead. If you're going to get a \"real\" gemstone, get something colored.",
            "title_similarity": "0.62669134",
            "sentiment_compound": 0.0243
        },
        {
            "id": "gwxf94r",
            "score": 1,
            "text": "Wonder if they will pass those cost savings on. Probably not.",
            "title_similarity": "0.31913075",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwxfbib",
            "score": 1,
            "text": "Kinda takes all the mystery out of owning a diamond but I get it.",
            "title_similarity": "0.5187626",
            "sentiment_compound": 0.1779
        },
        {
            "id": "gwxfgbe",
            "score": 1,
            "text": "They sell real diamonds?",
            "title_similarity": "0.43295884",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwxfoa2",
            "score": 1,
            "text": "Gems are overrated!!",
            "title_similarity": "0.33339077",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwxfvxt",
            "score": 1,
            "text": "My dumbass thought it said that pabdora box stopped showing mine diamonds (minecraft parody)",
            "title_similarity": "0.67275274",
            "sentiment_compound": -0.6705
        },
        {
            "id": "gwxg7h5",
            "score": 1,
            "text": "Sure they will",
            "title_similarity": "0.015494319",
            "sentiment_compound": 0.3182
        },
        {
            "id": "gwxgcja",
            "score": 2,
            "text": "Just curious here, but am I the only one who doesn't love Pandora's jewelry? I think it all just looks like fancier versions of crap I used to buy from Claire's when I was 13.",
            "title_similarity": "0.53945315",
            "sentiment_compound": -0.6189
        },
        {
            "id": "gwxgexo",
            "score": 1,
            "text": "neither are special",
            "title_similarity": "0.33614177",
            "sentiment_compound": -0.3089
        },
        {
            "id": "gwxghzi",
            "score": 2,
            "text": "Ah pandora,  I worked there one Christmas season. \n\nI still remember 3 out of every 4 sales ending in “im going to need a woman’s opinion”, which led to me having to get a coworker to say “it’s pretty”",
            "title_similarity": "0.32617122",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwxgrr6",
            "score": 1,
            "text": "Reading the headline and having never heard of the Pandora jewelry chain, I was scratching my head and wondered if this is related to the next Avatar movie where the humans on Pandora will stop mining for precious minerals and finally leave the Na'vi in peace...",
            "title_similarity": "0.7207756",
            "sentiment_compound": 0.7003
        },
        {
            "id": "gwxgtd8",
            "score": 1,
            "text": "Me: So they'll be cheaper???\n\nPandora: Haha no.",
            "title_similarity": "0.33805856",
            "sentiment_compound": 0.5484
        },
        {
            "id": "gwxgu7i",
            "score": 1,
            "text": "I mean the people that can afford diamonds will still buy the real ones. Pandora is more of a bracelet for a soccer mom store anyway. This won’t change a thing as far as the diamond trade. Simply a company using cheaper materials to bring their price point down for lower income customers that are their base, all while getting patted on the back for being “progressive”.",
            "title_similarity": "0.5731971",
            "sentiment_compound": 0.0516
        },
        {
            "id": "gwxgzsf",
            "score": 1,
            "text": "So their switching to cubic zerconia",
            "title_similarity": "0.33267072",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwxh09c",
            "score": 1,
            "text": "so apparently lab made diamonds are close enough in price now its worth the free advertising to switch",
            "title_similarity": "0.3734436",
            "sentiment_compound": 0.6369
        },
        {
            "id": "gwxh1vo",
            "score": 1,
            "text": "I always thought lab diamonds are cooler than dirt diamonds. One is super plentiful and found in the dirt and dig up by modern slaves the other is perfectly crafted by cool smart well paid scientists in a special lab just for you using the magic of science.",
            "title_similarity": "0.51397437",
            "sentiment_compound": 0.9201
        },
        {
            "id": "gwxh2z1",
            "score": 2,
            "text": "Then WHY pay so much for them if you KNOW they are easily reproduced?",
            "title_similarity": "0.2020664",
            "sentiment_compound": 0.25
        },
        {
            "id": "gwxh67e",
            "score": 2,
            "text": "Great, now we can all continue not giving a shit about diamonds.",
            "title_similarity": "0.696191",
            "sentiment_compound": 0.7174
        },
        {
            "id": "gwxh77w",
            "score": 2,
            "text": "People are crying about the diamonds being fake. They're not fake, they are completely real, they're just made artificially.",
            "title_similarity": "0.5700643",
            "sentiment_compound": -0.5641
        },
        {
            "id": "gwxhcov",
            "score": 2,
            "text": "Of course at a much lower price - right?\nRight..?",
            "title_similarity": "0.25860932",
            "sentiment_compound": -0.3736
        },
        {
            "id": "gwxhi7u",
            "score": 2,
            "text": "What does this have to do with Pandora music streaming",
            "title_similarity": "0.32240626",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwxhkzh",
            "score": 1,
            "text": "Lol @ at adults infatuation with a shiny rock!",
            "title_similarity": "0.33945203",
            "sentiment_compound": 0.5707
        },
        {
            "id": "gwxhn2c",
            "score": 2,
            "text": "Is this the part of the rich will soon cry,that finally we are acknowledging diamonds is not rare",
            "title_similarity": "0.5464606",
            "sentiment_compound": 0.5574
        },
        {
            "id": "gwxhrg8",
            "score": 1,
            "text": "No more slave labor ?",
            "title_similarity": "0.5575179",
            "sentiment_compound": -0.296
        },
        {
            "id": "gwxhucf",
            "score": 2,
            "text": "Does the value of diamonds drop as it can be lab made now?",
            "title_similarity": "0.6261066",
            "sentiment_compound": 0.0772
        },
        {
            "id": "gwxi1s3",
            "score": 1,
            "text": "They must be running out of natural deposits....",
            "title_similarity": "0.43766063",
            "sentiment_compound": 0.3612
        },
        {
            "id": "gwxi6ta",
            "score": 1,
            "text": "I was really confused why a music streaming service was in the diamond business for a second there.",
            "title_similarity": "0.43276358",
            "sentiment_compound": -0.0498
        },
        {
            "id": "gwxiayk",
            "score": 1,
            "text": "How do you even “lab-make” a diamond?",
            "title_similarity": "0.574874",
            "sentiment_compound": 0.34
        },
        {
            "id": "gwxili3",
            "score": 1,
            "text": "Fuck diamonds, sapphires are where it's at.",
            "title_similarity": "0.5059343",
            "sentiment_compound": -0.5423
        },
        {
            "id": "gwxioc2",
            "score": 1,
            "text": "Has anyone else notices the lab created rubies do not  have the same color as the mined ones ?",
            "title_similarity": "0.57652843",
            "sentiment_compound": 0.25
        },
        {
            "id": "gwxj4hx",
            "score": 1,
            "text": "I will never buy a diamond.",
            "title_similarity": "0.6044928",
            "sentiment_compound": -0.2584
        },
        {
            "id": "gwxjmc5",
            "score": 1,
            "text": "price better not be the same, and honestly can I grow it at home?",
            "title_similarity": "0.42219582",
            "sentiment_compound": 0.7096
        },
        {
            "id": "gwxjtfp",
            "score": 1,
            "text": "Who are these moronic cunts still paying hundreds for shiny rocks????",
            "title_similarity": "0.37755656",
            "sentiment_compound": -0.8611
        },
        {
            "id": "gwxjwjl",
            "score": 1,
            "text": "Pandöra",
            "title_similarity": "0.25060892",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwxjz2t",
            "score": 1,
            "text": "Diamonds are not rare, and should not hold this kind of value. It's completely made up, and people just accepted it.",
            "title_similarity": "0.6386113",
            "sentiment_compound": 0.4951
        },
        {
            "id": "gwxk97e",
            "score": 1,
            "text": "We can just make diamonds?",
            "title_similarity": "0.5332875",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwxkg6a",
            "score": 1,
            "text": "Pandora’s box turns out is man-made and boring af. Do a different jewel not something squeezed by puny man rather than gigantic global forces. \n\nAnd duh don’t mine with slave labor.",
            "title_similarity": "0.57176685",
            "sentiment_compound": 0.0516
        },
        {
            "id": "gwxkha3",
            "score": 1,
            "text": "Probably cause they're waaaaay cheaper",
            "title_similarity": "0.13005638",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwxkj1d",
            "score": 2,
            "text": "They're just doing it for the lower price and the good PR that comes with it. And I'm fine with that. \n\nThey're doing it pretty late, lab-diamonds aren't super new. But Now is better than in 10 years. something something best time to grow a tree was 20 years ago, second best time is today..",
            "title_similarity": "0.43279433",
            "sentiment_compound": 0.9597
        },
        {
            "id": "gwxl2r3",
            "score": 1,
            "text": "I bet they still charge a lot for them.",
            "title_similarity": "0.0993419",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwxl49p",
            "score": 1,
            "text": "Yay! Let’s change the diamond trade!! Lab created gems for everyone! 💎",
            "title_similarity": "0.599414",
            "sentiment_compound": 0.8388
        },
        {
            "id": "gwxlenn",
            "score": 1,
            "text": "Well Diamonds are worthless, you just got tricked into thinking there was a limited quantity of them.",
            "title_similarity": "0.5905857",
            "sentiment_compound": -0.5106
        },
        {
            "id": "gwxlkv3",
            "score": 1,
            "text": "Here I am wondering what a music streaming service needed diamonds for in the first place.",
            "title_similarity": "0.46709225",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwxlo0i",
            "score": 1,
            "text": "Yeah, but what about unobtainium?",
            "title_similarity": "0.2943247",
            "sentiment_compound": 0.1531
        },
        {
            "id": "gwxltci",
            "score": 1,
            "text": "This is why I would never want a diamond anything because of knowing how “cheap” they actually are. Monopoly making them priced at whatever. Just knowing at the back of my mind about the actual “value” made me not want to buy them. Glad its going in this direction.",
            "title_similarity": "0.6210673",
            "sentiment_compound": 0.1331
        },
        {
            "id": "gwxluec",
            "score": 1,
            "text": "I'm more suspicious of women who say they have to have a diamond ring these days since everyone should be well aware of the nonsense that goes on with diamonds.",
            "title_similarity": "0.5323428",
            "sentiment_compound": -0.2484
        },
        {
            "id": "gwxm68f",
            "score": 1,
            "text": "$100 says prices won't be affected",
            "title_similarity": "0.45669943",
            "sentiment_compound": 0.1139
        },
        {
            "id": "gwxmj0v",
            "score": 1,
            "text": "Thus lowering the value of the already useless mineral even more. Get with it society, this shit is beyond pointless to buy.",
            "title_similarity": "0.5359937",
            "sentiment_compound": -0.7684
        },
        {
            "id": "gwxmj1h",
            "score": 1,
            "text": "What a shame",
            "title_similarity": "0.11029444",
            "sentiment_compound": -0.4767
        },
        {
            "id": "gwxmqe8",
            "score": 1,
            "text": "So the price will go down since it's incredibly easy to make artificial diamonds right?\nNo of course not, they'll still price gouge the shit out of people.",
            "title_similarity": "0.6126582",
            "sentiment_compound": 0.7178
        },
        {
            "id": "gwxmsi5",
            "score": 1,
            "text": "So many nicer stones than diamonds.",
            "title_similarity": "0.2685922",
            "sentiment_compound": 0.4902
        },
        {
            "id": "gwxn2qu",
            "score": 2,
            "text": "When I was 5 years old I had heard diamonds could be made out of coal, so I decided I was going to make a diamond for my mom by putting a few pieces of charcoal from the grill into the microwave for 30 minutes until they were glowing orange.\n\nSadly they didn't turn into diamonds.",
            "title_similarity": "0.46756673",
            "sentiment_compound": -0.1027
        },
        {
            "id": "gwxn7mb",
            "score": 1,
            "text": "Remember when the jewelry industry tried to convince the public that zirconia diamonds were inferior in a multitude of unspecified ways we were too lame to understand?\n\nNever pay for diamonds unless you are using them for industrial purposes.",
            "title_similarity": "0.66212416",
            "sentiment_compound": -0.4946
        },
        {
            "id": "gwxncfb",
            "score": 3,
            "text": "I thought they were a music streaming site.",
            "title_similarity": "0.25023812",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwxo6ow",
            "score": 1,
            "text": "Diamonds are a scam either way.",
            "title_similarity": "0.46688107",
            "sentiment_compound": -0.5719
        },
        {
            "id": "gwxoa21",
            "score": 2,
            "text": "I want iron pixaxe..for mining..and open my own business",
            "title_similarity": "0.5546245",
            "sentiment_compound": 0.0772
        },
        {
            "id": "gwxocq2",
            "score": 1,
            "text": "That’s great news for the environment",
            "title_similarity": "0.11106374",
            "sentiment_compound": 0.6249
        },
        {
            "id": "gwxoi9n",
            "score": 1,
            "text": "TIL, you can make diamonds.",
            "title_similarity": "0.42502823",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwxouqg",
            "score": 1,
            "text": "Pandora sells diamonds? I thought they were like the Claire’s of jewelry stores.",
            "title_similarity": "0.4664489",
            "sentiment_compound": 0.3612
        },
        {
            "id": "gwxoy2s",
            "score": 1,
            "text": "Big FUCK to DeBeers.",
            "title_similarity": "0.1316213",
            "sentiment_compound": -0.6408
        },
        {
            "id": "gwxp7vw",
            "score": 1,
            "text": "Good. “Man made” Diamonds are cooler and very technically, still made by “Mother Earth”",
            "title_similarity": "0.5113985",
            "sentiment_compound": 0.4404
        },
        {
            "id": "gwxp9qn",
            "score": 1,
            "text": "With zero price decrease, I'm sure.",
            "title_similarity": "0.26924455",
            "sentiment_compound": 0.3182
        },
        {
            "id": "gwxpa2b",
            "score": 1,
            "text": "I'll give you 10 cents for it. Otherwise it's a worthless rock.",
            "title_similarity": "0.40000188",
            "sentiment_compound": -0.4404
        },
        {
            "id": "gwxpbho",
            "score": 2,
            "text": "[Superman](https://www.youtube.com/watch?v=JyHFPV-j8Gs) has found a full-time job!",
            "title_similarity": "0.34758162",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwxpe96",
            "score": 1,
            "text": "All of a sudden I want to buy a diamond from Pandora.",
            "title_similarity": "0.47722998",
            "sentiment_compound": 0.4019
        },
        {
            "id": "gwxpgob",
            "score": 2,
            "text": "Boycott diamonds. Diamonds aren’t rare. There is no reason for the insane prices",
            "title_similarity": "0.5932645",
            "sentiment_compound": -0.7351
        },
        {
            "id": "gwxpgv6",
            "score": 1,
            "text": "I don't love Pandora myself but they have made gift giving for the MIL easier.  Either way, it won't matter much, very few of thier pieces have precious stone in them.",
            "title_similarity": "0.46817577",
            "sentiment_compound": 0.9372
        },
        {
            "id": "gwxpi86",
            "score": 2,
            "text": "For 5 seconds, I wondered to myself. What does pandora radio have to do with diamonds??",
            "title_similarity": "0.43237942",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwxpmoe",
            "score": 1,
            "text": "and will they continue to embed them in items made in their labour friendly Thai facility? I ask it for a friend.",
            "title_similarity": "0.35908735",
            "sentiment_compound": 0.7506
        },
        {
            "id": "gwxpo7p",
            "score": 1,
            "text": "I didn’t realize they had products with diamonds, I assumed everything was cubic zirconium",
            "title_similarity": "0.6095866",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwxpqfg",
            "score": 1,
            "text": "So I find this hilarious and amazing because my jeweler is in prison. 11 years ago I purchased a very expensive engagement ring for my now wife. Got a great deal. Fast forward and I find out my jeweler, a very reputable and established local guy, had been sent to prison for selling lab grown diamonds and passing them off as natural. I had mine tested and they are in fact natural diamonds. Apparently what he was doing was selling very large expensive diamonds to long term customers who were very unlikely to take them elsewhere because they had a long standing business relationship with him. Also, it is difficult to tell the difference even with a trained eye. \n\nHe really was a nice guy.",
            "title_similarity": "0.46392664",
            "sentiment_compound": 0.9227
        },
        {
            "id": "gwxpsnw",
            "score": 1,
            "text": "If you're considering buying diamonds, I highly recommend looking into moisaanite instead, the stuff is sparklier than diamonds and nearly as hard and it's like 10x cheaper -- I ordered some loose ones off AliExpress for very cheap.",
            "title_similarity": "0.46643752",
            "sentiment_compound": 0.3804
        },
        {
            "id": "gwxq2c4",
            "score": 1,
            "text": "My husband got me a Moissanite engagement ring, I love it so much, it also has a pretty rainbow reflection which diamonds don’t generally have. It makes me even happier that he didn’t spend months and months worth of salary.",
            "title_similarity": "0.40279996",
            "sentiment_compound": 0.9403
        },
        {
            "id": "gwxq9np",
            "score": 1,
            "text": "Ok, if they sell diamonds for a third of the regular price, I wonder if I can buy diamonds from them and resell them at regular price.",
            "title_similarity": "0.44568262",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwxqce1",
            "score": 1,
            "text": "So worthless diamonds? This would be cool is lab diamonds weren’t priced so ridiculously",
            "title_similarity": "0.54584455",
            "sentiment_compound": -0.6136
        },
        {
            "id": "gwxqdix",
            "score": 2,
            "text": "No more GMO diamonds! Only home grown locally sourced in Africa diamonds for me.",
            "title_similarity": "0.6482776",
            "sentiment_compound": -0.3595
        },
        {
            "id": "gwxqf13",
            "score": 1,
            "text": "Pandora sell diamonds? I thought that shit was just fancy glass.",
            "title_similarity": "0.4661662",
            "sentiment_compound": -0.5574
        },
        {
            "id": "gwxqk81",
            "score": 1,
            "text": "Can lab-made diamonds and mined diamonds be clearly distinguished by an expert? And by a common person?",
            "title_similarity": "0.46624386",
            "sentiment_compound": 0.4696
        },
        {
            "id": "gwxqx7w",
            "score": 1,
            "text": "I won't be happy till they stop mining Unobtainium.",
            "title_similarity": "0.6397904",
            "sentiment_compound": -0.6367
        },
        {
            "id": "gwxqymr",
            "score": 1,
            "text": "Diamonds have always been charms, they're not really valuable.",
            "title_similarity": "0.5667945",
            "sentiment_compound": 0.0333
        },
        {
            "id": "gwxr5i4",
            "score": 2,
            "text": "Never owned one. Never will.",
            "title_similarity": "0.4617163",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwxr97x",
            "score": 1,
            "text": "So worthless carbon before. Worthless carbon after ( excluding scientific uses)",
            "title_similarity": "0.5586854",
            "sentiment_compound": -0.7264
        },
        {
            "id": "gwxrchf",
            "score": 1,
            "text": "Where can I buy mined diamonds? I kid.",
            "title_similarity": "0.5468784",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwxrj9b",
            "score": 1,
            "text": "But death and blood are what primes my diamonds for the marriage sacrifice.",
            "title_similarity": "0.42113632",
            "sentiment_compound": -0.7469
        },
        {
            "id": "gwxrn4z",
            "score": 1,
            "text": "Weird, I just saw Rosario Dawsons insta post about being a Pandora partner and thought of this exact conflict of interest.",
            "title_similarity": "0.43680227",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwxryrt",
            "score": 1,
            "text": "Pandora sells diamonds? I thought they just sold ugly charms for bracelets.",
            "title_similarity": "0.56058407",
            "sentiment_compound": -0.1027
        },
        {
            "id": "gwxs592",
            "score": 1,
            "text": "How hard would it be to make my own diamonds and start giving them away for free?  \n\nWall Street bets, you in?",
            "title_similarity": "0.49173906",
            "sentiment_compound": 0.6868
        },
        {
            "id": "gwxs9gj",
            "score": 1,
            "text": "I personally could give less of a fuck about elusive rocks.",
            "title_similarity": "0.4624192",
            "sentiment_compound": -0.5
        },
        {
            "id": "gwxsewb",
            "score": 1,
            "text": "Literally did not know until this moment that Pandora used any diamonds in its jewelry. Do they mean those tiny little melee ones? It's not exactly Cartier.",
            "title_similarity": "0.6313771",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwxskfm",
            "score": 1,
            "text": "Good. If the entire diamond industry (with the exception of their industrial use) could just go away now, that would be great.",
            "title_similarity": "0.63213986",
            "sentiment_compound": 0.8555
        },
        {
            "id": "gwxso9m",
            "score": 1,
            "text": "Got my girl an amber ring for 60 bucks. She loved it and still wears it. AMA.",
            "title_similarity": "0.2728759",
            "sentiment_compound": 0.5994
        },
        {
            "id": "gwxsr6v",
            "score": 1,
            "text": "*Profits intensify*",
            "title_similarity": "0.08587924",
            "sentiment_compound": 0.4404
        },
        {
            "id": "gwxsuck",
            "score": 1,
            "text": "If it's cheaper than what the current insane market price is, I'm okay with it.",
            "title_similarity": "0.20622525",
            "sentiment_compound": -0.2023
        },
        {
            "id": "gwxsvqo",
            "score": 3,
            "text": ">laboratory-made diamonds.\n\nAKA Diamonds.",
            "title_similarity": "0.52437836",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwxsvwp",
            "score": 1,
            "text": "And despite being much cheaper to create - they'll be sold as even pricer.",
            "title_similarity": "0.29104286",
            "sentiment_compound": 0.2732
        },
        {
            "id": "gwxswhb",
            "score": 1,
            "text": "Wow I’m over here thinking Pandora is still just a music streaming service!! Good for them!",
            "title_similarity": "0.41565552",
            "sentiment_compound": 0.8213
        },
        {
            "id": "gwxt0wo",
            "score": 1,
            "text": "Good.  No more dead African kids from terrible work environments in the diamond industry.",
            "title_similarity": "0.56059456",
            "sentiment_compound": 0.5768
        },
        {
            "id": "gwxt4a0",
            "score": 3,
            "text": "Prior to lab grown diamonds, selling a loose diamond of a larger size 1+ carat acquired from a diamond dealer might not show the markup up you’d expect. For instance on a $5k stone pocketing as little as $1000 or so. (Very circumstantial of course) Taking lesser on that end and taking home the more typical margin on the mounting and work to be done. There is a reason diamonds are the choice for engagement/ daily worn jewelry. Even rubies and sapphires which are the step below a diamond in hardness can get beat up badly and show wear(chips and scratches) in short time by a user who uses their hands alot.\n\nSomeone above was talking about having a moonstone for the engagement which is a terrible choice for longevity sake. Ive seen too many customers destroy and wear down much harder stones than that. Sure they can be replaced when damaged and worn, they arent practical. Although many gemstones are very beautiful choices. For daily wear a diamond is a great choice. I was previously a bench jeweler for 10 years and I like the lab grown stuff. It is a diamond through and through. It begins witha small seed of a diamond and its grown to the desired outcome",
            "title_similarity": "0.54717517",
            "sentiment_compound": 0.9359
        },
        {
            "id": "gwxt7aj",
            "score": 1,
            "text": "\"Natural\" diamonds need to be called dirty diamonds.   That is the only difference.  There is no point to dig them out of the ground when you can just make better ones for cheaper.\n\nThis was also going to happen now that moissanite is off patent.",
            "title_similarity": "0.7314383",
            "sentiment_compound": 0.0772
        },
        {
            "id": "gwxt8nq",
            "score": 2,
            "text": "Pandora barely sold diamonds anyway",
            "title_similarity": "0.5732369",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwxte0x",
            "score": 2,
            "text": "In other words, quality is about to go through the roof and price is going to fall through the floor.",
            "title_similarity": "0.30357516",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwxtm8f",
            "score": 3,
            "text": "Now they’re just gonna chop a kids arm off for fun",
            "title_similarity": "0.33880526",
            "sentiment_compound": 0.5106
        },
        {
            "id": "gwxtom6",
            "score": 2,
            "text": "Most y’all favorite rappers jewelry is lab grown diamonds that cost a penny compared to the real thing and the lab made diamonds look perfect and hit way better. You are dumb to buy real diamonds",
            "title_similarity": "0.50302714",
            "sentiment_compound": 0.7635
        },
        {
            "id": "gwxtsvf",
            "score": 1,
            "text": "Damn, never bought jewelry and never will",
            "title_similarity": "0.5527657",
            "sentiment_compound": -0.4019
        },
        {
            "id": "gwxtxgt",
            "score": 3,
            "text": "Lab made diamonds and gems are indistinguishable from mined rocks except that by law they have to a tiny laser ID cut into them. Ditch that law and collapse the shiny rocks industry says I.",
            "title_similarity": "0.7151253",
            "sentiment_compound": -0.6486
        },
        {
            "id": "gwxu82s",
            "score": 1,
            "text": "Good ole corporate morality. All of a sudden theres a cheaper alternative and boom morality. \n\nWho the fuck buys diamonds anyway. Theyre shiny rocks grow up.",
            "title_similarity": "0.50793153",
            "sentiment_compound": -0.1531
        },
        {
            "id": "gwxu99g",
            "score": 3,
            "text": "Diamonds are for suckers!",
            "title_similarity": "0.41707292",
            "sentiment_compound": -0.5562
        },
        {
            "id": "gwxuaee",
            "score": 1,
            "text": "Botswana blood free diamonds for the win",
            "title_similarity": "0.46614018",
            "sentiment_compound": 0.7964
        },
        {
            "id": "gwxuoq0",
            "score": 2,
            "text": "Aaaand this is why I bought my SO a sapphire from an artisan cutter - they’re actually rare and aren’t the overpriced product of a monopolistic marketing campaign.",
            "title_similarity": "0.57610476",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwxuw3p",
            "score": 1,
            "text": "Wouldn't that drive the value down if they're synthetic?",
            "title_similarity": "0.39416608",
            "sentiment_compound": 0.34
        },
        {
            "id": "gwxuz9g",
            "score": 1,
            "text": "What the fuck is a lab made diamond? How does that even work?\n\nWouldn't the value of a diamond be dramatically reduced if that's a possibility?",
            "title_similarity": "0.5992022",
            "sentiment_compound": -0.3129
        },
        {
            "id": "gwxv54f",
            "score": 3,
            "text": "There’s a lot of misinformation in these comments, I’m a geologist and a gemologist.\n\nA stone simulant (or fake) is not the same as a lab grown / synthetic gem. The lab grown gem and the natural are the same, except one was born in a lab whilst the other was created by the Earth. 🤔 Yes we mine a lot of diamonds, but a lot of them are not gem quality but of industrial quality. Same with corundum. Not all that is mined is used or CAN be used in jewelry.",
            "title_similarity": "0.6106814",
            "sentiment_compound": 0.1027
        },
        {
            "id": "gwxwd5c",
            "score": 1,
            "text": "I literally will only buy natural gemstone jewelry so I guess I'll never be buying diamond jewelry from them anytime haha. But diamonds are also overrated anyway.",
            "title_similarity": "0.7400512",
            "sentiment_compound": 0.3031
        },
        {
            "id": "gwxwizu",
            "score": 1,
            "text": "Diamonds aint what they used to be",
            "title_similarity": "0.5505605",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwxwzsu",
            "score": 1,
            "text": "Believe it when you see it",
            "title_similarity": "0.070931375",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwxx2ls",
            "score": 1,
            "text": "The best thing about laboratory grown diamonds is to the average consumer, they are exactly the same as mined. And even some CZ diamonds are very pretty. I don’t think the mined  diamond industry is going to be able to maintain like it used to.",
            "title_similarity": "0.5845981",
            "sentiment_compound": 0.9117
        },
        {
            "id": "gwxxf6i",
            "score": 1,
            "text": "will they lower the price?",
            "title_similarity": "0.2599432",
            "sentiment_compound": -0.296
        },
        {
            "id": "gwxxg0i",
            "score": 1,
            "text": "The longer I live and the more technology advances, the more barbaric and ideologically backwards the world becomes.",
            "title_similarity": "0.37910318",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwxxg1d",
            "score": 1,
            "text": "My wife asked for moissanite for her engagement ring. Spent $700 on what would've been a $3000 ring if it were diamond. She gets tons of compliments on it and a recent appraisal put it at $3500, so I think the artificial diamonds are catching up.",
            "title_similarity": "0.3537854",
            "sentiment_compound": 0.7964
        },
        {
            "id": "gwxxv4x",
            "score": 1,
            "text": "Aside from Jewelery,  what use do diamonds have?",
            "title_similarity": "0.47190657",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwxxy8f",
            "score": 2,
            "text": "Wow the diamond industry is shady af. Maybe instead of buying a diamond ring to propose we should just go out and find the most beautiful rock we can find or something 😂",
            "title_similarity": "0.5689365",
            "sentiment_compound": 0.9402
        },
        {
            "id": "gwxxyrp",
            "score": 1,
            "text": "As long as it’s diamond like. People can’t tell the difference on YouTube fake from real. So diamond like is good enough for me, not into supporting blood diamonds or financing foreign wars among tribes in far away places .",
            "title_similarity": "0.5846424",
            "sentiment_compound": 0.5557
        },
        {
            "id": "gwxy3w0",
            "score": 3,
            "text": "Why is a music streaming service selling diamonds in the first place?",
            "title_similarity": "0.49481273",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwxyo20",
            "score": 1,
            "text": "I am happy to see this. I bought my now wife a lab made diamond to propose and she is still in love with it.  In my eyes buying a diamond is like buying hype clothing (ex. Supreme, Louis Vuitton). It has no value other then the fact people will pay for it. It doesn't go up in value and it's not rare, so why not just buy a bigger, nicer ring for half the cost. Hopefully this becomes the new norm so those with a smaller budget can still buy a nice ring and not feel bad doing so.",
            "title_similarity": "0.51122075",
            "sentiment_compound": 0.9818
        },
        {
            "id": "gwxzard",
            "score": 1,
            "text": "Its finally profitable, huh?",
            "title_similarity": "0.076550305",
            "sentiment_compound": 0.4404
        },
        {
            "id": "gwxzgsp",
            "score": 1,
            "text": "I think they finally figured out that most of their products end up on shopgoodwill.com.\n\nAnd of course a commitment to environmental sustainability and carbon mitigation is also a commitment to ethical employment practices.",
            "title_similarity": "0.32651973",
            "sentiment_compound": 0.8176
        },
        {
            "id": "gwxzm8u",
            "score": 1,
            "text": "Is there a chart that would let me keep track of diamond value falling?",
            "title_similarity": "0.4164498",
            "sentiment_compound": 0.4939
        },
        {
            "id": "gwxzuxh",
            "score": 1,
            "text": "The only people who would have a problem with this are people who use diamonds as a way to savor the exploitation of the poor and as a status symbol.",
            "title_similarity": "0.4515385",
            "sentiment_compound": -0.7003
        },
        {
            "id": "gwy09c6",
            "score": 1,
            "text": "USA billboards just see historical https://www.reddit.com/r/Wallstreetsilver/comments/n4n1n0/please_post_more_billboard_pics_locations_below/?utm_source=share&utm_medium=ios_app&utm_name=iossmf",
            "title_similarity": "0.33839142",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwy0o5x",
            "score": 1,
            "text": "Were they ever selling mined diamonds though",
            "title_similarity": "0.5546082",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwy0ukc",
            "score": 1,
            "text": "I guess that means more ads then to make up for that money lost huh?😬",
            "title_similarity": "0.26270208",
            "sentiment_compound": -0.5719
        },
        {
            "id": "gwy0vkg",
            "score": 1,
            "text": "But will prices remain artificially high or are we about to see diamond price drop",
            "title_similarity": "0.42277938",
            "sentiment_compound": 0.1154
        },
        {
            "id": "gwy0yne",
            "score": 1,
            "text": "Time to go graverobbing",
            "title_similarity": "0.3245842",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwy11y0",
            "score": 1,
            "text": "Good. Mined diamonds are fucking dumb and evil",
            "title_similarity": "0.4875712",
            "sentiment_compound": -0.7474
        },
        {
            "id": "gwy1ea4",
            "score": 2,
            "text": "I bet their prices won't reflect the cheaper diamonds.",
            "title_similarity": "0.5630839",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwy1nh5",
            "score": 2,
            "text": "All diamonds are garbage.",
            "title_similarity": "0.58191496",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwy29yo",
            "score": 2,
            "text": " Cecil rhodes and his entire blood line are cancer to mankind.",
            "title_similarity": "0.38834035",
            "sentiment_compound": -0.6597
        },
        {
            "id": "gwy2g91",
            "score": 2,
            "text": "If I ever luck out and meet the right girl I’m gonna buy a vintage ring or maybe just white gold bands. She will totally be down because we will vibe together. Same reason I’ve always though have a small wedding and an extended honeymoon with any savings. What do you want 3-12 months traveling and hanging out with your new wife or a big ring and fancy wedding?",
            "title_similarity": "0.4590978",
            "sentiment_compound": 0.5106
        },
        {
            "id": "gwy2j23",
            "score": 1,
            "text": "Hopefully this will trickle through the market and fuck DeBeers",
            "title_similarity": "0.26589012",
            "sentiment_compound": -0.2023
        },
        {
            "id": "gwy2uyw",
            "score": 1,
            "text": "It's all the same thing. Give me a lab created gem that I know wasn't mined by slaves and controlled by a cartel any day.",
            "title_similarity": "0.7128734",
            "sentiment_compound": 0.25
        },
        {
            "id": "gwy2xwe",
            "score": 1,
            "text": "Big move!",
            "title_similarity": "-0.008519606",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwy2ztt",
            "score": 1,
            "text": "What's the carbon footprint of a lab made diamond vs mined?",
            "title_similarity": "0.51192176",
            "sentiment_compound": 0.34
        },
        {
            "id": "gwy39r5",
            "score": 1,
            "text": "Maybe someone with some knowledge on the subject can educate me. Aren't many natural diamonds mined using slave labor? And if that's the case, how on earth could anyone choose a natural diamond over a synthetic one, that I'm assuming is made more ethically?",
            "title_similarity": "0.5794",
            "sentiment_compound": 0.4854
        },
        {
            "id": "gwy3dgg",
            "score": 3,
            "text": "I always forget this was a jewelry chain first.  Every time there is a story about this company I automatically think they're talking about the music streaming service.",
            "title_similarity": "0.5415402",
            "sentiment_compound": -0.2263
        },
        {
            "id": "gwy4io0",
            "score": 1,
            "text": "https://t.me/joinchat/KZbuaAeg3PE4MjNi",
            "title_similarity": "0.20380592",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwy4xi4",
            "score": 1,
            "text": "      d4x",
            "title_similarity": "0.10591945",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwy589v",
            "score": 1,
            "text": "Still over priced",
            "title_similarity": "0.12029081",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwy5q4h",
            "score": 1,
            "text": "So the price will go down?",
            "title_similarity": "0.28557187",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwy5wfj",
            "score": 1,
            "text": "They are the most expensive fake jewelry company in the world.",
            "title_similarity": "0.33694804",
            "sentiment_compound": -0.5233
        },
        {
            "id": "gwy624x",
            "score": 2,
            "text": "Imagine how many people shopped at stores that, back in the day, had no idea they used slave labor and other cruel forms of production. I mean you had like 1 source of information besides actually going to a area and seeing for yourself.",
            "title_similarity": "0.44411278",
            "sentiment_compound": -0.5423
        },
        {
            "id": "gwy7ag4",
            "score": 2,
            "text": "I didn't even know that diamonds were involved in streaming music.",
            "title_similarity": "0.45585248",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwy7fgi",
            "score": 2,
            "text": "BlingBling less ChingChing",
            "title_similarity": "0.39651772",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwy7nte",
            "score": 1,
            "text": "Are they also going to significantly lower the prices of these lab grown diamonds?",
            "title_similarity": "0.5960294",
            "sentiment_compound": -0.296
        },
        {
            "id": "gwy830w",
            "score": 1,
            "text": "I won't buy jewelry until it's resale value is 50-75% of retail.",
            "title_similarity": "0.47616452",
            "sentiment_compound": 0.34
        },
        {
            "id": "gwy8fz6",
            "score": 2,
            "text": "If we can just make them in a lab, why are they still so valuable to us? Rarity is the value. If we could make gold, it would be worthless.",
            "title_similarity": "0.57985646",
            "sentiment_compound": 0.541
        },
        {
            "id": "gwy8ldu",
            "score": 1,
            "text": "Well then, that should take the wind out of over inflated diamond prices....",
            "title_similarity": "0.40121806",
            "sentiment_compound": 0.5423
        },
        {
            "id": "gwya5a6",
            "score": 2,
            "text": "(sold @ the same price as mined diamonds (or higher because 'fair trade diamonds' are a selling/advertising feature) therefore 'worth' more....\n\nAnalogy.... \nEg.... Cannabis before prohibition was free/cheap as hell..... Black market cannabis was available @ 1000 times the previous, legal price...\n\n Cannabis eventually becomes legally available again, but at the insanely high black market price?.... \n\n It should return to pre prohibition prices, but certain people want to keep the legal market price the same and maintain the artificial black market price... (because they are assholes wanting to make money from a substance that should be near free) yet they pretend that they only care about 'society' and the benefits of taxation of cannabis (at the artificially inflated price) for the benefit of schools, hospitals etc... Entirely disingenuous.... All about the money\n Market forces... Same product, same production methods but 'wokeness' leads to disingenuous advertising..",
            "title_similarity": "0.46898812",
            "sentiment_compound": 0.9319
        },
        {
            "id": "gwyab3b",
            "score": 2,
            "text": "Don't they buy all their garbage shit from flea markets in thailand ?",
            "title_similarity": "0.497139",
            "sentiment_compound": -0.5574
        },
        {
            "id": "gwyaep7",
            "score": 1,
            "text": "Pandora only sells low end shite anyway, 9ct, silver, zirconia...they don't make tiaras for Princesses..\n\nThis is just virtue signalling for free publicity",
            "title_similarity": "0.6830211",
            "sentiment_compound": 0.6124
        },
        {
            "id": "gwyc36g",
            "score": 1,
            "text": "Same price though. They aren’t doing it cause it’s the right thing to do but because they can make more money off of it.",
            "title_similarity": "0.3279732",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwyccyk",
            "score": 1,
            "text": "When did they add diamonds to their streaming music platform?",
            "title_similarity": "0.48136312",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwycn57",
            "score": 2,
            "text": "This is analogous to bitcoin",
            "title_similarity": "0.1944359",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwyd8z8",
            "score": 1,
            "text": "i thought pandora was a music streaming service...",
            "title_similarity": "0.33314693",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwydruz",
            "score": 1,
            "text": "And diamond prices gonna fall now.\n\nGood.",
            "title_similarity": "0.42927033",
            "sentiment_compound": 0.6486
        },
        {
            "id": "gwyeinh",
            "score": 2,
            "text": "From what I've read, diamonds were rare before the South African fields were discovered and developed. \n\nThat they remained 'rare' and expensive after that is largely due to Cecil Rhodes. The history of the De Beers cartel is fascinating stuff.",
            "title_similarity": "0.44572517",
            "sentiment_compound": 0.5423
        },
        {
            "id": "gwyey21",
            "score": 1,
            "text": "And they’ll charge double for them since they’re “perfect”",
            "title_similarity": "0.19487506",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwyf26r",
            "score": 1,
            "text": "The value was always artificial. Millennials don’t buy diamonds, which might of reflected sales. There’s no difference between artificial diamonds and mined diamonds. If you think there is, something is wrong with you. A baby made in a lab is still a baby.",
            "title_similarity": "0.72319794",
            "sentiment_compound": -0.4404
        },
        {
            "id": "gwyf6ui",
            "score": 2,
            "text": "Thought it was talking about Pandora Radio for a second, was very confused.",
            "title_similarity": "0.39218473",
            "sentiment_compound": -0.3804
        },
        {
            "id": "gwyfwmi",
            "score": 1,
            "text": "And they will charge even more for the “slave free diamonds”",
            "title_similarity": "0.38200948",
            "sentiment_compound": 0.5106
        },
        {
            "id": "gwyg0ki",
            "score": 3,
            "text": "Diamonds are stupid anyway, waste of money in my opinion.",
            "title_similarity": "0.49074638",
            "sentiment_compound": -0.7351
        },
        {
            "id": "gwyg0yv",
            "score": 2,
            "text": "They could just pay the people who mine them the fair share for the work they did, vs the middle men sucking up all the wealth",
            "title_similarity": "0.25371855",
            "sentiment_compound": 0.743
        },
        {
            "id": "gwygexg",
            "score": 1,
            "text": "If the diamond isn't gathered from Neptune's rain, then you don't really love her.",
            "title_similarity": "0.5118402",
            "sentiment_compound": -0.2925
        },
        {
            "id": "gwyhg66",
            "score": 1,
            "text": "TIL Pandora sells diamonds.",
            "title_similarity": "0.52674353",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwyi273",
            "score": 1,
            "text": "They’re still selling tat at a RIDICULOUS markup and idiots are still falling for it.",
            "title_similarity": "0.26857352",
            "sentiment_compound": -0.5904
        },
        {
            "id": "gwyi3du",
            "score": 1,
            "text": "Most of us can't afford high-quality mined diamonds, and the lesser-quality stones aren't worth what they cost. But man-made stones are less expensive and have better color, cut, and clarity for the money. As time goes on and the market for man-made diamonds expands, there will be less demand for mined stones because they'll be seen as overpriced and less attractive than man-made diamonds.",
            "title_similarity": "0.4978947",
            "sentiment_compound": 0.8449
        },
        {
            "id": "gwyia3e",
            "score": 2,
            "text": "What does it matter? Diamonds aren't even rare. The problem with mining isn't that it is hard finding diamonds, it's that they treat the workers as less than slaves.",
            "title_similarity": "0.54097533",
            "sentiment_compound": -0.0772
        },
        {
            "id": "gwyilmu",
            "score": 1,
            "text": "What do they expect as an outcome? More buyers?",
            "title_similarity": "0.19788915",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwyji9l",
            "score": 2,
            "text": "Dems da breaks De Beers!",
            "title_similarity": "0.342211",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwykl45",
            "score": 1,
            "text": "As a jewelry store owner, fine jewelry and custom design, this is great news. We push lab grown because it’s more affordable and fits more people’s budgets. The people who want natural, are usually older and well off. The younger crowd, which is the demo we’re breaking into because they’re the ones that will sustain us, doesn’t care if it’s natural or not. Just the quality and the design. We used lab grown for my sister’s engagement ring and she loves it. It was about 5k out the door and if we went with natural diamonds were talking about almost 25k in diamonds alone.",
            "title_similarity": "0.3930386",
            "sentiment_compound": 0.9709
        },
        {
            "id": "gwyl844",
            "score": 1,
            "text": "I’ll only buy diamond as cutting tool.",
            "title_similarity": "0.6700336",
            "sentiment_compound": 0.2263
        },
        {
            "id": "gwym22r",
            "score": 1,
            "text": "So DeBeers is going to bring the wrath to Pandora?  After all they are the ones got rich by advertising \"A Diamond is girl's best friend\" and 3 Months salary nonsense?",
            "title_similarity": "0.41173822",
            "sentiment_compound": 0.9013
        },
        {
            "id": "gwymajh",
            "score": 1,
            "text": "Well then Pandora should sell their crap at a 50% discount from now on. And to those who will still buy their stuff at full price.. no words for you.",
            "title_similarity": "0.42244953",
            "sentiment_compound": -0.4019
        },
        {
            "id": "gwymhhx",
            "score": 1,
            "text": "Read the book The Heartless Stone by Mark Zoellner. Awesome series of semi-connected essays/stories about the diamond trade.",
            "title_similarity": "0.48160022",
            "sentiment_compound": 0.5106
        },
        {
            "id": "gwyn073",
            "score": 1,
            "text": "Aren't synthetic diamonds made by sintering diamond dust? Diamond dust is made from non-gem grade diamonds. Won't those still need to be mined?",
            "title_similarity": "0.6906588",
            "sentiment_compound": 0.6322
        },
        {
            "id": "gwyo4ts",
            "score": 1,
            "text": "So they are dropping prices by 95%, right?",
            "title_similarity": "0.32553357",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwyopeo",
            "score": 1,
            "text": "“Sellers of a useless rock upset that they have bloodless competition with lab made useless rocks.”",
            "title_similarity": "0.4833223",
            "sentiment_compound": -0.802
        },
        {
            "id": "gwypgsg",
            "score": 1,
            "text": "Also, fuck DeBeers.",
            "title_similarity": "0.27906197",
            "sentiment_compound": -0.5423
        },
        {
            "id": "gwyphdy",
            "score": 1,
            "text": "They better say made in China",
            "title_similarity": "0.3003065",
            "sentiment_compound": 0.4404
        },
        {
            "id": "gwyps0e",
            "score": 1,
            "text": "The phrase \"conflict diamond\" didn't come out of my mouth.  But cool straw man?",
            "title_similarity": "0.4083113",
            "sentiment_compound": 0.4588
        },
        {
            "id": "gwyr9r6",
            "score": 1,
            "text": "Pandora sold diamonds? is glass mined?",
            "title_similarity": "0.44674712",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwyrdaw",
            "score": 1,
            "text": "Pandora music? What? Huh?",
            "title_similarity": "0.2905806",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwyrw6g",
            "score": 1,
            "text": "That really sucks. They charge a lot of money and at least hopefully they lower the price on their charms if they do this but probably not it’ll be more expensive. These people are ridiculous we have diamonds real diamonds not man-made diamonds that’s crap",
            "title_similarity": "0.4882025",
            "sentiment_compound": -0.7466
        },
        {
            "id": "gwyrxev",
            "score": 1,
            "text": "Think of all those poor African kids who are going to be out of a job",
            "title_similarity": "0.30971727",
            "sentiment_compound": -0.4767
        },
        {
            "id": "gwys8ao",
            "score": 1,
            "text": "DeBeers just threw up in its mouth a little.",
            "title_similarity": "0.21488178",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwysf2a",
            "score": 1,
            "text": "So will the prices fall? *sitcom laugh track*",
            "title_similarity": "0.30894196",
            "sentiment_compound": 0.5574
        },
        {
            "id": "gwysp2n",
            "score": 1,
            "text": "So their prices will go down a lot right",
            "title_similarity": "0.28186166",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwyssr0",
            "score": 1,
            "text": "I mean they should just stick to music streaming.",
            "title_similarity": "0.40601015",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwyt0p1",
            "score": 1,
            "text": "Wtf my internet radio sells diamonds lollllllll",
            "title_similarity": "0.40120363",
            "sentiment_compound": -0.5859
        },
        {
            "id": "gwyt404",
            "score": 1,
            "text": "So what you're saying is... It will now be adorable to buy this shit for my wife?",
            "title_similarity": "0.28069237",
            "sentiment_compound": -0.2617
        },
        {
            "id": "gwytf5y",
            "score": 1,
            "text": "I bought my wife her ring from a lab made producer. People were bonkers at how it looked. After a year I told her where I got it. She still loves her rings and wasnt against the idea. Told her I didnt want to waste months not married to her and having to save so much money for a ring. Plus it allowed me to save and pay for us to have two weeks in France. Married without wasting time, awesome honeymoon, and a nicer ring with bigger stone is a win win. Only problem with big companies switching to lab grow is that they wont offer the advantage of affordability like the companies that have been serving us them for years.",
            "title_similarity": "0.43655527",
            "sentiment_compound": 0.9603
        },
        {
            "id": "gwytgmi",
            "score": 1,
            "text": "As someone who once sat outside of a Pandora store for 15 minutes waiting for my friend to go to the bathroom, Pandora is a place where poor people go to buy fake shit to make themselves feel rich.\n\nAnd I’m not talking about lab diamonds I’m talking about true J-waste crap.",
            "title_similarity": "0.4580083",
            "sentiment_compound": -0.4215
        },
        {
            "id": "gwyuttw",
            "score": 1,
            "text": "Cool I'm probably still too poor to afford them",
            "title_similarity": "0.23977995",
            "sentiment_compound": -0.2023
        },
        {
            "id": "gwyvip8",
            "score": 1,
            "text": "Bold move for a website that does internet radio",
            "title_similarity": "0.21700081",
            "sentiment_compound": 0.3818
        },
        {
            "id": "gwywbi0",
            "score": 1,
            "text": "Better lower their prices then lol",
            "title_similarity": "0.31766772",
            "sentiment_compound": 0.5423
        },
        {
            "id": "gwywudj",
            "score": 1,
            "text": "Imo lab-made ones should be more expensive than natural ones because they're bound to be absolutely perfect and could be made to spec",
            "title_similarity": "0.35429335",
            "sentiment_compound": 0.7755
        },
        {
            "id": "gwywxut",
            "score": 1,
            "text": "I mean, diamonds are cool and all. But am I the only motherfucker sick and tired of getting Black Keys recommendations???",
            "title_similarity": "0.5080223",
            "sentiment_compound": -0.9484
        },
        {
            "id": "gwyx87e",
            "score": 1,
            "text": "Aren't diamonds basically worthless?",
            "title_similarity": "0.46539003",
            "sentiment_compound": 0.3412
        },
        {
            "id": "gwyxl0e",
            "score": 1,
            "text": "Profits must be higher",
            "title_similarity": "0.106496654",
            "sentiment_compound": 0.4404
        },
        {
            "id": "gwyxngx",
            "score": 1,
            "text": "Smart move.",
            "title_similarity": "-0.01617816",
            "sentiment_compound": 0.4019
        },
        {
            "id": "gwyxt4s",
            "score": 1,
            "text": "Still don't know why a diamond means fuck all to anyone",
            "title_similarity": "0.48358896",
            "sentiment_compound": -0.2732
        },
        {
            "id": "gwyxw2c",
            "score": 1,
            "text": "Diamonds, I always thought, were stupid investment the second I knew we could make them to a precious stone quality, and even better than nature.  \n\n\nThe \"value\" used to be the fact it took millions of years to make........",
            "title_similarity": "0.5223647",
            "sentiment_compound": 0.6808
        },
        {
            "id": "gwyy2ga",
            "score": 1,
            "text": "And now, the stockpile of mined diamonds pandora has been building up is worth triple the price .. easy when you create your own scarcity",
            "title_similarity": "0.3741974",
            "sentiment_compound": 0.7096
        },
        {
            "id": "gwyyefp",
            "score": 1,
            "text": "Don't believe everything the industry tells you. Laboratory grown diamonds are not proven to be more environmentally friendly (in fact, the FTC prohibits the term \"Environmentally Friendly\", unless proven in a long, grueling process.) Energy and resources are still astronomical. Underpaid workers in (usually) Asia or Africa still have to cut and polish those lab-grown diamonds. The only difference is switching the source from a local depleting diamond mine, to a lab. Also, an approximate 30% lower price in an honest market. Pandora has one of the largest mark-ups in the jewelry industry. This is only a campaign to make them look good; not an honest attemot at doing any good.",
            "title_similarity": "0.5819389",
            "sentiment_compound": 0.9228
        },
        {
            "id": "gwyyq8e",
            "score": 1,
            "text": "The music streaming company??",
            "title_similarity": "0.22063304",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwyyuw5",
            "score": 1,
            "text": "Can someone explain to me why diamonds are considered valuable? The scarcity?",
            "title_similarity": "0.4247042",
            "sentiment_compound": 0.5362
        },
        {
            "id": "gwyyy4u",
            "score": 1,
            "text": "Good! Diamonds are a crap stone (exception being mechanical and electronic applications) and any dolt who buys his significant other a real diamond is a f’ing idiot.",
            "title_similarity": "0.5706376",
            "sentiment_compound": 0.126
        },
        {
            "id": "gwyzmak",
            "score": 1,
            "text": "This increasing the price of the diamonds they have",
            "title_similarity": "0.3114738",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwyzwj9",
            "score": 1,
            "text": "And will these diamonds be extremely cheap or the same price",
            "title_similarity": "0.32004496",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwyzyop",
            "score": 1,
            "text": "I suspect they’ll release a specific amount in an effort to not over saturate the market so they can continue to sell laboratory diamonds at market value.",
            "title_similarity": "0.6227722",
            "sentiment_compound": 0.0516
        },
        {
            "id": "gwz06aq",
            "score": 1,
            "text": "The real news to me was that Pandora sold actual diamonds",
            "title_similarity": "0.5026995",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwz0ise",
            "score": 1,
            "text": "So they're going to charge $10 per carat?",
            "title_similarity": "0.2870863",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwz1adr",
            "score": 1,
            "text": "My first thought: \"Why tf does a streaming music service sell jewelry?\"\n\nMy next thought: \"Wait.\"",
            "title_similarity": "0.4337365",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwz27zp",
            "score": 1,
            "text": "Ain’t no blood on my hands! I was so happy my now husband got me a moissanite ring. So many ethical and moral implications to diamonds. Also my rock shimmers and people are always staring. I find myself staring! It isn’t the most important part of the whole thing too! Just a symbol. Happy it’s cheaper and more ethical",
            "title_similarity": "0.45856333",
            "sentiment_compound": 0.9544
        },
        {
            "id": "gwz2k8l",
            "score": 1,
            "text": "They’ll be acquired by DeBeers by week end.",
            "title_similarity": "0.26537874",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwz2mnu",
            "score": 1,
            "text": "Still not buying diamonds just to spite the baby boomers. I want to kill all of their beloved industries.",
            "title_similarity": "0.59279335",
            "sentiment_compound": -0.6705
        },
        {
            "id": "gwz31re",
            "score": 1,
            "text": "Are they going to lower prices to accommodate the fact that their industry has been full of false scarcity for decades and with lab made diamonds theres no excuse for this scalping?",
            "title_similarity": "0.5796479",
            "sentiment_compound": -0.3447
        },
        {
            "id": "gwz3evp",
            "score": 1,
            "text": "I have a Montana sapphire that was mined and cut by a woman who lives in Montana. It’s her family business and her dad taught her to mine and cut. So much less expensive than a diamond, but still spendy enough ($1275 for the stone) but it’s ethically, locally sourced and supporting a small family business.",
            "title_similarity": "0.42843992",
            "sentiment_compound": 0.5346
        },
        {
            "id": "gwz3nm3",
            "score": 1,
            "text": "Boom goes either their sales or their prices",
            "title_similarity": "0.16935557",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwz3ytj",
            "score": 1,
            "text": "Pandora is schlocky jewelry in the first place. Putting real diamonds in the equivalent of pre-teen charm brackets seemed like a poor use of resources.",
            "title_similarity": "0.5675021",
            "sentiment_compound": 0.2732
        },
        {
            "id": "gwz4pcs",
            "score": 1,
            "text": "Gross. They are going to put 1,000s of kids out of work.",
            "title_similarity": "0.45526344",
            "sentiment_compound": -0.4767
        },
        {
            "id": "gwz53rr",
            "score": 1,
            "text": "Neat! I’m a jeweler and try to use as many ethically sourced materials as I can, which is kinda hard in this industry. \nThankfully I haven’t had a ton a push back from clients about using lab made stones, but big brands making shifts like this will hopefully help normalize it more",
            "title_similarity": "0.52414536",
            "sentiment_compound": 0.9258
        },
        {
            "id": "gwz5okn",
            "score": 1,
            "text": "You know that expensive engagement ring you bought last week? It just lost 2/3 of its value. You feel good about that?",
            "title_similarity": "0.38548374",
            "sentiment_compound": 0.7476
        },
        {
            "id": "gwz5ouz",
            "score": 2,
            "text": "Call me a simple person but I was trying to figure out when a music streaming company started selling diamonds.",
            "title_similarity": "0.5557068",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwz5phy",
            "score": 1,
            "text": "DeBeers will suppress that effort.",
            "title_similarity": "0.47950956",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwz6l2i",
            "score": 1,
            "text": "After decades of getting modern braceleted workers to create trinkets for bracelets, we now have a moral to be upstanding people. Good job a-holes",
            "title_similarity": "0.3403108",
            "sentiment_compound": 0.6124
        },
        {
            "id": "gwz6u44",
            "score": 1,
            "text": "They are gonna be cheaper, right....? Right?",
            "title_similarity": "0.170566",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwz85d5",
            "score": 2,
            "text": "This seems like an advertising ploy just before Mother’s Day.",
            "title_similarity": "0.27562708",
            "sentiment_compound": 0.3612
        },
        {
            "id": "gwz8p16",
            "score": 3,
            "text": "Why not use the diamonds that take up an entire facility that the de beers family uses? They literally hoard the diamonds to drive up their value, the diamonds are in such an abundance they’re worthless without the De Beers hoarding them like that.",
            "title_similarity": "0.5786142",
            "sentiment_compound": 0.25
        },
        {
            "id": "gwz8rob",
            "score": 2,
            "text": "Who tf cares? Diamonds have been reportedly stupid for nearly a decade. Also Pandora sucks.",
            "title_similarity": "0.4498654",
            "sentiment_compound": -0.4404
        },
        {
            "id": "gwz8t5k",
            "score": 2,
            "text": "This will only increase the value of mined diamonds.",
            "title_similarity": "0.5602046",
            "sentiment_compound": 0.5719
        },
        {
            "id": "gwz8xcw",
            "score": 1,
            "text": "[deleted]",
            "title_similarity": "0.3195309"
        },
        {
            "id": "gwz9wkl",
            "score": 1,
            "text": "So, does this mean their diamond jewelry will be cheaper since it's lab created? I mean, lab created diamonds are sold for less than mined diamonds, it would make sense. It'll be interesting to see what happens. \n\n(Just in case it says in the article, the article won't load for me - idk if it's due to a firewall at work or a Reddit hug of death)",
            "title_similarity": "0.63963705",
            "sentiment_compound": 0.7096
        },
        {
            "id": "gwzaqiu",
            "score": 1,
            "text": "An actual jeweller can tell difference between and nothing will change!  It’s just us that shop at pandora...big ballers will still get those uncut pink Congo shit!",
            "title_similarity": "0.5487754",
            "sentiment_compound": -0.6351
        },
        {
            "id": "gwzaxfq",
            "score": 1,
            "text": "I didn’t even know Pandora sold diamonds. I thought they just sold garbage.",
            "title_similarity": "0.5854613",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwzb5mv",
            "score": 1,
            "text": "Are diamonds the new fur?",
            "title_similarity": "0.4426442",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwzb5vi",
            "score": 1,
            "text": "Back to the music business, I see",
            "title_similarity": "0.31621355",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwzb6nb",
            "score": 2,
            "text": "Am I the only one noticing the irony of a jeweler not selling diamonds because mining them is bad for the environment, as if gold and silver are?",
            "title_similarity": "0.53973883",
            "sentiment_compound": -0.5719
        },
        {
            "id": "gwzbaxl",
            "score": 1,
            "text": "So all diamonds are now worthless...",
            "title_similarity": "0.645578",
            "sentiment_compound": -0.4404
        },
        {
            "id": "gwzbt2c",
            "score": 1,
            "text": " diamonds are just carbon in special arrangement,",
            "title_similarity": "0.6141394",
            "sentiment_compound": 0.4019
        },
        {
            "id": "gwzca9m",
            "score": 1,
            "text": "Tear down the De Beers! 💎🔨",
            "title_similarity": "0.37298706",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwzcdop",
            "score": 1,
            "text": "The engagement ring episode of Adam Ruins everything shows you how brilliant diamond marketing is, and how dumb we are for falling for it.",
            "title_similarity": "0.50295365",
            "sentiment_compound": 0.34
        },
        {
            "id": "gwzcjqt",
            "score": 1,
            "text": "As long as they call them glass...",
            "title_similarity": "0.17059913",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwzcr3p",
            "score": 1,
            "text": "So now they're filthy billionaires they'll be 'good guys'?! Awww.... it warms my heart.",
            "title_similarity": "0.17533773",
            "sentiment_compound": 0.8588
        },
        {
            "id": "gwzctt9",
            "score": 1,
            "text": "Epic",
            "title_similarity": "0.008294496",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwzcxrz",
            "score": 2,
            "text": "I don’t get it, since when does Pandora sell diamonds? I shop there and its mostly cheap jewelry overpriced due to the brand. Most of the products are sterling silver, prob 70% of what they sell. The gold stuff is only 18k plated, only very very few items are made of 18k gold, maybe 1% of what they sell. I don’t remember seeing diamonds, all the stones in the jewelry are cheap cubic zirconias.",
            "title_similarity": "0.5250437",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwzd5um",
            "score": 1,
            "text": "There are artificial versions of all of these.",
            "title_similarity": "0.25006098",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwzd8gi",
            "score": 1,
            "text": "Pandora sells diamonds? In other news five Guys no longer considered fine dining.",
            "title_similarity": "0.48643598",
            "sentiment_compound": -0.1027
        },
        {
            "id": "gwzd97v",
            "score": 1,
            "text": "What an exceptional way to increase the value of mined diamonds.",
            "title_similarity": "0.31916714",
            "sentiment_compound": 0.6077
        },
        {
            "id": "gwzdjg7",
            "score": 1,
            "text": "So, is the fucking price going to go down?",
            "title_similarity": "0.28799552",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwzdks6",
            "score": 3,
            "text": "There are so many diamonds in DeBeers vaults that if they were all released in the market, they’d literally be worth a bit less than copper.",
            "title_similarity": "0.5059892",
            "sentiment_compound": 0.2263
        },
        {
            "id": "gwzdr8k",
            "score": 1,
            "text": "Can we make lab made hair to fix my damn receding hair line then",
            "title_similarity": "0.42617473",
            "sentiment_compound": -0.4019
        },
        {
            "id": "gwzdttx",
            "score": 2,
            "text": "I fuck with that so hard",
            "title_similarity": "0.13047303",
            "sentiment_compound": -0.656
        },
        {
            "id": "gwze51v",
            "score": 1,
            "text": "They should stop making people listen to ads",
            "title_similarity": "0.54670155",
            "sentiment_compound": -0.296
        },
        {
            "id": "gwze7ef",
            "score": 2,
            "text": "I bet they'll keep selling them at the same prices tho",
            "title_similarity": "0.23201746",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwzed41",
            "score": 1,
            "text": "So the price  of diamonds will plummet?",
            "title_similarity": "0.40812078",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwzeiog",
            "score": 1,
            "text": " Avatar",
            "title_similarity": "0.12591767",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwzej1p",
            "score": 1,
            "text": "So I should expect to pay 30% less then.",
            "title_similarity": "0.28510955",
            "sentiment_compound": -0.1027
        },
        {
            "id": "gwzel9e",
            "score": 1,
            "text": "Sooo what you're saying is Diamonds will be cheaper now since they can be mass produced?",
            "title_similarity": "0.43429828",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwzf51n",
            "score": 2,
            "text": "\"but do the laws of supply and demand, no-one wants to buy *diamonds* because they're *being made in labs*\" idk but this seems like it will decrease diamond cost",
            "title_similarity": "0.7346314",
            "sentiment_compound": 0.6124
        },
        {
            "id": "gwzgven",
            "score": 2,
            "text": "And people will bitch that the artificial diamonds are in some fake bullshit way distinguishable from natural diamonds, which only have value due to artificial scarcity and marketing.",
            "title_similarity": "0.5296817",
            "sentiment_compound": -0.7783
        },
        {
            "id": "gwzhv7m",
            "score": 1,
            "text": "Can you really even tell the difference?",
            "title_similarity": "0.19294253",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwzip31",
            "score": 2,
            "text": "get her a ring pop. And some fake gold chains or something. Actual jewelry is stupid. It’d be nice someday as like a physical display of wealth like “damn I earned this” but nah buying a ring way above your means is dumb. And if she expects that, then she’s probably not the one. It’s about the sentiment not the physical value. Gifts in general are stressful and unnecessary. The only gifts I ever remember are the heartfelt ones that get given to me randomly.",
            "title_similarity": "0.542518",
            "sentiment_compound": -0.7231
        },
        {
            "id": "gwzjb8j",
            "score": 2,
            "text": "Either way you're still paying an absurd amount for a stupid rock",
            "title_similarity": "0.36985868",
            "sentiment_compound": -0.5267
        },
        {
            "id": "gwzjgc4",
            "score": 2,
            "text": "Then why the fuck would I buy a diamond for 3 months salary. Fuck the diamond industry, I'm glad I'll get to see it burn down.",
            "title_similarity": "0.49042198",
            "sentiment_compound": -0.0516
        },
        {
            "id": "gwzlwaa",
            "score": 1,
            "text": "What about unobtainium??!",
            "title_similarity": "0.32196447",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwzqeo0",
            "score": 1,
            "text": "What’s gonna happen next? Disney plus becomes free?",
            "title_similarity": "0.41580516",
            "sentiment_compound": 0.5661
        },
        {
            "id": "gwzw0r9",
            "score": 1,
            "text": "why do people still want diamonds? I mean, opal is so much more pretty",
            "title_similarity": "0.3930276",
            "sentiment_compound": 0.6195
        },
        {
            "id": "gwzx0oo",
            "score": 1,
            "text": "Well it looks we've come to the point where lab grown diamonds are now cheaper than blood diamonds. Congrats pandora more power to you",
            "title_similarity": "0.5034514",
            "sentiment_compound": 0.6705
        },
        {
            "id": "gx000tn",
            "score": 1,
            "text": "How long until people start arguing the morality of lab-made diamond the same way people once did on lab-grown meat?",
            "title_similarity": "0.5693036",
            "sentiment_compound": -0.1531
        },
        {
            "id": "gx02vm4",
            "score": 1,
            "text": "Nice. Finally bigger quality flawless diamonds. :D\n\nNow let's do this to other cartel owned products. \nOil? - How's that synthetic oil coming along?",
            "title_similarity": "0.5155852",
            "sentiment_compound": 0.8883
        },
        {
            "id": "gx04d70",
            "score": 1,
            "text": "Before buying a  ring I discussed my thoughts on the Diamond Industry with my fiance and she was perfectly happy to get a nice moissanite ring. No regrets, and she likes showing it off.",
            "title_similarity": "0.33758888",
            "sentiment_compound": 0.9517
        },
        {
            "id": "gx0a0vy",
            "score": 1,
            "text": "I thought pandora was already overpriced costume jewelry, this just makes me dislike them more lol",
            "title_similarity": "0.45447528",
            "sentiment_compound": 0.1263
        },
        {
            "id": "gx0ed11",
            "score": 1,
            "text": "Such wokeness",
            "title_similarity": "0.07348769",
            "sentiment_compound": 0.0
        },
        {
            "id": "gx0fezr",
            "score": 1,
            "text": "Can you really tell the difference?",
            "title_similarity": "0.11205599",
            "sentiment_compound": 0.0
        },
        {
            "id": "gx0flmb",
            "score": 1,
            "text": "So they are still worthless",
            "title_similarity": "0.3374787",
            "sentiment_compound": -0.4404
        },
        {
            "id": "gx0nbcv",
            "score": 1,
            "text": "  Is Spotify planning on following suit?",
            "title_similarity": "0.19650921",
            "sentiment_compound": 0.0
        },
        {
            "id": "gx1aq06",
            "score": 2,
            "text": "*But they won’t be getting any cheaper*",
            "title_similarity": "0.39851272",
            "sentiment_compound": 0.0
        },
        {
            "id": "gx284wf",
            "score": 1,
            "text": "I worked at pandora and we never sold actually diamonds",
            "title_similarity": "0.669487",
            "sentiment_compound": 0.0
        },
        {
            "id": "gx2vdpa",
            "score": 1,
            "text": "This isn't NEWs it's OLDs",
            "title_similarity": "0.36596388",
            "sentiment_compound": 0.0
        },
        {
            "id": "gx3a1g5",
            "score": 1,
            "text": "Well I wish we would stop making holes in the earth, I’m afraid it will implode and we’ll all fall in from all the mining, oil and gas and fracking that is going on.",
            "title_similarity": "0.53592527",
            "sentiment_compound": 0.3818
        },
        {
            "id": "gx4wbcy",
            "score": 2,
            "text": "More job losses for Black South Africans then? Wait till media learns about it",
            "title_similarity": "0.39083722",
            "sentiment_compound": -0.4549
        },
        {
            "id": "gx51jlp",
            "score": 1,
            "text": "He went to Jared.",
            "title_similarity": "0.12554659",
            "sentiment_compound": 0.0
        },
        {
            "id": "gx57yzn",
            "score": 1,
            "text": "Made in the microwave",
            "title_similarity": "0.20247367",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxa5n4i",
            "score": 1,
            "text": "I support lab-grown diamonds I just think people should shop them with smaller brands!",
            "title_similarity": "0.48865336",
            "sentiment_compound": 0.4574
        },
        {
            "id": "gxdm0fy",
            "score": 1,
            "text": "Good, but I'm not giving them any brownie points for doing something they should have done she's ago.",
            "title_similarity": "0.58197695",
            "sentiment_compound": -0.1541
        },
        {
            "id": "gya5tpx",
            "score": 1,
            "text": "It rains diamonds inside neptune.",
            "title_similarity": "0.41207743",
            "sentiment_compound": 0.0
        },
        {
            "id": "gz0quoq",
            "score": 1,
            "text": "What they mean is, people are too poor to spend",
            "title_similarity": "0.29387465",
            "sentiment_compound": -0.4767
        },
        {
            "id": "gzy6olg",
            "score": 1,
            "text": "this is gonna happen with food mock my wuuuurdddddsss",
            "title_similarity": "0.12938067",
            "sentiment_compound": -0.4215
        },
        {
            "id": "h04yhfj",
            "score": 1,
            "text": "I don’t care. Never shopped with them anyway. They might as well cease to exist. 🪄",
            "title_similarity": "0.65888584",
            "sentiment_compound": 0.6486
        }
    ]
}