{
    "Joe Biden to donate 75% of unused COVID vaccines to UN-backed global vaccine program\n": [
        {
            "id": "h0gtqw6",
            "score": -6,
            "text": "[deleted]",
            "title_similarity": "-0.022515053"
        },
        {
            "id": "h0gvj2p",
            "score": 2,
            "text": "Loving the switch up in administration.  \n  \nTrump would have sold them with his hands printed on em like a logo.  👐",
            "title_similarity": "0.41468778",
            "sentiment_compound": 0.7506
        },
        {
            "id": "h0gvq3y",
            "score": 4,
            "text": "[removed]",
            "title_similarity": "-0.06395121"
        },
        {
            "id": "h0h1u10",
            "score": 8,
            "text": "Conservatives will complain that he is giving away our vaccines, even though they wouldn't get the vaccine anyway.",
            "title_similarity": "0.5319736",
            "sentiment_compound": -0.0258
        },
        {
            "id": "h0h2vdk",
            "score": 0,
            "text": "Ok, now watch all these right wing anti vax lunatics say \"THOSE VACCINES WERE MADE FOR AMERICANS, AND BIDEN IS GIVING THEM AWAY! WE NEED THOSE HERE!\"",
            "title_similarity": "0.60862637",
            "sentiment_compound": -0.3294
        },
        {
            "id": "h0gwu80",
            "score": 12,
            "text": "Only now ?!?!? EU is donating from the start",
            "title_similarity": "0.27407527",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0ge60v",
            "score": 9,
            "text": "This is great but wasn’t there a thing where this stuff should be super cold?",
            "title_similarity": "0.13189201",
            "sentiment_compound": 0.836
        },
        {
            "id": "h0h95az",
            "score": -8,
            "text": "Congratulations US taxpayers. Another couple of billions of your money going to big pharma, and don't forget the big guy's cut.",
            "title_similarity": "0.6408303",
            "sentiment_compound": 0.5371
        },
        {
            "id": "h0gl2qs",
            "score": -45,
            "text": "title is a bit curious, why \"Joe Biden\" rather than \"United States\"?\n MSM propping up old joe every chance they get",
            "title_similarity": "0.42146936",
            "sentiment_compound": 0.7269
        },
        {
            "id": "h0ien1f",
            "score": 0,
            "text": "Imagine where we’d be if trump was still defacing the office of the president? \n\nStates would be holding hunger game style tournaments for vaccine supply…(and no that does not sound fun)",
            "title_similarity": "0.5243705",
            "sentiment_compound": -0.7097
        },
        {
            "id": "h0gs7zn",
            "score": -14,
            "text": "And yet refuses to waive IP restrictions so these vaccines can be manufactured \nand distributed by these countries themselves rather than having to wait for their populations to be significantly vaccinated three or four years from now",
            "title_similarity": "0.5088546",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0goywy",
            "score": 28,
            "text": "I've been saying for awhile that the best way to get conservatives to get the vaccine is tell them we are giving them to other countries.",
            "title_similarity": "0.5842111",
            "sentiment_compound": 0.765
        },
        {
            "id": "h0gkhg0",
            "score": 15,
            "text": "Master stroke in reverse psychology. He could’ve also said blacks and gays were able to go to the top of the queue and the trumpets wouldn’t still fell into the trap.",
            "title_similarity": "0.41260865",
            "sentiment_compound": -0.128
        },
        {
            "id": "h0hxklz",
            "score": 5,
            "text": "\"Biden Administration follows through with former Administrations plan - project warp speed, which included sending excess ventilators and vaccine to countries in need\" \n\nTHERE fixed the headline for ya",
            "title_similarity": "0.62843275",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0irray",
            "score": -1,
            "text": "I will believe anything that Biden says he's going to do only AFTER he does it. His entire career he's been lying and his presidency has been nothing but lies so far.",
            "title_similarity": "0.3844231",
            "sentiment_compound": 0.2018
        },
        {
            "id": "h0hvxh0",
            "score": 3,
            "text": "Biden??? OH! You mean the American tax payers. Got ya 😉",
            "title_similarity": "0.413693",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0ho2x7",
            "score": 0,
            "text": "Operation warp speed worked",
            "title_similarity": "0.11622968",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0h8c44",
            "score": -7,
            "text": "It’s almost like he is smart",
            "title_similarity": "-0.00508908",
            "sentiment_compound": 0.6003
        },
        {
            "id": "h0h9yw9",
            "score": 1,
            "text": "It’s about time!!!\n\n\nMaybe all Trumpy anti vaxxers will get upset about this and insist it be used on Americans. That is, them. 😜🤷🏻‍♀️",
            "title_similarity": "0.36157578",
            "sentiment_compound": -0.6981
        },
        {
            "id": "h0hequ9",
            "score": 3,
            "text": "“Talk to your doctor.” That’s all that has to be said.\nI do not need a random celebrity, or doctor that’s doesn’t even know my medical records, to tell me “be part of the team, take the vaccine.”\n\nTalk to your doctor should have been the message from the beginning.\n\nP.S. Yes, I have my vaccine appointment scheduled to talk to my doctor. Before “some” of you start spouting,” You’re one of them! Oh my God how...” Yes I’m putting this here because I’ve been accused of such things before, and I’m tired of it.",
            "title_similarity": "0.53792834",
            "sentiment_compound": 0.4003
        },
        {
            "id": "h0gugxq",
            "score": 4,
            "text": "What are the chances that republicans are going to require new immigrants to prove they have had the COVID-19 vaccine that they themselves refuse to take?",
            "title_similarity": "0.52329516",
            "sentiment_compound": -0.1027
        },
        {
            "id": "h0h3ni3",
            "score": -3,
            "text": "The antivaxers are gonna lose their shit, he's giving away vaccines they didn't want, but feel they deserve.",
            "title_similarity": "0.48940992",
            "sentiment_compound": -0.3738
        },
        {
            "id": "h0hplqr",
            "score": -3,
            "text": "So nice of him to come out of the taxpayers pockets like that. That's personal sacrifice I can respect, right there.",
            "title_similarity": "0.24746907",
            "sentiment_compound": 0.8268
        },
        {
            "id": "h0ha1oy",
            "score": -13,
            "text": "lets just ignore the fact that they've got so many spares is because they were hoarding them",
            "title_similarity": "0.23663935",
            "sentiment_compound": -0.3612
        },
        {
            "id": "h0hmiy5",
            "score": -9,
            "text": "Damn didn't know Joe Biden owned all the vaccines. How about American tax payers are donating 75% of unused vaccines?",
            "title_similarity": "0.8896687",
            "sentiment_compound": -0.4019
        },
        {
            "id": "h0iuosq",
            "score": 1,
            "text": "If there was a huge amount of side effects with the vaccines do you think you’d even hear of them? How could they release info like that with the amount of people who have received the vaccines.",
            "title_similarity": "0.525162",
            "sentiment_compound": 0.5859
        },
        {
            "id": "h0had01",
            "score": -22,
            "text": "Interesting to see how news headlines suddendly changed, from Trump is racist for liking ice cream to this.",
            "title_similarity": "0.3206864",
            "sentiment_compound": 0.1027
        },
        {
            "id": "h0h4k1j",
            "score": -4,
            "text": "It’s great to finally have a brilliant man in office, best president of my lifetime by a country mile",
            "title_similarity": "0.43522444",
            "sentiment_compound": 0.9201
        },
        {
            "id": "h0h0z4f",
            "score": 3,
            "text": "Ask most Europeans, and they still think highly of the US for helping stop Germany in WWII.\n\nThis is some of the cheapest, no-brainer diplomacy the US can do to counter Chinese influence, repair the damage Trump and the Capitol riots did to its image, and prevent Covid variants from popping up to kill Americans later.\n\nIf Covid's a war, it's not won just because it's been repelled from US shores.\n\nCompared to \"defense\" spending, this is an incredible return on investment.",
            "title_similarity": "0.44629017",
            "sentiment_compound": -0.9552
        },
        {
            "id": "h0gja88",
            "score": 55,
            "text": "> \"We are sharing these doses not to secure favors or extract concessions. We are sharing these vaccines to save lives and to lead the world in bringing an end to the pandemic, with the power of our example and with our values,\" Biden said.\n\nI don't think that's 100% honest. Of course it's also about diplomacy. China has been very aggressive on that front lately and the US was at risk of being seen as indifferent to the poor vaccine situation in the developing world.\n\nThe result is unequivocally a positive one though. If this turns into a competition of who can help the developing world the most and the fastest, I'm all for it.",
            "title_similarity": "0.5355935",
            "sentiment_compound": 0.8868
        },
        {
            "id": "h0gzg0w",
            "score": -24,
            "text": "A rare show of generosity and compassion coming from a famously selfish country. And I say that as an American.",
            "title_similarity": "0.324153",
            "sentiment_compound": 0.4939
        },
        {
            "id": "h0gja19",
            "score": 117,
            "text": "A great example of \"put your own oxygen mask first before assisting others\".",
            "title_similarity": "0.3267275",
            "sentiment_compound": 0.6249
        },
        {
            "id": "h0gs8bw",
            "score": 6,
            "text": "Awesome job, US.",
            "title_similarity": "-0.0071416143",
            "sentiment_compound": 0.6249
        },
        {
            "id": "h0hbg2z",
            "score": 11,
            "text": "Cool.\n\nMost of the people not vaccinating are in red states, or are trump supporters.\n\n\n\nFuck 'em, seriously we tried",
            "title_similarity": "0.51815486",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0gli1s",
            "score": -21,
            "text": "Isn’t it the US donating and not Joe Biden? Also some other countries are donating like Japan and Sweden.",
            "title_similarity": "0.39652035",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h0il33j",
            "score": 0,
            "text": "If Trump did this, he'd spend millions in tax payer dollars to have his name printed on everything.",
            "title_similarity": "0.5400521",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0inktt",
            "score": 0,
            "text": "This puppet is a bad joke. Look at him and you think, “come on man”",
            "title_similarity": "0.12169007",
            "sentiment_compound": -0.3182
        },
        {
            "id": "h0gzobk",
            "score": -66,
            "text": "[removed]",
            "title_similarity": "-0.06395121"
        },
        {
            "id": "h0ifa14",
            "score": -1,
            "text": "Depopulate the world. 👍🏼",
            "title_similarity": "0.17851594",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0iy04x",
            "score": -1,
            "text": "I wonder if the democrats will ever give credit to Trump for ramping up production distribution and removing regulatory roadblocks",
            "title_similarity": "0.46881303",
            "sentiment_compound": 0.3818
        },
        {
            "id": "h0gtvom",
            "score": 13,
            "text": "Republicans are going to be pissed when they find out the vaccines they refuse are going to foreign countries.",
            "title_similarity": "0.44882578",
            "sentiment_compound": -0.7506
        },
        {
            "id": "h0gqmyq",
            "score": -36,
            "text": "Translation: \"Corporate handlers have instructed their government employee to dump unwanted product to the 3rd world to minimize losses.\"\n\nI know, I know. I'm a horrible person according to your ego. I treat your downvote as a badge of honor.",
            "title_similarity": "0.41465437",
            "sentiment_compound": -0.5859
        },
        {
            "id": "h0hc4zt",
            "score": 0,
            "text": "The U.S. leads once again",
            "title_similarity": "0.16982877",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0i08s3",
            "score": 3,
            "text": "[removed]",
            "title_similarity": "-0.06395121"
        },
        {
            "id": "h0ica46",
            "score": 1,
            "text": "Brought to you by the US tax payer...",
            "title_similarity": "0.33712503",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0ihpli",
            "score": -1,
            "text": "Finally . A president who gives a shit about other people.",
            "title_similarity": "0.37155473",
            "sentiment_compound": -0.5574
        },
        {
            "id": "h0iq9q3",
            "score": -1,
            "text": "Can you spell a responsible living human?  Thank goodness.\nLast administration said publicly.... we should stop testing .... ( even in the early days there was no appropriate testing available within our country)...  \nHe said.... if we stop testing,,,  we have no cases.\nHas he read the nearly 600,000 lives lost?   Funerals of family members were lucky.\nThis former guy is wealthy and he does not, never did understand the heart beat of most Americans:   Yes, he has enraged the radical.   Not most of us.",
            "title_similarity": "0.54758584",
            "sentiment_compound": 0.7382
        },
        {
            "id": "h0h9ql8",
            "score": -1,
            "text": "[removed]",
            "title_similarity": "-0.06395121"
        },
        {
            "id": "h0i8lxg",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "-0.06395121"
        },
        {
            "id": "h0iqkrm",
            "score": 0,
            "text": "Giving away vaccine is all well and good but it will never come close to actually helping poorer developed countries get the amount they need.\n\nWhat we really need is Biden to support a large, general trips/patent waiver for covid related vaccines (all medicine really...) and then help those countries produce their own. Otherwise many poor counties in the global south will wait years until they're fully vaccinated.\n\nToo bad America is still pracrically run by corporations, it's better than trump, but we need much more to get over this together.",
            "title_similarity": "0.6075791",
            "sentiment_compound": 0.5859
        },
        {
            "id": "h0jigf6",
            "score": 0,
            "text": "I would have not subsidized the manufacturing of an experimental vaccine that doesn't protect you from getting or giving a virus that has a 99.98% rate of survival for people under 75. \n\nIt ain't hard if you have a functional brain genius",
            "title_similarity": "0.54695547",
            "sentiment_compound": 0.1311
        },
        {
            "id": "h0jjy2p",
            "score": 0,
            "text": "Now let’s hope the Trumpstain’s and Religious Right Die Off",
            "title_similarity": "0.25539362",
            "sentiment_compound": -0.25
        },
        {
            "id": "h0hvufu",
            "score": 1,
            "text": "So the tax payers are paying to vaccinate other countries",
            "title_similarity": "0.4885264",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0hxrt4",
            "score": 3,
            "text": "[deleted]",
            "title_similarity": "-0.022515053"
        },
        {
            "id": "h0i3p0f",
            "score": -2,
            "text": "They should make these vaccinations mandatory...",
            "title_similarity": "0.30322695",
            "sentiment_compound": 0.0772
        },
        {
            "id": "h0if9oe",
            "score": 3,
            "text": "Biden is a class act",
            "title_similarity": "0.13611066",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0h7asp",
            "score": -5,
            "text": "US protecting the world on the US taxpayers’ dollar (again)",
            "title_similarity": "0.47370994",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0glnxv",
            "score": 105,
            "text": "\"Of the first tranche of 25 million doses, the White House said about 19 million will go to COVAX, with approximately 6 million for South and Central America, 7 million for Asia and 5 million for Africa.\"\n\nMaybe this would motivate more Americans to start getting vaccinated. When we announce that we'll be giving it away to poorer countries full of black, brown and yellow people.",
            "title_similarity": "0.8016498",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h0h7jkv",
            "score": -11,
            "text": "What he unnecessarily horded in the first place.",
            "title_similarity": "0.15088697",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0go8bz",
            "score": 1,
            "text": "I think we all should transcend these baby steps and collectively make an effort to vaccinate as many people around the globe as possible. Considering the shit show that is going on in India, Latin America and elsewhere, this is a global problem. If anyone national program fails it would leave people elsewhere unsafe. Just ramp up vaccine availability and if national/local authorities could do with more support ,the  global community should make it available on a proactive basis. Otherwise this could linger on for some years.",
            "title_similarity": "0.5364634",
            "sentiment_compound": 0.624
        },
        {
            "id": "h0h55q1",
            "score": -3,
            "text": "Better late than never, I guess.",
            "title_similarity": "0.13543016",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h0ha3m3",
            "score": 2,
            "text": "Great, now waive IP protections, too. Let’s really get serious about defeating this PANDEMIC",
            "title_similarity": "0.28326946",
            "sentiment_compound": 0.2315
        },
        {
            "id": "h0hqui0",
            "score": -2,
            "text": "This is fucking useless. Release the patents, share the know-how. This is just a weak ass attempt to keep pharma profits",
            "title_similarity": "0.2786149",
            "sentiment_compound": -0.659
        },
        {
            "id": "h0i0c15",
            "score": 1,
            "text": "I didn't know they were his.",
            "title_similarity": "0.094801754",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0hvith",
            "score": -5,
            "text": "Yeah everyone had to just wait for the US to develop and pay for the vaccine and then wait for a handout 👍",
            "title_similarity": "0.5096925",
            "sentiment_compound": 0.2023
        },
        {
            "id": "h0gitu1",
            "score": 122,
            "text": "[removed]",
            "title_similarity": "-0.06395121"
        },
        {
            "id": "h0gsj0e",
            "score": -11,
            "text": "America is wastful, greed and profit will be prioritized 99% of the time. But this makes me happy. Hopefully they will release the patent to let everyone produce tbe vaccine if they haven't already.",
            "title_similarity": "0.60632885",
            "sentiment_compound": 0.8658
        },
        {
            "id": "h0h24a0",
            "score": -6,
            "text": "I would have typed out \"United Nations\" here. This headline reads very negatively. Anyone from r/conservative will surely be clickbaited if they see this. 🤣",
            "title_similarity": "0.39408594",
            "sentiment_compound": 0.836
        },
        {
            "id": "h0gu9s2",
            "score": 8,
            "text": "Republicans:\n\nJOE HUSSAIN BIDEN GIVES MONEY TO COMMUNISTS, PROBABLY TO HUGE CHAVEZ AND THE ANTIFA\n\nWait, are Republicans pro or anti vax now? I don't remember the details of the \"beautiful vaccine\" that they're so against taking...",
            "title_similarity": "0.49715397",
            "sentiment_compound": 0.6841
        },
        {
            "id": "h0hcjrd",
            "score": -3,
            "text": "That is really nobel. First restricting export and hoarding vaccines while there ar shortages everywhere. Now donating 75% of your hoarded stash…",
            "title_similarity": "0.82769173",
            "sentiment_compound": -0.5367
        },
        {
            "id": "h0iqihd",
            "score": -3,
            "text": "Joe biden hasn’t developed or participated in developing a vaccine and has nothing in his ownership to donate.",
            "title_similarity": "0.19117281",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0h4zdp",
            "score": -1,
            "text": "Wait for the the far right and anti vaxers to suddenly complain its our vaccinations keep them for Americans.... I can see it on fox news now.",
            "title_similarity": "0.53154427",
            "sentiment_compound": -0.5859
        },
        {
            "id": "h0h5x8j",
            "score": 1,
            "text": "Joe Biden himself is doing this?  Wow, what a guy",
            "title_similarity": "0.19978306",
            "sentiment_compound": 0.6705
        },
        {
            "id": "h0h7y0h",
            "score": 1,
            "text": "Good. These assholes think they are fake or otherwise don’t want em? Good fuck em.",
            "title_similarity": "0.100940734",
            "sentiment_compound": -0.6486
        },
        {
            "id": "h0h9gvd",
            "score": -1,
            "text": "Why didn’t Biden tell his son to sell them off to the highest bidder for personal gain, like the bigliest man would have done?",
            "title_similarity": "0.41540784",
            "sentiment_compound": 0.7096
        },
        {
            "id": "h0hk9ga",
            "score": 1,
            "text": "This is because he’s blocking third world countries from making thier own. This is like cutting of a homeless mans leg then giving him a sandwich.",
            "title_similarity": "0.4123802",
            "sentiment_compound": 0.2023
        },
        {
            "id": "h0hszc0",
            "score": 1,
            "text": "Fuck yes. It’s time the USA started showing some leadership in the world again.",
            "title_similarity": "0.3159525",
            "sentiment_compound": -0.2023
        },
        {
            "id": "h0hxdo6",
            "score": 1,
            "text": "The least the US could do after their trade restrictions destroyed basically all vaccine supply chains",
            "title_similarity": "0.5238958",
            "sentiment_compound": -0.4939
        },
        {
            "id": "h0hyi58",
            "score": -1,
            "text": "The other 25% are going in the trash because fuck the poor",
            "title_similarity": "0.4160971",
            "sentiment_compound": -0.765
        },
        {
            "id": "h0hzmtz",
            "score": 1,
            "text": "Im not so sure about this, donate the AZ and JJ but apparently we might need a booster dose of pfizer later, dont want to have none left right",
            "title_similarity": "0.43168843",
            "sentiment_compound": -0.0524
        },
        {
            "id": "h0i6m1o",
            "score": 1,
            "text": "Trump would have tried to sell publicly to the highest bidder smiling smugly thinking it was “good business” and Fox would have swooned.",
            "title_similarity": "0.38025224",
            "sentiment_compound": 0.4939
        },
        {
            "id": "h0i9u9y",
            "score": 1,
            "text": "Good. Every American has had an opportunity to get a vaccine already, and we've been absolutely spoiled in this situation while the rest of the world suffers. People who refuse the vaccine should simply lose their chance and have their vaccine available to someone else in need.",
            "title_similarity": "0.5237827",
            "sentiment_compound": -0.0772
        },
        {
            "id": "h0ia6cs",
            "score": 1,
            "text": "Is Joe personally donating them or is he giving them in the name of the american tax dollar that paid for them?",
            "title_similarity": "0.46161413",
            "sentiment_compound": 0.34
        },
        {
            "id": "h0ibrlr",
            "score": 1,
            "text": "Hooray for the UN!  They UN-Nazi’d the world!",
            "title_similarity": "0.28697833",
            "sentiment_compound": 0.5972
        },
        {
            "id": "h0ie3gr",
            "score": 1,
            "text": "America being great again.",
            "title_similarity": "0.23196158",
            "sentiment_compound": 0.6249
        },
        {
            "id": "h0immqe",
            "score": -1,
            "text": "Fuck biden…piece a shit",
            "title_similarity": "0.06769357",
            "sentiment_compound": -0.7964
        },
        {
            "id": "h0in9k1",
            "score": -1,
            "text": "Wow this made the front page but fauci didn’t? At this point you’re all willing to be deceived.",
            "title_similarity": "0.2606547",
            "sentiment_compound": -0.3506
        },
        {
            "id": "h0iomt6",
            "score": 1,
            "text": "When did Shotgun Joe come into possession of these vaccines?",
            "title_similarity": "0.52288437",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0jjeob",
            "score": -1,
            "text": "Title is wrong. Joe Biden didn’t donate, the American people did. Edit: the article has the correct title. OP made their own. The people are the government. Downvoting facts again Reddit.",
            "title_similarity": "0.43552557",
            "sentiment_compound": -0.4767
        },
        {
            "id": "h0jkk7x",
            "score": -1,
            "text": "First hoard global supply then give away excess to look good.",
            "title_similarity": "0.38266712",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h0jn4kg",
            "score": -1,
            "text": "The US donates, not Joe Biden.",
            "title_similarity": "0.26555523",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0jwprr",
            "score": -1,
            "text": "[deleted]",
            "title_similarity": "-0.022515053"
        },
        {
            "id": "h0h30lx",
            "score": 23,
            "text": "Cue a whole bunch of people in the US who refuse to get the vaccine complaining about this.",
            "title_similarity": "0.45178813",
            "sentiment_compound": -0.4588
        },
        {
            "id": "h0gjyhk",
            "score": 6,
            "text": "I don't see anything wrong with shipping out so much vaccine to other countries with people clamouring for access that Americans still unvaccinated might have trouble getting a shot.  Maybe having ro wait to get one will know make people value ii more",
            "title_similarity": "0.45656568",
            "sentiment_compound": 0.308
        },
        {
            "id": "h0gy6vw",
            "score": -21,
            "text": "Maybe we should sell them? \n\nI mean why is it always our responsibility to take care of the rest of the world at our taxpayer expense?\n\nPaying for them shouldn’t be that big of a deal for any legitimate country.",
            "title_similarity": "0.4074641",
            "sentiment_compound": 0.5514
        },
        {
            "id": "h0h1420",
            "score": 20,
            "text": "Thanks US.  \nI'm so glad you have a boring and normal president.",
            "title_similarity": "0.20903549",
            "sentiment_compound": 0.6669
        },
        {
            "id": "h0h7av2",
            "score": -20,
            "text": "Fuck Joe Biden",
            "title_similarity": "0.11873357",
            "sentiment_compound": -0.5423
        },
        {
            "id": "h0hx9nh",
            "score": -10,
            "text": "If Trump did this it wouldnt be reported",
            "title_similarity": "0.14096497",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0h6e28",
            "score": 18,
            "text": "Watch the anti-vaxx now bitch about how we care about the health of others than of our own",
            "title_similarity": "0.30378327",
            "sentiment_compound": -0.1531
        },
        {
            "id": "h0gyhcr",
            "score": -13,
            "text": "BUT WHAT ABOUT ALL US CONSERVATIVE ANTI-VAXXERS WHO HAVE REFUSED TO BE INNCOLUATED UNTIL NOW?!?!?!\n\n\nFUCKING SOCIALIST SLEEPY BIDEN\n\nTRUMP WOULD NEVER GIVE AWAY OUR PRECIOUS VACCINES I HAVE NO INTENT OF GETTING BECAUSE I FUCK MY DAUGHTER NIGHTLY AND MY SISTER WEEKLY WHICH JUST LEAVES NO TIME FOR THE DOCTOR'S OFFICE\n\nedit: holy fuck are you guys really that stupid that I have to put a \"/s\" to stop the downvotes? jesus tapdancing christ...................",
            "title_similarity": "0.46886122",
            "sentiment_compound": -0.9814
        },
        {
            "id": "h0hcgl9",
            "score": -3,
            "text": "So nice of him to distribute the leftovers from the vaccines they hoarded. What a hero.",
            "title_similarity": "0.50751436",
            "sentiment_compound": 0.7713
        },
        {
            "id": "h0iqvhr",
            "score": -4,
            "text": "Fuck Biden. Release the goddamn patents",
            "title_similarity": "0.24542814",
            "sentiment_compound": -0.765
        },
        {
            "id": "h0ja2sj",
            "score": -3,
            "text": "Thankfully I’m healthy, have anti-bodies & dont need one. Give em to someone who does ✌🏻",
            "title_similarity": "0.23730402",
            "sentiment_compound": 0.8271
        },
        {
            "id": "h0higud",
            "score": -6,
            "text": "\"**AMERICAN TAX PAYERS TO DONATE 75% OF UNUSED COVID VACCINES developed under the trump warp speed program.  JOE BIDEN TO TAKE CREDIT**\n\nFixed it for you",
            "title_similarity": "0.92302376",
            "sentiment_compound": 0.516
        },
        {
            "id": "h0gzwk0",
            "score": -10,
            "text": "I didn't realize he was the one making it!",
            "title_similarity": "0.14016087",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0i33rj",
            "score": -8,
            "text": "Trump 2024",
            "title_similarity": "0.32223654",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0gnvxz",
            "score": 53,
            "text": "[deleted]",
            "title_similarity": "-0.022515053"
        },
        {
            "id": "h0gseds",
            "score": -5,
            "text": "Seems like a month too late, could they have released this share sooner?",
            "title_similarity": "0.41548228",
            "sentiment_compound": 0.6124
        },
        {
            "id": "h0iulvl",
            "score": -5,
            "text": "Thank The Don",
            "title_similarity": "0.08298863",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h0h0u22",
            "score": 2,
            "text": "Waiting for the Fox News crowd to start complaining about giving away the vaccines they refused to take to other countries with people who actually want them.",
            "title_similarity": "0.4698969",
            "sentiment_compound": -0.0772
        },
        {
            "id": "h0h2she",
            "score": -2,
            "text": "Meanwhile Americans finally getting a universal care are like…. Nah bro",
            "title_similarity": "0.414402",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h0hb7k2",
            "score": -2,
            "text": "This is un-American! Sell that shit to the highest bidder! If you want a vaccine you’ve got to out in the work snd make or buy one yourself!  GEEEEZUS!! GEEEEZUS!!!",
            "title_similarity": "0.5777568",
            "sentiment_compound": -0.6671
        },
        {
            "id": "h0hcv4y",
            "score": 2,
            "text": "ITT: conservatives don’t want to get vaccinated and don’t want our unused vaccines being sent to people who will actually use them",
            "title_similarity": "0.38278887",
            "sentiment_compound": 0.1531
        },
        {
            "id": "h0hghnz",
            "score": 3,
            "text": "Or he could have just pressured the pharmaceutical goliaths to not keep their formulas protected by patents when we are talking literal life and death for other countries..",
            "title_similarity": "0.46485752",
            "sentiment_compound": -0.4404
        },
        {
            "id": "h0hnmo8",
            "score": 2,
            "text": "Please give them to Canada. They have an abysmally small number of vaccines.",
            "title_similarity": "0.4726224",
            "sentiment_compound": 0.3818
        },
        {
            "id": "h0hnpus",
            "score": 1,
            "text": "Does this mean the demonized young healthy Americans who opt out are doing the underprivileged of the world a solid?",
            "title_similarity": "0.43335873",
            "sentiment_compound": 0.5106
        },
        {
            "id": "h0hrqk2",
            "score": 1,
            "text": "Honestly knowing that their vaccine, if unused, will go to somebody in Africa might inspire a lot of Republicans to get the shot for themselves.",
            "title_similarity": "0.5088686",
            "sentiment_compound": 0.7717
        },
        {
            "id": "h0hwl4a",
            "score": -2,
            "text": "America, does it bother you that your country gives free health care to other nations, but not you?",
            "title_similarity": "0.4763816",
            "sentiment_compound": 0.3716
        },
        {
            "id": "h0i9fw9",
            "score": -2,
            "text": "He's so \"generous\" with OUR MONEY.",
            "title_similarity": "0.17387557",
            "sentiment_compound": 0.5563
        },
        {
            "id": "h0iikuc",
            "score": -3,
            "text": "Of course he’s a globalist puppet",
            "title_similarity": "0.24190697",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0il4pw",
            "score": 1,
            "text": "What a Fn joke of an administration. How about we stop overbuying with the people’s money and make a proper assessment.",
            "title_similarity": "0.29294902",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0imj6z",
            "score": -2,
            "text": "Still not taking it :)",
            "title_similarity": "-0.1299962",
            "sentiment_compound": -0.357
        },
        {
            "id": "h0imnt7",
            "score": 2,
            "text": "This is why I voted for him.",
            "title_similarity": "0.2364808",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0inz1h",
            "score": -1,
            "text": "But how will he grift money back into his own pockets this way?",
            "title_similarity": "0.26572782",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0isxs5",
            "score": 2,
            "text": "President. This man.",
            "title_similarity": "0.28847444",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0iyd25",
            "score": -3,
            "text": "Haha that’s because nobody here wants them otherwise they would be used",
            "title_similarity": "0.054038238",
            "sentiment_compound": 0.4588
        },
        {
            "id": "h0j06e7",
            "score": -2,
            "text": "I’m sure the headline meant to say, “The American Taxpayer donates ....”",
            "title_similarity": "0.4936244",
            "sentiment_compound": 0.3182
        },
        {
            "id": "h0j8mdm",
            "score": -2,
            "text": "Shoulda donated his 75% unused brain capacity🥳",
            "title_similarity": "0.75692385",
            "sentiment_compound": 0.3818
        },
        {
            "id": "h0h4ap6",
            "score": -12,
            "text": "I'm glad our tax dollars are going towards helping people that will turn around and hate on the US any chance they get. Gives me the warm and fuzzies.",
            "title_similarity": "0.31411466",
            "sentiment_compound": 0.5267
        },
        {
            "id": "h0hplqs",
            "score": 14,
            "text": "#HEY REPUBLICANS! THAT DIRTY JOE BIDEN WANTS TO GIVE AWAY YOUR VACCINES THAT WERE PAID FOR WITH YOUR TAXES TO BROKE-ASS MEXICANS THAT ARE ALL RAPISTS AND MURDERERS!! DON’T LET HIM GET AWAY WITH IT! GO GET YOUR VACCINE BEFORE ITS TOO LATE!!!\n\n\n\n/s",
            "title_similarity": "0.5081222",
            "sentiment_compound": -0.9507
        },
        {
            "id": "h0gusoo",
            "score": 7,
            "text": "So ironically a bunch of anti-vaxxers will end up helping 'brown people in sh\\*thole countries' due to their anti-science bs.",
            "title_similarity": "0.4105224",
            "sentiment_compound": 0.296
        },
        {
            "id": "h0gzv0b",
            "score": -7,
            "text": "Maybe the right thing was NOT TO HOARD THE VACCINES so that other nations who couldn't afford to overbid your wealth could have also vaccinated their citizens as soon as possible. DISGUSTING!!!",
            "title_similarity": "0.48791856",
            "sentiment_compound": -0.4232
        },
        {
            "id": "h0it7bq",
            "score": -5,
            "text": "[removed]",
            "title_similarity": "-0.06395121"
        },
        {
            "id": "h0ivli2",
            "score": -7,
            "text": "Maybe he can throw fauci out along with the vaccines ?",
            "title_similarity": "0.5079944",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0hc0ht",
            "score": 18,
            "text": "Can't wait for conservatives -- who were only yesterday ranting about how they'll never take the vaccine -- to complain about Biden sending all of our precious vaccines to 'foreigners' and betraying his own country.",
            "title_similarity": "0.52857494",
            "sentiment_compound": -0.3182
        },
        {
            "id": "h0h8uk3",
            "score": -3,
            "text": "For the love of all that is Holy, someone please give me a little Karma. And good job, Joey B. That’s my dawg right therez",
            "title_similarity": "0.23760742",
            "sentiment_compound": 0.8456
        },
        {
            "id": "h0hhtid",
            "score": 3,
            "text": "Give it to Canada!! We are your neighbours and need vaccines",
            "title_similarity": "0.48929533",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0hlr8a",
            "score": 4,
            "text": "So many idiots here that refuse to take them.... glad they are going to save lives elsewhere.",
            "title_similarity": "0.18543497",
            "sentiment_compound": 0.6124
        },
        {
            "id": "h0hlvh5",
            "score": -3,
            "text": "Imagine a virus so bad you have to give people incentives to get the vaccine for it😂😂😂",
            "title_similarity": "0.4538583",
            "sentiment_compound": 0.6714
        },
        {
            "id": "h0hxfgx",
            "score": -3,
            "text": "If you get covid you have 1.4% chance of death per the CDC statistics based on cases from a year ago before they developed a solid treatment plan, that number today is less than 1.4%. I don't think everyone who doesn't get it is a vaccine denier I think some people feel going without is an acceptable risk for them.\n It is interesting how pro VAC's people feel their lower tolerance for risk with the virus and their higher tolerance for risk with the vaccine should be how every should feel, and their risk assessment is the only valid one.  Funny really.",
            "title_similarity": "0.6507582",
            "sentiment_compound": -0.6202
        },
        {
            "id": "h0i265w",
            "score": 4,
            "text": "I’ve said it once and I’ll say it many more times... it’s just nice to have a human being with compassion leading our country again\n\nFuck trump and all his crazy, fascist followers",
            "title_similarity": "0.42529863",
            "sentiment_compound": -0.5719
        },
        {
            "id": "h0idnjl",
            "score": -5,
            "text": "Good. We don’t want them anyway.",
            "title_similarity": "-0.051870458",
            "sentiment_compound": 0.4939
        },
        {
            "id": "h0ii7cn",
            "score": -3,
            "text": "Giving away tax payers money 😂😂",
            "title_similarity": "0.30538273",
            "sentiment_compound": 0.802
        },
        {
            "id": "h0iqasu",
            "score": -3,
            "text": "“Donate” some more of our tax revenue to others",
            "title_similarity": "0.35858506",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0iwjww",
            "score": -3,
            "text": "What a joke",
            "title_similarity": "-0.07816275",
            "sentiment_compound": 0.296
        },
        {
            "id": "h0ixrph",
            "score": -3,
            "text": "Joe the whore doesn't do anything if he doesn't get a cut, so I wonder who's buttering his bread for this.",
            "title_similarity": "0.30674958",
            "sentiment_compound": -0.5402
        },
        {
            "id": "h0hpe1s",
            "score": -9,
            "text": "I hope they deduct from the tax payers dollars for a vaccine from a politically inflated manufactured pandemic but yall aren't ready for that conversation.",
            "title_similarity": "0.50231546",
            "sentiment_compound": -0.1815
        },
        {
            "id": "h0glrzj",
            "score": 29,
            "text": "The US and other countries have a self interest to get the rest of the world vaccinated. If not we will just see more and more variants. We might be stuck with Covid to some degree. Moderna and others have been working on a booster shot for months.",
            "title_similarity": "0.6055122",
            "sentiment_compound": 0.25
        },
        {
            "id": "h0gpc8y",
            "score": 0,
            "text": "Ha! I read that as unbacked and I was like \"wait, who is making sure they get where they need to go then?\" Adhd is stupid",
            "title_similarity": "0.22679362",
            "sentiment_compound": 0.1759
        },
        {
            "id": "h0gsh87",
            "score": 0,
            "text": "Thanks Joe, thanks Emmanuel. I hope to be a recipient, and appreciate it enormously!",
            "title_similarity": "0.15873347",
            "sentiment_compound": 0.8932
        },
        {
            "id": "h0hbtt9",
            "score": 0,
            "text": "So the US is already at the point they have run out of people willing to take the vaccine?",
            "title_similarity": "0.57596856",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0hgz9y",
            "score": 0,
            "text": "What extra ?, America is not even half way vaccinated yet. Sounds like a political grandstanding.",
            "title_similarity": "0.43337852",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h0hhmg1",
            "score": 0,
            "text": "Meanwhile, the EU has already exported 200 million doses without patting themselves on the back that much while the US has done zilch. \n\nThis is a cheap PR move.",
            "title_similarity": "0.55892885",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0hhqqu",
            "score": 0,
            "text": "Why isn't the program backed by anyone?/s",
            "title_similarity": "0.11265929",
            "sentiment_compound": -0.0191
        },
        {
            "id": "h0hif9d",
            "score": 0,
            "text": "What's he gonna do with 25% of the unused vaccines?",
            "title_similarity": "0.80382985",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0hk4e8",
            "score": 0,
            "text": "The question is why did USA order so much in the first place? Did they not know the population, is there a large amount of people that didnt get vaccinated?\n\nConsidering what is happening in India how many lives could have been saved if USA had only purchased what they needed.",
            "title_similarity": "0.5151626",
            "sentiment_compound": 0.4871
        },
        {
            "id": "h0hkjcy",
            "score": -2,
            "text": "\"donate\" ah it's nice to have American tax dollars being sent out of the country again",
            "title_similarity": "0.37754405",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h0hkljn",
            "score": 0,
            "text": "Glad I stopped procrastinating and got my first shot this past weekend. I'm a hermit and barely leave the house so my wife and I weren't exactly in a hurry. 😅",
            "title_similarity": "0.38211077",
            "sentiment_compound": 0.5709
        },
        {
            "id": "h0hlc99",
            "score": 0,
            "text": "This is good! This'll help the vaccination process, good work on Biden's part!",
            "title_similarity": "0.26188898",
            "sentiment_compound": 0.8436
        },
        {
            "id": "h0hle64",
            "score": 0,
            "text": "... What happens when we all need a third, booster shot?",
            "title_similarity": "0.31649464",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0hllx7",
            "score": 0,
            "text": "Bro move, not gonna lie :)",
            "title_similarity": "-0.0030199587",
            "sentiment_compound": -0.357
        },
        {
            "id": "h0hnztg",
            "score": 0,
            "text": "Can someone with less public views please cross post this on r/conservative with something like \"If you don't get the shot now, it will be given away to other countries\".",
            "title_similarity": "0.4038192",
            "sentiment_compound": 0.5478
        },
        {
            "id": "h0hoqgw",
            "score": 0,
            "text": "75%?? What are they gonna do with the other unused ones? Not use them?",
            "title_similarity": "0.5422467",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0hq73q",
            "score": 0,
            "text": "good. let others who are smarter live <3",
            "title_similarity": "0.10735428",
            "sentiment_compound": 0.8316
        },
        {
            "id": "h0hqz4x",
            "score": 0,
            "text": "What else was he going to do with them?",
            "title_similarity": "0.02723516",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0hr51k",
            "score": 0,
            "text": "I don’t trust the UN to supply the world with toilet paper. Better to give the unused vaccines directly to India along with bottled oxygen...🤓",
            "title_similarity": "0.49902657",
            "sentiment_compound": 0.6124
        },
        {
            "id": "h0hrcfy",
            "score": 0,
            "text": "Come to Brazil lol",
            "title_similarity": "0.2202279",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h0hs99z",
            "score": 0,
            "text": "“Here other countries, our own people are too stupid to understand basic science. Take these”",
            "title_similarity": "0.20731723",
            "sentiment_compound": -0.5267
        },
        {
            "id": "h0hsopq",
            "score": -4,
            "text": "No one I know wants the vaccine and will never get them.  Sorry, blame social media and liberal biased media.",
            "title_similarity": "0.3269816",
            "sentiment_compound": -0.6681
        },
        {
            "id": "h0ht8wg",
            "score": 0,
            "text": "Thanks all you anti vax Karen's for giving your vax to people who will appreciate it.",
            "title_similarity": "0.36315328",
            "sentiment_compound": 0.6908
        },
        {
            "id": "h0htait",
            "score": 0,
            "text": "Gooooo Jooooooe!\n\nSeriously,that's awesome. Backwards ass third world countries like mine need all the help they can get",
            "title_similarity": "0.33539426",
            "sentiment_compound": 0.7263
        },
        {
            "id": "h0htge2",
            "score": 0,
            "text": "Make sure this is broadcast \"unused vaccines will go to brown and black people, using your tax money Cletus\".  See if that changes any minds.",
            "title_similarity": "0.60637337",
            "sentiment_compound": 0.3182
        },
        {
            "id": "h0htt3j",
            "score": 0,
            "text": "You're welcome rest of the world.",
            "title_similarity": "0.01133254",
            "sentiment_compound": 0.4588
        },
        {
            "id": "h0hu0za",
            "score": 0,
            "text": "Is that worth an applause or something? Given it's a crisis it would be highly immoral to charge for the vaccine. Why 75 percent of unused vaccines anyway why not every unused vaccine?",
            "title_similarity": "0.63399506",
            "sentiment_compound": -0.6191
        },
        {
            "id": "h0hubeg",
            "score": 0,
            "text": "You wouldn’t see Trump doing anything close to this.  A step in the right direction",
            "title_similarity": "0.0848794",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0hurrv",
            "score": 0,
            "text": "Kamala in the pic is really “and I can stand next to you and watch”",
            "title_similarity": "0.11130249",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0hvh2v",
            "score": 0,
            "text": "Dont give em away for free!",
            "title_similarity": "0.033300012",
            "sentiment_compound": 0.5562
        },
        {
            "id": "h0hwigl",
            "score": -3,
            "text": "[deleted]",
            "title_similarity": "-0.022515053"
        },
        {
            "id": "h0hwo8v",
            "score": 0,
            "text": "Lmfao. 75% ?!?!?!. But COVID is fucking SERIOUS! We need those vaccines!",
            "title_similarity": "0.7441926",
            "sentiment_compound": -0.5341
        },
        {
            "id": "h0hwx89",
            "score": 0,
            "text": "Just wish the US didn't panic buy all the vaccines so the rest of the world can at least have a chance",
            "title_similarity": "0.5316905",
            "sentiment_compound": 0.7508
        },
        {
            "id": "h0hwzvw",
            "score": -4,
            "text": "Kamala the babysitter always there in case Joe loses his way from the stage or catches a whiff of a particularly tasty child that needs ice cream.",
            "title_similarity": "0.25394374",
            "sentiment_compound": -0.3182
        },
        {
            "id": "h0hx6wf",
            "score": 0,
            "text": "The irony is that the ones complaining about Biden giving these vaccines away will be all the Trumpers, who have no intention of getting vaccinated anyways",
            "title_similarity": "0.42918122",
            "sentiment_compound": -0.2023
        },
        {
            "id": "h0hxrx2",
            "score": 0,
            "text": "Can’t wait to see how the anti vaxxers spin this",
            "title_similarity": "0.20053858",
            "sentiment_compound": -0.3182
        },
        {
            "id": "h0hyh3s",
            "score": 0,
            "text": "Or he could force the pharma companies to release the vaccine as open-source so other countries can use it? Idk but that seems reasonable, considering those companies literally profited hundreds of millions off our tax money",
            "title_similarity": "0.6829981",
            "sentiment_compound": 0.4118
        },
        {
            "id": "h0i0wo4",
            "score": 0,
            "text": "They have 75% of vaccine they didn’t use.  WTF.",
            "title_similarity": "0.79853165",
            "sentiment_compound": -0.6739
        },
        {
            "id": "h0i1894",
            "score": 0,
            "text": "This is being presented as an act of altruism, but America is so far ahead of most of the world on its vaccination rollout for a simple reason - they made a deal to buy far more vaccines than they needed - and were given them as a priority. Meanwhile, countless other countries are left waiting for the vaccines they also bought, while the USA has millions and millions of doses just sitting in warehouses.",
            "title_similarity": "0.6041349",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0i1c3y",
            "score": 0,
            "text": "They should just lift the export restrictions and allow unfettered exports",
            "title_similarity": "0.24633977",
            "sentiment_compound": 0.2263
        },
        {
            "id": "h0i26h7",
            "score": 0,
            "text": "Donate me another stimmy",
            "title_similarity": "0.354342",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0i28gj",
            "score": 0,
            "text": "Good thing since they'd [go unused](https://twitter.com/USVaccineCount/status/1400541944355332096?s=09)...",
            "title_similarity": "0.16245505",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h0i8hvz",
            "score": 0,
            "text": "[deleted]",
            "title_similarity": "-0.022515053"
        },
        {
            "id": "h0i8ir9",
            "score": 0,
            "text": "Should have sold it and added the money back to the fund used to pay for the vaccine",
            "title_similarity": "0.58639395",
            "sentiment_compound": -0.1027
        },
        {
            "id": "h0iajev",
            "score": 0,
            "text": ">Joe Biden to donate. \n\n\nWTF. That's like saying \" Trump vaccine to save millions\". \nJust because it happens under an administration doesn't mean they get credit for Jack shit you fuckwads.   How about saying 'US to give unwanted vaccines to India and Brasil'",
            "title_similarity": "0.6281847",
            "sentiment_compound": -0.4084
        },
        {
            "id": "h0iak50",
            "score": 0,
            "text": "Send them to China! Oh wait..they aren't using any vaccines on their population.",
            "title_similarity": "0.38417754",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0icd9s",
            "score": 0,
            "text": "Like they are his to give away",
            "title_similarity": "0.073958665",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h0idm0y",
            "score": 0,
            "text": "So, at what point do they become surplus? Or are we giving out the J&J to get it out of or system. It’s very early and I’m sure numbers are not on for number of people vaccinated. America first please. Share after.",
            "title_similarity": "0.51454926",
            "sentiment_compound": 0.7893
        },
        {
            "id": "h0igwbu",
            "score": 3,
            "text": "Finally the President the world deserves",
            "title_similarity": "0.3777199",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0ijimv",
            "score": 0,
            "text": "[deleted]",
            "title_similarity": "-0.022515053"
        },
        {
            "id": "h0ijusj",
            "score": 0,
            "text": "It’s good knowing he’s out there. The Dude. Taking ‘er easy for all us sinners.",
            "title_similarity": "0.18523821",
            "sentiment_compound": 0.7003
        },
        {
            "id": "h0ijven",
            "score": 0,
            "text": "What about the other 25%? What’re we gonna do with those exactly? Let them go to waste? Or sell them?",
            "title_similarity": "0.50859976",
            "sentiment_compound": -0.5803
        },
        {
            "id": "h0ijvls",
            "score": -4,
            "text": "Why not they told to our face the vaccine is a gamble with random side effects and random versions and that you can still catch and share the virus after you get it and we still took it, because for some people if they dont take it they die. And it gave people a slightly better chance than not getting it depending on who you are and your circumstances. So yeah share it and let people decide for themselves. I didnt take it and I have no disdain for those that did. Before the vaccines came out my mother passed from CoronaVirus disease 2019 aka covid19 named after the year it came out not the year they told us it was out. #Politicallyagnostic Im capable to think for myself so are you and so are they.",
            "title_similarity": "0.4868318",
            "sentiment_compound": 0.8787
        },
        {
            "id": "h0ijvpe",
            "score": 0,
            "text": "84% upvoted how can people even be mad about this, theres a vaccine surplus in the US because almost everyone who wants it already has",
            "title_similarity": "0.655983",
            "sentiment_compound": -0.4939
        },
        {
            "id": "h0ijz6p",
            "score": 0,
            "text": "I read this as unbacked rather than united nations backed global vaccine program😅",
            "title_similarity": "0.39194775",
            "sentiment_compound": 0.6597
        },
        {
            "id": "h0ikb66",
            "score": 0,
            "text": "I live in a country that needs these. So, thank you anti-vaxxers who facilitated this program!",
            "title_similarity": "0.29953784",
            "sentiment_compound": 0.4199
        },
        {
            "id": "h0ikbhf",
            "score": 0,
            "text": "If this were FB is could see a lot of people thinking it said ‘unbacked’ global vaccine program. Hehe",
            "title_similarity": "0.5196198",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0itl2n",
            "score": 0,
            "text": "Americans\\*",
            "title_similarity": "0.24562854",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0iv9x5",
            "score": -5,
            "text": "Doesn't donate much if his own money. But as long as it's someone else's,  it's just fine",
            "title_similarity": "0.12570834",
            "sentiment_compound": 0.296
        },
        {
            "id": "h0ivg0i",
            "score": -5,
            "text": "I do not trust any of this.",
            "title_similarity": "-0.051086493",
            "sentiment_compound": -0.4023
        },
        {
            "id": "h0ivkj7",
            "score": 0,
            "text": "I think he means the US taxpayers are donating these vaccines as we paid for them initially.",
            "title_similarity": "0.65262115",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0ivm84",
            "score": 0,
            "text": "Were they planning to send the used COVID vaccines?",
            "title_similarity": "0.5432026",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0iwev8",
            "score": -4,
            "text": "[removed]",
            "title_similarity": "-0.06395121"
        },
        {
            "id": "h0j1kle",
            "score": 0,
            "text": "guess taiwans not getting any",
            "title_similarity": "0.07989234",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0j1ucf",
            "score": -5,
            "text": "lol, good luck getting a viable vaccine. They only last a few hours out of refrigeration. What a bad joke.",
            "title_similarity": "0.5695168",
            "sentiment_compound": 0.7506
        },
        {
            "id": "h0j3v68",
            "score": 0,
            "text": "Hopefully not the one that makes your skin fail",
            "title_similarity": "0.0012815129",
            "sentiment_compound": -0.2023
        },
        {
            "id": "h0j511e",
            "score": 0,
            "text": "There are unused COVID vaccines?",
            "title_similarity": "0.47979715",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0j59wj",
            "score": 0,
            "text": "Are 100% of America with the vaccine or why the don't need it",
            "title_similarity": "0.68642986",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0j8xej",
            "score": 0,
            "text": "I wonder if this is a ploy to get the \"america first\" crowd vaccinated. If you dont use your vaccine will go give one to another country, perhaps even a starving child.",
            "title_similarity": "0.6126881",
            "sentiment_compound": -0.4215
        },
        {
            "id": "h0jg1or",
            "score": -6,
            "text": "[removed]",
            "title_similarity": "-0.06395121"
        },
        {
            "id": "h0jgoyg",
            "score": 0,
            "text": "I thought the vaccines had a shelf life of under 8 hrs?",
            "title_similarity": "0.57056314",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0jh9o2",
            "score": 0,
            "text": "Are they the AstraZeneca vaccines that US did not use on its own citizens?",
            "title_similarity": "0.49681005",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0jhmgp",
            "score": 0,
            "text": "To be fair that was the plan from the start, not the idea of Biden",
            "title_similarity": "0.09275319",
            "sentiment_compound": 0.3182
        },
        {
            "id": "h0jm0ya",
            "score": 0,
            "text": "He’s a hero 🙄",
            "title_similarity": "0.09523497",
            "sentiment_compound": 0.5574
        },
        {
            "id": "h0jno3u",
            "score": 0,
            "text": "So what’s up with India? Don’t they need some? I’m out of the loop since I haven’t been reading into the news lately",
            "title_similarity": "0.19870862",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0jozj7",
            "score": 0,
            "text": "Yeah nice and blablabla but why did the US accumulated so many vaccines ?",
            "title_similarity": "0.59442556",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h0jtheu",
            "score": 0,
            "text": "What’s covid ? Never heard of it",
            "title_similarity": "0.09580326",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0jv0t0",
            "score": 0,
            "text": "We need to donate him . but no other country would take him either .",
            "title_similarity": "0.31055665",
            "sentiment_compound": -0.4215
        },
        {
            "id": "h0k1q10",
            "score": 0,
            "text": "To be clear... American people are donating vaccines not j Biden per se",
            "title_similarity": "0.5360249",
            "sentiment_compound": 0.3818
        },
        {
            "id": "h0lkcp8",
            "score": 0,
            "text": "Unused aka unwanted.",
            "title_similarity": "-0.06434353",
            "sentiment_compound": -0.2263
        },
        {
            "id": "h0mf5gf",
            "score": 0,
            "text": "do not under ANY circumstance take that experimental drug therapy.  over 50,000 have died from it with thousands more experiencing serious symptoms, including infertility in women.  gates and fauci will pay dearly for murdering millions.  don't even get near a vaccinated person because you will get sick!!!  hunker down people, all the conspiracy theories are coming true right before our very eyes and over the next few months they will try to get you to take booster shots that are even deadlier.",
            "title_similarity": "0.5790448",
            "sentiment_compound": -0.9162
        },
        {
            "id": "h0mtlr6",
            "score": 0,
            "text": "“You can always trust Americans to do the right thing, once they have exhausted every other option.”",
            "title_similarity": "0.235869",
            "sentiment_compound": 0.2023
        },
        {
            "id": "h0n603k",
            "score": 0,
            "text": "Joe Biden couldn't find water if he fell out of a boat.  Someone in the administration pushed a paper in front of him and helped move his hand to sign it.\n\nAnd it's the vaccine that isn't approved for use in America:\n\n> Biden has committed to providing other nations with all 60 million U.S.-produced doses of the AstraZeneca vaccine, which has yet to be authorized for use in America...",
            "title_similarity": "0.648831",
            "sentiment_compound": 0.453
        },
        {
            "id": "h0gl21k",
            "score": 736,
            "text": " Can't wait to hear conservative media spin this into Biden being unamerican and disregarding his american citizens that haven't been vaccinated even though they don't want the vaccine because Bill Gates wants to brain wash vaccinated people with 5G into gay trans liberals.",
            "title_similarity": "0.5240699",
            "sentiment_compound": -0.2783
        },
        {
            "id": "h0h1fq3",
            "score": -14,
            "text": "Thanks Beijing Biden",
            "title_similarity": "0.17303807",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h0ginya",
            "score": -42,
            "text": "So, this was a scheme to make big-Phama richer at the expense of the US taxpayers?",
            "title_similarity": "0.41738892",
            "sentiment_compound": 0.5267
        },
        {
            "id": "h0hafuc",
            "score": 5,
            "text": "Cue the narrative that Biden is taking vaccine doses away from American citizens. Watch anti-vaxxers turn around real quick now that wanting a vaccine they think they can't have will fit their narrative about evil globalist Dems.",
            "title_similarity": "0.54411143",
            "sentiment_compound": -0.7587
        },
        {
            "id": "h0hda0v",
            "score": -5,
            "text": "What? First you hoard vaccines and now you are the saviour angel, USA being USA",
            "title_similarity": "0.5558212",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0hwbfo",
            "score": -5,
            "text": "Good get that garbage out of here, it’s a shame our tax dollars were wasted but at least some rich politicians got richer off of it I guess 🤷🏼‍♂️",
            "title_similarity": "0.37065864",
            "sentiment_compound": 0.8519
        },
        {
            "id": "h0ibqwf",
            "score": 4,
            "text": "What's this weird feeling of being proud of our country instead of embarrassed by it?",
            "title_similarity": "0.20765547",
            "sentiment_compound": 0.1027
        },
        {
            "id": "h0iu8vr",
            "score": 5,
            "text": "[deleted]",
            "title_similarity": "-0.022515053"
        },
        {
            "id": "h0h32vw",
            "score": 148,
            "text": "I like how it doesn’t say “The United States” or “The U.S.” or even “President Joe Biden”. \nIt’s just titled like Joe is feeling nice and hand delivering millions of vaccines across the globe. 😂",
            "title_similarity": "0.6033762",
            "sentiment_compound": 0.9451
        },
        {
            "id": "h0gs6gb",
            "score": 285,
            "text": "Question: if they’re unused... why not donate all of it?",
            "title_similarity": "0.30559272",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0gp8ey",
            "score": -27,
            "text": "[removed]",
            "title_similarity": "-0.06395121"
        },
        {
            "id": "h0gsvno",
            "score": -13,
            "text": "Give it to our allies and partners first. I don’t want them to disappear into India, China, Venezuela, Russia, and Africa.",
            "title_similarity": "0.3706811",
            "sentiment_compound": -0.1531
        },
        {
            "id": "h0h8v24",
            "score": -13,
            "text": "NGL, anyone esle wonder if he caresses and smells the underage vaccines?",
            "title_similarity": "0.46812606",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0hlnho",
            "score": -6,
            "text": "Reddit manages to make this about conservatives somehow. Never fails. Fucking morons",
            "title_similarity": "0.36966318",
            "sentiment_compound": 0.544
        },
        {
            "id": "h0ieja6",
            "score": -6,
            "text": "I never understood how ppl who get vaccinated are afraid of the ones who aren't, like wtf did you get vaccinated for? Make it Make Scense?",
            "title_similarity": "0.40548468",
            "sentiment_compound": 0.323
        },
        {
            "id": "h0hiqlb",
            "score": -13,
            "text": "Creepy uncle Joe is a train wreck",
            "title_similarity": "0.24281524",
            "sentiment_compound": -0.4404
        },
        {
            "id": "h0gxw0z",
            "score": 1,
            "text": "Wait a second, what about the other 25%? Will they just go to waste?\nEdit: Nevermind, they will be kept in the US for emergencies.",
            "title_similarity": "0.58275723",
            "sentiment_compound": -0.4871
        },
        {
            "id": "h0h1jp9",
            "score": -1,
            "text": "But if they're unused why not 100%?",
            "title_similarity": "0.329131",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0h2ds0",
            "score": 1,
            "text": "Something trump would NEVER do. I'm not a Biden lover either",
            "title_similarity": "0.07506715",
            "sentiment_compound": -0.4717
        },
        {
            "id": "h0h2riq",
            "score": 1,
            "text": "Awesome! I can’t wait to hear all the trumpers complain they don’t have access.  bUt Ma RiGhTs tO tHe VaCcInE!",
            "title_similarity": "0.49473295",
            "sentiment_compound": 0.3365
        },
        {
            "id": "h0h4bvx",
            "score": -1,
            "text": "Why doesn't he just allow them to manufacture it?",
            "title_similarity": "0.18348604",
            "sentiment_compound": -0.1695
        },
        {
            "id": "h0h4qmy",
            "score": 1,
            "text": "Better late than never. India is dying.",
            "title_similarity": "0.24284351",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h0h51jl",
            "score": -1,
            "text": "Without reading the article I shall assume he will be filling a swimming pool with the rest and diving into it, like scrooge mcduck.",
            "title_similarity": "0.36255407",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h0h54w3",
            "score": -1,
            "text": "Watch trump get pissed like, “but what if we end up needing them?!  Irresponsible!!!!”",
            "title_similarity": "0.19908918",
            "sentiment_compound": -0.5951
        },
        {
            "id": "h0h70y7",
            "score": 1,
            "text": "Why not donate them all if they aren't going to be used?",
            "title_similarity": "0.28653422",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0h7qz0",
            "score": 1,
            "text": "Is that like incentive to tell those yet unaccounted that you'll miss your chance? Nothing makes people move faster than the feeling of loss.",
            "title_similarity": "0.16927893",
            "sentiment_compound": 0.5574
        },
        {
            "id": "h0h8xjc",
            "score": 1,
            "text": "Wait why is there such a huge amount of unused vaccine?  Surely America hasn't vaccinated everyone yet?",
            "title_similarity": "0.53711295",
            "sentiment_compound": 0.6767
        },
        {
            "id": "h0h9uro",
            "score": 1,
            "text": "Can you imagine the comments if this was on the Fox News website?",
            "title_similarity": "0.3127678",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0habby",
            "score": 1,
            "text": "Offer a $50 coupon to Walmart, or a case of Bush beer, for a vaccine poke, you’ll have to beat them back with selfie sticks.",
            "title_similarity": "0.6870558",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0hb7t2",
            "score": 1,
            "text": "[deleted]",
            "title_similarity": "-0.022515053"
        },
        {
            "id": "h0hc496",
            "score": 1,
            "text": "The end of the pandemic has been America's revenge tour. I remember seeing article after article about how much the United States sucked. Even India was throwing shade. Granted trump was (is) an idiot and didn't help with our global image, the USA is now a global leader.",
            "title_similarity": "0.4464463",
            "sentiment_compound": -0.7997
        },
        {
            "id": "h0hc73r",
            "score": -1,
            "text": "Took them long enough to depart from vaccine nationalism.",
            "title_similarity": "0.29355186",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0hcqgn",
            "score": -1,
            "text": "How about lifting patent restrictions so that generics can be made. This is a bullshit half measure.",
            "title_similarity": "0.36628312",
            "sentiment_compound": -0.5859
        },
        {
            "id": "h0hd6dl",
            "score": 1,
            "text": "damn librule commie, that vacines if fer merica!, even if we too dumbs to use it.",
            "title_similarity": "0.16573554",
            "sentiment_compound": -0.6696
        },
        {
            "id": "h0hd6ea",
            "score": -1,
            "text": "Trump would tried to sell it.",
            "title_similarity": "0.2737348",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0hdk26",
            "score": -1,
            "text": "I like how is says unused.  To differentiate this with biohazard trash that is used vaccines",
            "title_similarity": "0.41142815",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h0hdt6r",
            "score": 1,
            "text": "Sounds like the equivalent of when a kid won't eat and their parents tell them there's starving kids in Africa that'll eat their food.",
            "title_similarity": "0.43367565",
            "sentiment_compound": -0.0772
        },
        {
            "id": "h0hdthc",
            "score": -1,
            "text": "Trump would have sold them to the highest bidder",
            "title_similarity": "0.38478464",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0hdux4",
            "score": -1,
            "text": "Daddy Biden",
            "title_similarity": "0.14498731",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0he1o1",
            "score": 1,
            "text": "Good to see America is helping the world again",
            "title_similarity": "0.20260568",
            "sentiment_compound": 0.6249
        },
        {
            "id": "h0heb65",
            "score": 1,
            "text": "A donation... From the US? But... That's not profitable. What angle are they playing...?",
            "title_similarity": "0.166558",
            "sentiment_compound": -0.3114
        },
        {
            "id": "h0hekki",
            "score": -1,
            "text": "How many vaccines does joe Biden have?!? Doesn’t he only need one, why has he been hoarding them this whole time. Hopefully the US can follow his lead. FYI just read the headline.",
            "title_similarity": "0.64140475",
            "sentiment_compound": 0.7082
        },
        {
            "id": "h0hf1qm",
            "score": 1,
            "text": "[deleted]",
            "title_similarity": "-0.022515053"
        },
        {
            "id": "h0hfpfw",
            "score": -1,
            "text": "Why do all these articles say Joe Biden is donating them? He’s literally just the face of the administration. He doesn’t do ANYTHING other than just sign a piece of paper...",
            "title_similarity": "0.32235807",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0hgdrp",
            "score": -1,
            "text": "I heard if you’re in the Opulous telegram you can’t get covid https://t.me/joinchat/iGtXadn6DuRjOWUx",
            "title_similarity": "0.22849558",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0hgooq",
            "score": 1,
            "text": "Awesome, is he gonna have the troops come back any Time soon or is that gonna be another delay?",
            "title_similarity": "0.27760398",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h0hh1vp",
            "score": -1,
            "text": "Unused? I think it should read unwanted or more accurately unnecessary.",
            "title_similarity": "0.00960095",
            "sentiment_compound": -0.2263
        },
        {
            "id": "h0hh4vv",
            "score": -1,
            "text": "So what happens when we give out some bad vaccines and the world starts blaming us for any long-term issues? Of the worlds governments accept these they need to not get mad at the US for trying to help out. I just hope those vaccines go on to do good.",
            "title_similarity": "0.49290887",
            "sentiment_compound": 0.7208
        },
        {
            "id": "h0hiqqn",
            "score": 1,
            "text": "The hell we finna do with 25% of all the unused vaccines? That's some billionaire hoarder mentality BS... imagine going to a homeless shelter where the staff eat first then throw away 1/4 of what's left before serving others..",
            "title_similarity": "0.7609587",
            "sentiment_compound": -0.6808
        },
        {
            "id": "h0hjjqu",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "-0.06395121"
        },
        {
            "id": "h0hjt4t",
            "score": 1,
            "text": "Why are all the top comments in this thread so negative? This is positive news - the US has enough vaccines to donate to India, and India really needs them. This is good. Why can't y'all take the win instead of focusing on the negative?",
            "title_similarity": "0.5247586",
            "sentiment_compound": 0.4622
        },
        {
            "id": "h0hk9l4",
            "score": 1,
            "text": "I admit I don't know much about the covid vaccine, just heresy from people in my life, I heard the vaccine doesn't stop you from getting covid, but simply from it being more serious or deadly when/if you do catch it, can anyone confirm or link me to a credible vaccine source?\nI'd love to be more educated & I think a lot of you here have more knowledge that I could benefit from, thankyou.",
            "title_similarity": "0.4552123",
            "sentiment_compound": 0.8946
        },
        {
            "id": "h0hl9ey",
            "score": -1,
            "text": "About time. America's vaccine nationalism was embarrassing",
            "title_similarity": "0.40732065",
            "sentiment_compound": -0.3818
        },
        {
            "id": "h0hlbi9",
            "score": -1,
            "text": "The People of the United States donate the vaccines they paid for to the world at large out of the goodness of their hearts.",
            "title_similarity": "0.6198239",
            "sentiment_compound": 0.8779
        },
        {
            "id": "h0hle69",
            "score": 1,
            "text": "it's a start, but it's not enough.  we need to end ip on vaccines.",
            "title_similarity": "0.4005221",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0hml30",
            "score": -1,
            "text": "So instead of releasing the patent to the world, the US is just going to donate the vaccines? What?",
            "title_similarity": "0.607947",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0hmswi",
            "score": -1,
            "text": "I mean this is good and everything, but it makes me concerned because the vaccination rate in my state is close to 30%",
            "title_similarity": "0.6084149",
            "sentiment_compound": 0.2382
        },
        {
            "id": "h0hnsav",
            "score": 1,
            "text": "Cool, we're throwing out 80% of the doses at the retail pharmacies now.  Stop sending us more, it,'s inefficient.",
            "title_similarity": "0.6221024",
            "sentiment_compound": 0.0258
        },
        {
            "id": "h0hppfg",
            "score": 1,
            "text": "Richard Wheatley downvoted this post",
            "title_similarity": "0.17273018",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0hpwit",
            "score": 1,
            "text": "Saw in the news in Costa Rica today that we’ll be getting a good portion of vaccines. \n\nThanks to whoever made that decision, we’ll be able to ramp up the vaccination here, and that is very much needed right now. Can’t be thankful enough.",
            "title_similarity": "0.5862208",
            "sentiment_compound": 0.8591
        },
        {
            "id": "h0hpz24",
            "score": -1,
            "text": "Why donate them when we can sell them?",
            "title_similarity": "0.23880301",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0hq5ad",
            "score": -1,
            "text": "Doesn't he need those or is it US healthcare shinanagens?",
            "title_similarity": "0.39487287",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0hqine",
            "score": -1,
            "text": "On the surface it seems good but on further examination I realize that we are not aggressively trying enough to get them used here. I think the vaccines need to marked better and they should not ask for all your personal information to get a vaccine you should just be able to get one no questions asked (except if you are allergic).\n\nI think we need to try harder to use them up then send them over.",
            "title_similarity": "0.40852335",
            "sentiment_compound": 0.3905
        },
        {
            "id": "h0hqp2m",
            "score": 1,
            "text": "The other 25% gets sold to Mexico at a premium to offset cost of donation.",
            "title_similarity": "0.58429086",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0hquo1",
            "score": -1,
            "text": "Anti vax republicans will find a way to be upset about this.",
            "title_similarity": "0.26402408",
            "sentiment_compound": -0.5994
        },
        {
            "id": "h0hqy33",
            "score": 1,
            "text": "Humans need to help humans",
            "title_similarity": "-0.010058863",
            "sentiment_compound": 0.4019
        },
        {
            "id": "h0hr30l",
            "score": 1,
            "text": "Yes, this is a good thing for people across the world, but it is a cover for poor government budgeting. 75%? Thats taxpayer donations* not Biden.",
            "title_similarity": "0.5856597",
            "sentiment_compound": -0.3291
        },
        {
            "id": "h0hss9u",
            "score": 1,
            "text": "Isn't it fucking great to see things being done just because it's the right thing to do?",
            "title_similarity": "0.089237705",
            "sentiment_compound": -0.544
        },
        {
            "id": "h0htxvi",
            "score": -1,
            "text": "Donate??? Really? WTF man that’s taxpayers money",
            "title_similarity": "0.44403112",
            "sentiment_compound": -0.7774
        },
        {
            "id": "h0hu19l",
            "score": 1,
            "text": "UNBACKED?  Wow, Dems.  Just let him cowboy everything I guess...\n\n/s if you couldn't tell.",
            "title_similarity": "0.19250494",
            "sentiment_compound": 0.5859
        },
        {
            "id": "h0hvd6a",
            "score": 1,
            "text": "Man this guy is different as to trump much more quit and reserved. Everything he does is more calculated.",
            "title_similarity": "0.19118603",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0hvkq2",
            "score": 1,
            "text": "Joe Biden officially gives up on Drump supporters.",
            "title_similarity": "0.26402557",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h0hwga8",
            "score": 1,
            "text": "Good,\nUS citizens have had plenty of time to get vaccinated. Finish up with the kids and let the chips fall where they may.",
            "title_similarity": "0.42782247",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h0hxay9",
            "score": -1,
            "text": "The other 25% will be thrown away because this is America, motherfucker",
            "title_similarity": "0.53379595",
            "sentiment_compound": -0.6808
        },
        {
            "id": "h0hxayb",
            "score": -1,
            "text": "The other 25% will be thrown away because this is America, motherfucker",
            "title_similarity": "0.53379595",
            "sentiment_compound": -0.6808
        },
        {
            "id": "h0hyjf5",
            "score": 1,
            "text": "Fair play Joe",
            "title_similarity": "0.0024221037",
            "sentiment_compound": 0.5719
        },
        {
            "id": "h0hyq7k",
            "score": 1,
            "text": "Say what you will about the state of this nation, but this right here is the kind of thing that makes us exceptional.",
            "title_similarity": "0.3299244",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0hzo2a",
            "score": -1,
            "text": "probably the ones that cause sude effects :/",
            "title_similarity": "0.04513739",
            "sentiment_compound": -0.34
        },
        {
            "id": "h0i1gjh",
            "score": -1,
            "text": "He plans to take the additional 25% of the doses himself in hopes of becoming a covid-curing super hero",
            "title_similarity": "0.6619302",
            "sentiment_compound": 0.8834
        },
        {
            "id": "h0i2m7c",
            "score": 1,
            "text": "Lol what a goddamn saint 😂",
            "title_similarity": "0.16014329",
            "sentiment_compound": 0.3818
        },
        {
            "id": "h0i44ax",
            "score": 1,
            "text": "Give them to Canada, we have fuckall. Gotta wait 20 weeks for my second dose lmao",
            "title_similarity": "0.6111171",
            "sentiment_compound": 0.5994
        },
        {
            "id": "h0iam5u",
            "score": 1,
            "text": "Greatly timed; in one week the rich countries will meet to deny patent waivers for the Covid vaccines, so the Pharmaceutical blood suckers can keep getting rich on the backs of government funded research and dead bodies all over the world.\n\nI will give Grandpa Biden credit if he actually fights next week, but I assume this is his compromise.",
            "title_similarity": "0.63777804",
            "sentiment_compound": -0.2617
        },
        {
            "id": "h0iclb2",
            "score": 1,
            "text": "I'm an American living abroad...still paying US taxes...with no access to a vaccine.  What a joke.",
            "title_similarity": "0.43376017",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0id3f9",
            "score": 1,
            "text": "When is Donald Trump going to get the credit he deserves?? \n\n\n\n\n\n\n\n\n\n\n/s",
            "title_similarity": "0.3995733",
            "sentiment_compound": 0.4515
        },
        {
            "id": "h0iftvu",
            "score": 1,
            "text": "Shouldn’t it say, USA to donate 75% ...",
            "title_similarity": "0.74014246",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0ihh7f",
            "score": 1,
            "text": "It's fantastic that we can finally start vaccinating the rest of the world.\n\nIt's truly depressing that only 50% of adults have gotten the vaccine though.",
            "title_similarity": "0.74047846",
            "sentiment_compound": 0.5994
        },
        {
            "id": "h0iir2m",
            "score": 1,
            "text": "Good! Idiots in red states won’t use it, send it to ppl who will. Save some lives.",
            "title_similarity": "0.33486515",
            "sentiment_compound": 0.75
        },
        {
            "id": "h0ij378",
            "score": 1,
            "text": "Wait. if a heart beat equals life, all life deserves to survive to its fullest extent. Vaccinate anyone that wants to be vaccinated. PERIOD.",
            "title_similarity": "0.46402445",
            "sentiment_compound": 0.6369
        },
        {
            "id": "h0ijcxy",
            "score": 1,
            "text": "Where was Biden’s acknowledgment of the UN when they were making statements telling Israel to stop bombing innocent Palestinians? The American hypocrisy is real (I’m an American)",
            "title_similarity": "0.3851504",
            "sentiment_compound": 0.0516
        },
        {
            "id": "h0ijoyx",
            "score": 1,
            "text": "Really? Joe Biden? That's the headline?",
            "title_similarity": "0.24178156",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0ijud0",
            "score": 1,
            "text": "Hey amigos neighbors we could use some of those...",
            "title_similarity": "0.054172803",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0ijxfg",
            "score": -1,
            "text": "Because the US is made of money.. so why not GIVE IT ALL AWAY!!",
            "title_similarity": "0.2860794",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0ikbvb",
            "score": 1,
            "text": "\nWest Bank. Gaza. India. Haiti. Yemen.\n\nThat’s good.",
            "title_similarity": "0.25912774",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h0ikjbs",
            "score": 1,
            "text": "yeees, vaccines youre going to brazil",
            "title_similarity": "0.42122668",
            "sentiment_compound": 0.4019
        },
        {
            "id": "h0ilgup",
            "score": -1,
            "text": "Ok but Joe Biden still loves children.",
            "title_similarity": "0.12793148",
            "sentiment_compound": 0.7684
        },
        {
            "id": "h0impvv",
            "score": 1,
            "text": "Murica fuck yeah",
            "title_similarity": "0.043871783",
            "sentiment_compound": -0.3182
        },
        {
            "id": "h0imtgj",
            "score": 1,
            "text": "What do you mean \"He\" donates them",
            "title_similarity": "0.24706592",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0infej",
            "score": -1,
            "text": "What’s he doing with the other 25% of unused vaccines? Huffing it?",
            "title_similarity": "0.7570822",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0inunf",
            "score": -1,
            "text": "It’s unfortunate that the program didn’t pan out how it was supposed to be.\n\nWhat was supposed to happen with the Covax program was that multiple countries invest into the vaccine effort and then it is distributed to all countries equally regardless of the country’s economic (1st world/3rd world status)\n\nInstead, Highest bidder gets first dibs. So 1st world countries got the vaccine 1st, then leftovers were given to the smaller countries.\n\nTo anyone surprised if this news.. don’t be because this was the plan from the start when it was introduced in around Q3/Q4 of 2020. Trump didn’t join it, but Biden did from day 1.",
            "title_similarity": "0.6319707",
            "sentiment_compound": 0.0129
        },
        {
            "id": "h0ioxhs",
            "score": -1,
            "text": "“I’ll tell you what, she looks like a 19 year old sitting there with her legs crossed.”",
            "title_similarity": "0.28572914",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h0irvi6",
            "score": -1,
            "text": "I'm happy that the rest of the world is getting better access to the vaccines. Daddy Joe really looked at the vaccine hesitant crowd and went \"You snooze you lose.\"",
            "title_similarity": "0.5056702",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h0it3l0",
            "score": 1,
            "text": "Ah finally after sitting on vaccines for months, US decides to be generous.",
            "title_similarity": "0.6105457",
            "sentiment_compound": 0.5106
        },
        {
            "id": "h0iu48q",
            "score": -1,
            "text": "[removed]",
            "title_similarity": "-0.06395121"
        },
        {
            "id": "h0ixpsl",
            "score": 1,
            "text": "In other words, US saves its own ass first, finally gives its leftovers to other countries\n\n75% sure does sound good, but how much is that in actual numbers?\n\nAmericans sure are good at patting themselves on the back",
            "title_similarity": "0.6119926",
            "sentiment_compound": 0.7992
        },
        {
            "id": "h0izbws",
            "score": -1,
            "text": "Donate 100%",
            "title_similarity": "0.35351592",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0j3hko",
            "score": -1,
            "text": "They’ll just sit in a warehouse.",
            "title_similarity": "0.14590138",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0jb18k",
            "score": -1,
            "text": "You think it was his idea?",
            "title_similarity": "0.099682435",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0jbkjq",
            "score": -1,
            "text": "https://uii.io/NMetnFK",
            "title_similarity": "0.027049232",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0jdpbf",
            "score": -1,
            "text": "Don't give them to Australia, we'll find a way to sell them to Twiggy or Gina instead.",
            "title_similarity": "0.25175452",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0jfz0a",
            "score": 1,
            "text": "Ohh how nice that they now give it away after they bought up everything for prices no developing country could afford",
            "title_similarity": "0.46627897",
            "sentiment_compound": 0.1531
        },
        {
            "id": "h0jgcq0",
            "score": -1,
            "text": "Joke",
            "title_similarity": "-0.106995955",
            "sentiment_compound": 0.296
        },
        {
            "id": "h0jnz9k",
            "score": -1,
            "text": "[removed]",
            "title_similarity": "-0.06395121"
        },
        {
            "id": "h0joi2o",
            "score": -1,
            "text": "After blocking raw material exports for months for a vaccine US is not going to approve (novovax), now Biden claims to be the saviour by donating vaccines that are about to expire.",
            "title_similarity": "0.6213424",
            "sentiment_compound": -0.3818
        },
        {
            "id": "h0jot00",
            "score": -1,
            "text": "Good. We don’t want that shit here.",
            "title_similarity": "-0.06794415",
            "sentiment_compound": -0.1027
        },
        {
            "id": "h0jqsgq",
            "score": 1,
            "text": "It‘s not Joe Biden that donates these vaccines, it‘s the USA",
            "title_similarity": "0.4940698",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0jrzr9",
            "score": 1,
            "text": "The fact that they had so many unused vaccines is disgusting.",
            "title_similarity": "0.28768846",
            "sentiment_compound": -0.5267
        },
        {
            "id": "h0jsdw4",
            "score": -1,
            "text": "[removed]",
            "title_similarity": "-0.06395121"
        },
        {
            "id": "h0jtpcx",
            "score": -1,
            "text": "What an Ass Clown",
            "title_similarity": "0.013771923",
            "sentiment_compound": -0.5423
        },
        {
            "id": "h0ju7ed",
            "score": -1,
            "text": "Iam glad it was President Trump who got this ball rolling! Even as he left the white house he was working.  \n\nHe deserves a noble peace prize.",
            "title_similarity": "0.40162084",
            "sentiment_compound": 0.92
        },
        {
            "id": "h0jzmbk",
            "score": -1,
            "text": "Fuck COVID and fuck the vaccine. I’m not a non vaxxer but I’m definitely non COVID vaccine. It’s a joke to begin with and I don’t trust it. My immune system is built for a reason and it is and has been doing me wonders!",
            "title_similarity": "0.35349676",
            "sentiment_compound": 0.8858
        },
        {
            "id": "h0nnoc5",
            "score": -1,
            "text": "Look at all these brainwashed people supporting a pedophile.",
            "title_similarity": "0.2803952",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h0hzfxp",
            "score": 7,
            "text": "Now all the anti vaccine Republicans are suddenly going to want the vaccine just cause Biden says he's going to give it away.",
            "title_similarity": "0.54250455",
            "sentiment_compound": -0.25
        },
        {
            "id": "h0h0xdl",
            "score": -13,
            "text": "2 of them were mine. I'm doing my part for the world!",
            "title_similarity": "0.23263752",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0h25yl",
            "score": 14,
            "text": "Cue a whole bunch of people in the US who refuse to get the vaccine complaining about this.",
            "title_similarity": "0.45178813",
            "sentiment_compound": -0.4588
        },
        {
            "id": "h0hujw0",
            "score": 14,
            "text": "How about Taiwan? They donated millions of masks in the early stage of COVID to the US.",
            "title_similarity": "0.6553992",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0h6o58",
            "score": 31,
            "text": "getting the third world vaccinated will make returning to normalcy more achievable. It will make every component of getting a cucumber in December possible and isnt that what america is really about",
            "title_similarity": "0.5127791",
            "sentiment_compound": 0.3804
        },
        {
            "id": "h0gj6qm",
            "score": 83,
            "text": "What about extra N95 masks?  A lot of businesses are going to have extras as we move to a mask free policy, but there are countries that could use them, or they could be stored for the next time they are needed.",
            "title_similarity": "0.45256415",
            "sentiment_compound": 0.2846
        },
        {
            "id": "h0hcczo",
            "score": 8,
            "text": "Some right wing news about to switch from complaining about the government pressuring us to get vaccines to \"not enough vaccines because Joe B gave them all away!\"",
            "title_similarity": "0.5970435",
            "sentiment_compound": -0.5411
        },
        {
            "id": "h0hb3c4",
            "score": 9,
            "text": "We're not safe unless everyone else is also safe.",
            "title_similarity": "0.12381606",
            "sentiment_compound": 0.1265
        },
        {
            "id": "h0hfmzm",
            "score": -9,
            "text": "Why don’t inject Biden with them all at the same time",
            "title_similarity": "0.19860767",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0hx8wg",
            "score": 10,
            "text": "Watch some people complain about this.",
            "title_similarity": "0.062687054",
            "sentiment_compound": -0.3612
        },
        {
            "id": "h0gzpx6",
            "score": -2,
            "text": "[deleted]",
            "title_similarity": "-0.022515053"
        },
        {
            "id": "h0h21oi",
            "score": -2,
            "text": "He'd do better by making the MRNA patent public. He refuses to do this and is a death profiteer unless he chooses to do otherwise.",
            "title_similarity": "0.32848817",
            "sentiment_compound": -0.0516
        },
        {
            "id": "h0h247t",
            "score": -2,
            "text": "I read the antibodies from the vaccines only last 3-6 months, is that popular thinking? if so, why not keep them since much of the country would be getting the vaccine again?",
            "title_similarity": "0.6844623",
            "sentiment_compound": 0.4871
        },
        {
            "id": "h0h2a0f",
            "score": 2,
            "text": "So that a no on the Trips waiver or what.",
            "title_similarity": "0.122533605",
            "sentiment_compound": -0.3535
        },
        {
            "id": "h0h2gdz",
            "score": -2,
            "text": "lol, RIP Taiwan for not able to join UN.",
            "title_similarity": "0.21634875",
            "sentiment_compound": 0.2292
        },
        {
            "id": "h0h5ra0",
            "score": -2,
            "text": "What can I say except, \"You're welcome\"\nFor the vaccine that I really don't need,\nHey, it's okay, it's okay\nYou're welcome\nI'm just an ordinary guy\n\nBut seriously, I believe that anyone who wants it should definitely take it and I am glad that they wont be going to waste and will go to poor nations who cant afford it.",
            "title_similarity": "0.41244662",
            "sentiment_compound": 0.3716
        },
        {
            "id": "h0h6206",
            "score": -2,
            "text": "I might be overly pessimistic, but I wonder if not being harder on the unvaccinated is an intentional strategy. The unvaccinated would be harder hit, more deaths. 40% of republicans are unvaccinated. Qanon supporters primarily refusing to vaccinate.....",
            "title_similarity": "0.48029605",
            "sentiment_compound": -0.1154
        },
        {
            "id": "h0h73h4",
            "score": 2,
            "text": "Great job joe!",
            "title_similarity": "0.03954982",
            "sentiment_compound": 0.6588
        },
        {
            "id": "h0h7dyy",
            "score": -2,
            "text": "Oh yeah, buy 5 times more than what you actually need so the poorer countries couldn't compete with your prices and thus they won't have any vaccines, and then later donate the unused and be a hero...",
            "title_similarity": "0.60792977",
            "sentiment_compound": 0.4627
        },
        {
            "id": "h0h7eqj",
            "score": 2,
            "text": "Actual moral leadership from a US president. Wonderful to see it again.",
            "title_similarity": "0.30316353",
            "sentiment_compound": 0.5719
        },
        {
            "id": "h0hckte",
            "score": -2,
            "text": "How kind!\n\nIt only took millions of deaths due to his hoarding",
            "title_similarity": "0.50755346",
            "sentiment_compound": 0.5707
        },
        {
            "id": "h0hcxwt",
            "score": -2,
            "text": "Not 100%? What am I missing?",
            "title_similarity": "0.1152038",
            "sentiment_compound": -0.3736
        },
        {
            "id": "h0hd95p",
            "score": 2,
            "text": "We should tell Americans there's a vaccine shortage so maybe they'd get vaccinated",
            "title_similarity": "0.57691205",
            "sentiment_compound": -0.25
        },
        {
            "id": "h0hfbtc",
            "score": -2,
            "text": "Good, they can have minev",
            "title_similarity": "0.025485035",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h0hflx4",
            "score": -2,
            "text": "[deleted]",
            "title_similarity": "-0.022515053"
        },
        {
            "id": "h0hhkby",
            "score": -2,
            "text": "Guinea pig the 🌎",
            "title_similarity": "0.29486018",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0hieu1",
            "score": -2,
            "text": "At what cost to the US taxpayers?",
            "title_similarity": "0.29615363",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0hrep7",
            "score": -2,
            "text": "Ok, ok, I don't understand why you say Joe Biden, he is not the only one who did this.",
            "title_similarity": "0.22876254",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0hsmcd",
            "score": -2,
            "text": "He can have mine!",
            "title_similarity": "0.03386058",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0hwnm2",
            "score": -2,
            "text": "Minus 10%",
            "title_similarity": "0.23059335",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0hyc5d",
            "score": 2,
            "text": "\"Donate\" lol\n\nWho paid for the vaccines?",
            "title_similarity": "0.65498924",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h0hylm3",
            "score": 2,
            "text": "And that is what a true American President does",
            "title_similarity": "0.32132393",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h0i1pm3",
            "score": 2,
            "text": "It reminds me of the biblical parable where a man held a feast, but the invitees declined to show, so he sent his servants out into the streets to invite everyone they encountered.",
            "title_similarity": "0.3767536",
            "sentiment_compound": 0.2263
        },
        {
            "id": "h0i27q5",
            "score": -2,
            "text": "Don’t go pretend like this clears the US of all the untold pain and suffering they’ve caused across the world by blocking vaccine exports.",
            "title_similarity": "0.4711579",
            "sentiment_compound": -0.765
        },
        {
            "id": "h0i7y8t",
            "score": -2,
            "text": "thanks america for hoarding all the vaccines then acting like heroes for donating some of your stash",
            "title_similarity": "0.6407045",
            "sentiment_compound": 0.8271
        },
        {
            "id": "h0idzno",
            "score": 2,
            "text": "Dude sucks but he’s light years better than trump",
            "title_similarity": "0.2609472",
            "sentiment_compound": 0.4767
        },
        {
            "id": "h0iekgk",
            "score": -2,
            "text": "It’s a bad move tbh. We buy the vaccines at about $20 and then donate them to third world countries to whom the pharma companies were planning the vaccines at a discounted rate of $9. It’s just bad business. \n\nWe don’t prevent variants by doing so because giving India as an example 7 million doses (3.5 million vaccinations) does not result in herd immunity as their population is well over a billion at this point. Instead it will give the virus repeated exposures to vaccinated persons while it’s still able to successfully replicate among the 99% of the population that isn’t vaccinated (minus those who have recovered from wild type infections). If anything, this increases the evolutionary pressure on the virus to evade the antibodies generated to our vaccines. \n\nI think it would be better, if you did for whatever reason feel the need to donate the additional $11/shot to a pharmaceutical company, to give the vaccines to a country whose population would reach herd immunity by receiving them. For instance, we could cover multiple Central American populations. Maybe grab El Salvador, Honduras, Guatemala and Nicaragua. Something to that effect.",
            "title_similarity": "0.70116544",
            "sentiment_compound": 0.2682
        },
        {
            "id": "h0if0c8",
            "score": 2,
            "text": "Very good. No other president would donate their unused vaccine like this. Now pull the patents from the corrupt pharma-cos so anyone can make the vaccine.",
            "title_similarity": "0.61238813",
            "sentiment_compound": 0.4964
        },
        {
            "id": "h0igx6p",
            "score": -2,
            "text": "Sell that shit dum dum.",
            "title_similarity": "0.17139974",
            "sentiment_compound": -0.5574
        },
        {
            "id": "h0ijiyr",
            "score": -2,
            "text": "What about the other 25%? Wouldn't it make sense to move on all vaccines that would otherwise go to waste?",
            "title_similarity": "0.66960526",
            "sentiment_compound": -0.4871
        },
        {
            "id": "h0ipnbg",
            "score": -2,
            "text": "There’s something weird about how much they insist on her being on stage with him for photos even when she’s not saying a damn thing. And that pose… it’s unsettling. Hawkish.",
            "title_similarity": "0.16900574",
            "sentiment_compound": 0.1426
        },
        {
            "id": "h0iqfs5",
            "score": -2,
            "text": "I wonder why there are so many unwanted vaccines?🤨",
            "title_similarity": "0.42648405",
            "sentiment_compound": -0.2911
        },
        {
            "id": "h0itm30",
            "score": -2,
            "text": "And how many of these will get swooped up by Canada before at need countries get a chance to vaccinate their vulnerable and elderly?",
            "title_similarity": "0.5927422",
            "sentiment_compound": 0.0258
        },
        {
            "id": "h0ixsia",
            "score": 2,
            "text": "\"He's selling the vaccine to other nations - see guys, it's dangerous!\" - Morons.",
            "title_similarity": "0.4939348",
            "sentiment_compound": -0.69
        },
        {
            "id": "h0izuo9",
            "score": 2,
            "text": "Shouldn't the title read: America to donate 75% of unused vaccines to UN vaccine program?",
            "title_similarity": "0.9393889",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0j02fj",
            "score": -2,
            "text": "\"Americans to donate 75% of unused COVID vaccines to UN-backed global vaccibe program\"\n\nFixed.",
            "title_similarity": "0.9615731",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0j0joh",
            "score": -2,
            "text": "After hoarding materials and vaccines forever... USA strikes again",
            "title_similarity": "0.5249542",
            "sentiment_compound": -0.3612
        },
        {
            "id": "h0j67bf",
            "score": 2,
            "text": "This is a great common sense idea that will help a lot of people.  Biden's on a roll!",
            "title_similarity": "0.15087795",
            "sentiment_compound": 0.7959
        },
        {
            "id": "h0j7pth",
            "score": 2,
            "text": "Good. Now prosecute the leaders of the insurrection and secure our voting rights, goddamnit.",
            "title_similarity": "0.34750158",
            "sentiment_compound": 0.3818
        },
        {
            "id": "h0j8241",
            "score": 2,
            "text": "In Mexico we have a total of 4% of people vaccinated. I don't think I'll get one this year\n\nChale",
            "title_similarity": "0.6307539",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0j8kkz",
            "score": -2,
            "text": "Except he can't...",
            "title_similarity": "-0.07105616",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0j9p4o",
            "score": -2,
            "text": "The UN is shit",
            "title_similarity": "0.005568167",
            "sentiment_compound": -0.5574
        },
        {
            "id": "h0ja9pr",
            "score": -2,
            "text": "[deleted]",
            "title_similarity": "-0.022515053"
        },
        {
            "id": "h0jmbs4",
            "score": -2,
            "text": "odd morality....",
            "title_similarity": "-0.094979025",
            "sentiment_compound": -0.3182
        },
        {
            "id": "h0jx90c",
            "score": 2,
            "text": "Sounds good but the rich nations incl the US have been hoarding vaccines and not sharing IP so poor countries can make their own, so they are way behind. The problem is with the pandemic it will simply continue and potentially the mutations could outpace the vaccines.",
            "title_similarity": "0.5279299",
            "sentiment_compound": -0.6471
        },
        {
            "id": "h0jzyqm",
            "score": 2,
            "text": "Well I had to scroll pretty far too find it but knew it would be there. \n\n\"Biden has committed to providing other nations with all 60 million U.S.-produced doses of the AstraZeneca vaccine, which has yet to be authorized for use in America but is widely approved around the world\" \n\nThe AZ Jag has been banned in numerous countries for use in under 40s , some countries for under 60s and some countries it's banned altogether as the risk of dying from blood clots is too high. \n\nHe's not  being nice, he's doing what we done and offloading the dangerous shots to countries who are too desperate to turn them down. \n\nFirst it was under 30s here (UK) who were told not to take it. \n\nhttps://www.google.com/url?sa=t&source=web&rct=j&url=https://apnews.com/article/eu-rare-blood-clots-possibly-linked-astrazeneca-vaccine-1ec87a9b7f14f98e29962e9d055d27ed&ved=2ahUKEwimz9i28P3wAhVz7OAKHR2jCbAQFjAKegQICBAC&usg=AOvVaw3lLcI-xJuXYQjEw_CZnhta\n\nThen the under 40s (UK)\n https://www.google.com/url?sa=t&source=web&rct=j&url=https://www.bbc.co.uk/news/health-57021738.amp&ved=2ahUKEwimz9i28P3wAhVz7OAKHR2jCbAQFjAAegQIBRAC&usg=AOvVaw2ObyQjgF66TRF-KKgFxyy6&ampcf=1\n\nAnd some other countries such as denmark won't give it to anyone. \n https://www.google.com/url?sa=t&source=web&rct=j&url=https://www.bbc.co.uk/news/world-56763490&ved=2ahUKEwimz9i28P3wAhVz7OAKHR2jCbAQFjABegQIBBAC&usg=AOvVaw1hJ4McAW05S2pJEI05IIuF\n\nFor people aged 30-40 the chances of it giving you blood clots are 1 in 100k. For under 30s it's 1 in 60k. Which literally makes it more dangerous than covid for younger people. You can find that info in the first link I shared.",
            "title_similarity": "0.6593542",
            "sentiment_compound": -0.9114
        },
        {
            "id": "h0gjo8l",
            "score": 3894,
            "text": "Maybe if we start giving them away to other countries all the conservatives who refuse to get them will shriek in outrage and demand they be given those doses, they can’t pass up a chance to be rotten.",
            "title_similarity": "0.43113905",
            "sentiment_compound": -0.7096
        },
        {
            "id": "h0gxfvs",
            "score": 17,
            "text": "Translation:  The remaining ~35% of eligible US recipients aren't coming around any time soon.",
            "title_similarity": "0.45160407",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0h44sr",
            "score": -11,
            "text": "[removed]",
            "title_similarity": "-0.06395121"
        },
        {
            "id": "h0hagaq",
            "score": -11,
            "text": "[deleted]",
            "title_similarity": "-0.022515053"
        },
        {
            "id": "h0hfqe9",
            "score": -10,
            "text": "President Trump’s operation light speed just keeps on giving!  Thanks president Trump!",
            "title_similarity": "0.36422825",
            "sentiment_compound": 0.7081
        },
        {
            "id": "h0i2gq5",
            "score": -10,
            "text": "Cool they can have mine because I'm not touching that shit!!",
            "title_similarity": "-0.00899083",
            "sentiment_compound": 0.7011
        },
        {
            "id": "h0iuss8",
            "score": 10,
            "text": "America back in the global leadership scene, its a good start.",
            "title_similarity": "0.26953977",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h0izymp",
            "score": 11,
            "text": "Oh boy I can't wait for dumbass conservatives to twist this around!",
            "title_similarity": "0.29180306",
            "sentiment_compound": 0.4966
        },
        {
            "id": "h0h3wax",
            "score": 3,
            "text": "look up \"black fungus covid india\" that will make you want to send as much vaccine over there as possible.",
            "title_similarity": "0.51876676",
            "sentiment_compound": 0.0772
        },
        {
            "id": "h0h4kvo",
            "score": 4,
            "text": "Anti-vaxxers: oh hell naw, you ain't injecting that 5g virus In me!\n\nAlso anti-vaxxers after finding out about this. Oh hell naw, you're giving away our vaccines! Tell them to make their own!",
            "title_similarity": "0.5486576",
            "sentiment_compound": -0.865
        },
        {
            "id": "h0h681g",
            "score": -3,
            "text": "I had to push my JJ vaccine back 2 weeks because of a different vaccine my doc gave me at my physical today. \n\nDon't give away my shot, Joe!",
            "title_similarity": "0.62157",
            "sentiment_compound": 0.4633
        },
        {
            "id": "h0h86y7",
            "score": -2,
            "text": "Why aren’t we giving them to NATO allies first?",
            "title_similarity": "0.32588908",
            "sentiment_compound": 0.34
        },
        {
            "id": "h0h9pbn",
            "score": -2,
            "text": "Joe Biden? It should be United States of America isn't it?",
            "title_similarity": "0.3418501",
            "sentiment_compound": 0.4871
        },
        {
            "id": "h0h9xik",
            "score": -4,
            "text": "Joe Biden is so generous to make this donation out of his own pocket.",
            "title_similarity": "0.31074345",
            "sentiment_compound": 0.6418
        },
        {
            "id": "h0hd0zk",
            "score": -3,
            "text": "Americans 😆 superpower going retarded is a dangerous superpower.  Why don't they want to get vaccinated, wtf are they thinking?  Maybe they are afraid it will hurt their arm too much 🤔",
            "title_similarity": "0.4125862",
            "sentiment_compound": -0.9139
        },
        {
            "id": "h0hj0o4",
            "score": 2,
            "text": "Why is there 75% of unused vaccines in the first place?!",
            "title_similarity": "0.81602216",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0hs9fv",
            "score": -2,
            "text": "[removed]",
            "title_similarity": "-0.06395121"
        },
        {
            "id": "h0hvbwd",
            "score": 3,
            "text": "Can't blame him. If you are an American citizen who is eligible for the vaccine and STILL haven't gotten a single shot, you only have yourself to blame.",
            "title_similarity": "0.5059279",
            "sentiment_compound": -0.0936
        },
        {
            "id": "h0hzfqr",
            "score": 3,
            "text": "Thank you Uncle Joe",
            "title_similarity": "0.17608319",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h0i13cj",
            "score": -2,
            "text": "Good, I was hoping somebody would take mine lmfao\nAhhh it looks like y’all didn’t like that one 😂 it’s like y’all wanna do everything with this vaccine except get it fully approved 😩",
            "title_similarity": "0.44317234",
            "sentiment_compound": 0.9602
        },
        {
            "id": "h0i8gth",
            "score": 4,
            "text": "I've been hoping something along these lines would happen. \n\nIn the back of my mind, im hoping a certain group of people get upset by this, claiming \"why not help us Americans first\" and Jedi mind trick them into getting vaccinated. Like a kid that only wants to play with a ball when somebody else does",
            "title_similarity": "0.39443475",
            "sentiment_compound": 0.7609
        },
        {
            "id": "h0i9qih",
            "score": -4,
            "text": "Throw them in the garage",
            "title_similarity": "0.17093006",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0ianlr",
            "score": 2,
            "text": "Biden is not donating this, we are!",
            "title_similarity": "-0.013496859",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0ibjta",
            "score": 2,
            "text": "It’s actually pretty funny how I’m seeing people who are getting COVID after refusing the vaccine for months. All the unvaccinated people will have a surge in cases and we can say “Told you so”. Employers are also discontinuing paid time off for those who get sick with it so they really screwed themselves.",
            "title_similarity": "0.5532169",
            "sentiment_compound": -0.5657
        },
        {
            "id": "h0ih7s0",
            "score": -4,
            "text": "I donate the one set aside for me to that cause as well.",
            "title_similarity": "0.33233064",
            "sentiment_compound": 0.2732
        },
        {
            "id": "h0ihg6m",
            "score": 3,
            "text": "Hey that's awesome go biden",
            "title_similarity": "0.001060646",
            "sentiment_compound": 0.6249
        },
        {
            "id": "h0inxyt",
            "score": -3,
            "text": "They can donate mine 👍",
            "title_similarity": "0.21541455",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0ir205",
            "score": 3,
            "text": "Yes Joe yes!",
            "title_similarity": "-0.015620399",
            "sentiment_compound": 0.69
        },
        {
            "id": "h0is9bo",
            "score": 3,
            "text": "I hope 🤞🏽 it reaches the most in need ASAP!!! This is so crucial to get the world 🌎 back",
            "title_similarity": "0.24439652",
            "sentiment_compound": 0.6093
        },
        {
            "id": "h0itmkz",
            "score": 3,
            "text": "Way to go Mr President.",
            "title_similarity": "0.25139546",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0j0y2z",
            "score": 4,
            "text": "In before Americans who refuse to get vaccinated start complaining about helping them damn foreigners instead of hard working 'Mericans.",
            "title_similarity": "0.42601663",
            "sentiment_compound": -0.5994
        },
        {
            "id": "h0j7hzt",
            "score": 3,
            "text": "Now watch all of the anti-vax/Covid deniers complain that out unused vaccines that they didn't want are going to help the people who need it the most.",
            "title_similarity": "0.5419458",
            "sentiment_compound": -0.2783
        },
        {
            "id": "h0j8f17",
            "score": -3,
            "text": "Fucking gringos",
            "title_similarity": "0.079907715",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0gtops",
            "score": -12,
            "text": "[deleted]",
            "title_similarity": "-0.022515053"
        },
        {
            "id": "h0h386q",
            "score": -14,
            "text": "Didn’t we have a insane shortage of vaccines like two months ago? \n\nMan these guys can’t make up their minds.",
            "title_similarity": "0.52746177",
            "sentiment_compound": -0.296
        },
        {
            "id": "h0h2yxy",
            "score": -15,
            "text": "What’s Khamalas opinion on this?  Khamala says “HAHAHAHAHA”  That’s her only response when she can’t answer ANYTHING with a pre made response. This admin is so corrupt. No transparency. Just circle back to it never.",
            "title_similarity": "0.17981322",
            "sentiment_compound": -0.3566
        },
        {
            "id": "h0h2jnv",
            "score": 5,
            "text": "And look guys he didn’t try to squeeze money out of the countries he’s sending them too.",
            "title_similarity": "0.26812142",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0h4pal",
            "score": -5,
            "text": "[deleted]",
            "title_similarity": "-0.022515053"
        },
        {
            "id": "h0h5l0y",
            "score": -3,
            "text": "Even though demand in the U.S. for vaccines is falling, we should still hold on to our supply to ensure we have enough doses for every American. Just look at India, they donated their doses too soon. \n\nShare the AZ doses, those are not approved for use in the U.S. anyway, but keep enough of the Pfizer and Moderna doses to vaccinate every American. \n\nI’m vaccinated, for the users saying that the people complaining about this plan will be the never-vaxers.",
            "title_similarity": "0.5700511",
            "sentiment_compound": -0.2537
        },
        {
            "id": "h0h5w75",
            "score": -3,
            "text": "Tell me when he *actually* does it, cause he sure talks a lot about things he doesnt actually do later on",
            "title_similarity": "0.20230433",
            "sentiment_compound": 0.3182
        },
        {
            "id": "h0h6si2",
            "score": -5,
            "text": "You've twisted the headline. The president doesn't have squat. The United States is donating the vaccines. \n\nActual source headline:\n>US will boost global vaccine-sharing, Biden announces  \n\nFirst sentence: \n>President Joe Biden announced Thursday the U.S. will donate 75% of its unused COVID-19 vaccines to the U.N.-backed COVAX global vaccine sharing program...",
            "title_similarity": "0.872432",
            "sentiment_compound": 0.8225
        },
        {
            "id": "h0ha0ie",
            "score": -5,
            "text": "Well shouldn't have just hoard it the first place sucka!",
            "title_similarity": "0.17716043",
            "sentiment_compound": 0.3382
        },
        {
            "id": "h0haxse",
            "score": -5,
            "text": "Too bad it’s through the UN. Bummer.",
            "title_similarity": "0.1816278",
            "sentiment_compound": -0.7269
        },
        {
            "id": "h0hckly",
            "score": -4,
            "text": "Don’t know man .... don’t trust these politicians and their vaccines",
            "title_similarity": "0.27558303",
            "sentiment_compound": 0.5106
        },
        {
            "id": "h0he5we",
            "score": 4,
            "text": "if the un is as good at distributing vaxes as it is stopping genocide then we should be fine.",
            "title_similarity": "0.3786804",
            "sentiment_compound": 0.4767
        },
        {
            "id": "h0hhr8o",
            "score": -5,
            "text": "You can't donate something you yourself didn't work for.",
            "title_similarity": "0.09184921",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0hhsfz",
            "score": -4,
            "text": "Donate mine. I’m never going to get it.",
            "title_similarity": "0.1229875",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0hydcu",
            "score": -5,
            "text": "[deleted]",
            "title_similarity": "-0.022515053"
        },
        {
            "id": "h0i1ie3",
            "score": -4,
            "text": "Look at Harris licking her lips and rubbing her hands together thinking “ I can’t wait to be president next year”",
            "title_similarity": "0.36329782",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0i31kf",
            "score": 3,
            "text": "I can’t wait to hear Republicans who will not take the shot complain about this.",
            "title_similarity": "0.28499636",
            "sentiment_compound": -0.3612
        },
        {
            "id": "h0i6kq6",
            "score": -3,
            "text": "How Biden is a freakin idiot, think of all the money that has made its way to this guys family. He sold his soul to the devil A LONG TIME AGO. Terrible person, terrible party, terrible family",
            "title_similarity": "0.370184",
            "sentiment_compound": -0.936
        },
        {
            "id": "h0i71d4",
            "score": 3,
            "text": "That awkward moment when nobody wants a vaccine so you have to donate them before they expire.",
            "title_similarity": "0.45864558",
            "sentiment_compound": -0.1531
        },
        {
            "id": "h0i7g6p",
            "score": 5,
            "text": "To be a bit more acurrate..the official white house fact sheet  states that it was not Biden admin.. but the  Biden-Harris Administration. \n\n&#x200B;\n\nhttps://www.whitehouse.gov/briefing-room/statements-releases/2021/06/03/fact-sheet-biden-harris-administration-unveils-strategy-for-global-vaccine-sharing-announcing-allocation-plan-for-the-first-25-million-doses-to-be-shared-globally/",
            "title_similarity": "0.64541745",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0i8ukn",
            "score": 3,
            "text": "I've never seen so much strawmanning against what conservatives **might** do.",
            "title_similarity": "0.36572596",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0i8ycb",
            "score": 5,
            "text": "Republicans who refuse to get vaccinated: They're giving away all our vaccines!!!",
            "title_similarity": "0.51412207",
            "sentiment_compound": 0.2677
        },
        {
            "id": "h0iarhv",
            "score": 5,
            "text": "Good. Better than being wasted in red states.",
            "title_similarity": "0.112297505",
            "sentiment_compound": 0.3818
        },
        {
            "id": "h0ic8nf",
            "score": -4,
            "text": "global depopulation program",
            "title_similarity": "0.25532556",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0ihrce",
            "score": -5,
            "text": "I gave mine to the kid sniffer to donate",
            "title_similarity": "0.3499273",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0ik4tt",
            "score": 5,
            "text": "Bold strategy to get the MAGATs vaccinated.... “Sleepy Joe isn’t giving my vaccine to no foreigner”",
            "title_similarity": "0.5321675",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h0io34d",
            "score": -3,
            "text": "But how will he grift money back into his own pockets this way?",
            "title_similarity": "0.26572782",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0isf0x",
            "score": -5,
            "text": "Can’t make this shit up. Corruption everywhere",
            "title_similarity": "0.050050363",
            "sentiment_compound": -0.6428
        },
        {
            "id": "h0ismqh",
            "score": 4,
            "text": "Fox news: Creepy Biden DUMPS covid vaccines into the hands of known TERRORIST organization, the United nations.",
            "title_similarity": "0.54215515",
            "sentiment_compound": -0.7944
        },
        {
            "id": "h0ivexw",
            "score": 3,
            "text": "Hope it reaches lot of unfortunate counties who needs it badly. Prayers up!!!",
            "title_similarity": "0.26346415",
            "sentiment_compound": -0.5962
        },
        {
            "id": "h0iyyh9",
            "score": 4,
            "text": "Perfect.... these rednecks in Texas are not using them.",
            "title_similarity": "0.22444083",
            "sentiment_compound": 0.5719
        },
        {
            "id": "h0izjdu",
            "score": 5,
            "text": "Has anyone considered telling Americans that some brown people might be getting these vaccinations that were meant for you? They might suddenly want them.",
            "title_similarity": "0.49225035",
            "sentiment_compound": 0.0772
        },
        {
            "id": "h0j3rer",
            "score": -4,
            "text": "Just fucking suspend the vaccine patents. Let countries make their own vaccines. Fuck off with this half-assed \"guess you can have our leftovers\" bullshit, stop keeping how a lifesaving vaccine is made a secret. Everyone complicit in maintaining IP law in the face of millions of deaths have blood on their hands, and that includes Biden.",
            "title_similarity": "0.56769544",
            "sentiment_compound": -0.902
        },
        {
            "id": "h0j5l5b",
            "score": -5,
            "text": "Why don’t we sell them and take a little chunk out of our National debt",
            "title_similarity": "0.4570884",
            "sentiment_compound": -0.3612
        },
        {
            "id": "h0jl4qx",
            "score": -3,
            "text": "More like us tax payer to donate...",
            "title_similarity": "0.336927",
            "sentiment_compound": 0.4201
        },
        {
            "id": "h0jnbnw",
            "score": -4,
            "text": "The biggest scam right behind the FED…",
            "title_similarity": "0.3722016",
            "sentiment_compound": -0.5719
        },
        {
            "id": "h0jwn67",
            "score": -4,
            "text": "Why would y’all want a vaccine to a virus that have a 99% survival rate as of now, it does NOT keep u from getting the virus in the way that the flu keeps u getting the flu, and it has also killed 4K ppl in America and 10k ppl in Europe. These are all facts u can find on ur own",
            "title_similarity": "0.6596108",
            "sentiment_compound": -0.8555
        },
        {
            "id": "h0haigp",
            "score": 108,
            "text": "[deleted]",
            "title_similarity": "-0.022515053"
        },
        {
            "id": "h0gvfy0",
            "score": -4,
            "text": "Why won't anyone back the vaccine program? /s 😅 \nEdit: for clarity i am fully vaxed just saw an opportunity to make a bad joke lmao",
            "title_similarity": "0.39676473",
            "sentiment_compound": 0.8625
        },
        {
            "id": "h0h0upq",
            "score": -3,
            "text": "[removed]",
            "title_similarity": "-0.06395121"
        },
        {
            "id": "h0h22ty",
            "score": -5,
            "text": "We should be giving these directly to our allies like India and Taiwan, not providing them for sale by the corrupt UN.",
            "title_similarity": "0.34201667",
            "sentiment_compound": 0.5994
        },
        {
            "id": "h0h2lk7",
            "score": -5,
            "text": "After stealing a bunch from other countries lmao",
            "title_similarity": "0.27161372",
            "sentiment_compound": 0.0516
        },
        {
            "id": "h0h2u96",
            "score": -4,
            "text": "Enjoy the pathogenic spike protein",
            "title_similarity": "0.13617349",
            "sentiment_compound": 0.4939
        },
        {
            "id": "h0h2xe2",
            "score": -5,
            "text": "Eat more chocolate chocolate chip",
            "title_similarity": "0.27489117",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0h3ykf",
            "score": -5,
            "text": "U.N only a fucking idiot would accept it.",
            "title_similarity": "0.11318737",
            "sentiment_compound": -0.1851
        },
        {
            "id": "h0h5o9t",
            "score": -6,
            "text": "Or we could hang on to em for our own country…",
            "title_similarity": "0.1638853",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0h629o",
            "score": 4,
            "text": "We have so many morons in this country not wanting the vaccine... give it to others who would give their left nut to have the vaccine!  Don’t waste them!",
            "title_similarity": "0.4457432",
            "sentiment_compound": -0.7151
        },
        {
            "id": "h0h6wo5",
            "score": -5,
            "text": "Too little too late. The world should remember who it was that put everyones safety first and didn’t enact vaccine export bans. The EU.",
            "title_similarity": "0.4185868",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h0h835x",
            "score": -5,
            "text": "I'm surprised he's not using that money to help fund terrorist isreal commit war crimes",
            "title_similarity": "0.31489754",
            "sentiment_compound": -0.5859
        },
        {
            "id": "h0hrcos",
            "score": -4,
            "text": "Wow thanks so much for doing the bare minimum and not just chucking them in the trash. Nobel Peace Prize when?",
            "title_similarity": "0.3168459",
            "sentiment_compound": 0.926
        },
        {
            "id": "h0huke1",
            "score": -6,
            "text": "[removed]",
            "title_similarity": "-0.06395121"
        },
        {
            "id": "h0i1qt9",
            "score": 5,
            "text": "Good. The useless idiots who refuse theirs in the USA shouldn’t complain when they want one later and can’t find one.",
            "title_similarity": "0.22300583",
            "sentiment_compound": -0.5106
        },
        {
            "id": "h0iblyf",
            "score": 5,
            "text": "My god it feels so good to have a humanitarian back in the White House!",
            "title_similarity": "0.30439112",
            "sentiment_compound": 0.7297
        },
        {
            "id": "h0iectd",
            "score": -6,
            "text": "Why the fuck these motherfuckers bought so many doses that they wouldn’t use?\n\nFUCK THE UNITED STATES!",
            "title_similarity": "0.46983993",
            "sentiment_compound": -0.6696
        },
        {
            "id": "h0ijn1j",
            "score": -5,
            "text": "So the US literally **stole** vaccines from shipments going to other countries and now they are giving it back after they’re done vaccinating americans?",
            "title_similarity": "0.6423503",
            "sentiment_compound": 0.34
        },
        {
            "id": "h0inygw",
            "score": -5,
            "text": "But how will he grift money back into his own pockets this way?",
            "title_similarity": "0.26572782",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0iu0nc",
            "score": 6,
            "text": "You have a good President, probably not even 70% of approval, and maybe you don’t agree with him 100% but at least is working",
            "title_similarity": "0.4459311",
            "sentiment_compound": 0.5789
        },
        {
            "id": "h0iwo6i",
            "score": -4,
            "text": "Good cause I'll never get a vaccine",
            "title_similarity": "0.18331188",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h0gwh17",
            "score": 576,
            "text": "Good. I know India is a world away and probably not part of this program but I hope they get some soon. Something about the second most populous country being devastated by covid scares the shit out of me. Those poor people.",
            "title_similarity": "0.39788246",
            "sentiment_compound": -0.3506
        },
        {
            "id": "h0hkeai",
            "score": 268,
            "text": "Us buys vaccines for every citizen\n\n30% of citizens: no i don't want it.\n\nAmerica gives them away.\n\nThose same Americans: how dare they.",
            "title_similarity": "0.73479694",
            "sentiment_compound": -0.3447
        },
        {
            "id": "h0hysif",
            "score": 7,
            "text": "Conservatives who reeee about not getting the vaccine are now going to do a 180 and say they cant get it because of the LIBRUL DEMONRATS LOOKING OUT FOR CHINA OVER US CITIZENS",
            "title_similarity": "0.5155829",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0i5ygf",
            "score": -6,
            "text": "Fuck Joe biden he is a zionist, an evil one.",
            "title_similarity": "0.18696374",
            "sentiment_compound": -0.836
        },
        {
            "id": "h0i94jl",
            "score": -5,
            "text": "Can I get karma so I can go bug the WSB people?",
            "title_similarity": "0.24210347",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0iyvsc",
            "score": 7,
            "text": "What kind of president is Biden??? He didn't even *try* to sell those things to the highest bidder and pocket the profits!!",
            "title_similarity": "0.39656264",
            "sentiment_compound": 0.6154
        },
        {
            "id": "h0gvuyo",
            "score": 20,
            "text": "Good, hopefully someone will actually use them now",
            "title_similarity": "-0.019827025",
            "sentiment_compound": 0.6808
        },
        {
            "id": "h0h1y01",
            "score": -6,
            "text": "Why wouldn't 100% of unused vaccines be donated? Also, you're welcome, UN, thank American tax payers for this gift.",
            "title_similarity": "0.68151075",
            "sentiment_compound": 0.8349
        },
        {
            "id": "h0h1yno",
            "score": -8,
            "text": "Just toss em\nIn the trash",
            "title_similarity": "0.015853452",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0h43kw",
            "score": -7,
            "text": "I know where he can stick the other 25%\n🤡s of 🇺🇸",
            "title_similarity": "0.4724785",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0h5a51",
            "score": 7,
            "text": "Good, why have them  just sit? If they have a shelf life, put them to use before it ends",
            "title_similarity": "0.23441",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h0h5cqu",
            "score": -8,
            "text": "I need up votes so I’m gonna make fun of our president",
            "title_similarity": "0.3571639",
            "sentiment_compound": 0.5106
        },
        {
            "id": "h0h9usa",
            "score": -7,
            "text": "I’m all for getting the whole world vaccinated but can we first focus on finishing vaccination at least enough Americans to reach herd immunity before we give away vaccines to other countries?",
            "title_similarity": "0.6628484",
            "sentiment_compound": 0.0387
        },
        {
            "id": "h0hbtac",
            "score": -7,
            "text": "That's ok. They can have my dose. I'll never get it.",
            "title_similarity": "0.16999248",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0hjmjf",
            "score": -7,
            "text": "Upvote me plz",
            "title_similarity": "0.07417815",
            "sentiment_compound": 0.0772
        },
        {
            "id": "h0hvp81",
            "score": -7,
            "text": "Roflmao and all you sheep keep falling in line lmao, you keep drinking the kool-aid and you ask for more lmao",
            "title_similarity": "0.42590564",
            "sentiment_compound": 0.8999
        },
        {
            "id": "h0hy6w6",
            "score": -7,
            "text": "Might as well donate all 100%. I'm not taking it",
            "title_similarity": "0.43204993",
            "sentiment_compound": 0.2732
        },
        {
            "id": "h0j0yb2",
            "score": -7,
            "text": "Quick, someone take a screenshot before he forgets.",
            "title_similarity": "0.11422286",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0gr10q",
            "score": -8,
            "text": "Those are probably astra zeneca, many countries stopped using them and are donating them.",
            "title_similarity": "0.42811394",
            "sentiment_compound": -0.2263
        },
        {
            "id": "h0h27se",
            "score": -8,
            "text": "[removed]",
            "title_similarity": "-0.06395121"
        },
        {
            "id": "h0h65kx",
            "score": -8,
            "text": "They're all probably expired.",
            "title_similarity": "0.14057077",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0hba0o",
            "score": -7,
            "text": "Why doesn't he donate his paycheck like Trump did?",
            "title_similarity": "0.44594046",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h0hdtuu",
            "score": -8,
            "text": "Sure it's only more tax dollars gone to waste why would a Democrat care",
            "title_similarity": "0.43701154",
            "sentiment_compound": 0.4019
        },
        {
            "id": "h0hfkwm",
            "score": -7,
            "text": "Luckily Trump started operation warp speed so we are able to do this.",
            "title_similarity": "0.351236",
            "sentiment_compound": 0.5106
        },
        {
            "id": "h0hixcp",
            "score": 8,
            "text": "Send some to australia. Our usless PM needs all the help he can get",
            "title_similarity": "0.30665472",
            "sentiment_compound": 0.4019
        },
        {
            "id": "h0hkq56",
            "score": -8,
            "text": "You stupid democrats don’t even know joe Biden talked about a little girls legs during a Memorial Day speech",
            "title_similarity": "0.47971752",
            "sentiment_compound": -0.5267
        },
        {
            "id": "h0hr366",
            "score": -8,
            "text": "What an idiotic move- now countries like Venezuela, Nicaragua, Iran etc can obtain vaccines paid by the USA taxpayer! Rookie foreign policy mistake!",
            "title_similarity": "0.5750325",
            "sentiment_compound": -0.6229
        },
        {
            "id": "h0hu9j9",
            "score": -8,
            "text": "Joe is a disgusting pedophile hey man I like those bows in your hair oh you look at least 19 sitting there with your legs crossed Joe pervs out on a 9 year old girl 😠",
            "title_similarity": "0.34019896",
            "sentiment_compound": -0.6369
        },
        {
            "id": "h0hyyif",
            "score": -9,
            "text": "Donating vaccines: vaccine apartheid disguised as charity! Not a TRIPS waiver that includes mechanisms for other countries to develop and distribute vaccines. Give a man a fish and he'll shut up about the fact that you won't let him teach himself to fish.",
            "title_similarity": "0.47096846",
            "sentiment_compound": 0.2481
        },
        {
            "id": "h0iacbu",
            "score": -7,
            "text": "Good, I don't want or need your fucking vaccine you old biggot.",
            "title_similarity": "0.17670262",
            "sentiment_compound": 0.3975
        },
        {
            "id": "h0h5sli",
            "score": -9,
            "text": "But capitalism is bad? Isn't big pharmaceutical bad too? Isn't the airlines  used to transport it bad? What about the military used to protect it? Also bad right guys? \n\nNow if we had listened to extremist in 2019 we would have nothing. Good job extremist.",
            "title_similarity": "0.4185083",
            "sentiment_compound": -0.9208
        },
        {
            "id": "h0h6emo",
            "score": -9,
            "text": "Nice I love my tax dollars going to other fucking countries. Neither could have possibly planned for this.",
            "title_similarity": "0.33709183",
            "sentiment_compound": 0.7906
        },
        {
            "id": "h0hbcb7",
            "score": -9,
            "text": "WTF qualifies as unused?\n\nNot everyone in the US is vaccinated.  \n\nStop giving our stuff away you POS.",
            "title_similarity": "0.44681925",
            "sentiment_compound": -0.6523
        },
        {
            "id": "h0hfrtn",
            "score": -9,
            "text": "[deleted]",
            "title_similarity": "-0.022515053"
        },
        {
            "id": "h0icndv",
            "score": -10,
            "text": "[deleted]",
            "title_similarity": "-0.022515053"
        },
        {
            "id": "h0gsxsi",
            "score": -12,
            "text": "Yes!!! This is why I haven’t gotten vaccinated!  I’m so glad vaccines are finally getting donated from US to folks that need them hella more than healthy western youth",
            "title_similarity": "0.58712375",
            "sentiment_compound": 0.8996
        },
        {
            "id": "h0h6mt1",
            "score": -11,
            "text": "All the covid vaccines are useless, anyway. Pharma companies misled everyone.",
            "title_similarity": "0.38121402",
            "sentiment_compound": -0.4215
        },
        {
            "id": "h0gz8q0",
            "score": 1253,
            "text": "In a few years we'll see a lot of people who chose not to get vaccinated talking about how they couldn't get vaccinated because Joe Biden gave away all the vaccines to other countries lmao.",
            "title_similarity": "0.6232054",
            "sentiment_compound": 0.5994
        },
        {
            "id": "h0hmmg8",
            "score": 43,
            "text": "I sure hope nobody in the hesitency group is at all complaining about these vaccines going to other countries.",
            "title_similarity": "0.43626106",
            "sentiment_compound": 0.5267
        },
        {
            "id": "h0hz8gm",
            "score": 18,
            "text": "Dual US and Canada citizen here. I have felt a tremendous amount of guilt  seeing ads saying \"now accepting walk-ins for vaccines!\" while my friends and family in Canada struggle through brutal quarantine with no end in sight. \n\nI believe Canada found sources of supply prior to this announcement as their roll out is well underway,, but it still feels good that they, and other nations, will be able to get some of what the US has made clear it doesn't want anymore. If nothing else, this should accelerate timelines to reopening.",
            "title_similarity": "0.51977",
            "sentiment_compound": 0.7292
        },
        {
            "id": "h0gkoie",
            "score": 3300,
            "text": "Selfishly, I want to travel again. Other countries having similar vaccination rates to the US will mean more and more travel restrictions will finally be lifted.",
            "title_similarity": "0.43852097",
            "sentiment_compound": -0.2732
        },
        {
            "id": "h0gzy0n",
            "score": 8262,
            "text": "Guess who’s gonna complain about this....the people that don’t want them.",
            "title_similarity": "0.088694595",
            "sentiment_compound": -0.296
        },
        {
            "id": "h0ipfoo",
            "score": 20,
            "text": "I work in a pharmacy and at this point we are throwing away good doses of vaccine everyday. We were told by our health dept to just get the shots into people’s arms and to no longer worry about wasting vaccine.  To the vaccine hesitant please come and get vaccinated!  The rest of planet earth is having trouble getting there hands on this while us Americans have it spilling out of every pharmacy and doctors office where we live.  Just do it!!",
            "title_similarity": "0.60854876",
            "sentiment_compound": -0.4348
        },
        {
            "id": "h0hf5tp",
            "score": 721,
            "text": "In Alberta it's really fucked up! People are booking at as many places as possible; then not showing up for their appointments. Their hope is that vaccines will be wasted. What idiotic morons!",
            "title_similarity": "0.38871205",
            "sentiment_compound": -0.9096
        },
        {
            "id": "h0h95ol",
            "score": 93,
            "text": "This is the US adult equivalent to “if you don’t eat your food, it will go to waste and there are starving children in Africa.” As a physician, I am so frustrated by meeting and trying to convince adults who should know better to get the vaccine but refuse it despite someone who does know better telling them they should get it. And then I am seeing those in the hospital who didn’t get the vaccine as a consequence of not getting the vaccine..",
            "title_similarity": "0.5222272",
            "sentiment_compound": -0.246
        },
        {
            "id": "h0gco01",
            "score": 12671,
            "text": "Finally a substantial amount of vaccines that would otherwise go to waste.",
            "title_similarity": "0.41372925",
            "sentiment_compound": -0.25
        },
        {
            "id": "h0h7bc9",
            "score": 2544,
            "text": "As a Filipino who's estimated first shot date has jumped around from anywhere between 2-36 years, thank you~",
            "title_similarity": "0.38420552",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h0gt9mo",
            "score": 1,
            "text": "Did he just said unused? We barely half vaccines in Mexico, i literally had to flew to the us to get vaccinated",
            "title_similarity": "0.59291476",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0gx3e5",
            "score": 1,
            "text": "hell yeah ridin' with Biden baby.",
            "title_similarity": "0.17693004",
            "sentiment_compound": -0.5267
        },
        {
            "id": "h0gxc8h",
            "score": 1,
            "text": "I really hope we're making sure our neighbors have what they need. I want my brothers and sisters in Canada and Mexico to feel the same sense of relief I do right now.",
            "title_similarity": "0.40731558",
            "sentiment_compound": 0.8357
        },
        {
            "id": "h0h0zy0",
            "score": 1,
            "text": "Could be a good way for selfish America 1st americans that don’t want to vaccinate to vaccinate out of spite.",
            "title_similarity": "0.39018312",
            "sentiment_compound": -0.5106
        },
        {
            "id": "h0h41in",
            "score": 3,
            "text": "I promise people will read that and believe that he is giving 75% of our vaccines to the UN.",
            "title_similarity": "0.8903737",
            "sentiment_compound": 0.5719
        },
        {
            "id": "h0h41sf",
            "score": 2,
            "text": "Good job Biden.  I feel sad for other countries that still battling with the virus.",
            "title_similarity": "0.3539896",
            "sentiment_compound": -0.3182
        },
        {
            "id": "h0h45np",
            "score": 2,
            "text": "Thank you, Mr. Biden. We’re all human after all. 💎👐🏽",
            "title_similarity": "0.15688896",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h0h467j",
            "score": 1,
            "text": "Crazy considering how easy it is to get a a vaccine",
            "title_similarity": "0.25593948",
            "sentiment_compound": 0.128
        },
        {
            "id": "h0h46l1",
            "score": 1,
            "text": "This is amazing.",
            "title_similarity": "-0.060528755",
            "sentiment_compound": 0.5859
        },
        {
            "id": "h0h4hbh",
            "score": 2,
            "text": "All the red state vaccines.",
            "title_similarity": "0.48281813",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0h4w9z",
            "score": 2,
            "text": "Hell yeah! Just another example of how we have a real American president again.",
            "title_similarity": "0.44437885",
            "sentiment_compound": -0.5707
        },
        {
            "id": "h0h54t1",
            "score": 2,
            "text": "If Trump was still president he’d rather send it to the landfill",
            "title_similarity": "0.42875645",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0h55zt",
            "score": 1,
            "text": "Send them to Georgia pleeaaase. Preatty please.",
            "title_similarity": "0.228235",
            "sentiment_compound": 0.3182
        },
        {
            "id": "h0h5knc",
            "score": 1,
            "text": "Pfizer and J&J be like:\n\n\n“We still get paid right?”",
            "title_similarity": "0.31346664",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h0h5pmr",
            "score": 1,
            "text": "If Uncle Jed & his gun buddies refuse to have themselves \"chipped\", then give the shots to the poor & homeless. No sense wasting medicine on people who think \"Nah! I believe that JESUS will protect me from the LIBERAL COMMIE FLU!\"",
            "title_similarity": "0.5236766",
            "sentiment_compound": -0.8541
        },
        {
            "id": "h0h617y",
            "score": 1,
            "text": "Hey, if we're starting to get a handle on things, or at least as much as we're going to after politicizing a fucking plague, then I'm on-board with our vaccines going anywhere they can be used. India sure as hell need 'em more than we do.",
            "title_similarity": "0.53411996",
            "sentiment_compound": -0.5106
        },
        {
            "id": "h0h6lrb",
            "score": 1,
            "text": "Covax? Dope.",
            "title_similarity": "0.14718723",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0h6np6",
            "score": 1,
            "text": "5-6 Million to Latin America and the Caribbean. They really really need them since they don't manufacture vaccines anywhere near there and there's no European aid/offerings coming in for the Caribbean.",
            "title_similarity": "0.40452987",
            "sentiment_compound": -0.296
        },
        {
            "id": "h0h6yve",
            "score": 1,
            "text": "Wait! I still have one more shot to take.",
            "title_similarity": "0.095775686",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0h6z3c",
            "score": 2,
            "text": "So how are the right going to twist this?",
            "title_similarity": "0.029361263",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0h6z9o",
            "score": 1,
            "text": "QAnon folks: \"What about America first!!! We need to make America great again....Of course I won't take the vaccine.\"",
            "title_similarity": "0.46913514",
            "sentiment_compound": 0.7163
        },
        {
            "id": "h0h72uv",
            "score": 1,
            "text": "It’s still strange rather than donating vaccines, there’s still patent restrictions? For certain countries that have facilities capable of producing vaccines?",
            "title_similarity": "0.4212134",
            "sentiment_compound": 0.504
        },
        {
            "id": "h0h78iq",
            "score": 1,
            "text": "There is a certain segment of the American population that might be motivated by this to get vaccinated now.\n\nIf the only way they can prevent expensive vaccines bought with taxpyer dollars from going to poor foreigners is to use them up themselves, then they will pull up their sleeves to get 5G mircoshipped as a matter of principle.",
            "title_similarity": "0.64692676",
            "sentiment_compound": 0.296
        },
        {
            "id": "h0h791l",
            "score": 1,
            "text": "Vista oil",
            "title_similarity": "0.08184677",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0h7c64",
            "score": 1,
            "text": "Curious how we have that many unused vaccines in the first place. I get that plenty of people chose not to be vaccinated but even if that was the case shouldn’t we have only had the amount of vaccines necessary for all the people of the us? And shouldn’t we hold onto them assuming some people will still change their mind?",
            "title_similarity": "0.5720011",
            "sentiment_compound": 0.2523
        },
        {
            "id": "h0h7hb0",
            "score": 2,
            "text": "Nothing is gonna make Americans get poked faster than thinking that some other country is going to benefit from \"their\" vaccines lol.",
            "title_similarity": "0.49538618",
            "sentiment_compound": 0.7003
        },
        {
            "id": "h0h7kht",
            "score": 1,
            "text": "Why do they have so many unused vaccines?",
            "title_similarity": "0.5191598",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0h7qli",
            "score": 1,
            "text": "Is there a list of countries? something tells me my country will be forgotten once again.",
            "title_similarity": "0.27527404",
            "sentiment_compound": -0.2263
        },
        {
            "id": "h0h7s2g",
            "score": 3,
            "text": "🥰",
            "title_similarity": "-0.064157486",
            "sentiment_compound": 0.8074
        },
        {
            "id": "h0h7s3w",
            "score": 1,
            "text": "Did he donate some Chocolate Chocolate Chip with it?",
            "title_similarity": "0.38321725",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0h7x1j",
            "score": 4,
            "text": "The US should do this and then report a 'potential' shortage coming for the first dose so people need to get it or else they will have to wait because they went to 'other countries'.\n\nParts of China are having this and there is suddenly a huge rush to get the first shot despite tons of people saying they weren't going to get it because it is 'untested and unsafe'. (Just an example of the psychological effect idk how effective the Chinese vaccine is).",
            "title_similarity": "0.43651626",
            "sentiment_compound": 0.4588
        },
        {
            "id": "h0h7zs0",
            "score": 1,
            "text": "Send some to your mexican neighbors",
            "title_similarity": "0.29935664",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0h944g",
            "score": 1,
            "text": "Why isn’t it backed!?",
            "title_similarity": "-0.029210772",
            "sentiment_compound": 0.1007
        },
        {
            "id": "h0h954u",
            "score": 1,
            "text": "What will they do with the microchips or is it an all inclusive deal?",
            "title_similarity": "0.26740038",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0h9b1s",
            "score": 1,
            "text": "Remember when the promise of patent sharing at the beginning was a thing.",
            "title_similarity": "0.21025589",
            "sentiment_compound": 0.6249
        },
        {
            "id": "h0h9es1",
            "score": 1,
            "text": "Yo can we send some to Taiwan and South Korea?",
            "title_similarity": "0.23186636",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0h9h3j",
            "score": 2,
            "text": "We should send at lest some of them to Taiwan since China is trying to block them from getting the vaccine.",
            "title_similarity": "0.42472017",
            "sentiment_compound": -0.4404
        },
        {
            "id": "h0h9wyg",
            "score": 1,
            "text": "The other 25% will be used for this summer's return if Baja Blast.",
            "title_similarity": "0.53330797",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0ha6k4",
            "score": 2,
            "text": "Nice one Joe",
            "title_similarity": "-0.03937012",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h0habp8",
            "score": 2,
            "text": "Hopefully they go to countries in need, like Canada.  \n/s",
            "title_similarity": "0.2994481",
            "sentiment_compound": 0.6369
        },
        {
            "id": "h0hamun",
            "score": 1,
            "text": "Please send some to the Philippines 🇵🇭",
            "title_similarity": "0.13292576",
            "sentiment_compound": 0.3182
        },
        {
            "id": "h0hb4pq",
            "score": 1,
            "text": "Meanwhile in Australia, doses are expiring and thrown out before they get used because they're only available to certain demographics in certain areas, while 5% has had a full dose.",
            "title_similarity": "0.4782836",
            "sentiment_compound": 0.4939
        },
        {
            "id": "h0hbb2b",
            "score": 1,
            "text": "I’m in a waiting room with a radio and as soon as I opened this article this exact news came on the radio. Freaky",
            "title_similarity": "0.33510476",
            "sentiment_compound": -0.3612
        },
        {
            "id": "h0hbd8m",
            "score": 2,
            "text": "How will the right flip this to something comical?",
            "title_similarity": "0.036078658",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0hblc0",
            "score": 1,
            "text": "Somewhere in Winnipeg, Brian Palliater is RAGING",
            "title_similarity": "0.24982183",
            "sentiment_compound": -0.6289
        },
        {
            "id": "h0hblm4",
            "score": 1,
            "text": "Took him long enough to do some good for the us, hopefully this trend continues.",
            "title_similarity": "0.2628646",
            "sentiment_compound": 0.6808
        },
        {
            "id": "h0hbo40",
            "score": 1,
            "text": "good.\n\nstop dem variants.",
            "title_similarity": "0.076854296",
            "sentiment_compound": 0.1779
        },
        {
            "id": "h0hbrnk",
            "score": 1,
            "text": "Your a good man Charlie Biden Brown.",
            "title_similarity": "0.11765221",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h0hclwv",
            "score": 1,
            "text": "*therapeutics \n\nFTFY",
            "title_similarity": "0.12240022",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0hcny4",
            "score": 1,
            "text": "Trump would’ve listed them all on eBay.",
            "title_similarity": "0.42115113",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0hcocj",
            "score": 1,
            "text": "What a guy.  He is a peach.",
            "title_similarity": "0.08483094",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0hcyqg",
            "score": 2,
            "text": "Give it to our good friends in Canada. They need it and there'd be no or little spoilage.",
            "title_similarity": "0.27792972",
            "sentiment_compound": 0.5859
        },
        {
            "id": "h0hda38",
            "score": 1,
            "text": "Great move. Don’t know why we weren’t already doing it tho...",
            "title_similarity": "0.12462618",
            "sentiment_compound": 0.6249
        },
        {
            "id": "h0hdmdt",
            "score": 2,
            "text": "They should open it up to foreign travelers to the US if they haven't already.  Here for a short trip?  Have the J&J vax, here for a while? Have any of the other two.",
            "title_similarity": "0.39324638",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0hdmj7",
            "score": 1,
            "text": "Please correct me if I'm wrong but wasn't the issues regarding the vaccine was that it has to be kept cold and doesn't travel/last long?",
            "title_similarity": "0.2645483",
            "sentiment_compound": -0.1027
        },
        {
            "id": "h0hdp21",
            "score": 1,
            "text": "He’s holding 25% of those unused vaccines for the Republican/Trump supporters that come to their senses.",
            "title_similarity": "0.8017857",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h0hdr0k",
            "score": 1,
            "text": "According to MAGA fans they would have sold them all on the “free” market to make a profit but they would have never really sold and claimed the sale as a loss on their tax returns.",
            "title_similarity": "0.40680525",
            "sentiment_compound": -0.25
        },
        {
            "id": "h0hds93",
            "score": 1,
            "text": "I mean it's about time after stopping all exports of vaccines for the last few months.",
            "title_similarity": "0.61214554",
            "sentiment_compound": -0.1531
        },
        {
            "id": "h0hdsih",
            "score": 1,
            "text": "Yes! Get them the fuck out of here!!! People need em bad!",
            "title_similarity": "0.09154101",
            "sentiment_compound": -0.7556
        },
        {
            "id": "h0he41y",
            "score": 1,
            "text": "So much for giving extra doses to Canada and Mexico first I guess.",
            "title_similarity": "0.47217005",
            "sentiment_compound": 0.3947
        },
        {
            "id": "h0hejkh",
            "score": 1,
            "text": "Joe Biden exhibits basic human decency\n\n*the crowd goes wild*",
            "title_similarity": "0.17193155",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0hem3g",
            "score": 1,
            "text": "Well he signed off on it. This has near-universal backing.",
            "title_similarity": "0.18584268",
            "sentiment_compound": 0.296
        },
        {
            "id": "h0hem51",
            "score": 3,
            "text": "Well, if the GQP nutters refuse to get them, might as well give them to those that will.",
            "title_similarity": "0.18777362",
            "sentiment_compound": 0.25
        },
        {
            "id": "h0hesy6",
            "score": 1,
            "text": "Neat. Now let's see it happen",
            "title_similarity": "-0.033471912",
            "sentiment_compound": 0.4588
        },
        {
            "id": "h0hexfr",
            "score": 1,
            "text": "Well throwing them away would be stupid\n\nI guess the question is do the places we plan on donating them to have the minus 200° refrigerators or whatever is needed to keep them good?",
            "title_similarity": "0.4309067",
            "sentiment_compound": 0.1531
        },
        {
            "id": "h0hf113",
            "score": 1,
            "text": "The USA has been a huge help for Canada. We've had to outsource all of our vaccines and they've had our back every step of the way.",
            "title_similarity": "0.5612928",
            "sentiment_compound": 0.6124
        },
        {
            "id": "h0hf40s",
            "score": 2,
            "text": "Zero problems with this ... we have more than enough based on the amount of people already vaccinated. \n\nGive them to countries that need it, India first",
            "title_similarity": "0.42803204",
            "sentiment_compound": -0.4019
        },
        {
            "id": "h0hfbfw",
            "score": 1,
            "text": "the red necks are like no masks no vaccines go f yourself lol!",
            "title_similarity": "0.26968682",
            "sentiment_compound": 0.6463
        },
        {
            "id": "h0hfikt",
            "score": 1,
            "text": "Holy shit these comments....\n\nOh right, this is one of the most astroturfed subs on reddit.",
            "title_similarity": "0.35150397",
            "sentiment_compound": -0.5574
        },
        {
            "id": "h0hfvot",
            "score": 1,
            "text": "Imagine the Trump administration doing this without grifting or profiting. You can't. It's unimaginable.",
            "title_similarity": "0.23481846",
            "sentiment_compound": -0.2924
        },
        {
            "id": "h0hg9ve",
            "score": 1,
            "text": "The previous admin would have sold it to the highest bidder, and had members personally profit from it, from both ends.",
            "title_similarity": "0.41711035",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h0hgaps",
            "score": 1,
            "text": "I guess this means no vaccines for America's biggest ally in Asia... The country of Taiwan.",
            "title_similarity": "0.41999295",
            "sentiment_compound": -0.296
        },
        {
            "id": "h0hgb3b",
            "score": 1,
            "text": "I hope they go to Japan",
            "title_similarity": "0.17394908",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h0hgpu4",
            "score": 1,
            "text": "Now watch conservatives ridicule Biden for giving away something they didnt want",
            "title_similarity": "0.29215503",
            "sentiment_compound": -0.2076
        },
        {
            "id": "h0hgq3x",
            "score": 1,
            "text": "very very very good! bravo Biden!",
            "title_similarity": "0.043964934",
            "sentiment_compound": 0.6507
        },
        {
            "id": "h0hgr40",
            "score": 1,
            "text": "Great job for the world ..Greetings from Vienna",
            "title_similarity": "0.15647687",
            "sentiment_compound": 0.7845
        },
        {
            "id": "h0hgtb8",
            "score": 2,
            "text": "Queue the people who refuse to get the vaccine bitching about how Biden is giving \"american vaccines\" to foreign countries",
            "title_similarity": "0.48294145",
            "sentiment_compound": -0.2263
        },
        {
            "id": "h0hguzv",
            "score": 1,
            "text": "The United States. Not Joe.",
            "title_similarity": "0.10720551",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h0hgvjj",
            "score": 2,
            "text": "Same people that refuse to get the vaccine gonna be mad about this lol",
            "title_similarity": "0.34569",
            "sentiment_compound": -0.3818
        },
        {
            "id": "h0hgwh6",
            "score": 1,
            "text": "That should boost his political standing",
            "title_similarity": "0.14684251",
            "sentiment_compound": 0.4019
        },
        {
            "id": "h0hh9ej",
            "score": 1,
            "text": "Taiwan is in dire need of vaccines right now. China is actively blocking attempts for taiwan to get vaccines for its citizens.",
            "title_similarity": "0.42697132",
            "sentiment_compound": -0.5106
        },
        {
            "id": "h0hhhgn",
            "score": 1,
            "text": "Can’t wait to see all the dorks who didn’t want the vaccine anyway to complain about what’s being done with unused vaccines.",
            "title_similarity": "0.4576171",
            "sentiment_compound": -0.4019
        },
        {
            "id": "h0hhmi2",
            "score": 1,
            "text": "Conservatives who arent even willing to get the vaccine are going to whine about this I guarantee it.\n\nSimultaneously they will ignore all the hydrochloriquine doses that the last administration bought",
            "title_similarity": "0.46842667",
            "sentiment_compound": -0.4588
        },
        {
            "id": "h0hhqcv",
            "score": 2,
            "text": "I just started working for the COVID-19 Vaccination Hotline, the type of calls we get are ridiculous. \nPeople asking us if getting vaccinated will alter their DNA, allow the government to track them, makes their limbs fall off, make them into zombies, etc.\nIt almost sounds like prank calls but sadly they're not.",
            "title_similarity": "0.47190613",
            "sentiment_compound": -0.525
        },
        {
            "id": "h0hhz2y",
            "score": 2,
            "text": "United States* to donate 75% of unused COVID vaccines to UN-backed global vaccine program",
            "title_similarity": "0.9861194",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h0hi0tp",
            "score": 2,
            "text": "This will encourage the vaccine hesitant to use them, I bet.",
            "title_similarity": "0.2875694",
            "sentiment_compound": 0.3182
        },
        {
            "id": "h0hi724",
            "score": 2,
            "text": "Ironically the idiots refusing will suddenly be motivated to get them knowing that they could go to poor dark skin folks.",
            "title_similarity": "0.19171488",
            "sentiment_compound": -0.4215
        },
        {
            "id": "h0hi936",
            "score": 2,
            "text": "If you want the science denying clowns to get vaccinated, just threaten to give their vaccines away to other nations.",
            "title_similarity": "0.5299449",
            "sentiment_compound": -0.5719
        },
        {
            "id": "h0hibf5",
            "score": 1,
            "text": "In a way we're not so different millennial, boomer and Gen Z let's all get together and celebrate our newborn Generation C.",
            "title_similarity": "0.43775603",
            "sentiment_compound": 0.5719
        },
        {
            "id": "h0hjww0",
            "score": 1,
            "text": "Finally, we need a sense of scarcity to scare people a little lol",
            "title_similarity": "0.11760213",
            "sentiment_compound": -0.1761
        },
        {
            "id": "h0hk9s3",
            "score": 1,
            "text": "Lol, I still need to schedule my first shot.",
            "title_similarity": "0.11354844",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h0hkd2o",
            "score": 1,
            "text": "Well, I guess that gotta be used",
            "title_similarity": "-0.07077414",
            "sentiment_compound": 0.2732
        },
        {
            "id": "h0hkoh2",
            "score": 1,
            "text": "Green screen ?",
            "title_similarity": "0.0018549063",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0hkw91",
            "score": 1,
            "text": "We will need them soon, I bet.",
            "title_similarity": "0.061100923",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0hlwx9",
            "score": 1,
            "text": "Good. The daily active cases are still high globally. hope it will come down with world wide vaccine roll out.",
            "title_similarity": "0.53166324",
            "sentiment_compound": 0.8176
        },
        {
            "id": "h0hm1jk",
            "score": 1,
            "text": "That’s a great news! I’m glad US is doing what they can to reduce pandemic around the world, and I hope they will indeed donate the 80 million vaccine they promised eventually.",
            "title_similarity": "0.6555847",
            "sentiment_compound": 0.9151
        },
        {
            "id": "h0hm5s2",
            "score": 1,
            "text": "People just don’t want the vaccine 💉",
            "title_similarity": "0.22216135",
            "sentiment_compound": 0.0772
        },
        {
            "id": "h0hmlw1",
            "score": 1,
            "text": "Vista oil to the moon 🌙 🚀🚀",
            "title_similarity": "0.25322664",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0hmvdr",
            "score": 2,
            "text": "This is extremely good news. The more we give to COVAX, the safer the world (and thus us) will be collectively.",
            "title_similarity": "0.26460695",
            "sentiment_compound": 0.7178
        },
        {
            "id": "h0hmzc8",
            "score": 1,
            "text": "Unused vaccines? Arnt there still queues to get vaccinated?",
            "title_similarity": "0.45954975",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0hn46r",
            "score": 2,
            "text": "who here thinks trump would give away vaccine doses? that dude would be auctioning them off to the highest bidder .",
            "title_similarity": "0.56510615",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0hnfm1",
            "score": 1,
            "text": "\"thAT'S cOmMunIST!!!\"\n\n-Some dumbass conservative probably",
            "title_similarity": "0.2436549",
            "sentiment_compound": -0.6679
        },
        {
            "id": "h0hnik4",
            "score": 1,
            "text": "Nice to see acting as a leading country again.",
            "title_similarity": "0.107138716",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h0hognw",
            "score": 3,
            "text": "Meaning, a lot of people are refusing to take the vaccine.",
            "title_similarity": "0.37864912",
            "sentiment_compound": -0.4019
        },
        {
            "id": "h0hokrb",
            "score": 2,
            "text": "This will make right wingers heads explode..  Yeah, get rid of those 5g vaccines.  Wait, we cant help other countries, we need to think mericka first.    But I don't want 5g DNA altering vaccines around.  But I don't want Biden to give them away.",
            "title_similarity": "0.4603482",
            "sentiment_compound": -0.1766
        },
        {
            "id": "h0hozpl",
            "score": 1,
            "text": "Where did the 75% figure in the title come from? Seems like all of the would be donated since they have an extremely short shelf life",
            "title_similarity": "0.541313",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h0hp3rb",
            "score": 2,
            "text": "Conservatives will now want the vaccine all of the Sudden.\n\n*\"HEY! Dont give it to the Darkies! y No One think about Whiiiiiite people!!!!* [unintelligible Tantrum noises]\"",
            "title_similarity": "0.43443045",
            "sentiment_compound": -0.7067
        },
        {
            "id": "h0hpdge",
            "score": 1,
            "text": "Not so long ago the headline would have read 'America invites third world leaders to giant vaccine bonfire party'.",
            "title_similarity": "0.60028887",
            "sentiment_compound": 0.4019
        },
        {
            "id": "h0hr6l5",
            "score": 2,
            "text": "Good. Get these out of our country. \n\n\n\n\nSo that other countries can benefit and get the world back to normal.",
            "title_similarity": "0.26188502",
            "sentiment_compound": 0.7096
        },
        {
            "id": "h0hrgcd",
            "score": 2,
            "text": "Please give some to India. I am depressed by seeing my motherland suffering. \nScared for my parents",
            "title_similarity": "0.3097123",
            "sentiment_compound": -0.7906
        },
        {
            "id": "h0hrpy2",
            "score": 1,
            "text": "The USA government has not much of a choice but to donate those Covid19 vaccine, the shelf life is terrible, it can expire easily and the current stockpile does not work against international Covid19 variants. So donating them Covid19 vaccine is like hitting two birds with one stone, they get ride of them before the expiration occurs and look good in international scene. AstraZeneca and J&J vaccine are worthless. Moderna and Pfizer can cause side effects etc and it’s not for everyone of age. Would USA government replace the current stockpile with Covaxin vaccine which has wayyy better shelf life and is effective against UK, South Africa, Brazil and Indian variants while the above mentioned vaccine are not....that’s multi billion dollars worth question 🤔\nBharat biotech is the maker of Covaxin vaccine from India, they have licensing and production agreement with OCGN to make and distribute Covaxin vaccine in North America soon. Covaxin is the only vaccine with phase 3 data and ages 2-16 under trails right now. Peace and blessings to you all.",
            "title_similarity": "0.48149568",
            "sentiment_compound": 0.9806
        },
        {
            "id": "h0hrt7o",
            "score": 1,
            "text": "at first I was like WTF why use an unbacked vaccine program. And then my brain started.",
            "title_similarity": "0.5158434",
            "sentiment_compound": -0.4648
        },
        {
            "id": "h0hrtuc",
            "score": 1,
            "text": "It's like WWII all over again /s",
            "title_similarity": "0.26964214",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h0hrufd",
            "score": 1,
            "text": "that's cool, say what's the status on supporting the TRIPS waiver?",
            "title_similarity": "0.31112495",
            "sentiment_compound": 0.6369
        },
        {
            "id": "h0hrulc",
            "score": 1,
            "text": "Better late than never I guess.",
            "title_similarity": "0.12853564",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h0hs2t2",
            "score": 1,
            "text": "So what happens to the other 25%?",
            "title_similarity": "0.46516776",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0hs4iz",
            "score": 1,
            "text": "ITT: [https://www.who.int/initiatives/act-accelerator/covax](https://www.who.int/initiatives/act-accelerator/covax)\n\nThis was the global plan to begin with.",
            "title_similarity": "0.32890463",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0hsbun",
            "score": 1,
            "text": "isnt the expiration date like a few weeks or something?",
            "title_similarity": "0.3118899",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h0hsijc",
            "score": 1,
            "text": "I can't wait for Fox News to spin this",
            "title_similarity": "0.2969777",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0hsjc0",
            "score": 1,
            "text": "I wish it was all going to Japan to ease their concerns over the olympics. Doesn’t even have to be all but I wish they could get to a point where the olympics could happen and they would be satisfied with it happening- I think having a successful and Covid free olympics would be good for the world.",
            "title_similarity": "0.32906234",
            "sentiment_compound": 0.976
        },
        {
            "id": "h0hstar",
            "score": 1,
            "text": "Common sense.\n\nOnce our immediate needs are met, and we have a surplus available, we should assist everyone else. Provided that we have enough in reserve for any American who wants one in the future plus boosters.",
            "title_similarity": "0.42492712",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0htdne",
            "score": 2,
            "text": "Internet has been less interesting without trump",
            "title_similarity": "0.21520102",
            "sentiment_compound": 0.3415
        },
        {
            "id": "h0htgm4",
            "score": 1,
            "text": "And inject the remaining 25% to become superimmune.",
            "title_similarity": "0.69502074",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0htrv5",
            "score": 1,
            "text": "The UN is a joke\n\nHaving said that hopefully these actually go towards good use.",
            "title_similarity": "0.13506168",
            "sentiment_compound": 0.7783
        },
        {
            "id": "h0hts0k",
            "score": 1,
            "text": "Is this the extent of covid vaccine development? Are they working on any other vaccines that are more effective than what we have? \n\nI don't see much point to talking the current vaccines since they don't really offer immunity. I'm already on medication that limits my bodies ability to produce the cytokine storm (and subsequent micro blood clots in the lungs) and I'm otherwise healthy - not obese, not over 50 and I have no vitamin deficiencies. There's no need for me to take it. I'd rather get a bit sick and then get over it and develop a natural immunity.",
            "title_similarity": "0.48358488",
            "sentiment_compound": 0.5947
        },
        {
            "id": "h0hu2mn",
            "score": 1,
            "text": "Might as well since all the brainwashed republicans won't take them",
            "title_similarity": "0.24966875",
            "sentiment_compound": 0.2732
        },
        {
            "id": "h0hu6sx",
            "score": 1,
            "text": "Lol. We are giving away the one vaccine we didn't want. Astrazeneca.  While it's not the best, it's def better than nothing.",
            "title_similarity": "0.48286313",
            "sentiment_compound": 0.5439
        },
        {
            "id": "h0hunru",
            "score": 1,
            "text": "Great news!! Thoughhh… imagine if somehow Biden *was* responsible with what to do with them and somehow he for whatever reason decided to get rid of them… just trying to imagine, if there are multiple universes? What universe got the Biden in which the title said, “Joe Biden to throw into space 75% of unused vaccinations \n…”\n\nWoo wee!! baaack to work",
            "title_similarity": "0.70559716",
            "sentiment_compound": 0.8926
        },
        {
            "id": "h0hv50o",
            "score": 1,
            "text": "What happens to the other 25%? Why not 100%",
            "title_similarity": "0.53396773",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0hvnfu",
            "score": 1,
            "text": "My damn vaccine is becoming increasingly hard to get. I got the Moderna one at a local clinic and they told me to come back on the 1st. When I went back they said I needed to have made an appointment and they're not opening a new vial without 5 or 10 people I forget how many.\n\nNow, I have an appointment set up to go to the hospital to get it which is a pain in the ass but they said I could get my second shot so we'll see how it goes. I feel like giving up but won't because it's a lot more chill to get it at the clinic instead of the hospital and I have a lot of anxiety especially at hospitals.",
            "title_similarity": "0.57332766",
            "sentiment_compound": -0.1531
        },
        {
            "id": "h0hvz71",
            "score": 1,
            "text": "Meanwhile I still can't get my vaccine here until August",
            "title_similarity": "0.41019666",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0hw0x5",
            "score": 1,
            "text": "what's the number? 75% of ten is not much.",
            "title_similarity": "0.4054849",
            "sentiment_compound": 0.0772
        },
        {
            "id": "h0hwcxw",
            "score": 1,
            "text": "So everyone in the USA is vaccinated? even the children? I mean, everyone that want it.",
            "title_similarity": "0.5436882",
            "sentiment_compound": 0.168
        },
        {
            "id": "h0hwxu6",
            "score": 1,
            "text": "When I got my 1st shot of moderna they asked me to get people to come in and not hold off for the johnson & johnson, because they were very perishable and would go to waste.",
            "title_similarity": "0.43196344",
            "sentiment_compound": -0.4215
        },
        {
            "id": "h0hxcv6",
            "score": 1,
            "text": "wtf are they doing with the other 25%",
            "title_similarity": "0.5546925",
            "sentiment_compound": -0.5859
        },
        {
            "id": "h0hxdn7",
            "score": 1,
            "text": "Where do the other 25 percent go?",
            "title_similarity": "0.39741892",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0hxwwt",
            "score": 1,
            "text": "Many Republicans yesterday: \"Fuck no, I wouldn't never get that fuckin' liberal, mind control vaccine!\"\n\nSame Republicans today: \"THAT FUCKING PIECE OF SHIT IS GIVING AWAY *OUR* VACCINE!!!\"",
            "title_similarity": "0.54738563",
            "sentiment_compound": -0.8313
        },
        {
            "id": "h0hy7va",
            "score": 2,
            "text": "Watch all the people who have been hardcore anti vaccine start screaming “Biden is a communist those vaccines are for hardworking Americans like me!!!!!” Lol.",
            "title_similarity": "0.45962518",
            "sentiment_compound": 0.3753
        },
        {
            "id": "h0hyjrr",
            "score": 1,
            "text": "Good ! Give them to people who want them",
            "title_similarity": "0.015274875",
            "sentiment_compound": 0.5411
        },
        {
            "id": "h0hyw04",
            "score": 1,
            "text": "how do you have \"unused vaccines\" when you dont have 100% of your population vaccinated yet?",
            "title_similarity": "0.6876322",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0i0stj",
            "score": 3,
            "text": "Good.\n\nIf they didn’t use them it’d be like those bakeries that just throw all their shit in the trash at the end of the day instead of giving it to a homeless shelter",
            "title_similarity": "0.3795576",
            "sentiment_compound": 0.4939
        },
        {
            "id": "h0i1hml",
            "score": 1,
            "text": "Spare some to Taiwan would be nice since it's not part of UN or WHO",
            "title_similarity": "0.1518931",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h0i1zk4",
            "score": 1,
            "text": "That gonna be a ton of vaccines!",
            "title_similarity": "0.48107922",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0i23z4",
            "score": 1,
            "text": "how they decide they are unused",
            "title_similarity": "-0.02320924",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0i2g35",
            "score": 2,
            "text": "Is vaccine tourism still going to be available in the next couple months? I want to go get my J&J in a couple of months.",
            "title_similarity": "0.61088824",
            "sentiment_compound": 0.0772
        },
        {
            "id": "h0i30qc",
            "score": 3,
            "text": "Imagine being somewhere where the vaccine is unavailable and watching U.S. States trying to bribe people into getting their free vaccine with free guns.",
            "title_similarity": "0.4867732",
            "sentiment_compound": 0.7003
        },
        {
            "id": "h0i3527",
            "score": 1,
            "text": "Well well",
            "title_similarity": "-0.1389685",
            "sentiment_compound": 0.4939
        },
        {
            "id": "h0i3iet",
            "score": 2,
            "text": "Conservatives will bitch and moan because now it looks like the other kids are getting the lollipop instead.",
            "title_similarity": "0.3050993",
            "sentiment_compound": -0.4404
        },
        {
            "id": "h0i3pxi",
            "score": 1,
            "text": "Dope.",
            "title_similarity": "-0.04754485",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0i3szg",
            "score": 4,
            "text": "As an Australian who’s not gonna get a shot of anything this side of Christmas because our government just didn’t fucking bother signing deals. \n\nFucken get it in my arm Joey B I’ll take what ever you got",
            "title_similarity": "0.29342246",
            "sentiment_compound": -0.4005
        },
        {
            "id": "h0i4x8c",
            "score": 1,
            "text": "My brain read that as \"unbacked\" instead of United Nations-backed for a sec and I was VERY confused lol",
            "title_similarity": "0.30430204",
            "sentiment_compound": 0.5021
        },
        {
            "id": "h0i57qy",
            "score": 1,
            "text": "Should give it to middle eastrens and Africans instead. Not allies that can afford to make them.",
            "title_similarity": "0.3921546",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0i59bk",
            "score": 2,
            "text": "So, in a way, are all of the people refusing to be vaccinated actually *contributing* to worldwide vaccination efforts?",
            "title_similarity": "0.55968726",
            "sentiment_compound": -0.4019
        },
        {
            "id": "h0i5nfd",
            "score": 1,
            "text": "Good job.   If we do pay attention to taking care of the world..... the world,  this will not be a good story.\nI want to travel internationally again.  Not wealthy, save my money.   The world needs protection for us all to get our shit together.\nSure, some do not travel, never have, so their opinion is misguided on their perceived personal bubble.   \nThis IS a world issue that effects all of us, worldwide.   Anyone who does not understand this is misguided.  \nWe are a global community whether you like it or not.",
            "title_similarity": "0.3584566",
            "sentiment_compound": 0.0145
        },
        {
            "id": "h0i6d5h",
            "score": 1,
            "text": "Why only 75% ?",
            "title_similarity": "0.47096294",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0i6q0p",
            "score": 1,
            "text": "Kamala be like 🧍🏽",
            "title_similarity": "0.06569073",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h0i76pa",
            "score": 2,
            "text": "Edit* \n\nThe United States to donate vaccines.",
            "title_similarity": "0.6667359",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h0i77sh",
            "score": 1,
            "text": "America leading again 💙",
            "title_similarity": "0.27724048",
            "sentiment_compound": 0.6369
        },
        {
            "id": "h0i78gp",
            "score": 1,
            "text": "Serious question, why not 100%? Is it because that extra 25% is enough to fully vaccinate all Americans?",
            "title_similarity": "0.736776",
            "sentiment_compound": -0.168
        },
        {
            "id": "h0i7bm1",
            "score": 1,
            "text": "If they are getting close to expiring (like within a month) and won’t be used, I totally support this!",
            "title_similarity": "0.35863456",
            "sentiment_compound": 0.6989
        },
        {
            "id": "h0i7cg4",
            "score": 1,
            "text": "What I don’t get is how will they distribute the Pfizer and Moderna magazines in the developing world . They have insane refrigeration requirements. Might as well just give them money so they manufacture Covishield or Covaxin ( Indian developed) which are cheaper to manufacture and distribute.",
            "title_similarity": "0.4667685",
            "sentiment_compound": -0.1531
        },
        {
            "id": "h0i8cqh",
            "score": 1,
            "text": "Wait when did the US reach 100% vaccination? How do you have a surplus of vaccines if you haven’t even gotten 75% of your population vaccinated? So did we pay for vaccines we didn’t need? As far as I see unless we have 90-100% vaccination rate, we still need those vaccines.",
            "title_similarity": "0.7881559",
            "sentiment_compound": -0.2741
        },
        {
            "id": "h0i8h7s",
            "score": 2,
            "text": "Excellent.",
            "title_similarity": "-0.08344223",
            "sentiment_compound": 0.5719
        },
        {
            "id": "h0i8pyr",
            "score": 1,
            "text": "Wtf is he doing with the other 25%",
            "title_similarity": "0.57418925",
            "sentiment_compound": -0.5859
        },
        {
            "id": "h0i9alp",
            "score": 1,
            "text": "Give to Nepal.",
            "title_similarity": "0.10271187",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0ia0v5",
            "score": 1,
            "text": "Go for 100%! Be A MAN!!!!!",
            "title_similarity": "0.31856406",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0ialxm",
            "score": 2,
            "text": "The US is donating. Fixed it.",
            "title_similarity": "0.28597957",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0ib89o",
            "score": 1,
            "text": "Funny how US has a stockpile while other countries are scrambling for vaccines",
            "title_similarity": "0.55007243",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h0ib98n",
            "score": 2,
            "text": "Can we get some in Australia aswell as a guide from Biden to Morrison on how to get your country vaccinated\n\nThanks chief",
            "title_similarity": "0.45379993",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h0icklm",
            "score": 1,
            "text": "what about the boosters",
            "title_similarity": "0.17003319",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0icmcl",
            "score": 1,
            "text": "What the duck he doing with the other 25%?",
            "title_similarity": "0.5773269",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0idb67",
            "score": 2,
            "text": "Any idea who paid for those vaccines by chance?",
            "title_similarity": "0.4798447",
            "sentiment_compound": 0.25
        },
        {
            "id": "h0iexmo",
            "score": 3,
            "text": "Warp speed",
            "title_similarity": "0.11686294",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0ifhe5",
            "score": 2,
            "text": "I wonder if people will be grateful for the help, or belligerent about not getting more.\n\nI guess we'll see in the coming weeks.",
            "title_similarity": "0.32367226",
            "sentiment_compound": 0.6908
        },
        {
            "id": "h0ifjwb",
            "score": 1,
            "text": "This was the right response.",
            "title_similarity": "-0.042755067",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0ifkf8",
            "score": 1,
            "text": "About time",
            "title_similarity": "-0.031771462",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0ig2tb",
            "score": 1,
            "text": "That leaves 25 percent and does that mean morons won’t have when they want it?",
            "title_similarity": "0.45448422",
            "sentiment_compound": -0.25
        },
        {
            "id": "h0igir1",
            "score": 2,
            "text": "At least now other countries can get vaccines for their people",
            "title_similarity": "0.43649852",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0ihg8i",
            "score": 2,
            "text": "> Joe Biden donates 75% of unused COVID vaccines to UN-backed global vaccine program on behalf of the american people\n\nFTFY",
            "title_similarity": "0.9622059",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0ii65y",
            "score": 1,
            "text": "i thought the cdc just said it won’t be available untill next year",
            "title_similarity": "0.38694948",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0iite7",
            "score": 1,
            "text": "Interesting",
            "title_similarity": "-0.13802269",
            "sentiment_compound": 0.4019
        },
        {
            "id": "h0iiwpl",
            "score": 1,
            "text": "Chocolate chocolate chip",
            "title_similarity": "0.24704838",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0iiy4n",
            "score": 3,
            "text": "Living in third world country, I would love to have this vaccine. Our vaccination rate here is too slow (our gov rather talk a lot than actions), vaccines are limited and they prioritize older generations first, so it means that I'll probably get my doses optimistically in a few months or so.",
            "title_similarity": "0.52595496",
            "sentiment_compound": 0.7506
        },
        {
            "id": "h0ijzpq",
            "score": 1,
            "text": "MANDA PRA NÓIS BR PLS NUNCA PEDI NADA",
            "title_similarity": "0.031594597",
            "sentiment_compound": 0.0772
        },
        {
            "id": "h0ik36j",
            "score": 2,
            "text": "Glad that the US is doing this.  At least we have leadership in place that recognizes that WE (all humans) are in this together.  If there aren't enough Americans willing to help make sure that the next variant doesn't emerge...then we can certainly help others that want to participate.",
            "title_similarity": "0.28426397",
            "sentiment_compound": 0.9081
        },
        {
            "id": "h0ikscc",
            "score": 2,
            "text": "As opposed to all the used covid vaccines?",
            "title_similarity": "0.4909946",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0il1tf",
            "score": 3,
            "text": "As non US citizen, it's nice to see the the U.S flexing it's muscle for good again.",
            "title_similarity": "0.20499918",
            "sentiment_compound": 0.6908
        },
        {
            "id": "h0ilz0u",
            "score": 1,
            "text": "Such good news! My country needs them!!",
            "title_similarity": "0.1787592",
            "sentiment_compound": 0.5826
        },
        {
            "id": "h0im61c",
            "score": 1,
            "text": "Canadian here. Still need my second shot. I’ll take it. Gladly.",
            "title_similarity": "0.29973125",
            "sentiment_compound": 0.34
        },
        {
            "id": "h0imarb",
            "score": 1,
            "text": "Wonder how much pharma is going to hammer them for since this violates the purchase agreements, unless Pharma said ok to it.",
            "title_similarity": "0.35001355",
            "sentiment_compound": -0.1469
        },
        {
            "id": "h0impje",
            "score": 1,
            "text": "How generous.",
            "title_similarity": "-0.049320437",
            "sentiment_compound": 0.5106
        },
        {
            "id": "h0in0mo",
            "score": 1,
            "text": "Didn't read the article but from the title it seems to insinuate that Everyone in America has been vaccinated. It this really what this means,  because there shouldn't be an \"unused\" covid vaccines to give away if there are still people in American infecting each other.",
            "title_similarity": "0.5889807",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0in5u3",
            "score": 1,
            "text": "He's going to have the remaining 25% injected into him so he can develop superpowers.",
            "title_similarity": "0.69813526",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0io6og",
            "score": 1,
            "text": "You know what. I’m not a big fan of Biden, sometimes he sounds really brain dead. But this is what needed to be done.",
            "title_similarity": "0.17558691",
            "sentiment_compound": -0.5057
        },
        {
            "id": "h0ioof0",
            "score": 1,
            "text": "Ah yes because they won’t be abused by a dictator of a third world country now",
            "title_similarity": "0.21643393",
            "sentiment_compound": -0.1531
        },
        {
            "id": "h0iouiw",
            "score": 1,
            "text": "Somebody should back it.",
            "title_similarity": "0.04675141",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0ipklj",
            "score": 3,
            "text": "That is great, we should help countries  that are struggling with Covid,  that is truly human kindness",
            "title_similarity": "0.25287917",
            "sentiment_compound": 0.872
        },
        {
            "id": "h0ipkp4",
            "score": 2,
            "text": "Please Indian Govt, since you don't have the interest of saving this country by putting PM cares funds on central Vista instead of covid relief, atleast take the help of foreign countries ready to help.",
            "title_similarity": "0.35528916",
            "sentiment_compound": 0.9156
        },
        {
            "id": "h0iq10g",
            "score": 2,
            "text": "He better. And so should other rich countries that stockpiled vaccines \n\nNo different to hoarding toilet paper",
            "title_similarity": "0.5293964",
            "sentiment_compound": 0.6771
        },
        {
            "id": "h0irnjw",
            "score": 2,
            "text": "[removed]",
            "title_similarity": "-0.06395121"
        },
        {
            "id": "h0ishau",
            "score": 1,
            "text": "You mean the United States. Joe Biden isn't the one donating his own supply.",
            "title_similarity": "0.27956218",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h0itcs1",
            "score": 3,
            "text": "Nepal and India needs it",
            "title_similarity": "0.17941356",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0its1k",
            "score": 1,
            "text": "Send them to North Korea. Make them depend on us",
            "title_similarity": "0.25765193",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0iun6z",
            "score": 3,
            "text": "literally because of all the anti-vaxxers just not want it.",
            "title_similarity": "0.13150907",
            "sentiment_compound": -0.0572
        },
        {
            "id": "h0iwee5",
            "score": 1,
            "text": "Interesting",
            "title_similarity": "-0.13802269",
            "sentiment_compound": 0.4019
        },
        {
            "id": "h0ixeuf",
            "score": 2,
            "text": "Sarcasm aside, “Professor”, you don’t see a problem these two telling everyone not to trust the vaccine, yet now... Biden giving thousands of viles away because no one trusts the vaccine? Or are you biased and just don’t care? Interested. Seriously",
            "title_similarity": "0.48773223",
            "sentiment_compound": -0.711
        },
        {
            "id": "h0ixvrm",
            "score": 1,
            "text": "[deleted]",
            "title_similarity": "-0.022515053"
        },
        {
            "id": "h0iygd9",
            "score": 2,
            "text": "Or Japan so they could host the Olympic?",
            "title_similarity": "0.31065232",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0iz1wk",
            "score": 1,
            "text": "https://twitter.com/civilrightsorg/status/1390128012348301313?ref_src=twsrc%5Etfw%7Ctwcamp%5Etweetembed%7Ctwterm%5E1390128012348301313%7Ctwgr%5E%7Ctwcon%5Es1_c10&ref_url=about%3Ablank",
            "title_similarity": "0.37238434",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0j1qm0",
            "score": 3,
            "text": "Good. If the Americans are too proud to use it they might as well use them to save lives elsewhere.",
            "title_similarity": "0.3215932",
            "sentiment_compound": 0.8834
        },
        {
            "id": "h0j2caf",
            "score": 8,
            "text": "Send some to India please. People are dying here and there is vaccine shortage. Government has no choice but to impose strict lockdown and wait for the cases to reduce. Poor peole who depend on daily wage are starving due to long lockdowns.",
            "title_similarity": "0.49967957",
            "sentiment_compound": -0.9022
        },
        {
            "id": "h0j3kme",
            "score": 2,
            "text": "if they aint being used give it away til the next surge",
            "title_similarity": "0.12829842",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0j3phm",
            "score": 2,
            "text": "The USA should donate some to our long-standing friend, Taiwan. China is blocking Taiwan’s access to vaccines. They are blocking Taiwan’s admission to the WHO. Taiwan is a strategic ally to The US and democracies around the world. Taiwan donated medical supplies very early during COVID to the US.",
            "title_similarity": "0.5752244",
            "sentiment_compound": -0.25
        },
        {
            "id": "h0j3x4m",
            "score": 2,
            "text": "Republicans: this is nothing hut good but I'm mad somehow. Tucker \"the shittiest bowtie in history\" Carlson, how should I feel about this?",
            "title_similarity": "0.2986872",
            "sentiment_compound": -0.9202
        },
        {
            "id": "h0j3xcv",
            "score": 2,
            "text": "I hope Mexico and poor Central American countries get most vaccines.  They’re our (US) neighbors",
            "title_similarity": "0.6181046",
            "sentiment_compound": -0.0516
        },
        {
            "id": "h0j64il",
            "score": 2,
            "text": "Send to lebanon",
            "title_similarity": "0.18626565",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0j6p3q",
            "score": 1,
            "text": "USA USA USA",
            "title_similarity": "0.07296712",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0j9svl",
            "score": 2,
            "text": "We are in a really bad situation and there's still lockdown here, when I heard about many countries donating so such doses it made me happy. Our country is shadowed by India due to which no one gave attention but un issued it and now many countries are noticing and helping. Thanks!",
            "title_similarity": "0.3474226",
            "sentiment_compound": 0.7427
        },
        {
            "id": "h0jbvee",
            "score": 1,
            "text": "A real human!",
            "title_similarity": "-0.08596437",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0jckvf",
            "score": 1,
            "text": "Donate them all. To hell with the anti-vaxxers.",
            "title_similarity": "0.33602336",
            "sentiment_compound": -0.6808
        },
        {
            "id": "h0jclzk",
            "score": 2,
            "text": "There's a good podcast episode about rich countries hoarding vaccines from third-world countries. My Filipino-American coworker was going to visit the Phillipines this year to bring her son back but she has to wait for a certain percentage of people in the Phillipines to be vaccinated.. but there's no vaccines. She's been very sad and depressed and I hope that she'll be reunited with her family as soon as they can get their hands on one!",
            "title_similarity": "0.5749384",
            "sentiment_compound": -0.5827
        },
        {
            "id": "h0jfg61",
            "score": 1,
            "text": "I guess india is least interested now opt for low quantity leaving it for needy . As it's always a risk to depends on US as we have seen with US attitude in the past.\n\nIndia may build its own supply chain.",
            "title_similarity": "0.27479488",
            "sentiment_compound": -0.7819
        },
        {
            "id": "h0jfukf",
            "score": 1,
            "text": "and then once donated it will be sold to the local markets at high prices...",
            "title_similarity": "0.36068988",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0jg7l3",
            "score": 1,
            "text": "0 for gaza",
            "title_similarity": "0.058255862",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0jgi42",
            "score": 1,
            "text": "thank god. i live in arizona and every college kid i. my college town is vaccinated and at bars : raves again because of it. other countries deserve it so much more",
            "title_similarity": "0.4694258",
            "sentiment_compound": 0.5574
        },
        {
            "id": "h0jgt8q",
            "score": 2,
            "text": "Well if the Republicans don’t want them might as well give them to those who do.",
            "title_similarity": "0.26502708",
            "sentiment_compound": 0.5423
        },
        {
            "id": "h0jis76",
            "score": 2,
            "text": "People wonder why the US is still seen as a beacon in the darkness by so many. This is why.",
            "title_similarity": "0.13874996",
            "sentiment_compound": -0.25
        },
        {
            "id": "h0jj43c",
            "score": 1,
            "text": "This should have happened fucking weeks ago",
            "title_similarity": "0.27913845",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0jltk0",
            "score": 1,
            "text": "https://t.me/joinchat/Opskio3ie-tjODhh",
            "title_similarity": "0.13528502",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0jm079",
            "score": 1,
            "text": "75% of the vaccine, so how many?",
            "title_similarity": "0.77960384",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0jo20c",
            "score": 1,
            "text": "It's about time. I hope the domestic vaccination rates do increase though",
            "title_similarity": "0.48859012",
            "sentiment_compound": 0.6369
        },
        {
            "id": "h0jp235",
            "score": 1,
            "text": "Ceazy",
            "title_similarity": "-0.01669883",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0jpnpb",
            "score": 2,
            "text": "When your doing a total 180 on the previous administration.",
            "title_similarity": "0.41604027",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0jpqdh",
            "score": 4,
            "text": "This will be fun. All the meat heads who are refusing to take it in the USA are gonna start bitching about helping other countries.",
            "title_similarity": "0.41970342",
            "sentiment_compound": 0.1779
        },
        {
            "id": "h0jpvkg",
            "score": 4,
            "text": "It makes me really unhappy that we have enough vaccines to end this pandemic and protect the US population, but evidently so many people are just refusing to get the vaccine that we're having to give it away to other countries. People take for granted what an amazing job the government has done with vaccine distribution - it's miraculous, really - yet people are throwing this opportunity away.",
            "title_similarity": "0.50013506",
            "sentiment_compound": 0.8511
        },
        {
            "id": "h0jq8kr",
            "score": 1,
            "text": "Great. Canada and the U.S stockpiling and hoarding vaccines while refusing to waive patents was realy not a good look",
            "title_similarity": "0.41679224",
            "sentiment_compound": -0.0015
        },
        {
            "id": "h0jrgj6",
            "score": 1,
            "text": "This is a normal thing to do. And a potentially good political movement.",
            "title_similarity": "0.07970728",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h0js98n",
            "score": 1,
            "text": "I have to stop smoking weed. I literally read this as “unbacked” and thought “he really should have chosen one that’s backed”.",
            "title_similarity": "0.25351667",
            "sentiment_compound": -0.296
        },
        {
            "id": "h0jsihx",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "-0.06395121"
        },
        {
            "id": "h0jsnix",
            "score": 1,
            "text": "It's so nice to have a good president than that cheeto-benito.",
            "title_similarity": "0.27081436",
            "sentiment_compound": 0.7178
        },
        {
            "id": "h0jsshj",
            "score": 3,
            "text": "Omg it feels so good to be fully vaccinated.\n\nJust got my 2nd shot this week. It’s a huge relief to never worry about this virus anymore.",
            "title_similarity": "0.4515322",
            "sentiment_compound": 0.8897
        },
        {
            "id": "h0jteid",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "-0.06395121"
        },
        {
            "id": "h0jtpc6",
            "score": 2,
            "text": "Good Step",
            "title_similarity": "-0.07356971",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h0jtvag",
            "score": 1,
            "text": "Wheres the other 25% going?",
            "title_similarity": "0.4434179",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0ju1rb",
            "score": 1,
            "text": "He must be getting stuff done and in order for the transition of power back to the fat psychopath in August.",
            "title_similarity": "0.40515232",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0juec2",
            "score": 1,
            "text": "So?",
            "title_similarity": "-0.13034192",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0jueeo",
            "score": 1,
            "text": "Maybe send fhem to worst affected countries first 🤷🏻‍♂️🙄 But I guess UN will do that",
            "title_similarity": "0.4087535",
            "sentiment_compound": -0.431
        },
        {
            "id": "h0jup6j",
            "score": 1,
            "text": "75% unsed",
            "title_similarity": "0.48645186",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0juzjx",
            "score": 1,
            "text": "They forgot one very important word.\n\nPresident.",
            "title_similarity": "0.28861767",
            "sentiment_compound": 0.2716
        },
        {
            "id": "h0jv31g",
            "score": 1,
            "text": "Come on Canada.  Release your unused vaccines too.",
            "title_similarity": "0.47536933",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0jv6pu",
            "score": 1,
            "text": "Biden seems to be actually making waves and bringing the US back to her prime, unlike his predecessor.....",
            "title_similarity": "0.30536005",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0jvlsh",
            "score": 1,
            "text": "And thats why we got rid of the cheeto.\ngo team!",
            "title_similarity": "0.26350912",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0jvuzn",
            "score": 1,
            "text": "Seems like interest here is flattened out. God speed",
            "title_similarity": "0.12426239",
            "sentiment_compound": 0.765
        },
        {
            "id": "h0jw6iw",
            "score": 1,
            "text": "Wasn't there a popular post or comment recently about countries like the US hoarding vaccines, and how soon they're going to donate them to other countries and pass it off like a good deed and everyone is going to congratulate them (despite the fact that they wouldn't have had to do this if they didn't hoard them in the first place)...?\n\nTo say I got whiplash when I read this title was an understatement.",
            "title_similarity": "0.5342339",
            "sentiment_compound": 0.8302
        },
        {
            "id": "h0jw79o",
            "score": 1,
            "text": "good!  give it to people who will use it. screw anti vaxxers.",
            "title_similarity": "0.18198004",
            "sentiment_compound": 0.126
        },
        {
            "id": "h0jwb5r",
            "score": 1,
            "text": "Cool, can we get universal healthcare now or maybe a living wage? No?",
            "title_similarity": "0.5012256",
            "sentiment_compound": 0.3939
        },
        {
            "id": "h0jwn9w",
            "score": 1,
            "text": "Conservative anti vaxers still gonna hate. \"THOSE ARE OUR VACCINES\"\n\nJust watch",
            "title_similarity": "0.418603",
            "sentiment_compound": -0.7184
        },
        {
            "id": "h0jxome",
            "score": 1,
            "text": "👍🏻",
            "title_similarity": "-0.064157486",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0jywzc",
            "score": 1,
            "text": "I'm so glad trump is out of office. If only we could get rid of greg abbott......",
            "title_similarity": "0.3459559",
            "sentiment_compound": 0.5095
        },
        {
            "id": "h0jyzwg",
            "score": 1,
            "text": "The man is a god",
            "title_similarity": "0.2410342",
            "sentiment_compound": 0.2732
        },
        {
            "id": "h0jz3en",
            "score": 1,
            "text": "All the ferrets died",
            "title_similarity": "0.24031034",
            "sentiment_compound": -0.5574
        },
        {
            "id": "h0jzxal",
            "score": 1,
            "text": "When does he donate his salary?",
            "title_similarity": "0.36474276",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0k0frx",
            "score": 1,
            "text": "Paid for by tax payers to pharmaceutical companies. God bless corporate \nwelfare.",
            "title_similarity": "0.5441233",
            "sentiment_compound": 0.5994
        },
        {
            "id": "h0k32jp",
            "score": 1,
            "text": "As a Australian, it is weird to see the US so far ahead in their vaccination program that they can do this. We donated 9000 to PNG, but that is literally fuck all, and barely put a dint in their outbreak. Hopefully Scummo pulls his finger out of his ass and we can give back to the world some doses!",
            "title_similarity": "0.57852685",
            "sentiment_compound": -0.8221
        },
        {
            "id": "h0k4snp",
            "score": 1,
            "text": "You spelled *China* wrong",
            "title_similarity": "0.22197196",
            "sentiment_compound": -0.4767
        },
        {
            "id": "h0k53of",
            "score": 1,
            "text": "Reddit went from strongly opposing a former president to kissing the ass of the current one. Joe Biden doesn't own the vaccine so how the hell he's the one to donate it? If going by that logic, you can put any random American's name and the meaning would've stayed the same.",
            "title_similarity": "0.5659899",
            "sentiment_compound": -0.552
        },
        {
            "id": "h0ka570",
            "score": 1,
            "text": "Now all the trumptards & Qtards that have been boycotting the vaccine due to stupidity will bitch they cant get it because Biden gave it all away...watch",
            "title_similarity": "0.36856234",
            "sentiment_compound": -0.8555
        },
        {
            "id": "h0kho9g",
            "score": 1,
            "text": "What are we gonna do with the remaining 25% that are also unused? Throw them away?",
            "title_similarity": "0.5112757",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0kk7fi",
            "score": 2,
            "text": "Amazing how instead of comments saying \"this is great, i'm glad we're putting vaccines to good use\" every comment is just \"nurr republicans bad nurr\". Ya'll are assholes.",
            "title_similarity": "0.4401077",
            "sentiment_compound": 0.7579
        },
        {
            "id": "h0kkn22",
            "score": 1,
            "text": "No, the U.S. will donate them. Joe Biden does not own the vaccines.",
            "title_similarity": "0.41214007",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0kv0z1",
            "score": 2,
            "text": "That's nice, but this should have been done earlier, and without the US and other wealthy countries blocking IP waivers so poorer countries could manufacture their own supply quickly. From a public health perspective, the US isn't out of the woods until all other countries vaccinate, and our government has not been the best with ensuring vaccine equity both within and outside our borders.",
            "title_similarity": "0.52266",
            "sentiment_compound": -0.7589
        },
        {
            "id": "h0l2jrs",
            "score": 1,
            "text": "I’m glad others get to have them, but I wish more people took them when they were here.",
            "title_similarity": "0.14807418",
            "sentiment_compound": 0.6757
        },
        {
            "id": "h0l67rm",
            "score": 2,
            "text": "Joe Biden owns the vaccines?",
            "title_similarity": "0.5742568",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0ldmwc",
            "score": 1,
            "text": "I’m confused why this is a good thing...that was an American program to provide relief to Americans hurting from covid...is there no one else in this country still hurting from the lockdowns?",
            "title_similarity": "0.48345178",
            "sentiment_compound": -0.4404
        },
        {
            "id": "h0m5t0e",
            "score": 1,
            "text": "As someone who discussed this policy with multiple actual republicans before this came out, I’d guess that the conservative response won’t be that we shouldn’t give other countries vaccines, as other comment threads here have said. Instead, they’ll argue that we should be *selling* them to other countries or extracting other promises from them. This allows them to hold a much more defensible, reasonable position while still giving them the ability to oppose a democratic administration.\n\nNow, I think this is short-sighted and immoral, but most republicans are more creative in their opposition than most threads here would suggest.",
            "title_similarity": "0.46208873",
            "sentiment_compound": 0.6894
        },
        {
            "id": "h0mv6r0",
            "score": 1,
            "text": "But not agreeing to open the recipe to other countries so they can work on thier own vaccine...still protecting big pharma",
            "title_similarity": "0.51509315",
            "sentiment_compound": -0.3724
        },
        {
            "id": "h0sckee",
            "score": 1,
            "text": "Look at Kamala back there in the shadows, lurking like a famished vulture waiting for a Biden carcass.",
            "title_similarity": "0.13701363",
            "sentiment_compound": -0.25
        },
        {
            "id": "h1sr4u7",
            "score": 1,
            "text": "he can hardly put a sentence together, wtf is going on? Who is running the USA?",
            "title_similarity": "0.33606863",
            "sentiment_compound": -0.6278
        },
        {
            "id": "h2h0mc8",
            "score": 1,
            "text": "And the GOP goes crazy accusing him of abandoning the citizens",
            "title_similarity": "0.25448257",
            "sentiment_compound": -0.6908
        },
        {
            "id": "h2pob5k",
            "score": 1,
            "text": "https://t.me/joinchat/jWGllsORk8ozMjJh",
            "title_similarity": "0.14623857",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2qs6z9",
            "score": 1,
            "text": "Throughout the dramatic past year, many people\r had in mind contributing to help the most\r vulnerable people to fight against COVID-19.\r  \n\r  \nCOVID FREE TOKEN\r launches their token to help many people by raising funds to donate to International Organizations.\r  \n\r\n\nThis is such an amazing gesture.",
            "title_similarity": "0.529953",
            "sentiment_compound": 0.857
        },
        {
            "id": "h3rpt8e",
            "score": 1,
            "text": "Gave up at home, no takers of the experimental gene therapy treatment shot. You have to give it away to provided a un needed treatment for a life expectancy in the 90% at minimum, so what let's take our chances then go to war on who started this. ww3...",
            "title_similarity": "0.5543406",
            "sentiment_compound": -0.6486
        },
        {
            "id": "h9md7ea",
            "score": 1,
            "text": "And made quite a generous donation to the Taliban. Weapons, uniforms, blackhawks, artillery, way to go Joe. Unbelievable.",
            "title_similarity": "0.48818147",
            "sentiment_compound": 0.3566
        }
    ]
}