{
    "BuzzFeed News Has Won Its First Pulitzer Prize For Exposing China’s System For Detaining Muslims\n": [
        {
            "id": "h1fx0k6",
            "score": -1,
            "text": "[removed]",
            "title_similarity": "-0.022555217"
        },
        {
            "id": "h1funka",
            "score": 9,
            "text": "\"One of the worst human rights abuses in our time\"\nMeanwhile, in Gaza...",
            "title_similarity": "0.44193462",
            "sentiment_compound": -0.8271
        },
        {
            "id": "h1fw1vt",
            "score": 98,
            "text": "The Pulitzer Prize is a joke, it's a political tool to award the people who think like they do and call it examples of good journalism in order to lend it legitimacy. \n\nIn the early 1930 Walter Duranty, the Moscow bureau chief of The New York Times wrote a number of stories denying the Holodomor, and covering up atrocities committed by Stalin Russia.  He even went so far as to slander other journalist like Gareth Jones who was working to expose the tragedy. \n\nThere have been numerous calls for the Pulitzer to revoke the award for Durnaty but they will not: [https://www.pulitzer.org/news/statement-walter-duranty](https://www.pulitzer.org/news/statement-walter-duranty) \n\n[https://en.wikipedia.org/wiki/Walter\\_Duranty](https://en.wikipedia.org/wiki/Walter_Duranty)\n\n[https://en.wikipedia.org/wiki/Gareth\\_Jones\\_(journalist)](https://en.wikipedia.org/wiki/Gareth_Jones_(journalist))",
            "title_similarity": "0.6713544",
            "sentiment_compound": 0.7717
        },
        {
            "id": "h1fpyml",
            "score": 62,
            "text": "Prepare your selves. CCP defenders are comming",
            "title_similarity": "0.18669353",
            "sentiment_compound": 0.0772
        },
        {
            "id": "h1fqva0",
            "score": -52,
            "text": "Pretty wild you can win a Pulitzer reporting about things in places you never went to",
            "title_similarity": "0.50073785",
            "sentiment_compound": 0.7906
        },
        {
            "id": "h1fzvlw",
            "score": -24,
            "text": "lol. And so goes the Pulitzer down the drain.",
            "title_similarity": "0.29645634",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h1g1pqo",
            "score": 21,
            "text": "> BuzzFeed News Has Won Its First Pulitzer Prize\n\nI think I just threw up in my mouth a little.",
            "title_similarity": "0.67304933",
            "sentiment_compound": 0.7906
        },
        {
            "id": "h1fydhj",
            "score": 1,
            "text": "I’ve read their articles on this. They were very good. Well-earned for sure!",
            "title_similarity": "0.23252313",
            "sentiment_compound": 0.6989
        },
        {
            "id": "h1fyhzs",
            "score": 3,
            "text": "Good on them. They've become a quality journalistic enterprise, clickbait origins aside. This is well deserved.",
            "title_similarity": "0.32367575",
            "sentiment_compound": 0.6124
        },
        {
            "id": "h1fsgr1",
            "score": -26,
            "text": "According to all the reddit CCP bots this isn't factual... I wonder if the reward will be rescinded? (heavy sarcasm)",
            "title_similarity": "0.48494786",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h1fyd52",
            "score": 4,
            "text": "Shit there goes their credibility",
            "title_similarity": "0.031727348",
            "sentiment_compound": -0.5574
        },
        {
            "id": "h1g2ef3",
            "score": -18,
            "text": "People have combed over their map data and usually the \"death camps\" turn out to be schools or apartment blocks.\n\nWhat a farce",
            "title_similarity": "0.4747327",
            "sentiment_compound": -0.8176
        },
        {
            "id": "h1fynu8",
            "score": 126,
            "text": "Unearned. They didn't expose anything. Manufacturing Consent.",
            "title_similarity": "0.11886639",
            "sentiment_compound": 0.3278
        },
        {
            "id": "h1h0gft",
            "score": 6,
            "text": "Why does this seem oddly familiar …\n\nhttps://www.smh.com.au/opinion/the-new-york-times-role-in-promoting-war-on-iraq-20040323-gdilbl.html\n\n> Judith Miller is one of the NYT's most senior journalists. A Pulitzer Prize winning writer and regarded expert on Middle East issues and WMD, Miller has written extensively on Osama Bin Laden and the al-Qaeda network.\n\n> In the run-up to the Iraq War, Miller became a key reporter on that country’s supposedly documented WMDs. She wrote many articles relayed around the globe on the Bush administration’s doomsday reading of Saddam’s regime. She painted a terrifying picture of his arsenal with apparently sound intelligence sources to back her claims.\n\n>However, it emerged that the vast majority of her WMD claims came through Ahmed Chalabi, an indicted fraudster and one of the leading figures in the Iraqi National Congress (INC), the group keen to militarily overthrow Saddam. Miller relied on untested defectors’ testimonies (usually provided by Chalabi) to write several front-page stories on this information. Michael Massing from Columbia Journalism Review suggests her stories were “far too reliant on sources sympathetic to the (Bush) administration\".",
            "title_similarity": "0.63726676",
            "sentiment_compound": 0.0516
        },
        {
            "id": "h1fkj8b",
            "score": 150,
            "text": "how can they win an award for something that china says isnt happening? I will wait for the china bots to explain this to me. lol",
            "title_similarity": "0.6450466",
            "sentiment_compound": 0.8779
        },
        {
            "id": "h1fv645",
            "score": -1,
            "text": "Click HERE to find out which Deception Leader you are.",
            "title_similarity": "0.30826113",
            "sentiment_compound": -0.4404
        },
        {
            "id": "h1fpidj",
            "score": -24,
            "text": "Unpopular Opinion: Buzzfeed isn't as bad as the memes say it is!",
            "title_similarity": "0.3700831",
            "sentiment_compound": 0.484
        },
        {
            "id": "h1fynls",
            "score": 4,
            "text": "Buzz feed is still a joke though",
            "title_similarity": "0.16242512",
            "sentiment_compound": 0.296
        },
        {
            "id": "h1fy3w5",
            "score": 196,
            "text": "from the bottom of the article from buzzfeed: https://www.buzzfeednews.com/article/meghara/china-new-internment-camps-xinjiang-uighurs-muslims\n  \n>Alison Killing conducted this reporting with a grant and further assistance from the Open Technology Fund.\n   \nfrom their [wiki](https://en.wikipedia.org/wiki/Open_Technology_Fund):   \n   \n>The Open Technology Fund was created in 2012 as a pilot program within **Radio Free Asia.**[2][7] Under U.S. Secretary of State Hillary Clinton, the State Department adopted a policy of supporting global internet freedom initiatives.[8] At this time, RFA began looking into technologies that helped their audiences avoid censorship and surveillance.[8] Journalist Eli Lake argued that Clinton's policy was \"heavily influenced by the Internet activism that helped organize the green revolution in Iran in 2009 and other revolutions in the Arab world in 2010 and 2011\".[8].  \n   \n  \n   \nfrom their [about page](https://www.opentech.fund/about/our-history/):\n>About a decade ago, the United States Congress recognized Radio Free Asia (RFA) and the Broadcasting Board of Governors (BBG) as an appropriate engine to empower citizens worldwide to use the Internet as a safe and secure platform for free speech. **To this end, the Open Technology Fund (OTF) was created in 2012 as a program of Radio Free Asia.**\n   \nOh look, it's the [RFA](https://en.wikipedia.org/wiki/Radio_Free_Asia) again, an organization banned from broadcasting in the US between 1948-2013 under the [Smith-Mundt Act](https://en.wikipedia.org/wiki/Smith%E2%80%93Mundt_Act#Entities_covered_by_the_Act) which banned domestic propaganda. Then again it's buzzfeed, i did not expect much to begin with.",
            "title_similarity": "0.68824047",
            "sentiment_compound": 0.9501
        },
        {
            "id": "h1fpk7m",
            "score": 3,
            "text": "The MIC made sure they would win the award for a job well done.",
            "title_similarity": "0.27854767",
            "sentiment_compound": 0.8934
        },
        {
            "id": "h1fvssq",
            "score": 3,
            "text": "[deleted]",
            "title_similarity": "0.027378835"
        },
        {
            "id": "h1g2l5i",
            "score": 1,
            "text": "Buzzfeed is the most toxic thing on the face of the planet. How in the hell does this make sense",
            "title_similarity": "0.50470483",
            "sentiment_compound": -0.6808
        },
        {
            "id": "h1g4zl5",
            "score": -7,
            "text": "China, the world's 21st century Nazis.",
            "title_similarity": "0.58093774",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1fvzpr",
            "score": -20,
            "text": "[deleted]",
            "title_similarity": "0.027378835"
        },
        {
            "id": "h1g7nsx",
            "score": 26,
            "text": "Pretty telling how Reddit immediately stops shitting on BuzzFeed as soon as it confirms their biases. For the article itself, in the subheading it states it has been funded by the OTF (Open Technology Fund)\n\nA quick look at their about page:\n\n“Our foundation\n\nAbout a decade ago, the United States Congress recognized Radio Free Asia (RFA) and the Broadcasting Board of Governors (BBG) as an appropriate engine to empower citizens worldwide to use the Internet as a safe and secure platform for free speech. To this end, the Open Technology Fund (OTF) was created in 2012 as a program of Radio Free Asia. Broadcasting over the radio and then the Internet throughout China, including in Xinjiang and Tibet, RFA knew well both the challenges and importance of providing independent media content in censored environments. It was out of this context that OTF was born.”\n\nVery interesting, we have arrived at Radio Free Asia, an outlet [literally founded by the CIA](https://www.nytimes.com/1977/12/26/archives/worldwide-propaganda-network-built-by-the-cia-a-worldwide-network.html)\n\nIt’s just funny, every single time, every single article, every single report about this issue in Xinjiang always comes full fucking circle to:\n\na) a Christian fundamentalist who works for the Jamestown Foundation, a right-wing NGO with origins in the CIA which researches “defence” policy\n\nb) the ASPI, funded by Raytheon, Boeing and Lockheed Martin, among many others\n\nc) Radio Free Asia, a CIA propaganda network\n\nEvery. Single. Time",
            "title_similarity": "0.6506376",
            "sentiment_compound": 0.9856
        },
        {
            "id": "h1gglin",
            "score": 5,
            "text": "Radio Free Asia helped the journalist behind this \"exposé\". That's the CIA btw.\n\nSomeone please explain to me why the US stopped UN observers visiting Xinjiang if it totally definitely knows for sure trust me bro that there's concentration camps in Xinjiang for Uyghurs? (the ones they suddenly care about after admitting to funding terrorism in the region)\n\nRemember folks, propaganda isn't just about lying, it's about twisting and omitting the truth.",
            "title_similarity": "0.7451912",
            "sentiment_compound": 0.9181
        },
        {
            "id": "h1gv44a",
            "score": 7,
            "text": "Yep, it's more cold war stuff funded by the US government and military contractors. You'll notice the evidence BuzzFeed come up with is flimsy at best and this story was funded by [Radio Free Asia](https://www.nytimes.com/1977/12/26/archives/worldwide-propaganda-network-built-by-the-cia-a-worldwide-network.html) which was founded by the CIA and well known as a front for American propaganda as you'll see in the NYT article.\n\nQiao Collective has done some extensive work in debunking a lot of these claims. If we want peace well have to see through a lot of these unsubstantiated claims. How many times more times will we be lied into wars?\n\nhttps://www.qiaocollective.com/en/education/xinjiang\n\nVideo of retired Colonal [Lawrence Wilkerson talking](https://www.youtube.com/watch?v=hrufheMU-WQ) about the US strategy with Uyghurs in Xinjiang.",
            "title_similarity": "0.6416372",
            "sentiment_compound": 0.689
        },
        {
            "id": "h1fx2a6",
            "score": -4,
            "text": "This authoritarian trick the CCP doesn't want you to know about",
            "title_similarity": "0.28397584",
            "sentiment_compound": -0.1083
        },
        {
            "id": "h1gh557",
            "score": -3,
            "text": "[removed]",
            "title_similarity": "-0.022555217"
        },
        {
            "id": "h1g9y9v",
            "score": 4,
            "text": "Xi Jinping can go to hell",
            "title_similarity": "0.30267134",
            "sentiment_compound": -0.6808
        },
        {
            "id": "h1g3jzh",
            "score": 9,
            "text": "Insert Seymour Skinner meme:\n\n\"Could China be as bad as they say it is?\"\n\n\"No, it's the Pulitzer committee, Amnesty International, and the Agence France-Presse who are wrong.\"",
            "title_similarity": "0.6809798",
            "sentiment_compound": -0.765
        },
        {
            "id": "h1gaftd",
            "score": 2,
            "text": "Top 10 Reasons Why A Preemptive Strike is in Order",
            "title_similarity": "0.33741498",
            "sentiment_compound": 0.0772
        },
        {
            "id": "h1i6tft",
            "score": 1,
            "text": "Where have they exposed anything?\n\nThey were just regurgitating unsupported conspiracy theories by religious and secessionist extremists not supported by evidence and were citing disgraced anti-communist conspiracy theorists like Adrian Zenz, no?\n\nAs a non-American I always thought the Pulitzer Prize was apolitical?\n\nI wonder what Buzzfeed article they are referring that \"exposed\" anything (a word that implies that they have found actual evidence). I have been following the American anti-Chinese propaganda surrounding Xinjiang since the 90s when the US was first funding extremists there to build a secessionist movement and break up the country.\n\nSince then nobody has ever found any evidence of wrongdoing on behalf of the Chinese government and non-partisan international organizations, including the UN have consistently praised China for its amazing work in the region.\n\nYet over the past 2 years it suddenly became a major focus of American anti-Chinese propaganda and we have crackpot government-paid anti-communist shills like Adrian Zenz are being paraded around as if their absurd claims could be taken seriously... and BuzzFeed wins a Pulitzer Prize for some hit piece? If they are referring to the BuzzFeed article I believe they are referring to: They \"exposed\" nothing. They didn't even do any kind of original investigative research. They straight-up uncritically repeated what members of the World Uyghur Congress (a US-funded propaganda organization in Germany led by anti-communist who want to break up China to establish a new country on Chinese soil against the will of the general population).\n\n\nCan someone link for me the article they won a prize for if that isn't the one?",
            "title_similarity": "0.73620033",
            "sentiment_compound": 0.9101
        },
        {
            "id": "h1ftvxp",
            "score": 29,
            "text": "I think the development of BuzzFeed from an algorithm that generates arbitrary \"Top X\" lists from stolen content to a Pulitzer Prize Winning news organization is one of the better character arcs of the 2010-20's season",
            "title_similarity": "0.66846824",
            "sentiment_compound": 0.802
        },
        {
            "id": "h1gmzu1",
            "score": 2,
            "text": "Fuck the CCP.\n\nAlso, Taiwan is a great country.",
            "title_similarity": "0.4224149",
            "sentiment_compound": 0.1531
        },
        {
            "id": "h1fvyca",
            "score": -5,
            "text": "Wow.\n\nI didn't know BuzzFeed was capable of this.",
            "title_similarity": "0.2776034",
            "sentiment_compound": 0.7506
        },
        {
            "id": "h1g5eb5",
            "score": 2,
            "text": "Congratulations BuzzFeed, keep up the good work. I bet you China is pissed.",
            "title_similarity": "0.5600442",
            "sentiment_compound": 0.3818
        },
        {
            "id": "h1gp9q8",
            "score": 2,
            "text": "Everyone yesterday: BuzzFeed is horrible! I hate BuzzFeed! They should just disappear forever!!\n\nEveryone today: Oh I've totally always thought BuzzFeed was great! They're fantastic! I love them! I'm the biggest BuzzFeed fan ever!",
            "title_similarity": "0.51591736",
            "sentiment_compound": 0.8057
        },
        {
            "id": "h1fxqtk",
            "score": 15,
            "text": "This feels like the onion.",
            "title_similarity": "0.116407625",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h1ftix5",
            "score": -8,
            "text": "Top 10 Worst Places In China to Be Muslim - Number 6 Will BLOW YOUR MIND!!!",
            "title_similarity": "0.6295898",
            "sentiment_compound": -0.5962
        },
        {
            "id": "h1fzhga",
            "score": -5,
            "text": "Ok, I might have to view BuzzFeed News a bit more seriously. Thought they are just a content farm.",
            "title_similarity": "0.30797952",
            "sentiment_compound": -0.2484
        },
        {
            "id": "h1g0gtm",
            "score": 3,
            "text": "Lol",
            "title_similarity": "-0.12713787",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h1fn82r",
            "score": 22,
            "text": "Find out how this noodle vendor evades the Great Firewall with this one SIMPLE trick, - ***The state censors HATE him!***",
            "title_similarity": "0.56939054",
            "sentiment_compound": -0.4633
        },
        {
            "id": "h1gbtho",
            "score": -2,
            "text": "What does this physically accomplish to free them?",
            "title_similarity": "0.07797977",
            "sentiment_compound": 0.7269
        },
        {
            "id": "h1gjfi3",
            "score": 2,
            "text": "Yet they and the leftists they support still bend over to China. Amazing that up to 80M people (depending on real number of legitimate votes) couldn’t see through it",
            "title_similarity": "0.6533435",
            "sentiment_compound": 0.7783
        },
        {
            "id": "h1fzfbc",
            "score": -4,
            "text": "China is gonna move a cross hair over them now",
            "title_similarity": "0.47290874",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1gose1",
            "score": 26,
            "text": "Next do Guantanamo bay",
            "title_similarity": "0.1039388",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1g92c3",
            "score": 3,
            "text": "10 ways China violates human rights, number 6 will shock you",
            "title_similarity": "0.59646755",
            "sentiment_compound": -0.6808
        },
        {
            "id": "h1gb7eh",
            "score": 2,
            "text": "At least some of our institutions still have courage when it comes to China.",
            "title_similarity": "0.37779248",
            "sentiment_compound": 0.4939
        },
        {
            "id": "h1gbd9w",
            "score": 3,
            "text": "Now, do America!",
            "title_similarity": "0.1436754",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1gbkyh",
            "score": -3,
            "text": "I better not tell the tankie at work or my day will be ruined",
            "title_similarity": "0.31947374",
            "sentiment_compound": -0.0516
        },
        {
            "id": "h1g3o7v",
            "score": 7,
            "text": "Well that's the last place I expected to win a Pulitzer",
            "title_similarity": "0.4043153",
            "sentiment_compound": 0.7096
        },
        {
            "id": "h1h465p",
            "score": 2,
            "text": "Has anyone encountered the numerous yahoos online who deny this is even happening? It's on par with holocaust denial. \n\nThey say all the interviews are fake, the satellite photos are fake, all the international news and NGOs who independently investigated this are involved in a massive global conspiracy to make us hate China?\n\nMind boggling.",
            "title_similarity": "0.69631565",
            "sentiment_compound": -0.9438
        },
        {
            "id": "h1g3we2",
            "score": 9,
            "text": "Only nine more Pulitzers and they can do a top ten list.\n\nNUMBER FOUR WILL SHOCK YOU",
            "title_similarity": "0.4859059",
            "sentiment_compound": -0.128
        },
        {
            "id": "h1g01k5",
            "score": 136,
            "text": "> Alison Killing conducted this reporting with a grant and further assistance from the Open Technology Fund.\n\n> The Open Technology Fund was created in 2012 as a pilot program within Radio Free Asia.[2][7] Under U.S. Secretary of State Hillary Clinton, the State Department adopted a policy of supporting global internet freedom initiatives.[8] At this time, RFA began looking into technologies that helped their audiences avoid censorship and surveillance.[8] Journalist Eli Lake argued that Clinton's policy was \"heavily influenced by the Internet activism that helped organize the green revolution in Iran in 2009 and other revolutions in the Arab world in 2010 and 2011\".[8].\n\nWe really got to the point that Pulitzer winners are getting US state funding, beautiful.",
            "title_similarity": "0.5879734",
            "sentiment_compound": 0.9153
        },
        {
            "id": "h1g21yb",
            "score": 0,
            "text": "How can this be BuzzFeed News's first Pulitzer when back when it exposed Trump for directing Cohen to lie to the FBI people on Reddit said BuzzFeed News division already won Pulitzer back then.",
            "title_similarity": "0.800853",
            "sentiment_compound": 0.5267
        },
        {
            "id": "h1g4mqu",
            "score": 0,
            "text": "as terrible as the details within the story are, nothing will change and China will continue to perform genocide on these innocent humans.",
            "title_similarity": "0.6241113",
            "sentiment_compound": -0.1779
        },
        {
            "id": "h1g543k",
            "score": 0,
            "text": "Buzzfeed does something good???",
            "title_similarity": "0.20143396",
            "sentiment_compound": 0.533
        },
        {
            "id": "h1gaksj",
            "score": 0,
            "text": "I'm guessing no prizes will be given to journalists covering Muslims detained in Guantanamo Bay without charges for years and being tortured at CIA black sites.",
            "title_similarity": "0.6558666",
            "sentiment_compound": -0.7885
        },
        {
            "id": "h1gnjxn",
            "score": 0,
            "text": "As long as they’re branded buzzfeed, I will not take them seriously",
            "title_similarity": "0.3161432",
            "sentiment_compound": 0.1326
        },
        {
            "id": "h1hlad8",
            "score": 0,
            "text": "I can only assume they were able to get into China as the government didn't expect them to be doing any journalism.",
            "title_similarity": "0.5784233",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1ho8lg",
            "score": 0,
            "text": "Go to read the article... \n\nIt's just wishful thinking.\n\nClick baited again",
            "title_similarity": "0.3333707",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1hpt6k",
            "score": 0,
            "text": "If buzzfeed is winning awards the end times are truly upon us.",
            "title_similarity": "0.41670364",
            "sentiment_compound": 0.8519
        },
        {
            "id": "h1idgdx",
            "score": 0,
            "text": "“Even a stopped clock is right twice a day.” I still despise buzzfeed. Know how many “articles” are simply copy/pasted /r/askreddit s?? They’re lazy excuses for “journalists.”",
            "title_similarity": "0.51265824",
            "sentiment_compound": -0.7319
        },
        {
            "id": "h1igcl8",
            "score": 0,
            "text": "PPrize is a hoax.",
            "title_similarity": "0.19179784",
            "sentiment_compound": -0.2732
        },
        {
            "id": "h1fjb4f",
            "score": -56,
            "text": "[deleted]",
            "title_similarity": "0.027378835"
        },
        {
            "id": "h1gg2bo",
            "score": 9,
            "text": "Literally never thought I would unironically say, good fucking job Buzzfeed. Your reporting on this subject was extremely well done and you deserve the accolades. My hope is that more news story’s like this will crop up and pressure country’s into stopping these atrocities.",
            "title_similarity": "0.58327967",
            "sentiment_compound": 0.7996
        },
        {
            "id": "h1g2t2h",
            "score": 3,
            "text": "What alternate ass timeline are we in.",
            "title_similarity": "0.014630927",
            "sentiment_compound": -0.5423
        },
        {
            "id": "h1g2uyv",
            "score": 3,
            "text": "You WON’T believe what China does with this one simple trick",
            "title_similarity": "0.48769027",
            "sentiment_compound": -0.0516
        },
        {
            "id": "h1g5c2i",
            "score": 3,
            "text": "And yet people will use Chinese products while spouting social justice.\n\nLebron probably skipped this article.",
            "title_similarity": "0.60758007",
            "sentiment_compound": 0.5267
        },
        {
            "id": "h1gswu2",
            "score": -4,
            "text": "So is it official now? Lefties are allowed by their lord Jesus savior aka the media to out China for their wrongs like the right has been doing for 40 years?",
            "title_similarity": "0.80076945",
            "sentiment_compound": 0.4329
        },
        {
            "id": "h1g3r7i",
            "score": -4,
            "text": "I’m assuming they stole the content from somewhere else given their usual articles are collections of things stolen from Twitter/Reddit/Facebook etc etc",
            "title_similarity": "0.5364367",
            "sentiment_compound": -0.4939
        },
        {
            "id": "h1gg5e6",
            "score": -6,
            "text": "Buzzfeed is such fucking garbage. I want to believe the article and I want everyone, everywhere to put China on fucking blast because they're a disgusting government run by and supported by absolutely disgusting humans....\n\nBut Buzzfeed/ BF News could tell me the Sun is hot and I flat out wouldn't believe it. They could report my house was on fire as I watched it burn and I wouldn't believe them. \n\nThey're garbage, and I guess so is pulitzer. Kinda like when Obama won the Nobel peace prize for continuing to drone, bomb and shoot brown folks to death for 8 years after campaigning against the war. \n\n*I was for the war, before I was against the war*",
            "title_similarity": "0.7494525",
            "sentiment_compound": -0.9601
        },
        {
            "id": "h1ga6em",
            "score": 7,
            "text": "Anyone else find it ridiculous that sites like dailymail and buzzfeed now have better investigative journalism than CNN, FOX, MSNBC, etc.?",
            "title_similarity": "0.5925423",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h1gsg49",
            "score": 7,
            "text": "Mad respect for these journalists. Investigative journalism is so critical. Theres prob no such thing in China unless its done by ccp.",
            "title_similarity": "0.68308806",
            "sentiment_compound": -0.6476
        },
        {
            "id": "h1g26ln",
            "score": 2,
            "text": "Too bad nothing will come of this that benefits the Muslims in China. But hey, at least they got a Pulitzer Prize!",
            "title_similarity": "0.6792325",
            "sentiment_compound": 0.6476
        },
        {
            "id": "h1gafgg",
            "score": -2,
            "text": "Buzzfeed News can shallow my cock whole. It’s a useless neoliberal click-bait shit site, giving ammunition to far right.",
            "title_similarity": "0.55165696",
            "sentiment_compound": -0.6808
        },
        {
            "id": "h1gegxu",
            "score": 2,
            "text": "That's a weird way to spell \"BuzzFeed News Has Won its First Pulitzer Prize For Exposing China's Genocide of Uighurs\"",
            "title_similarity": "0.9313376",
            "sentiment_compound": 0.6369
        },
        {
            "id": "h1goqbh",
            "score": -3,
            "text": "Honestly my opinion of Buzzfeed is so low that this has damaged my opinion of the Pulitzer rather than elevated my opinion of Buzzfeed",
            "title_similarity": "0.43646702",
            "sentiment_compound": -0.3902
        },
        {
            "id": "h1guj9u",
            "score": -3,
            "text": "Fuck Buzzfeed.",
            "title_similarity": "0.2608426",
            "sentiment_compound": -0.5423
        },
        {
            "id": "h1h1bhf",
            "score": 0,
            "text": "Hahaa you know its corrupt when buzzfeed get an award",
            "title_similarity": "0.48421368",
            "sentiment_compound": 0.5423
        },
        {
            "id": "h1gv4j9",
            "score": -4,
            "text": "[deleted]",
            "title_similarity": "0.027378835"
        },
        {
            "id": "h1fxdep",
            "score": -12,
            "text": "How sad of a world do we live in when Buzzfeed is among the best in the field of journalism?",
            "title_similarity": "0.6056894",
            "sentiment_compound": 0.2732
        },
        {
            "id": "h1g5t2p",
            "score": -16,
            "text": "People need to stop blaming this on ‘China’, it’s a problem with systems, with bureaucracy, with communications.  Trump didn’t get hung for keeping children in cages at the border, people investigated and there were people lower down the chain of command interpreting the rules their own way and the people at the bottom get screwed.  This is a universal problem the world over. \nMost likely the Chinese government does not have some secret racist agenda or a policy of genocide, it’s just that they have rules for everyone and a policy of suppressing negative distorted news. It’s more likely the people implementing the rules running the prisons can be assholes and have bias. It is wrong to sensationalise it and create racism and political sanctions etc, but of course there are those who gain from spreading news or fear or sanctions against competing businesses.  But these are also bad people.",
            "title_similarity": "0.6411663",
            "sentiment_compound": -0.9716
        },
        {
            "id": "h1g985e",
            "score": 21,
            "text": "Their celebrity news division is poison though. Full of isms and tropes and shitty gotcha journalism",
            "title_similarity": "0.53821254",
            "sentiment_compound": -0.7964
        },
        {
            "id": "h1g3tis",
            "score": 7,
            "text": "They do have some great journalism on buzzfeed news. The rest of the site is nonsense, though.",
            "title_similarity": "0.4438712",
            "sentiment_compound": 0.34
        },
        {
            "id": "h1fjmm9",
            "score": 703,
            "text": "Top 10 ways China is abusing Uyghurs - you won't believe number 3",
            "title_similarity": "0.6902336",
            "sentiment_compound": -0.3447
        },
        {
            "id": "h1fufxc",
            "score": 6,
            "text": "Journalism profs everywhere gonna have to find new jokes",
            "title_similarity": "0.38208503",
            "sentiment_compound": 0.25
        },
        {
            "id": "h1fwzh2",
            "score": -4,
            "text": "The ten worst reasons to be Muslim in China!",
            "title_similarity": "0.58457637",
            "sentiment_compound": -0.6588
        },
        {
            "id": "h1g8juj",
            "score": 3,
            "text": "Just here for the Beijing supporters to deflect and deploy their whataboutism barrage",
            "title_similarity": "0.5967889",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h1g8rzz",
            "score": 4,
            "text": "And FOX \"News\" still doesn't have a Pulitzer or any other credible journalism award and probably never will.",
            "title_similarity": "0.23521525",
            "sentiment_compound": 0.5423
        },
        {
            "id": "h1g3glt",
            "score": -3,
            "text": "Whoa Buzzfeed took a break from peddling propaganda and racially loaded articles to do some real journalism.",
            "title_similarity": "0.5521262",
            "sentiment_compound": -0.25
        },
        {
            "id": "h1gnd2d",
            "score": 4,
            "text": "This is a testament to how absolutely ahitty the mainstream media is, when buzzfeed wins.",
            "title_similarity": "0.50689495",
            "sentiment_compound": 0.5719
        },
        {
            "id": "h1gzmrb",
            "score": -5,
            "text": "You mean undeniably fabricated steel dossier buzzfeed news? The tabloid? No I do not like trump but don’t let America sell you war as a social justice issue....",
            "title_similarity": "0.6179496",
            "sentiment_compound": -0.5048
        },
        {
            "id": "h1jpn92",
            "score": -4,
            "text": "Lol just a random satellite images can make them win that award ? What a joke",
            "title_similarity": "0.4492515",
            "sentiment_compound": 0.9062
        },
        {
            "id": "h1g0vy9",
            "score": -1,
            "text": "The BuzzFeed name is so tainted with terrible garbage that I never once would assume they'd release anything decent but I guess good job on the exposé.",
            "title_similarity": "0.57201624",
            "sentiment_compound": 0.3956
        },
        {
            "id": "h1g1tq6",
            "score": 1,
            "text": "I thought they deserved an award for their article entitled “15 Great Things You Need to Buy on Amazon Right Now”.",
            "title_similarity": "0.51512444",
            "sentiment_compound": 0.886
        },
        {
            "id": "h1g27ed",
            "score": 1,
            "text": "seeing the name buzzfeed next to anything of substance confuses me to no end. is this buzzfeed now or are they a seperate department or something ?",
            "title_similarity": "0.38226557",
            "sentiment_compound": -0.5423
        },
        {
            "id": "h1g4oec",
            "score": -1,
            "text": "Click bait.",
            "title_similarity": "0.12354893",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1g7rqr",
            "score": 1,
            "text": "Dictators hate them!",
            "title_similarity": "0.268014",
            "sentiment_compound": -0.6114
        },
        {
            "id": "h1g9lmm",
            "score": -1,
            "text": "Written by an unpaid intern…",
            "title_similarity": "0.19106027",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1g9pcd",
            "score": 1,
            "text": "anyone know if fox \"news\" has managed to snag one of those yet?",
            "title_similarity": "0.2856199",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1ge6qm",
            "score": 1,
            "text": "I'm wondering how America's right wing is digesting this. They hate China, they hate Muslims, curious how they would respond to this news.",
            "title_similarity": "0.65653145",
            "sentiment_compound": -0.7269
        },
        {
            "id": "h1gfx5h",
            "score": -1,
            "text": "Kind of a joke award, especially since most of the press around China and propaganda from the US",
            "title_similarity": "0.6522589",
            "sentiment_compound": 0.5719
        },
        {
            "id": "h1ghtss",
            "score": -1,
            "text": "Buzzfeed News posted the widely debunked and ridiculed Trump dossier that tarnished an incoming president.  Giving them an award is criminal b",
            "title_similarity": "0.7063125",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1gi0s3",
            "score": 1,
            "text": "But the CCP army of commenters is still sticking to their script about some British guy!",
            "title_similarity": "0.38297886",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1gkt4s",
            "score": 1,
            "text": "\"detaining\"? You mean concentration camps and genoicide, the likes of which hasn't been seen since hitler had the idea. So tired of people sucking chinas dick. We should be at war, yesterday.",
            "title_similarity": "0.63257146",
            "sentiment_compound": -0.8458
        },
        {
            "id": "h1gq5kl",
            "score": 1,
            "text": "Here’s 7 ways the Pulitzer Prize will impact BuzzFeed. #5 will have you in tears.",
            "title_similarity": "0.56922376",
            "sentiment_compound": 0.34
        },
        {
            "id": "h1grmsf",
            "score": -1,
            "text": "Queue incoming tankies and commies to deny the genocide of the Uyghurs....",
            "title_similarity": "0.5531031",
            "sentiment_compound": -0.34
        },
        {
            "id": "h1gsbbh",
            "score": -1,
            "text": "Even the National Enquirer and other tabloids got it right once and awhile.  Still a trash rag though.",
            "title_similarity": "0.47027978",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1gww8j",
            "score": 1,
            "text": "Is this a joke?",
            "title_similarity": "0.041966073",
            "sentiment_compound": 0.296
        },
        {
            "id": "h1h2iw6",
            "score": -1,
            "text": "Guess even a broken clock can show the correct time twice a day...\nCongratulations.",
            "title_similarity": "0.3788013",
            "sentiment_compound": 0.2023
        },
        {
            "id": "h1hdm1a",
            "score": -1,
            "text": "I always see different numbers. is it thousands of locked up Uighurs or millions of  it's always such a wide margin of error. and then it's always cited from Adrien Zenz..",
            "title_similarity": "0.37028658",
            "sentiment_compound": -0.4019
        },
        {
            "id": "h1heb6h",
            "score": -1,
            "text": "[deleted]",
            "title_similarity": "0.027378835"
        },
        {
            "id": "h1hkubk",
            "score": 1,
            "text": "Fuck China. Backwards ass nation",
            "title_similarity": "0.48779687",
            "sentiment_compound": -0.7906
        },
        {
            "id": "h1hllbo",
            "score": 1,
            "text": "So it’s true that journalism is dead.",
            "title_similarity": "0.26978153",
            "sentiment_compound": -0.3008
        },
        {
            "id": "h1hoj7l",
            "score": -1,
            "text": "One article criticizing China and you all take Buzzfeed seriously. It boggles the mind",
            "title_similarity": "0.70988125",
            "sentiment_compound": -0.4939
        },
        {
            "id": "h1hspus",
            "score": -1,
            "text": "China bashing is the season’s flavour. Sorry guys, this will go down the same route as WMDs in Iraq.",
            "title_similarity": "0.67748153",
            "sentiment_compound": -0.0772
        },
        {
            "id": "h1ibje0",
            "score": 1,
            "text": "The world is truly fucked if BuzzFeed won a Pulitzer",
            "title_similarity": "0.5486718",
            "sentiment_compound": 0.296
        },
        {
            "id": "h1ic5fo",
            "score": 1,
            "text": "Has anyone thought that maybe, just maybe, China has a reason for this?",
            "title_similarity": "0.46503025",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1iqyqc",
            "score": -1,
            "text": "Buzzfeed is trash. Who is upvoting this garbage?",
            "title_similarity": "0.44421068",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1g0mtm",
            "score": 12,
            "text": "I had this discussion today about buzzfeed being brilliant about 7 years ago and how it's news part was bringing back the good content.\n\nLet's hope they keep it up!",
            "title_similarity": "0.46041644",
            "sentiment_compound": 0.8718
        },
        {
            "id": "h1h0j8o",
            "score": -6,
            "text": "[removed]",
            "title_similarity": "-0.022555217"
        },
        {
            "id": "h1gftla",
            "score": 93,
            "text": "So westerners care about Muslims in China, but nowhere else apparently.",
            "title_similarity": "0.570657",
            "sentiment_compound": 0.3047
        },
        {
            "id": "h1fs116",
            "score": -16,
            "text": "BuzzFeed getting a pulitzer, what a fuckin' world we live in.",
            "title_similarity": "0.5467236",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1fvuj8",
            "score": -4,
            "text": "And the Pulitzer prize for best weird eating challenge goes to...",
            "title_similarity": "0.54103434",
            "sentiment_compound": 0.7964
        },
        {
            "id": "h1g0wsn",
            "score": -4,
            "text": "Buzzfeed is trash",
            "title_similarity": "0.34525543",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1g9xzx",
            "score": 3,
            "text": "ITT: Comedic geniuses posting 'hilarious' Buzzfeed clickbait headlines. We get it.",
            "title_similarity": "0.4239633",
            "sentiment_compound": 0.6597
        },
        {
            "id": "h1gy63d",
            "score": -4,
            "text": "After the west invading multiple Muslim countries this past 20 years and letting Israel commit genocide in Palestine does anyone really believe that the west care about Muslims in China?! 😂😂😂😂😂😂",
            "title_similarity": "0.753983",
            "sentiment_compound": 0.9686
        },
        {
            "id": "h1fy1t4",
            "score": -9,
            "text": "Throw enough shit against the wall and eventually some will stick.",
            "title_similarity": "0.25409263",
            "sentiment_compound": -0.5574
        },
        {
            "id": "h1g6sxg",
            "score": 5,
            "text": "“What kind of detained Muslim are you? Take our quiz and find out which!”",
            "title_similarity": "0.5075122",
            "sentiment_compound": -0.5081
        },
        {
            "id": "h1g6uuy",
            "score": 140,
            "text": "11 Reasons Why BuzzFeed News Deserves This Pulitzer! Number five will shock you!",
            "title_similarity": "0.59440005",
            "sentiment_compound": -0.4374
        },
        {
            "id": "h1g27pi",
            "score": 4,
            "text": "Never thought I'd see something BuzzFeed related win a prize",
            "title_similarity": "0.35486898",
            "sentiment_compound": 0.7964
        },
        {
            "id": "h1g3dft",
            "score": -1,
            "text": "Buttfeed",
            "title_similarity": "0.09085588",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1g4llt",
            "score": 2,
            "text": "buzzfeed need to rebrand and stop the clickbait fake bullshit.  \nthey are doing some good but the name has stigma attached to it.",
            "title_similarity": "0.4833831",
            "sentiment_compound": -0.4767
        },
        {
            "id": "h1g6sxf",
            "score": 2,
            "text": "More like ButtFeed amiright?",
            "title_similarity": "0.09770799",
            "sentiment_compound": 0.4201
        },
        {
            "id": "h1g8ik4",
            "score": 2,
            "text": "I'm poor otherwise I would give all my tokens to this cause. I'm not supporting the U.S. but fuck China",
            "title_similarity": "0.63367045",
            "sentiment_compound": -0.8178
        },
        {
            "id": "h1gfh71",
            "score": 2,
            "text": "10 Things China doesn’t want you to know",
            "title_similarity": "0.3981947",
            "sentiment_compound": 0.0772
        },
        {
            "id": "h1gfkax",
            "score": -3,
            "text": "So buzzfeed news stole some post on reddit and they got a Pulitzer for it?",
            "title_similarity": "0.7679379",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1gri2s",
            "score": 4,
            "text": "I’m really really proud that their headquarters aren’t too far from where I live. They started out as an internet fluff-writing site; then stepped up during the Trump years when few other sources would. Good work and well done!!",
            "title_similarity": "0.46768814",
            "sentiment_compound": 0.8502
        },
        {
            "id": "h1guag2",
            "score": -1,
            "text": "this wasn’t groundbreaking journalism. It was pandering to unread American idiots to drive up the China hate. We’ve known how to tame a populace with internment camps from the Americans, from its founding till 2011 in Florida. Hear of the 215 bodies in Canada?. So stop pointing fingers. Very true to your brand buzfeed. Pander it bitch.",
            "title_similarity": "0.7136251",
            "sentiment_compound": -0.806
        },
        {
            "id": "h1gyq96",
            "score": -2,
            "text": "Nope. I will never recognize them as a legitimate news source. They are an embarrassment.",
            "title_similarity": "0.30474585",
            "sentiment_compound": -0.4404
        },
        {
            "id": "h1h8nl9",
            "score": -2,
            "text": "She won a Pulitzer for interviewing \"exiles\" and for standing outside a gate looking in.\n\nAre you F'king kidding me?\n\nShe even cites Zenz, FFS.",
            "title_similarity": "0.6334867",
            "sentiment_compound": -0.1111
        },
        {
            "id": "h1hftr9",
            "score": 3,
            "text": "They can win 100 pulitzers and I won’t change my mind about their reporting. I don’t trust their integrity.",
            "title_similarity": "0.46651527",
            "sentiment_compound": 0.8658
        },
        {
            "id": "h1gdb3z",
            "score": 11,
            "text": "And what has anybody done with such knowledge of these camps? \n\n\nNothing.",
            "title_similarity": "0.19940266",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1gdpvz",
            "score": 8,
            "text": "Bruh people in this thread really complaining huh. But they don’t even know that media corps need to adapt in today’s modern society to actually do the real investigative work. If you have more than 2 brains cells you’ll be able pick out the good stuff from the bad stuff. It’s a necessary evil.",
            "title_similarity": "0.5214423",
            "sentiment_compound": -0.8607
        },
        {
            "id": "h1fwn49",
            "score": -16,
            "text": "Ha ha ha Buzzfeed. What a bag of wank.",
            "title_similarity": "0.29773015",
            "sentiment_compound": 0.7351
        },
        {
            "id": "h1g9u9q",
            "score": 4,
            "text": "You know what, good job Buzzfeed",
            "title_similarity": "0.21349578",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h1g2iis",
            "score": 3,
            "text": "I mean at least buzzfeed news is doing real journalism because what’s going on is awful",
            "title_similarity": "0.547747",
            "sentiment_compound": -0.4588
        },
        {
            "id": "h1g2sjd",
            "score": 5,
            "text": "The Journalist’s father’s amazing reaction:\n\nhttps://twitter.com/meghara/status/1403436259385688070?s=21",
            "title_similarity": "0.5340642",
            "sentiment_compound": 0.5859
        },
        {
            "id": "h1g3ybv",
            "score": -2,
            "text": "Who gives a fuck",
            "title_similarity": "0.008502493",
            "sentiment_compound": -0.5423
        },
        {
            "id": "h1g7d3i",
            "score": -3,
            "text": "But it only against one tribe of Muslims not all Muslims with the largest group being left alone.\nThe tribe being oppressed is because some of it went extremist and did terrorist acts.\nJust like Burma the group punishment is wrong but Muslim extremist attacks started it.\nWe must always be clear this more a war against an ethnic group in China not Muslims as a whole.\nThis does not make China’s actions Ok but it important to be accurate. It it slants the news when you fail to repeat the cause extremism in groups that are recruited by Muslims but don’t follow the main of the religion",
            "title_similarity": "0.66668546",
            "sentiment_compound": -0.9824
        },
        {
            "id": "h1g8w19",
            "score": -3,
            "text": "Aren't these the same guys who pushed the Russian collusion lie? Aren't they the guys who claimed Trump asked Cohen to lie, a story so egregiously wrong that Mueller had to issue a special statement refuting it? THAT Buzzfeed?\n\nAnd didn't CNN get a Pulitzer for a very detailed, meticulously sourced story that was completely false? THAT Pulitzer?\n\nAnd this is the top story on the front page of Reddit. My oh my.",
            "title_similarity": "0.73983586",
            "sentiment_compound": 0.269
        },
        {
            "id": "h1gaq1y",
            "score": 4,
            "text": "Nice way of saying genocide but okay.",
            "title_similarity": "0.32163006",
            "sentiment_compound": 0.3291
        },
        {
            "id": "h1gar15",
            "score": -4,
            "text": "This news says more about Pulitzer than BuzzFeed",
            "title_similarity": "0.48918557",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1gaxmx",
            "score": -3,
            "text": "Haha wtf",
            "title_similarity": "-0.051645193",
            "sentiment_compound": -0.2023
        },
        {
            "id": "h1gcdut",
            "score": -2,
            "text": "How low the Pulitzer goes. Let me guess. They exposed it but it was a click bait article that took clicking next 20 times to get the payoff.",
            "title_similarity": "0.5616506",
            "sentiment_compound": -0.1779
        },
        {
            "id": "h1gdafk",
            "score": -4,
            "text": "Buzzfeed news by their own standards is contributing to anti asian hate with this reporting",
            "title_similarity": "0.65680075",
            "sentiment_compound": -0.7184
        },
        {
            "id": "h1gpwbd",
            "score": 5,
            "text": "“Where’d you read that, Buzzfeed?”\n\nAn insult 5 years ago.",
            "title_similarity": "0.48475957",
            "sentiment_compound": -0.5106
        },
        {
            "id": "h1gy09j",
            "score": -1,
            "text": "Who reports on your own pulitzer prize? Thats like playing smell the finger with yourself...",
            "title_similarity": "0.55285937",
            "sentiment_compound": 0.765
        },
        {
            "id": "h1h10iu",
            "score": -3,
            "text": "Send some BLM white girls over there to protest and hold up Chinese traffic.",
            "title_similarity": "0.6168603",
            "sentiment_compound": -0.25
        },
        {
            "id": "h1h8qo2",
            "score": -5,
            "text": "Buzz feed lmao. They’ll give Pulitzer’s out to anyone nowadays. Roy Pulitzer would be turning in his grave.",
            "title_similarity": "0.48030445",
            "sentiment_compound": 0.3182
        },
        {
            "id": "h1hczog",
            "score": 2,
            "text": "[deleted]",
            "title_similarity": "0.027378835"
        },
        {
            "id": "h1g5v7h",
            "score": -7,
            "text": "The girl who filmed George Floyd's arrest with biased commentary who fanned the flames and went on to witness against the police involved with dire negative implications for national security, independent judiciary and due process, got the prize as well. Another verification that this prize means close to nothing.\n\nMany reports about the situation in China isn't fully corroborated or confirmed either from what I've seen. I presume that is true regarding Buzzfeed too considering their frequent click bait articles, retractions of their publications, and poor journalistic track record.",
            "title_similarity": "0.72874904",
            "sentiment_compound": 0.0451
        },
        {
            "id": "h1fz5r8",
            "score": -13,
            "text": "They didn't expose it first, people said it for years and when the bioweapon level 4 lab Wuhan theory came about it was more prominent.\n\nUnfortunately people were overdosing on a 1st world police problem and Trump so China torturing people wasn't big enough for the twitter like crew.\n\nStill credit to buzzeed but it just shows how much people are led and need to be told what to do\n\n\nEdit: Bush and Obama are war criminals send it send in those downvotes I'll wait Buzzeed exposed the 21st century concentration camps not the mainstream media.",
            "title_similarity": "0.7077221",
            "sentiment_compound": -0.9275
        },
        {
            "id": "h1futr0",
            "score": 61,
            "text": "Better than anything owned by Murdoch.",
            "title_similarity": "0.20094585",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h1g9vq0",
            "score": 6,
            "text": "Cool cool. Now let's do something about it.",
            "title_similarity": "-0.029599398",
            "sentiment_compound": 0.5574
        },
        {
            "id": "h1g1x6y",
            "score": -5,
            "text": "Unfortunately there are many like me that see buzzfeed and just correlate the name to sjw grifters",
            "title_similarity": "0.2896706",
            "sentiment_compound": 0.0258
        },
        {
            "id": "h1g3cmm",
            "score": 0,
            "text": "Can we get a comment from Lebron James on the matter?",
            "title_similarity": "0.23380844",
            "sentiment_compound": 0.0258
        },
        {
            "id": "h1g6rw9",
            "score": 0,
            "text": "Only kids from the 90s will recognize these human rights violations and symptoms of genocide!",
            "title_similarity": "0.5492006",
            "sentiment_compound": -0.5707
        },
        {
            "id": "h1g87kd",
            "score": 5,
            "text": "Where’s lebron James for this crisis?",
            "title_similarity": "0.2772519",
            "sentiment_compound": -0.7073
        },
        {
            "id": "h1g8bug",
            "score": 0,
            "text": "Ok, but why is there a picture of Meghan Markle next to Karen and a convict?",
            "title_similarity": "0.368531",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1g98hl",
            "score": -4,
            "text": "Buzzfeed will always be cancer no matter how many awards they win. They could win an award for curing cancer and still be cancer.",
            "title_similarity": "0.5241531",
            "sentiment_compound": -0.0449
        },
        {
            "id": "h1g9udr",
            "score": 0,
            "text": "Also “10 ten tweets from parent that just OWNED their children!!”",
            "title_similarity": "0.4280617",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1gad9b",
            "score": 0,
            "text": "“Take this quiz to see which dictator you are!”",
            "title_similarity": "0.3850748",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1gay4u",
            "score": 0,
            "text": "i skip over everything buzzfeed related.\n\n&#x200B;\n\nhowever i enjoyed their Unsolved and Ghost shows tho. pretty entertaining.",
            "title_similarity": "0.3788135",
            "sentiment_compound": 0.7964
        },
        {
            "id": "h1gbwhz",
            "score": 0,
            "text": "https://instagram.com/tarasmazuroff",
            "title_similarity": "0.15709385",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1gc0vn",
            "score": -5,
            "text": "They give out pullitzers for lying and working for the cia? wow!",
            "title_similarity": "0.60859",
            "sentiment_compound": 0.1759
        },
        {
            "id": "h1gczs3",
            "score": -5,
            "text": "The standards for getting a Pulitzer prize must have really dropped if buzzfeed got one.",
            "title_similarity": "0.53983784",
            "sentiment_compound": 0.5106
        },
        {
            "id": "h1ge71i",
            "score": 0,
            "text": "Top 27 reasons why China is not chill, bruh.",
            "title_similarity": "0.43278405",
            "sentiment_compound": 0.2023
        },
        {
            "id": "h1ge846",
            "score": 0,
            "text": "Fizzy Bang Bang Newsy News",
            "title_similarity": "0.33559147",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1gfgzw",
            "score": 0,
            "text": "What about the Wuhan Virology Lab leaks?",
            "title_similarity": "0.4854577",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1ghfeg",
            "score": 0,
            "text": "hahahahahahahahahah",
            "title_similarity": "-0.04821783",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1ghzt4",
            "score": 0,
            "text": "Buzz Lightnews",
            "title_similarity": "0.13161583",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1gi67q",
            "score": 0,
            "text": "Fuck China!",
            "title_similarity": "0.43505877",
            "sentiment_compound": -0.5848
        },
        {
            "id": "h1giwxi",
            "score": 0,
            "text": "Someone got an award about writing about genocide at the exact same time nothing has been done about the genocide! Good job at writing I guess. Yay for happiness.",
            "title_similarity": "0.5822119",
            "sentiment_compound": 0.9286
        },
        {
            "id": "h1giy83",
            "score": 0,
            "text": "Did they get the info from Reddit?",
            "title_similarity": "0.39487007",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1gj224",
            "score": 0,
            "text": "The first (and probably last) time buzzfeed has ever done anything useful",
            "title_similarity": "0.3383736",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h1gj22h",
            "score": 0,
            "text": "I won't believe it until I see real footage because the west got their propaganda... ( everyone nation got their own propaganda)",
            "title_similarity": "0.49004903",
            "sentiment_compound": -0.4588
        },
        {
            "id": "h1gkbay",
            "score": 0,
            "text": "This is from The Onion, right?!?",
            "title_similarity": "0.17934793",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1gkj1t",
            "score": 0,
            "text": "Ah, BuzzFeed, the reputable award-winning news source",
            "title_similarity": "0.49507862",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1gklla",
            "score": 0,
            "text": "Which Pulitzer winning buzzfeed journalist are you? Take this quiz to find out",
            "title_similarity": "0.5833976",
            "sentiment_compound": 0.5267
        },
        {
            "id": "h1gko1v",
            "score": 0,
            "text": "10 reasons you wouldn't believe BuzzFeed does real journalism",
            "title_similarity": "0.46128958",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1gl3xg",
            "score": 0,
            "text": "They’ve come along way from the bogus Steele Dossier report in 2016",
            "title_similarity": "0.32370847",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1glcrd",
            "score": 0,
            "text": "10 reasons the owners of buzzfeed dont really give a shit about Pulitzers.",
            "title_similarity": "0.4568851",
            "sentiment_compound": -0.5945
        },
        {
            "id": "h1glh9l",
            "score": 0,
            "text": "Did BuzzFeed write their own news article about a fake Pulitzer that they won?",
            "title_similarity": "0.7239177",
            "sentiment_compound": 0.1531
        },
        {
            "id": "h1gljgr",
            "score": 0,
            "text": "Okay now take on the surge in funding to I.C.E under Biden and our plans to use immigrant detainees as SLAVE LABOR as they're farmed out to the for profit prison system IN THE US. \n\nEasy to criticize China lets see them touch the obvious disgusting actions taking place in our own country.",
            "title_similarity": "0.70714974",
            "sentiment_compound": -0.3818
        },
        {
            "id": "h1gmfxh",
            "score": 0,
            "text": "Ah, something BuzzFeed has done right in years",
            "title_similarity": "0.17796165",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1gmv1l",
            "score": 0,
            "text": "Yeah I’m still not taking them seriously.",
            "title_similarity": "-0.056377694",
            "sentiment_compound": 0.4055
        },
        {
            "id": "h1gnl0x",
            "score": 0,
            "text": "Still Buttfeed",
            "title_similarity": "0.0048127435",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1gpdvg",
            "score": 0,
            "text": "10 ways the corrupt chinese dictatorship is getting away with large scale genocide - and why the rest of the world is letting them  rape sterilised women! \n\nNumber 3 will shock you!",
            "title_similarity": "0.72531086",
            "sentiment_compound": -0.8217
        },
        {
            "id": "h1gpyp7",
            "score": 4,
            "text": "Taiwan is a country fuckers",
            "title_similarity": "0.42405313",
            "sentiment_compound": -0.5994
        },
        {
            "id": "h1gr6bs",
            "score": 0,
            "text": "BuzzFeed news is basically patting itself on the back with this article lol.\n\nGood for them though it's great to have actual hard hitting journalism for once from a company known to be shitty in it's larger branch",
            "title_similarity": "0.59199035",
            "sentiment_compound": 0.7003
        },
        {
            "id": "h1gra4o",
            "score": 0,
            "text": "Well you know the US did a bad thing that time remember? \n\nbecause it’s impossible to look at two bad things at once",
            "title_similarity": "0.35206938",
            "sentiment_compound": -0.7096
        },
        {
            "id": "h1grdyv",
            "score": 0,
            "text": "This has been going on for years. How long does it take to write an article for BUZZFEED?",
            "title_similarity": "0.4041731",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1gsf8h",
            "score": 0,
            "text": "Permanent Xi man good\n\nTemporary Biden man bad",
            "title_similarity": "0.29342365",
            "sentiment_compound": -0.1531
        },
        {
            "id": "h1gtv6k",
            "score": 0,
            "text": "Buzz feed didn’t do squat…. China has been killing Uygher Muslims for years. Buzzfeed just want to take credit.",
            "title_similarity": "0.7818147",
            "sentiment_compound": -0.3612
        },
        {
            "id": "h1gwo9p",
            "score": 0,
            "text": "Hold on, buzz feed is becoming a legit news source? What fucking year is it? Where am I?",
            "title_similarity": "0.50872743",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1h1ieg",
            "score": 0,
            "text": "I am really happy for them.",
            "title_similarity": "-0.029118849",
            "sentiment_compound": 0.6115
        },
        {
            "id": "h1h1sws",
            "score": 0,
            "text": "Who cares, the buzzfeed name is shit",
            "title_similarity": "0.29321352",
            "sentiment_compound": -0.1531
        },
        {
            "id": "h1h7807",
            "score": 0,
            "text": "What? We knew about Uligurs for years. This was just copy pasta.",
            "title_similarity": "0.37529454",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1h91nq",
            "score": 0,
            "text": "Yay, they’re exposed! That’ll stop em!",
            "title_similarity": "0.2301437",
            "sentiment_compound": 0.3578
        },
        {
            "id": "h1hawvq",
            "score": 0,
            "text": "Farts",
            "title_similarity": "0.039848335",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1hb3k6",
            "score": 0,
            "text": "Ok. So now you exposed them. So what's going to happen? Absolutely nothing.",
            "title_similarity": "0.14005578",
            "sentiment_compound": -0.144
        },
        {
            "id": "h1hc4s0",
            "score": 0,
            "text": "Congratulations!\nNow it will be amazing to see what is going to be happen after this expose...",
            "title_similarity": "0.30670106",
            "sentiment_compound": 0.8043
        },
        {
            "id": "h1hcc9d",
            "score": 0,
            "text": "Buzzfeed bad! China good! Americans stupid!",
            "title_similarity": "0.568184",
            "sentiment_compound": -0.7074
        },
        {
            "id": "h1hcmaz",
            "score": 0,
            "text": "Wat",
            "title_similarity": "-0.074386746",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1he3lb",
            "score": 0,
            "text": "Shut hell up butt feed",
            "title_similarity": "0.15280738",
            "sentiment_compound": -0.6808
        },
        {
            "id": "h1hejlm",
            "score": 0,
            "text": "Lmao!",
            "title_similarity": "-0.015984904",
            "sentiment_compound": 0.636
        },
        {
            "id": "h1hfad7",
            "score": 0,
            "text": "🤡",
            "title_similarity": "-0.090968825",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1hfi12",
            "score": 0,
            "text": "They actually wrote a legit article??",
            "title_similarity": "0.35792878",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1hfnum",
            "score": 0,
            "text": "\"How to tell one if your writers is over qualified\"",
            "title_similarity": "0.2777971",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1hh9vk",
            "score": 0,
            "text": "Except this article. Buzz feed is useless.",
            "title_similarity": "0.21174423",
            "sentiment_compound": -0.4215
        },
        {
            "id": "h1hl3on",
            "score": 0,
            "text": "Wow.  I expected the Onion to win one before buzzfeed.",
            "title_similarity": "0.41600847",
            "sentiment_compound": 0.8225
        },
        {
            "id": "h1hmh9a",
            "score": 0,
            "text": "https://youtu.be/NQglZPVmoo8\n\nYou mean the same buzzfeed who does shit like this 90% of the time?\n\nI'm sorry but 😂😂😂",
            "title_similarity": "0.42643252",
            "sentiment_compound": 0.8968
        },
        {
            "id": "h1hnkfd",
            "score": 0,
            "text": "wait. maybe they're not so bad after all",
            "title_similarity": "-0.0006272737",
            "sentiment_compound": 0.5549
        },
        {
            "id": "h1hnodf",
            "score": 0,
            "text": "10 things that could win you a Pulitzer. \n\n1. Vulture ..",
            "title_similarity": "0.36856535",
            "sentiment_compound": 0.2023
        },
        {
            "id": "h1hosjx",
            "score": 0,
            "text": "Hasn't this been out in the open for damn near a decade?\n\nI'm glad it's finally catching some attention, and it's awesome they did an in depth analysis.\n\nIt just makes me really sad that it's only happening now.\n\nBut good job buzz feed, and I mean that genuinely.",
            "title_similarity": "0.44952387",
            "sentiment_compound": 0.6546
        },
        {
            "id": "h1hqbns",
            "score": 0,
            "text": "They finally did something",
            "title_similarity": "-0.025092196",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1hrspm",
            "score": 0,
            "text": "BuzzFeed does something good, wow what timeline is this?",
            "title_similarity": "0.21714523",
            "sentiment_compound": 0.7717
        },
        {
            "id": "h1hrsyf",
            "score": 0,
            "text": "Meh. Buzzfeed isn't even news. It's more of an entertainment than actual news",
            "title_similarity": "0.30160815",
            "sentiment_compound": 0.4144
        },
        {
            "id": "h1hs7jr",
            "score": 0,
            "text": "Thats so amazing to hear",
            "title_similarity": "-0.024249231",
            "sentiment_compound": 0.624
        },
        {
            "id": "h1ht3ai",
            "score": 0,
            "text": "Its unfortunate that it's bizzfeed, but I'm glad it happened",
            "title_similarity": "0.24837133",
            "sentiment_compound": 0.4588
        },
        {
            "id": "h1hv05v",
            "score": 0,
            "text": "Buzzfeed news farted in my mouth",
            "title_similarity": "0.36579126",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1hvdj8",
            "score": 0,
            "text": "Exposing?\n\nSo... The YouTube videos I watched over a year ago didn't exist?\n\nWow! Congrats. Holocaust V2 IS STILL HAPPENING. but congrats on a fucking prize",
            "title_similarity": "0.5410247",
            "sentiment_compound": 0.8256
        },
        {
            "id": "h1hwcpc",
            "score": 0,
            "text": "Literally everyone knows about China's genocide\nAnd the one company that gets a useless reward is BuzzFeed of all things",
            "title_similarity": "0.7128115",
            "sentiment_compound": 0.2263
        },
        {
            "id": "h1hwpgq",
            "score": 0,
            "text": "Human only counts when is china right..? .not the killing of children and women by Israel in palestine....",
            "title_similarity": "0.57362133",
            "sentiment_compound": 0.5448
        },
        {
            "id": "h1hxynb",
            "score": 0,
            "text": "Gross",
            "title_similarity": "-0.031361572",
            "sentiment_compound": -0.4767
        },
        {
            "id": "h1i2hll",
            "score": 0,
            "text": "They weren’t even the first ones to break the story. Wth is going on here?",
            "title_similarity": "0.24651551",
            "sentiment_compound": -0.5267
        },
        {
            "id": "h1i3b3y",
            "score": 0,
            "text": "Another sign showing we are at our end…",
            "title_similarity": "0.011170417",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1i40vl",
            "score": 0,
            "text": "its been known for quite some time... but okei.",
            "title_similarity": "0.0692067",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1i4lm4",
            "score": 0,
            "text": "We live in the darkest timeline",
            "title_similarity": "0.20918903",
            "sentiment_compound": -0.4939
        },
        {
            "id": "h1i6dg2",
            "score": 0,
            "text": "Also on Buzzfeed: Top 10 restaurants to take Pulitzer judges to.",
            "title_similarity": "0.49822134",
            "sentiment_compound": 0.2023
        },
        {
            "id": "h1i6jn9",
            "score": 0,
            "text": "Too bad they are still a news site and their survival depends on getting clicks and views just like everyone else",
            "title_similarity": "0.4354487",
            "sentiment_compound": -0.25
        },
        {
            "id": "h1j6z9k",
            "score": 0,
            "text": "And next week in upside-down land......",
            "title_similarity": "0.14888355",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1j9205",
            "score": 0,
            "text": "https://youtu.be/ijjtiDJi910",
            "title_similarity": "0.035862274",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3y42x6",
            "score": 0,
            "text": "WTF WRONG WITH YOU THEY JUST WRITED OVER FROM REALLY COURAGES PEOPLE SPEAKING UP FOR YEARS NOW WHAT WRONG WITH YOU ALL. BUTTNEWS CAUSE THEYASSHOOOOEEE",
            "title_similarity": "0.48000762",
            "sentiment_compound": -0.875
        },
        {
            "id": "h1glbcp",
            "score": 11,
            "text": "I wonder if there's gonna be another wave of anti-buzzfeed memes which show fake headlines and dumbass punchlines like \"Reddit, time for a crusade\" or some other dumb shit from Totally Real and Not At All Astroturfed people, like the last time Buzzfeed news made a damning expose on a controversial issue.",
            "title_similarity": "0.6487922",
            "sentiment_compound": -0.9246
        },
        {
            "id": "h1gcnqq",
            "score": 6,
            "text": "The investigative journalism of BuzzFeed is pretty kickass! \n\nHeck, investigative journalism of almost *any* publication is pretty impressive.",
            "title_similarity": "0.5632016",
            "sentiment_compound": 0.8748
        },
        {
            "id": "h1gbcyb",
            "score": 58,
            "text": "ITT: People trashing their perceived reputation of buzzfeed and talking about how they abuse baitclicky titles, while they type on reddit of all places.",
            "title_similarity": "0.62019575",
            "sentiment_compound": -0.6369
        },
        {
            "id": "h1ftdc8",
            "score": -28,
            "text": "If Buzzfeed is winning awards you know journalism is aaaaaaall the way dead.",
            "title_similarity": "0.5532713",
            "sentiment_compound": 0.2732
        },
        {
            "id": "h1g6y6l",
            "score": 11,
            "text": "BuzzFeed News also has a great article about the UAE hiring a US Mercenary team to carry out assassinations of politicians in Yemen [link to article ](https://www.buzzfeednews.com/article/aramroston/mercenaries-assassination-us-yemen-uae-spear-golan-dahlan)",
            "title_similarity": "0.67747617",
            "sentiment_compound": 0.1027
        },
        {
            "id": "h1g7xpl",
            "score": 6,
            "text": "Not bad, \nBuzzfeed, not bad",
            "title_similarity": "0.0920596",
            "sentiment_compound": 0.6908
        },
        {
            "id": "h1g1h5b",
            "score": 2,
            "text": "Fucking props to them. It's about time someone did something.",
            "title_similarity": "0.14814827",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1g1ped",
            "score": 1,
            "text": "Well between that and the quiz to find out what type of garlic bread I am, it’s good that China gets the spotlight for the wrong reason. Hopefully someone will actually do something about it",
            "title_similarity": "0.5794548",
            "sentiment_compound": 0.5574
        },
        {
            "id": "h1g2eiq",
            "score": 1,
            "text": "Only because the political needs",
            "title_similarity": "0.19050008",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1g2v9t",
            "score": 1,
            "text": "Damn, I wonder how much they're gonna milk this moving on in the future.",
            "title_similarity": "0.217801",
            "sentiment_compound": -0.4019
        },
        {
            "id": "h1g36xj",
            "score": -1,
            "text": "Buzzfeed is like Bing. Not gonna happen.",
            "title_similarity": "0.24776137",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h1g37x8",
            "score": -1,
            "text": "BuzzFeed didn’t win shit. The writers won.",
            "title_similarity": "0.35688555",
            "sentiment_compound": 0.5994
        },
        {
            "id": "h1g3u2f",
            "score": -1,
            "text": "The company that loves making lists about obnoxious shit won a Pulitzer?",
            "title_similarity": "0.62227345",
            "sentiment_compound": 0.2023
        },
        {
            "id": "h1g3xe7",
            "score": -1,
            "text": "BuzzFeed, the king of Clickbait, out here winning a Pulitzer Prize. Love this redemption arc.",
            "title_similarity": "0.54291964",
            "sentiment_compound": 0.8979
        },
        {
            "id": "h1g4afv",
            "score": -1,
            "text": "Quick, Buzzfeed! Now do blacks in the USA",
            "title_similarity": "0.44015193",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1g6p01",
            "score": -1,
            "text": "No. 5 really DID make our jaws drop!",
            "title_similarity": "0.28950712",
            "sentiment_compound": -0.3382
        },
        {
            "id": "h1g6sfi",
            "score": -1,
            "text": "r/nottheonion. Imagine telling someone a few years ago that the tabloid site thats constantly posting celeb and zoomer nonsense would actually post news. This is the equivalent of the national enquirier suddenly becoming time magazine",
            "title_similarity": "0.6049498",
            "sentiment_compound": -0.4019
        },
        {
            "id": "h1g78hw",
            "score": -1,
            "text": "buzzfeed is synonymous with hot garbage this must be a buzz feed article saying they won it lol",
            "title_similarity": "0.51606846",
            "sentiment_compound": 0.7579
        },
        {
            "id": "h1g7a56",
            "score": -1,
            "text": "I think I saw this one on Facebook.\n\n“Fourteen things China doesn’t want you to know about what it does to Muslims.  Number 9 will shock you.”",
            "title_similarity": "0.67984235",
            "sentiment_compound": -0.25
        },
        {
            "id": "h1g7fdk",
            "score": -1,
            "text": "Buzzed, we feed your nudes.",
            "title_similarity": "0.3973634",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1g7nfd",
            "score": -1,
            "text": "Oh no, now they might start thinking people should take them seriously...",
            "title_similarity": "0.090117335",
            "sentiment_compound": -0.1779
        },
        {
            "id": "h1g8lj0",
            "score": -1,
            "text": "Now do Israel",
            "title_similarity": "0.084478036",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1g8uu5",
            "score": -1,
            "text": "I would have never expected to see the words \"Buzzfeed\" and \"Pulitzer\" in the same sentence.",
            "title_similarity": "0.47207206",
            "sentiment_compound": 0.0772
        },
        {
            "id": "h1g9e6m",
            "score": -1,
            "text": "https://ekhlaseacademy.blogspot.com/2021/06/Benefits%20-%20omega%203%20-%20children.html",
            "title_similarity": "0.25681597",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1g9jz6",
            "score": 1,
            "text": "Ok but can we still hate on huffington post?",
            "title_similarity": "0.4066291",
            "sentiment_compound": -0.6652
        },
        {
            "id": "h1g9kyy",
            "score": -1,
            "text": "Haha Poolitzer",
            "title_similarity": "0.03689523",
            "sentiment_compound": 0.4588
        },
        {
            "id": "h1ga99v",
            "score": 1,
            "text": "Did anyone have \"Buzzfeed doing something useful\" on the 2021 bingo? Yeah me either....",
            "title_similarity": "0.37421003",
            "sentiment_compound": 0.6249
        },
        {
            "id": "h1gaanl",
            "score": -1,
            "text": "What world do we live in where Buzzfeed is a credible news source?",
            "title_similarity": "0.44238257",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1gade8",
            "score": 1,
            "text": "“Top 10 Signs You May Have Won a Pulitzer, and Why that’s Problematic”",
            "title_similarity": "0.45050442",
            "sentiment_compound": 0.5719
        },
        {
            "id": "h1gag9x",
            "score": -1,
            "text": "10 things you wouldn't believe happen in China!",
            "title_similarity": "0.47410595",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1gak3s",
            "score": 1,
            "text": "People still having a hard time dropping that confirmation bias.",
            "title_similarity": "0.15379342",
            "sentiment_compound": -0.2023
        },
        {
            "id": "h1gak9g",
            "score": 1,
            "text": "社会信用体系 is all that needs to be said about the comments",
            "title_similarity": "0.3126013",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1ganjg",
            "score": -1,
            "text": "now you know it's rigged.\n\ni'm not saying what china is doing to the muslims isn't horrible.  i'm not saying the reporting isn't good.\n\ni am saying that pretending western governments, (who until very recently have been bombing the fuck out of muslims abroad, and persecuting and stigmatizing Islam  at home)  give a shit about what china does to muslims, is very naive indeed.",
            "title_similarity": "0.71431255",
            "sentiment_compound": -0.9127
        },
        {
            "id": "h1gaohx",
            "score": 1,
            "text": "When BuzzFeed does a better job than you, do better.",
            "title_similarity": "0.3048281",
            "sentiment_compound": 0.7003
        },
        {
            "id": "h1gb4kd",
            "score": 1,
            "text": "And nothing is going to happen to the PRC",
            "title_similarity": "0.15749222",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1gb96r",
            "score": -1,
            "text": "BuzzFeed news is new news to me.",
            "title_similarity": "0.35090232",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1gbrak",
            "score": 1,
            "text": "How a shock news site win a Pulitzer!\n\nNumber three will blow your mind!",
            "title_similarity": "0.6246791",
            "sentiment_compound": 0.4738
        },
        {
            "id": "h1gbvnm",
            "score": -1,
            "text": "I'm very conflicted and confused. My entire knowledge of buzzfeed is them being a laughing stock. Its like the equivalent on The Sun newspaper in the UK putting a thought provoking and factual piece on the economy right next to their 16 year old page 3 girl then winning a prize for it.",
            "title_similarity": "0.6514107",
            "sentiment_compound": 0.8417
        },
        {
            "id": "h1gbvrw",
            "score": -1,
            "text": "All these years, I thought Buzzfeed was a website for listicles on cat-related content.  Source: https://www.buzzfeed.com/mireyagonzalez/cats-doing-whatever-they-want-2019",
            "title_similarity": "0.3511728",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1gbvxz",
            "score": 1,
            "text": "You Won't Believe the Award We Just Won!",
            "title_similarity": "0.33216223",
            "sentiment_compound": 0.2828
        },
        {
            "id": "h1gc82u",
            "score": -1,
            "text": "When BuzzFeed starts winning Pulitzers because MSM is trash. r/ABoringDystopia",
            "title_similarity": "0.64384866",
            "sentiment_compound": 0.5267
        },
        {
            "id": "h1gc9h8",
            "score": 1,
            "text": "Hmm I coulda sworn they won their first Pulitzer prize after they helped thousands of people figure out which disney princess they were",
            "title_similarity": "0.54431903",
            "sentiment_compound": 0.7906
        },
        {
            "id": "h1gckq8",
            "score": 1,
            "text": "Top 10 way the Chinese are man spreading and Mansplaining to Muslim prisoner",
            "title_similarity": "0.6967822",
            "sentiment_compound": -0.4019
        },
        {
            "id": "h1gd672",
            "score": 1,
            "text": "Perhaps renaming this section of the company \"the buzz\" or something similarly derivative will help shake the reputation their predecessors have so carelessly created for them.",
            "title_similarity": "0.5309091",
            "sentiment_compound": 0.1685
        },
        {
            "id": "h1gddle",
            "score": -1,
            "text": "its like a tabloid and a broadsheet sensible and completely stupid, what kind of journalist are you if you are a fruit?",
            "title_similarity": "0.53256726",
            "sentiment_compound": -0.2944
        },
        {
            "id": "h1gdo6j",
            "score": -1,
            "text": "I wonder if The Greyzone will get a Nobel for debunking it?",
            "title_similarity": "0.45686015",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1gdqkq",
            "score": -1,
            "text": "Unfortunately we have a president who says the Uiyger situations is a cultural difference... [https://www.youtube.com/watch?v=6Uf\\_55lrJSg](https://www.youtube.com/watch?v=6Uf_55lrJSg) \n\nHe was talking big talk before he won the election though... but after he won he's calling it cultural differences...",
            "title_similarity": "0.5768424",
            "sentiment_compound": 0.7941
        },
        {
            "id": "h1gdrax",
            "score": -1,
            "text": "Nice to see them covering actual news and doing real journalism... Not \"How my boyfriend opening the door for me is toxic\" or similar.",
            "title_similarity": "0.5745776",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h1gdrum",
            "score": -1,
            "text": "Ok... but they didn’t expose it.",
            "title_similarity": "-0.07002401",
            "sentiment_compound": -0.2263
        },
        {
            "id": "h1gdwuw",
            "score": -1,
            "text": "Manufacture that consent.",
            "title_similarity": "0.0011322629",
            "sentiment_compound": 0.2263
        },
        {
            "id": "h1gdzg4",
            "score": 1,
            "text": "Imagine that.  Good journalism gets rewards for good journalism.  Happy for them.",
            "title_similarity": "0.27708465",
            "sentiment_compound": 0.9118
        },
        {
            "id": "h1gdzuf",
            "score": -1,
            "text": "...exposing? are you serious? this has been common knowledge in IR for over a decade. r/FreeTheUyghurs",
            "title_similarity": "0.4250684",
            "sentiment_compound": -0.4137
        },
        {
            "id": "h1ge8qe",
            "score": 1,
            "text": "Wait didn't we know about this for a very long time",
            "title_similarity": "0.15312502",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1geea4",
            "score": -1,
            "text": "BuzzFeed... Pulitzer Prize... we really live in the darkest timeline.",
            "title_similarity": "0.4527728",
            "sentiment_compound": 0.0258
        },
        {
            "id": "h1gejgu",
            "score": 1,
            "text": "Was the headline “oh my god, China is doing something you’ll never believe.  Here’s 10 questions to answer to find out how you feel!”",
            "title_similarity": "0.62724686",
            "sentiment_compound": 0.3382
        },
        {
            "id": "h1gettr",
            "score": -1,
            "text": "As if it expects to win a whole bunch of them in the future...",
            "title_similarity": "0.12286545",
            "sentiment_compound": 0.5859
        },
        {
            "id": "h1geusi",
            "score": 1,
            "text": "Oh I thought they won a Pulitzer before?",
            "title_similarity": "0.4856586",
            "sentiment_compound": 0.5719
        },
        {
            "id": "h1gf6pp",
            "score": -1,
            "text": "Fuck Buzzfeed.",
            "title_similarity": "0.2608426",
            "sentiment_compound": -0.5423
        },
        {
            "id": "h1gfi61",
            "score": -1,
            "text": "Did buzzfeed actually do something good for once? Holy shit",
            "title_similarity": "0.32951173",
            "sentiment_compound": -0.1779
        },
        {
            "id": "h1gfnfr",
            "score": -1,
            "text": "Buzzfeed.... did something useful?\n\nWhat. The. Hell.",
            "title_similarity": "0.24772006",
            "sentiment_compound": -0.4019
        },
        {
            "id": "h1gfpv1",
            "score": 1,
            "text": "Had no idea that BuzzFeed is legit.",
            "title_similarity": "0.28292468",
            "sentiment_compound": -0.296
        },
        {
            "id": "h1gfwit",
            "score": 1,
            "text": "BuzzFeed winning a Pulitzer is like Stephen Hawking winning a deadlift competition. It doesn't make any sense the first time you hear it and the more you say it the less sense it makes.",
            "title_similarity": "0.5991326",
            "sentiment_compound": 0.8519
        },
        {
            "id": "h1gfwwg",
            "score": 1,
            "text": "How is this a thing? Buzzfeed of all people? They only joined the bandwagon like 9 months ago, there have been actual journalists risking their lives to get articles together and some libA grad first year made a summary video in 8 hours and gets a Pulitzer? The bar has really dropped",
            "title_similarity": "0.6281345",
            "sentiment_compound": 0.1877
        },
        {
            "id": "h1gg1k4",
            "score": -1,
            "text": "I thought this was common knowledge. Did buzzfeed really expose it?",
            "title_similarity": "0.39670056",
            "sentiment_compound": -0.2247
        },
        {
            "id": "h1gg4uc",
            "score": 1,
            "text": "Buzzfeed News has some fantastic long-form journalism pieces. I will forever recommend, “The Ghosts of St. Joseph’s Catholic Orphanage” by Christine Kenneally",
            "title_similarity": "0.48158944",
            "sentiment_compound": 0.7269
        },
        {
            "id": "h1ggh20",
            "score": 1,
            "text": "Wow way to go buzzfeed.  Thank you for exposing the criminal china.",
            "title_similarity": "0.7467993",
            "sentiment_compound": 0.2023
        },
        {
            "id": "h1ggias",
            "score": 1,
            "text": "Can’t wait for buzzweed China quizzes",
            "title_similarity": "0.47926348",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1ggjnd",
            "score": 1,
            "text": "Was the article called “top ten ways to detain Muslims”",
            "title_similarity": "0.5021329",
            "sentiment_compound": -0.4215
        },
        {
            "id": "h1ggmq2",
            "score": 1,
            "text": "buzzfeed pulitzer? what world is this",
            "title_similarity": "0.4249028",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1ggnp7",
            "score": -1,
            "text": "Who'd they steal the story from?",
            "title_similarity": "0.38112614",
            "sentiment_compound": -0.4939
        },
        {
            "id": "h1ggvxp",
            "score": 1,
            "text": "BuzzFeed breaking important stories. This is the darkest timeline.",
            "title_similarity": "0.52390254",
            "sentiment_compound": -0.34
        },
        {
            "id": "h1ggwm7",
            "score": 1,
            "text": "First good thing Buzzfeed has done",
            "title_similarity": "0.27781945",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h1ghbbz",
            "score": -1,
            "text": "Ha ha ha. Buzzfeed. 🤡",
            "title_similarity": "0.24077195",
            "sentiment_compound": 0.5859
        },
        {
            "id": "h1ghdaf",
            "score": 1,
            "text": "Way to go Buzzfeed!👍",
            "title_similarity": "0.29295963",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1ghi69",
            "score": 1,
            "text": "Did it change anything?",
            "title_similarity": "-0.046433486",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1ghx4d",
            "score": -1,
            "text": "I for one am glad the adults are rounding up the children. Religion, not even once.",
            "title_similarity": "0.39324877",
            "sentiment_compound": 0.4588
        },
        {
            "id": "h1giuqo",
            "score": -1,
            "text": "I’ve seen many BuzzFeed “articles” just copy+paste Reddit comments… it’s an infinite loop. They broke the internet",
            "title_similarity": "0.5638846",
            "sentiment_compound": -0.4215
        },
        {
            "id": "h1givue",
            "score": 1,
            "text": "And to think people still vehemently deny that it’s even happening",
            "title_similarity": "0.1235258",
            "sentiment_compound": -0.34
        },
        {
            "id": "h1gklzb",
            "score": 1,
            "text": "Please don't let our trust in real journalism be replaced by sites like Buzzfeed.",
            "title_similarity": "0.45080322",
            "sentiment_compound": 0.2728
        },
        {
            "id": "h1gl4mm",
            "score": 1,
            "text": "Oh my god, how are neckbeards on YouTube going to cope?",
            "title_similarity": "0.35564667",
            "sentiment_compound": 0.2732
        },
        {
            "id": "h1gl6ev",
            "score": 1,
            "text": "Every year a very detailed worldwide report is posted from the USCIRF. It should get some more attention. Whether it be Muslim persecution in China, Jehovah’s Witness persecution in Russia, or Christian persecution in Iran, we as humanity around the world should know about it, rise up, build awareness, and do what we can.\n\nhttps://www.uscirf.gov\n\nhttps://www.uscirf.gov/annual-reports\n\nhttps://www.uscirf.gov/sites/default/files/2021-04/2021%20Annual%20Report_0.pdf",
            "title_similarity": "0.5447475",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1glmt7",
            "score": 1,
            "text": "They weren’t the first just the first in western media",
            "title_similarity": "0.2250285",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1glxbz",
            "score": 1,
            "text": "\"For detaining West Taiwanese\"",
            "title_similarity": "0.4344087",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1gmwbz",
            "score": 1,
            "text": "Reddit's resident CCP shills will have a tougher time spinning their usual denials in this thread.",
            "title_similarity": "0.48604146",
            "sentiment_compound": 0.1779
        },
        {
            "id": "h1gnb6c",
            "score": 1,
            "text": "Anybody else feels like the Pulitzer means less now that Buzzfeed has one?",
            "title_similarity": "0.43138048",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h1gnpoe",
            "score": 1,
            "text": "Is this Buzzfeed's masterplan? Churn out garbage media for profit to fund hard-hitting journalism that doesn't make a lot of money.",
            "title_similarity": "0.6275053",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h1go3iw",
            "score": 1,
            "text": "BuzzFeed reports news?",
            "title_similarity": "0.4155669",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1goa77",
            "score": 1,
            "text": "Not to make light of the situation, which is a modern-day Holocaust, but if you don't know anything about Uighur culture, just know that the food is absolutely bomb-tastic. Imagine Chinese food mixed with Middle Eastern food, e.g. noodles with a lamb/cumin broth. It was by far my favorite cuisine when I lived in China, even though what I had was probably watered down since I wasn't actually in Xinjiang. I hope those in power do something about this awful situation. It'll be something written in history books 50 years from now and our grandkids will wonder how we let it happen.",
            "title_similarity": "0.67728627",
            "sentiment_compound": 0.4767
        },
        {
            "id": "h1gothw",
            "score": 1,
            "text": "Cool. Now what?",
            "title_similarity": "-0.12792459",
            "sentiment_compound": 0.3182
        },
        {
            "id": "h1gpeew",
            "score": 1,
            "text": "All the crazy shit China does to its own people and the West draws a line at Muslims. Cool. I wonder what Saudi Arabia is up to as far as Human Rights...",
            "title_similarity": "0.718798",
            "sentiment_compound": -0.5719
        },
        {
            "id": "h1gpx4q",
            "score": 1,
            "text": "Thanks BuzzFeed 🙄",
            "title_similarity": "0.25891078",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h1gqlfy",
            "score": 1,
            "text": "About time. The conspiracy folks have only been talking for over a year about it with videos of the trains and everything. Fuck the news.",
            "title_similarity": "0.5265543",
            "sentiment_compound": -0.7845
        },
        {
            "id": "h1gqoxc",
            "score": 1,
            "text": "I've been saying it for years, but while the corporate side of BuzzFeed is full of clowns, there truly is some excellent journalism in Buzzfeed News.",
            "title_similarity": "0.50863105",
            "sentiment_compound": 0.872
        },
        {
            "id": "h1gqrzq",
            "score": -1,
            "text": "Wild how multiple cia fronts funded the article and were on the Pulitzer board lol",
            "title_similarity": "0.6119328",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h1grvtm",
            "score": 1,
            "text": "apple is ok with the uigher slave for making phones.",
            "title_similarity": "0.32639417",
            "sentiment_compound": 0.296
        },
        {
            "id": "h1grx2g",
            "score": 1,
            "text": "BuzzFeed's model of using clockbait junk media to finance a solid news team is pretty great",
            "title_similarity": "0.5810529",
            "sentiment_compound": 0.836
        },
        {
            "id": "h1gsvkt",
            "score": -1,
            "text": "I mean, if someone goes into a Muslim country and does the wrong thing they get detained or worse. Why is it only a problem if it happens to them???",
            "title_similarity": "0.47362798",
            "sentiment_compound": -0.903
        },
        {
            "id": "h1gt624",
            "score": 1,
            "text": "Next Buzzfeed article: \"You wouldn't believe the comments about this Buzzfeed post!\"",
            "title_similarity": "0.5817472",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1gtf3x",
            "score": 1,
            "text": "Damn well deserved",
            "title_similarity": "0.019556459",
            "sentiment_compound": -0.1531
        },
        {
            "id": "h1gtn1h",
            "score": -1,
            "text": "Reddit will cancel buzzfeed because they have CCP cock in their mouth",
            "title_similarity": "0.5533874",
            "sentiment_compound": -0.3818
        },
        {
            "id": "h1gto6k",
            "score": 1,
            "text": "Honest question, how many prestigious journalism awards has Fox News won, if any?",
            "title_similarity": "0.543126",
            "sentiment_compound": 0.875
        },
        {
            "id": "h1gtq3g",
            "score": -1,
            "text": "Oh its true to their brand alright. This wasn’t groundbreaking journalism. We known how residential schools, camps, forced labor etc works for several decades now. America showed China how to do it. You don’t hold one accountable, you end up not being able to hold anyone accountable…\n\nEdit: this wasn’t groundbreaking journalism. It was pandering to unread America idiots to drive up the China hate.",
            "title_similarity": "0.7131461",
            "sentiment_compound": -0.4404
        },
        {
            "id": "h1gu28s",
            "score": -1,
            "text": "Saw this earlier today and my first thought. The Pulitzer prize bar sure has fallen.",
            "title_similarity": "0.5676302",
            "sentiment_compound": 0.4767
        },
        {
            "id": "h1gu7i2",
            "score": 1,
            "text": "That’s one more than Fox News.",
            "title_similarity": "0.21784282",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1gusal",
            "score": 1,
            "text": "How can buzzed news and buzzfeed be on the same site?",
            "title_similarity": "0.45471683",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1gvri6",
            "score": -1,
            "text": "Oh shit. The credibility of Pulitzer Prize",
            "title_similarity": "0.4198388",
            "sentiment_compound": -0.0772
        },
        {
            "id": "h1gwktf",
            "score": 1,
            "text": "Okay now let's do it for the US",
            "title_similarity": "0.11403423",
            "sentiment_compound": 0.2263
        },
        {
            "id": "h1gxpsc",
            "score": -1,
            "text": "Everyone should do it in order to screw China for the sake of the various prizes regardless the story is true or not. You see, now you can even get a Pulitzer Prize for screwing China. Keep doing it, Nobel Prize would also come your way soon.",
            "title_similarity": "0.6823265",
            "sentiment_compound": 0.8779
        },
        {
            "id": "h1gys0v",
            "score": -1,
            "text": "No one cares about muslims unless they are chinese muslims",
            "title_similarity": "0.48252323",
            "sentiment_compound": -0.569
        },
        {
            "id": "h1gytpj",
            "score": 1,
            "text": "Let me guess the headline: \n\n“CHINA IS DETAINING MUSLIMS AND I SO FEEL IT RIGHT NOW”",
            "title_similarity": "0.7641599",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1gzuaf",
            "score": -1,
            "text": "Astonishing. Still hate all news outlets though.",
            "title_similarity": "0.30443954",
            "sentiment_compound": -0.5719
        },
        {
            "id": "h1h323f",
            "score": 1,
            "text": "It's a sad state when Buzzfeed is doing real journalism and winning awards, while places like CNN, MSNBC, and Fox News are legit making stuff up with no accountability.",
            "title_similarity": "0.5966175",
            "sentiment_compound": 0.5574
        },
        {
            "id": "h1h3ca9",
            "score": -1,
            "text": "Haha such a trash site.",
            "title_similarity": "0.20688356",
            "sentiment_compound": 0.4588
        },
        {
            "id": "h1h69ka",
            "score": 1,
            "text": "Sad most people will label this as fiction when it is in fact, non fiction.",
            "title_similarity": "0.33607212",
            "sentiment_compound": -0.4767
        },
        {
            "id": "h1hbwcf",
            "score": 1,
            "text": "Over under 6 months on when the journalists that contributed are disappeared?",
            "title_similarity": "0.37591675",
            "sentiment_compound": -0.2263
        },
        {
            "id": "h1hemj5",
            "score": 1,
            "text": "Now do the same for Israel",
            "title_similarity": "0.12028112",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1heyla",
            "score": 1,
            "text": "If your mad about this, you should be furious about our funding of Israel.",
            "title_similarity": "0.5023737",
            "sentiment_compound": -0.7845
        },
        {
            "id": "h1hff87",
            "score": 1,
            "text": "RIP China will be upset lol",
            "title_similarity": "0.43959662",
            "sentiment_compound": 0.0516
        },
        {
            "id": "h1hg940",
            "score": 1,
            "text": "They detain and enslave everybody. It really wasn’t all that hard lol\nSocialism at its best. They have millions of slaves in China. Guess who built your iPhone?",
            "title_similarity": "0.752962",
            "sentiment_compound": -0.0772
        },
        {
            "id": "h1hgj6y",
            "score": -1,
            "text": "no. 1 china, great ccp, breave chinese",
            "title_similarity": "0.49906564",
            "sentiment_compound": 0.6249
        },
        {
            "id": "h1hjmaa",
            "score": 1,
            "text": "I pray that one day, occupied China will break free of their CCP shackles. Bots and paids come at me.",
            "title_similarity": "0.6688711",
            "sentiment_compound": 0.6808
        },
        {
            "id": "h1hjmq7",
            "score": -1,
            "text": "I think I blocked them on my Google news feed. If anyone is reading this from BuzzFeed, separate from them, they're toxic and pulling you down.",
            "title_similarity": "0.56769884",
            "sentiment_compound": -0.2732
        },
        {
            "id": "h1hjp60",
            "score": 1,
            "text": "Tankies malding.",
            "title_similarity": "0.16976528",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1hk350",
            "score": 1,
            "text": "Fuck BuzzFeed, thank you for doin the work",
            "title_similarity": "0.33494738",
            "sentiment_compound": -0.25
        },
        {
            "id": "h1hk5i0",
            "score": 1,
            "text": "Click to see the top ten ways journalists can win awards!",
            "title_similarity": "0.4029541",
            "sentiment_compound": 0.8356
        },
        {
            "id": "h1hkkep",
            "score": -1,
            "text": "*Buzzfeed: we whoopsied a good thing*",
            "title_similarity": "0.2534505",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h1hklfp",
            "score": -1,
            "text": "Holy shit, has BuzzFeed actually done something constructive that's not pure cancer? I'm appalled",
            "title_similarity": "0.43117672",
            "sentiment_compound": -0.4738
        },
        {
            "id": "h1hl1i1",
            "score": -1,
            "text": "And still so many people believe so much crap around coronavirus that stemmed only from the CCP and westerners with deep ties to China (lockdowns, asymptomatic contagion, in silico genome sequence for PCR modelling, etc.)",
            "title_similarity": "0.70801425",
            "sentiment_compound": -0.7076
        },
        {
            "id": "h1hlpo9",
            "score": -1,
            "text": "I dont even fucking believe this shit, show me the proof. fucking buzzfeed",
            "title_similarity": "0.41868132",
            "sentiment_compound": -0.6787
        },
        {
            "id": "h1hmkq7",
            "score": -1,
            "text": "Lmfao BUZZFEED?! 😂",
            "title_similarity": "0.25709176",
            "sentiment_compound": 0.7712
        },
        {
            "id": "h1hn91e",
            "score": -1,
            "text": "BuzzFeed  Earning  a Pulitzer is one of the signs of the end of the world.",
            "title_similarity": "0.5710529",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1hnhls",
            "score": -1,
            "text": "Great! But how come not enough papers and government officials are condemning Israel?",
            "title_similarity": "0.47953543",
            "sentiment_compound": 0.4295
        },
        {
            "id": "h1hnjri",
            "score": -1,
            "text": "Trump supporters fuming right now",
            "title_similarity": "0.33642134",
            "sentiment_compound": -0.2023
        },
        {
            "id": "h1hplfk",
            "score": -1,
            "text": "Buzzfeed has a Pulitzer. Buzzfeed. Everyday we stray farther from God's light.",
            "title_similarity": "0.39026132",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1hpnpo",
            "score": -1,
            "text": "They where first ? Doubt it buzzfeed is awful clickbait shit",
            "title_similarity": "0.37828606",
            "sentiment_compound": -0.8442
        },
        {
            "id": "h1hprmk",
            "score": -1,
            "text": "Good job BuzzFeed. Now please cover the situation in Palestine. Although for doing such thing you will probably get cancelled. Sad world we live in",
            "title_similarity": "0.5057931",
            "sentiment_compound": 0.0258
        },
        {
            "id": "h1hq10v",
            "score": -1,
            "text": "Bolster empire / win prizes",
            "title_similarity": "0.25565323",
            "sentiment_compound": 0.7783
        },
        {
            "id": "h1hu59a",
            "score": -1,
            "text": "nice empty award",
            "title_similarity": "0.045230478",
            "sentiment_compound": 0.6705
        },
        {
            "id": "h1hu89n",
            "score": -1,
            "text": "You know in the world of \"Idiocracy,\" this is something you'd expect to hear.... but it wouldn't be for exposing China, it's be for, \"Hahaha butts.\"\n\nIt really amuses me people finding this comment either negative or positive.",
            "title_similarity": "0.57700497",
            "sentiment_compound": 0.8992
        },
        {
            "id": "h1hwpxf",
            "score": 1,
            "text": "Honestly, when BuzzFeed wins a Pulitzer, it begs the question: What are the mainstream, supposedly credible media outlets doing?",
            "title_similarity": "0.6088247",
            "sentiment_compound": 0.7717
        },
        {
            "id": "h1i40qb",
            "score": -1,
            "text": "Then they said sike!!",
            "title_similarity": "0.06227843",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1i4cfk",
            "score": 1,
            "text": "Weird… \n\na few months ago on reddit I was told… \n\n“there is no evidence of this… blah blah”\n\nOnce again…\n\nIt’s real…",
            "title_similarity": "0.44994405",
            "sentiment_compound": -0.3818
        },
        {
            "id": "h1i5n0q",
            "score": -1,
            "text": "So Buzzfeed, the known fake news site with no credibility, broke the story that tows the line of the US government and stokes anti chinese fears and which extremely exaggerates the extent of the situation. How does this deserve a prize?",
            "title_similarity": "0.7525737",
            "sentiment_compound": -0.6869
        },
        {
            "id": "h1i5zh9",
            "score": 1,
            "text": "I love that they were able to expose this but I cannot stand buzzfeed. Most of what they write is garbage clickbait.",
            "title_similarity": "0.5060356",
            "sentiment_compound": 0.3182
        },
        {
            "id": "h1i9acn",
            "score": -1,
            "text": "CBU : 1430001714013548380023   \n$10 usd help for shop made to buy medicines that I need and are expensive in Argentina",
            "title_similarity": "0.490534",
            "sentiment_compound": 0.4019
        },
        {
            "id": "h1i9wdd",
            "score": -1,
            "text": "Well that’s stoopid. All those independent journalists who have been reporting this for years must be fuming.",
            "title_similarity": "0.4489505",
            "sentiment_compound": -0.3818
        },
        {
            "id": "h1ia4t9",
            "score": -1,
            "text": "I can't take Buzzfeed seriously when they do an expose on Amazon, then push dozens of lists on what to buy on Amazon within the next day in all their sister FB pages.\n\nIt's a very hypocritical site.",
            "title_similarity": "0.5544708",
            "sentiment_compound": -0.2441
        },
        {
            "id": "h1icknu",
            "score": 1,
            "text": "How come no one ever exposed how the United States slaughtered Muslims in the middle east and the Muslim detainees in American concentration camp?  This award is just to get young American to hate China that's all.   Buzzed didn't do anything special at all its the same as other news outlets.",
            "title_similarity": "0.6612327",
            "sentiment_compound": -0.1363
        },
        {
            "id": "h1idfb1",
            "score": -1,
            "text": "If you want awards for journalism, all you have to do is spread propaganda for the west.",
            "title_similarity": "0.52770734",
            "sentiment_compound": 0.3182
        },
        {
            "id": "h1igcx5",
            "score": 1,
            "text": "And yet laowhy on YouTube has been out here preaching and getting put on Chinese state media in a bad light for how long now? Where's his?",
            "title_similarity": "0.6810763",
            "sentiment_compound": -0.594
        },
        {
            "id": "h1k9vka",
            "score": 1,
            "text": "Buttfeed",
            "title_similarity": "0.09085588",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1kx1kb",
            "score": -1,
            "text": "Wait something good came out of BuzzFeed, what!?!?!",
            "title_similarity": "0.2466504",
            "sentiment_compound": 0.6293
        },
        {
            "id": "h29pr2v",
            "score": 1,
            "text": "I read it and that is literally poor Journalism. Anyone could get some satelite image and say something is going on. lol. Even though those buildings can be anything. Everytime I seen something about China and Muslims,  all I saw is poor journalism. 1. is they don't even travel to those places to do proper research and 2. they generally just try to take anything that is vague and slap China on the title. The worse part is this is Buzzfeed and it is not even news that the produce.",
            "title_similarity": "0.6676215",
            "sentiment_compound": -0.743
        },
        {
            "id": "h1g9zrs",
            "score": -7,
            "text": "Looks like circle jerking of same propaganda.  West Karen committee boosting west Karen media. Same exact playbook for Iraq wmds.",
            "title_similarity": "0.49211538",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h1hjn82",
            "score": 5,
            "text": "I don’t like that we use subjective awards or statements to strengthen our own position on topics. \n\nThe original article was sponsored by the Pulitzer Center, this article then went on to win a Pulitzer Prize. \n\nThe award was given in the international category on “…for a series of clear and compelling stories that used satellite imagery and architectural expertise”. BuzzFeed themselves state it’s awarded on the innovation of using satellite imagery for investigative journalism. \n\nThe Pulitzer Center is a USA based organisation. Looking at the other intentional winners, in recent years it’s been awarded to political causes that favour the USA agenda (and as an independent award they are allowed to give it on whatever they want).\n\nIf Covid-19 has taught us anything, we have to remind ourselves to question things that we’ve always taken as fact when it’s delivered from a seemingly authoritative source, but is actually still subjective and can be used to manipulate a story. \n\nTo be 100% clear, I don’t think that’s what’s happening in this case. This story was ground breaking!",
            "title_similarity": "0.6721009",
            "sentiment_compound": 0.9741
        },
        {
            "id": "h1g80sl",
            "score": 14,
            "text": "Whoa, I just had to step outside in Kansas to make sure it wasn't frozen.",
            "title_similarity": "0.22996172",
            "sentiment_compound": 0.3182
        },
        {
            "id": "h1fryjx",
            "score": -17,
            "text": "Maybe if Buzzfeed and TMZ start getting Pulitzers it'll wakeup real journalists.",
            "title_similarity": "0.5492245",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1fx8tq",
            "score": -2,
            "text": "Take our  “What kind of Genocidal Regime are you cat quiz?” Number 4 is just all the feels!!!",
            "title_similarity": "0.41099477",
            "sentiment_compound": 0.2905
        },
        {
            "id": "h1g3d74",
            "score": 2,
            "text": "I was gonna shit on the Pulitzers for giving an award to BuzzFeed, but I guess BuzzFeed news is actually a good journalism company. Sucks they have to share their name to such trash though.",
            "title_similarity": "0.6454798",
            "sentiment_compound": 0.6187
        },
        {
            "id": "h1g3vnz",
            "score": -2,
            "text": "Fuck CCP, Fuck buzzfeed",
            "title_similarity": "0.30983138",
            "sentiment_compound": -0.7906
        },
        {
            "id": "h1g40z5",
            "score": -2,
            "text": "Do the independent news organizations that have been covering this same topic for years before BuzzFeed decided to mention it also get awards? No? Ah, darn.",
            "title_similarity": "0.55116993",
            "sentiment_compound": 0.5204
        },
        {
            "id": "h1g4c37",
            "score": -2,
            "text": "is this an out of season april fools joke?",
            "title_similarity": "0.27136415",
            "sentiment_compound": -0.25
        },
        {
            "id": "h1g4o96",
            "score": -2,
            "text": "Click bait.",
            "title_similarity": "0.12354893",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1g52tu",
            "score": 2,
            "text": "Good to see there’s still investigative journalism, even if it’s Buzzfeed",
            "title_similarity": "0.39464435",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h1g56lm",
            "score": 2,
            "text": "Shame no one in the world is helping the Muslims though because of who he is. Shame on you all. It’s time to put a stop to him , hitler mark 2",
            "title_similarity": "0.523934",
            "sentiment_compound": -0.8126
        },
        {
            "id": "h1g5hmp",
            "score": 2,
            "text": "Reality: the only thing you can’t make up.",
            "title_similarity": "0.09094173",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1g68sp",
            "score": 2,
            "text": "Amazing, actually noteworthy news reporting AND they can tell me what flavour of fruit roll up I am based on my favourite breed of bat.",
            "title_similarity": "0.4407213",
            "sentiment_compound": 0.5859
        },
        {
            "id": "h1g6ilk",
            "score": 2,
            "text": "Buzzfeed.com exists to rake in ad revenue in order to fund Buzzfeed News' quality journalism. People don't realize how expensive these stories cost.",
            "title_similarity": "0.5462158",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1g77ow",
            "score": 2,
            "text": "Top Ten Reasons BuzzFeed Won A Pulitzer Prize. Number 6 Will Surprise You.\n\n1. Good journalism \n2. Good reporting\n3. Good interviews\n4. Breaking important stories\n5. Digging deeper into the stories\n6. Intern won hotdog eating contest\n7. Follows the lead\n8. Trendsetting\n9. Good SEO\n10. “Which Harry Potter House Would You Be Sorted Into?” Quiz Was top-notch",
            "title_similarity": "0.5927522",
            "sentiment_compound": 0.9783
        },
        {
            "id": "h1g7iol",
            "score": -2,
            "text": "Are you sure this isn't the onion?\n\nChina being dicks is real\n\nBut Buzzfeed growing a journalistic spine sounds like horshit",
            "title_similarity": "0.66574234",
            "sentiment_compound": 0.714
        },
        {
            "id": "h1g7p89",
            "score": -2,
            "text": "What a joke lmao",
            "title_similarity": "0.116607964",
            "sentiment_compound": 0.7269
        },
        {
            "id": "h1g8jsf",
            "score": -2,
            "text": "journalism is dead. we need more philosophers\n\n\nhttps://youtu.be/34LGPIXvU5M\n\n\nedit* legitimacy, consensus, immutable, memetic, blockchain. will there be an intelligence explosion? or return2monke…..",
            "title_similarity": "0.4741839",
            "sentiment_compound": -0.296
        },
        {
            "id": "h1g8pln",
            "score": 2,
            "text": "Top 10 ways to get a Pulitzer. You won’t believe the number one way!!",
            "title_similarity": "0.43150723",
            "sentiment_compound": 0.3987
        },
        {
            "id": "h1g8saz",
            "score": 2,
            "text": "Dont go pissing off pooh bear now.",
            "title_similarity": "0.18059668",
            "sentiment_compound": 0.3089
        },
        {
            "id": "h1g9riq",
            "score": -2,
            "text": "So does any random comment get awarded in this thread?",
            "title_similarity": "0.20581208",
            "sentiment_compound": 0.4019
        },
        {
            "id": "h1gacao",
            "score": -2,
            "text": "It was an amazing week of trading. Look trading is not easy, it takes time. Don't let other servers tell you it's easy and you can make crazy amounts from it. With the right strategies you really can 🙂 We not only provide signals but we also TEACH that is the #1 way to become a great trader. Want more insight? Join our server of 250 amazing traders who trust us with their decisions \n\nhttps://discord.gg/vYjdx9DDUm",
            "title_similarity": "0.5141163",
            "sentiment_compound": 0.9747
        },
        {
            "id": "h1gbyk9",
            "score": 2,
            "text": "What a timeline",
            "title_similarity": "-0.069574475",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1gcp04",
            "score": 2,
            "text": "So Buzzfeed News is a real organization now?",
            "title_similarity": "0.34902227",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1gcrqe",
            "score": 2,
            "text": "[deleted]",
            "title_similarity": "0.027378835"
        },
        {
            "id": "h1gcwwz",
            "score": -2,
            "text": "Where's the Razzie equivalent for the dossier fiasco?",
            "title_similarity": "0.44009966",
            "sentiment_compound": -0.5106
        },
        {
            "id": "h1gdm3n",
            "score": 2,
            "text": "Ya, fuck China",
            "title_similarity": "0.4350988",
            "sentiment_compound": -0.5423
        },
        {
            "id": "h1gf1f1",
            "score": 2,
            "text": "Headline: Top 10 quirky things China does",
            "title_similarity": "0.5550111",
            "sentiment_compound": 0.2023
        },
        {
            "id": "h1gfl8y",
            "score": -2,
            "text": "There are prizes for this kind of shit shows? Where's the prize for covid? No one? Okay.",
            "title_similarity": "0.42888463",
            "sentiment_compound": -0.2498
        },
        {
            "id": "h1gflsx",
            "score": -2,
            "text": "This probably won't be a popular point to make here, but Judith Miller also won a Pulitzer.\n\nWe saw how that one turned out...",
            "title_similarity": "0.47171217",
            "sentiment_compound": 0.658
        },
        {
            "id": "h1gfmk2",
            "score": -2,
            "text": "Let me guess, because they copied from someone’s Reddit post?",
            "title_similarity": "0.46096113",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1gfxen",
            "score": 2,
            "text": "Detain doesn't begin to cover it. It is a concentration camp. And nobody is doing shit.",
            "title_similarity": "0.27983677",
            "sentiment_compound": -0.7506
        },
        {
            "id": "h1ggwm5",
            "score": -2,
            "text": "You mean [this](https://www.washingtonpost.com/lifestyle/style/buzzfeeds-stumble-fuels-doubts-about-the-press-even-if-a-few-details-are-missing/2019/01/19/b509ed32-1b93-11e9-88fe-f9f77a3bcb6c_story.html) BuzzFeed News?",
            "title_similarity": "0.55572957",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1gi7xm",
            "score": 2,
            "text": "Fuck China",
            "title_similarity": "0.44261736",
            "sentiment_compound": -0.5423
        },
        {
            "id": "h1gjvaw",
            "score": 2,
            "text": "Could win 100 prizes and I won’t take them seriously",
            "title_similarity": "0.33012494",
            "sentiment_compound": 0.7269
        },
        {
            "id": "h1gkk54",
            "score": 2,
            "text": "And now what? \n\nOh right nothing will happen and china will continue to get away with it just like the virus! \n\n\nChina is fucking the world and no one is noticing",
            "title_similarity": "0.5813026",
            "sentiment_compound": 0.1511
        },
        {
            "id": "h1gkvoj",
            "score": 2,
            "text": "This Pulitzer prize is really going to help BuzzFeed with a culture shift of having its news taken more seriously. Those knowledgeable on the topic already know how high quality many of their pieces are (yes, really!), but the platform faces stigma due to the low-quality pieces Buzzfeed specifically (different than Buzzfeed news) puts out. Exciting for sure to see what Buzzfeed news will do next!",
            "title_similarity": "0.53916466",
            "sentiment_compound": 0.9066
        },
        {
            "id": "h1gl3ba",
            "score": -2,
            "text": "Buzzfeed is still a cancer posing as journalism.",
            "title_similarity": "0.54008716",
            "sentiment_compound": -0.6597
        },
        {
            "id": "h1glqzb",
            "score": 2,
            "text": "Imagine telling someone in 2014 that in 7 years there'll be another Holocaust and only BuzzFeed can stop it",
            "title_similarity": "0.55451477",
            "sentiment_compound": -0.296
        },
        {
            "id": "h1gmeah",
            "score": -2,
            "text": "Article written on an IPhone 8 produced by slave labor.",
            "title_similarity": "0.51538014",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1gn2ge",
            "score": -2,
            "text": "[deleted]",
            "title_similarity": "0.027378835"
        },
        {
            "id": "h1gomik",
            "score": -2,
            "text": "Lmfao what a joke",
            "title_similarity": "0.1301142",
            "sentiment_compound": 0.6908
        },
        {
            "id": "h1gpblp",
            "score": 2,
            "text": "Drop the horrible brand name already...",
            "title_similarity": "0.26184812",
            "sentiment_compound": -0.6808
        },
        {
            "id": "h1gpf53",
            "score": -2,
            "text": "A company like buzzfeed (they spread lot’s of fake news) get a pulitzer, but independent journalists that are spitting truth are left undiscovered?..",
            "title_similarity": "0.704103",
            "sentiment_compound": 0.3919
        },
        {
            "id": "h1gqr4h",
            "score": -2,
            "text": "Oh the Muslim concentration camps are popular now? I member when that was too controversial, but really… buzzfeed?? C’mon.. this is old news, but yeah let’s prop up Buzzfeed as being a reliable source for news, not the clickbait garbage we keep seeing from the onion..",
            "title_similarity": "0.59402454",
            "sentiment_compound": 0.5913
        },
        {
            "id": "h1gre39",
            "score": -2,
            "text": "Fuck Buzzfeed.",
            "title_similarity": "0.2608426",
            "sentiment_compound": -0.5423
        },
        {
            "id": "h1gs55q",
            "score": -2,
            "text": "And  qhat difference  will  this nak?? None",
            "title_similarity": "0.049158804",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1gt7ou",
            "score": 2,
            "text": "I made fun of buzzfeed news a long time ago and I’m sorry because they’ve done awesome work.",
            "title_similarity": "0.48330218",
            "sentiment_compound": 0.7964
        },
        {
            "id": "h1gvsy6",
            "score": -2,
            "text": "What are the odds that they themselves are marxists/commies/socialist?",
            "title_similarity": "0.3328663",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1gvyzy",
            "score": -2,
            "text": "This Quiz Can Guess How Old You Were When The Pulitzer Lost Its Credibility.",
            "title_similarity": "0.50207657",
            "sentiment_compound": -0.3182
        },
        {
            "id": "h1gwkks",
            "score": 2,
            "text": "They really earned it. Hopefully redditors will stop downvoting you to oblivion for citing buzzfeed news. Been attacked multiple times for defending buzzfeed news on this site.",
            "title_similarity": "0.6341691",
            "sentiment_compound": -0.3041
        },
        {
            "id": "h1gyp4u",
            "score": 2,
            "text": "Wow, who would've ever thought? Never imagined BuzzFeed had it in them, they did good for journalist, they did good.",
            "title_similarity": "0.473593",
            "sentiment_compound": 0.8625
        },
        {
            "id": "h1gyzec",
            "score": 2,
            "text": "2021 is weird man, i always associate buzzfeed with those cringe clickbait things.  Who know they had an actual journalism team.  I know they released the document about trump when no one else would, but that was because the source seemed shady I though.  So I never took it serious, I guess I need to check them out.",
            "title_similarity": "0.5844992",
            "sentiment_compound": -0.1573
        },
        {
            "id": "h1gzf40",
            "score": -2,
            "text": "So what? Reddit found out about China detaining Muslims and buzzfeed copies that too?",
            "title_similarity": "0.8087636",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1gzx04",
            "score": -2,
            "text": "90% of women won't *believe* what they did next!",
            "title_similarity": "0.37785137",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1h0s4k",
            "score": -2,
            "text": "[deleted]",
            "title_similarity": "0.027378835"
        },
        {
            "id": "h1h318e",
            "score": 2,
            "text": "And yet celebrities and athletes (NBA) suck China's dicl daily and no one cares.",
            "title_similarity": "0.5503815",
            "sentiment_compound": -0.7636
        },
        {
            "id": "h1h844u",
            "score": 2,
            "text": "It’s funny how the headline here is about Buzzfeed winning a prize. Not about the whole, ya know, GENOCIDE happening.",
            "title_similarity": "0.56079596",
            "sentiment_compound": 0.8625
        },
        {
            "id": "h1hailc",
            "score": -2,
            "text": "Buzz feed is literal trash,",
            "title_similarity": "0.3205075",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1hbaeu",
            "score": -2,
            "text": "Good bye credibility, Pulitzer Prize.",
            "title_similarity": "0.382088",
            "sentiment_compound": 0.7351
        },
        {
            "id": "h1hehrw",
            "score": 2,
            "text": "Perhaps i judged you too harshly",
            "title_similarity": "0.26035637",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1howyw",
            "score": -2,
            "text": "Pulitzer prize is trash",
            "title_similarity": "0.42967778",
            "sentiment_compound": 0.5106
        },
        {
            "id": "h1hpkfu",
            "score": -2,
            "text": "lol. I don't see clear evidence but I find it funny that they would be so interested in \"exposing\" with no clear evidence and yet they dont want to expose Trump's internment camps.",
            "title_similarity": "0.40489057",
            "sentiment_compound": 0.6604
        },
        {
            "id": "h1i08v9",
            "score": -2,
            "text": "Considering buzzfeed is absolute trash discredits the fuck out of the Pulitzer Prize lol.",
            "title_similarity": "0.52859974",
            "sentiment_compound": 0.3818
        },
        {
            "id": "h1i9xzi",
            "score": -2,
            "text": "The article is less about why they received a pulitzer, than it is about their targeted attempt to be another fake news outlet while Trump was POTUS.  ... Cannot even get real stories on reddit anymore.",
            "title_similarity": "0.6150781",
            "sentiment_compound": -0.4767
        },
        {
            "id": "h1il95p",
            "score": 2,
            "text": "Well I'll be.. What's next? Logan Paul brokers peace is the Gaza Strip?",
            "title_similarity": "0.29280794",
            "sentiment_compound": 0.7149
        },
        {
            "id": "h1j0idt",
            "score": -2,
            "text": "Buzzfeed is only good for finding out what deli meat most closely matches your personality",
            "title_similarity": "0.3774682",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h1juury",
            "score": 2,
            "text": "Thank God this is getting more recognition. I never hear about this in America's news. It hurts seeing my people getting alienated and belittled by \"authority\". China's Muslims, Palestinians, what else?",
            "title_similarity": "0.6479843",
            "sentiment_compound": -0.296
        },
        {
            "id": "h1fq3hm",
            "score": 884,
            "text": "Cool story I saw on Twitter about one of the authors, Megha Rajagopala:\n\n[One quick story about @meghara: After Chinese government refused to renew her visa, @MiriamElder & I met with gov't officials. They said we were welcome to send literally any other reporter — just not Megha. Who exposed Uighur camps from the outside in, & just won a Pulitzer.](https://twitter.com/benyt/status/1403401462584164354)",
            "title_similarity": "0.7598761",
            "sentiment_compound": 0.7919
        },
        {
            "id": "h1fyn2m",
            "score": -3,
            "text": "I'm shocked to learn that there is any part of BuzzFeed worthy of actual respect.",
            "title_similarity": "0.3338255",
            "sentiment_compound": 0.5719
        },
        {
            "id": "h1fyn76",
            "score": -2,
            "text": "Congratulations, I guess.\n\nBut how to separate the genuine 'old fashioned' investigative journalism from the click-bait synonymous with the brandname?\n\nInvestigate that, if you dare!",
            "title_similarity": "0.55446666",
            "sentiment_compound": 0.4102
        },
        {
            "id": "h1g29yj",
            "score": -4,
            "text": "I guess they practiced for that by watching how the US detained migrants! Pot and Kettle",
            "title_similarity": "0.5716771",
            "sentiment_compound": -0.4574
        },
        {
            "id": "h1g2p6m",
            "score": -2,
            "text": "So all American news outlets, huh.....",
            "title_similarity": "0.3198938",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1g3m7c",
            "score": -3,
            "text": "After all the years of bull shit pieces of garbage literature they put out, that do nothing but divide genders, race, religion and class, they get an award that they don’t deserve. Congrats BuzzFeed.",
            "title_similarity": "0.60926706",
            "sentiment_compound": 0.8422
        },
        {
            "id": "h1g4hu5",
            "score": 3,
            "text": "I'm so glad! People give them so much shit and I posted an article on reddit and got do much shit lol.",
            "title_similarity": "0.54901934",
            "sentiment_compound": -0.3974
        },
        {
            "id": "h1g61ej",
            "score": 3,
            "text": "And what are we doing about it? It sad to know we've been talking about it for years at this point and it doesn't seem like there's a lot of action from either president in terms of sanctions and what not, it's sad.",
            "title_similarity": "0.4725417",
            "sentiment_compound": -0.3931
        },
        {
            "id": "h1g6ij9",
            "score": -2,
            "text": "I'm sure this was an impartial decision and not politically motivated at all /s",
            "title_similarity": "0.113391496",
            "sentiment_compound": -0.0464
        },
        {
            "id": "h1g7jir",
            "score": 2,
            "text": "Buzzfeed won a WHAT",
            "title_similarity": "0.34548157",
            "sentiment_compound": 0.5719
        },
        {
            "id": "h1ga48q",
            "score": 3,
            "text": "🅱️ased 🅱️uzzfeed?",
            "title_similarity": "-0.03813891",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1gcq9q",
            "score": 3,
            "text": "More than Fox News",
            "title_similarity": "0.2258939",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1gltxl",
            "score": 3,
            "text": "Credit where it's due. I've laughed at some of buzzfeeds journalists fumbles, but this is an important story that world governments seem eager to do jack shit to acknowledge.",
            "title_similarity": "0.5503348",
            "sentiment_compound": 0.1406
        },
        {
            "id": "h1gr2u1",
            "score": 2,
            "text": "Lebron: it's complicated you wouldn't get it.",
            "title_similarity": "0.10031223",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1gsc3t",
            "score": 3,
            "text": "Congratulations. This is a huge step in the right direction",
            "title_similarity": "0.084580995",
            "sentiment_compound": 0.7351
        },
        {
            "id": "h1gsjp5",
            "score": 3,
            "text": "Seems like China is about to ban buzzfeed.",
            "title_similarity": "0.61978304",
            "sentiment_compound": -0.2732
        },
        {
            "id": "h1gv8pc",
            "score": 4,
            "text": "Totally deserved! That was committed and brilliant old school journalism work.",
            "title_similarity": "0.3539578",
            "sentiment_compound": 0.7345
        },
        {
            "id": "h1gzdnp",
            "score": -2,
            "text": "Award should go to journalists, not Buzzfeed.",
            "title_similarity": "0.34942603",
            "sentiment_compound": 0.5423
        },
        {
            "id": "h1h1pit",
            "score": 4,
            "text": "Genuine question, is Buzzfeed news trustworthy? Whats it’s political viewpoint?    \n\nI very much dislike the content they put out (steal content, mis/no credit, and their terrible clickbait) and haven’t supported any of their stuff since ~2015 or so.",
            "title_similarity": "0.5463345",
            "sentiment_compound": -0.259
        },
        {
            "id": "h1hhj6e",
            "score": -4,
            "text": "[removed]",
            "title_similarity": "-0.022555217"
        },
        {
            "id": "h1hpogm",
            "score": -4,
            "text": "So Buzzfeed gets credit for what we ALL knew to begin with hmm?Yeah i think they can take that pulitzer and shove it next to the anti mansplaining chair.",
            "title_similarity": "0.60046303",
            "sentiment_compound": 0.144
        },
        {
            "id": "h1ie26e",
            "score": 3,
            "text": "meanwhile, the AP reporter gets fired for expressing views on Gaza.",
            "title_similarity": "0.5910429",
            "sentiment_compound": -0.5574
        },
        {
            "id": "h1g81rw",
            "score": 30,
            "text": "Yay for investigatory journalism.",
            "title_similarity": "0.35779613",
            "sentiment_compound": 0.5267
        },
        {
            "id": "h1frrjl",
            "score": 2153,
            "text": "Over the last few years, Buzzfeed News has established itself as a legitimate source of investigative journalism. I'm glad that's finally being recognized.",
            "title_similarity": "0.51150125",
            "sentiment_compound": 0.4588
        },
        {
            "id": "h1fznvq",
            "score": -4,
            "text": "Wait, BuzzFeed actually made something good and useful?",
            "title_similarity": "0.23062432",
            "sentiment_compound": 0.7003
        },
        {
            "id": "h1gb6wa",
            "score": -4,
            "text": "[removed]",
            "title_similarity": "-0.022555217"
        },
        {
            "id": "h1gd7yo",
            "score": -3,
            "text": "wish i could get a pulitzer prize for lying",
            "title_similarity": "0.5471104",
            "sentiment_compound": 0.3818
        },
        {
            "id": "h1gnjic",
            "score": -5,
            "text": "Reading what the article that got the prize says, and what people on Reddit actually say about what's happening in Xinjiang.... it's clear absolutely no-one read the Buzzfeed article.\n\nA re-education and forced labor program that can contain a few hundred thousand victims. Horrific. Unfortunately, the UK has been too close to that in forcing the unemployed into work programs to continue to receive support, and the US pioneered the model with their prison labor system which takes undesirable minorities and funnels them into prison for little to no reason to provide a labor force.....so instead people straight faced state China is running *extermination camps* and committing literal *genocide* because that's the only thing we can get all self-righteous about anymore because it's the only thing we didn't do....recently.\n\nPeople don't want news. They don't want journalism. They want propaganda and an enemy. Winning a Pulitzer is confirmation that you worked too hard when you could just have posted a headline and a blurry picture saying whatever you want readers to think these days.",
            "title_similarity": "0.70280176",
            "sentiment_compound": -0.9333
        },
        {
            "id": "h1guj29",
            "score": 3,
            "text": "I don’t think they should change their name. If they continue to do good journalism, eventually people will start to see them as such, and doing that while overcoming the name, would increase their credibility even more.",
            "title_similarity": "0.35880193",
            "sentiment_compound": 0.6369
        },
        {
            "id": "h1gv9ka",
            "score": -4,
            "text": "nobody gives a fuck BuzzFeed News. Just something control by a bunch of redneck, that would slap their daughter cuz they use the word evolution.",
            "title_similarity": "0.4773789",
            "sentiment_compound": -0.4404
        },
        {
            "id": "h1gz803",
            "score": -2,
            "text": "[Judith Miller also won the Pulitzer Prize](https://www.youtube.com/watch?v=924DT22tSWE) for her coverage on the Iraq war...\n\nLook how that went...",
            "title_similarity": "0.62851125",
            "sentiment_compound": -0.0516
        },
        {
            "id": "h1h48ks",
            "score": 5,
            "text": "It’s pretty surprising since the article was titled, “15 ways China is oppressing Muslims”.",
            "title_similarity": "0.7466018",
            "sentiment_compound": 0.6486
        },
        {
            "id": "h1h6jng",
            "score": 3,
            "text": "China is using these 20 tactics to neutralise Muslims in Xinjiang. The 15th one will shock you",
            "title_similarity": "0.6855018",
            "sentiment_compound": -0.3818
        },
        {
            "id": "h1g5nkv",
            "score": 511,
            "text": "[deleted]",
            "title_similarity": "0.027378835"
        },
        {
            "id": "h1g0knr",
            "score": -5,
            "text": "Hopefully this will make them realize they should focus on real journalism and not shit like “Top 10 Quotes from the 90s”",
            "title_similarity": "0.43403238",
            "sentiment_compound": 0.5445
        },
        {
            "id": "h1g1ger",
            "score": -5,
            "text": "[deleted]",
            "title_similarity": "0.027378835"
        },
        {
            "id": "h1gwnbk",
            "score": -6,
            "text": "So an American give award to another American for promoting American propaganda?\n\nSounds like Nazi giving itself the human rights award.",
            "title_similarity": "0.62112606",
            "sentiment_compound": 0.9081
        },
        {
            "id": "h1gylnv",
            "score": -7,
            "text": "[removed]",
            "title_similarity": "-0.022555217"
        },
        {
            "id": "h1hkrjm",
            "score": 5,
            "text": "One of the interesting things about the changes in the media landscape is that outlets that used to be considered entertainment or even tabloid are now doing legitimate journalism.\n\nCosmopolitan is another example with the investigation and subsequent [article](https://www.google.com/amp/s/www.cosmopolitan.com/lifestyle/amp30284631/amish-sexual-abuse-incest-me-too/) they did on sexual abuse in the Amish community.",
            "title_similarity": "0.61078894",
            "sentiment_compound": 0.0772
        },
        {
            "id": "h1geuyq",
            "score": 136,
            "text": "Reddit loves to shit on BuzzFeed, but did Reddit win a Pulitzer for finding the Boston Marathon Bomber? LOLOLOLOLOLOL",
            "title_similarity": "0.64875174",
            "sentiment_compound": 0.7391
        },
        {
            "id": "h1g3tru",
            "score": 5,
            "text": "Heres the article\n\nhttps://www.buzzfeednews.com/article/meghara/china-new-internment-camps-xinjiang-uighurs-muslims",
            "title_similarity": "0.64806116",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1g6m2g",
            "score": 6,
            "text": "Am I the only one who remembers Buzzfeed starting as a music blog?",
            "title_similarity": "0.411823",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1g9c8q",
            "score": -5,
            "text": "[deleted]",
            "title_similarity": "0.027378835"
        },
        {
            "id": "h1h06qz",
            "score": -5,
            "text": "[removed]",
            "title_similarity": "-0.022555217"
        },
        {
            "id": "h1jgty9",
            "score": 6,
            "text": "Gotta give Buzzfeed props where due. Usually buzzfeed news is click bait garbage but this was really great journalism and they deserve the Pulitzer for it",
            "title_similarity": "0.55516905",
            "sentiment_compound": 0.7958
        },
        {
            "id": "h1i1rlu",
            "score": -6,
            "text": "Oh great. I see they're now handing out prizes for propaganda.",
            "title_similarity": "0.40327108",
            "sentiment_compound": 0.7269
        },
        {
            "id": "h1gb0w8",
            "score": -8,
            "text": "Reddit is a fucking cancer",
            "title_similarity": "0.52340627",
            "sentiment_compound": -0.6901
        },
        {
            "id": "h1fzrnf",
            "score": 854,
            "text": "Honestly if you go back to 2016, buzzfeed news had a scoop on Russia’s Internet Research Agency and a lot of the low level foreign malign influencers on social media. I’m sure they’ve had more since then, but I remember thinking at that time how it was the first, and best reporting I had seen on the topic.",
            "title_similarity": "0.6653029",
            "sentiment_compound": 0.8481
        },
        {
            "id": "h1fu2y0",
            "score": -11,
            "text": "Even a blind squirrel can tell time once in awhile /s",
            "title_similarity": "0.28383943",
            "sentiment_compound": -0.4019
        },
        {
            "id": "h1g022a",
            "score": 4924,
            "text": "“Al Jazeera is run by a national government so I crosscheck it with BBC” \n\nbro I’ve got bad news about what that first B stands for",
            "title_similarity": "0.59845746",
            "sentiment_compound": -0.5423
        },
        {
            "id": "h1fy9vi",
            "score": 3627,
            "text": "Remember, all of the garbage that buzzfeed and vice post, fund their real investigations.",
            "title_similarity": "0.5178947",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1g8lac",
            "score": 182,
            "text": "[deleted]",
            "title_similarity": "0.027378835"
        },
        {
            "id": "h1fme8h",
            "score": -29,
            "text": "Give them one for the Fauci emails too!",
            "title_similarity": "0.35597217",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1fy5mh",
            "score": 18435,
            "text": "Take this quiz to find out which kind of labor camp the Chinese government would put you in!",
            "title_similarity": "0.69118154",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1fsfwq",
            "score": 10900,
            "text": "Change your name BuzzFeed News, you deserve it.",
            "title_similarity": "0.41520005",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1flko5",
            "score": 26688,
            "text": "BuzzFeed news needs to be it's own thing because the BuzzFeed name is internet poison. They've done a lot of old school foot-to-the-pavement journalism and no one will take it seriously.",
            "title_similarity": "0.56265163",
            "sentiment_compound": -0.7506
        },
        {
            "id": "h1g392i",
            "score": 1,
            "text": "Mashallah",
            "title_similarity": "0.058309335",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1g3jf8",
            "score": 1,
            "text": "The White House press room has assigned seats. Buzzfeed is next to the BBC. It sounds impressive, but they’re near the back.",
            "title_similarity": "0.42031008",
            "sentiment_compound": 0.2846
        },
        {
            "id": "h1g3u80",
            "score": 1,
            "text": "In general I hate Buzzfeed. That said this is praiseworthy even if it came from my worst enemy. Great job, please do more like that.",
            "title_similarity": "0.48528668",
            "sentiment_compound": 0.1263
        },
        {
            "id": "h1g4943",
            "score": 1,
            "text": "I had no idea Buzzfeed did news. I see Buzzfeed and I pass, this is crazy to me",
            "title_similarity": "0.4472049",
            "sentiment_compound": -0.5574
        },
        {
            "id": "h1g4a09",
            "score": 1,
            "text": "Just don’t be a terror empatizer..",
            "title_similarity": "0.06691127",
            "sentiment_compound": -0.5267
        },
        {
            "id": "h1g4i6u",
            "score": 1,
            "text": "And nothing will be done about it. But at least they got an award for it.",
            "title_similarity": "0.16105996",
            "sentiment_compound": 0.6956
        },
        {
            "id": "h1g4kf8",
            "score": 1,
            "text": "I like how the top ten comments are how “buzzfeed news is great! Too bad nobody knows they’re separate from buzzfeed” ….except it seems everyone does know that?",
            "title_similarity": "0.4440279",
            "sentiment_compound": 0.636
        },
        {
            "id": "h1g4ov4",
            "score": 1,
            "text": "I had no idea Buzzfeed did real news, this subgroup needs to be separate, real journalism.",
            "title_similarity": "0.5058287",
            "sentiment_compound": -0.296
        },
        {
            "id": "h1g4yl0",
            "score": 1,
            "text": "When I saw the title I thought it said “Deleting” and not Detaining... so I thought they were a new type of digital Muslim or something...",
            "title_similarity": "0.38101682",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1g59km",
            "score": 1,
            "text": "prices and all but nothing is changing.",
            "title_similarity": "0.032482",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1g6h5f",
            "score": 1,
            "text": "Simulation gets wierder and wierder",
            "title_similarity": "0.08615035",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1g6mfn",
            "score": 1,
            "text": "Had no idea, I generally look at anything buzzfeed as a waste of time.. but they did good on this one.",
            "title_similarity": "0.3633957",
            "sentiment_compound": 0.3291
        },
        {
            "id": "h1g6w9c",
            "score": 1,
            "text": "Why not \"The Feed\" or \"The News Feed\" ?",
            "title_similarity": "0.31728756",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1g71cb",
            "score": 1,
            "text": "\"Maybe I don't want to be the bad guy anymore\"\n-Buzzfeed",
            "title_similarity": "0.31558418",
            "sentiment_compound": -0.575
        },
        {
            "id": "h1g71ym",
            "score": 1,
            "text": "Huh. I saw Buzzfeed and immediately thought \"Those hacks don't deserve a fucking prize\". They gotta change their name because this particular Pulitzer Prize will be forever tainted by the lack of credibility attached to the Buzzfeed brand.",
            "title_similarity": "0.58290815",
            "sentiment_compound": 0.6801
        },
        {
            "id": "h1g724d",
            "score": 1,
            "text": "How did they do it and where is the article?",
            "title_similarity": "0.29665375",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1g75cg",
            "score": 1,
            "text": "Christo Buschek 😍😍😍",
            "title_similarity": "0.059311457",
            "sentiment_compound": 0.8402
        },
        {
            "id": "h1g7q33",
            "score": 1,
            "text": "\"BuzzFeed...Sounds like something I used to do in College.\"\n\n-President Obama",
            "title_similarity": "0.3977336",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h1ga2zx",
            "score": 1,
            "text": "I mean... I guess.",
            "title_similarity": "-0.12765026",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1gamyu",
            "score": 1,
            "text": "Iris-West Allen is a hell of a reporter!",
            "title_similarity": "0.31344402",
            "sentiment_compound": -0.7088
        },
        {
            "id": "h1gbgpd",
            "score": 1,
            "text": "I never even knew",
            "title_similarity": "-0.034363355",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1gcet3",
            "score": 1,
            "text": "Well I just got a China crimes against humanity bingo",
            "title_similarity": "0.7053781",
            "sentiment_compound": 0.2732
        },
        {
            "id": "h1gdqd1",
            "score": 1,
            "text": "I predict buzzfeed is going to be hacked soon",
            "title_similarity": "0.38130644",
            "sentiment_compound": -0.4019
        },
        {
            "id": "h1gduzl",
            "score": 1,
            "text": "Well now they're just gonna be unbearable.",
            "title_similarity": "0.11276888",
            "sentiment_compound": 0.2732
        },
        {
            "id": "h1ged2a",
            "score": 1,
            "text": "I didn’t know they were making feature films either until I seen a recent movie they did at the drive in. Wasn’t that good tho",
            "title_similarity": "0.4462771",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h1geem6",
            "score": 1,
            "text": "One of my favorite arguments to take Buzzfeed news seriously was because they don’t have a reason to lie as an independent entity. I know there’s $Millions of reasons why they could, but they have nothing to lose by reporting what their journalists actually detail in great lengths. \n\nPretty neat stuff IMO.",
            "title_similarity": "0.46254444",
            "sentiment_compound": 0.9561
        },
        {
            "id": "h1geqns",
            "score": 1,
            "text": "Reminds me of when the National Enquirer broke the story on John Edward’s affair and illegitimate child back in 2004 or so.",
            "title_similarity": "0.664008",
            "sentiment_compound": -0.4215
        },
        {
            "id": "h1ges72",
            "score": 1,
            "text": "They deserve one for putting away dozens of the most evil members of the trumpkultists kabal. Minus the leader himself of course",
            "title_similarity": "0.58747655",
            "sentiment_compound": -0.6901
        },
        {
            "id": "h1gevsa",
            "score": 1,
            "text": "Wait, you're telling me BuzzFeed actually does something legitimately honest? I guess that's why we should never have prejudice cloud our judgement.",
            "title_similarity": "0.3593607",
            "sentiment_compound": 0.7186
        },
        {
            "id": "h1gf8kk",
            "score": 1,
            "text": "Needs a rebrand maybe? Congrats tho",
            "title_similarity": "0.17459011",
            "sentiment_compound": 0.5267
        },
        {
            "id": "h1gg059",
            "score": 1,
            "text": "Buzzfeed. Let that sink in….buzzfuckingfeed",
            "title_similarity": "0.26272628",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1gg13k",
            "score": 1,
            "text": "I love how it's news that BuzzFeed did good news",
            "title_similarity": "0.34709275",
            "sentiment_compound": 0.7964
        },
        {
            "id": "h1ghonp",
            "score": 2,
            "text": "Congratulations, well deserved!",
            "title_similarity": "0.023144862",
            "sentiment_compound": 0.7424
        },
        {
            "id": "h1ghpck",
            "score": 1,
            "text": "Oh so they’ve started being actually useful now",
            "title_similarity": "0.009102294",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h1ghsnn",
            "score": 1,
            "text": "Congrats to them. It is still kind of surprising that a legitimate news outlet got started from internet clickbait. Usually it's the other way around!",
            "title_similarity": "0.5058503",
            "sentiment_compound": 0.6704
        },
        {
            "id": "h1gi1t3",
            "score": 1,
            "text": "CCP be like whaaa???",
            "title_similarity": "0.05836086",
            "sentiment_compound": 0.466
        },
        {
            "id": "h1gi2jj",
            "score": 1,
            "text": "What a lifetime to live in.\n\nIt is unexpected (but certainly welcomed)  to see entertainment grassroot news can actually transform to actual investigative grassroot journalism.",
            "title_similarity": "0.41499126",
            "sentiment_compound": 0.872
        },
        {
            "id": "h1giejy",
            "score": 1,
            "text": "Buzzfeed doesn’t need their heads blown up anymore then it already is, but good job nonetheless",
            "title_similarity": "0.26800722",
            "sentiment_compound": 0.5927
        },
        {
            "id": "h1gigm6",
            "score": 1,
            "text": "How many reporters pancreas for sale in Shanghai now? Asking for a friend",
            "title_similarity": "0.6024686",
            "sentiment_compound": 0.4939
        },
        {
            "id": "h1gj19k",
            "score": 1,
            "text": "This is good news to me",
            "title_similarity": "0.022052355",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h1gj5en",
            "score": 1,
            "text": "I’m glad that conservatives are reading buzzfeed now",
            "title_similarity": "0.38294277",
            "sentiment_compound": 0.4588
        },
        {
            "id": "h1gjb9j",
            "score": 1,
            "text": "Oh wow!...anyway",
            "title_similarity": "-0.09853318",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1gjeo9",
            "score": 1,
            "text": "This definitely sounds like a joke headline from a time travel show",
            "title_similarity": "0.3436801",
            "sentiment_compound": 0.7506
        },
        {
            "id": "h1gjmkl",
            "score": 1,
            "text": "Anti corruption e were worldwide needed",
            "title_similarity": "0.39215338",
            "sentiment_compound": -0.3182
        },
        {
            "id": "h1gjmzn",
            "score": 1,
            "text": "Can someone tell me what's new about this?? We've known about this for years. Or was BuzzFeed the first to report on it years ago and they're just now being awarded?",
            "title_similarity": "0.49235722",
            "sentiment_compound": 0.5007
        },
        {
            "id": "h1gjn9r",
            "score": 1,
            "text": "This is 31st thing on the list of things I never expected to hear.",
            "title_similarity": "0.28687865",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1gjqn3",
            "score": 1,
            "text": "Awards are cool and all, but what the hell is anyone doing to put an end to it?",
            "title_similarity": "0.30419278",
            "sentiment_compound": -0.6956
        },
        {
            "id": "h1gk7td",
            "score": 1,
            "text": "Everyone knows already",
            "title_similarity": "0.047890548",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1gk8fu",
            "score": 1,
            "text": "Never thought I'd live to see the day the Pulitzer Prize became worthless. But here we are.",
            "title_similarity": "0.4733706",
            "sentiment_compound": 0.0516
        },
        {
            "id": "h1gkbi7",
            "score": 1,
            "text": "There are some great people at buzzfeed. The buzzfeed name is tarnished by a lot of their other garbage. I think they need to rebrand as something else because buzzfeed is just such a negative thing to many lol",
            "title_similarity": "0.49317795",
            "sentiment_compound": 0.4939
        },
        {
            "id": "h1gkf1r",
            "score": 1,
            "text": "Wait....buzzfeed broke this story? Really!?",
            "title_similarity": "0.51391876",
            "sentiment_compound": -0.5349
        },
        {
            "id": "h1gkk1n",
            "score": 1,
            "text": "What dimension is this? What year are we in?",
            "title_similarity": "0.075995006",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1gktf6",
            "score": 1,
            "text": "Is this even true? Rachael Maddow thinks otherwise. There was a special about this where she went into depth. I’ll believe cnn before buzz news anyday.",
            "title_similarity": "0.5333366",
            "sentiment_compound": 0.6705
        },
        {
            "id": "h1gkv8s",
            "score": 2,
            "text": "Is the “world news” that Buzzfeed got an award or is it the article itself?",
            "title_similarity": "0.56571424",
            "sentiment_compound": 0.5423
        },
        {
            "id": "h1gl0p6",
            "score": 1,
            "text": "New, nice.",
            "title_similarity": "-0.016412094",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h1glhns",
            "score": 1,
            "text": "Write an article and get an award to further my career ......duh!",
            "title_similarity": "0.3739758",
            "sentiment_compound": 0.5848
        },
        {
            "id": "h1glp6e",
            "score": 8,
            "text": "Are those \"Evey single piece of evidence of this comes from one unreliable source\" folk still around?",
            "title_similarity": "0.24697238",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1gm3bs",
            "score": 1,
            "text": "Congrats!",
            "title_similarity": "-0.022816252",
            "sentiment_compound": 0.5707
        },
        {
            "id": "h1gm46x",
            "score": 1,
            "text": "Glad it’s getting attention. I love to shit on buzzfeed as much as the next guy but good on them. \n\nAny news on any organization even attempting to apply pressure on China over this?",
            "title_similarity": "0.6614404",
            "sentiment_compound": 0.5187
        },
        {
            "id": "h1gm708",
            "score": 1,
            "text": "Buzzfeed has such bad brand recognition I thought this was an Onion Article at first",
            "title_similarity": "0.5262201",
            "sentiment_compound": -0.5423
        },
        {
            "id": "h1gma0h",
            "score": 1,
            "text": "Their top twelve lists were winning pulitzers in my book 10 years ago.",
            "title_similarity": "0.5491965",
            "sentiment_compound": 0.6369
        },
        {
            "id": "h1gmc22",
            "score": 1,
            "text": "Buzzfeed is hilarious with their articles but this is a job well done!",
            "title_similarity": "0.36229354",
            "sentiment_compound": 0.5848
        },
        {
            "id": "h1gmise",
            "score": 1,
            "text": "As America and the world sit idle, because China’s a super power. Weak sauce.",
            "title_similarity": "0.5185001",
            "sentiment_compound": 0.25
        },
        {
            "id": "h1gmmyl",
            "score": 1,
            "text": "Buzzfeed needs to rebrand because I still can't take them seriously",
            "title_similarity": "0.3115759",
            "sentiment_compound": 0.1326
        },
        {
            "id": "h1gmon5",
            "score": 2,
            "text": "I discovered BF news by accident. There was an article on the kardashians splitting and where it all started\n\nI was expecting a fluff piece which would go in and out but it was really detailed and went in the how and why really well.\n\nFew days later there was another kardashian piece and it was another great read.\n\nIve never seen an episode of kuwtk but it was a great read on the back ground of the family situation and not just one focused on Kim. It really showed how the show ultimately caused the family's precarious mental state now",
            "title_similarity": "0.6250128",
            "sentiment_compound": 0.9111
        },
        {
            "id": "h1gmpbb",
            "score": 1,
            "text": "Unpopular opinion - The only ones that deserve recognition in this field are the first to do something about it. Still waiting.",
            "title_similarity": "0.3856952",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1gmwl8",
            "score": 1,
            "text": "the young turks are sooo far away from winning a pulitzer",
            "title_similarity": "0.36081624",
            "sentiment_compound": 0.5267
        },
        {
            "id": "h1gmy7m",
            "score": 1,
            "text": "Is the media finally going after modern-day Nazi Germany???",
            "title_similarity": "0.50902766",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1gn003",
            "score": 1,
            "text": "Perhaps I treated you too harshly",
            "title_similarity": "0.23855273",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1gnaus",
            "score": 1,
            "text": "Good they haven’t found out about the Jews",
            "title_similarity": "0.31146407",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h1gnglz",
            "score": 1,
            "text": "If this doesn't make me question the whole China Uighar Muslim thing I don't know what does.",
            "title_similarity": "0.47930998",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1gnl67",
            "score": 1,
            "text": "Lebron James and John cena would like to dispute that.",
            "title_similarity": "0.25118297",
            "sentiment_compound": -0.0516
        },
        {
            "id": "h1go0zd",
            "score": 1,
            "text": "I’m just glad some good has come from all of this.",
            "title_similarity": "0.055044003",
            "sentiment_compound": 0.7096
        },
        {
            "id": "h1go1ss",
            "score": 2,
            "text": "Next will be about journalist assassinations",
            "title_similarity": "0.52007216",
            "sentiment_compound": -0.5719
        },
        {
            "id": "h1go3wn",
            "score": 1,
            "text": "Buzzfeed has been doing some real honest-to-god high quality investigative journalism for *years* now, and nobody takes them seriously.  Glad to see them finally getting some recognition, yeah the listicles are cancer but that doesn’t discredit their other work",
            "title_similarity": "0.5589664",
            "sentiment_compound": -0.1154
        },
        {
            "id": "h1gogdg",
            "score": 1,
            "text": "I remember hearing Buzzfeed news actually had amazing journalists too bad they got associated with that stupid quiz stuff",
            "title_similarity": "0.57742167",
            "sentiment_compound": -0.4767
        },
        {
            "id": "h1gonkv",
            "score": 1,
            "text": "Damn shame they never got the pulitzer for publishing the groundbreaking revelations researched and consolidated by the UK's top Russia intel officer. Fucki g politics",
            "title_similarity": "0.6173625",
            "sentiment_compound": -0.6124
        },
        {
            "id": "h1gpdtd",
            "score": 1,
            "text": "Finally some good news out of buzzfeed",
            "title_similarity": "0.31263185",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h1gpruu",
            "score": 1,
            "text": "What why? zerohedge was talking about this shit in mid-2019. They also broke the covid-19 stories too.",
            "title_similarity": "0.50173974",
            "sentiment_compound": -0.7935
        },
        {
            "id": "h1gra60",
            "score": 2,
            "text": "BuzzFeed will always carry the baggage of its past low quality ‘quirky’ stories that resulted in their rise to fame. It’s very hard to take them serious even when they do groundbreaking stories.",
            "title_similarity": "0.46916258",
            "sentiment_compound": -0.0498
        },
        {
            "id": "h1grfpn",
            "score": 2,
            "text": "The fuck kinda world is this where buzzfeed\n...and fucking 'the daily beast' are leaking top tier news. Like did someone think 'oh, these assholes? We could say whatever we want around them. No one will believe their clickbai....ohhh wait...\"",
            "title_similarity": "0.6209944",
            "sentiment_compound": -0.7096
        },
        {
            "id": "h1gs7al",
            "score": 1,
            "text": "Their first draft of the title: “Find Out: What Kind Of Imprisoned Muslim Are You?”",
            "title_similarity": "0.5714215",
            "sentiment_compound": -0.5095
        },
        {
            "id": "h1gse2b",
            "score": 1,
            "text": "\"Buzz Feed. We don't steal EVERYTHING \"",
            "title_similarity": "0.1335023",
            "sentiment_compound": 0.3875
        },
        {
            "id": "h1gstv4",
            "score": 1,
            "text": "From clickbait lists like “The ten things you didn’t know about condiments!” to a Pulitzer Prize. What a world we live in.",
            "title_similarity": "0.48764542",
            "sentiment_compound": 0.7263
        },
        {
            "id": "h1gtmpk",
            "score": 1,
            "text": "always behind the news sigh *",
            "title_similarity": "0.25382096",
            "sentiment_compound": 0.0258
        },
        {
            "id": "h1gtmy9",
            "score": 1,
            "text": "They should definitely rebrand, imagine world class journalism linked to the cesspit that is Buzzfeed.",
            "title_similarity": "0.50651956",
            "sentiment_compound": 0.4019
        },
        {
            "id": "h1gtnrd",
            "score": 1,
            "text": "Redemption arc?",
            "title_similarity": "0.047906004",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1gtyxe",
            "score": 1,
            "text": "First worthwhile thing written by buzzfeed lol.",
            "title_similarity": "0.3140326",
            "sentiment_compound": 0.6369
        },
        {
            "id": "h1gtzn6",
            "score": 1,
            "text": "I’ll take things i never thought I’d read for 400, Alex",
            "title_similarity": "0.3856705",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1gu727",
            "score": 1,
            "text": "Now since the tankies will be attracted here like flies to shite, I think it's high time we retire that name and look for something more....apt.  I think, motherfucking genocidal nazi fuckfaced bastards will do nicely.  What do you think?  Too long?  Too unfair?",
            "title_similarity": "0.47265548",
            "sentiment_compound": -0.6416
        },
        {
            "id": "h1guhr0",
            "score": 1,
            "text": "To think Buzzfeed and Kendrick Lamar are in the same company (kinda) really baffles my mind. Damn...",
            "title_similarity": "0.42710066",
            "sentiment_compound": -0.4019
        },
        {
            "id": "h1gukij",
            "score": 1,
            "text": "Literally never thought I would ever see BuzzFeed win any legitimate award.",
            "title_similarity": "0.334619",
            "sentiment_compound": 0.8074
        },
        {
            "id": "h1gulvl",
            "score": 1,
            "text": "And what’s Biden doing about it?",
            "title_similarity": "0.049219612",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1guoug",
            "score": 1,
            "text": "Its a real thing](https://www.twitch.tv/hottubuncleiroh)",
            "title_similarity": "0.18310875",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1gvizg",
            "score": 1,
            "text": "Well damn, guess I have to take them more seriously more, lol!",
            "title_similarity": "0.0869253",
            "sentiment_compound": 0.263
        },
        {
            "id": "h1gvwtt",
            "score": 1,
            "text": "Every Angelino around me, “Yeah but Palestine!”",
            "title_similarity": "0.16979456",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1gw05k",
            "score": 1,
            "text": "Awesome.\n\n\nWhat being done about the situation?",
            "title_similarity": "0.029565278",
            "sentiment_compound": 0.6249
        },
        {
            "id": "h1gw1hj",
            "score": 1,
            "text": "Of all the news outlets out there why the fuck did no one but _Buzzfeed_ run a story on this!?! This is fucking revolting!",
            "title_similarity": "0.5085554",
            "sentiment_compound": -0.5756
        },
        {
            "id": "h1gx0j4",
            "score": 1,
            "text": "In the voice of Wolf:\n\n> They must have been soooo confused",
            "title_similarity": "0.22098544",
            "sentiment_compound": -0.3182
        },
        {
            "id": "h1gy4rz",
            "score": 1,
            "text": "~~\"Begby's~~  China's fucking psycho, man. But... he's a mate, so what can you do?\"\n\n&#x200B;\n\n\\-The World",
            "title_similarity": "0.62831724",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1gyfy4",
            "score": 1,
            "text": "I hope this fixes all those fucking morons who respond to a scoop Buzzfeed got with \"but how is this a quiz\" or \"when will a real news organisation report on this?\"\n\nHint it won't.\n The comments prove this.",
            "title_similarity": "0.59999174",
            "sentiment_compound": 0.1163
        },
        {
            "id": "h1gz2uq",
            "score": 2,
            "text": "A headline I never thought I'd read.",
            "title_similarity": "0.26747194",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1gz53b",
            "score": 1,
            "text": "We all knew this. So what will we do about it? Other than applaud the reporting.",
            "title_similarity": "0.2731502",
            "sentiment_compound": 0.4588
        },
        {
            "id": "h1gzbx2",
            "score": 1,
            "text": "Very well deserved",
            "title_similarity": "-0.0145960525",
            "sentiment_compound": 0.3384
        },
        {
            "id": "h1gzrav",
            "score": 1,
            "text": "Buzzed actually doing something good for a change! Alright we'll see how this goes 🧐😌",
            "title_similarity": "0.22869787",
            "sentiment_compound": 0.7777
        },
        {
            "id": "h1h08wz",
            "score": 2,
            "text": "You won't believe some of the winners of the Pulitzer Prize... click to read more!",
            "title_similarity": "0.5455172",
            "sentiment_compound": 0.7712
        },
        {
            "id": "h1h0h6t",
            "score": 1,
            "text": "Much deserved!",
            "title_similarity": "-0.0267876",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1h0zjm",
            "score": 3,
            "text": "Freaking congratulations. That is huge. Great job everyone and thank you.",
            "title_similarity": "0.13381514",
            "sentiment_compound": 0.875
        },
        {
            "id": "h1h1z6l",
            "score": 1,
            "text": "Jeez I still remember when buzzfeed was a lowly Facebook page reposting other people’s work. How the times have changed.",
            "title_similarity": "0.51906574",
            "sentiment_compound": -0.25
        },
        {
            "id": "h1h22s0",
            "score": 1,
            "text": "Buzzfeed did some actual journalism for once.",
            "title_similarity": "0.43109915",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1h25e6",
            "score": 1,
            "text": "Finally, they put out actual good shit",
            "title_similarity": "0.13826676",
            "sentiment_compound": -0.1779
        },
        {
            "id": "h1h2azv",
            "score": 2,
            "text": "The messenger gets the prize and the victims keeps suffering while the world watches.",
            "title_similarity": "0.39400128",
            "sentiment_compound": -0.2732
        },
        {
            "id": "h1h2g9y",
            "score": 1,
            "text": "So this is what waking up from a 10 year coma feels like.",
            "title_similarity": "0.3335548",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h1h2sf2",
            "score": 1,
            "text": "Buzzfeed... well, fuck.",
            "title_similarity": "0.24075463",
            "sentiment_compound": -0.34
        },
        {
            "id": "h1h313i",
            "score": 1,
            "text": "Never though i would see the day buzzfeed win any real awards",
            "title_similarity": "0.2895093",
            "sentiment_compound": 0.7783
        },
        {
            "id": "h1h36jo",
            "score": 1,
            "text": "Wowzers",
            "title_similarity": "-0.04110562",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1h38gv",
            "score": 1,
            "text": "Readers HATE this one trick…",
            "title_similarity": "0.24016687",
            "sentiment_compound": -0.6633
        },
        {
            "id": "h1h3c5s",
            "score": 1,
            "text": "What was done about it though?",
            "title_similarity": "0.027087128",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1h3qbk",
            "score": 1,
            "text": "Well done, Buzzfeed. This is characater development.",
            "title_similarity": "0.29127604",
            "sentiment_compound": 0.2732
        },
        {
            "id": "h1h3uox",
            "score": 1,
            "text": "*sends their twin Ahgem*",
            "title_similarity": "0.23627731",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1h4e92",
            "score": 1,
            "text": "I'm sorry what?",
            "title_similarity": "-0.022643235",
            "sentiment_compound": -0.0772
        },
        {
            "id": "h1h4ej7",
            "score": 1,
            "text": "Buzzfeed news team been doing actual good journalism for some years now.",
            "title_similarity": "0.46017215",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h1h4hnh",
            "score": 1,
            "text": "Props on them. Once again Reddit in a circlejerk, when I know damn well ya' don't even read articles",
            "title_similarity": "0.44298223",
            "sentiment_compound": -0.1531
        },
        {
            "id": "h1h4mvc",
            "score": 1,
            "text": "it used to be tabloid level but now wow",
            "title_similarity": "0.35118163",
            "sentiment_compound": 0.7351
        },
        {
            "id": "h1h4w2y",
            "score": 2,
            "text": "Gives us hope that maybe somebody can speak out about the Wuhan lab leak as well",
            "title_similarity": "0.5059319",
            "sentiment_compound": 0.3818
        },
        {
            "id": "h1h521h",
            "score": 1,
            "text": "\"A former US Treasury Official was sentenced to prison just last week for leaking the thousands of secret government documents that served as its genesis.\"\n\n\nDoesn't this strike anyone as fucked up? Whistleblower gets prison, new outlet gets award for breaking the story.",
            "title_similarity": "0.71662635",
            "sentiment_compound": -0.7459
        },
        {
            "id": "h1h54vq",
            "score": 2,
            "text": "??? I just did a quiz on Buzzfeed that said they could guess my age by picking my favourite food?  Everyone likes pizza, c'mon!!",
            "title_similarity": "0.45862317",
            "sentiment_compound": 0.6535
        },
        {
            "id": "h1h5ah6",
            "score": 1,
            "text": "A new age in journalism",
            "title_similarity": "0.26799533",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1h5deq",
            "score": 1,
            "text": "For all the dumb lists and quizzes they publish, their actual news is well-researched and well-written. The expose on St. Joseph's orphanage just floored me.",
            "title_similarity": "0.59162873",
            "sentiment_compound": -0.5994
        },
        {
            "id": "h1h5wn0",
            "score": 1,
            "text": "Wait, you're telling me BuzzFeed did something good?",
            "title_similarity": "0.2894449",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h1h67bb",
            "score": 2,
            "text": "YOU WONT BELIEVE DETAINMENT NUMBER 4",
            "title_similarity": "0.20224404",
            "sentiment_compound": -0.1936
        },
        {
            "id": "h1h6hca",
            "score": 1,
            "text": "What the fuck buzzfeed! Amazing!",
            "title_similarity": "0.22653443",
            "sentiment_compound": 0.2225
        },
        {
            "id": "h1h6oxm",
            "score": 1,
            "text": "Buzzfeed used to be a joke\n\nTheOnion was satire\n\nThen we couldn't tell anymore\n\nRegular news sites became a joke and Buzzfeed actually put out quality content over time, how the times have changed",
            "title_similarity": "0.5454816",
            "sentiment_compound": 0.5267
        },
        {
            "id": "h1h77th",
            "score": 1,
            "text": "I wish Ellie would stop reporting on the Kadashians.",
            "title_similarity": "0.4143687",
            "sentiment_compound": 0.128
        },
        {
            "id": "h1h7b3l",
            "score": 1,
            "text": "Wow BuzzFeed actually did something useful for once.",
            "title_similarity": "0.21254754",
            "sentiment_compound": 0.7717
        },
        {
            "id": "h1h7id2",
            "score": 1,
            "text": "They’ve were the first to discover some Russian money laundering thing as well seems that’s were all the quiz money goes to",
            "title_similarity": "0.6309445",
            "sentiment_compound": 0.2732
        },
        {
            "id": "h1h7mru",
            "score": 1,
            "text": "Honestly it's strange seeing the word Pulitzer and BuzzFeed and not seeing \"Is racist\" or \"Which Prize winner are you\"",
            "title_similarity": "0.50551426",
            "sentiment_compound": 0.9104
        },
        {
            "id": "h1h7qst",
            "score": 2,
            "text": "I could talk shit about buzzfeed all day, but I remember when this broke. I remember reading, being shocked, and looking to confirm elsewhere. I had a realization after a moment that any rumblings from other sources were only quoting the original buzzfeed piece. \n\nWould describe it as a “oh okurrrrrr I see you buzzfeed”-type moment for me. Take some gold.",
            "title_similarity": "0.5511568",
            "sentiment_compound": -0.657
        },
        {
            "id": "h1h7voc",
            "score": 1,
            "text": "Ok but it looks like these three got to choose the photo displayed and this man decided to submit this gorgeous closeup.",
            "title_similarity": "0.3675875",
            "sentiment_compound": 0.9095
        },
        {
            "id": "h1h7w0p",
            "score": 1,
            "text": "Never thought I'd see the day...",
            "title_similarity": "0.11489025",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1h808y",
            "score": 1,
            "text": "Hopefully these journalists find a better publication or, better yet, start their own at some point. Because, as great as it is that Buzzfeed gave these journalists a shot in the first place, the publication itself, overall, is garbage & they've outgrown Buzzfeed at this point. \n\nCongrats to these journalists for doing an awesome job. & I hope they do some more fulfilling work.",
            "title_similarity": "0.5155282",
            "sentiment_compound": 0.9719
        },
        {
            "id": "h1h9pdg",
            "score": 1,
            "text": "\\#4 will shock you!",
            "title_similarity": "0.1972976",
            "sentiment_compound": -0.4389
        },
        {
            "id": "h1habyg",
            "score": 1,
            "text": "Why does this have an 81% upvote percent? WHO DOWNVOTED THIS!",
            "title_similarity": "0.34938595",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1hac4b",
            "score": 2,
            "text": "\"Top 10 detention camps you wouldn't believe exist\", yeah I'm a Griffindor..",
            "title_similarity": "0.46984363",
            "sentiment_compound": -0.3794
        },
        {
            "id": "h1hatqk",
            "score": 16,
            "text": "FoxNews: Claims to news, is buzz\n\nBuzzFeed: Claims to be Buzz, is news",
            "title_similarity": "0.43266135",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1hb62v",
            "score": 1,
            "text": "[deleted]",
            "title_similarity": "0.027378835"
        },
        {
            "id": "h1hbx9b",
            "score": 1,
            "text": "The try guys",
            "title_similarity": "0.06814176",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1hc6el",
            "score": 1,
            "text": "Now do the synthetic shares with GameStop.",
            "title_similarity": "0.16177909",
            "sentiment_compound": 0.296
        },
        {
            "id": "h1hd1ro",
            "score": 1,
            "text": "Buzzfeed news and Buzzfeed Unsolved are carrying the entire company",
            "title_similarity": "0.49241143",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1hd39g",
            "score": 1,
            "text": "r/aboringdystopia",
            "title_similarity": "0.04728814",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1hdbmh",
            "score": 1,
            "text": "Why are so many people upset over this? Buzzfeed the site is trash but Buzzfeed News has a stellar history of journalism.",
            "title_similarity": "0.60179174",
            "sentiment_compound": -0.2339
        },
        {
            "id": "h1hdkl5",
            "score": 1,
            "text": "Finally hired some talent",
            "title_similarity": "0.10892519",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h1hdxeg",
            "score": 1,
            "text": "Is this the same buzzfeed i know?",
            "title_similarity": "0.22044235",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1hdyhf",
            "score": 1,
            "text": "This is wild. This company started by making cheap sharable quizzes on Facebook.",
            "title_similarity": "0.5409626",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1heqep",
            "score": 1,
            "text": "I didn't know Buzzfeed gives news",
            "title_similarity": "0.32601488",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1hfvxb",
            "score": 1,
            "text": "Why not for their incredible coverage of the correlation between sandwich customization choices and shrek characters?",
            "title_similarity": "0.32920805",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1hg7b4",
            "score": 1,
            "text": "You say first like there’s more to come....",
            "title_similarity": "-0.018463735",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h1hghee",
            "score": 1,
            "text": "Vox and buzzfeed are 2 source of news I assumed were all click bait and bad source of information",
            "title_similarity": "0.5066081",
            "sentiment_compound": -0.5423
        },
        {
            "id": "h1hgn0f",
            "score": 1,
            "text": "This feels like a Bojack Horseman episode.",
            "title_similarity": "0.23423424",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h1hgnaa",
            "score": 1,
            "text": "I’m just glad buzzfeed stopped sucking Chrissy tiegens pan faced dick and moved onto that little boy Demi lovato. Actually demis pretty fucking annoying too",
            "title_similarity": "0.43567544",
            "sentiment_compound": -0.2484
        },
        {
            "id": "h1hguph",
            "score": 1,
            "text": "Hold up, did Buzzfeed actually write an article that wasn't clickbait and actually contains good information?",
            "title_similarity": "0.4871096",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h1hgwdo",
            "score": 1,
            "text": "Detain Muslims with this one weird trick! Strange times indeed.",
            "title_similarity": "0.43757364",
            "sentiment_compound": -0.6996
        },
        {
            "id": "h1hh69b",
            "score": 1,
            "text": "Look “news channels”. This is what real journalism looks like.  Remember? Of course you don’t.",
            "title_similarity": "0.4608212",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h1hhoqd",
            "score": 2,
            "text": "Wow... they did a real thing with it and not “7 reasons China detains Muslims(and #4 will amaze you)”. I’d have to say good for them for actually doing real news, and I know they do occasionally actually partake in real journalism. Just never thought I’d hear Pulitzer and BuzzFeed in the same sentence unless it was “BuzzFeed isn’t up for a Pulitzer”. Bravo. Seriously bravo!",
            "title_similarity": "0.7351067",
            "sentiment_compound": 0.8777
        },
        {
            "id": "h1hhrur",
            "score": 1,
            "text": "This is going to be brought up in so many new smug ways",
            "title_similarity": "0.15577042",
            "sentiment_compound": 0.2648
        },
        {
            "id": "h1hhydw",
            "score": 1,
            "text": "I have read a lot of thoughtful investigative journalism pieces from Buzzfeed News. I can appreciate their business model if it means I don’t have to go thru a paywall to learn myself.",
            "title_similarity": "0.5605868",
            "sentiment_compound": 0.6486
        },
        {
            "id": "h1hi1cs",
            "score": 1,
            "text": "They finally did real news. Not dumb everyone churn out an article every day news.",
            "title_similarity": "0.411145",
            "sentiment_compound": 0.4023
        },
        {
            "id": "h1hi8mk",
            "score": 1,
            "text": "“China is going to eat our lunch? Come on, man,”\n\n“I mean, you know, they’re not bad folks, folks.”",
            "title_similarity": "0.41933638",
            "sentiment_compound": 0.431
        },
        {
            "id": "h1hj0eq",
            "score": 1,
            "text": " Chinese culture",
            "title_similarity": "0.32120577",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1hl38d",
            "score": 1,
            "text": "We never doubted you for a second, BuzzFeed",
            "title_similarity": "0.2934209",
            "sentiment_compound": 0.2057
        },
        {
            "id": "h1hlnpw",
            "score": 1,
            "text": "But the internet told be that BuzzFeed was cringe",
            "title_similarity": "0.39867485",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1hm6m7",
            "score": 1,
            "text": "For once, buzzfeed is actually doing something useful",
            "title_similarity": "0.19250919",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h1hmgyp",
            "score": 1,
            "text": "Can we all as nations just come together and withdrawal all ties we have with China ? Yeah there will be some losses, but we can recover !",
            "title_similarity": "0.615601",
            "sentiment_compound": -0.126
        },
        {
            "id": "h1hnby6",
            "score": 1,
            "text": "Really can’t believe what I am reading here. Please if you are criticising Buzz feed state the reasons why point by point . Can’t handle the truth?",
            "title_similarity": "0.42318904",
            "sentiment_compound": 0.2263
        },
        {
            "id": "h1hndlz",
            "score": 2,
            "text": "Serpentenza and laowhy86 on YouTube have both individually done a lot more than this. They deserve so much more recognition.",
            "title_similarity": "0.2843224",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1hnyd4",
            "score": 1,
            "text": "What the fuck?",
            "title_similarity": "-0.015243654",
            "sentiment_compound": -0.5423
        },
        {
            "id": "h1hoju4",
            "score": 1,
            "text": "I never thought buzzfeed would ever receive a Pulitzer. Good for them, I was always under the impression they just put out useless spam, but I guess I was wrong.",
            "title_similarity": "0.4949712",
            "sentiment_compound": -0.6597
        },
        {
            "id": "h1hqwqu",
            "score": 2,
            "text": "Didn't they win one for the \"what kind of potato are you\" quiz ?",
            "title_similarity": "0.3460434",
            "sentiment_compound": -0.4717
        },
        {
            "id": "h1hrsgm",
            "score": 1,
            "text": "Almost aiming the onion would post",
            "title_similarity": "0.24985147",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1hsek0",
            "score": 1,
            "text": "80% upvoted, there must be a lot of ccp agents here",
            "title_similarity": "0.34475386",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1htbax",
            "score": 1,
            "text": "Seriously wish the Muslims would go open a can of jihad on the Chinese",
            "title_similarity": "0.6875113",
            "sentiment_compound": 0.25
        },
        {
            "id": "h1hv9d3",
            "score": 1,
            "text": "Ironically, Vice has also done a complete 180 and has started doing the boots on the ground investigative journalism they were known for again. They've been putting out really good videos over the last few months.",
            "title_similarity": "0.55942655",
            "sentiment_compound": 0.4927
        },
        {
            "id": "h1hvwhw",
            "score": 1,
            "text": "This is not a title I ever expected to read.",
            "title_similarity": "0.1168791",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1hw0op",
            "score": 3,
            "text": "Congratulations to these amazing journalist",
            "title_similarity": "0.28784257",
            "sentiment_compound": 0.8271
        },
        {
            "id": "h1hwa93",
            "score": 3,
            "text": "And so many Americans: oh It is fine and I don’t mind my data being used and send back to China while I’m on tiktok doing some freaking stupid challenges.",
            "title_similarity": "0.6344047",
            "sentiment_compound": -0.6249
        },
        {
            "id": "h1hwflh",
            "score": 1,
            "text": "Does anyone have a link to the article that won? I’m interested in a read but I thought buzzfeed was what made those fb quizzes",
            "title_similarity": "0.521527",
            "sentiment_compound": 0.4939
        },
        {
            "id": "h1hwstx",
            "score": 1,
            "text": "BuzzFeed is a perfect example of us getting the media we deserve.\n\nThose shitty clickbait articles everyone complains about are easy to produce and get lots of views. Doing actual journalism is difficult,  expensive and nowhere near as popular.",
            "title_similarity": "0.5004841",
            "sentiment_compound": -0.5318
        },
        {
            "id": "h1hwvsq",
            "score": 1,
            "text": "When the satire joke site manages better reporting than most of international journalism",
            "title_similarity": "0.44805047",
            "sentiment_compound": 0.6249
        },
        {
            "id": "h1hx9hs",
            "score": 1,
            "text": "Top ten reasons BuzzFeed has a Pulitzer Prize: 10. They started doing actually news...",
            "title_similarity": "0.5378206",
            "sentiment_compound": 0.6249
        },
        {
            "id": "h1hxbik",
            "score": 1,
            "text": "It's crazy that the site that used to publish \"which butt plug are you?\" Personality quizzes wound up here",
            "title_similarity": "0.45027566",
            "sentiment_compound": -0.34
        },
        {
            "id": "h1hzhow",
            "score": 1,
            "text": "5 simple tricks the Chinese government doesn’t want you to know!",
            "title_similarity": "0.56823695",
            "sentiment_compound": -0.126
        },
        {
            "id": "h1i00rg",
            "score": 3,
            "text": "Detaining is a nice word for slaving",
            "title_similarity": "0.21900047",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h1i0t1s",
            "score": 1,
            "text": "I'll wait for the prize to be posthumously retracted from [Walter Duranty and The New York Times](https://en.wikipedia.org/wiki/Walter_Duranty) before I consider this a valid endorsement of reporting on a Communist regime's crimes.",
            "title_similarity": "0.6276504",
            "sentiment_compound": 0.6808
        },
        {
            "id": "h1i2aqe",
            "score": 2,
            "text": "I like to think BuzzFeed deliberately fosters the shittiest rep possible on its main site so that its news division can use obfuscating stupidity to its advantage. Which would seem more threatening to an exposee - a journalist from the Washington Post or something, or that one dude from BuzzFeed? Prolly lots of people letting their guard down.",
            "title_similarity": "0.65252006",
            "sentiment_compound": -0.8173
        },
        {
            "id": "h1i40vi",
            "score": 1,
            "text": "As someone who's taken university classes on this many years ago this is surprising lol many many authors have written about this and translated hundreds if not more documents. Then again the Pulitzer Prize givers aren't known for their own investigative procedures.",
            "title_similarity": "0.4866224",
            "sentiment_compound": 0.872
        },
        {
            "id": "h1i43ir",
            "score": 2,
            "text": "Wow BuzzFeed doing something good",
            "title_similarity": "0.12641977",
            "sentiment_compound": 0.7717
        },
        {
            "id": "h1i4g3r",
            "score": 2,
            "text": "Congratulations",
            "title_similarity": "-0.042380333",
            "sentiment_compound": 0.5994
        },
        {
            "id": "h1i4u0r",
            "score": 2,
            "text": "now we got to give a pulitzer prize to the person who exposed Dr. Fauci",
            "title_similarity": "0.6291046",
            "sentiment_compound": 0.4588
        },
        {
            "id": "h1i5eo2",
            "score": 2,
            "text": "I hate Buzzfeed as much as the next guy, but this is great. Fuck the CCP",
            "title_similarity": "0.46820077",
            "sentiment_compound": -0.1154
        },
        {
            "id": "h1ib75t",
            "score": 1,
            "text": "Now only if they can shed some of the integrity to the click bait shitty content projects under the same corporate umbrella...",
            "title_similarity": "0.5041909",
            "sentiment_compound": -0.25
        },
        {
            "id": "h1icp1i",
            "score": 2,
            "text": "I know the article in question is almost a year old but I was reading about the Uighur camps before Buzzfeed wrote about them. Maybe they had the first widely read article on the topic? I don’t know. At least more and more people are becoming aware of China’s recent atrocities.",
            "title_similarity": "0.71181613",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1if1q6",
            "score": 2,
            "text": "Buzzfeed doing real journalism!? Hell yeah! Keep it up.",
            "title_similarity": "0.4059341",
            "sentiment_compound": -0.6103
        },
        {
            "id": "h1ik0d4",
            "score": 1,
            "text": "Wow, maybe they aren’t complete trash.",
            "title_similarity": "0.0322237",
            "sentiment_compound": 0.5859
        },
        {
            "id": "h1io8di",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "-0.022555217"
        },
        {
            "id": "h1irgb6",
            "score": 6,
            "text": "Pooh-bear is pissed",
            "title_similarity": "0.21664557",
            "sentiment_compound": -0.6369
        },
        {
            "id": "h1iv9yw",
            "score": 1,
            "text": "Weird character arc",
            "title_similarity": "0.048056286",
            "sentiment_compound": -0.1779
        },
        {
            "id": "h1j171b",
            "score": 1,
            "text": "Wow, they actually contributed. Nice.",
            "title_similarity": "0.0030138837",
            "sentiment_compound": 0.765
        },
        {
            "id": "h1j47tw",
            "score": 2,
            "text": "The onion editors must be super pissed about now",
            "title_similarity": "0.4063102",
            "sentiment_compound": -0.0772
        },
        {
            "id": "h1j4v1l",
            "score": 2,
            "text": "Every dog has his day! Never stop tryin!",
            "title_similarity": "0.13243191",
            "sentiment_compound": 0.3553
        },
        {
            "id": "h1j4xjt",
            "score": 2,
            "text": "Good show",
            "title_similarity": "-0.0006531272",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h1jfvwp",
            "score": 6,
            "text": "For gods sake finally someone has talked about it.",
            "title_similarity": "0.062577136",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1kh3gl",
            "score": 1,
            "text": "Wait, they do real news now?",
            "title_similarity": "0.16944835",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1kvc0y",
            "score": 1,
            "text": "Serious societal/government doublemindedness there, them earning a pulitzer price for exposing corruption and their source being jailed (albeit a fairly light sentence).",
            "title_similarity": "0.6235111",
            "sentiment_compound": -0.6486
        },
        {
            "id": "h1lfgbr",
            "score": 2,
            "text": "Buzzfeed is a fucking enigma. Their journalists are top notch as is their devotion to the role of the news in society. \n\nBut otherwise they're a shitshow of click bait and trashy tabloid crap.",
            "title_similarity": "0.5996332",
            "sentiment_compound": -0.25
        },
        {
            "id": "h1m38yy",
            "score": 2,
            "text": "Fuck the Chinese government.",
            "title_similarity": "0.5539588",
            "sentiment_compound": -0.5423
        },
        {
            "id": "h1qhc6l",
            "score": 1,
            "text": "Thought they got all stories from reddit",
            "title_similarity": "0.4194267",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1qrsqo",
            "score": 1,
            "text": "How attractive are buzz fed reporters? Swipe to find out it’s one out of three.",
            "title_similarity": "0.44180858",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h1t2w71",
            "score": 2,
            "text": "wouldn't have won if they exposed israel's crime this year",
            "title_similarity": "0.54617083",
            "sentiment_compound": -0.7781
        },
        {
            "id": "h1th5e6",
            "score": 1,
            "text": "Name a better character arc...I’ll wait",
            "title_similarity": "0.10278376",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h1tplav",
            "score": 1,
            "text": "News",
            "title_similarity": "0.09481368",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1w3ks9",
            "score": 1,
            "text": "All these people’s hard work for nothing since nobody will ever do anything about it. The Holocaust 2 is happening and we’re all just watching it happen.",
            "title_similarity": "0.38047823",
            "sentiment_compound": -0.1027
        },
        {
            "id": "h1x0oto",
            "score": 1,
            "text": "Wait buzzfeed actually did something good for once?",
            "title_similarity": "0.28708786",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h1x7lyb",
            "score": 1,
            "text": "If buzzfeed won a Pulitzer, I can win an Oscar",
            "title_similarity": "0.5156071",
            "sentiment_compound": 0.8176
        },
        {
            "id": "h1xhzeo",
            "score": 1,
            "text": "Commie bastards!",
            "title_similarity": "0.19342889",
            "sentiment_compound": -0.6476
        },
        {
            "id": "h1xif06",
            "score": 1,
            "text": "Newsbuzz by feed",
            "title_similarity": "0.33111244",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1xkqb3",
            "score": 1,
            "text": "OMG...  the people who have been paying attention to this regime and the handling on the Uyghurs have known about this for decades.  Woah!  Now we recognize this?  Please.",
            "title_similarity": "0.43328846",
            "sentiment_compound": 0.4436
        },
        {
            "id": "h1xyutr",
            "score": 3,
            "text": "I saw their article and there is no clear evidence to support it. All I saw was just construction of buildings but the thing is those buildings could been anything. I need to see mroe clear evidence than just satellite photos of some buildings being raised because those buildings could been raised for anything. BTW how come they would cover this on China but turn the other way for the US internment camps? Seems sketch. Along with that Pedophile ring and Satanic rituals.",
            "title_similarity": "0.61619556",
            "sentiment_compound": 0.5659
        },
        {
            "id": "h1yt4qo",
            "score": 1,
            "text": "I think this says as much about the state of the rest of the news media as it does about BuzzFeed",
            "title_similarity": "0.55784607",
            "sentiment_compound": 0.0
        },
        {
            "id": "h21m0m0",
            "score": 1,
            "text": "Good. Now take it away and tell them to fuck themselves for dragging journalism through the mud and giving millions of people terminal cancer by subjecting them to their tabloid filth.",
            "title_similarity": "0.6668992",
            "sentiment_compound": -0.5574
        },
        {
            "id": "h21qv84",
            "score": 1,
            "text": "The Chinese cannot win awards for the news that \"**everyone in American prisons has religious beliefs**\", it is too unfair!😥",
            "title_similarity": "0.60874015",
            "sentiment_compound": -0.4153
        },
        {
            "id": "h22mt7e",
            "score": 1,
            "text": "Old school journalism is the opposite of lucrative.\n\nBuzzFeed has such a toxic reputation because its quirks are specifically designed to generate as much money as possible via ad revenue.\n\nBuzzFeed News is, in all likelihood, built on that foundation and is using it to stay afloat. Obviously they still could by changing their name, assuming they remain the same entity.\n\nBut, controversy sells. A notorious and “internet poison” company suddenly winning awards because its news branch is the exact opposite of what everyone defines BuzzFeed by is far more attention grabbing than some random upstart news site.\n\nIt almost certainly does help the brand. It’s what built their brand.",
            "title_similarity": "0.6158357",
            "sentiment_compound": 0.8901
        },
        {
            "id": "h260cyz",
            "score": 1,
            "text": "r/fucktheCCP",
            "title_similarity": "0.12109754",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2697kp",
            "score": 1,
            "text": "Fuck buzzfeed",
            "title_similarity": "0.26041183",
            "sentiment_compound": -0.5423
        },
        {
            "id": "h26sr7l",
            "score": 1,
            "text": "They need to change it to detaining wahabbi extremists. They’re not bothering Sufi Muslims",
            "title_similarity": "0.4427035",
            "sentiment_compound": 0.2924
        },
        {
            "id": "h26ur88",
            "score": 1,
            "text": "BuzzFeed, Vice, Vox, and many others, thank you for existing! More to come, I hope",
            "title_similarity": "0.21727058",
            "sentiment_compound": 0.69
        },
        {
            "id": "h29a1x1",
            "score": 1,
            "text": "Buzzfeedgot credit for it? What? Despite the fact that Republicans have been pointing it out for years?",
            "title_similarity": "0.49677533",
            "sentiment_compound": 0.4836
        },
        {
            "id": "h2cf33k",
            "score": 1,
            "text": "Who knew you could get awards for propagating lies and avoiding the truth because of a political party you disagree with and then reporting on the same thing all over a year later as if it just magically happened.......🤦🏼‍♂️🤦🏼‍♂️🤦🏼‍♂️",
            "title_similarity": "0.6484004",
            "sentiment_compound": 0.0516
        },
        {
            "id": "h2wpcj7",
            "score": 1,
            "text": "Such the same with VICE, those middle-east and war documentaries are high quality, but the other clickbait woke stuff kinda ruins their image.",
            "title_similarity": "0.50424635",
            "sentiment_compound": -0.706
        },
        {
            "id": "h317y0h",
            "score": 1,
            "text": "National Enquirer you are next",
            "title_similarity": "0.17687172",
            "sentiment_compound": 0.0
        },
        {
            "id": "h32ejt8",
            "score": 1,
            "text": "At least someone wants to talk about how we're ignoring the genocide and ethnic cleansing committed by a ruthless communist regime masquerading as a cheap source for cute furniture. But hey, it's easier to crucify people from the US over the costume they wore at a college party in the 80s.",
            "title_similarity": "0.6262914",
            "sentiment_compound": 0.8381
        },
        {
            "id": "h33p9uv",
            "score": 1,
            "text": "Something that they don't deserve.   \nThere is no detaining. I read Buzzfeed article and it was just some satellite image from above, it shows nothing but buildings.\n\nhttps://www.youtube.com/watch?v=unpUSB3ne6M",
            "title_similarity": "0.38060528",
            "sentiment_compound": -0.1531
        },
        {
            "id": "h34xddk",
            "score": 1,
            "text": "Win a Pulitzer for false news.",
            "title_similarity": "0.63571393",
            "sentiment_compound": 0.5859
        },
        {
            "id": "h35wsyq",
            "score": 1,
            "text": "Happy for Muslims humans and even happier for BuzzFeed News by beating those old legacy agencies that forgot what real journalism is all about.",
            "title_similarity": "0.5655453",
            "sentiment_compound": 0.6249
        },
        {
            "id": "h36smmv",
            "score": 1,
            "text": "Finally took them a while to do something good.",
            "title_similarity": "0.046289004",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h3eq2t6",
            "score": 1,
            "text": "Wait, Buzzfeed? BuzzFeed doing real news?!? Thought I'd never see the day.",
            "title_similarity": "0.45625603",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3eu4y2",
            "score": 1,
            "text": "It's really odd to me how people will defend Muslims while in Muslim countries people are killed for being gay but will hate on U.S. Christians for not being accepting of or supporting it.",
            "title_similarity": "0.5688094",
            "sentiment_compound": -0.8187
        },
        {
            "id": "h3hb0c9",
            "score": 1,
            "text": "I am completely shocked that Buzzfeed just won a pulitzer.. what planet are we living on. I guess I could be way behind the times. but yeah, this seems highly irregular",
            "title_similarity": "0.5615807",
            "sentiment_compound": 0.5193
        },
        {
            "id": "h3nzy7i",
            "score": 1,
            "text": "I have a lot of problems with Buzzfeed, but wow. Bravo",
            "title_similarity": "0.37199032",
            "sentiment_compound": 0.6542
        },
        {
            "id": "h3vw1x2",
            "score": 1,
            "text": "Wait buzzfeed actually does journalism? Like, *real* journalism?? Fuck me, never thought I’d see the day. Time to rebrand.",
            "title_similarity": "0.59697855",
            "sentiment_compound": -0.3695
        },
        {
            "id": "h45v32p",
            "score": 1,
            "text": "Buzzfeed news are a bunch of cunts that manipulate interviewees and deliberately misinterpret foreign  translations to fit their liberal agenda. A monkey in a suit would of won a Pulitzer prize for doing a piece on china's Muslim camps as it's a people pleaser.",
            "title_similarity": "0.7241283",
            "sentiment_compound": 0.8074
        },
        {
            "id": "h48fmil",
            "score": 1,
            "text": "Fauci emails AND Muslim camps from buzzfeed? Tf this really is the Twilight Zone.",
            "title_similarity": "0.5286507",
            "sentiment_compound": 0.0
        },
        {
            "id": "h48l3wh",
            "score": 1,
            "text": "Find creative ways to use your period blood in prison here !! (We are so quirky)",
            "title_similarity": "0.4243378",
            "sentiment_compound": -0.2462
        },
        {
            "id": "h4llr7d",
            "score": 1,
            "text": "Buzzfeed: “Wait, we *actually* made relevant content?”",
            "title_similarity": "0.28354812",
            "sentiment_compound": 0.0
        },
        {
            "id": "h4quqrr",
            "score": 1,
            "text": "Zoom. W",
            "title_similarity": "-0.056669477",
            "sentiment_compound": 0.0
        },
        {
            "id": "h4s1hrp",
            "score": 1,
            "text": "It’s not big news! So what! What about exposing China for making corona viruses! Who cares about what they do to Muslims? Look what they do to their own people! Win a Pulitzer on that!",
            "title_similarity": "0.80563045",
            "sentiment_compound": 0.7825
        },
        {
            "id": "h5j5vun",
            "score": 1,
            "text": "Next do a story on buzzfeed constantly being accused of plagiarizing or the fact they pay hardly anything to video creators that routinely get millions of views for them and help their company grow and how they’re constantly treated like shit",
            "title_similarity": "0.56507105",
            "sentiment_compound": -0.25
        }
    ]
}