{
    "Sister Lucy, the nun who took Bishop Franco Mulakkal head-on in a rape case, has now been permanently expelled from the Church. The Catholic Church has rejected her appeal, stripped her of sisterhood & asked her to vacate her convent within a week.\n": [
        {
            "id": "h21w4m7",
            "score": -9,
            "text": "[deleted]",
            "title_similarity": "0.29835454"
        },
        {
            "id": "h2210vw",
            "score": 31,
            "text": "[deleted]",
            "title_similarity": "0.29835454"
        },
        {
            "id": "h22c2ch",
            "score": 0,
            "text": "This is the point where people should renounce their faith, or at the very least stop aligning themselves to the Catholic church.",
            "title_similarity": "0.6661624",
            "sentiment_compound": 0.0828
        },
        {
            "id": "h223a92",
            "score": 29,
            "text": "[removed]",
            "title_similarity": "0.25901917"
        },
        {
            "id": "h226bxf",
            "score": -22,
            "text": "She was not expelled from the Church, that's not what the article says. She was expelled from her congregation of nuns (Franciscan Clarist Congregation). And the reason is that she was not living the vows a nun makes. If she doesn't want to live like a nun, not being a nun seems like the logical choice.",
            "title_similarity": "0.7185844",
            "sentiment_compound": 0.5451
        },
        {
            "id": "h2296rl",
            "score": 28,
            "text": "When will everyone start seeing churches for what they really are?  ...Cults.\n\nThey're all the same.  They brainwash people into putting faih in the cult before logic and reason.  They worship some God Zeus or some shit.  Then they kill each other over interpretations of cult lore.  They also like to steal from their followers and rape their kids because they're all pedophile psychopaths.\n\nMy mom is trying to get my kid to go to preschool at a church.  I told her I didn't want my kid brainwashed by some religious fruit cakes.  She said that my nephew wasn't taught religious stuff.  I then asked my nephew if they taught anything about religion.  \"Yes!  Once a week!\". ...Cults\n\nI was baptized and went to preschool at a Catholic church.  I remember preschool being pretty uneventful.  But I do remember going into the church and them telling us about it, and we went by the \"father's\" house to say hi.  That shit was off now that I think about it.  Like all of us kids walked by his door and said hi.  I remember seeing a bunch of empty liquor bottles.  Catholics drink.  But it was super weird and I'm grateful I didn't become a victim like we hear about too often.\n\nCatholic churches are beautiful, but the Catholic religion can go fuck itself.  Renounce your faith and rejoin humanity.",
            "title_similarity": "0.7492322",
            "sentiment_compound": 0.9089
        },
        {
            "id": "h22225x",
            "score": 22,
            "text": "What an evil cult.",
            "title_similarity": "0.36610746",
            "sentiment_compound": -0.6597
        },
        {
            "id": "h22ibeg",
            "score": 2,
            "text": "[deleted]",
            "title_similarity": "0.29835454"
        },
        {
            "id": "h22zxah",
            "score": 0,
            "text": "Title is misleading - she intentionally broke rules of the religious order she was a part of, and that's why she was expelled.  Yes - she took part in a protest, and Bishop Franco was later arrested, but it seems like the rule violations were her downfall. These may seem like small things, but religious orders have very strict guidelines.   \n\n*The Clarist congregation, a Catholic religious order based near Kochi, had cited several reasons for dismissing Sr. Lucy from the order in 2019. The reasons included her failure to explain adequately her violating the rules of the religious order and her not wearing her religious habit. She was also accused of obtaining a driver’s licence without permission of the superiors, of buying a car and publishing a book of poetry.*",
            "title_similarity": "0.8030126",
            "sentiment_compound": -0.9267
        },
        {
            "id": "h225spe",
            "score": 1,
            "text": "Horrible institution. Just a bunch of hypocrites who like to claim moral superiority when in fact they are so far off from what Jesus said.",
            "title_similarity": "0.41330427",
            "sentiment_compound": 0.1027
        },
        {
            "id": "h21xsxa",
            "score": 6,
            "text": "Ahhh religion never lets me down.",
            "title_similarity": "0.27254152",
            "sentiment_compound": 0.0
        },
        {
            "id": "h226310",
            "score": 9,
            "text": "[deleted]",
            "title_similarity": "0.29835454"
        },
        {
            "id": "h22bqeb",
            "score": 3,
            "text": "Fuck the Catholic church and anyone that supports this cult.",
            "title_similarity": "0.71054476",
            "sentiment_compound": -0.25
        },
        {
            "id": "h22fup7",
            "score": 4,
            "text": "Religion is an outdated sickness. \n\nIt serves no purpose other than a tax free income, rehoming paedophiles, and keeping minds closed. \n\nIt is far past the purpose it once served - and causes much more division and unrequired fear, than any measure of good that it may be responsible for. \n\n\nThis goes for every flavour of fucked up, across the board.",
            "title_similarity": "0.57863665",
            "sentiment_compound": -0.3182
        },
        {
            "id": "h22a1g0",
            "score": 1,
            "text": "Remember this the next time you see Frankie the Wonderpope lecturing the world about morality. Unlike the things he lectures us about, he actually has the power to do something about this or prevent it in the first place. For that matter he could also force the church to hand over every file it has on every case of sexual abuse to the authorities.",
            "title_similarity": "0.5835563",
            "sentiment_compound": -0.2023
        },
        {
            "id": "h222583",
            "score": 15,
            "text": "Catholics covering up sexual abuse? \n\nSay it isn't so!",
            "title_similarity": "0.52544075",
            "sentiment_compound": -0.6696
        },
        {
            "id": "h2215nr",
            "score": 10,
            "text": "Just in case you didn't realise the institution of the Catholic church is pretty fucking evil",
            "title_similarity": "0.55757713",
            "sentiment_compound": -0.3597
        },
        {
            "id": "h228rxq",
            "score": 10,
            "text": "Disgusting. They’re actually firing her for reporting a rape.",
            "title_similarity": "0.7350079",
            "sentiment_compound": -0.8885
        },
        {
            "id": "h224vvs",
            "score": 9,
            "text": "[removed]",
            "title_similarity": "0.25901917"
        },
        {
            "id": "h221ubw",
            "score": 6,
            "text": "Shameful. Sister Lucy should be congratulated for having good character.",
            "title_similarity": "0.32830846",
            "sentiment_compound": -0.0772
        },
        {
            "id": "h229c5n",
            "score": -2,
            "text": "The Catholic Church (and its dogmatic supporters here on reddit) will continue to stick their head in the sand rather than ask hard questions about *all the raping being done in the name of Catholicism*.",
            "title_similarity": "0.54181767",
            "sentiment_compound": -0.5106
        },
        {
            "id": "h22rgih",
            "score": -2,
            "text": "The catholic Church is a cancer",
            "title_similarity": "0.5692121",
            "sentiment_compound": -0.6597
        },
        {
            "id": "h229wo4",
            "score": 6,
            "text": "[removed]",
            "title_similarity": "0.25901917"
        },
        {
            "id": "h23he6z",
            "score": 1,
            "text": "All Gods are Myths created by man to control the masses.\n\nThe history of the religion is an abomination against all of mankind.",
            "title_similarity": "0.5543364",
            "sentiment_compound": 0.25
        },
        {
            "id": "h21y689",
            "score": 365,
            "text": "This article is very misleading.  It frames it as if she was kicked out for speaking out against the Bishop when the charges against her were brought up years before that happened.  She was asked to leave years ago and has been appealing all the way up to the highest \"court\" in the church.  I'm not 100% sure, but I'm pretty sure she was first asked to leave before she even spoke out against the bishop.\n\nIt is also misleading because it downplays what she was accused of.  \n\n> she had been dismissed for reasons, including driving a vehicle, writing and publishing poems, and lending her support to the protests for the nun who had accused the Roman Catholic Bishop Mulakkal of repeatedly raping and sexually assaulting her.\n\nShe had a private sector job and kept her salary for herself and did not give it to her convent, which is against their rules.  She used that money to buy a personal vehicle and did not let the convent have access to it, which is also against the rules.  She got her license without permission from the convent, which may be a stupid rule, but it was a rule she knew before she did it.  She published a book of poems without clearing it with the convent, against the rules, and kept the money from the sales to herself, also against the rules.\n\nShe was constantly breaking the rules, so they started proceedings to kick her out because she was not willing to follow the rules of the convent that she joined, knowing the rules before she did.  During the process to kick her out, she joined the protests and spoke out against the bishop.  So, while that probably did not help her in her appeals, it was not the reason she was kicked out.\n\nWe can disagree with the rules of the convent all we want, but she knew them when she joined.  She willingly broke them.  Despite what this article, and many others, try to insinuate, she was not kicked out for speaking up against a Bishop.  That came far into the process that had started long before she said anything about it.\n\nI'm not trying to defend the church, or their coverup of sexual abuse.  It is horrible and the church needs to do something about it.  But that is a separate issue and really has nothing to do with this case.  The only reason they bring it up is because the only reason anyone cares, or even knows who she is, is because of her speaking up about the bishop.  If that had not happened, this would just be a story about a nun who broke many rules and was asked to leave and nobody would give a shit.  It would be like every other story about someone who didn't think the rules at work applied to them and they got fired because of it.",
            "title_similarity": "0.8324169",
            "sentiment_compound": -0.9945
        },
        {
            "id": "h22ajzj",
            "score": -2,
            "text": "People are still Catholic after the Luther patch?",
            "title_similarity": "0.36092925",
            "sentiment_compound": 0.0
        },
        {
            "id": "h221fzz",
            "score": 8,
            "text": "Why these people have any credibility in culture is beyond me. This is not just a few bad apples thing; it has been going on everywhere the church operates. Residential school survivors said the priest would rape them then force them to pray for forgiveness for the priest.",
            "title_similarity": "0.6674017",
            "sentiment_compound": -0.7003
        },
        {
            "id": "h21vj4t",
            "score": 7,
            "text": "At least the lord will forgive her? /s",
            "title_similarity": "0.22155866",
            "sentiment_compound": 0.2732
        },
        {
            "id": "h21xoz2",
            "score": 0,
            "text": "Galatians 4:16 Catholics.",
            "title_similarity": "0.31805933",
            "sentiment_compound": 0.0
        },
        {
            "id": "h22bahw",
            "score": 0,
            "text": "Fuck the Pope.",
            "title_similarity": "0.49833202",
            "sentiment_compound": -0.5423
        },
        {
            "id": "h22bzqe",
            "score": 0,
            "text": "What a shocker... wish we could just abolish the Catholic church altogether. Centuries of rape, murder, war I mean you name it the Catholics have done it and continue to do it to this day and never and I mean ever take responsibility or action to prevent it.",
            "title_similarity": "0.79433686",
            "sentiment_compound": -0.9201
        },
        {
            "id": "h226e7a",
            "score": 6,
            "text": "Born into Catholicism but left a long time ago.  F those monsters who are constantly defending sicko pedofiles and rapists. That cult has completely warped the minds of my loved ones who have been suffering from mental illnesses.",
            "title_similarity": "0.74034995",
            "sentiment_compound": -0.8765
        },
        {
            "id": "h23bi3m",
            "score": 0,
            "text": "This is why i openly and proudly say FUCK the Catholic Church.",
            "title_similarity": "0.58825684",
            "sentiment_compound": -0.1613
        },
        {
            "id": "h24swv1",
            "score": 0,
            "text": "what is it with religions and supporting pedophilia and rape, two major examples is catholic and muslim",
            "title_similarity": "0.4507442",
            "sentiment_compound": -0.4215
        },
        {
            "id": "h24u96a",
            "score": 0,
            "text": "The church has become a disgusting representation of what's supposed to be decent",
            "title_similarity": "0.50316966",
            "sentiment_compound": -0.5267
        },
        {
            "id": "h24ve1x",
            "score": 0,
            "text": "Fuck religion",
            "title_similarity": "0.39420512",
            "sentiment_compound": -0.5423
        },
        {
            "id": "h24vqhm",
            "score": 0,
            "text": "It's a great big world. Fuck the Catholic Church.",
            "title_similarity": "0.43335313",
            "sentiment_compound": 0.1531
        },
        {
            "id": "h2538t3",
            "score": 0,
            "text": "Fine, I'll go start my own church! with blackjack! And hookers!",
            "title_similarity": "0.56408197",
            "sentiment_compound": 0.3971
        },
        {
            "id": "h256jig",
            "score": 0,
            "text": "Ah yes organized religion your god really knows justice huh 😂",
            "title_similarity": "0.16027817",
            "sentiment_compound": 0.8854
        },
        {
            "id": "h25dagi",
            "score": 0,
            "text": "Jeeze! All the horrible shit involving child sexual abuse, murders/deaths of Native Children and bodies found in mass graves, the cess pit full of infant bones found around one of the old Irish,\"laundries\" tied to the church...sure seems to me that if you want to find evil in the world, the Catholic church is a good place to start.",
            "title_similarity": "0.62269634",
            "sentiment_compound": -0.9432
        },
        {
            "id": "h25z384",
            "score": 0,
            "text": "Why be part of that organization. I’m not an expert but there’s Bitcoin miners, then there’s the Catholic Church who are “Guilt Miners”",
            "title_similarity": "0.53273076",
            "sentiment_compound": 0.0
        },
        {
            "id": "h22hrfs",
            "score": -3,
            "text": "And after the ridiculous behavior that Christians have shown over the years they can add falling right in line with Donald Trump to the list",
            "title_similarity": "0.56187063",
            "sentiment_compound": -0.4767
        },
        {
            "id": "h226jkm",
            "score": -3,
            "text": "What really upsets me is I believe in the core tenets of the Catholic Church (outside of things regarding marriage abortion), including the episcopacy, but I’m so sickened that it continues to act in such callous, thoughtless ways to it’s most devout adherents.",
            "title_similarity": "0.5968203",
            "sentiment_compound": -0.9206
        },
        {
            "id": "h22uimc",
            "score": 3,
            "text": "Where’s your god now people?",
            "title_similarity": "0.19497965",
            "sentiment_compound": 0.2732
        },
        {
            "id": "h22ut1b",
            "score": 1,
            "text": "I’m glad I stopped believing in god when I was 8. What an absolutely horrible fairy tale.",
            "title_similarity": "0.6610068",
            "sentiment_compound": -0.1513
        },
        {
            "id": "h22ehtm",
            "score": 3,
            "text": "When will the world learn that everyone is better off without religion. Wake up people. They're all cults that do much more harm than good.",
            "title_similarity": "0.644177",
            "sentiment_compound": 0.3117
        },
        {
            "id": "h22hpj8",
            "score": -5,
            "text": "There are still people who call themselves catholics like why???",
            "title_similarity": "0.22294548",
            "sentiment_compound": 0.466
        },
        {
            "id": "h21yg3e",
            "score": 22,
            "text": "[deleted]",
            "title_similarity": "0.29835454"
        },
        {
            "id": "h2200fu",
            "score": 9,
            "text": "Church doing church things.",
            "title_similarity": "0.2138914",
            "sentiment_compound": 0.0
        },
        {
            "id": "h229tnt",
            "score": 6,
            "text": "This could also be crossposted to /r/LeopardsAteMyFace \n\nWhat the fuck did you expect from an entity like the Catholic Church? Compassion? Contrition? Anything even remotely approaching Christlike?",
            "title_similarity": "0.47043377",
            "sentiment_compound": 0.4515
        },
        {
            "id": "h224ozx",
            "score": -2,
            "text": "Maybe if we send her all our thoughts and prayers, the church will reverse the decision. Just an idea.",
            "title_similarity": "0.60670173",
            "sentiment_compound": 0.0
        },
        {
            "id": "h226q6z",
            "score": -3,
            "text": "The Catholic church is an organization which is simultaneously a cult and a mafia organization with outdated and backward values . It is long overdue for disbandment.",
            "title_similarity": "0.7087382",
            "sentiment_compound": 0.4019
        },
        {
            "id": "h23c6o0",
            "score": -1,
            "text": "The Vatican was taken over by imposters years ago. A lot like the Governments of our shitty world. Can’t expect those evil people to do what’s right. God will make it right for her though. 🙏🏻",
            "title_similarity": "0.67390907",
            "sentiment_compound": -0.6597
        },
        {
            "id": "h24z1fv",
            "score": -1,
            "text": "Sister, as a recovered catholic I hope you can put those clowns in the rear view and join humanity. We can use you on the no religion team.",
            "title_similarity": "0.50782067",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h255lgw",
            "score": -1,
            "text": "Lucy is a brave woman and really has true Good within her unlike the pedo ring Catholic Church. To be with God you don't need a vow and you don't need to belong to a club.",
            "title_similarity": "0.41000608",
            "sentiment_compound": 0.8943
        },
        {
            "id": "h259cx7",
            "score": -1,
            "text": "I wish we could just abolish the Catholic Church. Too much corruption and greed to ever be trusted.",
            "title_similarity": "0.6673696",
            "sentiment_compound": 0.4767
        },
        {
            "id": "h25wnsp",
            "score": 1,
            "text": "Hot take. The Catholic Church is evil. Why is this even surprising to anyone? They’ve been burning, stealing, murdering, and molesting for 2000 years. And people still act alarmed 😱",
            "title_similarity": "0.729041",
            "sentiment_compound": -0.9729
        },
        {
            "id": "h26ed6e",
            "score": -1,
            "text": "Another reason why the church needs to be razed to the ground. Religion is all based in fantasy and none of it in reality, in addition they are the cause of a very large amount of the worlds issues and intolerance as well as countless wars and human rights violations. Organized religion is the bane of the human race.",
            "title_similarity": "0.6604593",
            "sentiment_compound": -0.7096
        },
        {
            "id": "h223a5f",
            "score": -2,
            "text": "Could religion be proven hopeless and selfish?",
            "title_similarity": "0.37659565",
            "sentiment_compound": -0.7269
        },
        {
            "id": "h2254np",
            "score": -1,
            "text": "Travesty of justice.  See documentary \"Mea Maxima Culpa\" in Youtube.",
            "title_similarity": "0.23089203",
            "sentiment_compound": -0.0772
        },
        {
            "id": "h226kqn",
            "score": -1,
            "text": "Tax the church",
            "title_similarity": "0.4237685",
            "sentiment_compound": 0.0
        },
        {
            "id": "h227ul6",
            "score": -1,
            "text": "It's time to label the church a terrorist organisation",
            "title_similarity": "0.5698383",
            "sentiment_compound": -0.6908
        },
        {
            "id": "h22e58k",
            "score": -2,
            "text": "The more I live the more it seems the world wants me to rape women and so I suffer",
            "title_similarity": "0.6489783",
            "sentiment_compound": -0.8583
        },
        {
            "id": "h22f9ik",
            "score": -2,
            "text": "if god is on your side (no gods exist, so lul) youll be correct in the end.\n\nWorth it, if youre ok with that nonsense.",
            "title_similarity": "0.30615878",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h22ijon",
            "score": -3,
            "text": "Fuck the Catholic Church. In Canada, we’ve officially uncovered 3 mass graves at residential schools run by the church in which hundreds of Aboriginal children have been found. Federal government has been fighting this for decades. It’s appalling and the Pope basically apologized to Canadians instead of the Aboriginals directly. I’ll add links in the morning. \n\nIf you’re Catholic, I suggest you take a good hard look at the atrocities your church has committed around the world in the name of religion for centuries. The Catholic Church may not the the only ones, but are by far the biggest offenders.",
            "title_similarity": "0.7200749",
            "sentiment_compound": -0.6858
        },
        {
            "id": "h233lb1",
            "score": -2,
            "text": "One cannot be expelled from the church for the one true and only church of God is within each and every one of us, it cannot be taken from us ever, even in our death, the rules and laws of man are not of God but of man. Look within yourself for God, by prayer. That's the church, don't desecrate it or make it unclean. It's your direct line to God. And he hears and sees everything you think and do.",
            "title_similarity": "0.45463288",
            "sentiment_compound": 0.6443
        },
        {
            "id": "h23gr90",
            "score": -2,
            "text": "As Christian that lives in today's world with science and everything and an updated understanding of God's written word the Catholic Church is a bigger enemy to me than atheism. The Catholic Church has turned more people into atheists than science in my experience. It will the last enemy destroyed before death. I will pray for this woman.",
            "title_similarity": "0.6511322",
            "sentiment_compound": -0.9153
        },
        {
            "id": "h252e29",
            "score": 2,
            "text": "millions and milions of catholics all around the world couldnt possibly care less. they will continue to fund the pope who hides and protects his minions. they will remain catholics no matter how vile and pervtedly twisted they are. the mass is cursed.",
            "title_similarity": "0.6031194",
            "sentiment_compound": -0.7353
        },
        {
            "id": "h229j12",
            "score": -6,
            "text": "The church could have prevented such things from happening by proactively hiring gay folks and paedophiles only.\n\nWhat a terrible mistake to hire straight rapists too.",
            "title_similarity": "0.5574685",
            "sentiment_compound": -0.8316
        },
        {
            "id": "h22hr6o",
            "score": -6,
            "text": "Fuck organised religion!!!!\n\nSorry, it has to be said. Fuck it all the way to hell (or whatever these people believe in).",
            "title_similarity": "0.636317",
            "sentiment_compound": -0.9333
        },
        {
            "id": "h21yiyl",
            "score": 4,
            "text": "I'm sure this behavior and the rules of the convent are exactly what Jesus had in mind.",
            "title_similarity": "0.2684479",
            "sentiment_compound": 0.3182
        },
        {
            "id": "h22em9x",
            "score": 3,
            "text": "As if rape isn't bad enough, Imagine giving your life to your god like that, then having to deal with the dissonance of your love for Jesus and how men run his church. Jesus.",
            "title_similarity": "0.48435825",
            "sentiment_compound": 0.81
        },
        {
            "id": "h22j7h6",
            "score": -3,
            "text": "Its official....the catholic church supports rape!",
            "title_similarity": "0.45595622",
            "sentiment_compound": -0.5411
        },
        {
            "id": "h23gbvq",
            "score": -3,
            "text": "WELL OF COURSE.THATS WHAT CATHOLICS DO… ATLEAST IT WAS A WOMAN INSTEAD OF A LITTLE BOY!!!",
            "title_similarity": "0.51345205",
            "sentiment_compound": 0.4545
        },
        {
            "id": "h227ilh",
            "score": 48,
            "text": "Why is the Church so satanic and evil?",
            "title_similarity": "0.5367694",
            "sentiment_compound": -0.6872
        },
        {
            "id": "h21yton",
            "score": 69,
            "text": "So, just to be clear: the Church rejected her appeal, but it's her order that is expelling her from the convent. I know this is Reddit where there's no room for nuance, but the Church and religious orders are **not** the same thing. Nuns and Brothers are generally not part of the clergy; they are, in fact, part of the laity.",
            "title_similarity": "0.79574776",
            "sentiment_compound": -0.7615
        },
        {
            "id": "h21vffp",
            "score": 212,
            "text": "Sounds about right.  The church fucking the fucked.",
            "title_similarity": "0.41627687",
            "sentiment_compound": -0.6887
        },
        {
            "id": "h22dw5q",
            "score": 61,
            "text": "The catholic church aligned itself with the nazi party, primarily over a shared hatred of the jews,much of that hatred being directly fueled by the church itself. The church has also continued to preach about the evils of condom use,while that preachment has let to the suffering and death of millions in sub Saharan Africa and around the world. The church has also shielded and continues to shield scores of child molesters and child rapists and murderers. Let's not forget the misery they have heaped on the gay community.  I don't know anyone  could belong to and financially support such an openly evil organization.",
            "title_similarity": "0.64037716",
            "sentiment_compound": -0.9795
        },
        {
            "id": "h227fnp",
            "score": 0,
            "text": "Catholicism needs to deal with its own. It is worldwide the obstruction. The thing is, in this century your followers can read, communicate and find flaws in your system.   \nWe have known but are still reeling from the realities of catholic policy on residential schools here in Canada.   \n\n\nThis is a global pattern. I don't understand what is so hard about living the values in your own holy book. This is shameful every time it comes up. Either disavow these actions or frankly f-off.   \n\n\nAll good catholics please continue your faith, but never ever stop calling out these atrocities.   \n\n\nThis sounds like a wonderful woman trying to do good things. Lets remember that she is the true representative of her community.",
            "title_similarity": "0.63187027",
            "sentiment_compound": 0.9791
        },
        {
            "id": "h228ts8",
            "score": 4,
            "text": "How are people still believers....",
            "title_similarity": "0.08218079",
            "sentiment_compound": 0.0
        },
        {
            "id": "h22ams2",
            "score": 0,
            "text": "The leopards ... they ate the face.....",
            "title_similarity": "0.45022133",
            "sentiment_compound": 0.0
        },
        {
            "id": "h22aslt",
            "score": 0,
            "text": "eat the church ! fck 'em",
            "title_similarity": "0.4725265",
            "sentiment_compound": 0.0
        },
        {
            "id": "h22crlx",
            "score": -5,
            "text": "She didn’t follow her vows so she was removed from her congregation of nuns. Why is the headline such clockbait trash lol",
            "title_similarity": "0.8658881",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h22earm",
            "score": 4,
            "text": "So she was kicked out of a shitty group for rejecting and calling them to account for their evil? Are we supposed to feel bad for her? This is some backwards abusive shit imho.",
            "title_similarity": "0.7127063",
            "sentiment_compound": -0.974
        },
        {
            "id": "h22hmsc",
            "score": 0,
            "text": "Wait... Isn't the current pope pro gay marriage and in general pro LGBTQ+? Why has he chosen to die on this hill? Sounds weird",
            "title_similarity": "0.51906765",
            "sentiment_compound": -0.7149
        },
        {
            "id": "h22hvoi",
            "score": 0,
            "text": "I remember when the priest of my local church came to me after me quiting the church and asked why I did it. Bless the man, he really wants to keep his herd together, and it was certainly not because of him I quit.\n\nBut when I whipped out my iPad, started googling stuff like this and asked \"How much time do you have?\" his only answer was a *very* deep sigh.",
            "title_similarity": "0.53589374",
            "sentiment_compound": 0.7519
        },
        {
            "id": "h22i3df",
            "score": 0,
            "text": "/r/leopardsatemyface",
            "title_similarity": "0.20149356",
            "sentiment_compound": 0.0
        },
        {
            "id": "h22ihzd",
            "score": 0,
            "text": "I mean they rape kids why would raping a woman be different",
            "title_similarity": "0.57434374",
            "sentiment_compound": -0.8885
        },
        {
            "id": "h22l64z",
            "score": 4,
            "text": "I will never understand why people support the largest most well-funded and by far most organized pedophile ring on the planet. Some of the continues to give money to the Catholic Church de facto supports pedophilia. The tithe goes into the church from your pocket and then goes into a victim's pocket after the settlement of a lawsuit.",
            "title_similarity": "0.6193628",
            "sentiment_compound": 0.5106
        },
        {
            "id": "h22mu8h",
            "score": 0,
            "text": "When will people realize all this is just a huge conspiracy? If anything religion has held us back more than ever.",
            "title_similarity": "0.5612476",
            "sentiment_compound": -0.2732
        },
        {
            "id": "h22o01f",
            "score": 0,
            "text": "Can we end freedom of religion. We tried, they're all too fucked it's time to stop",
            "title_similarity": "0.64447486",
            "sentiment_compound": -0.34
        },
        {
            "id": "h22o27m",
            "score": 0,
            "text": "It blows my mind that people have to even do that. Like the State shouldn't even know your religion, let alone make you change it.\n\nYou know how I left the church in Australia?\n\nJust stopped going...",
            "title_similarity": "0.6653266",
            "sentiment_compound": -0.1027
        },
        {
            "id": "h22o5j9",
            "score": 0,
            "text": "Lol sex addition",
            "title_similarity": "0.14313868",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h22owxv",
            "score": 0,
            "text": "everyone here mentioning how impossible it is to “leave the church”. Y’all realize that’s a fucking cult right",
            "title_similarity": "0.63214755",
            "sentiment_compound": 0.0
        },
        {
            "id": "h22prea",
            "score": 0,
            "text": "Nothing going to change until people leave the church.  Catholics willing to keep on being Catholics enable this behavior.  They know the church doesn’t care about sexual abuse in its ranks.  They just don’t care because they feel being Catholic is more important.  Indoctrination at its best.",
            "title_similarity": "0.5175185",
            "sentiment_compound": 0.807
        },
        {
            "id": "h22qa0h",
            "score": 0,
            "text": " Sister Lucy, excommunicado",
            "title_similarity": "0.5439721",
            "sentiment_compound": 0.0
        },
        {
            "id": "h22qf1x",
            "score": 0,
            "text": "Excommunicado",
            "title_similarity": "0.2130425",
            "sentiment_compound": 0.0
        },
        {
            "id": "h22r27g",
            "score": 0,
            "text": "But they protect the pedos and rapists",
            "title_similarity": "0.17104653",
            "sentiment_compound": -0.5499
        },
        {
            "id": "h22s75w",
            "score": 0,
            "text": "When did Jesus say \"rape the nuns\"?\n\nFuck the Catholic Church and their fake Christianity.",
            "title_similarity": "0.7433846",
            "sentiment_compound": -0.9062
        },
        {
            "id": "h22soki",
            "score": 0,
            "text": "Wow this is crazy. Quite a departure from tradition. I guess someone decided it was time to stop fucking little boys eh? \n\nEvery time I see something like this I remember George Carlin’s line:\n\n“I was Catholic until I reached the age of reason”",
            "title_similarity": "0.6691996",
            "sentiment_compound": 0.4767
        },
        {
            "id": "h22sw12",
            "score": 0,
            "text": "The Catholic church reeeeeeeally loves raping and molesting people.",
            "title_similarity": "0.4976458",
            "sentiment_compound": -0.7096
        },
        {
            "id": "h22sxv7",
            "score": 0,
            "text": "real question: why are catholic priests so creepily sex driven?\n\nis it the stigma of priests that make younger boys aspire to become one? but at what point does it suddenly click in their head that it’s ok?",
            "title_similarity": "0.50651157",
            "sentiment_compound": 0.0
        },
        {
            "id": "h22t1xs",
            "score": 0,
            "text": "Fuck these corrupt “corporations”",
            "title_similarity": "0.47314",
            "sentiment_compound": -0.5423
        },
        {
            "id": "h22thqa",
            "score": 0,
            "text": "Yo fuck the Catholic Church",
            "title_similarity": "0.6023032",
            "sentiment_compound": -0.5423
        },
        {
            "id": "h22tl7x",
            "score": 0,
            "text": "Fuck the Catholic Church but also fuck religion in general!",
            "title_similarity": "0.6057266",
            "sentiment_compound": -0.807
        },
        {
            "id": "h22ulyf",
            "score": 3,
            "text": "Who could proudly be catholic in 2021?",
            "title_similarity": "0.30292892",
            "sentiment_compound": 0.5574
        },
        {
            "id": "h22va2w",
            "score": 3,
            "text": "Every piece of trash lowlife I've met goes to church on sunday.\n\nEvery kind, giving, caring person who would give you their last dollar has been an atheist.",
            "title_similarity": "0.68523884",
            "sentiment_compound": 0.7579
        },
        {
            "id": "h22yhqy",
            "score": 0,
            "text": "Ok.\n\nFinal straw.\n\nNo more tax exemption for Catholic Church.\n\nIf they fall apart they fall apart but no more hurting people with impunity.",
            "title_similarity": "0.6538626",
            "sentiment_compound": -0.019
        },
        {
            "id": "h235sw8",
            "score": 0,
            "text": "The Lord suffers not a snitch.",
            "title_similarity": "0.08728936",
            "sentiment_compound": -0.4767
        },
        {
            "id": "h23aeyo",
            "score": 0,
            "text": "The devil lives in Rome.",
            "title_similarity": "0.38953605",
            "sentiment_compound": -0.6597
        },
        {
            "id": "h23af7s",
            "score": 0,
            "text": "Protect the molester is like a an official church policy.",
            "title_similarity": "0.39414993",
            "sentiment_compound": 0.2023
        },
        {
            "id": "h23crja",
            "score": 0,
            "text": ":-\\ :-[  man in a dress follows my child into the restroom\n:O :-$  its a Catholic preist",
            "title_similarity": "0.38860154",
            "sentiment_compound": -0.6841
        },
        {
            "id": "h23et4z",
            "score": 0,
            "text": "The Catholic church is so sad. I'm Christian and I wish I could wipe the Catholic church off any relation to do with true Christ based Christianity. it's straight up demonic deceit. And billions follow because they don't bother to read the Bible themselves. God is all powerful though I'm sure He still reaches His sheep through all they're false preaching.",
            "title_similarity": "0.7112959",
            "sentiment_compound": 0.7811
        },
        {
            "id": "h23eu6c",
            "score": 0,
            "text": "All popes are bastards",
            "title_similarity": "0.6003718",
            "sentiment_compound": -0.6124
        },
        {
            "id": "h23eup8",
            "score": 0,
            "text": "She’s better off anyway. Following a cult that believes in invisible bullshit.",
            "title_similarity": "0.52535474",
            "sentiment_compound": -0.2263
        },
        {
            "id": "h23fox6",
            "score": 0,
            "text": "Fuck religion",
            "title_similarity": "0.39420512",
            "sentiment_compound": -0.5423
        },
        {
            "id": "h23gagu",
            "score": 0,
            "text": "The church is filthy and full of sin",
            "title_similarity": "0.49727285",
            "sentiment_compound": -0.5574
        },
        {
            "id": "h23giae",
            "score": 0,
            "text": "Same people who brought us the Spanish Inquisition. And that’s not even the worst of their crimes. Don’t forget to tithe! God wants his 10%!",
            "title_similarity": "0.37890157",
            "sentiment_compound": 0.4363
        },
        {
            "id": "h23ha0c",
            "score": 0,
            "text": "As a non believer, I am amazed that people can still be catholic, given the awfulness that continually spews out of this church.",
            "title_similarity": "0.5882493",
            "sentiment_compound": 0.4939
        },
        {
            "id": "h23hwwj",
            "score": 0,
            "text": "Welcome to the church.  Now fuck off.",
            "title_similarity": "0.4749195",
            "sentiment_compound": -0.128
        },
        {
            "id": "h23ijnr",
            "score": 0,
            "text": "Fuck the church all these priests that have been protected all these heads that paid off media and families to keep quiet should be publicly executed…. You harm another persons life you shouldnt be aloud to keep yours….  16 years of my life forced by my devout parents to go every sunday, participate in programs etc i hated every minute of it…. As soon as common sense came in, some case studies in crime and deviance university courses involving the church and over all look at the damage Christianity/Catholicism has done to their own congregation I quickly rejected all influence it had on my life, denounced my religion and never regretted a single decision.",
            "title_similarity": "0.8073877",
            "sentiment_compound": -0.9644
        },
        {
            "id": "h23j45z",
            "score": 0,
            "text": "The Catholic Church covering up sexual abuse? \n\n\nHow is this news?",
            "title_similarity": "0.5607987",
            "sentiment_compound": -0.6767
        },
        {
            "id": "h23kfw7",
            "score": 0,
            "text": "Religion of evil.",
            "title_similarity": "0.32902312",
            "sentiment_compound": -0.6597
        },
        {
            "id": "h23kss0",
            "score": 0,
            "text": "Religion is one massive lie - even if there are billions who believe in it. Knowing that, is it such a shock that that the leaders of a church would pull this shit? These leaders are they guys that operate behind the curtain, and they know just how bullshit it all is because their position depends on maintaining the facade. These guys know how the church operates - the lies, the money, the power grabs, political influence. They're protecting the church the same way companies protect their board members.",
            "title_similarity": "0.5723703",
            "sentiment_compound": -0.8968
        },
        {
            "id": "h23kza1",
            "score": 0,
            "text": "This can't possibly be a surprise to anyone at all, right? 🙄",
            "title_similarity": "0.19532275",
            "sentiment_compound": 0.2732
        },
        {
            "id": "h23lq6d",
            "score": 0,
            "text": "Satan lives in pedo church.",
            "title_similarity": "0.46802887",
            "sentiment_compound": 0.0
        },
        {
            "id": "h23mpp5",
            "score": 0,
            "text": "Satan has infiltrated that church",
            "title_similarity": "0.53891385",
            "sentiment_compound": 0.0
        },
        {
            "id": "h23wj9k",
            "score": 0,
            "text": "This is not the point of the story, but just look how many people are so quick to attack the Catholic Church, but in the same breath defend Sister Lucy. \n\nYou can say what you will about the incredible amount of corruption and vile at the top in Rome, but remember the church is populated by MILLIONS of good, kind and above all innocent people who simply wish to practice their faith.",
            "title_similarity": "0.67696404",
            "sentiment_compound": 0.8691
        },
        {
            "id": "h246nvl",
            "score": 0,
            "text": "Just hang the fucking bishop already",
            "title_similarity": "0.5320165",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2484jd",
            "score": 0,
            "text": "Good for you Lucy. You're finally free",
            "title_similarity": "0.12914342",
            "sentiment_compound": 0.7351
        },
        {
            "id": "h24ot6n",
            "score": 0,
            "text": "The “church” can’t take the true house of God which is yourself. Not some dam building not some stupid ass counsel",
            "title_similarity": "0.48073733",
            "sentiment_compound": 0.86
        },
        {
            "id": "h24oxyj",
            "score": 0,
            "text": "Breaking news: Catholic Church is full of shit",
            "title_similarity": "0.61459124",
            "sentiment_compound": -0.5574
        },
        {
            "id": "h24p2o8",
            "score": 0,
            "text": "Hell is bursting at the seams with \"religious\" people.",
            "title_similarity": "0.4717113",
            "sentiment_compound": -0.6808
        },
        {
            "id": "h24phlz",
            "score": 0,
            "text": "They rejected me too. That club is exclusive and expensive.  She will find a more suitable mission here on this planet. God will make sure of it.",
            "title_similarity": "0.5995433",
            "sentiment_compound": 0.1531
        },
        {
            "id": "h24pngp",
            "score": 0,
            "text": "Just Christianity things",
            "title_similarity": "0.13965195",
            "sentiment_compound": 0.0
        },
        {
            "id": "h24prv4",
            "score": 0,
            "text": "The Catholic Church commits harm daily, has perpetuated harm without remorse or recompense, and excuses harm on a constant basis. They are not worthy of tolerance or respect.",
            "title_similarity": "0.6875478",
            "sentiment_compound": -0.8683
        },
        {
            "id": "h24s4xj",
            "score": 0,
            "text": "Because the church is such a wonderful organisation to be part of…\n\nSeriously it’s 2021 and with every change going on you would have thought this is the one place that’s had it’s Hoise cleaned from top to bottom by now (and yes before the jokes come, more so bottom)",
            "title_similarity": "0.40121713",
            "sentiment_compound": 0.8176
        },
        {
            "id": "h24stxl",
            "score": 0,
            "text": "Deep state pedos Humm perhaps quack anon is a little mis directed in their conspiracy theories of late",
            "title_similarity": "0.43882644",
            "sentiment_compound": -0.5267
        },
        {
            "id": "h24sx9q",
            "score": 0,
            "text": "Wtf fvck the church",
            "title_similarity": "0.21082634",
            "sentiment_compound": -0.5859
        },
        {
            "id": "h24t6s9",
            "score": 0,
            "text": "Weds Thurs Fri!?  I have no issue with the religion itself but w the institute",
            "title_similarity": "0.40918142",
            "sentiment_compound": -0.2244
        },
        {
            "id": "h24v0bp",
            "score": 0,
            "text": "Maybe a real journalist needs to ask the pope in a public forum WFT?!",
            "title_similarity": "0.4296797",
            "sentiment_compound": 0.0
        },
        {
            "id": "h24wv6g",
            "score": 0,
            "text": "Catholics gonna cath.",
            "title_similarity": "0.33074862",
            "sentiment_compound": 0.0
        },
        {
            "id": "h24wy1w",
            "score": 0,
            "text": "But God! He’ll make sure the good people win lmao",
            "title_similarity": "0.22684667",
            "sentiment_compound": 0.9694
        },
        {
            "id": "h24x2ko",
            "score": 0,
            "text": "Of course they did",
            "title_similarity": "-0.11917846",
            "sentiment_compound": 0.0
        },
        {
            "id": "h24xd86",
            "score": 0,
            "text": "This is the kinda news that just makes me feel sick to my stomach",
            "title_similarity": "0.37717095",
            "sentiment_compound": -0.5106
        },
        {
            "id": "h250jw1",
            "score": 0,
            "text": "WHAT?! So that means the Vatican - The Pope - is punishing her for pointing out the TRUTH, and giving it the opportunity to rid itself of something rotten. That Bishop clearly has friends there...that or his money would be missed if they didn't back him. Its just so depressing and dissappointing. How does a devout mother explain that to her young daughter?\n\nGood thing is, 1 or 2 more generations, there will be NO catholic church to speak of. Good riddance.",
            "title_similarity": "0.78508097",
            "sentiment_compound": 0.6231
        },
        {
            "id": "h2514cx",
            "score": 0,
            "text": "The Catholic Church doesn't deserve sister Lucy.",
            "title_similarity": "0.6385694",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2515dn",
            "score": 0,
            "text": "Surprise surprise",
            "title_similarity": "0.13736868",
            "sentiment_compound": 0.4939
        },
        {
            "id": "h2540en",
            "score": 0,
            "text": "This is the true face of Pope Francis's \"reformed\" church.\n\nBlame the woman for being raped, kick her out of the Church.",
            "title_similarity": "0.82650363",
            "sentiment_compound": -0.6369
        },
        {
            "id": "h254ktq",
            "score": 0,
            "text": "Is there a go fund me for this Sister Lucy, or something similar? I imagine that a nun being expelled from the church and ripped of sisterhood is similar to a woman losing a divorce settlement from her adulterous husband and doesn't without any work history to help her in finding a job or income of her own to find a place to live. I know nuns work really hard, they're responsible for all of the cooking and cleaning and organizing community events but I don't think that is seen as work history when they are shunned like that. I don't know, it just seems like she got a really s***** end of the stick here.",
            "title_similarity": "0.80588734",
            "sentiment_compound": 0.7569
        },
        {
            "id": "h25eo0r",
            "score": 0,
            "text": "An ancient criminal kingdom laden down for 1000 years by criminals . There is no justice.",
            "title_similarity": "0.59570074",
            "sentiment_compound": -0.8713
        },
        {
            "id": "h27alh2",
            "score": 0,
            "text": "She's against rape? How un-christian of her.",
            "title_similarity": "0.5306908",
            "sentiment_compound": -0.6908
        },
        {
            "id": "h2801w9",
            "score": 0,
            "text": "That sounds terrible, and it is, but 300 years ago, they would have burned her at the stake for being a witch and casting a lust spell on the Bishop.",
            "title_similarity": "0.7411488",
            "sentiment_compound": -0.6486
        },
        {
            "id": "h2c8ill",
            "score": 0,
            "text": "Faith is a way to navigate life and if faith helps great.\n\nOrganized rule-based religion is just a group of people with money, power and no accountability.\n\nOne needs to go.",
            "title_similarity": "0.41468397",
            "sentiment_compound": 0.8779
        },
        {
            "id": "h2etq8k",
            "score": 0,
            "text": "Okay,no money in the poor box.let us not forget what the church has done,let Jesus live and let the church die",
            "title_similarity": "0.60647374",
            "sentiment_compound": -0.7457
        },
        {
            "id": "h2ggkgs",
            "score": 0,
            "text": "trashy; the catholic church still don't know how to handle cases properly and still attack the victims instead of turning the perps to the police...",
            "title_similarity": "0.6680731",
            "sentiment_compound": -0.6597
        },
        {
            "id": "h227gt6",
            "score": 72,
            "text": "The Catholic Church siding with a rapist over a nun? Well colour me shocked and surprised.",
            "title_similarity": "0.7442485",
            "sentiment_compound": -0.6369
        },
        {
            "id": "h220whw",
            "score": -5,
            "text": "Why would you want to be a part of that cult after all of that?",
            "title_similarity": "0.40058896",
            "sentiment_compound": 0.0772
        },
        {
            "id": "h227xrp",
            "score": 6,
            "text": "Matthew 6:5\n\nAnd when thou prayest, thou shalt not be as the hypocrites are: for they love to pray standing in the synagogues andi n the corners of the streets, that they may be seen of men. Verily I say unto you, They have their reward.\n\nEven if you believe in God your own book says \"fuck organized religion.\"",
            "title_similarity": "0.4850583",
            "sentiment_compound": 0.8316
        },
        {
            "id": "h22cqfj",
            "score": 6,
            "text": "Fuck religion",
            "title_similarity": "0.39420512",
            "sentiment_compound": -0.5423
        },
        {
            "id": "h2293ju",
            "score": 21,
            "text": "Many Catholics are more offended at Catholic priest rape jokes, than the actual child and other forms of rape actually being committed by the priests.",
            "title_similarity": "0.5621987",
            "sentiment_compound": -0.8622
        },
        {
            "id": "h22xoq5",
            "score": 5,
            "text": "In case you believe women aren’t still subjugated…they have gone from stoning us to muzzling us. #ReasonsToLeaveReligion",
            "title_similarity": "0.5731086",
            "sentiment_compound": 0.0
        },
        {
            "id": "h228tte",
            "score": 102,
            "text": "What a sick institution.",
            "title_similarity": "0.31464314",
            "sentiment_compound": -0.5106
        },
        {
            "id": "h21zt9v",
            "score": 1,
            "text": "Hey look, the church being evil. Gee, I’m shocked.",
            "title_similarity": "0.51398915",
            "sentiment_compound": -0.7717
        },
        {
            "id": "h222w4d",
            "score": 1,
            "text": "Typical catholic church thing to do. Is anyone actually surprised?",
            "title_similarity": "0.37019318",
            "sentiment_compound": 0.2263
        },
        {
            "id": "h2233gr",
            "score": 1,
            "text": "Just DEMAND to be released from the church.  Works for everything else",
            "title_similarity": "0.5608323",
            "sentiment_compound": -0.3034
        },
        {
            "id": "h223hdc",
            "score": 1,
            "text": "Can she go after him in a court of law?",
            "title_similarity": "0.26515567",
            "sentiment_compound": 0.0
        },
        {
            "id": "h224nuf",
            "score": 1,
            "text": "It's remarkable how a something caught in a corner uses force to persuade.",
            "title_similarity": "0.1259268",
            "sentiment_compound": 0.5574
        },
        {
            "id": "h224tts",
            "score": 1,
            "text": "God must be so angry at the Catholic Church. Satan had taken it over from the inside out and made a mockery of everything good and pure.",
            "title_similarity": "0.6594983",
            "sentiment_compound": -0.3697
        },
        {
            "id": "h225fhd",
            "score": 1,
            "text": "Pope needs to be a leader and not subservient mascot for the cardinals. It's an entire system endoctinated over two thousand years of power and corruption. I mean they do help more empoverished people than any other organization by far but the philanthropy hasn't been but the last 500 years or so. The system needs to adapt to a point where the pope has authority and influence and the cardinals the governing body that handles the will of the people. Until than, the church will continue to lose thousands of practioners yearly to the more fringe and radical aspects of the faith. John Paul was very much a Pope for the people but threatened the power structure of the Vatican so we ended up with Benedict. Francis started out strong but maybe he's just too old to continue trying to fight back. All he positives he came out the gate with have slowly been eroded over last few years. It's maddening. In a time where great leadership is needed worldwide, the church has been absent. They amassed immense wealth and influence only to not use it in any other way than to protect their own archaic structures. Power truly defines a man's character... and the world is proving to lack a whole lot of that. Truly hope my generation (millennial) and those to follow are able to put the pieces together and push through all the barriers being put up so we can be that better world we're so capable of. You can only wall back a tsunami for so long and eventually the waves break through. Leaders need to realize that.",
            "title_similarity": "0.61820036",
            "sentiment_compound": 0.9863
        },
        {
            "id": "h228vyb",
            "score": 1,
            "text": "This sounds like a cult to me",
            "title_similarity": "0.09611095",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h229h7l",
            "score": 1,
            "text": "\"Why are people so hostile to the Catholic Church?\"",
            "title_similarity": "0.58990407",
            "sentiment_compound": -0.5214
        },
        {
            "id": "h22a6fd",
            "score": 1,
            "text": "Looks like the Church needs an audit or 1,000.",
            "title_similarity": "0.42297196",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h22a7fb",
            "score": 1,
            "text": "Wahhh?! The church is corrupt AF and terrible!?!? I’m shook",
            "title_similarity": "0.5694846",
            "sentiment_compound": -0.711
        },
        {
            "id": "h22agy8",
            "score": 1,
            "text": "It’s a cult.",
            "title_similarity": "0.15951368",
            "sentiment_compound": 0.0
        },
        {
            "id": "h22at4h",
            "score": 1,
            "text": "I'd say, get out of there sister. You are worth more and you do not need to stay in a place that protects people like him. You can proudly walk out of that place with your head held high, knowing that you did the right thing.",
            "title_similarity": "0.46987498",
            "sentiment_compound": 0.8519
        },
        {
            "id": "h22b788",
            "score": 1,
            "text": "THE Catholic Church? Like the one with the popes? Crazy, normally they're totally chill and not at all rapey.",
            "title_similarity": "0.5546427",
            "sentiment_compound": 0.1179
        },
        {
            "id": "h22bek4",
            "score": 1,
            "text": "This is organized realign in a nut shell. How any person with even half a brain still buys into this fantasy is beyond me.",
            "title_similarity": "0.28193274",
            "sentiment_compound": 0.0
        },
        {
            "id": "h22bqza",
            "score": 1,
            "text": "Only if she would have raped few minors, Church would have just transferred her to another location.",
            "title_similarity": "0.56189334",
            "sentiment_compound": -0.6808
        },
        {
            "id": "h22cpyd",
            "score": 1,
            "text": "Morons, how Christian like.... Not.",
            "title_similarity": "0.32819015",
            "sentiment_compound": 0.0516
        },
        {
            "id": "h22cqe5",
            "score": 1,
            "text": "Ironic that the same church preaches about love and brotherhood...",
            "title_similarity": "0.23430368",
            "sentiment_compound": 0.5719
        },
        {
            "id": "h22cuam",
            "score": 1,
            "text": "If you don't see now in 2021 that Catholic Church is full of pedophiles and they are protecting each other you have to be living under a rock last 20 years",
            "title_similarity": "0.67500806",
            "sentiment_compound": 0.0
        },
        {
            "id": "h22de7d",
            "score": 1,
            "text": "Ahh dont you love religion. So morally upstanding. Great roll models",
            "title_similarity": "0.2735657",
            "sentiment_compound": 0.249
        },
        {
            "id": "h22dmcu",
            "score": 1,
            "text": "Ban religious institutions, they are full of liars and criminals.",
            "title_similarity": "0.5574677",
            "sentiment_compound": -0.8934
        },
        {
            "id": "h22ez3c",
            "score": 1,
            "text": "She doesn't know it yet. But they have just given her the best gift.",
            "title_similarity": "0.24945465",
            "sentiment_compound": 0.8922
        },
        {
            "id": "h22gs6t",
            "score": 1,
            "text": "That nun should have realized that her beloved god is a phoney who did not help her when she needed him.\n\nShe should have quit the church by herself on that spot.",
            "title_similarity": "0.7718754",
            "sentiment_compound": 0.484
        },
        {
            "id": "h22hp9i",
            "score": 1,
            "text": "What a bunch of douche bag losers. That poor lady. The church she has devoted her whole life to they just throw away like trash because she spoke out SMH",
            "title_similarity": "0.8048055",
            "sentiment_compound": -0.7804
        },
        {
            "id": "h22hy4a",
            "score": 1,
            "text": "I don't understand how anyone could still view the catholic church as a healthy or good institution. Seems rotten to the core. I guess that's what happens when you try to become the middleman between people and God.",
            "title_similarity": "0.56232077",
            "sentiment_compound": 0.5267
        },
        {
            "id": "h22idds",
            "score": 1,
            "text": "Ah, the good old Catholic Church. Way to be consistent.  Cult of monsters.",
            "title_similarity": "0.44083312",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h22ig75",
            "score": 1,
            "text": "The same institution with a long history of protecting child rapists. Insert shocked Pikachu meme here",
            "title_similarity": "0.42936602",
            "sentiment_compound": -0.765
        },
        {
            "id": "h22pvn8",
            "score": 1,
            "text": "The Catholic Church is a criminal organization at this point, protecting and enabling sexual predators on a global level.",
            "title_similarity": "0.5047676",
            "sentiment_compound": -0.5267
        },
        {
            "id": "h22qicl",
            "score": 1,
            "text": "Good fuck the Catholic Church they harbor and protect child rapists. Stop wasting your time on these fairy tale pushing psychos",
            "title_similarity": "0.64623487",
            "sentiment_compound": -0.802
        },
        {
            "id": "h22qjuj",
            "score": -1,
            "text": "Fuck the catholic church!\n\nNeed a reminder why?  https://www.youtube.com/watch?v=JZRcYaAYWg4",
            "title_similarity": "0.5576812",
            "sentiment_compound": -0.6312
        },
        {
            "id": "h22ql5a",
            "score": -1,
            "text": "Behold, the criminal organization called \"The Catholic Church\" Strokes again.  And people ask why I don't like religion.  Because not only is it just wrong, but the men and women of god are corrupt and evil.",
            "title_similarity": "0.63156664",
            "sentiment_compound": -0.8502
        },
        {
            "id": "h22qluo",
            "score": -1,
            "text": "I sympathize with the rape victim and Sister Lucy, but rape and child abuse are synonymous with the catholic church. Almost everyone I know, knows this.They must have known or at least heard about it. I usually treat these cases now, as a case of the \"leopards ate my face\". You know you're lying down with the snake, then get shocked and outraged when it fucking bites you. I wonder when folks will get tired and start taking matters into their own hands? The only good priest is a dead one.",
            "title_similarity": "0.6865915",
            "sentiment_compound": -0.9875
        },
        {
            "id": "h22qmja",
            "score": 1,
            "text": "ALL Dogma is bullshit, religious institutions exist to make money and nothing more. There is nothing between you and whatever God you like to pray to, so pray away.",
            "title_similarity": "0.49389997",
            "sentiment_compound": 0.5709
        },
        {
            "id": "h22raxd",
            "score": 1,
            "text": "Proving that they are useless once again. Why does anyone still bother with the Catholic Church? Irredeemable.",
            "title_similarity": "0.63327265",
            "sentiment_compound": -0.6369
        },
        {
            "id": "h22rddo",
            "score": 1,
            "text": "Organized religion is a plague on humanity example number 4654684257",
            "title_similarity": "0.56220233",
            "sentiment_compound": 0.0772
        },
        {
            "id": "h22rr6g",
            "score": 1,
            "text": "Fuck the Catholic Church!",
            "title_similarity": "0.58089566",
            "sentiment_compound": -0.5848
        },
        {
            "id": "h22rxip",
            "score": 1,
            "text": "Dog water.",
            "title_similarity": "0.0076310677",
            "sentiment_compound": 0.0
        },
        {
            "id": "h22rxp1",
            "score": 1,
            "text": "Catholic Church should be sanctioned. So should the pope.",
            "title_similarity": "0.33679986",
            "sentiment_compound": 0.0
        },
        {
            "id": "h22swxy",
            "score": 1,
            "text": "She’s better off. Catholic Church is Satanic.",
            "title_similarity": "0.5442841",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h22t3mk",
            "score": 1,
            "text": "And this creepy old white man’s club will still get people lining up and gushing over its leader if he goes on tour somewhere. Fucking gross.",
            "title_similarity": "0.5009159",
            "sentiment_compound": -0.5256
        },
        {
            "id": "h22uxw5",
            "score": 1,
            "text": "God’s going to be so tucking pissed when he starts to exist",
            "title_similarity": "0.48427582",
            "sentiment_compound": -0.6682
        },
        {
            "id": "h22veel",
            "score": 1,
            "text": "Haha organized religion…",
            "title_similarity": "0.13168901",
            "sentiment_compound": 0.4588
        },
        {
            "id": "h22w3h9",
            "score": -1,
            "text": "people are people, you believe in whatever you want and you don’t need anyone’s approval for that",
            "title_similarity": "0.13513172",
            "sentiment_compound": 0.5267
        },
        {
            "id": "h231hl5",
            "score": 1,
            "text": "I have a friend in the Midwest, where in order to not be a priest anymore, he has to go to the Vatican directly is what he told me. So he decided he will just not do that and just not advertise that he is a priest.",
            "title_similarity": "0.59708023",
            "sentiment_compound": 0.4939
        },
        {
            "id": "h239sfm",
            "score": -1,
            "text": "Lots of ignorant people posting bullshit comments here. It’s too bad you’re not more circumspect with your hatred. You don’t know the facts, you’re just looking for a chance to further attack the church. And by the way before you attack me I am not condoning what the church did. I also do not know the facts but least I know enough to keep my mouth shut until I do.",
            "title_similarity": "0.6074916",
            "sentiment_compound": -0.8555
        },
        {
            "id": "h23aq0c",
            "score": 1,
            "text": "The title is wrong. She was not “expelled from the Church,” just from being a nun. Also she stole money from the convent and was generally disobedient, which is at least part of the reason for her getting kicked out of the convent.\n\nThere could still be plenty of covering up sex abuse elsewhere, but this story isn’t it.",
            "title_similarity": "0.69277227",
            "sentiment_compound": -0.5647
        },
        {
            "id": "h23b6uz",
            "score": 1,
            "text": "She tried to tackle it head-on. The Catholic church prefers face-down, ass-up.",
            "title_similarity": "0.5551444",
            "sentiment_compound": 0.0
        },
        {
            "id": "h23b8pf",
            "score": 1,
            "text": "Guess that's one way to ruin someones belief in God.....fuck these monsters.",
            "title_similarity": "0.5611791",
            "sentiment_compound": -0.5859
        },
        {
            "id": "h23c29r",
            "score": 1,
            "text": "You dont need a title of Nun to be a person of faith. Fuck the church for this politically motivated move. Im so sick of religion being inappropriately used by some.",
            "title_similarity": "0.67792773",
            "sentiment_compound": -0.4481
        },
        {
            "id": "h23c30h",
            "score": 1,
            "text": "Bunch of pedos in the church anyway so she's better off without them",
            "title_similarity": "0.64416105",
            "sentiment_compound": 0.4902
        },
        {
            "id": "h23d31r",
            "score": 1,
            "text": "It seems the Catholic church is no place for people who care about the truth, especially when it comes to where priests stick their lil St. Peters.",
            "title_similarity": "0.5839047",
            "sentiment_compound": 0.5106
        },
        {
            "id": "h23dc8j",
            "score": 1,
            "text": "If course they did, the Catholic church is a criminal organization who covers for pedophiles and rapists.",
            "title_similarity": "0.5207641",
            "sentiment_compound": -0.8271
        },
        {
            "id": "h23dx1e",
            "score": 1,
            "text": "She is not being kicked out of the Church, she was asked to leave the convent she joined since she was not following their rules. I don't think there has been a ruling on her rape accusations yet.",
            "title_similarity": "0.7350961",
            "sentiment_compound": -0.802
        },
        {
            "id": "h23gu7h",
            "score": 1,
            "text": "For embezzlement.",
            "title_similarity": "0.31726608",
            "sentiment_compound": 0.0
        },
        {
            "id": "h23h25h",
            "score": 1,
            "text": "No good deed goes unpunished, especially in the Catholic Church.",
            "title_similarity": "0.5755903",
            "sentiment_compound": -0.3412
        },
        {
            "id": "h23iklr",
            "score": 1,
            "text": "That catholic church covering for their rapist priests? Color me surprised.",
            "title_similarity": "0.6546289",
            "sentiment_compound": -0.6124
        },
        {
            "id": "h23kr9g",
            "score": 1,
            "text": "Its almost as if religion and the church is just a ponzi scheme to grant power and money. Why else would they expel a nun after a rape accusation?",
            "title_similarity": "0.6463464",
            "sentiment_compound": -0.7964
        },
        {
            "id": "h23kyla",
            "score": 1,
            "text": "Wow, the Catholic Church is so corrupt and rotten to the core, maybe it's time for a refor.... oh wait, it has been done centuries ago and it also went horribly wrong? I see... well...",
            "title_similarity": "0.6531048",
            "sentiment_compound": -0.6326
        },
        {
            "id": "h23lts5",
            "score": 1,
            "text": "Catholic Church is always gonna be on the side of rape",
            "title_similarity": "0.5415703",
            "sentiment_compound": -0.6908
        },
        {
            "id": "h23luav",
            "score": 1,
            "text": "Well forever be in the stone age until we eradicate religion and the brainwashed",
            "title_similarity": "0.582866",
            "sentiment_compound": 0.2732
        },
        {
            "id": "h23m2cu",
            "score": -1,
            "text": "And this is why religion is dead, only the power hungry child rapist reigns supreme",
            "title_similarity": "0.6173977",
            "sentiment_compound": -0.765
        },
        {
            "id": "h23nq8q",
            "score": 1,
            "text": "So glad I dumped all religion and started thinking for myself!!! 😇",
            "title_similarity": "0.5355422",
            "sentiment_compound": 0.6376
        },
        {
            "id": "h23nul1",
            "score": 1,
            "text": "Religon is a cult. \n\nCatholicism has been taken over by pedos and there apologists . There's no saving it .\n\n(Former catholic)",
            "title_similarity": "0.6461379",
            "sentiment_compound": -0.296
        },
        {
            "id": "h23sqk0",
            "score": -1,
            "text": "Mee too not going so well maybe she should change genders",
            "title_similarity": "0.41005838",
            "sentiment_compound": 0.4101
        },
        {
            "id": "h23yzit",
            "score": 1,
            "text": "Her actions are between her and her God. She has to live with the decisions and give an account to her God. I’m glad she knew it was wrong and acted the way her faith requires. To speak for those who can’t. To stand up for children, adults, whoever. You can’t exemplify Christ anymore than that.",
            "title_similarity": "0.52507174",
            "sentiment_compound": 0.7096
        },
        {
            "id": "h2438ce",
            "score": 1,
            "text": "May The God I serve be with this woman all the days of her life and May she dwell in the house OF THE LORD forever and ever. In Jesus name we pray these things. Amen.",
            "title_similarity": "0.42466986",
            "sentiment_compound": 0.5994
        },
        {
            "id": "h246dcv",
            "score": 1,
            "text": "Isn't the catholic church swell!",
            "title_similarity": "0.21340671",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2489q1",
            "score": 1,
            "text": "Fuck the catholic church. \n\nI stand corrected.\n\nFuck not, the catholic church.\nPlease?",
            "title_similarity": "0.49779755",
            "sentiment_compound": -0.6908
        },
        {
            "id": "h24p3e3",
            "score": 1,
            "text": "Why would any sane woman still listen to the church? You don’t need anyone but yourself to live life with God present. Women run now before you are swallowed whole and spit out as a handmaiden for the institution rather than spiritual person serving God.",
            "title_similarity": "0.6524565",
            "sentiment_compound": 0.6486
        },
        {
            "id": "h24qwec",
            "score": 1,
            "text": "Good ol’ christians. Holding true to those “values”",
            "title_similarity": "0.020445652",
            "sentiment_compound": 0.6908
        },
        {
            "id": "h24r1j4",
            "score": 1,
            "text": "Seems about right for a group of pedophiles, rapists and backward thinking, money laundering hypocritical assholes.",
            "title_similarity": "0.32732505",
            "sentiment_compound": -0.9022
        },
        {
            "id": "h24r4fy",
            "score": 1,
            "text": "I loathe the Catholic Church. They excuse, perpetuate, commit, and facilitate evil on a daily basis, all while proclaiming their innocence and goodness. When it comes to hypocrisy, they take the cake.",
            "title_similarity": "0.64171845",
            "sentiment_compound": -0.128
        },
        {
            "id": "h24rau7",
            "score": 1,
            "text": "Fuk the Catholic Church hierarchy",
            "title_similarity": "0.3413168",
            "sentiment_compound": 0.0
        },
        {
            "id": "h24rp4r",
            "score": -1,
            "text": "When are people gonna realize that no religion gives a shit about women, they just want power to do whatever they want, and tax free wealth.",
            "title_similarity": "0.4557064",
            "sentiment_compound": 0.3182
        },
        {
            "id": "h24rpdn",
            "score": 1,
            "text": "Meanwhile, around the planet…male priests are rogering little boys frequently and just get relocated. Events like these are more reasons for people to turn away from organized religion. Tax them!",
            "title_similarity": "0.58907187",
            "sentiment_compound": 0.4199
        },
        {
            "id": "h24sa3s",
            "score": -1,
            "text": "The Catholic Church is just a tax haven for pedophiles. It should be stripped of all its assets.",
            "title_similarity": "0.6558503",
            "sentiment_compound": 0.1779
        },
        {
            "id": "h24sf88",
            "score": 1,
            "text": "Yet so many stand behind the Catholic Church. Doesn't matter if Priests rape and touch kids , doesn't matter if they hide and cover up rape..I'll never understand Catholics",
            "title_similarity": "0.66540676",
            "sentiment_compound": -0.7613
        },
        {
            "id": "h24ti9g",
            "score": -1,
            "text": "Organized religion is a scam.",
            "title_similarity": "0.39333862",
            "sentiment_compound": -0.5719
        },
        {
            "id": "h24um91",
            "score": 1,
            "text": "Fuck those particular members of cathoclic church",
            "title_similarity": "0.6053757",
            "sentiment_compound": -0.5423
        },
        {
            "id": "h24x676",
            "score": 1,
            "text": "Wow. How Jesus like of them. 🙄",
            "title_similarity": "0.07471095",
            "sentiment_compound": 0.743
        },
        {
            "id": "h24xlhh",
            "score": -1,
            "text": "Good ol Catholic Church. The church of rapists and child sex abuse. It baffles me that people can turn a blind eye to the institutionalized abuse of people perpetuated and enabled by this institution.",
            "title_similarity": "0.6140752",
            "sentiment_compound": -0.926
        },
        {
            "id": "h24y353",
            "score": -1,
            "text": "Sounds about right. The Catholic church have always been the bad guys on this planet",
            "title_similarity": "0.62319946",
            "sentiment_compound": -0.5423
        },
        {
            "id": "h24y7gm",
            "score": 1,
            "text": "I wonder if 40 years from now, she’ll suddenly be a candidate for sainthood…..",
            "title_similarity": "0.45513278",
            "sentiment_compound": 0.0
        },
        {
            "id": "h24z80h",
            "score": -1,
            "text": "I despise the Catholic Church-  just another reason why.  For hundreds of years they’ve protected abusers-  sickening.",
            "title_similarity": "0.71122867",
            "sentiment_compound": -0.7579
        },
        {
            "id": "h257wah",
            "score": 1,
            "text": "The Catholic Church has much to answer for. The Day is coming.",
            "title_similarity": "0.31803268",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2582m7",
            "score": 1,
            "text": "And people wonder why Catholic numbers are declining in first world nations with younger generations…",
            "title_similarity": "0.51054823",
            "sentiment_compound": 0.0
        },
        {
            "id": "h25pm37",
            "score": 1,
            "text": "Oh that’s funny (NOT!). The same church which protects its child molesting priest for decades kicks out a Nun who fights sexual misconduct in the church.  Hypocritical bastards.",
            "title_similarity": "0.825921",
            "sentiment_compound": -0.8622
        },
        {
            "id": "h25qlhz",
            "score": 1,
            "text": "This is a Saint in the making.  It may not be in our lifetimes, but I fully expect she will eventually be sainted.  Taking on corruption in God’s church won’t win friends among people, but it will cause Divine Justice to eventually prevail.  “Arise, oh God, and be the judge who redeems the oppressed.”",
            "title_similarity": "0.5322882",
            "sentiment_compound": 0.9735
        },
        {
            "id": "h26dn86",
            "score": 1,
            "text": ">The FCC report had then said that she had been dismissed for reasons, including driving a vehicle, writing and publishing poems, and lending her support to the protests for the nun who had accused the Roman Catholic Bishop Mulakkal of repeatedly raping and sexually assaulting her.\n\nThis is the punishment for a woman speaking out. But a rapist themselves gets transferred to a different diocese. Lets be clear exactly what she did wrong.\n\n**Driving**\n\n**writing**\n\n**supporting a victim**\n\nFor that she is dismissed. I don't know if that forbids her membership in the church or just removal from her order as a nun.\n\nTimes like these make me wonder about all of that love and forgiveness the church talks about. I suppose God can forgive her, but his church cannot.",
            "title_similarity": "0.837263",
            "sentiment_compound": 0.34
        },
        {
            "id": "h26itzc",
            "score": 1,
            "text": "She forgot the most important tenet of Christianity: the man is always right.",
            "title_similarity": "0.35126114",
            "sentiment_compound": 0.2716
        },
        {
            "id": "h26nykh",
            "score": 1,
            "text": "Very Christianly.",
            "title_similarity": "0.016313074",
            "sentiment_compound": 0.0
        },
        {
            "id": "h273xo2",
            "score": 1,
            "text": "*Just Catholic Things*",
            "title_similarity": "0.22498253",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2fbkdr",
            "score": 1,
            "text": "scumbag catholic church",
            "title_similarity": "0.36584157",
            "sentiment_compound": -0.6369
        },
        {
            "id": "h22a6o7",
            "score": 8,
            "text": "May the Lord bless her and keep her.",
            "title_similarity": "0.14456484",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h22jq0y",
            "score": 8,
            "text": "Catholic Church - Protecting Pervs of all kind since ever.",
            "title_similarity": "0.4575938",
            "sentiment_compound": 0.5267
        },
        {
            "id": "h22212j",
            "score": 39,
            "text": "\"The FCC report had then said that she had been dismissed for reasons, including driving a vehicle, writing and publishing poems, and lending her support to the protests for the nun who had accused the Roman Catholic Bishop Mulakkal of repeatedly raping and sexually assaulting her.\"\n\nWTF...",
            "title_similarity": "0.7777435",
            "sentiment_compound": -0.9329
        },
        {
            "id": "h226vqv",
            "score": 2,
            "text": "Hey Pope, you hearing this? I thought you were turning over a new leaf.",
            "title_similarity": "0.30771863",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2276gy",
            "score": 2,
            "text": "That's what you get for speaking truth to power in the fucked up Catholic church.",
            "title_similarity": "0.52795464",
            "sentiment_compound": -0.4767
        },
        {
            "id": "h227sf0",
            "score": 2,
            "text": "People wonder why religion is losing its grip",
            "title_similarity": "0.4318887",
            "sentiment_compound": -0.3818
        },
        {
            "id": "h228iyg",
            "score": 2,
            "text": "How can anyone have any  \"faith\" in an institution that makes women cover the shame of their monthly period from their \"god\" with a head covering? Middle ages ignorance.",
            "title_similarity": "0.75750417",
            "sentiment_compound": -0.1779
        },
        {
            "id": "h22a8va",
            "score": 2,
            "text": "Fuck the church. More and more people are leaving and those fucks have only got themselves to blame.",
            "title_similarity": "0.7371764",
            "sentiment_compound": -0.8402
        },
        {
            "id": "h22agfg",
            "score": 2,
            "text": "And they hated her because she spoke the truth\n\nSeriously, when will the Christians of the world finally get rid of the obscenity called the Katholik Church? They use their global network of churches to rape women and children and systematically protect the rapers by transfering them when the law is coming for them. It is an obvious pattern. Let's not even get started on the crimes they committed when the church still had more worldly power, like in the middle ages or the colonial era. How can believing Christians all over the world allow an obviously satanic organisation to represent them? You can pray anywhere, read the bible where you like to, no corrupt church is needed for that!",
            "title_similarity": "0.7196039",
            "sentiment_compound": -0.6796
        },
        {
            "id": "h22dqxk",
            "score": 2,
            "text": "She made a vow to serve god....not a corrupt, pedophile money laundering institution....trust me, she's better off.",
            "title_similarity": "0.42179126",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h22e9d9",
            "score": 2,
            "text": "r/atheism",
            "title_similarity": "0.23668575",
            "sentiment_compound": 0.0
        },
        {
            "id": "h22ehth",
            "score": 2,
            "text": "Sounds about right for the Catholic Church",
            "title_similarity": "0.20479134",
            "sentiment_compound": 0.0
        },
        {
            "id": "h22g4qk",
            "score": 2,
            "text": "There you go, the great values of organized religion, the greatest evil ever to be invented in our planet. What one believes personally, it's what one believes. But this \"enlightened\" people in drag keeps having \"the moral high ground\" this species will get nowhere execpt extinction.",
            "title_similarity": "0.51685375",
            "sentiment_compound": 0.795
        },
        {
            "id": "h22gpeg",
            "score": 2,
            "text": "Fuck the church and fuck ANYONE who supports it.",
            "title_similarity": "0.71703655",
            "sentiment_compound": -0.6705
        },
        {
            "id": "h22i19q",
            "score": 2,
            "text": "Sounds about “catholic”. Stay pieces of Shit 👊",
            "title_similarity": "0.34904435",
            "sentiment_compound": -0.5574
        },
        {
            "id": "h22jauj",
            "score": 2,
            "text": "Canadian here. I can attest to the atrocities that the Catholic Church have done in the past. Our federal police are currently investigating several \"residential schools\" which were essentially reeducation camps for Natives in the late 1800's to early 1900's. In Kamloops British Columbia they found a mass grave at one of these schools with approximately 215 bodies of deceased children. There are others across the country now being investigated after this light was shed. Even my own father growing up felt the wrath of the Nuns at his elementary school. Dishing out \"lashings\" with belts and rulers when children did no comply.\n\nThe fact is that horrible people can join these institutions under the guise of a morale compass when in fact they have none and use this to prey upon people, it's truly sickening.",
            "title_similarity": "0.69090456",
            "sentiment_compound": -0.7096
        },
        {
            "id": "h22kb37",
            "score": 2,
            "text": "Hide yo kids and hide ya wife cause they raping everybody out here.",
            "title_similarity": "0.6451357",
            "sentiment_compound": -0.802
        },
        {
            "id": "h22kwe5",
            "score": 2,
            "text": "Uhhhh....title makes her seem real nice but wasn't she removed for making money outside the convent and a bunch of other rule breaks?",
            "title_similarity": "0.44759488",
            "sentiment_compound": 0.2263
        },
        {
            "id": "h22lflf",
            "score": 2,
            "text": "Classic religion for ya.",
            "title_similarity": "0.16943528",
            "sentiment_compound": 0.0
        },
        {
            "id": "h22lncq",
            "score": 2,
            "text": "Surprise. A religion that subjugates women and treats nuns even worse would come to such a conclusion. Church in my area losing there mind about celebrating gay pride but has no problem teaching kids that a woman’s place is at home serving her husband.",
            "title_similarity": "0.6813333",
            "sentiment_compound": 0.5628
        },
        {
            "id": "h22luzm",
            "score": 2,
            "text": "\"Why are we losing followers?\"",
            "title_similarity": "0.39783984",
            "sentiment_compound": -0.3818
        },
        {
            "id": "h22lv8o",
            "score": 2,
            "text": "“Nah we’re gonna keep taping kids. GTFO”",
            "title_similarity": "0.18308856",
            "sentiment_compound": 0.0
        },
        {
            "id": "h22m2js",
            "score": 2,
            "text": "circle of demons.  The Catholic church single-handedly keeps Satan alive.",
            "title_similarity": "0.47536412",
            "sentiment_compound": 0.3818
        },
        {
            "id": "h22m8w7",
            "score": 2,
            "text": "“violating her vows as a nun through her lifestyle”\n\nApearently raping nuns doesn't violate Bishop Franco Mulakkals vows.",
            "title_similarity": "0.6103357",
            "sentiment_compound": -0.4891
        },
        {
            "id": "h22m9xb",
            "score": 2,
            "text": "It's time for Christians to consider seriously that God is there for each one and we do not need a church cult to manipulate our trust in God for their own gains. God is Just, raping nuns and innocent children is not just and the church must shut down and the criminal priests must be thrown away in a jungle, let's see how the beasts deal with them.",
            "title_similarity": "0.59558105",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h22mqn4",
            "score": 2,
            "text": "Absolutely shameful. And if the Catholic Church wonders why it is losing its faithful, they should look inward.",
            "title_similarity": "0.61669385",
            "sentiment_compound": -0.4927
        },
        {
            "id": "h22nauw",
            "score": 2,
            "text": "Bunch of bastards kill me. They invent the ideal of Godliness and then live contrary to it while using it to defend themselves.",
            "title_similarity": "0.5807328",
            "sentiment_compound": -0.743
        },
        {
            "id": "h22nbtr",
            "score": 2,
            "text": "Are you insinuating that a global organization known for murder and rape of children for a century (before that they were MUCH worse) is petty and retaliatory? I’m shocked! Shocked I tell you.",
            "title_similarity": "0.6498334",
            "sentiment_compound": -0.9595
        },
        {
            "id": "h22nzkj",
            "score": 2,
            "text": "You can count on the Catholic Church to protect sexual predators…every time.",
            "title_similarity": "0.47128403",
            "sentiment_compound": 0.3818
        },
        {
            "id": "h22phkt",
            "score": 2,
            "text": "Poor woman, If at least she had sex with young kids The church would protect her",
            "title_similarity": "0.6020152",
            "sentiment_compound": -0.128
        },
        {
            "id": "h22r7lb",
            "score": -2,
            "text": "What a shock, another article tailor made for the liberalati.\n\n**Twenty-five** nuns and **three** Cardinals have gone on record and complained about Mulakka(e)l and his rape-first attitude.  That's why he was arrested and jailed, and why he's on trial.  Sister Lucy, who also is not the rape victim, is the only one being punished in this way.  Usually, that means that lil Sis ain't being punished for complaining about a raping cardinal, but more than likely, how she's doing it.  Your 'article' here leaves that tidbit of information out, but go ahead and keep thinking the Catholic Church is still going out of it's way to defend rapists in 2021.  The collapse of liberal civilization has already begun, and stuff like this just accelerates the timeline towards the civil war you guys are going to start.",
            "title_similarity": "0.69044304",
            "sentiment_compound": -0.968
        },
        {
            "id": "h22rafb",
            "score": 2,
            "text": "More digging revealed that she’s getting kicked out for a lot of reasons not related to protesting the Bishop, and more to do with her breaking quite a few convent rules of conduct prior to the Bishop scandal. Articles like this are gold to those who wish to smear the Church.",
            "title_similarity": "0.7378712",
            "sentiment_compound": 0.2805
        },
        {
            "id": "h22so97",
            "score": 2,
            "text": "Fucking cults",
            "title_similarity": "0.320378",
            "sentiment_compound": 0.0
        },
        {
            "id": "h22twdg",
            "score": 2,
            "text": "Scummy people do scummy thing to a victim of their scum.",
            "title_similarity": "0.4101066",
            "sentiment_compound": -0.2732
        },
        {
            "id": "h22u6gs",
            "score": 2,
            "text": "How about every nation nationalizes all church property and assets in its territory, and uses the proceeds to fund compensation for victims and social programs for the population?",
            "title_similarity": "0.50838476",
            "sentiment_compound": -0.1531
        },
        {
            "id": "h22u715",
            "score": 2,
            "text": "And you won’t hear one religious person or conservative talk about it.",
            "title_similarity": "0.4313287",
            "sentiment_compound": 0.0
        },
        {
            "id": "h22uc9p",
            "score": 2,
            "text": "> Is this what Christianity is about?\n\nPedophilia and cover ups? Pretty sure, yeah.",
            "title_similarity": "0.45429763",
            "sentiment_compound": 0.7941
        },
        {
            "id": "h22vazw",
            "score": 2,
            "text": "Why do people think religions are moral again?",
            "title_similarity": "0.16442233",
            "sentiment_compound": 0.0
        },
        {
            "id": "h231ar6",
            "score": -2,
            "text": "The rape case was not why she was exiled btw, she broke multiple oaths she had been sworn to and also apparently stole money. Not that the smarmy Redditors will care but whatever, that’s the truth so accept it or don’t.",
            "title_similarity": "0.63827753",
            "sentiment_compound": 0.7049
        },
        {
            "id": "h232tt6",
            "score": -2,
            "text": "She broke many covenant rules, embezzled money to publish a book and was told she would be removed for doing so before the protests. That part doesn't get discussed because it's less sensational.",
            "title_similarity": "0.7124609",
            "sentiment_compound": -0.6077
        },
        {
            "id": "h233xbf",
            "score": -2,
            "text": "Poor lady suffers from Stockholm Syndrome.",
            "title_similarity": "0.48690155",
            "sentiment_compound": -0.7351
        },
        {
            "id": "h23bjke",
            "score": 2,
            "text": "ABSOLUTE FUCKERY. CATHOLIC CHURCH IS PROTECTING THEIR RAPIST, PEDOPHILE FUCKS- as always",
            "title_similarity": "0.59964573",
            "sentiment_compound": -0.8877
        },
        {
            "id": "h23d0yg",
            "score": 2,
            "text": "This is why Catholicism is a joke of a cult.",
            "title_similarity": "0.3721922",
            "sentiment_compound": 0.296
        },
        {
            "id": "h23dw9w",
            "score": 2,
            "text": "Pope Francis is not a Christian nor a Catholic. Just look at the cross he wears (man with arms cross chest). The cross symbolizes Christs victory over the curse of the law, which freed man from sin. \n\nThe guy on the Pope's cross is either not JC or is dead JC (ie, celebrating the death of JC, not the sacrifice or resurrection). \n\nA true person of god isn't going to cover up rape of children or anyone else. Hence why so many denominations have broke communion with the RCC. \n\nThe Vatican and Rome have been warned plenty of times about their misdeeds. Now RCC churches are breaking doctrine and endorsing communion improperly and discouraging confession. It's not a Catholic or Christian institute. Non religious people or those who don't study theology don't usually understand that aspect. \n\nThe ones standing up to the corruption, like in politics, are smeared and silenced.",
            "title_similarity": "0.60546505",
            "sentiment_compound": -0.9432
        },
        {
            "id": "h23o4st",
            "score": -2,
            "text": "I'm sure nobody in this comment section will fire off insults at the Church from the hip will be totally levelheaded.",
            "title_similarity": "0.67411983",
            "sentiment_compound": -0.4404
        },
        {
            "id": "h245hu8",
            "score": 2,
            "text": "She's welcome with us non raping agnostics.",
            "title_similarity": "0.18708648",
            "sentiment_compound": -0.4215
        },
        {
            "id": "h245swi",
            "score": 2,
            "text": "Not sure how this is a surprise considering their history with children…",
            "title_similarity": "0.18345487",
            "sentiment_compound": 0.0356
        },
        {
            "id": "h248gst",
            "score": 2,
            "text": "A religious organization being shitty human beings that goes against directly what they like to preach *shocked pikachu*",
            "title_similarity": "0.5992124",
            "sentiment_compound": -0.5267
        },
        {
            "id": "h24qgws",
            "score": 2,
            "text": "Fuck the “church”.",
            "title_similarity": "0.5321524",
            "sentiment_compound": -0.5423
        },
        {
            "id": "h24qktu",
            "score": 2,
            "text": "Seriously fuck the Catholic Church.",
            "title_similarity": "0.5992006",
            "sentiment_compound": -0.6369
        },
        {
            "id": "h24ux0q",
            "score": -2,
            "text": "Religion is a cult.",
            "title_similarity": "0.21314882",
            "sentiment_compound": 0.0
        },
        {
            "id": "h24z1bn",
            "score": -2,
            "text": "Sister, as a recovered catholic I hope you can put those clowns in the rear view and join humanity. We can use you on the no religion team.",
            "title_similarity": "0.50782067",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h24zrb3",
            "score": -2,
            "text": "The Catholic Church should be burned to the ground",
            "title_similarity": "0.6238617",
            "sentiment_compound": 0.0
        },
        {
            "id": "h255mv6",
            "score": -2,
            "text": "She is better off out of this rapist club anyway. Witness the catholic \"church\" just updated their laws to give cover to rapist.",
            "title_similarity": "0.69273186",
            "sentiment_compound": -0.8713
        },
        {
            "id": "h25dvuy",
            "score": 2,
            "text": "Guys, hear me out.\n\nI think the Catholic Church might be a bad organization.",
            "title_similarity": "0.48566043",
            "sentiment_compound": -0.5423
        },
        {
            "id": "h25qhc9",
            "score": 2,
            "text": "The Catholic Church covering up a sexual assault cases?? No wayyyyyyyy",
            "title_similarity": "0.612337",
            "sentiment_compound": -0.7476
        },
        {
            "id": "h21y50y",
            "score": 232,
            "text": "Wow, the lord works in some really fucking mysterious ways",
            "title_similarity": "0.19967368",
            "sentiment_compound": 0.5859
        },
        {
            "id": "h22a190",
            "score": 21,
            "text": "You don’t need a church to have faith!",
            "title_similarity": "0.24416663",
            "sentiment_compound": 0.4753
        },
        {
            "id": "h229280",
            "score": 41,
            "text": "What's with the weird number of full screeds trying to play this large pro rape organization off as the victim because one member had the audacity not to play ball with their cover ups?",
            "title_similarity": "0.60436916",
            "sentiment_compound": -0.7805
        },
        {
            "id": "h2228li",
            "score": 193,
            "text": "Just like Jesus would do.",
            "title_similarity": "0.08208777",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h23dbwl",
            "score": 11,
            "text": "Raised Catholic in a family with deep Irish Catholic roots in a very Catholic city and I 100% believe the Catholic Church needs to be abolished. Immediately.",
            "title_similarity": "0.64519787",
            "sentiment_compound": 0.0
        },
        {
            "id": "h21z5m8",
            "score": 3,
            "text": "Here lies the origin story of Medusa...",
            "title_similarity": "0.15018281",
            "sentiment_compound": -0.4215
        },
        {
            "id": "h22aqfi",
            "score": 2,
            "text": "I just can't believe the Vatican would protect a rapist, what with their glowing record of outing/reporting those pesky kiddie fiddlers /s",
            "title_similarity": "0.5900161",
            "sentiment_compound": -0.6705
        },
        {
            "id": "h22dn80",
            "score": 3,
            "text": "Classic Catholic Church",
            "title_similarity": "0.2198338",
            "sentiment_compound": 0.0
        },
        {
            "id": "h22fpec",
            "score": 3,
            "text": "It's time for me to officially renounce Christianity and remove myself from their list of members. Fucking tired of this BS.",
            "title_similarity": "0.7665081",
            "sentiment_compound": -0.4927
        },
        {
            "id": "h22fvjd",
            "score": 3,
            "text": "Nice church. Fucking muppets.",
            "title_similarity": "0.13857436",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h22hy8j",
            "score": 4,
            "text": "The church still allows child abusers to remain as clergy. They still continue to take care of their needs whilst allowing victims to suffer. They take no action against all those who know and cover it up. But they get rid of those who speak up. They are not the church of Jesus. They are a business and they meet every definition of a criminal organisation. Yet governments are scared to stand up to them. \nThe Pope even declared that those who are critical of the church are in league with Satan. Well I'm a victim of childhood sexual abuse by clergy. I am critical of the church. And of these people are going to heaven then it is not a place where I would want to be.",
            "title_similarity": "0.67750406",
            "sentiment_compound": -0.9625
        },
        {
            "id": "h22iats",
            "score": 3,
            "text": "Could it be that maybe, just maybe, the catholic church a bit evil?",
            "title_similarity": "0.4223218",
            "sentiment_compound": -0.6597
        },
        {
            "id": "h22jg5s",
            "score": 3,
            "text": "Thr important question is: When will the Catholic Church stop being a rape apologists' criminal enterprise?",
            "title_similarity": "0.66702336",
            "sentiment_compound": -0.8591
        },
        {
            "id": "h22jupu",
            "score": 3,
            "text": "Would you really expect better from the Catholic Church?",
            "title_similarity": "0.32557812",
            "sentiment_compound": 0.4902
        },
        {
            "id": "h22k95m",
            "score": 3,
            "text": "Religion should simply have no place in modern society. It holds us back and serves only as something to hide behind for the ignorant, hateful and perverted.",
            "title_similarity": "0.5250083",
            "sentiment_compound": -0.8934
        },
        {
            "id": "h22lxqr",
            "score": 2,
            "text": "This is horrible, but still probably in her best interest. The Catholic church is one of the worst organisations in the world. She's better off without them. We all are.",
            "title_similarity": "0.686702",
            "sentiment_compound": 0.775
        },
        {
            "id": "h22m8nb",
            "score": 3,
            "text": "shame forever to catholic priests and their institution, the religion of pedophiles",
            "title_similarity": "0.66387725",
            "sentiment_compound": -0.4767
        },
        {
            "id": "h22nmq7",
            "score": 3,
            "text": "Time's up for the Catholic Church. I live in Canada and I've never heard a good thing about the church. I don't understand how an organisation can kidnap, rape, beat, starve, murder and bury children hundred of miles away from their families in unmarked mass graves and we as a society are like \"Yeah, that's fine! You want to do my kid next?\"",
            "title_similarity": "0.69726753",
            "sentiment_compound": -0.9081
        },
        {
            "id": "h22qjc9",
            "score": 4,
            "text": "From the Wiki page on the Bishop-prick:  \"80 witnesses, including a cardinal, three bishops, 11 priests and 25 nuns, according to Indian Catholic group Save our Sisters, have issued statements against Mulakkal.\"",
            "title_similarity": "0.65359354",
            "sentiment_compound": 0.4939
        },
        {
            "id": "h22syze",
            "score": 3,
            "text": "She’s being expelled because of her support of a rape victim.",
            "title_similarity": "0.69842505",
            "sentiment_compound": -0.7269
        },
        {
            "id": "h22tal7",
            "score": 2,
            "text": "Religion is a curse\n\nLive your whole life in their service following their commands, in poverty and celibacy.\n\nThey reward you with rape",
            "title_similarity": "0.6402252",
            "sentiment_compound": -0.8316
        },
        {
            "id": "h22tzcs",
            "score": 3,
            "text": "That’s the church protecting its ass and not it’s flock or female clergy",
            "title_similarity": "0.42911282",
            "sentiment_compound": -0.5423
        },
        {
            "id": "h22u857",
            "score": 4,
            "text": "And who here is surprised.  Catholic priests have been raping women, children and men for thousands of years and then being protected by the Vatican.  She should be glad to be rid of THEM.",
            "title_similarity": "0.7310523",
            "sentiment_compound": 0.25
        },
        {
            "id": "h23db8w",
            "score": 2,
            "text": "They call themselves Christians.  And Donald Trump is an honorable man. 😂",
            "title_similarity": "0.14257598",
            "sentiment_compound": 0.7506
        },
        {
            "id": "h23dnrd",
            "score": 3,
            "text": "We’re at the point where anyone with an ounce of decent morals couldn’t remain a Catholic. \n\nAnyone who remains a Catholic after watching the Catholic Church systematically support and protect rapists and molesters should be ashamed of themselves.",
            "title_similarity": "0.682661",
            "sentiment_compound": -0.743
        },
        {
            "id": "h23kpbe",
            "score": -4,
            "text": "As a Christian, it always bothers me when people lump Catholicism in with Christianity. The vast majority of regular, non denominational Christians are just normal people who tithe/give a little extra to charity/the community.\n\nCatholicism on the other hand is designed structurally to be evil and to exploit poor/defenseless people via crime and villainy.",
            "title_similarity": "0.59333754",
            "sentiment_compound": -0.8885
        },
        {
            "id": "h245u8d",
            "score": 3,
            "text": "Excommunication is such an insanely stupid and hypocritical concept- who the fuck thinks that man has say over God?\n\nReligion’s a joke tho so it’s aight",
            "title_similarity": "0.5081494",
            "sentiment_compound": -0.765
        },
        {
            "id": "h24qd6b",
            "score": 3,
            "text": "This comes as a complete and total shock to no one.",
            "title_similarity": "0.4316944",
            "sentiment_compound": -0.6549
        },
        {
            "id": "h24zx1h",
            "score": -3,
            "text": "Perfect example of mainstream religions also being cults",
            "title_similarity": "0.13139908",
            "sentiment_compound": 0.5719
        },
        {
            "id": "h22uuka",
            "score": 13,
            "text": "Discommunication means they just tried to damn her soul to hell for this",
            "title_similarity": "0.6680436",
            "sentiment_compound": -0.8074
        },
        {
            "id": "h22n9hv",
            "score": 12,
            "text": "Religions are toxic cults run by hypocritical charlatans who want to put the fear of fairy tales into the weak and deluded in order to control and abuse them in a variety of ways. Scour these tax shelters from the Earth.",
            "title_similarity": "0.59235126",
            "sentiment_compound": -0.9186
        },
        {
            "id": "h220dui",
            "score": 5,
            "text": "This is the best tl;dr I could make, [original](https://thewire.in/rights/kerala-sister-lucy-who-protested-against-rape-accused-bishop-ordered-to-leave-convent) reduced by 83%. (I'm a bot)\n*****\n> In January 2019, Kalappura had protested against Bishop Franco Mulakkal, who has been accused of raping a fellow nun between 2014 and 2016.\n\n> The FCC report had then said that she had been dismissed for reasons, including driving a vehicle, writing and publishing poems, and lending her support to the protests for the nun who had accused the Roman Catholic Bishop Mulakkal of repeatedly raping and sexually assaulting her.\n\n> Even after her appeals were rejected, Kalappura had said that she would not leave the convent and would let the court decide.\n\n\n*****\n[**Extended Summary**](http://np.reddit.com/r/autotldr/comments/o1p09m/sister_lucy_the_nun_who_took_bishop_franco/) | [FAQ](http://np.reddit.com/r/autotldr/comments/31b9fm/faq_autotldr_bot/ \"Version 2.02, ~583142 tl;drs so far.\") | [Feedback](http://np.reddit.com/message/compose?to=%23autotldr \"PM's and comments are monitored, constructive feedback is welcome.\") | *Top* *keywords*: **Catholic**^#1 **nun**^#2 **rejected**^#3 **appeal**^#4 **FCC**^#5",
            "title_similarity": "0.7842824",
            "sentiment_compound": -0.9032
        },
        {
            "id": "h228t8x",
            "score": 4,
            "text": "How long has it been since the Catholic Church's last rape scandal? 20? 30 seconds?",
            "title_similarity": "0.65779316",
            "sentiment_compound": -0.8458
        },
        {
            "id": "h22e9s9",
            "score": 3,
            "text": "I love God but fuck all organized religion",
            "title_similarity": "0.45959896",
            "sentiment_compound": -0.3818
        },
        {
            "id": "h22pg4h",
            "score": 3,
            "text": "With the pedo priest scandal a former Pope said they didn’t feel like they had the right to defrock priests and that’s why they didn’t boot the molestors. \n\nSeems like they don’t have that problem with booting nuns for much less.",
            "title_similarity": "0.60432523",
            "sentiment_compound": -0.1531
        },
        {
            "id": "h22xp3b",
            "score": -4,
            "text": "This is so gay",
            "title_similarity": "-0.047366407",
            "sentiment_compound": 0.0
        },
        {
            "id": "h22zz6p",
            "score": 4,
            "text": "[deleted]",
            "title_similarity": "0.29835454"
        },
        {
            "id": "h240hbq",
            "score": 5,
            "text": "Whelp it's about time we all band together and abolished the Catholic church. Round up these cowards and toss their child molesting asses in a volcano they all deserve to burn in hell.",
            "title_similarity": "0.7600145",
            "sentiment_compound": -0.8555
        },
        {
            "id": "h22wxih",
            "score": 16,
            "text": "The Catholic Church is the world's largest criminal organization.",
            "title_similarity": "0.49652752",
            "sentiment_compound": -0.5267
        },
        {
            "id": "h22m9br",
            "score": 5,
            "text": "I think the time for this 'organization' to pay financially and legally for the atrocities of their members.  🇨🇦 has just discovered 215 unmarked graves of children.  Unfortunately,  I do not think we are the only country this happened.  But, they need to be held accountable in every way on every case.",
            "title_similarity": "0.559776",
            "sentiment_compound": -0.3182
        },
        {
            "id": "h22tvji",
            "score": 5,
            "text": "I can't stand all the references to the \"Catholic legal system\" as though it's a legitimate legal entity. If the \"laws\" and punishments for breaking those \"laws\" only apply to those within the group itself and not society as a whole then they are nothing but workplace and membership rules. I was raised Catholic and though I left the church many years ago I never formally left and never will because to do so would again give some sort of legitimacy to their process. Maybe I'll care about the Catholic Church's process when it stops protecting pedophiles and rapists but till then I say \"Fuck right off,\" to the Catholic Church.",
            "title_similarity": "0.6603899",
            "sentiment_compound": -0.8658
        },
        {
            "id": "h230tdf",
            "score": 4,
            "text": "Why do we keep these overglorified pedophilia rings around",
            "title_similarity": "0.26528025",
            "sentiment_compound": 0.0
        },
        {
            "id": "h232lqk",
            "score": 4,
            "text": "Don't let them trick you into thinking the Catholic Church is about helping the weak. No matter how modern or nice some of their members may seem, including the current pope. It's all about keeping power, even if doing that implies putting that power in the hands of abusers.",
            "title_similarity": "0.49327564",
            "sentiment_compound": -0.3455
        },
        {
            "id": "h2333qf",
            "score": 5,
            "text": "All religions are cults and should be ashamed of themselves with how they treat people and their “members”.  Why does god need so much money?",
            "title_similarity": "0.61909926",
            "sentiment_compound": 0.1779
        },
        {
            "id": "h241owc",
            "score": 4,
            "text": "Catholics are complicit with rape. They know the money they give to the church goes to victims of the clergy and they still keep sending their children. Surprised this hasn't disillusioned Sister Lucy to any religion.",
            "title_similarity": "0.655954",
            "sentiment_compound": -0.571
        },
        {
            "id": "h2458m7",
            "score": 4,
            "text": "People still believe in religion 😂🤣🤣😂🤣",
            "title_similarity": "0.07692934",
            "sentiment_compound": 0.9371
        },
        {
            "id": "h25kv1o",
            "score": -5,
            "text": "If anyone deserves to be raped it's a nun.\nMaybe she thought she was safe because she wasn't a young boy. She worked for the largest pedophile ring in the world, go look somewhere else for pity. \n\nDisclaimer: nuns are horrible.",
            "title_similarity": "0.7133953",
            "sentiment_compound": -0.8126
        },
        {
            "id": "h22ehfc",
            "score": 18,
            "text": "Considering some of the text written in the comments, the solution to this problem is to not allow your children to be baptized in the first place.\n\nNOT, to advocate something against the religion, but to end the church. Like all systems, corruption putrefies it when the variable is time.\n\nThis isn't an institution of God, it's an institution of rapists, coin and flesh peddlers. The men are dirty. Their minds are dirty.",
            "title_similarity": "0.63139415",
            "sentiment_compound": -0.8829
        },
        {
            "id": "h22xgpv",
            "score": 5,
            "text": "Religion is poison.",
            "title_similarity": "0.43557048",
            "sentiment_compound": -0.5423
        },
        {
            "id": "h22aj8e",
            "score": 23,
            "text": "That's very Christian of them.",
            "title_similarity": "0.016431104",
            "sentiment_compound": 0.0
        },
        {
            "id": "h22ezqa",
            "score": 7,
            "text": "Can’t be much more hypocritical than the Catholic Church.",
            "title_similarity": "0.33351427",
            "sentiment_compound": -0.5095
        },
        {
            "id": "h22ur1n",
            "score": 7,
            "text": "this is the kind of bullshit you have to put up with when you join a cult.",
            "title_similarity": "0.60145545",
            "sentiment_compound": -0.4391
        },
        {
            "id": "h21vg7a",
            "score": 1507,
            "text": "I mean, yeah.  She's going against the central doctrine of the Catholic church: \"Snitches get stitches.\"",
            "title_similarity": "0.7257204",
            "sentiment_compound": 0.296
        },
        {
            "id": "h22vwby",
            "score": 10,
            "text": "Interesting, an Indian woman denied dignity after confronting men about rape. Where have we heard that before! Fucking appalling.",
            "title_similarity": "0.6990378",
            "sentiment_compound": -0.7836
        },
        {
            "id": "h22uaip",
            "score": 12,
            "text": "Good. Someone take her in and support her ministry. She’ll shine brighter on her own than she ever could have. Meanwhile, the Catholic Church needs to shrivel and die.",
            "title_similarity": "0.5788125",
            "sentiment_compound": 0.5106
        },
        {
            "id": "h22w0g4",
            "score": 14,
            "text": "These are supposedly the \"good\" and the \"just\" people of the world.",
            "title_similarity": "0.039045587",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h22wl9f",
            "score": 12,
            "text": "Why is anyone Catholic anymore? Its not like this church stands up for the values in their book.",
            "title_similarity": "0.52894443",
            "sentiment_compound": 0.1506
        },
        {
            "id": "h223ozd",
            "score": 2525,
            "text": "For those curious about things the article is vague on (or are too lazy to read it), I did some additional research:\n\n* The Bishop, [Franco Mulakkal](https://en.wikipedia.org/wiki/Franco_Mulakkal), faced accusations of rape from a nun (as well as sexual assault from three other women) in the summer of 2018. In September of that year, protests were organized against him; he resigned, and he was arrested and charged with rape several days later.\n\n* Sister Lucy Kalappurakkal (the nun in the article) is not one of his sexual assault victims, nor was anyone else in her religious order (the Franciscan Clarist Congregation). The nun who the Bishop raped, as well as all the nuns named in news articles as organizing the protests, were part of a different order (Missionaries of Jesus).\n\n* As a Clarist nun, Sister Lucy had to abide by vows of chastity, poverty (no ownership of personal property), and obedience toward her superiors.\n\n* Sister Lucy has had a rocky relationship with the Church since 2015, when she was given a transfer order to a different convent and refused; her Superior General at the time (Sister Stephina) was not her Superior General in 2018 (Sister Ann Joseph).\n\n* At some point before 2018, she also published a book of her poetry without official approval, taking a total of 60,000 rupees (a bit under $700 USD) to do it. She also kept the proceeds from the book sales without sharing it with the convent.\n\n* In 2017, she also secured a driver's license, got a car loan, and registered it her own name, without the knowledge or approval of her superiors. She is also said to have withheld some of her government paychecks as a schoolteacher and not turned it over to the convent.\n\n* During the 2018 protests against Bishop Franco demanding his arrest, Sister Lucy left the convent and attended the protests without permission. She also published unauthorized articles in secular papers, gave interviews to the news, and made social posts that \"belittled the Catholic leadership by making false accusations against it and tried to bring down the sacraments.\" I couldn't find any transcriptions or more detailed summary of her comments. As a result, she was effectively confined to the convent and told to make no more public statements.\n\n* At some point on 2018, she was accused of letting a female journalist stay in the convent overnight and going out in public without her habit (nun's uniform). It's unclear whether this happened before or after her confinement.\n\n* From January to March 2019, she was issued official warnings, to which she responded with replies she felt sufficiently justified her actions. Needless to say, the superiors in her order felt her explanations were insufficient justifications, said she had made no effort to amend her actions, and went ahead with dismissal in May.\n\n* For the next two years, she continually appealed her decision throughout the Catholic hierarchy, all the way to the Supreme Tribunal of the Apostolic Signatura in the Vatican. This month, the Tribunal dismissed her appeal, finalizing her expulsion from the Franciscan Clarist Congregation.\n\n* This is *NOT* the same thing as being expelled from the Catholic Church as a whole, which the title gets wrong; that's a completely different matter called excommunication for particular serious crimes (preaching heresy, physically harming the Pope, performing an abortion, defiling the Eucharist, etc.). Sister Lucy is now officially a laywoman in the Catholic Church.\n\nFor those curious about my sources, I mainly used [the News Minute](https://www.thenewsminute.com/article/publishing-poems-supporting-rape-survivor-crimes-sr-lucy-according-church-94722), [the Indian Express](https://indianexpress.com/article/india/kerala/lucy-kalapura-church-vatican-appeal-7358676/), and [the Deccan Chronicle](https://www.deccanchronicle.com/nation/current-affairs/170219/sr-lucy-kalappurakkal-receives-third-notice-with-warning-of-expulsion.html). If anyone has any more detailed or reliable sources, feel free to share them.",
            "title_similarity": "0.8120692",
            "sentiment_compound": -0.9918
        },
        {
            "id": "h22u38m",
            "score": 13,
            "text": "Man. The Catholic church seems oddly similar to what I imagine Satan would be like.",
            "title_similarity": "0.38124436",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h22xlub",
            "score": 14,
            "text": "[removed]",
            "title_similarity": "0.25901917"
        },
        {
            "id": "h22tusj",
            "score": 50,
            "text": "I'd bet my bottom dollar the rapist won't be kicked out though...",
            "title_similarity": "0.34357473",
            "sentiment_compound": -0.7096
        },
        {
            "id": "h21yfcx",
            "score": 1810,
            "text": "I left the Catholic church a long time ago because of its terrible history of abuse and failures to address it.",
            "title_similarity": "0.7517836",
            "sentiment_compound": -0.8834
        },
        {
            "id": "h22vcro",
            "score": 55,
            "text": "> she had been dismissed for reasons, including **driving a vehicle**, writing and **publishing poems**, and lending her **support to the protests** for the nun who had accused the Roman Catholic Bishop Mulakkal of repeatedly raping and sexually assaulting her. \n\n&nbsp;\n\nDoing Satan's work, obviously.",
            "title_similarity": "0.762869",
            "sentiment_compound": -0.8591
        },
        {
            "id": "h22xcrm",
            "score": 224,
            "text": "They wonder why their church is in decline smh It’s hard to listen to clergy speak to you about God when they protect Rapist & Pedophiles at every turn…",
            "title_similarity": "0.64077747",
            "sentiment_compound": -0.5994
        },
        {
            "id": "h21wolf",
            "score": 7609,
            "text": "Got an appointment setup to leave the church. I've waited far, far too long with this decision.",
            "title_similarity": "0.5807568",
            "sentiment_compound": -0.0516
        },
        {
            "id": "h21w0xb",
            "score": 7133,
            "text": "Well if the Catholic church protects child molesters in its ranks, what chance does a rape victim have?",
            "title_similarity": "0.57513",
            "sentiment_compound": -0.6808
        },
        {
            "id": "h22451u",
            "score": 10286,
            "text": "In Ireland there was a way to formally record that you were no longer a Catholic and require the church to record that fact. Over 12,000 people started this \"Declaration of Defection\" process. But in April 2011 the Catholic Church changed church law and removed the option to record formal defections.",
            "title_similarity": "0.72186697",
            "sentiment_compound": -0.6757
        },
        {
            "id": "h22ahcy",
            "score": 6267,
            "text": "Sister Lucy taught me Maths in 7th grade, in 2007. She is very humble and an amazing person always ready to help students out in every sort of problems, be it academic or personal. she was always very kind to all students, which is very rare.",
            "title_similarity": "0.3766393",
            "sentiment_compound": 0.8658
        },
        {
            "id": "h22wfi8",
            "score": 170,
            "text": "The catholic church doesn't need enemies, it's doing an excellent job of destroying itself.",
            "title_similarity": "0.34482297",
            "sentiment_compound": 0.4075
        },
        {
            "id": "h226fxz",
            "score": 1,
            "text": "Calling /u/johndehlin \n\nThis would be a great interview if it could ever be managed!",
            "title_similarity": "0.1534181",
            "sentiment_compound": 0.6588
        },
        {
            "id": "h2289uf",
            "score": 2,
            "text": "One second they're 'ashamed', next second they protect those they are ashamed of.",
            "title_similarity": "0.2923628",
            "sentiment_compound": -0.5574
        },
        {
            "id": "h228m3p",
            "score": 2,
            "text": "\"HOW DARE YOU TELL PEOPLE WHAT WE DID!\" - Religious people of faith...",
            "title_similarity": "0.5271632",
            "sentiment_compound": 0.4753
        },
        {
            "id": "h228n4h",
            "score": 1,
            "text": "Typical Catholic church, openly supporting rape while their members just shake their heads and continue to open their wallets.\n\nI don't get how people can think an organization that does things like this is their key to salvation. What type of salvation is that to acquire?",
            "title_similarity": "0.6095285",
            "sentiment_compound": -0.25
        },
        {
            "id": "h228yi1",
            "score": 1,
            "text": "If you killed him for raping you would you go to hell?",
            "title_similarity": "0.56710184",
            "sentiment_compound": -0.9423
        },
        {
            "id": "h229el2",
            "score": 1,
            "text": "Nothing new",
            "title_similarity": "0.09059684",
            "sentiment_compound": 0.0
        },
        {
            "id": "h229qv7",
            "score": 1,
            "text": "I think so. I did. What, want to say buh-bye?",
            "title_similarity": "0.1149662",
            "sentiment_compound": 0.0772
        },
        {
            "id": "h229tb9",
            "score": 1,
            "text": "Welcome to modern day Christianity. Mormons cover up a load of shit as well because, \"just forgive and forget\". Gross",
            "title_similarity": "0.56115294",
            "sentiment_compound": -0.34
        },
        {
            "id": "h229xut",
            "score": 1,
            "text": "Excommunicado. Mr Wick.",
            "title_similarity": "0.23290515",
            "sentiment_compound": 0.0
        },
        {
            "id": "h22a0bt",
            "score": 1,
            "text": "So the went full Vatican on her, welcome to the club of millions of other people they abused I guess. TAX all religious groups, this would solve a lot of the worlds crimes.",
            "title_similarity": "0.67500013",
            "sentiment_compound": 0.128
        },
        {
            "id": "h22af4f",
            "score": 1,
            "text": "FREEDOM!!!",
            "title_similarity": "-0.10479325",
            "sentiment_compound": 0.7249
        },
        {
            "id": "h22afp7",
            "score": 1,
            "text": "Of course they did, they’re the catholic church, that’s what they do, they’re simply people made out of excrement.",
            "title_similarity": "0.499807",
            "sentiment_compound": 0.0
        },
        {
            "id": "h22ahii",
            "score": 1,
            "text": "What is the story of Sister Lucy?",
            "title_similarity": "0.3764028",
            "sentiment_compound": 0.0
        },
        {
            "id": "h22aj54",
            "score": 1,
            "text": "Wow, that is disgusting of the church. That poor lady.",
            "title_similarity": "0.6335951",
            "sentiment_compound": -0.4019
        },
        {
            "id": "h22avbv",
            "score": 1,
            "text": "If he’ll truest exist I imagine I would be meeting all Catholics there.",
            "title_similarity": "0.37213326",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h22awo6",
            "score": 1,
            "text": "Of couse, this is obviously the Christian thing to do.",
            "title_similarity": "0.17804769",
            "sentiment_compound": 0.0
        },
        {
            "id": "h22axnq",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.25901917"
        },
        {
            "id": "h22axrl",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.25901917"
        },
        {
            "id": "h22b48p",
            "score": 1,
            "text": "Seriously this world in the last 10 years has done a 180! What is happening? People have become complete idiots and accustomed to down right fuckery! Some weird shit happened we are not being told about! Beside this normally predatory church bullshit! I’m thinking we are in a sci fi movie!",
            "title_similarity": "0.67995274",
            "sentiment_compound": -0.8994
        },
        {
            "id": "h22b4g4",
            "score": 1,
            "text": "\"Bring in the Cumvee 3000!\"",
            "title_similarity": "0.19896826",
            "sentiment_compound": 0.0
        },
        {
            "id": "h22b82w",
            "score": 1,
            "text": "“The Catholic Church is evil?!??” - nobody who has even remote knowledge of the last two thousand years",
            "title_similarity": "0.7160628",
            "sentiment_compound": 0.0
        },
        {
            "id": "h22bgar",
            "score": 1,
            "text": "**How Christian of them**",
            "title_similarity": "0.083528735",
            "sentiment_compound": 0.0
        },
        {
            "id": "h22bsun",
            "score": 1,
            "text": "In Slovakia with help of [this webpage](https://zbohom.net/) you can leave the church. Page name translates as Godbye (pun intended).",
            "title_similarity": "0.41501355",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h22bwpk",
            "score": 1,
            "text": "Somehow I'm not surprised.. bloody cultists",
            "title_similarity": "0.21757886",
            "sentiment_compound": 0.1877
        },
        {
            "id": "h22bx4j",
            "score": 1,
            "text": "Gald this is popular. She has gone through a lot already.",
            "title_similarity": "0.17370433",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h22c2zg",
            "score": 1,
            "text": "They are still brainwashed: [https://www.youtube.com/watch?v=w12O4kndiLE](https://www.youtube.com/watch?v=w12O4kndiLE) Just leave the church people, they don't give a fuck about you.",
            "title_similarity": "0.6804654",
            "sentiment_compound": 0.4606
        },
        {
            "id": "h22c7gl",
            "score": 1,
            "text": "Catholic Church cares",
            "title_similarity": "0.17683183",
            "sentiment_compound": 0.4588
        },
        {
            "id": "h22c91d",
            "score": 1,
            "text": "It’s a sick world out there.",
            "title_similarity": "0.2850529",
            "sentiment_compound": -0.5106
        },
        {
            "id": "h22ca25",
            "score": 1,
            "text": "You know how I left? My grandma kept throwing holy water on me, and one day I screamed in pain and unholy torment. Heh. They don't want me back.",
            "title_similarity": "0.76683784",
            "sentiment_compound": -0.7523
        },
        {
            "id": "h22ckrp",
            "score": 1,
            "text": "Just goes to prove once again, the Church is a sham.",
            "title_similarity": "0.5652064",
            "sentiment_compound": 0.0
        },
        {
            "id": "h22ckzr",
            "score": 1,
            "text": "Dear sister Lucy, \n As aunty crabby and living waters would have done. I invite you to argentina. We have food.",
            "title_similarity": "0.41479778",
            "sentiment_compound": 0.4939
        },
        {
            "id": "h22cocf",
            "score": 1,
            "text": "[deleted]",
            "title_similarity": "0.29835454"
        },
        {
            "id": "h22cq3p",
            "score": 1,
            "text": "And the church wonders why people don't like them or turn up for service",
            "title_similarity": "0.52109545",
            "sentiment_compound": -0.2755
        },
        {
            "id": "h22crz9",
            "score": 1,
            "text": "“The pope must hear this? “, “What did the Pope say?”, “ This is not fair!” This is not how democracy works.",
            "title_similarity": "0.4841918",
            "sentiment_compound": 0.0
        },
        {
            "id": "h22culi",
            "score": 2,
            "text": "Weird of the Catholic Church to strip someone of age",
            "title_similarity": "0.6066611",
            "sentiment_compound": -0.1779
        },
        {
            "id": "h22cvn8",
            "score": 2,
            "text": "What the world would be like when people realize religion needs them rather than them needing religion.",
            "title_similarity": "0.17852157",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h22cvox",
            "score": 1,
            "text": "HORRIBLE",
            "title_similarity": "0.27725312",
            "sentiment_compound": -0.5423
        },
        {
            "id": "h22cw9c",
            "score": 2,
            "text": "Sounds like the kind of treatment you’d expect when considering the bibles abhorrent 1st century views of women.",
            "title_similarity": "0.5365105",
            "sentiment_compound": -0.3818
        },
        {
            "id": "h22cwow",
            "score": 2,
            "text": "In twist surprise ending, the institution which declares itself 'god's' authority on earth and compass of morality to humanity helps pedophiles and rapists get away with their crimes.",
            "title_similarity": "0.46762127",
            "sentiment_compound": -0.0772
        },
        {
            "id": "h22d683",
            "score": 2,
            "text": "Beginning to think that child molestation and rape are just apart of Catholicism. It's not but it might as well be.",
            "title_similarity": "0.47369283",
            "sentiment_compound": -0.2846
        },
        {
            "id": "h22d797",
            "score": 2,
            "text": "Not very christian of them",
            "title_similarity": "0.16211367",
            "sentiment_compound": 0.0
        },
        {
            "id": "h22d7xg",
            "score": 2,
            "text": "Everything’s fine: the RC Church has been permanently expelled from my home.",
            "title_similarity": "0.7043804",
            "sentiment_compound": -0.0516
        },
        {
            "id": "h22dfrd",
            "score": 3,
            "text": "What a huge surprise.",
            "title_similarity": "0.047184043",
            "sentiment_compound": 0.5267
        },
        {
            "id": "h22dgih",
            "score": 2,
            "text": "[deleted]",
            "title_similarity": "0.29835454"
        },
        {
            "id": "h22dp5u",
            "score": 1,
            "text": "Wtf?",
            "title_similarity": "0.058198586",
            "sentiment_compound": -0.5859
        },
        {
            "id": "h22e93g",
            "score": 1,
            "text": "\nHey /u/Familiar_Internet,\n\n\nThis is now the top post on reddit. It will be recorded at /r/topofreddit with all the other top posts.",
            "title_similarity": "0.2795015",
            "sentiment_compound": 0.3818
        },
        {
            "id": "h22ekn4",
            "score": 1,
            "text": "Good for her",
            "title_similarity": "-0.004384159",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h22ezos",
            "score": 2,
            "text": "Might as well becoming an atheist now, she will be at peace.",
            "title_similarity": "0.46777394",
            "sentiment_compound": 0.6808
        },
        {
            "id": "h22f0n7",
            "score": 2,
            "text": "Catholics gonna Catholic",
            "title_similarity": "0.26498806",
            "sentiment_compound": 0.0
        },
        {
            "id": "h22f2bc",
            "score": 1,
            "text": "and this is why people dont like the church corrupt trys to hide thing under the carpet. i have seen the church leaders online why are people leaving us? and trying to figure out how to get people back.",
            "title_similarity": "0.60188377",
            "sentiment_compound": -0.4234
        },
        {
            "id": "h22f88v",
            "score": 1,
            "text": "Just a few bad apples, right?\n\nRight...?",
            "title_similarity": "0.28599536",
            "sentiment_compound": -0.594
        },
        {
            "id": "h22f914",
            "score": 2,
            "text": "Is it any wonder that the Catholic Church has been losing parishioners by the thousands!",
            "title_similarity": "0.6660899",
            "sentiment_compound": -0.4389
        },
        {
            "id": "h22fete",
            "score": 1,
            "text": "Here in cologne (Germany) I need an appointment at the local court, only problem is that every appointment is booked.\nSo many people want to leave, that as soon as you can book new appointments, they are gone within 10 minutes",
            "title_similarity": "0.61532235",
            "sentiment_compound": -0.3262
        },
        {
            "id": "h22fg63",
            "score": 2,
            "text": "Between 1950 and 2002, 10,667 individuals in the US have made accusations against priests and deacons in the Catholic Church of under age sexual abuse. In the same time period there have been 1,100 reported shark attacks. Therefore you are 10 times more likely to be sexually abused when stepping foot inside a church than you are to be attacked by a shark when stepping foot in the ocean. \n\nA police report in Australia claimed that in 2012 alone, 40 suicide deaths were directly related to abuse by the Catholic clergy, meanwhile 2 people were killed by sharks in the same year.\n\nIn conclusion, the Catholic Church is more dangerous than sharks.",
            "title_similarity": "0.63730246",
            "sentiment_compound": -0.9875
        },
        {
            "id": "h22fha8",
            "score": 2,
            "text": "Catholicism: the religion where any sin can be forgiven. Except exposing the corruption of the Catholic Church isn't a sin, so they will never forgive it.  \nPRIESTS RAPE KIDS, THE CHURCH COVERS IT UP.  \nPRIESTS RAPE NUNS, THE CHURCH COVERS IT UP.  \nTHEY SAY ABORTION IS MURDER. THEN THEY FORCE RAPED NUNS TO GET ABORTIONS.  \nFUCK EM. SINEAD WAS RIGHT.",
            "title_similarity": "0.72552514",
            "sentiment_compound": -0.9847
        },
        {
            "id": "h22fjws",
            "score": 1,
            "text": "Well, what would you expect? The only WW2 Nazi leader who was expelled from the Church for their actions during the war years and before was Goebbels. The reason for excommunication? He married a Protestant. \n\nSee, genocide, war, rape is understandable, God and the saints themselves did it several times in Bible after all. But marrying a Protestant is where the Church draws the line.",
            "title_similarity": "0.7307981",
            "sentiment_compound": -0.7587
        },
        {
            "id": "h22fmxc",
            "score": 1,
            "text": "Ah the integrity and novelty of the biggest fucking pedo-network is on display once again. All those filthy old bastards should finally be dragged out of their little state and brought to justice by a real court not another „internal investigation“ that just so happens to find absolutely nothing. How convenient!",
            "title_similarity": "0.50013995",
            "sentiment_compound": 0.2714
        },
        {
            "id": "h22fpik",
            "score": 2,
            "text": ">There is no further legal remedy available to you to within the Catholic legal system to challenge your dismissal…your right to continue as a member of the FCC is now definitively and irrevocably extinguished.\n\nwhat about real court?",
            "title_similarity": "0.6738609",
            "sentiment_compound": -0.195
        },
        {
            "id": "h22g3b7",
            "score": 2,
            "text": "The Catholic Church should be ashamed of themselves!",
            "title_similarity": "0.56344056",
            "sentiment_compound": -0.5255
        },
        {
            "id": "h22g6db",
            "score": 2,
            "text": "Pedos and rapists in the name of god.",
            "title_similarity": "0.40929258",
            "sentiment_compound": -0.4939
        },
        {
            "id": "h22g8gg",
            "score": 2,
            "text": "Just reading this and suddenly seeing that some folks to have to... pay to leave a church?\n\n&#x200B;\n\nI'm... is this not a thing I notice because I'm an American or...what?",
            "title_similarity": "0.55097944",
            "sentiment_compound": -0.2406
        },
        {
            "id": "h22gbwk",
            "score": 1,
            "text": "Man, Catholicism/Christianity has been the single biggest \"world power\" for centuries. Sure we're in a time when more people are agnostic/atheist, but goddamn, they still control a helluva lot. And thinking about how much history has been shaped by it, and the *real* reasons some of these things came to pass (i.e. willful misinterpretation of the Bible, or amending it, in order to excuse persecution of minority peoples), it's like.. Damn, dude, a lot of really bad shit didn't, and still does, *not* need to happen.",
            "title_similarity": "0.55792356",
            "sentiment_compound": -0.9419
        },
        {
            "id": "h22gcvy",
            "score": 1,
            "text": "Title is incorrect right? Removed from her convent, not from the Catholic Church. Big difference.",
            "title_similarity": "0.67012006",
            "sentiment_compound": 0.0
        },
        {
            "id": "h22geiw",
            "score": 1,
            "text": "Zzzzzxxxzzzxxxxxzzzzz\n\nETA...I fell asleep w Reddit open, my fingers did that.🤯",
            "title_similarity": "0.45592284",
            "sentiment_compound": 0.0
        },
        {
            "id": "h22gil1",
            "score": 1,
            "text": "god has a plan huh",
            "title_similarity": "0.024951868",
            "sentiment_compound": 0.2732
        },
        {
            "id": "h22gitk",
            "score": 2,
            "text": "And them do be wondering how atheism sky rocketing now",
            "title_similarity": "0.3265233",
            "sentiment_compound": 0.0
        },
        {
            "id": "h22gquh",
            "score": 2,
            "text": "she had been dismissed for reasons, including **driving a vehicle**, writing and publishing **poems**, and **lending her support** to the **protests** for the nun who had accused the Roman Catholic Bishop Mulakkal of repeatedly raping and sexually assaulting her.\n\n&#x200B;\n\npretty sure jesus never said thou shalt not drive",
            "title_similarity": "0.7929326",
            "sentiment_compound": -0.6124
        },
        {
            "id": "h22gzc8",
            "score": 1,
            "text": "Rosa Parks time...NO...",
            "title_similarity": "0.24565469",
            "sentiment_compound": 0.0
        },
        {
            "id": "h22h4yp",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.25901917"
        },
        {
            "id": "h22h9dz",
            "score": 1,
            "text": "She didn't need to be with that cult anyway",
            "title_similarity": "0.40231228",
            "sentiment_compound": 0.0
        },
        {
            "id": "h22hepg",
            "score": 1,
            "text": "Anything to do with religious people and being cleaner than clean are the biggest culprits going! I wouldn’t trust any religious person in authority seeing the abuse and coverups they do to protect themselves!",
            "title_similarity": "0.58540916",
            "sentiment_compound": 0.717
        },
        {
            "id": "h22hfp6",
            "score": 1,
            "text": "Lol in NZ they wouldn't let my uncle get divorced from his wife who denied him seeing his daughter for about ten years and was mentally ill. Despite his pleas he could buy a divorce and stay Catholic at about $10000. That moved him out of the church. Whether he is officially Catholic or not is irrelevant he is not attending, giving no money and I don't think he cares",
            "title_similarity": "0.76054376",
            "sentiment_compound": -0.6734
        },
        {
            "id": "h22hmgv",
            "score": 1,
            "text": "Poor lady being ostracised due to no crime of her own. The Catholic Church is terrible, it’s so corrupt and the fact that it accepts the abuse that people get is disgusting. I think Henry VIII had it right by wiping the Catholic Church from existence.",
            "title_similarity": "0.72045225",
            "sentiment_compound": -0.8641
        },
        {
            "id": "h22hnz6",
            "score": 2,
            "text": "Must suck to spend your whole life supporting a scheme to bilk idiots out of their money only to get kicked out the second you report on their other sketchy dealings. If she were smarter she would have realized the whole thing was a scam from the beginning and been an accountant or something",
            "title_similarity": "0.61974376",
            "sentiment_compound": -0.1779
        },
        {
            "id": "h22ihgu",
            "score": 1,
            "text": "Is this what the documentary The Keepers, is about?",
            "title_similarity": "0.13135251",
            "sentiment_compound": 0.0
        },
        {
            "id": "h22ilq5",
            "score": 2,
            "text": "Can't even behave properly with one of their own.",
            "title_similarity": "0.29042602",
            "sentiment_compound": 0.0
        },
        {
            "id": "h22iwfg",
            "score": 2,
            "text": "What would they know of martyrs?",
            "title_similarity": "0.25933164",
            "sentiment_compound": 0.0
        },
        {
            "id": "h22j2ro",
            "score": 1,
            "text": "Maybe she will live a life trashing this garbage organization",
            "title_similarity": "0.5559813",
            "sentiment_compound": 0.0
        },
        {
            "id": "h22j9bi",
            "score": 1,
            "text": "A christian rape and the christian fight against justice, a classic as old as their religion itself",
            "title_similarity": "0.547241",
            "sentiment_compound": -0.5994
        },
        {
            "id": "h22ji7o",
            "score": 3,
            "text": "[This should be on Leopards Ate My Face](https://old.reddit.com/r/LeopardsAteMyFace/)",
            "title_similarity": "0.4796384",
            "sentiment_compound": 0.0
        },
        {
            "id": "h22jnoy",
            "score": 3,
            "text": "So he's guilty then.",
            "title_similarity": "0.18604665",
            "sentiment_compound": -0.4728
        },
        {
            "id": "h22jqlf",
            "score": 2,
            "text": "God works in mysterious ways.  Isn’t that the answer to all things",
            "title_similarity": "0.20808062",
            "sentiment_compound": 0.2732
        },
        {
            "id": "h22jvda",
            "score": 2,
            "text": "Funny how the CC is performing its own moral bankruptcy declaration without any evil outsiders doing.\nAn important point, though, She would not be expelled from the Carholic Church, just from her Convent. That is an important distinction - they are not that stupid.",
            "title_similarity": "0.45619756",
            "sentiment_compound": 0.9106
        },
        {
            "id": "h22jy3p",
            "score": 2,
            "text": "She knows she did the right thing. Catholic Church apologists always come up with plenty of arguments as to why it shouldn’t be held to account, but at the end of the day it is an institution run by humans, not God. The people it abused and killed cannot be collateral damage for the good it does.",
            "title_similarity": "0.6460434",
            "sentiment_compound": -0.8166
        },
        {
            "id": "h22k0rq",
            "score": 2,
            "text": "I never knew that European countries charged a church tax and you needed to be formally discharged from the church's membership to avoid paying it. In the US, all I did was quit going and stopped tithing.",
            "title_similarity": "0.73838514",
            "sentiment_compound": -0.5994
        },
        {
            "id": "h22k0wt",
            "score": 2,
            "text": "Sometimes i wonder if all the parts of my brain developed correctly because while i am not dumb i seem to lack common sense, or at least thats how i feel until i remember how many grown adults are religious.",
            "title_similarity": "0.37755883",
            "sentiment_compound": 0.1032
        },
        {
            "id": "h22k20w",
            "score": 2,
            "text": "Garbage title, she hasn't been expelled from the Catholic Church but kicked from her convent for breaking her nunnery vows. Still all power to this woman and the nuns she's backing in getting justice for all those harmed by that scumbag priest. If she chooses there should and will be positions in the Catholic church for her",
            "title_similarity": "0.8101294",
            "sentiment_compound": -0.7032
        },
        {
            "id": "h22k5vp",
            "score": 2,
            "text": "A Tax free haven for rapists and paedos. Shut the whole lot down. They’ve fooled us for long enough.",
            "title_similarity": "0.50761807",
            "sentiment_compound": -0.5574
        },
        {
            "id": "h22k88w",
            "score": 1,
            "text": "Vile institution",
            "title_similarity": "0.2473579",
            "sentiment_compound": -0.6249
        },
        {
            "id": "h22k9z0",
            "score": 1,
            "text": "Imagine the church, with a history of abuse and illegal happenings, punishing a nun for trying to do what their faith claims to be for.\n\nWorlds largest cult needs to be forced to shut down.\n\nWanna be faithful?\n You don't need a church for that.\nYou can pray or worship in ur home (and wont be asked for donations)",
            "title_similarity": "0.8280877",
            "sentiment_compound": -0.7351
        },
        {
            "id": "h22kaf3",
            "score": 1,
            "text": "Yeah, can we all just be DONE with the Catholic Church, fam?",
            "title_similarity": "0.49370703",
            "sentiment_compound": 0.296
        },
        {
            "id": "h22kbxd",
            "score": 2,
            "text": "Ahh yes, the forgiveness and mercy of the Lord in action. So much for practicing what you preach.\n\nI hope Lucy lands on her feet.",
            "title_similarity": "0.34698913",
            "sentiment_compound": 0.8481
        },
        {
            "id": "h22kdpo",
            "score": 2,
            "text": "Hell hath no fury like a holy church scorned.",
            "title_similarity": "0.53482294",
            "sentiment_compound": -0.5736
        },
        {
            "id": "h22km7w",
            "score": 1,
            "text": "Of course.",
            "title_similarity": "-0.14254883",
            "sentiment_compound": 0.0
        },
        {
            "id": "h22kn9o",
            "score": 1,
            "text": "Religious people who spend 100s of hrs or dollars working for their church and over the top patriots who aren't even defending anything are such total clowns.",
            "title_similarity": "0.5290162",
            "sentiment_compound": 0.2023
        },
        {
            "id": "h22kszy",
            "score": 1,
            "text": "Epic",
            "title_similarity": "0.0123894075",
            "sentiment_compound": 0.0
        },
        {
            "id": "h22lfhy",
            "score": 1,
            "text": "I’m in Australia. WTF is this pay tax depending on your religion? And WWTF is this you can’t leave the church? WTF?????",
            "title_similarity": "0.47621465",
            "sentiment_compound": -0.9123
        },
        {
            "id": "h22lolz",
            "score": 2,
            "text": "seems like a good candidate for a GoFundMe",
            "title_similarity": "0.0332784",
            "sentiment_compound": 0.6597
        },
        {
            "id": "h22lsk2",
            "score": 2,
            "text": "Religion the true root of all evil",
            "title_similarity": "0.43253154",
            "sentiment_compound": -0.3818
        },
        {
            "id": "h22ltw4",
            "score": 2,
            "text": "How Christian of them…..WWJD?",
            "title_similarity": "0.093554765",
            "sentiment_compound": 0.0
        },
        {
            "id": "h22lu2d",
            "score": 2,
            "text": "Parishioners can always choose to change the world and walk away from supporting perhaps the biggest disinformation campaign in history.",
            "title_similarity": "0.64366245",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h22lujx",
            "score": 1,
            "text": "Shouldnt the church against rapists? I am jus asking, cause the last decades make it sound like being a rapist is somewhat mandatory.",
            "title_similarity": "0.6261065",
            "sentiment_compound": -0.8268
        },
        {
            "id": "h22lzec",
            "score": 1,
            "text": "Faith is in our hearts. We shouldn't be trapped in church, should we?",
            "title_similarity": "0.3040699",
            "sentiment_compound": 0.8713
        },
        {
            "id": "h22lzpj",
            "score": 1,
            "text": "Does she have a go fund me?",
            "title_similarity": "0.25393695",
            "sentiment_compound": 0.0
        },
        {
            "id": "h22m0lg",
            "score": 1,
            "text": "Is there a go fund me? I'll send cash so long as I know she'll get it.",
            "title_similarity": "0.28036636",
            "sentiment_compound": 0.0
        },
        {
            "id": "h22mkez",
            "score": 2,
            "text": "Fuck the catholic church",
            "title_similarity": "0.58894694",
            "sentiment_compound": -0.5423
        },
        {
            "id": "h22mmcw",
            "score": 1,
            "text": "It's ok everybody. They have a cool pope now 😎🏍️🇻🇦⛪👨‍👦🍩🌭🤫",
            "title_similarity": "0.15062302",
            "sentiment_compound": 0.7579
        },
        {
            "id": "h22mvhe",
            "score": 2,
            "text": "I expect a formal apology in roughly 400 years.",
            "title_similarity": "0.2989341",
            "sentiment_compound": 0.0516
        },
        {
            "id": "h22mz1c",
            "score": 1,
            "text": "What about sister Nancy",
            "title_similarity": "0.3982111",
            "sentiment_compound": 0.0
        },
        {
            "id": "h22n5bq",
            "score": 2,
            "text": "Disband the church and go back to the way Jesus spread the good word. Being as good a person as you can and try to help people as much as you can is the only moral that should matter in any religion. This nun chose the Catholic church but they have treated her disgracefully. Rape and abuse should not be part of any religion.",
            "title_similarity": "0.6954407",
            "sentiment_compound": -0.8898
        },
        {
            "id": "h22n5vs",
            "score": 1,
            "text": "Typical. My aunt was excommunicated, and when her ex husband tried to remarry, despite all off the family negating it, the father was like lol you thought what you submitted mattered, meet your new step mom, I’m going to giv’her the Christ cracker anyway lol.",
            "title_similarity": "0.75213385",
            "sentiment_compound": 0.7964
        },
        {
            "id": "h22n8ed",
            "score": 2,
            "text": "uh-oh!\n\nagain, the catholic church says \" 'me too!'.. powerful\"..",
            "title_similarity": "0.33030462",
            "sentiment_compound": 0.5242
        },
        {
            "id": "h22n94d",
            "score": 1,
            "text": "Religion is often a tool for the evil to control you.",
            "title_similarity": "0.38443184",
            "sentiment_compound": -0.6597
        },
        {
            "id": "h22n99x",
            "score": 1,
            "text": "Cults are crazy!",
            "title_similarity": "0.34123677",
            "sentiment_compound": -0.4003
        },
        {
            "id": "h22nbtf",
            "score": 1,
            "text": "> she was dismissed by the FCC on the grounds that she was “violating her vows as a nun through her lifestyle”.\n\n\nI am surprised (not...) that accusation was never used against priests abusing children. Maybe they consider that is a proper lifestyle...",
            "title_similarity": "0.7207329",
            "sentiment_compound": -0.0926
        },
        {
            "id": "h22nbu7",
            "score": 1,
            "text": "The easiest way to leave the church is to stop giving them money…….. that is what they will notice, # of parishioners = tithing.",
            "title_similarity": "0.6376216",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h22ngj4",
            "score": 1,
            "text": "But I thought this Pope was good!",
            "title_similarity": "0.07020441",
            "sentiment_compound": 0.63
        },
        {
            "id": "h22ngo7",
            "score": 2,
            "text": "Down with organized religion",
            "title_similarity": "0.32302347",
            "sentiment_compound": 0.0
        },
        {
            "id": "h22nhza",
            "score": 1,
            "text": "The Catholic church (like most religious organisations) is nothing but a scam run by pedophiles, rapists and thieves.\n\nAlways was, always will be.",
            "title_similarity": "0.5921763",
            "sentiment_compound": -0.7686
        },
        {
            "id": "h22nieu",
            "score": 1,
            "text": "Religion is a joke",
            "title_similarity": "0.27946505",
            "sentiment_compound": 0.296
        },
        {
            "id": "h22nmqu",
            "score": 2,
            "text": "The Catholic church is literally a multi national criminal organization.",
            "title_similarity": "0.47685754",
            "sentiment_compound": -0.5267
        },
        {
            "id": "h22nspj",
            "score": 1,
            "text": "What happens when she leaves? Don't nuns have to take a vow of poverty? Won't she be destitute?",
            "title_similarity": "0.6732263",
            "sentiment_compound": -0.5913
        },
        {
            "id": "h22nuej",
            "score": 3,
            "text": "Catholics are a bunch of pedophile enablers. She we will be better off in the long run.",
            "title_similarity": "0.45522958",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h22nuzz",
            "score": 2,
            "text": "This church has always been stupid n corrupted. They are making it harder to believe this scam people have been falling for",
            "title_similarity": "0.62572175",
            "sentiment_compound": -0.8546
        },
        {
            "id": "h22nyw0",
            "score": 1,
            "text": "Why does she remind me so much of Jamie Fox?",
            "title_similarity": "0.29438278",
            "sentiment_compound": 0.0
        },
        {
            "id": "h22o0w5",
            "score": 2,
            "text": "Religion poisons everything",
            "title_similarity": "0.6015893",
            "sentiment_compound": -0.5719
        },
        {
            "id": "h22o16m",
            "score": 1,
            "text": "How is this not trending in twitter?",
            "title_similarity": "0.29304862",
            "sentiment_compound": 0.0
        },
        {
            "id": "h22o29x",
            "score": 2,
            "text": "If you can’t win, shut them up",
            "title_similarity": "0.34626472",
            "sentiment_compound": 0.5859
        },
        {
            "id": "h22o48l",
            "score": 1,
            "text": "It’s time the Catholic Church lost it’s tax exemption status",
            "title_similarity": "0.65576124",
            "sentiment_compound": -0.3182
        },
        {
            "id": "h22o83u",
            "score": 1,
            "text": "The catholic church is a fucking joke",
            "title_similarity": "0.50152564",
            "sentiment_compound": 0.3597
        },
        {
            "id": "h22ocqv",
            "score": 1,
            "text": "Lol @ religion.",
            "title_similarity": "0.17212231",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h22oe51",
            "score": 1,
            "text": "The \"church\"",
            "title_similarity": "0.13497809",
            "sentiment_compound": 0.0
        },
        {
            "id": "h22oeqg",
            "score": 2,
            "text": "Yeah the catholic church is a piece of shit",
            "title_similarity": "0.5325437",
            "sentiment_compound": -0.34
        },
        {
            "id": "h22offi",
            "score": 1,
            "text": "The Christian church is currently performing the slowest suicide attempt in history. Impressive",
            "title_similarity": "0.5542771",
            "sentiment_compound": -0.296
        },
        {
            "id": "h22ofst",
            "score": 1,
            "text": "Respect for sister Lucy. If she was expelled for this then the church is obviously evil and she truly doesn't belong there.",
            "title_similarity": "0.7487662",
            "sentiment_compound": -0.1027
        },
        {
            "id": "h22omr8",
            "score": 3,
            "text": "Short summary about Italy. In 1861 we united the country. There  only was a little part still independent: the Church Reign, in Rome, which was ruled by the pope and couldn't be attacked as it was protected by France. In 1871 France got his ass kicked in Sedan by Germany and suddenly they have their own problems to think about. Italy is like: \"hold on we can now get Rome\". And there we go, conquering the city and annexing the Church Reign too. Pope is pissed now, and excommunicate everyone involved with the Italian Parliament, including the Italian Kings. The king himself is catholic and kind of worried about his own soul, but he would always do what he think is best for the country, including arresting priests who just don't want to follow Italian laws. This situation lasted till 1929 when Mussolini decided to end it by signing the Lateran Treaty, basically a bunch of laws that ended the conflict between the Italian Kingdom and the Vatican. This treaty was later ratified when the country became a republic and are the reason why Church still has a big voice in Italian Society which, as a consequence, is way less secular then the one our grandfathers lived in.\nTrivia: Mussolini himself was an atheist. During the time he still was a socialist he used to challenge God to kill him in one minute to prove it existed. Unfortunately it never happened and he lived to become the founder of Fascism, inspire Hitler, and make a treaty with the Church .",
            "title_similarity": "0.64646196",
            "sentiment_compound": 0.2048
        },
        {
            "id": "h22opiw",
            "score": 2,
            "text": "In all honesty sister Lucy also did some other terrible things: driving a vehicle, writing and publishing poems. A real terrorist right there...",
            "title_similarity": "0.6095394",
            "sentiment_compound": -0.6808
        },
        {
            "id": "h22ot9p",
            "score": 1,
            "text": "This woman is so brave. If anyone deserves sainthood it’s her because standing up to the church for someone in her position takes serious balls.",
            "title_similarity": "0.45008165",
            "sentiment_compound": 0.6207
        },
        {
            "id": "h22ozi1",
            "score": 1,
            "text": "Jumping Jesus!!! This Church doesn't have a very good track record, eh..?",
            "title_similarity": "0.4806363",
            "sentiment_compound": 0.6211
        },
        {
            "id": "h22p49p",
            "score": 1,
            "text": "Jesus \"said\" it best himself:  \n\n\"It would be better for him if a millstone were hung around his neck and he were cast into the sea than that he should cause one of these little ones to sin\" Luke 17:2  \n\nThrow all those child rapists, their enablers and their apologists in the fucking ocean with [this](https://assets.ldscdn.org/c8/47/c8473efc1645241ccc5b1895f0b183d05807553e1069437/millstone.jpeg) around their necks.",
            "title_similarity": "0.58174527",
            "sentiment_compound": -0.1372
        },
        {
            "id": "h22p4s1",
            "score": 2,
            "text": "I'm a little lost here isn't church about going to heaven? She's going to heaven, that's for sure.",
            "title_similarity": "0.46961513",
            "sentiment_compound": 0.7841
        },
        {
            "id": "h22pfgw",
            "score": 2,
            "text": "Ahhh, so loving. Good for her.",
            "title_similarity": "0.06444628",
            "sentiment_compound": 0.8111
        },
        {
            "id": "h22pm24",
            "score": 1,
            "text": "Catholics are allot like Republicans.. They have lots to hide or sweep under a rug.. This is morally wrong ! I'm not Catholic but she went head-to-head with a Bishop and receives this as her reward ?",
            "title_similarity": "0.6278283",
            "sentiment_compound": 0.69
        },
        {
            "id": "h22pn8x",
            "score": 2,
            "text": "Here in Canada, half our provinces still fund catholic hospitals and school boards, it's automatic and no way out of it.\n\nAnd the funny thing is for some reason a zombie lie that we get to choose what school board your money goes to on our taxes has been around for like 50 years and people still believe it because they are idiots.",
            "title_similarity": "0.6253952",
            "sentiment_compound": 0.4939
        },
        {
            "id": "h22pp66",
            "score": 2,
            "text": "And they wonder why people leave the church.",
            "title_similarity": "0.56501555",
            "sentiment_compound": -0.0516
        },
        {
            "id": "h22qgqz",
            "score": 1,
            "text": "wondering were all the people that say \"the church still does a lot of good\" every time something like this happens, as if it make it ok, are right now.",
            "title_similarity": "0.29975867",
            "sentiment_compound": 0.6597
        },
        {
            "id": "h22qi0x",
            "score": 1,
            "text": "Good riddance. Who needs the Catholic Church anyway. Time for something else.",
            "title_similarity": "0.4381226",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h22qnmj",
            "score": 2,
            "text": "all organisations religous or not, that have power hierarchy and vulnerable adults and children. are going to attract those that want to abuse. the global catholic Church appears the handle these cases very badly. People who work with vulnerable others should expect to opporate in a climate of suspicion and so ensure that their actions are auditable. for me there should be automatic court orders that reward the victims huge sums of money, so large in fact that the organisation/church is wounded. only then will they improve their safe guarding!",
            "title_similarity": "0.55270505",
            "sentiment_compound": 0.3595
        },
        {
            "id": "h22qqzd",
            "score": 1,
            "text": "This shit right here is one of the reasons I left the Catholic church.",
            "title_similarity": "0.6697973",
            "sentiment_compound": -0.5574
        },
        {
            "id": "h22qslk",
            "score": 2,
            "text": "After reading some comments, I’m super happy I dodged joining the Catholic Church. Money machine masquerading as religion. Touting bullshit with a spiritual facade.\n\n[Amazing critique of the church](https://youtu.be/gINrK9RJ6-o)",
            "title_similarity": "0.5813228",
            "sentiment_compound": 0.7845
        },
        {
            "id": "h22qsmn",
            "score": 2,
            "text": "Luckily, they can not strip her of her faith at least.",
            "title_similarity": "0.26516134",
            "sentiment_compound": 0.7269
        },
        {
            "id": "h22qtok",
            "score": 1,
            "text": "…And that is why we are witnessing their downfall!",
            "title_similarity": "0.42613912",
            "sentiment_compound": 0.0
        },
        {
            "id": "h22r0dy",
            "score": 2,
            "text": "Difficult to understand how Catholics are not revolting. The list of horrific deeds perpetrated is long and more seems to always be uncovered. Why are the leaders not held accountable?",
            "title_similarity": "0.52672863",
            "sentiment_compound": -0.7845
        },
        {
            "id": "h22r54z",
            "score": 2,
            "text": "didnt the pope say he would no longer protect sexual assaulters under the church umbrella...yet this guy is out on bail? what a liar",
            "title_similarity": "0.6552115",
            "sentiment_compound": -0.7707
        },
        {
            "id": "h22rc5g",
            "score": 1,
            "text": "Thought the whole religion thing boiled down to one unifying concept - done be an asshole",
            "title_similarity": "0.483917",
            "sentiment_compound": 0.0
        },
        {
            "id": "h22rk25",
            "score": 2,
            "text": "Lmao the catholic church isn’t even trying to hide their skeletons at this point",
            "title_similarity": "0.40811044",
            "sentiment_compound": 0.4939
        },
        {
            "id": "h22rknk",
            "score": 2,
            "text": "It's almost as if organized religion is one big farce.",
            "title_similarity": "0.39645857",
            "sentiment_compound": -0.4019
        },
        {
            "id": "h22rle2",
            "score": 2,
            "text": "This is how you create an Atheist",
            "title_similarity": "0.44246703",
            "sentiment_compound": 0.2732
        },
        {
            "id": "h22rnck",
            "score": 1,
            "text": "Ah yes, Gods eternal love....I see it being used for good within the catholic church.",
            "title_similarity": "0.2783361",
            "sentiment_compound": 0.6808
        },
        {
            "id": "h22rol2",
            "score": 5,
            "text": "This is the kinda thing that will drive a wedge between more folks and Catholicism. \n\nEach step to protect trash people internally is plainly visible by others.  \n\nThey hammer the nail in their own coffin, one case at a time.",
            "title_similarity": "0.5766907",
            "sentiment_compound": 0.3818
        },
        {
            "id": "h22rpd1",
            "score": 2,
            "text": "I think speaks for itself,  Catholic‘s will just except it. Gross",
            "title_similarity": "0.3690545",
            "sentiment_compound": -0.4767
        },
        {
            "id": "h22rs70",
            "score": 2,
            "text": "But God loves all his children equally...He has no choice but to work in mysterious ways...",
            "title_similarity": "0.23824593",
            "sentiment_compound": 0.7096
        },
        {
            "id": "h22rsas",
            "score": 2,
            "text": "Don’t go against the family",
            "title_similarity": "0.18744417",
            "sentiment_compound": 0.0
        },
        {
            "id": "h22rxr2",
            "score": 2,
            "text": "Well, of course. They only want people that they can rape and will stay quiet. They don't need some bs like this lady ratting them out. Smh at the nerve of her to stand up for herself.. If only the government could do something about it.. Oh, wait... They could but they get paid too much to say anything.",
            "title_similarity": "0.6295624",
            "sentiment_compound": -0.2617
        },
        {
            "id": "h22s1ze",
            "score": 1,
            "text": "The church doesn’t define beliefs nor do they own religion. That’s the best part about religion. It’s about your own beliefs and relationship. The church doesn’t own that, it’s a building and a bunch of people who have no power of your brain. F them.",
            "title_similarity": "0.55216616",
            "sentiment_compound": 0.4588
        },
        {
            "id": "h22s7an",
            "score": 1,
            "text": "Just like Jesus would do.",
            "title_similarity": "0.08208777",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h22sddk",
            "score": 1,
            "text": "For some reason, [this ](https://youtu.be/XCl7PNWdZ1k) came to mind almost immediately",
            "title_similarity": "0.13592589",
            "sentiment_compound": 0.0
        },
        {
            "id": "h22sf50",
            "score": 1,
            "text": "Meh. Good thing you don’t need the Catholic Church to continue worshipping God and be of service to others.",
            "title_similarity": "0.36949408",
            "sentiment_compound": 0.743
        },
        {
            "id": "h22sh4c",
            "score": 1,
            "text": "Ah yes, in accordance the 11th commandment \"Snitches get Stitches.\" /s",
            "title_similarity": "0.3199365",
            "sentiment_compound": 0.4019
        },
        {
            "id": "h22sjof",
            "score": 2,
            "text": "Americans pay to support churches they don’t go to because churches don’t pay tax.  We just don’t think of it that way because it’s indirect - but not paying tax means someone else is paying for services an organization or business uses.",
            "title_similarity": "0.4657815",
            "sentiment_compound": 0.1154
        },
        {
            "id": "h22sspn",
            "score": 2,
            "text": "More of that wonderful \"love of Jesus\" that I keep hearing so much about.",
            "title_similarity": "0.11161626",
            "sentiment_compound": 0.8467
        },
        {
            "id": "h22svlt",
            "score": 1,
            "text": "Have the local authorities gotten involved to do a real criminal investigation?",
            "title_similarity": "0.30072886",
            "sentiment_compound": -0.5267
        },
        {
            "id": "h22sy6f",
            "score": 1,
            "text": "Why? Oh yea... because of GOOOOOOOOOOOOOOOOOOOOOOOOD",
            "title_similarity": "0.10597743",
            "sentiment_compound": 0.0
        },
        {
            "id": "h22t1u0",
            "score": 2,
            "text": "How does one officially leave the church? In the US you just stop going after confirmation.",
            "title_similarity": "0.64601696",
            "sentiment_compound": -0.34
        },
        {
            "id": "h22t5mx",
            "score": 3,
            "text": "I always wonder why there are a lot of negative voices when Christianity and Catholicism come up.\n\n\nThen news like this arrives and I remember, \n\n\nOh yeah, theres a lot of bullshit when it comes to how the church functions, as well as its history and failure to fix its own issues.",
            "title_similarity": "0.59567165",
            "sentiment_compound": -0.7184
        },
        {
            "id": "h22thhu",
            "score": 2,
            "text": "I feel like catholicism is responsible for 90% of hate religion gets. It’s weird af, tbh",
            "title_similarity": "0.62447476",
            "sentiment_compound": -0.1531
        },
        {
            "id": "h22ti28",
            "score": 3,
            "text": "oh just incase anyone out there doesn't know. the Catholic Church has a tendency to fuck kids and hide its people who fuck kids... that's all.",
            "title_similarity": "0.6699503",
            "sentiment_compound": -0.8271
        },
        {
            "id": "h22tlbd",
            "score": 2,
            "text": "Why doesn’t she just rape some kids then she will just get moved to a different church?",
            "title_similarity": "0.7327472",
            "sentiment_compound": -0.6908
        },
        {
            "id": "h22tq2s",
            "score": 1,
            "text": "Best thing that could have happened, for her.",
            "title_similarity": "0.09364218",
            "sentiment_compound": 0.6369
        },
        {
            "id": "h22trv1",
            "score": 2,
            "text": "Its getting to be almost as bad as the southern baptist convention in dealing with sexual assault/rape.",
            "title_similarity": "0.5139468",
            "sentiment_compound": -0.4976
        },
        {
            "id": "h22tsim",
            "score": 2,
            "text": "Religion of love and compassion.",
            "title_similarity": "0.092262596",
            "sentiment_compound": 0.802
        },
        {
            "id": "h22txwh",
            "score": 3,
            "text": "No fucking surprises there really 😕",
            "title_similarity": "0.13953915",
            "sentiment_compound": -0.6958
        },
        {
            "id": "h22u1lm",
            "score": 3,
            "text": ">He has been charged with rape, wrongful confinement, **unnatural offence** and criminal intimidation.\n\nWtf does \"unnatural offence\" mean here?",
            "title_similarity": "0.42878315",
            "sentiment_compound": -0.9633
        },
        {
            "id": "h22u9qn",
            "score": 2,
            "text": "Does something to benefit the kingdom. Promptly gets excommunicated. 😑",
            "title_similarity": "0.44082743",
            "sentiment_compound": 0.4588
        },
        {
            "id": "h22udbr",
            "score": 3,
            "text": "That is religion; it is its own illness. Created for control rather than spirituality. Oppression is far from the spiritual teachings of Jesus. I love Jesus but I despise and hate religion.",
            "title_similarity": "0.5553447",
            "sentiment_compound": -0.7845
        },
        {
            "id": "h22ueo8",
            "score": 3,
            "text": "Do you want another schism?! Because this is how you get another schism.",
            "title_similarity": "0.40564185",
            "sentiment_compound": 0.1511
        },
        {
            "id": "h22ujr1",
            "score": 3,
            "text": "Good for her, no one wants to be surrounded by people that support rapists and their fake Religious holier than thou attitudes.\nReality is a hard pill to swallow but completely necessary to move forward in life.",
            "title_similarity": "0.53569484",
            "sentiment_compound": -0.4019
        },
        {
            "id": "h22uqev",
            "score": 2,
            "text": "I love the fact she broke the rules by driving the car, publishing poems and supporting someone\n\nSeems like we are all in the 21st Century and the Church hasn't moved one bit since the 14th Century\n\nWhich sort of makes sense as there were no cars in the 14th Century and people could not read or write\n\nI have to admit that i admire people blindly following any organisation without questioning anything",
            "title_similarity": "0.6107689",
            "sentiment_compound": 0.8688
        },
        {
            "id": "h22uqt2",
            "score": 2,
            "text": "Praise the vengeful lord.",
            "title_similarity": "0.25684136",
            "sentiment_compound": 0.5574
        },
        {
            "id": "h22ur6b",
            "score": 1,
            "text": "If she's looking for an opening I think the traveling pants are taking auditions.",
            "title_similarity": "0.3505142",
            "sentiment_compound": 0.0
        },
        {
            "id": "h22uvgn",
            "score": 3,
            "text": "Awful. Religion is evil.",
            "title_similarity": "0.41104007",
            "sentiment_compound": -0.8126
        },
        {
            "id": "h22uy1f",
            "score": 3,
            "text": "Bullshit decision - at least she won’t have to be part of the Catholic Church anymore.  Good job fighting them sister Lucy!!!",
            "title_similarity": "0.7107732",
            "sentiment_compound": -0.6458
        },
        {
            "id": "h22v1gk",
            "score": 1,
            "text": "But it's cool because they totally acknowledge that they have a pedophile problem right? All is forgiven!",
            "title_similarity": "0.2727278",
            "sentiment_compound": 0.4753
        },
        {
            "id": "h22v2ni",
            "score": 3,
            "text": "Isn't that the wrong way round? Franko Mullahkal should be expelled, not her..",
            "title_similarity": "0.59363604",
            "sentiment_compound": 0.1416
        },
        {
            "id": "h22v89q",
            "score": 4,
            "text": "Lady in a pedo sex ring gets kicked out of pedo sex ring for not liking pedos",
            "title_similarity": "0.67825985",
            "sentiment_compound": -0.3089
        },
        {
            "id": "h22v8rg",
            "score": 2,
            "text": "This is why concentrations of power need to be dismantled! Equality and justice cannot happen in a heirarchy!",
            "title_similarity": "0.5768935",
            "sentiment_compound": 0.6103
        },
        {
            "id": "h22vfnh",
            "score": 2,
            "text": "How is satan the bad guy again?",
            "title_similarity": "0.42417526",
            "sentiment_compound": -0.5423
        },
        {
            "id": "h22vmms",
            "score": 2,
            "text": "Religion, believe what you want, pray to who you choose… Your belief is your choice. But when people hind behind religious titles to get away with such sinister acts, well… shame on you. You are a ugly human being and deserve every bit of a public spotlight. Little boys, girls, to the unheard cries of goats… these “holy” people devour ones innocence and pave a road of trauma and heartache. Shame.",
            "title_similarity": "0.59697795",
            "sentiment_compound": -0.9724
        },
        {
            "id": "h22vojs",
            "score": 2,
            "text": "And these cultists think its doom making people leave the church.",
            "title_similarity": "0.7556623",
            "sentiment_compound": -0.4404
        },
        {
            "id": "h22vqvk",
            "score": 3,
            "text": "Those who claim to be God's closest followers always seem the most eager to stray from His flock",
            "title_similarity": "0.48906863",
            "sentiment_compound": 0.4201
        },
        {
            "id": "h22w62v",
            "score": 1,
            "text": "Not suprising.",
            "title_similarity": "0.05964538",
            "sentiment_compound": 0.0
        },
        {
            "id": "h22w6cx",
            "score": 1,
            "text": "They can banish her from the Church Militant, but not the Church Triumphant. That is not within their capacity.",
            "title_similarity": "0.5756978",
            "sentiment_compound": -0.6822
        },
        {
            "id": "h22wa3z",
            "score": 1,
            "text": "pope francis, stop it!!",
            "title_similarity": "0.50419074",
            "sentiment_compound": -0.4184
        },
        {
            "id": "h22wcmt",
            "score": 2,
            "text": "So many silver linings that can come from this it's almost magical.",
            "title_similarity": "0.036809985",
            "sentiment_compound": 0.0
        },
        {
            "id": "h22wfoq",
            "score": 2,
            "text": "And this is one of the many reasons why religion fucking sucks",
            "title_similarity": "0.46668726",
            "sentiment_compound": -0.4201
        },
        {
            "id": "h22wjc5",
            "score": 2,
            "text": "What would Jesus do?",
            "title_similarity": "0.13425842",
            "sentiment_compound": 0.0
        },
        {
            "id": "h22wk8t",
            "score": 2,
            "text": "Fuck the Catholic Church",
            "title_similarity": "0.58894694",
            "sentiment_compound": -0.5423
        },
        {
            "id": "h22wmhk",
            "score": 1,
            "text": "wow",
            "title_similarity": "-0.10739674",
            "sentiment_compound": 0.5859
        },
        {
            "id": "h22wppn",
            "score": 3,
            "text": "Damn raped twice",
            "title_similarity": "0.5222769",
            "sentiment_compound": -0.8074
        },
        {
            "id": "h22wr8g",
            "score": 3,
            "text": "Church is too rich I bet they are richer than Elon Musk. Stop giving them cash ghve'em bread or fruits.",
            "title_similarity": "0.4088389",
            "sentiment_compound": 0.802
        },
        {
            "id": "h22wtlh",
            "score": 3,
            "text": "This is disgusting. How can any Catholic ignore shit like this while preaching to everyone else.",
            "title_similarity": "0.6034166",
            "sentiment_compound": -0.7906
        },
        {
            "id": "h22wyrs",
            "score": 3,
            "text": "That’s cold blooded. Shame on you Catholic Church.",
            "title_similarity": "0.6258807",
            "sentiment_compound": -0.4767
        },
        {
            "id": "h22x0n2",
            "score": 9,
            "text": "So the church can kick people out!? Now the only have to learn to do it with abusers and rapists instead of whistle blowers.",
            "title_similarity": "0.6644036",
            "sentiment_compound": -0.8478
        },
        {
            "id": "h22x35a",
            "score": 2,
            "text": "What happens in the rectory, stays in the rectum!",
            "title_similarity": "0.25595564",
            "sentiment_compound": 0.0
        },
        {
            "id": "h22xcqp",
            "score": 2,
            "text": "Jesus, if there is god up there, they is not happy..",
            "title_similarity": "0.34653118",
            "sentiment_compound": -0.2259
        },
        {
            "id": "h22xxl9",
            "score": 3,
            "text": "BTW, the Catholic Church needs more of your money.",
            "title_similarity": "0.36073792",
            "sentiment_compound": 0.0
        },
        {
            "id": "h22y07r",
            "score": 3,
            "text": "The Catholic Church will never not ruin everything ever forever and ever, amen.",
            "title_similarity": "0.33292964",
            "sentiment_compound": -0.3681
        },
        {
            "id": "h22y34n",
            "score": 2,
            "text": "Religion is embarrassing.",
            "title_similarity": "0.3040098",
            "sentiment_compound": -0.3818
        },
        {
            "id": "h22y5pt",
            "score": 2,
            "text": "In the words of my Lord and Saviour, Bill Burr, \"Don't you think the Catholic Church took it a little too far?\"",
            "title_similarity": "0.40636614",
            "sentiment_compound": 0.0
        },
        {
            "id": "h22y605",
            "score": 2,
            "text": "This is just disgusting, I’ve lost faith in the Catholic Church over the past couple of years because of scandals like this. She is a hero and will be in my prayers tonight. 🙏😇",
            "title_similarity": "0.7747197",
            "sentiment_compound": 0.4588
        },
        {
            "id": "h22ycp8",
            "score": 2,
            "text": "Because morals come from god right?",
            "title_similarity": "0.07281713",
            "sentiment_compound": 0.2732
        },
        {
            "id": "h22ye3t",
            "score": 1,
            "text": "Organized religion is a sham. You don’t need to go to church or do all this crap to get closer to god.  The Catholics had a army for god sakes.  Something I also have some knowledge on is the early years of the church they weren’t getting any followers so they went to temples where people would go instead of church and take mushrooms to be spiritual so they would go there and slaughter everyone who didn’t want to follow Christ.  That’s how they got people in their church based on fear and bullying the same tactics they use today.",
            "title_similarity": "0.74243724",
            "sentiment_compound": -0.765
        },
        {
            "id": "h22yhax",
            "score": 2,
            "text": "And this is why people who keep to donate money to the church, are complicit in the abuse.",
            "title_similarity": "0.49707484",
            "sentiment_compound": -0.6369
        },
        {
            "id": "h22ytvk",
            "score": 1,
            "text": "There isn’t a single organisation that has done more to destroy the holiness of god than the Catholic Church. The Catholic Church is Satan’s mission on earth made to lure humanity away from the path to god.",
            "title_similarity": "0.52879846",
            "sentiment_compound": -0.1477
        },
        {
            "id": "h22yuk9",
            "score": 2,
            "text": "Organized religion is a crock of shit.",
            "title_similarity": "0.4421788",
            "sentiment_compound": -0.5574
        },
        {
            "id": "h22yvim",
            "score": 1,
            "text": "Good. Religion is trash.",
            "title_similarity": "0.26294225",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h22yw4u",
            "score": 5,
            "text": ">she was dismissed by the FCC on the grounds that she was “violating her vows as a nun through her lifestyle”\n\nGood to know the Catholics have this option, and just choose not to use it on rapists and pedophiles, only those shining a light on said rapists and pedophiles.",
            "title_similarity": "0.7538383",
            "sentiment_compound": -0.7717
        },
        {
            "id": "h22yyjs",
            "score": 2,
            "text": "The Catholic Church and all who follow it are pathetic cowards.",
            "title_similarity": "0.6783539",
            "sentiment_compound": -0.5719
        },
        {
            "id": "h22z38t",
            "score": 1,
            "text": "This bomb ass church can be a dope as house if you get the money\nhttps://www.realliving.com/commercial-for-sale/18430-Utica-Rd-Roseville-MI-48066-260363803",
            "title_similarity": "0.5055299",
            "sentiment_compound": -0.7717
        },
        {
            "id": "h22zey4",
            "score": 1,
            "text": "When you ignore the imaginary part of what the church does, the real part is just a non-tax paying organization that trafficks children.",
            "title_similarity": "0.4277008",
            "sentiment_compound": -0.3612
        },
        {
            "id": "h22zgma",
            "score": 1,
            "text": "Is anyone surprised at this?   FUCK ALL RELIGIONS!!!!",
            "title_similarity": "0.45747992",
            "sentiment_compound": -0.6706
        },
        {
            "id": "h22zhgo",
            "score": 2,
            "text": "These legal cults need to be completely outlawed.",
            "title_similarity": "0.60852814",
            "sentiment_compound": 0.128
        },
        {
            "id": "h22ziw0",
            "score": 2,
            "text": "In the absence of knowledge, religion reigns supreme",
            "title_similarity": "0.29988575",
            "sentiment_compound": 0.5574
        },
        {
            "id": "h22znpr",
            "score": 3,
            "text": "WhY dOn'T wOmEn JuSt CoMe FoRwArD?",
            "title_similarity": "0.36596996",
            "sentiment_compound": 0.0
        },
        {
            "id": "h22ztjj",
            "score": 1,
            "text": "So weird... the Catholic Church is unsympathetic to a rape case? Thank god she's not a child or we wouldn't have even gotten a news story out of it",
            "title_similarity": "0.7121893",
            "sentiment_compound": -0.4754
        },
        {
            "id": "h22zxia",
            "score": 2,
            "text": "They don’t like it when you bring up the fact those guys like fucking kids. Your not suppose to tell.",
            "title_similarity": "0.40550932",
            "sentiment_compound": 0.6124
        },
        {
            "id": "h2303hk",
            "score": 2,
            "text": "Religious orders are evil.",
            "title_similarity": "0.40998825",
            "sentiment_compound": -0.6597
        },
        {
            "id": "h2304r0",
            "score": 2,
            "text": "And the US government just gave the Catholic Church (a tax exempt organization) 300 million taxpayer dollars to settle their “misconduct” cases in the us.",
            "title_similarity": "0.5489699",
            "sentiment_compound": 0.1027
        },
        {
            "id": "h230550",
            "score": 3,
            "text": "the church is very corrupt.. such hypocrites",
            "title_similarity": "0.5259243",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2307a8",
            "score": 2,
            "text": "Christians demonizing True Christians. And they wonder why no one wants to join their dogshit religion.",
            "title_similarity": "0.65282226",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h2309i5",
            "score": 3,
            "text": "The more good people the Catholic church expels the easier it will be for those still in it to see the shit show that it really is",
            "title_similarity": "0.48400563",
            "sentiment_compound": 0.8122
        },
        {
            "id": "h230i0o",
            "score": 3,
            "text": "Fuck the church",
            "title_similarity": "0.55985796",
            "sentiment_compound": -0.5423
        },
        {
            "id": "h230ngy",
            "score": 3,
            "text": "Churches are dumb",
            "title_similarity": "0.43550682",
            "sentiment_compound": -0.5106
        },
        {
            "id": "h230o3x",
            "score": 3,
            "text": "A Church did this? Why am I not surprised?",
            "title_similarity": "0.23203099",
            "sentiment_compound": -0.2561
        },
        {
            "id": "h230sqc",
            "score": 3,
            "text": " Noooo not the church??? Being shitty??? To an abuse victim?? Well I just can’t believe it 🙄🙄🙄🙄",
            "title_similarity": "0.60428536",
            "sentiment_compound": -0.8677
        },
        {
            "id": "h2310to",
            "score": 2,
            "text": "Hey Reddit, tell me again about how awesome and \"progressive\" this Pope is. \n\nI'm glad the PR mask is starting to fall away, but I wish it hadn't taken so long for people to realize Jorge Mario Bergoglio was a piece of shit long before he became Pope and the church's PR department turned him into a fake propaganda Pope.",
            "title_similarity": "0.56641245",
            "sentiment_compound": -0.6652
        },
        {
            "id": "h2314jy",
            "score": 3,
            "text": "Starting to think the Catholic church is a dick",
            "title_similarity": "0.50125426",
            "sentiment_compound": -0.5106
        },
        {
            "id": "h23183t",
            "score": 3,
            "text": "Religion is evil disguised as love",
            "title_similarity": "0.38254973",
            "sentiment_compound": -0.3182
        },
        {
            "id": "h231gti",
            "score": 2,
            "text": "They’re all judgmental hypocrites anyway. Her life will be better off.",
            "title_similarity": "0.5406666",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h231mzh",
            "score": 3,
            "text": "...and Catholics insist Catholicism is a force for good in the world.",
            "title_similarity": "0.33428335",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h231pzo",
            "score": 2,
            "text": "God sure does work in mysterious ways....",
            "title_similarity": "0.04261774",
            "sentiment_compound": 0.5267
        },
        {
            "id": "h231q8b",
            "score": 1,
            "text": "Keep fighting, Sister Lucy.",
            "title_similarity": "0.44972712",
            "sentiment_compound": -0.3612
        },
        {
            "id": "h231vex",
            "score": 1,
            "text": "If only there were a new fangled pope around somewhere to right this wrong......oh well fuck it I guess",
            "title_similarity": "0.50905114",
            "sentiment_compound": -0.34
        },
        {
            "id": "h231vuf",
            "score": 1,
            "text": "At least they are no longer burning them.",
            "title_similarity": "0.15861416",
            "sentiment_compound": -0.296
        },
        {
            "id": "h231zzb",
            "score": 2,
            "text": "Reasons also included driving a vehicle and writing a poem!! Sounds like radical Islam, all religions are the same, sick corrupt cults! This Sister sounds like a good moral person with the values of great people like Jesus n Buddha (neither followed religions btw, men invented religions after them to manipulate)",
            "title_similarity": "0.5654869",
            "sentiment_compound": 0.9297
        },
        {
            "id": "h2321op",
            "score": 6,
            "text": "If there’s one thing you can bet on is that religion is nothing but hypocrisy",
            "title_similarity": "0.41792613",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2328dq",
            "score": 2,
            "text": "She was my school principal. The woman was a disciplinarian for sure but she was strong headed and iron willed. What the Catholic Church in India is doing is so wrong to her.",
            "title_similarity": "0.6737241",
            "sentiment_compound": -0.0994
        },
        {
            "id": "h232h3g",
            "score": 3,
            "text": "As a nun she would have no personal wealth accumulated, no house no nothing. How will she survive? She has given her life to this asshole church and now she is left with nothing! Is there a gofundme of something?",
            "title_similarity": "0.7064989",
            "sentiment_compound": -0.6996
        },
        {
            "id": "h232u60",
            "score": 3,
            "text": "So they're still harboring sexual predators. This is the reason I haven't been to church in nearly 20 years.",
            "title_similarity": "0.68955904",
            "sentiment_compound": 0.0
        },
        {
            "id": "h232vig",
            "score": 2,
            "text": "Not all heroes wear capes.",
            "title_similarity": "0.014313145",
            "sentiment_compound": -0.4023
        },
        {
            "id": "h232xwy",
            "score": 2,
            "text": "It's a lot easier to argue for antitheism than atheism",
            "title_similarity": "0.13708569",
            "sentiment_compound": 0.1027
        },
        {
            "id": "h2330w2",
            "score": 2,
            "text": "TL;DR for this comment section - people find out how much freedom America truly has.",
            "title_similarity": "0.19415042",
            "sentiment_compound": 0.7964
        },
        {
            "id": "h23367r",
            "score": 2,
            "text": "Maybe it will be the wake-up call when she realises she's not being deprived of anything, rather throwing off the shackles of a diabolical lie that has caused immeasurable pain and suffering.",
            "title_similarity": "0.5259522",
            "sentiment_compound": -0.5921
        },
        {
            "id": "h2339bj",
            "score": 1,
            "text": "With all the sexual abuse going on with the Catholic church it's surprising that they find time to do anything else.\n\nThey must wake up very early in the morning.",
            "title_similarity": "0.5219024",
            "sentiment_compound": -0.4767
        },
        {
            "id": "h233csv",
            "score": 2,
            "text": "Here’s a list of things we’re better off without:\n\nReligion\n\nPeople who use religion to push their own desires/agenda/politics/“morality”/stereotypes/bigotry/hate/perversion/ignorance/fear on others. \n \nFairytales like god/heaven/hell used to manipulate and hold power over others through fear. \n\nLegal loopholes and tax exemptions for religious organizations\n\nThe invasive manipulation of governments by religious organizations. \n\n——\n\nGod is not real. The Bible is a book of myths and legends and most of it is fabricated or stolen from other religions. Religion is harming the human race.",
            "title_similarity": "0.561352",
            "sentiment_compound": -0.6369
        },
        {
            "id": "h233gf5",
            "score": 1,
            "text": "The second rape.",
            "title_similarity": "0.40387022",
            "sentiment_compound": -0.6908
        },
        {
            "id": "h233hwe",
            "score": 2,
            "text": "Always murder rapists!",
            "title_similarity": "0.5225544",
            "sentiment_compound": -0.8832
        },
        {
            "id": "h233r2q",
            "score": 1,
            "text": "The comment section shows how lazy people are to actually read the article.",
            "title_similarity": "0.36968613",
            "sentiment_compound": -0.3612
        },
        {
            "id": "h233u9s",
            "score": 2,
            "text": "Hey, you know what? Fuck religion.",
            "title_similarity": "0.4266858",
            "sentiment_compound": -0.5423
        },
        {
            "id": "h233wux",
            "score": 1,
            "text": "Fuck the Catholic Church. 🤬",
            "title_similarity": "0.5908737",
            "sentiment_compound": -0.5423
        },
        {
            "id": "h2345yw",
            "score": 2,
            "text": "Have churches pay taxes.",
            "title_similarity": "0.3328588",
            "sentiment_compound": -0.1027
        },
        {
            "id": "h234a05",
            "score": 2,
            "text": "Is anyone surprised, I’m not sure how the catholic church is still so prominent.",
            "title_similarity": "0.32044628",
            "sentiment_compound": 0.4459
        },
        {
            "id": "h234hpn",
            "score": 1,
            "text": "Worth it.",
            "title_similarity": "-0.15563503",
            "sentiment_compound": 0.2263
        },
        {
            "id": "h234pq9",
            "score": 2,
            "text": "Such an absolute garbage institution is the catholic church.  ‘By their fruits you will know them.’  The vatican deserves to burn to rubble at this point.",
            "title_similarity": "0.6514297",
            "sentiment_compound": 0.0
        },
        {
            "id": "h234qtw",
            "score": 2,
            "text": "Typical of Catholic Church, whatever happened to all the pedo priests? The truth is hidden in plain sight  - not many see it and/ or care!  Why?",
            "title_similarity": "0.6028495",
            "sentiment_compound": 0.7312
        },
        {
            "id": "h23506u",
            "score": 2,
            "text": "That's some serious bullshit",
            "title_similarity": "0.20756114",
            "sentiment_compound": -0.6249
        },
        {
            "id": "h235925",
            "score": 1,
            "text": "I can't imagine why people are leaving the church...",
            "title_similarity": "0.5193163",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2359zf",
            "score": 1,
            "text": "And now her real life can begin.",
            "title_similarity": "0.20924123",
            "sentiment_compound": 0.0
        },
        {
            "id": "h235cb6",
            "score": 2,
            "text": "Damn Catholics, you did it! You managed to become 20% more rapey!",
            "title_similarity": "0.4852863",
            "sentiment_compound": -0.508
        },
        {
            "id": "h235dny",
            "score": 2,
            "text": "This is exactly why I no longer give money to the church for anything. They no longer represent goodness",
            "title_similarity": "0.6417557",
            "sentiment_compound": -0.1027
        },
        {
            "id": "h235ekw",
            "score": 2,
            "text": "Well it looks like no apology for their bad behaviour at the residential schools in Canada then.",
            "title_similarity": "0.565289",
            "sentiment_compound": -0.0124
        },
        {
            "id": "h235sag",
            "score": 1,
            "text": "How dare she hold them accountable! \n\nFuck the church, may it fall into the waste bin of history for all the perverts it's protected.",
            "title_similarity": "0.7274964",
            "sentiment_compound": -0.8172
        },
        {
            "id": "h235t7p",
            "score": 2,
            "text": "Well yeah, because if the Catholic Church starts to punish Rapists their whole empire will melt away.",
            "title_similarity": "0.75554645",
            "sentiment_compound": -0.6597
        },
        {
            "id": "h235u5r",
            "score": 1,
            "text": "Now go write some books, get paid and destroy the church",
            "title_similarity": "0.6629456",
            "sentiment_compound": -0.5423
        },
        {
            "id": "h235v88",
            "score": 1,
            "text": "It's the catholics church is it a surprise they hide and protect their pedophiles and sex criminals?",
            "title_similarity": "0.5229011",
            "sentiment_compound": -0.1779
        },
        {
            "id": "h2361jd",
            "score": 1,
            "text": "The catholic church hasn't changed since its creation",
            "title_similarity": "0.24220933",
            "sentiment_compound": 0.2732
        },
        {
            "id": "h2361uw",
            "score": 2,
            "text": "Plus now she’s going to hell for her transgressions.",
            "title_similarity": "0.5963692",
            "sentiment_compound": -0.6808
        },
        {
            "id": "h236adv",
            "score": 1,
            "text": "What adult still believes in god in 2021?",
            "title_similarity": "0.19827527",
            "sentiment_compound": 0.2732
        },
        {
            "id": "h236es9",
            "score": 1,
            "text": "Well yeah Catholicism (like all religions) is ran by garbage vile people. Did everyone forget this?",
            "title_similarity": "0.6486105",
            "sentiment_compound": -0.0516
        },
        {
            "id": "h236ha3",
            "score": 3,
            "text": "Pretty soon only the Rapist was going to want to become priest!\n\n\n……wait?  I suppose that has come and passed.",
            "title_similarity": "0.5303372",
            "sentiment_compound": -0.4003
        },
        {
            "id": "h236t7k",
            "score": 2,
            "text": "More proof that the Catholic Church is a fucking joke.",
            "title_similarity": "0.45229158",
            "sentiment_compound": 0.3597
        },
        {
            "id": "h2372xf",
            "score": 3,
            "text": "The Catholic Church didn't condone her anti-rape sentiment. How can you be a part of the worlds largest paedophile ring if you're not even pro rape?",
            "title_similarity": "0.6253749",
            "sentiment_compound": 0.5773
        },
        {
            "id": "h237j5h",
            "score": 1,
            "text": "GOD IS DEAD",
            "title_similarity": "0.42874897",
            "sentiment_compound": -0.4939
        },
        {
            "id": "h237qvl",
            "score": 1,
            "text": "Religion is a cancer to critical thinking.",
            "title_similarity": "0.4816023",
            "sentiment_compound": -0.7717
        },
        {
            "id": "h237sb8",
            "score": 1,
            "text": "The Catholic Church is so tone deaf and delusionally self righteous, that they would do this? In India? Where the rape of young poor girls without any punishment for the perpetrators is  rampant?  Wow, just wow.",
            "title_similarity": "0.7010439",
            "sentiment_compound": 0.2425
        },
        {
            "id": "h237vm7",
            "score": 1,
            "text": "That catholic church never changes, huh? Geez.",
            "title_similarity": "0.33973533",
            "sentiment_compound": 0.0
        },
        {
            "id": "h237y3j",
            "score": 1,
            "text": "I wonder what Francis has to say on this one.",
            "title_similarity": "0.16699661",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2383rc",
            "score": 2,
            "text": "Good to know that Church still harbors criminals.",
            "title_similarity": "0.24093604",
            "sentiment_compound": -0.2023
        },
        {
            "id": "h238602",
            "score": 3,
            "text": "If heaven and hell was real then my guess is there would be more church faculty in hell than regular people.  Bunch of hypocrites.  Rape and steal from the community in the name of an imaginary story.",
            "title_similarity": "0.6521442",
            "sentiment_compound": -0.9413
        },
        {
            "id": "h2389yq",
            "score": 2,
            "text": "They do shit like this and people really expect an apology for what they did to those native children during residential schools. An apology ain't going to do shit.  \n\n  \nTax em, take all their money and throw those pedophile enablers in jail.",
            "title_similarity": "0.6863815",
            "sentiment_compound": -0.617
        },
        {
            "id": "h238anx",
            "score": 2,
            "text": "I'm sorry I don't get why in this day and age people look to religion for comfort. Believe in your god or whatever, but in my experience christianity is a business that sells nothing but your faith keeps you buying. Weird.",
            "title_similarity": "0.49009165",
            "sentiment_compound": -0.4401
        },
        {
            "id": "h238duu",
            "score": 1,
            "text": "Out here in Canada they knew about the murder of dozens of children at a boarding school and they wouldn’t even publicly apologize.",
            "title_similarity": "0.6815654",
            "sentiment_compound": -0.6486
        },
        {
            "id": "h238ecp",
            "score": 1,
            "text": "This isn’t even news. A religious organization causing unjust harm to a person who has been victimized by that very religion in the pursuit of protecting the self interest of the religion itself is practically just a definition of religion. My heart goes out to the nun as I’m sure all of ours do. But we have literally had thousands of years to get wise to the game folks. Until we have the courage to have an open and honest conversation about what religion has done and is doing to our society, about what religion itself is, we have every reason to expect both the offenses and the coverups to not only continue but to evolve.",
            "title_similarity": "0.6882184",
            "sentiment_compound": 0.891
        },
        {
            "id": "h238izi",
            "score": 1,
            "text": "Jesus would be oh *so* proud",
            "title_similarity": "0.07144594",
            "sentiment_compound": 0.4767
        },
        {
            "id": "h238jcn",
            "score": 1,
            "text": "how could they do that to jesus's wife?",
            "title_similarity": "0.58592165",
            "sentiment_compound": 0.0
        },
        {
            "id": "h238lpx",
            "score": 1,
            "text": "Catholics: “We believe in Jesus and brotherhood.”\nAlso Christians: “Oh you’re raped? Suck it up! The Bishops can do whatever they want!”",
            "title_similarity": "0.48992658",
            "sentiment_compound": -0.8436
        },
        {
            "id": "h238wpu",
            "score": 1,
            "text": "I spent 2 years becoming a Catholic once. My ex wife pretends she cares about religion when she feels bad, and after she cheated we decided to \"find god\" together. Did the whole Catechism, the baptism, and was a few weeks from confirmation when I found out she had again started cheating with two of her coworkers the entire time I was dedicating my life to becoming Catholic and a religious leader for my little family.\n\nI told the Deacon that tried to change my mind from walking away from her and religion permanently that if he could get Jesus himself to come down and talk to me I would stay. \"You know that's a ridiculous request, what can I actually do to help you?\" At which point I spit in the holy water dish and bounced haha in the US that's a good enough way to signal the end of your religious life.",
            "title_similarity": "0.7759594",
            "sentiment_compound": -0.1531
        },
        {
            "id": "h239ekr",
            "score": 1,
            "text": "This should be in LeapordsAteMyFace sub",
            "title_similarity": "0.032889508",
            "sentiment_compound": 0.0
        },
        {
            "id": "h239mbz",
            "score": 2,
            "text": "What a power house of a person. If the whole god thing is real she just cemented her path to the shiny place, AND she pissed off the church too? Good for her",
            "title_similarity": "0.62272763",
            "sentiment_compound": -0.0516
        },
        {
            "id": "h239mlo",
            "score": 2,
            "text": "Hey Catholics:\n\nYou support rape.",
            "title_similarity": "0.40143797",
            "sentiment_compound": -0.4588
        },
        {
            "id": "h239o96",
            "score": 3,
            "text": "How people still goin to church I mean seriously?",
            "title_similarity": "0.32454503",
            "sentiment_compound": -0.1779
        },
        {
            "id": "h239om9",
            "score": 2,
            "text": "The same catholic institution that abused and murdered aboriginal children in Canada. The Catholic Church is an evil group that needs to be taken down.",
            "title_similarity": "0.7098849",
            "sentiment_compound": -0.9201
        },
        {
            "id": "h239oyu",
            "score": 2,
            "text": "This is exactly why secularism is such a good thing. Organized religion shouldn't have any sort of real power in the world",
            "title_similarity": "0.3754393",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h239skc",
            "score": 1,
            "text": "By men, about men, for men.\n\nSo Help me, Goddess ..",
            "title_similarity": "0.26587242",
            "sentiment_compound": 0.541
        },
        {
            "id": "h239szp",
            "score": 1,
            "text": "About every 5 years or so I think about going back to church. Then I spend two seconds looking at news ...",
            "title_similarity": "0.4890244",
            "sentiment_compound": 0.0
        },
        {
            "id": "h239ts9",
            "score": 1,
            "text": "In Britain, Henry VIII filled in our exit forms for us a couple of years ago.",
            "title_similarity": "0.3868125",
            "sentiment_compound": 0.0
        },
        {
            "id": "h239uxl",
            "score": 2,
            "text": "Religion = bronze age fairy tales",
            "title_similarity": "0.23599565",
            "sentiment_compound": 0.0
        },
        {
            "id": "h23a2u6",
            "score": 3,
            "text": "They’re like cops, must protect the institution at Any cost. Pathetic",
            "title_similarity": "0.32862723",
            "sentiment_compound": 0.1027
        },
        {
            "id": "h23a54u",
            "score": 2,
            "text": "If only they had thss as t kind of response for the pedophiles",
            "title_similarity": "0.46016985",
            "sentiment_compound": 0.0
        },
        {
            "id": "h23a87c",
            "score": 1,
            "text": "The great and abominable church that fornicates with the devil;  Revelations",
            "title_similarity": "0.5491837",
            "sentiment_compound": -0.0772
        },
        {
            "id": "h23aazt",
            "score": 1,
            "text": "Good for her!",
            "title_similarity": "0.054261215",
            "sentiment_compound": 0.4926
        },
        {
            "id": "h23acuu",
            "score": 1,
            "text": "It's a weird world we live in where, if for some reason you were struck with the desire to donate money to pedophiles, your best, fastest and easiest method would be sending money to the Catholic Church.",
            "title_similarity": "0.4842978",
            "sentiment_compound": 0.7906
        },
        {
            "id": "h23aizr",
            "score": 1,
            "text": "She’s welcome to come to Canada and help us take down the church while we find the graves of all our First Nations children killed in residential schools! We should be protesting churches every Sunday until they prosecute the pedophiles they are hiding. We just watched Americans try to over throw their capital (over a lot of stupid reasons) but one of them was they believed there was a child sex ring. No larger child sex ring than the Catholic Church has ever existed.",
            "title_similarity": "0.75301266",
            "sentiment_compound": -0.7871
        },
        {
            "id": "h23aj9p",
            "score": 1,
            "text": "I hope they see gods wrath for this sinful shit.",
            "title_similarity": "0.49644896",
            "sentiment_compound": -0.714
        },
        {
            "id": "h23alos",
            "score": 1,
            "text": "Note that Sister Lucy was expelled from the Church on the grounds that she was driving a car and writing/reading poems apparently.",
            "title_similarity": "0.80771244",
            "sentiment_compound": -0.25
        },
        {
            "id": "h23avjv",
            "score": 3,
            "text": "I think it’s important to understand that it is one thing to criticize the institution, but another to criticise the normal, every day people of the faith. They have common sense and of course, decency, opinions, strong feelings and anger about this shit when it happens to anyone. They don’t always just sit complicity. \n\nMost Catholics/Christians (because let’s be real- bad people exist in every place) are good people who absolutely detest this sort of bullshit. There aren’t headliners saying “X&X think that priest is a piece of shit” or “X&X demand answers from the Vatican immediately and justice to be served”. A lack of exposure to those people does not mean they don’t exist.",
            "title_similarity": "0.53991264",
            "sentiment_compound": -0.9286
        },
        {
            "id": "h23axnv",
            "score": 1,
            "text": ">Speaking on behalf of ACC, advocate A.M. Sodder, said: “Is this what Christianity is about?\n\nYes.",
            "title_similarity": "0.30570483",
            "sentiment_compound": 0.4019
        },
        {
            "id": "h23aytq",
            "score": 2,
            "text": "Boo!!!",
            "title_similarity": "0.069962695",
            "sentiment_compound": 0.0
        },
        {
            "id": "h23b7eh",
            "score": 2,
            "text": "Yeah, I’m sure they’ll have a great time squaring that with their god when it’s over.\n\n“It says here you...let’s see, kicked a nun out of the church for sticking up for a probable rape victim, writing poetry, and...driving?”",
            "title_similarity": "0.72872007",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h23b81m",
            "score": 1,
            "text": "Just another reason why I don’t support churches that treat women as inferiors.",
            "title_similarity": "0.5385759",
            "sentiment_compound": 0.5994
        },
        {
            "id": "h23biwc",
            "score": 1,
            "text": "But sure, Q-Anon, tell me more about the pedophile Satanic cabal while saying nothing about this.",
            "title_similarity": "0.55097854",
            "sentiment_compound": 0.4497
        },
        {
            "id": "h23blh7",
            "score": 2,
            "text": "The Catholic Church is going to end up with like 100 guys holed up in the Vatican and that’s it",
            "title_similarity": "0.58567154",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h23bly3",
            "score": 2,
            "text": "But hey they gotta have a huge meeting about publicly rebuking the Biden administration regarding abortion rights lol",
            "title_similarity": "0.66808057",
            "sentiment_compound": 0.7684
        },
        {
            "id": "h23bovl",
            "score": 2,
            "text": "Headline does not match the article. It does not say she was expelled from the church. She was expelled from her order.",
            "title_similarity": "0.778872",
            "sentiment_compound": -0.4588
        },
        {
            "id": "h23bsjr",
            "score": 2,
            "text": "Fuck religion so hard",
            "title_similarity": "0.43959472",
            "sentiment_compound": -0.6361
        },
        {
            "id": "h23byyi",
            "score": 3,
            "text": "I’d be like bye ✌️ bitches !!",
            "title_similarity": "0.38672674",
            "sentiment_compound": -0.4559
        },
        {
            "id": "h23diep",
            "score": 3,
            "text": "God Is Not Great: How Religion Poisons Everything \n- Christopher Hitchens\n\nGood read",
            "title_similarity": "0.4978845",
            "sentiment_compound": -0.4577
        },
        {
            "id": "h23dm42",
            "score": 1,
            "text": "Just like Jesus taught",
            "title_similarity": "0.11324762",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h23dnlp",
            "score": 3,
            "text": "Good. Maybe this will help shine a light onto the actual reality of what religion fosters.",
            "title_similarity": "0.13796684",
            "sentiment_compound": 0.6808
        },
        {
            "id": "h23dpbm",
            "score": 3,
            "text": "If heaven exists. She will get in.",
            "title_similarity": "0.110038325",
            "sentiment_compound": 0.5106
        },
        {
            "id": "h23dqp8",
            "score": 2,
            "text": "Here is an excellent explanation of the history of taxes being collected for religious institutions by the German state. It explains the history, tax % rate, amount that is typical, how to get out of paying, and how to solve problems, if the tax continues on your wages/salary. Indeed, bizarre. But then again, so is the way religion is supported in the USA. https://www.settle-in-berlin.com/stop-paying-german-church-tax/",
            "title_similarity": "0.5218121",
            "sentiment_compound": 0.4939
        },
        {
            "id": "h23dzi7",
            "score": 3,
            "text": "She did not go against god. She went against the church. The church does not serve god. It serves itself and those who head it. Everything checks out here.",
            "title_similarity": "0.5911765",
            "sentiment_compound": -0.3875
        },
        {
            "id": "h23eg7g",
            "score": 1,
            "text": "I hate religion",
            "title_similarity": "0.5085224",
            "sentiment_compound": -0.5719
        },
        {
            "id": "h23egvw",
            "score": 1,
            "text": "Yet another reason why I am no longer a Catholic.",
            "title_similarity": "0.34792447",
            "sentiment_compound": -0.296
        },
        {
            "id": "h23eriu",
            "score": 1,
            "text": "Ah, the church special. If you cannot answer questions, just don't listen to it.",
            "title_similarity": "0.49575782",
            "sentiment_compound": 0.4019
        },
        {
            "id": "h23f30p",
            "score": 1,
            "text": "We have a nun who is a good friend. The church got a new priest who decided he didn’t want the nuns around anymore even though they ran the church, Sunday school etc. All of them were really great fantastic woman. Come to find out the priest was “holding” their money and only paying them a fraction of what was supposed to be paid. She called out his bluff and decided he wanted them gone. She’s in Mexico City now. The local catholic  diocese found out after an uproar from church members and his punishment despite stealing was to be transferred. Damn shame the church still can’t get their shit together.",
            "title_similarity": "0.79301167",
            "sentiment_compound": 0.7244
        },
        {
            "id": "h23f6yf",
            "score": 2,
            "text": "So we’re surprised that the Catholic Church sucks now?",
            "title_similarity": "0.50176615",
            "sentiment_compound": -0.0828
        },
        {
            "id": "h23fi54",
            "score": 1,
            "text": "Freedom from religion.....expelled? whatever",
            "title_similarity": "0.37568977",
            "sentiment_compound": 0.6369
        },
        {
            "id": "h23fmm0",
            "score": 1,
            "text": "For the Catholic Church it doesn’t seem like the Christian thing to do. Unless protecting its power and wealth is now the new Christianity…",
            "title_similarity": "0.41668558",
            "sentiment_compound": 0.6908
        },
        {
            "id": "h23fu8x",
            "score": 1,
            "text": "Fuck the church!!! What a fucking waste",
            "title_similarity": "0.5694864",
            "sentiment_compound": -0.8161
        },
        {
            "id": "h23fyzp",
            "score": 1,
            "text": "So the answer to WWJD is be cool with rape? Thanks Catholic Church! smh",
            "title_similarity": "0.48109698",
            "sentiment_compound": -0.4753
        },
        {
            "id": "h23fzzf",
            "score": 1,
            "text": "Out my own ignorance I have to say- it seems ridiculous that the Catholic Church has continued for centuries to prey on, abuse, rape and torment women and children, then cast them out without repercussions. What would it take- other than flipping worldwide complacency on its head- to stamp out these demons posing as angels? I mean, god damn. It’s disgusting.",
            "title_similarity": "0.7286035",
            "sentiment_compound": -0.9578
        },
        {
            "id": "h23g3ku",
            "score": 2,
            "text": "I didn't see the article state that she was excommunicated, only that she was dismissed from her order. Am I missing something?",
            "title_similarity": "0.661788",
            "sentiment_compound": -0.296
        },
        {
            "id": "h23gf2z",
            "score": 2,
            "text": "The Catholic Church is sketchy AF.",
            "title_similarity": "0.32163763",
            "sentiment_compound": 0.0
        },
        {
            "id": "h23gh9f",
            "score": 1,
            "text": "Integra Helsing: Oh, I have an idea...",
            "title_similarity": "0.031716026",
            "sentiment_compound": 0.0
        },
        {
            "id": "h23gmrq",
            "score": 2,
            "text": "She’s just another dirty little secret. That bags getting full though and sooner then later it will burst and all the little secrets will come out to play.",
            "title_similarity": "0.41078514",
            "sentiment_compound": -0.128
        },
        {
            "id": "h23heqb",
            "score": 3,
            "text": "And this is why when people say, \"But look at the Pope he hugs Atheist and stuff,\" and I nod and say the church is still a self serving business.",
            "title_similarity": "0.49357522",
            "sentiment_compound": 0.6486
        },
        {
            "id": "h23iue0",
            "score": 2,
            "text": "More shame on the Catholic Church. As soon as I started thinking for myself, I walked away from it.",
            "title_similarity": "0.727288",
            "sentiment_compound": -0.5256
        },
        {
            "id": "h23jfql",
            "score": 1,
            "text": "Of course",
            "title_similarity": "-0.14329097",
            "sentiment_compound": 0.0
        },
        {
            "id": "h23jm47",
            "score": 1,
            "text": "DNA will prove if hes guilty... or was in consensual??",
            "title_similarity": "0.27461028",
            "sentiment_compound": -0.4871
        },
        {
            "id": "h23jnd4",
            "score": 2,
            "text": ">vacate her convent within a week.\n\nLol or what? They gonna chase her out with rulers?",
            "title_similarity": "0.78392905",
            "sentiment_compound": 0.4871
        },
        {
            "id": "h23junr",
            "score": 2,
            "text": "Can we stop believing the Catholic Church holds any morals? The evidence keeps expanding that shows the Church is criminal and evil, yet we're supposed to believe they guide morality? \n\nGoes to show they have better p.r than the Nazis did.",
            "title_similarity": "0.4849033",
            "sentiment_compound": -0.8156
        },
        {
            "id": "h23kqbp",
            "score": 1,
            "text": "Ben Shapiro - well, if you gonna put yourself in a bad situation like the church - then you are responsible for your own rape.",
            "title_similarity": "0.6211625",
            "sentiment_compound": -0.5106
        },
        {
            "id": "h23l4yv",
            "score": 1,
            "text": "This is just adding to my reasons for disavowing the church. They are not what they say they are, ever.",
            "title_similarity": "0.66790044",
            "sentiment_compound": 0.0
        },
        {
            "id": "h23lg3h",
            "score": 1,
            "text": "And here in Canada, we're up in arms (rightly so) about the 200+ native children killed in residential homes. Strangely the focus is on solely blaming the Gov., and not the Catholic Church which ran the majority of these deathcamp \"Schools\".",
            "title_similarity": "0.65298903",
            "sentiment_compound": -0.872
        },
        {
            "id": "h23lp4o",
            "score": 1,
            "text": "Sounds like a blessing in disguise.",
            "title_similarity": "0.00727681",
            "sentiment_compound": 0.5719
        },
        {
            "id": "h23mmih",
            "score": 1,
            "text": "https://discord.gg/eZFVQ5gR",
            "title_similarity": "0.25946432",
            "sentiment_compound": 0.0
        },
        {
            "id": "h23mn5g",
            "score": 1,
            "text": "The church has to know they’re on the wrong side of history and morality and humanity, right? They expel nuns who fight rapists and protect child molester priests.",
            "title_similarity": "0.7412036",
            "sentiment_compound": -0.9274
        },
        {
            "id": "h23mp2a",
            "score": 1,
            "text": "My brain auto corrected the word vacate to vaccinate. \n\nThis time period sucks",
            "title_similarity": "0.49993587",
            "sentiment_compound": -0.3612
        },
        {
            "id": "h23mqwk",
            "score": 1,
            "text": "Just the latest attempt by the Catholic Church to protect one of their many molesters and rapists priests or Bishops!  Sounds like the Bishop in question needs to be put away in a prison where he can get what he seems to desire, except this time it will be he who is getting raped!",
            "title_similarity": "0.6753602",
            "sentiment_compound": -0.8802
        },
        {
            "id": "h23mxpd",
            "score": 1,
            "text": "Can’t fight the establishment",
            "title_similarity": "0.31005615",
            "sentiment_compound": -0.3818
        },
        {
            "id": "h23n2af",
            "score": 1,
            "text": "And that’s one more reason why you shouldn’t be part of this club called catholic church",
            "title_similarity": "0.56201696",
            "sentiment_compound": 0.0
        },
        {
            "id": "h23nfjo",
            "score": 2,
            "text": "“The church protects its own.” What does this say about the church not protecting her?",
            "title_similarity": "0.5267111",
            "sentiment_compound": 0.3182
        },
        {
            "id": "h23nhgo",
            "score": 1,
            "text": "Eff the Catholic Church. Disgusting.",
            "title_similarity": "0.5308948",
            "sentiment_compound": -0.5267
        },
        {
            "id": "h23nqt2",
            "score": 1,
            "text": "Let's hope this is the Rosa Parks moment for the church.... please can someone who believes in god and the church explain to me how this situation has come about? \nLet's just , for a moment, believe the bishops version.... were is the tolerance and forgiveness of the church that should help her after all the years of service to the church.But back in the real world how is it possible that no matter what the accusations against the clergy are no one ( except in very rare circumstances) goes to prison,no one is thrown out of the church and money is thrown around like confetti in the defence of the sex offenders?\nThe gropers and molesters and child rapers is not a new concept... the church itself trying to take control of the financies in each parish by banning priests from marriage and moving the young priests to distant areas, has bred a group of sexualy frustrated men with access to children and absolute power over any reports of abuse.When are you god squad groups going to open your eyes and demand justice for all the victims.... after all you are the ones financing and allowing it to happen....\nWhen will the world stop believing in the fairy tales and put the same energy into being a human being and treat everyone else as human with the right not to be abused and have no way to get justice....",
            "title_similarity": "0.63435864",
            "sentiment_compound": 0.7571
        },
        {
            "id": "h23nuzv",
            "score": 1,
            "text": "If I ever have kids, it’s going to be hard to explain to them the fight between good and evil because evil has so obviously won.",
            "title_similarity": "0.4854808",
            "sentiment_compound": -0.7115
        },
        {
            "id": "h23p8ij",
            "score": 1,
            "text": "I'll add this as reason #26852680 as to why I don't believe in organized religion and could never in my life support any church",
            "title_similarity": "0.6308222",
            "sentiment_compound": 0.4019
        },
        {
            "id": "h23q7sq",
            "score": 1,
            "text": "The Catholic Church everybody.",
            "title_similarity": "0.34507236",
            "sentiment_compound": 0.0
        },
        {
            "id": "h23qbr1",
            "score": 1,
            "text": "Hey, take a wild guess at who hasn't been disciplined by the Catholic Church. Still a member in good standing and holds onti all titles and leadership positions. He was granted a leave of absence at his own request to deal with the rape and assault charges. Priorities, right?",
            "title_similarity": "0.61421466",
            "sentiment_compound": -0.7845
        },
        {
            "id": "h23qhfb",
            "score": 1,
            "text": "It's so nice to see the Catholic church being an equal opportunity rape organization and are now giving the young boys a break. (/s, in case anyone thinks this could possibly be serious.)\n\nAt least they are consistent about protecting the guilty and ignoring heinous crimes their people commit.",
            "title_similarity": "0.40302166",
            "sentiment_compound": -0.2516
        },
        {
            "id": "h23qlte",
            "score": 1,
            "text": "Religion as shitty as always....",
            "title_similarity": "0.5481324",
            "sentiment_compound": -0.5574
        },
        {
            "id": "h23qp61",
            "score": 1,
            "text": "Shocker",
            "title_similarity": "0.074161515",
            "sentiment_compound": -0.1531
        },
        {
            "id": "h23qyx8",
            "score": 1,
            "text": "The catholic church is chock full of rapists and pedophiles so it's no surprise she isn't getting justice. I can only hope this will open people's eyes a bit to see that the world doesn't need religion.",
            "title_similarity": "0.6774099",
            "sentiment_compound": -0.7163
        },
        {
            "id": "h23r04o",
            "score": 2,
            "text": "The headline makes it sound like she was expelled for reasons relating to the rape allegations, but 30 seconds of googling shows that it was because she repeatedly did not follow the rules of her convent and repeatedly ignored the orders of her superiors.",
            "title_similarity": "0.8182256",
            "sentiment_compound": -0.4678
        },
        {
            "id": "h23r3at",
            "score": 1,
            "text": "How dare she interfere with the Catholic Church’s rape quota? The absolute *nerve* of some people",
            "title_similarity": "0.72527397",
            "sentiment_compound": -0.6908
        },
        {
            "id": "h23ras3",
            "score": 1,
            "text": "Catholicism should have died so many times over. Religion is a blight on society",
            "title_similarity": "0.63654685",
            "sentiment_compound": -0.5574
        },
        {
            "id": "h23rdsg",
            "score": 1,
            "text": "This is fucking disgusting, tax all churches and send those rapist priests straight to jail. Let them get butt fucked see how they like it.",
            "title_similarity": "0.73484683",
            "sentiment_compound": -0.8908
        },
        {
            "id": "h23se80",
            "score": 1,
            "text": "Surprise surprise....",
            "title_similarity": "0.100568846",
            "sentiment_compound": 0.4939
        },
        {
            "id": "h23smca",
            "score": 1,
            "text": "It’s all part of the new fresh or happier kinder less Nazi Catholic Church",
            "title_similarity": "0.32256323",
            "sentiment_compound": 0.836
        },
        {
            "id": "h23t0rz",
            "score": 1,
            "text": "Jesus hates it when women complain about being raped especially by one of his guys",
            "title_similarity": "0.6373257",
            "sentiment_compound": -0.875
        },
        {
            "id": "h23t5ah",
            "score": 3,
            "text": "This is the reality for women as brave as her to speak out about abuse. \nI have also been denied justice, on the basis I choked in court when asked why I never screamed. I was 14 at the time of my assault, and am inpatient in a psychiatric hospital at the time of the court hearing due to a mental breakdown because of the investigation. \n\nSo many women are denied justice for shitty fucking reasons. It often goes unnoticed that most women have some form of trauma when it comes to being objectified. From cat calls to extreme abuse, most women I've met have one story. \n\nIt would be nice to live in a world where women weren't ignored when speaking out about this shit.",
            "title_similarity": "0.7150382",
            "sentiment_compound": -0.9525
        },
        {
            "id": "h23t6gc",
            "score": 2,
            "text": "Oh the same catholic church that harbors and protects pedophiles. I'm not exactly surprised at this.",
            "title_similarity": "0.38799262",
            "sentiment_compound": 0.1615
        },
        {
            "id": "h23tz93",
            "score": 1,
            "text": "Evil Corp Church will always hide the truth.",
            "title_similarity": "0.59347767",
            "sentiment_compound": -0.5859
        },
        {
            "id": "h23uaox",
            "score": 3,
            "text": "Religious tolerance is at the heart of the issue - we have allowed Religion to be a “hands-off” subject \nthat can’t be criticized or ridiculed regardless of obvious nonsense, textual conflicts, outright errors, canonical censorship, superstitious/magical thinking, acts of gennoacide, infanticide, misogyny, homophobia, human and animal sacrifice. racism and slavery.  The Pope is infallible? And pedophile priests haven't been protected by the church since its inception - seriously?\nMoreover, no one dares to draw a picture and call it the Prophet Mohammad - even if they themselves believe it to be horseshit.  Nowhere else in life do we self-deceive, deny science, suspend critical thinking or the need for evidence as we do when it comes to religion.  \n\nJESUS, YAHWEH, The HOLY SPIRIT, MOHAMMAD, SATAN - COEXISTENCE in general, can bite my ass. I have Zer0 faith in Talking Snakes, Winged Horses, Sky Wizards or ANY baseless “Bronze Age” beliefs.",
            "title_similarity": "0.6182842",
            "sentiment_compound": -0.9754
        },
        {
            "id": "h23ubl8",
            "score": 1,
            "text": "God is in one’s heart not some bitch ass church.",
            "title_similarity": "0.27652353",
            "sentiment_compound": 0.9047
        },
        {
            "id": "h23ue6c",
            "score": 1,
            "text": "That’s messed up!",
            "title_similarity": "0.19325384",
            "sentiment_compound": -0.4003
        },
        {
            "id": "h23uebq",
            "score": 2,
            "text": "Ladies and gentlemen, the church.  Where your donations fund a cult of rapists....or was that the republican party...same thing 🤷🏻‍♂️",
            "title_similarity": "0.58614725",
            "sentiment_compound": 0.0
        },
        {
            "id": "h23w2s6",
            "score": 1,
            "text": "#cultproblems",
            "title_similarity": "0.12048416",
            "sentiment_compound": 0.0
        },
        {
            "id": "h23w9uv",
            "score": 1,
            "text": "Toxic Christianity",
            "title_similarity": "0.42839354",
            "sentiment_compound": 0.0
        },
        {
            "id": "h23wp4r",
            "score": 1,
            "text": "True Christians know that this woman will be seated in heaven for eternity, and he will be rotting in the deepest flames of hell forever, as will anyone who may have contributed to her being expelled from the church. The Catholic Church has done more work for satan than any organization in world history.",
            "title_similarity": "0.7235228",
            "sentiment_compound": -0.128
        },
        {
            "id": "h23wsu4",
            "score": 2,
            "text": "Guys I'm starting to suspect the Catholic Church doesn't actually represent God on earth.",
            "title_similarity": "0.43235403",
            "sentiment_compound": -0.4614
        },
        {
            "id": "h23wums",
            "score": 1,
            "text": "Fuck shit up Sister Lucy",
            "title_similarity": "0.5641476",
            "sentiment_compound": -0.7964
        },
        {
            "id": "h23wyeq",
            "score": 1,
            "text": "Religon religon religon @ 2021, still going political",
            "title_similarity": "0.18657118",
            "sentiment_compound": 0.0
        },
        {
            "id": "h23x0dg",
            "score": 2,
            "text": "You don't have to be a nun to be dedicated to the work of the church and to be dedicated to the directions of God. God will handle that priest and those involved. Right now there are other hurt and abused, the forgotten, homeless, and other people that Jesus told us to help and love until he gets back. Doesn't take a fancy dress and headpiece to do that. I hope she gets every blessing due to her. Take the appeal to court, and get that whole church and everyone that has wronged her thrown in prison.",
            "title_similarity": "0.62394863",
            "sentiment_compound": 0.8126
        },
        {
            "id": "h23x1hj",
            "score": 2,
            "text": "Fuck the catholic church",
            "title_similarity": "0.58894694",
            "sentiment_compound": -0.5423
        },
        {
            "id": "h23x34z",
            "score": 2,
            "text": "So...Catholicism in a nutshell is \"Got fucked? Get fucked.\"",
            "title_similarity": "0.4950443",
            "sentiment_compound": -0.8689
        },
        {
            "id": "h23xabp",
            "score": 1,
            "text": "Once again the church doesn’t very Christ like. I hope that convent gets disbanded.",
            "title_similarity": "0.74347997",
            "sentiment_compound": 0.6887
        },
        {
            "id": "h23xltf",
            "score": 1,
            "text": "Ah, religious heirarchy....somehow people keep falling for it and get confused when the leopards eat their face. Sounds like some higher-ups in the organization need to rot in hell a while",
            "title_similarity": "0.6450162",
            "sentiment_compound": -0.7184
        },
        {
            "id": "h23y70s",
            "score": 1,
            "text": "A sad day for everybody. If those in power cannot be held to account, and if those who legitimately try to speak truth about abuse to the powerful.",
            "title_similarity": "0.51032984",
            "sentiment_compound": -0.4939
        },
        {
            "id": "h23yahw",
            "score": 2,
            "text": "I'm happy for her. Clearly a rapist supporting cabal of charlatans doesn't deserve the privilege of a brave principled soul like her.",
            "title_similarity": "0.48000598",
            "sentiment_compound": 0.8014
        },
        {
            "id": "h23yb6z",
            "score": 1,
            "text": "What’s new? Catholics are pedos, it’s common knowledge.",
            "title_similarity": "0.33575723",
            "sentiment_compound": 0.0
        },
        {
            "id": "h23yjw7",
            "score": 1,
            "text": "This seems highly unlike the Church to do. \n\n\n\nLol.",
            "title_similarity": "0.41071606",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h23yv4s",
            "score": 2,
            "text": ">For many parents, baptising a child is a bit of cheap soul insurance or done blithely for the benefit of devout grandparents. But for the Catholic church, it’s the door to membership and salvation. A one-way door. Baptism “imprints on the soul an indelible spiritual sign” and creates an “ontological and permanent bond” with Jesus and the church. And this contract is recorded on a parish baptismal register, forever.\n\nSo this bullshit voodoo ceremony you had for me when I was a tiny infant unable to comprehend anything or consent to it makes it so that I am unable to opt-out of your evil, raping, pedophile organization? GTFO with that horseshit, I don't need you or anyone else to 'grant' me the right to denounce every goddamn thing you assholes represent.",
            "title_similarity": "0.66359305",
            "sentiment_compound": -0.9813
        },
        {
            "id": "h23yys8",
            "score": 1,
            "text": "God is dead sister",
            "title_similarity": "0.6148658",
            "sentiment_compound": -0.4939
        },
        {
            "id": "h23yzhz",
            "score": 2,
            "text": "Fuck the catholic church",
            "title_similarity": "0.58894694",
            "sentiment_compound": -0.5423
        },
        {
            "id": "h23z5ng",
            "score": 3,
            "text": "And the church wonders why membership to their cult is at an all time low.",
            "title_similarity": "0.5839027",
            "sentiment_compound": -0.2732
        },
        {
            "id": "h23zbu5",
            "score": 3,
            "text": "Well that’s one less person in that cult. Hopefully she sees the rape culture that is so endemic in Catholicism and organized religions for the most part. I wonder how the church will respond to the criticism. I’d love if she did an international speaking engagement on the dangers of trusting religious leaders and fellow fanatics.",
            "title_similarity": "0.69580877",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h23zhnl",
            "score": 4,
            "text": "i’m starting the think the catholic church might not be that great.",
            "title_similarity": "0.40954113",
            "sentiment_compound": -0.5096
        },
        {
            "id": "h240al3",
            "score": 1,
            "text": "Well the churches hot take on the rape of women and children is obvious. \"It's for the greater good\"",
            "title_similarity": "0.48826706",
            "sentiment_compound": 0.2023
        },
        {
            "id": "h240izs",
            "score": 2,
            "text": "This world is is fucked!",
            "title_similarity": "0.3111601",
            "sentiment_compound": -0.69
        },
        {
            "id": "h240k6o",
            "score": 1,
            "text": "r/Makingsofagreatmovie",
            "title_similarity": "0.14538501",
            "sentiment_compound": 0.0
        },
        {
            "id": "h240ltn",
            "score": 2,
            "text": "The Catholic church is a political extortion racket.",
            "title_similarity": "0.496728",
            "sentiment_compound": 0.0
        },
        {
            "id": "h240o6w",
            "score": 3,
            "text": "The Catholic Church is an evil institution. There is very little evidence to the contrary. \n\nIt may have good members, but as an institution it’s corrupt, malevolent and brutal.",
            "title_similarity": "0.47889718",
            "sentiment_compound": -0.8126
        },
        {
            "id": "h240q54",
            "score": 4,
            "text": "People who still think the Catholic Church isn't an evil organization, knows nothing of the last thousand years regardless of how hip modern Pope's try to show themselves as",
            "title_similarity": "0.49110368",
            "sentiment_compound": 0.5448
        },
        {
            "id": "h241lad",
            "score": 2,
            "text": "Religion is poison",
            "title_similarity": "0.43059495",
            "sentiment_compound": -0.5423
        },
        {
            "id": "h241lgc",
            "score": 2,
            "text": "Sounds like the Catholic thing to do.",
            "title_similarity": "0.17310427",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h241o3e",
            "score": 3,
            "text": "Is there any organization more despicable than the Catholic Church?I think not. If you think I’m wrong just ask the 1,000,000++ boys and Girls that were rapped.",
            "title_similarity": "0.5920702",
            "sentiment_compound": -0.4767
        },
        {
            "id": "h241p4b",
            "score": 3,
            "text": "This is a clear case of \"Shut the fuck up and don't question the people in power.\"",
            "title_similarity": "0.4178778",
            "sentiment_compound": -0.2263
        },
        {
            "id": "h242bhg",
            "score": 1,
            "text": "Oh god…",
            "title_similarity": "0.02826555",
            "sentiment_compound": 0.0
        },
        {
            "id": "h242mbu",
            "score": 2,
            "text": "Fuck the catholic church.",
            "title_similarity": "0.5723238",
            "sentiment_compound": -0.5423
        },
        {
            "id": "h242y8z",
            "score": 2,
            "text": "Consider this a blessing. Contemplate on whether your god exists, for real, and, if he does: if these are the people who represent him, how bad is the actual head honcho?",
            "title_similarity": "0.37438205",
            "sentiment_compound": 0.2023
        },
        {
            "id": "h2435vu",
            "score": 2,
            "text": "Catholicism needs to be dismantled and their resources distributed to the unfortunately like they claim they do.",
            "title_similarity": "0.63708377",
            "sentiment_compound": 0.0258
        },
        {
            "id": "h2438j8",
            "score": 1,
            "text": "Disgusting. So glad the Catholic Church has finally gotten their priorities in order /s",
            "title_similarity": "0.38794792",
            "sentiment_compound": -0.0276
        },
        {
            "id": "h243i45",
            "score": 1,
            "text": "I have doubts, I have such doubts...",
            "title_similarity": "0.14902511",
            "sentiment_compound": -0.5267
        },
        {
            "id": "h243j0h",
            "score": 1,
            "text": "I wonder if she can pursue it through regular civil court instead? A lot of people done this in my country as church procedures proven to be fucking useless and they were protecting priests in child molesting cases.",
            "title_similarity": "0.69563437",
            "sentiment_compound": -0.7841
        },
        {
            "id": "h2442fw",
            "score": 5,
            "text": "I hope sister Lucy prevails in her legal battle and then shucks off her habit and quits the Catholic Church realizing that religion is a lie, it does not empower people with anything than ridiculous beliefs such as \n\n#1 one needs anyone else to commune with their higher power for them and that everyone should give them their money.   \n\nI hope she sees that \n\n#2 the Catholic Church has repeatedly been shown to be corrupt in the most heinous of ways (ie the sexual abuse of women and children. \n\n#3 Jesus was not Catholic or Christian \n\n#4 If Jesus taught anything it was to be kind to those less fortunate and regardless of station AND \n\n#5 Even more importantly Jesus taught us to question and challenge the powers that be.\n\nRock on Sister Lucy!  You will continue to be the person Jesus encouraged us all to be regardless of where you live, the clothes on your back, the place you reside, and who does or does not approve.",
            "title_similarity": "0.7364342",
            "sentiment_compound": 0.8268
        },
        {
            "id": "h244cuq",
            "score": 1,
            "text": "This is not what my Jesus would want... Its so cruel.",
            "title_similarity": "0.41811866",
            "sentiment_compound": -0.5849
        },
        {
            "id": "h2454ga",
            "score": 1,
            "text": "Efh",
            "title_similarity": "-0.05890764",
            "sentiment_compound": 0.0
        },
        {
            "id": "h24738x",
            "score": 2,
            "text": ">In October 2019, she was dismissed by the FCC on the grounds that she was “violating her vows as a nun through her lifestyle”. The FCC report had then said that she had been dismissed for reasons, including driving a vehicle, writing and publishing poems, and lending her support to the protests for the nun who had accused the Roman Catholic Bishop Mulakkal of repeatedly raping and sexually assaulting her.\n\nWhat even is any of this Calvinball bullshit.\n\nWriting poems?  Driving a car?  For real?",
            "title_similarity": "0.822922",
            "sentiment_compound": -0.9305
        },
        {
            "id": "h247u3j",
            "score": 1,
            "text": "Somebody should do something.",
            "title_similarity": "-0.08441324",
            "sentiment_compound": 0.0
        },
        {
            "id": "h247ztf",
            "score": 1,
            "text": "Shocking",
            "title_similarity": "0.13873468",
            "sentiment_compound": -0.4019
        },
        {
            "id": "h2483f4",
            "score": 2,
            "text": "He def a rapist.. getting her exiled is so obvious",
            "title_similarity": "0.52048504",
            "sentiment_compound": -0.7096
        },
        {
            "id": "h248d95",
            "score": 2,
            "text": "#GODSPLAN",
            "title_similarity": "0.12309511",
            "sentiment_compound": 0.0
        },
        {
            "id": "h248ocn",
            "score": 3,
            "text": "This is the type of shit that keeps me a atheist",
            "title_similarity": "0.46230358",
            "sentiment_compound": -0.5574
        },
        {
            "id": "h249q3j",
            "score": 1,
            "text": "Bet she'll just say it's God's will...\n\nSome people are so forgiving. Not me.",
            "title_similarity": "0.3129668",
            "sentiment_compound": 0.5777
        },
        {
            "id": "h24a6jd",
            "score": 3,
            "text": "The title is misleading. She has not been expelled from the Catholic Church. She has been kicked out of her  religious order.  The Vatican did not do that. The Mother Superior of her religious order did.  She appealed to the Vatican and  they did not overturn the religious order.  As to why they did not, the article doesn't say, but most likely it is because religious orders are responsible for who is and is not a member, not the Vatican.\n\nIs an injustice to her being done? Yes, certainly, but it is her local religious order creating that injustice. Ironically, the accused bishop who is out on bail is still a bishop.  How sad.",
            "title_similarity": "0.711712",
            "sentiment_compound": -0.7077
        },
        {
            "id": "h24abzk",
            "score": 2,
            "text": "Fuck the Catholic Church",
            "title_similarity": "0.58894694",
            "sentiment_compound": -0.5423
        },
        {
            "id": "h24af5e",
            "score": 1,
            "text": "Not the first nun they have thrown out for questioning the norm. There was a documentary about a nun that was with the church like 50 years. She started demanding answers regarding not helping the poor and a few other issues. She told it all the way up to the pope. Who quickly expelled her from the Abby and the church.",
            "title_similarity": "0.8599674",
            "sentiment_compound": -0.0346
        },
        {
            "id": "h24ao2r",
            "score": 2,
            "text": "Catholic Church has been wack and will always be wack. The most satanic Christians for sure.",
            "title_similarity": "0.5773502",
            "sentiment_compound": 0.3182
        },
        {
            "id": "h24avws",
            "score": 1,
            "text": "You can’t be “permanently expelled“ from the Catholic Church.  She could be expelled from her order, but that’s a different matter. \n\nThere’s no excommunication that can’t be removed.",
            "title_similarity": "0.6433561",
            "sentiment_compound": -0.4854
        },
        {
            "id": "h24blu6",
            "score": 1,
            "text": "She should start her own church.",
            "title_similarity": "0.4504349",
            "sentiment_compound": 0.0
        },
        {
            "id": "h24bnjx",
            "score": 1,
            "text": "The Catholic church needs to be torn down and it's assets sold off. It's a joke and it's not funny. I will not mince my words when I say I have no desire to see Catholicism go forward into the future. I truly believe it is a rogue nation of people infiltrating and damaging cultures and their people. It always has been and it always will be. Ask a native if the Catholic church is a loving, kind thing... If you can find one. If you think their good out weighs their evil then I invite you to investigate their destruction of native cultures and people. They used God to excuse rape, murder, and even genocide. If I had a dog that killed a kid, we would kill it out of fear in most instances. The Catholic church has been a mad dog for centuries and no one cares to catch it because they know it will kill them too. I don't excuse the child rapists the church hides, and I don't excuse the organization that hides them. It's rotten throughout and it's time to clear it away. Also tax them like a business, see if Jesus is love when they are forced to pay for birth control and heretics with their hard stolen money.",
            "title_similarity": "0.6818771",
            "sentiment_compound": -0.9921
        },
        {
            "id": "h24boa9",
            "score": 1,
            "text": "What I am reading is \n\nChurch = Cult and they strong arm you into paying protection money like the mob.",
            "title_similarity": "0.50211567",
            "sentiment_compound": 0.7003
        },
        {
            "id": "h24bvmu",
            "score": 1,
            "text": "WTF?!?!",
            "title_similarity": "0.065577134",
            "sentiment_compound": -0.695
        },
        {
            "id": "h24c794",
            "score": 1,
            "text": "So on one side the Pope is saying things against what some of them did, on the other side he’s happy to let such a kind person be thrown onto the streets..",
            "title_similarity": "0.2979646",
            "sentiment_compound": 0.7964
        },
        {
            "id": "h24cnea",
            "score": 1,
            "text": "She doesn’t need the Catholic Church, the Catholic Church needs her.",
            "title_similarity": "0.4721392",
            "sentiment_compound": 0.0
        },
        {
            "id": "h24cy7g",
            "score": 1,
            "text": "And those guys call themselves men of God...who are they fooling.",
            "title_similarity": "0.28565687",
            "sentiment_compound": -0.4019
        },
        {
            "id": "h24df8k",
            "score": 1,
            "text": "Is there a gofund me for her?",
            "title_similarity": "0.34395537",
            "sentiment_compound": 0.0
        },
        {
            "id": "h24dkoi",
            "score": 1,
            "text": "Catholic Church is such a terrible organization. This is systematic.",
            "title_similarity": "0.547649",
            "sentiment_compound": -0.4767
        },
        {
            "id": "h24eoch",
            "score": 1,
            "text": "Yet the church continues to demand separation of church and state so that they don’t have to pay taxes and continue to cover up their abuses",
            "title_similarity": "0.5962906",
            "sentiment_compound": -0.6705
        },
        {
            "id": "h24ffo0",
            "score": 1,
            "text": "The Vatican \n\nProtecting Pedeophiles, Pederasts, Rapists & Abusers ... \n\nJesus Christ will one day kick your ass for these sins.",
            "title_similarity": "0.6283792",
            "sentiment_compound": -0.9371
        },
        {
            "id": "h24fn27",
            "score": 1,
            "text": "They punished the Bishop equally harshly, right? . . . Right?",
            "title_similarity": "0.56687945",
            "sentiment_compound": -0.5204
        },
        {
            "id": "h24fwd3",
            "score": 2,
            "text": "How on Earth do people still follow religions? Every damn one of them is abusive. It’s ridiculous.\n\nThey are a cancer on humanity.",
            "title_similarity": "0.6352278",
            "sentiment_compound": -0.93
        },
        {
            "id": "h24fwix",
            "score": 1,
            "text": "ahhh churches, one of the most blatant scams humanity has come up with.",
            "title_similarity": "0.49497575",
            "sentiment_compound": -0.6222
        },
        {
            "id": "h24g2zg",
            "score": 1,
            "text": "There has got to be a list of genocidal dictators and mass murders who were not excommunicated.",
            "title_similarity": "0.43329376",
            "sentiment_compound": -0.6124
        },
        {
            "id": "h24gazm",
            "score": 1,
            "text": "**Organized religion:**  You have brought to light the negativity of our establishment by asking for justice. For this, you will be stripped of rank, fired (dismissed), and be made homeless.\n\n**Athiest everywhere:** And you wonder why we don't like you?",
            "title_similarity": "0.67708653",
            "sentiment_compound": -0.6818
        },
        {
            "id": "h24gbfn",
            "score": 2,
            "text": "Just another thing that proves that the church has nothing to do with the christian values.",
            "title_similarity": "0.47497872",
            "sentiment_compound": 0.4019
        },
        {
            "id": "h24gtw6",
            "score": 1,
            "text": "Stop the  catholic church! They are like the Mafia.",
            "title_similarity": "0.61948466",
            "sentiment_compound": 0.1511
        },
        {
            "id": "h24hj5r",
            "score": 2,
            "text": "Let’s all quit waiting for karma to help people out and let’s help stop what we’re all complaining about. Religion is a great thing, but as we see those who hold the highest religious power are corrupt. You all sit here online, and “hope things will get better for people” \n\nThe Catholic Church, Evangelicalism(the worst sect), Judaism, Christianity, Islam. \n\nWe all believe in the same god, whether u believe in a god or gods. We believe in the same thing.\n\nReligious power is what creates “sin”, corruption, capitalism, war, genocide. \n\nMoney isn’t the problem . Yea, religion in this country is tax evasion, and a scam. I left Christianity years ago. \n\nSTOP PUTTING FAITH IN POWERS YOU DONT SEE, and put it in yourself. That’s the real power and where the real secret to the world of love is. \n\nNOT RELIGION.",
            "title_similarity": "0.5348195",
            "sentiment_compound": 0.0387
        },
        {
            "id": "h24hmgh",
            "score": 1,
            "text": "Fucking Catholic church man, dismantle it and give it back to the people. \n\nYou can do the same with every other fascist hierarchy or cult.",
            "title_similarity": "0.605072",
            "sentiment_compound": -0.5574
        },
        {
            "id": "h24hvxh",
            "score": 1,
            "text": "God is held hostage in human churches, where we condemn and judge each other in its name while disregarding everything it stands for.  We impose our own flaws and biases and let this actual creation rage wildly upon each other.  Glad I escaped, and I can only hope for some kind of reckoning.  'God' needs to find itself, and people like Lucy are hopeful signs of change.",
            "title_similarity": "0.6422303",
            "sentiment_compound": 0.7717
        },
        {
            "id": "h24i34p",
            "score": 1,
            "text": "How can we help?",
            "title_similarity": "-0.050134204",
            "sentiment_compound": 0.4019
        },
        {
            "id": "h24i3mo",
            "score": 1,
            "text": "Funny how religion can 'belong' to an institution. It's almost like the worst people claim to be the most important.",
            "title_similarity": "0.5023546",
            "sentiment_compound": 0.3321
        },
        {
            "id": "h24i9mt",
            "score": 1,
            "text": "The Catholic Church is a crock of shit & totally unfit for purpose - although the purpose would be control & money generation so I guess it’s doing ok.",
            "title_similarity": "0.568901",
            "sentiment_compound": -0.5574
        },
        {
            "id": "h24ie6i",
            "score": 1,
            "text": "This is why religion is trash.",
            "title_similarity": "0.43012363",
            "sentiment_compound": 0.0
        },
        {
            "id": "h24iesr",
            "score": 1,
            "text": "If she dont like it she CaN GeT ouT!",
            "title_similarity": "0.26865548",
            "sentiment_compound": -0.3404
        },
        {
            "id": "h24in3e",
            "score": 1,
            "text": "Is it legal to let her go? Are nuns considered employee of the church and are does protected by law? From what i know it is illigal for a company to fire someone because they complained about sexual arrestment",
            "title_similarity": "0.770406",
            "sentiment_compound": -0.264
        },
        {
            "id": "h24iuc0",
            "score": 2,
            "text": "Organized religion is a sham.",
            "title_similarity": "0.4025864",
            "sentiment_compound": 0.0
        },
        {
            "id": "h24j7c6",
            "score": 2,
            "text": "Fuck the Catholic Church in its entirety. It’s a dying organization that isn’t likely to survive another century. Good riddance.",
            "title_similarity": "0.7239542",
            "sentiment_compound": -0.1531
        },
        {
            "id": "h24jb57",
            "score": 1,
            "text": "Stripped in more ways than one.",
            "title_similarity": "0.022146076",
            "sentiment_compound": 0.0
        },
        {
            "id": "h24jedc",
            "score": 2,
            "text": "I have no doubt that Sister Lucy never had a chance against a bishop from the Catholic Church. Sad.",
            "title_similarity": "0.72610146",
            "sentiment_compound": -0.4078
        },
        {
            "id": "h24jexa",
            "score": 1,
            "text": "Headline: Religion the Root of More Bad Shit Happening in the News",
            "title_similarity": "0.5245268",
            "sentiment_compound": -0.8258
        },
        {
            "id": "h24jq9a",
            "score": 1,
            "text": "Kicked out of Christianity lol",
            "title_similarity": "0.56028897",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h24k0o0",
            "score": 2,
            "text": "Is this a surprise!?! It’s a patriarchy!",
            "title_similarity": "0.15602078",
            "sentiment_compound": 0.4545
        },
        {
            "id": "h24k9xp",
            "score": 1,
            "text": "No hate like Christian love",
            "title_similarity": "0.34779286",
            "sentiment_compound": 0.7259
        },
        {
            "id": "h24kh71",
            "score": 1,
            "text": "Any redditor I see from now on essentially felating the pope because he says something about climate change or the poor should remember this. All the pious political platitudes sound great until it’s time for them to actually step up and do the right thing.",
            "title_similarity": "0.571936",
            "sentiment_compound": 0.25
        },
        {
            "id": "h24ksi3",
            "score": 1,
            "text": "Christianity became synonymous with paedophilia, greed and corruption!",
            "title_similarity": "0.46563634",
            "sentiment_compound": -0.4574
        },
        {
            "id": "h24l2bo",
            "score": 1,
            "text": "Good, fuck the church, and anyone else that thinks little boys buttholes are made for their amusement",
            "title_similarity": "0.51612514",
            "sentiment_compound": 0.2263
        },
        {
            "id": "h24l873",
            "score": 2,
            "text": "Fuck the Church",
            "title_similarity": "0.55985796",
            "sentiment_compound": -0.5423
        },
        {
            "id": "h24lu0s",
            "score": 2,
            "text": "Isn't the Catholic church rebranded version of the Roman army?",
            "title_similarity": "0.41138119",
            "sentiment_compound": 0.0
        },
        {
            "id": "h24lxw5",
            "score": 2,
            "text": "Wouldn’t want the church to do the right thing ever 🙄",
            "title_similarity": "0.5004035",
            "sentiment_compound": 0.0772
        },
        {
            "id": "h24mmo4",
            "score": 1,
            "text": "Dodgy catholic church at it again, are we surprised?",
            "title_similarity": "0.49397147",
            "sentiment_compound": 0.0
        },
        {
            "id": "h24mob0",
            "score": 1,
            "text": "I have thought for years the worst thing about religion is the church.",
            "title_similarity": "0.68824923",
            "sentiment_compound": -0.6249
        },
        {
            "id": "h24mqih",
            "score": 1,
            "text": "Grrrrrr aahhhhhhhh NOT ACCEPTABLE!!!!!!!!!!!",
            "title_similarity": "0.3173424",
            "sentiment_compound": -0.5679
        },
        {
            "id": "h24mz7y",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.25901917"
        },
        {
            "id": "h24n18w",
            "score": 1,
            "text": "If I was her I wouldn't leave. I'd make them bodily force me out and make sure it was filmed.",
            "title_similarity": "0.53669167",
            "sentiment_compound": 0.3502
        },
        {
            "id": "h24ncuk",
            "score": 1,
            "text": "Is there a petition? Or an email we can all spam?",
            "title_similarity": "0.36988008",
            "sentiment_compound": -0.4329
        },
        {
            "id": "h24nkfq",
            "score": 1,
            "text": "https://www.instagram.com/p/CQNENErB8Ey/?utm_medium=copy_link",
            "title_similarity": "0.2244353",
            "sentiment_compound": 0.0
        },
        {
            "id": "h24nluc",
            "score": 1,
            "text": "#gofundme",
            "title_similarity": "0.11553865",
            "sentiment_compound": 0.0
        },
        {
            "id": "h24nmv2",
            "score": 1,
            "text": "Sad she is being removed but, ultimately, she may be better off outside that male dominant perv club -- it should be shut down altogether.",
            "title_similarity": "0.6545023",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h24nydo",
            "score": 1,
            "text": "PM me! Happy to contribute to the fundraising. God bless-",
            "title_similarity": "0.067118965",
            "sentiment_compound": 0.8356
        },
        {
            "id": "h24nz5e",
            "score": 1,
            "text": "The wrong person got excommunicated.",
            "title_similarity": "0.51912796",
            "sentiment_compound": -0.4767
        },
        {
            "id": "h24o4ls",
            "score": 1,
            "text": "I guess God works in mysterious ways",
            "title_similarity": "0.15733024",
            "sentiment_compound": 0.2732
        },
        {
            "id": "h24od04",
            "score": 2,
            "text": "And this is why I left the Catholic Church",
            "title_similarity": "0.61555076",
            "sentiment_compound": 0.0
        },
        {
            "id": "h24or3p",
            "score": 2,
            "text": "Fuck organized religion. All it is is another vehicle for the powerful to fuck over the weak",
            "title_similarity": "0.5360681",
            "sentiment_compound": -0.7964
        },
        {
            "id": "h24pb8r",
            "score": 1,
            "text": "Classic Catholics…",
            "title_similarity": "0.15390387",
            "sentiment_compound": 0.0
        },
        {
            "id": "h24pt2o",
            "score": 1,
            "text": "I was raised Catholic. Stuff like this is why I'm still Christian (I identify as non-denominational), but definitely not Catholic. I still attend a Catholic church, only because our priest will openly criticize the way the church handles things and because they're super accepting and act a lot more like a non-denominational church, but I can't say I believe in what they (the institution of the Vatican) claims to stand for at all. This is outrageous, and it feels like a way for a bunch of really creepy old dudes to keep taking advantage of people... \n\n\nThen all we hear is officials saying, \"We're working on it.\" Oh? Are you? Have you fired all of the priests involved in stuff like this and thoroughly investigsted them? No? Doesn't sound like it's getting worked on to me then.",
            "title_similarity": "0.5799366",
            "sentiment_compound": 0.9142
        },
        {
            "id": "h24th79",
            "score": 1,
            "text": "God sure is great",
            "title_similarity": "-0.12672034",
            "sentiment_compound": 0.8176
        },
        {
            "id": "h24ub4k",
            "score": 1,
            "text": "She was lying?",
            "title_similarity": "0.2901286",
            "sentiment_compound": -0.5267
        },
        {
            "id": "h24w5pn",
            "score": 1,
            "text": "Shameful!",
            "title_similarity": "0.21111196",
            "sentiment_compound": -0.5411
        },
        {
            "id": "h25dua4",
            "score": 2,
            "text": ">she had been dismissed for reasons, including driving a vehicle, **writing and publishing poems**...\n\nFranciscan nuns can't write poetry?  I knew someone who majored in medieval french nun's poetry.  Yes, the world's most useless degree, I know.  But still.  Nun poetry is that major.",
            "title_similarity": "0.7031508",
            "sentiment_compound": -0.0507
        },
        {
            "id": "h25eg45",
            "score": 1,
            "text": "Sometimes we forget those that have power are just humans.",
            "title_similarity": "0.13355571",
            "sentiment_compound": -0.2263
        },
        {
            "id": "h25olc4",
            "score": 1,
            "text": "The Catholic Church don't need no bitches rocking the boat! /s",
            "title_similarity": "0.48076743",
            "sentiment_compound": -0.4367
        },
        {
            "id": "h25s8bz",
            "score": 1,
            "text": "Is there any way to write an e mail to the people in charge that did this to this women?",
            "title_similarity": "0.5281873",
            "sentiment_compound": 0.0
        },
        {
            "id": "h265bn2",
            "score": 2,
            "text": "This is exactly what Jesus would have done. Religion is a fucking joke.",
            "title_similarity": "0.4301954",
            "sentiment_compound": 0.3597
        },
        {
            "id": "h26dhvn",
            "score": 1,
            "text": "Clickbait. She was not expelled from the Catholic Church. She was expelled from the Franciscan Clarist Congregation, a Catholic religious order. She can still be Catholic. I’d say clickbait headline, but the Wire’s headline in the article linked was actually accurate, “Kerala: Sister Lucy, Who Protested Against Rape Accused Bishop, Ordered to Leave Convent”. It is this Reddit post that was inaccurate. My guess is that it was intended to be more inflammatory against the Catholic Church in an attempt to get more upvotes.",
            "title_similarity": "0.72130144",
            "sentiment_compound": -0.9007
        },
        {
            "id": "h26nw24",
            "score": 5,
            "text": "\"In October 2019, she was dismissed by the FCC on the grounds that she was “violating her vows as a nun through her lifestyle”. The FCC report had then said that she had been dismissed for reasons, including **driving a vehicle**, **writing and publishing poems**, and lending her support to the protests for the nun who had accused the Roman Catholic Bishop Mulakkal of **repeatedly raping and sexually assaulting her**.\"",
            "title_similarity": "0.8674964",
            "sentiment_compound": -0.8591
        },
        {
            "id": "h28kwfa",
            "score": 1,
            "text": "I heard she is proxy of the local modi party, who are trying to defame Christianity in Kerala province? \nIs this true?",
            "title_similarity": "0.60963",
            "sentiment_compound": 0.7438
        },
        {
            "id": "h2a2pg4",
            "score": 2,
            "text": "She wasn’t excommunicated she’s just not a nun anymore, huge difference",
            "title_similarity": "0.5026614",
            "sentiment_compound": 0.3182
        },
        {
            "id": "h2ujvsx",
            "score": 2,
            "text": "Shocker, who would have thought the Catholic Church was full of immoral, predator supporting, shit heads?",
            "title_similarity": "0.58601016",
            "sentiment_compound": -0.6486
        },
        {
            "id": "h3i37tu",
            "score": 2,
            "text": "Why not just move her to a new convent where no one knows what she did?",
            "title_similarity": "0.6438862",
            "sentiment_compound": -0.296
        },
        {
            "id": "h4a2jio",
            "score": 1,
            "text": "At least the rapist Brock Turner has a career path.",
            "title_similarity": "0.17764097",
            "sentiment_compound": -0.7096
        }
    ]
}