{
    "130 nations agree to support U.S. proposal for global minimum tax on corporations\n": [
        {
            "id": "h3pe1tn",
            "score": 41,
            "text": "[removed]",
            "title_similarity": "-0.02126519"
        },
        {
            "id": "h3pd8vi",
            "score": 62,
            "text": "Why do people think this will help? The price of goods will just rise accordingly. Why do people trust the government will do the right thing with the extra taxes? You are just taking from the elite to give to the elite with even more direct power lol...",
            "title_similarity": "0.5275965",
            "sentiment_compound": 0.8564
        },
        {
            "id": "h3pcfxd",
            "score": 33,
            "text": "Wait for the price of everything to go up",
            "title_similarity": "0.3390662",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3pi7y6",
            "score": 41,
            "text": "Congratulations, you're proposing to tax consumers...again.\n\n(hint: Corporations do not pay taxes)",
            "title_similarity": "0.5927948",
            "sentiment_compound": 0.6365
        },
        {
            "id": "h3pi842",
            "score": 2,
            "text": "That's all good but if it doesn't get ratified back at home because of Republicans in the Senate then it is meaningless.",
            "title_similarity": "0.38569304",
            "sentiment_compound": -0.5523
        },
        {
            "id": "h3pg97c",
            "score": 9,
            "text": "Let me guess: not the nations where many corps are headquartered.",
            "title_similarity": "0.26306415",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3pn3gi",
            "score": -1,
            "text": "The US has couped countries that dared to rise taxes on their corporations before, this, once more, is bullshit talking in the UN but nowhere near to be done.",
            "title_similarity": "0.50657487",
            "sentiment_compound": -0.3693
        },
        {
            "id": "h3pnyz7",
            "score": 9,
            "text": "[deleted]",
            "title_similarity": "0.0017693602"
        },
        {
            "id": "h3pbrum",
            "score": 0,
            "text": "It might be a good idea but how would this work? Which country would have the right to tax international corporations and in what proportion? Or would there be an international agency that would receive the taxes and then distribute them to each country depending on the profits or activity of the corporations in each one?",
            "title_similarity": "0.5968597",
            "sentiment_compound": 0.7461
        },
        {
            "id": "h3pnc6z",
            "score": 16,
            "text": "This is stupid. France and Germany aren’t exactly stellar in regards to tax issues. \n\nAnyone living in any of both countries knows how hard it is to open a business over here, and how much harder it is to maintain it due to all the excess regulations and taxes.\n\nAll this is going to achieve is that smaller businesses close, and bigger businesses will just take over the markets.\n\nTaxation in its current form is already inadequate. Enforcing this new proposal is adding fuel to the fire, and last but not least Olaf Scholz isn’t a paragon of virtue in regards to finances. Anyone watching his current tenure and following the wirecard case among other things will show clearly how all this is wrong.",
            "title_similarity": "0.3804626",
            "sentiment_compound": -0.2144
        },
        {
            "id": "h3pbods",
            "score": 12,
            "text": "\"US proposal for global minimum tax\"?\n\nThe US has been one of the largest opponents of a global minimum tax whenever European countries proposed it. What changed?",
            "title_similarity": "0.49800372",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3qh4sz",
            "score": 3,
            "text": "Taxes are theft and a global tax rate for companies is absolutely stupid",
            "title_similarity": "0.36584112",
            "sentiment_compound": -0.5709
        },
        {
            "id": "h3pg1d5",
            "score": 30,
            "text": "Soooo...a 15% markup on Apple products inbound.",
            "title_similarity": "0.58580935",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3pp2ez",
            "score": 10,
            "text": "Every nation loses in this race to the bottom of who can provide the lowest taxes to incentivize business.  The only winners are corporations.  I'm glad to see so many nations uniting against corporate abuse of the tax systems.",
            "title_similarity": "0.5708978",
            "sentiment_compound": -0.4588
        },
        {
            "id": "h3ps9uy",
            "score": 17,
            "text": "[deleted]",
            "title_similarity": "0.0017693602"
        },
        {
            "id": "h3plq03",
            "score": 22,
            "text": "The issue isn’t the rates but the fact that some nations like the USA want to tax all worldwide profits even for business done outside the USA \n\nIf they want to get rid of the tax havens they need to reform the taxation to tax only profits made in that nation",
            "title_similarity": "0.5835191",
            "sentiment_compound": 0.9161
        },
        {
            "id": "h3pit6t",
            "score": 0,
            "text": "We don’t make from war.  How else do we make it",
            "title_similarity": "0.17453885",
            "sentiment_compound": -0.5994
        },
        {
            "id": "h3qzmxg",
            "score": 3,
            "text": "The world is on a very dangerous path to socialism. Instead of racing to the bottom, here is an better solution: all countries abolish taxes on corporations and individuals, cut all benefits for welfare moochers.",
            "title_similarity": "0.49423403",
            "sentiment_compound": -0.1513
        },
        {
            "id": "h3rdaw5",
            "score": 2,
            "text": "What a terrible idea, less taxes are better people",
            "title_similarity": "0.12840338",
            "sentiment_compound": -0.1189
        },
        {
            "id": "h3pm6tc",
            "score": 6,
            "text": "I don’t know, but globalism never rubs me the right way",
            "title_similarity": "0.1889326",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3pglvt",
            "score": -1,
            "text": "Will the next president reverse it?",
            "title_similarity": "0.38514012",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3pn1gx",
            "score": -2,
            "text": "I don't think a minimum tax of 1$ will help much",
            "title_similarity": "0.28352892",
            "sentiment_compound": 0.4019
        },
        {
            "id": "h3pta1d",
            "score": 2,
            "text": "So, they will tax the corporations, check.\n\nAnd will anyone see a dime of it?  Nope.\n\n&#x200B;\n\nCongratulations you are just fueling the national debt.",
            "title_similarity": "0.70495653",
            "sentiment_compound": -0.6854
        },
        {
            "id": "h3p9ect",
            "score": 79,
            "text": "This will never work because Ireland will never go along with this because it is its main attraction.",
            "title_similarity": "0.06999354",
            "sentiment_compound": 0.4588
        },
        {
            "id": "h3pw9ne",
            "score": -4,
            "text": "How about taxing stock market earnings heavily? Shareholders are the real evil.",
            "title_similarity": "0.3464297",
            "sentiment_compound": -0.6597
        },
        {
            "id": "h3q26gp",
            "score": 4,
            "text": "this is a HORRIBLE idea.",
            "title_similarity": "-0.10694393",
            "sentiment_compound": -0.6408
        },
        {
            "id": "h3q3l2i",
            "score": -3,
            "text": "Only corrupt cunts would be against this.",
            "title_similarity": "0.18389194",
            "sentiment_compound": -0.5994
        },
        {
            "id": "h3q6z3w",
            "score": 0,
            "text": "This is price fixing on a global scale. I can't possibly support that.",
            "title_similarity": "0.35991266",
            "sentiment_compound": -0.3089
        },
        {
            "id": "h3qbvck",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "-0.02126519"
        },
        {
            "id": "h3qjmsr",
            "score": 2,
            "text": "Governments all agree to stifle free enterprise. Got it.",
            "title_similarity": "0.571353",
            "sentiment_compound": 0.7003
        },
        {
            "id": "h3qvesm",
            "score": 3,
            "text": "This is one of the stupidest decisions in history of human kind.",
            "title_similarity": "0.09847967",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3pddtp",
            "score": -11,
            "text": "[deleted]",
            "title_similarity": "0.0017693602"
        },
        {
            "id": "h3pko64",
            "score": 10,
            "text": "Welp Middle class it was nice knowing what's left of you 😂",
            "title_similarity": "0.1985957",
            "sentiment_compound": 0.6908
        },
        {
            "id": "h3pnbim",
            "score": 5,
            "text": "I am new to business and all so Correct me if am wrong. Isn’t this a bad for all the small and medium companies also don’t forget the start ups.  Usually startups need low  taxes and tax  breaks for some time period in my opinion and  how can small and medium companies survive ? Usually in order to Compete with big companies small companies tend to take less profit right so how can they survive? Especially businesses with sole ownership.",
            "title_similarity": "0.4251799",
            "sentiment_compound": -0.8102
        },
        {
            "id": "h3qf1jb",
            "score": 1,
            "text": "ITT: Unemployable Redditers believe that government is good and that corporations will magically start paying taxes.",
            "title_similarity": "0.62394816",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h3pi1xr",
            "score": -15,
            "text": "WALMART MADE 138 BILLION DOLLARS LAST YEAR \n\n69 BILLION WENT DIRECTLY TO PAYCHECKS \n\n62 BILLION WENT TO BUY THE CRAP THEY SELL YOU\n\n7 BILLION DOLLARS WENT TO KEEP THE LIGHTS ON AT THE STORE AND EVERYTHING ELSE\n\nTHAT LEAVES ZERO DOLLARS LEFT TO TAX\n\npeople see 138 Billion and say sure you can tax them more but what they don't understand is the profit margins are so close and so much of the money they make go to paying employees... then those employees pay taxes... many of them get refunds but many of them pay taxes... the rest goes to buy the stuff they sell and to take care of the business... \n\nin the end there is nothing left to tax\n\nso if you add a tax on a company who gets hurt?\n\nthe employees\n\nEMPLOYEES ARE THE BUSINESS AT EVERY BUSINESS\n\nwant to raise taxes on Businesses? you are going to hurt employees\n\nRun a business .. I have ... its fucking tough and sometimes i don't make enough to get a paycheck because of all the bullshit i have to deal with... and I am just a small company",
            "title_similarity": "0.55279195",
            "sentiment_compound": -0.9015
        },
        {
            "id": "h3qf6xk",
            "score": 0,
            "text": "Then tomorrow we are at war with a 130 nations .. happy 4th",
            "title_similarity": "0.62333465",
            "sentiment_compound": -0.0516
        },
        {
            "id": "h3qf7xk",
            "score": 0,
            "text": "Welp, we're fucked. Fight this with all your being!",
            "title_similarity": "0.079598695",
            "sentiment_compound": -0.807
        },
        {
            "id": "h3qfb9w",
            "score": 0,
            "text": "How is this good news?",
            "title_similarity": "0.091510914",
            "sentiment_compound": 0.5228
        },
        {
            "id": "h3qfumv",
            "score": 0,
            "text": "The government's of the world are far more corrupt and produce more waste.... this should not be supported",
            "title_similarity": "0.22872266",
            "sentiment_compound": -0.6193
        },
        {
            "id": "h3qid5v",
            "score": 0,
            "text": "[deleted]",
            "title_similarity": "0.0017693602"
        },
        {
            "id": "h3qmzsr",
            "score": 0,
            "text": "Complete waste of time. The rate of tax is irrelevant if they can avoid declaring any taxable income. \n\nMore needs to be done to close loopholes that are effectively impossible for small businesses to use (eg the \"double Irish\", \"dutch sandwich\" etc). Large businesses are being subsidized by the state at the expense of small ones by this system. It needs to change before everyone except Amazon is driven out of business.",
            "title_similarity": "0.40934846",
            "sentiment_compound": -0.1027
        },
        {
            "id": "h3r7kb8",
            "score": 0,
            "text": "All taxes should be eliminated and replaced with a flat consumption tax across all goods and services. You consume more you pay more. Stupid and overly complicated tax laws is what fuels corporate greed and tax havens.",
            "title_similarity": "0.5754074",
            "sentiment_compound": -0.7947
        },
        {
            "id": "h3ptom7",
            "score": 2,
            "text": "China won't, which makes it irrelevant as they're a large market and significant competitors to the US. All this could do is accelerate China increasing it's global power relative to the west. Which is fine, if you like authoritarian censorship of media and concentration camps for religious and ethnic minorities.",
            "title_similarity": "0.49697596",
            "sentiment_compound": 0.6249
        },
        {
            "id": "h3q0uns",
            "score": 30,
            "text": "As much as i would like this to work, sadly it won't. Not in the slightest.\n\nCorporations will simply shift the cost to product prices, like they always do, and ultimately, ordinary people will end up paying the cost, like it always was and always will be.\n\nTaxing corporations is a dead end, it makes for a nice election campaign slogan, and that's literally it.\n\nIf you want to take money away from corporations, tax them based on the wages of the lowest paid emplooyes. Make them pay less taxes the more they pay their workers.",
            "title_similarity": "0.48002765",
            "sentiment_compound": -0.2911
        },
        {
            "id": "h3pw1jx",
            "score": 5,
            "text": "Higher taxes = less new jobs\nHigher taxes = more responsibility for existing jobs\n\nBad idea",
            "title_similarity": "0.37284786",
            "sentiment_compound": -0.5423
        },
        {
            "id": "h3pz4w8",
            "score": 4,
            "text": "This is a tax on consumers. That’s who will pay in the end.",
            "title_similarity": "0.45798808",
            "sentiment_compound": -0.1027
        },
        {
            "id": "h3q0dct",
            "score": 7,
            "text": "America is at the heart of corporate tax evasion. Not as a haven, but a center for those corporations and wealthy who shape financial regulatory legislation by lobbying the US government. \n\nThe structure they have in place is intentionally full of holes. This will be an attempt to put on a good show, but also angle/leverage the structure globally to their benefit at the cost of their international competitors.",
            "title_similarity": "0.5774845",
            "sentiment_compound": 0.9224
        },
        {
            "id": "h3q1axg",
            "score": 10,
            "text": "Can they also talk about the ecclesiastical elephant in room?   We need to tax all church corporations and franchises.",
            "title_similarity": "0.5935105",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3pdktm",
            "score": -11,
            "text": "Why isn’t NY asking the question about Bezos tax returns, for example. It has been reported he paid no taxes for years, so why the infatuation with Trumps?  Oh let me guess!  Hatred and anger.",
            "title_similarity": "0.4683924",
            "sentiment_compound": -0.86
        },
        {
            "id": "h3pe7mo",
            "score": -10,
            "text": "Next there should be a global wage chart so that workers in various industries all over the world get paid the same base rate no matter what nation they are in.",
            "title_similarity": "0.64989936",
            "sentiment_compound": -0.0191
        },
        {
            "id": "h3pmhcy",
            "score": 3,
            "text": "Ugh stahppppppppp",
            "title_similarity": "0.12837237",
            "sentiment_compound": -0.4215
        },
        {
            "id": "h3pu559",
            "score": 4,
            "text": "They really should penalize the \"tax haven\" nations. Those small turds are the ones fucking it up for everyone.\n\nIncrease the import tax by many orders of magnitude to any companies based on tax haven countries.",
            "title_similarity": "0.5783223",
            "sentiment_compound": 0.3182
        },
        {
            "id": "h3qiqr9",
            "score": 2,
            "text": "We pushing for a one world government and global policies now? This won’t end well.",
            "title_similarity": "0.41831434",
            "sentiment_compound": 0.2732
        },
        {
            "id": "h3p2pg9",
            "score": 834,
            "text": "Good first step. Next is tax the rich more.",
            "title_similarity": "0.48359603",
            "sentiment_compound": 0.7579
        },
        {
            "id": "h3pt0jz",
            "score": 10,
            "text": "As long as shell companies are allowed to exist in tax havens, this won't matter. \n\nThe shell corp. \"owns\" the name and all equipment and they shuffle all profits back because on paper the company in let's say the US only claims to lease it all. \n\nSo companies call pull in billions of dollars in profit and claim that's the lease fees and not only pay $0 in taxes, but get government payouts.\n\nIt's a huge scam and this changes nothing.",
            "title_similarity": "0.5944127",
            "sentiment_compound": -0.023
        },
        {
            "id": "h3psh51",
            "score": 4,
            "text": "[removed]",
            "title_similarity": "-0.02126519"
        },
        {
            "id": "h3pe8pd",
            "score": -3,
            "text": "But not all nations.  If you cannot get all nations to sign on, the ultra-rich win.",
            "title_similarity": "0.46210328",
            "sentiment_compound": 0.7351
        },
        {
            "id": "h3psbbt",
            "score": 2,
            "text": "It’s hard to believe that a proposal to fill the coffers of bloated, corrupt bureaucracies would have so much global support amongst bloated, corrupt bureaucracies. This is truly an amazing day, one which we should all celebrate and cherish.",
            "title_similarity": "0.45702273",
            "sentiment_compound": 0.9389
        },
        {
            "id": "h3qjykv",
            "score": 3,
            "text": "I hope a day will come when reddit will cheer cutting spending instead of increased taxation by bloated and corrupt governments to feed bloated and corrupt governments.",
            "title_similarity": "0.44985163",
            "sentiment_compound": 0.7783
        },
        {
            "id": "h3pgk0j",
            "score": -1,
            "text": "This is fuct",
            "title_similarity": "0.0013195099",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3proc3",
            "score": -1,
            "text": "It's like we all know these organizations have everyone by the balls. Acknowledgment is the first step to improvement",
            "title_similarity": "0.4592774",
            "sentiment_compound": 0.6705
        },
        {
            "id": "h3pt4f8",
            "score": 1,
            "text": "Corporation tax is really not that useful of a tax. Sure it raises some money, but most companies reinvest most or all of their profits, meaning it doesn't count as taxable profit.",
            "title_similarity": "0.3676158",
            "sentiment_compound": 0.8184
        },
        {
            "id": "h3ptun0",
            "score": 1,
            "text": "If this were a bunch of corporations we would call this price fixing.",
            "title_similarity": "0.56166947",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3px6n6",
            "score": 1,
            "text": "Couple reasons not to count the chickens:\n\n* Financial and banking institutions are exempt, so this does fuck-all for most of the real issues of inequality in the world.\n\n* Ireland—money launderer for the world's largest tech companies—is one of the 60+ who are not on board.\n\n* There is not yet an agreed-upon rate, set of stipulations, penalties, or even a timeline.",
            "title_similarity": "0.4591512",
            "sentiment_compound": 0.1027
        },
        {
            "id": "h3q0gar",
            "score": 1,
            "text": "Its sounds like a wonderful ideas but really it is a way for the larger countries to strong arm smaller nations into getting them more control and money over private business. \n\nIreland went from not a great country to A prosperous one where the entire population benefitted because it had the opportunity to make its own tax policies and now we want to remove that option for all developing nations in Africa, central Asia, latin America and so on.  I hate tax dodging as much as anybody and not paying any tax is insane but really this isn’t the solution and it will affect the largest corporations the least and the average citizen and mid to small companies the most……",
            "title_similarity": "0.49395925",
            "sentiment_compound": 0.8081
        },
        {
            "id": "h3q3asg",
            "score": 1,
            "text": "Oh yay, time to destroy the world economy instead of just our own now.",
            "title_similarity": "0.36482042",
            "sentiment_compound": -0.0258
        },
        {
            "id": "h3qgh4i",
            "score": 1,
            "text": "Hmm I wonder who they will pass that added expense onto? 🤔",
            "title_similarity": "0.20085426",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3qjr4t",
            "score": 1,
            "text": "I don’t see that a minimum corporate tax is going to help anyone - the next president will just pull out the deal anyway. Also, international agreements don’t overtake the domestic right of the people to choose its own policies for itself.",
            "title_similarity": "0.42203143",
            "sentiment_compound": 0.5859
        },
        {
            "id": "h3qo67g",
            "score": -1,
            "text": "The global corporate tax rate should be zero, and replaced by a consumption tax. Taxes on corporate income are incredibly distortionary and lead to all sorts of loopholes which can actually decrease government revenue. This sounds like a move based on politics rather than what actually benefits the global economy.",
            "title_similarity": "0.4734439",
            "sentiment_compound": 0.6249
        },
        {
            "id": "h3qwadq",
            "score": -1,
            "text": "How about no. How about we create a non-territorial nation to pay a low tax rate to that'll offer us the same or better protection at a lower cost",
            "title_similarity": "0.39861453",
            "sentiment_compound": 0.0772
        },
        {
            "id": "h3rkndt",
            "score": -1,
            "text": "CNBC IS JUST PROPAGANDA CHANGE MY MIND",
            "title_similarity": "0.30089307",
            "sentiment_compound": -0.25
        },
        {
            "id": "h3rvc5k",
            "score": -1,
            "text": "Taxation is theft, and socio-economically destructive. I recommend that more corporations use cryptocurrencies like Bitcoin Cash (BCH) to hide their earnings from the slaver gangs that states are.",
            "title_similarity": "0.39426827",
            "sentiment_compound": -0.1779
        },
        {
            "id": "h3po51s",
            "score": 43,
            "text": "More accurate headline:  \"130 nations agree to tax everybody else because it won't impact *us*\"",
            "title_similarity": "0.63821495",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h3p4hca",
            "score": 16,
            "text": "How long until this takes effect?  We will see increased taxes on corporations soon?",
            "title_similarity": "0.63370943",
            "sentiment_compound": 0.3527
        },
        {
            "id": "h3phhgu",
            "score": 5,
            "text": "The US proposed this??",
            "title_similarity": "0.27205658",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3pzri1",
            "score": 5,
            "text": "Global Minimum Tax is just ridiculous",
            "title_similarity": "0.28875002",
            "sentiment_compound": -0.3612
        },
        {
            "id": "h3qgvor",
            "score": -5,
            "text": "You all sheeps thinking taxation brings social justice.\n\nSheeps under leash of politicians",
            "title_similarity": "0.44752258",
            "sentiment_compound": 0.5267
        },
        {
            "id": "h3pllj8",
            "score": 3,
            "text": "Great, life just needs to get more expensive...",
            "title_similarity": "0.21511725",
            "sentiment_compound": 0.6249
        },
        {
            "id": "h3pm4lj",
            "score": 1,
            "text": "Gonna need all the nations to contribute or else these people and companies will find places to park there money for tax avoidance.",
            "title_similarity": "0.55547243",
            "sentiment_compound": -0.4019
        },
        {
            "id": "h3py1xn",
            "score": 3,
            "text": "What a nonsense idea.",
            "title_similarity": "-0.09972666",
            "sentiment_compound": -0.4019
        },
        {
            "id": "h3qj21e",
            "score": 2,
            "text": "The 30+ plus nations that didn’t sign boutta see their corporate interest skyrocket lol",
            "title_similarity": "0.56632304",
            "sentiment_compound": 0.7003
        },
        {
            "id": "h3qj3qd",
            "score": 3,
            "text": "This is the fastest way to raise prices on goods that those corporations sell to the everyday layperson. By how much, I have no idea, but this is completely blind thinking that corporations are just going to roll over on this. They are just going to pass the cost to consumers. Figure out how much they owe in taxes, raise the cost of goods/services by that much for the next year. Wash, rinse, repeat.",
            "title_similarity": "0.62223434",
            "sentiment_compound": -0.6798
        },
        {
            "id": "h3qkztx",
            "score": 0,
            "text": "What about a global minimum wage of 20.00 hr?",
            "title_similarity": "0.5914013",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3qm4r8",
            "score": 4,
            "text": "Start taxing churches!!!! They have political sway and opinions, and benefit from\nGov money.",
            "title_similarity": "0.47211593",
            "sentiment_compound": 0.6331
        },
        {
            "id": "h3qre60",
            "score": 3,
            "text": "131 stupid bureaucrats that never produced a single cent of value in their lives.",
            "title_similarity": "0.25661623",
            "sentiment_compound": -0.25
        },
        {
            "id": "h3q1p7g",
            "score": 7,
            "text": "They need to properly tax the CEOs and top brass of said companies too.",
            "title_similarity": "0.5556804",
            "sentiment_compound": 0.2023
        },
        {
            "id": "h3pr71m",
            "score": 16,
            "text": "Which leaves about 65 that don't. So if this were to become a thing there would probably be about, let me check my math here... yep, about 65 countries seeing a lot of increased interest from corporations looking to relocate their corporate headquarters.",
            "title_similarity": "0.6085084",
            "sentiment_compound": 0.743
        },
        {
            "id": "h3qddnz",
            "score": 4,
            "text": "And guess who pays for that tax , the regular civilians through increased prices.  We all get poorer , the rich stay rich.",
            "title_similarity": "0.46831435",
            "sentiment_compound": 0.7783
        },
        {
            "id": "h3qkvi7",
            "score": 2,
            "text": "If this goes through it’s gonna be funny to see the quality of public serves not increase in the slightest.\n\n*hint*\n\nIt’s not the amount it’s how it’s spent..",
            "title_similarity": "0.16276471",
            "sentiment_compound": 0.2354
        },
        {
            "id": "h3r0ph8",
            "score": 4,
            "text": "Yeah so they can tax US corporations. They lookin at that green.\n\nAnd it only works one way. The US would not tax foreign based coMpanies, only US based companies would be taxed by other countries.",
            "title_similarity": "0.58233154",
            "sentiment_compound": 0.296
        },
        {
            "id": "h3qb6oe",
            "score": 6,
            "text": "Or we could just tax the megachurches and make billions. They're all scams anyway.",
            "title_similarity": "0.5044058",
            "sentiment_compound": -0.5859
        },
        {
            "id": "h3pj4ue",
            "score": 0,
            "text": "If i can get a permanent ban from writingprompts for mentioning 'the interest group society' then what can you be banned from intergalactic federations and empires and godhoods and your hopes and dreams for by the adjustment bureaus?",
            "title_similarity": "0.39643598",
            "sentiment_compound": 0.2263
        },
        {
            "id": "h3pjnxw",
            "score": 0,
            "text": "If financial services firms are exempt, why bother?",
            "title_similarity": "0.2925495",
            "sentiment_compound": -0.25
        },
        {
            "id": "h3pk399",
            "score": 0,
            "text": "This is great!",
            "title_similarity": "0.1095021",
            "sentiment_compound": 0.6588
        },
        {
            "id": "h3pm5gs",
            "score": 0,
            "text": "USA won’t impose tax on its wealthy but will on the World?",
            "title_similarity": "0.41037482",
            "sentiment_compound": 0.0387
        },
        {
            "id": "h3po493",
            "score": 0,
            "text": "None of this matters if these corporations can deduct their tax liability to zero like they already do.",
            "title_similarity": "0.44368994",
            "sentiment_compound": 0.2083
        },
        {
            "id": "h3po54l",
            "score": 0,
            "text": "Which still leaves plenty of nations for companies to dodge taxes through 🙄\n\nThis is a start though! Would be naive to think everyone would agree at first. From here, countries can really really pressure those who refuse to join",
            "title_similarity": "0.48423898",
            "sentiment_compound": -0.3946
        },
        {
            "id": "h3po85o",
            "score": 0,
            "text": "Start taxing on income not profits if you are using a tax haven country to shift expenses.",
            "title_similarity": "0.41741648",
            "sentiment_compound": -0.3412
        },
        {
            "id": "h3poa54",
            "score": 0,
            "text": "eli5 wont the corporations just go to someplace were this isnt there?",
            "title_similarity": "0.328944",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3poadl",
            "score": 0,
            "text": "15% minimum? That'll only get bargained down wtf",
            "title_similarity": "0.5038943",
            "sentiment_compound": -0.5859
        },
        {
            "id": "h3poozp",
            "score": 0,
            "text": "Does this mean amazon will start paying taxes?",
            "title_similarity": "0.5642127",
            "sentiment_compound": 0.1779
        },
        {
            "id": "h3prp0m",
            "score": 0,
            "text": "Sounds like corporations are getting a 6% tax cut.",
            "title_similarity": "0.49395156",
            "sentiment_compound": 0.1027
        },
        {
            "id": "h3prp6z",
            "score": 0,
            "text": "Except GB is missing out. Poor poor brexiteers.",
            "title_similarity": "0.122048676",
            "sentiment_compound": -0.8126
        },
        {
            "id": "h3prqzr",
            "score": 0,
            "text": "This law is reallocate more taxes to the rich countries.  For this to work, the rich country will need to be willing to allocate tax dollars to the tax havens or else the havens would see no benefit from this.",
            "title_similarity": "0.50705916",
            "sentiment_compound": 0.6927
        },
        {
            "id": "h3ps1k0",
            "score": 0,
            "text": "Would this mean no more tax havens for rich fucks?",
            "title_similarity": "0.44494045",
            "sentiment_compound": -0.1779
        },
        {
            "id": "h3ps8ya",
            "score": 5,
            "text": "Oh coool bet capital tax for us is going up huh 😏",
            "title_similarity": "0.46841645",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3pta6i",
            "score": 0,
            "text": "Good luck getting that through the senate",
            "title_similarity": "0.3285067",
            "sentiment_compound": 0.7096
        },
        {
            "id": "h3ptnlj",
            "score": 0,
            "text": "Yo this is actually extremely good news wtf?",
            "title_similarity": "0.24104041",
            "sentiment_compound": -0.2193
        },
        {
            "id": "h3pvlhg",
            "score": 0,
            "text": "Let's hope Sweden's onboard. Taxes are a nightmare here.",
            "title_similarity": "0.27792645",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h3pzi7c",
            "score": 0,
            "text": "How about just lower our cooperate taxes down to where they were, and maybe other countries will want to do business in our country...now we are  just running back to Ireland and asking to reopen factories because we don't want to pay our cooperate tax.",
            "title_similarity": "0.38426298",
            "sentiment_compound": -0.2086
        },
        {
            "id": "h3q1j8n",
            "score": 0,
            "text": "What? 130 nations agree to have more money? I need to sit down.",
            "title_similarity": "0.61177266",
            "sentiment_compound": 0.4329
        },
        {
            "id": "h3q1ulg",
            "score": 4,
            "text": "What kinda authoritarian bullshit?",
            "title_similarity": "0.019589646",
            "sentiment_compound": -0.5456
        },
        {
            "id": "h3q2d4l",
            "score": 0,
            "text": "Yup about time they did this!",
            "title_similarity": "0.21209064",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3q3mvd",
            "score": 3,
            "text": "I hate to be that guy, I live in the states…\nWhy does the United States have power over other countries tax laws? They should tell us to fuck off. \nI get the goal they are going for, trying to make the states more competitive on a global scale, but any county we tell to raise their taxes should just ignore us  and keep their most powerful manufacturing asset alive.",
            "title_similarity": "0.52834773",
            "sentiment_compound": 0.7738
        },
        {
            "id": "h3q3nfs",
            "score": 0,
            "text": "As long as I can still not pay taxes by having my Caribbean passport I don’t care what globohomo does.",
            "title_similarity": "0.35618222",
            "sentiment_compound": 0.5417
        },
        {
            "id": "h3q4miy",
            "score": 0,
            "text": "The illuminati won....",
            "title_similarity": "0.26120865",
            "sentiment_compound": 0.5719
        },
        {
            "id": "h3q5a5z",
            "score": 0,
            "text": "So Biden want to lower the corporate from 21 to 15% what a genius",
            "title_similarity": "0.60346127",
            "sentiment_compound": -0.1585
        },
        {
            "id": "h3q5hwo",
            "score": 0,
            "text": "There are so many morons on reddit.",
            "title_similarity": "0.21647158",
            "sentiment_compound": -0.3774
        },
        {
            "id": "h3q646x",
            "score": 0,
            "text": "130 nations politicians agree.  Not the people of 130 nations.",
            "title_similarity": "0.5631668",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h3q68d3",
            "score": 0,
            "text": "So is the USA going to lower its corporate tax by 50% to compete with this minimum tax? Otherwise this seems pointless",
            "title_similarity": "0.5339606",
            "sentiment_compound": -0.296
        },
        {
            "id": "h3q6w24",
            "score": 0,
            "text": "This is great.",
            "title_similarity": "0.084597476",
            "sentiment_compound": 0.6249
        },
        {
            "id": "h3q96p0",
            "score": 0,
            "text": "Daaamn, the US altruism unleashed, saving the world yet again...",
            "title_similarity": "0.41261548",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3qaa2q",
            "score": 0,
            "text": "And of course leftists 100% believe that all that extra tax revenue will go to a productive and righteous cause.",
            "title_similarity": "0.60078955",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3qaj54",
            "score": 0,
            "text": "corporations dont pay taxes...they pas on the expense to the consumer....",
            "title_similarity": "0.4125348",
            "sentiment_compound": 0.0762
        },
        {
            "id": "h3qbev5",
            "score": 0,
            "text": "It’s just going to be passed on to consumer . We’re all going to get fucked out of this deal if it goes through. Plus that’s one more step closer to losing our sovereignty as a nation",
            "title_similarity": "0.32673037",
            "sentiment_compound": -0.7906
        },
        {
            "id": "h3qbgao",
            "score": 0,
            "text": "Corporations are pirates.",
            "title_similarity": "0.35814562",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3qbkho",
            "score": 0,
            "text": "All these companies will be moving their fake headquarters to some country you haver never heard.",
            "title_similarity": "0.42863443",
            "sentiment_compound": -0.4767
        },
        {
            "id": "h3qbxjz",
            "score": 0,
            "text": "How about churches",
            "title_similarity": "0.251348",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3qc31j",
            "score": 0,
            "text": "Now that’s global leadership",
            "title_similarity": "0.35883203",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3qc4c0",
            "score": 0,
            "text": "Fuck yessss, tax code is so broken and this is a step in the right direction!",
            "title_similarity": "0.34532127",
            "sentiment_compound": -0.8309
        },
        {
            "id": "h3qc8vt",
            "score": 0,
            "text": "What happened to letting nations run the way the people want them to run?",
            "title_similarity": "0.2837159",
            "sentiment_compound": 0.0772
        },
        {
            "id": "h3qdjv2",
            "score": 0,
            "text": "Normally, places compete with each other. \"They charge 15%? We'll do 14%! Oh yeah? We'll do 10% and throw in free shipping!\" It helps keep the prices low. When the entities involved come to agreement for a minimum price to keep prices high, that's called price fixing, a form of collusion. It's super illegal for the people who aren't the hypocrites making the laws.",
            "title_similarity": "0.5709884",
            "sentiment_compound": 0.8871
        },
        {
            "id": "h3qexru",
            "score": 0,
            "text": "of course they do, they’ll now benefit from the work of other nations.",
            "title_similarity": "0.3283211",
            "sentiment_compound": 0.4588
        },
        {
            "id": "h3qffyu",
            "score": 0,
            "text": "I'm not really all that political, but this feels like a ploy. I can't help but imagine this playing out with a ton of smaller companies getting taxed into oblivion while Amazon and other megacorporations take it on the chin - only to be made up later by the merit of them being the only places left to shop.",
            "title_similarity": "0.45801046",
            "sentiment_compound": 0.8231
        },
        {
            "id": "h3qh50b",
            "score": 0,
            "text": "Do I need to explain the difference between state and nation?",
            "title_similarity": "0.2599306",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3ql85u",
            "score": 0,
            "text": "Yes!",
            "title_similarity": "0.09611613",
            "sentiment_compound": 0.4574
        },
        {
            "id": "h3qlowe",
            "score": 0,
            "text": "Corporations or *large* corporations?",
            "title_similarity": "0.53031194",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3qmch4",
            "score": 0,
            "text": "There are 195 recognized nations and 130 want a minimum tax. Oh Boy I bet the other 65 are the ones that aren’t making the mega corps pay taxes and will continue to not do so.\n\nCan we actually get some news that isn’t a fucking joke?",
            "title_similarity": "0.6284125",
            "sentiment_compound": 0.3384
        },
        {
            "id": "h3qnhih",
            "score": 0,
            "text": "Thats what im talking about.",
            "title_similarity": "0.06327651",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3qnoic",
            "score": 0,
            "text": "Tax churches also.",
            "title_similarity": "0.3193433",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3qnuwa",
            "score": 0,
            "text": "Hopefully they have a way to enforce this properly.",
            "title_similarity": "0.09575122",
            "sentiment_compound": 0.4019
        },
        {
            "id": "h3qo8v9",
            "score": 0,
            "text": "Lol nice theater. To bad nothing will come of it.",
            "title_similarity": "0.13082904",
            "sentiment_compound": 0.2732
        },
        {
            "id": "h3qojn5",
            "score": 0,
            "text": "It's a start.",
            "title_similarity": "0.122735664",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3qp3th",
            "score": 0,
            "text": "Just finished reading The Panama Papers..you know how it do",
            "title_similarity": "0.41318786",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3qqv1s",
            "score": 0,
            "text": "It's either this or war on tax havens.",
            "title_similarity": "0.41708684",
            "sentiment_compound": -0.5994
        },
        {
            "id": "h3qr04y",
            "score": 0,
            "text": "Anyone who doesn’t play along should face sanctions from the others.",
            "title_similarity": "0.07570051",
            "sentiment_compound": 0.34
        },
        {
            "id": "h3qsx2k",
            "score": 0,
            "text": "Let's spread tyranny to every other country while we increase it at home lol",
            "title_similarity": "0.4751143",
            "sentiment_compound": 0.6249
        },
        {
            "id": "h3qum1y",
            "score": 0,
            "text": "F that, they should be paying more in taxes and people paying much less in taxes. There’s no such thing as trickle down. F reagan.",
            "title_similarity": "0.47328657",
            "sentiment_compound": -0.296
        },
        {
            "id": "h3qvjy8",
            "score": 0,
            "text": "Don’t forget Churches",
            "title_similarity": "0.20201044",
            "sentiment_compound": -0.2263
        },
        {
            "id": "h3r3ux6",
            "score": 0,
            "text": "This should also be be paired with sanctions on countries that don’t adopt the global minimum tax",
            "title_similarity": "0.41864187",
            "sentiment_compound": 0.1779
        },
        {
            "id": "h3r4n07",
            "score": 0,
            "text": "I’ll get excited about that when it actually happens",
            "title_similarity": "0.21245135",
            "sentiment_compound": 0.34
        },
        {
            "id": "h3r50kl",
            "score": 0,
            "text": "Well maybe the government shouldn’t have spent all our money on WAR, they have shown that they are not responsible with it and I will not support anything that gives the government more money",
            "title_similarity": "0.3204258",
            "sentiment_compound": -0.7752
        },
        {
            "id": "h3r7fb9",
            "score": 0,
            "text": "Hope those taxes get used to provide a proper social safety net for the citizens. Else unhappiness may lead to violent conflicts or even a revolution. Obviously, the powers that be might see some sense in avoiding such a situation.",
            "title_similarity": "0.2684172",
            "sentiment_compound": -0.765
        },
        {
            "id": "h3r8lty",
            "score": 0,
            "text": "Oh we are so fucked as a species",
            "title_similarity": "0.09488354",
            "sentiment_compound": -0.7661
        },
        {
            "id": "h3r9ahq",
            "score": 0,
            "text": "You can only tax people not business.\n\nhttps://youtu.be/xNc-xhH8kkk?t=2087",
            "title_similarity": "0.4303701",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3r9wde",
            "score": 0,
            "text": "I thought this was already a damn thing my whole life and it’s barely happening now??",
            "title_similarity": "0.33114755",
            "sentiment_compound": -0.4696
        },
        {
            "id": "h3rc30a",
            "score": 0,
            "text": "Who is John Galt?",
            "title_similarity": "0.17541113",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3rdesc",
            "score": 0,
            "text": "Yes this needs to happen, these companies have the headquarters in the us hire us employees take us government tax breaks, use public resources that we pay taxes for and the give the tax money to some island nation in the middle of the ocean",
            "title_similarity": "0.6456322",
            "sentiment_compound": 0.3182
        },
        {
            "id": "h3rgu3q",
            "score": 0,
            "text": "The push to raise taxes on the wealthy does nothing but cause the wealthy to pass their costs on to the poor and middle class.",
            "title_similarity": "0.5126779",
            "sentiment_compound": -0.0387
        },
        {
            "id": "h3rhfyr",
            "score": 0,
            "text": "Of course they do. Wouldn’t you want to get more money. People are blind thinking that somehow corporations paying more money to the governments is a good thing. How do you expect those corporations will make up for the losses. They will pass the cost onto us the consumer. So we will essentially be paying more taxes. And the benefit goes to the governments. I personally think the US government is wildly inefficient and a poor steward of the money (our value). Maybe other governments are better. I would like to see a major overhaul of our government spending and accountability. When I read about trillions of dollars of our value going unaccounted for in the DOD it’s unacceptable. When I see billions wasted on a half assed ethnocentric border wall it’s disheartening. That’s my hard earned money. Money that could have gone to strengthening my families financial future, their life experiences or joy. We already give our government 30 to 40% of our value and I don’t believe we have much to show for it. I definitely do not think the answer is to give them more money. It’s funny that you don’t see them getting signatures on finding ways to limit profit or CEO salary discrepancy or forcing profit sharing, but they are happy to pass around a petition to get paid more in taxes. Please don’t support this. Let’s keep working to find a peaceful way to claim our value back and force the governments and corporations to treat us fairly. Our ancestors had to physically fight for it. Maybe we will win the battle through technologies like Bitcoin.",
            "title_similarity": "0.55450946",
            "sentiment_compound": 0.9876
        },
        {
            "id": "h3rllet",
            "score": 0,
            "text": "Good start but will be tough convincing any place that is already a tax haven",
            "title_similarity": "0.35522455",
            "sentiment_compound": 0.5789
        },
        {
            "id": "h3ropnc",
            "score": 0,
            "text": "CAN WE PLEASE JUST GET A CARBON TAX LIKE COME ON",
            "title_similarity": "0.5673198",
            "sentiment_compound": 0.5859
        },
        {
            "id": "h3rpoup",
            "score": 0,
            "text": "Taxation is theft.",
            "title_similarity": "0.14440352",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3rw88d",
            "score": 0,
            "text": "It should be global minimum starting from at least 30%",
            "title_similarity": "0.40009946",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3s5z6k",
            "score": 0,
            "text": "CNBC as a news source……ok",
            "title_similarity": "0.438128",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3sgq4x",
            "score": 0,
            "text": "Being as it limits the min\ntax to only companies that have a \"pre-tax profit margin above 10%\"\nI foresee every company having at most a 9.99% profit margin",
            "title_similarity": "0.6512083",
            "sentiment_compound": 0.7239
        },
        {
            "id": "h3sh9m6",
            "score": 0,
            "text": " Nice let's start with CNBC the lying bastards",
            "title_similarity": "0.37093222",
            "sentiment_compound": -0.6808
        },
        {
            "id": "h3siz4f",
            "score": 0,
            "text": "Ireland will never go for this.  Most corporations are domiciled there for tax reasons.  \nI say don't tax corporations at all.  Tax the owners on their profits instead.  Same thing but avoids tax shelters",
            "title_similarity": "0.4536842",
            "sentiment_compound": -0.0258
        },
        {
            "id": "h3sjuhg",
            "score": 0,
            "text": "a step in the right direction\n\nnow look in it for loopholes big enough to drive a truck throught, inevitably endorsed by the republicans",
            "title_similarity": "0.46970087",
            "sentiment_compound": 0.25
        },
        {
            "id": "h3sjv3r",
            "score": 0,
            "text": "Can't they just the same taxes as everyone? No more and no less? Problem solved",
            "title_similarity": "0.5805361",
            "sentiment_compound": -0.3075
        },
        {
            "id": "h3slhkm",
            "score": 0,
            "text": "All the countries that arent tax havens.",
            "title_similarity": "0.43401474",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3sm57y",
            "score": 0,
            "text": "Won't work on Amazon though. They paid lawyers on lawyers with money they saved on not paying taxes by finding every loophole in the system to continue not paying taxes.",
            "title_similarity": "0.38169354",
            "sentiment_compound": 0.3142
        },
        {
            "id": "h3smrg9",
            "score": 0,
            "text": "I can just hear the trololol guy singing as all the loopholes make this pointless",
            "title_similarity": "0.1332646",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3sq4h5",
            "score": 0,
            "text": "They are lying to you, because this is all they know, masters of dark deception!",
            "title_similarity": "0.05815837",
            "sentiment_compound": -0.7644
        },
        {
            "id": "h3stetu",
            "score": 0,
            "text": "Same shit everyday. What is the purpose of this exactly? 130 countries that probably have a much higher corporate tax already agreeing on making 15% a minimum. Meanwhile Cayman & co are laughing their asses off. Effectively 0 change.",
            "title_similarity": "0.7151973",
            "sentiment_compound": 0.5994
        },
        {
            "id": "h3sxvzp",
            "score": 0,
            "text": "If a coffee shop owner proposes to raise prices on coffee to all other shops, that would be conspiring to manipulate prices. If government goes out and gets another 130 countries to increase taxes - that’s a great policy. Okay, thanks for clarifying how this system works.",
            "title_similarity": "0.68136",
            "sentiment_compound": 0.8807
        },
        {
            "id": "h3t8nau",
            "score": 0,
            "text": "I don't care that they support it. Just make it happen.",
            "title_similarity": "0.20678473",
            "sentiment_compound": 0.0186
        },
        {
            "id": "h3tdqq4",
            "score": 0,
            "text": "Fuck that shit. France and England and Germany and whomever else did not have sway over American owned businesses.",
            "title_similarity": "0.27402014",
            "sentiment_compound": -0.7964
        },
        {
            "id": "h3uzsac",
            "score": 0,
            "text": "No, they would only be taxing profit made from business in their own country. In principle, it's not not any different than what is already done today in many countries.",
            "title_similarity": "0.46021593",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h3v6gks",
            "score": 0,
            "text": "How  about a global maximum? Nah never that, greed is infinite",
            "title_similarity": "0.4043792",
            "sentiment_compound": 0.2163
        },
        {
            "id": "h5pb3kk",
            "score": 0,
            "text": "WORLD MARXISM! TRUMP 2024!",
            "title_similarity": "0.5361795",
            "sentiment_compound": 0.0
        },
        {
            "id": "h68p0t8",
            "score": 0,
            "text": "Whe  has the government EVER made consistently good decisions??? NEVER!!! They will spend this money like fuck holes and the people who need it won't see shit... like usual... wake up pepes",
            "title_similarity": "0.41894013",
            "sentiment_compound": 0.6286
        },
        {
            "id": "h6fj45u",
            "score": 0,
            "text": "More communist BS.  Taxing doesn't solve a problem.  Remember the little tea party they had in Boston?  Keep it up globalist......",
            "title_similarity": "0.4372201",
            "sentiment_compound": 0.4745
        },
        {
            "id": "h3pvjs5",
            "score": 9,
            "text": "So, 196 nations - 130 = only 66 potential tax haven countries now?\n\nWin, I guess?",
            "title_similarity": "0.6600272",
            "sentiment_compound": 0.6322
        },
        {
            "id": "h3qp89o",
            "score": 8,
            "text": "> “Foreign policy for the middle class” aims to ensure that globalization, trade, human rights and military might are all harnessed for the benefit of working Americans, not solely for billionaires and multinational corporations, but not for abstract ideological reasons either.\n\nWait...is a *news* article implying that military and free trade have benefited primarily corporations and the super wealthy as fact and not an opinion?",
            "title_similarity": "0.5990306",
            "sentiment_compound": 0.9505
        },
        {
            "id": "h3pvgew",
            "score": 6,
            "text": "It might just be me, but I don’t feel like the US should be the ones we are following when it comes to doing the right thing.",
            "title_similarity": "0.059436534",
            "sentiment_compound": 0.5023
        },
        {
            "id": "h3pwerp",
            "score": 4,
            "text": "And so yet another domino in the economic downfall sequence is placed",
            "title_similarity": "0.30922675",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3puepe",
            "score": 7,
            "text": "Or you know they can make it a law that they have to pay taxes on any and all profits made within the United states with absolutely no exemptions allowed aside from maybe paying their employees a decent wage, assuming they havent already outsourced everything to a country where they can legally pay them almost nothing.",
            "title_similarity": "0.6140194",
            "sentiment_compound": 0.4228
        },
        {
            "id": "h3q70lc",
            "score": 63,
            "text": "ITT: People who know embarrassingly little about anything having equally embarrassingly strong opinions.",
            "title_similarity": "0.067962125",
            "sentiment_compound": -0.2732
        },
        {
            "id": "h3pfvko",
            "score": -1,
            "text": "Wonder what the tax haven counties like the Bahamas, Ireland think about this",
            "title_similarity": "0.39854348",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h3pn3g4",
            "score": -1,
            "text": "Please make it high, and then use the tax money to fund things like sources of energy that don't destroy the climate, which currently is being destroyed. Those types of energy exist, and could easily be profitable too, but we have this problem as humans of becoming stuck in certain ways. Especially in the political-scape of fossil fuels, which we no longer truly NEED at all.",
            "title_similarity": "0.48420748",
            "sentiment_compound": -0.6087
        },
        {
            "id": "h3pnbkd",
            "score": -1,
            "text": "I can only assume that the countries that don't join will eventually have to circum to forces from the ones that do. Ireland doesn't want to join? Ok, all companies based in Ireland get a tax specific to them. The ones that are just normal businesses aka not tax avoidance schemes that do international trade will pressure the government to change course. \n\nOr, it is so profitable for the government that they just reimburse the other businesses because because Ireland becomes the English speaking tax haven of the world.",
            "title_similarity": "0.5386106",
            "sentiment_compound": 0.2026
        },
        {
            "id": "h3po9xu",
            "score": -1,
            "text": "Yah, whose gonna be doing the oversight in China?\n\nThe Chinese Commie Party?",
            "title_similarity": "0.51310545",
            "sentiment_compound": 0.4696
        },
        {
            "id": "h3potat",
            "score": 1,
            "text": "Oh no! It's the One World Government we were told to fear by corporate news for some totally legitimate not \"they'll make us pay taxes\" reason.",
            "title_similarity": "0.54526126",
            "sentiment_compound": -0.5983
        },
        {
            "id": "h3ppc60",
            "score": -1,
            "text": "I'm surprised an initiative for an actually decent global change came from the US. Rather than the toxic nationalism or blatant imperialism we got accustomed to. I hope the US can do more like this.",
            "title_similarity": "0.39405066",
            "sentiment_compound": 0.7645
        },
        {
            "id": "h3psbew",
            "score": 1,
            "text": "Does any of it matter once Mitch McConnell decides it isn’t in his donors’ best interest?",
            "title_similarity": "0.25341636",
            "sentiment_compound": 0.8074
        },
        {
            "id": "h3psbjc",
            "score": 1,
            "text": "#Biden still hasn’t done anything LOL!",
            "title_similarity": "0.04046783",
            "sentiment_compound": 0.5893
        },
        {
            "id": "h3ptlra",
            "score": 1,
            "text": "A minimum tax sounds to me like the sort of thing that will disproportionately harm small businesses.",
            "title_similarity": "0.32299632",
            "sentiment_compound": -0.25
        },
        {
            "id": "h3purbf",
            "score": 1,
            "text": "BROOOO POGGERS. THIS YELLEN LADY IS AMAZING!!!",
            "title_similarity": "0.18257095",
            "sentiment_compound": 0.6884
        },
        {
            "id": "h3pv8ia",
            "score": 1,
            "text": "This is a really good thing. Its really about damn time. Lets hope republicans dont get in and lower it to an absolute pointless level.",
            "title_similarity": "0.31137592",
            "sentiment_compound": 0.2298
        },
        {
            "id": "h3pvgab",
            "score": 1,
            "text": "And the rest of the nations will suddenly see more corporate offices opened up in their borders.",
            "title_similarity": "0.55617106",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3pvmdb",
            "score": -1,
            "text": "Good bye more jobs, this is more incentive to move out of the us, this administration is just destroying our country at an alarming rate, it's unbelievable",
            "title_similarity": "0.3614764",
            "sentiment_compound": 0.3384
        },
        {
            "id": "h3pvn8u",
            "score": -1,
            "text": "Raising corporate taxes on a domestic level is bad enough, but putting a mandatory international floor on them is even worse.",
            "title_similarity": "0.3899597",
            "sentiment_compound": -0.714
        },
        {
            "id": "h3px35e",
            "score": -1,
            "text": "Corporate tax should be zero",
            "title_similarity": "0.42719716",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3py5vv",
            "score": 1,
            "text": "Except the Irish. Of course except the Irish. They've made a fortune out of it.",
            "title_similarity": "0.39410877",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3py774",
            "score": -1,
            "text": "God bless everyone Jesus loves you and died for everyone",
            "title_similarity": "0.3606625",
            "sentiment_compound": 0.6124
        },
        {
            "id": "h3pyaoo",
            "score": 1,
            "text": "Some day some dictator will offer his entire population as slave labor in return for arms and training.  And the worlds corporations will beat a path to his door.",
            "title_similarity": "0.51839167",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3pyjiu",
            "score": 1,
            "text": "This would be great until it gets set at a tax rate of 5% with hundreds of different loopholes and exemptions because the decision-making world is made up of spineless bastards",
            "title_similarity": "0.41578764",
            "sentiment_compound": 0.0258
        },
        {
            "id": "h3pzdyw",
            "score": 1,
            "text": "No thanks\n\n\nIt's a half good idea, but when some countries proposed tk make it even more water tight against corporations the US denied. Because if it is made watertight then the US doesn't benefit from it\n\nThis whole taxation greatly benefits the US and will strengthen their economic structure at the cost of smaller nations\n\nShould corporations be taxed more than they are and at a level amount to ensure there is no perversion of capitalistic systems? Yes. Is this the way to do it? No. Is the only reason the US proposed this strategy due to economically ulterior motives? Yes",
            "title_similarity": "0.44779176",
            "sentiment_compound": 0.9253
        },
        {
            "id": "h3pzr3u",
            "score": 1,
            "text": "This can't be real. Something like this coming from the US ? The land where corporations control everything and squeeze as much as they can out of USA citizens ? Where the lobbies are the most powerful entities ever ? Really hard to believe.",
            "title_similarity": "0.5438099",
            "sentiment_compound": 0.6641
        },
        {
            "id": "h3pzv5v",
            "score": 1,
            "text": "Can't governments just give these super rich dudes like an IOU and just use their money if they aren't using it?\n\nOf course, you include in your proposal their official \"I Won Capitalism\" Certificate and non-biodegradable tote bag",
            "title_similarity": "0.6427665",
            "sentiment_compound": 0.9445
        },
        {
            "id": "h3q0f9d",
            "score": 1,
            "text": "Sure US, sure.",
            "title_similarity": "0.115298964",
            "sentiment_compound": 0.5574
        },
        {
            "id": "h3q0fd6",
            "score": -1,
            "text": "So it's collusion when a group of companies set minimum prices for goods and they are prosecuted for it. However, when the governments collude it is completely okay and encouraged. Fucking useless leaches. How can people be supportive of this shit.",
            "title_similarity": "0.45586067",
            "sentiment_compound": -0.483
        },
        {
            "id": "h3q0joi",
            "score": -1,
            "text": "Shareholders already pay income tax. \n\nNot a single one can avoid it if they live in the United States. \n\nCompanies should not be double taxed.",
            "title_similarity": "0.61992925",
            "sentiment_compound": 0.0516
        },
        {
            "id": "h3q0p1i",
            "score": -1,
            "text": "Lol, what a horrible idea.",
            "title_similarity": "-0.07019496",
            "sentiment_compound": -0.1779
        },
        {
            "id": "h3q0u6y",
            "score": 1,
            "text": "till they all move to the country without the minimum. or a president gets into office in America and torches it on their end.",
            "title_similarity": "0.55528605",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3q19kb",
            "score": 1,
            "text": "The rich and corporations run the US, not the people. Slim changes this has of actually happening.",
            "title_similarity": "0.48173326",
            "sentiment_compound": 0.5574
        },
        {
            "id": "h3q1akc",
            "score": 1,
            "text": "If all the taxes are equal then corporations will go where the stability is and where the cheap labor is. So the US and China would come out on top. \n\nThere must be a component of tax sharing included somewhere. Meaning taxes collected in the US and China markets would be redistributed to places like Myanmar and Ethiopia.",
            "title_similarity": "0.6547275",
            "sentiment_compound": 0.7269
        },
        {
            "id": "h3q1u9q",
            "score": 1,
            "text": "Hm. This reads like a headline from bloody 50 years ago. Nice to see the country I was born in actually getting some international traction again after the absolute *mockery* of leadership and policy the past few years.",
            "title_similarity": "0.49783385",
            "sentiment_compound": 0.0258
        },
        {
            "id": "h3q1xii",
            "score": 1,
            "text": "Who doesn't want less money?",
            "title_similarity": "0.0186303",
            "sentiment_compound": -0.0572
        },
        {
            "id": "h3q220n",
            "score": 1,
            "text": "I doubt the “minimum” will actually be enough. But it’s a good step",
            "title_similarity": "0.06405954",
            "sentiment_compound": 0.4767
        },
        {
            "id": "h3q3idj",
            "score": 1,
            "text": "Expect price hikes and layoffs.",
            "title_similarity": "0.34154958",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3q4pw7",
            "score": -1,
            "text": "Global authoritarianism. Loopholes will ensure they pay no tax minimum anyways.",
            "title_similarity": "0.4771486",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3q4w9d",
            "score": 1,
            "text": "So prices will only increase more for the standard consumer?",
            "title_similarity": "0.41291964",
            "sentiment_compound": 0.3182
        },
        {
            "id": "h3q5443",
            "score": -1,
            "text": "Tax is theft.",
            "title_similarity": "0.18635738",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3q5823",
            "score": -1,
            "text": "These agreements make it easier for other nations to tax American corporations. The income limit is essentially built so as to only capture American corporations. It creates an essential tariff for selling goods in other countries.\n\nAlso, this base tax still leaves the US with a much higher rate, and all it takes are nations that don’t cooperate to further screw us by being tax havens. \n\nWay to go Biden, eroding American tax base for short sided policies that people with no understanding of taxes can feel good about. But hey, Europe will get more cash at the expense of America",
            "title_similarity": "0.5440098",
            "sentiment_compound": 0.4854
        },
        {
            "id": "h3q5qsu",
            "score": 1,
            "text": "Do you people not understand that whatever you tax in corporation goes directly into the price of the goods or services they sell? All this does is raise prices from every corporation that is taxed. They certainly aren't going to lower their profit.",
            "title_similarity": "0.57678664",
            "sentiment_compound": 0.7342
        },
        {
            "id": "h3q5wq6",
            "score": -1,
            "text": "Here is a crazy idea, Why not just abolish corporate tax, and only tax the revenue when it's payed out to shareholders/executives/other employees/....",
            "title_similarity": "0.5656607",
            "sentiment_compound": -0.34
        },
        {
            "id": "h3q6qgh",
            "score": 1,
            "text": "Or those business will show less profits by reinvesting in their corporations, making them even bigger.  Maybe they’ll pay higher wages in addition to growing their business to show less profit.  This will surely wipe out smaller business that already have low profits.",
            "title_similarity": "0.38450134",
            "sentiment_compound": 0.8487
        },
        {
            "id": "h3q77dr",
            "score": 1,
            "text": "Watch these billionaire fucks suddenly shit out technology to make us interstellar species - and all of them fuckoff to mars just to evade taxes",
            "title_similarity": "0.3715682",
            "sentiment_compound": -0.7717
        },
        {
            "id": "h3q8qp8",
            "score": 1,
            "text": "I guess until all countries agree, this wouldn't really work because businesses would just go to the remaining 60-70 countries and still pay less tax. Some 'tax haven countries' will just not back this up as they would no longer be attractive to corporations wishing to register their companies there. Idk though someone correct me if I'm wrong, pretty stoned.",
            "title_similarity": "0.42105424",
            "sentiment_compound": 0.5267
        },
        {
            "id": "h3q8wsj",
            "score": 1,
            "text": "Can anyone in America tell me what republicans have found to be mad about with this",
            "title_similarity": "0.36657214",
            "sentiment_compound": -0.4939
        },
        {
            "id": "h3q9ag2",
            "score": -1,
            "text": "[deleted]",
            "title_similarity": "0.0017693602"
        },
        {
            "id": "h3qa7yr",
            "score": 1,
            "text": "What about a global minimum wage for corporations?",
            "title_similarity": "0.7011645",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3qatq9",
            "score": 1,
            "text": "Meanwhile the US barely taxes its monopolistic overlords.",
            "title_similarity": "0.37632692",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3qc3ua",
            "score": 1,
            "text": "To the cynical people:\n\nTax havens are a prime example of (symptom of a form of) prisoner's dilemma.\n\n&#x200B;\n\nCountries are pressured to lower their corporate taxes (and neoliberals will ensure this pressure is converted into legislation).If they don't the corporations can just threaten to (and do) fuck off to a tax haven.\n\n&#x200B;\n\nThe ONLY way to break a prisoner's dilemma is unionization (as in forming a coalition with common goals, not just the more narrow labor union definition)\n\n&#x200B;\n\nAn agreement like this is the mandatory first step to break the prisoner's dilemma. It heavily reduces the leverage corporations have, and makes it easier to make laws to tax corporations who do try to move their business to the now smaller pool of tax havens in other ways.\n\na hypothetical example: giant global corporation fucks off to ireland and tries to route and declare all of its operating profits there through shell companies. Individual countries are fairly powerless. They can punish the corporation by denying access to their market or taxing their local operating costs in some other way, but in reality this is little more than the cost of doing business when global profits dwarf the cost due to going untaxed everywhere else.\n\nIf 130 countries band together and want to tax or deny their market to the corporation then it has a big problem. Not much point to not paying taxes if you can't sell your products.\n\n&#x200B;\n\nAgain: the implementation of incentives/counter incentives is completely arbitrary and can be iterated upon and improved and changed over time. But the first step is to agree to do it together and overcome the prisoner's dilemma.\n\n&#x200B;\n\nThere's going to be a lot of worming and manipulation and a big propaganda war from corporations following this.",
            "title_similarity": "0.5187995",
            "sentiment_compound": -0.836
        },
        {
            "id": "h3qc994",
            "score": 1,
            "text": "What fucking business does the US have telling the world to tax corporations?",
            "title_similarity": "0.61134446",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3qcec6",
            "score": 1,
            "text": "My job is to find tax havens for rich people, nobody is thinking about me ????",
            "title_similarity": "0.49064487",
            "sentiment_compound": 0.6767
        },
        {
            "id": "h3qd2aj",
            "score": -1,
            "text": "[deleted]",
            "title_similarity": "0.0017693602"
        },
        {
            "id": "h3qdbpw",
            "score": 1,
            "text": "Just to clear up how much this is an actual \"US proposal\": The proposal came from Germany and France in May 2019. After that more and more OECD and G20 countries (137 countries) thought is was a good idea and joined the negotiations. The USA joined talks about this only last April, so like 2 months ago.\n\nObviously it won't work if the US won't join, but lets not pretend the US came up with this idea on its own.",
            "title_similarity": "0.47514427",
            "sentiment_compound": 0.5955
        },
        {
            "id": "h3qdtqr",
            "score": 1,
            "text": "Great. Can't wait for costs to increase.",
            "title_similarity": "0.29587477",
            "sentiment_compound": 0.7506
        },
        {
            "id": "h3qe8dx",
            "score": 1,
            "text": "Unless this includes the all of the countries that matter this is a futile effort.",
            "title_similarity": "0.20959796",
            "sentiment_compound": -0.4215
        },
        {
            "id": "h3qedrl",
            "score": 1,
            "text": "I don’t really give a fuck. What does this change? Use your brains. NOTHING. That’s the answer - we’ll just keep working to live until we die like nothing ever happened anywhere or anytime",
            "title_similarity": "0.2848341",
            "sentiment_compound": -0.7322
        },
        {
            "id": "h3qeljv",
            "score": 1,
            "text": "Cant wait for all the roads and hospitals theyre gonna spend this money on.",
            "title_similarity": "0.48832738",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3qh07w",
            "score": 1,
            "text": "LOL US proposal, the US was the one in G7 that was against this for years, now it's their proposal? Sure",
            "title_similarity": "0.4083838",
            "sentiment_compound": 0.7034
        },
        {
            "id": "h3qia8u",
            "score": 1,
            "text": "nah",
            "title_similarity": "-0.049665987",
            "sentiment_compound": -0.1027
        },
        {
            "id": "h3qjiiq",
            "score": 1,
            "text": "The companies are just going to go to under developed nations that won’t tax them lol",
            "title_similarity": "0.48473874",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h3qjuji",
            "score": 1,
            "text": "Ok but where’s the money going",
            "title_similarity": "0.12611426",
            "sentiment_compound": 0.1531
        },
        {
            "id": "h3qkiym",
            "score": 1,
            "text": "The headline should be \"OP gaslighting the world in believing something is done to make corporations pay their far share of taxes while nothing will be done\". And how did it bacame a US idea? They didn't come up with it.",
            "title_similarity": "0.56844485",
            "sentiment_compound": 0.2023
        },
        {
            "id": "h3qkkzl",
            "score": 1,
            "text": "That leaves what, 120 or so that don't?",
            "title_similarity": "0.19262436",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3qmdtd",
            "score": 1,
            "text": "Can we do this for labor rights?\n\nHow about the standards on production cleanliness? Shit if China and others would adopt US standards of the 1990s",
            "title_similarity": "0.50901455",
            "sentiment_compound": -0.504
        },
        {
            "id": "h3qmgoz",
            "score": 1,
            "text": "Finally..and also.it should include freaking every single corporation..churches financial institutions.private banks on their profit... freaking schools everything.",
            "title_similarity": "0.5533649",
            "sentiment_compound": -0.4019
        },
        {
            "id": "h3qnqel",
            "score": 1,
            "text": "This won’t help anyone.",
            "title_similarity": "-0.07123391",
            "sentiment_compound": 0.4019
        },
        {
            "id": "h3qnzv2",
            "score": 1,
            "text": "One world government here we come.",
            "title_similarity": "0.4486723",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3qolam",
            "score": 1,
            "text": "This is America. Why would we give a fuck what other countries want from us?",
            "title_similarity": "0.3756364",
            "sentiment_compound": -0.4939
        },
        {
            "id": "h3qq6v1",
            "score": 1,
            "text": "Great, another reason for the price of everything to rise.",
            "title_similarity": "0.2929172",
            "sentiment_compound": 0.6249
        },
        {
            "id": "h3qq8cx",
            "score": 1,
            "text": "Well if you wanted a dystopian corporate world, this is how you get a dystopian corporate world.",
            "title_similarity": "0.4583746",
            "sentiment_compound": 0.2732
        },
        {
            "id": "h3qrfh8",
            "score": 1,
            "text": "Lol, the US is just mad it wants to raise corporate tax and companies will leave as a result. Fuck this.",
            "title_similarity": "0.39013177",
            "sentiment_compound": -0.6249
        },
        {
            "id": "h3qxy1a",
            "score": 1,
            "text": "So they’ll flock to the ones that don’t 😂. Dumbest thing ever. If you want corporations to make taxes you make them reasonable enough to where they’re shamed into paying them and it’s good public image.",
            "title_similarity": "0.52302694",
            "sentiment_compound": -0.2023
        },
        {
            "id": "h3qys1b",
            "score": 1,
            "text": "Corporations should be proud to pay their fair share of taxes. For a world that is so good to them they should be glad to pay back to contribute to its upkeep, not hide and dodge away from paying a single coin.",
            "title_similarity": "0.525628",
            "sentiment_compound": 0.9195
        },
        {
            "id": "h3r1v87",
            "score": 1,
            "text": "this is a grift like any other.  the corporations are effectively getting a tax cut, as always.  current corporate income tax averages out at around 25% state and federal.  profit shifting, tax avoiding companies like apple are just holding out on repatriating cash profits until they get the favorable rate they want.  [Tim Cook said as much](https://www.cnbc.com/2016/08/14/tim-cook-addresses-apples-us-taxes-says-no-repatriation-without-fair-rate.html). You think any private citizen could get away with that?  Fuck the United States for once again rigging the game in favor of their corporate overlords while the rest of us actually follow the rules only to barely scrape by.",
            "title_similarity": "0.6262201",
            "sentiment_compound": 0.9274
        },
        {
            "id": "h3r2ysn",
            "score": 1,
            "text": "As if this works!? They will never pay tax, or somehow pass the taxes on to the little people.",
            "title_similarity": "0.26088214",
            "sentiment_compound": 0.1501
        },
        {
            "id": "h3r3e5v",
            "score": 1,
            "text": "This is the stupidest thing I’ve ever seen",
            "title_similarity": "0.07738645",
            "sentiment_compound": -0.5267
        },
        {
            "id": "h3r3p6l",
            "score": 1,
            "text": "Minutiae regarding the global banking system kinda misses the point. The US, is trying recoup corporate taxes from multinational corporations  that legally evade the IRS.\nGood luck!! With the stroke of a pen, you could force all taxpayers, individuals as well as businesses to pay a flat tax. Everyone pays. Everyone pays. Everyone pays the same rate.",
            "title_similarity": "0.69443494",
            "sentiment_compound": 0.7892
        },
        {
            "id": "h3r4vlw",
            "score": -1,
            "text": "It's great to see the world getting back to multilateral , even global initiatives, free of four years of destructive mayhem being launched from Trump's America.",
            "title_similarity": "0.60358876",
            "sentiment_compound": 0.5994
        },
        {
            "id": "h3r5qt1",
            "score": 1,
            "text": "If corporations were doing that, it would be considered price fixing, which is illegal.",
            "title_similarity": "0.2648989",
            "sentiment_compound": -0.5574
        },
        {
            "id": "h3r7iqj",
            "score": 1,
            "text": "[deleted]",
            "title_similarity": "0.0017693602"
        },
        {
            "id": "h3r84tz",
            "score": 1,
            "text": "As long as its funnelled back into free universal health care, actual infrastructure needed not opinionated, minimum wage increases to those struggling  a overhaul of social welfare. \nInstead of the back pocket of lobbyists tax breaks for rich, monopolys that benefit no one but the rich.",
            "title_similarity": "0.51874954",
            "sentiment_compound": 0.872
        },
        {
            "id": "h3r9bw4",
            "score": 1,
            "text": "Huge steaming pile of communist shit that nobody could've even dreamed of, hoping that it will either get rejected by USA or the EU, or at the very least hoping for some loopholes in this disgusting project.",
            "title_similarity": "0.26343593",
            "sentiment_compound": -0.575
        },
        {
            "id": "h3r9vj7",
            "score": 1,
            "text": "Politicians are barely employable in the private sector. That's why they take positions in govt. That being said, they are unqualified to make these kinds of decisions.",
            "title_similarity": "0.3081411",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3rbyo7",
            "score": 1,
            "text": "I am sure there will be enough loopholes and this is only going to cause smaller family owned corporations to pay even more taxes.",
            "title_similarity": "0.5540994",
            "sentiment_compound": 0.2263
        },
        {
            "id": "h3re08u",
            "score": 1,
            "text": "Ahh so global theft, got it.",
            "title_similarity": "0.3291625",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3rgv1c",
            "score": -1,
            "text": "Alright. Since the US proposed this, when are we going to address Delaware?\n\nThey only have the one representative...",
            "title_similarity": "0.42791498",
            "sentiment_compound": 0.25
        },
        {
            "id": "h3rhs8g",
            "score": 1,
            "text": "The problem is, this tax is going to end up passed off to the employees and the customers. No pay raises, lower maximum salaries, and costs are going to increase.",
            "title_similarity": "0.46419948",
            "sentiment_compound": -0.3191
        },
        {
            "id": "h3rnf3l",
            "score": 1,
            "text": "Actually the proposal is French and German in a origin and has been worked on by the OECD for years.",
            "title_similarity": "0.40947127",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3rnrdg",
            "score": 1,
            "text": "Nope totally doesn't sound like world government shit at all. This should really concern anyone who values private property.",
            "title_similarity": "0.32950824",
            "sentiment_compound": -0.5063
        },
        {
            "id": "h3roevu",
            "score": 1,
            "text": "Governments of this world are completely and totally out of control.  Anyone who wants to give the governments more authority and control are out of their damn minds.  NO to this and anything that gives further rise to the government getting bigger and taking further control of our lives and freedoms.",
            "title_similarity": "0.32425314",
            "sentiment_compound": -0.4291
        },
        {
            "id": "h3rogb5",
            "score": 1,
            "text": "That’s great.  The US probably won’t go along with its own proposal because we’re ruled by a minority party.",
            "title_similarity": "0.27515668",
            "sentiment_compound": 0.7783
        },
        {
            "id": "h3rozck",
            "score": -1,
            "text": "Tax all the corporations 100% and it still won’t pay for a fraction of the religion called government.",
            "title_similarity": "0.62477535",
            "sentiment_compound": -0.1027
        },
        {
            "id": "h3rr3xh",
            "score": 1,
            "text": "People in this thread are actually arguing that taxing corporations is the same as governments having monopolies and dominating markets.\n\nWho the actual fuck lets these people taint the internet with their idiocy...",
            "title_similarity": "0.51475996",
            "sentiment_compound": -0.8271
        },
        {
            "id": "h3rreq1",
            "score": 1,
            "text": "This is disgusting.",
            "title_similarity": "-0.1273173",
            "sentiment_compound": -0.5267
        },
        {
            "id": "h3ruz0n",
            "score": 1,
            "text": "Yes please. 👍",
            "title_similarity": "0.067220226",
            "sentiment_compound": 0.6124
        },
        {
            "id": "h3rv5n0",
            "score": 1,
            "text": "Yes, this is a step towards a just direction. Capitalist wild west needs to end.",
            "title_similarity": "0.2808182",
            "sentiment_compound": 0.4019
        },
        {
            "id": "h3smddy",
            "score": -1,
            "text": "Absolutely ridiculous overreach of power. What is the US going to do countries that don't comply? What else are they going to propose.",
            "title_similarity": "0.29657045",
            "sentiment_compound": -0.4201
        },
        {
            "id": "h3pstyj",
            "score": 135,
            "text": "This will have zero legal effect in the US unless submitted to and passed by Congress. The “Paris accords” are the same. A President can’t just wave his magic wand and make law. If it’s a treaty it has to be ratified by the Senate.  If its just law it goes thru both houses and Biden signs it. Otherwise its just hot air.",
            "title_similarity": "0.55105495",
            "sentiment_compound": 0.2732
        },
        {
            "id": "h3r6u03",
            "score": 10,
            "text": "I cannot wait until these assholes start nation states. Facebook island is going to be the fucking worst.",
            "title_similarity": "0.35743415",
            "sentiment_compound": -0.8479
        },
        {
            "id": "h3pimvb",
            "score": 2,
            "text": "It’s just going to line politicians pockets even more.",
            "title_similarity": "0.39248943",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3ptsvm",
            "score": 2,
            "text": "Never happening.",
            "title_similarity": "-0.050398484",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3pucx9",
            "score": -2,
            "text": "So price fixing for companies is against the law. (Bad)\n\nTax fixing on a global scale is good. (Good)\n\nDifferent rules",
            "title_similarity": "0.44024363",
            "sentiment_compound": 0.3182
        },
        {
            "id": "h3pwide",
            "score": -2,
            "text": "Yeah this is just theater act like everything else they say. Keep suckin chinas dick for slave Labor to keep “economies”going.",
            "title_similarity": "0.34088182",
            "sentiment_compound": 0.1027
        },
        {
            "id": "h3pwlif",
            "score": -2,
            "text": "> 130 nations agree to support U.S. proposal for global minimum tax on corporations\n\nLooks like they're supporting more taxes that consumers will pay for.",
            "title_similarity": "0.91083",
            "sentiment_compound": 0.8481
        },
        {
            "id": "h3px666",
            "score": 2,
            "text": "Wait. This is... like... good news? \n\nI don't know what to do with my hands.",
            "title_similarity": "0.027717564",
            "sentiment_compound": 0.6597
        },
        {
            "id": "h3q147a",
            "score": 2,
            "text": "Nice to see 130 Nations stick it to the end consumer!  Corporations just raise prices to maintain their profit margin.",
            "title_similarity": "0.6963037",
            "sentiment_compound": 0.7177
        },
        {
            "id": "h3q17hu",
            "score": 2,
            "text": "Laughs in cayman island",
            "title_similarity": "0.17831731",
            "sentiment_compound": 0.4939
        },
        {
            "id": "h3q22du",
            "score": 2,
            "text": "Ireland and the Caymans have left the chat.",
            "title_similarity": "0.15030795",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3q3mqy",
            "score": 2,
            "text": "Nope.  They'll just avoid their obligations.  Make the CEO, CFO etc & Boards personally, criminally liable for tax avoidance. Legislate that unless they've had explicit conformation from the relevant tax authority that what they are wanting to do is lawful, then they'll be criminally liable for any legally dubious tax avoidance. \n\nTLDR just make CEO's personally criminally liable.",
            "title_similarity": "0.475431",
            "sentiment_compound": -0.6499
        },
        {
            "id": "h3q4snb",
            "score": 2,
            "text": "Yup the world needs to get behind blocking the tax dodging corporations that jump countries to avoid taxes 100%.",
            "title_similarity": "0.54096055",
            "sentiment_compound": -0.6369
        },
        {
            "id": "h3q56jo",
            "score": -2,
            "text": "Lmao who collects this global tax? Do we have a global government in place? Hmmm.... so some sort of global organization can now tax any corporation, there for leads to a global control of corporations  how is this not fascism on a global scale... someone please explain to me what fascism is if this isn't it",
            "title_similarity": "0.72574383",
            "sentiment_compound": 0.7622
        },
        {
            "id": "h3q80ex",
            "score": 2,
            "text": "Great, just another 50 years to implement this and we should be good.",
            "title_similarity": "0.44519708",
            "sentiment_compound": 0.7906
        },
        {
            "id": "h3q8cec",
            "score": 2,
            "text": "God, that's disgusting. Global taxes, really?",
            "title_similarity": "0.34651166",
            "sentiment_compound": -0.3182
        },
        {
            "id": "h3q9cqf",
            "score": -2,
            "text": "this is not a good thing.",
            "title_similarity": "-0.14982821",
            "sentiment_compound": -0.3412
        },
        {
            "id": "h3qbzd6",
            "score": 2,
            "text": "France : 15% lol is this taxes for ants?",
            "title_similarity": "0.59336025",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h3qg4qy",
            "score": 2,
            "text": "I can't wait to watch us Americans ignore the agreement.",
            "title_similarity": "0.41867542",
            "sentiment_compound": 0.1779
        },
        {
            "id": "h3qgppw",
            "score": 2,
            "text": "Can we start taxing churches?",
            "title_similarity": "0.29627782",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3qpsfu",
            "score": 2,
            "text": "If the Channel Islands, Isle of Man, Netherlands, Ireland, Malta, Luxembourg, Cyprus, the Caymans and the UK aren’t on the list then it doesn’t matter.",
            "title_similarity": "0.24557744",
            "sentiment_compound": 0.0258
        },
        {
            "id": "h3qs7v0",
            "score": -2,
            "text": "That is so fucked",
            "title_similarity": "-0.07870617",
            "sentiment_compound": -0.7661
        },
        {
            "id": "h3qw8e0",
            "score": 2,
            "text": "Yeah, as an American I fail to see how this is one of the greatest countries on the planet, when it tries to destroy the planet.",
            "title_similarity": "0.4387165",
            "sentiment_compound": -0.1531
        },
        {
            "id": "h3qy6vc",
            "score": 2,
            "text": "The U.S. shouldn't sign away their taxing authority like this.  I could see the Chinese bending arms to get the tax rate raised to an exorbitant level, just to crush competition. Not only are they willing to take losses to destroy competitors, their financial system is pretty damn opaque. \"Yeah, all our companies are paying the appropriate 75% corporate tax...\"",
            "title_similarity": "0.553627",
            "sentiment_compound": -0.3182
        },
        {
            "id": "h3qznky",
            "score": 2,
            "text": "If you believe something will actually happen you are deluded. Some “rules” may be written but lots of loopholes are already prepared. \n\nFor decades this is what governments had been doing - say they are going to do this but actually doing nothing.\n\nIt is clear that this is just a sham - the agreement also aims to remove digital service taxes, something Amazon and Google would be very happy with.",
            "title_similarity": "0.4018938",
            "sentiment_compound": 0.9084
        },
        {
            "id": "h3qztk9",
            "score": 2,
            "text": "Amazon is now headquartered in Eritrea.",
            "title_similarity": "0.38294998",
            "sentiment_compound": 0.1779
        },
        {
            "id": "h3r1f5l",
            "score": 2,
            "text": "All this will lead to his increased prices to consumers, yippee!",
            "title_similarity": "0.3978285",
            "sentiment_compound": 0.3382
        },
        {
            "id": "h3rcaxp",
            "score": 2,
            "text": "Wonder how those corporations who supported Biden feel now🤭🥱🤔",
            "title_similarity": "0.511691",
            "sentiment_compound": 0.6705
        },
        {
            "id": "h3robc2",
            "score": 2,
            "text": "Won’t happen.",
            "title_similarity": "-0.09254247",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3rqb0i",
            "score": 2,
            "text": "Tax the church",
            "title_similarity": "0.42072144",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3rw3ba",
            "score": 2,
            "text": "Bad idea all round",
            "title_similarity": "-0.093507044",
            "sentiment_compound": -0.5423
        },
        {
            "id": "h3rwe1p",
            "score": 2,
            "text": "Wont all the costs ultimately passed down to the the everyday consumer?",
            "title_similarity": "0.4005592",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3popu5",
            "score": -3,
            "text": "God bless president not trump!\n\nSo fucking awesome!\n\nYou know though that if trump or Qanon ever sees the big chair, they're immediately gonna back out of this citing how unfair it is that other countries aren't doing it, which is causing corporations to leave the US or some bullshit.",
            "title_similarity": "0.44787377",
            "sentiment_compound": 0.4688
        },
        {
            "id": "h3pv7pq",
            "score": -3,
            "text": "[deleted]",
            "title_similarity": "0.0017693602"
        },
        {
            "id": "h3pvlao",
            "score": 4,
            "text": "What about religious companies? Like every church",
            "title_similarity": "0.47612455",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h3q3yip",
            "score": 3,
            "text": "Taxes on corps are simply passed on in the form of price increases to consumers.",
            "title_similarity": "0.53495145",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3q7f7k",
            "score": 2,
            "text": "People, wake up.\n\nNo matter the rate corporations pay 0 taxes.  That burden is 100% paid by their customers.",
            "title_similarity": "0.68697155",
            "sentiment_compound": -0.5226
        },
        {
            "id": "h3qcmmu",
            "score": -4,
            "text": "130+ corporations know they’ll just pass those taxes on to the middle class. who’s the idiot that thought this up? if you said quid pro joe biden, then idiot fits. the children are back in charge again. thank god for the plandemic or we wouldn’t have had millions of fraudulent mail-in votes. if you support the left or this plan, then you deserve to pay more for “everything”. all the while, the criminal in chief continues to get kickbacks from china, Ukraine, and Russia. but it’s ok… because he’s a democrat. fucktards",
            "title_similarity": "0.5553406",
            "sentiment_compound": -0.5647
        },
        {
            "id": "h3ro65r",
            "score": 4,
            "text": "Lmao, this was not proposed by the US, but by France and Germany. The US merely signed it.",
            "title_similarity": "0.35349247",
            "sentiment_compound": 0.3506
        },
        {
            "id": "h3skzvn",
            "score": -4,
            "text": "Oh my fucking God. How much tax is enough? They will tax us and kill us until there's nothing left",
            "title_similarity": "0.34735888",
            "sentiment_compound": -0.5118
        },
        {
            "id": "h3q6pwn",
            "score": -3,
            "text": "So the plan is to…. What? Make the corporations move to the other 65 Countries? Make them jack up the prices and therefore once again pass price on to those buying rather than selling? \n\nProbably not a popular opinion, but Here’s an idea, maybe we should stop bashing our heads against the wall trying to force businesses to pay “their fair share”, if you can call it that, and more time educating the financially mismanaged masses into responsible adults that use their money wisely rather than omniconsumers. \n\nYou know, basic shit like don’t go into debt, don’t expect a luxurious life on min wage, don’t have kids until you’re financially stable and profitable. \n\nAnd to all the people at their keyboards ready to type “bUt I wOrK 40 hOuRs a wEeK aNd i cAnT mAkE rEnT” then find another place to live, get a new job, do SOMETHING. These corporations owners didn’t become billionaires for doing nothing, they took chances and risks, built up infrastructure, made products or services people were willing to buy, and sold them at a rate where both they make a profit, and the consumer has deemed them a fair price. \n\nIf you don’t like that whole system, there are other countries you can go to live that don’t have it, it is far easier to just move. If you don’t want them to sell for that price, vote with your wallet",
            "title_similarity": "0.52016085",
            "sentiment_compound": 0.9672
        },
        {
            "id": "h3qbxk1",
            "score": 4,
            "text": "[removed]",
            "title_similarity": "-0.02126519"
        },
        {
            "id": "h3r0ki8",
            "score": 4,
            "text": "Who doesn't think that they will just raise prices and it will just end up being yet another tax on us?",
            "title_similarity": "0.44074023",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3qrolg",
            "score": 6,
            "text": "I'm dumb, can someone explain to me why a country can't simply demand 15% taxes or refuse to allow the business to operate in their market? Why are people worried about the 60 countries that aren't on board with this? If America enforced its own minimum tax _regardless_ of the rest or the world, what happens?",
            "title_similarity": "0.6207406",
            "sentiment_compound": -0.7158
        },
        {
            "id": "h3ps45z",
            "score": 6,
            "text": "Lichtenstein: \"Nah, we're good\"\n\nMassive Corporations: \"Let's incorporate in Lichtenstein!!\"",
            "title_similarity": "0.63667774",
            "sentiment_compound": 0.4738
        },
        {
            "id": "h3p1wn8",
            "score": 96,
            "text": "This is the best tl;dr I could make, [original](https://www.cnbc.com/2021/07/01/nations-agree-to-support-us-proposal-for-global-minimum-tax-on-corporations.html) reduced by 66%. (I'm a bot)\n*****\n> WASHINGTON - Treasury Secretary Janet Yellen announced Thursday that a group of 130 nations has agreed to a global minimum tax on corporations.\n\n> &quot;For decades, the United States has participated in a self-defeating international tax competition, lowering our corporate tax rates only to watch other nations lower theirs in response. The result was a global race to the bottom: Who could lower their corporate rate further and faster? No nation has won this race,&quot; said Yellen in a statement on the accord.\n\n> The strategy, devised in part by Biden&#039;s national security adviser Jake Sullivan, emphasizes how foreign policy and domestic policy can be integrated into a new middle ground between the traditional conservative and liberal approaches to global affairs.\n\n\n*****\n[**Extended Summary**](http://np.reddit.com/r/autotldr/comments/obovak/130_nations_agree_to_support_us_proposal_for/) | [FAQ](http://np.reddit.com/r/autotldr/comments/31b9fm/faq_autotldr_bot/ \"Version 2.02, ~585773 tl;drs so far.\") | [Feedback](http://np.reddit.com/message/compose?to=%23autotldr \"PM's and comments are monitored, constructive feedback is welcome.\") | *Top* *keywords*: **global**^#1 **Yellen**^#2 **policy**^#3 **nation**^#4 **tax**^#5",
            "title_similarity": "0.77894056",
            "sentiment_compound": 0.9268
        },
        {
            "id": "h3pzf44",
            "score": 7,
            "text": "It’s hilarious because all it takes is 1 tax haven",
            "title_similarity": "0.38640124",
            "sentiment_compound": 0.4019
        },
        {
            "id": "h3q2dvd",
            "score": 8,
            "text": "Cue the accountants working out another huge dodge.",
            "title_similarity": "0.4083922",
            "sentiment_compound": 0.3182
        },
        {
            "id": "h3q79u2",
            "score": 8,
            "text": "Blanket regulation rarely works as intended, regardless of the intent.",
            "title_similarity": "0.07616471",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3rj97q",
            "score": 8,
            "text": "This won't pass though, it isn't as simple as everyone just agreeing. A lot of the listed countries rely on their income from corporate tax. This bill is an effort by larger nations to just beat down smaller ones instead of competing with them. Countries that offer the really low tax rates have been doing so to get a bigger slice of global tax revenue -- this will harm the little nations with less stable economies if it actually happens while making rich nations richer.\n\nIf a small country figures it can demand a 5% corporate tax, get some large businesses to come (fwiw by the number, most businesses doing jurisdiction shopping are medium sized, this is popular  especially with online businesses because they are not location dependent), and provide more for their people, then they should be able to do that. Yes it's a problem that companies are leaving the US and other superpowers but being a bully to smaller ones by taking away their competitive leverage isn't the right solution. This proposal is just about imperialism and exerting control for the benefit of a dozen countries. It gives the US a way out of playing fairly and drawing business by what they can offer.\n\nBy the way, you still have to pay US tax as a foreign corporation for all business done in the US. The tax benefit these corporations are getting is on non-US based income (income made in other countries where the US government does not provide the taxpayer services or business opportunity)",
            "title_similarity": "0.4995912",
            "sentiment_compound": 0.8863
        },
        {
            "id": "h3p5ue0",
            "score": 746,
            "text": "[deleted]",
            "title_similarity": "0.0017693602"
        },
        {
            "id": "h3pn337",
            "score": 333,
            "text": "Agree to support != agree to implement",
            "title_similarity": "0.22076525",
            "sentiment_compound": 0.7901
        },
        {
            "id": "h3pe533",
            "score": 3379,
            "text": "Interestingly, the tax haven Cayman Islands have signed on.  European tax haven country Ireland has not.  I'd be curious to know how that happened. \n\n. [https://www.oecd.org/tax/beps/oecd-g20-inclusive-framework-members-joining-statement-on-two-pillar-solution-to-address-tax-challenges-arising-from-digitalisation-july-2021.pdf](https://www.oecd.org/tax/beps/oecd-g20-inclusive-framework-members-joining-statement-on-two-pillar-solution-to-address-tax-challenges-arising-from-digitalisation-july-2021.pdf)",
            "title_similarity": "0.51068294",
            "sentiment_compound": 0.1872
        },
        {
            "id": "h3p6wfs",
            "score": 1411,
            "text": "Ireland is not one of them",
            "title_similarity": "-0.010677759",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3p2qz5",
            "score": -19,
            "text": "[deleted]",
            "title_similarity": "0.0017693602"
        },
        {
            "id": "h3p0z11",
            "score": 8448,
            "text": "That leaves 60+ who aren’t on board.",
            "title_similarity": "0.20838204",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3q5rbv",
            "score": 415,
            "text": "This post deserves an award for most comments from people that clearly did not read the article.",
            "title_similarity": "0.26622763",
            "sentiment_compound": 0.7351
        },
        {
            "id": "h3pkx2y",
            "score": 9506,
            "text": "As long as it actually includes financial institutions too.",
            "title_similarity": "0.39158434",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3pohpa",
            "score": 1,
            "text": "The best I can do is advance climate change",
            "title_similarity": "0.37731904",
            "sentiment_compound": 0.6369
        },
        {
            "id": "h3pox6m",
            "score": 1,
            "text": "Looks like some 3rd world countries are suddenly going to become corporate headquarters for multinational companies",
            "title_similarity": "0.62300014",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h3pp3pc",
            "score": 1,
            "text": "BFD if even just tracking / enforcement mechanisms are put on place in good faith. Lack of automatic reporting of assets has no reasonable justification in this century outside of tax evasion and fraud.",
            "title_similarity": "0.39159247",
            "sentiment_compound": -0.7456
        },
        {
            "id": "h3ppfdm",
            "score": 1,
            "text": "Scene: A comment section full of people who didn't read the article",
            "title_similarity": "0.16565819",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3ppg7f",
            "score": 1,
            "text": "...and then they’ll set it really really low.",
            "title_similarity": "0.022861434",
            "sentiment_compound": -0.3962
        },
        {
            "id": "h3ppo7q",
            "score": 1,
            "text": "Can anyone find a list of the countries that are either backing it or not? I can’t seem to find one",
            "title_similarity": "0.25146556",
            "sentiment_compound": 0.0258
        },
        {
            "id": "h3pprpa",
            "score": 1,
            "text": "oh shit, the us is doing something good!!",
            "title_similarity": "0.18064943",
            "sentiment_compound": -0.3147
        },
        {
            "id": "h3pq0lp",
            "score": 1,
            "text": "So every global corporation is now located in Sierra Leone?",
            "title_similarity": "0.5613804",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3pqdxw",
            "score": 1,
            "text": "\"hey America... We all had a talk and we'd really like you to stop being so corrupt\"\n\n\"Sure just send me $5b to my Bitcoin wallet or in Apple gift cards to support the change in legislation\"",
            "title_similarity": "0.55341816",
            "sentiment_compound": 0.8304
        },
        {
            "id": "h3pqfsi",
            "score": 1,
            "text": "That’s more than who signed Sokovia accords",
            "title_similarity": "0.35894984",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3pqp92",
            "score": 1,
            "text": "Came here to say the minimum.",
            "title_similarity": "0.11109576",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3pquj1",
            "score": 1,
            "text": "yay, more money for bombs!",
            "title_similarity": "0.4118545",
            "sentiment_compound": 0.5707
        },
        {
            "id": "h3pqx8m",
            "score": 1,
            "text": "Ya ok good luck lol",
            "title_similarity": "0.09339824",
            "sentiment_compound": 0.872
        },
        {
            "id": "h3pqxae",
            "score": 1,
            "text": "it probably have loophole that has already been exploded before it even hit the floor.",
            "title_similarity": "0.27177697",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3pr7la",
            "score": 1,
            "text": "What's the big deal here? Shouldn't there be a maximum tax on corporations or what am I overlooking here?",
            "title_similarity": "0.60521036",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3praje",
            "score": 1,
            "text": "That's cool and all but I wish the US would focus on punishing companies that avoid US taxes first. Companies suffering as they rearrange their financial structure to the 60 something other countries doesn't benefit me.",
            "title_similarity": "0.40359646",
            "sentiment_compound": -0.8972
        },
        {
            "id": "h3prdqj",
            "score": 1,
            "text": "Minimum. Why? Why not more than minimum m? Especialgn Amazon and like Uber which are jus cash cows…… moooooo move more money into poor peoples resources",
            "title_similarity": "0.47055876",
            "sentiment_compound": -0.134
        },
        {
            "id": "h3preie",
            "score": 1,
            "text": "Cool if it hypothetically were to pass, they'd still find a way to dodge them",
            "title_similarity": "0.08396635",
            "sentiment_compound": 0.3182
        },
        {
            "id": "h3prfa4",
            "score": 1,
            "text": "Woooooo taxes and government overreach",
            "title_similarity": "0.36551583",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3prfwx",
            "score": 1,
            "text": "Ireland refused to sign. They are happy enough taxing the crap out of people who live there but don't want to annoy Apple, Microsoft, Amazon, pretty much all of the big pharma companies, etc., leaving them with effective tax rates below 1%. It's not a good look for us and will end up having us blacklisted as a tax haven.",
            "title_similarity": "0.35765743",
            "sentiment_compound": 0.8784
        },
        {
            "id": "h3prh74",
            "score": 1,
            "text": "WOW! This could be HUGE! 😁\n\nThe way to proceed is for the US to sign on to and ratify this. Then, Congress should pass a law that, independent from the ratification itself, clearly states that Corporate tax rate must not be set below the international standard set by (insert the exact body establishing the rate). \n\nI say this, because the more Congress does to support this tax policy, the harder it will be to undo it via the courts, etc. Congress has the sole authority to create and set fed tax rates.",
            "title_similarity": "0.6680156",
            "sentiment_compound": 0.9581
        },
        {
            "id": "h3prmhn",
            "score": 1,
            "text": "And that leaves 60 counties to reep the benefits of businesses moving to them.\n\nAlmost like this idea was stupid to begin with. \n\nIf you need everyone to raise their taxes in order for yours to work then it was a stupid idea in the first place.",
            "title_similarity": "0.4350813",
            "sentiment_compound": -0.4576
        },
        {
            "id": "h3prt94",
            "score": 1,
            "text": "Does that mean employers get more money?",
            "title_similarity": "0.34345075",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3pruzi",
            "score": 1,
            "text": "They'll just execute the minimum tax the way they execute the minimum wage... Abuse and utilize the *minimum* to maximize profit.",
            "title_similarity": "0.47228223",
            "sentiment_compound": -0.3182
        },
        {
            "id": "h3prwnn",
            "score": 1,
            "text": "Too little too late",
            "title_similarity": "-0.007572787",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3ps02i",
            "score": 1,
            "text": "\nHey /u/ma002,\n\n\nThis is now the top post on reddit. It will be recorded at /r/topofreddit with all the other top posts.",
            "title_similarity": "0.5160279",
            "sentiment_compound": 0.3818
        },
        {
            "id": "h3ps2dg",
            "score": 1,
            "text": "Ah yes, the prelude to 2nd Irish famine.",
            "title_similarity": "0.33450732",
            "sentiment_compound": 0.4019
        },
        {
            "id": "h3ps3aw",
            "score": 1,
            "text": "Hmmm",
            "title_similarity": "-0.027248185",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3ps8b7",
            "score": 1,
            "text": "Give the working class back their power and dignity goddammit",
            "title_similarity": "0.3263114",
            "sentiment_compound": 0.4019
        },
        {
            "id": "h3ps8el",
            "score": 1,
            "text": "US proposal? Wait, are we actually leading on the world stage again?  It's almost like having a functioning adult as president is a good thing.",
            "title_similarity": "0.52780616",
            "sentiment_compound": 0.667
        },
        {
            "id": "h3ps9uj",
            "score": 1,
            "text": "We've needed a reform on tax havens for a while. I'm glad to see it happening, but hopefully the remaining countries can be encouraged to join.",
            "title_similarity": "0.4777482",
            "sentiment_compound": 0.891
        },
        {
            "id": "h3pscbb",
            "score": 1,
            "text": "So most of the tax havens will not sign which makes the problem slightly better as it was before.",
            "title_similarity": "0.28591985",
            "sentiment_compound": -0.024
        },
        {
            "id": "h3psph1",
            "score": 1,
            "text": "There's a carve out for UK financial services and digital sales tax. \n\n[https://www.reddit.com/r/worldnews/comments/obdcpu/uk\\_wins\\_financial\\_services\\_carveout\\_from\\_new/](https://www.reddit.com/r/worldnews/comments/obdcpu/uk_wins_financial_services_carveout_from_new/)",
            "title_similarity": "0.60695285",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3psvyh",
            "score": 1,
            "text": "Some sort of reverse oligarchy. I mean, I'm down with this but even a few bad actors ducks things up",
            "title_similarity": "0.16404176",
            "sentiment_compound": -0.6956
        },
        {
            "id": "h3psxz7",
            "score": 1,
            "text": "Is this good or bad",
            "title_similarity": "-0.030494964",
            "sentiment_compound": -0.1531
        },
        {
            "id": "h3psz77",
            "score": 1,
            "text": "There's a carve-out in the UK for financial services and removal of digital sales tax: [https://www.reddit.com/r/worldnews/comments/obdcpu/uk\\_wins\\_financial\\_services\\_carveout\\_from\\_new/](https://www.reddit.com/r/worldnews/comments/obdcpu/uk_wins_financial_services_carveout_from_new/) \n\nAdditional information here: [https://www.irishtimes.com/business/economy/uk-presses-for-city-of-london-carve-out-from-g7-global-tax-plan-1.4588385](https://www.irishtimes.com/business/economy/uk-presses-for-city-of-london-carve-out-from-g7-global-tax-plan-1.4588385) \n\nThe rationale for excluding the financial sector was set out in October 2020 in a pillar one plan that said financial services were a special case because they were generally required to have appropriately capitalised entities in each jurisdiction and therefore paid the right level of local tax.\r  \n\r  \nBut Mr Biden’s proposals in April to define the type of companies included in the pillar one plan was cross-sector, based on the 100 largest and most profitable firms, and brought the issue of financial services back in scope.\r  \n\r  \nMr Sunak has said the proposals agreed at the G7 under pillar one of the global talks – which would reallocate an element of profits from the largest multinationals according to sales – would increase revenues to the UK exchequer.\r  \n\r  \nBut neither he nor the Treasury has put any figure on this. TaxWatch, a think-tank, has calculated that Big Tech companies will pay less tax in the UK under the G7 plan than they currently do under the country’s digital services tax.",
            "title_similarity": "0.5542784",
            "sentiment_compound": 0.9202
        },
        {
            "id": "h3pt2h5",
            "score": 1,
            "text": "Great, global tax!  I remember reading about it 20 years ago.  When are they going to unveil the world govt?",
            "title_similarity": "0.70460415",
            "sentiment_compound": 0.6588
        },
        {
            "id": "h3pt3d8",
            "score": 1,
            "text": "http://neue-news-weltweit.de/2021/05/21/dogisahero/?fbclid=IwAR238qRIpCHurHSDFJd\\_5F8T1MFkAC9JlxPZqPmmFRpMHmG79aKRZ4jOttU",
            "title_similarity": "0.34359384",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3pt8gr",
            "score": 1,
            "text": "For those corporations that try to bypass the tax by moving their “headquarters” to a country other than those 130, we (consumers) can agree to boycott them. We don’t need to support companies who do not support us.",
            "title_similarity": "0.5363598",
            "sentiment_compound": 0.1635
        },
        {
            "id": "h3ptgq4",
            "score": 1,
            "text": "This doesn't fix anything, just concentrates wealth even further into a few large countries",
            "title_similarity": "0.41394284",
            "sentiment_compound": 0.4939
        },
        {
            "id": "h3ptguh",
            "score": 1,
            "text": "Does this include s class corps?",
            "title_similarity": "0.2372419",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3ptiak",
            "score": 1,
            "text": "As sure as God made little green apples the GOP will say this will destroy the economy! I can't believe how they've gotten their supporters to go along with the ultra rich getting more and more and paying zero and somehow that's American!  They're STILL going with trickle down economics even thought they won't dare say the words anymore cuz they know it's an embarrassing failure.\n\nThe GOP only cares about keeping worker's rights and the min wage as low as possible. Why? because the people that write the biggest checks employ the most people and God forbid that Bezos doesn't beat Elon Musk in the billionaire space race or that he would have to buy the 50billion yaught and not the 100billion one. \n\nIf the GOP cared about guns why don't they ever say one word about the huge drop in hunters every single year? because the auto insurance industry pays them not to! average cost from one deer hit is over $7000 and more hunters means less cars slamming into deer and they can't have that. There should be mentorship and education programs in every state to grow the number of hunters, and animals like deer, black bear and WILD PIGS have to be controlled by us because the natural predators are gone. \n\nWild pigs alone cause billions in farm losses every year and you'd think they would address the drop in hunters but their focus was always on stopping any devices in guns to track or limit who can pull the trigger or automatic weapons....why? the makers gave em around $100,000 each .... that's all it takes to buy a vote of a congressman and the senate vote is more but wtf ?  this party is a criminal enterprise...",
            "title_similarity": "0.46090403",
            "sentiment_compound": -0.8727
        },
        {
            "id": "h3ptkws",
            "score": 1,
            "text": "Luxembourg has left the chat",
            "title_similarity": "0.087423936",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3ptrr6",
            "score": 1,
            "text": "I guess i just realized that if a country has no need of taxes, it would be silly to tax the corporations.\n\nOr, they can just collect the tax money from the companies, and then give it right back to them.\n\n---------\n\nThink of it this way: \n\n- some places have zero individual income tax\n- and then world decides to have a global minimum individual income tax\n\nSo we then....tax people that we don't need to tax...in order to...shut people up?  And then we give them money back to people after they pay it.\n\n---------------\n\nIn an ideal world governments would:\n\n- raise taxes\n- not only until the budget is balanced\n- not only until the debt is paid off\n- but until the government has a nest-egg of money\n\nThen rather than taxing individuals and corporations, they can instead operate from the interest revenue.\n\nBut realize that some countries today do not need taxes, because the government itself has enough money to operate. That is the problem with assuming everyone works the same way your broken country does.\n\nWhat there should be is a global maximum income tax: zero.  You have 30 years to balance your budgets. **Go!**\n\n---------\n\nA good example is oil-rich countries.  A better example is Ireland:\n\n- Ireland is required by EU to tax corporations at a rate that they don't need\n- and then they give the money back to the corporations\n\n*\"reeee\"*, says the EU.\n\n*\"Tough shit\"*, says Ireland.",
            "title_similarity": "0.61729205",
            "sentiment_compound": -0.501
        },
        {
            "id": "h3ptzs4",
            "score": 1,
            "text": "Does this include all corporations, or just the huge ones? Like if I choose to incorporate my small town business that barely pulls in money, am I going to be taxed by this too?",
            "title_similarity": "0.6095995",
            "sentiment_compound": 0.6322
        },
        {
            "id": "h3ptzsk",
            "score": 1,
            "text": "This sounds perfect for when I want to undercut everyone.",
            "title_similarity": "0.24880329",
            "sentiment_compound": 0.6124
        },
        {
            "id": "h3pu0rl",
            "score": 1,
            "text": "Yes, please can we do this?! We can all levy heavy duties on any non-committal countries until they hop on board too.",
            "title_similarity": "0.49566513",
            "sentiment_compound": 0.6476
        },
        {
            "id": "h3pub4f",
            "score": 1,
            "text": "Were the Canary Islands on the yay side or the nay side?  How about Switzerland?\nThis is just going to hurt the millionaires, not the billionaires unless everyone is on board.\nOtherwise, start painting because the Art world is about to get a serious, tax deductible, infusion of interest and money.",
            "title_similarity": "0.47277972",
            "sentiment_compound": 0.4696
        },
        {
            "id": "h3pud3w",
            "score": 1,
            "text": "Aw shit",
            "title_similarity": "-0.046202824",
            "sentiment_compound": -0.5574
        },
        {
            "id": "h3pue06",
            "score": 1,
            "text": "Now let's work on their labor exploitations.",
            "title_similarity": "0.21656758",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3pufzq",
            "score": 1,
            "text": "Just a minimum eh?….alright then. Keep your secrets…",
            "title_similarity": "0.03846609",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3puipf",
            "score": 1,
            "text": "They didn’t just say it, THEY DECLARED IT!",
            "title_similarity": "0.15745384",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3pum4q",
            "score": 1,
            "text": "Moronic. Any nation who doesn't wish to impose it won't sign the agreement, and they will reap the benefits as a new tax haven.",
            "title_similarity": "0.43212605",
            "sentiment_compound": -0.6246
        },
        {
            "id": "h3purnf",
            "score": 1,
            "text": "This just trickles down to the buyer. We will be paying. Smoke and mirrors.",
            "title_similarity": "0.43286988",
            "sentiment_compound": 0.0516
        },
        {
            "id": "h3puuac",
            "score": 1,
            "text": "What nation holds and controls the money?",
            "title_similarity": "0.3916366",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3puv1k",
            "score": 1,
            "text": "Ok but there needs to be control to not pass the increase in taxes into increasing prices on their products to compensate for it.",
            "title_similarity": "0.3499251",
            "sentiment_compound": -0.2127
        },
        {
            "id": "h3puvib",
            "score": 1,
            "text": "nWo",
            "title_similarity": "0.1334136",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3puwdq",
            "score": 1,
            "text": "About damn time",
            "title_similarity": "0.111827224",
            "sentiment_compound": -0.4019
        },
        {
            "id": "h3pv0xd",
            "score": 1,
            "text": "How is this now a US proposal?",
            "title_similarity": "0.23834844",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3pv2se",
            "score": 1,
            "text": "I’m so used to misnamed US laws that I really expect this law means companies will only have to pay the absolute minimum amount of tax possible instead of making sure companies can’t hide in tax havens.",
            "title_similarity": "0.52881455",
            "sentiment_compound": 0.0516
        },
        {
            "id": "h3pv4na",
            "score": 1,
            "text": "Doesn't the latest proposal exclude financial services companies? You know, the overwhelming majority of the corporate demographic that dodges taxes.",
            "title_similarity": "0.6029669",
            "sentiment_compound": -0.2263
        },
        {
            "id": "h3pv4wy",
            "score": 1,
            "text": "So the next question becomes how the tax basis is calculated.  Some countries do it based on the amount of money made from business within the country, some do it on the whole amount (meaning they get taxed on the whole amount for every country that operates this way).\n\nNot many people seem to appreciate the significant difference between the two, but I sure do hope it's the former!",
            "title_similarity": "0.54150915",
            "sentiment_compound": 0.8534
        },
        {
            "id": "h3pveyj",
            "score": 1,
            "text": "In other words this is the corporate sanctioned pay off that is supposed to be advertised as a means to get the working class off their backs. The media will splash this around for a while and every time someone on the left brings up corporate taxes or tax rates, they'll point to this and claim they've already been handled.",
            "title_similarity": "0.57515657",
            "sentiment_compound": -0.1531
        },
        {
            "id": "h3pvfod",
            "score": 1,
            "text": "Who collects this tax?",
            "title_similarity": "0.38872182",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3pvhzs",
            "score": 1,
            "text": "How can others follow a policy we do not have",
            "title_similarity": "0.05492641",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3pvmax",
            "score": 1,
            "text": "Whatever is it, I wonder if the average person would benefit.   Close one loophole open another it seems.",
            "title_similarity": "0.16486835",
            "sentiment_compound": 0.4588
        },
        {
            "id": "h3pvqbo",
            "score": 1,
            "text": "\"In the European Union, the deal will need an EU law to be passed, most likely during France's presidency of the bloc in the first half of 2022, and that will require unanimous backing from all EU members.\"\n\nYet Ireland, Hungary and Estonia did not sign this deal.\n\nWhat metric did they use to determine each of these 130 nations agreement? Is the US able to promise their participation if international treaties require 2/3 senate approval? Is this legally binding or just politically binding?",
            "title_similarity": "0.5566189",
            "sentiment_compound": 0.8638
        },
        {
            "id": "h3pvuop",
            "score": 1,
            "text": "USA Will agree with taxing the companies in Delaware?",
            "title_similarity": "0.5513729",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h3pvuqg",
            "score": 1,
            "text": "Could taxing corporations on US currency create an incentive for unregulated virtual currencies?",
            "title_similarity": "0.5349777",
            "sentiment_compound": 0.5574
        },
        {
            "id": "h3pvvk3",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "-0.02126519"
        },
        {
            "id": "h3pvx7h",
            "score": 1,
            "text": "tAx BrEaKs\n\nThis won’t mean anything if the corporations are given welfare.",
            "title_similarity": "0.38436413",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3pvy16",
            "score": 1,
            "text": "it was a German proposal",
            "title_similarity": "0.27970588",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3pw6fs",
            "score": 1,
            "text": "I'm sorry. The *US* proposed this?!",
            "title_similarity": "0.19871108",
            "sentiment_compound": -0.1511
        },
        {
            "id": "h3pwa35",
            "score": 1,
            "text": "They'll just relocate to Mars on paper and avoid taxes from there.",
            "title_similarity": "0.32163766",
            "sentiment_compound": -0.296
        },
        {
            "id": "h3pwaps",
            "score": 1,
            "text": "Worthless. Banks and financial institutions are exempt.",
            "title_similarity": "0.3014807",
            "sentiment_compound": -0.3612
        },
        {
            "id": "h3pwe25",
            "score": 1,
            "text": "A race to the bottom is finally starting to end.",
            "title_similarity": "0.14065214",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3pweud",
            "score": 1,
            "text": "Great for Ireland, it will just send more companies there",
            "title_similarity": "0.35493705",
            "sentiment_compound": 0.6249
        },
        {
            "id": "h3pwi66",
            "score": 1,
            "text": "The US, proposing taxes????? \n\nWhat timeline am I in. \n\nAnyway it'll only affect corporate tax havens I guess and those 130 probably already had Corporate tax.",
            "title_similarity": "0.7286447",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3pwmeb",
            "score": 1,
            "text": "Corporations are people too my friend.  And if they're traitors we'll hang 'em.",
            "title_similarity": "0.3836436",
            "sentiment_compound": 0.4939
        },
        {
            "id": "h3pwmgk",
            "score": 1,
            "text": "Yeah, I wouldn't trust an American tax plan.",
            "title_similarity": "0.28245494",
            "sentiment_compound": -0.1285
        },
        {
            "id": "h3pwpuk",
            "score": 1,
            "text": "Isn't that the point of import taxes. I.e. company X is bringing materials from Africa; they get a 15% tax. Or Some social media company is headquarters in Ireland, any revenue made off of ads in the US is taxed 15%. Why should their headquarters matter?",
            "title_similarity": "0.63360405",
            "sentiment_compound": 0.0258
        },
        {
            "id": "h3pwred",
            "score": 1,
            "text": "*nervous Irish sweating*",
            "title_similarity": "0.0691222",
            "sentiment_compound": -0.2732
        },
        {
            "id": "h3pwz1i",
            "score": 1,
            "text": "Who will receive the money from these taxes? I bet it's the corporations! Teeheehee",
            "title_similarity": "0.6429091",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3pwz36",
            "score": 1,
            "text": "> 130 nations agree to ~~support U.S. proposal for global minimum tax on corporations~~ chain themselves further to the sinking ship that is the US\n\nftfy",
            "title_similarity": "0.9093336",
            "sentiment_compound": 0.6369
        },
        {
            "id": "h3px08m",
            "score": 1,
            "text": "Wow that's great. I'm sure we'll keep up our end and this won't just be used as a cudgel against official state enemies.",
            "title_similarity": "0.31348413",
            "sentiment_compound": 0.7906
        },
        {
            "id": "h3px0t8",
            "score": 1,
            "text": "It wasn't a US proposal but okay",
            "title_similarity": "0.07280786",
            "sentiment_compound": 0.3291
        },
        {
            "id": "h3px4sm",
            "score": 1,
            "text": "awesome, great idea!",
            "title_similarity": "0.17477974",
            "sentiment_compound": 0.8588
        },
        {
            "id": "h3px6mo",
            "score": 1,
            "text": "So everyone except Ireland, Switzerland, and those random island countries?",
            "title_similarity": "0.26646864",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3px9s2",
            "score": 1,
            "text": "The governments are so in bed with corporations that if they approve this, the companies approve this too and there will be some fuckery in the bill that benefits the current corporations somehow.",
            "title_similarity": "0.5109336",
            "sentiment_compound": 0.3818
        },
        {
            "id": "h3pxhrc",
            "score": 1,
            "text": "It's that one rogue country who doesn't agree",
            "title_similarity": "0.035878196",
            "sentiment_compound": -0.2755
        },
        {
            "id": "h3pxww5",
            "score": 1,
            "text": "Hopefully we can follow through with the plan and not dip our cheeks in the blue water, when 2024 comes around.",
            "title_similarity": "0.31533512",
            "sentiment_compound": 0.4019
        },
        {
            "id": "h3py1h8",
            "score": 1,
            "text": "Okay this either results in either space corporations or Rapture from bioshock",
            "title_similarity": "0.35754746",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h3pyhkb",
            "score": 1,
            "text": "mastermindwriters.com",
            "title_similarity": "0.30547136",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3pyho8",
            "score": 1,
            "text": "Finally something that ignites a spark of hope in me. I can't stand corporations that exploit the existince of tax havens. They make millions on the backs of their employees and are benefitting from the existing infrastructure of the places where their consumers live, although they do nothing to give back to said communities. Instead they fled to tax havens and got richer and even more ruthless. Hopefully this unfairness and corporal greed will stop or at least will be hindered.",
            "title_similarity": "0.4706457",
            "sentiment_compound": 0.8214
        },
        {
            "id": "h3pymi2",
            "score": 1,
            "text": "This will only work if the loop holes are buttoned up.  Company A decided to become an LLC. And dodge the tax etc.",
            "title_similarity": "0.4863381",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3pyscf",
            "score": 1,
            "text": "Wait, but does the US (government) support this? This sounds highly anti-US to me",
            "title_similarity": "0.31430984",
            "sentiment_compound": 0.5499
        },
        {
            "id": "h3pz7kk",
            "score": 2,
            "text": "I bet nothing will change",
            "title_similarity": "0.116206795",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3pzblh",
            "score": 1,
            "text": "You know it's an overall useless agreement when so many countries agree to it. Same with the The Paris Agreement.",
            "title_similarity": "0.3208149",
            "sentiment_compound": 0.7479
        },
        {
            "id": "h3pzc5d",
            "score": 1,
            "text": "“globalization, trade, human rights and military might are all harnessed for the benefit of working Americans” \n\nUh… yeah no.. not in that order",
            "title_similarity": "0.46786112",
            "sentiment_compound": 0.6369
        },
        {
            "id": "h3pzh0a",
            "score": 1,
            "text": "German magazine „Der Spiegel“ writes: This 15%+ rule will not lead to relevant national tax increase …",
            "title_similarity": "0.49172434",
            "sentiment_compound": 0.3182
        },
        {
            "id": "h3pzl5f",
            "score": 1,
            "text": "How much of the tax is going to those 130 other nations?",
            "title_similarity": "0.73571765",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3pzl5l",
            "score": 1,
            "text": "The cartel is laughing hysterically",
            "title_similarity": "0.18142426",
            "sentiment_compound": 0.4939
        },
        {
            "id": "h3pzqsf",
            "score": 1,
            "text": "Many country's have tried for years but now it's American? Sure at least it gets done.",
            "title_similarity": "0.46966034",
            "sentiment_compound": 0.4497
        },
        {
            "id": "h3pzufr",
            "score": 1,
            "text": "Can someone explain this to me? Because I’m thinking it’s that they want to tax them less.",
            "title_similarity": "0.22823924",
            "sentiment_compound": 0.0772
        },
        {
            "id": "h3pzx3j",
            "score": 1,
            "text": "Calculations for Germany are: 380 million € taxes per year from this. Compared with 1.1 billion in coffee taxation.",
            "title_similarity": "0.6162427",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3pzzys",
            "score": 1,
            "text": "Globalism baby! Nations don’t need sovereignty that’s overrated",
            "title_similarity": "0.37359548",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3q04d1",
            "score": 1,
            "text": "Isn't this mandatory tax lower than these countries' current tax rates? \n\nGlad they can pat themselves on the back though, I'm sure their corporate donors like this new tax rate. Virtue signaling while neoliberalism burns the world\n\n*effectively anonymous financial institutions are exempt lmao",
            "title_similarity": "0.6139244",
            "sentiment_compound": 0.9369
        },
        {
            "id": "h3q084i",
            "score": 1,
            "text": "lets see if all of the worlds problems will magically go away now",
            "title_similarity": "0.2944168",
            "sentiment_compound": -0.4019
        },
        {
            "id": "h3q08i4",
            "score": 1,
            "text": "Too little too late.",
            "title_similarity": "0.0032691723",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3q0j3f",
            "score": 1,
            "text": "Adorable",
            "title_similarity": "-0.021766935",
            "sentiment_compound": 0.4939
        },
        {
            "id": "h3q0kqz",
            "score": 2,
            "text": "Tax rates don’t matter if loopholes exists",
            "title_similarity": "0.2916665",
            "sentiment_compound": 0.0258
        },
        {
            "id": "h3q1310",
            "score": 1,
            "text": "Conservatives in shambles trying to figure out how to attack Biden",
            "title_similarity": "0.29536384",
            "sentiment_compound": -0.4767
        },
        {
            "id": "h3q1768",
            "score": 1,
            "text": "[deleted]",
            "title_similarity": "0.0017693602"
        },
        {
            "id": "h3q198z",
            "score": 2,
            "text": "That leaves around 65 countries as global tax havens.",
            "title_similarity": "0.6109029",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3q1p44",
            "score": 1,
            "text": "This is fine and dandy but the proof is in the fucking pudding for me. You can agree to tax corporations more but they have about seven billion ways to get around taxes to begin with. \n\nStart by demanding the back pay for years of unpaid/tax haven dollars from Apple, Google, Amazon, and basically every other massive Fortune 500 company. Literally trillions they’ve evaded at this point and your talking about taxing them more. So what, they can get better at dodging them? \n\nIt’s disgusting nothing has been done for decades and now in typical fashion we are cramming in like a college student who forgot their fucking project is due 12am sharp and they just started at 1030. Oh wait we can’t afford college anymore either. Fucking joke.",
            "title_similarity": "0.58390623",
            "sentiment_compound": 0.7839
        },
        {
            "id": "h3q1yof",
            "score": 2,
            "text": "Good! Finally...enough with the trickle down myth and lies...",
            "title_similarity": "0.16719058",
            "sentiment_compound": 0.1007
        },
        {
            "id": "h3q1zoa",
            "score": 1,
            "text": "\"Like who?\"\n\nhttps://youtu.be/9DLuALBnolM?t=211",
            "title_similarity": "0.24124464",
            "sentiment_compound": 0.4329
        },
        {
            "id": "h3q213m",
            "score": 1,
            "text": "[SRGA](https://www.tipranks.com/stocks/srga/forecast)",
            "title_similarity": "0.4039786",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3q298t",
            "score": 2,
            "text": "Not Ireland.",
            "title_similarity": "0.0030729296",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3q2esb",
            "score": 1,
            "text": "Wow",
            "title_similarity": "-0.005479361",
            "sentiment_compound": 0.5859
        },
        {
            "id": "h3q304y",
            "score": 2,
            "text": "Man, that's more than the Sokovia accords.",
            "title_similarity": "0.28790623",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3q39bn",
            "score": 1,
            "text": "So which countries become the new tax havens?",
            "title_similarity": "0.5474999",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3q3hjd",
            "score": 1,
            "text": "mr you don’t go to war with the equipment you want but with the equipment you get, ie screw the troops they don’t need body armor and up armored humvees",
            "title_similarity": "0.27313647",
            "sentiment_compound": -0.4404
        },
        {
            "id": "h3q4a8x",
            "score": 1,
            "text": "Until its 196 does it even matter? They can just go to other tax havens",
            "title_similarity": "0.427019",
            "sentiment_compound": 0.0258
        },
        {
            "id": "h3q4d87",
            "score": 1,
            "text": "Guess which countries don’t support the proposal ? Yep it’s those rogue states run by corrupt populist dictators.. Brazil/Bolsonaro Russia/Putin N.Korea/Kim U.K/Johnson",
            "title_similarity": "0.35292545",
            "sentiment_compound": 0.5994
        },
        {
            "id": "h3q4ge1",
            "score": 1,
            "text": "sick, now do minimum wage",
            "title_similarity": "0.21238708",
            "sentiment_compound": -0.5106
        },
        {
            "id": "h3q4jeh",
            "score": 1,
            "text": "Doesn't matter, loopholes will be made so legally all the boxes have been checked, yet no taxes will be paid.",
            "title_similarity": "0.3434758",
            "sentiment_compound": -0.1047
        },
        {
            "id": "h3q4ko7",
            "score": 1,
            "text": "Does the proposal address tax breaks and loopholes? If not, I’m sure the big companies will continue to skirt around paying their fucking share of taxes",
            "title_similarity": "0.5927408",
            "sentiment_compound": 0.1358
        },
        {
            "id": "h3q4mp9",
            "score": 1,
            "text": "I mean the US proposal has one of the lowest and those with no tax for corporations, won't change . Nothing will change.  Another headline that does absolutely nothing.",
            "title_similarity": "0.42117205",
            "sentiment_compound": -0.5859
        },
        {
            "id": "h3q4pae",
            "score": 1,
            "text": "Sucks that any progress made will just be wiped out next time republicans are in charge.",
            "title_similarity": "0.30603868",
            "sentiment_compound": 0.0772
        },
        {
            "id": "h3q550l",
            "score": 1,
            "text": "Lol to little to late at this point.",
            "title_similarity": "0.10259771",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h3q5bw5",
            "score": 2,
            "text": "Prosecute the bankers",
            "title_similarity": "0.33868703",
            "sentiment_compound": -0.4019
        },
        {
            "id": "h3q5e2a",
            "score": 1,
            "text": "Hypothetical question; could you circumvent this if you were situated in a Freeport/Charter City/ZDE thing?",
            "title_similarity": "0.30122095",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3q5qri",
            "score": 1,
            "text": "Greedy corporations will always find a way out.",
            "title_similarity": "0.2976578",
            "sentiment_compound": -0.3182
        },
        {
            "id": "h3q5xv2",
            "score": 1,
            "text": "*laughs in SCOTUS*",
            "title_similarity": "0.14143959",
            "sentiment_compound": 0.4939
        },
        {
            "id": "h3q61ij",
            "score": 1,
            "text": "I wonder how many countries will use this as an excuse to *lower* their tax rate to 15%",
            "title_similarity": "0.5949577",
            "sentiment_compound": -0.2263
        },
        {
            "id": "h3q67wl",
            "score": 1,
            "text": "Cool",
            "title_similarity": "0.0017160382",
            "sentiment_compound": 0.3182
        },
        {
            "id": "h3q6atu",
            "score": 1,
            "text": "🙃",
            "title_similarity": "-0.023819728",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3q6dif",
            "score": 1,
            "text": "🤔",
            "title_similarity": "-0.023819728",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3q6dmx",
            "score": 1,
            "text": "That's actually such a big step.",
            "title_similarity": "0.16698456",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3q6o5k",
            "score": 1,
            "text": "I’m not super informed on these things, but my 2 cents is that this sounds like really scary idea. I’d love to hear both sides of the issue.",
            "title_similarity": "0.14137429",
            "sentiment_compound": 0.5002
        },
        {
            "id": "h3q6pjy",
            "score": 1,
            "text": "Do it.",
            "title_similarity": "0.08282771",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3q6ryv",
            "score": 1,
            "text": "Oh cool. Money for new fighter jets, stealth tech, and AI piloted drones.",
            "title_similarity": "0.45987332",
            "sentiment_compound": 0.3818
        },
        {
            "id": "h3q6uot",
            "score": 1,
            "text": "[deleted]",
            "title_similarity": "0.0017693602"
        },
        {
            "id": "h3q6ybr",
            "score": 1,
            "text": "Who knew the best way to setup a Lunar or Mars colony was to offer a tax-haven status?",
            "title_similarity": "0.47553396",
            "sentiment_compound": 0.6369
        },
        {
            "id": "h3q74v9",
            "score": 1,
            "text": "The public support has been there.",
            "title_similarity": "0.14897506",
            "sentiment_compound": 0.4019
        },
        {
            "id": "h3q75ae",
            "score": 1,
            "text": "The poor countries won't benefit.",
            "title_similarity": "0.03297379",
            "sentiment_compound": -0.6788
        },
        {
            "id": "h3q79xc",
            "score": 1,
            "text": "Well this is a no brainer..  Free money from others??  No shit they'll vote for it..",
            "title_similarity": "0.3261445",
            "sentiment_compound": 0.1235
        },
        {
            "id": "h3q7ct2",
            "score": 1,
            "text": "This is gonna fail everyone’s has to be a part of this or it’s not gonna work. And I think the tax I a good I idea but I don’t want the tax on small business",
            "title_similarity": "0.29228133",
            "sentiment_compound": 0.0387
        },
        {
            "id": "h3q7duf",
            "score": 1,
            "text": "Ireland says \"fuck you, we have cheap taxes. Give us business and don't pay the cheap taxes. We don't even need it\".",
            "title_similarity": "0.40346408",
            "sentiment_compound": -0.4946
        },
        {
            "id": "h3q7rfy",
            "score": 1,
            "text": "And should include the preposition that a tax haven is illegal.",
            "title_similarity": "0.29095256",
            "sentiment_compound": -0.5574
        },
        {
            "id": "h3q7vgi",
            "score": 2,
            "text": "Bitcoin needs to be global currency!!!!!!",
            "title_similarity": "0.48278987",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3q82w4",
            "score": 1,
            "text": "Six Flags is like the ones on this tweet",
            "title_similarity": "0.26218507",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h3q895w",
            "score": 2,
            "text": "Of course they do, it's  a gravy train for all of them.",
            "title_similarity": "0.3298692",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3q8a6t",
            "score": 2,
            "text": "So-- where my new tax haven countries at now??  Do I need to call the yacht valet at monaco to re-park it?",
            "title_similarity": "0.4858855",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3q8cd0",
            "score": 2,
            "text": "195 countries on the planet. This idea doesn't work if only 2/3 sign on.",
            "title_similarity": "0.34231508",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3q8ee5",
            "score": 1,
            "text": "As if these corporation pay taxes.\nThey'll find another tax loop and the show will continue",
            "title_similarity": "0.59111214",
            "sentiment_compound": -0.1027
        },
        {
            "id": "h3q8f7v",
            "score": 1,
            "text": "I don't believe the corporate-run USA would support a tax on corporations. What's the catch?",
            "title_similarity": "0.4547721",
            "sentiment_compound": 0.4019
        },
        {
            "id": "h3q8fnn",
            "score": 1,
            "text": "Hopefully they find a way to do it where the expense doesn't get passed on to the employees or the consumer. Or companies skip out by finding some loophole, or worse yet just move out of the country completely to a country with fewer tax burdens. I know the intentions of increasing taxes on big corporations are good, but they will find any way they can to weasel out of paying them. Whether it be lower wages or benefits for employees, layoffs, outsourcing, loopholes. Good luck I really hope it works, but I am skeptical.",
            "title_similarity": "0.41896608",
            "sentiment_compound": 0.8954
        },
        {
            "id": "h3q8gxx",
            "score": 1,
            "text": "another empty post to rile up the troops!",
            "title_similarity": "0.14192039",
            "sentiment_compound": -0.2714
        },
        {
            "id": "h3q8ntd",
            "score": 1,
            "text": "I probably missed it but was there some sort of agreement on how this tax is going to be distributed?",
            "title_similarity": "0.34269908",
            "sentiment_compound": 0.5041
        },
        {
            "id": "h3q8on6",
            "score": 1,
            "text": "And the one that doesn't will be where they're all registered just like Delaware in the states",
            "title_similarity": "0.3537559",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h3q8scl",
            "score": 1,
            "text": "Global tax? Where and how is the tax distributed?",
            "title_similarity": "0.548157",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3q8wxn",
            "score": 1,
            "text": "Just have a revenue tax of 10%. We know how much revenue they make so just tax that so they can’t hide it",
            "title_similarity": "0.6245576",
            "sentiment_compound": -0.2415
        },
        {
            "id": "h3q96mf",
            "score": 1,
            "text": "but let’s keep allowing 3 companies to dominate the entire world! As long as we take their money, we’re looking good!",
            "title_similarity": "0.55136406",
            "sentiment_compound": 0.5696
        },
        {
            "id": "h3q9krg",
            "score": 1,
            "text": "Pls tell me india is on board",
            "title_similarity": "0.2898808",
            "sentiment_compound": 0.0772
        },
        {
            "id": "h3q9q6z",
            "score": 1,
            "text": "53 other nations looking forward to reaping some sweet sweet rewards. That’s the problem with all of these global initiatives that require at or near total corporation, always at least a few that ruin it for the rest. Classic game theory at work.",
            "title_similarity": "0.42281488",
            "sentiment_compound": 0.3818
        },
        {
            "id": "h3q9r4f",
            "score": 1,
            "text": "I would give this an award, but it has exactly 69 awards and I don't want to mess that up.",
            "title_similarity": "0.31772888",
            "sentiment_compound": 0.8216
        },
        {
            "id": "h3q9t9c",
            "score": 1,
            "text": "Suddenly, major companies now have their headquarters incorporated in the other 60 countries",
            "title_similarity": "0.59981805",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3qa2v4",
            "score": 1,
            "text": "This means giant international trade changes are coming  essentially any country who doesn't join with be blacklisted.",
            "title_similarity": "0.51535255",
            "sentiment_compound": -0.2235
        },
        {
            "id": "h3qa3z9",
            "score": 1,
            "text": "Could anyone ELI5 what the motivation of the current tax havens is for signing this deal?",
            "title_similarity": "0.54840416",
            "sentiment_compound": 0.34
        },
        {
            "id": "h3qa61h",
            "score": 1,
            "text": "Yes. This. Yes.",
            "title_similarity": "0.099222876",
            "sentiment_compound": 0.6597
        },
        {
            "id": "h3qa6h3",
            "score": 1,
            "text": "I would also like to see these countries put practices in place that basically FORCE those taxes to trickle back in to the economy.",
            "title_similarity": "0.51203454",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h3qact2",
            "score": 1,
            "text": "Banks/financial institutions being exempt means facebook will purchase venmo, amazon will purchase cash app.... every big corporation will become some type of bank, and we'll have a weird future where everyone's personality is based on what corporation they choose.  So, like Outer Worlds",
            "title_similarity": "0.6152023",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h3qah3s",
            "score": 1,
            "text": "Numerous international companies (such as Shell Oil) have been operating in Denmark for decades, and never paid a single dime in taxes.\n\nDoes this change that?",
            "title_similarity": "0.51561916",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3qaol6",
            "score": 1,
            "text": "Interesting. Very beneficial for richer countries though.",
            "title_similarity": "0.26149654",
            "sentiment_compound": 0.861
        },
        {
            "id": "h3qb5dy",
            "score": 1,
            "text": "Doesn’t this just give tiny non participating nations the ability to create a tax incentive to incorporate in their country? I agree corporations should be paying taxes, but how do we get around this problem?",
            "title_similarity": "0.6063694",
            "sentiment_compound": -0.2138
        },
        {
            "id": "h3qb5sz",
            "score": 1,
            "text": "A great first step to attacking global financial fraud",
            "title_similarity": "0.4820097",
            "sentiment_compound": -0.4019
        },
        {
            "id": "h3qbbkx",
            "score": 1,
            "text": "Never gonna happen!!!!!!!",
            "title_similarity": "0.00053533353",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3qbiil",
            "score": 1,
            "text": "This is actually a great idea because they wouldn't have a place to hide!\n\nHowever, best start at home, as many places in the world are already miles ahead in terms of corporation tax.",
            "title_similarity": "0.4754942",
            "sentiment_compound": 0.8356
        },
        {
            "id": "h3qbq2u",
            "score": 1,
            "text": "\"Lol taxes\"\n\n-every corporation",
            "title_similarity": "0.66218215",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h3qbq8k",
            "score": 1,
            "text": "The US Government won't seek nor implement any form of accountability for the donor-class. Expect this to be a great virtue signaling topic, with no actual content.",
            "title_similarity": "0.3320722",
            "sentiment_compound": 0.6908
        },
        {
            "id": "h3qbqf6",
            "score": 1,
            "text": "bla bla 👏",
            "title_similarity": "0.08589989",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3qbs5f",
            "score": 2,
            "text": "I didn’t know Reddit was made up of exclusively economists but this comment section really showed I was in the midst of the greatest economic minds of our generation \n\n/s",
            "title_similarity": "0.57456565",
            "sentiment_compound": 0.7783
        },
        {
            "id": "h3qbvpm",
            "score": 1,
            "text": "What!?",
            "title_similarity": "-0.050103307",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3qc1fc",
            "score": 2,
            "text": "Ireland ain’t playing.  Watch all the companies move to  Ireland.  Money follows the path of least taxation.",
            "title_similarity": "0.46486747",
            "sentiment_compound": 0.2023
        },
        {
            "id": "h3qclx8",
            "score": 1,
            "text": "That's like most of them lol",
            "title_similarity": "0.115653045",
            "sentiment_compound": 0.6771
        },
        {
            "id": "h3qcmln",
            "score": 1,
            "text": "I don't think Biden can even get this passed in the US, with the Senate the way it is.",
            "title_similarity": "0.33358842",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3qcyyo",
            "score": 2,
            "text": "You just need one country to not agree to ruin the whole plan",
            "title_similarity": "0.25657135",
            "sentiment_compound": 0.2411
        },
        {
            "id": "h3qdcqm",
            "score": 1,
            "text": "Calling it now. It won't pass the US senate",
            "title_similarity": "0.24999374",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3qdfo2",
            "score": 1,
            "text": "That would be lit",
            "title_similarity": "0.108365886",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3qdfwc",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "-0.02126519"
        },
        {
            "id": "h3qdmqm",
            "score": 1,
            "text": "Strange how this feels like nothing to me. Wait, are banks big corporations according to this?",
            "title_similarity": "0.51366246",
            "sentiment_compound": 0.1779
        },
        {
            "id": "h3qdogs",
            "score": 1,
            "text": "Massive. Now we need to work on government spending and get the same countries to agree to a maximum for military spending and campaign spending. \n\nWe're really in a bad place in the world right now and this is a start but won't do any good unless we fix the other problems we have at the same time.",
            "title_similarity": "0.5013939",
            "sentiment_compound": -0.8069
        },
        {
            "id": "h3qdxym",
            "score": 2,
            "text": "Maybe they will just all convert to religious institutions or non-profits. ‘I solemnly swear on the Book of Faces that the news story I just posted is absolutely true because many people say it is. /s",
            "title_similarity": "0.48058608",
            "sentiment_compound": 0.5709
        },
        {
            "id": "h3qevg8",
            "score": 1,
            "text": "And Ireland isn’t one as they know all the big companies will just leave. Apple owe the Irish government like 9billion and the government refuse to collect it.",
            "title_similarity": "0.44242728",
            "sentiment_compound": 0.0258
        },
        {
            "id": "h3qfa9s",
            "score": 1,
            "text": "Corporations about to move their offices to the moon.",
            "title_similarity": "0.4147622",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3qfi0x",
            "score": 1,
            "text": "Minimum... . Well done leaders.",
            "title_similarity": "0.12736507",
            "sentiment_compound": 0.2732
        },
        {
            "id": "h3qfps5",
            "score": 1,
            "text": "When’s the Amazon Christian Church opening then?",
            "title_similarity": "0.41077626",
            "sentiment_compound": 0.1779
        },
        {
            "id": "h3qg7kh",
            "score": 2,
            "text": "Now if we could get the states in the US to do the same, we’d be better off.\n\nRegardless, this is great!",
            "title_similarity": "0.352113",
            "sentiment_compound": 0.807
        },
        {
            "id": "h3qgaiy",
            "score": 1,
            "text": "Is Ireland one of these 130 countries?",
            "title_similarity": "0.46809384",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3qgcig",
            "score": 2,
            "text": "Now actually tax them and hold them accountable.",
            "title_similarity": "0.40587708",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3qgkex",
            "score": 1,
            "text": "It’s only “US” cos everyone else wanted a higher rate and the US pushed a lower one",
            "title_similarity": "0.27812427",
            "sentiment_compound": -0.296
        },
        {
            "id": "h3qhmax",
            "score": 2,
            "text": "It's nice to see the entire world agree on something that will make things better for everyone and the US not be the only country on the other side for once",
            "title_similarity": "0.3376125",
            "sentiment_compound": 0.802
        },
        {
            "id": "h3qhu2s",
            "score": 2,
            "text": "Where is the list of 130 countries?  Nice work media.",
            "title_similarity": "0.63261443",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h3qhyuo",
            "score": 1,
            "text": "Oh right, we failed to just create a tax on corporations trying to flee national taxes.",
            "title_similarity": "0.48058593",
            "sentiment_compound": -0.296
        },
        {
            "id": "h3qi4dt",
            "score": 1,
            "text": "Damn, Trisha is going to go triple nuts now.",
            "title_similarity": "0.23381294",
            "sentiment_compound": -0.6124
        },
        {
            "id": "h3qi8ow",
            "score": 1,
            "text": "15% isn’t enough but it’s a start! Tax these shitty, engorged companies and useless billionaires to hell and back, and use the funds on infrastructure, education and combating climate change.        \nI know that’s a pipe dream, the US is probably just gonna spend it on more guns to put on tanks that sit in warehouses until they rust over, but we can hope.",
            "title_similarity": "0.5335107",
            "sentiment_compound": -0.8988
        },
        {
            "id": "h3qicjg",
            "score": 2,
            "text": "They need to tax churches too, the amount of money some of those places make is insane.",
            "title_similarity": "0.33657765",
            "sentiment_compound": -0.4019
        },
        {
            "id": "h3qidft",
            "score": 1,
            "text": "So when will the US start to tax its own corporations then?",
            "title_similarity": "0.6592182",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3qiyys",
            "score": 1,
            "text": "I was hoping we signed it against expectations. Oh well.",
            "title_similarity": "0.13360016",
            "sentiment_compound": 0.5994
        },
        {
            "id": "h3qlfwa",
            "score": 2,
            "text": "Dumb plan is dumb",
            "title_similarity": "-0.07026094",
            "sentiment_compound": -0.765
        },
        {
            "id": "h3qm6x0",
            "score": 2,
            "text": "Make corrupt corprations richer",
            "title_similarity": "0.30046695",
            "sentiment_compound": 0.5267
        },
        {
            "id": "h3qmhdq",
            "score": 2,
            "text": "Watch the minimum tax rate be like 6% or whatever",
            "title_similarity": "0.3567406",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h3qmsbb",
            "score": 2,
            "text": "Unfortunately this only works if EVERY country is on board.",
            "title_similarity": "0.36917335",
            "sentiment_compound": -0.34
        },
        {
            "id": "h3qmzfw",
            "score": 2,
            "text": "Consumers pay 100% of all corporate taxes.",
            "title_similarity": "0.72573876",
            "sentiment_compound": -0.1027
        },
        {
            "id": "h3qn0ue",
            "score": 2,
            "text": "They'll just end up setting up their HQ on Mars and save tax there instead.",
            "title_similarity": "0.4338012",
            "sentiment_compound": 0.4939
        },
        {
            "id": "h3qo38o",
            "score": 2,
            "text": "There's a minimum wage, minimum tax sounds fair?  Even  though the minimum wage definitely isn't fair...",
            "title_similarity": "0.30894345",
            "sentiment_compound": 0.4657
        },
        {
            "id": "h3qo3a1",
            "score": 2,
            "text": "Yep that cost will trickle down for sure, the corporations always win one way or another",
            "title_similarity": "0.40281817",
            "sentiment_compound": 0.8074
        },
        {
            "id": "h3qp094",
            "score": 1,
            "text": "It’s like price fixing but in reverse.",
            "title_similarity": "0.20605953",
            "sentiment_compound": 0.1901
        },
        {
            "id": "h3qqzeu",
            "score": 2,
            "text": "Tax is one thing.  What to ***spend it on***, another thing entirely.",
            "title_similarity": "0.39479247",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3qsu2s",
            "score": 1,
            "text": "Great, I guess, but what does the parliamentarian think of it?",
            "title_similarity": "0.36400086",
            "sentiment_compound": 0.3716
        },
        {
            "id": "h3qtabk",
            "score": 1,
            "text": "They will find a way to not pay.",
            "title_similarity": "0.025533667",
            "sentiment_compound": 0.0762
        },
        {
            "id": "h3qtbm7",
            "score": 1,
            "text": "And the corps will move to the countries that didn't agree lol. Dumbest shit ice read in a while",
            "title_similarity": "0.41217893",
            "sentiment_compound": -0.6531
        },
        {
            "id": "h3qtjlo",
            "score": 1,
            "text": "Now do rich individuals too",
            "title_similarity": "0.3492682",
            "sentiment_compound": 0.5574
        },
        {
            "id": "h3qtk1k",
            "score": 1,
            "text": "This is a great step forward. \n\nRegardless of political affiliation, everyone should support this - to hold those with power responsible for paying their fair share.",
            "title_similarity": "0.4434977",
            "sentiment_compound": 0.9118
        },
        {
            "id": "h3qtn6e",
            "score": 1,
            "text": "Emphasis on minimum",
            "title_similarity": "0.03253614",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3qtvp8",
            "score": 2,
            "text": "If tax havents arent on board then I dont see what the big deal is here.",
            "title_similarity": "0.2848255",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3qukg9",
            "score": 1,
            "text": "Does anyone know which countries are holdouts? Theres 197 total nations I think, 130 signed. I hope the remainder are so improbable, like Yemen, and Syria that nobody would risk a post box there",
            "title_similarity": "0.540238",
            "sentiment_compound": 0.5542
        },
        {
            "id": "h3qv9mv",
            "score": 2,
            "text": "Only in dream, it never will get approved in the US.   Most corp pays very little tax now.  why would the politicians approve it?  Corps is where they get most of their campaign fund.",
            "title_similarity": "0.4299925",
            "sentiment_compound": -0.0854
        },
        {
            "id": "h3qvvfv",
            "score": 2,
            "text": "Headline makes it look as if they're trying something good for the corporations, but in fact they're just saving their asses.",
            "title_similarity": "0.40114802",
            "sentiment_compound": 0.2382
        },
        {
            "id": "h3qvw9b",
            "score": 1,
            "text": "Daddy",
            "title_similarity": "0.10114421",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3qw71s",
            "score": 1,
            "text": "Americans: \"Tax Corporations!\" \n\nDemocrats: \"Well, guess it's time to do the thing we all should have done fifty years ago.\"",
            "title_similarity": "0.6224046",
            "sentiment_compound": 0.3382
        },
        {
            "id": "h3qx26e",
            "score": 2,
            "text": "Now actually do it. And don't make any loopholes.",
            "title_similarity": "0.15313253",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3qx6n4",
            "score": 2,
            "text": "While we’re at it, can we start to tax churches too? You know who would pay taxes?\n\nJesus",
            "title_similarity": "0.52574843",
            "sentiment_compound": -0.1926
        },
        {
            "id": "h3qxf2j",
            "score": 1,
            "text": "Okay now enforce it",
            "title_similarity": "0.14910242",
            "sentiment_compound": 0.2263
        },
        {
            "id": "h3qxjup",
            "score": 1,
            "text": "No more tax evasion for billionaires",
            "title_similarity": "0.49106827",
            "sentiment_compound": -0.296
        },
        {
            "id": "h3qxonp",
            "score": 17,
            "text": "[The actual list of the countries](https://www.oecd.org/tax/beps/oecd-g20-inclusive-framework-members-joining-statement-on-two-pillar-solution-to-address-tax-challenges-arising-from-digitalisation-july-2021.pdf)",
            "title_similarity": "0.63120764",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3qy057",
            "score": 2,
            "text": "Regardless of the law there will be loop holes for the expensive lawyers to find",
            "title_similarity": "0.20376644",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3qy4kj",
            "score": 1,
            "text": "Could someone explain to me what this means for the working class?",
            "title_similarity": "0.25839373",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3qya4n",
            "score": 2,
            "text": "So, that's great but as long as there is one that doesn't, companies will keep being able to put a subsidiary there to shuffle all the money...no?",
            "title_similarity": "0.43240622",
            "sentiment_compound": 0.3716
        },
        {
            "id": "h3qyc03",
            "score": 2,
            "text": "If this actually happens I'll be first in line to give oral sex to every single lawmaker and world leader that actually pushed for it.\n\nBut I'm fairly certain that it's going to just fizzle out like every other push to regulate corporate greed. Good fucking luck getting the guys who can literally buy cities to ever follow anything that might make their precious bottom line smaller.",
            "title_similarity": "0.5745214",
            "sentiment_compound": 0.9493
        },
        {
            "id": "h3qydbk",
            "score": 2,
            "text": "Fuck that shit",
            "title_similarity": "-0.043229707",
            "sentiment_compound": -0.7964
        },
        {
            "id": "h3qze9l",
            "score": 2,
            "text": "Doesn’t matter because we can’t even get them to pay taxes in the countries that do tax them",
            "title_similarity": "0.3611557",
            "sentiment_compound": -0.0772
        },
        {
            "id": "h3qzoue",
            "score": 1,
            "text": "Too little, too late.",
            "title_similarity": "-0.03329304",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3r01ww",
            "score": 1,
            "text": "Irish eyes are smiling.",
            "title_similarity": "0.11194607",
            "sentiment_compound": 0.4588
        },
        {
            "id": "h3r08ss",
            "score": 1,
            "text": "It's finally happening!!!",
            "title_similarity": "0.18246931",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3r1io1",
            "score": 2,
            "text": "*on a nominal basis\n\nFixed it for you",
            "title_similarity": "0.19290906",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3r1y7t",
            "score": 1,
            "text": "Too all the naysayers, the words are very clear. 130 NATIONS agree...",
            "title_similarity": "0.5557982",
            "sentiment_compound": 0.659
        },
        {
            "id": "h3r2ruo",
            "score": 2,
            "text": "So what are they gonna do if another Trump takes office and pulls the US from this agreement?",
            "title_similarity": "0.43679368",
            "sentiment_compound": 0.5789
        },
        {
            "id": "h3r2wpf",
            "score": 2,
            "text": "They have to do this so companies don't have a place to move where they don't tax.",
            "title_similarity": "0.2672817",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3r3m8r",
            "score": 1,
            "text": "The planet needs this sooooo bad",
            "title_similarity": "0.03912314",
            "sentiment_compound": -0.5423
        },
        {
            "id": "h3r3r92",
            "score": 1,
            "text": "Whatever we can do helps… we should make the corporations make more plays in order to more easily assess how they are transitioning to the next fucking",
            "title_similarity": "0.42619246",
            "sentiment_compound": 0.6106
        },
        {
            "id": "h3r3vb1",
            "score": 1,
            "text": "BS tax break.global scale ...Outside nations wont be able to  sue big conglomeraes for monopoly",
            "title_similarity": "0.5332342",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3r3zkp",
            "score": 2,
            "text": "This will NEVER happen. I guarantee it, and you all forget about it.",
            "title_similarity": "0.14179453",
            "sentiment_compound": -0.3899
        },
        {
            "id": "h3r4gtx",
            "score": 1,
            "text": "~50 nations don't then?",
            "title_similarity": "0.24211134",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3r4rxw",
            "score": 2,
            "text": "So we're going to fix our broken policies by forcing others to raise their taxes? That seems backwards.",
            "title_similarity": "0.4449876",
            "sentiment_compound": -0.4767
        },
        {
            "id": "h3r55h6",
            "score": 3,
            "text": "So does this mean all the companies will simply move to the others 70-80 countries that have not agreed to support this proposal?",
            "title_similarity": "0.5327891",
            "sentiment_compound": -0.4717
        },
        {
            "id": "h3r6z4d",
            "score": 1,
            "text": "Wait, I thought Ireland said they would not agree… [Ireland hold out on corp tax. ](https://www.irishtimes.com/business/economy/ireland-one-of-9-countries-to-hold-out-on-signing-oecd-global-tax-deal-1.4609129)",
            "title_similarity": "0.50239325",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3r79sd",
            "score": 1,
            "text": "Having a hard time finding out how many current tax havens have signed on vs how many not.",
            "title_similarity": "0.35398185",
            "sentiment_compound": -0.1027
        },
        {
            "id": "h3r81ur",
            "score": 1,
            "text": "AhaahahahahahahaahahahahaaahahahhahahahahahahahahahahahahahahahahahahahahAhaahahahahahahaahahahahaaahahahhahahahahahahahahahahahahahahahahahahahahAhaahahahahahahaahahahahaaahahahhahahahahahahahahahahahahahahahahahahahahAhaahahahahahahaahahahahaaahahahhahahahahahahahahahahahahahahahahahahahahAhaahahahahahahaahahahahaaahahahhahahahahahahahahahahahahahahahahahahahahAhaahahahahahahaahahahahaaahahahhahahahahahahahahahahahahahahahahahahahahAhaahahahahahahaahahahahaaahahahhahahahahahahahahahahahahahahahahahahahahAhaahahahahahahaahahahahaaahahahhahahahahahahahahahahahahahahahahahahahah\n\nSupport.",
            "title_similarity": "0.088263705",
            "sentiment_compound": 0.4019
        },
        {
            "id": "h3r8c4u",
            "score": 1,
            "text": "Make it a gross receipts tax instead of a tax on net income. Too many loopholes/incentives/normal operations that enable multi-billion corporations to avoid net income for years if not decades. And while they pay real estate, payroll and other minor taxes, those are usually earmarked already for schools, roads, social security, etc and have little to no impact on general revenue.",
            "title_similarity": "0.49891332",
            "sentiment_compound": -0.6395
        },
        {
            "id": "h3raj9d",
            "score": 1,
            "text": "!remindme - 10 years",
            "title_similarity": "0.3367352",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3rak9m",
            "score": 1,
            "text": "Doesn’t it just take one country to sit this one out and THAT’S where they’ll invest their billions of dollars?",
            "title_similarity": "0.62195385",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3raoc9",
            "score": 2,
            "text": "Not going to work. If there is even one country a corporation can set up its headquarters to evade tax, it’s as good as nothing.",
            "title_similarity": "0.42275912",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h3raugo",
            "score": 2,
            "text": "Taxing the globe will surely end well…",
            "title_similarity": "0.252065",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h3rba89",
            "score": 1,
            "text": "Fun fact, this would eliminate the Digital Services Tax, so big tech companies would actually end up paying less in taxes. I guess Janet Yellen is making friends in Silicon Valley. \n\nSource: differ to the bot. Down vote if it doesn’t show up, I’ll notice and share.",
            "title_similarity": "0.48204452",
            "sentiment_compound": 0.8225
        },
        {
            "id": "h3rbk58",
            "score": 1,
            "text": "\"we agree that the minimum tax is 0.001%\"",
            "title_similarity": "0.44776827",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h3rbooc",
            "score": 1,
            "text": "I like the thought behind it, but it ain't going to mean shit because it is relying on nearly every other country being trustworthy and the corporations not corrupting small governments and officials for special backroom deals. You want to operate in X country and sell products there you need to pay the full taxes there just as if your company was based there. You try and do anything shady and move money out of the country to avoid taxes? Then you should be barred from selling product in country. Im talking your shit gets pulled off the shelves, your assets seized, and warrants going out for anybody from that company trying to operate or sell product within the country until their tax payment is paid in full. No special court deals, no moving money around through other shell corps, no reprieve for pending cases and fines, full payment and nothing else or they can fuck off to whatever tax haven they come from and never return.",
            "title_similarity": "0.48742068",
            "sentiment_compound": -0.9407
        },
        {
            "id": "h3rbzze",
            "score": 1,
            "text": "If they don't remove loopholes, it's a moot point. In the US removal of loopholes would negate the need for an increase in corporate taxes, so it would look good to the republican citizenry (if not the corporations themselves). For instance, an increase in asset value could be taxed just like a capital gain is. The big problem -- enforcement; that always takes the wind out of world-wide resolutions of any sort.",
            "title_similarity": "0.49553323",
            "sentiment_compound": 0.9274
        },
        {
            "id": "h3rc2vt",
            "score": 1,
            "text": "From -3% to 0% lmao",
            "title_similarity": "0.14047432",
            "sentiment_compound": 0.5994
        },
        {
            "id": "h3rc9ae",
            "score": 2,
            "text": "Yea this isn’t good.",
            "title_similarity": "-0.14570504",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h3red4v",
            "score": 1,
            "text": "We've still got it baby!",
            "title_similarity": "0.1742526",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3rev8n",
            "score": 1,
            "text": "> The deal also reportedly includes a framework to eliminate digital services taxes, which targeted the biggest American tech companies.\n\n> In their place, officials agreed to a new tax plan that would be linked to the places where multinationals are actually doing business, rather than where they are headquartered.\n\n\n\nSo someone with more knowledge on tax law tell me if this is a good or bad thing, because this sounds like: Coubtries who already charge companies taxes agree to continue charging them tax, while the countries that historically haven't continue to not charge them tax **and** the companies get to pay less tax anyway.",
            "title_similarity": "0.59315574",
            "sentiment_compound": 0.6249
        },
        {
            "id": "h3rexac",
            "score": 1,
            "text": "I love how collusions only legal when the government does it",
            "title_similarity": "0.40316573",
            "sentiment_compound": 0.6908
        },
        {
            "id": "h3reyyl",
            "score": 1,
            "text": "That would suck! National sovereignty is disappearing but countries such as Russia and China WILL maintain theirs, especially China.",
            "title_similarity": "0.36742407",
            "sentiment_compound": -0.3054
        },
        {
            "id": "h3reznr",
            "score": 1,
            "text": "Shoutout to all the people who know so much about taxes in this thread. Honestly, it’s funny how people see taxes. A 15% minimum that the current US administration is proposing would mean that they still want to raise them more above that. In doing so perpetuating the issue but just making it so they are at least paying the tax in a low-tax jurisdiction. Transfer pricing looks at this already for the US and so does the FCC (Foreign controlled Corporation) taxes. This is me explaining this, My stance is that corporations CAN not that they do more good with the same amount of money than most governments and their corruption.",
            "title_similarity": "0.67534137",
            "sentiment_compound": 0.8121
        },
        {
            "id": "h3rf4k8",
            "score": 1,
            "text": "Will there be money involved?",
            "title_similarity": "0.100813486",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3rf7m9",
            "score": 1,
            "text": "And churches. Tax them.",
            "title_similarity": "0.42258728",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3rf9ix",
            "score": 1,
            "text": "We can’t even make people in our country pay taxes how tf would we be able to make people pay taxes internationally, decent idea just impossible to achieve",
            "title_similarity": "0.40582365",
            "sentiment_compound": -0.2023
        },
        {
            "id": "h3rfbvk",
            "score": 1,
            "text": "Why are people crying about how this won’t happen? 130 countries have already agreed to it",
            "title_similarity": "0.5249757",
            "sentiment_compound": -0.25
        },
        {
            "id": "h3rfe7t",
            "score": 1,
            "text": "I hate that it’s coming down to this but fuck the corporations for not paying their fair share",
            "title_similarity": "0.2377424",
            "sentiment_compound": -0.7746
        },
        {
            "id": "h3rff96",
            "score": 1,
            "text": "Is the US proposal a minimum of zero percent? Because tgats what i would expect from the US these days",
            "title_similarity": "0.38980448",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3rfl1y",
            "score": 1,
            "text": "Out here advocating for shit we don’t even do.",
            "title_similarity": "0.082924135",
            "sentiment_compound": -0.5574
        },
        {
            "id": "h3rfx9g",
            "score": 1,
            "text": "I REALLY need an ELI5.",
            "title_similarity": "0.15016478",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3rg347",
            "score": 1,
            "text": "So many people think this is some sort of victory for the people.\n\nOur government's institutions have been long since intertwined with all sorts of private businesses. There is plenty of value for large multinational companies to be apart of this and likely will have all sorts of influence to help ensure they can hold onto their market share and make it ever more difficult for any upstarts to come along and challenge them.",
            "title_similarity": "0.5532582",
            "sentiment_compound": 0.7512
        },
        {
            "id": "h3rg4g1",
            "score": 1,
            "text": "Once this includes all of the off shore havens that we all know exist but no one puts a thumb on then it’s not news. Trillions are off shore! To put this in perspective, if you were given $1M a day for 2000 YEARS that’s only $730B.",
            "title_similarity": "0.5539504",
            "sentiment_compound": -0.4753
        },
        {
            "id": "h3rgt81",
            "score": 1,
            "text": "The United States has not assumed the responsibility of a great power at all, and it has done nothing to help countries around the world except to go to war everywhere and accelerate the spread of the epidemic. He also slandered China as an accelerationist country. In fact, he is the real accelerationist country.\n\nhttps://www.backchina.com/forum/20210624/info-1868192-1-1.html",
            "title_similarity": "0.46914545",
            "sentiment_compound": 0.1882
        },
        {
            "id": "h3rh3b0",
            "score": 1,
            "text": "Did South Sudan agree? Because that’s all I care about",
            "title_similarity": "0.24495247",
            "sentiment_compound": 0.6908
        },
        {
            "id": "h3rh9ba",
            "score": 1,
            "text": "\"But without government, corporations would just collude to form monopolies to dominate the market!\"\n\n> governments proceeds to collude to form monopolies to dominate the market",
            "title_similarity": "0.5145452",
            "sentiment_compound": -0.4199
        },
        {
            "id": "h3rheec",
            "score": 1,
            "text": "Good start.",
            "title_similarity": "0.11553228",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h3rhn26",
            "score": 1,
            "text": "Tax everyone, big corporations, banks, schools, hospitals, and especially churches",
            "title_similarity": "0.5737883",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3rhz21",
            "score": 1,
            "text": "Time to incorporate in sealand.",
            "title_similarity": "0.25633946",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3rieje",
            "score": 1,
            "text": "And the global minimum the U.S. is proposing is…\nNOTHIIIIIIIING!",
            "title_similarity": "0.46412787",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3rk2j8",
            "score": 1,
            "text": "can someone explain to me how companies that refuse to pay tax, US Republican Mitch McConnell saying they aren’t going to pay it and the framework to eliminate digital services taxes, which targeted the biggest American tech companies means things are actually going to change?",
            "title_similarity": "0.5184706",
            "sentiment_compound": -0.4588
        },
        {
            "id": "h3rlqsu",
            "score": 1,
            "text": "Laughs in China",
            "title_similarity": "0.32447183",
            "sentiment_compound": 0.4939
        },
        {
            "id": "h3rlrny",
            "score": 1,
            "text": "Isn’t that like most of the UN at this point or something?",
            "title_similarity": "0.33343273",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h3rm1aq",
            "score": 1,
            "text": "Economic ignorance springs eternal.",
            "title_similarity": "0.26315933",
            "sentiment_compound": -0.3612
        },
        {
            "id": "h3rmyos",
            "score": 1,
            "text": "I gotta pay 20%+ as long as they pay their fair share, I don’t give a damn.",
            "title_similarity": "0.5228441",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3rnlc8",
            "score": 1,
            "text": "Why now?",
            "title_similarity": "-0.006947238",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3rnpby",
            "score": 1,
            "text": "Bezos will just implement two day shipping from Mars.",
            "title_similarity": "0.42383134",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3rnw6n",
            "score": 1,
            "text": "but not North Korea.",
            "title_similarity": "0.07749334",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3rnwzc",
            "score": 2,
            "text": "Not sure why everyone is hyped about this. It's not like the government is going to tax the regular guy less. It's literally just one corrupt group extorting another corrupt group, nothing more.",
            "title_similarity": "0.3850985",
            "sentiment_compound": -0.4717
        },
        {
            "id": "h3ro3fn",
            "score": 1,
            "text": "I hope they do it fairly.",
            "title_similarity": "0.06884045",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h3rop3c",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "-0.02126519"
        },
        {
            "id": "h3royx2",
            "score": 1,
            "text": "US will probably be the only place that won't actually implement it",
            "title_similarity": "0.15131092",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3rp8iz",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "-0.02126519"
        },
        {
            "id": "h3rpbej",
            "score": 1,
            "text": "130 corporations agree to set minimum pricing...",
            "title_similarity": "0.85188425",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h3rpejw",
            "score": 3,
            "text": "So.. Ireland and the Cayman Islands are in..?",
            "title_similarity": "0.268099",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3rqbvx",
            "score": 2,
            "text": "Can we tax churches listed as corporations?",
            "title_similarity": "0.5992747",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3rqfsp",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "-0.02126519"
        },
        {
            "id": "h3rqz6g",
            "score": 2,
            "text": "Thank GOD. Christ it’s about damn time.",
            "title_similarity": "0.25048497",
            "sentiment_compound": 0.3885
        },
        {
            "id": "h3rrco4",
            "score": 1,
            "text": "With all the tax evading corporations do, I'm worried this will do nothing in the end.",
            "title_similarity": "0.41508374",
            "sentiment_compound": -0.296
        },
        {
            "id": "h3rrdqg",
            "score": 1,
            "text": "It doesn’t matter what anyone else payin like how is that helping us like just cuz we both get hurt that don’t mean I’m cool wit it like df",
            "title_similarity": "0.19845639",
            "sentiment_compound": 0.7717
        },
        {
            "id": "h3rrpw4",
            "score": 1,
            "text": "Wholesome as fuck.",
            "title_similarity": "0.18546653",
            "sentiment_compound": -0.5423
        },
        {
            "id": "h3rrrbr",
            "score": 1,
            "text": "No taxation without representation",
            "title_similarity": "0.38196576",
            "sentiment_compound": -0.296
        },
        {
            "id": "h3rry5h",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "-0.02126519"
        },
        {
            "id": "h3rs7dy",
            "score": 1,
            "text": "how does this affect me, a normie?",
            "title_similarity": "0.08959924",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3rsajs",
            "score": 1,
            "text": "global democracy will never be a thing until we strip the veto from the UN and give the UN actual law making powers",
            "title_similarity": "0.51179147",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3rss3l",
            "score": 2,
            "text": "This is the dumbest idea ever.",
            "title_similarity": "0.03742903",
            "sentiment_compound": -0.5106
        },
        {
            "id": "h3rsvz6",
            "score": 2,
            "text": "Fucking finally!",
            "title_similarity": "0.1089032",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3rsx1o",
            "score": 1,
            "text": "Any experts able to weigh in on what effect this 15% tax would have?",
            "title_similarity": "0.5925462",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3rt4t7",
            "score": 3,
            "text": "The world benefits from more educated people and more science literate people that this tax policy could fund\n\nCancer can be cured faster if this tax pans out",
            "title_similarity": "0.46202743",
            "sentiment_compound": -0.4215
        },
        {
            "id": "h3rtd6o",
            "score": 2,
            "text": "No way this should ever be implemented. The world isn’t one country, the attempt to give international groups even more leverage is insane. Every country can have its own laws and be happy, no need to force other countries to comply with another countries rules.",
            "title_similarity": "0.3846955",
            "sentiment_compound": -0.3947
        },
        {
            "id": "h3rtm1l",
            "score": 1,
            "text": "Why not implement a politician tax?",
            "title_similarity": "0.48005605",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3rv0fb",
            "score": 1,
            "text": "This is the central character of future politics. The way countries dispose their relationships with corporations should resemble the way they dispose their foreign policies.",
            "title_similarity": "0.5608684",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3rv6c2",
            "score": 2,
            "text": "Can someone tell me if this is true? I heard that when companies are given tax breaks they tend to hoard the money and let it stay stationary without any kind of action. Thus going against the main reason for tax breaks In the first place. Is this true?",
            "title_similarity": "0.45173347",
            "sentiment_compound": 0.7514
        },
        {
            "id": "h3rvjj4",
            "score": 2,
            "text": "As a working class person, I love being fucked by my corporate slave masters!",
            "title_similarity": "0.3492786",
            "sentiment_compound": -0.126
        },
        {
            "id": "h3rwqz9",
            "score": 1,
            "text": "does US tax at 15%?",
            "title_similarity": "0.6031038",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3rwtq5",
            "score": 1,
            "text": "How many countries aren’t the problem, how many are NOT are being used by these people.",
            "title_similarity": "0.29869008",
            "sentiment_compound": -0.4019
        },
        {
            "id": "h3rx8mq",
            "score": 1,
            "text": "https://t.me/joinchat/3oiyluG5VahhZGNk",
            "title_similarity": "0.23847881",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3ry3ur",
            "score": 1,
            "text": "Seo linn, Éire...",
            "title_similarity": "0.13043317",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3ry9o0",
            "score": 1,
            "text": "Looks like companies just found about 60 good candidates for hq",
            "title_similarity": "0.5440755",
            "sentiment_compound": 0.6597
        },
        {
            "id": "h3ryqen",
            "score": 1,
            "text": "And…",
            "title_similarity": "0.01053991",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3rz2lm",
            "score": 2,
            "text": "Does this mean consumers have to pay more?",
            "title_similarity": "0.276999",
            "sentiment_compound": -0.1027
        },
        {
            "id": "h3rzf0b",
            "score": 1,
            "text": "184 nations also just voted in the UN General Assembly to support a resolution calling for an end of the US blockade of Cuba...for the 29th year in a row. The US only cares about justice and democracy when it stands to benefit their interests.",
            "title_similarity": "0.51938856",
            "sentiment_compound": 0.9201
        },
        {
            "id": "h3rzkry",
            "score": 2,
            "text": "Of course they are, it’s ultimately absorbed by the consumer and not the business.",
            "title_similarity": "0.3175217",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3rzrth",
            "score": 1,
            "text": "Wtf",
            "title_similarity": "0.096440434",
            "sentiment_compound": -0.5859
        },
        {
            "id": "h3s126w",
            "score": 1,
            "text": "What about churches?",
            "title_similarity": "0.2095677",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3s17x5",
            "score": 1,
            "text": "First of, wasn't then USA' idea, second, biden didn't push for 15% they already agreed on it...why do the american medias always twist the stories ?just be real...",
            "title_similarity": "0.55618596",
            "sentiment_compound": 0.2732
        },
        {
            "id": "h3s1hch",
            "score": 1,
            "text": "So everything's gonna turn into crypto corporations. Run on their own Blockchain.\n\nSelf contained economies",
            "title_similarity": "0.53702253",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3s1iwv",
            "score": 1,
            "text": "One kink in the armor and they keep getting away with not paying any taxes. It only takes one country to not join.",
            "title_similarity": "0.37338728",
            "sentiment_compound": -0.2235
        },
        {
            "id": "h3s3itp",
            "score": 2,
            "text": "I don’t get it, doesn’t the US have the same problem with Delaware? A state in their own country for which they haven’t found a solution yet. Will anything happen with nations far away miles from you and where you have absolutely no jurisdiction on?",
            "title_similarity": "0.32833263",
            "sentiment_compound": -0.5028
        },
        {
            "id": "h3s4e47",
            "score": 1,
            "text": "Unless the market comes into picture",
            "title_similarity": "0.09011439",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3s5pq4",
            "score": 1,
            "text": "Lmao. 130 isn’t ALL. Africa or some ridiculous place will become the next tax haven. Nice try though buttheads.",
            "title_similarity": "0.46611825",
            "sentiment_compound": 0.6369
        },
        {
            "id": "h3s6a2r",
            "score": 1,
            "text": "[deleted]",
            "title_similarity": "0.0017693602"
        },
        {
            "id": "h3s6z91",
            "score": 1,
            "text": "Fuck you corporations",
            "title_similarity": "0.28746295",
            "sentiment_compound": -0.5423
        },
        {
            "id": "h3s703i",
            "score": 2,
            "text": "Do they agree to get rid of all the tax loopholes and subsidies that turn a 30% tax rate  into either a 0% tax or even a source of revenue?",
            "title_similarity": "0.6049842",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h3s7rl9",
            "score": 1,
            "text": "The difference between tax evasion and tax avoidance is a good lawyer, the rich still won’t pay 😴\n\nThey should have public voluntary tax, company’s who don’t pay to the benefit of the community’s in which they operate are publicly ostricized",
            "title_similarity": "0.4361013",
            "sentiment_compound": 0.7184
        },
        {
            "id": "h3s95r0",
            "score": 1,
            "text": "If this many nations signed on this quickly it gives hope that a tax on stock purchases could be done. One of the great fears is that if it is implemented on one stock exchange, corporations would just list their stocks on another exchange. This would be impossible if all agreed to implement the tax. I've always like the stock tax because the little guy doesn't own enough to make a difference & usually holds on to them for the long term. It also penalizes really quick trades which puts in a built in safeguard on volatility in the age of computer trades. I remember over a decade ago infographics showing how a 1 tenth of 1 percent tax would easily pay for healthcare.",
            "title_similarity": "0.54524225",
            "sentiment_compound": 0.9081
        },
        {
            "id": "h3s9oy1",
            "score": 1,
            "text": "So what happens if a country signs up and doesn't charge the minimum.  Will it be like any EURO agreement that is not enforceable?",
            "title_similarity": "0.32433206",
            "sentiment_compound": 0.6908
        },
        {
            "id": "h3s9tqo",
            "score": 1,
            "text": "Wouldve been nice 30yrs ago. The damage is already done and the wealth is gone.",
            "title_similarity": "0.33838168",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h3s9vj0",
            "score": 1,
            "text": "This just sounds like bullshit to satiate me.",
            "title_similarity": "0.009203505",
            "sentiment_compound": -0.3182
        },
        {
            "id": "h3sa8ch",
            "score": 1,
            "text": "It'd be funny if the upvotes associated with this post reflected reality.",
            "title_similarity": "0.15745308",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h3safz7",
            "score": 1,
            "text": "Finally",
            "title_similarity": "0.030605394",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3sar6r",
            "score": 1,
            "text": "This was not a US proposal.\nThe US government, being one of the most supportive towards corporations ever,  with a higher prison population than any civilization in history, did not propose this positive step....",
            "title_similarity": "0.552912",
            "sentiment_compound": 0.5335
        },
        {
            "id": "h3sas6o",
            "score": 1,
            "text": "okay! Good news",
            "title_similarity": "0.11296187",
            "sentiment_compound": 0.6239
        },
        {
            "id": "h3sbj95",
            "score": 1,
            "text": "Bigger taxes only equal to a bigger reason to find loopholes and lobby lawmakers.\n\nSimple as that.",
            "title_similarity": "0.51987267",
            "sentiment_compound": 0.0258
        },
        {
            "id": "h3sbjuw",
            "score": 1,
            "text": "To whom would the tax be paid? The banks already own the world",
            "title_similarity": "0.61469084",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3scfwg",
            "score": 1,
            "text": "i'm america and i'm claiming the proposal made by the G7 because i'm a piece of shit",
            "title_similarity": "0.41656902",
            "sentiment_compound": -0.5574
        },
        {
            "id": "h3sdm0y",
            "score": 1,
            "text": "US proposal? That was a joint venture from Germany and France with the US hopping on  \n\n\n  \nIt's Biontech all over again",
            "title_similarity": "0.45663184",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3sdvip",
            "score": 1,
            "text": "Ya but it's only 15%. Many countries have a much higher tax rate than this. I don't think much is going to change",
            "title_similarity": "0.55943453",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3se7k4",
            "score": 1,
            "text": "FIFTEEN PERCENT! I’d like to pay 15%!! I guess it’s a start",
            "title_similarity": "0.55735755",
            "sentiment_compound": 0.4545
        },
        {
            "id": "h3see8y",
            "score": 1,
            "text": "The money grab continues",
            "title_similarity": "0.1907162",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3sej66",
            "score": 1,
            "text": "So tax on global corporations should be as minimum as possible.",
            "title_similarity": "0.5539721",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3sf2ei",
            "score": 1,
            "text": "In other news, Cayman Islands starts subdividimg property to make room. You only need one leak to drain an ocean full of good intentions.",
            "title_similarity": "0.46410102",
            "sentiment_compound": 0.128
        },
        {
            "id": "h3sfdoc",
            "score": 1,
            "text": "Can someone break down exactly what this means for someone with a room temperature IQ (Me)? Thanks. I know I’ll be downvoted to admitting to not knowing something but I’m fine with that if it provides the potential someone will help me.",
            "title_similarity": "0.3108074",
            "sentiment_compound": 0.7717
        },
        {
            "id": "h3sfeph",
            "score": 1,
            "text": "U.S. leading the charge like always! Surprised so many still hate us.",
            "title_similarity": "0.2824018",
            "sentiment_compound": -0.2157
        },
        {
            "id": "h3sfgdq",
            "score": 2,
            "text": "The problem is not closing loopholes. The problem is countries are not providing sufficient value to corporations. Corporations would pay taxes if it benefited them in any way. \nNow they’re just going to move money to one of those countries not on this list.",
            "title_similarity": "0.4956145",
            "sentiment_compound": -0.7805
        },
        {
            "id": "h3sfh1l",
            "score": 1,
            "text": "so what are the 130 nations exactly?",
            "title_similarity": "0.52773273",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3sfkpo",
            "score": 1,
            "text": "Is there a link to see which nations have agreed to this? I didn’t see it in the article, maybe I’m blind",
            "title_similarity": "0.26930636",
            "sentiment_compound": -0.1531
        },
        {
            "id": "h3sfmp7",
            "score": 1,
            "text": "People mention how this might hurt Ireland a bit, but probably more so a lot of the [tax havens ](https://www.google.com/amp/s/amp.theguardian.com/business/2021/mar/09/uk-overseas-territories-top-list-of-worlds-leading-tax-havens) in the Caribbean - a few of them [British territories.](https://www.google.com/amp/s/theconversation.com/amp/g7-deal-uk-is-badly-conflicted-between-offshore-tax-havens-and-bidens-global-tax-drive-162190)\n\nIf the UK tries to force them into line then maybe independence movements would grow in places like Bermuda. Not sure if them getting independence makes it easier or harder for them to carry on operating as they are.\nhttp://www.jfichtner.net/visualizations-of-global-finance/",
            "title_similarity": "0.40969944",
            "sentiment_compound": 0.5118
        },
        {
            "id": "h3sfz8p",
            "score": 1,
            "text": "Make it 35%.",
            "title_similarity": "0.30622762",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3sg0a8",
            "score": 1,
            "text": "Make it 35%.",
            "title_similarity": "0.30622762",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3silrd",
            "score": 1,
            "text": "Corporate Income tax is too easily manipulated by accounting techniques. There should be a minimum tax that is based on their gross receipts.",
            "title_similarity": "0.52351075",
            "sentiment_compound": -0.5106
        },
        {
            "id": "h3snvdv",
            "score": 1,
            "text": "I'm sure Chinese businesses are included.. this is NONSENSE.",
            "title_similarity": "0.35582727",
            "sentiment_compound": -0.2808
        },
        {
            "id": "h3sr5l7",
            "score": 1,
            "text": "All the while German capitalists use that global minimum tax to pressure German govt to lower corporate tax. Go figure why so many countries support it!",
            "title_similarity": "0.6027865",
            "sentiment_compound": -0.1848
        },
        {
            "id": "h3srpki",
            "score": 1,
            "text": "Ensuring the end of corporate structures everywhere….",
            "title_similarity": "0.37286362",
            "sentiment_compound": 0.2732
        },
        {
            "id": "h3ssyg5",
            "score": 1,
            "text": "Yes, go President Biden!",
            "title_similarity": "0.4579645",
            "sentiment_compound": 0.4574
        },
        {
            "id": "h3stwkj",
            "score": 1,
            "text": "Sooo....non-binding, then? lol",
            "title_similarity": "0.023756206",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h3svbuu",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "-0.02126519"
        },
        {
            "id": "h3syr49",
            "score": 1,
            "text": "I bet CNBC actually likes this because Comcast/GE has most of its taxable assets and such already within the domestic realm. They can't make copper wires in the dirt very \"global.\" It's hard to make a collection of local monopolies into what they're literally not.  \n\n\nBut if everyone of their corporate peers gets leveled by a tax, a lowering tide, lowers all ships except the ones that hit ground. While everyone around them was reaching, reaching, reaching, they chose another strategy. And here comes a winter storm next to the warm ant's home.",
            "title_similarity": "0.5566331",
            "sentiment_compound": 0.4621
        },
        {
            "id": "h3szqnv",
            "score": 2,
            "text": "Now if we could just to the same thing with the fifty states _within_ the United States. The race to the bottom there is just as self-defeating.",
            "title_similarity": "0.38934964",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h3t0nxg",
            "score": 1,
            "text": "So apparently Reddit thinks anti-competitive practices are somehow okay when it's governments doing it...",
            "title_similarity": "0.4566126",
            "sentiment_compound": 0.2263
        },
        {
            "id": "h3t9pep",
            "score": 1,
            "text": "We're fucked.",
            "title_similarity": "-0.027770892",
            "sentiment_compound": -0.6597
        },
        {
            "id": "h3tbx5d",
            "score": 2,
            "text": "\"Could City of London be exempt?\"\n\ngtfo brits lol",
            "title_similarity": "0.3592419",
            "sentiment_compound": 0.4939
        },
        {
            "id": "h3tmowk",
            "score": 1,
            "text": "oh good, more money for governments to squander. \n\nthis will end well.",
            "title_similarity": "0.43203276",
            "sentiment_compound": 0.6124
        },
        {
            "id": "h3u21kr",
            "score": 1,
            "text": "Somebody just played the ACE",
            "title_similarity": "0.1958561",
            "sentiment_compound": 0.34
        },
        {
            "id": "h3u22t0",
            "score": 1,
            "text": "Whaaaat? Somebody just played the ACE",
            "title_similarity": "0.22492915",
            "sentiment_compound": 0.34
        },
        {
            "id": "h3ulhy8",
            "score": 1,
            "text": "What happens if you don’t get 100%? Where does the money go? Do we go to war to force those countries to tax the rich? Are any of these 130 nations known tax havens?  Is China on board? If not how does this help?\n\nLet’s be honest the US and the Biden administration got all excited like someone who hasn’t thought everything through and exclaimed, “I know, we’ll tax the rich!!!” As if nobody else thought of that, then like Smithers from the Simpsons someone came over and said, “Sir they’ll just move their money somewhere else.” So Old man Biden says, “I know we’ll get everyone to tax the rich!!!” Except many countries do quite well by simply offering extremely low tax rates, and the unintended consequence of banding together to tax the rich will be these countries do extremely well.",
            "title_similarity": "0.62972367",
            "sentiment_compound": 0.9668
        },
        {
            "id": "h3vv0dd",
            "score": 2,
            "text": "The world takes a tiny step away from mega-corp controlled dystopia.",
            "title_similarity": "0.23608364",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3w0x88",
            "score": 1,
            "text": "Give it to me straight Reddit people who are smarter than me, is this good?",
            "title_similarity": "0.38722098",
            "sentiment_compound": 0.8061
        },
        {
            "id": "h3y6tsf",
            "score": 1,
            "text": "This is so that the Democrats can raise taxes without fear of companies leaving. That’s all democrats do in office, increase their revenue and increase their power.",
            "title_similarity": "0.51435506",
            "sentiment_compound": 0.7374
        },
        {
            "id": "h40b9g6",
            "score": 1,
            "text": "Those corporations will still dodge taxes like they always do. Cayman Islands and the like",
            "title_similarity": "0.3506056",
            "sentiment_compound": 0.6124
        },
        {
            "id": "h4256r3",
            "score": 1,
            "text": "Why does that message keep popping up?",
            "title_similarity": "0.09455335",
            "sentiment_compound": 0.0
        },
        {
            "id": "h4bammw",
            "score": 1,
            "text": "Why should we believe other nations they couldn't pay their NATO  tab. What a joke. We don't need more taxes",
            "title_similarity": "0.45571804",
            "sentiment_compound": 0.3603
        },
        {
            "id": "h4n17zu",
            "score": 1,
            "text": "We are going to a cashless society so it should be automatically removed before received",
            "title_similarity": "0.32494497",
            "sentiment_compound": 0.0
        },
        {
            "id": "h4nqp8v",
            "score": 1,
            "text": "This is a terrible idea.",
            "title_similarity": "-0.09777965",
            "sentiment_compound": -0.4767
        },
        {
            "id": "h50c1oc",
            "score": 1,
            "text": "globalist taxing the sheep lmao, this reddit page is horse shit",
            "title_similarity": "0.28666496",
            "sentiment_compound": 0.0772
        },
        {
            "id": "h55hp86",
            "score": 1,
            "text": "Fuck no can we please not infect the rest of the world with our NOT CURRENTLY functioning tax system.",
            "title_similarity": "0.34567052",
            "sentiment_compound": -0.5267
        },
        {
            "id": "h56acc6",
            "score": 1,
            "text": "You cannot tax yourself into prosperity but you can tax yourself into the poor house.  If you tax corporations at higher rates they will pass on those taxes to those they serve.  Absolute stupidity to support this.",
            "title_similarity": "0.5164588",
            "sentiment_compound": -0.6652
        },
        {
            "id": "h57gnro",
            "score": 1,
            "text": "Biden is an ass!",
            "title_similarity": "-0.017429687",
            "sentiment_compound": -0.5848
        },
        {
            "id": "h57vmdp",
            "score": 1,
            "text": "Unfortunately the US does not support the proposal. What an absolutely terrible idea. This must be opposed with every effort we can muster.",
            "title_similarity": "0.08659754",
            "sentiment_compound": -0.7936
        },
        {
            "id": "h5envcj",
            "score": 1,
            "text": "Doesn't mean it's any less of a terrible idea",
            "title_similarity": "0.02205781",
            "sentiment_compound": -0.4284
        },
        {
            "id": "h5gf7vj",
            "score": 1,
            "text": "Yeah, this will work ... ugh.",
            "title_similarity": "0.08937241",
            "sentiment_compound": -0.1531
        },
        {
            "id": "h5hlv7y",
            "score": 1,
            "text": "Does that include Singapore?",
            "title_similarity": "0.14673",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5qbpj9",
            "score": 1,
            "text": "Wow. More taxes. Y am i not surprised?",
            "title_similarity": "0.43126655",
            "sentiment_compound": 0.4826
        },
        {
            "id": "h6343ss",
            "score": 1,
            "text": "130 nations agree with the US Government that there should be a minimum on the theft of resources from the citizenry into the abyss of theft, fraud and abuse that is the vast majority of national governments.",
            "title_similarity": "0.67420244",
            "sentiment_compound": -0.7579
        },
        {
            "id": "h6e735e",
            "score": 1,
            "text": "\"Can't just go arresting the thieve's guild!\"",
            "title_similarity": "0.27780807",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6jg9gw",
            "score": 1,
            "text": "Gobal marxist crap, wanna start a war? This is how you do it.",
            "title_similarity": "0.28674036",
            "sentiment_compound": -0.7579
        },
        {
            "id": "h6jw401",
            "score": 1,
            "text": "Here come the new world order agenda",
            "title_similarity": "0.29968768",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfwyu4z",
            "score": 1,
            "text": "Ireland got exceptions approved.  \nOnly applies to \"small\" companies above €750 million. WTF??  \n I'm done subsidizing the leprechauns.",
            "title_similarity": "0.551913",
            "sentiment_compound": -0.4754
        }
    ]
}