{
    "Boris Johnson pushes for Russia to be ejected from Swift payment system\n": [
        {
            "id": "hy9pak5",
            "score": 0,
            "text": "Fuck me, I'd never thought I'd be cheering the 'british Trump' against the decisions of his other european counterparts (like Germany). \n\nLife is cruel joke.",
            "title_similarity": "0.446369",
            "sentiment_compound": -0.0772
        },
        {
            "id": "hy9bkei",
            "score": -7,
            "text": "He's very eager for others to be sanctioning, but rather tepid in his own sanctions. Lead by example if you're really that committed, maybe?\n\nNot that huge plies of Russian cash being stuffed into his and his political party's pockets might be a cause for his weak sanctions announced so far? No of course not.",
            "title_similarity": "0.57635385",
            "sentiment_compound": -0.7101
        },
        {
            "id": "hy9gmow",
            "score": -8,
            "text": "[deleted]",
            "title_similarity": "0.39116004"
        },
        {
            "id": "hy9rwf3",
            "score": -4,
            "text": "Germany, Italy, Hungary blocking this. All attackers from second world war. Coincidence ?",
            "title_similarity": "0.5701971",
            "sentiment_compound": -0.8807
        },
        {
            "id": "hy9r3q9",
            "score": -1,
            "text": "This is literally cutting your nose off to spite your face. Astonishing how few people on here understand the ramifications of going forth with such a measure. You really going to trust a blundering buffoon like Boris on this?\n\nThis is not an economically viable solution for the West.",
            "title_similarity": "0.540843",
            "sentiment_compound": 0.5367
        },
        {
            "id": "hy9nnd6",
            "score": 0,
            "text": "I wonder if this really would be the smartest course of action. After this Russia would have nothing to lose, they might just then push all the way through or even further. A country stacked with nuclear weapons and military equipment.  \nThis would also heavily affect all the normal working people that really are not responsible for any of this.",
            "title_similarity": "0.5536831",
            "sentiment_compound": 0.2806
        },
        {
            "id": "hy9q091",
            "score": -2,
            "text": "Not just SWIFT. Kick Russia from the G7 as well.",
            "title_similarity": "0.71351933",
            "sentiment_compound": -0.0089
        },
        {
            "id": "hy9qkww",
            "score": 2,
            "text": "Hmm where was this critique when the US invaded Iraq or Afghanistan? Maybe the US should be sanctioned for it's wars of aggression too? We need to condemn all acts of imperialism. Every single act of it. Not just if it's Russia or some other non western country",
            "title_similarity": "0.6512761",
            "sentiment_compound": -0.8299
        },
        {
            "id": "hy9u0pr",
            "score": 0,
            "text": "[deleted]",
            "title_similarity": "0.39116004"
        },
        {
            "id": "hy9mtmo",
            "score": 8,
            "text": "What a DISGRACE that GERMANY of all countries are the ones dragging their asses on removing Russia from SWIFT.\n\nWAKE THE FUCK UP GERMANY. WE DIDN'T LET YOU BE FREE JUST TO PULL THIS SHIT.\n\nAt this point the US just needs to go ahead with removing Russia from SWIFT and threaten to sanction Germany for their failure as an ally. Want to put your economy ahead of lives? Get fucked from the other side then.",
            "title_similarity": "0.7044182",
            "sentiment_compound": -0.9454
        },
        {
            "id": "hy9sape",
            "score": 2,
            "text": "I am currently watching his statements at the house on live. He is doing an OUTSTANDING job. Good on you, Brits, for electing him, absolute Chad.",
            "title_similarity": "0.17498726",
            "sentiment_compound": 0.824
        },
        {
            "id": "hy9o2ck",
            "score": 2,
            "text": "Yet again the German government fails to act when it comes to Russian aggression. Then again, they stood by while Russia deployed a nerve agent against a western European nation, why would they be bothered by tanks rolling into an eastern European one.\n\nGet your shit together, you're letting the continent down.",
            "title_similarity": "0.6597418",
            "sentiment_compound": -0.872
        },
        {
            "id": "hy9vp84",
            "score": 0,
            "text": "people here still don't understand that if America help Ukraine fight and russian lose putin still has an Alas (ace move) called Nuclear. Everyone that intervene will be nuke. And thats how China will fight with Russia maybe North Korea too. Putin is playing the game of chess. He knows that no one can stop him. The only help America can give is food, ammo etc. but they cant war with Russia, remember china is just waiting.",
            "title_similarity": "0.54284245",
            "sentiment_compound": 0.2776
        },
        {
            "id": "hya4vhe",
            "score": -1,
            "text": "Earlier I was on Putin's side because I wanted vengeance against a Ukrainian Hacker who stole my digital copy of Red Dead Redemption 2 somehow. Now I realize he was probably just playing it to prepare for vigilantism against Russia.\n\n  \nI'm proud to say, by not having 2FA and using the same password for every service, I have helped Ukraine fend off Russia.",
            "title_similarity": "0.555675",
            "sentiment_compound": -0.1027
        },
        {
            "id": "hy9xuqy",
            "score": -1,
            "text": "[removed]",
            "title_similarity": "0.38150543"
        },
        {
            "id": "hy9tsvv",
            "score": 3,
            "text": "Everyone condemning Germany and EU for not doing this right now (keep in mind this wasn’t discussed anywhere in the EU yet) has to understand that this would mean all trade with Russia is immediately impossible for everyone. Every company anywhere wouldn’t be able to send any transaction to Russian companies. While this sounds like an amazing sanction, that would also mean ending tons of European (and other) businesses dependent on any Russian goods / money / business in general. In our globalized world, this would have massive, unforeseeable consequences and might lead to way more than just destroying the Russian economy. It might lead to an all out financial crisis. It has to be very carefully analyzed, but of course shouldn’t be completely out of the question",
            "title_similarity": "0.65606666",
            "sentiment_compound": -0.1117
        },
        {
            "id": "hy9ezlv",
            "score": -7,
            "text": "Driving Russia closer to China would be a bad idea.",
            "title_similarity": "0.5812657",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hy9n9wi",
            "score": -5,
            "text": "Way to go, Boris\n\nEurope is spineless without UK, hard facts",
            "title_similarity": "0.511564",
            "sentiment_compound": 0.0762
        },
        {
            "id": "hy9qv07",
            "score": 0,
            "text": "Before getting too excited, think about Russians too. They absolutely should not pay the price for their crooked dictator. \n\nUnless for a very short time, Direct military aid is far better than this IMO. Starving normal Russians doesn't solve anything. Look at Iran.",
            "title_similarity": "0.59875095",
            "sentiment_compound": 0.3544
        },
        {
            "id": "hy9y1ll",
            "score": 0,
            "text": "If kicking them out didn’t hurt us so much we would’ve done it already. This is not a simple matter and I’m worried about inflation and even perhaps a recession.",
            "title_similarity": "0.44526652",
            "sentiment_compound": -0.8163
        },
        {
            "id": "hy9p27l",
            "score": 1,
            "text": "Im seeing rumors Germany is pushing against this. If so, fuck em.",
            "title_similarity": "0.5607741",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hy9ls99",
            "score": -1,
            "text": "Germany has blood on its hands if they don’t support kicking Russia out of SWIFT They’ve always been on the wrong side of history.",
            "title_similarity": "0.61570024",
            "sentiment_compound": 0.2808
        },
        {
            "id": "hy9moz7",
            "score": 0,
            "text": "Not going to happen. Germany and those with money need Russia to stay on it.  Money trumps everything",
            "title_similarity": "0.6909081",
            "sentiment_compound": 0.0
        },
        {
            "id": "hy9ox9s",
            "score": -1,
            "text": "[deleted]",
            "title_similarity": "0.39116004"
        },
        {
            "id": "hy9e5kp",
            "score": -12,
            "text": "Disabling swift would be an open war deceleration and would leave Russia with no more options … it should not be taken lightly",
            "title_similarity": "0.6615238",
            "sentiment_compound": -0.8225
        },
        {
            "id": "hy9gt9i",
            "score": 11,
            "text": "Peace in Europe is important, but not as important as german business. It is absolutly disgusting to protect these eastern animals because \"muh industry\". Few more steps like this and union might actually collapse because of german greed.",
            "title_similarity": "0.47251734",
            "sentiment_compound": -0.6829
        },
        {
            "id": "hy9di9n",
            "score": 9,
            "text": "How about you also seize all of that Russian property bought up in London? How about any oligarchs that might own a football team get their shares seized? How about you start arresting the people in your own party that take money from Russian interests?",
            "title_similarity": "0.66205364",
            "sentiment_compound": 0.7536
        },
        {
            "id": "hy9mezq",
            "score": 35,
            "text": "Germany fucking the rest of Europe as usual.",
            "title_similarity": "0.48274797",
            "sentiment_compound": 0.0
        },
        {
            "id": "hy9fcum",
            "score": -1,
            "text": "He just wants to eliminate payment options so he doesn't have to give back their political donations.",
            "title_similarity": "0.49985716",
            "sentiment_compound": 0.0
        },
        {
            "id": "hy9jc4r",
            "score": 2,
            "text": "Out of all the politicians it's Boris freaking Johnson who's pushing  \"very hard\" ???  What did I miss ???\n\nI read that he actually wrote two editorials pro /against Brexit and picked the one better for his political career.  Is there an angle ?\n\nRegardless, BoJo if you pull off this one I am going to significantly review my dismal opinion of you. Not sure anything can offset Brexit catastrophe but that's legit bold leadership, especially considering how much Russian money there is in England (real estate alone : £1.5bn of UK property owned by Russians accused of financial crime or with links to the Kremlin according to Transparency International ). And if there's a personal agenda at least this time it works for the greater good.\n\nEDIT : I don’t mind the downvote as it touches different issues /it was a bit tongue in cheek . But more seriously, leaving Brexit issue aside for a moment ,  can someone answer me : why Johnson out of all leaders  is doing this ?",
            "title_similarity": "0.6855153",
            "sentiment_compound": -0.851
        },
        {
            "id": "hy9rgg3",
            "score": 1,
            "text": "Germany always being a bitch. Refusing to do this. They dont pay nato they don’t have a way to defend themselves and yet act like they are king shit and now at every turn they are willing to let ukraine burn like they know best",
            "title_similarity": "0.5422638",
            "sentiment_compound": -0.1541
        },
        {
            "id": "hy9s812",
            "score": -1,
            "text": "Too bad they brexit. Otherwise this may have more sway. Probably saying this as a PR stunt.",
            "title_similarity": "0.45963898",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hy9sxah",
            "score": 0,
            "text": "Can't help but think this is a calculated play by Boris to bolster his image. Get the feeling that he knew such a thing would be held up by other politicians and in such he can wash his hands of any guilt and proclaim \"Look! I tried guys!\". With his absolutely stunning track record, it's hard to imagine genuine inteligence and goodwill from him currently.",
            "title_similarity": "0.4448868",
            "sentiment_compound": 0.6591
        },
        {
            "id": "hy9vfln",
            "score": -1,
            "text": "This is all PR you clowns. Do you know how much gas Russia pumps to Europe.",
            "title_similarity": "0.58379126",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyb1794",
            "score": 0,
            "text": "Some opposed this in EU...I want to know who you are? I want to know which country is my enemy and I no.longer will consider EU member.",
            "title_similarity": "0.6492704",
            "sentiment_compound": -0.4404
        },
        {
            "id": "hy9phbo",
            "score": 3,
            "text": "Next day China would abandon Swift, then we will see who won.",
            "title_similarity": "0.5503275",
            "sentiment_compound": 0.3818
        },
        {
            "id": "hy9b936",
            "score": -10,
            "text": "I can only guess that Russian donations to the Tory party come in brown envelopes.\n\nEdit: The US was talking about this a week or two ago, it's not a new idea. Have a look at the sanctions earlier this week they were a joke: 5 banks that don't do business in the UK and 3 people who've been sanctioned by the US for 4 years.\n\nIt's estimated that the Tories have received around £2m in Russian money in the past 2ish years. One of the biggest donors is married to Vladimir Chernukhin, Putin's former deputy finance minister.\n\n[https://www.theguardian.com/politics/2022/feb/23/oligarchs-funding-tories](https://www.theguardian.com/politics/2022/feb/23/oligarchs-funding-tories)",
            "title_similarity": "0.49499714",
            "sentiment_compound": 0.5994
        },
        {
            "id": "hy9vxo9",
            "score": 3,
            "text": "How is it that anytime there’s a major European conflict Germany ends up being a massive fucking bastard about it",
            "title_similarity": "0.53785145",
            "sentiment_compound": -0.7485
        },
        {
            "id": "hy9krin",
            "score": 15,
            "text": "Didn’t realize Germany has become that weak.",
            "title_similarity": "0.33940622",
            "sentiment_compound": -0.4404
        },
        {
            "id": "hy9dilo",
            "score": 3,
            "text": "There’s seems to be a lot of talk from Boris but a lot of action \n\nAlso are they waiting transfer the money to China before locking Russia out?",
            "title_similarity": "0.518445",
            "sentiment_compound": 0.0
        },
        {
            "id": "hy9o2ed",
            "score": 2,
            "text": "[deleted]",
            "title_similarity": "0.39116004"
        },
        {
            "id": "hy9r25m",
            "score": -4,
            "text": "Tell Boris to get a hair cut or at least style it you bum! You look like a joke on international tv can’t take you seriously. And I love Russian people Putin needs a bullet",
            "title_similarity": "0.6172209",
            "sentiment_compound": 0.75
        },
        {
            "id": "hy9i6fg",
            "score": 1,
            "text": "What is the process of ejecting them from SWIFT? Who decides?",
            "title_similarity": "0.5088152",
            "sentiment_compound": 0.4391
        },
        {
            "id": "hy9rku0",
            "score": -1,
            "text": "Maybe Germany isnt overreacting like everyone and holding their ground like russia. Its a standoff and they dont want to aggravate Russia more.",
            "title_similarity": "0.57375526",
            "sentiment_compound": 0.4621
        },
        {
            "id": "hy9rxiu",
            "score": 1,
            "text": "Boris is Bullish on Bitcoin.",
            "title_similarity": "0.51461154",
            "sentiment_compound": 0.0
        },
        {
            "id": "hy9t4l0",
            "score": -1,
            "text": "Boris  needs something big to distract attention from party gate so he can remain leader.",
            "title_similarity": "0.4909165",
            "sentiment_compound": 0.128
        },
        {
            "id": "hy9y4c1",
            "score": 1,
            "text": "Clean up Londongrad too",
            "title_similarity": "0.35520107",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hy9z7k8",
            "score": -1,
            "text": "Y’all aware Russia has nukes or nah?",
            "title_similarity": "0.6280694",
            "sentiment_compound": -0.1027
        },
        {
            "id": "hya84tr",
            "score": -1,
            "text": "Well, show me somebody who has trusted Johnson in the past and still thinks it was a good idea. Not that I think sactions are wrong but the UK Tories are so entrenched with Russian interference that I find it *very* hard to trust them.",
            "title_similarity": "0.46358126",
            "sentiment_compound": 0.7435
        },
        {
            "id": "hya8v8z",
            "score": 1,
            "text": "I hope they Venezuela the shit out Russia between now and next week. Did you see the kid riding her bike getting bombed? Horrible!!!!",
            "title_similarity": "0.5443767",
            "sentiment_compound": 0.6776
        },
        {
            "id": "hyalv0w",
            "score": 1,
            "text": "Well Boris, why don’t you take their expensive homes in London.? And those of their families. And the financial assets you have allowed them to acquire in your country.",
            "title_similarity": "0.5016313",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hy9t1ey",
            "score": 8,
            "text": "Wow, turns out even a wilfully ignorant over educated but under thinking broken clock is right twice a day.",
            "title_similarity": "0.23679572",
            "sentiment_compound": -0.5106
        },
        {
            "id": "hy9ugt5",
            "score": -2,
            "text": "\"Johnson's conservative party then received another huge payment from the Russian state and swiftly backtracked on his statement.\"",
            "title_similarity": "0.72047377",
            "sentiment_compound": 0.7351
        },
        {
            "id": "hyal3qq",
            "score": -4,
            "text": "Why is this utter DUNCE still in power? Why?",
            "title_similarity": "0.25193423",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyay5n6",
            "score": -3,
            "text": "This irrelevant PM with his irrelevant country just wants EUs economy to collapse. He's not really after Russia.",
            "title_similarity": "0.6309955",
            "sentiment_compound": -0.4939
        },
        {
            "id": "hy9ekbd",
            "score": 3,
            "text": "What are the counter arguments against this? Honest question.",
            "title_similarity": "0.23712929",
            "sentiment_compound": 0.1531
        },
        {
            "id": "hy9hp2k",
            "score": 0,
            "text": "I'm wondering if this is something he's really pushing for, or if it's something like brexit he wants to go on record as advocating for but doesn't really support, because in this case he thinks US opposition to this step will prevent it from actually happening.",
            "title_similarity": "0.4650628",
            "sentiment_compound": -0.3209
        },
        {
            "id": "hy9kbqj",
            "score": 0,
            "text": "A so typical autocrats' thinking: they rely on our copper coins to survive. When we stop giving them copper coins, they will give up and give in.",
            "title_similarity": "0.45933533",
            "sentiment_compound": 0.0516
        },
        {
            "id": "hy9pdcz",
            "score": -5,
            "text": "Let see if we can get our geriatric shitshow POTUS to follow up with this before next year.",
            "title_similarity": "0.3420965",
            "sentiment_compound": 0.0
        },
        {
            "id": "hy9pltn",
            "score": 0,
            "text": " At first thought, I was like Europe should just do it and reinstate at a later time as Russia tries to \"negotiate. However, at second thought. how shutting out Russian from SWIFT impacts the innocent citizens of Russia? So is it just the price they pay for having the current Russian administration?",
            "title_similarity": "0.71663606",
            "sentiment_compound": 0.7501
        },
        {
            "id": "hy9qzs0",
            "score": 0,
            "text": "US is onboard, but the EU is not, so this will not happen",
            "title_similarity": "0.41474056",
            "sentiment_compound": 0.0
        },
        {
            "id": "hy9r2oz",
            "score": 0,
            "text": "Although I'm in favour of this Germany have a lot to lose since German banks have lended Russia lots of money and it would be difficult to pay this back once Russia has been cut off from swift",
            "title_similarity": "0.5570813",
            "sentiment_compound": -0.4588
        },
        {
            "id": "hy9rqp5",
            "score": 0,
            "text": "I’m worried this and the sanctions may not matter much now. Isn’t Russia pretty self sufficient now?",
            "title_similarity": "0.52672267",
            "sentiment_compound": 0.2325
        },
        {
            "id": "hy9uea7",
            "score": 0,
            "text": "[deleted]",
            "title_similarity": "0.39116004"
        },
        {
            "id": "hy9vq7g",
            "score": 5,
            "text": "How will the GOP get their donations though?",
            "title_similarity": "0.33993602",
            "sentiment_compound": 0.0
        },
        {
            "id": "hy9vuab",
            "score": 0,
            "text": "Guys… what if we waited like 40 or 50 days before we paid there invoices.",
            "title_similarity": "0.29081863",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hy9wt12",
            "score": 0,
            "text": "What is swift payment system?",
            "title_similarity": "0.32488897",
            "sentiment_compound": 0.2023
        },
        {
            "id": "hy9xcti",
            "score": 0,
            "text": "[deleted]",
            "title_similarity": "0.39116004"
        },
        {
            "id": "hya0j90",
            "score": 0,
            "text": "This is dangerous. There are no further economic sanctions after this. It's as far as you can go.",
            "title_similarity": "0.3675012",
            "sentiment_compound": -0.6486
        },
        {
            "id": "hya5tlx",
            "score": 0,
            "text": "The US and Germany have the most to lose from ejecting Russia from the swift payment system since most transactions are done in those two countries and in Dollars.",
            "title_similarity": "0.5340669",
            "sentiment_compound": -0.2911
        },
        {
            "id": "hya7cjr",
            "score": 0,
            "text": "THE \"ELECTED\" RUSSIAN LORD PUTIN DECLARES WAR IN YEAR 2022... COME ON DUDE SNAP OUT OF IT, PEOPLE ARE GETTING KILLED, A KID IS SEVERY INJURED... GET THE FUCK OUT OF THERE, THERE ARE LAWS BETWEEN COUNTRIES, ONE MAN CANNOT JUST DO WHATEVER HE COMES UP WITH",
            "title_similarity": "0.7389257",
            "sentiment_compound": -0.9614
        },
        {
            "id": "hya8t20",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "0.38150543"
        },
        {
            "id": "hyag359",
            "score": 0,
            "text": "Boris is pushing for swift sanctions, Biden said “our European friends don’t all agree” so now I wonder which eu countries didn’t want Russia to be ejected from the swift payment system. And btw, doing so, would be escalating the situation. It should be considered as a last non violent option",
            "title_similarity": "0.6836279",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hyahap1",
            "score": 0,
            "text": "But what *is* \"Swift\"?",
            "title_similarity": "0.20539075",
            "sentiment_compound": 0.296
        },
        {
            "id": "hyajaog",
            "score": 0,
            "text": "Lol, Ripple would be adopted so fast in Russia it wouldn't even be funny.",
            "title_similarity": "0.67497414",
            "sentiment_compound": 0.1012
        },
        {
            "id": "hyal79w",
            "score": 0,
            "text": "this will hurt momentarily and then they will switch to SFPS or whatever it's called that the Russians developed themselves further reducing our western influence in there, it's really only a one-time heavy hit.",
            "title_similarity": "0.6885753",
            "sentiment_compound": -0.5267
        },
        {
            "id": "hyanisc",
            "score": 0,
            "text": "But didn't you see, Biden said these sanctions are WORSE than swift removal and maybe we should wait about a month and see how it goes THEN we can consider swift removal",
            "title_similarity": "0.57696307",
            "sentiment_compound": -0.4309
        },
        {
            "id": "hyb2q2q",
            "score": 0,
            "text": "I disliked Ole Boris when he was first elected, seemed kinda goofy and aloft, but he is slowly starting to gain my respect, not that it matters lol.",
            "title_similarity": "0.3510763",
            "sentiment_compound": 0.9098
        },
        {
            "id": "hybarbv",
            "score": 0,
            "text": "It will in a way effect the economies of smaller countries",
            "title_similarity": "0.25587824",
            "sentiment_compound": 0.0
        },
        {
            "id": "hybbeh4",
            "score": 0,
            "text": "Germany is done as the country that \"learned its lesson from WW2\" and \"the most tolerant one\". Their opposition to eject Russia from SWIFT, not to mention years of dealing with Russia, clearly shows, that they don't care about principles that they were always putting forward. Even though they are the richest country in EU. They just mind their business. And my, poor, central-european country is amongst ones pushing for more severe sanctions... \n\nF\\*\\*k Germany.",
            "title_similarity": "0.51798004",
            "sentiment_compound": 0.341
        },
        {
            "id": "hybgbc7",
            "score": 0,
            "text": "The headline should be\n\n\"Boris Johnson pushes for Russia to be ejected from swift payment system, once he makes sure everyone else opposes it and it will not happen.\" \n\nSo who's stopping Boris from blocking any Russian transactions between UK and Russia that use the swift system, or of imposing stronger sanctions to Russia in general? I mean, UK isn't part of EU so doesn't need their approval, right? They are a sovereign nation and can do whatever they want, so why not just do their part anyway?",
            "title_similarity": "0.76131546",
            "sentiment_compound": 0.2282
        },
        {
            "id": "hybgoe5",
            "score": 0,
            "text": "They won't block them from swift because how else are EU/US going to pay the oil companies in Russia that they own all their stock in.",
            "title_similarity": "0.50081503",
            "sentiment_compound": 0.4226
        },
        {
            "id": "hybh7yd",
            "score": 0,
            "text": "Cowards",
            "title_similarity": "0.30178547",
            "sentiment_compound": 0.0
        },
        {
            "id": "hybifza",
            "score": 0,
            "text": "Too bad Boris is not longer part of any organization that has got influence",
            "title_similarity": "0.33170587",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hyciv3d",
            "score": 0,
            "text": "BoJo Horseface is doing something right?   What a fucked up timeline.",
            "title_similarity": "0.30187076",
            "sentiment_compound": -0.6597
        },
        {
            "id": "hy9gvgi",
            "score": 10,
            "text": "The Czech President is one thing: The British Prime Minister is absolutely something else. This move would have _teeth._",
            "title_similarity": "0.55618393",
            "sentiment_compound": 0.0
        },
        {
            "id": "hy9n322",
            "score": 5,
            "text": "Seriously wtf are we doing as the EU. You got Russia killing civilians and we're talking about some economic sanctions. FUCK EU",
            "title_similarity": "0.7212328",
            "sentiment_compound": -0.9341
        },
        {
            "id": "hy9phug",
            "score": 5,
            "text": "It's not as simple as it sounds. This would be encouraging Russia and China to develop their own system which would be harder to control. China already has an alternate system in place, but it's not used much.",
            "title_similarity": "0.51425195",
            "sentiment_compound": 0.296
        },
        {
            "id": "hy9tqtg",
            "score": 4,
            "text": "To anyone in the Ukraine. My family and I have a home for you if you are somehow able to make it to the US. It’s not much, but you have safety and shelter. We have food. We have comfort. We have safety. If you are fleeing war, please reach out to me. I can help you and I am more than willing to open my home to you if you need it.",
            "title_similarity": "0.37815982",
            "sentiment_compound": 0.899
        },
        {
            "id": "hy9u5n6",
            "score": 11,
            "text": "Germany inviting Putin to Europes door step will be a regrettable decision. Political tides are turning again in the United States and if republicans win you know they will have Europe paying more for NATO with Russia sitting on Europe’s door.\n\nGermans fail to realize soon they will be paying a legitimate mad man for heat and paying the US to protect them from that mad man. Brilliant move Germany!",
            "title_similarity": "0.56115997",
            "sentiment_compound": 0.3382
        },
        {
            "id": "hy9bqn2",
            "score": -7,
            "text": "I'm interested to see what will happen to crypto.\n\nIt's a viable alternative.",
            "title_similarity": "0.2335954",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hy9k0cg",
            "score": -4,
            "text": "People in Canada organize a peaceful protest, they do not attack other nations, minorities, do not hate any social, ethnic or religious group - the Canadian government blocks their bank accounts.  \nRussian soldiers, on Putin's orders, attack civilian objects, the population, launching open aggression against another country - the EU government THOUGHTS whether to block SWIFT for Russia and Germany is against. Democracy and freedom are long dead.",
            "title_similarity": "0.60556793",
            "sentiment_compound": 0.0219
        },
        {
            "id": "hya3y3c",
            "score": -7,
            "text": "Why isn’t europe nuking Moscow",
            "title_similarity": "0.528751",
            "sentiment_compound": 0.0
        },
        {
            "id": "hy9dbhw",
            "score": 1,
            "text": "This is literally one of the only options and they don't want to do it... vile. Shame on Putin and whoever is complicit.",
            "title_similarity": "0.5340638",
            "sentiment_compound": -0.8137
        },
        {
            "id": "hy9ecf1",
            "score": 1,
            "text": "DO IT!",
            "title_similarity": "0.1614254",
            "sentiment_compound": 0.0
        },
        {
            "id": "hy9evbp",
            "score": 1,
            "text": "Cut the line. Leave them out in the cold.",
            "title_similarity": "0.5675234",
            "sentiment_compound": -0.3182
        },
        {
            "id": "hy9mty0",
            "score": 1,
            "text": "I'm stupid, why is this a big deal? Only time I've seen swift is when I'm getting on the bus",
            "title_similarity": "0.3216523",
            "sentiment_compound": -0.3818
        },
        {
            "id": "hy9ncsy",
            "score": 1,
            "text": "This is the way",
            "title_similarity": "0.10994162",
            "sentiment_compound": 0.0
        },
        {
            "id": "hy9nqnn",
            "score": -1,
            "text": "Eject them from the security council as well!",
            "title_similarity": "0.69741774",
            "sentiment_compound": 0.5848
        },
        {
            "id": "hy9oixb",
            "score": 1,
            "text": "Guys for the bombing of Libya, France will be punished?",
            "title_similarity": "0.46769473",
            "sentiment_compound": -0.4588
        },
        {
            "id": "hy9q88b",
            "score": 1,
            "text": "What is the swift payment system?",
            "title_similarity": "0.3339018",
            "sentiment_compound": 0.2023
        },
        {
            "id": "hy9qva0",
            "score": 1,
            "text": "What is SWIFT?",
            "title_similarity": "0.22901532",
            "sentiment_compound": 0.368
        },
        {
            "id": "hy9rql4",
            "score": -1,
            "text": " Swift system should be replaced with XRPL",
            "title_similarity": "0.5038873",
            "sentiment_compound": 0.2023
        },
        {
            "id": "hy9szv1",
            "score": 1,
            "text": "Is it just me or has NATO/EU been doing the exact decisions redditors have suggested? Reddit controls the world /s",
            "title_similarity": "0.51354164",
            "sentiment_compound": 0.0
        },
        {
            "id": "hy9uigh",
            "score": 1,
            "text": "I bet Trump would be against it! POS",
            "title_similarity": "0.52734387",
            "sentiment_compound": 0.0
        },
        {
            "id": "hy9vizy",
            "score": 1,
            "text": "Weekly reminder that there are in fact worse options than Biden/Johnson *sighs in depression*",
            "title_similarity": "0.37230942",
            "sentiment_compound": -0.7783
        },
        {
            "id": "hy9xg8z",
            "score": 1,
            "text": "Yeah, a quarter of Johnson's cabinet is in the pocket of Russian oligarchs and Putin who own a lot of London real estate and massively rely on UK banking. Would be nice if he would do anything about that.",
            "title_similarity": "0.51048595",
            "sentiment_compound": 0.6124
        },
        {
            "id": "hy9yqe6",
            "score": 1,
            "text": "Germany and Italy.... what the fuck?",
            "title_similarity": "0.42339385",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hya18fw",
            "score": -1,
            "text": "[deleted]",
            "title_similarity": "0.39116004"
        },
        {
            "id": "hya44yj",
            "score": -1,
            "text": "Hey Boris, I thought you liked Russia\n\nhttps://www.theguardian.com/politics/2019/jul/26/boris-johnson-security-evgeny-lebedev-perugia-party\n\nI get you, you would do anything to take attention away from your political covid brexit russian affiliation fiascos.\n\nStill, amazing as it sounds, I actually agree.",
            "title_similarity": "0.65355873",
            "sentiment_compound": 0.8442
        },
        {
            "id": "hyablhv",
            "score": -1,
            "text": "Bojo is really fighting the guy who may have put him in power",
            "title_similarity": "0.39738202",
            "sentiment_compound": -0.4201
        },
        {
            "id": "hyadz3c",
            "score": -1,
            "text": "I don’t think some of you understand how significant kicking Russia out of SWIFT is. Russia has already said if this happens this would be a declaration of war. This was threatened during the Crimean war, but they never got kicked. This is why it needs to be a well thought out decision by country leaders and can’t just happen immediately.",
            "title_similarity": "0.62374526",
            "sentiment_compound": -0.2694
        },
        {
            "id": "hyaj6i7",
            "score": -1,
            "text": "Bruh it will be a reason for a A LITERAL WW3",
            "title_similarity": "0.34947038",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyaj8u5",
            "score": -1,
            "text": "Kicking Russia out of SWIFT would trigger nuclear strikes, no?",
            "title_similarity": "0.6607804",
            "sentiment_compound": 0.0085
        },
        {
            "id": "hyak2o1",
            "score": -1,
            "text": "Won't happen. The only countries pushing for it are the ones that don't need Russian gas.  Empty threat.",
            "title_similarity": "0.48174882",
            "sentiment_compound": -0.6369
        },
        {
            "id": "hyami9s",
            "score": -1,
            "text": "Just in time to forget about partygate. Tories fucking loving it probably.",
            "title_similarity": "0.37966377",
            "sentiment_compound": 0.5095
        },
        {
            "id": "hyamzyb",
            "score": 1,
            "text": "But Russians own like 1/2 of London..\n\n\nAnd I bet he got alot of Russian money in recent years🙃",
            "title_similarity": "0.52964795",
            "sentiment_compound": 0.5023
        },
        {
            "id": "hyatxfw",
            "score": -1,
            "text": "Boris Johnson is just that, a big fucking Johnson!",
            "title_similarity": "0.33586636",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyaxiha",
            "score": 1,
            "text": "Reddit is only now waking up to the fact that the EU and Germany in particular is a spineless shill that is only looking to secure its gas supply. It’s truely funny how people think the EU acts as a balwack against Russian aggression when in reality is just French and German political mongering in other countries. The economic union they have tried to develop over the last two decades has been a total disaster and done severe damage to the institutions of poorer European countries",
            "title_similarity": "0.5764364",
            "sentiment_compound": -0.8858
        },
        {
            "id": "hyb2fwv",
            "score": 1,
            "text": "Thanks to the Germans  r/de and Italians swift is not a part of the sanctions now we finally know that this country is not a ally of the west.",
            "title_similarity": "0.5092162",
            "sentiment_compound": 0.5719
        },
        {
            "id": "hyb47yl",
            "score": 1,
            "text": "Why are you all only shitting on Germany?  Italy, Hungary and Cyprus said \"no\" too.\n\nBut thank god, we have so many clever redditors here, who know everything better than politicians...",
            "title_similarity": "0.4306503",
            "sentiment_compound": 0.9227
        },
        {
            "id": "hyb5s2h",
            "score": -1,
            "text": "Fuck You Boris.",
            "title_similarity": "0.5713469",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hybca66",
            "score": 1,
            "text": "WAY TO GO, GERMANY. \n\nReally? I mean, REALLY?!? 2 world wars, and you're still sticking up for russia - and as of a few weeks ago - still trying to be cozy to china? REALLY?? \n\nCan you guys play on the other team for once, and stop being the baddies??!?!?!?! Just try it this century. If you don't like it, go back in 2100. Come on!",
            "title_similarity": "0.5648347",
            "sentiment_compound": -0.8612
        },
        {
            "id": "hybce04",
            "score": 1,
            "text": "Oh no some more economic sanctions!! That will really show them this time!!1",
            "title_similarity": "0.5019268",
            "sentiment_compound": -0.5216
        },
        {
            "id": "hyc4vwc",
            "score": 1,
            "text": "Germany is largely to blame for this situation and, in forgoing the opportunity to correct it has again placed themselves on the wrong side of history. It is a sad day and the world will remember their bumbling cowardice for generations.",
            "title_similarity": "0.5091693",
            "sentiment_compound": -0.7003
        },
        {
            "id": "hycew3y",
            "score": 1,
            "text": "[deleted]",
            "title_similarity": "0.39116004"
        },
        {
            "id": "hy9pqs5",
            "score": -8,
            "text": "[removed]",
            "title_similarity": "0.38150543"
        },
        {
            "id": "hy9f6fh",
            "score": 163,
            "text": "I can't believe children are dying, yet Germany is like \"yo, not doing it, don't care, we're too involved\" and the rest of EU \"well, Germany said no and we won't go against momma\"\n\nThe thing is, it doesn't matter if this will be enough, it doesn't matter they won't stop, we have to try anything we can\n\nAs a european citizen I'm ashamed and disgusted, I've never felt less represented by our governments",
            "title_similarity": "0.5295727",
            "sentiment_compound": -0.7174
        },
        {
            "id": "hy99mwi",
            "score": 8,
            "text": "Yes!, can't just sit and watch, if sanctions is the only move we dare make, then make it big...   \n\n\nStill sad about Nations around the world just watching a legally democratic nation get swollen up by a war hungering elite",
            "title_similarity": "0.55124897",
            "sentiment_compound": -0.636
        },
        {
            "id": "hyahksm",
            "score": 7,
            "text": "imagine boris Johnson being the voice of reason holy fuck",
            "title_similarity": "0.52186686",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hy9d9zo",
            "score": 17,
            "text": "As much as I fucking detest this absolute clown of a prime minister I agree 100% that we should all be united against putin, cutting him and his cronies off swift is going to devastate them.",
            "title_similarity": "0.59634817",
            "sentiment_compound": 0.128
        },
        {
            "id": "hy9di2q",
            "score": 2,
            "text": "Its mindboggling this is still not done? Are they going to debate this or some shit? Just do it exactly at right this second",
            "title_similarity": "0.43185976",
            "sentiment_compound": -0.6072
        },
        {
            "id": "hy9eh0d",
            "score": 2,
            "text": "Wealthy people with skin in the game are not going to let this happen. Poor people are fucked.",
            "title_similarity": "0.3538566",
            "sentiment_compound": -0.7184
        },
        {
            "id": "hy9l2rr",
            "score": -2,
            "text": "This is good for Bitcoin.",
            "title_similarity": "0.20094107",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hy9m3x5",
            "score": 2,
            "text": "Germany: no lol",
            "title_similarity": "0.36804315",
            "sentiment_compound": -0.3252
        },
        {
            "id": "hy9qbp3",
            "score": -2,
            "text": "What is this, Nazi Germany?",
            "title_similarity": "0.41432464",
            "sentiment_compound": 0.0
        },
        {
            "id": "hy9r0yw",
            "score": 2,
            "text": "Fucking do it.",
            "title_similarity": "0.18812571",
            "sentiment_compound": 0.0
        },
        {
            "id": "hy9rocr",
            "score": -2,
            "text": "You people have lost sight with the one thing that is inside of you, that tells you something is not loving. Thus, you have portrayed an evil in your minds and in your bodies when youre not speaking the truth to yourselves.",
            "title_similarity": "0.4310309",
            "sentiment_compound": -0.8958
        },
        {
            "id": "hy9s5sj",
            "score": -2,
            "text": "If they’re so offended, put Tony Blair in jail.",
            "title_similarity": "0.5807922",
            "sentiment_compound": -0.3851
        },
        {
            "id": "hy9tid8",
            "score": 2,
            "text": "First good decision this moron has managed to come up with.",
            "title_similarity": "0.18861213",
            "sentiment_compound": -0.0772
        },
        {
            "id": "hy9vdjn",
            "score": -2,
            "text": "This is a good way to get fucking nuked, do you wanna get nuked? Cause I sure as hell don't.",
            "title_similarity": "0.35375762",
            "sentiment_compound": -0.1027
        },
        {
            "id": "hy9vrvt",
            "score": -2,
            "text": "Now, wouldn't this constitute a reason for Russians to drop nukes on the whole world?",
            "title_similarity": "0.76508594",
            "sentiment_compound": -0.2732
        },
        {
            "id": "hy9vy93",
            "score": -2,
            "text": "But…I mean…they have BTC and ETH…",
            "title_similarity": "0.25231224",
            "sentiment_compound": 0.0
        },
        {
            "id": "hy9w4qh",
            "score": -2,
            "text": "Dont understand why eu just doesnt retalite…combine uk, germany, and the others military and bomb the fuck outta russia and ur done…no chance eu+usa wouldnt destory russia",
            "title_similarity": "0.69715285",
            "sentiment_compound": -0.6908
        },
        {
            "id": "hy9w7qa",
            "score": 2,
            "text": "I don't think it's as simple as \"wow germany you cowards\". There are likely very serious and wide downsides to this apart from squeezing the Russian Government a little tighter.",
            "title_similarity": "0.67791355",
            "sentiment_compound": 0.4951
        },
        {
            "id": "hy9ybpm",
            "score": 2,
            "text": "Damn. I didn't realize how neutered Germany has become.",
            "title_similarity": "0.38146287",
            "sentiment_compound": -0.4019
        },
        {
            "id": "hya05bh",
            "score": -2,
            "text": "[deleted]",
            "title_similarity": "0.39116004"
        },
        {
            "id": "hya09g4",
            "score": 2,
            "text": "Disable their bitcoin if you really want to stick it to them!!",
            "title_similarity": "0.6135794",
            "sentiment_compound": 0.2908
        },
        {
            "id": "hya2dv5",
            "score": -2,
            "text": "Is he really pushing for this do?  Or is it just to look good after his first poor attempt at sanctions?  \"Sorry old boy, can't do swift, bloody Italians standing in the way but I tried my best\"  But he really doesn't push much behind the scenes and the blame falls on the EU member states.",
            "title_similarity": "0.4505244",
            "sentiment_compound": 0.639
        },
        {
            "id": "hya3yc6",
            "score": 2,
            "text": "So fucking weak Biden didn’t press this harder.  The guy on cnn was basically like what are you waiting for pussy?",
            "title_similarity": "0.3810305",
            "sentiment_compound": -0.2433
        },
        {
            "id": "hya4v03",
            "score": -2,
            "text": "oh yes this should just fix EVERYTHING. Hey let's make life harder for the average russian who's agasint this whole thing and the elites won't be affected.. 10/10 reddit logic right there your parents must be sooooo proud. Everyone in here just pats on backs here's a doggy treat. Good job you all stopped WW3 *claps*",
            "title_similarity": "0.5546256",
            "sentiment_compound": 0.8672
        },
        {
            "id": "hya73vu",
            "score": -2,
            "text": "Boris Johnson needs to push to eject shit from his face... less often",
            "title_similarity": "0.55477226",
            "sentiment_compound": -0.5574
        },
        {
            "id": "hyabqy1",
            "score": 2,
            "text": "Wtf Germany are acting like such cowards, what happened to being green and cutting reliance from fossil fuels that the SPD were all soo happy to pump up before the election. You can see now they are addicted to Russian gas and have NO alternative.",
            "title_similarity": "0.5405719",
            "sentiment_compound": -0.2577
        },
        {
            "id": "hyakiyh",
            "score": -2,
            "text": "How hasn't Bojo still retired after going to a party during lockdown and acting like it was all well and good?",
            "title_similarity": "0.35179746",
            "sentiment_compound": 0.8481
        },
        {
            "id": "hyb6i7c",
            "score": 2,
            "text": "What needs to happen is kicking Russia from the UN. You cant be united if you directly wage offensive wars for territorial gain.",
            "title_similarity": "0.71809405",
            "sentiment_compound": -0.6738
        },
        {
            "id": "hycl5po",
            "score": 2,
            "text": "What a joke of a man. I completely support the idea, but Johnson has the clout of a ball boy. Who's going to listen to a man who doesn't know when he's at a party?",
            "title_similarity": "0.28044814",
            "sentiment_compound": 0.7308
        },
        {
            "id": "hy9f3a5",
            "score": 404,
            "text": "So Germany announced it was shutting down all nuclear power plants... Nuclear power plants are the best green energy until Nuclear fusion energy is a thing...... They are also great for not polluting the air.\n\nSo Germany's grand plan was to make themselves completly reliant on Russia for Energy and basically become their lapdogs even though they have a stronger economy than Russia?\n\nI hope some people are investigating the people who were pushing for shutting down Nuclear power plants, which again is the cleanest and most reliable form of green energy.",
            "title_similarity": "0.51627207",
            "sentiment_compound": 0.975
        },
        {
            "id": "hy9a00w",
            "score": 196,
            "text": "[removed]",
            "title_similarity": "0.38150543"
        },
        {
            "id": "hy9ivrg",
            "score": 10,
            "text": "Meanwhile the EU said they're not ready to do this yet.  Pathetic.",
            "title_similarity": "0.49138302",
            "sentiment_compound": -0.7013
        },
        {
            "id": "hy9qo0y",
            "score": 10,
            "text": "i hate the current UK govornment but at the very least they are not flitering their political stance. seeing germany tip toe around a unavoidably catastrophic war is incredibly foolish",
            "title_similarity": "0.5249353",
            "sentiment_compound": -0.9441
        },
        {
            "id": "hy9lt78",
            "score": 20,
            "text": "Is this the right approach? SWIFT is a Belgian company and would require almost every EU country to sign off, it's not just up to the US and UK. Also, it'll hurt Russia badly in the short-term but would just further drive them to alternative systems in the future.\n\nInstead, Europe and the US need to put pressure on Russia's energy income and Putin's cronies. Put in severe energy sanctions, seize every oligarch's foreign assets, and roll out restrictions to Western and Taiwanese technology and chips.",
            "title_similarity": "0.5897673",
            "sentiment_compound": -0.0344
        },
        {
            "id": "hy9a6y9",
            "score": 561,
            "text": "[deleted]",
            "title_similarity": "0.39116004"
        },
        {
            "id": "hy9y5pg",
            "score": 36,
            "text": "Dear Ukrainians!\n\nI heard on social media that there is fake news being spread (most likely by Russia backed trolls) that polish border is closed.\n\nIt's a lie.\n\nIf you seek asylum - go towards polish border. We are ready for your arrival. We have reception points ready at the border where you can find shelter, food, medical and legal aid.\n\nPolish government launched a dedicated site to help you: ua.gov.pl\n\nPlease share this information if you know anyone seeking help right now.\n\nEDIT: YOU DON'T NEED VISA TO PASS THROUGH POLISH BORDER. ALL YOU NEED IS PASSPORT. VISAS ARE SUSPENDED! YOU DON'T NEED THEM FOR TIME BEING!!!!!!\n\nEDIT2: as a proof that you no longer need visa:\n\n•\t⁠in Ukrainian https://www.gov.pl/web/udsc/ukraina---ua •\t⁠in English https://www.gov.pl/web/udsc/ukraina-en",
            "title_similarity": "0.6461592",
            "sentiment_compound": 0.9124
        },
        {
            "id": "hy9bymq",
            "score": 3,
            "text": "Yesterday, was all like Nato *\"will lay down the big hammer.\"* Not expecting anything from Biden announcement an hour from now.",
            "title_similarity": "0.46047616",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hy9e6bb",
            "score": 2,
            "text": "I love the use of the word 'ejected' in this sentence. I'm already imagining Putin being literally ejected from the globe.",
            "title_similarity": "0.5470886",
            "sentiment_compound": 0.6783
        },
        {
            "id": "hy9mfau",
            "score": 3,
            "text": "Never thought I’d agree with Boris Johnson.",
            "title_similarity": "0.399761",
            "sentiment_compound": -0.2755
        },
        {
            "id": "hy9n5kx",
            "score": 3,
            "text": "Good, they should but the EU has no balls to do it.",
            "title_similarity": "0.45562875",
            "sentiment_compound": -0.2144
        },
        {
            "id": "hy9pq9t",
            "score": 3,
            "text": "Aren't they isolated from SWIFT now, and using China to move through?  \n\n&#x200B;\n\nAlso, if they go \"FULL ON SANCTIONS\" it could result in Putin going full on the offense - he'll have nothing to lose potentially, depending on his state of mind.",
            "title_similarity": "0.5586265",
            "sentiment_compound": 0.5794
        },
        {
            "id": "hy9q08x",
            "score": 2,
            "text": "Is this the first country/event where a hostile government has come this close to threatening NATO?",
            "title_similarity": "0.50145304",
            "sentiment_compound": -0.7184
        },
        {
            "id": "hy9yvvd",
            "score": -4,
            "text": "Why doesnt UK stop occupying Chagos Archipelago where  they forcibly evicted people a.k.a. ethic cleansing?",
            "title_similarity": "0.6755912",
            "sentiment_compound": 0.2235
        },
        {
            "id": "hyagrbr",
            "score": 2,
            "text": "First good thing Johnsons ever done under the public eye",
            "title_similarity": "0.103997976",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hyah3is",
            "score": -3,
            "text": "Where's Biden??",
            "title_similarity": "0.22221272",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyatgxx",
            "score": 3,
            "text": "Look, Boris is by far a good PM, but he’s handled the Ukraine situation very well in my opinion",
            "title_similarity": "0.31069458",
            "sentiment_compound": 0.6174
        },
        {
            "id": "hy99i8m",
            "score": 36,
            "text": "Money and violence appear to be the only things in the driver's seat in Russia. \n\nWe need to combat them on at least one of these battlefields. I personally would prefer the former. \n\nCut them off. Size all their assets.",
            "title_similarity": "0.6605946",
            "sentiment_compound": -0.8316
        },
        {
            "id": "hy9tzyl",
            "score": 38,
            "text": "Germany might as well just admit that if Putin decides to roll into the Eastern NATO countries, they will ignore article 5 because it would be inconvenient for them.",
            "title_similarity": "0.64381826",
            "sentiment_compound": -0.25
        },
        {
            "id": "hyaae4z",
            "score": 4,
            "text": "The German people are cowards. This is nothing new to anyone paying attention.\n\nLes allemands sont des lâches. C’est honteux.",
            "title_similarity": "0.4743148",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyad15h",
            "score": 4,
            "text": "Incredible that it is Boris “the Clown” Johnson who seems to be the only one with the stones to actually push for something impactful.",
            "title_similarity": "0.28139552",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyb2fmj",
            "score": 5,
            "text": "Germany and Italy, on the wrong side of a world war yet again.",
            "title_similarity": "0.53628016",
            "sentiment_compound": -0.7906
        },
        {
            "id": "hy9hpwn",
            "score": 57,
            "text": "I wish more people had talked about how Russia has spent the years following the invasion of Crimea prepping for this by moving off the dollar to the gold standard so that sanctions would be less impactful",
            "title_similarity": "0.6455014",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hy9ti7t",
            "score": 4,
            "text": "At least Boris is on the right side of this and not being a total cunt",
            "title_similarity": "0.2644602",
            "sentiment_compound": -0.5413
        },
        {
            "id": "hy9tllb",
            "score": 6,
            "text": " Conventional war is the only way to stop Russia or they'll get whatever they want. You can say but that will start nuclear war but  the alternative is this maniac wiping out anyone he wants anyway. Either he will end the world  by using nuclear weapons or back down.",
            "title_similarity": "0.6148323",
            "sentiment_compound": -0.9586
        },
        {
            "id": "hy9vnx5",
            "score": 5,
            "text": "Take away their Pornhub.  There will be riots in the streets.",
            "title_similarity": "0.57065815",
            "sentiment_compound": -0.5106
        },
        {
            "id": "hyagnqo",
            "score": -6,
            "text": "This will only piss of Russia more and make them feel like everyone is interfering leading to an actual world war with Nukes, This is kinda a double sided sword here",
            "title_similarity": "0.67300344",
            "sentiment_compound": -0.6249
        },
        {
            "id": "hydbxf8",
            "score": -4,
            "text": "Why Russia is painted as evil after this invasion ? Isn’t it the same what US were doing in Iraq and other countries",
            "title_similarity": "0.71928823",
            "sentiment_compound": -0.6597
        },
        {
            "id": "hy995e2",
            "score": 1334,
            "text": "Fucking Germany again. Who's side are you on??",
            "title_similarity": "0.50456554",
            "sentiment_compound": 0.0
        },
        {
            "id": "hy9obrz",
            "score": 19,
            "text": "Even Merkel has more balls than Scholz.",
            "title_similarity": "0.055621985",
            "sentiment_compound": 0.0
        },
        {
            "id": "hy9twto",
            "score": 34,
            "text": "As an Iranians whome my country went through sanctions and all that about 15 years ago duo to the nuclear program, I just want to say that these measures, although significant and valuable, immensely affect ordinary people.\nI'm not against the the idea of sanctions and international isolation. However, vulnerable families pay the price as always, and that's saddening. (Imagine all the people..... )",
            "title_similarity": "0.44815522",
            "sentiment_compound": -0.4588
        },
        {
            "id": "hy9v0bl",
            "score": 6,
            "text": "**Not fucking enough by any stretch of the imagination.**\n\nSeize **ALL** Russian assets.  Money, Homes, businesses, and property.  Liquidize it, and send it to the Ukraine.\n\nThe world can punish Russia today.  Right now.\n\n...if they wanted to.\n\nThey don't, because it hurts their bottom lines too.\n\nGreed will end us all.",
            "title_similarity": "0.7138884",
            "sentiment_compound": -0.4303
        },
        {
            "id": "hya2e1x",
            "score": 6,
            "text": "Speaking as someone from the uk, I can’t fucking believe I’m agree with boris fucking Johnson",
            "title_similarity": "0.52587354",
            "sentiment_compound": 0.4144
        },
        {
            "id": "hyama2y",
            "score": 6,
            "text": "Dear Ukrainians!\n\nI heard on social media that there is fake news being spread (most likely by Russia backed trolls) that polish border is closed.\n\nIt's a lie.\n\nIf you seek asylum - go towards polish border. We are ready for your arrival. We have reception points ready at the border where you can find shelter, food, medical and legal aid.\n\nPolish government launched a dedicated site to help you: ua.gov.pl\n\nPlease share this information if you know anyone seeking help right now.\n\nYOU DON'T NEED VISA TO PASS THROUGH POLISH BORDER. ALL YOU NEED IS PASSPORT. VISAS ARE SUSPENDED! YOU DON'T NEED THEM FOR TIME BEING!!!!!!\n\nproof that you no longer need visa:\n\n•\t⁠in Ukrainian https://www.gov.pl/web/udsc/ukraina---ua\n•\t⁠in English https://www.gov.pl/web/udsc/ukraina-en\n\n#copied from /u/everysir to spread awareness! please spread on relevant threads to get the word out!!!",
            "title_similarity": "0.6463301",
            "sentiment_compound": 0.9317
        },
        {
            "id": "hyad2er",
            "score": 23,
            "text": "Boris Johnson is a clown, but i have to say, he's been far more agressive towards Russia than other leaders, he's arming Ukraine, pushing for real sanctions and actually starting to clean UK from scummy Russian capital. But i'm not sure swift ban will go through, since US and part of EU is being weak on Russia as always.",
            "title_similarity": "0.6428338",
            "sentiment_compound": 0.0657
        },
        {
            "id": "hy9h3l7",
            "score": 6,
            "text": "They have to pull all their money out first before they cut Russia off, but cutting off Russian access to swift seems like more of a formality at this point.",
            "title_similarity": "0.71778536",
            "sentiment_compound": 0.4854
        },
        {
            "id": "hy9oxnw",
            "score": 39,
            "text": "Whatever, these sanctions should have been preemptive. Europe's frankly infantile optimism that this could be resolved diplomatically has been infuriating to see from the outside. Germany in particular it seems is living in some kind of fantasyland.",
            "title_similarity": "0.49444303",
            "sentiment_compound": 0.2023
        },
        {
            "id": "hy9qpow",
            "score": 8,
            "text": "Even a broken Mickey Mouse watch is right twice a day, and Boris Johnson is right.",
            "title_similarity": "0.23068222",
            "sentiment_compound": -0.4767
        },
        {
            "id": "hy9siqx",
            "score": 25,
            "text": "Democracy is speaking.  \n\nLouder and louder is the voice to cut Russia from Swift.  \n\nWe are really angry at what we see. And make no mistake, when NATO strikes, it is personal. We are going after your money, little dick Vlad.",
            "title_similarity": "0.67328215",
            "sentiment_compound": -0.8108
        },
        {
            "id": "hy9u1sh",
            "score": 10,
            "text": ">Dmytro Kuleba, Ukraine’s minister of foreign affairs,[ tweeted:](https://twitter.com/dmytrokuleba/status/1496874382102351872?s=27) “Everyone who now doubts whether Russia should be banned from Swift has to understand that the blood of innocent Ukrainian men, women and children will be on their hands too.”\n\nThe blood of innocent Ukrainian men, women and children will be on the hands of every single Russian national that's not doing something against Putin right now. They are just as guilty as he is.",
            "title_similarity": "0.6507733",
            "sentiment_compound": -0.34
        },
        {
            "id": "hy9bcqz",
            "score": 804,
            "text": "Всем привет. Я из России и я против войны. И пожалуй это первый день, когда мне мерзко от того, кто я и где живу, мне стыдно за маму, которая верит всей этой пропаганде, мне стыдно за некоторых знакомых, которые предпочитают отмалчиваться. Но я понимаю, что не мне одному нужно стыдиться, поскольку ведь я вижу, что санкции тормозят чиновники из Германии, Италии, Венгрии и Кипра - тех стран, где крутятся ворованные и кровавые деньги.\r  \nИнтересно, депутатам, которые лоббируют пассивное поведение, так же больно, как и мне сегодня?\r  \n\r  \nHello. I am from Russia and I am against the war. And perhaps this is the first day when I am disgusted with who I am and where I live, I am ashamed of my mother, who believes in all this propaganda, I am ashamed of some of my acquaintances who prefer to remain silent. But I understand that I am not the only one who needs to be ashamed, because I see that the sanctions are hindered by officials from Germany, Italy, Hungary and Cyprus - those countries where stolen and bloody money is circulating.\r  \nI wonder if the deputies who lobby for passive behavior are hurting as much as I am today?",
            "title_similarity": "0.46560282",
            "sentiment_compound": -0.9727
        },
        {
            "id": "hy9waww",
            "score": 11,
            "text": "kick out every corrupt Russian ex pat family from London - seize their assets. Send em back and make sure it’s all over instagram. Americans worked to get trump out of office - now it’s Russia’a turn to do the same - they have a lot more to lose but they need to topple this guy.",
            "title_similarity": "0.67065203",
            "sentiment_compound": 0.0028
        },
        {
            "id": "hy9x9qq",
            "score": 11,
            "text": "Russian bots - \"Boris Johnson is a Russian puppet!!!\"\n\nBoris - \"Oh really? Watch this then.\"",
            "title_similarity": "0.66538966",
            "sentiment_compound": 0.0
        },
        {
            "id": "hy9q500",
            "score": 13,
            "text": "The world has gone mad. Boris is making sense.",
            "title_similarity": "0.5145032",
            "sentiment_compound": -0.4939
        },
        {
            "id": "hy9ww57",
            "score": 10,
            "text": "Germany can be considered Russian ally at this point.",
            "title_similarity": "0.6209538",
            "sentiment_compound": 0.0
        },
        {
            "id": "hya0eo4",
            "score": 13,
            "text": "Every nation needs to push to isolate Russia in everything right now. Payment systems, Olympics, NATO, UN, air travel, boat travel, EVERYTHING. Russia needs to be an island of lepers right now. PERMANENTLY.",
            "title_similarity": "0.7237632",
            "sentiment_compound": -0.2023
        },
        {
            "id": "hy998ep",
            "score": 149,
            "text": "This is a big fucking deal.",
            "title_similarity": "0.183161",
            "sentiment_compound": 0.0
        },
        {
            "id": "hy9i3j6",
            "score": 12,
            "text": "Now THIS is serious consequences. I applaud this.",
            "title_similarity": "0.17600626",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hy9k6w4",
            "score": 13,
            "text": "The Brits have balls",
            "title_similarity": "0.032646578",
            "sentiment_compound": 0.0
        },
        {
            "id": "hy99bun",
            "score": 67,
            "text": "Finally a suggestion with some teeth to it. Can only hope they actually go through with it.",
            "title_similarity": "0.24729103",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hy9qdmz",
            "score": 70,
            "text": "Good. And don’t freeze their assets. Take their assets.",
            "title_similarity": "0.29299587",
            "sentiment_compound": 0.6705
        },
        {
            "id": "hy9e8sk",
            "score": 1125,
            "text": "What the fuck is Germany doing?",
            "title_similarity": "0.43832874",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hy9a07u",
            "score": 1382,
            "text": "These fucking cowards I swear to god. A fucking week ago it was kicking Russia out of Swift if they invaded.  The fucking cunts are in the damn capital!!!\n\nWhat a fucking disgrace.",
            "title_similarity": "0.66059107",
            "sentiment_compound": -0.8697
        },
        {
            "id": "hy9wl5l",
            "score": 17,
            "text": "Boris is the first person to actually do something instead of dealing in useless sanctions against some random guys. VTB + Aeroflot sanctions are huge.\n\nHuge respect and a thank you from Ukraine",
            "title_similarity": "0.4418476",
            "sentiment_compound": 0.7506
        },
        {
            "id": "hy99c60",
            "score": 2659,
            "text": "If it really is Germany holding up this action, then fuck them.  They have the strongest hand to play in this crisis and they're folding.",
            "title_similarity": "0.4757964",
            "sentiment_compound": -0.0258
        },
        {
            "id": "hy9safc",
            "score": 333,
            "text": "Okay. our country that doesn't has all of this resources is struggling to fight against invasion. Okay, im personally hearing explosions and seeing warplanes flying over houses just to make them tremble with air hits.\n\nOkay, you won't send any real forces to stop this, you've learned nothing from WW2.\n\nBut can you have at least enough balls to disable SWIFT?\n\nStting in basements, with electricity disabled while my country is gradually being taken over by an invader with criminal government ill be thinking about some fucker in bundestag that thought it's more important to have one more portion of caviar than stopping WW3",
            "title_similarity": "0.5381341",
            "sentiment_compound": -0.9203
        },
        {
            "id": "hy9r8nt",
            "score": 259,
            "text": "Can someone explain what SWIFT is and why it's so important? Have never heard of it before today.",
            "title_similarity": "0.24638547",
            "sentiment_compound": 0.5993
        },
        {
            "id": "hy9qtdb",
            "score": 159,
            "text": "Should have been cut off 12 hours ago.",
            "title_similarity": "0.38762534",
            "sentiment_compound": -0.2732
        },
        {
            "id": "hy9934n",
            "score": 3040,
            "text": "Only solution to stop this is to starve Russia out. Direct warfare is not an option",
            "title_similarity": "0.6859826",
            "sentiment_compound": -0.6124
        },
        {
            "id": "hy9vwf6",
            "score": 27,
            "text": "As a German I am ashamed that my government opposes this.",
            "title_similarity": "0.4609406",
            "sentiment_compound": -0.4767
        },
        {
            "id": "hy9m224",
            "score": 244,
            "text": "How the fuck is it not already? hello? Isn't this what the \"severe sanctions\" was supposed to include?",
            "title_similarity": "0.5092252",
            "sentiment_compound": -0.7677
        },
        {
            "id": "hy9a6rq",
            "score": 8383,
            "text": ">However, Olaf Scholz, German chancellor, warned Johnson on Thursday that his country would not support such a dramatic move and neither would the EU, according to officials close to sanctions negotiations.\n\nCome on Germany and EU. For once, have to act instead of hope it all fixes itself.",
            "title_similarity": "0.6036429",
            "sentiment_compound": -0.1174
        },
        {
            "id": "hy9xnx6",
            "score": 1341,
            "text": "As a British man, I find it hard to believe that the most prominent voice against Russia currently (outside of Ukraine) is Boris fucking Johnson.\n\nCitizens of Germany and Italy - pressure your politicians to demand the removal of Russia from SWIFT and enact punitive sanctions!",
            "title_similarity": "0.7165949",
            "sentiment_compound": -0.3749
        },
        {
            "id": "hy9vnel",
            "score": 591,
            "text": "[removed]",
            "title_similarity": "0.38150543"
        },
        {
            "id": "hy9cb7g",
            "score": 388,
            "text": "Czech Republic and UK now are on board.  That's good.",
            "title_similarity": "0.20172831",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hy995ea",
            "score": 5999,
            "text": "YES.\n\nAs the Ukrainian Defense Ministry put it: \"to the people who doubt about disconnecting from SWIFT: the blood of children is in your hands\".",
            "title_similarity": "0.65931165",
            "sentiment_compound": 0.608
        },
        {
            "id": "hy9nd5j",
            "score": 1109,
            "text": "Do it.  There will be financial pain globally, but Ukrainians are literally being murdered (I say murdered because this is not a legit war - it’s a war crime).  Time for the Democratic world to actually live the courage of its stated convictions.",
            "title_similarity": "0.61214876",
            "sentiment_compound": -0.958
        },
        {
            "id": "hy9m7ix",
            "score": 13408,
            "text": "Dear Ukrainians!\n\nI heard on social media that there is fake news being spread (most likely by Russia backed trolls) that polish border is closed.\n\nIt's a lie.\n\nIf you seek asylum - go towards polish border. We are ready for your arrival. We have reception points ready at the border where you can find shelter, food, medical and legal aid.\n\nPolish government launched a dedicated site to help you: ua.gov.pl\n\nPlease share this information if you know anyone seeking help right now.\n\nEDIT: YOU DON'T NEED VISA TO PASS THROUGH POLISH BORDER. ALL YOU NEED IS PASSPORT. VISAS ARE SUSPENDED! YOU DON'T NEED THEM FOR TIME BEING!!!!!!\n\nEDIT2: as a proof that you no longer need visa:\n\n•\t⁠in Ukrainian https://www.gov.pl/web/udsc/ukraina---ua\n•\t⁠in English https://www.gov.pl/web/udsc/ukraina-en",
            "title_similarity": "0.6461592",
            "sentiment_compound": 0.9124
        },
        {
            "id": "hy9ouxs",
            "score": 947,
            "text": "Do it Boris.",
            "title_similarity": "0.39493176",
            "sentiment_compound": 0.0
        },
        {
            "id": "hy9937v",
            "score": 16741,
            "text": "Massive if it is true. Every single country should pursue this.",
            "title_similarity": "0.2601313",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hy9hb1v",
            "score": 2,
            "text": "I’m surprised we don’t cut them off from out networks. Remove their ability to connect to the main internet.",
            "title_similarity": "0.43895203",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hy9i5g9",
            "score": 3,
            "text": "They really should do that… and I would like to see them seize the overseas assets of these Russian oligarchs wherever possible.",
            "title_similarity": "0.6411085",
            "sentiment_compound": 0.4939
        },
        {
            "id": "hy9icsr",
            "score": 1,
            "text": "Yes, we have to crush them economically until the oust Putin and his cronies.",
            "title_similarity": "0.7443917",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hy9id2o",
            "score": 1,
            "text": "They should have done this immediately! What are they waiting for",
            "title_similarity": "0.31880987",
            "sentiment_compound": 0.0
        },
        {
            "id": "hy9iorj",
            "score": 1,
            "text": "Is there any chance that a hacker group could take down Swift?",
            "title_similarity": "0.37448177",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hy9j1sr",
            "score": 1,
            "text": "Should be ejected from everything.  I just saw a Russian jet (video) fly over civilian homes and fire a Missile.   I hope the people that can’t defend themselves evacuate to Poland",
            "title_similarity": "0.6391351",
            "sentiment_compound": 0.128
        },
        {
            "id": "hy9jpoc",
            "score": 1,
            "text": "Non European here, can someone explain what is swift payment?",
            "title_similarity": "0.39103007",
            "sentiment_compound": 0.2023
        },
        {
            "id": "hy9khko",
            "score": 1,
            "text": "What's the risk for banning them from Swift? Besides just making them more desperate/angry, is there some economic downside that would affect other countries?\n\n&#x200B;\n\nEdit; I went and found this NYT article that helps answer this.   \nhttps://www.nytimes.com/2022/01/31/us/politics/russia-swift.html",
            "title_similarity": "0.688635",
            "sentiment_compound": 0.168
        },
        {
            "id": "hy9kndf",
            "score": 1,
            "text": "FUCKING DOOOO IT. NOW!",
            "title_similarity": "0.33621502",
            "sentiment_compound": 0.0
        },
        {
            "id": "hy9kto5",
            "score": 1,
            "text": "Will this prevent them from Swiss banking too?  Apparently a lot of their money flows through Swiss banks so that would be very important.",
            "title_similarity": "0.38546026",
            "sentiment_compound": 0.2944
        },
        {
            "id": "hy9la9w",
            "score": 1,
            "text": "This would just give crypto a massive boost",
            "title_similarity": "0.18614961",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hy9lc7r",
            "score": 1,
            "text": "Never thought I'd agree on something with Boris.",
            "title_similarity": "0.3659826",
            "sentiment_compound": -0.2755
        },
        {
            "id": "hy9ls2m",
            "score": 1,
            "text": "He never said he was pushing for it.",
            "title_similarity": "0.19068295",
            "sentiment_compound": 0.0
        },
        {
            "id": "hy9ltmr",
            "score": 1,
            "text": "Russia are going to become China's bitch.",
            "title_similarity": "0.6609667",
            "sentiment_compound": -0.5859
        },
        {
            "id": "hy9luum",
            "score": 1262,
            "text": "Who would make final decision on SWIFT? Everyone pushes but no one acts.",
            "title_similarity": "0.35709953",
            "sentiment_compound": -0.2578
        },
        {
            "id": "hy9mrao",
            "score": 1,
            "text": "What are the chances this actually happens?",
            "title_similarity": "0.16752207",
            "sentiment_compound": 0.2023
        },
        {
            "id": "hy9mt5b",
            "score": 1,
            "text": "Should’ve be already done as soon as he mounted forces there.",
            "title_similarity": "0.36705",
            "sentiment_compound": 0.0
        },
        {
            "id": "hy9na9e",
            "score": 1,
            "text": "This is the only sanction that they couldn’t have accounted for. If the US and Germany join them, they’ll get the boot. I pray it happens, but I have my doubts.",
            "title_similarity": "0.3953617",
            "sentiment_compound": -0.1406
        },
        {
            "id": "hy9ntfa",
            "score": 1,
            "text": "SWIFT - one of the most unsecure systems in the world. Be prepared for some ugly retaliation.",
            "title_similarity": "0.45780578",
            "sentiment_compound": 0.0343
        },
        {
            "id": "hy9nv7d",
            "score": 1,
            "text": "Can someone explain the Swift Payment System?",
            "title_similarity": "0.35461253",
            "sentiment_compound": 0.2023
        },
        {
            "id": "hy9nzsf",
            "score": 1,
            "text": "Why is this not already done?",
            "title_similarity": "0.22094195",
            "sentiment_compound": 0.0
        },
        {
            "id": "hy9o099",
            "score": 1,
            "text": "Good guy Boris shows up again",
            "title_similarity": "0.22919247",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hy9o3f0",
            "score": 10,
            "text": "And stop doing business with Russian firms who supply the Russian army.",
            "title_similarity": "0.7986729",
            "sentiment_compound": -0.296
        },
        {
            "id": "hy9omcy",
            "score": 1,
            "text": "On short term: yes. On the long term: poor people make angry (angrier?) people. Amirite Versailles treaty?",
            "title_similarity": "0.50792706",
            "sentiment_compound": -0.8105
        },
        {
            "id": "hy9onhw",
            "score": 1,
            "text": "Putin eventually wants to go after Israel #GogMagog",
            "title_similarity": "0.5032743",
            "sentiment_compound": 0.0
        },
        {
            "id": "hy9onp6",
            "score": 1,
            "text": "It won't happen, but it would absolutely cripple Russia, to the point of a revolt honestly just based on economic circumstances.",
            "title_similarity": "0.6302914",
            "sentiment_compound": 0.6124
        },
        {
            "id": "hy9or60",
            "score": 1,
            "text": "Eh.. SWIFT is one of the most unsecure systems in the world; what could go wrong?",
            "title_similarity": "0.349408",
            "sentiment_compound": -0.1449
        },
        {
            "id": "hy9ous5",
            "score": 1,
            "text": "Who is against russia expelled from swift? Germany?",
            "title_similarity": "0.74058604",
            "sentiment_compound": -0.1431
        },
        {
            "id": "hy9ow0s",
            "score": 1,
            "text": "Blocked",
            "title_similarity": "0.3198136",
            "sentiment_compound": -0.2732
        },
        {
            "id": "hy9oyxf",
            "score": 1,
            "text": "A broken clock is right twice a day.",
            "title_similarity": "0.16412245",
            "sentiment_compound": -0.4767
        },
        {
            "id": "hy9p1pm",
            "score": 2,
            "text": "Let's hope Ukraine is still on the map when they are done \"pushing\"\n\nIt is sad that after all these weeks of talks, calls, meetings, there is still not a concrete and concise plan",
            "title_similarity": "0.43200493",
            "sentiment_compound": -0.0516
        },
        {
            "id": "hy9p44m",
            "score": 5,
            "text": "Never thought I'd say I actually agree with Boris",
            "title_similarity": "0.34471893",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hy9p7j7",
            "score": 1,
            "text": "Germany is against it according the Financial Times.",
            "title_similarity": "0.5515766",
            "sentiment_compound": 0.0
        },
        {
            "id": "hy9p7sb",
            "score": 2,
            "text": "Kind of funny that we live in a world where the best you can do against a murderous dictator is monetary sanctions. No morality in politics, just economics.",
            "title_similarity": "0.5399974",
            "sentiment_compound": 0.1779
        },
        {
            "id": "hy9pch2",
            "score": 1,
            "text": "Yes, please.",
            "title_similarity": "0.091460705",
            "sentiment_compound": 0.6124
        },
        {
            "id": "hy9pmmg",
            "score": 1,
            "text": "legit question : how do we pay gas then ?",
            "title_similarity": "0.3115068",
            "sentiment_compound": -0.1027
        },
        {
            "id": "hy9po4v",
            "score": 1,
            "text": "Question is if Germany, Greece, and Italy will eventually back it... all the countries which have strong economic \"ties\" (I dont like that word but its the only one that really fits) with Russia.  Hopefully they do the same to Belarus as well.",
            "title_similarity": "0.5121415",
            "sentiment_compound": 0.7779
        },
        {
            "id": "hy9pptc",
            "score": 1,
            "text": "This needs to happen ASAP.",
            "title_similarity": "0.3150229",
            "sentiment_compound": 0.0
        },
        {
            "id": "hy9prut",
            "score": 1,
            "text": "This should have been pre-planned and ready to execute as soon as Russia stepped across the border.  But I guess better late than never.",
            "title_similarity": "0.55912125",
            "sentiment_compound": 0.6808
        },
        {
            "id": "hy9pthq",
            "score": 1,
            "text": "Are pigs flying?",
            "title_similarity": "0.2174931",
            "sentiment_compound": 0.0
        },
        {
            "id": "hy9pu6n",
            "score": 5,
            "text": "Get them off the internet too",
            "title_similarity": "0.46145856",
            "sentiment_compound": 0.0
        },
        {
            "id": "hy9q0nt",
            "score": 1,
            "text": "Should be proceeded",
            "title_similarity": "0.22332019",
            "sentiment_compound": 0.0
        },
        {
            "id": "hy9q2km",
            "score": 2,
            "text": "Watching on Sky News Live",
            "title_similarity": "0.16059995",
            "sentiment_compound": 0.0
        },
        {
            "id": "hy9qcso",
            "score": 2,
            "text": "lol does Boris have a reddit account",
            "title_similarity": "0.36871266",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hy9qg0t",
            "score": 8,
            "text": "Honestly I’m tired of Putin holding the reigns. My whole life he has been in power. It’s time other surrounding countries take their destiny into their own hands by standing against him. \n\nI’m surprised he hasn’t been taken out. Putin and this invasion are wildly unpopular in Russia. I hope nothing but the best for the Ukrainian and Russian civilians who are stuck in this mess created by their oligarchs.\n\nWe’re watching the crumbling of democracy. We should take notes lest similar events occur here.",
            "title_similarity": "0.649845",
            "sentiment_compound": -0.8101
        },
        {
            "id": "hy9qgje",
            "score": 1,
            "text": "I can't believe I'm agreeing with Boris. But this is a really good initiative",
            "title_similarity": "0.19620824",
            "sentiment_compound": 0.5819
        },
        {
            "id": "hy9qgl7",
            "score": 1,
            "text": "Do it! Cut Russia off from the west completely",
            "title_similarity": "0.7614365",
            "sentiment_compound": -0.3382
        },
        {
            "id": "hy9qhnk",
            "score": 1,
            "text": "It’s the Germans",
            "title_similarity": "0.37901634",
            "sentiment_compound": 0.0
        },
        {
            "id": "hy9qoy8",
            "score": 1,
            "text": "DO IT!",
            "title_similarity": "0.1614254",
            "sentiment_compound": 0.0
        },
        {
            "id": "hy9qqyz",
            "score": 1,
            "text": "As he should",
            "title_similarity": "0.13932888",
            "sentiment_compound": 0.0
        },
        {
            "id": "hy9qr3k",
            "score": 3,
            "text": "Please please cut them from SWIFT",
            "title_similarity": "0.51776206",
            "sentiment_compound": 0.6166
        },
        {
            "id": "hy9qwz6",
            "score": 2,
            "text": "This would cause a global issue here. Notwithstanding, Russia has alternative options to SWIFT available if this happens. They've been preparing for this moment for years.",
            "title_similarity": "0.5064268",
            "sentiment_compound": 0.368
        },
        {
            "id": "hy9qygw",
            "score": 2,
            "text": "What effect would this truly have? I keep reading how China would help Russia keep afloat. Didn't Russia consider these possible sanctions?",
            "title_similarity": "0.55863845",
            "sentiment_compound": 0.7532
        },
        {
            "id": "hy9r1jh",
            "score": 1,
            "text": "Wait, so do we like Boris Johnson now? He confuses me.",
            "title_similarity": "0.39911538",
            "sentiment_compound": 0.1189
        },
        {
            "id": "hy9r265",
            "score": 1,
            "text": "Didn’t Putin say he would treat ejectment from swift as a declaration of war?",
            "title_similarity": "0.72375107",
            "sentiment_compound": -0.1027
        },
        {
            "id": "hy9r8k3",
            "score": 1,
            "text": "But Germany says no.",
            "title_similarity": "0.45864755",
            "sentiment_compound": 0.0
        },
        {
            "id": "hy9r99b",
            "score": 1,
            "text": "Good!!!! Eject them from the SWIFT system!!! Putin needs to know that killing innocent people and invading a country for no reason can NOT and will NOT be tolerated.",
            "title_similarity": "0.6791694",
            "sentiment_compound": 0.3402
        },
        {
            "id": "hy9r9e2",
            "score": 1,
            "text": "Do it.",
            "title_similarity": "0.12568578",
            "sentiment_compound": 0.0
        },
        {
            "id": "hy9rc66",
            "score": 2,
            "text": "He is right! And block their access to the internet…",
            "title_similarity": "0.4511366",
            "sentiment_compound": -0.4926
        },
        {
            "id": "hy9rejc",
            "score": 1,
            "text": "I hope not. Close to retiring so my portfolio doesn’t need that",
            "title_similarity": "0.2915519",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hy9rf69",
            "score": 1,
            "text": "Not a good idea. This could backfire on the US",
            "title_similarity": "0.42159414",
            "sentiment_compound": -0.3412
        },
        {
            "id": "hy9rfwk",
            "score": 1,
            "text": "I would rather world leaders push for Putin to be ejected from the planet.",
            "title_similarity": "0.7828798",
            "sentiment_compound": 0.0
        },
        {
            "id": "hy9rfww",
            "score": 1,
            "text": "Didn't he just say that it is \"not off the table\"? Wouldn't call that pushing for something.",
            "title_similarity": "0.3475498",
            "sentiment_compound": 0.0
        },
        {
            "id": "hy9rhsc",
            "score": 2,
            "text": "I don't know why this is even a question at this point. The only option is to cripple Russia, excise it from the world and hope that it's enough to get the people within Russia motivated to put enough pressure on Putin to get him to stop or be removed.",
            "title_similarity": "0.7529136",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hy9riam",
            "score": 2,
            "text": "can someone r/explainlikeimfive",
            "title_similarity": "0.1705642",
            "sentiment_compound": 0.0
        },
        {
            "id": "hy9rjat",
            "score": 1,
            "text": "Boris grows balls",
            "title_similarity": "0.3116758",
            "sentiment_compound": 0.0
        },
        {
            "id": "hy9rk5q",
            "score": 1,
            "text": "Need to take Russian money from all the British Island protectorates, too.\n\nIsle of Man, Guernsey, the Bahamas... they're all flush with dirty Russian money.\n\nStarve the oligarchs. Make them bleed.",
            "title_similarity": "0.6852949",
            "sentiment_compound": -0.7003
        },
        {
            "id": "hy9rkbv",
            "score": 1,
            "text": "What is SWIFT?",
            "title_similarity": "0.22901532",
            "sentiment_compound": 0.368
        },
        {
            "id": "hy9rm2a",
            "score": 1,
            "text": "Lol, I’m agreeing with Boris Johnson",
            "title_similarity": "0.28185755",
            "sentiment_compound": 0.6369
        },
        {
            "id": "hy9rmvl",
            "score": 1,
            "text": "Details of the EU sanctions according to dpa: Russia is not excluded from the Swift banking communications network and there is no ban on the export of natural gas.",
            "title_similarity": "0.49482748",
            "sentiment_compound": 0.8053
        },
        {
            "id": "hy9ro9u",
            "score": 2,
            "text": "Hang in there if you're living in Russia. Putin has fucked you over as bad as it gets. Hopefully he gets ousted. He has no business being in charge of a country.",
            "title_similarity": "0.74947464",
            "sentiment_compound": -0.8126
        },
        {
            "id": "hy9rqry",
            "score": 1,
            "text": "This would result in Russia revaluing gold",
            "title_similarity": "0.5911292",
            "sentiment_compound": 0.0
        },
        {
            "id": "hy9rrf9",
            "score": 1,
            "text": "2",
            "title_similarity": "0.10784807",
            "sentiment_compound": 0.0
        },
        {
            "id": "hy9rsa8",
            "score": 3,
            "text": "This is going to be devastating for the Russian oligarchs.  Literally every Russian billionaire has their wealth in British or American banks.  Russian banks are dependent on Swift for financing.",
            "title_similarity": "0.5609585",
            "sentiment_compound": -0.0772
        },
        {
            "id": "hy9rxej",
            "score": 1,
            "text": "So bitcoin?",
            "title_similarity": "0.31534627",
            "sentiment_compound": 0.0
        },
        {
            "id": "hy9rxwb",
            "score": 2,
            "text": "Putin would threaten nuclear war over this.",
            "title_similarity": "0.5853078",
            "sentiment_compound": -0.7579
        },
        {
            "id": "hy9s30q",
            "score": 1,
            "text": "Why hasn't this been done already?",
            "title_similarity": "0.26768813",
            "sentiment_compound": 0.0
        },
        {
            "id": "hy9s321",
            "score": 1,
            "text": "Agreed",
            "title_similarity": "0.03847996",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hy9s6d0",
            "score": 3,
            "text": "I am Russian and do not support Putin. Please make him regret what he is doing. We don't want war!  My country is run by fascists ((\r  \nMost Russians are intimidated or deceived by propaganda. Most of our people say of themselves, \"I am out of politics,\" because they are afraid of criminal prosecution and are trying to survive. Help Ukraine.",
            "title_similarity": "0.663526",
            "sentiment_compound": -0.9447
        },
        {
            "id": "hy9s7oz",
            "score": 1,
            "text": "I seriously clapped when I heard Boris Johnson saying aeroflot will\nbe banned from the UK and put on same level with Air Koryo and Belavia. I’m estonian and i’m seriously proud of having friends like british through the whole crisis atm.",
            "title_similarity": "0.5360328",
            "sentiment_compound": -0.2023
        },
        {
            "id": "hy9sa4k",
            "score": 1,
            "text": "Massive blow to money flowing in and out.",
            "title_similarity": "0.35632324",
            "sentiment_compound": 0.0
        },
        {
            "id": "hy9sa7o",
            "score": 2,
            "text": "I've been reluctant on seeing the regular Russian people suffer because of their leader. But I'm now fairly certain that this regime won't go away until they revolt. A short pain is better than decades of this mafioso asshole keeping everybody hostge.\n\nSo shut down everything. Absolutely everything. Bar all flights out of Russia, stop all traffic, don't move their mail over the border. Everything. All of these rely on international treaties and if Putin wants out of some of them, let's cut them all off to let him know he can't cherry pick.",
            "title_similarity": "0.71303344",
            "sentiment_compound": -0.7311
        },
        {
            "id": "hy9sagt",
            "score": 3,
            "text": "Shut down Russia banks access \n\nNow.",
            "title_similarity": "0.8335132",
            "sentiment_compound": 0.0
        },
        {
            "id": "hy9sdme",
            "score": 1,
            "text": "Every peace loving country please support this, thanks, you'd be doing a favor to a homo sapiens civilization",
            "title_similarity": "0.14168864",
            "sentiment_compound": 0.9517
        },
        {
            "id": "hy9sg07",
            "score": 1,
            "text": "Boris sure got lucky Putin dropped this massive dead cat on the table just at the right time, didn't he",
            "title_similarity": "0.46905294",
            "sentiment_compound": -0.0516
        },
        {
            "id": "hy9shps",
            "score": 1,
            "text": "I don’t know why people (mainly news commentators) don’t think Russia thought about, and planned for, the blowback by the international community.",
            "title_similarity": "0.51212466",
            "sentiment_compound": 0.0
        },
        {
            "id": "hy9si5n",
            "score": 1,
            "text": "not a big fan of BJ but from the speech i’ve heard today hes on the correct side of history",
            "title_similarity": "0.26508164",
            "sentiment_compound": -0.1232
        },
        {
            "id": "hy9sjcm",
            "score": 1,
            "text": "I have to praise Boris. The best European liderance so far.",
            "title_similarity": "0.2777692",
            "sentiment_compound": 0.8316
        },
        {
            "id": "hy9sk5x",
            "score": 1,
            "text": "America and others won't do it. It would hurt the quarterly gains.",
            "title_similarity": "0.46122944",
            "sentiment_compound": -0.25
        },
        {
            "id": "hy9skga",
            "score": 1,
            "text": "I've been watching Sky News for hours now. He didn't push for it. He was a bit noncommittal at best.",
            "title_similarity": "0.17109486",
            "sentiment_compound": 0.6369
        },
        {
            "id": "hy9sogp",
            "score": 5,
            "text": "Bizarro world when Boris finally steps up in a leadership position.\n\nEjecting Russia from SWIFT has to be done. This would in theory impose a \"financial siege\" of sorts. Cutting them off from accessing their funds is a good way to sanction them.",
            "title_similarity": "0.79625297",
            "sentiment_compound": 0.4084
        },
        {
            "id": "hy9sot6",
            "score": 2,
            "text": "Ejection from SWIFT would be sweet, but it would be painful for a lot of western economies trying to collect debt/payments from Russia. It's not a step to be taken lightly. In my mind, it's like - OK close SWIFT and raise the iron curtain. No more visas, no travel, no business relationships. Severed.",
            "title_similarity": "0.71324825",
            "sentiment_compound": 0.3464
        },
        {
            "id": "hy9sp23",
            "score": 3,
            "text": "wow for once he does something right!",
            "title_similarity": "0.03978266",
            "sentiment_compound": 0.6239
        },
        {
            "id": "hy9svhb",
            "score": 1,
            "text": "Whats Swift?",
            "title_similarity": "0.22933555",
            "sentiment_compound": 0.2023
        },
        {
            "id": "hy9svju",
            "score": 1,
            "text": "And just like that I agree with Boris Johnson and disagree with Germany's stance on the same issue. Never thought I'd see the day.",
            "title_similarity": "0.4850168",
            "sentiment_compound": 0.34
        },
        {
            "id": "hy9svpn",
            "score": 1,
            "text": "Unfortunately, this is only a short term solution. Must be done, but I fear Russia will only grow to live with it",
            "title_similarity": "0.54873526",
            "sentiment_compound": -0.6542
        },
        {
            "id": "hy9sw4t",
            "score": 1,
            "text": "Rare Boris Johnson W",
            "title_similarity": "0.3267883",
            "sentiment_compound": 0.0
        },
        {
            "id": "hy9swrb",
            "score": 1,
            "text": "It’s too late; the important people swapped their money for other currencies weeks or months ago. Anything general they do now only hurts the average Russian, who their government doesn’t actually care about.",
            "title_similarity": "0.58507025",
            "sentiment_compound": 0.2263
        },
        {
            "id": "hy9sxx3",
            "score": 1,
            "text": "Do it",
            "title_similarity": "0.1295401",
            "sentiment_compound": 0.0
        },
        {
            "id": "hy9sznf",
            "score": 1,
            "text": "And what will Johnson do about all the Russian donors that his party has?",
            "title_similarity": "0.6699501",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hy9t1b6",
            "score": 2,
            "text": "Hopefully they'll do the rest of Garry Kasparov's list too",
            "title_similarity": "0.35103825",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hy9t1fn",
            "score": 3,
            "text": "Yesss",
            "title_similarity": "0.06624335",
            "sentiment_compound": 0.0
        },
        {
            "id": "hy9t8w9",
            "score": 2,
            "text": "Nan I could have borrowed money to a Russian bank and never have to pay anything😜",
            "title_similarity": "0.521737",
            "sentiment_compound": 0.0762
        },
        {
            "id": "hy9t9l1",
            "score": 2,
            "text": "Slava Ukraina!  Let’s do it. \n\nHowever: https://www.ft.com/content/e2e1748a-32c6-4ca9-85d8-3a384eede156 Shutting out Russia from Swift system would not be a surgical strike\nBan from payments alliance over Ukraine might not isolate country financially",
            "title_similarity": "0.6541748",
            "sentiment_compound": -0.4588
        },
        {
            "id": "hy9t9zt",
            "score": 1,
            "text": "https://petition.parliament.uk/petitions/609477/sponsors/new?token=wNu5CSY72rA8i3xYz1Y-",
            "title_similarity": "0.45175087",
            "sentiment_compound": 0.0
        },
        {
            "id": "hy9tbic",
            "score": 1,
            "text": "Do it",
            "title_similarity": "0.1295401",
            "sentiment_compound": 0.0
        },
        {
            "id": "hy9tdqo",
            "score": 1,
            "text": "As they should be.",
            "title_similarity": "0.0672634",
            "sentiment_compound": 0.0
        },
        {
            "id": "hy9tdvg",
            "score": 2,
            "text": "How much you got to fuck up for Reddit and Boris Johnson to be against you?",
            "title_similarity": "0.62087274",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hy9thly",
            "score": 1,
            "text": "Yes",
            "title_similarity": "0.046967294",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hy9time",
            "score": 1,
            "text": "This is right up there with invading Russia.",
            "title_similarity": "0.65014994",
            "sentiment_compound": 0.0
        },
        {
            "id": "hy9tnfw",
            "score": 1,
            "text": "\nHey /u/Leondgeeste,\n\n\nThis is now the top post on reddit. It will be recorded at /r/topofreddit with all the other top posts.",
            "title_similarity": "0.19597502",
            "sentiment_compound": 0.3818
        },
        {
            "id": "hy9tobc",
            "score": 7,
            "text": "As the world we need to disconnect Russia from everything, make them another north korea. No goods go in, none come out.",
            "title_similarity": "0.70733947",
            "sentiment_compound": -0.296
        },
        {
            "id": "hy9tp7c",
            "score": 1,
            "text": "As much as I agree that Russia should be cut off from SWIFT, it isn't going to happen.  Much of western Europe has billions in outstanding loans to Russia and doing this will cut off repayments to them.  It's a simple matter of economics.\n\nExcerpt from recent Biden news conference:\n\nBiden said removing Russia from SWIFT is not the direction the rest of Europe wants to go in at this moment. \n\n>Biden said removing the nation from SWIFT, a high security network that connects thousands of financial institutions around the world, is “always an option,” but said, “right now, that’s not the position that the rest of Europe wishes to take.”",
            "title_similarity": "0.66851413",
            "sentiment_compound": 0.7964
        },
        {
            "id": "hy9tqj2",
            "score": 1,
            "text": "Boris is doing great. Best European lider so far.",
            "title_similarity": "0.15250514",
            "sentiment_compound": 0.8519
        },
        {
            "id": "hy9tr63",
            "score": 5,
            "text": "if we don't eject them from swift then this is just another proxy war to test this-gen armament while world powers collude to protect energy investments/stability.",
            "title_similarity": "0.5266309",
            "sentiment_compound": 0.1531
        },
        {
            "id": "hy9ts4i",
            "score": 15,
            "text": "This, and everything else they are a part of they should loose access to.  Immediately.  This shouldn’t even be a discussion.  Airlines shouldn’t fly there either.  \n\nThey want to wage war, fuck them.  They can be their own isolationist society.\n\nWorld leaders - grow a spine.  Cut them off , now. And don’t let them back in until Putin and his regime are gone.",
            "title_similarity": "0.73422676",
            "sentiment_compound": -0.8689
        },
        {
            "id": "hy9tubf",
            "score": 1,
            "text": "I love Boris’ most recent response.",
            "title_similarity": "0.24909423",
            "sentiment_compound": 0.6369
        },
        {
            "id": "hy9u1eg",
            "score": 4,
            "text": "You can’t see that Putin is a strategist, he is old school kgb he has already thought of all possibilities and worked out solutions. He is old ussr and wants it back. His only miscalculation is his own people. They don’t want war.",
            "title_similarity": "0.57366276",
            "sentiment_compound": -0.4404
        },
        {
            "id": "hy9u3g1",
            "score": 5,
            "text": "He should deport all the Russian billionaires out of London first, that’s the only way they’ll get through to Putin",
            "title_similarity": "0.7935287",
            "sentiment_compound": 0.0
        },
        {
            "id": "hy9u3zz",
            "score": 3,
            "text": "[deleted]",
            "title_similarity": "0.39116004"
        },
        {
            "id": "hy9uayx",
            "score": 3,
            "text": "The right choice. \n\nWithout Swift Russian will be running on rations in a week",
            "title_similarity": "0.37141642",
            "sentiment_compound": -0.1511
        },
        {
            "id": "hy9udf7",
            "score": 3,
            "text": "Yeah. I mean the argument that we wont do it because it would hurt us too is so ridiculously cowardish. These sanctions are the less we can do now. Even if it mean taking some financial hit. (because in the end it may be the least expensive solution)",
            "title_similarity": "0.38411766",
            "sentiment_compound": -0.6722
        },
        {
            "id": "hy9ufge",
            "score": 1,
            "text": "The Russians have been prepearing alternatives for this for years. This is not the blow you might think it is. At worst we would just weaken ourselves massivly in the face of already taking a blow from downing the Russian economy. At best we just force them to cirvumvent the system.",
            "title_similarity": "0.6636765",
            "sentiment_compound": -0.4019
        },
        {
            "id": "hy9uhru",
            "score": 1,
            "text": "The Oligarchs won't be pleased about this.",
            "title_similarity": "0.4512974",
            "sentiment_compound": -0.3412
        },
        {
            "id": "hy9uk1w",
            "score": 1,
            "text": "Eject Russia from everything. Cripple their asses.",
            "title_similarity": "0.8039024",
            "sentiment_compound": 0.0
        },
        {
            "id": "hy9ulh7",
            "score": 1,
            "text": "It needed to happen, like yesterday.",
            "title_similarity": "0.21045725",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hy9un0j",
            "score": 2,
            "text": "Russia needs to be ejected from the world. Cut them off from everything. Trade embargoes, cutting them off from western internet, travel bans, seizure of Russian oligarchs assets. Russias economy is abysmal, they just carry a big stick. The west doesn't need to fire a shot to bring Russia to its knees",
            "title_similarity": "0.76956785",
            "sentiment_compound": 0.0351
        },
        {
            "id": "hy9unpr",
            "score": 6,
            "text": "Finally something Boris says I can agree with!",
            "title_similarity": "0.26135898",
            "sentiment_compound": 0.4199
        },
        {
            "id": "hy9uovc",
            "score": 11,
            "text": "Inaction is enablement.",
            "title_similarity": "0.34773225",
            "sentiment_compound": -0.25
        },
        {
            "id": "hy9usnb",
            "score": 1,
            "text": "What about RIPPLE",
            "title_similarity": "0.21690068",
            "sentiment_compound": 0.0
        },
        {
            "id": "hy9ut7d",
            "score": 1,
            "text": "Do it. Enough of Russian bullshit",
            "title_similarity": "0.69054043",
            "sentiment_compound": -0.5859
        },
        {
            "id": "hy9ut9a",
            "score": 1,
            "text": "I thought it meant SWIFT like the trucking company lol",
            "title_similarity": "0.40491557",
            "sentiment_compound": 0.7804
        },
        {
            "id": "hy9uu22",
            "score": 1,
            "text": "Get him the fuck out bro",
            "title_similarity": "0.46518555",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hy9uvs2",
            "score": 1,
            "text": "I love that Russia is being fucked so hard right now,\n\nI hate that it only comes after they attack our ally and did not come after they attacked US elections.",
            "title_similarity": "0.60710573",
            "sentiment_compound": -0.8972
        },
        {
            "id": "hy9uw0o",
            "score": 1,
            "text": "Good! Fuck ruSSia!",
            "title_similarity": "0.60997874",
            "sentiment_compound": -0.2924
        },
        {
            "id": "hy9uw82",
            "score": 4,
            "text": "Russia out here making me agree with Boris Johnson.",
            "title_similarity": "0.67338514",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hy9uwmj",
            "score": 1,
            "text": "Id say we should erase Russia from the face of the Earth, but fortunately their country and people are much better than their leader. Sad times we are livingnin.",
            "title_similarity": "0.6162882",
            "sentiment_compound": -0.0772
        },
        {
            "id": "hy9uxw8",
            "score": 1,
            "text": "that's really what he did NOT say just 30min ago in the House of Commons. I am still watching it. In fact, judging by his reaction (he even made a pause), it felt more like he resisted. He said 'nothing is off the table\" which is a nope in political speak. I could have misread, of course.",
            "title_similarity": "0.4838196",
            "sentiment_compound": 0.1761
        },
        {
            "id": "hy9uz5z",
            "score": 3,
            "text": "The screws must be tightened and cutting off Putin's money is something that has to be done and done now.   His actions can not go unpunished, Russia has to be hit and hit hard on all fronts.",
            "title_similarity": "0.64963925",
            "sentiment_compound": -0.4404
        },
        {
            "id": "hy9uzxx",
            "score": 2,
            "text": "Even a fucking idiot squirrel finds a nut once in a while.",
            "title_similarity": "0.26493105",
            "sentiment_compound": -0.5563
        },
        {
            "id": "hy9v136",
            "score": 2,
            "text": " Russia - the global pariah - should be globally isolated.",
            "title_similarity": "0.79237306",
            "sentiment_compound": -0.3182
        },
        {
            "id": "hy9v56i",
            "score": 1,
            "text": "https://www.reuters.com/business/finance/eu-unlikely-cut-russia-off-swift-now-sources-say-2022-02-24/\n\n\nNaturally, our profiteers are only interested in how much profit they’re losing, not the actual important thing.",
            "title_similarity": "0.5795126",
            "sentiment_compound": 0.4419
        },
        {
            "id": "hy9v58p",
            "score": 2,
            "text": "Ejecting Russia from SWIFT is critical to stopping the violence and bloodshed in Ukraine. It should be done immediately. The time for “wait and see” has passed.",
            "title_similarity": "0.69039613",
            "sentiment_compound": -0.667
        },
        {
            "id": "hy9v7wk",
            "score": 1,
            "text": "Hit russia in every single way we can without putting boots on the ground. Cripple their stupid asses, maybe when theyre hungry enough theyll burn the kremlin to the ground.",
            "title_similarity": "0.6730467",
            "sentiment_compound": -0.5267
        },
        {
            "id": "hy9vce7",
            "score": 1,
            "text": "Won’t happen Italy and Germany are highly against it. Corrupt idiots as long as they can sell stuff they don’t care about human life’s.",
            "title_similarity": "0.48979384",
            "sentiment_compound": 0.4939
        },
        {
            "id": "hy9vdov",
            "score": 1,
            "text": "Well gee I bet Putin never would have considered such harsh punishment! I’m sure he’ll stop this shit immediately now, and post an apology video on YouTube.",
            "title_similarity": "0.61382496",
            "sentiment_compound": -0.8497
        },
        {
            "id": "hy9veot",
            "score": 1,
            "text": "What is the swift payment system?",
            "title_similarity": "0.3339018",
            "sentiment_compound": 0.2023
        },
        {
            "id": "hy9vi47",
            "score": 1,
            "text": "Do it!",
            "title_similarity": "0.1614254",
            "sentiment_compound": 0.0
        },
        {
            "id": "hy9vli9",
            "score": 2,
            "text": "That's great, but have we thought about a targeted drone strike on Putin's yacht?",
            "title_similarity": "0.54450476",
            "sentiment_compound": 0.2023
        },
        {
            "id": "hy9vp7o",
            "score": 1,
            "text": "Olaf is a cunt! I said it.",
            "title_similarity": "0.40699252",
            "sentiment_compound": -0.5411
        },
        {
            "id": "hy9vpcf",
            "score": 4,
            "text": "US military should actively foment insurrection in Russia, do the exact thing they did to us. Russians already hate their government far more than the hillbillies who attacked our capital.",
            "title_similarity": "0.6850475",
            "sentiment_compound": -0.6597
        },
        {
            "id": "hy9vsqs",
            "score": 6,
            "text": "FUCK YOU PUTIN! FUCK OFF AND FUCKING DIE!",
            "title_similarity": "0.6002488",
            "sentiment_compound": -0.9149
        },
        {
            "id": "hy9vuma",
            "score": 2,
            "text": "Shut down the Dardanelles.",
            "title_similarity": "0.600363",
            "sentiment_compound": 0.0
        },
        {
            "id": "hy9vv4z",
            "score": 4,
            "text": "Enough talking, time for action. EU is probably regretting their Russian dependency but if they don’t take action it will illustrate to Putin that their are no consequences to his actions.",
            "title_similarity": "0.58143973",
            "sentiment_compound": -0.5647
        },
        {
            "id": "hy9w04d",
            "score": 1,
            "text": "I can’t fucking believe I’m saying it. But the cunt has good idea.",
            "title_similarity": "0.19488011",
            "sentiment_compound": -0.1154
        },
        {
            "id": "hy9w11s",
            "score": 2,
            "text": "You know what’s worse than losing some $ bc trade is cutoff w/ a nation? Losing lots of $ bc of regional instability & war",
            "title_similarity": "0.55827254",
            "sentiment_compound": -0.9042
        },
        {
            "id": "hy9w255",
            "score": 1,
            "text": "If they do this then theyr gonna escalate this into ww3",
            "title_similarity": "0.3342278",
            "sentiment_compound": 0.0
        },
        {
            "id": "hy9w5gx",
            "score": 1,
            "text": "True if big",
            "title_similarity": "0.033215858",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hy9w9t8",
            "score": 1,
            "text": "Not caring until it actually takes effect, and it won't, because everything is about money",
            "title_similarity": "0.3206575",
            "sentiment_compound": -0.3875
        },
        {
            "id": "hy9way9",
            "score": 15,
            "text": "NATO , the EIU and their allies should cut off every single connection they have except a diplomat. No internet, no border crossings. Seize the foreign money and possessions of Putin and those around him.\n\nThen sell the property and take all of the money combined and place it in account that  can be claimed by which ever government removes Putin from power.",
            "title_similarity": "0.73093724",
            "sentiment_compound": -0.3425
        },
        {
            "id": "hy9wbli",
            "score": 2,
            "text": "Didn't russia say this was a declaration of war?",
            "title_similarity": "0.70487475",
            "sentiment_compound": -0.5994
        },
        {
            "id": "hy9whx6",
            "score": 2,
            "text": "And good thing covid is over and gone and we can forget all about those parties while we are at it. Thanks Putin.",
            "title_similarity": "0.61748314",
            "sentiment_compound": 0.765
        },
        {
            "id": "hy9wi7x",
            "score": 29,
            "text": "Any hesistation about doing this went out the window the moment Vlad abandoned any pretence of a \"terrorist\" or \"ukraininan\" attack and just flat out invaded with the intent of conquest. \n\nBlackball the fucker and freeze everything owned by Russian Oligarchs.",
            "title_similarity": "0.69336784",
            "sentiment_compound": -0.9423
        },
        {
            "id": "hy9wiu0",
            "score": 5,
            "text": "Russia deserves to be sanctioned to the point of revolution for this act of needless war. Fuck war. Fuck Putin.",
            "title_similarity": "0.7010915",
            "sentiment_compound": -0.9413
        },
        {
            "id": "hy9wjse",
            "score": 1,
            "text": "Does this hurt Putin or the Russian people more?",
            "title_similarity": "0.6477616",
            "sentiment_compound": -0.5267
        },
        {
            "id": "hy9wkco",
            "score": 1,
            "text": "Yes.",
            "title_similarity": "0.043224566",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hy9wq0a",
            "score": 3,
            "text": "Isolate them until all they have left is China",
            "title_similarity": "0.4806889",
            "sentiment_compound": -0.2023
        },
        {
            "id": "hy9wu3t",
            "score": 2,
            "text": "Do it.",
            "title_similarity": "0.12568578",
            "sentiment_compound": 0.0
        },
        {
            "id": "hy9wvow",
            "score": 1,
            "text": "Like he cares ..",
            "title_similarity": "0.026440844",
            "sentiment_compound": 0.6705
        },
        {
            "id": "hy9wwlv",
            "score": 4,
            "text": "Germany collaborating again with russians? That’s something new",
            "title_similarity": "0.5689719",
            "sentiment_compound": 0.0
        },
        {
            "id": "hy9wwmk",
            "score": 1,
            "text": "Yes, please!",
            "title_similarity": "0.09838554",
            "sentiment_compound": 0.6476
        },
        {
            "id": "hy9wwzo",
            "score": 5,
            "text": "We should also be pushing for ejecting Belarus tbh. They're in this as well, as long as they stand with Russia.\n\nI feel like if Belarus won't be ejected, Russians will find a way to still use swift and other mechanisms through Belarus despite any sanctions.",
            "title_similarity": "0.6829523",
            "sentiment_compound": 0.6597
        },
        {
            "id": "hy9wy24",
            "score": 3,
            "text": "Interesting article on the BBC about how Russia has been preparing for these sanctions:\n\n[https://www.bbc.co.uk/news/business-60480904](https://www.bbc.co.uk/news/business-60480904)\n\nIn particular:\n\n\"The government in Moscow has also taken initial steps to create its own   \nsystem of international payments, in case it gets cut off from Swift - a  \n global financial messaging service which is overseen by the major   \nWestern central bank\n\nI am sure it will have some impact still but I found it an interesting read anyway. Goes to show they've been thinking about the repurcusions for some time.",
            "title_similarity": "0.6491121",
            "sentiment_compound": 0.7543
        },
        {
            "id": "hy9wydl",
            "score": 1,
            "text": "Pleaseeee kick them out",
            "title_similarity": "0.499173",
            "sentiment_compound": 0.0
        },
        {
            "id": "hy9wziv",
            "score": 1,
            "text": "What is the swift payment system",
            "title_similarity": "0.3007095",
            "sentiment_compound": 0.2023
        },
        {
            "id": "hy9x1t5",
            "score": 1,
            "text": "https://www.change.org/p/united-nations-lets-have-vladimir-putin-have-a-mma-fight-with-volodymyr-zelenskyy-to-squash-the-beef?utm\\_content=cl\\_sharecopy\\_32471827\\_es-419%3A4&recruiter=1254734216&utm\\_source=share\\_petition&utm\\_medium=copylink&utm\\_campaign=share\\_petition",
            "title_similarity": "0.61727405",
            "sentiment_compound": 0.0
        },
        {
            "id": "hy9x40b",
            "score": 1,
            "text": "For once I agree with Boris.",
            "title_similarity": "0.23620668",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hy9x59c",
            "score": 2,
            "text": "Can someone with more knowledge about world finance please explain why Germany, the US, and the EU, are currently against cutting Russia out of Swift? How would it negatively effect the west?",
            "title_similarity": "0.6070043",
            "sentiment_compound": 0.4515
        },
        {
            "id": "hy9x9my",
            "score": 2,
            "text": "Who decides whether Russia is cut from SWIFT? Does it require all countries be on board or is this the decision of one individual?",
            "title_similarity": "0.72451043",
            "sentiment_compound": 0.2006
        },
        {
            "id": "hy9xgtu",
            "score": 3,
            "text": "Shit, seems like Johnson finally made one decision that actually makes sense!",
            "title_similarity": "0.13575676",
            "sentiment_compound": -0.3382
        },
        {
            "id": "hy9xhk9",
            "score": 1,
            "text": "If you can’t cut the head off the snake then at least start with the tail.",
            "title_similarity": "0.3974948",
            "sentiment_compound": -0.2732
        },
        {
            "id": "hy9xhu8",
            "score": 1,
            "text": "Do it.",
            "title_similarity": "0.12568578",
            "sentiment_compound": 0.0
        },
        {
            "id": "hy9xlfo",
            "score": 1,
            "text": "Too late",
            "title_similarity": "0.25108618",
            "sentiment_compound": 0.0
        },
        {
            "id": "hy9xmqp",
            "score": 7,
            "text": "Sanction these fuckers\n\nFreeze their accounts\n\nTake the oligarchs property now",
            "title_similarity": "0.66325414",
            "sentiment_compound": -0.5719
        },
        {
            "id": "hy9xn17",
            "score": 1,
            "text": "Stop talking about it and DO IT!! Let's make the Russian population know how bad they fucked up. \\[[This can be you again Russia \\[NSFW\\]](https://www.dailymail.co.uk/news/article-4076244/Distressing-photos-1920s-Russian-famine-turned-hopeless-peasants-cannibals-five-million-people-starved-death.html)\\]",
            "title_similarity": "0.7228647",
            "sentiment_compound": -0.893
        },
        {
            "id": "hy9xoht",
            "score": 2,
            "text": "Do it please",
            "title_similarity": "0.124696344",
            "sentiment_compound": 0.3182
        },
        {
            "id": "hy9xq4i",
            "score": 4,
            "text": "Why is this even a debate?  Should be happening immediately.",
            "title_similarity": "0.3618207",
            "sentiment_compound": 0.0
        },
        {
            "id": "hy9xthc",
            "score": 2,
            "text": "Any chance we could implement more measures that specifically punish Putin instead of the Russian people?  He’s the one committing the atrocities, and the last to actually feel any economic impact of his own behavior.",
            "title_similarity": "0.6603033",
            "sentiment_compound": -0.2732
        },
        {
            "id": "hy9xu5y",
            "score": 1,
            "text": "TAKE THE 5 PERMANENT MEMBERS OF THE UN SECURITY COUNCIL OFF",
            "title_similarity": "0.5370341",
            "sentiment_compound": 0.4824
        },
        {
            "id": "hy9xudw",
            "score": 1,
            "text": "Well that was SWIFT",
            "title_similarity": "0.092688054",
            "sentiment_compound": 0.5622
        },
        {
            "id": "hy9xvjo",
            "score": 2,
            "text": "Hesitating just gives them more time to move their money.",
            "title_similarity": "0.30522883",
            "sentiment_compound": -0.34
        },
        {
            "id": "hy9xzfu",
            "score": 1,
            "text": "Finally something good coming from Johnson",
            "title_similarity": "0.007781807",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hy9y4bh",
            "score": 2,
            "text": "This is the right thing to do. If you can't play well with others, you will have to leave the playground.",
            "title_similarity": "0.43854135",
            "sentiment_compound": -0.4678
        },
        {
            "id": "hy9y8qd",
            "score": 1,
            "text": "Good. Finally a good idea from Borris.",
            "title_similarity": "0.08200834",
            "sentiment_compound": 0.7003
        },
        {
            "id": "hy9ycg3",
            "score": 1,
            "text": "Narrator: Russia maintained access to swift.",
            "title_similarity": "0.54297876",
            "sentiment_compound": 0.2023
        },
        {
            "id": "hy9ygii",
            "score": 2,
            "text": "The only fucking intelligent thing I have heard Boris said",
            "title_similarity": "0.22623497",
            "sentiment_compound": 0.5095
        },
        {
            "id": "hy9yidh",
            "score": 1,
            "text": "Looks like chaos is here",
            "title_similarity": "0.37740803",
            "sentiment_compound": -0.296
        },
        {
            "id": "hy9yjvh",
            "score": 2,
            "text": "How do you buy Russian oil if they’re off swift?",
            "title_similarity": "0.7004001",
            "sentiment_compound": 0.2023
        },
        {
            "id": "hy9yklu",
            "score": 1,
            "text": "EU really showing their hand.",
            "title_similarity": "0.20084985",
            "sentiment_compound": 0.5367
        },
        {
            "id": "hy9ynk6",
            "score": 1,
            "text": "Russia should be out of swift until there is regime change.",
            "title_similarity": "0.78939486",
            "sentiment_compound": 0.2023
        },
        {
            "id": "hy9yoyc",
            "score": 1,
            "text": "Not often I agree with Johnson. But on this rare occasion I am pained to say that I do",
            "title_similarity": "0.115652815",
            "sentiment_compound": -0.6434
        },
        {
            "id": "hy9ysnf",
            "score": 1,
            "text": "Boris can be commended for his compassion, integrity, and righteousness--as incongruous as those attributes are with my perceptions of him--by endorsing these retributive financial sanctions but I do also empathise with Germany's circumspection. \n\nI can pontificate about politics and financial repercussions but I can only produce speculations with no corroboration; pragmatically speaking, Germany's own interests will always take precedence as will Britain's and should anything be detrimental to Britain then Boris would recant his denunciation. \n\nBelgium, for all its moral posturing, wants exemptions for diamonds for God's sake. \n\nThe altruism we are anticipating will never be extended to Ukraine unless NATO is violated. Sanctimony and appeasement will flow as our leaders equivocate about Putin's subjugation of a democratic country.",
            "title_similarity": "0.47735772",
            "sentiment_compound": -0.4854
        },
        {
            "id": "hy9ysvk",
            "score": 1,
            "text": "Great move",
            "title_similarity": "0.051504128",
            "sentiment_compound": 0.6249
        },
        {
            "id": "hy9yuz6",
            "score": 1,
            "text": "Didn’t Putin yearn for the old Soviet days? This will give him a taste of what he so desires.",
            "title_similarity": "0.5461067",
            "sentiment_compound": 0.0
        },
        {
            "id": "hy9z0gj",
            "score": 1,
            "text": "Why is Germany warning against it. How much has the chancellor been paid....",
            "title_similarity": "0.57895076",
            "sentiment_compound": -0.34
        },
        {
            "id": "hy9z0lz",
            "score": 1,
            "text": "One problem that I could see from this is instilling into the Russian public that the west is out to get them, personally. This could shift public opinion to a very anti-west/nato stance and further embolden Russia to pursue more nefarious goals. \n\nAs it stands now, it seems the Russian public are split fifty/fifty on the war. The west needs as many of those supporter as possible to create domestic pushback against the Russian machine.\n\nIf we were to begin acosting the Russian public (indirectly) through cutting Russia out of SWIFT, those supporters could swap sides and the west would lose the Russian social war. \n\nLet things play out for now, monitor, and assess weaknesses and opportunities. Identify stronger, more targeted sanctions. Enhance Ukraine's defense. But it would be unwise to attack the Russian public at this early stage.",
            "title_similarity": "0.70285195",
            "sentiment_compound": -0.6579
        },
        {
            "id": "hy9z1c0",
            "score": 2,
            "text": "You know the end is near when you find yourself agreeing with Bojo",
            "title_similarity": "0.23895608",
            "sentiment_compound": 0.34
        },
        {
            "id": "hy9z3g2",
            "score": 2,
            "text": "This should be done TODAY!  Time for all the Russian people to feel the pain from the pathetic decisions their dumbass leader, Putin, made for them.\n\nThey need to yank Putin out of this palace and put him on trial for war crimes!",
            "title_similarity": "0.6780493",
            "sentiment_compound": -0.944
        },
        {
            "id": "hy9z3gm",
            "score": 1,
            "text": "ARE YOU KIDDING ME?! Do it already!",
            "title_similarity": "0.31351167",
            "sentiment_compound": 0.4053
        },
        {
            "id": "hy9z46d",
            "score": 1,
            "text": "Do everything we can to achieve peace, fuck invaders",
            "title_similarity": "0.33595687",
            "sentiment_compound": 0.0
        },
        {
            "id": "hy9z5ev",
            "score": 1,
            "text": "Yes fuck Russia",
            "title_similarity": "0.6719138",
            "sentiment_compound": -0.2023
        },
        {
            "id": "hy9z6r7",
            "score": 1,
            "text": "The EU once again proving itself to be a complete waste of time when it comes to anything even remotely important.",
            "title_similarity": "0.40846068",
            "sentiment_compound": -0.25
        },
        {
            "id": "hy9zf4m",
            "score": 2,
            "text": "Can't we just cut off their Internet? 😉",
            "title_similarity": "0.59405863",
            "sentiment_compound": 0.2057
        },
        {
            "id": "hy9zfed",
            "score": 2,
            "text": "Make russia economy fail !!!",
            "title_similarity": "0.7589438",
            "sentiment_compound": -0.6571
        },
        {
            "id": "hy9zg3b",
            "score": 1,
            "text": "Joe just said they are not planning to remove Russia from the Swift payment system.",
            "title_similarity": "0.59614146",
            "sentiment_compound": 0.2023
        },
        {
            "id": "hy9zh8s",
            "score": 2,
            "text": "Biden literally just said Europe doesn't want to do it",
            "title_similarity": "0.5357188",
            "sentiment_compound": -0.0572
        },
        {
            "id": "hy9zhnd",
            "score": 2,
            "text": "Cynical side of me thinks Johnson would just push something like this knowing full well that it wouldn't be agreed on, just to seem the good guy since he has been a walking joke since before he came to power.",
            "title_similarity": "0.3822014",
            "sentiment_compound": 0.647
        },
        {
            "id": "hy9zm43",
            "score": 1,
            "text": "I'm curious as to what exactly people think this will accomplish?",
            "title_similarity": "0.19208592",
            "sentiment_compound": 0.6249
        },
        {
            "id": "hy9zmne",
            "score": 3,
            "text": "And here Germany protects Russia because ENERGY.",
            "title_similarity": "0.48771617",
            "sentiment_compound": 0.6289
        },
        {
            "id": "hy9zqpm",
            "score": 3,
            "text": "All surrounding countries should kill their internet connections into Russia.",
            "title_similarity": "0.75593793",
            "sentiment_compound": -0.6908
        },
        {
            "id": "hy9zsie",
            "score": 7,
            "text": "Kick Belarus out too!",
            "title_similarity": "0.6160623",
            "sentiment_compound": 0.0
        },
        {
            "id": "hy9ztgi",
            "score": 2,
            "text": "Hope it happens. I feel like the US would not do this though.",
            "title_similarity": "0.28525186",
            "sentiment_compound": 0.6597
        },
        {
            "id": "hy9zvk7",
            "score": 1,
            "text": "The main reason why the EU hasn't pressed for this would be the reliance for Russian natural gas.  If ability to send money into Russia is impacted then Russia may turn off the pipeline to Germany which is close to 50% of German energy dependency.  This act would hurt Germany and other countries dependent on Russian gas than it would hurt Putin, as he can still sell to China.",
            "title_similarity": "0.55867887",
            "sentiment_compound": -0.2263
        },
        {
            "id": "hy9zwhl",
            "score": 1,
            "text": "I feel like this has the opportunity for the world to realize how fragile all of our economic connections really are and it will encourage further fragmentation. If every country is at strategic risk then all of them should be worried and potentially looking to invest in other, more secure or reliable ways of securing their economies from enemies. \n\nI also feel this way about the US dollar as the primary world currency. You can only push economic sanctions so far before a country voluntarily withdraws, perhaps to the harm of its citizens but if China were to do it then we'd be screwed.",
            "title_similarity": "0.5194705",
            "sentiment_compound": -0.5429
        },
        {
            "id": "hy9zwjm",
            "score": 3,
            "text": "It’s so pathetic that everyone isn’t on board. What a joke.",
            "title_similarity": "0.3046766",
            "sentiment_compound": -0.4201
        },
        {
            "id": "hy9zxlu",
            "score": 1,
            "text": "About bloody time! Germans need to nut up!",
            "title_similarity": "0.4983932",
            "sentiment_compound": -0.5399
        },
        {
            "id": "hy9zzah",
            "score": 1,
            "text": "Just wanted to say, thanks, for linking the story to an automated paywall blocker link.  Cheers.",
            "title_similarity": "0.23427258",
            "sentiment_compound": 0.7184
        },
        {
            "id": "hya00dm",
            "score": 1,
            "text": "How about ejected from the UN, along with China if they fuck with Taiwan?",
            "title_similarity": "0.64048815",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hya016q",
            "score": 4,
            "text": "Russia should be ejected from everything isolated left to rot ordinary citizens allowed across the border thats it. freeze them out",
            "title_similarity": "0.7774233",
            "sentiment_compound": -0.2732
        },
        {
            "id": "hya03rp",
            "score": 1,
            "text": "Wild times",
            "title_similarity": "0.24024388",
            "sentiment_compound": 0.0
        },
        {
            "id": "hya051x",
            "score": 2,
            "text": "YESSS 🇺🇦 🇺🇦 🇺🇦",
            "title_similarity": "0.11937437",
            "sentiment_compound": 0.0
        },
        {
            "id": "hya09rw",
            "score": 1,
            "text": "Bravo to Boris",
            "title_similarity": "0.31284094",
            "sentiment_compound": 0.0
        },
        {
            "id": "hya0a2b",
            "score": 1,
            "text": "DO IT . JPG",
            "title_similarity": "0.21689054",
            "sentiment_compound": 0.0
        },
        {
            "id": "hya0b0d",
            "score": 2,
            "text": "Looks like that's not happening...",
            "title_similarity": "0.24413797",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hya0bs9",
            "score": 1,
            "text": "Let’s do it",
            "title_similarity": "0.19217627",
            "sentiment_compound": 0.0
        },
        {
            "id": "hya0fxe",
            "score": 2,
            "text": "Angela Markell used to have Putin on check the second she left Putin became very aggressive towards the EU",
            "title_similarity": "0.63463855",
            "sentiment_compound": -0.2247
        },
        {
            "id": "hya0hdo",
            "score": 1,
            "text": "I find myself agreeing with Boris for the first time.",
            "title_similarity": "0.14744768",
            "sentiment_compound": 0.34
        },
        {
            "id": "hya0nau",
            "score": 3,
            "text": " Never thought I'd support anything to come out of Boris Johnson's facehole but here we are.\n\n Completely agree, get Russia out of Swift.",
            "title_similarity": "0.75300175",
            "sentiment_compound": 0.644
        },
        {
            "id": "hya0pnm",
            "score": 1,
            "text": "And what about all the dirty russian money already in london?",
            "title_similarity": "0.6623952",
            "sentiment_compound": -0.4404
        },
        {
            "id": "hya0ubw",
            "score": 1,
            "text": "Bozo the clown is right for once.",
            "title_similarity": "0.077941164",
            "sentiment_compound": 0.0
        },
        {
            "id": "hya12g9",
            "score": 1,
            "text": "Don’t know if it’s just only them but with Biden’s speech it seems like US and UK want this. It’s clear some allies don’t.",
            "title_similarity": "0.3947277",
            "sentiment_compound": 0.7964
        },
        {
            "id": "hya12th",
            "score": 1,
            "text": "I wish Biden would",
            "title_similarity": "0.2845735",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hya136e",
            "score": 1,
            "text": "Does anybody have a list of which countries are onboard with this sanction and which are against it it’s don’t have a position?",
            "title_similarity": "0.42718944",
            "sentiment_compound": 0.0
        },
        {
            "id": "hya14tr",
            "score": 1,
            "text": "U.S just days SWIFT is currently not on the table for this round of sanctions and that newly announced sanctions are as damaging if not more.",
            "title_similarity": "0.499395",
            "sentiment_compound": -0.1943
        },
        {
            "id": "hya166b",
            "score": 1,
            "text": "Nope....chicken's.  Bidens just done the same...",
            "title_similarity": "0.23273015",
            "sentiment_compound": 0.0
        },
        {
            "id": "hya16y3",
            "score": 5,
            "text": "Biden asserted that certain European member states did not get on board for the SWIFT changes.\n\nMy guesses are Italy and Germany.",
            "title_similarity": "0.507722",
            "sentiment_compound": 0.5622
        },
        {
            "id": "hya1739",
            "score": 1,
            "text": "The United States hasn’t ..",
            "title_similarity": "0.272443",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hya1bao",
            "score": 1,
            "text": "IT MUST HAPPEN BEFORE IT IS TOO LATE!!!!!!  \n\n&#x200B;\n\nAlso, China is in bed with Putin, https://www.yahoo.com/news/chinese-news-outlet-accidentally-leaked-211350671.html",
            "title_similarity": "0.5790697",
            "sentiment_compound": 0.0
        },
        {
            "id": "hya1hw7",
            "score": 2,
            "text": "If that happens it is going to hurt Russia a lot..",
            "title_similarity": "0.6119982",
            "sentiment_compound": -0.5267
        },
        {
            "id": "hya1iki",
            "score": 7,
            "text": "Boris Johnson knows precisely which properties in London are owned by Russian oligarchs loyal to the Putin regime. These properties should be confiscated right now, plain and simple.",
            "title_similarity": "0.7818444",
            "sentiment_compound": 0.4767
        },
        {
            "id": "hya1ku7",
            "score": 1,
            "text": "ELI5 pls (finance bros and sisses):\n\nWhy is SWIFT such a nuclear option compared to all the other heavy sanctions?  Why is Biden not going that far yet?",
            "title_similarity": "0.4608383",
            "sentiment_compound": 0.4927
        },
        {
            "id": "hya21a5",
            "score": 1,
            "text": "See there  are real Bond:  James Bond, villains",
            "title_similarity": "0.43538487",
            "sentiment_compound": -0.6597
        },
        {
            "id": "hya22dj",
            "score": 1,
            "text": "Good. The US should not be advocating everything, Europe sounds be taking the lead in larger sanctions",
            "title_similarity": "0.5210716",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hya2320",
            "score": 1,
            "text": "Do it....\nhttps://c.tenor.com/YmYYTz-cW7sAAAAC/memes-just-do-it.gif",
            "title_similarity": "0.33003232",
            "sentiment_compound": 0.0
        },
        {
            "id": "hya28is",
            "score": 1,
            "text": "Germany refused, disgusting...",
            "title_similarity": "0.434246",
            "sentiment_compound": -0.6808
        },
        {
            "id": "hya2w0f",
            "score": 1,
            "text": "Maybe countries want to delay this because their own rich people need to take their money out Russia until they lock them inside.",
            "title_similarity": "0.6833904",
            "sentiment_compound": 0.3818
        },
        {
            "id": "hya34a0",
            "score": 1,
            "text": "Come on Mexico!, now it’s the time to shine and push the Russians out of the SWIFT system!.",
            "title_similarity": "0.73824555",
            "sentiment_compound": 0.4796
        },
        {
            "id": "hya3aey",
            "score": 1,
            "text": "That’s a man baby!",
            "title_similarity": "0.14224014",
            "sentiment_compound": 0.0
        },
        {
            "id": "hya3ar8",
            "score": 1,
            "text": "Why is the link being filtered?",
            "title_similarity": "0.26280344",
            "sentiment_compound": 0.0
        },
        {
            "id": "hya3jcz",
            "score": 1,
            "text": "The amount of people lacking brains in these comments just shows how smart americans overall are lmao",
            "title_similarity": "0.15894231",
            "sentiment_compound": 0.765
        },
        {
            "id": "hya3mbm",
            "score": 2,
            "text": "Needs to happen but the rest of Europe doesn’t want to hurt their own economies",
            "title_similarity": "0.34505332",
            "sentiment_compound": -0.631
        },
        {
            "id": "hya3pxy",
            "score": 1,
            "text": "Will a talented cartoon artist please draw Boris Johnson swatting Putin on the nose with a rolled up hundred dollar bill?",
            "title_similarity": "0.44707888",
            "sentiment_compound": 0.6808
        },
        {
            "id": "hya3rvl",
            "score": 5,
            "text": "This is a repose by Darabuu Redditor  user. I copied it Because of the gravity of the current situation it’s imperative Ukrainians read this;\n\nDarabuu Dear Ukrainians!\n\nI heard on social media that there is fake news being spread (most likely by Russia backed trolls) that polish border is closed.\n\nIt's a lie.\n\nIf you seek asylum - go towards polish border. We are ready for your arrival. We have reception points ready at the border where you can find shelter, food, medical and legal aid.\n\nPolish government launched a dedicated site to help you: ua.gov.pl\n\nPlease share this information if you know anyone seeking help right now.\n\nYOU DON'T NEED VISA TO PASS THROUGH POLISH BORDER. ALL YOU NEED IS PASSPORT. VISAS ARE SUSPENDED! YOU DON'T NEED THEM FOR TIME BEING!!!!!!\n\nEDIT2: as a proof that you no longer need visa:\n\n• ⁠in Ukrainian https://www.gov.pl/web/udsc/ukraina---ua • ⁠in English https://www.gov.pl/web/udsc/ukraina-en",
            "title_similarity": "0.6148164",
            "sentiment_compound": 0.9124
        },
        {
            "id": "hya3t6b",
            "score": 1,
            "text": "No no, it's all good. We're enacting the most sanctiony sanctions that ever sanctioned someone.",
            "title_similarity": "0.42587805",
            "sentiment_compound": 0.1779
        },
        {
            "id": "hya3xk3",
            "score": 1,
            "text": "The US is saying no. Hopefully we get outvoted.",
            "title_similarity": "0.49867028",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hya3z81",
            "score": 1,
            "text": "Can someone explain to me what the Swift payment system is? I’ve seen multiple posts about it being extremely important but none explaining what it is",
            "title_similarity": "0.36791867",
            "sentiment_compound": 0.2374
        },
        {
            "id": "hya4cla",
            "score": 1,
            "text": "Cannot happen swift enough.",
            "title_similarity": "0.27121753",
            "sentiment_compound": -0.1511
        },
        {
            "id": "hya4f9m",
            "score": 1,
            "text": "why isnt every ally pushing for this?",
            "title_similarity": "0.344813",
            "sentiment_compound": 0.0
        },
        {
            "id": "hya4fxu",
            "score": 1,
            "text": "Johnson is right. Boot them out.  It's would send a unified message to Russia, and really hurt them economically.",
            "title_similarity": "0.74850595",
            "sentiment_compound": -0.2716
        },
        {
            "id": "hya4q2r",
            "score": 1,
            "text": "I have a feeling some of these international sanctions rather than do any good in the long run, will end up hurting ordinary people in Russia the most. It's not like Putin's gonna back down anytime soon.",
            "title_similarity": "0.5342579",
            "sentiment_compound": -0.1714
        },
        {
            "id": "hya4sk2",
            "score": 2,
            "text": "Shocking this hasn't happened",
            "title_similarity": "0.105887815",
            "sentiment_compound": -0.4019
        },
        {
            "id": "hya4vps",
            "score": 8,
            "text": "It doesn’t really matter how anyone feels about Boris Johnson. He has got this one right. Sanctions need to be crippling Russia and that also means the West needs to be able to take some pain to make them work.",
            "title_similarity": "0.6234504",
            "sentiment_compound": -0.4417
        },
        {
            "id": "hya51q3",
            "score": 4,
            "text": "Just stop all export to Russia. Literally send them back to the stone age.",
            "title_similarity": "0.8122612",
            "sentiment_compound": -0.296
        },
        {
            "id": "hya542y",
            "score": 1,
            "text": "Who gets to decide this? US just said \"no\".",
            "title_similarity": "0.43976521",
            "sentiment_compound": 0.0
        },
        {
            "id": "hya5m18",
            "score": 2,
            "text": "[deleted]",
            "title_similarity": "0.39116004"
        },
        {
            "id": "hya5qqz",
            "score": 4,
            "text": "I thought this was a forgone conclusion if Russia actually invaded Ukraine… and yet here we are seeing politicians demanding it after the invasion is well underway.",
            "title_similarity": "0.7618343",
            "sentiment_compound": 0.0516
        },
        {
            "id": "hya5yw0",
            "score": 9,
            "text": "Stop being pussies germans",
            "title_similarity": "0.48067534",
            "sentiment_compound": -0.296
        },
        {
            "id": "hya6612",
            "score": 4,
            "text": "Turning against Russia is now the easiest way to earn popularity. Even Boris freaking Johnson is being applauded right nwo for doing this\n\nEvery politicians of the world should see this and follow that example. Good actions made for selfish reasons are still good actions, corner Putin !",
            "title_similarity": "0.4351701",
            "sentiment_compound": 0.8221
        },
        {
            "id": "hya6h7z",
            "score": 1,
            "text": "Biden just said in his speech that cutting off access to SWIFT is \"not an option\" right now. Anyone know why? 😟",
            "title_similarity": "0.60350525",
            "sentiment_compound": -0.0431
        },
        {
            "id": "hya6mmu",
            "score": 2,
            "text": "I think Biden is holding SWIFT as a trump card (no pun intended). Squeeze them then squeeze them harder if needed because SWIFT does affect the US. It also buys him time to hammer Germany and Italy into submission.",
            "title_similarity": "0.4726758",
            "sentiment_compound": 0.6207
        },
        {
            "id": "hya6nz6",
            "score": 1,
            "text": "Why Russia hates NATO explained - https://youtu.be/2umsr04CFTo",
            "title_similarity": "0.7855906",
            "sentiment_compound": -0.4404
        },
        {
            "id": "hya6tnj",
            "score": 1,
            "text": "They must do this, the heat on Putin must be set to the max. Being soft could explode in the West's face. The Russian people also aren't likely to accept things suddenly turning sour, instead of being allowed to \"acclimatize\" to it through Russian propaganda. If turns turn sour quickly, they'll mainly blame Putin rather than the West.",
            "title_similarity": "0.5950953",
            "sentiment_compound": -0.6792
        },
        {
            "id": "hya7f0x",
            "score": 3,
            "text": "Rare Boris Johnson W",
            "title_similarity": "0.3267883",
            "sentiment_compound": 0.0
        },
        {
            "id": "hya7vbp",
            "score": 1,
            "text": "Please please please please. Boris for once in your life do something useful and meaningful.",
            "title_similarity": "0.21680865",
            "sentiment_compound": 0.9081
        },
        {
            "id": "hya8960",
            "score": 2,
            "text": "If you support cutting Russia out of SWIFT, sign a petition, and help your voice be heard!\n\nTowards the EU:\n\nhttps://www.change.org/p/swift-cut-russia-off-from-swift\n\nTowards Joe Biden:\n\nhttps://www.change.org/p/disconnect-russia-from-swift-system-due-to-the-invasion-of-ukraine",
            "title_similarity": "0.82697654",
            "sentiment_compound": 0.7734
        },
        {
            "id": "hya8e32",
            "score": 1,
            "text": "Israel support Ukraine even though Russia threat our borders from Syria",
            "title_similarity": "0.59312814",
            "sentiment_compound": -0.1779
        },
        {
            "id": "hya8y6j",
            "score": 1,
            "text": "On Biden's press conference that just ended a little while ago, a reporter tried to corner him on cutting off access to Swift.  He would only say the sanctions go well beyond Swift.\n\nPutin is a smart dude so you know he's anticipated all the sanctions and probably spent years preparing.",
            "title_similarity": "0.5558644",
            "sentiment_compound": 0.7096
        },
        {
            "id": "hya92nk",
            "score": 2,
            "text": "How does Europe plan to overcome the energy leverage that Russia has over them? \n\nEspecially when Russia could shift that energy to other allies whereas Europe does not seem to have an energy alternative?\n\nhttps://www.reuters.com/world/europe/how-much-does-germany-need-russian-gas-2022-01-20/\n\n> \"Russia in its (gas supplier) role cannot be replaced during the next few years,\" Maubach said.",
            "title_similarity": "0.6040768",
            "sentiment_compound": 0.6868
        },
        {
            "id": "hya9zfq",
            "score": 1,
            "text": "Putin needs another kind of \"swift payment.\"",
            "title_similarity": "0.60675013",
            "sentiment_compound": 0.1298
        },
        {
            "id": "hyaa4jj",
            "score": 2,
            "text": "Do it now!",
            "title_similarity": "0.27768248",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyaa8fq",
            "score": 2,
            "text": "Eject them from reality.",
            "title_similarity": "0.49038553",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyaag9g",
            "score": 3,
            "text": "Boris has been great, other countries are pussies.",
            "title_similarity": "0.23183471",
            "sentiment_compound": 0.6249
        },
        {
            "id": "hyaak76",
            "score": 1,
            "text": "Germany, Italy, Ciprus and Hungary refused this swift retaliation … So much solidarity …\nNATO countries , I bet that when it will be needed they will react in the same way , forgetting about partnerships and 5 th amendment .",
            "title_similarity": "0.5459456",
            "sentiment_compound": 0.3134
        },
        {
            "id": "hyab5ke",
            "score": 1,
            "text": "First good thing he's done",
            "title_similarity": "0.069715634",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hyabb4x",
            "score": 1,
            "text": "AH YEA! That shit should have happened the second russian forces started advancing!  \nAs well as a complete BOYCOTT of anything and everything Russian and Belarusian. Seize all financial assets around the world as well IN EVERY COUNTRY! NOW!",
            "title_similarity": "0.6958138",
            "sentiment_compound": -0.5995
        },
        {
            "id": "hyabeqa",
            "score": 1,
            "text": "Wish you were in EU so you could actually vote on this",
            "title_similarity": "0.42130083",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hyabmqz",
            "score": 1,
            "text": "Come on Boris, pls do one right thing",
            "title_similarity": "0.31342316",
            "sentiment_compound": 0.0772
        },
        {
            "id": "hyabrzx",
            "score": 1,
            "text": "Why wouldn't we do this?",
            "title_similarity": "0.3663631",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyac1k7",
            "score": 2,
            "text": "If these spineless fucks don’t stand up to tyranny and make this happen, then all the innocent blood that is shed will also be on their own hands. Cowards better do something drastic, and quick. In case anyone is still confused, Putin is hell bent on his delusional vision of grandeur of the old Soviet Union, and now he’s disregarding human life for the sake of his fragile ego. Kick Russia off the swift system. Act boldly now, or it’s not going to have any impact on the final outcome.",
            "title_similarity": "0.64311063",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hyac9vf",
            "score": 1,
            "text": "All good, except Switzerland are being cunts and not freezing Russia",
            "title_similarity": "0.4540757",
            "sentiment_compound": -0.1788
        },
        {
            "id": "hyacdsa",
            "score": 1,
            "text": "They should be isolated from everything.  No trade with them, not allowed to enter anyone's airspace, totally cordoned off from the rest of the world.",
            "title_similarity": "0.49178463",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hyackvg",
            "score": 1,
            "text": "Didn't expect to agree with Boris Johnson.",
            "title_similarity": "0.45370305",
            "sentiment_compound": -0.2755
        },
        {
            "id": "hyacml6",
            "score": 1,
            "text": "How about we ban Russian SWIFT payments on large amounts. That will surely affect the big fishes while leaving the citizens some space to work with. \n\nSurely a more targeted approach on SWIFT payments can be taken?",
            "title_similarity": "0.7025147",
            "sentiment_compound": 0.7404
        },
        {
            "id": "hyacrxe",
            "score": 2,
            "text": "Hopefully this happened.... swiftly.",
            "title_similarity": "0.15054362",
            "sentiment_compound": 0.5994
        },
        {
            "id": "hyacuni",
            "score": 1,
            "text": "Also Boris: \"The conservative party is now accepting donations via Bitcoin\".",
            "title_similarity": "0.53741795",
            "sentiment_compound": 0.6486
        },
        {
            "id": "hyad7yh",
            "score": 6,
            "text": "Way to go Germany! You chose gas over Ukraine lives.",
            "title_similarity": "0.5544909",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyadc4c",
            "score": 5,
            "text": "This honestly redeems any bad thing boris has ever done. This would be so huge if it happens.",
            "title_similarity": "0.3778513",
            "sentiment_compound": 0.3593
        },
        {
            "id": "hyaeumc",
            "score": 2,
            "text": "I am ashamed Scholz doesn't push for this",
            "title_similarity": "0.3525493",
            "sentiment_compound": -0.4767
        },
        {
            "id": "hyaexyg",
            "score": 2,
            "text": "Very good. Hope Biden agrees",
            "title_similarity": "-0.0084675625",
            "sentiment_compound": 0.8004
        },
        {
            "id": "hyaf1dr",
            "score": 1,
            "text": "dear god we can only hope.  this is a kill shot to the russian economy.",
            "title_similarity": "0.6748001",
            "sentiment_compound": 0.2263
        },
        {
            "id": "hyaf1dx",
            "score": 1,
            "text": "The solution is accept Ukraine in NATO and Allies defend them! Next in line is that Belarus’ Putin”s\n big puppet. Russian troops are already in . Chess game?",
            "title_similarity": "0.6556813",
            "sentiment_compound": 0.636
        },
        {
            "id": "hyaf1ny",
            "score": 2,
            "text": "Just cut them off! They’re GDP is that off an island, let’s make a true island! Full Import/Export embargo of all resources.",
            "title_similarity": "0.6297284",
            "sentiment_compound": 0.3147
        },
        {
            "id": "hyaf1qn",
            "score": 4,
            "text": "They 100% should be. I dont see how you can question it.",
            "title_similarity": "0.13580978",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyaf27o",
            "score": 1,
            "text": "Can someone explain why this is a big deal?",
            "title_similarity": "0.23708674",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyafacy",
            "score": 4,
            "text": "Do it. End this bastard",
            "title_similarity": "0.496207",
            "sentiment_compound": -0.628
        },
        {
            "id": "hyafeld",
            "score": 3,
            "text": "Go after Putin’s money!",
            "title_similarity": "0.67980283",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyafm6b",
            "score": 5,
            "text": "Why the fuck HAVEN’T they been? Biden got asked about this and totally dodged the question. It was really shitty. I’m a liberal, but I think Biden’s address was WEAK.",
            "title_similarity": "0.4552043",
            "sentiment_compound": -0.864
        },
        {
            "id": "hyafqg2",
            "score": 3,
            "text": "\"The US has suggested it was too early to consider the move, while saying that no option was off the table.\"  \n\n\nWhat else are you waiting for ? They have already invaded and killed Ukrainians.",
            "title_similarity": "0.6377153",
            "sentiment_compound": -0.7717
        },
        {
            "id": "hyafsst",
            "score": 3,
            "text": "Dear Ukrainians!\n\nI heard on social media that there is fake news being spread (most likely by Russia backed trolls) that polish border is closed.\n\nIt's a lie.\n\nIf you seek asylum - go towards polish border. We are ready for your arrival. We have reception points ready at the border where you can find shelter, food, medical and legal aid.\n\nPolish government launched a dedicated site to help you: ua.gov.pl\n\nPlease share this information if you know anyone seeking help right now.\n\nEDIT: YOU DON'T NEED VISA TO PASS THROUGH POLISH BORDER. ALL YOU NEED IS PASSPORT. VISAS ARE SUSPENDED! YOU DON'T NEED THEM FOR TIME BEING!!!!!!\n\nEDIT2: as a proof that you no longer need visa:\n\n•\t⁠in Ukrainian https://www.gov.pl/web/udsc/ukraina---ua •\t⁠in English https://www.gov.pl/web/udsc/ukraina-en\n\nYes, this is a repost, I'm not the author, I'm trying to get this info to as many people I can",
            "title_similarity": "0.6461592",
            "sentiment_compound": 0.9364
        },
        {
            "id": "hyag3jx",
            "score": 2,
            "text": "Hate to say I could agree with anything Boris would say.... but I do  ....",
            "title_similarity": "0.46145958",
            "sentiment_compound": -0.1531
        },
        {
            "id": "hyag64m",
            "score": 1,
            "text": "🙏",
            "title_similarity": "0.12310185",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyagfp1",
            "score": 4,
            "text": "Do it. Definitely not too harsh. Unwarranted attack, initiating war and killing innocents.",
            "title_similarity": "0.3727609",
            "sentiment_compound": -0.7347
        },
        {
            "id": "hyags4y",
            "score": 4,
            "text": "I was told this would be equal to declaration of world war III but in my opinion it would be a declaration of a world war against russia.\n\n&#x200B;\n\nWe must be mindful that whatever response we dole out to Russia is a message to every other @$$hole out there who wants to get frosty (china).\n\nSo IMO it is in our interest to drop the righteous fucking hammer down as hard as possible even if it hurts us a little in the short term.",
            "title_similarity": "0.7095976",
            "sentiment_compound": -0.9042
        },
        {
            "id": "hyagxmd",
            "score": 1,
            "text": "Here here",
            "title_similarity": "0.070186354",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyagyc3",
            "score": 3,
            "text": "Sanction Russia into dust.",
            "title_similarity": "0.68641156",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyagyy1",
            "score": 1,
            "text": "Upvote for using 12ft.io. Thanks!",
            "title_similarity": "0.12690172",
            "sentiment_compound": 0.4926
        },
        {
            "id": "hyah8vd",
            "score": 2,
            "text": "Dear Ukrainians!\n\nI heard on social media that there is fake news being spread (most likely by Russia backed trolls) that polish border is closed.\n\nIt's a lie.\n\nIf you seek asylum - go towards polish border. We are ready for your arrival. We have reception points ready at the border where you can find shelter, food, medical and legal aid.\n\nPolish government launched a dedicated site to help you: ua.gov.pl\n\nPlease share this information if you know anyone seeking help right now.\n\nEDIT: YOU DON'T NEED VISA TO PASS THROUGH POLISH BORDER. ALL YOU NEED IS PASSPORT. VISAS ARE SUSPENDED! YOU DON'T NEED THEM FOR TIME BEING!!!!!!\n\nEDIT2: as a proof that you no longer need visa:\n\n• ⁠in Ukrainian https://www.gov.pl/web/udsc/ukraina---ua • ⁠in English https://www.gov.pl/web/udsc/ukraina-en",
            "title_similarity": "0.6461592",
            "sentiment_compound": 0.9124
        },
        {
            "id": "hyahczr",
            "score": 1,
            "text": "“Imagine” John Lennon",
            "title_similarity": "0.23121813",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyahspr",
            "score": 2,
            "text": "DO IT",
            "title_similarity": "0.1295401",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyahuqt",
            "score": 1,
            "text": "That's crazy. I always figured he was the mole.",
            "title_similarity": "0.28306875",
            "sentiment_compound": -0.34
        },
        {
            "id": "hyahz8w",
            "score": 1,
            "text": "PLEASE PLEASE EJECT THEM FROM  SWIFT PAYMENT....Oh wait, CHINA will pick them up...",
            "title_similarity": "0.6035339",
            "sentiment_compound": 0.8224
        },
        {
            "id": "hyaid54",
            "score": 1,
            "text": "This is a copy and paste and I encourage you all to do it too where appropriate!  \nШановні українці!\r  \n\r  \nУ соцмережах я чув, що поширюються фейкові новини (скоріше за все, підтримувані Росією тролі), що польський кордон закритий.\r  \n\r  \nЦе брехня.\r  \n\r  \nЯкщо ви шукаєте притулку – йдіть до польського кордону. Ми готові до вашого приїзду. На кордоні готові пункти прийому, де ви можете знайти притулок, їжу, медичну та правову допомогу.\r  \n\r  \nПольський уряд запустив спеціальний сайт, щоб допомогти вам: ua.gov.pl\r  \n\r  \nБудь ласка, поділіться цією інформацією, якщо ви знаєте когось, хто зараз шукає допомоги.\r  \n\r  \nРЕДАКТИРОВАТИ: ВАМ НЕ ПОТРІБНА ВІЗА ДЛЯ ПРОЙДЖЕННЯ ПОЛЬСЬКИМ КОРДОНОМ. ВСЕ, що ВАМ ПОТРІБНО, - це ПАСПОРТ. ВІЗИ ПРИСПИНЕНО! ВОНИ ВАМ НЕ ПОТРІБНИ НА ЧАС!!!!!!\r  \n\r  \nEDIT2: як доказ того, що вам більше не потрібна віза:\r  \n\r  \n• ⁠українською https://www.gov.pl/web/udsc/ukraina---ua • ⁠англійською https://www.gov.pl/web/udsc/ukraina-en\r  \n\r  \nВибачте, якщо це дурниця, я використовував Google Translate",
            "title_similarity": "0.39850238",
            "sentiment_compound": 0.6671
        },
        {
            "id": "hyaie9n",
            "score": 2,
            "text": "YES!!! Don’t make Obama’s mistake!!",
            "title_similarity": "0.2466938",
            "sentiment_compound": 0.4941
        },
        {
            "id": "hyailg7",
            "score": 6,
            "text": "Never ever I though I'd be aligning with Boris Johnson, but here we are. Full respect for him and all the others pushing this through!",
            "title_similarity": "0.35231793",
            "sentiment_compound": 0.6643
        },
        {
            "id": "hyaina5",
            "score": 2,
            "text": "Do it. This invasion needs to be made more painful for Russia than it is for Ukraine. Cut them off from everything. Don't take Russian imports, don't export to Russia. Sure it will hurt us some, but it's worth it.",
            "title_similarity": "0.69622904",
            "sentiment_compound": -0.2135
        },
        {
            "id": "hyainlx",
            "score": 1,
            "text": "I'm getting whiplash about reddits opinion on Germany. Maybe wait for official statements before calling Germany the fourth reich you crazies??",
            "title_similarity": "0.56716895",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyaity3",
            "score": 2,
            "text": "This is all very confusing. On another Reddit topic, it was explained the US would not eject Russia from Swift due to concerns from Europeans?  What nations are opposed to this?\n\nI’m all for cracking down on Russia as hard as possible and don’t understand the “slow drip” approach to rolling out sanctions. Every mile that Russian armies advance just gives them more negotiating power.",
            "title_similarity": "0.6713736",
            "sentiment_compound": -0.2853
        },
        {
            "id": "hyaiyxx",
            "score": 1,
            "text": "His government should also hand back all the Russian money used for his party.",
            "title_similarity": "0.6886552",
            "sentiment_compound": 0.7096
        },
        {
            "id": "hyaj9et",
            "score": 1,
            "text": "I say everyone in Nato should attack Russia. 200k troops and equipmwnt are at the border. Not nukes. Ground and air assault until you find Putin hiding in a hole.",
            "title_similarity": "0.72504365",
            "sentiment_compound": -0.8442
        },
        {
            "id": "hyajdfm",
            "score": 2,
            "text": "YES YES YES",
            "title_similarity": "0.05080074",
            "sentiment_compound": 0.7964
        },
        {
            "id": "hyajfel",
            "score": 2,
            "text": "“Cutting Russia off would be an act of war”\n\nHe says while *invading* another country.",
            "title_similarity": "0.75973916",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyakd1m",
            "score": 1,
            "text": "If this happens the ramifications will be devastating for Russia and its people. His people are going to hate him for this war. This is his demise. Nothing scary than an animal backed into a corner",
            "title_similarity": "0.62058604",
            "sentiment_compound": -0.8978
        },
        {
            "id": "hyakhun",
            "score": 1,
            "text": "Kill the ruble",
            "title_similarity": "0.58168054",
            "sentiment_compound": -0.6908
        },
        {
            "id": "hyakn6w",
            "score": 2,
            "text": "So Putin is begging us not to hurt him too much while he butchers Ukrainian civilians? It’s an act of war if we pull him from SWIFT? And his attack on Ukraine isn’t? He wants to have his cake and eat it too. He is a bully with nukes but his oligarchs and generals will assassinate him first before he fires one off. They want power and wealth, not Armageddon. No Ukraine is worth that. He is hot air. Call his bluff and eject then from SWIFT. He will file or be ended from inside. Mad man.",
            "title_similarity": "0.6025723",
            "sentiment_compound": 0.6295
        },
        {
            "id": "hyaktws",
            "score": 1,
            "text": "Kick them out!",
            "title_similarity": "0.48636043",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyakwwu",
            "score": 2,
            "text": "Germany and any other country being against this, need to take a long, hard look at themselves. Fucking useless wankers.",
            "title_similarity": "0.5022886",
            "sentiment_compound": -0.5413
        },
        {
            "id": "hyal1k5",
            "score": 1,
            "text": "That won’t matter unless your gonna put some sanctions on China! They already said they would help!",
            "title_similarity": "0.5141078",
            "sentiment_compound": 0.5242
        },
        {
            "id": "hyal3ih",
            "score": 2,
            "text": "Fuck Italy Germany and Cyprus",
            "title_similarity": "0.47761804",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hyalf84",
            "score": 1,
            "text": "Looks like President Biden believed that there wasn’t enough support for Russia to be ejected. I hope Boris got the ball rolling.",
            "title_similarity": "0.65875685",
            "sentiment_compound": 0.7964
        },
        {
            "id": "hyall3d",
            "score": 2,
            "text": "Bojo can shout about it as much as he wants but Germany have already said it’s a no go and that EU would follow. Shame as it might actually work.",
            "title_similarity": "0.56480944",
            "sentiment_compound": -0.7876
        },
        {
            "id": "hyalscw",
            "score": 2,
            "text": "Fuck Putin. He should be considered a war criminal.",
            "title_similarity": "0.64244556",
            "sentiment_compound": -0.8957
        },
        {
            "id": "hyam2gy",
            "score": 7,
            "text": "And against this are Germany, Hungary and Italy.\n\nReminds you anything?\nLooks like they still don’t have any sense of right side.",
            "title_similarity": "0.426255",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hyam4c9",
            "score": 1,
            "text": "#DO IT!!!!",
            "title_similarity": "0.18614599",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyam7gg",
            "score": 1,
            "text": "Germany and Italy are opposing it.",
            "title_similarity": "0.4822852",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyamqx2",
            "score": 1,
            "text": "Do it!!!!",
            "title_similarity": "0.17000079",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyamvyn",
            "score": 5,
            "text": "Anything less than cutting 100% of ties is indefensible for 1st world countries.",
            "title_similarity": "0.3392225",
            "sentiment_compound": -0.0571
        },
        {
            "id": "hyamy0y",
            "score": 2,
            "text": "The sooner the better.  Cut 'em off.",
            "title_similarity": "0.3728355",
            "sentiment_compound": 0.2023
        },
        {
            "id": "hyan0u3",
            "score": 2,
            "text": "Putin already talking about crypto! So for sure, he expected this to happen!",
            "title_similarity": "0.5530954",
            "sentiment_compound": 0.4875
        },
        {
            "id": "hyanbaq",
            "score": 3,
            "text": "God damnit - I don't want to like BoJo. But today I guess...",
            "title_similarity": "0.42335618",
            "sentiment_compound": -0.3217
        },
        {
            "id": "hyanswv",
            "score": 2,
            "text": "no brainer. cut off all access.",
            "title_similarity": "0.5019094",
            "sentiment_compound": -0.0992
        },
        {
            "id": "hyao7t7",
            "score": 2,
            "text": "Anyone else find it messed up that a payment system/corporation can have enough power that it can be used as a threat to another country?",
            "title_similarity": "0.40911376",
            "sentiment_compound": -0.7003
        },
        {
            "id": "hyaob0i",
            "score": 1,
            "text": "Who is currently pushing *back* against this?",
            "title_similarity": "0.36879396",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyaob3x",
            "score": 1,
            "text": "Since when does Boris have balls",
            "title_similarity": "0.33441895",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyaov7w",
            "score": 1,
            "text": "I think Winston would be proud of Johnson's decision",
            "title_similarity": "0.13429928",
            "sentiment_compound": 0.4767
        },
        {
            "id": "hyapcu1",
            "score": 4,
            "text": "Should have been done 2 weeks ago",
            "title_similarity": "0.28440404",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyaph0f",
            "score": 1,
            "text": "Go on Boris!",
            "title_similarity": "0.46030337",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyaphd1",
            "score": 1,
            "text": "And germany is against it. Even when they arent starting the world wars they are still being bad guys.",
            "title_similarity": "0.51882434",
            "sentiment_compound": -0.7964
        },
        {
            "id": "hyappq0",
            "score": 2,
            "text": "To all my German friends: fuck your shithole country. Take your pathetic government off the world stage and let real leadership make decisions. Acknowledge all the good Germans left your borders decades ago and stop hindering freedom due to your greed.",
            "title_similarity": "0.57890445",
            "sentiment_compound": -0.2263
        },
        {
            "id": "hyaq88c",
            "score": 2,
            "text": "Surprising no one, Germany feels it’s too radical of a move. After all, Russia hasn’t really invaded, they’ve just bombed Kyiv.\n\nI swear Germany won’t support shit until Vladimir Putin receives a medal from the Ukrainian government he installs for liberating Ukraine from the West",
            "title_similarity": "0.65215415",
            "sentiment_compound": 0.2263
        },
        {
            "id": "hyaqswe",
            "score": 1,
            "text": "Some Swedish bank dude said he doesn’t believe it’s going to happen",
            "title_similarity": "0.42289817",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyar78m",
            "score": 3,
            "text": "Possibly the best position Boris has ever had on anything. Make Russia bleed in every way possible",
            "title_similarity": "0.49794173",
            "sentiment_compound": 0.6369
        },
        {
            "id": "hyarbhm",
            "score": 1,
            "text": ">Swift has long been considered as an option within the EU’s sanctions package, but it was not seen as a likely part of any early round of measures, and was instead held in reserve for extra deterrence\n\n\nCivilians are being bombed what the fuck are they waiting for",
            "title_similarity": "0.48596603",
            "sentiment_compound": -0.6542
        },
        {
            "id": "hyarceg",
            "score": 2,
            "text": "Do it. Russia should be made a pariah to the rest of the world over this. Until such a time as we're satisfied that Putin and anyone that shares his ideology has been purged from the Russian Government.",
            "title_similarity": "0.8328033",
            "sentiment_compound": 0.6124
        },
        {
            "id": "hyarcgk",
            "score": 2,
            "text": "FUCK VLADIMIR PUTIN!",
            "title_similarity": "0.6501651",
            "sentiment_compound": -0.5848
        },
        {
            "id": "hyaredn",
            "score": 1,
            "text": "FFS do it already.",
            "title_similarity": "0.19659802",
            "sentiment_compound": -0.6739
        },
        {
            "id": "hyarpau",
            "score": 1,
            "text": "Germany and Italy against. What a bunch of corrupt cowards.",
            "title_similarity": "0.49774843",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyarqsm",
            "score": 2,
            "text": "I think European citizens have lost any right to ever criticize US foreign policy again considering that they aren't willing to even slightly inconvenience themselves to actually act out the values they claim to hold so dearly.  Putin isn't going off of the SWIFT system, that would cost Germany and Italy money.",
            "title_similarity": "0.51551366",
            "sentiment_compound": 0.4102
        },
        {
            "id": "hyas563",
            "score": 2,
            "text": "Please! It’s time to punish these autocrats.",
            "title_similarity": "0.5855081",
            "sentiment_compound": -0.3382
        },
        {
            "id": "hyasb4a",
            "score": 1,
            "text": "Kick. Him. The. Fuck. Out.\n\nI don't understand how the EU council is in any way hesitant about this. Take out the heaviest tool available short of war between Russia and NATO.",
            "title_similarity": "0.6518122",
            "sentiment_compound": -0.8555
        },
        {
            "id": "hyasbcd",
            "score": 3,
            "text": "Dear Ukrainians!\n\nI heard on social media that there is fake news being spread (most likely by Russia backed trolls) that polish border is closed.\n\nIt's a lie.\n\nIf you seek asylum - go towards polish border. We are ready for your arrival. We have reception points ready at the border where you can find shelter, food, medical and legal aid.\n\nPolish government launched a dedicated site to help you: ua.gov.pl\n\nPlease share this information if you know anyone seeking help right now.\n\nEDIT: YOU DON'T NEED VISA TO PASS THROUGH POLISH BORDER. ALL YOU NEED IS PASSPORT. VISAS ARE SUSPENDED! YOU DON'T NEED THEM FOR TIME BEING!!!!!!\n\nEDIT2: as a proof that you no longer need visa:\n\n•\t⁠in Ukrainian https://www.gov.pl/web/udsc/ukraina---ua •\t⁠in English https://www.gov.pl/web/udsc/ukraina-en\n\nCopy and paste anywhere you can! Spread the word!",
            "title_similarity": "0.6461592",
            "sentiment_compound": 0.9124
        },
        {
            "id": "hyascb9",
            "score": 1,
            "text": "that would involve Mr. Brexit Johnson to work with the EU for that to happen.",
            "title_similarity": "0.50173765",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyasn7m",
            "score": 3,
            "text": "Dear Ukrainians!\n\nI heard on social media that there is fake news being spread (most likely by Russia backed trolls) that polish border is closed.\n\nIt's a lie.\n\nIf you seek asylum - go towards polish border. We are ready for your arrival. We have reception points ready at the border where you can find shelter, food, medical and legal aid.\n\nPolish government launched a dedicated site to help you: ua.gov.pl\n\nPlease share this information if you know anyone seeking help right now.\n\nYOU DON'T NEED VISA TO PASS THROUGH POLISH BORDER. ALL YOU NEED IS PASSPORT. VISAS ARE SUSPENDED! YOU DON'T NEED THEM FOR TIME BEING!!!!!!\n\nproof that you no longer need visa:\n\n•\t⁠in Ukrainian https://www.gov.pl/web/udsc/ukraina---ua •\t⁠in English https://www.gov.pl/web/udsc/ukraina-en\n\ncopied from u/everysir to spread awareness! please spread on relevant threads to get the word out!!!",
            "title_similarity": "0.6463301",
            "sentiment_compound": 0.9317
        },
        {
            "id": "hyasrst",
            "score": 1,
            "text": "Can someone explain this to an American? Is this like Paypal or something?",
            "title_similarity": "0.35931432",
            "sentiment_compound": 0.4998
        },
        {
            "id": "hyat17x",
            "score": 8,
            "text": "I can't believe I'm on Boris's side with something. \n\nAnd the lack of action from the EU is making me kind of ok with the Brexit decision for the first time in my life. \n\nWhat a strange day this is for a left-wing Brit.",
            "title_similarity": "0.45879167",
            "sentiment_compound": -0.2944
        },
        {
            "id": "hyat1xx",
            "score": 1,
            "text": "That push would have had more weight if he didn't make the russian backed Brexit a thing.  \nNow his voice is a voice from outside the EU.   \nBut at least Putin cut out the nuclear arsenal of the EU, so thanks for that, Bojo.   \n(Frances nukes don't really count as their deterrent is only meant for an attack on France)",
            "title_similarity": "0.64186764",
            "sentiment_compound": -0.1626
        },
        {
            "id": "hyat789",
            "score": 5,
            "text": "Dear Ukrainians!\n\nI heard on social media that there is fake news being spread (most likely by Russia backed trolls) that polish border is closed.\n\nIt's a lie.\n\nIf you seek asylum - go towards polish border. We are ready for your arrival. We have reception points ready at the border where you can find shelter, food, medical and legal aid.\n\nPolish government launched a dedicated site to help you: https://ua.gov.pl\n\nPlease share this information if you know anyone seeking help right now.\n\nYOU DON'T NEED VISA TO PASS THROUGH POLISH BORDER. ALL YOU NEED IS PASSPORT. VISAS ARE SUSPENDED! YOU DON'T NEED THEM FOR TIME BEING!\n\n• ⁠in Ukrainian https://www.gov.pl/web/udsc/ukraina-ua\n\n• ⁠in English https://www.gov.pl/web/udsc/ukraina-en",
            "title_similarity": "0.60601133",
            "sentiment_compound": 0.9266
        },
        {
            "id": "hyatfkj",
            "score": 1,
            "text": "This is the time that every politician out there can wipe the slate clean, and look like a good guy. \n\nDon’t fuck this up you wankers.",
            "title_similarity": "0.39188758",
            "sentiment_compound": 0.5574
        },
        {
            "id": "hyatp4h",
            "score": 3,
            "text": "Yesss.  Grab him by the rubles.",
            "title_similarity": "0.44050157",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyatyyb",
            "score": 1,
            "text": "This will start WWIII....",
            "title_similarity": "0.330379",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyau7jf",
            "score": 2,
            "text": "Why this not yet happened?",
            "title_similarity": "0.20411296",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyau81y",
            "score": 2,
            "text": "China and Russia already have a contingency in place with that in mind. If anything, it'll destabilize the Western banking system which is what the elites probably want to cover up their crimes.",
            "title_similarity": "0.6568397",
            "sentiment_compound": 0.0772
        },
        {
            "id": "hyaubdv",
            "score": 1,
            "text": "He's already had plenty of Russian cash in party donations and dark money.",
            "title_similarity": "0.4647439",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hyaugx8",
            "score": 1,
            "text": "Шановні українці!\n\nУ соцмережах я чув, що поширюються фейкові новини (скоріше за все, підтримувані Росією тролі), що польський кордон закритий.\n\nЦе брехня.\n\nЯкщо ви шукаєте притулку – йдіть до польського кордону.  Ми готові до вашого приїзду.  На кордоні готові пункти прийому, де ви можете знайти притулок, їжу, медичну та правову допомогу.\n\nПольський уряд запустив спеціальний сайт, щоб допомогти вам: ua.gov.pl\n\nБудь ласка, поділіться цією інформацією, якщо ви знаєте когось, хто зараз шукає допомоги.\n\nРЕДАКТИРОВАТИ: ВАМ НЕ ПОТРІБНА ВІЗА ДЛЯ ПРОЙДЖЕННЯ ПОЛЬСЬКИМ КОРДОНОМ.  ВСЕ, що ВАМ ПОТРІБНО, - це ПАСПОРТ.  ВІЗИ ПРИСПИНЕНО!  ВОНИ ВАМ НЕ ПОТРІБНИ НА ЧАС!!!!!!\n\nEDIT2: як доказ того, що вам більше не потрібна віза:\n\n• ⁠українською https://www.gov.pl/web/udsc/ukraina---ua • ⁠англійською https://www.gov.pl/web/udsc/ukraina-en\n\nВибачте, якщо це дурниця, я використовував Google Translate",
            "title_similarity": "0.42710626",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyaupoh",
            "score": 1,
            "text": "Fucking do it.",
            "title_similarity": "0.18812571",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyaux9n",
            "score": 1,
            "text": "Am disappointed that this comes from Boris of all people. \n\nBecause this should have been a first step if the west is serious about sanctions.\n\nSadly, from reading the article it looks like it won't happen, as German (again ) and America are hesitant.",
            "title_similarity": "0.51006067",
            "sentiment_compound": -0.6908
        },
        {
            "id": "hyav43b",
            "score": 1,
            "text": "12ft.io ……okayyyyyyyyyyyy",
            "title_similarity": "0.15385464",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyav4au",
            "score": 1,
            "text": "Maybe the smartest thing BJ has done",
            "title_similarity": "0.05173335",
            "sentiment_compound": 0.6124
        },
        {
            "id": "hyav53r",
            "score": 1,
            "text": "Tldr please. I don’t know what this means.",
            "title_similarity": "0.30231255",
            "sentiment_compound": 0.3182
        },
        {
            "id": "hyav5uf",
            "score": 1,
            "text": "Get them out from everywhere.. Putin has just turned into Evil 👿",
            "title_similarity": "0.6882504",
            "sentiment_compound": -0.8271
        },
        {
            "id": "hyav626",
            "score": 1,
            "text": "What’s do russia gain here?",
            "title_similarity": "0.63387156",
            "sentiment_compound": 0.5267
        },
        {
            "id": "hyaw9dl",
            "score": 1,
            "text": "Question for the Brits, how do y’all feel about how Boris has conducted himself during this situation? As an American, for all the shite he got about being your Donald Trump, he’s decidedly in lockstep with everyone else, which I guess is a low bar to clear? Just curious",
            "title_similarity": "0.5422282",
            "sentiment_compound": 0.4871
        },
        {
            "id": "hyawbrp",
            "score": 1,
            "text": "Fuck Germany for saying no to this",
            "title_similarity": "0.5253788",
            "sentiment_compound": -0.6908
        },
        {
            "id": "hyawe5d",
            "score": 1,
            "text": "This absolutely needs to happen!",
            "title_similarity": "0.252327",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyawxya",
            "score": 1,
            "text": "Could we also shut down or block the RT propaganda service?",
            "title_similarity": "0.63464594",
            "sentiment_compound": -0.5994
        },
        {
            "id": "hyax1dd",
            "score": 1,
            "text": "Best thing he's done since getting in parliament!",
            "title_similarity": "0.18810001",
            "sentiment_compound": 0.6696
        },
        {
            "id": "hyax20h",
            "score": 1,
            "text": "Hearing Boris Johnson has gotten really tough with the Russians.\n\nApparently he now charges £50,000 for a game of tennis and you only get to play one set.\n\nThat will show 'em. Bastards!!",
            "title_similarity": "0.47299528",
            "sentiment_compound": -0.725
        },
        {
            "id": "hyax4ps",
            "score": 1,
            "text": "Dear Ukrainians!\n\nI heard on social media that there is fake news being spread (most likely by Russia backed trolls) that polish border is closed.\n\nIt's a lie.\n\nIf you seek asylum - go towards polish border. We are ready for your arrival. We have reception points ready at the border where you can find shelter, food, medical and legal aid.\n\nPolish government launched a dedicated site to help you: ua.gov.pl\n\nPlease share this information if you know anyone seeking help right now.\n\nEDIT: YOU DON'T NEED VISA TO PASS THROUGH POLISH BORDER. ALL YOU NEED IS PASSPORT. VISAS ARE SUSPENDED! YOU DON'T NEED THEM FOR TIME BEING!!!!!!\n\nEDIT2: as a proof that you no longer need visa:\n\n•\t⁠in Ukrainian https://www.gov.pl/web/udsc/ukraina---ua\n•\t⁠in English https://www.gov.pl/web/udsc/ukraina-en",
            "title_similarity": "0.6461592",
            "sentiment_compound": 0.9124
        },
        {
            "id": "hyax6c5",
            "score": 1,
            "text": "Cut them off from the civilised world, complete economic embargo",
            "title_similarity": "0.6641604",
            "sentiment_compound": -0.2732
        },
        {
            "id": "hyax6gd",
            "score": 1,
            "text": "Turn Russia into fucking North Korea who has to get aid from charities and only friend is crazy Xi from China.",
            "title_similarity": "0.61070794",
            "sentiment_compound": 0.6124
        },
        {
            "id": "hyaxygc",
            "score": 1,
            "text": "If no one understands this, Putin has said that hard sanctions like the swift, will result in him declaring war",
            "title_similarity": "0.65670735",
            "sentiment_compound": -0.4939
        },
        {
            "id": "hyay0xp",
            "score": 1,
            "text": "I had to look up what swift is. Here is the wiki https://en.m.wikipedia.org/wiki/SWIFT",
            "title_similarity": "0.3080595",
            "sentiment_compound": 0.2023
        },
        {
            "id": "hyaykhn",
            "score": 2,
            "text": "The EU banks are exposed to Russia. Kicking them out of SWIFT could trigger a banking crisis, which is why Germany, Italy, Hungary, Cyprus, and anyone who does not wish global economic meltdown is against it.\n\nIf you think inflation is bad now, just wait.",
            "title_similarity": "0.6984021",
            "sentiment_compound": -0.8236
        },
        {
            "id": "hyayu9x",
            "score": 1,
            "text": "This is essentially the economic nuclear option.  There really isn't much more one can do without a military response and all of you want the EU to blow their load right out of the gate. The Russian stock market just lost 40% of it's value and their currency took a big hit.  Let's continue diplomacy - we're not even 24 hours in.",
            "title_similarity": "0.49904323",
            "sentiment_compound": 0.1027
        },
        {
            "id": "hyaz4bz",
            "score": 2,
            "text": "Also shut down their ONLYFANS!",
            "title_similarity": "0.55256295",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyaznna",
            "score": 3,
            "text": "As a German, I'm so fucking disappointed in our government more than I already was. \n\nCowards! They're all cowards!",
            "title_similarity": "0.47243956",
            "sentiment_compound": -0.6434
        },
        {
            "id": "hyazvfo",
            "score": 1,
            "text": "While at it he could go through many pro-Brexiteers who got money from Russia.",
            "title_similarity": "0.6188022",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyb0dla",
            "score": 1,
            "text": "If you’re going to invade other countries…you cannot bank with the rest of us!",
            "title_similarity": "0.57023466",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyb0ujq",
            "score": 3,
            "text": "Germany is trying to block this\n\nGermany has chosen to be dependent of Russian gas, so they can freeze for all I care. \n\nKick Russia out of SWIFT NOW",
            "title_similarity": "0.75966465",
            "sentiment_compound": 0.5101
        },
        {
            "id": "hyb12vm",
            "score": 1,
            "text": "SWIFT hurts the Russian people as well as the government. And many Russian people are against what Putin is doing",
            "title_similarity": "0.6132481",
            "sentiment_compound": 0.1363
        },
        {
            "id": "hyb1g0j",
            "score": 1,
            "text": "Never really liked BoJo and have grown to actively dislike him, along with his cronies, over recent years - now I'm livid, cannot possibly despise him enough for pushing for this...it's a genius chess move, something which I am completely in support of and I couldn't possibly criticise him for it, what an asshole.",
            "title_similarity": "0.36154428",
            "sentiment_compound": 0.0185
        },
        {
            "id": "hyb1ilc",
            "score": 2,
            "text": "Nice to know that Boris is not Trump.",
            "title_similarity": "0.27801937",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hyb23kd",
            "score": 1,
            "text": "not just swift. Russia should get North Korea'd for this shit.",
            "title_similarity": "0.6476171",
            "sentiment_compound": -0.7043
        },
        {
            "id": "hyb2459",
            "score": 3,
            "text": "Russia and China already launched their own and Russia will trade using China as a proxy.",
            "title_similarity": "0.6171073",
            "sentiment_compound": 0.128
        },
        {
            "id": "hyb257p",
            "score": 2,
            "text": "[removed]",
            "title_similarity": "0.38150543"
        },
        {
            "id": "hyb2r49",
            "score": 2,
            "text": "Шановні українці!\n\nУ соцмережах я чув, що поширюються фейкові новини (скоріше за все, підтримувані Росією тролі), що польський кордон закритий.\n\nЦе брехня.\n\nЯкщо ви шукаєте притулку – йдіть до польського кордону.  Ми готові до вашого приїзду.  На кордоні готові пункти прийому, де ви можете знайти притулок, їжу, медичну та правову допомогу.\n\nПольський уряд запустив спеціальний сайт, щоб допомогти вам: ua.gov.pl\n\nБудь ласка, поділіться цією інформацією, якщо ви знаєте когось, хто зараз шукає допомоги.\n\nРЕДАКТИРОВАТИ: ВАМ НЕ ПОТРІБНА ВІЗА ДЛЯ ПРОЙДЖЕННЯ ПОЛЬСЬКИМ КОРДОНОМ.  ВСЕ, що ВАМ ПОТРІБНО, - це ПАСПОРТ.  ВІЗИ ПРИСПИНЕНО!  ВОНИ ВАМ НЕ ПОТРІБНИ НА ЧАС!!!!!!\n\nEDIT2: як доказ того, що вам більше не потрібна віза:\n\n• ⁠українською https://www.gov.pl/web/udsc/ukraina---ua • ⁠англійською https://www.gov.pl/web/udsc/ukraina-en\n\nВибачте, якщо це дурниця, я використовував Google Translate",
            "title_similarity": "0.42710626",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyb380e",
            "score": 1,
            "text": "So makes things worse, all this is going to do is push Russia and China together.   They already announced an alternative,  plus thanks to Obama Russia and China trade internationally in each other's currency instead of USD.   \n\nRussia has the west bent over cause nothing they can do will stop this power house, especially when China takes Taiwan, they said so at the Olympics.   Poison the world with a bio weapon and still get the Olympics, why should China or Russia care what the west does to them.  Not going to hurt them....  plus Russia owes several European counties billions, ha ha don't think they will be paying now...",
            "title_similarity": "0.60965633",
            "sentiment_compound": 0.3426
        },
        {
            "id": "hyb3ga6",
            "score": 2,
            "text": "EU has become very silent, where are there hard sanctions, germany and italy send putin millions each day for gas.. putin must be hurting /s.",
            "title_similarity": "0.49442333",
            "sentiment_compound": -0.4767
        },
        {
            "id": "hyb3qup",
            "score": 2,
            "text": "Some popular Russian products that you can boycott are:\n\n* [Yandex](https://en.wikipedia.org/wiki/Yandex)\n* [Lukoil](https://en.wikipedia.org/wiki/Lukoil)\n* [WinRAR](https://en.wikipedia.org/wiki/WinRAR)\n* [Kaspersky](https://en.wikipedia.org/wiki/Kaspersky_Lab)\n* [Lada](https://en.wikipedia.org/wiki/Lada)\n* Russian Standard Original Vodka\n* [Stolichnaya](https://en.wikipedia.org/wiki/Stolichnaya)\n* [Baltika](https://en.wikipedia.org/wiki/Baltika_Breweries)\n* [Gazprom](https://en.wikipedia.org/wiki/Gazprom)\n* [Kamaz](https://en.wikipedia.org/wiki/Kamaz)\n* [Masha and the Bear](https://en.wikipedia.org/wiki/Masha_and_the_Bear)\n* [Kalashnikov](https://en.wikipedia.org/wiki/Kalashnikov_rifle)\n* [Stolichnaya](https://en.wikipedia.org/wiki/Stolichnaya)\n* [Ural motorcycles](https://en.wikipedia.org/wiki/IMZ-Ural)\n* [VK](https://en.wikipedia.org/wiki/VK_(service\\))\n* [Abbyy](https://en.wikipedia.org/wiki/ABBYY_FineReader)",
            "title_similarity": "0.6526998",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hyb3uvx",
            "score": 2,
            "text": "just do it, fuck russian leadership, I will gladly suffer for them to suffer more",
            "title_similarity": "0.66788286",
            "sentiment_compound": -0.8442
        },
        {
            "id": "hyb46o0",
            "score": 1,
            "text": "At last!",
            "title_similarity": "0.19262856",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyb486d",
            "score": 2,
            "text": "Even if I can't stand Boris Johnson at all - he's doing damn good in this regard and I'm glad for it",
            "title_similarity": "0.15947185",
            "sentiment_compound": 0.4939
        },
        {
            "id": "hyb4gou",
            "score": 2,
            "text": "Holy shit dew it! It is time for your redemption arc Boris.",
            "title_similarity": "0.48676163",
            "sentiment_compound": -0.5983
        },
        {
            "id": "hyb53i9",
            "score": 1,
            "text": "If they actually do this what’s the likely hood of all our war? From my super brief read on the subject, this would financially cripple Russia long term, so would they give a shit at that point? If they don’t have money to wage war later would they just try to now, and would anyone back them?",
            "title_similarity": "0.6163132",
            "sentiment_compound": -0.8418
        },
        {
            "id": "hyb55wr",
            "score": 1,
            "text": "Should swift kick them",
            "title_similarity": "0.27365363",
            "sentiment_compound": 0.2023
        },
        {
            "id": "hyb5efn",
            "score": 1,
            "text": "Yes, swiftly….",
            "title_similarity": "0.21412623",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hyb5gm0",
            "score": 1,
            "text": "[deleted]",
            "title_similarity": "0.39116004"
        },
        {
            "id": "hyb5qvw",
            "score": 2,
            "text": "Do the right thing. Eject their ass. This will be a fatal blow to Russia.",
            "title_similarity": "0.7236924",
            "sentiment_compound": -0.7906
        },
        {
            "id": "hyb6j7j",
            "score": 1,
            "text": "While Turkey has harsh words for Russia, Russia has Turkey by the balls economically. When Turkey shot down a Russian jet and didn't apologize Russia sanctioned them. Turkey's economy suffered and Erdogan had to apologize and at the same time bought expensive s400 air defense systems which caused the U.S to cancel their F22 purchases. I don't know if Erdogan was backed into a corner or he just didn't like someone telling him what he can do.",
            "title_similarity": "0.6222258",
            "sentiment_compound": -0.8179
        },
        {
            "id": "hyb6y9c",
            "score": 2,
            "text": "I have to admit, that otherwise contemptible man is taking the lead on this. What do you say, Biden?",
            "title_similarity": "0.2730117",
            "sentiment_compound": -0.2023
        },
        {
            "id": "hyb741l",
            "score": 1,
            "text": "ELI5 what is SWIFT?",
            "title_similarity": "0.24136277",
            "sentiment_compound": 0.368
        },
        {
            "id": "hyb78t2",
            "score": 2,
            "text": "What is it with Germans and never being on the good guys side?",
            "title_similarity": "0.40146565",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hyb7g3y",
            "score": 1,
            "text": "Say what you want about Boris Johnson, but he has handled this whole situation very well so far",
            "title_similarity": "0.19572157",
            "sentiment_compound": 0.5006
        },
        {
            "id": "hyb7nee",
            "score": 2,
            "text": "More or less the only decent thing he's done for quite a while.",
            "title_similarity": "0.06775509",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyb7w5b",
            "score": 1,
            "text": "I'll not convinced this will do what we Want. Russia has been converting currency and building reserves for a while now. We pull this lever and we push them deeper in to the arms of China. Idk, maybe I'm wrong, but this is no silver bullet imo.",
            "title_similarity": "0.58324647",
            "sentiment_compound": -0.6735
        },
        {
            "id": "hyb7y7w",
            "score": 2,
            "text": "This is the first time I've seen his name and not just thought \"what a twat\"",
            "title_similarity": "0.15066616",
            "sentiment_compound": -0.6597
        },
        {
            "id": "hyb857v",
            "score": 2,
            "text": "Bravo, after 8 years of contemplating this, and ample time for Russia to prepare, you might actually do it, alas impact would be nowhere near what it might have been.",
            "title_similarity": "0.4699529",
            "sentiment_compound": -0.2732
        },
        {
            "id": "hyb8a35",
            "score": 2,
            "text": "SWIFT is the system used by banks for inter transactions. No SWIFT, no online transaction. Bank users will have to switch to cash.",
            "title_similarity": "0.48836082",
            "sentiment_compound": 0.2723
        },
        {
            "id": "hyb8kh1",
            "score": 2,
            "text": "Finally someone said it! Let’s kick em where it hurts.",
            "title_similarity": "0.44243586",
            "sentiment_compound": -0.5255
        },
        {
            "id": "hyb8vy7",
            "score": 2,
            "text": "Dear Ukrainians!\n\nI heard on social media that there is fake news being spread (most likely by Russia backed trolls) that polish border is closed.\n\nIt's a lie.\n\nIf you seek asylum - go towards polish border. We are ready for your arrival. We have reception points ready at the border where you can find shelter, food, medical and legal aid.\n\nPolish government launched a dedicated site to help you: ua.gov.pl\n\nPlease share this information if you know anyone seeking help right now.\n\nYOU DON'T NEED VISA TO PASS THROUGH POLISH BORDER. ALL YOU NEED IS PASSPORT. VISAS ARE SUSPENDED! YOU DON'T NEED THEM FOR TIME BEING!!!!!!\n\nproof that you no longer need visa:\n\n•\t⁠in Ukrainian https://www.gov.pl/web/udsc/ukraina---ua •\t⁠in English https://www.gov.pl/web/udsc/ukraina-en\n\ncopied from u/everysir to spread awareness! please spread on relevant threads to get the word out!!!",
            "title_similarity": "0.6463301",
            "sentiment_compound": 0.9317
        },
        {
            "id": "hyb901c",
            "score": 1,
            "text": "Cut off all the porn streaming sites too..",
            "title_similarity": "0.5910946",
            "sentiment_compound": -0.2732
        },
        {
            "id": "hyb91gx",
            "score": 2,
            "text": "I'm seriously worried about this, not just for the lives being lost, but because it seems like the major world leaders are just in a \"I don't give a shit anymore\"\n\nReally makes me wonder if they know something the general population does not.",
            "title_similarity": "0.446252",
            "sentiment_compound": 0.6742
        },
        {
            "id": "hyb95lv",
            "score": 2,
            "text": "I would push to cut off Russian telecommunications wherever possible.\n\nPutin prepared the ability to isolate their internet already anyways. I'm sure they have ways to get through anyways but worthwhile to strain their resources in every way possible.",
            "title_similarity": "0.74102974",
            "sentiment_compound": 0.5574
        },
        {
            "id": "hyb99rm",
            "score": 1,
            "text": "Eject Putin to Mars.",
            "title_similarity": "0.462445",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyb9iqf",
            "score": 3,
            "text": "Putin needs a  taste of his own Novichok poison",
            "title_similarity": "0.64121544",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hyba16f",
            "score": 1,
            "text": "How does this impact Russian civilians?",
            "title_similarity": "0.6413245",
            "sentiment_compound": 0.0
        },
        {
            "id": "hybaf8x",
            "score": 2,
            "text": "Dear Ukrainians!\n\nI heard on social media that there is fake news being spread (most likely by Russia backed trolls) that polish border is closed.\n\nIt's a lie.\n\nIf you seek asylum - go towards polish border. We are ready for your arrival. We have reception points ready at the border where you can find shelter, food, medical and legal aid.\n\nPolish government launched a dedicated site to help you: ua.gov.pl\n\nPlease share this information if you know anyone seeking help right now.\n\nEDIT: YOU DON'T NEED VISA TO PASS THROUGH POLISH BORDER. ALL YOU NEED IS PASSPORT. VISAS ARE SUSPENDED! YOU DON'T NEED THEM FOR TIME BEING!!!!!!\n\nEDIT2: as a proof that you no longer need visa:\n\n•\t⁠in Ukrainian https://www.gov.pl/web/udsc/ukraina---ua •\t⁠in English https://www.gov.pl/web/udsc/ukraina-en\n\nCopy and paste anywhere you can! Spread the word!\n\nШановні українці!\n\nУ соцмережах я чув, що поширюються фейкові новини (скоріше за все, підтримувані Росією тролі), що польський кордон закритий.\n\nЦе брехня.\n\nЯкщо ви шукаєте притулку – йдіть до польського кордону.  Ми готові до вашого приїзду.  На кордоні готові пункти прийому, де ви можете знайти притулок, їжу, медичну та правову допомогу.\n\nПольський уряд запустив спеціальний сайт, щоб допомогти вам: ua.gov.pl\n\nБудь ласка, поділіться цією інформацією, якщо ви знаєте когось, хто зараз шукає допомоги.\n\nРЕДАКТИРОВАТИ: ВАМ НЕ ПОТРІБНА ВІЗА ДЛЯ ПРОЙДЖЕННЯ ПОЛЬСЬКИМ КОРДОНОМ.  ВСЕ, що ВАМ ПОТРІБНО, - це ПАСПОРТ.  ВІЗИ ПРИСПИНЕНО!  ВОНИ ВАМ НЕ ПОТРІБНИ НА ЧАС!!!!!!\n\nEDIT2: як доказ того, що вам більше не потрібна віза:\n\n• ⁠українською https://www.gov.pl/web/udsc/ukraina---ua • ⁠англійською https://www.gov.pl/web/udsc/ukraina-en\n\nВибачте, якщо це дурниця, я використовував",
            "title_similarity": "0.6461592",
            "sentiment_compound": 0.9124
        },
        {
            "id": "hybahnd",
            "score": 5,
            "text": " Dear Ukrainians!\n\nI heard on social media that there is fake news being spread (most likely by Russia backed trolls) that polish border is closed.\n\nIt's a lie.\n\nIf you seek asylum - go towards polish border. We are ready for your arrival. We have reception points ready at the border where you can find shelter, food, medical and legal aid.\n\nPolish government launched a dedicated site to help you: ua.gov.pl\n\nPlease share this information if you know anyone seeking help right now.\n\nEDIT: YOU DON'T NEED VISA TO PASS THROUGH POLISH BORDER. ALL YOU NEED IS PASSPORT. VISAS ARE SUSPENDED! YOU DON'T NEED THEM FOR TIME BEING!!!!!!\n\nEDIT2: as a proof that you no longer need visa:\n\n•\t⁠in Ukrainian https://www.gov.pl/web/udsc/ukraina---ua •\t⁠in English https://www.gov.pl/web/udsc/ukraina-en\n\nCopy and paste anywhere you can! Spread the word!\n\nШановні українці!\n\nУ соцмережах я чув, що поширюються фейкові новини (скоріше за все, підтримувані Росією тролі), що польський кордон закритий.\n\nЦе брехня.\n\nЯкщо ви шукаєте притулку – йдіть до польського кордону. Ми готові до вашого приїзду. На кордоні готові пункти прийому, де ви можете знайти притулок, їжу, медичну та правову допомогу.\n\nПольський уряд запустив спеціальний сайт, щоб допомогти вам: ua.gov.pl\n\nБудь ласка, поділіться цією інформацією, якщо ви знаєте когось, хто зараз шукає допомоги.\n\nРЕДАКТИРОВАТИ: ВАМ НЕ ПОТРІБНА ВІЗА ДЛЯ ПРОЙДЖЕННЯ ПОЛЬСЬКИМ КОРДОНОМ. ВСЕ, що ВАМ ПОТРІБНО, - це ПАСПОРТ. ВІЗИ ПРИСПИНЕНО! ВОНИ ВАМ НЕ ПОТРІБНИ НА ЧАС!!!!!!\n\nEDIT2: як доказ того, що вам більше не потрібна віза:\n\n• ⁠українською https://www.gov.pl/web/udsc/ukraina---ua• ⁠англійською https://www.gov.pl/web/udsc/ukraina-en\n\nJust wanted to make this in Ukrainian to help / просто хотів зробити це українською, щоб допомогти\n\ncharities to help support",
            "title_similarity": "0.6461592",
            "sentiment_compound": 0.9717
        },
        {
            "id": "hybb40k",
            "score": 2,
            "text": "There is no try. There is only do. \n\nSo just fucking do it.",
            "title_similarity": "0.38876602",
            "sentiment_compound": -0.296
        },
        {
            "id": "hybbai8",
            "score": 1,
            "text": "Shut them all down.",
            "title_similarity": "0.45942384",
            "sentiment_compound": 0.0
        },
        {
            "id": "hybbyhz",
            "score": 1,
            "text": "This would be huge.  Do it and inflect as much pain on Putin as possible.",
            "title_similarity": "0.6045163",
            "sentiment_compound": -0.25
        },
        {
            "id": "hybbzvx",
            "score": 2,
            "text": "Russia has indicated in the past that such an ejection would be akin to a declaration of war. It will be really interesting to see if this is something the EU will actually go forward with, and if they do, what the Russian response will look like.",
            "title_similarity": "0.6633517",
            "sentiment_compound": 0.1513
        },
        {
            "id": "hybc74g",
            "score": 1,
            "text": "Everyone pushes but no one acts.",
            "title_similarity": "0.2419492",
            "sentiment_compound": -0.4215
        },
        {
            "id": "hybcaui",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.38150543"
        },
        {
            "id": "hybd026",
            "score": 1,
            "text": "Ejecting Russia from SWIFT would be catastrophic to the world's financial system. They would just team up with other bully nations to make their own, decreasing US Dollar's influence overtime. Even EU is trying to get away from SWIFT",
            "title_similarity": "0.705068",
            "sentiment_compound": -0.3257
        },
        {
            "id": "hybdbjd",
            "score": 1,
            "text": "EU is stalling at the moment. Germany the hold up here?",
            "title_similarity": "0.4629591",
            "sentiment_compound": -0.2023
        },
        {
            "id": "hybdi3r",
            "score": 1,
            "text": "What is Swift. I don't get it?",
            "title_similarity": "0.2987816",
            "sentiment_compound": 0.2023
        },
        {
            "id": "hybdozs",
            "score": 1,
            "text": "Just do it",
            "title_similarity": "0.17850395",
            "sentiment_compound": 0.0
        },
        {
            "id": "hybdrx6",
            "score": 1,
            "text": "Sanctions like never before seen. 3am comes quickly",
            "title_similarity": "0.24665906",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hybdsex",
            "score": 1,
            "text": "What the hell is a swift",
            "title_similarity": "0.28780788",
            "sentiment_compound": -0.5859
        },
        {
            "id": "hybeic7",
            "score": 1,
            "text": "Bojo is such a nob sometimes but God do I agree with him on this point.",
            "title_similarity": "0.19622764",
            "sentiment_compound": 0.7096
        },
        {
            "id": "hybevtj",
            "score": 1,
            "text": "Would Russia being ejected from SWIFT affect the whole Trump borrowing $$$ from Russia thing?",
            "title_similarity": "0.71468157",
            "sentiment_compound": 0.368
        },
        {
            "id": "hybf2q9",
            "score": 1,
            "text": " The west starved USSR to death.  Time to do the same to Putin.  SWIFT should be first to go.  No money in, no money out.",
            "title_similarity": "0.7477397",
            "sentiment_compound": -0.8544
        },
        {
            "id": "hybf969",
            "score": 1,
            "text": "Yes but how about refusing to buy Russian gas and oil? Let's get the Russian people to drag Putin out of the Kremlin!",
            "title_similarity": "0.85282385",
            "sentiment_compound": -0.6533
        },
        {
            "id": "hybfgq8",
            "score": 2,
            "text": "The real reasons they didnt yet kick out Russia from Swift are the following:\n\n1. If they do, there is practically zero ways to continue hurting Russia with further economic sanctions. Russia be like: well they cant do anthing else, lets continue to attack with more resolve. \n\n2. That actually hurts the global economy and not just Russia. And most countries dont want their economies to bleed more specially during the pandemic effects.",
            "title_similarity": "0.57114005",
            "sentiment_compound": -0.2715
        },
        {
            "id": "hybfsej",
            "score": 1,
            "text": "Could someone ELI5 how would a Swift ban hurt Putina and his enablers?\nWould it not hurt the general population more? Is not enough they are/have been exclusive under despots for all their existence?\nHow about a general ban on usage of any Russian owned properly outside Russia?",
            "title_similarity": "0.70491636",
            "sentiment_compound": -0.8168
        },
        {
            "id": "hybg2y9",
            "score": 1,
            "text": "Don’t just talk Boris, do it.",
            "title_similarity": "0.4529995",
            "sentiment_compound": 0.0
        },
        {
            "id": "hybgz2m",
            "score": 2,
            "text": "So one country attacks another one. USA and EU talk big talk of most severe sactions, but they don't cut them off SWIFT. \n\nPoor Ukraine, being used by both sides.",
            "title_similarity": "0.53917754",
            "sentiment_compound": -0.3935
        },
        {
            "id": "hybijna",
            "score": 1,
            "text": "Never thought I'd agree on anything with this incompetent numbnut",
            "title_similarity": "0.2891658",
            "sentiment_compound": -0.6942
        },
        {
            "id": "hybimyf",
            "score": 3,
            "text": "Dear Ukrainians!\n\nI heard on social media that there is fake news being spread (most likely by Russia backed trolls) that polish border is closed.\n\nIt's a lie.\n\nIf you seek asylum - go towards polish border. We are ready for your arrival. We have reception points ready at the border where you can find shelter, food, medical and legal aid.\n\nPolish government launched a dedicated site to help you: ua.gov.pl\n\nPlease share this information if you know anyone seeking help right now.\n\nEDIT: YOU DON'T NEED VISA TO PASS THROUGH POLISH BORDER. ALL YOU NEED IS PASSPORT. VISAS ARE SUSPENDED! YOU DON'T NEED THEM FOR TIME BEING!!!!!!\n\nEDIT2: as a proof that you no longer need visa:\n\n•\t⁠in Ukrainian https://www.gov.pl/web/udsc/ukraina---ua •\t⁠in English https://www.gov.pl/web/udsc/ukraina-en",
            "title_similarity": "0.6461592",
            "sentiment_compound": 0.9124
        },
        {
            "id": "hybk7sr",
            "score": 1,
            "text": "OMFG... just do it already!  Pukin-Putin needs the biggest kick up the backside he's ever had - It'd be nice to think the people of Russia would grow a set and revolt against thier govt. But ain't holdin me breath.",
            "title_similarity": "0.6510126",
            "sentiment_compound": 0.2942
        },
        {
            "id": "hybk8vk",
            "score": 1,
            "text": "Sure would be a good time to be a member of the EU to have some influence on such a decision…",
            "title_similarity": "0.2528367",
            "sentiment_compound": 0.6369
        },
        {
            "id": "hybkzmc",
            "score": 1,
            "text": "Lets make this happen!!! What do we have to do to apply pressure???",
            "title_similarity": "0.39432734",
            "sentiment_compound": -0.5597
        },
        {
            "id": "hybl5qo",
            "score": 1,
            "text": "What if they want out of the Swift to usher in legitimacy of crypto",
            "title_similarity": "0.4597819",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hybl7sb",
            "score": 2,
            "text": "Сейчас сумасшедшие времена, и если вы сейчас находитесь в России, то, скорее всего, испытываете сильные чувства по поводу сложившейся ситуации. Я от всего сердца сочувствую вам.\n\nУчитывая действия и заявления Путина, я с тяжелым сердцем говорю, что вам, возможно, следует быть очень осторожными. Если он решит пойти по пути полного фашистского диктатора, ваши сообщения в социальных сетях могут сделать вас уязвимыми для репрессий со стороны его правительства и его правоохранительных органов - или даже сограждан, купившихся на пропаганду.\n\nПожалуйста, подумайте о том, чтобы сделать следующее:\n\nОчистите свой аккаунт на Reddit от личной идентифицирующей информации. Это включает ваше имя, если в каком-либо сообщении отмечается или упоминается ваш день рождения, фотографии вас, вашей семьи или домашних животных, а также все остальное, что может быть отслежено до вас.\n\nВсегда подключайтесь к Reddit через VPN.\n\nРассмотрите возможность удаления критических сообщений из русскоязычных социальных сетей.\n\nЕсли вы получили образование на Западе, скорее всего, вас будут считать подозрительным... особенно если дела пойдут не так, как хочет Путин. Подумайте о том, чтобы уехать скорее раньше, чем позже. Возможно, вам стоит попросить убежища в одной из европейских стран.\n\nОставайтесь в безопасности. Вы все являетесь жертвами в той же степени, что и Украина. Не несите это бремя в одиночку, и если люди за пределами России могут как-то помочь вам, пожалуйста, оставьте здесь свой комментарий, чтобы мы могли вместе посмотреть, сможем ли мы предоставить вам голос или ресурсы, необходимые вам, чтобы иметь наилучшие шансы пережить эту бурю невредимыми.",
            "title_similarity": "0.44994092",
            "sentiment_compound": 0.0
        },
        {
            "id": "hybl8b0",
            "score": 1,
            "text": "bitcoin :)",
            "title_similarity": "0.29535514",
            "sentiment_compound": 0.4588
        },
        {
            "id": "hyblzxg",
            "score": 2,
            "text": "Why do you think russia is turning to crypto?  Looks like this move was predicted.  Something bigger is happening with this war. The real intention of this war are still unknown unfortunately.  Crazy times to be honest.",
            "title_similarity": "0.5864023",
            "sentiment_compound": -0.85
        },
        {
            "id": "hybom1v",
            "score": 1,
            "text": "Not a great idea for a number of reasons.\n\nChina has an alternative which would gain more traction if Russia began using it. China's alternative being used would weaken America's position as the global currency reserve.",
            "title_similarity": "0.55970114",
            "sentiment_compound": -0.3387
        },
        {
            "id": "hybosyn",
            "score": 1,
            "text": "Boris, finally doing something right.",
            "title_similarity": "0.21913537",
            "sentiment_compound": 0.0
        },
        {
            "id": "hybp973",
            "score": 2,
            "text": "In times of peace I hate the brits, in times of war I love them.\n\n\nTruly remarkable, united and fierce people.",
            "title_similarity": "0.29801163",
            "sentiment_compound": 0.8555
        },
        {
            "id": "hybpd7k",
            "score": 1,
            "text": "They will find middlemen to flow money through.\n\nBanks trade for all kinds of pariahs.\n\nJust because of this, it should not even be a question if Russia should be taken off SWIFT. It is a symbolic gesture at best, so why hesitate.",
            "title_similarity": "0.5909989",
            "sentiment_compound": 0.6547
        },
        {
            "id": "hybqx0r",
            "score": 1,
            "text": "Yesssss",
            "title_similarity": "0.07912481",
            "sentiment_compound": 0.0
        },
        {
            "id": "hybrmw8",
            "score": 2,
            "text": "But Boris is opposed to seizing Russian property in England",
            "title_similarity": "0.6932039",
            "sentiment_compound": 0.0
        },
        {
            "id": "hybs3aa",
            "score": 1,
            "text": "Swift < Ripple",
            "title_similarity": "0.22709739",
            "sentiment_compound": 0.2023
        },
        {
            "id": "hybtdsz",
            "score": 1,
            "text": "If this happens, monero (XMR) and Bitcoin (BTC) will go to the moon.",
            "title_similarity": "0.42749012",
            "sentiment_compound": 0.0
        },
        {
            "id": "hybtkoq",
            "score": 1,
            "text": "Cripple him. Fuck Putin.",
            "title_similarity": "0.67316985",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hybu10m",
            "score": 1,
            "text": "lol",
            "title_similarity": "0.10109444",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hybv10i",
            "score": 1,
            "text": "Russia would simply start mass adopting cryptocurrency and build its own SWIFT payment system. \n\nHedera hashgraph already have a PoC with Shinhan Bank and Standard bank.",
            "title_similarity": "0.617103",
            "sentiment_compound": 0.368
        },
        {
            "id": "hybvsv4",
            "score": 1,
            "text": "Also, we should get someone to slap Putin's wrist really hard.",
            "title_similarity": "0.5965582",
            "sentiment_compound": -0.024
        },
        {
            "id": "hybvsy6",
            "score": 1,
            "text": "☜🐨😾😾  ﾻ𝓾𝓒𝐤 ڶ𝐎ε ๒𝐈𝐝𝐞η  😂🍧💙",
            "title_similarity": "0.14303072",
            "sentiment_compound": 0.7964
        },
        {
            "id": "hybw3ky",
            "score": 2,
            "text": "Thought people should know this as well:  \nExcluding Russia from Swift would risk severe repercussions for banks that are owed money - either now or in the longer term.This is particularly true in Germany, which has deep financial ties with Russia and feels it has done its share of economic sacrifice by suspending certification of the Nord Stream 2 pipeline. Although being de-Swifted would be disruptive for Russia, there is an alternate system - called CFPS - that Russia set up after it annexed Crimea in 2014. Similarly, China has also set up a secondary system, CIPS.  \nExpelling Russia would probably only push it closer to China and play into the hands of the Xi administration, which is keen to \"de-dollarise\" the world's financial architecture. This would accelerate that trend and ambition.",
            "title_similarity": "0.6739489",
            "sentiment_compound": 0.5413
        },
        {
            "id": "hybw9qk",
            "score": 1,
            "text": "Recycle ♻️",
            "title_similarity": "0.2988937",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyby2kd",
            "score": 1,
            "text": "Taylor Swift??",
            "title_similarity": "0.30206865",
            "sentiment_compound": 0.2869
        },
        {
            "id": "hybydjt",
            "score": 1,
            "text": "For once, I agree with this jackass",
            "title_similarity": "0.14981869",
            "sentiment_compound": -0.0772
        },
        {
            "id": "hybz87w",
            "score": 2,
            "text": "Thank you for using the 12ft ladder link. You saved us all a step!",
            "title_similarity": "0.08159488",
            "sentiment_compound": 0.68
        },
        {
            "id": "hyc0mva",
            "score": 1,
            "text": "Biden kept insisting that his sanctions are way worse than kicking Russia from Swift. Was ge right about that?",
            "title_similarity": "0.6797209",
            "sentiment_compound": -0.3182
        },
        {
            "id": "hyc0o56",
            "score": 1,
            "text": "SWIFT utilizes the US dollar for transactions. Putin and Xi hate that the American dollar is the \"global\" currency. This could be exactly what he wants....parallel economy on the global scale incoming.",
            "title_similarity": "0.5867693",
            "sentiment_compound": -0.2885
        },
        {
            "id": "hycdn6z",
            "score": 1,
            "text": "A little less conversation\nA little more action please\n\nJust do it already!",
            "title_similarity": "0.3220085",
            "sentiment_compound": 0.3832
        },
        {
            "id": "hycdvog",
            "score": 2,
            "text": "> \"It would also stymie Russia’s ability to recoup international profits from its oil and gas exports, which account for more than 40 per cent of its revenue.\"\n\nHoly shit.  Russia would collapse within 2 months.",
            "title_similarity": "0.4513414",
            "sentiment_compound": -0.3818
        },
        {
            "id": "hycj2ch",
            "score": 2,
            "text": "At this point I don’t even know which side Germany is on. Are the German people pressuring their government to ban Russia or are they eating popcorn now?",
            "title_similarity": "0.60725886",
            "sentiment_compound": -0.7184
        },
        {
            "id": "hycnnzb",
            "score": 1,
            "text": "Then how will everyone pay russia for the oil they’re dependant on?",
            "title_similarity": "0.5508617",
            "sentiment_compound": -0.1027
        },
        {
            "id": "hycr0i7",
            "score": 1,
            "text": "ELI5 what is swift?",
            "title_similarity": "0.24136277",
            "sentiment_compound": 0.2023
        },
        {
            "id": "hycrahv",
            "score": 1,
            "text": "That is a Big Deal.",
            "title_similarity": "0.07432553",
            "sentiment_compound": 0.0
        },
        {
            "id": "hycroue",
            "score": 2,
            "text": "Oh my god.  It finally happened.  Boris Johnson said something that I agree with.",
            "title_similarity": "0.3044887",
            "sentiment_compound": 0.5574
        },
        {
            "id": "hyctf17",
            "score": 2,
            "text": "do it!\n\n\\- a german\n\nEDIT: funnily enough, I live near the area where the pipeline nord stream 2 ends",
            "title_similarity": "0.4014111",
            "sentiment_compound": 0.4926
        },
        {
            "id": "hycx24z",
            "score": 1,
            "text": "Why am I agreeing with Boris fucking Johnson today",
            "title_similarity": "0.47467047",
            "sentiment_compound": 0.34
        },
        {
            "id": "hycy8m6",
            "score": 3,
            "text": "Even fucking Boris is on the right side of this one! What the fuck are Germany and Italy doing?",
            "title_similarity": "0.5312978",
            "sentiment_compound": -0.5848
        },
        {
            "id": "hyd107d",
            "score": 2,
            "text": "That will lead to China and Russia solidifying their open alliance against the world, Putin wants the eastern block of Europe, Xi wants south/east Asia and the pacific isles, both for their own reasons.  But Putins #3 world supply of oil could be the power China needs and China could be the trade facilitator that Russia needs.\n\nPeople underestimate what further isolating theses aggressive and nationalistic super powers will do.  Sanctions dont mean anything when your own gas is too expensive for people to pay for.",
            "title_similarity": "0.5829692",
            "sentiment_compound": 0.0258
        },
        {
            "id": "hyd5981",
            "score": 1,
            "text": "They want total war and economic chaos. \nRussian companies have outstanding loans AND deposits.",
            "title_similarity": "0.65608495",
            "sentiment_compound": -0.5563
        },
        {
            "id": "hyd7hrx",
            "score": 1,
            "text": "All that'd do is ensure China wins. Did Boris get out of the wrong side of bed again?",
            "title_similarity": "0.53477407",
            "sentiment_compound": 0.4939
        },
        {
            "id": "hydfixw",
            "score": 1,
            "text": "Not a bad idea really. We should push our banking system to stop financing the gas and oil industry while we are at it! Look for fossil fuel divested bank, there is a growing number of those around the world. Here's a list of some of the [top names](https://sustainfi.com/banking/green-banks/) for anyone wanting to look further into things.",
            "title_similarity": "0.54085773",
            "sentiment_compound": 0.5778
        },
        {
            "id": "hydpl6o",
            "score": 1,
            "text": "What about Putin and his circle instead of the whole populi?",
            "title_similarity": "0.67953",
            "sentiment_compound": 0.0
        },
        {
            "id": "hydpsg5",
            "score": 1,
            "text": "But at the end it didn't happen...",
            "title_similarity": "0.2609992",
            "sentiment_compound": 0.0
        },
        {
            "id": "hydr31p",
            "score": 1,
            "text": "Excellent way to start a general war (WW3).",
            "title_similarity": "0.43422753",
            "sentiment_compound": -0.0516
        },
        {
            "id": "hye22q0",
            "score": 1,
            "text": "Kick him out.",
            "title_similarity": "0.52445966",
            "sentiment_compound": 0.0
        },
        {
            "id": "hye941v",
            "score": 1,
            "text": "Biden didn't even sanction *PUTIN* what a joke. \n\nS'pose that means he still gets his Amazon deliveries.",
            "title_similarity": "0.46913433",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hyf8pxu",
            "score": 1,
            "text": "He’s finally doing something sensible for once in his life",
            "title_similarity": "0.057172894",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyii8na",
            "score": 1,
            "text": "Is Biden waiting for every world leader to state they are good with Russia getting a ban on SWIFT before he announces that Russia should be banned from SWIFT",
            "title_similarity": "0.787639",
            "sentiment_compound": 0.0941
        },
        {
            "id": "hyjs33c",
            "score": 1,
            "text": "oh yeah, it's jubilee time soon",
            "title_similarity": "0.043805044",
            "sentiment_compound": 0.296
        },
        {
            "id": "i4sppca",
            "score": 1,
            "text": "Yes,  the dirty cash has stopped.\n\nNo more brown envelopes.",
            "title_similarity": "0.38409802",
            "sentiment_compound": -0.5106
        }
    ]
}