{
    "Ukraine asks Red Cross to facilitate repatriation of thousands of Russian soldiers’ bodies so that their parents can “bury them with dignity” and to “not let Putin hide scale of tragedy”\n": [
        {
            "id": "hymdfah",
            "score": -11,
            "text": "times of israel should talk about the civillians their killing in yemen/syria on a daily business. everyone reading this, please don’t forget these same countries are engaging in war crimes every day :)",
            "title_similarity": "0.62302476",
            "sentiment_compound": -0.4897
        },
        {
            "id": "hymdqso",
            "score": 1,
            "text": "A week ago I barely knew anything about Ukraine. After this week I am absolutely in love with Ukraine and it’s people. Can’t wait for the war to be over so I can visit.",
            "title_similarity": "0.6050979",
            "sentiment_compound": 0.1477
        },
        {
            "id": "hymc1v7",
            "score": 9,
            "text": "it's not smart to believe whatever ukraine say or russian say during war.",
            "title_similarity": "0.44376433",
            "sentiment_compound": -0.7317
        },
        {
            "id": "hymff5x",
            "score": -10,
            "text": "[removed]",
            "title_similarity": "0.037376937"
        },
        {
            "id": "hymd40p",
            "score": -4,
            "text": "I think Ukraine is really trying to be the new model for democracy.  No more politicians just in it for the money and power, no more corruption. \n\nThey want to be tough, but ethical and yet be a country known for its culture. \n\nSomething Russia has been trying to achieve, except you know all the corruption and communism. \n\nThis is definitely the direction so many democratic countries need to head in. Sadly most of them are getting more corrupt.",
            "title_similarity": "0.6134871",
            "sentiment_compound": 0.4822
        },
        {
            "id": "hymhzx2",
            "score": 4,
            "text": "I dont support this war. Dont support Putin. But so much footage, and scenarios that I have applauded as brave have just turned out to be completely false propaganda. Why does reddit not mind being lied to?",
            "title_similarity": "0.50623345",
            "sentiment_compound": 0.5629
        },
        {
            "id": "hymaxvn",
            "score": -4,
            "text": "[removed]",
            "title_similarity": "0.037376937"
        },
        {
            "id": "hymwbf7",
            "score": 1,
            "text": "An article in support of Ukraine, a country being invaded by another... Israelis don't see the irony. Both funny & tragic in their ignorance.",
            "title_similarity": "0.46498036",
            "sentiment_compound": 0.0639
        },
        {
            "id": "hylx9ah",
            "score": 15,
            "text": "Theres no good side of war my ass",
            "title_similarity": "0.20589939",
            "sentiment_compound": -0.8691
        },
        {
            "id": "hymx270",
            "score": 1,
            "text": "That last statement while dramatic, really put a noose around the Red Crosses neck.\n\nRed Cross has a neutrality clause it uses so it can freely move back and forth between nations during crisis unimpeded and help those in need. Impartial to aggressors or victims of conflict.\n\nRussian Red Cross right now even is heavily involved with providing support to refugees as they cross into Russia. Ukrainian Red Cross with the rest of the ICRC are supporting on the other side. \n\nAsking them to deliver the bodies and directly oppose alleged \"propaganda\" through humanitarian action is undermining their ability to remain neutral during this crisis. \n\nThat could mean trust in the Red Cross could fade and that would be bad because with that goes a lot of rules of war regarding safeguarding rescue workers, having advocates for humane treatment for prisoners of war, and other really important things.",
            "title_similarity": "0.74246514",
            "sentiment_compound": -0.9005
        },
        {
            "id": "hylwvvg",
            "score": 26,
            "text": "This is the way",
            "title_similarity": "-0.1211901",
            "sentiment_compound": 0.0
        },
        {
            "id": "hym9zej",
            "score": -10,
            "text": "[deleted]",
            "title_similarity": "0.08711866"
        },
        {
            "id": "hymhwir",
            "score": 2,
            "text": "Russian Warship. Go F\\*\\*\\* yourself;) Ghosts of Kyiv out tonight ;)",
            "title_similarity": "0.55604976",
            "sentiment_compound": 0.0516
        },
        {
            "id": "hymdufh",
            "score": -10,
            "text": "fuck the United States and Russian governments",
            "title_similarity": "0.5011866",
            "sentiment_compound": -0.1779
        },
        {
            "id": "hymd7jv",
            "score": 1,
            "text": "I still think great majority of russians is happy about what Putain is doing",
            "title_similarity": "0.3566598",
            "sentiment_compound": 0.8316
        },
        {
            "id": "hymgryy",
            "score": 1,
            "text": "Every single day of russian invasion should result in a decade or even a century of international isolation (of russia) in every single aspect.",
            "title_similarity": "0.66316",
            "sentiment_compound": -0.4019
        },
        {
            "id": "hymdh2p",
            "score": -21,
            "text": "Ukraine is lying and making false claims lol",
            "title_similarity": "0.34761733",
            "sentiment_compound": -0.1531
        },
        {
            "id": "hymcq8u",
            "score": -19,
            "text": "According r/worldnews , Ukrainian troops are probably in Moscow right now, you guys are so easily manipulated, thousands of Russian soldiers bodies? lol.",
            "title_similarity": "0.6888854",
            "sentiment_compound": 0.4657
        },
        {
            "id": "hymbqlf",
            "score": -8,
            "text": "It's a good PR nove by Ukraine move but this shouldn't be done. It's really bad for Russian morale - both at the front and at home so why help the fuckers? Let them rot.",
            "title_similarity": "0.62617207",
            "sentiment_compound": -0.7665
        },
        {
            "id": "hym2135",
            "score": -5,
            "text": "They can repatriate a few kilograms of ashes.",
            "title_similarity": "0.283328",
            "sentiment_compound": 0.0
        },
        {
            "id": "hymti8t",
            "score": 1,
            "text": "Russian citizens are being kidnapped off the streets to help provide troops for this fuckery btw",
            "title_similarity": "0.69212306",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hynh5hh",
            "score": 2,
            "text": "The traditional approach is to send the corpses back over the wall by catapult.",
            "title_similarity": "0.5099522",
            "sentiment_compound": 0.0
        },
        {
            "id": "hymnok8",
            "score": -10,
            "text": "fake",
            "title_similarity": "-0.07458021",
            "sentiment_compound": -0.4767
        },
        {
            "id": "hyme6n3",
            "score": -16,
            "text": "Kharkiv has fallen and the russians are rumored to have taken an airfield southwest of Kiev. Its looks like the Ukrainian army in the Donbas is shattering and group Zed out of Crimea is running wild into the west of the country.\n\nThis is only day four and the russians aren't using anywhere near their full strength of deployed forces. Western Legacy media just keeps repeating wild stories that are Ukrainian propaganda and Russia RT is going out of its way to not mention massive unexpected casualties.\n\nhttps://twitter.com/Osinttechnical/status/1497688642583683076/photo/1",
            "title_similarity": "0.70823795",
            "sentiment_compound": 0.296
        },
        {
            "id": "hymavqx",
            "score": 3,
            "text": "Yo, Red Cross, come pickup ya boy.",
            "title_similarity": "0.46959993",
            "sentiment_compound": 0.0
        },
        {
            "id": "hymce7a",
            "score": -1,
            "text": "[removed]",
            "title_similarity": "0.037376937"
        },
        {
            "id": "hymcrzm",
            "score": -2,
            "text": "Why?",
            "title_similarity": "-0.084838144",
            "sentiment_compound": 0.0
        },
        {
            "id": "hymfn9y",
            "score": 0,
            "text": "I don’t think your son never coming home “hides” the tragedy though. Adds mystery to the tragedy maybe, besides a lot of these soldiers are orphans that were drafted and had no choice but to go and no one that cares that they went or what happened.",
            "title_similarity": "0.6128174",
            "sentiment_compound": -0.5859
        },
        {
            "id": "hyn9ohj",
            "score": 0,
            "text": "I know it’s a little off the thread but\n\nIf they have the manpower it is time to attack… They can manage two fronts They should retake Crimea and engage Belarus who is giving aid to their enemy if they can only manage one then I would say attack Belarus as they are allowing staging for more troops to be placed in their country.",
            "title_similarity": "0.65758187",
            "sentiment_compound": -0.5719
        },
        {
            "id": "hyo568a",
            "score": 0,
            "text": "I just don't believe there are thousands maybe a thousand, are we to believe the Ukrainians are trading 5-1?",
            "title_similarity": "0.43078274",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyoaziq",
            "score": -1,
            "text": "[removed]",
            "title_similarity": "0.037376937"
        },
        {
            "id": "hyojnzr",
            "score": 0,
            "text": "Russia are sending the younger, softer soldiers in first to gain intelligence on the way Ukraine defend. They are cannon fodder, once he has a better understanding of Ukraines tactics he will send in his more experienced, harder soldiers",
            "title_similarity": "0.6463616",
            "sentiment_compound": 0.8555
        },
        {
            "id": "hylx34n",
            "score": 9,
            "text": "How exactly would this work? How would they be able to get thousands of bodies into Russia and bypass their policing?",
            "title_similarity": "0.71320903",
            "sentiment_compound": 0.0
        },
        {
            "id": "hymei90",
            "score": 5,
            "text": "Chad Zelensky: honors enemy troops\n\nVirgin Putin: Hides # of dead",
            "title_similarity": "0.7377778",
            "sentiment_compound": -0.7351
        },
        {
            "id": "hymnrsw",
            "score": -6,
            "text": "Hate Russia's actions but this sub has just become a Ukrainian propaganda outlet now",
            "title_similarity": "0.5769664",
            "sentiment_compound": -0.5927
        },
        {
            "id": "hymcy2f",
            "score": 1,
            "text": "Ukraine is just kicking Russia's ass in all areas right now. I don't suspect it will last, but I have a shit ton of respect for that country now.",
            "title_similarity": "0.5904054",
            "sentiment_compound": -0.3728
        },
        {
            "id": "hymdeo9",
            "score": 1,
            "text": "Putin is just like hitler ! \n\nKeep doing Crazy propaganda but mal what he tells are lies. \n\nStop this stupid motherfucker",
            "title_similarity": "0.49534148",
            "sentiment_compound": -0.965
        },
        {
            "id": "hymewk9",
            "score": 1,
            "text": "I think Ukraine is officially the worlds New Superpower.",
            "title_similarity": "0.30868083",
            "sentiment_compound": 0.0
        },
        {
            "id": "hymf24w",
            "score": 1,
            "text": "Spread the word: Telegram is NOT encrypted or secure!! https://www.reddit.com/r/ukraine/comments/t25ldr/stop_using_telegram_please/",
            "title_similarity": "0.5103011",
            "sentiment_compound": -0.3859
        },
        {
            "id": "hymhksa",
            "score": 1,
            "text": "Zelensky if he makes out of this war, will be a world hero. Right next to captain America.",
            "title_similarity": "0.52459383",
            "sentiment_compound": -0.2558
        },
        {
            "id": "hymjw9t",
            "score": 1,
            "text": "Dosent matter which side you support in this war, you can't ignore this example of #leadership!\n\nDON'T RUN AWAY.",
            "title_similarity": "0.39182293",
            "sentiment_compound": 0.0777
        },
        {
            "id": "hymllth",
            "score": 1,
            "text": "I've seen a lot of people on Reddit doubt that there's even been thousands of Russians dead. Does this change this? If it's just Ukrainian propaganda it would backfire if they didn't actually send back thousands of Russian bodies to be buried.",
            "title_similarity": "0.7415292",
            "sentiment_compound": -0.8316
        },
        {
            "id": "hymt3ki",
            "score": 1,
            "text": ">An accompanying chart claimed 3,500 Russian troops have been killed.\n\nDoesn't Ukraine have about ~300 deaths so far?  Is the death toll really so lopsided or is that chart inaccurate?",
            "title_similarity": "0.6337252",
            "sentiment_compound": -0.8677
        },
        {
            "id": "hymv2sj",
            "score": -1,
            "text": "Oh come on",
            "title_similarity": "-0.1342006",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyn71gw",
            "score": 1,
            "text": "Putin's banking on the anguish of his citizens and doubling down on his propaganda.\n\nHis high risk high reward invasion tactics led to a lot of casualties, and I am afraid this was also calculated on his part. You would think the people will want to give up on war, but seeing their loved ones come back in body bags can often inspire more people to join \"the cause.\"",
            "title_similarity": "0.66954434",
            "sentiment_compound": 0.9031
        },
        {
            "id": "hynvhth",
            "score": 1,
            "text": "Anybody have any idea of casualty numbers? \n\nLast I heard a day or so ago was Ukraine had 130 deaths of soldiers and civilians. \n\nAny word on the Russian forces?",
            "title_similarity": "0.6201594",
            "sentiment_compound": -0.5803
        },
        {
            "id": "hypedzp",
            "score": -1,
            "text": "Russia would only agree if it WANTS it to become known that the first dead were mostly conscript Chechens, cannon fodder to test Ukrainian resolve. \n\nIt may want that at this point, it may not. \n\nPutin is a genius at one thing, timing WHEN the truth is revealed. \n\nIf it's to his advantage in the present armistice talks to reveal that the casualties are people not regarded as fully human by rural Russians who believe state TV... And to NATO that the serious troops are in reserve...",
            "title_similarity": "0.7144348",
            "sentiment_compound": 0.4767
        },
        {
            "id": "hylzuda",
            "score": 16,
            "text": "All those poor kids duped into invading.",
            "title_similarity": "0.40107778",
            "sentiment_compound": -0.7096
        },
        {
            "id": "hymcjqu",
            "score": 2,
            "text": "Not so fun side fact: After the BP oil spill, BP brought in an incinerator and sent crews out to pick up all the dead animals.  There was no body count.",
            "title_similarity": "0.6315017",
            "sentiment_compound": -0.8562
        },
        {
            "id": "hymebmg",
            "score": -2,
            "text": "Wouldnt be me",
            "title_similarity": "-0.018836873",
            "sentiment_compound": 0.0
        },
        {
            "id": "hymfiol",
            "score": -2,
            "text": "Propo propo propo",
            "title_similarity": "-0.06635888",
            "sentiment_compound": 0.0
        },
        {
            "id": "hymj0is",
            "score": 2,
            "text": "What a fucking Chad \n\n\"We need humanitarian aid\"\n\n\"For fighting the war?\"\n\n\"..oh! No, we killed so many enemy soldiers we don't know what to do with them\"",
            "title_similarity": "0.69609475",
            "sentiment_compound": -0.943
        },
        {
            "id": "hympqnu",
            "score": -2,
            "text": "The world's most hardcore humble brag... okay.",
            "title_similarity": "0.14158161",
            "sentiment_compound": 0.2263
        },
        {
            "id": "hymuna7",
            "score": -2,
            "text": "[removed]",
            "title_similarity": "0.037376937"
        },
        {
            "id": "hym17ze",
            "score": 25,
            "text": "The article states a chart from the Ukrainian ambassador showed 3500 Russian dead. The request is not just humanitarian but also a psychological counter to generate unrest in Russia. At this rate, there will be tens of thousands of young  dead Russian men.",
            "title_similarity": "0.76690197",
            "sentiment_compound": -0.8625
        },
        {
            "id": "hym9los",
            "score": -19,
            "text": "They should be put in a stake for all to see. Those soldiers don't deserve an honorable burial.",
            "title_similarity": "0.6080915",
            "sentiment_compound": -0.431
        },
        {
            "id": "hylwzqv",
            "score": 190,
            "text": "Russian army are evaporating corpses with their mobile crematoriums and possibly lie to the soldiers families.",
            "title_similarity": "0.81268984",
            "sentiment_compound": 0.0
        },
        {
            "id": "hymbijj",
            "score": -2,
            "text": "Thank goodness Israel is able to give us the real news",
            "title_similarity": "0.11245203",
            "sentiment_compound": 0.6705
        },
        {
            "id": "hymdr3h",
            "score": -5,
            "text": "[removed]",
            "title_similarity": "0.037376937"
        },
        {
            "id": "hymghmj",
            "score": 2,
            "text": "Unless it's Chechen soldiers. Fuck them.",
            "title_similarity": "0.47308677",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hymr8np",
            "score": -3,
            "text": "Citing Israel's news website. How ironic.",
            "title_similarity": "0.2285911",
            "sentiment_compound": -0.128
        },
        {
            "id": "hymsst3",
            "score": 3,
            "text": "Reminds me of how Vietnam fucked USA",
            "title_similarity": "0.3154549",
            "sentiment_compound": -0.6597
        },
        {
            "id": "hym33dj",
            "score": 12,
            "text": "No, it’s true, there are no Russian bodies.. know why? They have a mobile crematoriums mounted to trucks and are burning their dead soldiers so there’s no evidence. \n\nRussia (Putin) is literally giving the world double middle fingers while he stands in front of 6,000 nukes",
            "title_similarity": "0.6914201",
            "sentiment_compound": -0.5829
        },
        {
            "id": "hymhch7",
            "score": -15,
            "text": "[removed]",
            "title_similarity": "0.037376937"
        },
        {
            "id": "hym7irj",
            "score": 4,
            "text": "If only everyone else had the same level class and could provide some humanitarian relief to Russian civilians as well",
            "title_similarity": "0.657672",
            "sentiment_compound": 0.6369
        },
        {
            "id": "hymi7ga",
            "score": 5,
            "text": "They should offer new identities and citizenship to any Russian troops that want to defect.",
            "title_similarity": "0.68656933",
            "sentiment_compound": -0.2732
        },
        {
            "id": "hymjp13",
            "score": 4,
            "text": "Soldiers mothers ended a lot of wars in the history of our civilization. This is a great move.",
            "title_similarity": "0.61446565",
            "sentiment_compound": 0.128
        },
        {
            "id": "hyme8nt",
            "score": -16,
            "text": "World Praising Civilian People who have been armed to defend their Independence against Unlawful invasion by Outsider...\n\nWorld declaring Palestinians as Terrorists who did the Same thing since 1948...\n\nWow",
            "title_similarity": "0.47403842",
            "sentiment_compound": 0.4939
        },
        {
            "id": "hympmtm",
            "score": 5,
            "text": "I wish the Russians would just join the Ukrainians or go home back to Russia. This war is only going to end either with countless dead Russians in a brutal urban war or the levelling of the capital city. All for one man who does not care one bit about them or their families, has clearly lost his mind with the threat of starting a nuclear war and is willing to send their country to the social and economic depths of hell.",
            "title_similarity": "0.69161165",
            "sentiment_compound": -0.982
        },
        {
            "id": "hymr3hv",
            "score": -5,
            "text": "ironic to see this posted by the Times of Israel 🤪",
            "title_similarity": "0.15243718",
            "sentiment_compound": -0.128
        },
        {
            "id": "hyngpkq",
            "score": 5,
            "text": "Ukraine flexing on their Kill count.  What a weird world we live in.",
            "title_similarity": "0.5346245",
            "sentiment_compound": -0.7506
        },
        {
            "id": "hynmko1",
            "score": -7,
            "text": "Baloney",
            "title_similarity": "-0.054242626",
            "sentiment_compound": 0.0
        },
        {
            "id": "hymdiba",
            "score": -10,
            "text": "[removed]",
            "title_similarity": "0.037376937"
        },
        {
            "id": "hymea20",
            "score": 6,
            "text": "Putin is dead meat !! He’s a fucking war criminal. He’s hiding out in the Ural Mountains the fucking piece of shit. I would be damn sure satellite imagery and drones will find this arsehole and all of his billionaire cronies. Death would be too good for this bastard and his mates. Evil son of a bitch",
            "title_similarity": "0.59379697",
            "sentiment_compound": -0.9871
        },
        {
            "id": "hynq50w",
            "score": 6,
            "text": "Let’s be completely clear about this. The people of Ukraine and people of Russia are very close. \n\nThey love and respect each other.  They are closer to each other than Americans are to Canadians. Think about the moral dissonance if an American was told to kill Canadians in order to annex Canadian land, and then double that for a Russian told to do the same to a fellow Ukrainian.",
            "title_similarity": "0.6919381",
            "sentiment_compound": 0.6962
        },
        {
            "id": "hylzrbq",
            "score": 90,
            "text": "Russia has mobile crematoriums so there are concerns the death toll will be hidden. \n\nRussian people need to see how their soldiers died for nothing.",
            "title_similarity": "0.8077555",
            "sentiment_compound": -0.8176
        },
        {
            "id": "hym1ld3",
            "score": 54,
            "text": "For any Africans or anyone still stuck at Poland-Ukraine border please share.\nhttps://mobile.twitter.com/BashirAhmaad/status/1497575788719362049?s=20&t=aVmJJ8wr75I_N1BeSM627w",
            "title_similarity": "0.4367566",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hyly0ew",
            "score": 73,
            "text": "so much class. Cant imagine this from the russians",
            "title_similarity": "0.45944005",
            "sentiment_compound": 0.0
        },
        {
            "id": "hym1mp6",
            "score": 80,
            "text": "At least half of these parents don't even know their kids are in Ukraine.",
            "title_similarity": "0.46095347",
            "sentiment_compound": 0.0
        },
        {
            "id": "hym575v",
            "score": 7,
            "text": "And that’s what I like to call a power move",
            "title_similarity": "-0.009959538",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hym5gwj",
            "score": 42,
            "text": "That's a lot of 🌻",
            "title_similarity": "-0.015067235",
            "sentiment_compound": 0.0
        },
        {
            "id": "hymcmg6",
            "score": 29,
            "text": "As a mother to a son, seeing what is happening in Ukraine has truly cut me to my soul. A child is such a beautiful and precious gift that takes so much time and nurturing and luck and love to create. It’s an extension of both parents’ bodies and souls. If you’ve ever had a kid you know exactly what I’m talking about. Seeing lives snuffed out like they mean nothing, someone’s sweet child and their entire reason for living just laying in the street to collect snow and maybe become a picture for people to share on Instagram is honestly haunting. The fact that this war is being shared on social media has really opened my eyes to just how horrible and unfair and disgusting it all is. War fucking sucks. It makes me appreciate the shit that all my grandparents and every vet went through in the wars that they fought in but never really talked about. And to everyone living through this kind of violence and worrying if their child is alive right now, I truly hope they are. Feeling so grateful for my warm and comfortable home tonight, and knowing my son is safe in his bed. Let’s all hope this is over soon. Fuck Putin.",
            "title_similarity": "0.66729856",
            "sentiment_compound": 0.9634
        },
        {
            "id": "hyn03d1",
            "score": -9,
            "text": "More fakes to detour reality.",
            "title_similarity": "0.23140642",
            "sentiment_compound": -0.4754
        },
        {
            "id": "hyn6jds",
            "score": -9,
            "text": "[removed]",
            "title_similarity": "0.037376937"
        },
        {
            "id": "hylyuft",
            "score": 12,
            "text": "The class. So much respect for Ukraine!",
            "title_similarity": "0.34814537",
            "sentiment_compound": 0.5676
        },
        {
            "id": "hym2av9",
            "score": 11,
            "text": "Deliver the bodies to Putins fucking front door and take confirmation pics of package delivery 📦",
            "title_similarity": "0.63464737",
            "sentiment_compound": 0.0
        },
        {
            "id": "hymfnsb",
            "score": 12,
            "text": "I hate all war. And though right now I'm in a \"fuck Russia!\" mode, I ultimately feel like I did when we invaded Iraq for no legitimate reason. All those poor soldiers and deaths on both sides for no real reason. All the parents who have to hear their son or daughter just died by just doing what they're told to do, to go fight for the kings in the ivory towers who use soldiers like sacrificial pawns in a chess match while they never face any real consequences.\n\nI hope Putin ultimately pays for this, but we all know he won't.",
            "title_similarity": "0.6894858",
            "sentiment_compound": -0.8497
        },
        {
            "id": "hymjyjh",
            "score": -12,
            "text": "[deleted]",
            "title_similarity": "0.08711866"
        },
        {
            "id": "hym01xy",
            "score": 59,
            "text": "Ukraine is far better than I would be.",
            "title_similarity": "0.21604809",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hym58nz",
            "score": 37,
            "text": "Putin can only hide it from his own people, even then, the families of the soldiers would find out eventually... Johnny went to war and never came back?? \nThe world is watching.\n\nThe soldiers, even if fighting for a ridiculous cause, still deserve a proper burial/funeral...\nNot uBer heats.\n\nCompassion costs nothing.\n\nWell done Ukraine, winning on so many levels.",
            "title_similarity": "0.76231074",
            "sentiment_compound": -0.8767
        },
        {
            "id": "hyn4t8e",
            "score": -12,
            "text": "Reddit is covered in nothing but false, misleading propaganda that has been proven to be nothing but lies. Thousands of bodies? Nice try. Meanwhile they give out guns to women and children and put AA in the middle of neighborhoods and then lie about hospitals and kindergartens being hit.",
            "title_similarity": "0.6107686",
            "sentiment_compound": 0.7955
        },
        {
            "id": "hylz4ok",
            "score": 13,
            "text": "When the rich wage war it's the poor who die.",
            "title_similarity": "0.49904728",
            "sentiment_compound": -0.8074
        },
        {
            "id": "hym4dt1",
            "score": 17,
            "text": "Putin is gathering Chechens and other such tribes as canon fodders to minimize loss of ethnic Russian lives.\n\nHe knows very well that his people (and Ukrainians) too will not care about dead Chechens or Uzbeks.",
            "title_similarity": "0.75299823",
            "sentiment_compound": 0.228
        },
        {
            "id": "hym7nsh",
            "score": 21,
            "text": "A burial would certainly bring more closure to the families of the dead than having their ashes swept under the rug by a Tyrant.",
            "title_similarity": "0.6556395",
            "sentiment_compound": -0.4404
        },
        {
            "id": "hym4ewv",
            "score": 56,
            "text": "Sounds like Russia is getting rekt.\nTraggic to all the Russians who were dragged into this, and all the innocent citizens affected.",
            "title_similarity": "0.7089604",
            "sentiment_compound": 0.4767
        },
        {
            "id": "hymd03b",
            "score": 25,
            "text": "The longer I read /r/worldnews the more I realize Putin has to be one of the most pathetic humans that ever walked the earth.",
            "title_similarity": "0.4679693",
            "sentiment_compound": -0.6115
        },
        {
            "id": "hym2p1v",
            "score": 93,
            "text": "Holy fuck these people are honorable.",
            "title_similarity": "0.01420591",
            "sentiment_compound": 0.0
        },
        {
            "id": "hym2v9h",
            "score": 119,
            "text": "> facilitate repatriation of thousands of Russian soldiers\n\n3,500 Russian troops possibly died already... this is horrible but also sounds like an offensive failure... its only been a few days.",
            "title_similarity": "0.7156236",
            "sentiment_compound": -0.8674
        },
        {
            "id": "hym5xgp",
            "score": 667,
            "text": "It’s not that I *didn’t* respect Ukraine before but Jesus Christ they’re writing the book on being inspirational badasses while being invaded by a much larger country. It goes beyond respect now.",
            "title_similarity": "0.61122113",
            "sentiment_compound": 0.8922
        },
        {
            "id": "hymc45b",
            "score": 57,
            "text": "I’m in Canada but my supervisor is from Russia. He was really upset when we talked about this. He said he has friends that are Russian soldiers. They didn’t have a choice :(",
            "title_similarity": "0.6857277",
            "sentiment_compound": -0.5483
        },
        {
            "id": "hym0vlf",
            "score": 157,
            "text": "God bless Ukraine and those Russians who hate what Putin is doing.",
            "title_similarity": "0.61752856",
            "sentiment_compound": 0.0516
        },
        {
            "id": "hylwrht",
            "score": 1816,
            "text": "Classy nation",
            "title_similarity": "-0.04936684",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hym7sf9",
            "score": 192,
            "text": "This will have a significant impact. During the Soviet-Afghan war, the USSR banned public funerals of Soviet troops KIA because of their concern that it would sour the psychological mood of their nation. They wanted to keep the public in the dark because the war was going far more poorly than they were reporting. Soviet families were forced to grieve in private, unaware that their feelings of grief were shared by so many across the Soviet Union. It will be interesting to watch how Russia will contend with hiding the dead from their people this time.",
            "title_similarity": "0.73502326",
            "sentiment_compound": -0.9823
        },
        {
            "id": "hylx54b",
            "score": 2380,
            "text": "Ukraine cares more about Russian soldiers and citizens than Putin even does.",
            "title_similarity": "0.56600034",
            "sentiment_compound": 0.4588
        },
        {
            "id": "hym1mb6",
            "score": 489,
            "text": "Those mobile crematoriums are some of the most ghastly and ghoulish devices to be shown to the world. Even their existence, to say nothing of their deployment, makes the Russian high command look evil in the extreme.",
            "title_similarity": "0.5365328",
            "sentiment_compound": -0.6597
        },
        {
            "id": "hym86ei",
            "score": 98,
            "text": "Watching what’s coming out of there, those are just kids. \n\nPutin is a fucking monster.",
            "title_similarity": "0.39622796",
            "sentiment_compound": 0.0
        },
        {
            "id": "hylxil2",
            "score": 240,
            "text": "[deleted]",
            "title_similarity": "0.08711866"
        },
        {
            "id": "hylzjy4",
            "score": 1487,
            "text": "This seems to be the first war where one of the sides is using social media as an asset and not just an after thought.",
            "title_similarity": "0.2660394",
            "sentiment_compound": -0.34
        },
        {
            "id": "hym2e8h",
            "score": 490,
            "text": "Many many of these Russian failing soldiers sent to invade Ukraine are just kids. \n\nThey would be conscripted and untrained, literally handed a weapon and some armor and be told - \"Go there, we must protect our nation\" (or some Russian propaganda shit) and they will go.\n\n\nAlternative is - Prison/Death for treason. \n\n\nThese young lads didn't have to die for it.\n\nThis is blame on government nobody else. (These kid-soldiers didn't get much choice).\n\nAs a result of that - we see a lot of innocent lives lost (Mostly Russian soldiers who were untrained and unprepared)\n\n\nThey deserve to be sent back at least.",
            "title_similarity": "0.70859814",
            "sentiment_compound": -0.8609
        },
        {
            "id": "hylwte4",
            "score": 7814,
            "text": "Even in war they show more dignity than Putin",
            "title_similarity": "0.23943244",
            "sentiment_compound": -0.228
        },
        {
            "id": "hymbopa",
            "score": 1004,
            "text": "In Russia more and more rumour sare starting to spread that not all soldiers sent to Ukraine are professional. They seem to be units of conscripts being sent into combat. \n\nIt is illegal to send a person serving the mandatory 1 year conscription into combat in a non defensive war.\n\nRefusing to collect the bodies might be a way to temporarily hide the news of these conscripts being sent to fight and die illegally, thus delay the outrage such news would cause.\n\nEdit: forgot to mention, as HavocReigns pointed out, there is also a possibility that the conscripts are being forced/coerced into signing contracts",
            "title_similarity": "0.75351596",
            "sentiment_compound": -0.9786
        },
        {
            "id": "hylx4w6",
            "score": 7164,
            "text": "This is amazing. A lot of these troops were conscripted teenagers. They had no skin in this fight until they did. Let their families bury them, and let it fuel the Russian populations rage against their authoritarian state.",
            "title_similarity": "0.7158274",
            "sentiment_compound": -0.6124
        },
        {
            "id": "hylyhtt",
            "score": 3706,
            "text": "Damn this is a good response from Ukraine. Russia can’t hide the bodies.",
            "title_similarity": "0.5777544",
            "sentiment_compound": -0.128
        },
        {
            "id": "hym4ewl",
            "score": 508,
            "text": "I hope the red cross is allowed to oversee the bodies returned to their families, otherwise Putin will likely have them burned before anybody in Russia can see or find out about them.",
            "title_similarity": "0.8439671",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hym28yo",
            "score": 221,
            "text": "A news report yesterday said for sure, at least 3 mobile Russian crematoriums have been spotted in or on the way to Ukraine.",
            "title_similarity": "0.60609746",
            "sentiment_compound": 0.3182
        },
        {
            "id": "hylxj4h",
            "score": 3135,
            "text": "[removed]",
            "title_similarity": "0.037376937"
        },
        {
            "id": "hym35g5",
            "score": 13467,
            "text": "This is both an empathic human gesture AND a strategic move to counter propaganda & convey the reality of this invasion to Russian citizens.",
            "title_similarity": "0.60370994",
            "sentiment_compound": -0.25
        },
        {
            "id": "hylz30u",
            "score": 23,
            "text": "Literally the opposite of putin",
            "title_similarity": "0.119987614",
            "sentiment_compound": 0.0
        },
        {
            "id": "hym2lvy",
            "score": 3,
            "text": "\"The Betrayal\"",
            "title_similarity": "0.1284203",
            "sentiment_compound": -0.5859
        },
        {
            "id": "hym443w",
            "score": 2,
            "text": "How are the Russian people going to take the news?",
            "title_similarity": "0.5592313",
            "sentiment_compound": 0.0
        },
        {
            "id": "hym53tk",
            "score": 9,
            "text": "That is as long as the mobile Russian crematoriums do not get to the body's first of course.",
            "title_similarity": "0.6825025",
            "sentiment_compound": 0.0
        },
        {
            "id": "hym6ssy",
            "score": 31,
            "text": "Having a moral high ground is especially important right now tho Putin have already put that bar straight in hell so this is just a massive win all together.",
            "title_similarity": "0.46134108",
            "sentiment_compound": 0.2944
        },
        {
            "id": "hym7nxk",
            "score": 7,
            "text": "its also an excellent strategic move so putin cant hide the true scale of tragedy from russia",
            "title_similarity": "0.45542106",
            "sentiment_compound": -0.3072
        },
        {
            "id": "hym7ypk",
            "score": 6,
            "text": "Smart move. Works positively on every angle. As the title states, both honors and respects the families who lost their own to senseless tragedy, and shows the world the scale of the losses.",
            "title_similarity": "0.57867527",
            "sentiment_compound": 0.3182
        },
        {
            "id": "hym817v",
            "score": 8,
            "text": "They should also find a way to get russian soldiers who don't want to fight out of ukraine.",
            "title_similarity": "0.7069907",
            "sentiment_compound": 0.2411
        },
        {
            "id": "hym8muo",
            "score": 89,
            "text": "The decent thing to do, and it prevents Putin from listing them as MIA forever. The families deserve closure.",
            "title_similarity": "0.55965674",
            "sentiment_compound": -0.3885
        },
        {
            "id": "hym959a",
            "score": 3,
            "text": "Dam brah",
            "title_similarity": "0.014362499",
            "sentiment_compound": 0.0
        },
        {
            "id": "hym9fvh",
            "score": 35,
            "text": "Ukraine is a example of leadership, citizenship, resolve and heart. I’m sad to that it took a war for the world to realize this",
            "title_similarity": "0.5998999",
            "sentiment_compound": -0.0516
        },
        {
            "id": "hym9nty",
            "score": 55,
            "text": "3500 seems like a lot considering this started like 3 days ago",
            "title_similarity": "0.21917303",
            "sentiment_compound": 0.6124
        },
        {
            "id": "hymat5n",
            "score": 4,
            "text": "Call an ambulance. But not for me!",
            "title_similarity": "0.33859476",
            "sentiment_compound": 0.0
        },
        {
            "id": "hymb33t",
            "score": 3,
            "text": "OBVIOUSLY THAT COWARD DICTATOR DOES NOT CARE ABOUT ANYBODY'S LIVES.    HE KNOWS THE IF RUSSIANS KNEW WHAT IS REALLY HAPPENING IN UKRAINE.    HE WOULD HAVE THE RUSSIAN PEOPLE AGAINST HIM.",
            "title_similarity": "0.6121041",
            "sentiment_compound": -0.6836
        },
        {
            "id": "hymb7ll",
            "score": 1,
            "text": "The body count of Russian soldiers is already in the thousands ? Jesus...",
            "title_similarity": "0.5575804",
            "sentiment_compound": 0.0
        },
        {
            "id": "hymbj4r",
            "score": 2,
            "text": "I would like for the whole world to take tourism to Ukraine and help them rebuild their country. Slava Ukraini",
            "title_similarity": "0.70176846",
            "sentiment_compound": 0.6369
        },
        {
            "id": "hymbr8a",
            "score": 2,
            "text": "There are thousands of deaths?",
            "title_similarity": "0.34183776",
            "sentiment_compound": 0.0
        },
        {
            "id": "hymbv2y",
            "score": 1,
            "text": "even when ukraine is being benevolent, they're burning Putin. Ya love to see it!",
            "title_similarity": "0.5571983",
            "sentiment_compound": 0.8478
        },
        {
            "id": "hymc2sz",
            "score": 1,
            "text": "This is what honor looks like",
            "title_similarity": "-0.032738537",
            "sentiment_compound": 0.6908
        },
        {
            "id": "hymc5tf",
            "score": 5,
            "text": "I'm starting to become nervous about what a humiliated Putin would do",
            "title_similarity": "0.36369178",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hymc5x7",
            "score": 2,
            "text": "The irony is as nuanced as it is bad-assed.",
            "title_similarity": "0.10513735",
            "sentiment_compound": -0.0516
        },
        {
            "id": "hymc66p",
            "score": 3,
            "text": "Good. Fight hard and give all you can to preserve your own skin and land, but treat POW and human remains with respect and dignity. Don't lose your humanity in the process, don't let Putin take that away from you as well. This is also in Ukraine's strategical interest, the world is watching and rallying behind you, important to maintain this level of support.",
            "title_similarity": "0.61939186",
            "sentiment_compound": 0.9788
        },
        {
            "id": "hymc6na",
            "score": 2,
            "text": "Wtf??? Thousands already?",
            "title_similarity": "0.18767639",
            "sentiment_compound": -0.6966
        },
        {
            "id": "hymc9aa",
            "score": 4,
            "text": "There's a reason putin sent mobile crematoriums behind the tanks. What a disgrace",
            "title_similarity": "0.6059667",
            "sentiment_compound": -0.4939
        },
        {
            "id": "hymcdtj",
            "score": 2,
            "text": "I’m just curious if Russian people actually believe their state saying Ukrainian cities are simply “surrendering” without casualties.",
            "title_similarity": "0.65606666",
            "sentiment_compound": 0.3182
        },
        {
            "id": "hymcj4t",
            "score": 1,
            "text": "Thousands have died already?  I need to read the article",
            "title_similarity": "0.53003335",
            "sentiment_compound": -0.5574
        },
        {
            "id": "hymck7w",
            "score": 3,
            "text": "\nHey /u/icedpickles,\n\n\nThis is now the top post on reddit. It will be recorded at /r/topofreddit with all the other top posts.",
            "title_similarity": "0.36424202",
            "sentiment_compound": 0.3818
        },
        {
            "id": "hymco6p",
            "score": 3,
            "text": "To me, this almost read as \"Call an ambulance. But not for me!\"",
            "title_similarity": "0.4038753",
            "sentiment_compound": 0.0
        },
        {
            "id": "hymcpot",
            "score": 2,
            "text": "The question is this being reported in Russian-language media?  This could be a huge PR coup for Ukraine, as it shows that even a country fighting for its continued existence is willing to act humanely toward its enemies.",
            "title_similarity": "0.7012379",
            "sentiment_compound": -0.5267
        },
        {
            "id": "hymcz6g",
            "score": 3,
            "text": "Ukraine is literally taking care of their enemies because their leader won’t.\n\nWow. Fuck Putin. May these poor people Rest In Peace - they didn’t want to be there and Ukraine didn’t want to experience this either. Russian President, go fuck yourself.",
            "title_similarity": "0.6960442",
            "sentiment_compound": -0.296
        },
        {
            "id": "hymd31t",
            "score": 2,
            "text": "This brings “Kill them with kindness” a whole new meaning.",
            "title_similarity": "0.35710603",
            "sentiment_compound": 0.0
        },
        {
            "id": "hymd7m3",
            "score": 2,
            "text": "Currently claiming 3500 deceased over 4 days. For scale, total coalition deaths in Iraq since 2003: 4809. Putin is on track for that many in a week.",
            "title_similarity": "0.5106352",
            "sentiment_compound": 0.0
        },
        {
            "id": "hymdbpb",
            "score": 1,
            "text": "It's the right thing to do, which is why it's both awesome, and also damaging for Putin.",
            "title_similarity": "0.28635836",
            "sentiment_compound": 0.2023
        },
        {
            "id": "hymdcer",
            "score": 1,
            "text": "Great, now Russia will be flooded with sunflowers. \n\n*buys more sunflower seed stocks*",
            "title_similarity": "0.49744725",
            "sentiment_compound": 0.6249
        },
        {
            "id": "hymdd5y",
            "score": 2,
            "text": "Ukraine playing entirely by rules of honor while Russia violates every standard of decency is epic.\n\nPutin looks weaker and weaker. Smaller and smaller. He may get his way but I don't think Russia recovers from this for awhile on the global scale.",
            "title_similarity": "0.6166137",
            "sentiment_compound": -0.3716
        },
        {
            "id": "hymdgqu",
            "score": 1,
            "text": "Christ. Poor boys. I’m sad for their loss and for their families. Godspeed to Ukraine however.",
            "title_similarity": "0.5688939",
            "sentiment_compound": -0.8176
        },
        {
            "id": "hymdhlx",
            "score": 1,
            "text": "Kill ‘em with kindness. Makes it hurt even worse.",
            "title_similarity": "0.4028932",
            "sentiment_compound": -0.8481
        },
        {
            "id": "hymdk9c",
            "score": 5,
            "text": "3500 dead russian soldiers so far, that's 875 a day, 319k a year. At this rate russia will beat u.s. vietnam casualties in 67 days.",
            "title_similarity": "0.5778036",
            "sentiment_compound": -0.6486
        },
        {
            "id": "hymdnyi",
            "score": 1,
            "text": "Where's the \"thousands\" from? The article says Ukraine has no numbers.",
            "title_similarity": "0.38016358",
            "sentiment_compound": -0.296
        },
        {
            "id": "hymdpyh",
            "score": 1,
            "text": "Fuck Putin! If this was Zelensky then that man is becoming a bigger hero day after day!",
            "title_similarity": "0.43875226",
            "sentiment_compound": 0.1739
        },
        {
            "id": "hymdu12",
            "score": 1,
            "text": "Putin would not agree. He would hide everything.",
            "title_similarity": "0.4021334",
            "sentiment_compound": -0.4234
        },
        {
            "id": "hymdvbs",
            "score": 2,
            "text": "What incredible integrity in the face of such appalling circumstances.\n\nGenuine question. How would the red cross do this logistically? Would Putin allow this ?",
            "title_similarity": "0.45591",
            "sentiment_compound": 0.3925
        },
        {
            "id": "hyme2ql",
            "score": 5,
            "text": "Yes let the Russian people see and revolt. Off with his fucking head.",
            "title_similarity": "0.53046805",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hyme2ri",
            "score": 7,
            "text": "Its tough to imagine someone who cares so little about human life that they dont have the decency to retrieve their own dead and give them the honours they deserve. That's got to be the lowest form of human, he's a knock-off Mussolini with a tiny cock",
            "title_similarity": "0.44175804",
            "sentiment_compound": -0.4215
        },
        {
            "id": "hyme586",
            "score": 2,
            "text": "Ukraine is winning the PR war.",
            "title_similarity": "0.43693003",
            "sentiment_compound": -0.128
        },
        {
            "id": "hyme6bs",
            "score": 1,
            "text": "I’ve been thinking about this for a few days now.  The way things are going I think that Ukraine will not only hold out but ultimately defeat Russia. It might not be quick but the sheer force of will from not only their army but also their now armed civilians will put a massive drain on the invaders.  Eventually Putin will have to recognise this - he can keep feeding the meat grinder but that’s all he can do - the grinder won’t stop.  \nNow for the plot twist. \nThe way Ukraine are playing this they will break the Russian propaganda machine just enough for people in Russia to get the truth through to them and there will be fury.  So much fury that it ignites.  \nCalling it now.\nAs long as Putin keeps his finger off the nuclear button I think this will lead to a new Russian revolution where we see the Russian population rise up with the backing of a now united Ukraine and Russian break away army to over throw Putin. \nIt would be wild and wouldn’t happen quickly but I genuinely think this path is becoming more possible with every story I hear coming out of there. Putin is digging his own grave.",
            "title_similarity": "0.6960639",
            "sentiment_compound": -0.9452
        },
        {
            "id": "hymeh06",
            "score": 3,
            "text": "Man that number is staggering. People compare this to the US invasion of Iraq or Afghanistan, but these Russian casualty numbers are on pace to absolutely dwarf the entire stay of the US in both countries.\n\nPlease top Russian fuckheads be discussing in the backroom how to oust Putin, restore order. The whole world wants it right now. It would put Xi on notice as well. Do the right thing.",
            "title_similarity": "0.6849085",
            "sentiment_compound": 0.631
        },
        {
            "id": "hymeqrd",
            "score": 1,
            "text": "Did the heavy shelling in the night happen or was it called off? Still see the pictures of people in the bunkers, so it seems the imminent danger ist not yet over.",
            "title_similarity": "0.3919742",
            "sentiment_compound": -0.5267
        },
        {
            "id": "hymevzu",
            "score": 35,
            "text": "Russian old and broken \"we will bury you\".\n\nUkrainian new hotness \"we will help you bury yourself\".",
            "title_similarity": "0.77379906",
            "sentiment_compound": -0.1027
        },
        {
            "id": "hymf0h4",
            "score": 1,
            "text": "Ukraine is Dead Russian Storage. Stop sending your sons for an unjust war. Be ashamed of what you allow your country to do.",
            "title_similarity": "0.7183804",
            "sentiment_compound": -0.9423
        },
        {
            "id": "hymf436",
            "score": 3,
            "text": "Good on ‘em!!! I hope the Red Cross helps out and the true numbers come out, just so the World can see what a TRUE monster Putin is!",
            "title_similarity": "0.5901028",
            "sentiment_compound": 0.9423
        },
        {
            "id": "hymf4u4",
            "score": 1,
            "text": "\"НЕИМЕЕТАНАЛОГОВ\"",
            "title_similarity": "0.18488365",
            "sentiment_compound": 0.0
        },
        {
            "id": "hymf5p8",
            "score": 3,
            "text": "Show dignity, Putin",
            "title_similarity": "0.15932274",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hymf6kf",
            "score": 1,
            "text": "Ukraine has also established hotlines so that Russian families can contact their soldiers taken prisoners and are making available lists of killed Russian soldiers.\nMeanwhile ,Russia has brought a mobile crematorium to evaporate the bodies or their dead and avoid bringing coffins home….",
            "title_similarity": "0.86890876",
            "sentiment_compound": -0.936
        },
        {
            "id": "hymfjj2",
            "score": 2,
            "text": "i feel so bad for the russians who are blinded by the propaganda of putin. so many lives on all sides lost just cause of putin’s action",
            "title_similarity": "0.61430347",
            "sentiment_compound": -0.8312
        },
        {
            "id": "hymfvnh",
            "score": 1,
            "text": "It's absolutely heart sore",
            "title_similarity": "0.10431322",
            "sentiment_compound": 0.4048
        },
        {
            "id": "hymfwcz",
            "score": 3,
            "text": "Ukraine's economy and international status will probably get a huge boost if/when they survive this due to how much mind share they have gained",
            "title_similarity": "0.28621605",
            "sentiment_compound": 0.8316
        },
        {
            "id": "hymfxgv",
            "score": 2,
            "text": "Does Ukraine hand out list of names of killed russian invaders and maybe POWs ?\n\nIf not, may be a good idea to show the russian people who is actually dying here. Names with place of birth is more hitting home than just numbers.",
            "title_similarity": "0.8070059",
            "sentiment_compound": 0.1531
        },
        {
            "id": "hymfy05",
            "score": 4,
            "text": "Ukraine is the adult in the room.",
            "title_similarity": "0.17287879",
            "sentiment_compound": 0.0
        },
        {
            "id": "hymfykk",
            "score": 3,
            "text": "That lady was definitely right about keeping sunflower seeds in their pocket.",
            "title_similarity": "0.20344782",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hymfzva",
            "score": 1,
            "text": "Even when attacked Ukraine being 💯",
            "title_similarity": "0.3920704",
            "sentiment_compound": -0.4588
        },
        {
            "id": "hymg5r9",
            "score": 2,
            "text": "I love the way Ukraine and Ukrainians have been conducting themselves during this ordeal.  Fighting like Hell to protect themselves but maintaining their humanity that Putin is trying to rob from them.",
            "title_similarity": "0.57721746",
            "sentiment_compound": -0.6486
        },
        {
            "id": "hymg9cu",
            "score": 1,
            "text": "Slava Ukraine 🇺🇦…glad I donated to Red Cross",
            "title_similarity": "0.5376655",
            "sentiment_compound": 0.0
        },
        {
            "id": "hymgccr",
            "score": 1,
            "text": "https://youtu.be/EAEKK8xCpBY... real time heroes",
            "title_similarity": "0.18724367",
            "sentiment_compound": 0.5106
        },
        {
            "id": "hymgh0a",
            "score": 2,
            "text": "I do wonder: How do you keep a thousand dead soldiers (or even more...) a secret?\n\nEvery one of them had parents, friends, maybe a husband/wife, maybe children.... Everyone had people that would notice that this soldier didnt return home.",
            "title_similarity": "0.71118915",
            "sentiment_compound": -0.296
        },
        {
            "id": "hymgms5",
            "score": 1,
            "text": "I'll fight",
            "title_similarity": "0.13403451",
            "sentiment_compound": -0.3818
        },
        {
            "id": "hymgolw",
            "score": 1,
            "text": "this is peak chadness limit, and they keep breaking the limit. my most respect to Ukraine",
            "title_similarity": "0.45297956",
            "sentiment_compound": 0.5256
        },
        {
            "id": "hymgpzd",
            "score": 2,
            "text": "Listen to \"What its worth\" song. It is exactly whats going on",
            "title_similarity": "0.14751133",
            "sentiment_compound": 0.2263
        },
        {
            "id": "hymgqyn",
            "score": 4,
            "text": "I have been very impressed with everything Ukraine has done in this war so far",
            "title_similarity": "0.4073901",
            "sentiment_compound": -0.3031
        },
        {
            "id": "hymgt84",
            "score": 2,
            "text": "Even a chart noting confirmed names and perhaps cause (i.e, fighting against, defending against, accident) might help a whole lot for those parents and this doesnt require hands on as much from the outside. Dog tags or docunents can act as confirmation proof.",
            "title_similarity": "0.5181729",
            "sentiment_compound": -0.4404
        },
        {
            "id": "hymgxjx",
            "score": 2,
            "text": "that many Russian soldiers have been killed?",
            "title_similarity": "0.6146176",
            "sentiment_compound": -0.6705
        },
        {
            "id": "hymgyo9",
            "score": 1,
            "text": "I think after his many military adventures it's safe to say Putin is certainly the Butcher of Our Time.",
            "title_similarity": "0.57342786",
            "sentiment_compound": 0.7717
        },
        {
            "id": "hymgyul",
            "score": 2,
            "text": "It was heart wrenching when Ukrainians allowed a soldier to call their family to tell them where they were. They had no idea. Imagine finding out that your son was killed in combat that they didn’t know what going to even happen",
            "title_similarity": "0.74443257",
            "sentiment_compound": -0.5994
        },
        {
            "id": "hymh3fd",
            "score": 1,
            "text": "I Swear Ukrainians are too good for this world... mad respect brothers and sisters. Stay strong and don't let the Russians beat you! :)",
            "title_similarity": "0.60114235",
            "sentiment_compound": 0.8478
        },
        {
            "id": "hymh70u",
            "score": 1,
            "text": "Ukrane has handled this all so well. This war will be studied and made an example of for the rest of human history.\n\nPlease don't stop spreading the message that this is not on the Russian people, this is on Putin and his political puppets.",
            "title_similarity": "0.6714413",
            "sentiment_compound": -0.0066
        },
        {
            "id": "hymhb70",
            "score": 1,
            "text": "super",
            "title_similarity": "-0.11527921",
            "sentiment_compound": 0.5994
        },
        {
            "id": "hymhfg6",
            "score": 1,
            "text": "what? there are already thousands of casualties?",
            "title_similarity": "0.3527521",
            "sentiment_compound": 0.0
        },
        {
            "id": "hymhh60",
            "score": 1,
            "text": "There were some reports of mobile crematoriums, keep an eye open out for that info",
            "title_similarity": "0.30776423",
            "sentiment_compound": 0.0
        },
        {
            "id": "hymhhco",
            "score": 1,
            "text": "Want to help? Join the DOS \nhttps://norussian.tk/",
            "title_similarity": "0.1807011",
            "sentiment_compound": 0.6369
        },
        {
            "id": "hymhllp",
            "score": 3,
            "text": "Hopefully the scale of this conflict will be visible for the Russian population so they can act against their leaders. Putin don't care about loss of soldiers life, but he loves money and power. I bet he cries a little for every plane and tank being destroyed. That hardware is expensive as shit. Those German Stinger missile will come in handy. Slava Ukraini!",
            "title_similarity": "0.6775065",
            "sentiment_compound": -0.8514
        },
        {
            "id": "hymhn6d",
            "score": 4,
            "text": "This country is really impressing me with the way they re handling this. From the president and advisors to the civilians remaining to defend their city.\n\nI am a world away in New Zealand and am really feeling for the citizens of Ukraine. \n\nKia Kaha, \nЗавжди сильний\nForever Strong.",
            "title_similarity": "0.49635568",
            "sentiment_compound": 0.5699
        },
        {
            "id": "hymhoce",
            "score": 2,
            "text": "Good guy Ukraine",
            "title_similarity": "0.12107296",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hymhr60",
            "score": 2,
            "text": "day 1 4chan showed pics of a mobile crematorium. Not sure if propaganda or if real.",
            "title_similarity": "0.44359076",
            "sentiment_compound": -0.0572
        },
        {
            "id": "hymhtcc",
            "score": 5,
            "text": "Bravo to the Ukrainians",
            "title_similarity": "0.2620219",
            "sentiment_compound": 0.0
        },
        {
            "id": "hymhtex",
            "score": 4,
            "text": "Holy shit.  A empathic request And the biggest flex of a threat I’ve ever seen.",
            "title_similarity": "0.19800156",
            "sentiment_compound": -0.7906
        },
        {
            "id": "hymhxzz",
            "score": 4,
            "text": "Fuck Putin!",
            "title_similarity": "0.25152174",
            "sentiment_compound": -0.5848
        },
        {
            "id": "hymi4k9",
            "score": 3,
            "text": "I hope they put sunflower seeds in their pockets before handing them over.",
            "title_similarity": "0.3842073",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hymickl",
            "score": 3,
            "text": "All I gotta say is. if Russia didn’t throw a fucking fit over Ukraine nun of this would have happened",
            "title_similarity": "0.56062496",
            "sentiment_compound": 0.4201
        },
        {
            "id": "hymih7q",
            "score": 5,
            "text": "Reading this gave me goosebumps",
            "title_similarity": "0.17888857",
            "sentiment_compound": 0.0
        },
        {
            "id": "hymit97",
            "score": 8,
            "text": "According to 4 day fighte reports, there are about  6000 dead Russian soldiers on Ukrainian territory,  so that's important to repatriate them.",
            "title_similarity": "0.79030377",
            "sentiment_compound": -0.4976
        },
        {
            "id": "hymix5f",
            "score": 3,
            "text": "What confuses me about Russia's plan is how incinerating the bodies of soldiers hides them. Yes in the short term you can deny that you've suffered losses, but after a while families all over Russia will start wondering why their sons and brothers aren't coming home from the army. What's the end game?",
            "title_similarity": "0.8042995",
            "sentiment_compound": -0.5859
        },
        {
            "id": "hymizmm",
            "score": 4,
            "text": "Really goes to show just how weak of a man Putin is. Russia walks in to their home, killing their people and destroying and occupying their lands, yet Ukraine still has the humanity to send the bodies of these young men home, instead of leaving them on foreign soil.",
            "title_similarity": "0.7698573",
            "sentiment_compound": -0.8979
        },
        {
            "id": "hymj0ye",
            "score": 2,
            "text": "This is the way.",
            "title_similarity": "-0.13251673",
            "sentiment_compound": 0.0
        },
        {
            "id": "hymj2zf",
            "score": 3,
            "text": "Russia needs to see what Putin has done to their sons and daughters.",
            "title_similarity": "0.72035384",
            "sentiment_compound": 0.0
        },
        {
            "id": "hymj3ti",
            "score": 2,
            "text": "This guy is a legend!",
            "title_similarity": "0.037644207",
            "sentiment_compound": 0.0
        },
        {
            "id": "hymj4k5",
            "score": 1,
            "text": "Wow. Just wow.",
            "title_similarity": "-0.17068103",
            "sentiment_compound": 0.8225
        },
        {
            "id": "hymj4x8",
            "score": 2,
            "text": "I hope zelensky will called as brave leader after all this War.",
            "title_similarity": "0.5772153",
            "sentiment_compound": 0.1717
        },
        {
            "id": "hymj6zz",
            "score": 2,
            "text": "Are we already up to thousands, or is he just calling his shot?",
            "title_similarity": "0.28006843",
            "sentiment_compound": 0.0
        },
        {
            "id": "hymj8eo",
            "score": 2,
            "text": "If this goes much further Putin will end up starving his civilians as well",
            "title_similarity": "0.5574583",
            "sentiment_compound": -0.1779
        },
        {
            "id": "hymj9ab",
            "score": 2,
            "text": "Wait, what happened?  Did Russia just get Hammer & Anvil'd?",
            "title_similarity": "0.5487035",
            "sentiment_compound": 0.0
        },
        {
            "id": "hymjchy",
            "score": 4,
            "text": "First and foremost, I would like us all to recognize that many of these fallen soldiers are just like you and me. They did not enlist to stir chaos; rather defend their territory with honor. They were betrayed and lied to about their placement in Ukraine.   \n\n\nThere is a common Ukrainian phrase: \"Cantzei Phitzes.\" (Sorry for my poor Anglican-phonetic interpretation.) As in, I Cantzei Phitzes bouls enmouten.",
            "title_similarity": "0.7028487",
            "sentiment_compound": -0.8402
        },
        {
            "id": "hymjcz0",
            "score": 5,
            "text": "Young -> conscripted -> lied that you're going to exercise -> throwed into war -> died young.",
            "title_similarity": "0.5526322",
            "sentiment_compound": -0.8779
        },
        {
            "id": "hymje71",
            "score": 1,
            "text": "Dang",
            "title_similarity": "-0.12853554",
            "sentiment_compound": 0.0
        },
        {
            "id": "hymjeln",
            "score": 3,
            "text": "What a fucking flex",
            "title_similarity": "-0.11612441",
            "sentiment_compound": 0.0
        },
        {
            "id": "hymjim8",
            "score": 2,
            "text": "Is there a war graph with casualties like there was for Covid19 & cases?\n\nLike arcgis. Com?",
            "title_similarity": "0.54657805",
            "sentiment_compound": 0.1179
        },
        {
            "id": "hymjnv1",
            "score": 1,
            "text": "Does redcross do body collection during active warzones?",
            "title_similarity": "0.5595648",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hymjpj3",
            "score": 2,
            "text": "We should make an exception and let Aeroflot cargo deliver that pile of bodies directly to Moscow.",
            "title_similarity": "0.6783563",
            "sentiment_compound": 0.0
        },
        {
            "id": "hymjsoz",
            "score": 3,
            "text": "Ukrainians are true sweats and currently have a 17.5 KDR \nRussia are complete bots coming in with an embarrassing 0.05 KDR",
            "title_similarity": "0.47136188",
            "sentiment_compound": 0.0516
        },
        {
            "id": "hymjyqf",
            "score": 3,
            "text": "As the days roll on my love and admiration for the Ukrainian people grows.\n\nStay safe guys the asshole will retreat soon",
            "title_similarity": "0.4442059",
            "sentiment_compound": 0.9081
        },
        {
            "id": "hymk4of",
            "score": 2,
            "text": "Poor people. They are killed for nothing. Putin sent them to Ukraine and killed them.",
            "title_similarity": "0.60558105",
            "sentiment_compound": -0.9201
        },
        {
            "id": "hymk588",
            "score": 3,
            "text": "They should start broadcasting the names of the fallen Russian soldiers.\n\nIt would make it that much more undeniable to those who knew them back home.",
            "title_similarity": "0.80004907",
            "sentiment_compound": -0.3612
        },
        {
            "id": "hymkk1j",
            "score": 1,
            "text": "The Russian people are so important in stopping this war and Putin. They need to be able to see as much as possible what is being done in their country's name to a neighbour that Russians overwhelmingly do not consider their enemy. Only when they've seen what's going on might they protest and right back in large enough numbers to completely overwhelm their government.",
            "title_similarity": "0.7047825",
            "sentiment_compound": -0.6971
        },
        {
            "id": "hymkngt",
            "score": 3,
            "text": "How embarrassing that Ukraine is treating the russian' corpses way better than Putin lapdog generals who don't care about them being send to get butchered for the wolves to stop by in the night",
            "title_similarity": "0.6574327",
            "sentiment_compound": -0.5466
        },
        {
            "id": "hymkque",
            "score": 3,
            "text": "3500 dead Russian soldiers already? Apparently it took 15 years for that number of western coalition deaths in Afghanistan\n\nhttps://www.statista.com/statistics/262894/western-coalition-soldiers-killed-in-afghanistan/",
            "title_similarity": "0.67045367",
            "sentiment_compound": -0.6124
        },
        {
            "id": "hymkqze",
            "score": 1,
            "text": "This is so depressing",
            "title_similarity": "0.013194305",
            "sentiment_compound": -0.5214
        },
        {
            "id": "hymkx48",
            "score": 2,
            "text": "I hope the mobile crematoriums are not being used. I hope they can disable those monstrosities",
            "title_similarity": "0.56828046",
            "sentiment_compound": 0.7003
        },
        {
            "id": "hymkx5n",
            "score": 2,
            "text": "Is this r/humansbeingbros?",
            "title_similarity": "0.06686217",
            "sentiment_compound": 0.0
        },
        {
            "id": "hymkzct",
            "score": 1,
            "text": "*sad Sunflower Babushka noises*",
            "title_similarity": "0.28526288",
            "sentiment_compound": -0.4767
        },
        {
            "id": "hyml5oy",
            "score": 3,
            "text": "For perspective, that 3500 dead Russians they're claiming is about the number of Americans that died in Afghanistan in the last 20 years.",
            "title_similarity": "0.6293831",
            "sentiment_compound": -0.8225
        },
        {
            "id": "hyml9db",
            "score": 1,
            "text": "Give their Parents safe passage and free Accommodation so that they can identify and pick up their sons. because once the body is in Russian soil Putin can do whatever he wants with it even if the Red Cross is in charge. I can assure you once those bodies where transferred to Russia no one will see those bodies yes even their parents. it will be straight to mass grave.",
            "title_similarity": "0.82247883",
            "sentiment_compound": 0.8126
        },
        {
            "id": "hymlnc8",
            "score": 3,
            "text": "Fuck Putin. Glory to Ukraine 🇺🇦🇺🇦 🇺🇦",
            "title_similarity": "0.45310497",
            "sentiment_compound": 0.0
        },
        {
            "id": "hymlqk0",
            "score": 1,
            "text": "Ukraine is definitely victorious and the red and black reaction will be the main loser in this war ....",
            "title_similarity": "0.52079004",
            "sentiment_compound": -0.6808
        },
        {
            "id": "hymlwld",
            "score": 3,
            "text": "I mean the other option is going full blown Vlad the Impaler",
            "title_similarity": "0.39112088",
            "sentiment_compound": 0.0
        },
        {
            "id": "hymm24l",
            "score": 2,
            "text": "If Presidents fought wars instead of their young men, we should have seen Putin vs Zelensky one on one.\n\nBut no, Putin is another bunker boy.",
            "title_similarity": "0.5814204",
            "sentiment_compound": -0.4497
        },
        {
            "id": "hymm2rw",
            "score": 1,
            "text": "[For Ukraine](https://youtu.be/j7OEI-KpvpA)",
            "title_similarity": "0.38676804",
            "sentiment_compound": 0.0
        },
        {
            "id": "hymm6wp",
            "score": 3,
            "text": "Let the Russian public see the bodies coming in boxes and realize what Putin is actually about.",
            "title_similarity": "0.71964127",
            "sentiment_compound": 0.0
        },
        {
            "id": "hymmlh0",
            "score": 3,
            "text": "Man, Ukraine is really becoming the darling of the world and it’s very very richly deserved",
            "title_similarity": "0.32158566",
            "sentiment_compound": 0.8193
        },
        {
            "id": "hymmqfu",
            "score": 1,
            "text": "Breaking News: Red Cross labelled a “foreign agent neo-nazi satanist pro-western techno-flamenco” organisation by Russia officials or some shit…",
            "title_similarity": "0.6126044",
            "sentiment_compound": 0.0
        },
        {
            "id": "hymmxjc",
            "score": 2,
            "text": "Good for Ukraine!!! Even with all this they want the families of the soldiers to be able to be laid to rest respectfully... Every day I'm more and more proud to have had my family come from Kyiv in the early 1900s.",
            "title_similarity": "0.6291928",
            "sentiment_compound": 0.8868
        },
        {
            "id": "hymn04q",
            "score": 2,
            "text": "Man Ukraine is so humane in all of this, I would trebuchet them across the border",
            "title_similarity": "0.47971198",
            "sentiment_compound": 0.0
        },
        {
            "id": "hymng1e",
            "score": 2,
            "text": "Doing the right thing is good for it’s own sake, it makes you friends, and it prevents many tragedies from even occurring. Putin’s philosophy was wrong from the start. His end goals were never going to be accomplished by him, but now he’s proven once and for all that not only will he not raise Russia to greatness, but he’s actively set them back by at least a generation. He has completely failed.\n\nThe only way Russia will ever be great is by joining with the West and being a good neighbor. It’ll take time and work, but Putin needs to go. They need a whole new view of the world and their place in it. Luckily there are a lot of civilians who recognize this.\n\nHopefully Putin doesn’t launch the nukes once he realizes all of his hopes are lost and he’ll be remembered as an even less competent Hitler.",
            "title_similarity": "0.5895623",
            "sentiment_compound": 0.9704
        },
        {
            "id": "hymnjpz",
            "score": 1,
            "text": "I hope for dramatic irony – that one day Russia becomes a democracy and joins NATO.",
            "title_similarity": "0.5697578",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hymno4p",
            "score": 2,
            "text": "Stalin's famine in Ukraine was so bad, soldiers had to guard cemeteries to stop people digging up bodies to eat. I kid you not.",
            "title_similarity": "0.69239044",
            "sentiment_compound": -0.7712
        },
        {
            "id": "hymnq9h",
            "score": 2,
            "text": "I think burying them in Ukraine would be more dignifying for those soldiers, Putin would just dump them at sea.",
            "title_similarity": "0.700664",
            "sentiment_compound": 0.2006
        },
        {
            "id": "hymo0r2",
            "score": 4,
            "text": "Does Putin seriously think he can defeat a looming guerilla war in Ukraine? Didn't the fiasco in Afghanistan teach the Russians anything? Obviously not. Tens of thousands of resistance fighters with high grade weapons delivered from the West will grind the occupying force down.",
            "title_similarity": "0.71788454",
            "sentiment_compound": -0.8707
        },
        {
            "id": "hymopvf",
            "score": 2,
            "text": "As much as I support this, I think the russian families who support this war should have to pay for the transport costs.",
            "title_similarity": "0.70612967",
            "sentiment_compound": -0.1593
        },
        {
            "id": "hymoxb8",
            "score": 1,
            "text": "Only those who have truly suffered will react to tragedy by trying to minimize the suffering, because they know what it feels like. I do not wish the feeling on anybody, but after knowing true despair, its a natural reaction to not fight fire with fire, and to minimize the horrible atrocities commited, instead of responding with their own. Some of the smartest people I have ever met can't wrap their head around this. You aren't born a compassionate comrade, youre forged into one by the horrors of your past. How the fuck did we end up here again with all the history lessons we have exemplifying what not to do.",
            "title_similarity": "0.5490109",
            "sentiment_compound": -0.9047
        },
        {
            "id": "hymozqy",
            "score": 3,
            "text": "If anything this crisis make Ukraine and the Ukrainian poeple looks strong and brave. I ll be honnest at first I thougth it would be a one sided War but the more time passes the less i see russia Bein able to  win this war. Good job Ukraine !!!!",
            "title_similarity": "0.5712979",
            "sentiment_compound": 0.4104
        },
        {
            "id": "hymp5wx",
            "score": 1,
            "text": "Fuck that site's \"oh you didn't actually mean to click the back button\" bullshit.",
            "title_similarity": "0.30135268",
            "sentiment_compound": -0.8074
        },
        {
            "id": "hymp8qm",
            "score": 1,
            "text": "Ya and Putin does not wanna fuck with the Red Cross.",
            "title_similarity": "0.44258994",
            "sentiment_compound": 0.431
        },
        {
            "id": "hympclt",
            "score": 1,
            "text": "And send them with sunflower seeds!",
            "title_similarity": "0.16321549",
            "sentiment_compound": 0.0
        },
        {
            "id": "hymqy6z",
            "score": 1,
            "text": "What is the scale of tragedy in Ukraine? Can’t seem to find anything on that",
            "title_similarity": "0.3777226",
            "sentiment_compound": -0.6597
        },
        {
            "id": "hymrmop",
            "score": 1,
            "text": "Try to deny Putin the opportunity of claiming credit for it, if you can.  Send them back with notes or something.",
            "title_similarity": "0.52788126",
            "sentiment_compound": 0.4588
        },
        {
            "id": "hymrqzx",
            "score": 2,
            "text": "It's shocking just how skewed the casualties are here. From numbers I've seen its roughly 10x worse for the Russians.",
            "title_similarity": "0.4200945",
            "sentiment_compound": -0.7003
        },
        {
            "id": "hymrujy",
            "score": 2,
            "text": "You mean the mobile crematoria weren't up to the task?",
            "title_similarity": "0.2955717",
            "sentiment_compound": 0.0
        },
        {
            "id": "hymrxkw",
            "score": 5,
            "text": "Apparently Putin has a portable crematorium just so body bags won't be seen back in Russia.",
            "title_similarity": "0.6932262",
            "sentiment_compound": 0.0
        },
        {
            "id": "hymt2iu",
            "score": 6,
            "text": "For a former comedian, this guy sure has a knack for asymmetrical warfare.",
            "title_similarity": "0.24034515",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hymt3f2",
            "score": 3,
            "text": "They should also let POWs to contact their families and friends.",
            "title_similarity": "0.505116",
            "sentiment_compound": 0.4767
        },
        {
            "id": "hymte7e",
            "score": 8,
            "text": "More and more this unhinged invasion sounds to me like a small handful of humanitarians fighting against the evil forces of Mordor.",
            "title_similarity": "0.5108938",
            "sentiment_compound": -0.6597
        },
        {
            "id": "hymtkpb",
            "score": 5,
            "text": "That’s a gangsta AF thing to say and do. Tite.",
            "title_similarity": "0.20868605",
            "sentiment_compound": 0.0
        },
        {
            "id": "hymupp6",
            "score": 1,
            "text": "Classy. Dignified. \n\nSmart.",
            "title_similarity": "-0.11438881",
            "sentiment_compound": 0.8316
        },
        {
            "id": "hymux1w",
            "score": 4,
            "text": "The Russian population needs to see the tragedy and rise up. There are rumors of mobile crematoriums.",
            "title_similarity": "0.7141223",
            "sentiment_compound": -0.6597
        },
        {
            "id": "hymv4x7",
            "score": 2,
            "text": "Those portable crematoriums not getting used then.",
            "title_similarity": "0.3059736",
            "sentiment_compound": 0.0
        },
        {
            "id": "hymvt4t",
            "score": 2,
            "text": "Putin: put boys in soldier toaster",
            "title_similarity": "0.4513412",
            "sentiment_compound": 0.0
        },
        {
            "id": "hymvyns",
            "score": 2,
            "text": "Red cross, impartiality is one of the core principles that get the org into places others cannot. Using the red cross as a pawn can harm it's abilities to provide humanitarian help all in need.... Personally though, I'm not impartial, count every one and remind  Russians of their complicity by reminding them of the price of silence, and leaving a tyrant to run free",
            "title_similarity": "0.64688987",
            "sentiment_compound": 0.5423
        },
        {
            "id": "hymwakf",
            "score": 2,
            "text": "Big brain move here",
            "title_similarity": "-0.027717466",
            "sentiment_compound": 0.0
        },
        {
            "id": "hymwlny",
            "score": 7,
            "text": "Ukraine is doing an amazing job handling everything, given the circumstances! Very admirable.",
            "title_similarity": "0.22767194",
            "sentiment_compound": 0.8395
        },
        {
            "id": "hymwn39",
            "score": 5,
            "text": "Putin and his regime deserve the Mussolini treatment. Let’s hope that happens sooner than later.",
            "title_similarity": "0.3973782",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hymwu6j",
            "score": 2,
            "text": "That’s sad :\\",
            "title_similarity": "0.056782108",
            "sentiment_compound": -0.6597
        },
        {
            "id": "hymx03g",
            "score": 3,
            "text": "Yes. Let their mothers have that at least.",
            "title_similarity": "0.25381625",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hymxu33",
            "score": 2,
            "text": "Thousands already? Fuck",
            "title_similarity": "0.14631599",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hymxyhf",
            "score": 3,
            "text": "No matter what idiotic and unjust war Russia get itself into before, they would ship their dead soldiers back home for proper burial. Afghanistan, Chechnya, Georgia...\n\nMilitary may be one of the strongest supporters of Putin, but, and perhaps it's the unspoken code of the military: the soldier deserves to be buried in their homeland, with the proper amenities. An officer who'd make a call to abandon / conceal the body would be facing a moral dilemma of whether they should follow their direct order, or whether those orders are in violation with the army code. I would imagine that at least some officers would, given such a choice disobey orders, as, in principle, they would view themselves as serving a higher purpose than the government. But then... who knows... on the other hand, Russian army, more than anything is based on fear, so it would be a hard choice to make.",
            "title_similarity": "0.82592666",
            "sentiment_compound": -0.9476
        },
        {
            "id": "hymy1h6",
            "score": 3,
            "text": "If the Ukraine wanted to be super brutal they could make a public site with the photos of corpses so that Russian families could look for their loved ones that don't come back.\n\nIt's not something I'd be for, but if it really rattles Putin's cage then I'd say it's fair in this conflict.",
            "title_similarity": "0.7645656",
            "sentiment_compound": 0.3291
        },
        {
            "id": "hymy1je",
            "score": 2,
            "text": "Otherwise the next time Russia invades it'll be \"that's Russian blood in the soil so it's our soil\"",
            "title_similarity": "0.6995452",
            "sentiment_compound": 0.0
        },
        {
            "id": "hymy7qz",
            "score": 6,
            "text": "I hope the Red Cross publish the death toll, so the world can see just how much blood is on Putin’s hands.",
            "title_similarity": "0.7575159",
            "sentiment_compound": -0.25
        },
        {
            "id": "hymyw8v",
            "score": 2,
            "text": "Wonder how long it would take for war crimes to be committed by the Russians against any red cross personnel attempting such a thing.",
            "title_similarity": "0.705487",
            "sentiment_compound": -0.4215
        },
        {
            "id": "hymz03j",
            "score": 5,
            "text": "Independent body to keep score.  Let everyone know they didn’t go quietly. Damn.",
            "title_similarity": "0.2605583",
            "sentiment_compound": -0.4019
        },
        {
            "id": "hymze07",
            "score": 3,
            "text": "May Ukraine come out of this.    There are good people led by Uber-Heroic Man.",
            "title_similarity": "0.33730844",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hymzf65",
            "score": 5,
            "text": "many russian parents and family members don't even know their children are dead in dirt.",
            "title_similarity": "0.6978502",
            "sentiment_compound": -0.7717
        },
        {
            "id": "hyn0247",
            "score": 3,
            "text": "That lady with the sunflower seeds is gonna be pissed about this.",
            "title_similarity": "0.32734457",
            "sentiment_compound": -0.6369
        },
        {
            "id": "hyn03bv",
            "score": 2,
            "text": "Пожалуйста, окажите финансовую помощ украинскому народу и украинской армии. Здесь ссылка на счета национального банка Украины. Спасибо!\r  \nPlease provide financial assistance to the Ukrainian people and the Ukrainian army. Here is a link to the accounts of the National Bank of Ukraine. Thanks!\r  \nhttps://bank.gov.ua/ua/news/all/natsionalniy-bank-vidkriv-spetsrahunok-dlya-zboru-koshtiv-na-potrebi-armiyi",
            "title_similarity": "0.55725205",
            "sentiment_compound": 0.6988
        },
        {
            "id": "hyn0keq",
            "score": 8,
            "text": "They should set up a service, reading the names of the deceased on a radio band that reach across Russia.",
            "title_similarity": "0.71902514",
            "sentiment_compound": 0.0258
        },
        {
            "id": "hyn0n03",
            "score": 3,
            "text": "Why is nobody talking about the fact that Orthodox Christians are not allowed to be cremated. The best thing Ukraine can do is send home the bodies so they can have a proper funeral.",
            "title_similarity": "0.7469398",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hyn0qei",
            "score": 1,
            "text": "Official Community below\n\nr/PresidentZelenskyy",
            "title_similarity": "0.25269106",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyn1j48",
            "score": 5,
            "text": "Remember this war is Vlademir Putin vs Ukraine  the people of Russia is under a dictatorship.",
            "title_similarity": "0.5879904",
            "sentiment_compound": -0.5994
        },
        {
            "id": "hyn22gt",
            "score": 8,
            "text": "[deleted]",
            "title_similarity": "0.08711866"
        },
        {
            "id": "hyn22pc",
            "score": 5,
            "text": "showing mercy and love to an aggressive enemy blinded by misinformation, now that is a free country",
            "title_similarity": "0.33455843",
            "sentiment_compound": 0.5574
        },
        {
            "id": "hyn23zp",
            "score": 2,
            "text": "Wait, it's already into the thousands of casualties for Russia? Fuck me.",
            "title_similarity": "0.65418065",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hyn34mt",
            "score": 3,
            "text": "Holy hell. I thought the \"thousands\" was just hyperbole or posturing, but if [this Miami Herald article is even remotely accurate,](https://amp.miamiherald.com/news/nation-world/world/article258819393.html) the number is staggering. \n\nAs a disclaimer, this is just the closest thing I could find to actual numbers from a cursory Google search. If Miami Herald is a shitty source or if there's a more accurate count available, I'll gladly change my link.",
            "title_similarity": "0.4576391",
            "sentiment_compound": -0.631
        },
        {
            "id": "hyn3chz",
            "score": 2,
            "text": "Gotta get to them before the mobile crematoriums though …",
            "title_similarity": "0.45414883",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyn3cm3",
            "score": 3,
            "text": "Wow, respect to Ukraine for this. They just make me like them more and more honestly",
            "title_similarity": "0.2995308",
            "sentiment_compound": 0.9179
        },
        {
            "id": "hyn3fqv",
            "score": 3,
            "text": "Do any IT developers know of a way to bring the amount of Ukrainian and Russian deaths to the public, in such a way that it is not able to be completely censored by the Russian government? Relatives of deceased soldiers should be able to have their voice heard, both from a humanitarian perspective, as well as from a strategic one. Each fallen soldier will gradually turn the Russian people (god bless them) against the ruling party.",
            "title_similarity": "0.83921075",
            "sentiment_compound": 0.6494
        },
        {
            "id": "hyn4pcl",
            "score": 1,
            "text": "Fuckityfuck",
            "title_similarity": "0.007202099",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyn4x2d",
            "score": 3,
            "text": "They should blow up the Russian cremation trucks then,\nbecause they are built for the purpose of hiding dead soldiers. I would not be surprised if they aren't even keeping records of who got cremated.",
            "title_similarity": "0.77082026",
            "sentiment_compound": -0.8001
        },
        {
            "id": "hyn5npm",
            "score": 6,
            "text": "Genius move by Zelensky.  This gives an independent 3rd party confirmation of the Russian body count.  It also shows Russia that they are losing their sons by the thousands, not the cake walk Pudding Pop says it is. \n\nMy autocorrect keeps changing Putin to Pudding.  From now on I’ll be referring to Russia’s prez as Pudding Pop.  Thank you Siri.",
            "title_similarity": "0.6932088",
            "sentiment_compound": 0.3818
        },
        {
            "id": "hyn5tb7",
            "score": 1,
            "text": "I didn’t know so many have been killed.",
            "title_similarity": "0.37528822",
            "sentiment_compound": -0.6705
        },
        {
            "id": "hyn6dah",
            "score": 3,
            "text": "Danm, Ukraine is dealing with this awesomely.",
            "title_similarity": "0.2387359",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyn720a",
            "score": 3,
            "text": "I have the highest amount of respect for not only how amazingly well the Ukrainians have handled this, but how respectful they’re. What an amazing country! I hope when this is all over, the world can repay them and their economy. We will deprive Russia and reward Ukraine!!!",
            "title_similarity": "0.5565822",
            "sentiment_compound": 0.9631
        },
        {
            "id": "hyn7dqk",
            "score": 6,
            "text": "1. If the bodies can be identified, Ukraine should post list of everyone killed on servers that Russians can access.\n2. Those who cannot be identified, post whatever identifiers there are: height, weight, hair color, eye color, identifying marks etc. \n\nPutin will have a hard time pretending that Russia is not at war when actual names of the dead are made public.",
            "title_similarity": "0.81333184",
            "sentiment_compound": -0.7687
        },
        {
            "id": "hyn7oe7",
            "score": 6,
            "text": "How to unambiguously be the good guys.",
            "title_similarity": "0.10530905",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hyn83gq",
            "score": 7,
            "text": "I hope they don't forget to send the bodies back with Sunflower seed's",
            "title_similarity": "0.42761713",
            "sentiment_compound": 0.5523
        },
        {
            "id": "hyn99c5",
            "score": 6,
            "text": "Ukraine needs to publish good detailed photos of the dead's faces, on both sides, so that relatives can see and grieve, and so the world can see.",
            "title_similarity": "0.773937",
            "sentiment_compound": 0.0772
        },
        {
            "id": "hyn9w7w",
            "score": 2,
            "text": "Heartwarming numbers.",
            "title_similarity": "-0.051859878",
            "sentiment_compound": 0.4767
        },
        {
            "id": "hyna38k",
            "score": 4,
            "text": "Mid 50's Russian coworker once told me that Russia sends back bodies of soldiers in locked cases that families are not allowed to/can't open. This is because the cases usually have 5 random limbs tossed into it and more often than not none of those limbs belonged to the soldier named on the box. \nCan't verify this though so take that for what you will.",
            "title_similarity": "0.7065736",
            "sentiment_compound": 0.0
        },
        {
            "id": "hynax2c",
            "score": 2,
            "text": "*Thousands*? Are there over a thousand dead Russian soldiers already?",
            "title_similarity": "0.64076775",
            "sentiment_compound": -0.6868
        },
        {
            "id": "hynbkcc",
            "score": 4,
            "text": "Bro this fucking Zelenskyy guy is a real one",
            "title_similarity": "0.06663704",
            "sentiment_compound": 0.0
        },
        {
            "id": "hynd0zm",
            "score": 5,
            "text": "In WW2 my grandfather was an MP in Florida where German POWs were kept. They were pretty well treated…he befriended a young man and our family helped theirs. Later they sent a daughter to be a foreign exchange student. Our families are friends still to this day.",
            "title_similarity": "0.49977696",
            "sentiment_compound": 0.8126
        },
        {
            "id": "hyne4s5",
            "score": 3,
            "text": "I feel like Ukraine is just kinda roasting Russia right now.",
            "title_similarity": "0.5327347",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hynejq1",
            "score": 2,
            "text": "What’s the current confirmed casualty count?",
            "title_similarity": "0.28249568",
            "sentiment_compound": -0.5267
        },
        {
            "id": "hyneqdu",
            "score": 3,
            "text": "Man they are just out savvy'ing Putin at ever turn.",
            "title_similarity": "0.43965986",
            "sentiment_compound": 0.0
        },
        {
            "id": "hynf7gp",
            "score": 7,
            "text": "Meanwhile Russia has crematorium trucks on the front line to get rid of \"evidence\".\n\nPutin is an evil psychopath. Average Russians deserve better.",
            "title_similarity": "0.7022786",
            "sentiment_compound": -0.3612
        },
        {
            "id": "hyngcf0",
            "score": 3,
            "text": "If anything this is the biggest FUCK YOU to Putin yet",
            "title_similarity": "0.3144232",
            "sentiment_compound": -0.6408
        },
        {
            "id": "hynjhyu",
            "score": 2,
            "text": "Big dick energy right here.",
            "title_similarity": "-0.03056647",
            "sentiment_compound": -0.296
        },
        {
            "id": "hynltgl",
            "score": 2,
            "text": "Treating the fallen with dignity, even the enemy, is an amazing thing. It further sends the message back to the Russian people that this fight is not with them but with Putin",
            "title_similarity": "0.6564571",
            "sentiment_compound": -0.1901
        },
        {
            "id": "hynnxtu",
            "score": 1,
            "text": "I seriously just want to cry. It’s been a 9/11’s worth of dead boys in just a handful of days. \n  \nAnd I can’t help but feel Putin is doing this on purpose to drag support out of the majority of Russia.",
            "title_similarity": "0.74068063",
            "sentiment_compound": -0.1027
        },
        {
            "id": "hyno2lx",
            "score": 5,
            "text": "Ukraine has been incredibly strong through all of this, and are very empathetic knowing that many of these Russian soldiers do not want to be fighting or invading. They are going to war and dying because of one madman's wish. \n\nMy respect for president Zelenskyy grows every single day. Every day he has a chance to flee and be safe. But he does not. He stands on the front lines with his people and refuses to leave them, while still finding empathy in his heart to make sure the dead of the ENEMY are respected and returned home. Not many people would do that, let alone ALL of what he has done. He has never faltered, and has stood with his people from the beginning. \n\nI am quite sure this has had an incredibly positive influence on the Ukrainian people. Knowing their leader will live and die by their side to defend them. Zelenskyy has all of my respect and I wish I could buy him a drink when this whole thing is over. But for now, I can only hope and pray that he makes it through this conflict safely.",
            "title_similarity": "0.71264935",
            "sentiment_compound": 0.9697
        },
        {
            "id": "hyno49z",
            "score": 2,
            "text": "It is a very respectable humanitarian gesture!",
            "title_similarity": "0.020758651",
            "sentiment_compound": 0.54
        },
        {
            "id": "hynp96r",
            "score": 1,
            "text": "Yeah! Don't let him hide anything at all!",
            "title_similarity": "0.09325462",
            "sentiment_compound": 0.5109
        },
        {
            "id": "hynq9yf",
            "score": 1,
            "text": "The most beautiful and smart thing. WOW. I am blown away at Ukraine and how amazing their leadership is.",
            "title_similarity": "0.2039925",
            "sentiment_compound": 0.9476
        },
        {
            "id": "hyntsr3",
            "score": 1,
            "text": "At times like this you just cannot trust any news",
            "title_similarity": "0.11635579",
            "sentiment_compound": -0.0521
        },
        {
            "id": "hynua54",
            "score": 3,
            "text": "Put the seeds in their pockets first.",
            "title_similarity": "0.23919395",
            "sentiment_compound": 0.0
        },
        {
            "id": "hynugw3",
            "score": 1,
            "text": "Somebody call an ambluance! But not for me!",
            "title_similarity": "0.19400366",
            "sentiment_compound": 0.0
        },
        {
            "id": "hynvmig",
            "score": 1,
            "text": "Jesus fucking christ they werent lying when they said they had killed thousands then",
            "title_similarity": "0.4826264",
            "sentiment_compound": -0.4067
        },
        {
            "id": "hynxyq8",
            "score": 1,
            "text": "1000s of Russian soldiers are really dead? Or I'm gullible.",
            "title_similarity": "0.6378852",
            "sentiment_compound": -0.796
        },
        {
            "id": "hynyndb",
            "score": 1,
            "text": "Even inflating a shitload of fake tanks is genius",
            "title_similarity": "0.2558164",
            "sentiment_compound": -0.4767
        },
        {
            "id": "hyo0snb",
            "score": 2,
            "text": "Please excuse my ignorance, I know nothing about military operations & such. \n\nWhat usually happens to the bodies of soldiers that are left on the battle field. What's the protocol? Who picks them up & transports the remains to the home country, if like in this case, Russia is denying that these casualties even exist.  Under normal circumstances, what is supposed to happen?",
            "title_similarity": "0.7228289",
            "sentiment_compound": -0.4137
        },
        {
            "id": "hyo1xnc",
            "score": 2,
            "text": "Irony of these stories coming from the Times of Israel. A known disseminator of false narratives.  Interestingly there are no offical numbers.  \n\nSanctions for Israel next.",
            "title_similarity": "0.2834425",
            "sentiment_compound": 0.0772
        },
        {
            "id": "hyo2gcm",
            "score": 2,
            "text": "Stack them up on the border with a sign saying ‘Lost Property’.",
            "title_similarity": "0.5052564",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyo3dkh",
            "score": 2,
            "text": "They should compile the list and share it with Russians.",
            "title_similarity": "0.6002241",
            "sentiment_compound": 0.296
        },
        {
            "id": "hyo6ac2",
            "score": 2,
            "text": "Fuck Fox news",
            "title_similarity": "0.19462939",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hyo7lvn",
            "score": 1,
            "text": "\"Call a~~n ambulance~~ coroner...but not for me!\"",
            "title_similarity": "0.49351296",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyo9qee",
            "score": 1,
            "text": "Killing Russians with kindness",
            "title_similarity": "0.577712",
            "sentiment_compound": -0.34
        },
        {
            "id": "hyoaicb",
            "score": 1,
            "text": "There's got to be a \"July plot: situation headed Putins way.  There are Russians that want peace and freedom.",
            "title_similarity": "0.5866059",
            "sentiment_compound": 0.8402
        },
        {
            "id": "hyol6oc",
            "score": 1,
            "text": "Ukraine showing Respect to the fallen. \nMany mothers in Russia have no clue their sons are in Ukraine because of the Putin propaganda machine.",
            "title_similarity": "0.79459786",
            "sentiment_compound": -0.3818
        },
        {
            "id": "hyomczt",
            "score": 3,
            "text": "As people have been saying, this is not a war with the Russian people, it is a war with Putin.",
            "title_similarity": "0.55288863",
            "sentiment_compound": -0.1911
        },
        {
            "id": "hyoqio4",
            "score": 1,
            "text": "How many Russians and Ukrainians are currently dieing?",
            "title_similarity": "0.5806032",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyowqyj",
            "score": 1,
            "text": "This is such a smart move it's making my skin crawl.",
            "title_similarity": "0.066224605",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hyozyzo",
            "score": 1,
            "text": ">and to “not let Putin hide scale of tragedy”\n\nWhat do you think those Russian mobile crematories are for? Hand the bodies over to Russia and they'll be stuffed right in there.",
            "title_similarity": "0.8177396",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hyp1yo4",
            "score": 1,
            "text": "thats actually a big brain move, you can't even find a flaw in it. Zalensky is truly one of the biggest Gigachad on Earth",
            "title_similarity": "0.14170852",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hyp61j9",
            "score": 1,
            "text": "Powerful",
            "title_similarity": "-0.13269597",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hypa1x3",
            "score": 1,
            "text": "Well done! The enemy you turn into a friend is a friend for life. Kill them with kindness, after you protect yourself",
            "title_similarity": "0.5755944",
            "sentiment_compound": 0.636
        },
        {
            "id": "hyppxe1",
            "score": 1,
            "text": "The quicker the bodies start getting back to Russia, the better. Maybe reality will start to set in for those who aren’t opposed to the war",
            "title_similarity": "0.6159491",
            "sentiment_compound": -0.25
        },
        {
            "id": "hyq3erg",
            "score": 3,
            "text": "Zelinksy knows putin could give a fuck about losses.",
            "title_similarity": "0.46248138",
            "sentiment_compound": -0.7351
        },
        {
            "id": "hyq59ri",
            "score": 1,
            "text": "This is extremely smart of them to do, get an organization not associated with them to transport the bodies so it is documented how many and who they were.",
            "title_similarity": "0.45956516",
            "sentiment_compound": 0.4576
        },
        {
            "id": "hyz4kw8",
            "score": 1,
            "text": "your opinion once again proves that you have no idea what is really happening.",
            "title_similarity": "0.13529366",
            "sentiment_compound": -0.296
        },
        {
            "id": "hzibi7e",
            "score": 1,
            "text": "Dear President Volodymyr Zelensky, Ukraine\r  \nIt was heart breaking to see Ukraine kids say bye to their fathers who are going to fight with Russia. Are you aware you are being deliberately ill-advised by the NATO for war with Russia in order to sell future Hi-Tech Arms to other countries?! Please see these arms making companies share prices have gone up. This is not the first time wars were being used for making trillions of dollars! Capitalism and Market Economy will remain number one threat to global peace. You can check these prices by yourself! \r  \nLockeed Martin share price on 14 Feb 2022 - $365 gone up 4 March 2022 - $458\r  \nGeneral Dynamics share price on 14 Feb 2022 -$211 gone up 4 March 2022 - $243\r  \nNorthrop Grumman share price on 14 Feb 2022 -$386 gone up 4 March 2022 - $471",
            "title_similarity": "0.7210063",
            "sentiment_compound": 0.8472
        },
        {
            "id": "hzowdrr",
            "score": 1,
            "text": "Now word is Putin has a mobile cremation unit to despose of the dead Russians,  denying the parents a last goodby to their children is disgraceful.",
            "title_similarity": "0.8101935",
            "sentiment_compound": -0.7717
        }
    ]
}