{
    "Ukraine has regained control over Kharkiv, the country's second largest city\n": [
        {
            "id": "hynab9i",
            "score": 3,
            "text": "This is not simply Russia vs Ukraine. This is authoritarianism vs democracy. Our freedom is at stake. Tyranny is slowly creeping into the west and it must be stopped. If you are ready and willing - check out r/volunteersforukraine",
            "title_similarity": "0.32740402",
            "sentiment_compound": 0.7003
        },
        {
            "id": "hyn3l0c",
            "score": 8,
            "text": "They never lost Kharkiv, fake",
            "title_similarity": "0.34170341",
            "sentiment_compound": 0.5448
        },
        {
            "id": "hyn151u",
            "score": -16,
            "text": "Need a better sauce. Love Ukraine; y'all be propagandists a lil bit",
            "title_similarity": "0.3742655",
            "sentiment_compound": 0.7964
        },
        {
            "id": "hyneiuu",
            "score": -12,
            "text": "[deleted]",
            "title_similarity": "0.17222165"
        },
        {
            "id": "hynbqrn",
            "score": -3,
            "text": "this entire thing has to be a false flag stunt. no way Putin could fuck up this badly...",
            "title_similarity": "0.2709369",
            "sentiment_compound": -0.8316
        },
        {
            "id": "hynjn0e",
            "score": 1,
            "text": "This is the savvy genius American conservatives are praising and cheering on?",
            "title_similarity": "0.32165387",
            "sentiment_compound": 0.7783
        },
        {
            "id": "hynokpb",
            "score": 1,
            "text": "Is anyone else concerned about the amount of Russia/Ukraine news at the top of /all? I get it’s a huge story but it feels like it’s inescapable on Reddit. The paranoid part of me might be inclined to believe it may be partly due to bots in an effort to drum up support for Ukraine. I did see a post with 18k upvotes and only 15 comments yesterday. Not saying it’s Ukraine necessarily. Putin has always been pretty blatant about his desires for conflict. He also has a history of social media and bots. The worst part is it seems to be working.\n\nIt just feels like we’re entering the beginning stages of a major global conflict and everyone is way too cool with it.",
            "title_similarity": "0.45741624",
            "sentiment_compound": 0.597
        },
        {
            "id": "hyneapc",
            "score": 7,
            "text": "right. from the kyiv independent. i wonder if it has a particular agenda. so many propaganda and disinfo like how everyone died on snake island when they surrendered in reality. i'll believe it when confirmed by multiple news outlets",
            "title_similarity": "0.35341132",
            "sentiment_compound": -0.5233
        },
        {
            "id": "hyno4jp",
            "score": 7,
            "text": "they never lost control of Kharviv..? You redditors upvote anything you read don't you",
            "title_similarity": "0.33458138",
            "sentiment_compound": 0.2411
        },
        {
            "id": "hynfl19",
            "score": -2,
            "text": "I hope I'm not in a Reddit's echo chamber and Ukraine is indeed winning. But I was shocked with the outcomes of Brexit and the election of Trump, so this time I won't get ahead of myself.",
            "title_similarity": "0.39559048",
            "sentiment_compound": 0.0516
        },
        {
            "id": "hyn3qh5",
            "score": -29,
            "text": "Things are going poorly for Russia. Heavy casualties, economic sanctions, travel restrictions, shitty hardware, etc. They’re still going to overwhelm Ukraine eventually and there’s not much we can do about it. This isn’t like Iraq invading Kuwait. Russia has nukes and WILL use them. A we can do is fund and arm Ukraine  to draw out the inevitable.\n\nEdit: I don’t like it any more than you guys do but Zelensky has hours left to live, and Kyiv will fall within a week. Someone do that remindme thing. I want to be wrong.\n\nEdit again: WHAT THE FUCK NO ONE TOLD ME BOB SAGET DIED.",
            "title_similarity": "0.52394056",
            "sentiment_compound": -0.9705
        },
        {
            "id": "hyne8ig",
            "score": 0,
            "text": "Annual defense budget of US: $800B USD\n\nAnnual budget of Taliban (overall, not just defense): $1.6B USD\n\nResult after 20 years of war: Taliban Win\n\nAnnual defense budget of Russia: $61B USD.\n\nAnnual defense budget of Ukraine: $4.2B USD...\n\nUkraine has 20 years of YouTube videos posted by the Taliban and ISIS to use for reference. Russia has no shot.",
            "title_similarity": "0.5874672",
            "sentiment_compound": -0.0439
        },
        {
            "id": "hynhtvc",
            "score": 0,
            "text": "Err. Are we sure its Russia Invading? Sounds like its Afghan Army(not taliban). \n\nI thought Russia was a super power, but they cant even take a city from their neighbour.",
            "title_similarity": "0.47505897",
            "sentiment_compound": 0.5927
        },
        {
            "id": "hyoc30g",
            "score": 0,
            "text": "I'm not siding with Russia here, but their plan wasn't as incompetent as people are painting it. Their plan, without help of international intelligence community would've been frighteningly effective.\n\nBeating the enemy is fairly easy if you type 'blacksheepwall' at the beginning of the match",
            "title_similarity": "0.33518985",
            "sentiment_compound": -0.0788
        },
        {
            "id": "hyne8jc",
            "score": -2,
            "text": "[deleted]",
            "title_similarity": "0.17222165"
        },
        {
            "id": "hynqkgw",
            "score": 3,
            "text": "This puts NATO to shame. Ukraine does not need to join NATO afterall. It’s NATO who should ask to join Ukraine.",
            "title_similarity": "0.4150107",
            "sentiment_compound": -0.4191
        },
        {
            "id": "hyo55f9",
            "score": 3,
            "text": "I take this as a sign, that we (the US and the West) have been completely exaggerating and over-blowing the non-nuclear, more traditional military threat that Russia truly poses to NATO.   We have kept up this image, to ensure our defense spending remains at high levels.  If there's no competition, then there's no way to justify our arms race, even though it's never been a race for 50+ years.\n\nWe have been pretending that they are the near equal of the US and West, when in actuality, their military has been in shambles for half a century, and is filled with tech that projects the image of power, but is just a hollow shell of actual power.\n\nIt's crazy when you actually think about it, a nation that is in between Mexico and Italy in GDP, is some how going to afford to outfit and equip a massive military, and storm through to a capital like the US has done.  They can't even supply night vision to their soldiers and armored vehicles. \n\nI really don't understand the end game here.  Has Putin lost his mind?  Did he get COVID, and now has COVID brain?  Even if he topples Ukraine, what's next?  Economic sanctions are going to further bankrupt his already broke country, and directly harm the Oligarchs.  I don't see how he avoids being overthrown by them.",
            "title_similarity": "0.48830193",
            "sentiment_compound": -0.9588
        },
        {
            "id": "hyneci5",
            "score": -1,
            "text": "You haven’t got the slightest clue",
            "title_similarity": "0.08965583",
            "sentiment_compound": 0.0
        },
        {
            "id": "hynfhfh",
            "score": 0,
            "text": "ye, im pretty sure thats not state propaganda and very realistic kappa",
            "title_similarity": "0.1884315",
            "sentiment_compound": 0.7383
        },
        {
            "id": "hynhxi9",
            "score": -3,
            "text": "Every country in the world should commit to send troops to Ukraine immediately,  like 500000.  At the same time tell Putin if he leaves now there will be no more bloodshed and tell the Russian soldiers directly that if they lay down their arms they will be granted amnesty and be relocated out of Russia.",
            "title_similarity": "0.45282954",
            "sentiment_compound": 0.5423
        },
        {
            "id": "hynox8j",
            "score": -2,
            "text": "I am probably being stupid here, but this is going too easily for now. It's almost like this is a first wave meant as a distraction and to tire out Ukraine's army as well as use up supplies and resources. The second wave then comes to sweep everything away. The mighty Russian army being defeated this easily? Something is not right.... Maybe.",
            "title_similarity": "0.46353558",
            "sentiment_compound": 0.3475
        },
        {
            "id": "hynltld",
            "score": -6,
            "text": "EDIT: Maybe the Ukrainians can win if logistics are so bad on the Russian side they can't wage more war, but not sure if that's a realistic assessment.\n\nDoes anyone think that this is the best Russia has to offer? They WILL win simply by sending more and better trained troops and wiping out Ukrainian air defense. This is a false start. He WILL win if he presses this (key open question). Zero doubt. Of course \"winning\" is losing since the entire nation hates Russia and will make Afghanistan look like a rave. This isn't the Soviet Union. They won't go quietly. But don't pretend like the Ukrainian military can win. They absolutely cannot if the full force of the Russian military is used. It all depends on how hard Putin want to press it. Hopefully he folds.",
            "title_similarity": "0.4526249",
            "sentiment_compound": 0.9823
        },
        {
            "id": "hyolirb",
            "score": -4,
            "text": "You never truly know the status until a few days later. Reddit news are filled with incorrect information. Just fact check any news you heard 48 hrs ago. Realistic speaking, I think Ukraine's propaganda team is he undisputed winner in the Reddit news section.\n\nHowever, I don't think cyber propaganda is doing Ukraine any good to be honest. Just like how the US assess Afghanistan government can last 9 months and turns out to be 6 weeks. Or China is going to collapse in the last 20 years, yet somehow t is going to surpass us economy size in the next 5 years. You keep hearing Ukraine drive Russian Force left and right recapture all the cities, yet we know the opposite had happened\n\nI often wondering who is your biggest adversary? Is that your opponent try to surpass you and make it clear that he or she tried to surpass you, or someone try to deceive you by providing you incorrect information until it's too late?",
            "title_similarity": "0.559263",
            "sentiment_compound": 0.7264
        },
        {
            "id": "hyncnwl",
            "score": -3,
            "text": "Go Ukraine!\n❤️🇺🇦 \n\n(Please let me know if I got the flag wrong)",
            "title_similarity": "0.41931248",
            "sentiment_compound": -0.2714
        },
        {
            "id": "hyn5jmq",
            "score": 1,
            "text": "🇺🇦",
            "title_similarity": "0.18323827",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyn8b1i",
            "score": 5,
            "text": "I don’t know what to believe anymore",
            "title_similarity": "0.10920267",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyn9sfq",
            "score": 5,
            "text": "Putin can go fuck himself",
            "title_similarity": "0.33970273",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hynl50h",
            "score": -5,
            "text": "It really demonstrates how powerful the US military is and that it truly has no competition. I mean Russia is supposed to be the other world power and they lost more troops in 4 days in Ukraine then we lost in 20 years in Iraq. The US has not lost a military battle since the Korean war. Nukes aside, the US military could probably take any Capitol in the world in under a week and Russia is getting beat back by one of the poorest countries in Europe.",
            "title_similarity": "0.6280054",
            "sentiment_compound": -0.8349
        },
        {
            "id": "hynpn4y",
            "score": 2,
            "text": "I think the Russian military is deliberately losing..",
            "title_similarity": "0.38373792",
            "sentiment_compound": -0.3818
        },
        {
            "id": "hyo2xfv",
            "score": 1,
            "text": "This success shows that Western weapons and info + trained, high morale forces are very powerful. Western weapons have been allowed to get in due to Putin not wanting to go too near the western border to not risk direct NATO conflict. However, Taiwan is an island, and China can blockade it once they invade and make it so if the west wants to get weapons in, we'd be forced into direct conflict. Therefore, now, before any invasion, we need to arm Taiwan to the teeth and then triple it - like I'm talking at least 100 billion $ worth.",
            "title_similarity": "0.36106172",
            "sentiment_compound": -0.5509
        },
        {
            "id": "hynfg8x",
            "score": -6,
            "text": "It is a lie. Truth is that ukrainian nationalists kill ukrainian civilians and say it was made by russians.",
            "title_similarity": "0.42156303",
            "sentiment_compound": -0.5267
        },
        {
            "id": "hynsnmb",
            "score": -4,
            "text": "Guys, let‘s be honest. Russia is sending trash equipment and young, untrained canon food as soldiers. The ukranian army was trained and armed the last years. But at the end of the day, there is no way russia would lose that war. I hope that these negotiations will work out.",
            "title_similarity": "0.42254305",
            "sentiment_compound": -0.7717
        },
        {
            "id": "hyo1zc1",
            "score": -8,
            "text": "Africans are being blocked by UKRANIANS from leaving. They are being pushed to the back of the line for white Ukrainians on bases and denied the right to get on trains and cross borders. \n\nBlack baby stuck in 3°c with her African mom because white people get to go first. Video\n\nhttps://twitter.com/TalbertSwan/status/1497870253208092673?t=ID8TTJcdYGZPKTa_gLclUQ&s=19\n\n\nUkranians blocking Africans from getting on trains to escape video.\n\nhttps://twitter.com/TalbertSwan/status/1497863041249169408?t=YfXZxXzLGtnwuQjt9mk63A&s=19",
            "title_similarity": "0.34621152",
            "sentiment_compound": -0.8053
        },
        {
            "id": "hyn0kb3",
            "score": 11,
            "text": "Have fun in your own person Vietnam Putin. Fuckhead.",
            "title_similarity": "0.2993466",
            "sentiment_compound": -0.2023
        },
        {
            "id": "hymy1c9",
            "score": 113,
            "text": "I’m pretty sure Zelenskyy showed up and just steam rolled the Russian tanks with his ~~massive~~ tremendous balls",
            "title_similarity": "0.4624277",
            "sentiment_compound": 0.6705
        },
        {
            "id": "hyn5ozc",
            "score": -3,
            "text": "im hoping that the theory of \"make this appear as an actual war to garner legitimacy\" is not true. because the optics of walking in and killing everyone and taking it in 2 days would be obviously worse. but i think im giving too much credit..",
            "title_similarity": "0.35100627",
            "sentiment_compound": 0.1366
        },
        {
            "id": "hynrl4i",
            "score": -3,
            "text": "These guys are the conscripts.  Young kids sent in to absorb most of the Ukrainian ammunition.  Latter on they’ll send the battle hardened units and Chechnyans.",
            "title_similarity": "0.4400833",
            "sentiment_compound": -0.3818
        },
        {
            "id": "hymze0n",
            "score": 43,
            "text": "I worry the worse it gets for Russia just how far or extreme Putin is willing to go?\n\nIs he crazy enough to go nuclear?\n\nEdit: WELP! He just put his nuclear command on HIGH alert!...fuuuu",
            "title_similarity": "0.34002548",
            "sentiment_compound": -0.8535
        },
        {
            "id": "hynbn90",
            "score": -8,
            "text": "If they have the manpower it is time to attack… If they can manage two fronts They should retake Crimea and engage Belarus who is giving aid to their enemy if they can only manage one then I would say attack Belarus as they are allowing staging of more troops to be placed in their country.",
            "title_similarity": "0.4404259",
            "sentiment_compound": -0.4215
        },
        {
            "id": "hyngca7",
            "score": 13,
            "text": "I hope the MAGA chuds in America who are pro-Putin are triggered and salty.  \n\nIf you support this invasion because you’re still licking Trump’s boots, you truly have lost your way as an American",
            "title_similarity": "0.32905748",
            "sentiment_compound": 0.7351
        },
        {
            "id": "hync4hw",
            "score": 0,
            "text": "She should be expelled just for being a fat head loud mouth witch",
            "title_similarity": "0.31542173",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hynd3fz",
            "score": 0,
            "text": "What the west now needs tondo is send a lot more material to ukraine. This can just be the first push to get ukraine to exaust most of its missiles and equipment.",
            "title_similarity": "0.52695715",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyngjal",
            "score": 0,
            "text": "[deleted]",
            "title_similarity": "0.17222165"
        },
        {
            "id": "hyninay",
            "score": -4,
            "text": "🇺🇸 We the people support you! Defend what’s yours! You are in my prayers.",
            "title_similarity": "0.14012408",
            "sentiment_compound": 0.508
        },
        {
            "id": "hynjt74",
            "score": 0,
            "text": "North Korea be like... \"Thanks Putin for Beta Testing WW3 against the West\".... 😂",
            "title_similarity": "0.3702806",
            "sentiment_compound": 0.8074
        },
        {
            "id": "hynnb15",
            "score": 0,
            "text": "And this is a military not good enough for NATO. Imagine what the real professionals would do to Russia.",
            "title_similarity": "0.4360597",
            "sentiment_compound": -0.3412
        },
        {
            "id": "hziappm",
            "score": 0,
            "text": "Dear President Volodymyr Zelensky, Ukraine\r  \nIt was heart breaking to see Ukraine kids say bye to their fathers who are going to fight with Russia. Are you aware you are being deliberately ill-advised by the NATO for war with Russia in order to sell future Hi-Tech Arms to other countries?! Please see these arms making companies share prices have gone up. This is not the first time wars were being used for making trillions of dollars! Capitalism and Market Economy will remain number one threat to global peace. You can check these prices by yourself! \r  \nLockeed Martin share price on 14 Feb 2022 - $365 gone up 4 March 2022 - $458\r  \nGeneral Dynamics share price on 14 Feb 2022 -$211 gone up 4 March 2022 - $243\r  \nNorthrop Grumman share price on 14 Feb 2022 -$386 gone up 4 March 2022 - $471",
            "title_similarity": "0.47804976",
            "sentiment_compound": 0.8472
        },
        {
            "id": "hyndqu8",
            "score": 19,
            "text": "⚠️ If you're in Ukraine and reading this please turn geolocation off on your phone now. Russia is using it to track gatherings. Tell those around you to do the same.",
            "title_similarity": "0.36558855",
            "sentiment_compound": 0.3869
        },
        {
            "id": "hymyhmj",
            "score": 17,
            "text": "Putin's plan is not going well it seems.",
            "title_similarity": "0.30872715",
            "sentiment_compound": -0.2057
        },
        {
            "id": "hynbntq",
            "score": -1,
            "text": "nobody has control",
            "title_similarity": "0.12928861",
            "sentiment_compound": 0.0
        },
        {
            "id": "hynd9p6",
            "score": 1,
            "text": "i'm scared putin's patience comes to an end soon",
            "title_similarity": "0.33909872",
            "sentiment_compound": -0.4404
        },
        {
            "id": "hyndka8",
            "score": -1,
            "text": "W :)",
            "title_similarity": "0.118222564",
            "sentiment_compound": 0.4588
        },
        {
            "id": "hyneogg",
            "score": -1,
            "text": "Su h",
            "title_similarity": "0.17749402",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyng4x6",
            "score": -1,
            "text": "/u/onikzin was still there. They never had a chance",
            "title_similarity": "0.16165935",
            "sentiment_compound": -0.1877
        },
        {
            "id": "hynhh35",
            "score": -1,
            "text": "I’m happy for Ukraine and hope they come out on top. To lean on the side of caution we just remember that Russia taking over Ukraine is probably just a matter of time unfortunately",
            "title_similarity": "0.51418614",
            "sentiment_compound": 0.7269
        },
        {
            "id": "hynhqn3",
            "score": -1,
            "text": "I would take down Putin by myself if I could, my brethren are suffering, fleeing, and fighting for their lives because Putin knows he has to be held accountable to the numerous war crimes, murders, and nefarious businesses practices he and his cronies have committed. I am proud of every Ukrainian willing to stand against Putin and his bullshit, the world is watching and your strength and resilience demonstrates that tyranny can steal lives, destroy homes, and ruin economies, but it can never take away hope, Democratic spirit, or silence the truth. Old Man Vlad needs to retire or be shot or finally held accountable for his war crimes, Geneva Convention violations, and his attempts to usurp national freedoms guaranteed by the fall of the USSR. Old views, old man, old news.",
            "title_similarity": "0.35158217",
            "sentiment_compound": -0.9549
        },
        {
            "id": "hynhwk0",
            "score": 1,
            "text": "If Putin's army is having as much trouble with Ukraine as it is imagine if they had to face a fully integrated modern military.  NATO isn't a threat, but it would finish them in weeks if Putin tried anything.",
            "title_similarity": "0.5318971",
            "sentiment_compound": 0.0098
        },
        {
            "id": "hynki8n",
            "score": 1,
            "text": "Lmao and Russia was supposed to number 2 in the top 10 world's military? Because they're looking real real bad right now",
            "title_similarity": "0.57180333",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hynkkau",
            "score": -1,
            "text": "Afghanistan are you watching",
            "title_similarity": "0.1929025",
            "sentiment_compound": 0.0
        },
        {
            "id": "hynkknq",
            "score": 1,
            "text": "Ukraine 6-0 putin.\n\nYou guys are gonna fucking win this war!",
            "title_similarity": "0.50750256",
            "sentiment_compound": -0.2855
        },
        {
            "id": "hynl4a4",
            "score": -1,
            "text": "“We support you Ukraine” \nUkraine: well come help…\nAmericans/EU: No no we meant support through comments on Reddit!",
            "title_similarity": "0.43161076",
            "sentiment_compound": 0.8262
        },
        {
            "id": "hynnjh4",
            "score": 1,
            "text": "Ukrainians captured Russian at Verhnya Syrovotka and made him say “glory to Ukraine” \n\nhttps://twitter.com/njohnson_145/status/1497964936567263233?s=21",
            "title_similarity": "0.5750749",
            "sentiment_compound": 0.0
        },
        {
            "id": "hynobdt",
            "score": -1,
            "text": "Hey Ukraine, after this is all over, will you guys just be the world's security force going forward?",
            "title_similarity": "0.5469528",
            "sentiment_compound": 0.34
        },
        {
            "id": "hynyw46",
            "score": 1,
            "text": "They cannot even project force in a neighboring country.\n\nRussia isn't even a regional power much less a world power.",
            "title_similarity": "0.40659362",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyq7fql",
            "score": -1,
            "text": "By the way, Kharkov was founded by Russian tsar in 1654",
            "title_similarity": "0.4054572",
            "sentiment_compound": 0.0
        },
        {
            "id": "hynb9pt",
            "score": 2,
            "text": "He did it, that son of a bitch did it.",
            "title_similarity": "0.23727363",
            "sentiment_compound": -0.5859
        },
        {
            "id": "hyne86k",
            "score": -2,
            "text": "Yeah sorry. Don't buy it. We'll be hearing about another city in two days that's made a heroic resistance. Western propaganda is just as loud as the east. And no I'm not hoping Russia wins. I just don't like bullshit no matter where it comes from",
            "title_similarity": "0.44057152",
            "sentiment_compound": -0.2828
        },
        {
            "id": "hynelgt",
            "score": -2,
            "text": "What news are we supposed to believe these days",
            "title_similarity": "0.2729038",
            "sentiment_compound": 0.0
        },
        {
            "id": "hynet8g",
            "score": 2,
            "text": "where can i go for unbiased info about what is going on in ukraine",
            "title_similarity": "0.40376255",
            "sentiment_compound": -0.0258
        },
        {
            "id": "hyng8l7",
            "score": 2,
            "text": "Reddit has completely lost the plot",
            "title_similarity": "0.25548947",
            "sentiment_compound": -0.3804
        },
        {
            "id": "hynglmt",
            "score": -2,
            "text": "This likely ends with the city nuked\n\nAnd thats strategically smart. \n\nCant take the city nuke it.\nTake the playbook the americans used against japan to force victory. \nAlso youd prove willingness to do so keeping NATO out of the fight. Nobody wants to risk a nuclear war.\n\n\nHopefully im wrong but thats what id do if i was putin",
            "title_similarity": "0.3049661",
            "sentiment_compound": -0.3818
        },
        {
            "id": "hyo71ph",
            "score": -2,
            "text": "It’s good the Ukrainians have the standard military equipment, but now is the time for Ukrainian inventors to make their moves. Now is the time for more spring loaded traps, sudden barb wire barriers, even catapults throwing the Russian’s own burning and burnt out vehicles back at them. Just a thought.",
            "title_similarity": "0.46232033",
            "sentiment_compound": 0.2382
        },
        {
            "id": "hyof3dy",
            "score": 2,
            "text": "Putin is fighting with one hand tied behind his back.  The Russians have largely stopped using air-strikes, cruise missiles and artillery after the first day, and it's probably to preserve cities.  \n\nStill leaves the army in a really shit position pushing into fortified cities without air-support.",
            "title_similarity": "0.45324457",
            "sentiment_compound": -0.624
        },
        {
            "id": "hyqklbc",
            "score": 2,
            "text": "Media reporting is bizarre. I have someone living in Kharkiv saying its been taken over.  Also the mayor of Kiev announced that they are surrounded then quickly took it back. The media has literally the entire plant believing that Putin is stupid and is just going to suicide his country.",
            "title_similarity": "0.41455722",
            "sentiment_compound": -0.8807
        },
        {
            "id": "hymy0r8",
            "score": 18,
            "text": "Great job guys 🇺🇦👍🏻",
            "title_similarity": "0.25605443",
            "sentiment_compound": 0.6249
        },
        {
            "id": "hyna4nm",
            "score": 3,
            "text": "Humans are upvoting this. Bots downvote.",
            "title_similarity": "0.2176035",
            "sentiment_compound": 0.0
        },
        {
            "id": "hynd90i",
            "score": -2,
            "text": "THE \" Z \" they are talking about on TV that the RUSSIANS ARE PUTTING ON THEIR TANKS is s \"signal.\" It was used during the cold war by KGB to signal distress. They are sending a covert message  to those who know what the Z means. It could be anything.  I keep saying, \" You want to nail Putin, THINK LIKE A COLD WAR SPY.\"  Talk yo the old guys and women.",
            "title_similarity": "0.31441367",
            "sentiment_compound": -0.8555
        },
        {
            "id": "hyneyq9",
            "score": 4,
            "text": "Get fucked Putin.",
            "title_similarity": "0.35508958",
            "sentiment_compound": -0.6597
        },
        {
            "id": "hynfgtt",
            "score": 3,
            "text": "Once this is over, every participatin soldier in the Russian army should be charged with war crimes and not be allowed to travel anywhere in the world",
            "title_similarity": "0.33273137",
            "sentiment_compound": -0.6908
        },
        {
            "id": "hyntnwr",
            "score": -2,
            "text": "Truth is the first casualty of war, regardless of what side you are on.",
            "title_similarity": "0.41165388",
            "sentiment_compound": -0.7184
        },
        {
            "id": "hyocckd",
            "score": 3,
            "text": "Enjoy it while it lasts. Hope you brought your seeds, you walking sacks of fertilizer.",
            "title_similarity": "0.14306806",
            "sentiment_compound": 0.7269
        },
        {
            "id": "hyocfaq",
            "score": 3,
            "text": "Men of Europe prepare for War\n\nRussia seems to forget us Europeans are\n\nMasters of War.I plant my Flag 🇮🇪",
            "title_similarity": "0.36604202",
            "sentiment_compound": -0.7003
        },
        {
            "id": "hync9j2",
            "score": 5,
            "text": "[deleted]",
            "title_similarity": "0.17222165"
        },
        {
            "id": "hyncftx",
            "score": 4,
            "text": "Despite rooting for Ukranians I can't avoid thinking that on the other side are people like you and me, that rather be doing their own business on a sunday afternoon and yet are sent by a lunatic and his olygarch entourage to die for no reason. After seeing the RU soldier covering his head, maybe in shame, or the one talking to his parents by phone or the exchange of words and laughter by the no gas RU tank crew and a Ukranian driver, more I'm certain that no one wished to be there. Therefore I have no joy in seeing a tank being blown up, imagining  that these are the kind of guys, again, like you and me, that are about to meet their maker.\n\nYet the responsibles and their entourages are still free to roam about, thanks to having EURO politicians balls in their hands (right, Boris? Abramovich has a nice stand in Stamfors Bridge for you show yourself to the masses and his daughter is against this war by the way, so everything is fine).",
            "title_similarity": "0.2390524",
            "sentiment_compound": 0.4995
        },
        {
            "id": "hyo2kbu",
            "score": -4,
            "text": "[removed]",
            "title_similarity": "0.15426585"
        },
        {
            "id": "hypa129",
            "score": 5,
            "text": "I can’t bring myself to blame the Russian troops and Russian people. I feel like this madman has them by the neck and is forcing them to do this evil against their will.",
            "title_similarity": "0.30348644",
            "sentiment_compound": -0.7311
        },
        {
            "id": "hymy8pj",
            "score": 43,
            "text": "Russia really be getting no bitches rn",
            "title_similarity": "0.33839545",
            "sentiment_compound": 0.5283
        },
        {
            "id": "hynl0ge",
            "score": -5,
            "text": "I live in Maryland. 52 years old.  I grew up in the cold war, was a soldier. Is it time to empty my bank account and head to the Midwest to areas far from high population centers and military bases?  Afraid a run on the banks is very possible. The day of the invasion bought my first AR15 and 500 rounds of 5.56 due to my concerns.  I understand if my family survives the initial exchange we will not likely survive the post exchange world. I am a nurse, never been a prepper.  I know it is too late.  I still have hope.",
            "title_similarity": "0.42797068",
            "sentiment_compound": -0.4215
        },
        {
            "id": "hyn1387",
            "score": 5,
            "text": "I cant believe we are winning, for now at least...",
            "title_similarity": "0.3191387",
            "sentiment_compound": 0.5267
        },
        {
            "id": "hyngyvs",
            "score": 6,
            "text": "I'm surprised at the amount of people that actually think Biden is responsible for Russia invading Ukraine as if he could've done something to stop it and if Trump was president this would never happen. Its crazy how  people forget things, like how powerful Russia got during the 4 years Trump was president and all the favors Trump did for Russia",
            "title_similarity": "0.48549852",
            "sentiment_compound": 0.8144
        },
        {
            "id": "hyo802a",
            "score": -7,
            "text": "Dang the Kyiv independent, I’m sure they’re a reliable non-bias source",
            "title_similarity": "0.2856164",
            "sentiment_compound": 0.3182
        },
        {
            "id": "hyn1k1t",
            "score": 109,
            "text": "The chernobyl radiation gave everyone in Ukraine Diamond balls\n\nEdit: accidentally dragged UK into chadness",
            "title_similarity": "0.4491681",
            "sentiment_compound": -0.0516
        },
        {
            "id": "hyn4ruz",
            "score": -20,
            "text": "[deleted]",
            "title_similarity": "0.17222165"
        },
        {
            "id": "hynq3ox",
            "score": -20,
            "text": " “Regained control” is code for Zelensky just announced that he is willing to \"negotiate\" (ie. surrender) \"without preconditions\" Oh, well, so much for reddit helping ukraine win the war.",
            "title_similarity": "0.42088592",
            "sentiment_compound": 0.0736
        },
        {
            "id": "hymxx1p",
            "score": 25,
            "text": "Alternative source: https://www.aljazeera.com/news/2022/2/27/street-battles-in-kharkiv-as-russians-enter-ukraines-2nd-city",
            "title_similarity": "0.59294254",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyn05ok",
            "score": 22,
            "text": "Simply surviving that artillery bombardment is substantial.  Surviving and being able to mount a counter-offensive is colossal.",
            "title_similarity": "0.32090208",
            "sentiment_compound": 0.6369
        },
        {
            "id": "hyn8sv1",
            "score": 26,
            "text": "[deleted]",
            "title_similarity": "0.17222165"
        },
        {
            "id": "hyn9w7t",
            "score": 10,
            "text": "This conflict is quickly becoming 1-sided. Casualties and injuries are piling up on the 🇷🇺 end. Heard a report of 3500 Russian casualties, injuries, and captures in Kyiv. Reminds me of the Russo-Japanese conflict. Everyone thought this massive Russian force would steam roll Japan, but Japan pulled off a massive upset.\n\nAt this rate Ukraine may be able to fight off the Russian aggressors with no boots on the ground from US or EU. Additionally the illusion of power that Putin holds will fall.\n\nLFG 🇺🇦 !!",
            "title_similarity": "0.563789",
            "sentiment_compound": -0.9304
        },
        {
            "id": "hynaujy",
            "score": 9,
            "text": "So much for Russia being a super power lmao. No lfg group is gonna accept them when they look up their 2022 win ratio stats.",
            "title_similarity": "0.578735",
            "sentiment_compound": 0.9186
        },
        {
            "id": "hymy0ee",
            "score": 10,
            "text": "Bravo, this is great news!",
            "title_similarity": "0.20875493",
            "sentiment_compound": 0.6588
        },
        {
            "id": "hyn9qn3",
            "score": 13,
            "text": "Russian Forces....go fuck yourselves.",
            "title_similarity": "0.3343814",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hyn7y74",
            "score": 15,
            "text": "So if Russia has way more planes, troops, tanks, etc, why not just use them? Why is Russia struggling so much with this invasion?",
            "title_similarity": "0.40181002",
            "sentiment_compound": -0.4871
        },
        {
            "id": "hynfvgd",
            "score": 15,
            "text": "We never lost it. There were some stray piggies waiting to be shot here and there, but 'regained' is a weird choice of word. We never lost any(!) of our major cities. russian army is a bunch of losers.",
            "title_similarity": "0.38301453",
            "sentiment_compound": -0.6147
        },
        {
            "id": "hyn9s3s",
            "score": 18,
            "text": "People really underestimated Ukraine",
            "title_similarity": "0.41873783",
            "sentiment_compound": -0.3384
        },
        {
            "id": "hymz1ei",
            "score": 96,
            "text": "This is definitely good news and hopefully will push Russia out and to the surrender table soon but I hate to see all these kids losing their life fighting for that limp dictator.",
            "title_similarity": "0.36908805",
            "sentiment_compound": -0.8422
        },
        {
            "id": "hyn3up5",
            "score": 92,
            "text": "Putin, keep your cyanide pill close. You wouldn't like to end up like Mussolini.",
            "title_similarity": "0.20359072",
            "sentiment_compound": 0.1002
        },
        {
            "id": "hyna6by",
            "score": 20,
            "text": "I really like watching RT alongside the western outlets in order to see how the people of Russia are being brainwashed. Jesus, even some of my coworkers are starting to tell me Russia has done nothing wrong and proceed to tell me exactly what RT has been saying.",
            "title_similarity": "0.2782113",
            "sentiment_compound": 0.6539
        },
        {
            "id": "hynet8e",
            "score": -23,
            "text": "[removed]",
            "title_similarity": "0.15426585"
        },
        {
            "id": "hyn6ejl",
            "score": 182,
            "text": "The Botox gremlin in kremlin is a failure and hopefully putin ground soon.",
            "title_similarity": "0.4103317",
            "sentiment_compound": -0.1531
        },
        {
            "id": "hynbj24",
            "score": 22,
            "text": "And the whole world cheered\n\nFuck Russia",
            "title_similarity": "0.3888123",
            "sentiment_compound": -0.0516
        },
        {
            "id": "hyn0rbl",
            "score": 499,
            "text": "Russia are fucking rubbish at urban warfare.",
            "title_similarity": "0.3728646",
            "sentiment_compound": -0.296
        },
        {
            "id": "hymzu41",
            "score": 27,
            "text": "Regaining control means a kot of Russian troops must have died or retreated.",
            "title_similarity": "0.41731697",
            "sentiment_compound": -0.5574
        },
        {
            "id": "hymyvqh",
            "score": 487,
            "text": "Is Ukraine going to invade Russia soon?",
            "title_similarity": "0.46395725",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyn9jgg",
            "score": 163,
            "text": "I want Ukraine in NATO after all of this because they're clearly incredible badasses.\n\nNow, that said, judging by the video I'm watching of the Russians advancing into the city, Its not surprising. They're tactics are atrocious and are leaving them WIDE open to ambush. Its a turkey shoot for some of these Ukrainians. I doubt their complaining about Russia making it easier for them though. Slava Ukrania.",
            "title_similarity": "0.3760627",
            "sentiment_compound": -0.1813
        },
        {
            "id": "hyn2hxa",
            "score": 1327,
            "text": "Roses are red\n\nThe Kremlin is twisted\n\nBend over Putin\n\nYou're about to get fisted\n\nEdit: please don't spend money on awards for this comment, please direct the funds to humanitarian aid efforts for Ukraine.",
            "title_similarity": "0.3730204",
            "sentiment_compound": 0.765
        },
        {
            "id": "hyn7xlx",
            "score": 75,
            "text": "What great news to start off the day with. Love from America. 🇺🇸 🇺🇦",
            "title_similarity": "0.35658365",
            "sentiment_compound": 0.8519
        },
        {
            "id": "hyn0l1u",
            "score": 795,
            "text": "Historians in 20 years:\n\n\nNever underestimate the Ukranian winter and the size of their leader's balls.",
            "title_similarity": "0.50673354",
            "sentiment_compound": 0.2235
        },
        {
            "id": "hyn4hf5",
            "score": 3425,
            "text": "Putin could have just not done this, lived out his life in luxury, and gone down in history as one of the most revered and powerful leaders of the last 2 centuries in pretty much everyone's minds, love him or hate him. (See edit before you correct my choice of words please)\n\nInstead he chose to shit the bed and remove any illusion of military prowess or political leadership. He's been a troll with an inferiority complex and some scary bombs the whole time. That's it.\n\nPutin is a disgrace to his people. We as a species need to erase his power on once and for all.\n\n\n\n**Edit: because my first sentence is causing a lot of confusion I feel I should rephrase. What I meant was:\n\nPutin could have averted this conflict, stayed in power, and lived out his days in exorbitant wealth while leaving the next generation to foot the bill. If he did that, whether you liked him or not, he would have gone down in history as one of the most revered (by those on his side) and powerful (by those afraid of or opposed to him) leaders of the last 2 centuries.\n\nI'm sorry that was so difficult to understand.",
            "title_similarity": "0.44973004",
            "sentiment_compound": 0.6791
        },
        {
            "id": "hyn7x1d",
            "score": 84,
            "text": "I’ve seen more convincing invasions by stoners trying break into a closed Taco Bell",
            "title_similarity": "0.24450141",
            "sentiment_compound": 0.4576
        },
        {
            "id": "hymxxv2",
            "score": 144,
            "text": "Give them hell guys! Слава Україні!",
            "title_similarity": "0.36108533",
            "sentiment_compound": -0.7339
        },
        {
            "id": "hymz164",
            "score": 331,
            "text": "Fucking beautiful.\n\nSlava Ukraini! 🇺🇦🇺🇦🇺🇦",
            "title_similarity": "0.3658235",
            "sentiment_compound": 0.6689
        },
        {
            "id": "hymxwxz",
            "score": 2648,
            "text": "Anyone has noticed that #1 security threats to Putin are:\n\n* Apartment Buildings\n* Ukrainian Civilians\n* Ukrainian Civilian Drivers \n* Homes .\n* Banks( Russian Troops are robbing banks in the Ukraine)\n\nAlso, why hasn't RT( Russia Today) been removed from Social Media, YouTube, Cable packages or denied accesses OTA satellite . Neither their assets have been frozen and overseas offices closed down.",
            "title_similarity": "0.4813995",
            "sentiment_compound": -0.5883
        },
        {
            "id": "hymyd4c",
            "score": 97,
            "text": "Slava Ukraini",
            "title_similarity": "0.36775386",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyn1v71",
            "score": 232,
            "text": "Bruh I hope we’re seeing Winter War Part 2",
            "title_similarity": "0.40677536",
            "sentiment_compound": -0.25
        },
        {
            "id": "hymyv0b",
            "score": 206,
            "text": "Kyiv and Kharkiv... Couldn't capture both",
            "title_similarity": "0.37856862",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyn9sld",
            "score": 139,
            "text": "I can’t wait to read reports of Russian troops pushed out of Crimea next. Putin made a colossal mistake and is undoing everything he’s built over the last 30 years. Godspeed Ukraine. You are the gatekeepers of Freedom.",
            "title_similarity": "0.5597747",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hyn20gx",
            "score": 9521,
            "text": "At this rate, NATO is going to want to join Ukraine.",
            "title_similarity": "0.46786422",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hymxq5o",
            "score": 1778,
            "text": "Wow, this Russian invasion really doesn't seem to be going to plan. Is there any independent source confirming that they have regained control?",
            "title_similarity": "0.36390036",
            "sentiment_compound": 0.5859
        },
        {
            "id": "hymxmdc",
            "score": 5274,
            "text": "oof, that's gotta sting for putin if true",
            "title_similarity": "0.31210235",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hyn9ry1",
            "score": 118,
            "text": "[removed]",
            "title_similarity": "0.15426585"
        },
        {
            "id": "hynbpjy",
            "score": 4497,
            "text": "I can’t find the thread but someone posted a really great breakdown of why Russia’s supply chain is so fucked. \n\nThe big takeaway is that the Russian military is insanely corrupt (no surprise). But that the top brass can’t admit to the scope of corruption without implicating themselves. \n\nPutin may have very well thought they had gas and supplies. His generals may have told him so. The problem is they were taking fuel and oil money to pad their own pockets. It also makes sense you’d skim from the fuel budget because you can claim the fuel was used. But if a rocket doesn’t show up then that isn’t going unnoticed. \n\nTLDR: Russian generals were skimming from the fuel fund but can’t admit it without admitting to their own corruption.",
            "title_similarity": "0.41068488",
            "sentiment_compound": 0.6065
        },
        {
            "id": "hyn70oq",
            "score": 14635,
            "text": "Russians are fighting for nothing. Ukrainians are fighting for their country and freedom. There’s a difference.",
            "title_similarity": "0.42843133",
            "sentiment_compound": 0.5873
        },
        {
            "id": "hynbls4",
            "score": 14868,
            "text": "Ok. I’m in Kharkiv right now. “Regained control” is kinda too loud, cause we never lost control to begin with.\n\nJust three piece of shit platoons on light armored vehicles slipped through defenses.\n\nThey were all tracked down and destroyed within 2-3 hours. Literally no chance. Our military is making a light work of those guys.\n\nNow the real problem is that Russians keep shelling the city and they mostly damaged civilian housing thus far.\n\nAnd they are doing it on purpose, targeting civilian areas to terrorize us.\n\nNot that we are scared, most of my friends went from ”oh shit where to run” to “lmao let THEM run”.",
            "title_similarity": "0.44902945",
            "sentiment_compound": -0.9579
        },
        {
            "id": "hyndr2b",
            "score": 1209,
            "text": "Fuck, Putin. Many Russian officials and Russian civilians are against the war and his party still went through with it. I wish nothing less than the worst for that piece of shit terrorizing innocent civilians. \n\nPoor parents and kids are begging for their lives and this guy has the audacity to not only start a war, but continue with it even people are obviously hurting.\n\nRot in hell, Putin",
            "title_similarity": "0.30935806",
            "sentiment_compound": -0.9681
        },
        {
            "id": "hyndo01",
            "score": 520,
            "text": "Yeah you can already see [multiple videos of Ukrainian forces getting back control of the city](https://www.youtube.com/watch?v=CrMpATZPSLI). It's actually insane to be able to witness this war almost live. (no gore / death in video, just gunfights and loot)",
            "title_similarity": "0.42349386",
            "sentiment_compound": -0.8757
        },
        {
            "id": "hyn9tqg",
            "score": 945,
            "text": "Putin is going to provoke a coup d’etat in Russia",
            "title_similarity": "0.38065428",
            "sentiment_compound": -0.4019
        },
        {
            "id": "hymyxpo",
            "score": 3,
            "text": "Hooray!",
            "title_similarity": "0.12596697",
            "sentiment_compound": 0.5562
        },
        {
            "id": "hyn2h1r",
            "score": 1,
            "text": "👏",
            "title_similarity": "0.18323827",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyn2nmb",
            "score": 2,
            "text": "Big if true",
            "title_similarity": "0.27755642",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hyn4n1t",
            "score": 1,
            "text": "💪💪💪🔵🟡",
            "title_similarity": "0.18323827",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyn53g6",
            "score": 2,
            "text": "Yeah, badass. Kill those invading bitches",
            "title_similarity": "0.27692786",
            "sentiment_compound": -0.7184
        },
        {
            "id": "hyn53hk",
            "score": 14,
            "text": "Yeah Moe those russians sure did suck last night. They just plain sucked. I've seen countries suck before, but they were the suckiest bunch of sucks that ever sucked.",
            "title_similarity": "0.39811522",
            "sentiment_compound": -0.872
        },
        {
            "id": "hyn5ht2",
            "score": 1,
            "text": "Amazing if true! Glory to Ukraine 🇺🇦",
            "title_similarity": "0.46244085",
            "sentiment_compound": 0.8858
        },
        {
            "id": "hyn65my",
            "score": 2,
            "text": "Fuck yes. Fuck Putin.",
            "title_similarity": "0.3902011",
            "sentiment_compound": -0.6486
        },
        {
            "id": "hyn6kmq",
            "score": 1,
            "text": "Real question, what defines military control over a city? I'm assuming at any one point in time there are elements from both sides scattered around the area, so is there some sort of condition that when achieved determines that one side now has control?",
            "title_similarity": "0.3581148",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyn70hv",
            "score": 1,
            "text": "Героям слава!\n\nOur thought, our song\n\nWill not die, will not perish…\n\nOh there, people, is our glory,\n\nGlory of Ukraine!",
            "title_similarity": "0.34563565",
            "sentiment_compound": 0.8941
        },
        {
            "id": "hyn7f6o",
            "score": 1,
            "text": "Get wrekt Putin",
            "title_similarity": "0.41380203",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyn7fwj",
            "score": 1,
            "text": "I’m going to enjoy these moments because we know eventually Russia will just keep throwing people at them until they overwhelm their defences. Even if the cities fall, the fight will be far from over. Keep it up, Ukraine!",
            "title_similarity": "0.42613554",
            "sentiment_compound": -0.1511
        },
        {
            "id": "hyn7fwn",
            "score": 1,
            "text": "Breaching and Holding a Large City is a totally different WarFare.  Can it be as Casualties mount…Russian forces begin too question.  Why ???",
            "title_similarity": "0.42663634",
            "sentiment_compound": -0.4621
        },
        {
            "id": "hyn7wt7",
            "score": 1,
            "text": "I feel like a lot of Europeans and people\n around the world will go to\nUkraine and join them to defend these brave people…Vitali Klitschko (ex world champion of boxing and now mayor of Kiev) is fighting to defend Ukraine. Lot’s of Europeans will join him on the ground. I am a peaceful person but Ukraine amazing! Don’t quit! We believe!",
            "title_similarity": "0.46285826",
            "sentiment_compound": 0.9328
        },
        {
            "id": "hyn7wx5",
            "score": 6,
            "text": "Napoleon 2: potato mode",
            "title_similarity": "0.2950904",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyn843n",
            "score": 8,
            "text": "What does control even mean in this case. You militarily occupy and then what. You are just housesitting with unruly occupants until Ukraine reinforcements come.",
            "title_similarity": "0.4619528",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyn84lq",
            "score": 13,
            "text": "Fucking hell Russia has no military strategy at all. Has nothing changed since WWII???",
            "title_similarity": "0.33820373",
            "sentiment_compound": -0.824
        },
        {
            "id": "hyn86tl",
            "score": 1,
            "text": "Putin is losing!",
            "title_similarity": "0.38147026",
            "sentiment_compound": -0.4389
        },
        {
            "id": "hyn8dh5",
            "score": 1,
            "text": "God bless Ukraine! 🇺🇦 🇺🇸",
            "title_similarity": "0.47602367",
            "sentiment_compound": 0.636
        },
        {
            "id": "hyn8r3j",
            "score": 1,
            "text": "pog",
            "title_similarity": "0.119843975",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyn8sxl",
            "score": 2,
            "text": "Slavaaa ✌🏻✌🏻✌🏻🇺🇦🇺🇦\nPozdrav Ukraini iz Zagreba 🇭🇷",
            "title_similarity": "0.39260536",
            "sentiment_compound": 0.8625
        },
        {
            "id": "hyn941v",
            "score": 2,
            "text": "Sweet. I was starting to get a bit worried.",
            "title_similarity": "0.09167531",
            "sentiment_compound": 0.2023
        },
        {
            "id": "hyn98pf",
            "score": 51,
            "text": "That one guy yesterday did it",
            "title_similarity": "0.35164076",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyn9ewx",
            "score": 1,
            "text": "LETS GOOOOOOOO!",
            "title_similarity": "0.14044102",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyn9i4y",
            "score": 1,
            "text": "It's been like a week now, 1 would think if Putin really wanted Ukraine he'd send more than a few ppl to take over these city's.",
            "title_similarity": "0.6911464",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hyn9i8a",
            "score": 6,
            "text": "⚡️ BREAKING; Ukraine delegation to meet Belarus and Russia delegation at Pripyat River on Belarus border for peace talks without preconditions. https://twitter.com/KyivIndependent/status/1497929907195756546?s=20&t=Q7OZtkP1MRcNSIUu8VkhLw",
            "title_similarity": "0.44653887",
            "sentiment_compound": 0.5423
        },
        {
            "id": "hyn9i8k",
            "score": 2,
            "text": "YES!!! 🇺🇦",
            "title_similarity": "0.19749168",
            "sentiment_compound": 0.6496
        },
        {
            "id": "hyn9ijl",
            "score": 4,
            "text": "Slava Ukraini!",
            "title_similarity": "0.39332473",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyn9ozv",
            "score": 2,
            "text": "Wow, for such big bad bullies Russia are just a bit shit at this whole war thing.",
            "title_similarity": "0.38449067",
            "sentiment_compound": -0.802
        },
        {
            "id": "hyn9ozz",
            "score": 3,
            "text": "Hope you reading this Putin.  F..k you",
            "title_similarity": "0.33942318",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hyn9p6z",
            "score": 82,
            "text": "Nukes aside, I've always imagined that the Russian military would be much larger, better equipped etc etc than it's neighbours such as Ukraine - can someone explain why they haven't essentially steamrolled over the country or is my impression of the military strength of both countries just waaaaay off?",
            "title_similarity": "0.5572845",
            "sentiment_compound": 0.7906
        },
        {
            "id": "hyn9vtd",
            "score": 7,
            "text": "Give ‘em hell, Ukrainians.",
            "title_similarity": "0.3858388",
            "sentiment_compound": -0.6808
        },
        {
            "id": "hyn9yqs",
            "score": 4,
            "text": "Heh, got his ass handed back to him again",
            "title_similarity": "0.27047098",
            "sentiment_compound": -0.6249
        },
        {
            "id": "hyn9yz9",
            "score": 5,
            "text": "I’m honestly shocked at how pathetic the Russian military are.  I was always under the impression that they had one of the worlds top military’s.  I feel like they couldn’t even handle taking a shit without messing it up now.",
            "title_similarity": "0.4147402",
            "sentiment_compound": -0.34
        },
        {
            "id": "hyna7x9",
            "score": 2,
            "text": "That’s a big wow!!!!!!!",
            "title_similarity": "0.25389564",
            "sentiment_compound": 0.7156
        },
        {
            "id": "hynab0q",
            "score": 3,
            "text": "Even the Russian forces are fighting Ukraine even less than half-heartedly. The Russian armed forces have been against this invasion idea right from the start. They are simply following orders just for the sake of it. So who knows if the invading forces themselves allowed some of their vehicles to become easy targets to convince Putin that Ukraine was  more substantial than expected.",
            "title_similarity": "0.38598153",
            "sentiment_compound": 0.5413
        },
        {
            "id": "hynadsu",
            "score": 2,
            "text": "Glory to Ukraine.",
            "title_similarity": "0.49478912",
            "sentiment_compound": 0.5423
        },
        {
            "id": "hynaekm",
            "score": 1,
            "text": "Anyone know a good stream for what’s going on",
            "title_similarity": "0.1894021",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hynahbd",
            "score": 3,
            "text": "They never lost it.",
            "title_similarity": "0.1014418",
            "sentiment_compound": 0.2411
        },
        {
            "id": "hynakjl",
            "score": 4,
            "text": "I have to think this puts Putin in a difficult position with the Oligarchs if true.",
            "title_similarity": "0.3493219",
            "sentiment_compound": 0.0772
        },
        {
            "id": "hynamty",
            "score": 13,
            "text": "FUCK PUTIN AND HIS CRONIES.\n\nFUCK THEM ALL",
            "title_similarity": "0.3282745",
            "sentiment_compound": -0.7906
        },
        {
            "id": "hynars9",
            "score": 4,
            "text": "For everything that is repugnant about war- these guys are seriously bad ass. No wonder Putin does not want them to join Nato. It makes it harder for him to take back the smaller countries like Estonia.",
            "title_similarity": "0.3019275",
            "sentiment_compound": 0.1724
        },
        {
            "id": "hynayaz",
            "score": 2,
            "text": "When Ukraine take Russia?",
            "title_similarity": "0.51089275",
            "sentiment_compound": 0.0
        },
        {
            "id": "hynb73n",
            "score": 4,
            "text": "Putin has failed already 😂😂😂",
            "title_similarity": "0.38257068",
            "sentiment_compound": 0.6597
        },
        {
            "id": "hynb7md",
            "score": 2,
            "text": "\nHey /u/Akid0uu,\n\n\nThis is now the top post on reddit. It will be recorded at /r/topofreddit with all the other top posts.",
            "title_similarity": "0.45183274",
            "sentiment_compound": 0.3818
        },
        {
            "id": "hynb85f",
            "score": 2,
            "text": "Fuck Putin",
            "title_similarity": "0.36524922",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hynbbop",
            "score": 3,
            "text": "That one guy from the r/bestof post almost certainly drove out the Russians himself",
            "title_similarity": "0.5054862",
            "sentiment_compound": 0.2748
        },
        {
            "id": "hynbh8o",
            "score": 3,
            "text": "Bravo Zulu, keep up the fight.",
            "title_similarity": "0.28517088",
            "sentiment_compound": -0.3818
        },
        {
            "id": "hynbmbd",
            "score": 3,
            "text": "Go Ukraine!",
            "title_similarity": "0.47703254",
            "sentiment_compound": 0.0
        },
        {
            "id": "hynbnao",
            "score": 2,
            "text": "This whole fiasco is just super embarrassing for Putin. Its just a reminder that Russia is no longer a superpower.",
            "title_similarity": "0.42793185",
            "sentiment_compound": -0.4939
        },
        {
            "id": "hynbpn1",
            "score": 3,
            "text": "Fckin Bastards did it!! Balls of steel",
            "title_similarity": "0.31658095",
            "sentiment_compound": -0.6792
        },
        {
            "id": "hynbrxh",
            "score": 3,
            "text": "So Hitler bunker meme when?",
            "title_similarity": "0.2882466",
            "sentiment_compound": 0.0
        },
        {
            "id": "hynbugp",
            "score": 1,
            "text": "Stot",
            "title_similarity": "0.2146836",
            "sentiment_compound": 0.0
        },
        {
            "id": "hynbxqi",
            "score": 1,
            "text": "Kharkiv changed hands like 4 times during WWII so this doesnt surprise me",
            "title_similarity": "0.44077253",
            "sentiment_compound": 0.1084
        },
        {
            "id": "hynbxzh",
            "score": 23,
            "text": "Shit is not going well for Russia. I'm very impressed with Ukraine's resolve.",
            "title_similarity": "0.45647353",
            "sentiment_compound": 0.1479
        },
        {
            "id": "hynbzsh",
            "score": 3,
            "text": "Russia failed war 101 dont go to war with \"russia\" in winter.",
            "title_similarity": "0.3387975",
            "sentiment_compound": -0.6192
        },
        {
            "id": "hync3cl",
            "score": 2,
            "text": "The Ukraine will forever be known as badass now",
            "title_similarity": "0.41270247",
            "sentiment_compound": 0.34
        },
        {
            "id": "hync418",
            "score": 2,
            "text": "Glory to Ukraine",
            "title_similarity": "0.47337216",
            "sentiment_compound": 0.5423
        },
        {
            "id": "hync6d3",
            "score": 2,
            "text": "Is anyone getting the feeling that Putin knows he and his brainwashed Q column aren‘t getting any younger, and decided to pull the trigger on this plan and go down guns a-blazin‘ on the off chance it works?",
            "title_similarity": "0.31946796",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hync71g",
            "score": 2,
            "text": "The Ukraine is not weak!",
            "title_similarity": "0.3442753",
            "sentiment_compound": 0.4015
        },
        {
            "id": "hync97v",
            "score": 2,
            "text": "The videos that are coming out of abandoned Russian vehicles and equipment and destroyed columns is just insane.",
            "title_similarity": "0.3088795",
            "sentiment_compound": -0.836
        },
        {
            "id": "hynca4b",
            "score": 2,
            "text": "Ukrainians, please do shit all over Russians\n\nAnd please show ZERO remorse",
            "title_similarity": "0.35804594",
            "sentiment_compound": -0.2732
        },
        {
            "id": "hyncafm",
            "score": 2,
            "text": "Hey, that guy did it!",
            "title_similarity": "0.2033835",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyncc2l",
            "score": 3,
            "text": "The Russian advance is so chaotic and unorganized. They send lightly armed reconnaissance units into cities. The major armored columns are moving too slowly and have barely entered the cities. I understand probing defenses ,but it's being done so haphazardly that it's insanity. They're basically giving Ukrainians weapons for the main advance and throwing away their own soldiers lives. The videos of the convoys fighting is like watching a train wreck. They panic and disperse.\n\nWhat a mess.",
            "title_similarity": "0.37046018",
            "sentiment_compound": -0.9664
        },
        {
            "id": "hyncjs1",
            "score": 2,
            "text": "And many young Russian soldiers evidently were nit told that they were going to war with the Ukranians. It accounts for angry parents in Russia (against Putin) and scared young men surrendering 🇺🇦",
            "title_similarity": "0.32583448",
            "sentiment_compound": -0.8779
        },
        {
            "id": "hynckam",
            "score": 1,
            "text": "I am afraid that Russia might retreat on purpose then implement tactical bombing.",
            "title_similarity": "0.25485337",
            "sentiment_compound": 0.2023
        },
        {
            "id": "hynckit",
            "score": 14,
            "text": "How humiliating for Putin and the Russian army. Viva Ukraine",
            "title_similarity": "0.4704424",
            "sentiment_compound": -0.296
        },
        {
            "id": "hynckmb",
            "score": 6,
            "text": "So Putin, which will it be? The Gadaffi (sodomized by a bayonet and shot), the Mussolini (shot and stoned to death), or the Hitler (bullet to the brain in an underground bunker)?",
            "title_similarity": "0.28157067",
            "sentiment_compound": -0.644
        },
        {
            "id": "hyncn7z",
            "score": 3,
            "text": "Wait, when the hell did they lose Kharkiv??",
            "title_similarity": "0.451375",
            "sentiment_compound": -0.8253
        },
        {
            "id": "hyncnm2",
            "score": 2,
            "text": "At this rate Russia is going to want protection from Ukraine and Papa Zelensky!",
            "title_similarity": "0.392483",
            "sentiment_compound": 0.1511
        },
        {
            "id": "hyncnrh",
            "score": 1,
            "text": "Ukraine is no joke",
            "title_similarity": "0.3304749",
            "sentiment_compound": -0.2235
        },
        {
            "id": "hyncnyj",
            "score": 1,
            "text": "HE WAS RIGHT!!\n\nhttps://www.reddit.com/r/worldnews/comments/t22676/kyiv_mayor_no_russian_troops_in_the_capital/hyk4iq9",
            "title_similarity": "0.4839061",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyncpxp",
            "score": 2,
            "text": "Zelensky should great care and not trust putin,putin is getting desperate.That meeting would definitely be a trap to try and assinate zelensky.Putin is a liar and has a history of assinating opponents.When monday comes and putins corrupt cronies start losing money putin wont be safe anywhere.",
            "title_similarity": "0.34521478",
            "sentiment_compound": -0.32
        },
        {
            "id": "hyncqfj",
            "score": 2,
            "text": "RUSSIA NEEDS TO FUCK OFF",
            "title_similarity": "0.34883422",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hyncx1a",
            "score": 2,
            "text": "Any equipment salvaged should be used again pewtin.",
            "title_similarity": "0.21251035",
            "sentiment_compound": 0.0
        },
        {
            "id": "hynd05s",
            "score": 1,
            "text": "Conversations about the Ukraine/Russia bullshit going on.\n\nhttps://youtu.be/7xe\\_grjQDD4?t=30",
            "title_similarity": "0.49036324",
            "sentiment_compound": -0.5859
        },
        {
            "id": "hynd1xr",
            "score": 4,
            "text": "I can’t seem to get enough of these bowls of Russian defeat for breakfast…",
            "title_similarity": "0.36898044",
            "sentiment_compound": -0.4588
        },
        {
            "id": "hynd7wg",
            "score": 2,
            "text": "Putin likes to think himself like Julius Caesar. He seems to have forgotten what happened to that guy.",
            "title_similarity": "0.27062654",
            "sentiment_compound": 0.5267
        },
        {
            "id": "hynd9iv",
            "score": 1,
            "text": "Legends",
            "title_similarity": "0.17158356",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyndh7d",
            "score": 2,
            "text": "In fact, we were not losing Kharkiv, there were just small groups of Russian soldiers",
            "title_similarity": "0.3904856",
            "sentiment_compound": 0.2924
        },
        {
            "id": "hyndhfd",
            "score": 2,
            "text": "Great! Meanwhile Putin just put his nuclear rockets on alert. I don’t think he’s messing around. He’s too determined.\n\nWe’re all still so naive but the end is near. I am buying a gun and hangout in my bunker. Take care everyone.",
            "title_similarity": "0.3254221",
            "sentiment_compound": 0.6674
        },
        {
            "id": "hyndifw",
            "score": 3,
            "text": "Russian military would do well to remember Stalingrad. They fought the Germans in some cases room by room, building by building. What makes them think Ukraine wouldn’t do the same thing for their freedom from invaders",
            "title_similarity": "0.4762897",
            "sentiment_compound": 0.6124
        },
        {
            "id": "hyndj23",
            "score": 1,
            "text": "Yikes! One of the small blurbs from the timeline further down is that Belarus is mobilizing to join the war on Russia's side. Looks like the war is going to expand now that Ukraine is holding. I heard French GIGN went into Kiev or something. Not sure how much longer they can last against Russia if they are just by themselves.",
            "title_similarity": "0.54200363",
            "sentiment_compound": -0.6192
        },
        {
            "id": "hyndkya",
            "score": 3,
            "text": "Never lost control",
            "title_similarity": "0.14970396",
            "sentiment_compound": 0.2411
        },
        {
            "id": "hyndl4s",
            "score": 4,
            "text": "Kharkov is a death trap for Russians if you know the history",
            "title_similarity": "0.45491368",
            "sentiment_compound": -0.7351
        },
        {
            "id": "hyndn2z",
            "score": 1,
            "text": "Seems like Russia is starting to lose the war",
            "title_similarity": "0.4382344",
            "sentiment_compound": -0.6249
        },
        {
            "id": "hyndp9h",
            "score": 1,
            "text": "Give ‘em hell! Slava Ukraini!",
            "title_similarity": "0.34138012",
            "sentiment_compound": -0.7339
        },
        {
            "id": "hyndpc7",
            "score": 1,
            "text": "putin is pulling his hair right now",
            "title_similarity": "0.2995314",
            "sentiment_compound": 0.0
        },
        {
            "id": "hynduri",
            "score": 1,
            "text": "Lets goooooooooo",
            "title_similarity": "0.13957587",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyndwt7",
            "score": 1,
            "text": "I love this so hard",
            "title_similarity": "0.16863249",
            "sentiment_compound": 0.5434
        },
        {
            "id": "hyndx46",
            "score": 3,
            "text": "Lol Putin is a joke. If it wasnt for the Nukes Russia would be nothing",
            "title_similarity": "0.3746168",
            "sentiment_compound": 0.6124
        },
        {
            "id": "hyndxuo",
            "score": 22,
            "text": "It’s like fighting to live vs fighting cause you didn’t go to college.",
            "title_similarity": "0.31009954",
            "sentiment_compound": -0.3612
        },
        {
            "id": "hyndzf2",
            "score": 3,
            "text": "Fuck yeah. Go UKRAINE!",
            "title_similarity": "0.47321117",
            "sentiment_compound": -0.3802
        },
        {
            "id": "hyndzx5",
            "score": 3,
            "text": "HAhaha let’s go Ukraine!!!\n\nRussians might have equipment but will not have the money and fight spirited men to keep it operational for very long.\nStay strong and resist",
            "title_similarity": "0.404274",
            "sentiment_compound": 0.7408
        },
        {
            "id": "hyne3xl",
            "score": 1,
            "text": "Vladimir just keeps on taking L’s.",
            "title_similarity": "0.2280516",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyne66n",
            "score": 1,
            "text": "Anyone else think the BBC coverage has been very pro Russia?",
            "title_similarity": "0.44298238",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyne8fk",
            "score": 2,
            "text": "Is this confirmed? \n\nIf so Russia is either baiting or in deep shit.",
            "title_similarity": "0.4289084",
            "sentiment_compound": -0.5574
        },
        {
            "id": "hyne9ib",
            "score": 4,
            "text": "Wouldn't it be something if Ukraine won?",
            "title_similarity": "0.48886454",
            "sentiment_compound": 0.5719
        },
        {
            "id": "hynebub",
            "score": 2,
            "text": "This is good news, but I am still weary since the Russians still have a large amount of troops that still have not been committed to the fight. As Russian military leaders adapt to the situation, I am afraid that we will see a major, more potent, offensive push sometime this week.",
            "title_similarity": "0.50280786",
            "sentiment_compound": -0.9029
        },
        {
            "id": "hynee3t",
            "score": 3,
            "text": "Putin getting his pants pulled down on the world stage",
            "title_similarity": "0.35266954",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyneff3",
            "score": 1,
            "text": "Headline is clickbait… they never lost control, they just defended it.",
            "title_similarity": "0.2251817",
            "sentiment_compound": 0.2411
        },
        {
            "id": "hynenqz",
            "score": 4,
            "text": "From everything i've been reading about this it seems like Russia is kinda getting their ass kicked",
            "title_similarity": "0.42019093",
            "sentiment_compound": -0.1868
        },
        {
            "id": "hyneprh",
            "score": 2,
            "text": "I don't get why Russia is dicking about so much, why start a war you cba to win",
            "title_similarity": "0.35995704",
            "sentiment_compound": -0.0258
        },
        {
            "id": "hyneqho",
            "score": 1,
            "text": "Realistically someone please explain this, at what point do Russian soldiers start defecting to Ukraine?",
            "title_similarity": "0.48918864",
            "sentiment_compound": -0.128
        },
        {
            "id": "hyneqy4",
            "score": 4,
            "text": "It’s not the size of the dog in the fight but the size of the fight in the dog that matters.",
            "title_similarity": "0.26303372",
            "sentiment_compound": -0.6187
        },
        {
            "id": "hynercb",
            "score": 2,
            "text": "SLAVA UKRAINI!",
            "title_similarity": "0.39332473",
            "sentiment_compound": 0.0
        },
        {
            "id": "hynet3b",
            "score": 2,
            "text": "Good!  This is what happens when civilians take up arms.  FU Putin\n\nNow someone needs to off the freak",
            "title_similarity": "0.32119",
            "sentiment_compound": -0.7734
        },
        {
            "id": "hynevbz",
            "score": 3,
            "text": "Does ukraine have anti-nuke weapons?\n\nI fear Putin may spaz out and just nuke kiev if he cant win the old fashioned way.",
            "title_similarity": "0.4087715",
            "sentiment_compound": -0.847
        },
        {
            "id": "hynevm0",
            "score": 2,
            "text": "Putin was already cracking the shits because he thought it was gonna be an easy W. Now getting pushed back will make him pissed.",
            "title_similarity": "0.27360186",
            "sentiment_compound": -0.6597
        },
        {
            "id": "hynew4y",
            "score": 3,
            "text": "Fuck yeah! I feel like any win for Ukraine in this fight is a win for us all.",
            "title_similarity": "0.43327212",
            "sentiment_compound": 0.7263
        },
        {
            "id": "hynew8z",
            "score": 2,
            "text": "They are going to be able to hold them off for a very long time I think. Especially if they can hold out for more aid and ammunition",
            "title_similarity": "0.30104327",
            "sentiment_compound": 0.0
        },
        {
            "id": "hynexwn",
            "score": 3,
            "text": "Ukraine is not weak",
            "title_similarity": "0.31261373",
            "sentiment_compound": 0.3412
        },
        {
            "id": "hynf0j5",
            "score": 1,
            "text": "\"One man defending his home is more powerful than ten hired soldiers.\" - Kevin Costner's Robin Hood",
            "title_similarity": "0.4638713",
            "sentiment_compound": 0.4754
        },
        {
            "id": "hynf2gi",
            "score": 1,
            "text": "This part, this little part, is called happiness",
            "title_similarity": "0.12134764",
            "sentiment_compound": 0.5574
        },
        {
            "id": "hynf467",
            "score": 2,
            "text": "Now repeat after me, fuck Putin, and you’re a piece of shit for shelling civilians.",
            "title_similarity": "0.31872368",
            "sentiment_compound": -0.7964
        },
        {
            "id": "hynf4ds",
            "score": 1,
            "text": "why did they lose control",
            "title_similarity": "0.20975116",
            "sentiment_compound": -0.4019
        },
        {
            "id": "hynf54e",
            "score": 3,
            "text": "Hate to say this but hearing news that a country regained a city without hearing it lost it in the first place is never a good sign.",
            "title_similarity": "0.38003427",
            "sentiment_compound": -0.4617
        },
        {
            "id": "hynf57v",
            "score": 2,
            "text": "Russia is raising their nuclear and defense systems. Putin is feeling backed into a corner. This could still get quite ugly.",
            "title_similarity": "0.40891013",
            "sentiment_compound": -0.3597
        },
        {
            "id": "hynf5hk",
            "score": 2,
            "text": "People forget Ukraine might not be a superpower but their military is ranked 22nd in the world which isn't bad at all and they are fighting for their freedom and their country unlike Russian soldiers that don't want to be there",
            "title_similarity": "0.52400786",
            "sentiment_compound": 0.7609
        },
        {
            "id": "hynf5yi",
            "score": 2,
            "text": "Vlad hates it when he loses his Kharkiv",
            "title_similarity": "0.39153647",
            "sentiment_compound": -0.6369
        },
        {
            "id": "hynf774",
            "score": 3,
            "text": "\"LONG LIVE FREEDOM\" May God bless the Ukrainians and those who seek peace. - Have Faith and God will stand by your side.\"\n\nPsalms 91:7 ^\nYou will see a thousand falling by your side, and ten thousand at your right hand; but it will not come near you.",
            "title_similarity": "0.30085665",
            "sentiment_compound": 0.8725
        },
        {
            "id": "hynf8cs",
            "score": 1,
            "text": "That's a stunning victory, I hope Ukraine turns it all around.",
            "title_similarity": "0.46822664",
            "sentiment_compound": 0.6705
        },
        {
            "id": "hynfa4c",
            "score": 3,
            "text": "Fuck that tiny little napoleon complex, short piece of shit Putin.",
            "title_similarity": "0.32968098",
            "sentiment_compound": -0.7964
        },
        {
            "id": "hynfd75",
            "score": 1,
            "text": "I bet the peace talk will end in 5 min.",
            "title_similarity": "0.38649815",
            "sentiment_compound": 0.5423
        },
        {
            "id": "hynfjve",
            "score": 2,
            "text": "I’m not even Ukrainian and I want to shout GLORY TO UKRAINE! Their fighters are so strong and so brave. There are no words for it.",
            "title_similarity": "0.37380108",
            "sentiment_compound": 0.8936
        },
        {
            "id": "hynfjze",
            "score": 2,
            "text": "Oh, my heart skipped a beat. I hope this will give hope to and inspire other Ukrainians.",
            "title_similarity": "0.31864464",
            "sentiment_compound": 0.9287
        },
        {
            "id": "hynfnx0",
            "score": 2,
            "text": "The guy wants to use nuclear weapons. Stay calm.",
            "title_similarity": "0.108745985",
            "sentiment_compound": -0.1531
        },
        {
            "id": "hynfo94",
            "score": 2,
            "text": "Lets hope a potential invasion of Taiwan would go very similar for the CCP.",
            "title_similarity": "0.22809681",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hynfpbk",
            "score": 3,
            "text": "Sure happy to wake up and hear good news about Ukraine.",
            "title_similarity": "0.30228448",
            "sentiment_compound": 0.836
        },
        {
            "id": "hynfpdi",
            "score": 3,
            "text": "Perhaps the russian troops think this is stupid and are not fully following orders?  They rarely seem to be getting out of their armored vehicles.",
            "title_similarity": "0.3143705",
            "sentiment_compound": -0.5267
        },
        {
            "id": "hynfq6l",
            "score": 1,
            "text": "This sets the Russians up for a more protracted war. I am assuming they thought they would just roll in and be done.",
            "title_similarity": "0.3751118",
            "sentiment_compound": -0.6344
        },
        {
            "id": "hynfqcf",
            "score": 3,
            "text": "Long live Ukraine! 🌻🌻🌻🌻🌻🌻",
            "title_similarity": "0.52466774",
            "sentiment_compound": 0.0
        },
        {
            "id": "hynfrau",
            "score": 3,
            "text": "Fuck Putin.",
            "title_similarity": "0.3467456",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hynfrme",
            "score": 3,
            "text": "Kick those Russians in the taint",
            "title_similarity": "0.35811287",
            "sentiment_compound": 0.0
        },
        {
            "id": "hynfsbi",
            "score": 3,
            "text": "GO UKRAINE!!! KICK THEIR ASS! FUCK PUTIN!",
            "title_similarity": "0.4284138",
            "sentiment_compound": -0.8469
        },
        {
            "id": "hynfth4",
            "score": 1,
            "text": "im just wondering about Ukrainians comment on the differences between pro Russian kuchma gov and current pro American gov?",
            "title_similarity": "0.5167943",
            "sentiment_compound": 0.0
        },
        {
            "id": "hynftlb",
            "score": 2,
            "text": "🇺🇦🇺🇦🇺🇦🇺🇦",
            "title_similarity": "0.18323827",
            "sentiment_compound": 0.0
        },
        {
            "id": "hynfzs5",
            "score": 1,
            "text": "Yeah!!!!",
            "title_similarity": "0.13748567",
            "sentiment_compound": 0.5216
        },
        {
            "id": "hynfzw2",
            "score": 2,
            "text": "Ukraine: fuck yeah!",
            "title_similarity": "0.4592495",
            "sentiment_compound": -0.3802
        },
        {
            "id": "hyng7oy",
            "score": 1,
            "text": "Finally a thread where the comments make sense.",
            "title_similarity": "0.1894067",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyng8p0",
            "score": 3,
            "text": "When does the counteroffensive start and there becomes an East Ukraine?",
            "title_similarity": "0.4858196",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyng8v9",
            "score": 3,
            "text": "It's my city, there are still bombings here, especially in my neighborhood.",
            "title_similarity": "0.35093886",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyng9pz",
            "score": 2,
            "text": "Fucking get in. I hope the Ukrainians fucking maul the Russians. Send them running scared and bloody. Would be the most amazing outcome!",
            "title_similarity": "0.3834214",
            "sentiment_compound": 0.358
        },
        {
            "id": "hyngbev",
            "score": 1,
            "text": " Glory to Ukraine!",
            "title_similarity": "0.47029778",
            "sentiment_compound": 0.5848
        },
        {
            "id": "hynghxd",
            "score": 1,
            "text": "lol wow the only thing Putin has shown us is that his military is WEAK!",
            "title_similarity": "0.42298293",
            "sentiment_compound": 0.5038
        },
        {
            "id": "hynghze",
            "score": 2,
            "text": "yees! Ukraine!",
            "title_similarity": "0.45988998",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyngigk",
            "score": 2,
            "text": "God Bless them. ❤The prayers are being answered🙏",
            "title_similarity": "0.2048657",
            "sentiment_compound": 0.5994
        },
        {
            "id": "hyngkw2",
            "score": 2,
            "text": "slava ukrayini",
            "title_similarity": "0.353817",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyngmtg",
            "score": 2,
            "text": "That dude did it",
            "title_similarity": "0.18160203",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyngoe2",
            "score": 3,
            "text": "Russia overextended itself. They could have taken the regions to the east and called it a day, but instead they wanted the whole fucking country. Hell, even then, they could have taken the East and waited 2-3 years to prepare another invasion.",
            "title_similarity": "0.42755553",
            "sentiment_compound": -0.8324
        },
        {
            "id": "hyngpvg",
            "score": 3,
            "text": "It’s so hilarious how bad ts is going for Russia.",
            "title_similarity": "0.39241517",
            "sentiment_compound": -0.1952
        },
        {
            "id": "hyngshf",
            "score": 3,
            "text": "🇺🇦🇺🇦🇺🇦",
            "title_similarity": "0.18323827",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyngswy",
            "score": 1,
            "text": "ok I'm gonna need some ELI5.\n\nWhy are Russia shelling civilian buildings? Surely they know where the Ukraine infrastructure/military complexes are? What purpose does destroying the local gym provide??",
            "title_similarity": "0.40868428",
            "sentiment_compound": 0.3527
        },
        {
            "id": "hyngwgt",
            "score": 3,
            "text": "glory to ukraine",
            "title_similarity": "0.47337216",
            "sentiment_compound": 0.5423
        },
        {
            "id": "hyngz2t",
            "score": 1,
            "text": "Man as much as Putin likes to put on that stone cold tough guy persona, he sure does suck ass as a warlord.",
            "title_similarity": "0.28896248",
            "sentiment_compound": -0.4215
        },
        {
            "id": "hyngz9g",
            "score": 2,
            "text": "Where do you expect them to go when the bombs fall?",
            "title_similarity": "0.24451499",
            "sentiment_compound": 0.0
        },
        {
            "id": "hynh3um",
            "score": 3,
            "text": "I may be repeating someone else's post here, but there's a lot to be said about the fact that Ukraine is putting up a bigger resistance than they expected, and so these Russian soldiers are losing morale because they thought this would be much easier.",
            "title_similarity": "0.44936293",
            "sentiment_compound": 0.0772
        },
        {
            "id": "hynh41i",
            "score": 1,
            "text": "Let’s goo",
            "title_similarity": "0.11160433",
            "sentiment_compound": 0.0
        },
        {
            "id": "hynhe7i",
            "score": 3,
            "text": "Slava Ukraini, Heroiam Slava!",
            "title_similarity": "0.4114682",
            "sentiment_compound": 0.0
        },
        {
            "id": "hynhfkg",
            "score": 2,
            "text": "Vladimir Putin’s made the biggest mistake ever.  he thought it was going to be easy. he thought it was going to be over in A couple of days. He had no idea how hard they Ukrainians Would fight. \nThe Ukraine has been a free country for 30 years now. They do not want to go back to being a Soviet country they like their freedom.",
            "title_similarity": "0.5060798",
            "sentiment_compound": 0.7251
        },
        {
            "id": "hynhn2l",
            "score": 3,
            "text": "Putin, go fuck yourself.",
            "title_similarity": "0.29699713",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hynhn44",
            "score": 3,
            "text": "Ukraine is an impressive country!!",
            "title_similarity": "0.49816787",
            "sentiment_compound": 0.5972
        },
        {
            "id": "hynhnxl",
            "score": 2,
            "text": "Putin is on his way to having as shit of a war record as tzar nicholas ii",
            "title_similarity": "0.5041313",
            "sentiment_compound": -0.8176
        },
        {
            "id": "hynhpv0",
            "score": 2,
            "text": "I pray  that these Russian asshats get their just karma .Praying for Ukraine 🇺🇦",
            "title_similarity": "0.4030622",
            "sentiment_compound": 0.5859
        },
        {
            "id": "hynhsyy",
            "score": 3,
            "text": "Get fucked, Putin.",
            "title_similarity": "0.32144535",
            "sentiment_compound": -0.6597
        },
        {
            "id": "hynhy73",
            "score": 2,
            "text": "We love you, Ukraine! Stay safe, you beautiful courageous people!",
            "title_similarity": "0.22375533",
            "sentiment_compound": 0.9431
        },
        {
            "id": "hynhybw",
            "score": 1,
            "text": "Get it Ukraine! We support you!",
            "title_similarity": "0.39305633",
            "sentiment_compound": 0.508
        },
        {
            "id": "hyni1bg",
            "score": 1,
            "text": "Are we positive this is true? If so then it’s good af",
            "title_similarity": "0.13345778",
            "sentiment_compound": 0.8612
        },
        {
            "id": "hyni6xi",
            "score": 3,
            "text": "Praying for everyone over there",
            "title_similarity": "0.061435014",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hynia9m",
            "score": 2,
            "text": "/u/onikzin FUCKIN’ A. Praying you, your family and loved ones are ok.",
            "title_similarity": "0.21045512",
            "sentiment_compound": 0.7506
        },
        {
            "id": "hynim2m",
            "score": 2,
            "text": "My only worry at this point is what will putin resort to?\n\n&#x200B;\n\nThis war wasn't supposed to last the weekend and he hasn't even been able to control major cities or airports.",
            "title_similarity": "0.44703597",
            "sentiment_compound": -0.8188
        },
        {
            "id": "hyniplb",
            "score": 3,
            "text": "This war is unfolding in ways no other war has unfolded. The eyes of the world can watch every action through the mobile phone footage of brave civilians defending their homeland.\n\nI saw the light vehicles enter Kharkiv and felt fear for the innocent people of the city. I fell asleep not knowing if this was part of a larger advance.\n\nNow, I begin the day with joy and respect for the Ukrainian people. It must be horrible to fight off any incursion. But, once again, the people of Ukraine have shown their strength and bravery.\n\nGive ‘‘em hell!",
            "title_similarity": "0.36106658",
            "sentiment_compound": 0.4049
        },
        {
            "id": "hynitbx",
            "score": 1,
            "text": "This invasion was truly stupid of Putin. Ukrainians will never give up. Even if the Russians \"win\" the Ukrainian people will still resist because they are fighting for a just cause that they truly believe in. For the Russians dealing with resistance like that will be like trying to punch smoke and the they don't have the morale or the economy for the fight. There's loads of examples throughout history. If they try to occupy a country that doesn't want to be occupied then they are going to have to commit a lot of war crimes to maintain that status and I don't think these conscripted Russian soldiers really want to be known as the new Nazis.",
            "title_similarity": "0.35555905",
            "sentiment_compound": 0.5819
        },
        {
            "id": "hyniy48",
            "score": 1,
            "text": "The world must not let Ukrainia become Syria !",
            "title_similarity": "0.17047039",
            "sentiment_compound": 0.0
        },
        {
            "id": "hynj05d",
            "score": 1,
            "text": "https://youtu.be/rHtZ1Ch8bNE",
            "title_similarity": "0.26745158",
            "sentiment_compound": 0.0
        },
        {
            "id": "hynj2jr",
            "score": 1,
            "text": "Still no videos though?",
            "title_similarity": "0.11762086",
            "sentiment_compound": -0.296
        },
        {
            "id": "hynj4n4",
            "score": 1,
            "text": "Russia's reportedly only deployed a third of its forces stationed near the border (deleted previous comment since you guys though I making stuff up).\n\nhttps://foreignpolicy.com/2022/02/25/russia-invasion-ukraine-war-beginning/",
            "title_similarity": "0.651925",
            "sentiment_compound": 0.0
        },
        {
            "id": "hynj6qo",
            "score": 1,
            "text": "🇺🇦💪🏻",
            "title_similarity": "0.18323827",
            "sentiment_compound": 0.0
        },
        {
            "id": "hynj92n",
            "score": 2,
            "text": "Is anyone here from melitopol? How is the situation there? My friend is there and i havent been able to talk to him since over 24h and im worried",
            "title_similarity": "0.3626505",
            "sentiment_compound": 0.3313
        },
        {
            "id": "hynj970",
            "score": 2,
            "text": "Worried about nukes",
            "title_similarity": "0.15939513",
            "sentiment_compound": -0.296
        },
        {
            "id": "hynj985",
            "score": 1,
            "text": "terrorussians go home.No vodka here.",
            "title_similarity": "0.28468353",
            "sentiment_compound": 0.0
        },
        {
            "id": "hynjd7u",
            "score": 1,
            "text": "Slava Ukraini!!",
            "title_similarity": "0.38697314",
            "sentiment_compound": 0.0
        },
        {
            "id": "hynjfn1",
            "score": 1,
            "text": "And now the fragile ego of the dictator is threatening to kill everyone. Pretty weak for a 'strong man'.",
            "title_similarity": "0.3355742",
            "sentiment_compound": -0.6705
        },
        {
            "id": "hynji96",
            "score": 5,
            "text": "I’m gonna say it. I thought this was was over yesterday. Ukraine is definitely exceeding all of our expectations. Keep up the momentum!",
            "title_similarity": "0.52459633",
            "sentiment_compound": 0.4574
        },
        {
            "id": "hynjuhr",
            "score": 1,
            "text": "Could Fucktard Putin just be working on giving the Ukrainian army the appearance of weakness by sending in the in-experienced first, get morale high on purpose, create an environment of ‘we got this easy’ and then be sending in the real army?\n\nI worry that the confidence levels need to be leveled out. Great morale is awesome, but overconfidence can be deadly.\n\nFuck Putin and his oligarchs. He’s a narcissistic tool, just like a few leaders in the past…",
            "title_similarity": "0.4476723",
            "sentiment_compound": 0.1531
        },
        {
            "id": "hynk45w",
            "score": 1,
            "text": "When I first started hearing of the attacks, I was scared. But I feel a lot better knowing that the situation is coming out better than expected. Thank God.",
            "title_similarity": "0.3469634",
            "sentiment_compound": 0.8934
        },
        {
            "id": "hynk997",
            "score": 1,
            "text": "🇺🇦💛💙",
            "title_similarity": "0.18323827",
            "sentiment_compound": 0.8555
        },
        {
            "id": "hynk9ll",
            "score": 3,
            "text": "Our media is telling us that the Ukranian forces are doing well against the Russian invaders and that Putin has lost the plot etc.\n\nI'm worried that because he now seems to be cornered he will lash out in more serious ways.\n\nHe must realise that the whole world is against him and if he 'loses' he is a dead man walking....an international pariah....he won't be able to lead russia again whatever happens.\n\nI hope to god he doesn't resort to taking the rest of the world down with him.",
            "title_similarity": "0.35643667",
            "sentiment_compound": -0.7713
        },
        {
            "id": "hynkf0f",
            "score": 1,
            "text": "What's Ukrainian for \"run like the mangy curs you are?\"",
            "title_similarity": "0.40632865",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hynkhg5",
            "score": 1,
            "text": "Afghanistan 2.0",
            "title_similarity": "0.3167415",
            "sentiment_compound": 0.0
        },
        {
            "id": "hynkq0g",
            "score": 2,
            "text": "🌻",
            "title_similarity": "0.18323827",
            "sentiment_compound": 0.0
        },
        {
            "id": "hynl6rv",
            "score": 1,
            "text": "Beat the shit out of them! Go 🇺🇦 go",
            "title_similarity": "0.3120098",
            "sentiment_compound": -0.5983
        },
        {
            "id": "hynlylu",
            "score": 1,
            "text": "Great news",
            "title_similarity": "0.211248",
            "sentiment_compound": 0.6249
        },
        {
            "id": "hynm23i",
            "score": 3,
            "text": "Just curious... why are we doing some soft support of finding ways of flooding the Russian troops with flyers that say if they surrender they'll be treated well and have a shot at a life in the west... and if they keep fighting they will be international war criminals and likely die... or some other, better wording.  Need to let the Russian solider know fighting means you're screwed and there's a better way out.",
            "title_similarity": "0.3420629",
            "sentiment_compound": -0.8316
        },
        {
            "id": "hynm9me",
            "score": 45,
            "text": "Sorry Putin. You can keep Steven Seagal as a consolation prize.",
            "title_similarity": "0.29502147",
            "sentiment_compound": 0.4588
        },
        {
            "id": "hynnj15",
            "score": 2,
            "text": "And the crowd goes wild!",
            "title_similarity": "0.11906721",
            "sentiment_compound": 0.0
        },
        {
            "id": "hynnkff",
            "score": 1,
            "text": "Poo Tin must be fuming",
            "title_similarity": "0.16659862",
            "sentiment_compound": -0.5719
        },
        {
            "id": "hynnldm",
            "score": 1,
            "text": "Миссия выполнена",
            "title_similarity": "0.2619894",
            "sentiment_compound": 0.0
        },
        {
            "id": "hynnmi4",
            "score": 2,
            "text": "Fuck ‘em up, Ukraine! Slava Ukraini!",
            "title_similarity": "0.47633943",
            "sentiment_compound": -0.6229
        },
        {
            "id": "hynnpyh",
            "score": 3,
            "text": "I’m still worried about Mariupol",
            "title_similarity": "0.21717478",
            "sentiment_compound": -0.296
        },
        {
            "id": "hynny16",
            "score": 1,
            "text": "Clear minds, full hearts can’t lose!",
            "title_similarity": "0.09507543",
            "sentiment_compound": 0.6696
        },
        {
            "id": "hynoq8z",
            "score": 4,
            "text": "Urban warfare against people being supplied with modern equipment seems impossible. You just can't defend against it, imagine Afghanistan but high rises everywhere and locals with stingers, and such.\n\nI know everyone here is cheering about Russia not controlling cities, but part of me thinks \"oh shit\". If they can't control them with light infantry, they will go [Grozny on Kiev](https://preview.redd.it/t29djsge62h81.jpg?width=640&crop=smart&auto=webp&s=fa977ff690ad2e1f314ed136f75b31ddf67970a3). Google what Putin did to Grozny in the Chechen war. Its NSFL when you consider the possibility of it happening in Ukraine",
            "title_similarity": "0.40830302",
            "sentiment_compound": -0.8126
        },
        {
            "id": "hynosee",
            "score": 3,
            "text": "Good news",
            "title_similarity": "0.17784524",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hynoyyp",
            "score": 3,
            "text": "And now putin is so salty he wants a nuclear war",
            "title_similarity": "0.29807732",
            "sentiment_compound": -0.5994
        },
        {
            "id": "hynozpj",
            "score": 2,
            "text": "Thank you also to these journalists reporting from Ukraine. It is because of your courage and hard work that the rest of the world who live in much more fortunate circumstances are able to observe for themselves the atrocities committed by the Russian military and government.",
            "title_similarity": "0.34657747",
            "sentiment_compound": 0.8622
        },
        {
            "id": "hynpzqs",
            "score": 4,
            "text": "Respect for Ukraine 📈",
            "title_similarity": "0.42814302",
            "sentiment_compound": 0.4767
        },
        {
            "id": "hynqvbb",
            "score": 3,
            "text": "Truce talks are being used as a ploy to gather Russian/Chechnyan troops. REPOST EVERYWHERE https://twitter.com/HananyaNaftali/status/1497961609502859265",
            "title_similarity": "0.33569807",
            "sentiment_compound": 0.0
        },
        {
            "id": "hynr2x8",
            "score": 4,
            "text": "Ukrainians blow up a Russian tank\n\nhttps://twitter.com/njohnson_145/status/1497970156328288260?s=21",
            "title_similarity": "0.5082476",
            "sentiment_compound": 0.0
        },
        {
            "id": "hynragm",
            "score": 4,
            "text": "Wtf, Putin is actually Wal-Mart Hitler",
            "title_similarity": "0.3976131",
            "sentiment_compound": -0.5859
        },
        {
            "id": "hynrqx8",
            "score": 2,
            "text": "UKR got this in the bag.  russia gave it all they had and it was really pathetic/got wrecked.\n\nUKR needs to demand Crimea back in peace talks and become part of nato",
            "title_similarity": "0.43985432",
            "sentiment_compound": 0.4588
        },
        {
            "id": "hyns4wr",
            "score": 3,
            "text": "Is Kharkiv the city that Putin supposedly believed would be the first and easiest to take?",
            "title_similarity": "0.56879705",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hynsbar",
            "score": 3,
            "text": "Ukrainian badass in minivan hits Russian vehicle with homemade Molotov cocktails\n\nhttps://twitter.com/njohnson_145/status/1497972793559764994?s=21",
            "title_similarity": "0.40442833",
            "sentiment_compound": 0.34
        },
        {
            "id": "hynt2pu",
            "score": 3,
            "text": "Lets fucking go! Glad to have something to be happy about this morning.",
            "title_similarity": "0.21305001",
            "sentiment_compound": 0.8058
        },
        {
            "id": "hynt77c",
            "score": 6,
            "text": "Go Ukraine 🇺🇦 and never stop! Your nation is a total inspiration.",
            "title_similarity": "0.44297838",
            "sentiment_compound": 0.7071
        },
        {
            "id": "hyntkk5",
            "score": 3,
            "text": "FUCK THEM UP💪🏼💪🏼💪🏼💪🏼 GOD DAMN IT! PUTIN NEEDS TO GO!!!",
            "title_similarity": "0.33409166",
            "sentiment_compound": -0.7906
        },
        {
            "id": "hyntl5f",
            "score": 2,
            "text": "Fuck Russia",
            "title_similarity": "0.36042735",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hynumhs",
            "score": 2,
            "text": "Слава Україні!",
            "title_similarity": "0.4077211",
            "sentiment_compound": 0.0
        },
        {
            "id": "hynuo1s",
            "score": 3,
            "text": "Good, good, good. They were also repelled from Kherson yesterday, and defeated in Mylokaiv today. I don't want to jump the gun, but it really seems that the Russian assault is stagnating.",
            "title_similarity": "0.46466467",
            "sentiment_compound": -0.6382
        },
        {
            "id": "hynuxsr",
            "score": 5,
            "text": "As has been demonstrated in the middle east over the past 20 years, you can bomb a country forever if you got them outgunned but you may never get a permanent foothold in it if the people you are occupying just continue fighting back. There will be alot of back and forth for years in cities depending on how long this lasts.",
            "title_similarity": "0.43664706",
            "sentiment_compound": -0.6542
        },
        {
            "id": "hynv3z6",
            "score": 3,
            "text": "Did the Russians learn nothing from Stalingrad? Urban warfare is a complete nightmare for any aggressor. Unless you literally level and depopulate the area completely it's extremely difficult to win. People have forgotten the scale of destruction in the last big European wars - sending light vehicles into cities will achieve nothing.",
            "title_similarity": "0.39951855",
            "sentiment_compound": -0.8805
        },
        {
            "id": "hynvdsf",
            "score": 4,
            "text": "Realistically, in this day and age taking a urban area over with a population that has made it a point to resist is impossible.",
            "title_similarity": "0.32258332",
            "sentiment_compound": 0.0
        },
        {
            "id": "hynvo7t",
            "score": 12,
            "text": "I'd love to see Ukraine retake the Crimea when this is over.  Leave Vlad with less than he had before the hostilities.",
            "title_similarity": "0.53629917",
            "sentiment_compound": 0.2263
        },
        {
            "id": "hynvtzr",
            "score": 3,
            "text": "Real life game of Battlefield. They just recaptured point Bravo.",
            "title_similarity": "0.42711914",
            "sentiment_compound": -0.3818
        },
        {
            "id": "hynwjn1",
            "score": 3,
            "text": "Lol Russia fighting with tanks like it’s the 80s \n\nSo pathetic. They would get buttfucked by US army.",
            "title_similarity": "0.38773078",
            "sentiment_compound": -0.4481
        },
        {
            "id": "hynwk0z",
            "score": 5,
            "text": "Russia will continue to be the antagonist in every single FPS war video game.",
            "title_similarity": "0.3939358",
            "sentiment_compound": -0.7783
        },
        {
            "id": "hynwu2e",
            "score": 2,
            "text": "\"Remember. . . No Russians\"",
            "title_similarity": "0.24212721",
            "sentiment_compound": -0.296
        },
        {
            "id": "hynwv0b",
            "score": 1,
            "text": "pog",
            "title_similarity": "0.119843975",
            "sentiment_compound": 0.0
        },
        {
            "id": "hynxpcq",
            "score": 3,
            "text": "Russia overextending an offensive, ruining its own supply lines and being defeated at Kharkiv. The WW2 references are everywhere!\n\n&#x200B;\n\nSeriously, the other day I was going to make a joke about a \"Kharkiv\" counterattack being both a good idea *and* a historical reference...but I thought that referencing Von Manstein and a Nazi German victory wouldn't have been appropriate.\n\nGlad to see Ukraine didn't care for that and actually did it.",
            "title_similarity": "0.40787303",
            "sentiment_compound": -0.5603
        },
        {
            "id": "hynxyma",
            "score": 4,
            "text": "Amazing work Ukraine, bravo!",
            "title_similarity": "0.44918287",
            "sentiment_compound": 0.6239
        },
        {
            "id": "hynyrwt",
            "score": 4,
            "text": "Let’s just hope if (hopefully when) Russia loses this that Putin hitlers himself instead of sending nukes.",
            "title_similarity": "0.3336324",
            "sentiment_compound": 0.5106
        },
        {
            "id": "hyo24wk",
            "score": 3,
            "text": "Russia’s main superiority is in the skies and they play that card a lot, but to take cities you need boots on the ground and his boots don’t even want to be there.",
            "title_similarity": "0.41525206",
            "sentiment_compound": 0.431
        },
        {
            "id": "hyo2tbe",
            "score": 2,
            "text": "Yes 🙌",
            "title_similarity": "0.20045196",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hyo2v90",
            "score": 2,
            "text": "Russia: we gonna kick your ass\nUkraine: hold my beer",
            "title_similarity": "0.44451505",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hyo3vgo",
            "score": 2,
            "text": "in a failing company, the blind-to-reality CEO is usually the last to give up. Middle management is the foundation and stability in a corporate structure. When does Russia's military middle management just stop following orders?",
            "title_similarity": "0.51283485",
            "sentiment_compound": -0.6705
        },
        {
            "id": "hyo5dd2",
            "score": 5,
            "text": "Whoop that ass, Ukraine!",
            "title_similarity": "0.42449158",
            "sentiment_compound": -0.5848
        },
        {
            "id": "hyo5w20",
            "score": 3,
            "text": "putin , go fuck yourself",
            "title_similarity": "0.29480958",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hyo74yu",
            "score": 2,
            "text": "I've always wandered what \"control of a City\" actually meant. When does a City count as being seized?",
            "title_similarity": "0.30944723",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyo7hzk",
            "score": 2,
            "text": "Kick ass Ukraine",
            "title_similarity": "0.45799726",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hyo7uk7",
            "score": 4,
            "text": "This is a confusing headline because Ukraine never lost control of Kharkiv to begin with.",
            "title_similarity": "0.52478063",
            "sentiment_compound": 0.016
        },
        {
            "id": "hyo8sxg",
            "score": 2,
            "text": "WOOOHOOOOO LETS GOI",
            "title_similarity": "0.15668276",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyo93ka",
            "score": 2,
            "text": "Slava ukraini",
            "title_similarity": "0.36775386",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyo9xc9",
            "score": 3,
            "text": "When you play Risk, sometimes that large stack you have attacking a few pieces...well you roll a lot of low dice and suddenly your stack is gone.    \n[The Ukraine is definitely not \"weak\".](https://www.youtube.com/watch?v=Mzqn-bXTq0k)",
            "title_similarity": "0.43586084",
            "sentiment_compound": -0.2732
        },
        {
            "id": "hyoatwb",
            "score": 1,
            "text": "A hgh cap ok I",
            "title_similarity": "0.2358182",
            "sentiment_compound": 0.296
        },
        {
            "id": "hyobio8",
            "score": 1,
            "text": "I hope Stepan is okay. \n\nYes, that Stepan.",
            "title_similarity": "0.23071918",
            "sentiment_compound": 0.7579
        },
        {
            "id": "hyoc4kh",
            "score": 4,
            "text": "Russia really is a shit show. They will never be viewed as powerful again.",
            "title_similarity": "0.39395785",
            "sentiment_compound": -0.2648
        },
        {
            "id": "hyod3ht",
            "score": 11,
            "text": "Anybody here see this guy removing a mine from under a bridge?\n\n[https://youtu.be/dOVDYwl2V5A](https://youtu.be/dOVDYwl2V5A)\n\nYeah… there’s no occupying balls that big. It may be the best opportunity for Putin right now, but seems to me that his best case scenario is still an Ukrainian Resistance and an international community with casus belli. Just look at how that cigarette dangles.",
            "title_similarity": "0.50109285",
            "sentiment_compound": 0.8658
        },
        {
            "id": "hyodeba",
            "score": 1,
            "text": "       \n        \n   \n      O.",
            "title_similarity": "0.17253824",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyodu5x",
            "score": 4,
            "text": "This has the hallmarks of Russia's Afghanistan 2.0.",
            "title_similarity": "0.45089847",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyoei5m",
            "score": 5,
            "text": "I mean, I dont want them to be doing better but is anyone else astonished at this poor showing from Russia? Seems like they forgot to bring supplies and the west completely tanked their troop morale by outing their excuses ahead of time.",
            "title_similarity": "0.37677085",
            "sentiment_compound": 0.517
        },
        {
            "id": "hyogpxa",
            "score": 3,
            "text": "Putin getting Gaddafi-ed would be in the 21st century's top 5 best Schadenfreude.",
            "title_similarity": "0.63242817",
            "sentiment_compound": 0.7184
        },
        {
            "id": "hyogsi4",
            "score": 1,
            "text": "US/west intelligence = strong",
            "title_similarity": "0.28870302",
            "sentiment_compound": 0.7506
        },
        {
            "id": "hyogtd6",
            "score": 3,
            "text": "The Ukrainians never lost it",
            "title_similarity": "0.33933476",
            "sentiment_compound": 0.2411
        },
        {
            "id": "hyoig8k",
            "score": 3,
            "text": "The videos I saw of Russian forces showed light vehicles and trucks. No tanks or APC's. Infantry on foot. Are they even trying to take Kharkiv?",
            "title_similarity": "0.36935717",
            "sentiment_compound": -0.296
        },
        {
            "id": "hyol1hh",
            "score": 3,
            "text": "Sorry, but when did the Ukranians lose control of Kharkiv? They never lost it as far as I know. The russians are trying to surround it.",
            "title_similarity": "0.49422246",
            "sentiment_compound": -0.3087
        },
        {
            "id": "hyolg8h",
            "score": 2,
            "text": "If the supplies from the west come, the russians don't stand a chance. Only win Putin can get is diplomatic or with a nuke but nobody wins when that happens. Is his end goal turning into the end?",
            "title_similarity": "0.39325178",
            "sentiment_compound": 0.7952
        },
        {
            "id": "hyomd12",
            "score": 7,
            "text": "GIVE EM FUCKING HELL!!!",
            "title_similarity": "0.16571727",
            "sentiment_compound": -0.7763
        },
        {
            "id": "hyotclt",
            "score": 3,
            "text": "🌻 🌻 🌻",
            "title_similarity": "0.20376007",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyots8g",
            "score": 2,
            "text": "Пожалуйста, окажите финансовую помощ украинскому народу и украинской армии. Здесь ссылка на счета национального банка Украины. Спасибо!\r  \nPlease provide financial assistance to the Ukrainian people and the Ukrainian army. Here is a link to the accounts of the National Bank of Ukraine. Thanks!\r  \nhttps://bank.gov.ua/ua/news/all/natsionalniy-bank-vidkriv-spetsrahunok-dlya-zboru-koshtiv-na-potrebi-armiyi",
            "title_similarity": "0.5489959",
            "sentiment_compound": 0.6988
        },
        {
            "id": "hyoup3f",
            "score": 6,
            "text": "God I love how badass the Ukrainians are",
            "title_similarity": "0.33754486",
            "sentiment_compound": 0.8271
        },
        {
            "id": "hyoxfz1",
            "score": 1,
            "text": "On a news report it showed tanks coming into Ukraine by rail. Would this not have been easy to stop from happening by the Ukrainian army ?",
            "title_similarity": "0.45055258",
            "sentiment_compound": -0.5583
        },
        {
            "id": "hyoxnck",
            "score": 3,
            "text": "Слава Украине",
            "title_similarity": "0.32553753",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyoyxmy",
            "score": 3,
            "text": "Russia??? Russia is a sitting dock. Russia is week, it’s feeble!",
            "title_similarity": "0.5414527",
            "sentiment_compound": -0.4646
        },
        {
            "id": "hyoz4kj",
            "score": 1,
            "text": "Hoping that Russia will always be [Russia](https://www.youtube.com/watch?v=5jDbJbCuKl4&t=44s)",
            "title_similarity": "0.37849623",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hyozh17",
            "score": 3,
            "text": "You love to see it.",
            "title_similarity": "0.10143775",
            "sentiment_compound": 0.6369
        },
        {
            "id": "hyp1dfi",
            "score": 3,
            "text": "It is hard reading this and truly taking in the reality, when mostly this platform is used for talking throughout a large music festival.  \"Get over to the Pavillion stage, shits crazy over there!\"  \"Bro we need some water by the tents when you get a chance\"  \"Yo, rumor is that Drake will be here on Sunday\"  \"Check out this crazy guy balancing a rock on his head while smoking a cig\"\n\nThat's what my brain is used to reading on reddit.  Instead that crazy guy is calmly moving a landmine out of position.",
            "title_similarity": "0.27623957",
            "sentiment_compound": -0.2363
        },
        {
            "id": "hyp1zv9",
            "score": 5,
            "text": "Kind of incredible how well Ukraine army is doing. Obviously the whole situation is incredibly fucked up but the resistance they already brought to bare is truly inspirational.",
            "title_similarity": "0.42334163",
            "sentiment_compound": 0.7988
        },
        {
            "id": "hypc2yf",
            "score": 2,
            "text": "This makes me so happy.",
            "title_similarity": "0.08249745",
            "sentiment_compound": 0.6948
        },
        {
            "id": "hyphqfe",
            "score": 1,
            "text": "Well. He wasn’t there so we left.",
            "title_similarity": "0.15956087",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hypndiv",
            "score": 2,
            "text": "My grandma and her whole side are there.  Just got photos of them hiding out in their cellar in coats and under blankets and I’m losing my shit.  What the hell",
            "title_similarity": "0.30497184",
            "sentiment_compound": -0.9186
        },
        {
            "id": "hyppz6d",
            "score": 2,
            "text": "Man, little Putin’s ego gotta be hurting right now lol",
            "title_similarity": "0.31029353",
            "sentiment_compound": 0.0258
        },
        {
            "id": "hyprfbx",
            "score": 2,
            "text": "Great. This website started operation 3 months ago and looks like Wordpress site.",
            "title_similarity": "0.45666212",
            "sentiment_compound": 0.765
        },
        {
            "id": "hypyme6",
            "score": 6,
            "text": "This was 13 hours ago.\n\nWhat is happening NOW.",
            "title_similarity": "0.40074807",
            "sentiment_compound": 0.0
        },
        {
            "id": "hypypg7",
            "score": 2,
            "text": "I have to say, Tom Clancy was real off about the effectiveness of the Russian military.",
            "title_similarity": "0.43099046",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyq0ffr",
            "score": 3,
            "text": "Yes!!!!! Go Ukraine!",
            "title_similarity": "0.4580687",
            "sentiment_compound": 0.5951
        },
        {
            "id": "hyq5mc2",
            "score": 3,
            "text": "Glory to Ukraine, fuck the Russians",
            "title_similarity": "0.5188198",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyq6wed",
            "score": 2,
            "text": " Brothers killing Brothers. Sad day for humanity at hands of putin.",
            "title_similarity": "0.38185543",
            "sentiment_compound": -0.8176
        },
        {
            "id": "hyqbfiy",
            "score": 1,
            "text": "It will be fine for sure. Ukraine will crack the evil and will warrant safety for Europe.",
            "title_similarity": "0.33453655",
            "sentiment_compound": 0.128
        },
        {
            "id": "hyqbjo8",
            "score": 1,
            "text": "Good on the Ukrainians",
            "title_similarity": "0.4330014",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hyqfmwf",
            "score": 1,
            "text": "LFG UKRAINE 🇺🇦",
            "title_similarity": "0.4921809",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyqh52n",
            "score": 2,
            "text": "This war is so embarrassing for Russia. Putin is just basically ASKING to get assassinated.",
            "title_similarity": "0.378463",
            "sentiment_compound": -0.7778
        },
        {
            "id": "hyqk06e",
            "score": 1,
            "text": "Fuck, how good would it be if Ukraine counter invaded and got themselves a tasty few thousand acres of Russian soil, purely as a fuck you.",
            "title_similarity": "0.5126593",
            "sentiment_compound": -0.6557
        },
        {
            "id": "hyqlo3y",
            "score": 1,
            "text": "The real question is once russia loses does Ukraine go for Crimea and retake the occupied lands they have been so hesitant to recapture.",
            "title_similarity": "0.4504671",
            "sentiment_compound": -0.6015
        },
        {
            "id": "hyqqp3e",
            "score": 1,
            "text": "Many innocent citizens even childrens babys are being died due to the fuking putin even mamy Russians think putin is wrong you will definitely go to hell putin",
            "title_similarity": "0.30491728",
            "sentiment_compound": -0.9081
        },
        {
            "id": "hyquv6n",
            "score": 1,
            "text": "I want to know whether u/onikzin is still with us. Stay safe.",
            "title_similarity": "0.06492819",
            "sentiment_compound": 0.4939
        },
        {
            "id": "hyqz404",
            "score": 2,
            "text": "Pretty sure the sieges will be Russia’s Stalingrad. Many dead for no strategic goal. \n\nSurely they know they can’t force them to surrender now. The insurgency will last for years and kill so many Russians. It’s not even worth it pull out lick your wounds and beg forgiveness",
            "title_similarity": "0.4238538",
            "sentiment_compound": -0.5213
        },
        {
            "id": "hyr3d15",
            "score": 2,
            "text": "Putin has underestimated the resolve of the Ukraine people.",
            "title_similarity": "0.54475427",
            "sentiment_compound": 0.128
        },
        {
            "id": "hyrfgmn",
            "score": 2,
            "text": "Ukraine never ceases to amaze me. I would assume much smaller resources vs Russian Military and they are out there doing work son. I love it. Praying for them everyday.",
            "title_similarity": "0.41443723",
            "sentiment_compound": 0.5927
        }
    ]
}