{
    "Kosovo has asked the United States to establish a permanent military base in the country and speed up its integration into NATO after Russia's invasion of Ukraine\n": [
        {
            "id": "hypfsij",
            "score": 1,
            "text": "NATO expansion is what instigated this war though. \n\nNot supporting Vova or anything, but Russia was promised after the fall of the USSR that NATO wouldn’t expand further East, yet it continues to do so. Vova even asked to join NATO shortly after he assumed office to try to head off any escalation like this, but was denied (he *was* kind of a dick about it, as he asked to be invited, and didn’t want to wait in line with “a bunch of countries that don’t matter”)\n\nAlso, unpopular opinion right now, but NATO should have been disbanded after the USSR officially dissolved. I fully support Ukraine and it’s sovereignty, but NATO to me looks a lot like the shit Otto Von Bismarck put together before WWI.",
            "title_similarity": "0.58755064",
            "sentiment_compound": 0.9277
        },
        {
            "id": "hyozwx2",
            "score": 7,
            "text": "The U.S. would love to welcome Kosovo into NATO and if they really would feel more secure with a U.S. presence then we as a country should try and facilitate it. \n\nPutin is really bringing Europe together into NATO.",
            "title_similarity": "0.7410922",
            "sentiment_compound": 0.8718
        },
        {
            "id": "hyp2ymr",
            "score": 5,
            "text": "This is casus belli for Serbia. Stop pushing more wood to the fire.",
            "title_similarity": "0.4282912",
            "sentiment_compound": -0.5574
        },
        {
            "id": "hypczbu",
            "score": 5,
            "text": "This is very rich considering Kosovo was created by waging war against a sovereign country, in violation of international law, and taking a piece of its territory to make a new country called Kosovo... exactly what Russia is doing in Ukraine now with the exact same pretext which is alleged government atrocities against a minority.",
            "title_similarity": "0.663432",
            "sentiment_compound": -0.2975
        },
        {
            "id": "hyovlii",
            "score": 43,
            "text": "yeah thats just what the world needs, more US military bases",
            "title_similarity": "0.6473226",
            "sentiment_compound": 0.296
        },
        {
            "id": "hyp1hhl",
            "score": 6,
            "text": "I loved my deployments to Kosovo. So much so, my second time was voluntary. Keep Bondsteel as a permanent base!",
            "title_similarity": "0.44966334",
            "sentiment_compound": 0.636
        },
        {
            "id": "hyp8cv4",
            "score": 15,
            "text": "God damn. After Iraq and the US occupations in the middle east it's really hard to be impartial here. I hope all the young people here realize the us does everything it can to abuse the power it's allowed to take \n\nNot saying this is anything nefarious. But all these global centralized powers need to be scrutinized during times of crisis.  After 911 emotions ask allowed the US to do a lot of things that were second guess later.  I hope people can keep a measure of skeptisism.  \n\nI was young once and really thought the US was going into these countries to help them. And my emotions tell me that now too. But emotions are often taken advantage of.\n\nI don't know what's right. All I know is power knows when it can get more power",
            "title_similarity": "0.4510762",
            "sentiment_compound": 0.2391
        },
        {
            "id": "hyontmm",
            "score": 13,
            "text": "Absolutely.  Russia is not stopping at Ukraine.",
            "title_similarity": "0.41932145",
            "sentiment_compound": 0.1139
        },
        {
            "id": "hypfllb",
            "score": -5,
            "text": "Kosovo isn't a country.",
            "title_similarity": "0.107840315",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyp7apr",
            "score": 0,
            "text": "As an American taxpayer, no thanks on more bases abroad, but I'm game for them to be in NATO if they're qualified.",
            "title_similarity": "0.6806706",
            "sentiment_compound": -0.1786
        },
        {
            "id": "hyosp8i",
            "score": 3,
            "text": "Holy f**k this is actually massive news",
            "title_similarity": "0.18409674",
            "sentiment_compound": 0.0
        },
        {
            "id": "hypdwc7",
            "score": -3,
            "text": "I would like to remind at least someone that Kosovo is not a country just like Donetsk is not a country, if Ukraine should stay whole in its borders, why not Serbia as well?",
            "title_similarity": "0.53268266",
            "sentiment_compound": 0.4915
        },
        {
            "id": "hyozdb8",
            "score": -39,
            "text": "Fuck NATO. Fuck Russia. Both are bullies that invade sovereign territory and both should be held accountable. There is no 'good' side when it comes to politics.",
            "title_similarity": "0.4783877",
            "sentiment_compound": -0.8558
        },
        {
            "id": "hypeaww",
            "score": -6,
            "text": "gross. this war's just gonna end up expanding the american empire. everybody loses from this shit",
            "title_similarity": "0.4080711",
            "sentiment_compound": -0.8402
        },
        {
            "id": "hyp75ru",
            "score": -22,
            "text": "Kosovo is a fake country ruled by druglords and its main route for EU drug/human trafficking. If they do that by some miracle its ofcourse interest.",
            "title_similarity": "0.41298407",
            "sentiment_compound": 0.5719
        },
        {
            "id": "hyonwzt",
            "score": -2,
            "text": "Yes!",
            "title_similarity": "0.061364133",
            "sentiment_compound": 0.4574
        },
        {
            "id": "hyp6lo8",
            "score": 16,
            "text": "For Albanians, the US has been our only true ally. During the war in Kosovo and the rest of the Balkans waged by the Serbs, Europe stood by quietly and didn't lift a finger to help.  \n\nIt was America that ended that conflict. \n\nI hope the US gets that base soon.",
            "title_similarity": "0.53867817",
            "sentiment_compound": 0.296
        },
        {
            "id": "hypcubx",
            "score": 2,
            "text": "Just after 4 years of \"fuck America\" and \"why are we bothering with NATO\", Putin manages to flip everything and turn the US and NATO into saints.",
            "title_similarity": "0.5512548",
            "sentiment_compound": -0.7269
        },
        {
            "id": "hypuomr",
            "score": -5,
            "text": "[deleted]",
            "title_similarity": "0.028029473"
        },
        {
            "id": "hypf7ge",
            "score": -4,
            "text": "Yeah because Putin is totally gonna invade Kosovo next lol",
            "title_similarity": "0.602049",
            "sentiment_compound": 0.6124
        },
        {
            "id": "hyp761r",
            "score": 1,
            "text": "Not really. NATO doesn't want to get into a military conflict with Russia, end of story. All Russia has to do is threaten incursion/invasion of whichever Eastern European country not already in NATO, and the organisation will think twice about offering membership to said country. This is because as soon as they do, they'll immediately use the membership's privileges. It's precisely why NATO has been hesitant to give Ukraine membership all these years.",
            "title_similarity": "0.63316095",
            "sentiment_compound": -0.5839
        },
        {
            "id": "hypiwxa",
            "score": 0,
            "text": "Biden like what? I’m eating ice cream.",
            "title_similarity": "0.2060549",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hypvkkr",
            "score": 0,
            "text": "Peace requires US military. I hope the world realizes this finally.",
            "title_similarity": "0.58917445",
            "sentiment_compound": 0.7506
        },
        {
            "id": "hyosb7s",
            "score": 5,
            "text": "Damn, this is amazing",
            "title_similarity": "0.020420795",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hyq4s2y",
            "score": 2,
            "text": "How wildly convenient for U.S. war profiteering interests",
            "title_similarity": "0.37158382",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hyp65e1",
            "score": -5,
            "text": "All planned. What a bunch of propaganda.",
            "title_similarity": "0.20091003",
            "sentiment_compound": -0.25
        },
        {
            "id": "hyonpv7",
            "score": 32,
            "text": "Yes please. Welcome Kosovo into Nato <3",
            "title_similarity": "0.6229404",
            "sentiment_compound": 0.872
        },
        {
            "id": "hyph5p0",
            "score": 18,
            "text": "If you want to support Ukraine than Kosovo is literaly the worst comparisment you can use. NATO bombed Serbia illegaly for three months without UN consent, annexed 15% of its teritory and most western countries recognised independence of that teritory contrary to all existing international laws. US has built an military base on that annexed part of Serbia without its consent, that is called occupation. So there is already a US base in Kosovo, an illegal one, but laws dont exist for peacefull hypocrite western countries. Albanians asking for more US military presence is nothing shocking for those who knows them, always hiding underneath somebody’s skirt, ottoman, italian, german an now US. So called Kosovars history is almost non existent so now they are trying to register Serbian churches as their unesco herritage, the same churches they attacked and damaged in 2004.  Kosovo is full of Serbian churches and monestaries from 14th century and older, the oldest albanian buildings are from 19th century. They almost entirely clensed Kosovo from Serbs with assistance from NATO countries. They have more statues of NATO leaders in Pristina then of their historical figures, maybe because they are non existent. With bombing of Serbia you have legalised everything that Putin is doing, so next time find another example to justify your hypocrisies and leave Serbia alone. And just to be clear, what Putin is doing in Ukraine right now is ludicrous.",
            "title_similarity": "0.540565",
            "sentiment_compound": -0.9316
        },
        {
            "id": "hyp22gx",
            "score": 18,
            "text": "[deleted]",
            "title_similarity": "0.028029473"
        },
        {
            "id": "hyotr63",
            "score": 11,
            "text": "I would really suggest not having the US establish a defense base. Having another country like France or Germany establish a bar would really show a more unified front of the world being against Russia.",
            "title_similarity": "0.56612337",
            "sentiment_compound": 0.7089
        },
        {
            "id": "hyoumdk",
            "score": -19,
            "text": "Serbia has straight up taken Putin's side in this conflict. NATO should lend its support to Kosovo.",
            "title_similarity": "0.74071586",
            "sentiment_compound": 0.2441
        },
        {
            "id": "hyp65gk",
            "score": -1,
            "text": "Kosovo sausage is so fucking good.",
            "title_similarity": "0.25652254",
            "sentiment_compound": 0.5379
        },
        {
            "id": "hypea9g",
            "score": 0,
            "text": "I love some people comments here.. In some way criimea joining Russia was more legitimate than Kosovo getting its independence, there was no vote, etc, just the gov announcing it one day, at least there was a vote in crimea, but obv that's not important and only self interest is what every country cares about in situations like these",
            "title_similarity": "0.5285785",
            "sentiment_compound": 0.9074
        },
        {
            "id": "hyq1bg7",
            "score": -1,
            "text": "They gotta wait till we get we get a useful Republican president back into office unfortunately",
            "title_similarity": "0.55224097",
            "sentiment_compound": 0.128
        },
        {
            "id": "hyp3r9s",
            "score": 4,
            "text": "Next time someone points out that the US spends too much on defense, I'll consider reminding them that if Europe spent any real money on world order then the US wouldn't have to spend so much.",
            "title_similarity": "0.45055917",
            "sentiment_compound": 0.128
        },
        {
            "id": "hyp6jkr",
            "score": 2,
            "text": "I love this all blowing up in Putins face.  \n\nHe is against NATO expansion and pulls this shit and now Kosovo wants into NATO and the Finn’s are talking about it too.",
            "title_similarity": "0.5941885",
            "sentiment_compound": -0.0129
        },
        {
            "id": "hyp9lgu",
            "score": -2,
            "text": ":(\n\nSad days.",
            "title_similarity": "-0.033618644",
            "sentiment_compound": -0.7184
        },
        {
            "id": "hypotkq",
            "score": 2,
            "text": "Remember this? Putin probably had a hand in this, and used Trump as the idiot he is. It all is starting to make sense, Trump needs to be investigate to the fullest extent of the law!! \n\nJan. 14, 2019\nWASHINGTON — There are few things that President Vladimir V. Putin of Russia desires more than the weakening of NATO, the military alliance among the United States, Europe and Canada that has deterred Soviet and Russian aggression for 70 years.\n\nLast year, President Trump suggested a move tantamount to destroying NATO: the withdrawal of the United States.\n\nSenior administration officials told The New York Times that several times over the course of 2018, Mr. Trump privately said he wanted to withdraw from the North Atlantic Treaty Organization. Current and former officials who support the alliance said they feared Mr. Trump could return to his threat as allied military spending continued to lag behind the goals the president had set.\n\nIn the days around a tumultuous NATO summit meeting last summer, they said, Mr. Trump told his top national security officials that he did not see the point of the military alliance, which he presented as a drain on the United States.",
            "title_similarity": "0.6890378",
            "sentiment_compound": -0.5644
        },
        {
            "id": "hyq98o5",
            "score": 2,
            "text": "Reverse Uno Card: USA happens to be the bad guys and conquer the world.",
            "title_similarity": "0.4169109",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hyoxh8s",
            "score": 21,
            "text": "How did Kosovo come about, remind me?",
            "title_similarity": "0.4580835",
            "sentiment_compound": 0.0
        },
        {
            "id": "hypndb8",
            "score": 0,
            "text": "That is the last thing we should do. Russia  is a threat to certain Eastern Euro countries, but not to America. We need to pull out of Europe and let Western Europeans handle the affairs. Instead we need to be focused on the mid East until renewables can do the heavy lifting, our hemisphere, the Pacific, and in developing lands where China is looking to secure natural resources and buy gvts.\n\nbut of course since there is so much $ to be made in the American military monstrosity,it will go forward.",
            "title_similarity": "0.6570388",
            "sentiment_compound": 0.8442
        },
        {
            "id": "hyptxkd",
            "score": 0,
            "text": "[deleted]",
            "title_similarity": "0.028029473"
        },
        {
            "id": "hypymkk",
            "score": 0,
            "text": "AFGHANISTAN 2.0",
            "title_similarity": "0.33078718",
            "sentiment_compound": 0.0
        },
        {
            "id": "hypz4dr",
            "score": 0,
            "text": "The US is not the fucking world police.",
            "title_similarity": "0.1436553",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyqxgyj",
            "score": 0,
            "text": "Bosnian here — considering Russia is Serbia’s “Big Brother”, Serbia may highly likely consider invading Bosnia & other Yugoslav countries. This will literally set Europe on fire.",
            "title_similarity": "0.65507925",
            "sentiment_compound": -0.34
        },
        {
            "id": "hyp0ald",
            "score": -7,
            "text": "Horrible idea imo. The world is cornering a dictator with more than enough nuclear weapons to destroy all complex life on earth. He’s also facing serious backlash in Russia itself and government officials. I think the only reasonable course of action is to agree that the west will not expand NATO and Russia will not interfere with any border countries. Obviously that’s not straight forward. What about economic ties? The west will also have to recognize Crimea as part of Russia. It won’t be easy but I just don’t see another way out of this. Putin has committed so much monetarily, militarily and politically he cannot just withdraw. I think a lot of people are being really naive if they aren’t truly terrified of these developments. \n\n\nIt’s not well known, as our media, at large, is generally not willing to go after the US government for “national security”(rather they spread the lies to sell American military intervention abroad) but we have almost been in nuclear war by accident many times. During the Cuban missile crisis a Soviet sub was too deep to get radio traffic. The officers on board thought that war had broken out because they didn’t have contact with Moscow for days. That sub was the only one that required all 3 senior officers to agree unanimously to launch the nuclear weapons. 2 of them agreed to. The 3rd opposed it and eventually convinced them to surface. One man stopped the end of human civilization. One. \n\n\nhttps://en.m.wikipedia.org/wiki/Soviet_submarine_B-59\n\n\nTheres another where the soviets new radar showed the US had launched a volley of nukes at them. The man in charge of responding was told by his superiors to return fire. He refused as it didn’t make sense the US would do this when relations where good. It turned out the radar was shit and it was migrating birds that set the warning system off. He was fired and I think exiled or lived out his days on house arrest. Something like that. He saved the world. One fucking guy. \n\n\nThe US had one of these situations too. Maybe the worst one really. I would encourage everyone to look it up. If everyone doesn’t think there’s a real chance this war couldn’t break out to nuclear war where we all die you are misinformed. \n\n\nI’m frankly terrified.\n\n\nEdit: you are all out of your minds. Russia will take Ukraine. All this support from the west is only meant to make them stop with Ukraine and not continue to other ex soviet countries. The concern is that the west’s support will go to far and something could happen. Go ahead and hit me with a remindme alert. I don’t like it but Ukraine will be taken and the west should never have done what they did in 2014 helping them coup when Ukraine abandoned EU trade talks due to what the IMF would make them do economically in order to get the loan. You can literally listen to the Secretary of State and the ambassador in Ukraine talk about who there guy is after the coup happens. The US never denied the leaked call wasn’t real. It’s so fucking maddening the average American completely buys into the child like fantasy of a pure good guy and a pure bad guy. The west wants to economically rape other weaker countries and so does Russia. It’s that easy and you have all the original source documentation to find that will always back it up.",
            "title_similarity": "0.5915702",
            "sentiment_compound": -0.9968
        },
        {
            "id": "hyp0pg3",
            "score": 7,
            "text": "Get in",
            "title_similarity": "0.1412259",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyoo8px",
            "score": 5,
            "text": "If Kosovo dosent join NATO russia and serbia gonna be good geographically and strategically.",
            "title_similarity": "0.66024554",
            "sentiment_compound": 0.6249
        },
        {
            "id": "hyp2os1",
            "score": -6,
            "text": "Kosovo fuckin legend",
            "title_similarity": "0.30729425",
            "sentiment_compound": 0.0
        },
        {
            "id": "hype0as",
            "score": -6,
            "text": "Great the whole world shits on the states when it comes to foreign politics (especially war) yet everyone expects us to send our boys to die for their country\n\nFuck nato, fuck Europe, fight your own wars. The United States has problems of their own and SHOULDNT be expected to fight for other countries",
            "title_similarity": "0.46938196",
            "sentiment_compound": -0.9712
        },
        {
            "id": "hyoxtrl",
            "score": 1,
            "text": "The war is such a tragedy but every now and then you see some positivity come from it.",
            "title_similarity": "0.28724694",
            "sentiment_compound": 0.0772
        },
        {
            "id": "hyozemy",
            "score": -2,
            "text": "Not happening - there is no domestic appetite to expand NATO especially when there is a territorial dispute. Some of you can probably tell when Trump threatened to dismantle NATO - this idea of the US leaving EU and focusing on China is bipartisan.",
            "title_similarity": "0.5162709",
            "sentiment_compound": -0.6808
        },
        {
            "id": "hyp8iqe",
            "score": 3,
            "text": "Talk about your all-time backfires, Putin is doing more to strengthen NATO than anyone could have ever dreamed! Trump, Fucker Cartlon and the rest of the Kremlin gang has a major sad.",
            "title_similarity": "0.49361983",
            "sentiment_compound": -0.7511
        },
        {
            "id": "hypd3g5",
            "score": 2,
            "text": "Ah yes Kosovo the country with a bronze statue of Bill Clinton.",
            "title_similarity": "0.514078",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hypj9mj",
            "score": 2,
            "text": "Russia is currently no threat to Kosovo, but I fear these calls might provoke Serbia to do something unwise",
            "title_similarity": "0.4635288",
            "sentiment_compound": -0.7883
        },
        {
            "id": "hypkw3q",
            "score": 2,
            "text": "So respect Ukrain but fk Serbia?\nClassic politics",
            "title_similarity": "0.45353842",
            "sentiment_compound": 0.2952
        },
        {
            "id": "hyq66mi",
            "score": 3,
            "text": "Since when did Reddit became fond of US placing military bases/troops on other country",
            "title_similarity": "0.6557866",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hypu893",
            "score": -3,
            "text": "kosovo is serbia",
            "title_similarity": "0.36965257",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyp2i1k",
            "score": 16,
            "text": "When a country that was created after military invasion which was launched because of claims of ethnic cleansing asks for aid because they see military invasion that was launched because of claims of ethnic cleansing. Not sure if this is bigger irony or Israelis protesting against Russian invasion and occupation......",
            "title_similarity": "0.66833377",
            "sentiment_compound": -0.2411
        },
        {
            "id": "hyoqpch",
            "score": 22,
            "text": "I hope my country joins the NATO it would be a huge relief",
            "title_similarity": "0.6089936",
            "sentiment_compound": 0.8074
        },
        {
            "id": "hypf340",
            "score": -3,
            "text": "Kosovo is territory  Nato invaded on false pretenses ,and took the territory from Serbia territory that Serbia had for what like 1000 years... \n\nIts a story of theft and stealing one's land in some ways just like Crimea was stolen . But everyone was fine with it cause it was NATO/USA doing it . The \" Racak massacre \"  was staged putting blame on Serbia for killing civilians where there was no civilians .\n\n And mind you Serbia army only acted against KLA a terrorist organization which started killing civilians on Serbian territory ( Kosovo ) and everyone was fine with it . The war crimes NATO committed bombing Serbia were totally brushed off and put under the rug",
            "title_similarity": "0.53087527",
            "sentiment_compound": -0.9833
        },
        {
            "id": "hypgm4i",
            "score": 2,
            "text": "Ahhhhh there it is; the American imperialism all the neo-commies were complaining about.",
            "title_similarity": "0.40894026",
            "sentiment_compound": -0.2023
        },
        {
            "id": "hypjwv6",
            "score": 2,
            "text": "Can't wait for 5 years down the road when redditors call this military base American imperialism.",
            "title_similarity": "0.5702528",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyp1xwv",
            "score": -1,
            "text": "lmao in a year NATO is gonna have like 6 more members.  Putin forgot about unintended consequences",
            "title_similarity": "0.45643684",
            "sentiment_compound": 0.7506
        },
        {
            "id": "hyp4cm8",
            "score": 1,
            "text": "Serbia is REALLY feeling the squeeze.",
            "title_similarity": "0.2089918",
            "sentiment_compound": 0.3666
        },
        {
            "id": "hypgeub",
            "score": 1,
            "text": "You know Serbia wouldn't lift a finger if they got invaded",
            "title_similarity": "0.3015371",
            "sentiment_compound": 0.0
        },
        {
            "id": "hypid41",
            "score": 1,
            "text": "As an American I have a big freedom boner over this",
            "title_similarity": "0.34486723",
            "sentiment_compound": 0.6369
        },
        {
            "id": "hyplhvl",
            "score": 1,
            "text": "Kosovo, and Bosnia should both be allowed to join NATO, and they should both have fast tracked EU membership, as they are in danger much like Ukraine albeit from Russian ally Serbia. I think Albanian EU membership should be sped up as well.\n\nIf Turkey can get its act together, perhaps EU membership process for them can be started back up.",
            "title_similarity": "0.7094282",
            "sentiment_compound": 0.34
        },
        {
            "id": "hypm4ek",
            "score": 1,
            "text": "Damn some white people get bombed and suddenly reddits simping for American Imperialism and the military industrial complex again lol",
            "title_similarity": "0.48091933",
            "sentiment_compound": 0.0258
        },
        {
            "id": "hypn7hw",
            "score": -1,
            "text": "Not our problem",
            "title_similarity": "-0.08369334",
            "sentiment_compound": 0.3089
        },
        {
            "id": "hyprnrr",
            "score": 1,
            "text": "okay what if the US wanted Russia to invade Ukraine so that NATO would expand more aggressively along with US influence in the region",
            "title_similarity": "0.7991059",
            "sentiment_compound": 0.1548
        },
        {
            "id": "hypsn14",
            "score": 1,
            "text": "They don't care about Russia. They care about Serbia. The only country in Europe that stayed silent when Russia invaded Ukraine.",
            "title_similarity": "0.44691133",
            "sentiment_compound": 0.1461
        },
        {
            "id": "hypu7u9",
            "score": 1,
            "text": "This is hilarious! Now you want us? How bout we trade Kosovo for Ukraine? I’m sure this is a great sign that NATO is now relevant again, but I see it as I hate you, but I’m scared of Russia more than I hate you.",
            "title_similarity": "0.57489365",
            "sentiment_compound": -0.9152
        },
        {
            "id": "hypuxaf",
            "score": 1,
            "text": "So long as the USA charges them &Billions for the base and doesnt cost the US taxpayers. I am personally sick of paying for EU protection while they enjoy education and healthcare that we wont pay for because of our military budget.",
            "title_similarity": "0.44153377",
            "sentiment_compound": -0.2273
        },
        {
            "id": "hyq0x3g",
            "score": 1,
            "text": "Oh so now people don’t mind American militarization huh",
            "title_similarity": "0.36056376",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyq2epq",
            "score": 1,
            "text": "Get this; ask Trump to intervene and have a face to face with Putin, ostensibly so Trump can broker a peace deal\n\nBut instead they get dosed with shrooms",
            "title_similarity": "0.6173374",
            "sentiment_compound": 0.3071
        },
        {
            "id": "hyq3nju",
            "score": -1,
            "text": "It would be spineless of nato not accept them.",
            "title_similarity": "0.30211008",
            "sentiment_compound": -0.2924
        },
        {
            "id": "hyq4s02",
            "score": -1,
            "text": "Kosovo is a city. I think they meant Serbia. Serbia wants to join NATO, makes more sense.",
            "title_similarity": "0.6877183",
            "sentiment_compound": 0.296
        },
        {
            "id": "hyqll9h",
            "score": -1,
            "text": "Well played Kosovo. Unfortunately U.S too busy not getting into conflicts while keeping an eye on China.",
            "title_similarity": "0.38220415",
            "sentiment_compound": 0.508
        },
        {
            "id": "hyqmyxj",
            "score": 1,
            "text": "Hell yeah! Kosovo is an absolutely GORGEOUS country with a tough past. Let’s get them into NATO!",
            "title_similarity": "0.5437795",
            "sentiment_compound": 0.4039
        },
        {
            "id": "hyrpyzf",
            "score": -1,
            "text": "NATO is a joke. Proper Clowns.",
            "title_similarity": "0.18824744",
            "sentiment_compound": 0.296
        },
        {
            "id": "hypa2fh",
            "score": 7,
            "text": "Hey Kosovo! Glad you peeps are doing better. Was there in 99 as part of KFOR. I was in Uroševac. The people there were nice, the food was great, I loved the market, but the fresh bread was my favorite. We had a kid back then, Little Danny, who was 12 or so, who did different things for us. Danny knew five languages, Russian, Serbia, Albanian, English, and some Spanish. At one point he got in at Camp Bondsteel and met the President when he came through. I have a question about the burgers though. We weren't sure about the meat being used, so we called them Cat Burgers, because we didn't see many cats. I can literally count how many cats I saw while in Kosovo on one hand. Plenty of dogs and pigs running around. And mines. One map showed ten kilometers of mines. \n\nI agree with a base there. I agree with us helping Ukraine.",
            "title_similarity": "0.35152906",
            "sentiment_compound": 0.9804
        },
        {
            "id": "hyot1d8",
            "score": 3,
            "text": "All for NATO expansion given the circumstances but Kosovo is not on Russia’s radar and it would be impossible for Russia to launch an invasion, so this is probably just a play for official and broad recognition of the country across the EU.",
            "title_similarity": "0.6075007",
            "sentiment_compound": 0.4767
        },
        {
            "id": "hyp217a",
            "score": 2,
            "text": "I'm sure Serbia, a traditional ally of Russia who lays claim to the territory, will be thrilled.",
            "title_similarity": "0.606089",
            "sentiment_compound": 0.6369
        },
        {
            "id": "hypi9or",
            "score": -6,
            "text": "Oh now y’all want our help? What ever happened to “America big bad empire”",
            "title_similarity": "0.38752323",
            "sentiment_compound": -0.128
        },
        {
            "id": "hyorlhs",
            "score": 8,
            "text": "This is the prime time for any breakaway region in Russia to slip away. Good god. What an L.",
            "title_similarity": "0.5157657",
            "sentiment_compound": 0.6124
        },
        {
            "id": "hyphkx3",
            "score": -7,
            "text": "Kosovo is a bitch and shouldn’t be recognized",
            "title_similarity": "0.21308318",
            "sentiment_compound": -0.5859
        },
        {
            "id": "hyoo9yt",
            "score": 100,
            "text": "May it be the largest American Base in Europe.",
            "title_similarity": "0.39627323",
            "sentiment_compound": 0.0
        },
        {
            "id": "hypgsbe",
            "score": 41,
            "text": "Reddit cannot handle seeing the US being treated as a leader and as a force for good and stability and protection",
            "title_similarity": "0.31739718",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hypajqi",
            "score": 6,
            "text": "> **Serbia Disliked That**",
            "title_similarity": "0.18682924",
            "sentiment_compound": -0.4019
        },
        {
            "id": "hypkmvs",
            "score": 4,
            "text": "Everyone wants to shit on the US until some big country threatens them. Then they run to the US for help.",
            "title_similarity": "0.5320351",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hypgbev",
            "score": 1,
            "text": "The more the merrier in NATO.",
            "title_similarity": "0.2903144",
            "sentiment_compound": 0.4549
        },
        {
            "id": "hypghvz",
            "score": 4,
            "text": "This is in response to [an attempt of the Serbian Intelligence Service to do a false flag operation](https://twitter.com/admirim/status/1497986153936343040?t=H0gqjMZmKAI_DH9OnVM_Og&s=19) along with other threats such as Serbians drawing chauvinistic symbols and russian \"Z\" symbol on road signs all over Northern Kosovo.",
            "title_similarity": "0.5836507",
            "sentiment_compound": 0.0772
        },
        {
            "id": "hyphcpp",
            "score": 2,
            "text": "As a United States citizen I would love for my tax dollars to go towards this. We have more than enough in the US. Instead of wasting money paying contractors to act as mercenaries for our own country. Paying them more than we do for our own troops. Let’s build bases to keep people who want us there safe. Maybe it would be good to have a “foreign legion” in these countries. Taking after France in a way. Make a base, train anyone who wants to join and then let Kosovo have the base as part of NATO? Just spitballing here. Maybe it’s a terrible idea.",
            "title_similarity": "0.578463",
            "sentiment_compound": 0.8591
        },
        {
            "id": "hypiuvm",
            "score": 3,
            "text": "This is what happens when someone finally punches the bully in the face. Everyone quickly sees it was all bravado and they stand up for themselves. Get fucked Putin!",
            "title_similarity": "0.3560701",
            "sentiment_compound": -0.8356
        },
        {
            "id": "hypljqm",
            "score": -3,
            "text": "Serbia says - no.\n\nAlso not every NATO country even recognizes Kosovo as a country, so that's an immediate \"not going to happen\"",
            "title_similarity": "0.40788668",
            "sentiment_compound": 0.0
        },
        {
            "id": "hypmf4t",
            "score": 2,
            "text": "Smacks Kosovo on top: this bad boy can take a US base and take all Russian nukes for Europe",
            "title_similarity": "0.5927853",
            "sentiment_compound": -0.5147
        },
        {
            "id": "hyprd3c",
            "score": 2,
            "text": "Why is Serbia such a dick, even after being genocidal",
            "title_similarity": "0.3262452",
            "sentiment_compound": -0.5106
        },
        {
            "id": "hyprr7v",
            "score": 3,
            "text": "Well NATO wont be necessary anymore after this war. Russia is going to be subdivided so hard its going to make the breakup of the USSR look like cracks on a windshield.",
            "title_similarity": "0.6132792",
            "sentiment_compound": -0.4388
        },
        {
            "id": "hyq72x7",
            "score": -2,
            "text": "Hell yeah! Do it America.. but with that Russian loving president in office now, I don't see it happening",
            "title_similarity": "0.5670613",
            "sentiment_compound": 0.6643
        },
        {
            "id": "hyqh3l3",
            "score": 3,
            "text": "Kosovo je SRBIJA",
            "title_similarity": "0.30929545",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyqjgoq",
            "score": 1,
            "text": "I really hope we don’t push Russia too far. You know this MAD doesn’t work if one party has absolutely nothing to lose.",
            "title_similarity": "0.31599393",
            "sentiment_compound": 0.4115
        },
        {
            "id": "hyrak6v",
            "score": -1,
            "text": "[removed]",
            "title_similarity": "0.023486834"
        },
        {
            "id": "hyou3hx",
            "score": 8,
            "text": "Here is something you can do UN... since most of your decrees are meaningless.. .\n\nKosovo is still not a United Nations member over objections from Russia.",
            "title_similarity": "0.409307",
            "sentiment_compound": -0.6407
        },
        {
            "id": "hype7l2",
            "score": 14,
            "text": "Biden has a long history with Kosovo. \n\nHe introduced the McCain-Biden resolution that led to the U.S. joining NATO bombing operations in the country in 1999.\n\nHis son Beau worked as a legal advisor in helping the country establish its post-Yugoslavian criminal code.\n\nAfter he was elected VP, he became the first sitting veep to visit the country and was awarded the nation's highest honor.\n\nKosovo's been through a lot, and I hope Biden helps her.",
            "title_similarity": "0.639264",
            "sentiment_compound": 0.8658
        },
        {
            "id": "hyp4wv9",
            "score": 11,
            "text": "See this is the one of the major reasons why the USA has a large defense budget. \n\nThe country is able to exert influence anywhere in the world and countries are more likely to align themselves with power. \n\nNot saying the USA does right 100% of the time but, I’d rather align with the US then find out. Having US bases basically ensures that country’s safety",
            "title_similarity": "0.5364037",
            "sentiment_compound": 0.6059
        },
        {
            "id": "hypf2an",
            "score": 3,
            "text": "Kosovo je NATO",
            "title_similarity": "0.51552963",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyphdrv",
            "score": 2,
            "text": "No.  Put a French or German military base there.  NATO is more than just the US.",
            "title_similarity": "0.5633585",
            "sentiment_compound": 0.0
        },
        {
            "id": "hypj58e",
            "score": 3,
            "text": "Wait wait wait... Trump said this invasion was genius! How could things be going so badly for Putin?\n\n/s",
            "title_similarity": "0.47258985",
            "sentiment_compound": -0.6466
        },
        {
            "id": "hypjywj",
            "score": -3,
            "text": "Kosovo is full of mafia.",
            "title_similarity": "0.32167354",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyppx29",
            "score": -2,
            "text": "Fake criminal country Kosovo is scared. Watch videos on YouTube what muslim extremists did there in 2004., before and now. Serbians will come back in their homes, even sooner than I thought 👏👏👏\nUS let Avganistan go, if I were in that criminal fake country, that is half recognized, not even member of UN, I will pack. Serbians are mad.",
            "title_similarity": "0.48050663",
            "sentiment_compound": -0.959
        },
        {
            "id": "hypse8k",
            "score": 3,
            "text": "Kosovo is now america~ Fuck ya gon do now serbia",
            "title_similarity": "0.5675659",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hypg446",
            "score": 7,
            "text": "I’m happy to see the people of Kosovo getting back on their feet. From an Army veteran of KFOR 1B. 👍🏻",
            "title_similarity": "0.413768",
            "sentiment_compound": 0.5719
        },
        {
            "id": "hypv6z6",
            "score": -7,
            "text": "[removed]",
            "title_similarity": "0.023486834"
        },
        {
            "id": "hyowjgc",
            "score": -14,
            "text": "[deleted]",
            "title_similarity": "0.028029473"
        },
        {
            "id": "hyozwgx",
            "score": 9,
            "text": "Well, de-facto we're already in NATO because of the military presence from various nations here and the US already having a military base, but we're taking the opportunity to at least ask because why not?\n\nIn times of war, a lot of things that usually drag out in peace get done far more quickly.",
            "title_similarity": "0.6612719",
            "sentiment_compound": 0.3182
        },
        {
            "id": "hyq3jtd",
            "score": -7,
            "text": "And people wonder why Russia is doing what it does. America’s reign as the world police is drawing to an end.",
            "title_similarity": "0.6060954",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyp1mtq",
            "score": 5,
            "text": "Looks like the Domino Theory works in reverse. Russia kicks off for no good reason prompts other countries that were wavering. Plus knock ons in Asia. Absolutely bonkers how poorly Putin has played this.",
            "title_similarity": "0.42429626",
            "sentiment_compound": 0.2249
        },
        {
            "id": "hyp7dxl",
            "score": 0,
            "text": "It's almost as Putin is actually an operative of NATO. Everything he is doing is making it stronger and stronger.",
            "title_similarity": "0.6672975",
            "sentiment_compound": 0.6369
        },
        {
            "id": "hypab28",
            "score": 0,
            "text": "Thank you for sharing u/two_plus_two_is_zero \n\nLegit TIL that Kosovo is not a UN-recognised country.",
            "title_similarity": "0.39354125",
            "sentiment_compound": 0.6486
        },
        {
            "id": "hypan4c",
            "score": 0,
            "text": "💙💛💙💛💙💛 [https://www.redbubble.com/i/t-shirt/I-Stand-With-Ukraine-Ukrainian-Map-Ukraine-Support-No-War-Idea-by-haythamjl/103153730.IJ6L0?asc=u](https://www.redbubble.com/i/t-shirt/I-Stand-With-Ukraine-Ukrainian-Map-Ukraine-Support-No-War-Idea-by-haythamjl/103153730.IJ6L0?asc=u)",
            "title_similarity": "0.50129336",
            "sentiment_compound": 0.981
        },
        {
            "id": "hypdfq9",
            "score": 0,
            "text": "Given that both China and Russia have denied Kosovo into the UN and don't recognize it's independence, this sounds like a terrible idea.",
            "title_similarity": "0.37751034",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hypdlqc",
            "score": 4,
            "text": "Colonize us harder senpai.",
            "title_similarity": "0.2733178",
            "sentiment_compound": 0.0
        },
        {
            "id": "hype1tw",
            "score": 4,
            "text": "The base was always going to be permanent. Kosovo doesn't even exist without the USA allowing it.  \n\n\nWhat will their contribution to NATO be exactly? Make soup?",
            "title_similarity": "0.60253495",
            "sentiment_compound": 0.0
        },
        {
            "id": "hype8fm",
            "score": 0,
            "text": "This should end poorly",
            "title_similarity": "0.018863674",
            "sentiment_compound": 0.0
        },
        {
            "id": "hypenfr",
            "score": 0,
            "text": "I think they should allow them into NATO but they need to go through the regular process. \n\nI also HATE the idea of the US being constant world police. “Build a base in my country so we won’t get attached”",
            "title_similarity": "0.58503234",
            "sentiment_compound": -0.7717
        },
        {
            "id": "hypep7j",
            "score": 0,
            "text": "Why is this thread just white people stroking each other off? Some individual American is thanking people on behalf of his government lmfao. Has to be the most cringe shit ever.",
            "title_similarity": "0.38456702",
            "sentiment_compound": -0.0972
        },
        {
            "id": "hypeyjt",
            "score": 0,
            "text": "Or build up your own military…",
            "title_similarity": "0.47041893",
            "sentiment_compound": 0.0
        },
        {
            "id": "hypf22u",
            "score": 0,
            "text": "Can we instead just help Kosovo build their own bases and keep our people out of it?\n\nYou know, maybe have NATO fucking build it and staff it?",
            "title_similarity": "0.66079235",
            "sentiment_compound": 0.4696
        },
        {
            "id": "hypg6u3",
            "score": 0,
            "text": "In 100 years, Russia itself will be a part of NATO or they will continue to be a shitty country. Either that or Putin or a leader like him will ensure Russia doesn’t exist.",
            "title_similarity": "0.6258946",
            "sentiment_compound": 0.128
        },
        {
            "id": "hypgslr",
            "score": 0,
            "text": "😝",
            "title_similarity": "-0.016807906",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyph7ea",
            "score": 0,
            "text": "Putin has got to be the DUMBEST leader of any nation, ever.",
            "title_similarity": "0.26214838",
            "sentiment_compound": -0.6166
        },
        {
            "id": "hyphsrr",
            "score": 0,
            "text": "Kosovo wants the embrace",
            "title_similarity": "0.42603776",
            "sentiment_compound": 0.3182
        },
        {
            "id": "hypi6t4",
            "score": 0,
            "text": "[deleted]",
            "title_similarity": "0.028029473"
        },
        {
            "id": "hypiihr",
            "score": 0,
            "text": "“ThE uS ArE CrImInAlS” Hey uh daddy biden, mind throwing a base here, please, today, now?",
            "title_similarity": "0.41969454",
            "sentiment_compound": 0.3182
        },
        {
            "id": "hypinmh",
            "score": 0,
            "text": "Make Kosovo part of NATO!!!",
            "title_similarity": "0.66233075",
            "sentiment_compound": 0.0
        },
        {
            "id": "hypioc0",
            "score": 0,
            "text": "Putin is done, and not just on Twitch.",
            "title_similarity": "0.28608313",
            "sentiment_compound": 0.0
        },
        {
            "id": "hypip5v",
            "score": 4,
            "text": "tHe Us hAS 2 mAnY bAsEs. Oh wait. The world wants them.",
            "title_similarity": "0.4252489",
            "sentiment_compound": 0.0
        },
        {
            "id": "hypkv1y",
            "score": 0,
            "text": "But then once this crisis will pass Kosovo among many other nations will be screaming the US is just an imperialist war mongering nation who meddles in everyone's affairs.",
            "title_similarity": "0.514366",
            "sentiment_compound": -0.9626
        },
        {
            "id": "hypkvgk",
            "score": 0,
            "text": "Selling the soul, fearing the devil.",
            "title_similarity": "0.20509987",
            "sentiment_compound": -0.8442
        },
        {
            "id": "hypm6wm",
            "score": 0,
            "text": "Putin to the Russian people: We need to invade Ukraine to stop the expansion of NATO.\n\nSweden, Finland, and Kosovo now want in.",
            "title_similarity": "0.7454102",
            "sentiment_compound": -0.2263
        },
        {
            "id": "hypm91b",
            "score": 0,
            "text": "Lots of servicemebers gonna get hot Ukrainian ass. I'd say that's top 5 reason to enlist",
            "title_similarity": "0.40954232",
            "sentiment_compound": -0.4019
        },
        {
            "id": "hypm9ke",
            "score": 0,
            "text": "I hope Russia faces a massive GDP collapse like they did after the fall of the USSR.",
            "title_similarity": "0.5485053",
            "sentiment_compound": 0.296
        },
        {
            "id": "hypmmry",
            "score": 0,
            "text": "Damn Putin, your idiocy has sped up US Imperialism and political hegemony, who could have seen this coming?  Im not even the leader of a nation and i could have told you this",
            "title_similarity": "0.43383953",
            "sentiment_compound": -0.4019
        },
        {
            "id": "hypn2rl",
            "score": 0,
            "text": "Sure would be nice if some of other NATO allies could pitch in and build some bases.",
            "title_similarity": "0.5792961",
            "sentiment_compound": 0.6249
        },
        {
            "id": "hypnkzk",
            "score": 0,
            "text": "\"If Biden posts soldiers in..........blarg,huff,puff,blargh.........\"",
            "title_similarity": "0.4674369",
            "sentiment_compound": 0.0
        },
        {
            "id": "hypnysu",
            "score": 0,
            "text": "We didn't in '91?\n\nHuh",
            "title_similarity": "0.17940962",
            "sentiment_compound": 0.0
        },
        {
            "id": "hypo6pz",
            "score": 0,
            "text": "If the world wants the us to be the world police then they should pitch in and cover the healthcare costs of our country.",
            "title_similarity": "0.54869795",
            "sentiment_compound": 0.0
        },
        {
            "id": "hypqzbq",
            "score": 0,
            "text": "I mean...when they WANT permanent US military bases.\n\nYou got to give them what they want right?\n\nIt's kind of like the whole burka situation.  It's oppressive tyranny when you force it onto people, but when they want to wear it and you kindly provide the article of clothing, then it becomes empowerment.\n\nno /s, or maybe /s?",
            "title_similarity": "0.546392",
            "sentiment_compound": 0.5761
        },
        {
            "id": "hypue88",
            "score": 0,
            "text": "I am a citizen of Earth. I support this.",
            "title_similarity": "0.34011227",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hypwurc",
            "score": 0,
            "text": "Holdup. See this is where politicians lose me. Ukraine holding their own. Chill out",
            "title_similarity": "0.40374452",
            "sentiment_compound": -0.4019
        },
        {
            "id": "hypym5t",
            "score": 0,
            "text": "Serbs are going to get bombed soon just like Yugoslavia by NATO. Excited",
            "title_similarity": "0.5350111",
            "sentiment_compound": 0.5994
        },
        {
            "id": "hypyzgz",
            "score": 0,
            "text": "Had Ukraine just been made a NATO member this would have never happened. Hesitation did this",
            "title_similarity": "0.50922203",
            "sentiment_compound": 0.2057
        },
        {
            "id": "hyq00su",
            "score": 0,
            "text": "That’s just billions of more American dollars gone.  I know US govt will approve, but American people are not doing that well at all",
            "title_similarity": "0.38659722",
            "sentiment_compound": -0.3007
        },
        {
            "id": "hyqmkam",
            "score": 0,
            "text": "We’re heading in a bad direction. Chance of thermo nuclear Holocaust is rising sharply. This should’ve been avoided",
            "title_similarity": "0.39951658",
            "sentiment_compound": -0.5994
        },
        {
            "id": "hyquhgw",
            "score": 0,
            "text": "not the base,  the military industrial complex is juiced up enough... If it comes to war it wont be stationed at this location, it may be fought here, but a base will add no tactical advantage with todays technology.  Get them in NATO, thats a great idea,  but we dont need to give the US army an excuse for a bigger budget",
            "title_similarity": "0.5494914",
            "sentiment_compound": 0.0232
        },
        {
            "id": "hyqunji",
            "score": 0,
            "text": "*laughs in middle east*",
            "title_similarity": "0.101884305",
            "sentiment_compound": 0.4939
        },
        {
            "id": "hyqwpu9",
            "score": 0,
            "text": "/popcorn... If Spain accepts Kosovo and Metohija, bye bye Catalonia ;)",
            "title_similarity": "0.35273454",
            "sentiment_compound": 0.4939
        },
        {
            "id": "hyrgqtf",
            "score": -4,
            "text": "Omg. The amount of Upvotes this has. r/worldnews has fully drunk the American good guys Kool aid.\n\nJust read up on how Kosovo was formed and see the irony for yourself. Haha.\n\nWanna hear a joke. NATO is a defensive treaty.",
            "title_similarity": "0.48585832",
            "sentiment_compound": 0.6494
        },
        {
            "id": "hyrurrm",
            "score": 0,
            "text": "Everyone hates the US military budget until they realize why it’s so gigantic.",
            "title_similarity": "0.37130257",
            "sentiment_compound": -0.4404
        },
        {
            "id": "hysjx2o",
            "score": 0,
            "text": "This feels like a one way ticket to world war 3. I’m all for helping Ukraine but the nato policy of you screw with one member everyone in nato will start fighting you seems a little risky.",
            "title_similarity": "0.5769049",
            "sentiment_compound": -0.6918
        },
        {
            "id": "hyp945e",
            "score": -5,
            "text": "Anyone who thinks NATO will have any more additions is crazy. Not Kosovo, not Ukraine, not Finland nor Sweden. This is why many think the US should be candid that they won't be expanding NATO further east so that Russia/Putin can calm their tits and we can stop leading Ukraine on.",
            "title_similarity": "0.545056",
            "sentiment_compound": -0.5367
        },
        {
            "id": "hypgb07",
            "score": 6,
            "text": "Well... Kosovo was always an USA military base so now it's only an officialisation",
            "title_similarity": "0.50773823",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hypicyr",
            "score": 5,
            "text": "Kosovo is *very* pro-West and will be an EU nation in the future.",
            "title_similarity": "0.521279",
            "sentiment_compound": 0.0
        },
        {
            "id": "hypqg33",
            "score": -4,
            "text": "No thanks. Rather have the US entirely out of Europe",
            "title_similarity": "0.29935753",
            "sentiment_compound": -0.3412
        },
        {
            "id": "hypt7pj",
            "score": 5,
            "text": "As an American this is great and all but it’s waaaay past time for Europe to develop an EU army that can handle these things.  Do you think we like paying all our taxes to the military, while Europe enjoys free social care? Do you realize how much it costs to sustain a military our size? Time for the EU to step up and form a common army against invaders. Let‘s bring our boys home.",
            "title_similarity": "0.5963584",
            "sentiment_compound": 0.9655
        },
        {
            "id": "hyowb5i",
            "score": 20,
            "text": "Reverse imperialism is weird.",
            "title_similarity": "0.1004913",
            "sentiment_compound": -0.1779
        },
        {
            "id": "hyou07l",
            "score": 35,
            "text": "Kosovo is about a third the size of Maryland.  They must be serious if they're going to give the USA a significant percentage of their territory for a base.",
            "title_similarity": "0.5918571",
            "sentiment_compound": 0.128
        },
        {
            "id": "hypsrtu",
            "score": 6,
            "text": "We love you kosovo 🇽🇰",
            "title_similarity": "0.28058797",
            "sentiment_compound": 0.6369
        },
        {
            "id": "hyqv2mm",
            "score": -8,
            "text": "And here we go another another arabic county consumed by the US military… except its ukraine.",
            "title_similarity": "0.5781599",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyp3rqb",
            "score": 1,
            "text": "Don't blame them watching this unfold. Lets get them in ASAP",
            "title_similarity": "0.3326027",
            "sentiment_compound": 0.2584
        },
        {
            "id": "hyp3z8k",
            "score": -1,
            "text": "Putin: STAWP GETTING BIGGER NATO. \n\nNATO:  No.",
            "title_similarity": "0.5139228",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyp5zha",
            "score": 1,
            "text": "Yankee go home!\n\n*Russia invades*\n\nYankee stay here!\n\nYa done fucked up Poots",
            "title_similarity": "0.53467906",
            "sentiment_compound": -0.717
        },
        {
            "id": "hyp6f3e",
            "score": -1,
            "text": "Yes.  Good.",
            "title_similarity": "0.013136825",
            "sentiment_compound": 0.6808
        },
        {
            "id": "hypdyfs",
            "score": -1,
            "text": "The most important consideration is if the women there are hot & reasonably available. Otherwise stationing soldiers & civilians longer than a deployment there is brutal on morale  \n\nI'm not even joking",
            "title_similarity": "0.32263806",
            "sentiment_compound": -0.568
        },
        {
            "id": "hypf8on",
            "score": 1,
            "text": "Serbs gonna be pissed.",
            "title_similarity": "0.23615742",
            "sentiment_compound": -0.6369
        },
        {
            "id": "hypfdv5",
            "score": 1,
            "text": "Would be better to have NATO base",
            "title_similarity": "0.50527406",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hypg76l",
            "score": 1,
            "text": "lolllllllllll Putin just keeps winning",
            "title_similarity": "0.25745338",
            "sentiment_compound": 0.5267
        },
        {
            "id": "hypgp2g",
            "score": 1,
            "text": "👏👏👏",
            "title_similarity": "-0.016807906",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyph0az",
            "score": 1,
            "text": "Just in time for Trump to abandon it when he steals office for his 2nd term?",
            "title_similarity": "0.44779986",
            "sentiment_compound": -0.7351
        },
        {
            "id": "hyphoh8",
            "score": 1,
            "text": "You can't make this stuff up. Everyone sees what's going on. Who is good and who is evil. All of the bs crap of genocide and nazi this and nazi that. Everyone sees",
            "title_similarity": "0.3241866",
            "sentiment_compound": -0.6249
        },
        {
            "id": "hypixr8",
            "score": -1,
            "text": "I hope they don’t complain about the base in 5 years.",
            "title_similarity": "0.3242322",
            "sentiment_compound": 0.1027
        },
        {
            "id": "hypkmpe",
            "score": 1,
            "text": "How amusing would it be if he retaliated and put out there whatever he has got on Trump be it financial or whatever…!?",
            "title_similarity": "0.38677993",
            "sentiment_compound": 0.4389
        },
        {
            "id": "hypmyk9",
            "score": 1,
            "text": "I dunno. Kosovo is still quite brutal.",
            "title_similarity": "0.23253544",
            "sentiment_compound": -0.659
        },
        {
            "id": "hypn0y4",
            "score": -1,
            "text": "Omg no get the fuck outta NATO and let the Europeans handle there own affairs this neoliberalism shit has got us into two forever wars already it's time to return to a neorealism foreign policy and get ready for our pivot to China.",
            "title_similarity": "0.5647011",
            "sentiment_compound": -0.886
        },
        {
            "id": "hypnn7c",
            "score": -1,
            "text": "The more the media is taking a specific side and knowing soros has funded Ukraine for over 20 yrs I find it hard to not question everything we are “told”",
            "title_similarity": "0.43367776",
            "sentiment_compound": -0.1027
        },
        {
            "id": "hypoz6s",
            "score": 1,
            "text": "This should be the exact response.  As for future deterrence to let Russia know, his actions of hostility will lead to overall loss for Russia.  His cry for more recognition was unnecessary.  There are many more countries with much larger populations with lower overall GDP than Russia.  For being a pariah all these years, his country had it much better in the overall world economy than compliant countries like Indonesia, Mexico, etc..  Isolation is the only way to show Putin that his actions are not tolerated.\n\nAnd his threat of nuclear attacks shows how unstable he is.  Now we see more clearly that he is the American's version of Donald Trump.",
            "title_similarity": "0.48587906",
            "sentiment_compound": -0.9218
        },
        {
            "id": "hyppyeo",
            "score": -1,
            "text": "Yeah but Ukraine needs to deal with the insurgent groups in their country first. That's the main reason they weren't there in the first place",
            "title_similarity": "0.5644718",
            "sentiment_compound": 0.1531
        },
        {
            "id": "hypq96j",
            "score": -1,
            "text": "Imagine leaving Afghanistan but then sending troops to Ukraine in the same administration and not seeing the irony",
            "title_similarity": "0.64732397",
            "sentiment_compound": 0.0572
        },
        {
            "id": "hypruaz",
            "score": 1,
            "text": "So before the world wanted USA to not be a global police, now they’re asking their military help. Lol.",
            "title_similarity": "0.6158584",
            "sentiment_compound": 0.6705
        },
        {
            "id": "hyps7o9",
            "score": 1,
            "text": "If Biden can outsmart you, Vlad must be one stupid dumbass.",
            "title_similarity": "0.2533415",
            "sentiment_compound": -0.7906
        },
        {
            "id": "hypulmm",
            "score": 1,
            "text": "So now everybody is cheering for the US to be world police? Interesting turn, Reddit.",
            "title_similarity": "0.4209735",
            "sentiment_compound": 0.7184
        },
        {
            "id": "hypuzvf",
            "score": -1,
            "text": "yayyy more foreign military bases yayyy go usa!!",
            "title_similarity": "0.5150485",
            "sentiment_compound": 0.0
        },
        {
            "id": "hypv27m",
            "score": 1,
            "text": "I’ve heard that Serbia is itching to reintegraye eastern bosnia",
            "title_similarity": "0.52603817",
            "sentiment_compound": 0.0
        },
        {
            "id": "hypv7i2",
            "score": 1,
            "text": "Requests like this should be met with RIDICULOUS speed. We should be there tomorrow laying out the plan to build and start the following week. Unfortunately shit like this seems to take years but with the way the world is we need to stomp out communism everywhere we can. When a country wants to be a part of NATO rush that process as fast as you can.",
            "title_similarity": "0.6122705",
            "sentiment_compound": -0.3852
        },
        {
            "id": "hypx0vy",
            "score": 1,
            "text": "Peace for Palestine🇵🇸 and\n Peace for Ukraine🇺🇦",
            "title_similarity": "0.061658707",
            "sentiment_compound": 0.7906
        },
        {
            "id": "hypyf0x",
            "score": 1,
            "text": "Scumbag serbs are not going to like it",
            "title_similarity": "0.20720878",
            "sentiment_compound": -0.7438
        },
        {
            "id": "hyq4vn0",
            "score": 1,
            "text": "The US having a military base border Russia will be absolutely insane. It's the very same thing Russia is scared off. But this war Is so unwarranted, they might lose it all.",
            "title_similarity": "0.5495037",
            "sentiment_compound": -0.9317
        },
        {
            "id": "hyqaux5",
            "score": 1,
            "text": "Serbia definitely not going to be a fan of this, and arguably rightfully so.",
            "title_similarity": "0.22971685",
            "sentiment_compound": 0.4588
        },
        {
            "id": "hyqi2jw",
            "score": 1,
            "text": "Serbia is not gunna like this",
            "title_similarity": "0.13948146",
            "sentiment_compound": -0.2755
        },
        {
            "id": "hyqnw12",
            "score": 1,
            "text": "[deleted]",
            "title_similarity": "0.028029473"
        },
        {
            "id": "hyrc0x0",
            "score": 1,
            "text": "After Russia's failed invasion attempt of Ukraine*",
            "title_similarity": "0.5641164",
            "sentiment_compound": -0.5106
        },
        {
            "id": "hysc0lm",
            "score": 1,
            "text": "I don't get how come no one even talks about the fact that Kosovo became independent the same way Dombas is going. Only it was NATO insted of Russia.",
            "title_similarity": "0.632681",
            "sentiment_compound": -0.296
        },
        {
            "id": "hyp0woh",
            "score": 8,
            "text": "Risking any upset of the status quo in the Balkans doesn’t seem like a smart idea at the moment. Historic precedence and all that jazz…",
            "title_similarity": "0.30675033",
            "sentiment_compound": 0.0772
        },
        {
            "id": "hyopefa",
            "score": 38,
            "text": "Shouldn't really matter considering they're effectively landlocked by NATO states, but I'm all for the expansion of the alliance.",
            "title_similarity": "0.57331353",
            "sentiment_compound": 0.2034
        },
        {
            "id": "hyp09n3",
            "score": 2,
            "text": "😂😂 oh you’ve gotta laugh",
            "title_similarity": "0.014344606",
            "sentiment_compound": 0.8555
        },
        {
            "id": "hyp1nm7",
            "score": 2,
            "text": "Lol",
            "title_similarity": "-0.06696998",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hyp1wka",
            "score": -2,
            "text": "This invasion of Ukraine has literally done the exact opposite of what Putin wanted. He thought this bullying tactic would stop nations joining the west, instead its expedited it",
            "title_similarity": "0.50020134",
            "sentiment_compound": -0.7798
        },
        {
            "id": "hyp8tgx",
            "score": -2,
            "text": "Russia won’t allow it",
            "title_similarity": "0.26304632",
            "sentiment_compound": 0.2263
        },
        {
            "id": "hypbbcv",
            "score": 2,
            "text": "Putin had a critical failure?",
            "title_similarity": "0.24817134",
            "sentiment_compound": -0.6808
        },
        {
            "id": "hypdsmk",
            "score": 2,
            "text": "Who had \"Balkan country *asks* for a United States military base\" on their 2022 BINGO card?",
            "title_similarity": "0.68556863",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hypel3k",
            "score": 2,
            "text": "I fucking love it, all these years of poisoning, harassment, proxy wars, assassinations, stealing lying etc, is coming around to ravage Putin in the ass .\nHow many years have countries put up with his shit over and over again until finally they get a chance to play him at his own game.\nI'm sure if Russia wasn't such a boat rocker over this last decade then this would be playing out differently, but Putin has pissed off nearly every country and they are all out doing their bit to exact revenge.\nWell done Putin you played yourself, reap what you sow! slava Ukraine 🇺🇦",
            "title_similarity": "0.41828346",
            "sentiment_compound": -0.9464
        },
        {
            "id": "hypeygx",
            "score": 2,
            "text": "You guys can all joke about it but answer this question? What happens and the whole world teams up against Russia who actually own most of the nuclear war heads in the world. Who wins if there is actually another world war but with nuks? I bet you guys won't be sitting behind computers and phones typing. This conflict needs to end ASAP bc if it escalates no one wins that war. Everyone loses!!",
            "title_similarity": "0.55350477",
            "sentiment_compound": -0.9788
        },
        {
            "id": "hypf1xv",
            "score": -2,
            "text": "As an American, we aren’t and shouldn’t be the world police. \n\nAside from the damned if you do damned if you don’t nature of those arrangements, shit is expensive. If you want our help, pay up or pay for your own defense. \n\nToo often do people want a free ride when it comes to defense only to demonize us as warmongers the moment it’s convenient.",
            "title_similarity": "0.35269994",
            "sentiment_compound": -0.7003
        },
        {
            "id": "hypf8nb",
            "score": 2,
            "text": "Damn, I would have loved to be stationed in the Balkans for a year or 2",
            "title_similarity": "0.5446172",
            "sentiment_compound": 0.296
        },
        {
            "id": "hypfero",
            "score": -2,
            "text": "I'm not sure if that's an Asian supermarket chain or a partially-recognised de facto sovereign state in Southeast Europe. But, either way, it's probably insignificant enough that Putin won't GAF.",
            "title_similarity": "0.35738587",
            "sentiment_compound": -0.5546
        },
        {
            "id": "hyph12s",
            "score": 2,
            "text": "Guys, read some geopolitics, Kosovo it's not recognized by many nato countries,  so they can't join before they do it....",
            "title_similarity": "0.4498746",
            "sentiment_compound": -0.285
        },
        {
            "id": "hyph173",
            "score": 2,
            "text": "## SPEED THIS UP",
            "title_similarity": "0.19056559",
            "sentiment_compound": 0.0
        },
        {
            "id": "hypih1b",
            "score": 2,
            "text": "I could chill at a base in Kosovo, love it there.\nWould be good to be back.\nLast time was during the war.",
            "title_similarity": "0.5432432",
            "sentiment_compound": 0.4939
        },
        {
            "id": "hypio9d",
            "score": 2,
            "text": "Hello Yeah Kosovo!  Hope you like McDonalds and FREEDOM!!",
            "title_similarity": "0.28943026",
            "sentiment_compound": 0.9247
        },
        {
            "id": "hypiqos",
            "score": 2,
            "text": "And this right here is why the US military has such a huge budget.  People want us to help, and Americans want us to help helpless people, and then everyone complains that the US military spends too much.",
            "title_similarity": "0.4020185",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hypjbos",
            "score": 2,
            "text": "Super handy timing Kosovo.",
            "title_similarity": "0.22791268",
            "sentiment_compound": 0.5994
        },
        {
            "id": "hypje2s",
            "score": 2,
            "text": "Wait, you’re telling me we can setup a permanent military base in a country without having to invade it for its natural resources, I mean, weapons of mass destruction?",
            "title_similarity": "0.70881623",
            "sentiment_compound": -0.6249
        },
        {
            "id": "hypjecn",
            "score": -2,
            "text": "If Russia had to choose whether to have Ukraine join NATO or the rest of the non-NATO European states join NATO, he'd choose the latter. Ukraine is pretty important to Russian security. All these states joining NATO isn't a big deal. I'd say Germany taking a hardline stance against Russia is a much bigger issue.",
            "title_similarity": "0.6880932",
            "sentiment_compound": 0.8689
        },
        {
            "id": "hypjjvf",
            "score": 2,
            "text": "For those too young to remember - In 1999 NATO bombed the Federal Republic of Yugoslavia (FRY) army as the Kosovo Liberation Army (KLA) rebels were fighting them out of the region. Afterward, FR Yugoslavia retreated, signed an agreement with NATO's international coalition, and the United Nations Security Council (UNSC) created the UN Interim Administration in Kosovo (UNMIK) to administer the region. In 2001 Organization for Security and Co-operation in Europe (OSCE) supervised the election of the Assembly of Kosovo. By 2003 FR Yugoslavia reorganized as a union between Serbia and Montenegro, allowing Montenegro to pass an independence referendum in 2006. Kosovo declared independence in 2008.",
            "title_similarity": "0.69408125",
            "sentiment_compound": 0.8176
        },
        {
            "id": "hypjt3q",
            "score": 2,
            "text": "Plot twist; communism as been capitalism propaganda all this time",
            "title_similarity": "0.37657556",
            "sentiment_compound": -0.25
        },
        {
            "id": "hypjzn2",
            "score": 2,
            "text": "💪🇽🇰      💪🇺🇦",
            "title_similarity": "0.0061455965",
            "sentiment_compound": 0.0
        },
        {
            "id": "hypkef6",
            "score": 2,
            "text": "Kosovo probably fears that Serbia could do something similar at some point in time basically",
            "title_similarity": "0.42663026",
            "sentiment_compound": -0.4215
        },
        {
            "id": "hypkvnl",
            "score": 2,
            "text": "I am seriously starting to think that his actual goal is to strengthen NATO. Without a boogeyman, how can you unite a country under corrupt rule?",
            "title_similarity": "0.63902533",
            "sentiment_compound": 0.1531
        },
        {
            "id": "hypl0r8",
            "score": -2,
            "text": "I think we were encroaching on Russia's space no matter what Putin did. Putin is just following our playbook, bully anyone too close for comfort.",
            "title_similarity": "0.52384937",
            "sentiment_compound": -0.196
        },
        {
            "id": "hyplwd6",
            "score": 2,
            "text": "Make it happen USA! ✊🇺🇦",
            "title_similarity": "0.40978912",
            "sentiment_compound": 0.0
        },
        {
            "id": "hypn4j6",
            "score": -2,
            "text": "\"HAHA US IS XYZ\"\n\n\"Pls help us US\"\n\nCan't Europe deal with this? Tired of spending my taxes on places and people who are ungrateful.",
            "title_similarity": "0.32923383",
            "sentiment_compound": 0.092
        },
        {
            "id": "hypnx5z",
            "score": 2,
            "text": "Kosovo je Srbjia",
            "title_similarity": "0.32332537",
            "sentiment_compound": 0.0
        },
        {
            "id": "hypoh0p",
            "score": 2,
            "text": "Kosovo has its own interest when it comes to that. They are not doing this for Ukraine",
            "title_similarity": "0.3554041",
            "sentiment_compound": 0.4588
        },
        {
            "id": "hyppdbb",
            "score": -2,
            "text": "Kosovo isn’t independent, so that’s unlikely.",
            "title_similarity": "0.18299177",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyppkij",
            "score": 2,
            "text": "Huh, that’s new. A country that wants our military there.",
            "title_similarity": "0.5838531",
            "sentiment_compound": 0.0
        },
        {
            "id": "hypw4e9",
            "score": 2,
            "text": "And what exactly does the United States get out of establishing a military presence there? Other than yet another excuse for bloated defense spending?",
            "title_similarity": "0.5711309",
            "sentiment_compound": 0.6072
        },
        {
            "id": "hyq222v",
            "score": 2,
            "text": "Russian actions have forced the issue. If you're not NATO, then prepare to be Russia.",
            "title_similarity": "0.6526005",
            "sentiment_compound": -0.4588
        },
        {
            "id": "hyq2icf",
            "score": -2,
            "text": "NATO isn't the answer we can be allies with NATO.",
            "title_similarity": "0.42334837",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyq3wvn",
            "score": -2,
            "text": "The last thing the US needs to do is build another military base abroad.",
            "title_similarity": "0.5621612",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyq91w4",
            "score": 2,
            "text": "Does Russia accept Oregonians?",
            "title_similarity": "0.55484235",
            "sentiment_compound": 0.3818
        },
        {
            "id": "hyqn1tk",
            "score": -2,
            "text": "Lol always works out to have a us military base in ur country. Just look how much the locals love the Okinawa base",
            "title_similarity": "0.4872585",
            "sentiment_compound": 0.7906
        },
        {
            "id": "hyqsmiz",
            "score": 2,
            "text": "Er... Putin recognise DPR and LPR as independent state, they had declared independence during 2014 ukrainian revolution. It was nt recognised by other country and called \"separatist\", it is against Minch agreement. \nMeanwhile when it come to Kosovo, it is okay to declare independence like that.\nMinsk agreement was publicly denied, unrecognized by those that signed the document. One of them, incidentally assasinated in \"terrorist act.\" anyway the Minsk agreement was long dead before recent Russia-Ukraine conflict.\n\nJust saying, the double standard here is strong",
            "title_similarity": "0.6319149",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hyr814h",
            "score": 2,
            "text": "Didn't we already have bases there? My cousin did his military time there 15 years ago patrolling one of them (Italy)",
            "title_similarity": "0.53951347",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyt7npo",
            "score": 2,
            "text": "Spent a year at Bondsteel, loved the country and the people. If this is the case ideally they’d convert the main multinational base into a permanent NATO position and turn Bondsteel into a permanent American base. It would likely become a beloved deployment for most folks.",
            "title_similarity": "0.59743786",
            "sentiment_compound": 0.875
        },
        {
            "id": "hyxa1y7",
            "score": 2,
            "text": "But Kosova has always had great and real love for US :)",
            "title_similarity": "0.1715786",
            "sentiment_compound": 0.9549
        },
        {
            "id": "hypelb1",
            "score": 11,
            "text": "Thank you USA, you are my best friend 🎶",
            "title_similarity": "0.23164177",
            "sentiment_compound": 0.872
        },
        {
            "id": "hypfbcj",
            "score": 3,
            "text": "USA: \"Kosovo, ffs give it a rest, you'l be in really soon\"\n\n&#x200B;\n\nKosovo: \"No, I want in now\" :D\n\nFinland: \"get in line bud, I asked first\" -,-\n\n&#x200B;\n\nKosovo: :(",
            "title_similarity": "0.5781367",
            "sentiment_compound": -0.3328
        },
        {
            "id": "hypg6kd",
            "score": 4,
            "text": "Newflash: Putin sending \"Peacekeepers\" to Kosovo.",
            "title_similarity": "0.69989115",
            "sentiment_compound": 0.3818
        },
        {
            "id": "hypiutm",
            "score": -2,
            "text": "Reading the comment sections on posts like this one reinforces my disgust for the Reddit community. Pro-war liberals have to be among the dumbest people alive.",
            "title_similarity": "0.2905057",
            "sentiment_compound": -0.4767
        },
        {
            "id": "hyplmlb",
            "score": 3,
            "text": "The US military has been in Kosovo since 1999. I doubt they are leaving anytime soon. Especially after the current events.",
            "title_similarity": "0.5656165",
            "sentiment_compound": -0.3612
        },
        {
            "id": "hypqvy3",
            "score": -3,
            "text": "Fuck off. Our defense budget is absurd and we have so many internal issues in the states. Quit fucking bailing other countries out and maybe focus on ours.",
            "title_similarity": "0.44983962",
            "sentiment_compound": -0.4588
        },
        {
            "id": "hypr9ax",
            "score": 3,
            "text": "The US Ambassador to Kosovo is a friend of mine. I suspect he's going to be real busy.",
            "title_similarity": "0.44506517",
            "sentiment_compound": 0.25
        },
        {
            "id": "hyprmg6",
            "score": 4,
            "text": "This is pretty unlikely.\n\nBut it’s just further evidence that Russia has horribly miscalculated the world’s reaction to their invasion. Every country vocalizing desires to be in NATO is a step back for Putin.",
            "title_similarity": "0.622436",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hypsp0a",
            "score": 4,
            "text": "Unlike the invasion of Georgia people are watching this time. There no war in Iraq to distract us.",
            "title_similarity": "0.41844857",
            "sentiment_compound": 0.2373
        },
        {
            "id": "hyptkhy",
            "score": 3,
            "text": "Me being American. Who is Kosovo?",
            "title_similarity": "0.5149748",
            "sentiment_compound": 0.0
        },
        {
            "id": "hypussl",
            "score": 3,
            "text": "America might gain back some of if not all the global prestige they lost from 16-20 depending on how they handle this. Crazy that a few months ago it felt like this kind of power was in the decline.",
            "title_similarity": "0.38201243",
            "sentiment_compound": 0.2144
        },
        {
            "id": "hypws1i",
            "score": 3,
            "text": "People: America! Leave! Now! \n\nAlso People: Because we need you somewhere else!",
            "title_similarity": "0.44737783",
            "sentiment_compound": -0.3331
        },
        {
            "id": "hyq0j71",
            "score": -4,
            "text": "[deleted]",
            "title_similarity": "0.028029473"
        },
        {
            "id": "hyq60dx",
            "score": 3,
            "text": "All going swimmingly for Russia I see. I hope that Russia feels this shit for a long time to come.",
            "title_similarity": "0.5347649",
            "sentiment_compound": -0.3291
        },
        {
            "id": "hyq8krm",
            "score": 4,
            "text": "I never thought I'd see this. This is worse than the 80s. This is the cold war. I'm genuinely concerned about an even larger conflict breaking out of this. Putin is a mad dog, countries have suddenly just started standing up for themselves and said fuck off to Russia. \n\nIt's a beautiful sense of togetherness and standing up for eachother. However of the past years since the USSR fell, I believe this is the greatest chance of another world War and it is scary. Russia is losing and there is no telling what they will do because of their leadership. And Belarus really needs to fuck off as they're a main reason why other countries might get pulled into this. \n\nRussia has already been cut off from the rest of the world for most things, their economy will be completely crippled. I'm dumbfounded at how fast this situation has unraveled.",
            "title_similarity": "0.54199195",
            "sentiment_compound": -0.9764
        },
        {
            "id": "hyqmm75",
            "score": 4,
            "text": "Kosovo is a country?",
            "title_similarity": "0.40585396",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyp2nk7",
            "score": 13,
            "text": "This is the perfect time for Sweden and Finland to join NATO. \n\nAre they going to wait to be attacked?\n\nPlus, how many war fronts can putin handle?",
            "title_similarity": "0.730423",
            "sentiment_compound": -0.3313
        },
        {
            "id": "hypfwy5",
            "score": 11,
            "text": "I for one, welcome our Kosovo friends into the fold.",
            "title_similarity": "0.44397682",
            "sentiment_compound": 0.7269
        },
        {
            "id": "hyoolkm",
            "score": 43,
            "text": "And another one.",
            "title_similarity": "0.0019879658",
            "sentiment_compound": 0.0
        },
        {
            "id": "hypdykx",
            "score": 4,
            "text": "Well that backfired for Putin.",
            "title_similarity": "0.2469143",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hypqv4q",
            "score": 5,
            "text": "I was there as part of KFOR (also previously was in Bosnia as part of SFOR). That whole area is absolutely beautiful. The people are friendly. I was hoping the USA would establish  a permanent presence there back in the late 90’s and early 2000. I wanted to move back after I got out of the military, find a wife,  have a family etc . And then 9/11 happened.",
            "title_similarity": "0.6150525",
            "sentiment_compound": 0.8805
        },
        {
            "id": "hypr9uj",
            "score": 4,
            "text": "I see that Putin's master plan to increase the scope and influence of NATO, crash the Russian economy, allow Ukraine to turn his military into a global laughing stock, and piss off literally everyone in the world including his rich mob friends, is finally coming to fruition.  What a \"genius\" move, indeed!",
            "title_similarity": "0.560488",
            "sentiment_compound": 0.8398
        },
        {
            "id": "hyq0355",
            "score": -5,
            "text": "Here’s an idea for kosovo: pay for your own military!",
            "title_similarity": "0.6079404",
            "sentiment_compound": -0.1759
        },
        {
            "id": "hyp0kod",
            "score": 5,
            "text": "Yeah, this is not going the way Vladimir saw it going.",
            "title_similarity": "0.17140493",
            "sentiment_compound": 0.296
        },
        {
            "id": "hyp9f1c",
            "score": 4,
            "text": "[deleted]",
            "title_similarity": "0.028029473"
        },
        {
            "id": "hypa93y",
            "score": 5,
            "text": "By the end of this Russia will join nato",
            "title_similarity": "0.6928216",
            "sentiment_compound": 0.296
        },
        {
            "id": "hypc9y5",
            "score": 6,
            "text": "im totally cool with the us defense budget now. the world is just getting crazier and the ukraine situation has made me be thankful that the US cant really be messed with",
            "title_similarity": "0.5154408",
            "sentiment_compound": 0.8375
        },
        {
            "id": "hypcu1h",
            "score": 4,
            "text": "Putin is going to find himself with US permanent bases on his doorstep as ALL of the previous Soviet states who are now Nato members will be opening their doors to invite the US in.\n\nMr \"oh he's so savvy\" Putin is in for a much bigger problem with this bullshit he is pulling in Ukraine.",
            "title_similarity": "0.7454234",
            "sentiment_compound": -0.7096
        },
        {
            "id": "hypedb2",
            "score": 5,
            "text": "The world is uniting. Get Wrecked Putin.",
            "title_similarity": "0.4118477",
            "sentiment_compound": 0.0
        },
        {
            "id": "hypoen0",
            "score": 5,
            "text": "Four NATO members don't recognize the independence of Kosovo, and they're not a UN member, so I don't think Kosovo can join the alliance. But this is showing that NATO is more alive than ever. Seeing what happened to Ukraine, has made all neutral countries afraid of having to defend against Russia with no help.",
            "title_similarity": "0.5209761",
            "sentiment_compound": 0.3721
        },
        {
            "id": "hypuhq3",
            "score": 3,
            "text": "Always money for military bases. But no money for America’s own problems.",
            "title_similarity": "0.43850893",
            "sentiment_compound": -0.7469
        },
        {
            "id": "hypuoyn",
            "score": 5,
            "text": "What I want to see:  The sanctions against Russian banks lasting until after the US midterm elections.\n\nLets see how well the Republicans do when they've got no Russian money behind them",
            "title_similarity": "0.57511294",
            "sentiment_compound": 0.0516
        },
        {
            "id": "hyqe4d5",
            "score": -5,
            "text": "So, Kosovo's response to a threat from a neo-imperialist country is to run into the arms of another neo-imperialist country?",
            "title_similarity": "0.6294267",
            "sentiment_compound": -0.5267
        },
        {
            "id": "hyoohjh",
            "score": 3313,
            "text": "During times like this, the world realizes how lucky we are to have such a behemoth (US) on our side. What would the world be like if Russia or China were in charge? Hoping this unites the rest of the world and brings upon peace.\n\n\\-fellow Canadian",
            "title_similarity": "0.5019746",
            "sentiment_compound": 0.9201
        },
        {
            "id": "hyorgga",
            "score": 34,
            "text": "Understandable",
            "title_similarity": "-0.014581658",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyouokz",
            "score": 34,
            "text": "Source: Dua Lipa",
            "title_similarity": "0.11575952",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyozezj",
            "score": 5,
            "text": "Well we’ll we’ll if it isn’t the consequences of my own actions.",
            "title_similarity": "0.23707524",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hyp1bdm",
            "score": 7,
            "text": "Congratulations, Putin. You played yourself.",
            "title_similarity": "0.33367682",
            "sentiment_compound": 0.743
        },
        {
            "id": "hyp29rp",
            "score": 8,
            "text": "I’ve always wondered why the US has hella military bases all over the world yet no foreign bases on US soil.",
            "title_similarity": "0.41071934",
            "sentiment_compound": -0.296
        },
        {
            "id": "hypjw1d",
            "score": 7,
            "text": "Russia “I cannot tolerate NATO on my border.”\n\nTakes over a non NATO nation and now has NATO nations on the borders!!",
            "title_similarity": "0.6358181",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyplshp",
            "score": -5,
            "text": "I think USA destabilised the world. Massive political incompetence and inflation. You printed to many trillions and USA is owned by many countries. Many countries do not want to be dependent on petrodollar. US and EU are weak and we will feel it soon . Unless political shitheads will nuke the world .",
            "title_similarity": "0.41656637",
            "sentiment_compound": -0.8756
        },
        {
            "id": "hypsk60",
            "score": 6,
            "text": "Oh Putin, you done fucked up.\n\nZelensky's a hero, your occupation will fail and your people hate your guts.\n\nAnd hello to all the ruski trolls here.",
            "title_similarity": "0.29819572",
            "sentiment_compound": -0.8402
        },
        {
            "id": "hyonkyc",
            "score": 242,
            "text": "RISTINA, Feb 27 (Reuters) - Kosovo has asked the United States to establish a permanent military base in the country and speed up its integration into NATO after Russia's invasion of Ukraine, Kosovo's Defence Minister Armend Mehaj said on Sunday.\r  \n\r  \nThe United States has already 635 soldiers in the Balkan country to maintain the fragile peace as part of a NATO peacekeeping mission.\r  \n\r  \n\"Accelerating Kosovo's membership in NATO and having a permanent base of American forces is an immediate need to guarantee peace, security and stability in the Western Balkans,\" Mehaj said on his Facebook page.\r  \n\r  \nKosovo has joined other countries in introducing sanctions against Russia. Mehaj has said that his government was ready to offer help for any military operation to Ukraine, should that be asked for by Washington.\r  \n\r  \nKosovo's 2008 independence is recognised by more than 110 countries, mainly Western nations, but not by Serbia or its traditional ally Russia. Four NATO members also refuse to recognise Kosovo's independence.\r  \n\r  \nKosovo is still not a United Nations member over objections from Russia.",
            "title_similarity": "0.8498707",
            "sentiment_compound": 0.7581
        },
        {
            "id": "hypu58f",
            "score": 7,
            "text": "If Trump hadn’t lubed Putin’s knob from 2016-2020 we probably wouldn’t be in this mess. Trump withheld aid from Ukraine and was impeached for it. As an American I am so ashamed of that imbecile and all the lasting damage he did. Sorry. I am truly sorry that man ever got elected.",
            "title_similarity": "0.4235772",
            "sentiment_compound": -0.8993
        },
        {
            "id": "hypdm27",
            "score": 7,
            "text": "Serbia isn't going to like that. When I was there for work, the security teams I spoke to when they were showing me around, I asked what happened to those abandoned looking building and they said those were bombed during the war. The tone in his voice, you can tell he was still upset.",
            "title_similarity": "0.41166842",
            "sentiment_compound": -0.8485
        },
        {
            "id": "hypepcw",
            "score": 9,
            "text": "Haliburton is probably jumping for joy right now.",
            "title_similarity": "0.20519377",
            "sentiment_compound": 0.5859
        },
        {
            "id": "hypppk0",
            "score": 8,
            "text": "in b4 putin dickriders say russia needs to take over kosovo and its nato's fault for expanding its influence.",
            "title_similarity": "0.73944247",
            "sentiment_compound": -0.4019
        },
        {
            "id": "hyq2q8z",
            "score": -7,
            "text": "That’s exactly what we need.  Escalation.  The reason we’re here in the first place is nato expansion.  Don’t cry when nukes are falling and you’re all wondering why.",
            "title_similarity": "0.7128234",
            "sentiment_compound": -0.5719
        },
        {
            "id": "hyow1eu",
            "score": 9,
            "text": "Implement anti corruption measures as a requirement to join and its a win win!",
            "title_similarity": "0.4228663",
            "sentiment_compound": 0.8313
        },
        {
            "id": "hypdieu",
            "score": 10,
            "text": "If we survive all this, in 10 years Russia may have NATO even in Kazachstan",
            "title_similarity": "0.55586356",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyppmph",
            "score": -9,
            "text": "Russia is not in the wrong ! This is all americas doing and this is why Putin will not stand back and tolerate it ! Team Russia !",
            "title_similarity": "0.55804443",
            "sentiment_compound": 0.5315
        },
        {
            "id": "hypa7ql",
            "score": 11,
            "text": "Kosovans love the USA and view Bill Clinton as an idol. They even made a song out of it.",
            "title_similarity": "0.41075662",
            "sentiment_compound": 0.6369
        },
        {
            "id": "hyouycd",
            "score": 210,
            "text": "Kosovo in NATO?!  \n\n\nWake me up.",
            "title_similarity": "0.63430715",
            "sentiment_compound": 0.0
        },
        {
            "id": "hypen8q",
            "score": 14,
            "text": "All of a sudden everyone wants to be friends with America lol people are to funny! Does American meddle to much does it not meddle enough. I’m sure one of you basement experts on everything will be sure to give your words of extraordinary wisdom ;)",
            "title_similarity": "0.40619773",
            "sentiment_compound": 0.9516
        },
        {
            "id": "hypgfxi",
            "score": 14,
            "text": "Everyone is going to join NATO now, Putin isn’t just evil, he’s an idiot.",
            "title_similarity": "0.57047236",
            "sentiment_compound": -0.7579
        },
        {
            "id": "hypepvx",
            "score": 16,
            "text": "putin didn't want NATO to expand anymore and now look what's happening lol",
            "title_similarity": "0.46281683",
            "sentiment_compound": 0.5964
        },
        {
            "id": "hypi4r2",
            "score": 19,
            "text": "What is scary is that the other nuclear powers, India china and Pakistan haven’t said shit or condemned Russia.",
            "title_similarity": "0.4057489",
            "sentiment_compound": -0.8658
        },
        {
            "id": "hyp282r",
            "score": 173,
            "text": "[deleted]",
            "title_similarity": "0.028029473"
        },
        {
            "id": "hyp4k8e",
            "score": 21,
            "text": "thats nice but spain, slovakia and romania will probably veto",
            "title_similarity": "0.2673101",
            "sentiment_compound": 0.2263
        },
        {
            "id": "hyp1gfn",
            "score": 27,
            "text": "Doubt it will ever happen while there are outstanding territorial disputes, while Kosovo is not recognized by UN, and while it's not recognized by 4 members of NATO.\n\nOutstanding territorial disputes is one of the reasons Ukraine is not part of NATO even.",
            "title_similarity": "0.3780728",
            "sentiment_compound": 0.5106
        },
        {
            "id": "hyp3tgt",
            "score": 72,
            "text": "Interesting wrinkle is that Kosovo is not a fully recognized sovereign nation around the world. In fact, neither Russia *nor* Ukraine recognize it.\n\nSource: https://worldpopulationreview.com/country-rankings/countries-that-recognize-kosovo",
            "title_similarity": "0.44532943",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hypfs3a",
            "score": 29,
            "text": "This is so weird. This is literally the reason why the US had military bases created throughout the world 50 years ago. But flash forward 20-30 years later and people will bitch about the US military having a base in their country.",
            "title_similarity": "0.59805715",
            "sentiment_compound": -0.7446
        },
        {
            "id": "hyov652",
            "score": 312,
            "text": "[removed]",
            "title_similarity": "0.023486834"
        },
        {
            "id": "hypflq2",
            "score": 136,
            "text": "Putin made a legendary mistake. Holy shit. This will go down on history as one of the biggest self owns ever.",
            "title_similarity": "0.3436188",
            "sentiment_compound": -0.7184
        },
        {
            "id": "hyorehj",
            "score": 191,
            "text": "Invading Ukraine could be a final nail in putins coffin; quite literally.",
            "title_similarity": "0.56643975",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyp47ba",
            "score": 38,
            "text": "I wonder is this more to do with Serbia than Russia",
            "title_similarity": "0.35022497",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyp0z6i",
            "score": 98,
            "text": "Man all Putin had to do was stick to sneak dissing. But instead he fucked around and found out",
            "title_similarity": "0.3285231",
            "sentiment_compound": -0.7964
        },
        {
            "id": "hyopojp",
            "score": 1497,
            "text": "This is huge. Putin has miscalculated to his detriment. It's nice to see these tyrants shoot themselves in the foot for a change. Even nicer to experience the geopolitical solidarity coming out of this tragedy. \nUkraine's suffering is not in vain.\nVictory to the Ukraine people.",
            "title_similarity": "0.44424763",
            "sentiment_compound": -0.0562
        },
        {
            "id": "hyowqc3",
            "score": 48,
            "text": "Isn't camp bondsteel already a permanent NATO base?",
            "title_similarity": "0.66744983",
            "sentiment_compound": 0.0
        },
        {
            "id": "hypfba6",
            "score": 52,
            "text": "Best marketing for NATO in history.",
            "title_similarity": "0.4579292",
            "sentiment_compound": 0.6369
        },
        {
            "id": "hyoy9be",
            "score": 1658,
            "text": "Putin: \"I will invade Ukraine with zero repercussions!\"\n\n*Ukraine proceeds to humiliate Putin's military, thousands of Russians dead, hundreds more surrender, hundreds of tanks destroyed. Devastating sanctions on the country, assets frozen all over the world, his best friends are losing their villas and yachts, cyberattacks on government websites. Russian banks banned from international transactions. Russians banned from travel or even entering other countries' airspaces, non-NATO countries in Europe suddenly want to join NATO as quickly as possible, German war machine reborn.*\n\nPutin: *surprised Pikachu face*",
            "title_similarity": "0.52388877",
            "sentiment_compound": -0.9493
        },
        {
            "id": "hyonuap",
            "score": 1971,
            "text": "Kosovo is probably going to get a new airfield and some ADA",
            "title_similarity": "0.5698653",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyp13oe",
            "score": 77,
            "text": "Lmao that’s one way to get American support",
            "title_similarity": "0.44474623",
            "sentiment_compound": 0.765
        },
        {
            "id": "hyonsi2",
            "score": 441,
            "text": "I think one problem is Spain doesn't recognize Kosovo and likely won't lest it encourage Catalan separatists.",
            "title_similarity": "0.3069988",
            "sentiment_compound": -0.6599
        },
        {
            "id": "hyopxvz",
            "score": 9022,
            "text": "Putin just helped NATO become more powerful than he could possibly imagine.",
            "title_similarity": "0.54166293",
            "sentiment_compound": 0.4754
        },
        {
            "id": "hyoq0ls",
            "score": 6659,
            "text": "“There are decades where nothing happens; and there are weeks where decades happen” – Vladimir Ilyich Lenin",
            "title_similarity": "0.27504385",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyopasj",
            "score": 4560,
            "text": "Otherwise knows as the \"Oh shit, he's actually quite fucking crazy, time to get a restraining order!\"",
            "title_similarity": "0.3044369",
            "sentiment_compound": -0.7823
        },
        {
            "id": "hypff6f",
            "score": 831,
            "text": "God damn putin has effectively united all of europe against russia lmao",
            "title_similarity": "0.55516666",
            "sentiment_compound": 0.8402
        },
        {
            "id": "hyoohz8",
            "score": 9590,
            "text": "Putin's invasion is biting him in the ass when it comes to wanting to reduce the influence of NATO. Not to mention the absolute pummeling the Russian economy is taking, along with Oligarchs seeing their fortunes and assets are at risk.",
            "title_similarity": "0.4845106",
            "sentiment_compound": -0.5994
        },
        {
            "id": "hyono5f",
            "score": 20586,
            "text": "LOL, the Ukraine invasion is having the opposite effect Putin wanted.",
            "title_similarity": "0.42369473",
            "sentiment_compound": 0.5473
        },
        {
            "id": "hyoti0h",
            "score": 1319,
            "text": "Does NATO accept states that are not UN members?",
            "title_similarity": "0.544422",
            "sentiment_compound": 0.3818
        },
        {
            "id": "hypdaqp",
            "score": 2940,
            "text": "[deleted]",
            "title_similarity": "0.028029473"
        },
        {
            "id": "hyoxefd",
            "score": 1,
            "text": "This is the best tl;dr I could make, [original](https://www.reuters.com/world/europe/kosovo-asks-us-permanent-military-base-speedier-nato-membership-2022-02-27/) reduced by 58%. (I'm a bot)\n*****\n> Register now for FREE unlimited access to Reuters.comPRISTINA, Feb 27 - Kosovo has asked the United States to establish a permanent military base in the country and speed up its integration into NATO after Russia&#039;s invasion of Ukraine, Kosovo&#039;s Defence Minister Armend Mehaj said on Sunday.\n\n> &quot;Accelerating Kosovo&#039;s membership in NATO and having a permanent base of American forces is an immediate need to guarantee peace, security and stability in the Western Balkans,&quot; Mehaj said on his Facebook page.\n\n> Four NATO members also refuse to recognise Kosovo&#039;s independence.\n\n\n*****\n[**Extended Summary**](http://np.reddit.com/r/autotldr/comments/t2xqmm/kosovo_has_asked_the_united_states_to_establish_a/) | [FAQ](http://np.reddit.com/r/autotldr/comments/31b9fm/faq_autotldr_bot/ \"Version 2.02, ~627050 tl;drs so far.\") | [Feedback](http://np.reddit.com/message/compose?to=%23autotldr \"PM's and comments are monitored, constructive feedback is welcome.\") | *Top* *keywords*: **Kosovo**^#1 **country**^#2 **NATO**^#3 **Russia**^#4 **unlimited**^#5",
            "title_similarity": "0.76123166",
            "sentiment_compound": 0.968
        },
        {
            "id": "hyp1ga3",
            "score": 5,
            "text": "So, are this would be in addition to Camp Bondsteel, or the SOF base they proposed last month?\n\nEdit: Sorry, the special ops base is slated for Albania, next door. Which will be the next conflict to re-ignite, as the two attempt to unite and Serbia loses it again. Great, another chance for the poop to hit.",
            "title_similarity": "0.5736271",
            "sentiment_compound": 0.5994
        },
        {
            "id": "hyp50vy",
            "score": 1,
            "text": "Repercussions that can not be achieved without Putin and his lackeys! The world will be a much better world with the authoritarian states gone.",
            "title_similarity": "0.38467222",
            "sentiment_compound": 0.4926
        },
        {
            "id": "hyp5udt",
            "score": 3,
            "text": "Sick duty station",
            "title_similarity": "0.10860816",
            "sentiment_compound": -0.5106
        },
        {
            "id": "hyp5vdm",
            "score": 2,
            "text": "We'll get there fast and then we'll take it slow. That's where we want to go. Way down in Kosovo.",
            "title_similarity": "0.42952397",
            "sentiment_compound": 0.0772
        },
        {
            "id": "hyp7c7l",
            "score": 39,
            "text": "I said this yesterday in a different thread already, if Putin just had kept his troops at the border doing \"training exercises\", he might even have gotten a good deal out of it. Everyone was kind of wondering what his next move might be, and it looked like he got Ukraine close to make some negotiation deal to deescalate the situation.\n\nPutin shot himself in every limb with this move. Geez, Russia is worse off than ever before.\n\nEDIT: \"shot\", not \"shit\" himself. ;D",
            "title_similarity": "0.5707213",
            "sentiment_compound": 0.4748
        },
        {
            "id": "hyp8auc",
            "score": 1,
            "text": "Time to set up a forward Starbucks and insert the fruity baristas",
            "title_similarity": "0.39497417",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyp96vr",
            "score": 1,
            "text": "None of this is going to matter. If Putin can’t win he’s going to start throwing nukes and make sure no one else does either.",
            "title_similarity": "0.42207664",
            "sentiment_compound": 0.6124
        },
        {
            "id": "hypa5ge",
            "score": 1,
            "text": "Back to bondsteel i guess lol",
            "title_similarity": "0.11966454",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hypaeb7",
            "score": 1,
            "text": "Putin had gone for on far this time and his plan is going to backfire on him.",
            "title_similarity": "0.3489194",
            "sentiment_compound": 0.0
        },
        {
            "id": "hypajb1",
            "score": 1,
            "text": "Putin loses again",
            "title_similarity": "0.23389469",
            "sentiment_compound": -0.3182
        },
        {
            "id": "hypb51v",
            "score": 2,
            "text": "That is very interesting.",
            "title_similarity": "0.0010850811",
            "sentiment_compound": 0.4576
        },
        {
            "id": "hypc0tc",
            "score": 1,
            "text": "I think we need to thank the Eastern European countries. They seem to uphold the principles that the US used to stand for better than we do.\nIt makes us reflect on what we should be probably because the need for these principles isn’t taken for granted by them.",
            "title_similarity": "0.3942696",
            "sentiment_compound": 0.7506
        },
        {
            "id": "hypcpsx",
            "score": 4,
            "text": "Putin really didn't think this out beforehand, did he?",
            "title_similarity": "0.28636158",
            "sentiment_compound": 0.0
        },
        {
            "id": "hypcvli",
            "score": 3,
            "text": "https://www.youtube.com/watch?v=M2rTafbQepg",
            "title_similarity": "0.1795463",
            "sentiment_compound": 0.0
        },
        {
            "id": "hypd28g",
            "score": 1,
            "text": "All this will do is bind all those other countries even tighter to Nato.",
            "title_similarity": "0.5770621",
            "sentiment_compound": 0.0
        },
        {
            "id": "hypd35j",
            "score": 1,
            "text": "This is incredible.",
            "title_similarity": "0.027956031",
            "sentiment_compound": 0.0
        },
        {
            "id": "hypdj7y",
            "score": 3,
            "text": "I mean most of us don't know military strategics but whether you're pro or anti-Putin doesn't it seem obvious that all this is going to do is make even more countries want to get in with NATO.",
            "title_similarity": "0.6043089",
            "sentiment_compound": 0.2186
        },
        {
            "id": "hypdl8m",
            "score": 1,
            "text": "Does Kosovo have the NATO influence to put weight behind their proposal? Asking genuinely.",
            "title_similarity": "0.6257535",
            "sentiment_compound": 0.0
        },
        {
            "id": "hypdm6i",
            "score": 1,
            "text": "Funny",
            "title_similarity": "-0.07882695",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hypdsnh",
            "score": 1,
            "text": "The “NA” in NATO is doing a lot of work here lol",
            "title_similarity": "0.44399634",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hype04t",
            "score": 1,
            "text": "What happened to the base that Cheney's company built with US tax dollars?  Honest question, i haven't been keeping track.",
            "title_similarity": "0.40329027",
            "sentiment_compound": 0.5106
        },
        {
            "id": "hype33h",
            "score": 1,
            "text": "Putin is doing for NATO what the Republican party did for the Democrats with Covid. \n\nThe people dying of Covid are mainly Republican anti-vaxxers, which is great news for the Democrats. \n\nWell done Putin!!!",
            "title_similarity": "0.4857741",
            "sentiment_compound": 0.8682
        },
        {
            "id": "hype916",
            "score": 1,
            "text": "Let's gooooooo",
            "title_similarity": "0.08660193",
            "sentiment_compound": 0.0
        },
        {
            "id": "hype9dc",
            "score": 1,
            "text": "Yeyeyye",
            "title_similarity": "0.08138985",
            "sentiment_compound": 0.0
        },
        {
            "id": "hypebmj",
            "score": 1,
            "text": "Ok seriously I hope noone stirs the balkans, nothing good will come out of this.",
            "title_similarity": "0.40275672",
            "sentiment_compound": 0.2486
        },
        {
            "id": "hypec1e",
            "score": 2,
            "text": "Hem them in! Suffocate them. In 25 year RF wont be a country",
            "title_similarity": "0.3913346",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyped5j",
            "score": 3,
            "text": "The more you tighten your grip, ~~Tarkin~~ Putin, the more ~~star systems~~ countries will slip through your fingers.",
            "title_similarity": "0.4456079",
            "sentiment_compound": 0.0
        },
        {
            "id": "hypeitf",
            "score": 1,
            "text": "“Congratulations, you just played yourself” @ Putin the Putain",
            "title_similarity": "0.32902208",
            "sentiment_compound": 0.34
        },
        {
            "id": "hypeizd",
            "score": 2,
            "text": "The Putin Streisand effect.",
            "title_similarity": "0.38759208",
            "sentiment_compound": 0.0
        },
        {
            "id": "hypelh3",
            "score": 2,
            "text": "Is there any reason why Ukraine doesn’t join NATO right now? If they did, would Russia suddenly be at war with NATO?",
            "title_similarity": "0.667493",
            "sentiment_compound": -0.4696
        },
        {
            "id": "hypelta",
            "score": 1,
            "text": "https://youtu.be/JeA22wQCksA",
            "title_similarity": "0.16759339",
            "sentiment_compound": 0.0
        },
        {
            "id": "hypeobu",
            "score": 2,
            "text": "Maybe this is all a grand counter ploy by Putin to counter Chinese influence, China would be much more hesitant to militarily antagonize the US with a much more militant EU behind them. Of course this all a fantasy but it would be a bit funny if true",
            "title_similarity": "0.41980642",
            "sentiment_compound": 0.7847
        },
        {
            "id": "hypesoz",
            "score": 1,
            "text": "Russia: How to turn the literal entire world against you in one easy step",
            "title_similarity": "0.5338283",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hypeuys",
            "score": 1,
            "text": "i’m american and obviously going to have a bias but i’m genuinely curious to anyone from a different country\n\ni know we are somewhat dickheads but do you think of us as the global forefront of what’s right as far as major countries? what russia is doing is so wrong and a country like the US would never stand for it",
            "title_similarity": "0.5094771",
            "sentiment_compound": -0.1247
        },
        {
            "id": "hypf3cy",
            "score": 1,
            "text": "So Friends unofficial Kosovo is a Piece of Nato \nThe US got a very Big Military Base Bondsteel.",
            "title_similarity": "0.6862331",
            "sentiment_compound": 0.5256
        },
        {
            "id": "hypf4vx",
            "score": 1,
            "text": "Isn’t Bondsteele still there?",
            "title_similarity": "0.12179212",
            "sentiment_compound": 0.0
        },
        {
            "id": "hypf65w",
            "score": 1,
            "text": "The fact this is in the news is absurd. This should be classified until it's not possible to keep secret.",
            "title_similarity": "0.3201118",
            "sentiment_compound": 0.0
        },
        {
            "id": "hypf7d9",
            "score": 1,
            "text": "\nHey /u/two_plus_two_is_zero,\n\n\nThis is now the top post on reddit. It will be recorded at /r/topofreddit with all the other top posts.",
            "title_similarity": "0.30207467",
            "sentiment_compound": 0.3818
        },
        {
            "id": "hypf7f9",
            "score": 1,
            "text": "Kosovo already have one of the biggest NATO base of the world, what do they want more ? some nukes for personal protection ?",
            "title_similarity": "0.6263566",
            "sentiment_compound": 0.168
        },
        {
            "id": "hypfcxr",
            "score": 4,
            "text": "If Putin was hoping to shrink NATO, I think we can say is sufficiently backfired.",
            "title_similarity": "0.45737678",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hypflen",
            "score": 90,
            "text": "Moldova has to know they’re next if Ukraine falls",
            "title_similarity": "0.5287541",
            "sentiment_compound": 0.0
        },
        {
            "id": "hypfu1y",
            "score": 1,
            "text": "If NATO accepts Kosovo, would that mean Serbia will never join?",
            "title_similarity": "0.5411591",
            "sentiment_compound": 0.1058
        },
        {
            "id": "hypfx9q",
            "score": 2,
            "text": "Coming again to save the muthafknnn day YEAH!!!",
            "title_similarity": "0.28702742",
            "sentiment_compound": 0.7911
        },
        {
            "id": "hypg9sb",
            "score": 3,
            "text": "So, could there even by a time in the future where a nice Russia would join NATO, or that wouldn’t work because Russia is like 90% of the reason why NATO exists?",
            "title_similarity": "0.59213954",
            "sentiment_compound": 0.7579
        },
        {
            "id": "hypgcuv",
            "score": 2,
            "text": "Camp Bondsteel built in 99’ in Kosovo is already one of the largest in Europe. This doesn’t really change things on the ground in a material way",
            "title_similarity": "0.3759895",
            "sentiment_compound": 0.0
        },
        {
            "id": "hypgh6n",
            "score": 3,
            "text": "This has nothing to do with Kosovo being worried about Russia and everything to do with Kosovo being recognized as a state by all of NATO and maybe the UN.",
            "title_similarity": "0.5561124",
            "sentiment_compound": -0.296
        },
        {
            "id": "hypgxcz",
            "score": 2,
            "text": "That's the place!",
            "title_similarity": "0.1043217",
            "sentiment_compound": 0.0
        },
        {
            "id": "hypgxpn",
            "score": 1,
            "text": "USAs response: lol no",
            "title_similarity": "0.19585316",
            "sentiment_compound": 0.1531
        },
        {
            "id": "hypgyjp",
            "score": 1,
            "text": "Hey! Of course! Proof is in the Putin!",
            "title_similarity": "0.46437967",
            "sentiment_compound": 0.0
        },
        {
            "id": "hypgz4y",
            "score": 1,
            "text": "I was thinking by myself what if this wars main goal was to make Russia more authoritarian",
            "title_similarity": "0.58714163",
            "sentiment_compound": -0.6428
        },
        {
            "id": "hyph8mg",
            "score": 1,
            "text": "#NATO!",
            "title_similarity": "0.45822597",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyphaeo",
            "score": 1,
            "text": "this war has revealed i know little about which countries are in eastern europe.",
            "title_similarity": "0.3362953",
            "sentiment_compound": -0.5994
        },
        {
            "id": "hyphfju",
            "score": 2,
            "text": "Sounds good, welcome brothers and sisters",
            "title_similarity": "0.21357134",
            "sentiment_compound": 0.7096
        },
        {
            "id": "hyphfz1",
            "score": 3,
            "text": "Let's set up shop and fuck the Russians. Man I hope we all see them for the rats they fucking are, everything they are doing has no good outcome, these sanctions are going to make it very tough to be in that country as a Russian citizen.",
            "title_similarity": "0.4178108",
            "sentiment_compound": -0.5857
        },
        {
            "id": "hyphqma",
            "score": 2,
            "text": "I don’t see this happening tbh",
            "title_similarity": "0.050463688",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyphsn2",
            "score": 2,
            "text": "Like Bondsteel is not a military base...",
            "title_similarity": "0.09585142",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hyphv6m",
            "score": 5,
            "text": "Literally the only reason Putin has to not want Ukraine joining NATO is so he can invade them sporadically when he gets bored. He pretends they are a threat but to what? Ukraine wasn’t ever gonna invade Russia. No more of this shit and no more threatening the world. He could have just kept the status quo. But nope. Fuck around and find out. Russia I’m sure is a great country being bogged down by one selfish asshole. Either the selfish asshole steps down or maybe he can get the Caesar treatment, his choice.",
            "title_similarity": "0.5198036",
            "sentiment_compound": -0.686
        },
        {
            "id": "hyphy6i",
            "score": 3,
            "text": "I'm confused... Isn't Camp Bondsteel already there? Biggest off-shore US military base?",
            "title_similarity": "0.50655925",
            "sentiment_compound": -0.3939
        },
        {
            "id": "hypi1e0",
            "score": 3,
            "text": "All of this is going to push Putin to his limits though. I don't like the idea of what comes after he is pushed to that point.",
            "title_similarity": "0.35141462",
            "sentiment_compound": -0.2755
        },
        {
            "id": "hypi6eg",
            "score": 2,
            "text": "When you want to flex your power to the world but end up making everyone want US/NATO defending them. Get fucked Russia",
            "title_similarity": "0.6005692",
            "sentiment_compound": -0.7579
        },
        {
            "id": "hypignd",
            "score": 1,
            "text": "Putin, the mastermind 😂",
            "title_similarity": "0.39663836",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hypih6r",
            "score": 3,
            "text": "Everyone loves hate the US until they need the military.",
            "title_similarity": "0.46505567",
            "sentiment_compound": 0.0
        },
        {
            "id": "hypij3e",
            "score": 1,
            "text": "How this war will end in your opinion?",
            "title_similarity": "0.4218526",
            "sentiment_compound": -0.5994
        },
        {
            "id": "hypijpj",
            "score": 3,
            "text": "It’s not often other countries want foreign military presence, especially from the US. The invasion of Ukraine is definitely not as Putin has foreseen",
            "title_similarity": "0.40609396",
            "sentiment_compound": 0.4588
        },
        {
            "id": "hypimru",
            "score": 6,
            "text": "I don't understand how Putin could have miscalculated this hard. Perhaps the people in his circle are that afraid of him that they didn't bring up this possibility? That them invading Ukraine, likely to prevent it from ever becoming a NATO country, would only have the opposite effect of driving more countries into NATO and away from him?",
            "title_similarity": "0.52789736",
            "sentiment_compound": -0.1926
        },
        {
            "id": "hypioli",
            "score": 1,
            "text": "Congratulations Putin, you played yourself.",
            "title_similarity": "0.3458941",
            "sentiment_compound": 0.743
        },
        {
            "id": "hypipfv",
            "score": 1,
            "text": "Yah.. Can't wait to get stationed in... Kosovo..Unaccompained I'm sure, Fuck my life.",
            "title_similarity": "0.51303095",
            "sentiment_compound": -0.296
        },
        {
            "id": "hypiq6d",
            "score": 1,
            "text": "To be honest, I don't blame them lol",
            "title_similarity": "0.039044693",
            "sentiment_compound": 0.4596
        },
        {
            "id": "hypiqlt",
            "score": 1,
            "text": "Good.\n\nDown with imperialism.",
            "title_similarity": "0.12889092",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hypiqqv",
            "score": 4,
            "text": "One of Putin’s primary goals was diminishing the influence of NATO, his invasion of Ukraine has had the complete opposite effect. Nations like Kosovo & Georgia are now pushing harder than ever for NATO membership & current members are beginning to increase their defense budgets (fun fact only 10 out of 30 NATO members meet the alliance’s recommend defense spending plan) \n\nHell, even the Germans announced they plan to massively overhaul and rearm their military, which for decades has suffered from underfunding.",
            "title_similarity": "0.57787156",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hypir6b",
            "score": 1,
            "text": "As great as this is if everyone joins up the only option is nuclear war when things pop off anyways from Russia/China they aren't going to play fair.",
            "title_similarity": "0.56203616",
            "sentiment_compound": 0.119
        },
        {
            "id": "hypit6p",
            "score": 2,
            "text": "Basically, everyone will join NATO and EU, except Russia?",
            "title_similarity": "0.64817125",
            "sentiment_compound": 0.296
        },
        {
            "id": "hypiujf",
            "score": 2,
            "text": "Putin is a baby killer",
            "title_similarity": "0.35547447",
            "sentiment_compound": -0.6486
        },
        {
            "id": "hypiw8k",
            "score": 2,
            "text": "Plot twist: Putin is doing the Zero requiem  to unite the world in hatred against him",
            "title_similarity": "0.5224304",
            "sentiment_compound": -0.6369
        },
        {
            "id": "hypiz9q",
            "score": 1,
            "text": "How is Serbia is reacting to Ukraine conflict?",
            "title_similarity": "0.54560405",
            "sentiment_compound": -0.3182
        },
        {
            "id": "hypj51d",
            "score": 1,
            "text": "Nice, Kosovo exists today because of NATO bombed the hell out of Jugoslavija",
            "title_similarity": "0.6754087",
            "sentiment_compound": -0.4215
        },
        {
            "id": "hypj56o",
            "score": 1,
            "text": "Is Ukraine actually going to get into NATO?",
            "title_similarity": "0.7288468",
            "sentiment_compound": 0.0
        },
        {
            "id": "hypj7k3",
            "score": 1,
            "text": "I think after last week he became the top 3 clown that ever lived on the planet.",
            "title_similarity": "0.2550234",
            "sentiment_compound": 0.2023
        },
        {
            "id": "hypj7k4",
            "score": 5,
            "text": "Ive been reading in other sources that non-European states are wanting to join NATO.",
            "title_similarity": "0.5622995",
            "sentiment_compound": 0.296
        },
        {
            "id": "hypj9tg",
            "score": 1,
            "text": "[More Footage: People flee to Poland as Russia invades Ukraine](https://youtu.be/fgW_n1fL95w)",
            "title_similarity": "0.5649502",
            "sentiment_compound": 0.0
        },
        {
            "id": "hypj9vh",
            "score": 1,
            "text": "https://fansly.com/throatog/posts",
            "title_similarity": "0.20740345",
            "sentiment_compound": 0.0
        },
        {
            "id": "hypjdi0",
            "score": 3,
            "text": "we will build that quicker then a walmart !!!",
            "title_similarity": "0.39441568",
            "sentiment_compound": 0.0
        },
        {
            "id": "hypjfyb",
            "score": 1,
            "text": "They won’t join NATO but they’ll probably get the base",
            "title_similarity": "0.50758743",
            "sentiment_compound": 0.1531
        },
        {
            "id": "hypji56",
            "score": 5,
            "text": "One often meets his destiny on the road he takes to avoid it.\n\n- Master Oogway",
            "title_similarity": "0.15570706",
            "sentiment_compound": -0.296
        },
        {
            "id": "hypjpiw",
            "score": 3,
            "text": "Like, just think of all the fucking advisors, economic and political experts, and military officials, that this dude had to completely ignore to get to this point.\n\nLike I'm fucking sure someone was telling him that this was going to be the outcome. Why make such a dipshit move when he could have milked the impending \"we'll fucking do it\" forever like NK?\n\nHe's gotta be losing his grasp on shit for him to make such a wild swing at the ball like this. It's gotta be some overcorrection for something going on internal in Russia high politics.",
            "title_similarity": "0.45551485",
            "sentiment_compound": -0.128
        },
        {
            "id": "hypjq1m",
            "score": 3,
            "text": "All your base are belong to us",
            "title_similarity": "0.25462425",
            "sentiment_compound": 0.0
        },
        {
            "id": "hypk0ca",
            "score": 2,
            "text": "Do you think putin will use nukes ?",
            "title_similarity": "0.520214",
            "sentiment_compound": 0.0
        },
        {
            "id": "hypkj41",
            "score": 1,
            "text": "Cold War 2: Putin’s Bugaloo",
            "title_similarity": "0.55768955",
            "sentiment_compound": -0.5994
        },
        {
            "id": "hypktlm",
            "score": 1,
            "text": "can Ukraine request a base also or they have to be in NATO first",
            "title_similarity": "0.7440971",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyplau2",
            "score": 2,
            "text": "Man, every single country in Europe and around Russia is terrified now lol they're lustful for taking over & dominating every individual country all for more power & resources, Putin's blood thirst knows no bounds.",
            "title_similarity": "0.42536134",
            "sentiment_compound": -0.6808
        },
        {
            "id": "hypleve",
            "score": 1,
            "text": "We have enough military bases. Thanks tho.",
            "title_similarity": "0.36807093",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hyplfnk",
            "score": 2,
            "text": "Everybody in Europe gangsta until it's time to do gangsta shit.",
            "title_similarity": "0.42331892",
            "sentiment_compound": -0.5574
        },
        {
            "id": "hyplicq",
            "score": 1,
            "text": "Beware the Ides of March, Vlad.",
            "title_similarity": "0.3327467",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyplk6t",
            "score": 1,
            "text": "Time to play the game of “how far can we go before Putin loses his marbles and nukes us?”",
            "title_similarity": "0.43472928",
            "sentiment_compound": 0.0258
        },
        {
            "id": "hyplnjy",
            "score": 1,
            "text": "THEY HAVE TO BE CAREFUL AS NOT TO PUT RUSSIA IN A CORNER! \n\nBut these are good developments that can be used in the short term as leverage in negotiation with Russia and in the long term as NATO expansion.",
            "title_similarity": "0.61303204",
            "sentiment_compound": 0.7011
        },
        {
            "id": "hyplnql",
            "score": 1,
            "text": "Mire",
            "title_similarity": "0.017082283",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyploji",
            "score": 3,
            "text": "\"Well don't mind If I do!\" -US military complex probably",
            "title_similarity": "0.50430554",
            "sentiment_compound": 0.3382
        },
        {
            "id": "hyplpuo",
            "score": 2,
            "text": "So , many people think that the only way to this war to finish is the nuclear fucking extinction , do you think is true ? I’m really scared",
            "title_similarity": "0.47904843",
            "sentiment_compound": -0.72
        },
        {
            "id": "hyplstn",
            "score": 1,
            "text": "Ukraine needs to take back snake island. This would have a profound impact on the war.",
            "title_similarity": "0.6338557",
            "sentiment_compound": -0.5994
        },
        {
            "id": "hyplug1",
            "score": 1,
            "text": "Congrats Putin, you played yourself.",
            "title_similarity": "0.32080847",
            "sentiment_compound": 0.7003
        },
        {
            "id": "hypluyd",
            "score": 2,
            "text": "Where is Kosovo?",
            "title_similarity": "0.3589418",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyplyez",
            "score": 1,
            "text": "If they pay for the base i’m all in",
            "title_similarity": "0.2869063",
            "sentiment_compound": -0.1027
        },
        {
            "id": "hyplyi1",
            "score": 1,
            "text": "Every Service Member after reading this news: \"Alright, I'm in. Just one question...how many bars will be in a one mile radius from base?\"",
            "title_similarity": "0.4039089",
            "sentiment_compound": 0.25
        },
        {
            "id": "hyplz8q",
            "score": 3,
            "text": "I love how Putin has made only more countries want to join NATO.",
            "title_similarity": "0.61251736",
            "sentiment_compound": 0.7893
        },
        {
            "id": "hyplzhj",
            "score": 1,
            "text": "New saying \"Never go full Putin\"",
            "title_similarity": "0.32393178",
            "sentiment_compound": 0.0
        },
        {
            "id": "hypm328",
            "score": 2,
            "text": "reddit doing propaganda's work for it.",
            "title_similarity": "0.36093196",
            "sentiment_compound": 0.0
        },
        {
            "id": "hypm7by",
            "score": 2,
            "text": "Is that Kosovo One of privatized countries by USA?",
            "title_similarity": "0.5374645",
            "sentiment_compound": 0.0
        },
        {
            "id": "hypm7h4",
            "score": 3,
            "text": "Putin speeding up the expansion of NATO. Lol",
            "title_similarity": "0.66865706",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hypm9h9",
            "score": 1,
            "text": "I'm American. I'm tired of the world being cozy in the safety of the US military when it's the US citizens taxes that fund it. Meanwhile we get NO tax payer funded healthcare or schooling like other NATO countries.\n\nWe are left to die. Please everyone in Europe, shame America into caring for it's citizens.",
            "title_similarity": "0.4592994",
            "sentiment_compound": -0.4648
        },
        {
            "id": "hypmaba",
            "score": 1,
            "text": "Well bc their president is pro western now",
            "title_similarity": "0.4265281",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hypmc7n",
            "score": 1,
            "text": "Yeah I somehow don't think they're gonna be the last country to join NATO in the next few months",
            "title_similarity": "0.44704998",
            "sentiment_compound": 0.5267
        },
        {
            "id": "hypmc9t",
            "score": 2,
            "text": "FUCK PUTIN",
            "title_similarity": "0.29686072",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hypmczr",
            "score": 1,
            "text": "We can't police the whole world. We need to fix our domestic issues. Let the rest of NATO pick up some of the slack. We need universal healthcare and education.",
            "title_similarity": "0.59684837",
            "sentiment_compound": 0.0
        },
        {
            "id": "hypmdif",
            "score": 1,
            "text": "This must drive Putin absolutely crazy. Choke on it, Soviet scum.",
            "title_similarity": "0.38507828",
            "sentiment_compound": -0.7559
        },
        {
            "id": "hypmfdg",
            "score": 1,
            "text": "It's wild to me that countries are requesting a military base from another country to be established in their country. I understand the reason, it just sounds wild when I say it out loud",
            "title_similarity": "0.6040386",
            "sentiment_compound": 0.0
        },
        {
            "id": "hypmftw",
            "score": 1,
            "text": "[deleted]",
            "title_similarity": "0.028029473"
        },
        {
            "id": "hypmg0z",
            "score": 2,
            "text": "Ugh",
            "title_similarity": "0.002455826",
            "sentiment_compound": -0.4215
        },
        {
            "id": "hypmlk1",
            "score": 1,
            "text": "Is “the country” Kosovo or... the US? Way to make a shit title, OP",
            "title_similarity": "0.48888358",
            "sentiment_compound": -0.5574
        },
        {
            "id": "hypmmy7",
            "score": 1,
            "text": "I love it, you know the US is the world Ledadee when Kosovo doesn’t run to Europe to set up a base they come to Uncle Sam. Like usual the US will be the deterrent for aggression in Europe.",
            "title_similarity": "0.6794354",
            "sentiment_compound": 0.6705
        },
        {
            "id": "hypmob9",
            "score": 1,
            "text": "Of course this was the result.  It was always the expectable result.  Narcissistic dip stick wasn't stopped before so expected no one would stop him this time.",
            "title_similarity": "0.19341552",
            "sentiment_compound": -0.4611
        },
        {
            "id": "hypmoe3",
            "score": 2,
            "text": "I'd take that deployment. Beats the hell out of the Middle East.",
            "title_similarity": "0.44309834",
            "sentiment_compound": -0.6808
        },
        {
            "id": "hypmqp6",
            "score": 2,
            "text": "I want Putin to burn for what he's done, but when a cold-blooded psychopath has the power to launch 6000 nukes, I'm not sure cornering him like an animal is the best strategy for the safety of the world. We have to give him some kind of off-ramp, no matter how undeserving he is. Otherwise his only choices are \n\n1. Accept defeat, look like a loser, and get killed by his own people.\n2. He launches his nukes and takes everyone down with him.",
            "title_similarity": "0.43314224",
            "sentiment_compound": -0.4027
        },
        {
            "id": "hypmyjf",
            "score": 1,
            "text": "And THAT is how you win at Risk.",
            "title_similarity": "0.14692742",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hypmz4x",
            "score": 1,
            "text": "Don’t temp the U.S. with a good time!",
            "title_similarity": "0.27283797",
            "sentiment_compound": 0.4926
        },
        {
            "id": "hypn0p7",
            "score": 1,
            "text": "Now Finland and Sweden should revisit membership. To be clear, no one in NATO wants to invade Russia, ever. Russia would be a great place if it wasn’t run by a dick.",
            "title_similarity": "0.6155772",
            "sentiment_compound": 0.296
        },
        {
            "id": "hypn7sg",
            "score": 3,
            "text": "Yes let’s do it 🇺🇸",
            "title_similarity": "0.15137854",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hypncyi",
            "score": 1,
            "text": "Lol, \"speed up its integration\" they have not worked with the US gov. funny sh\\*t.",
            "title_similarity": "0.33050576",
            "sentiment_compound": 0.6908
        },
        {
            "id": "hypnd8g",
            "score": 1,
            "text": "Since the situation there is unstable, they are using this situation to get more support from USA to be stronger in case Serbia comes in.\n\nIt's a very smart move I give them that, specially when Kosovo is funded and controlled by the US.",
            "title_similarity": "0.5976916",
            "sentiment_compound": 0.7258
        },
        {
            "id": "hypnf46",
            "score": 2,
            "text": "Wait Kosovo is allowed to join NATO? Is that sich an Good idea?",
            "title_similarity": "0.65471137",
            "sentiment_compound": 0.6662
        },
        {
            "id": "hypnnsb",
            "score": 1,
            "text": "Lol my DFEN calls can’t print fast enough",
            "title_similarity": "0.030200947",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hypns7v",
            "score": 1,
            "text": "Do you think putin will use nukes ? ( I’m scared )",
            "title_similarity": "0.43628788",
            "sentiment_compound": -0.4404
        },
        {
            "id": "hypnuyn",
            "score": 2,
            "text": "Russia fucked itself",
            "title_similarity": "0.35379052",
            "sentiment_compound": -0.6597
        },
        {
            "id": "hypnw7e",
            "score": 1,
            "text": "Idk man, getting the Balkans in Nato is tricky, they’ll probably end up fighting each other before long",
            "title_similarity": "0.4987639",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hypnxzz",
            "score": 3,
            "text": "Reddit hates on the US government for valid reasons, but Russia def making some people step back and realize how terrible some other major powers are. China won't be far behind soon w/ something they do, I'm sure.",
            "title_similarity": "0.4510886",
            "sentiment_compound": -0.4854
        },
        {
            "id": "hypny2v",
            "score": 1,
            "text": "Putin no more Nato other country's more Nato Putin Fuck me",
            "title_similarity": "0.54455864",
            "sentiment_compound": -0.7152
        },
        {
            "id": "hypo189",
            "score": 12,
            "text": "Comes right after Japan's former prime minister Shinzo Abe brought up the possibility of letting Japan host US nukes, along with calling for the US to clearly iterate that it would come to Taiwan's defense in case of an invasion.\n\n[https://asia.nikkei.com/Politics/U.S.-should-abandon-ambiguity-on-Taiwan-defense-Japan-s-Abe](https://asia.nikkei.com/Politics/U.S.-should-abandon-ambiguity-on-Taiwan-defense-Japan-s-Abe)\n\nPutin pulling nukes back onto the table is really going to send everyone banging on the door to huddle closer together under military pacts.",
            "title_similarity": "0.6420497",
            "sentiment_compound": 0.4939
        },
        {
            "id": "hypo18x",
            "score": 2,
            "text": "This is starting to look like the scariest war since WW2.",
            "title_similarity": "0.3020519",
            "sentiment_compound": -0.34
        },
        {
            "id": "hypo9qq",
            "score": 3,
            "text": "imagine if the wind turn around and Ukraine start taking small part of Russia 🤔",
            "title_similarity": "0.4917546",
            "sentiment_compound": 0.0
        },
        {
            "id": "hypoalc",
            "score": 2,
            "text": "How often is it that other countries *ask* the US to make a permanent base there? I'm honestly asking, because I feel like it never happens but I could just be totally uninformed",
            "title_similarity": "0.4200466",
            "sentiment_compound": 0.4118
        },
        {
            "id": "hypoau3",
            "score": 10,
            "text": "It's hard to fathom how much Putin's stupidity is going to fuck Russia for generations.  Talk about leaving a shitty legacy, he will be written about as villian.   Must suck being his parents knowing the abortion that lived did so much damage.  Should have used a condom.",
            "title_similarity": "0.4494689",
            "sentiment_compound": -0.95
        },
        {
            "id": "hypoglb",
            "score": 3,
            "text": "This is good news now we need more countries to join NATO and put the bully Russia in its place",
            "title_similarity": "0.78921294",
            "sentiment_compound": 0.2878
        },
        {
            "id": "hypohn0",
            "score": 11,
            "text": "Putin just made the NATO way more relevant.",
            "title_similarity": "0.6331587",
            "sentiment_compound": 0.0
        },
        {
            "id": "hypoydb",
            "score": 1,
            "text": "A shrewd request.",
            "title_similarity": "0.002160485",
            "sentiment_compound": 0.0
        },
        {
            "id": "hypp758",
            "score": 2,
            "text": "Gonna be a really weird plot twist when we get unified world peace because Russia tried to fuck around. \n\nUltra-level conspiracy theory is that this is some Watchmen/Ozymandias shit where Putin is using the conflict to push the rest of the world into holding hands.",
            "title_similarity": "0.5922026",
            "sentiment_compound": -0.8268
        },
        {
            "id": "hypp9kj",
            "score": 1,
            "text": "just another day that serbia doesn't occupy any of its neighbors",
            "title_similarity": "0.20602754",
            "sentiment_compound": 0.0
        },
        {
            "id": "hypptoy",
            "score": 1,
            "text": "anybody know websites where we can watch the heroic effort of ukrainians fighting?, they are so inspiring.",
            "title_similarity": "0.41186333",
            "sentiment_compound": 0.6924
        },
        {
            "id": "hyppwli",
            "score": 1,
            "text": "[Ukrainians Don't Back Down](https://www.youtube.com/watch?v=S7qpxzzq6Kk&ab_channel=JohnDoe)",
            "title_similarity": "0.3342114",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyppyut",
            "score": 2,
            "text": "Vladimir Putin, the man who single-handedly sent Russia back to the stone ages. Got a nice ring to it",
            "title_similarity": "0.55969805",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hypqax5",
            "score": 1,
            "text": "I imagine the #MidgetRuskie\" is spinning like Rumplestiltskin after hearing about this!",
            "title_similarity": "0.31280687",
            "sentiment_compound": 0.4199
        },
        {
            "id": "hypqef1",
            "score": 1,
            "text": "Can’t say the people of these countries but the leaders of Russia,China and NK can all go fuck each other. All these countries special ops can’t get these 3? \n\nI get it ain’t easy but I’m sure collectively we could",
            "title_similarity": "0.4334631",
            "sentiment_compound": 0.6808
        },
        {
            "id": "hypqo08",
            "score": 6,
            "text": "Observe 120,000+ Ukrainians flee their country -- not to their cousins in Russia, but to the open arms of the free west (Poland).\n\nSpin that, Russia Today.",
            "title_similarity": "0.5284297",
            "sentiment_compound": 0.6652
        },
        {
            "id": "hypqooy",
            "score": 3,
            "text": "People get only get pushed so far. And then they get fed up with the bully. Fucked with the wrong kid on the yard. Fucked with a kid that everyone likes.",
            "title_similarity": "0.14357182",
            "sentiment_compound": -0.9231
        },
        {
            "id": "hypqrd1",
            "score": 6,
            "text": "Ah yes, when you start a war to prevent NATO from spreading further towards your dictatorial regime and take your sweet gains away and instead you speed it up.  \n\n\nClassic Putin.",
            "title_similarity": "0.64645565",
            "sentiment_compound": 0.5106
        },
        {
            "id": "hypqrhd",
            "score": 7,
            "text": "lol poor Putin. This is becoming one of the biggest \"well that didn't turn out how I expected\" in history",
            "title_similarity": "0.30905145",
            "sentiment_compound": 0.2023
        },
        {
            "id": "hypqson",
            "score": 1,
            "text": "I thought the U. S. Had a huge \nmilitary base in Kosovo from after the 🇧🇦 Bosnian conflict?",
            "title_similarity": "0.6961621",
            "sentiment_compound": 0.0
        },
        {
            "id": "hypqzcr",
            "score": 2,
            "text": "As somebody who lives somewhere near Camp Bondsteel I wouldn’t mind getting nuked",
            "title_similarity": "0.31794697",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyprc4p",
            "score": 2,
            "text": "How about they make a trade: Give Serbia Republika Srpska for them letting Kosovo?",
            "title_similarity": "0.6293385",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyprhdh",
            "score": 1,
            "text": "Laughs in Serbia coming for them",
            "title_similarity": "0.26373488",
            "sentiment_compound": 0.4939
        },
        {
            "id": "hypro0s",
            "score": 7,
            "text": "Vlad you messed up. You found a way to unite the world against Russia. Way to go you pos.",
            "title_similarity": "0.57053375",
            "sentiment_compound": -0.34
        },
        {
            "id": "hyprtq7",
            "score": 9,
            "text": "Since Crimea I've been incensed at the fact Ukraine wasn't speed run in as a NATO member.  They earned it when the de-escalated and gave up nuclear weapons in 1994.  \n\nThe west should be ashamed at the last 30 years of leaving Ukraine exposed.",
            "title_similarity": "0.5584408",
            "sentiment_compound": -0.8519
        },
        {
            "id": "hypruil",
            "score": 3,
            "text": "Putin will be veeeery lonely in the future",
            "title_similarity": "0.25280875",
            "sentiment_compound": -0.3612
        },
        {
            "id": "hyprvv3",
            "score": 1,
            "text": "I thought the US didn’t recognize Kosovo?",
            "title_similarity": "0.34598827",
            "sentiment_compound": 0.0
        },
        {
            "id": "hypryxh",
            "score": 3,
            "text": "Putin trying to pull code geass lol",
            "title_similarity": "0.3907218",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hyps5ag",
            "score": 3,
            "text": "The excuses for not giving Ukraine NATO protection over the years are ringing pretty hollow now.\n\n\"There's technical fine print that you have to have ten years worth of unthreatened control over your territory.\"  Who cares?\n\n\"It might irk Putin\".  Again, who cares.  What's he going to do, invade and kill children? \n\nIn hindsight, we can see it was all naive appeasement.",
            "title_similarity": "0.48764834",
            "sentiment_compound": 0.5305
        },
        {
            "id": "hyps7zx",
            "score": 3,
            "text": "Thats a good move.  If he takes over ukraine hes half way to the coast. After ukraine he can take over whos next in line.  Maybe his long term goal is just that.",
            "title_similarity": "0.5964401",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hyps8n5",
            "score": 1,
            "text": "I know some Serbs who would be very unhappy with this",
            "title_similarity": "0.20050113",
            "sentiment_compound": -0.4754
        },
        {
            "id": "hypsag6",
            "score": 5,
            "text": "USA doesn't have to do a damn thing to solve their Russian problems,they are doing it themselves. They can just sit back and let them ruin themselves lol",
            "title_similarity": "0.40998465",
            "sentiment_compound": -0.4404
        },
        {
            "id": "hypsbhr",
            "score": 5,
            "text": "Imagine some older folks might get to see Russia fall twice in their lifetime.",
            "title_similarity": "0.42725778",
            "sentiment_compound": 0.0
        },
        {
            "id": "hypsd4a",
            "score": 3,
            "text": "They've been asking for both for years. Momentum changes attention.",
            "title_similarity": "0.27786368",
            "sentiment_compound": 0.0
        },
        {
            "id": "hypsh2e",
            "score": 3,
            "text": "“Don’t join that club or we’ll kill you all” is a pretty good pitch for joining the club",
            "title_similarity": "0.3150009",
            "sentiment_compound": 0.3818
        },
        {
            "id": "hypsntd",
            "score": 3,
            "text": "This is the thing that I find so head scratching, the world was questioning the relevance of or need for NATO. By doing this not only will the dismantling of NATO not happen, greater investment will be made to strengthening it.",
            "title_similarity": "0.6014011",
            "sentiment_compound": 0.1754
        },
        {
            "id": "hypso0i",
            "score": 3,
            "text": "Yep that scans. People are not going to wait around for Russia to beat them over the head for their friendship",
            "title_similarity": "0.4899458",
            "sentiment_compound": 0.6249
        },
        {
            "id": "hypsyw1",
            "score": 3,
            "text": "Oh that's huge.....",
            "title_similarity": "0.05622165",
            "sentiment_compound": 0.3182
        },
        {
            "id": "hypt6fy",
            "score": 2,
            "text": "Should be done",
            "title_similarity": "0.11448787",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyptd6k",
            "score": 1,
            "text": "Lol wut",
            "title_similarity": "-0.04248232",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hyptg1j",
            "score": 1,
            "text": "Let’s go!!",
            "title_similarity": "0.17278512",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyptpej",
            "score": 2,
            "text": "I wonder what all the Putin simps who think this was the \"right move\" to avoid \"NATO imperialism\" are thinking about this.\n\nIf I were to guess, I'm gonna assume it's not Putin's fault, but the \"evil West\" at it again.",
            "title_similarity": "0.5035033",
            "sentiment_compound": -0.7947
        },
        {
            "id": "hyptw1f",
            "score": 2,
            "text": "Okay but did anyone notice how ugly putin is?",
            "title_similarity": "0.25933462",
            "sentiment_compound": -0.6124
        },
        {
            "id": "hyptwd2",
            "score": 2,
            "text": "Ya NATO  needs to move its butt",
            "title_similarity": "0.4974055",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyptylp",
            "score": 3,
            "text": "I’m just having a hard time believing Putin wouldn’t have thought this whole thing through better.\n\nHave I been overestimating his cleverness this whole time? \n\nIdk… I worry he’s already set on either having it all, or taking everything down with him.",
            "title_similarity": "0.3717569",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hypu8zz",
            "score": 2,
            "text": "Suck on that Putin.",
            "title_similarity": "0.28563416",
            "sentiment_compound": -0.4404
        },
        {
            "id": "hypujkr",
            "score": 3,
            "text": " Nothing unifies people more than someone to hate.",
            "title_similarity": "0.09966293",
            "sentiment_compound": -0.5719
        },
        {
            "id": "hypuo52",
            "score": 1,
            "text": "How long does joining NATO take, from the time a country decides to?",
            "title_similarity": "0.56900656",
            "sentiment_compound": 0.0
        },
        {
            "id": "hypuqt3",
            "score": 1,
            "text": "https://youtu.be/5pVDlo6ZW5c",
            "title_similarity": "0.12652114",
            "sentiment_compound": 0.0
        },
        {
            "id": "hypux8f",
            "score": 5,
            "text": "How's this war working out for you, Putin?  You're losing a war you were overwhelmingly expected to win, you unified NATO and the world against you, and you're permanently putting your enemies right along your border.  You lost, you dumbass!  \n\nRussia should save itself and find a bullet for Putin's head.  After the war criminal is convicted and stripped of all the riches he stole from the Russian people, of course.",
            "title_similarity": "0.5337882",
            "sentiment_compound": -0.9392
        },
        {
            "id": "hypuz8g",
            "score": 1,
            "text": "What kosova and albania both need is mandatory military for the youth. That will also help as well",
            "title_similarity": "0.5616226",
            "sentiment_compound": 0.6249
        },
        {
            "id": "hypuzrt",
            "score": 1,
            "text": "With apologies to the Beach Boys...\n\nTo the tune of Kokomo...\n\nSer BEE A, AUS-TRI-A, oh we will defend ya\n\nWith N-Laws and...a few grand\n\nsoldiers on the main land...\n\n&#x200B;\n\nEast of It-a-a-leeeeee.\n\nThere's a place called Kosovo.\n\nThat's where NATO will go\n\nTo make the Russians bawl\n\n(Down in Kosovo)\n\n&#x200B;\n\nYou get the idea...",
            "title_similarity": "0.66829",
            "sentiment_compound": 0.4588
        },
        {
            "id": "hypv6pm",
            "score": 1,
            "text": "Literally a MASSIVE fuck up for Putin on every level it seems like.",
            "title_similarity": "0.32179177",
            "sentiment_compound": -0.25
        },
        {
            "id": "hypvd0k",
            "score": 2,
            "text": "Unintended consequences abound. Suck a bag of dicks, Putin.",
            "title_similarity": "0.2922054",
            "sentiment_compound": -0.4404
        },
        {
            "id": "hypvf8x",
            "score": 2,
            "text": "US imperialism + 1.  Ain't that a sweet deal...",
            "title_similarity": "0.29929912",
            "sentiment_compound": -0.357
        },
        {
            "id": "hypvjzn",
            "score": 1,
            "text": "Ummmm no",
            "title_similarity": "-0.06071209",
            "sentiment_compound": -0.296
        },
        {
            "id": "hypvl58",
            "score": 2,
            "text": "This is putin's greatest fear",
            "title_similarity": "0.2927474",
            "sentiment_compound": 0.25
        },
        {
            "id": "hypvzct",
            "score": 1,
            "text": "It's starting to seem like Putin hasn't really thought this thing through.",
            "title_similarity": "0.24770239",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hypvzh1",
            "score": 2,
            "text": "**I want to reach late stage** ***humanity***:\n\n\n1.\tOnly soldiers decide if war is needed\n\n2.\tConscript those that profit\n\n3.\tArmies stay within a few miles of border\n\n\n*Anything else should be a war crime for* ***humans***\n\nhttps://en.m.wikipedia.org/wiki/War_Is_a_Racket",
            "title_similarity": "0.5341804",
            "sentiment_compound": -0.8402
        },
        {
            "id": "hypw18v",
            "score": 1,
            "text": "The more this happens, the more Putin goes off the deep end I fear.",
            "title_similarity": "0.33311784",
            "sentiment_compound": -0.4939
        },
        {
            "id": "hypw6ox",
            "score": 2,
            "text": "Largest Lithium mines are there, imagine that.",
            "title_similarity": "0.29124492",
            "sentiment_compound": 0.0
        },
        {
            "id": "hypwrh9",
            "score": 2,
            "text": "\"Did somebody order a fresh batch of freedom?\" ~ Uncle Sam, probably",
            "title_similarity": "0.4224093",
            "sentiment_compound": 0.7579
        },
        {
            "id": "hypx4se",
            "score": 1,
            "text": "I’m assuming NATO wants payment from Ukraine to enter/join NATO? does anyone know why Ukraine refused to join NATO the few times it was requested between 2000-2020?",
            "title_similarity": "0.63297266",
            "sentiment_compound": 0.0
        },
        {
            "id": "hypx8f0",
            "score": 1,
            "text": "Ukraine PCS orders looking good down the line",
            "title_similarity": "0.3329714",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hypxmgt",
            "score": 2,
            "text": "That's where we want to go, way down in Kosovo",
            "title_similarity": "0.49544153",
            "sentiment_compound": 0.0772
        },
        {
            "id": "hypxr91",
            "score": 5,
            "text": "Putin, the man who united the world",
            "title_similarity": "0.49282748",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hypy0e7",
            "score": 4,
            "text": "[US military right now](https://media1.giphy.com/media/8VSaCyIdcnbuE/giphy.gif)",
            "title_similarity": "0.54523146",
            "sentiment_compound": 0.0
        },
        {
            "id": "hypyjzg",
            "score": 1,
            "text": "Oh that's gonna piss the Serbs off. Let's do it.",
            "title_similarity": "0.34486794",
            "sentiment_compound": -0.4019
        },
        {
            "id": "hypyqo2",
            "score": 1,
            "text": "I’ll leave this right here…\n\n\nhttps://www.google.com/amp/s/mobile.reuters.com/article/amp/idUSKCN1IP2JV",
            "title_similarity": "0.34565115",
            "sentiment_compound": -0.0516
        },
        {
            "id": "hypyx1g",
            "score": 1,
            "text": "IT HAS BEGUN!",
            "title_similarity": "0.15798377",
            "sentiment_compound": 0.0
        },
        {
            "id": "hypyy58",
            "score": 1,
            "text": "Wait. People...people still like us? YEAH!!!!!",
            "title_similarity": "0.12111764",
            "sentiment_compound": 0.765
        },
        {
            "id": "hyq0im6",
            "score": 1,
            "text": "Doesn't the U.S. already have a permanent military base in Kosovo?",
            "title_similarity": "0.7054213",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyq0q7b",
            "score": 4,
            "text": "as an american i really want the US to take a break from its wars and spending a lot on the military but i also want other european countries to be safe from russia",
            "title_similarity": "0.58387434",
            "sentiment_compound": 0.51
        },
        {
            "id": "hyq27ib",
            "score": 3,
            "text": "So apparently Putin and all of his rich friends truly did believe their own bullshit.  They obviously had absolutely no idea the world would respond like this. \n\nThey’re losing everything and destroying their economy and any want for another country to ever associate with them again. None of it Makes sense.",
            "title_similarity": "0.31092525",
            "sentiment_compound": -0.024
        },
        {
            "id": "hyq2nj3",
            "score": 2,
            "text": "If Ukraine joins nato, does that mean the USA and other nato countries will go to war with Russia?",
            "title_similarity": "0.7545991",
            "sentiment_compound": -0.5994
        },
        {
            "id": "hyq33n1",
            "score": 1,
            "text": "Cool.  Someone must still like us.",
            "title_similarity": "0.06893143",
            "sentiment_compound": 0.5859
        },
        {
            "id": "hyq3a9m",
            "score": 1,
            "text": "i'm such a great vid of the hill",
            "title_similarity": "0.16518505",
            "sentiment_compound": 0.6249
        },
        {
            "id": "hyq4eda",
            "score": 2,
            "text": "Russia will be asking to join NATO before this is over",
            "title_similarity": "0.783969",
            "sentiment_compound": 0.296
        },
        {
            "id": "hyq4nfr",
            "score": 3,
            "text": "That’s because they can’t enter into NATO while under active conflict. They think they will be next and want protection before it’s too late to get it.",
            "title_similarity": "0.5581345",
            "sentiment_compound": 0.1779
        },
        {
            "id": "hyq51zt",
            "score": 3,
            "text": "Nononono the Balkan situation is so delicate and any movement like this could set off another major war",
            "title_similarity": "0.34950784",
            "sentiment_compound": -0.2679
        },
        {
            "id": "hyq5996",
            "score": 3,
            "text": "There's been one in Pristina for decades. Is that not permanent?",
            "title_similarity": "0.25714874",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyq5d3u",
            "score": 2,
            "text": "EarthGov time",
            "title_similarity": "0.23188606",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyq6ab0",
            "score": 1,
            "text": "The Streisand Effect",
            "title_similarity": "0.12613449",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyq6nq2",
            "score": 1,
            "text": "Uhm...this might be a bit of a reach Kosovo...",
            "title_similarity": "0.36561084",
            "sentiment_compound": 0.0258
        },
        {
            "id": "hyq6vct",
            "score": 1,
            "text": "This is huge",
            "title_similarity": "0.048474886",
            "sentiment_compound": 0.3182
        },
        {
            "id": "hyq73yk",
            "score": 5,
            "text": "I thought everyone wanted the US to stop getting involved.",
            "title_similarity": "0.31718853",
            "sentiment_compound": -0.296
        },
        {
            "id": "hyq75gm",
            "score": 3,
            "text": "Meanwhile in Spain: what is Kosovo?",
            "title_similarity": "0.3763727",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyq7eky",
            "score": 3,
            "text": "All the neighboring countries to Russia should all apply for NATO membership all at the same time.  Let Russia invade all at once!",
            "title_similarity": "0.673665",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyq7kp8",
            "score": 3,
            "text": "Russia is the ocean swallowing the titanic (non-NATO countries), and Kosovo is that dude using the baby to get on the rescue boat. \n\n🙋🏻‍♂️ “Check, please.”",
            "title_similarity": "0.49794698",
            "sentiment_compound": 0.7579
        },
        {
            "id": "hyq847u",
            "score": 1,
            "text": "Don't be World Police! - but also, can we get some World Police please?",
            "title_similarity": "0.373171",
            "sentiment_compound": 0.501
        },
        {
            "id": "hyq8dl4",
            "score": 2,
            "text": "This is the world we live in now. Countries want to ally and pretty much just work things  out in a diplomatic way. This we have to thank putin for. I wish Central America established a NATO type of system.",
            "title_similarity": "0.68840265",
            "sentiment_compound": 0.8271
        },
        {
            "id": "hyq8fzz",
            "score": 4,
            "text": "Putin: dont join nato.  And those who are in nato, get out of there.\nRest of the world: I wasnt planning on joining either but now I am.",
            "title_similarity": "0.54830813",
            "sentiment_compound": -0.1139
        },
        {
            "id": "hyq8kob",
            "score": 1,
            "text": "Intriguing and seemingly prudent requests both, but unlikely to come to fruition any time soon.",
            "title_similarity": "0.1925054",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyq8o2q",
            "score": 3,
            "text": "Putin is an ad man at this point lol",
            "title_similarity": "0.30442238",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hyq912r",
            "score": 5,
            "text": "This is exactly what US wanted",
            "title_similarity": "0.14857262",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyqaa7d",
            "score": 1,
            "text": "many poles have some ukrainian heritage",
            "title_similarity": "0.23798747",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyqab7o",
            "score": 2,
            "text": "American: *say less*",
            "title_similarity": "0.19084111",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyqasro",
            "score": 2,
            "text": "Aruba, Jamaica…",
            "title_similarity": "0.11562735",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyqbrw5",
            "score": 1,
            "text": "What, Camp Bondsteel is gonna be permanent?",
            "title_similarity": "0.39648935",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyqcn4s",
            "score": 2,
            "text": "Tanking his own economy? Unifying western powers against him? Getting even China denounce and the Swiss to take action? Creating a mad dash for NATO enrollment? Getting your ass handed to you as your military is exposed as being poorly trained, poorly organized, and badly outdated? Boy, Putin is really firing on all cylinders this week. He’s caused more harm to Russia than 2 decades’ worth or outside influence and opposition.",
            "title_similarity": "0.4864861",
            "sentiment_compound": -0.9505
        },
        {
            "id": "hyqcne1",
            "score": 2,
            "text": "Bosnia and Herzegovina is also receiving more EU troops as we speak.",
            "title_similarity": "0.5180204",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyqdj6n",
            "score": 1,
            "text": "alees",
            "title_similarity": "0.03162839",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyqdo5n",
            "score": 1,
            "text": "for those surprised, there was also an incident yesterday and that’s why people in kosovo are more and more frightened, explained here: https://reddit.com/r/europe/comments/t2wdxu/_/hyp4etx/?context=1",
            "title_similarity": "0.414901",
            "sentiment_compound": -0.3729
        },
        {
            "id": "hyqe64x",
            "score": 1,
            "text": "Good idea.   \n\n\nRun on the Russian banks tomorrow. Ruble is crashing, they can’t access USD or Euros to prop it up.\n\nRussian stock market crash tomorrow. World’s largest fund, Norway $1.3T dumping Russia.",
            "title_similarity": "0.46938878",
            "sentiment_compound": -0.2732
        },
        {
            "id": "hyqfgia",
            "score": 5,
            "text": "How's that plan to discourage NATO membership working out for you there, Putin?  You sure showed 'em, eh?  You showed them all what a complete loose fucking canon you are.  Right into the waiting arms of NATO.\n\nBrilliant strategist you are.  What a dumb fuck loser.",
            "title_similarity": "0.4917658",
            "sentiment_compound": -0.8611
        },
        {
            "id": "hyqfs41",
            "score": 4,
            "text": "Insane how that works when everyone all the sudden needs America to step in and help. Also Finland all the sudden would like to join as well having said that this will strengthen NATO immeasurably.  Which is awesome bet they won't be the only ones.",
            "title_similarity": "0.63083136",
            "sentiment_compound": 0.9042
        },
        {
            "id": "hyqgcry",
            "score": 4,
            "text": "What's incredible is that all that built up \"good will\" that allowed Russia to at least be part of modern society (although still mistrusted) had literally one precondition, \"Don't invade other countries\".",
            "title_similarity": "0.5705628",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hyqgrbb",
            "score": 3,
            "text": "We should all join NATO just to spite the fucker! Where can I sign up?",
            "title_similarity": "0.6255193",
            "sentiment_compound": -0.7777
        },
        {
            "id": "hyqh8ol",
            "score": 2,
            "text": "Ok no problem haha",
            "title_similarity": "-0.044906035",
            "sentiment_compound": 0.2448
        },
        {
            "id": "hyqjpzd",
            "score": 1,
            "text": "They pay for, I am for it.",
            "title_similarity": "0.15885295",
            "sentiment_compound": -0.1027
        },
        {
            "id": "hyqkpic",
            "score": 2,
            "text": "History of NATO Enlargement\n\nhttps://i.imgur.com/A8P6PkI.png",
            "title_similarity": "0.66757745",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyqmb16",
            "score": 2,
            "text": "Putin did what Trump couldn’t. Had fellow nato countries meet their defense spending quota!",
            "title_similarity": "0.68558013",
            "sentiment_compound": 0.2003
        },
        {
            "id": "hyqnabx",
            "score": 1,
            "text": "I don't get why their asking US. it should be a NATO base. We've had our hands in too many countries for too long. US isn't world police. Am not saying we shouldn't help, but it shouldn't be us running the show.",
            "title_similarity": "0.5591856",
            "sentiment_compound": -0.1603
        },
        {
            "id": "hyqo272",
            "score": 2,
            "text": "I’m sorry, did I hear this correctly? A nation is ASKING to have foreign bases on their soil? Since when? Putin really fucked up this time",
            "title_similarity": "0.6101237",
            "sentiment_compound": -0.7603
        },
        {
            "id": "hyqowjk",
            "score": 4,
            "text": "“Kosovos President Mehaj has said that his government was ready to offer help for any military operation to Ukraine, should that be asked for by Washington.”\n\nAdmirable .",
            "title_similarity": "0.8227881",
            "sentiment_compound": 0.8316
        },
        {
            "id": "hyqrq9l",
            "score": 1,
            "text": "I don’t blame them.",
            "title_similarity": "0.046688993",
            "sentiment_compound": -0.34
        },
        {
            "id": "hyqvha2",
            "score": 1,
            "text": "O Putina!  A je budalla?  Gjithmon!",
            "title_similarity": "0.2616552",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyqwmwt",
            "score": 3,
            "text": "Well that's  something  you dont hear everyday.",
            "title_similarity": "-0.0011455072",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hyqzsjh",
            "score": 2,
            "text": "These are weird cause it seems like If they’re fast tracked like this, it may be up to a process that isn’t democratic",
            "title_similarity": "0.17780079",
            "sentiment_compound": 0.5106
        },
        {
            "id": "hyr1f6c",
            "score": 1,
            "text": "One of Trumps ideas was that countries should pay the US to host our bases. Thoughts?",
            "title_similarity": "0.5302328",
            "sentiment_compound": -0.1027
        },
        {
            "id": "hyr4d1g",
            "score": 2,
            "text": "Nothing gives Americans erections faster than letting them build a base in your territory.",
            "title_similarity": "0.46989524",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyr639o",
            "score": 2,
            "text": "If you have reached your article limit: https://web.archive.org/web/20220227195747/https://www.reuters.com/world/europe/kosovo-asks-us-permanent-military-base-speedier-nato-membership-2022-02-27/?utm_source=reddit.com",
            "title_similarity": "0.6412513",
            "sentiment_compound": 0.1027
        },
        {
            "id": "hyr90ev",
            "score": 1,
            "text": "Lol they scared of serbia",
            "title_similarity": "0.23786753",
            "sentiment_compound": -0.0258
        },
        {
            "id": "hyrcjw0",
            "score": 2,
            "text": "Can someone ELI5 why they're asking the U.S., specifically? Like, we didn't get *shit* done with Trump in office, why are we in charge all of a sudden? It's been a long time since I got a C+ in AP History...",
            "title_similarity": "0.50008285",
            "sentiment_compound": 0.6988
        },
        {
            "id": "hyrcoc2",
            "score": 1,
            "text": "Apples and oranges.",
            "title_similarity": "0.0019320659",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyrg269",
            "score": 1,
            "text": "Funny that people really think that Serbia needs Russia to re-take Kosovo. If the NATO wasn't in Kosovo, Serbia could re-take Kosovo within a week.",
            "title_similarity": "0.703248",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hyrgxtt",
            "score": 1,
            "text": "Don't we pretty much have a permanent base at camp bondsteel? It's been a while since I was there but as far as I know, it wasn't going anywhere anytime soon.",
            "title_similarity": "0.37882435",
            "sentiment_compound": -0.2057
        },
        {
            "id": "hyrj10g",
            "score": 1,
            "text": "I’m not sure about Singapore but these Bank of China foreign operations essentially run independently from one another with no real ties to the actual Bank of China, in China.\n\nAccounts of the Chinese Bank of China and Hong Kong are connected but I’m pretty sure elsewhere has no connection.",
            "title_similarity": "0.23266661",
            "sentiment_compound": 0.289
        },
        {
            "id": "hyrkbf0",
            "score": 1,
            "text": "Didn't Albania had a NATO base that's just nearby Kosovo?",
            "title_similarity": "0.52791166",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyrkd7w",
            "score": 3,
            "text": "Yeah expanding NATO more will fix this. Lol.",
            "title_similarity": "0.5730792",
            "sentiment_compound": 0.6652
        },
        {
            "id": "hyrl0oa",
            "score": 1,
            "text": "If you say so Einstein.",
            "title_similarity": "0.19927347",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyrlocu",
            "score": 1,
            "text": "Haven’t they been asking for this basically since the War?",
            "title_similarity": "0.44670418",
            "sentiment_compound": -0.5994
        },
        {
            "id": "hyrmgpl",
            "score": 1,
            "text": "Close the one in fucking Kuwait and open one their, sick of the Middle East.",
            "title_similarity": "0.27871358",
            "sentiment_compound": -0.5106
        },
        {
            "id": "hyrq9id",
            "score": 2,
            "text": " Kosovo wants protection understandable but a permanent base maybe temporarily would work better",
            "title_similarity": "0.46307707",
            "sentiment_compound": 0.5927
        },
        {
            "id": "hyruhnm",
            "score": 1,
            "text": "This is not necessarily Kosovo asking for protection from Russia, but Kosovo asking for protection from Albania. This is the “region destabilization” we also saw when the US illegally invaded Iraq.\n\nSpeaking of, when is George W Bush gonna be pulled in for war crimes? Everything he did was just as bad as what Putin is doing. Nobody cares because it was a Muslim country? We all just forgot? Or trying to forget? Cause last I saw he was on Ellen showing his paintings. Think we’ll have Putin on Russian talk shows in 20 years explaining how his love of macrame saved his retirement?",
            "title_similarity": "0.5492002",
            "sentiment_compound": 0.4606
        },
        {
            "id": "hyrvlrs",
            "score": 2,
            "text": "Kosovo is not even recognized by all EU members",
            "title_similarity": "0.269935",
            "sentiment_compound": 0.0
        },
        {
            "id": "hys7hjf",
            "score": 3,
            "text": "I just left Kosovo. They deserve everything.",
            "title_similarity": "0.39155054",
            "sentiment_compound": 0.0
        },
        {
            "id": "hysah6c",
            "score": 1,
            "text": "Serbia will love that",
            "title_similarity": "0.25411218",
            "sentiment_compound": 0.6369
        },
        {
            "id": "hyskcyg",
            "score": 1,
            "text": "Serbia should do the same, Russia have proven they don't care about their Slavic neighbours.",
            "title_similarity": "0.49756515",
            "sentiment_compound": -0.3875
        },
        {
            "id": "hyskdsf",
            "score": 1,
            "text": "I'm beginning to understand that Trump likes Putin because Putin is recruiting countries into NATO at record speeds.",
            "title_similarity": "0.62032956",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hyslk5g",
            "score": 1,
            "text": "I’ve got an image of Osmani filling out the application forms to NATO as fast as she can, while aids surround her, wiping her brown, changing her pens and sliding more paperwork in front of her like some kind of scene from a medical operation…",
            "title_similarity": "0.46796095",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hysv4dg",
            "score": 1,
            "text": "The United Nations is a good step\nNATO is meh\nBut by one thing or another this world gotta come together as one nation ruled by none\nRan by many.\nThe United people of Earth . 🌍",
            "title_similarity": "0.5766581",
            "sentiment_compound": 0.7506
        },
        {
            "id": "hyt3cbo",
            "score": 1,
            "text": "This will go down on history as one of the biggest self owns ever.",
            "title_similarity": "0.24912162",
            "sentiment_compound": 0.0
        },
        {
            "id": "hytddru",
            "score": 1,
            "text": "What are the chances that the US actually takes up on this request and begins work on establishing a new base in the country? Or is this more symbolic?",
            "title_similarity": "0.61162174",
            "sentiment_compound": 0.2869
        },
        {
            "id": "hzhn6at",
            "score": 1,
            "text": "Camp Bondsdeel is already in Kosovo and that base is massivee",
            "title_similarity": "0.4768572",
            "sentiment_compound": 0.0
        },
        {
            "id": "hziifma",
            "score": 2,
            "text": "NATO's economy is growing very fast on cold blood!\r  \nThese companies make and sell Hi-Tech War related Arms machineries including Nuclear systems!\r  \nLockeed Martin share price on 14 Feb 2022 - $365 gone up 4 March 2022 - $458\r  \nGeneral Dynamics share price on 14 Feb 2022 -$211 gone up 4 March 2022 - $243\r  \nNorthrop Grumman share price on 14 Feb 2022 -$386 gone up 4 March 2022 - $471 \r  \nCapitalism and Market Economy will remain number one threat to global peace.",
            "title_similarity": "0.5827155",
            "sentiment_compound": 0.6688
        },
        {
            "id": "i03u09t",
            "score": 2,
            "text": "Too late for a response.\n\nhttps://www.newsweek.com/kosovo-nato-eu-ukraine-balkans-russia-invasion-1685951",
            "title_similarity": "0.57374334",
            "sentiment_compound": 0.0
        }
    ]
}