{
    "Ukraine credits Turkish drones with eviscerating Russian tanks and armor in their first use in a major conflict\n": [
        {
            "id": "hysuglz",
            "score": 1,
            "text": "Turkey - this is your chance.  Be better!",
            "title_similarity": "0.34501433",
            "sentiment_compound": 0.636
        },
        {
            "id": "hyt8h8b",
            "score": 1,
            "text": "[deleted]",
            "title_similarity": "-0.004056666"
        },
        {
            "id": "hyubh3o",
            "score": -1,
            "text": "Turk here. These bayraktar drones are developed by Erdogan’s very groom (son in law), selcuk bayraktar. He was granted millions of dollars with fradulent agreements, which opted out other Turkish companies who had already made further progress in the field. However, he managed to develop them at last. And erdogan has been using these drones’s success for his own purpose as a perfect means for his own propaganda.",
            "title_similarity": "0.70489216",
            "sentiment_compound": 0.9062
        },
        {
            "id": "hytw1iq",
            "score": -8,
            "text": "The first use of Bayraktars in a major conflict was in late 2020 in Artsakh/Karabakh war by Azerbaijan. \n\nAzerbaijan was getting ton of these to fight the Armenians, who won a hard fought victory in the 90's to preserve their right to life. Those Bayraktars were most probably flown by the Turks as the Azeris got flight certified months after the conflict.\n\nIn that war, they were devastating. Mainly because Armenians of Artskh didn't have the latest AA systems and no proper air force. Turkish F16s were flying cover for these drones.\n\nIn Ukraine they are not as effective. While they had some successes, Russia dominated the air war and took most of the Ukrainian air force out. These relatively low cost drones, are not a serious match for any country with even a half decent AF. They will be either destroyed before they take off, or on the air.",
            "title_similarity": "0.7594052",
            "sentiment_compound": -0.9793
        },
        {
            "id": "hyt7xv7",
            "score": -8,
            "text": "Wikipedia tells me that Ukraine only has 6 of these. Those won't last long. There are a bunch more on order. I wonder when those will be delivered.",
            "title_similarity": "0.39395815",
            "sentiment_compound": 0.0
        },
        {
            "id": "hytvfg8",
            "score": 3,
            "text": "Obviously it’s great that Ukraine is able to defend itself, but let’s not forget that some of those people in the convoy had absolutely no idea they were going to war. They were told it was just another exercise or that they’d be welcomed with open arms. They are just people with families and loved ones.",
            "title_similarity": "0.5153872",
            "sentiment_compound": 0.5282
        },
        {
            "id": "hyt3aor",
            "score": 6,
            "text": "Turkey and Russian relations now.  \"This has turned in to a difficult situation meme.\"  didn't turkey get in to a dispute for buying a bunch of Russian air defense systems XD Russia was thinking thay were BFFs.",
            "title_similarity": "0.6635287",
            "sentiment_compound": 0.2103
        },
        {
            "id": "hytdrtk",
            "score": 4,
            "text": "NATO can't send troops in but let's send in a literal (thousands of) fuck ton of the best drones on the market to help. I'm tired of countries sending military aid packages that amount to a few dollars per capita of their citizens at most. Send in the cavalry!",
            "title_similarity": "0.6134354",
            "sentiment_compound": 0.2598
        },
        {
            "id": "hytzugk",
            "score": -3,
            "text": "They don’t seem to be too effective against the 4 mile long convoy that’s heading towards Kiev. I fear the Russians figured out how to neutralize these drones, that or the convoy is being escorted by a lot Air Force support. Either way, Ukraine needs to find out a way how to stop them. That shit don’t look good.",
            "title_similarity": "0.6102445",
            "sentiment_compound": -0.0772
        },
        {
            "id": "hyt5zb9",
            "score": 1,
            "text": "Keep it up #Ukraine",
            "title_similarity": "0.18172431",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyttbuo",
            "score": 1,
            "text": "When the bad guy is so bad that the other bad guy starts helping you out.",
            "title_similarity": "0.2252053",
            "sentiment_compound": -0.8831
        },
        {
            "id": "hyv3rd7",
            "score": 0,
            "text": "Great job blowing up the armored convoy, but can we take a minute to think about the people they blew up. I know “just following orders” isn’t a great excuse but they were still the sons and daughters and fathers and northern to people.",
            "title_similarity": "0.594243",
            "sentiment_compound": 0.8641
        },
        {
            "id": "hyt3y77",
            "score": 8,
            "text": "as a turk this is something unexpected to see, I didnt even know we made drones lmao.",
            "title_similarity": "0.4860314",
            "sentiment_compound": 0.5994
        },
        {
            "id": "hytujiv",
            "score": 0,
            "text": "Yallah",
            "title_similarity": "-0.03018945",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyu425o",
            "score": 0,
            "text": "This isn't the first major conflict where a Turkish drone was used. It was used about 2 years ago during the war between Artsakh (Ngorno-Karabagh) and Azerbaijan. Proportionately compared to what is going on now, that was a major conflict for that region, with far greater losses on the Armenian side. That war still isn't over, up until today Armenians in Artsakh are getting attacked, killed, and displaced. It seems like the entire world only cares when they want to care.",
            "title_similarity": "0.71239626",
            "sentiment_compound": -0.9133
        },
        {
            "id": "hyuxr33",
            "score": 0,
            "text": "I wish people would keep their immature comments to themselves and give the subject the respect it deserved. War between countries is not some school yard spat people loose families, lives homes so think of this before you post your shit.",
            "title_similarity": "0.3434298",
            "sentiment_compound": -0.6124
        },
        {
            "id": "hyzeuu8",
            "score": 0,
            "text": "We need nuclear way to destroy America lol",
            "title_similarity": "0.49018595",
            "sentiment_compound": -0.1779
        },
        {
            "id": "hytotas",
            "score": 3,
            "text": "tebrikler de çok da dillendirmesek...",
            "title_similarity": "0.0643549",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyt8on4",
            "score": 6,
            "text": "This is just way too premature. No doubt the Kremlin is quickly analyzing their approach and is looking to respond appropriately. We are celebrating way too early.",
            "title_similarity": "0.3103758",
            "sentiment_compound": 0.7013
        },
        {
            "id": "hyt3x71",
            "score": -13,
            "text": "This is gonna make the Greeks step up their game for sure.",
            "title_similarity": "0.24069929",
            "sentiment_compound": 0.3182
        },
        {
            "id": "hytwuoa",
            "score": -15,
            "text": "Turkey, all you have to do is acknowledge the Armenian genocide and you guys can be good guys too! I'm not trying to be smart. Today's day we should all acknowledge and bear our crosses or else we end up being a Putin.",
            "title_similarity": "0.6006324",
            "sentiment_compound": 0.7088
        },
        {
            "id": "hytusdb",
            "score": 2,
            "text": "I read about the Azerbaijan steamrolling Armenia last winter and the last few weeks I was hoping hard that our fellow NATO member Turkey would be getting Ukraine up to speed on drones like what they did with Azerbaijan. So I am overjoyed at reading this!",
            "title_similarity": "0.7303606",
            "sentiment_compound": 0.8464
        },
        {
            "id": "hyu3ldw",
            "score": 3,
            "text": "We forgetting about Armenia? They seemed pretty effective there too but we don’t want to talk about that.",
            "title_similarity": "0.2818447",
            "sentiment_compound": 0.5574
        },
        {
            "id": "hyszgrq",
            "score": 18,
            "text": "I'm really amazed Turkey can send in drones. I didn't think that would be looked at differently than Turkey sending in troops.\n\nCan other allies send in drones?",
            "title_similarity": "0.6282751",
            "sentiment_compound": 0.5413
        },
        {
            "id": "hytowla",
            "score": 18,
            "text": "They were used by the Ethiopian government when it defended the country from US backed Rebels in 2021. \n\nUpon their use, the western media called them “more deadly” and were very critical against Turkey. But now, it’s applauded.\n\nHypocrites.",
            "title_similarity": "0.63259614",
            "sentiment_compound": 0.274
        },
        {
            "id": "hyuh71t",
            "score": -8,
            "text": "Finally the Turks are being part of NATO",
            "title_similarity": "0.39381167",
            "sentiment_compound": 0.0
        },
        {
            "id": "hytmr3o",
            "score": -1,
            "text": "[deleted]",
            "title_similarity": "-0.004056666"
        },
        {
            "id": "hyvk8v6",
            "score": -1,
            "text": "Reddit needs to stop riding Bernie’s Dick.\n\nhttps://www.dailymail.co.uk/news/article-10561299/AOC-Bernies-Democratic-Socialists-group-blames-Russia-invasion-demands-end-NATO.html",
            "title_similarity": "0.54134667",
            "sentiment_compound": -0.6705
        },
        {
            "id": "hyu7rhq",
            "score": 11,
            "text": "As a Turkish person, this is the first time I'm seeing a whole /r/WorldNews post which isn't just all of Reddit dumping on my country. Whatever, I'm sure you'll just all be shitting all over us again tomorrow, but I guess I'll enjoy it while I can.\n\nIt is very important to note that the current advanced state of Turkish drone technology would not be possible without Selcuk Bayraktar, the son-in-law of Turkish President Tayyip Erdogan. Bayraktar is a Turkish engineer and businessman and is the Chief Technology Officer of Baykar, the Turkish defense company that manufacturers the TB2 drone being used in Ukraine. Baykar developed Turkey's first indigenous UAV program.",
            "title_similarity": "0.6979332",
            "sentiment_compound": 0.8515
        },
        {
            "id": "hytqw9o",
            "score": -8,
            "text": "You guys annoying",
            "title_similarity": "0.015449572",
            "sentiment_compound": -0.4019
        },
        {
            "id": "hytcer8",
            "score": -52,
            "text": "Turkish drones eviscerated civilian populations in Artsakh last year. Turkey can get fucked.",
            "title_similarity": "0.72330487",
            "sentiment_compound": -0.6597
        },
        {
            "id": "hytaw0p",
            "score": 8,
            "text": "Big props to Turkey",
            "title_similarity": "0.3610885",
            "sentiment_compound": 0.0
        },
        {
            "id": "hytq9gn",
            "score": 7,
            "text": "*Cries in Armenian*",
            "title_similarity": "0.2653576",
            "sentiment_compound": -0.4019
        },
        {
            "id": "hyt314x",
            "score": 3,
            "text": "I'm a pedantic mofo and all, but I don't think you can \"eviscerate\" a tank.",
            "title_similarity": "0.24608517",
            "sentiment_compound": -0.296
        },
        {
            "id": "hyt1b3z",
            "score": 21,
            "text": "For 5 million, I'd buy 1500 M72 LAW antitank bazookas and strap them vertically to 300x  DJI Matrice 600 drones, so each drone gets used 5 times with the single use bazookas. Reference : https://www.forbes.com/sites/davidhambling/2021/11/29/nammo-fit-their-anti-tank-rocket-launcher-to-a-drone/?sh=266d94ef42e2",
            "title_similarity": "0.6323339",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyudhd3",
            "score": 3,
            "text": "I'm an engineer. I like technology, and when I see something like that, I can't help myself but think this is very impressive, and I'm a bit excited by this feat.\n\nI also think that anything that prevents the annihilation of Ukraine is good. \n\nThat being said, I'm disgusted by the amount of messages here that meme and congratulates on the deaths of people. If roles were reversed and Trump had decided to send Americans in a war against Mexico, that could your brother, your father, you sister in that tank. Please be respectful.\n\nThe enemy is as human as you are, don't forget what's happening here, people dying, entire lives lost. It's a necessity, but meming is not.",
            "title_similarity": "0.6630684",
            "sentiment_compound": 0.5361
        },
        {
            "id": "hyv9hus",
            "score": -4,
            "text": "It's hilarious how pro military budget everyone is on reddit suddenly becomes when war breaks out. Before this Ukraine incident, not so much.",
            "title_similarity": "0.6787528",
            "sentiment_compound": -0.296
        },
        {
            "id": "hytkhip",
            "score": -12,
            "text": "Considering Turkey is run by it's own autocrat who has some Putin lite aspirations, this is not good.",
            "title_similarity": "0.4658474",
            "sentiment_compound": -0.3412
        },
        {
            "id": "hytuusb",
            "score": 0,
            "text": "These Bozos starting WWIII lol",
            "title_similarity": "0.27865627",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hytxseu",
            "score": 4,
            "text": "That face when Turkey is the most useful ally. Seriously, how did this happen?",
            "title_similarity": "0.45801747",
            "sentiment_compound": 0.3025
        },
        {
            "id": "hyty94b",
            "score": -5,
            "text": "[deleted]",
            "title_similarity": "-0.004056666"
        },
        {
            "id": "hytz6l0",
            "score": 0,
            "text": "[deleted]",
            "title_similarity": "-0.004056666"
        },
        {
            "id": "hyu0rj0",
            "score": 0,
            "text": "The Heavens rain death in the name of Sunflowers",
            "title_similarity": "0.2932455",
            "sentiment_compound": -0.296
        },
        {
            "id": "hyy8lfc",
            "score": 0,
            "text": "It’s quite odd to see so many celebrating this in the comments. And there… *people* in those tanks?",
            "title_similarity": "0.267398",
            "sentiment_compound": 0.3368
        },
        {
            "id": "hyucuaf",
            "score": -9,
            "text": "Why is Erdogan siding with the West? I'd have thought he'd be straight into bed with Putin.\n\nI know Turkey has ties to both countries, but just never expected them to be a voice of reason.",
            "title_similarity": "0.5478368",
            "sentiment_compound": 0.1154
        },
        {
            "id": "hyu50gl",
            "score": -9,
            "text": "Happy they're being put to good use and helping the Ukrainians. Although I can't help but be troubled by these drones, as we are constantly being bullied by Turkey. They have a base for them in the illegally occupied north.",
            "title_similarity": "0.66703606",
            "sentiment_compound": -0.8115
        },
        {
            "id": "hytrkvi",
            "score": 5,
            "text": "So countries and companies give Ukraine cutting edge new war equipment to showcase it against Russia's old stuff. And no one will sell Russia anything remotely new, or anything really.\n\nSucks to be Putin. Hope Russia will deal with their Putin problem soon.",
            "title_similarity": "0.6601453",
            "sentiment_compound": -0.8479
        },
        {
            "id": "hytxxkm",
            "score": 6,
            "text": "Reddit being Reddit hearing tb-2 making serious damage to Russians insteadly cheers our drones while sanctioned our drone tech not so long ago.\n\n\n\n\n\n\n\n\n\n\n\n\nBy the way if you didn't heard, the company that sanctioned us is bankrupt. Turns out it's not a logical thing to sanction your only customer.",
            "title_similarity": "0.7039813",
            "sentiment_compound": -0.6124
        },
        {
            "id": "hysvs4w",
            "score": -16,
            "text": "I hear they got Canadian software for them. Can anyone actually knowledgeable confirm?",
            "title_similarity": "0.43184662",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyswwh3",
            "score": 18,
            "text": "Used also by Morocco to chase Polisario rats. Highly effective!",
            "title_similarity": "0.37786886",
            "sentiment_compound": 0.5697
        },
        {
            "id": "hyt2nxg",
            "score": 14,
            "text": "How does Russia know if a drone is being piloted by a Ukrainian or a NATO member (with all the explosive ramifications thereof)?",
            "title_similarity": "0.69399875",
            "sentiment_compound": 0.0
        },
        {
            "id": "hytx0ip",
            "score": -7,
            "text": "Modern war is such a coward's game.",
            "title_similarity": "0.32087553",
            "sentiment_compound": -0.5994
        },
        {
            "id": "hytal6o",
            "score": 1,
            "text": "I dare them to do it again. Now I know this breaks all kinds of protocol, but I Triple Dog Dare them.",
            "title_similarity": "0.36795944",
            "sentiment_compound": 0.0
        },
        {
            "id": "hytdb20",
            "score": 1,
            "text": "What makes a drone better than a helicopter with missiles/guns/bombs? Just a question, not arguing or anything.",
            "title_similarity": "0.4610682",
            "sentiment_compound": 0.6575
        },
        {
            "id": "hytlqc3",
            "score": 1,
            "text": "Wow, I didn't see that happening. I thought Turkey supported Russia for some reason.",
            "title_similarity": "0.4355993",
            "sentiment_compound": 0.7269
        },
        {
            "id": "hytphyg",
            "score": -1,
            "text": "Hasan finally supporting Ukraine.",
            "title_similarity": "0.33491492",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hytpqmc",
            "score": -1,
            "text": "As a Cypriot this makes me nervous.",
            "title_similarity": "0.023835687",
            "sentiment_compound": -0.2732
        },
        {
            "id": "hytq638",
            "score": 1,
            "text": "Finally, drone strikes the world approves of.",
            "title_similarity": "0.517778",
            "sentiment_compound": 0.0516
        },
        {
            "id": "hytqjlz",
            "score": 1,
            "text": "Does this mean turkey is in danger",
            "title_similarity": "0.26486033",
            "sentiment_compound": -0.5267
        },
        {
            "id": "hyts20u",
            "score": -1,
            "text": "Hey, just wanted to let you know that are a wonderful and unique individual!",
            "title_similarity": "0.021888616",
            "sentiment_compound": 0.6114
        },
        {
            "id": "hytsw9l",
            "score": 1,
            "text": "Lets hope this doesnt turn into anything bigger.",
            "title_similarity": "0.022598118",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hyttlkv",
            "score": 1,
            "text": "Why do they bloat about it? Isn't it better for them that the enemy doesn't know wth is destroying them? Or am I missing something? They even post telling their enemies tk \"be afraid\". I guess they can use that to try to stop them? ..",
            "title_similarity": "0.4313436",
            "sentiment_compound": -0.9359
        },
        {
            "id": "hyttncp",
            "score": 1,
            "text": "War is terrible for everyone involved",
            "title_similarity": "0.29430145",
            "sentiment_compound": -0.7906
        },
        {
            "id": "hyttsk1",
            "score": 1,
            "text": "Depressing how many people die without knowing it's even coming",
            "title_similarity": "0.3075017",
            "sentiment_compound": -0.7579
        },
        {
            "id": "hytu3v0",
            "score": -1,
            "text": "Ww4 will be fought with sticks and rocks.",
            "title_similarity": "0.30686638",
            "sentiment_compound": -0.3182
        },
        {
            "id": "hytudiv",
            "score": 1,
            "text": "This is very well worded and written. May I ask what you do for work?",
            "title_similarity": "0.1499275",
            "sentiment_compound": 0.3384
        },
        {
            "id": "hytuj1s",
            "score": 1,
            "text": "There's video of these drones being used and Ukrainian soldiers going \"ooooooo\" like they're the aliens from Toy Story",
            "title_similarity": "0.6758469",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hytumt1",
            "score": 1,
            "text": "Apparently the war in Azerbaijan wasn't a major conflict?",
            "title_similarity": "0.2670507",
            "sentiment_compound": -0.4061
        },
        {
            "id": "hytx9sy",
            "score": 1,
            "text": "[deleted]",
            "title_similarity": "-0.0040566437"
        },
        {
            "id": "hytxdbd",
            "score": 1,
            "text": "engineer who made bayraktar is erdogans son in law lol",
            "title_similarity": "0.48265693",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hytz6p6",
            "score": -1,
            "text": "No they used them in the Donbas months ago before the war",
            "title_similarity": "0.46379358",
            "sentiment_compound": -0.7269
        },
        {
            "id": "hytzzcm",
            "score": 1,
            "text": "TB-2 is the perhaps the cheapest drones in the global market, with a payload of only 150KG. And their communication system is also the cheapest standard.\n\nIf the Russian Air force or their EW forces can't handle this kind of cheap toys, they are in serious problems ...",
            "title_similarity": "0.5053598",
            "sentiment_compound": -0.4588
        },
        {
            "id": "hyu45gd",
            "score": 1,
            "text": "Not gonna lie I thought turkey was sided with Russia",
            "title_similarity": "0.49899283",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyuc9ys",
            "score": -1,
            "text": "I guess Russia should have given a shit about Turkey when it was fucking with Armenia, instead of just letting it happen. Now that they are feeling the consequence and I hope hindsight is searing their ass raw. Nevertheless, fuck Putin.",
            "title_similarity": "0.5872417",
            "sentiment_compound": -0.802
        },
        {
            "id": "hyucef7",
            "score": 1,
            "text": "I keep thinking about the Death Star. The Death Star needed be removed from the Stars wars realm. I believe some of the people on the Death Star didn’t deserve death and many were only contracted to build the Death Star and maintain it. I am not saying it wasn’t right for the Death Star to be destroyed and I don’t have an alternative to a resolution. Damn thats still a lot of dead imperial workers.\n\nDamn that’s a lot of dead Russians.",
            "title_similarity": "0.55467176",
            "sentiment_compound": -0.9928
        },
        {
            "id": "hyuhdcd",
            "score": -1,
            "text": "Sounds like marketing stunt to me . \"This drone good, everyone buy this drone\" \nLotsa people are going to sell lotsa weapon during/after this war !!",
            "title_similarity": "0.6286202",
            "sentiment_compound": -0.3147
        },
        {
            "id": "hyuqy8i",
            "score": 1,
            "text": "These drones are relatively slow and require radio communication with the operator ...which proves just how totally incompetent the Russian war machine is, that they can't do something as simple as block the radio signal to these, much less blow them from the skies with missiles.",
            "title_similarity": "0.54472625",
            "sentiment_compound": -0.8805
        },
        {
            "id": "hyuw570",
            "score": -1,
            "text": "This article is sensationalized. Why? It’s drone warfare. It’s hell. \n\nSomething. Isn’t . Right. Here.",
            "title_similarity": "0.4584864",
            "sentiment_compound": -0.7783
        },
        {
            "id": "hyvpo1f",
            "score": -1,
            "text": "You can read my article about Turkish \"Bayraktar\" and \"Tusas\" drones..\n\nhttps://www.turkishvibe.com/turkey/game-changer-turkish-drones/",
            "title_similarity": "0.63402116",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyvs6ke",
            "score": -1,
            "text": "Act of war!",
            "title_similarity": "0.26964417",
            "sentiment_compound": -0.636
        },
        {
            "id": "hyvsf6a",
            "score": -1,
            "text": "I looked into the eyes of evil:  I remember him laughing, as my husband was dying!",
            "title_similarity": "0.4648086",
            "sentiment_compound": -0.3595
        },
        {
            "id": "hytoof0",
            "score": 8,
            "text": "People are vastly underestimating the capability of Russian military equipment. This shoddy invasion is a result of piss poor planning and vision. \n\nMost people forget that Ukraine uses mostly Soviet/Russian made weaponry.\n\nThis Twitter thread sums it up perfectly.\n\nhttps://twitter.com/KofmanMichael/status/1498381975022940167",
            "title_similarity": "0.5663109",
            "sentiment_compound": -0.3976
        },
        {
            "id": "hytu0dp",
            "score": -6,
            "text": "Russia has very good tanks even better than the US.. because there is reason the US is still using a tank from the 80s and spending money on drones.",
            "title_similarity": "0.63546324",
            "sentiment_compound": 0.7264
        },
        {
            "id": "hyttfys",
            "score": 9,
            "text": "Based Turkey. These same drones crushed the Armenian occupiers.",
            "title_similarity": "0.72264844",
            "sentiment_compound": -0.4215
        },
        {
            "id": "hyuhacx",
            "score": -8,
            "text": "Weapons create weapons. Drones may have pinpoint  accuracies, which may be helpful against civillian casualities but aren't soldiers civilians also? This is not about winning, there are no winners in the War. I May seem romantic but this is the truth. Violent acts arising with another reason than self defence is ill. If anyone wants to resolve a conflict with violence they should put themselves in flesh with what motives they may reserve. Strength is in union.",
            "title_similarity": "0.53433484",
            "sentiment_compound": -0.9562
        },
        {
            "id": "hyt0kkp",
            "score": 2,
            "text": "Any chance Ukrainian armed forces can get their hands on Harop kamikaze drones, or something similar from another country?",
            "title_similarity": "0.6390334",
            "sentiment_compound": 0.25
        },
        {
            "id": "hytbzni",
            "score": 2,
            "text": "I really wonder just how much of an advantage our drones now give us in traditional warfare. I don't think we've seen a major conflict where they've had so many high value targets to hit.\n\nIt's possibly they were far more present in afghanistan and iraq that we were told but I feel like we've got an enormous drone fleet currently that can almost be loaned out to our allies at a moments notice and allows a lot of the firepower of attack helicopters to be hidden all over the battlefield and use to hit targets precisely and at the most convient time.\n\nIt's possible I'm over estimating their advantage but if the US was going to discreetly help in this conflict the important thing we can offer is air support. There is a lot of distance to cover and if hundreds of drones can just eat away at the forces moving across ukraine and russia doesn't have a way to easily detect and counter these drones the devastation is going to looke like Iraq's forces in Kuwait.",
            "title_similarity": "0.72768974",
            "sentiment_compound": 0.7299
        },
        {
            "id": "hytcurz",
            "score": 2,
            "text": "The west should get more of these drones to the Ukrainians asap.",
            "title_similarity": "0.56952786",
            "sentiment_compound": 0.0
        },
        {
            "id": "hytfngz",
            "score": 2,
            "text": "BOOM SHAKKA LAKKA!",
            "title_similarity": "0.074289516",
            "sentiment_compound": 0.0
        },
        {
            "id": "hytj833",
            "score": 2,
            "text": "More drones please, is there a way for anyone else (another country) to anonymously pilot these drones to defined targets without being discovered or uncovered to be non Ukrainian? Could a small force of pilots be placed in Ukraine with live intel and access to multiple drones to wage their own war on incoming convoys of armour and thermobaric turrets. I would be targeting these heavy weapons firstly.",
            "title_similarity": "0.7249639",
            "sentiment_compound": -0.6395
        },
        {
            "id": "hytngdh",
            "score": 2,
            "text": "Smart, drag them into the quagmire, if Russia wins, they have another reason to attack Turkish interests which means that turkey can't have them win, which means more support. Nice.",
            "title_similarity": "0.55387855",
            "sentiment_compound": 0.7506
        },
        {
            "id": "hytqj9b",
            "score": -2,
            "text": "happy for ukraine but this is terrifying tbh. the age of warfare we're in has these super speed, highly maneuverable, 0 human casualty, remotely operated machines that could go in and out of a targeted zone in 10 minutes\n\nimagine if a group of like 50 of these were unleashed on New York, London, or Paris\n\nWhat defensive response do we even have against this?? Does anyone know?\n\nedit: this was just a legitimate question that i was curious about, not sure why the downvotes",
            "title_similarity": "0.65497506",
            "sentiment_compound": -0.3363
        },
        {
            "id": "hytu8w9",
            "score": 2,
            "text": "Great price, reliable accuracy and proven track record. \n\nBtw Turkey had some painful issues with right to use western weapons whenever they want ie cyprus invasion etc and have spent extra effort for years to cut themselves a slice of lucrative weapons export game. Looks like it worked with drones",
            "title_similarity": "0.70434296",
            "sentiment_compound": -0.4404
        },
        {
            "id": "hytvllj",
            "score": 2,
            "text": "🌱🌱🌱 here have some seeds russian nazi invaders.",
            "title_similarity": "0.5606967",
            "sentiment_compound": 0.0
        },
        {
            "id": "hytxsyw",
            "score": 2,
            "text": "Israel needs to send some Harop drones ASAP.  Make quick work of Russian terrorist ADN",
            "title_similarity": "0.67783535",
            "sentiment_compound": -0.6908
        },
        {
            "id": "hytyrcg",
            "score": 2,
            "text": "While this is absolutely an example of a legitimate use of unmanned fighter drones, dont forget that drones change the way a conflict plays out in so many ways, many of them negative.   \nThese same type of drones will soon be used by other forces not to engage a foreign invasion but against whoever they declare an enemy. \n\nDrones lower the risk for those using them so dramatically that they also reduce the hesitancy of going to war. \n\nThe ongoing automation and digitization of the military is a scary development that we need to deal with on many levels. Don't forget that while celebrating these drone strikes.",
            "title_similarity": "0.63974714",
            "sentiment_compound": -0.9674
        },
        {
            "id": "hytyu8x",
            "score": 2,
            "text": "Though they are on *our* side this time, I am almost equally terrified of the evolution of military drones as I'm terrified of nukes. Smaller and smaller machines with increasing capability of destruction leads my thoughts towards a certain black mirror episode with robotic wasps. The idea of a swarm of robots sweeping over an entire town is horrifying to me.\n\nIt's probably fine.",
            "title_similarity": "0.6168159",
            "sentiment_compound": -0.922
        },
        {
            "id": "hyuda1b",
            "score": -2,
            "text": "Really great to see the crazy dictator Erdoğan has such great weapons… let’s see what everyone’s saying once Turkey does something stupid….",
            "title_similarity": "0.65801036",
            "sentiment_compound": 0.796
        },
        {
            "id": "hyumo4q",
            "score": 2,
            "text": "I don’t have a dog in the fight but it’s rich that the Turkish president is against Putin when he did the same shit in Syria recently enough some people haven’t forgotten….",
            "title_similarity": "0.6326159",
            "sentiment_compound": -0.2023
        },
        {
            "id": "hyuugox",
            "score": 2,
            "text": "It’s cool but I feel bad for the people in those tanks. Once again, most of them don’t wanna be there and most of them didn’t even know they were going to war till the night before. Many though they were going for a peace mission. Fuck Putin. All these deaths are on his head",
            "title_similarity": "0.5260154",
            "sentiment_compound": -0.8873
        },
        {
            "id": "hyv2p34",
            "score": 2,
            "text": "I really wish they wouldn't publish these things until after this war is done. the lasting Ukraine needs is Putin figuring out a way to defeat these quickly",
            "title_similarity": "0.5647045",
            "sentiment_compound": -0.684
        },
        {
            "id": "hyvsprc",
            "score": -2,
            "text": "I’m Australian.  I have rights!  Even if nobody knows it.  I am David!",
            "title_similarity": "0.23861088",
            "sentiment_compound": 0.0
        },
        {
            "id": "hywwyeo",
            "score": 2,
            "text": "May I offer a suggestion?  Instead of paying for awards to give the posters, maybe make a donation to the Ukrainian war effort?\n\n&#x200B;\n\nСлава Героям України!    Glory to the heroes of Ukraine!",
            "title_similarity": "0.58272487",
            "sentiment_compound": 0.781
        },
        {
            "id": "hyxutg9",
            "score": 2,
            "text": "The irony here is astonishing. Erdogan and Putin might not stay butt buddies for long then!",
            "title_similarity": "0.34797797",
            "sentiment_compound": -0.126
        },
        {
            "id": "hytw9wx",
            "score": -11,
            "text": "[removed]",
            "title_similarity": "-0.052017674"
        },
        {
            "id": "hytsqgh",
            "score": 21,
            "text": "I understand the Ukrainians cheering but I can't derive any joy myself from watching Russian soldiers getting blown up.\n\nIt is Putin, his yes men and his generals that deserve to suffer the consequences, not the 20 year old Russian boys who are just as scared as their Ukrainian counterparts. Alas, in war it is often kill or be killed.",
            "title_similarity": "0.63599074",
            "sentiment_compound": -0.9859
        },
        {
            "id": "hyt7i0w",
            "score": 42,
            "text": "Trukey's drones are no joke. Thats a country no one should want to start a conflict with anytime soon.",
            "title_similarity": "0.36035725",
            "sentiment_compound": -0.6234
        },
        {
            "id": "hyt4znc",
            "score": -2,
            "text": "[deleted]",
            "title_similarity": "-0.004056666"
        },
        {
            "id": "hytc8xl",
            "score": -4,
            "text": "This article reads like the writer ran it through a thesaurus before hitting Publish.\n\nThe first clue? \"Eviscerating\".",
            "title_similarity": "0.49258104",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hytcs9v",
            "score": -3,
            "text": "idgaf if he supports al qaeda affiliated groups in idlib and helped ethnically cleanse afrin go kick those tankies ass erdogan",
            "title_similarity": "0.5889395",
            "sentiment_compound": -0.25
        },
        {
            "id": "hytdw0m",
            "score": 4,
            "text": "America should be doing this as well. Gift the drones to the Ukrainian people",
            "title_similarity": "0.6380137",
            "sentiment_compound": 0.6124
        },
        {
            "id": "hythgys",
            "score": 3,
            "text": "They seem incredibly effective for something that costs 1/10th of the American drones.",
            "title_similarity": "0.46191514",
            "sentiment_compound": 0.5256
        },
        {
            "id": "hytqya2",
            "score": 3,
            "text": "In general I really don't like drone warfare. It is the shooting fish in a barrel thing while not even being in any danger, that bothers me. It is a bit too much of a one sided affair to be tasteful.\n\nBut that moral problem only applies when someone is an aggressor. As a defence tool I have no problems at all in seeing them in use, as the attacker shouldn't have been there to begin with. It is really nice that you can defend your country in a comfy chair.",
            "title_similarity": "0.3928976",
            "sentiment_compound": -0.7205
        },
        {
            "id": "hytr14o",
            "score": 4,
            "text": "Let Ukraine go on the offensive.",
            "title_similarity": "0.45863283",
            "sentiment_compound": -0.4588
        },
        {
            "id": "hytv51d",
            "score": -3,
            "text": "Jesus— a fucking tragedy of human life. There is no ceiling in war.  Next stop —nuclear weapons.",
            "title_similarity": "0.4755451",
            "sentiment_compound": -0.9422
        },
        {
            "id": "hytxgx8",
            "score": -3,
            "text": "Wait... Wait... Isn't turkey a NATO country? A NATO country directly attacking Russian military forces? Does this not draw all of NATO in?\n\n\nEdit: nm the turks just donated the drones",
            "title_similarity": "0.81091017",
            "sentiment_compound": -0.5484
        },
        {
            "id": "hyu2p91",
            "score": -4,
            "text": "Guys wtf are you doing stop praising Turkey. Erdogan will feed this to the propaganda machine and win the election again NOOO!",
            "title_similarity": "0.6424097",
            "sentiment_compound": 0.1511
        },
        {
            "id": "hyu5epe",
            "score": 4,
            "text": "Oh man I can smell a great Poland Ball comic coming out of this.",
            "title_similarity": "0.2729112",
            "sentiment_compound": 0.6249
        },
        {
            "id": "hyu8rp1",
            "score": 4,
            "text": "Good job Turkey for helping Ukraine fight the Russians",
            "title_similarity": "0.74043286",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hyuo6oh",
            "score": 3,
            "text": "After what Russia did to Turkey during the armenian war with Azerbaijan. I’m not surprised by this",
            "title_similarity": "0.64121395",
            "sentiment_compound": -0.6774
        },
        {
            "id": "hyuqhnk",
            "score": 3,
            "text": "Putin be like, \"Erdoğan, my autocratic brother...WTF man?!!\"",
            "title_similarity": "0.51032937",
            "sentiment_compound": 0.4738
        },
        {
            "id": "hyv12fp",
            "score": -3,
            "text": "So this is how it happens. Turkey gets involved using and selling drones. Putin attacks Turkey. US gets dragged in because Turkey is a NATO member.\n\nFuck.",
            "title_similarity": "0.7549994",
            "sentiment_compound": -0.765
        },
        {
            "id": "hytm1th",
            "score": 14,
            "text": "Developed by an MIT grad student. Must of majored in arse whoppin.\n\nhttps://en.m.wikipedia.org/wiki/Sel%C3%A7uk_Bayraktar",
            "title_similarity": "0.37467137",
            "sentiment_compound": 0.0
        },
        {
            "id": "hytqhb2",
            "score": 5,
            "text": "I’m trying to remain optimistic for Ukraine but there is a 17 mile convoy of heavy equipment ready to enter Kyiv. This is going to get bad",
            "title_similarity": "0.48649067",
            "sentiment_compound": -0.2144
        },
        {
            "id": "hyvgywq",
            "score": -4,
            "text": "I feel really bad watching this. At least from the footage it looks like the convoy is just hanging out, not shooting or bothering anyone. I'm just imaging that specific group hasn't engaged anyone yet, and they got blown up.  Couldn't they have warned them. Dropped a \"message missle\" that hits next to them with a note saying \"give up or you will be blown up?\"\nThis whole thing is just shitty",
            "title_similarity": "0.41191962",
            "sentiment_compound": -0.6313
        },
        {
            "id": "hyz4vfj",
            "score": -4,
            "text": "oh yes, Ukraine will get what it deserves.  I don't care what reddit thinks about it, fact;  they will answer for everything, and you will all be wrong.",
            "title_similarity": "0.4710284",
            "sentiment_compound": -0.4639
        },
        {
            "id": "hyth143",
            "score": -16,
            "text": "I mean besides aiding Azerbaijan in invading Armenia.\n\nBut Turkey does not want to talk about that, just like they don't acknowledge the genocide they committed against Armenia less than 100 years ago.",
            "title_similarity": "0.5072132",
            "sentiment_compound": 0.6775
        },
        {
            "id": "hyteacy",
            "score": 5,
            "text": "Could Russia interpret this as NATO intefering or is it more the same as sending arms?",
            "title_similarity": "0.43143278",
            "sentiment_compound": 0.0
        },
        {
            "id": "hytjpl1",
            "score": 5,
            "text": "Tell  your governments to help donate money toward getting more TB2s into Ukraine..\n\nAnd if you're from Turkey, please help make the government send more.\n\nThese things are a complete game changer for Ukraine.",
            "title_similarity": "0.70313394",
            "sentiment_compound": 0.7717
        },
        {
            "id": "hytli7b",
            "score": 4,
            "text": "Were these Turkish drones operated by Turkish military personnel...? Because that would be a serious escalation.",
            "title_similarity": "0.62439984",
            "sentiment_compound": -0.0772
        },
        {
            "id": "hytxn1t",
            "score": 4,
            "text": "Yes, I had a feeling the Turkish drones were making some difference. They made loads of difference in Azerbaijan, and we knew Turkey sent those drones even before the Russia war, so yeah I kinda had a feeling they had to be making some effect.",
            "title_similarity": "0.7099662",
            "sentiment_compound": 0.3405
        },
        {
            "id": "hyu0w6r",
            "score": -5,
            "text": "The same drones they were using against Armenia last year I'm sure. Hypocrites.",
            "title_similarity": "0.66312814",
            "sentiment_compound": 0.3182
        },
        {
            "id": "hyus3rf",
            "score": 5,
            "text": "This is cool and all until you realize that these Russian soldiers are fcuken kids told to do drills and practice at the border.",
            "title_similarity": "0.6198811",
            "sentiment_compound": 0.3182
        },
        {
            "id": "hyv38q3",
            "score": -4,
            "text": "[deleted]",
            "title_similarity": "-0.004056666"
        },
        {
            "id": "hytdj1e",
            "score": 33,
            "text": "Drones...more like Turkish delgiht!",
            "title_similarity": "0.40846997",
            "sentiment_compound": 0.4199
        },
        {
            "id": "hytu53v",
            "score": 38,
            "text": "It's an interesting coincidence that when the paradigm shifts happen in war and combat approaches, there is Turks in somewhere. Half of the war doctrine changes in history, there is Turks.\n\nA true warrior folk. Evil or not. I am glad to be a Turkey citizen. Only problems is, you know who...",
            "title_similarity": "0.6887856",
            "sentiment_compound": -0.9358
        },
        {
            "id": "hytuo4a",
            "score": 6,
            "text": "Drones scare the shit out of me. Small, hard to detect and hyper lethal. \n\nBut God bless the Turks for providing these in defense of Ukraine. Hopefully they provide a meaningful defense",
            "title_similarity": "0.7186512",
            "sentiment_compound": 0.9387
        },
        {
            "id": "hytq2e4",
            "score": 18,
            "text": "Good job Turkey, did they develop these on there own or after another nations drones?",
            "title_similarity": "0.654544",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hytr222",
            "score": 20,
            "text": "Russia being pimp-slapped by Turkish tech...that's gotta hurt. \n\nIf the same thing happened to US tech, it'd be embarrassing AF. I thought Russia was supposed to be in parity with us tech-wise. Or else...you know...Turkey is just that good?",
            "title_similarity": "0.60109425",
            "sentiment_compound": -0.4767
        },
        {
            "id": "hytqwzh",
            "score": -7,
            "text": "[deleted]",
            "title_similarity": "-0.004056666"
        },
        {
            "id": "hytruma",
            "score": 7,
            "text": "Turkey just got itself aligned closely with the West. \n\nLet’s see how Erdogan plays this one out…",
            "title_similarity": "0.37737387",
            "sentiment_compound": 0.25
        },
        {
            "id": "hytsy1v",
            "score": 7,
            "text": "Vladimir pooping",
            "title_similarity": "0.12800783",
            "sentiment_compound": 0.0
        },
        {
            "id": "hysv00c",
            "score": 65,
            "text": "Fantastic footage for r/combatfootage",
            "title_similarity": "0.33087546",
            "sentiment_compound": 0.5574
        },
        {
            "id": "hytctw0",
            "score": 7,
            "text": "Good kabap and good kaboom.",
            "title_similarity": "0.068602696",
            "sentiment_compound": 0.7003
        },
        {
            "id": "hytz0rr",
            "score": -9,
            "text": "This is not first use of these Turkish drones.  Please see the 2020 invasion of Artsakh by Azerbaijan.  5000 Armenian troops were killed as they defended their indigenous homeland  by these drones.",
            "title_similarity": "0.77399564",
            "sentiment_compound": -0.4939
        },
        {
            "id": "hyuaw0f",
            "score": 8,
            "text": "[deleted]",
            "title_similarity": "-0.004056666"
        },
        {
            "id": "hyubt0n",
            "score": -8,
            "text": "How nice of the Russians to group their tanks so closely. 🙄 Fake.",
            "title_similarity": "0.5145786",
            "sentiment_compound": -0.0772
        },
        {
            "id": "hyufv4t",
            "score": -8,
            "text": "Why is there no image AFTER the strike. This looks like a fake to me. If they wanted to show something they would show the aftereffects - otherwise it's just a light show. Plus, these look like trucks.",
            "title_similarity": "0.4186223",
            "sentiment_compound": -0.2023
        },
        {
            "id": "hyuo6bk",
            "score": -8,
            "text": "Never happened",
            "title_similarity": "-0.054824427",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyvumea",
            "score": -8,
            "text": "Drones was lost before. Thats neeed understand. Ukraine can says anythings. Realy stay only combatants, light armored vehicles, rifles, a little bit tanks...and FoxtrotUniformCharlieKilo UNSO. \nFACHISM MUST DIE\nVietnam\nYgoslavia\nAfganistan\nIraq\nLibia\nSyria\nUkraine\nAnd this list can goes on endlessly.\nThink, think a head.",
            "title_similarity": "0.67720693",
            "sentiment_compound": -0.7865
        },
        {
            "id": "hytqy1v",
            "score": 9,
            "text": "Begun, the drone wars have...",
            "title_similarity": "0.5255319",
            "sentiment_compound": -0.5574
        },
        {
            "id": "hyua506",
            "score": 9,
            "text": "ITS NOT A CONFLICT ITS A WAR U FUCKING DUMB PIECES OF SHIT. MY FAMILY IS GOING TO DIE YOU IMBECILES",
            "title_similarity": "0.450125",
            "sentiment_compound": -0.9329
        },
        {
            "id": "hyufz7g",
            "score": -8,
            "text": "Same drones the Turkish gov supplied to Azerbaijan a year ago when they invaded the tiny country of Armenian and killed many civilians and children.",
            "title_similarity": "0.72338283",
            "sentiment_compound": -0.6705
        },
        {
            "id": "hyuq200",
            "score": 9,
            "text": "Apparently Turkey has the best drone tech in the world lol, Ukraine you got got this! Keep up the good fight and hold the line",
            "title_similarity": "0.67167234",
            "sentiment_compound": 0.8221
        },
        {
            "id": "hyt0cql",
            "score": 10,
            "text": "This is the best tl;dr I could make, [original](https://www.businessinsider.com/ukraine-hypes-bayraktar-drone-as-videos-show-destroyed-russia-tanks-2022-2) reduced by 84%. (I'm a bot)\n*****\n> As Russia pounded Ukraine in the opening days of its invasion, the defenders credited a new piece of equipment with helping them fight back - the Bayraktar TB2 drone.\n\n> The Russian invasion of Ukraine represents the first outing in a major conflict for the Bayraktar, an armed drone with 12-meter wingspan and distinctive triangular tail section.\n\n> On Telegram, the popular channel run by the Ukrainian parliament shared both Bayraktar strike videos on Sunday, the first of which said &quot;Let&#039;s win together!&quot; and the second of which concluded &quot;Our army, our power!&quot;.\n\n\n*****\n[**Extended Summary**](http://np.reddit.com/r/autotldr/comments/t3lmwf/ukraine_credits_turkish_drones_with_eviscerating/) | [FAQ](http://np.reddit.com/r/autotldr/comments/31b9fm/faq_autotldr_bot/ \"Version 2.02, ~627500 tl;drs so far.\") | [Feedback](http://np.reddit.com/message/compose?to=%23autotldr \"PM's and comments are monitored, constructive feedback is welcome.\") | *Top* *keywords*: **video**^#1 **strike**^#2 **Bayraktar**^#3 **Ukrainian**^#4 **drone**^#5",
            "title_similarity": "0.8512796",
            "sentiment_compound": 0.9508
        },
        {
            "id": "hyudjox",
            "score": 9,
            "text": "Hooray for Turkey! Those dudes are having a tough economy right now and yet they stepped up to the plate!",
            "title_similarity": "0.49350938",
            "sentiment_compound": 0.5242
        },
        {
            "id": "hyusu1a",
            "score": -9,
            "text": "[removed]",
            "title_similarity": "-0.052017674"
        },
        {
            "id": "hysyndm",
            "score": 536,
            "text": "I understand that US drones are better than these, but what makes up that difference between a 137m dollar US drone and a 5m Turkish drone?",
            "title_similarity": "0.47432154",
            "sentiment_compound": 0.2382
        },
        {
            "id": "hyufng1",
            "score": -11,
            "text": "Every American Needs to Read this Statement by the Russian Foreign Ministry before things reach the point of no return\n\n\"MOSCOW, February 28 Russian Foreign Ministry Spokeswoman Maria Zakharova expressed confidence on Monday that experiments of NATO and Western public’s staying mum on the situation in Donbass resulted in a humanitarian and political disaster in Europe.\n\n'NATO’s experiments and the deafening silence of the Western public - these are the reasons behind the humanitarian and political disaster in Europe. An end was to be put to this, since the West refused to conduct any negotiations whatsoever and welcomed aggressive statements and direct threats of Kiev puppets towards Russia,' the diplomat wrote.\n\n'Russia did not launch a war, it is ending it,' Zakharova stressed. 'Throughout these years, the Russian side was urging the global community to stand against the consistent annihilation of the Donbass population. 'These are millions of people, who were losing their loved ones every day, living in basements to flee the shelling,' she added.\n\n'Where were all these countries and their public during these eight years that the war continued, and how did they condemn the killing of at least 13,000 people throughout these years?' the diplomat asked.\n\n'None among those who are \"yelling now\" in \"civilized countries\" has ever rallied to support the population of Donetsk and Lugansk with the demand to stop bloodshed, she stressed. 'The world was silent. 'Submissive silence of the global community and their disregard for the bloody catastrophe resulting from the anti-constitutional coup in Ukraine in 2014, staged with the direct participation of the US, the EU, Germany, Poland, Lithuania, Estonia, Latvia and other NATO countries, simply encouraged the Kiev regime to continue to destroy their own population,' Zakharova stressed.\"",
            "title_similarity": "0.6326139",
            "sentiment_compound": -0.9889
        },
        {
            "id": "hytpsei",
            "score": 12,
            "text": "Unfortunately, I believe that Ukraine has less than a dozen of these in operation.\n\nRussia sending in columns of armor and support on paved roadways in single file columns before establishing air superiority is madness.",
            "title_similarity": "0.6022322",
            "sentiment_compound": -0.0516
        },
        {
            "id": "hythxvn",
            "score": 13,
            "text": "Weren't they used in the Azerbaijan and Armenian conflict two years ago?",
            "title_similarity": "0.42712882",
            "sentiment_compound": -0.3182
        },
        {
            "id": "hyu2awc",
            "score": 12,
            "text": "Bayraktar is also one of the coolest sounding names",
            "title_similarity": "0.08664026",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyt1z05",
            "score": 677,
            "text": "Ya know, those Turkish drones are VERY effective, but if the Ukrainians wanted to(for anti-personnel work) they could strap some munitions on some Inspire 2’s/ mavic 2 pros/phantom 4’s, fly them right into Russian troops. Aerial suicide bombers..",
            "title_similarity": "0.81121707",
            "sentiment_compound": 0.0933
        },
        {
            "id": "hytd30k",
            "score": 127,
            "text": "I am very glad that Ukraine is able to defend itself, but at the same time footage like this makes me sad/uncomfortable because I can only imagine that inside those tanks are teenagers/young adults who might not even know what they're getting themselves in to.  It's easy to see it as just blowing up machines without thinking of the human cost.  Putin is an insane POS that is causing so much unnecessary suffering!\n\nNow, if those are troops that know what they're doing and are ok with it, then I'm 100% fine with blowing them all to hell.",
            "title_similarity": "0.6005215",
            "sentiment_compound": -0.5486
        },
        {
            "id": "hyt1p5k",
            "score": 165,
            "text": "Soooo besides Belarus, who is gonna support Russia in this world war?",
            "title_similarity": "0.48505116",
            "sentiment_compound": -0.296
        },
        {
            "id": "hythfud",
            "score": 14,
            "text": "SLAVA UKRAINI",
            "title_similarity": "0.08174896",
            "sentiment_compound": 0.0
        },
        {
            "id": "hysup75",
            "score": 1568,
            "text": "I didn't expect Turkish technology/weapons to play a major part in this conflict. I always thought the US was the leader when it comes to drone technology.",
            "title_similarity": "0.54041815",
            "sentiment_compound": -0.058
        },
        {
            "id": "hytwx8u",
            "score": 18,
            "text": "Who would win: \n\n- former superpower \n\n- one propeller boi",
            "title_similarity": "0.32488233",
            "sentiment_compound": 0.5859
        },
        {
            "id": "hyt4vop",
            "score": 19,
            "text": "Imagine if the afghans decided to go for payback on Russia lol",
            "title_similarity": "0.5377034",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hyszhjx",
            "score": 55,
            "text": "Good. Light 'em up.",
            "title_similarity": "-0.07502459",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hytgxbw",
            "score": 89,
            "text": "Bayraktar means \"flag bearer\" in Turkish. So far they have lived up to their name.",
            "title_similarity": "0.29335916",
            "sentiment_compound": 0.0
        },
        {
            "id": "hytu60r",
            "score": -22,
            "text": "Ukraine is to blame for the aggression against itself. Ukraine's accession to NATO is a threat to Russia's national security. And also, the war in the DPR and the PRC, which lasted for 8 years, is a big blow to Russia, because peaceful Russian people died there at the hands of the Ukrainian military. I am absolutely against this war, but the best outcome will be the speedy victory of Russia and the complete demilitarization of Ukraine, because this minimizes the number of victims.",
            "title_similarity": "0.676082",
            "sentiment_compound": -0.2089
        },
        {
            "id": "hytxqmj",
            "score": 21,
            "text": "This is Erdogan’s revenge for Syria.",
            "title_similarity": "0.42886865",
            "sentiment_compound": -0.5267
        },
        {
            "id": "hyttr8n",
            "score": 23,
            "text": "TFW Turkey is outflexing Russia militarily.",
            "title_similarity": "0.6117865",
            "sentiment_compound": 0.0
        },
        {
            "id": "hytuwwh",
            "score": 25,
            "text": "These same drones won Azerbaijan there war against Armenia I believe",
            "title_similarity": "0.70858675",
            "sentiment_compound": -0.0516
        },
        {
            "id": "hyt37md",
            "score": 196,
            "text": "The drone Manufacturer will totally use footage of this war to sell their stuff.",
            "title_similarity": "0.6788317",
            "sentiment_compound": -0.6833
        },
        {
            "id": "hysudgo",
            "score": 679,
            "text": "Some Ottomans are fist pumping in their graves",
            "title_similarity": "0.3808216",
            "sentiment_compound": -0.296
        },
        {
            "id": "hytqool",
            "score": 27,
            "text": "Congrats to Putin for showing other nations they need to work together though.",
            "title_similarity": "0.4284249",
            "sentiment_compound": 0.5267
        },
        {
            "id": "hytsgiw",
            "score": 31,
            "text": "When a drone is shooting your mobile SAM launchers from directly above you, your army is terrible.",
            "title_similarity": "0.62349343",
            "sentiment_compound": -0.4767
        },
        {
            "id": "hyt5lg3",
            "score": 728,
            "text": "Those Turkish drones have been used before Libya, Syria, and even the disputed southern Ukrainian areas.   Iirc some Libyan rebel supply column got decimated on autonomous mode.. \n\nIf Turkey has those, wonder what the even more sophisticated powers have?   Think one result of this war will be more missiles and autonomous systems below ICBM/SLBM.",
            "title_similarity": "0.7981807",
            "sentiment_compound": -0.5764
        },
        {
            "id": "hyu5yka",
            "score": 33,
            "text": "Where are all the kick out Turkey from NATO crowds now?!!! Yeah, swallow your pride.",
            "title_similarity": "0.5910789",
            "sentiment_compound": 0.6679
        },
        {
            "id": "hytdd6e",
            "score": 213,
            "text": "Ended the Tank Wars have.\n\nBegun the Drones Wars have.",
            "title_similarity": "0.56477475",
            "sentiment_compound": -0.802
        },
        {
            "id": "hytcnry",
            "score": 38,
            "text": "That Azerbaijin-Armenia conflict was the testing geound for these types of strategies",
            "title_similarity": "0.42267814",
            "sentiment_compound": -0.3182
        },
        {
            "id": "hysyn5h",
            "score": 4860,
            "text": "Watching a lot of this footage really makes me feel that the era of the tank being the main force on the battlefield is long over.\n\nFirst time I had this thought was that road of destroyed Iraqi tanks by US bombing.  Was that A-10s or F-15s?\n\nHell you don’t even need jets anymore more.  Just dudes with Javelins or fucking flying robots.",
            "title_similarity": "0.73664236",
            "sentiment_compound": -0.886
        },
        {
            "id": "hyt2qq8",
            "score": 52,
            "text": "[deleted]",
            "title_similarity": "-0.0040566437"
        },
        {
            "id": "hysvrxo",
            "score": 1095,
            "text": "These drones were used extensively in both Azerbaijan and Syria.  I would call Syria a major conflict.",
            "title_similarity": "0.61971986",
            "sentiment_compound": -0.3804
        },
        {
            "id": "hytg5yq",
            "score": 141,
            "text": "My favorite ones are kamikaze drones ''Kargu''. They're very small. They have AI. They target enemies automatically, dive and explode. \n\nhttps://youtu.be/-P56pOLPnGA?t=115",
            "title_similarity": "0.55188745",
            "sentiment_compound": -0.0516
        },
        {
            "id": "hyt6fnx",
            "score": 364,
            "text": "Send them more drones please",
            "title_similarity": "0.28664005",
            "sentiment_compound": 0.3774
        },
        {
            "id": "hytu9b5",
            "score": 71,
            "text": "Always rate Turkey. Great drones and great kebabs.",
            "title_similarity": "0.47582674",
            "sentiment_compound": 0.8481
        },
        {
            "id": "hyt2jhv",
            "score": 2169,
            "text": "It would be really great if Ukraine could get say another 50-100 of these drones by tomorrow. Just saw Japan is giving Ukraine $200 million USD. From my understanding that would buy 40 drones alone. Turn that 17 mile long convoy into swiss cheese.",
            "title_similarity": "0.5958386",
            "sentiment_compound": 0.6997
        },
        {
            "id": "hysv2lb",
            "score": 5010,
            "text": " used extensively by Azerbaijan , or was that not considered a major conflict ?",
            "title_similarity": "0.33854645",
            "sentiment_compound": -0.3804
        },
        {
            "id": "hyu1c45",
            "score": 333,
            "text": "Turkey, for years has been contesting russian influence everywhere possible. In Libya, Syria, Caucasus and to some extent the central asian turkic republics. \n\nThe Libyan Civil War was going on for years since Ghaddafis fall. Hafters forces were trying to take Tripolis for years from the UN recognized government by besieging and attacking it for months, backed by Russia and its Wagner mercenaries, France and other allies of the West like Egypt and the UAE. Only when Turkey intervened with its UAVs, advisors, mercenaries and other stuff, the advance of hafters forces came to a halt  and they even lost territories to the government forces curbing russian influence there. Suddenly the West was like 'we have to stop the civil war and the influx of foreign fighters and weapons' years after the start of this war. \n\nIn Syria, Turkey was urging EU, Nato and the UN right from the start to implement a no fly zone in the north even saying it would put boots on the ground when no other country was willing to. After that Russia and Iran expanded their influence, millions of refugees fled to Turkey and Europe and other neighboring countries. When Turkey shot down a russian fighter jet, NATO allies pulled out their Patriot Systems and were like its got nothing to do with us. That is the reason Turkey had to balance the relationship with Russia, while fighting for influence and cooperating where they could, finding compromises so as to not escalate things in to a full blown war. Also many economic reasons like tourism and gas Imports. This is realpolitik, Turkey has been doing pretty good on its own while NATO allies have been supporting the YPG right on its borders and even sanctioning Turkey directly.\n\nAnd dont start talking about reasons like authorianism of Erdogan while being allied to states like Saudi Arabia, UAE and Egypt, selling tons of Weapons to them. Also killing thousands of civilians in Afghanistan, Iraq and other countries around the globe for decades.\n\nSince the annexation of Crimea by Russia, Turkey has been supporting Ukraine diplomatically and also by selling tons of weapons like UAVs and even Warships, while other countries until just 5 days ago were reluctant to send any lethal weapons.",
            "title_similarity": "0.64255196",
            "sentiment_compound": -0.9653
        },
        {
            "id": "hytuick",
            "score": 1690,
            "text": "Turkey is one hell of an ally, they are like the joker card in geo-politics.",
            "title_similarity": "0.51747465",
            "sentiment_compound": -0.3818
        },
        {
            "id": "hyszg5z",
            "score": 698,
            "text": "Now lets see those drones fuck up that 3 mile long convoy and make it turn around.",
            "title_similarity": "0.6113763",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hyt9zy9",
            "score": 343,
            "text": "[deleted]",
            "title_similarity": "-0.0040566437"
        },
        {
            "id": "hyt48ep",
            "score": 164,
            "text": "There has always been a lot of bad feelings between the Turkish Government and Russian Government do I'm not surprised they are taking advantage to get a few digs in lol",
            "title_similarity": "0.56600434",
            "sentiment_compound": -0.0941
        },
        {
            "id": "hyszmle",
            "score": 9541,
            "text": "I have a feeling Turkey will have a lot of new orders for them drones soon.",
            "title_similarity": "0.55153227",
            "sentiment_compound": 0.128
        },
        {
            "id": "hyt5rpo",
            "score": 8899,
            "text": "There was a podcast two weeks ago that said these these Turkish drones were going to be the tipping point that forces Putin to act. They were so effective in late 2021 against the Russians in the occupied parts of Ukraine that Putin realised he wouldn't be able to hold Lugansk and Donetsk.",
            "title_similarity": "0.7676268",
            "sentiment_compound": 0.6113
        },
        {
            "id": "hyti7ml",
            "score": 937,
            "text": "I remember seeing 2 Turkish A400's landing at a Kiev airport right before the invasion started, probably dropped off additional drones/operators.",
            "title_similarity": "0.74019694",
            "sentiment_compound": 0.0
        },
        {
            "id": "hysybc9",
            "score": 1,
            "text": "While humming Bad Motor Scooter, Montrose. \n\n[https://www.youtube.com/watch?v=\\_B2XJsKUtjQ&ab\\_channel=Montrose-Topic](https://www.youtube.com/watch?v=_B2XJsKUtjQ&ab_channel=Montrose-Topic)",
            "title_similarity": "0.40849236",
            "sentiment_compound": -0.594
        },
        {
            "id": "hyt5xa9",
            "score": 2,
            "text": "Gotta get out practicing with that quadcopter",
            "title_similarity": "0.43483186",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyt625y",
            "score": 22,
            "text": "These drone already proved themselves a short while ago in the armenia azeri war.",
            "title_similarity": "0.6443263",
            "sentiment_compound": -0.5994
        },
        {
            "id": "hyt6sdw",
            "score": 1,
            "text": "How much is one of the Turkish drones?",
            "title_similarity": "0.47139692",
            "sentiment_compound": 0.0
        },
        {
            "id": "hytczf5",
            "score": 7,
            "text": "Honest question: does Russia not have any combat drone capabilities?",
            "title_similarity": "0.47608304",
            "sentiment_compound": 0.6526
        },
        {
            "id": "hytdejk",
            "score": 4,
            "text": "I know it would be an escalation but having one of these nail Putin's palace or yacht would be hitting him where it hurts.\n\nI don't think he gives a single damn for all of the Russian youth he's sending into battle for himself and his cronies that are behind him.",
            "title_similarity": "0.51489",
            "sentiment_compound": -0.9022
        },
        {
            "id": "hytf35q",
            "score": 7,
            "text": "A-10s are iconic and awesome but if you can do the same thing with drones….",
            "title_similarity": "0.43232405",
            "sentiment_compound": 0.3716
        },
        {
            "id": "hyth5bw",
            "score": 1,
            "text": "It is prudent for all possible parties, including Turkey, to weigh the risk/benefit ratio before any actions are offered or accepted. “DO look a gift horse in the mouth”. If support is offered what strings are attached?",
            "title_similarity": "0.42772758",
            "sentiment_compound": 0.8555
        },
        {
            "id": "hyth65e",
            "score": 1,
            "text": "Biden should give a few Reaper drones to Ukraine. Imagine what they could do to the Russians with those.",
            "title_similarity": "0.71983576",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyti33j",
            "score": 1,
            "text": "Would be really nice if they had a few more to decimate that 27km convoy converging on Kiev.",
            "title_similarity": "0.583222",
            "sentiment_compound": 0.4754
        },
        {
            "id": "hytj18r",
            "score": 1,
            "text": "Curious.  What is the control system for drones?  Could the communications be jammed/interfered with somehow?\n\nJust wondering if this is truly the future of aerial military tech or if it is just niche because of potential countermeasures.",
            "title_similarity": "0.4854895",
            "sentiment_compound": 0.6767
        },
        {
            "id": "hytjjj1",
            "score": 1,
            "text": "It’s time to light up the whole convoy",
            "title_similarity": "0.17053372",
            "sentiment_compound": 0.0
        },
        {
            "id": "hytjt1p",
            "score": 1,
            "text": "Hey u/slabnasium is this fake?",
            "title_similarity": "0.12752286",
            "sentiment_compound": -0.561
        },
        {
            "id": "hytks1c",
            "score": 1,
            "text": "Can’t be",
            "title_similarity": "-0.118189536",
            "sentiment_compound": 0.0
        },
        {
            "id": "hytks3b",
            "score": 6,
            "text": "This shows the breadcrumbs of future warfare. Tanks are obsolete. Behold the dawn of drone warfare!",
            "title_similarity": "0.56736344",
            "sentiment_compound": -0.7088
        },
        {
            "id": "hytl1n9",
            "score": 1,
            "text": "Wonder if Russia will disable the S-400 they sold Turkey now.",
            "title_similarity": "0.66295576",
            "sentiment_compound": 0.0
        },
        {
            "id": "hytlpv1",
            "score": 1,
            "text": "This wasn't the product placement marketing tactic I would have expected, but it works well!",
            "title_similarity": "0.1566444",
            "sentiment_compound": 0.4482
        },
        {
            "id": "hytmaeb",
            "score": 5,
            "text": "These were the same drones the turned the tide of the conflict in Ethiopia as well. These drones are becoming quite popular.",
            "title_similarity": "0.506544",
            "sentiment_compound": 0.4391
        },
        {
            "id": "hytmbdh",
            "score": 4,
            "text": "Serious question, so here’s Putin right, and suddenly the seeming underdog turned out to be a kungfu master kicking his ass beyond all reason. With this addition, wouldn’t Putin be inclined to drop a tacticle nuke on Kiev or Charkiv? Seems like a serious message to send by someone that’s losing so much he has nothing else to lose?",
            "title_similarity": "0.516312",
            "sentiment_compound": -0.6599
        },
        {
            "id": "hytmfys",
            "score": 30,
            "text": "The publicity worked well for the French and their Exocet missiles. Turkey will be getting a lot of orders.",
            "title_similarity": "0.5205054",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hytmmy4",
            "score": 12,
            "text": "Like Mike Tyson said...everybody has a plan until the first fist to the face.",
            "title_similarity": "0.41608584",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hytmxfe",
            "score": 1,
            "text": "I dont understand how Ukraine is in a position to use these drones on the Convoy, is it that Russia isn't protecting them properly?",
            "title_similarity": "0.55901897",
            "sentiment_compound": 0.0
        },
        {
            "id": "hytn0z0",
            "score": 1,
            "text": "TB2 > the likes of A-10 and Su-25.",
            "title_similarity": "0.34395817",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hytn9mf",
            "score": 1,
            "text": "[deleted]",
            "title_similarity": "-0.004056666"
        },
        {
            "id": "hytncac",
            "score": 1,
            "text": "Thanks to putin",
            "title_similarity": "0.25903982",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hytnqj7",
            "score": 14,
            "text": "I love that it's attacking what is ostensibly an anti-aircraft machine.\n\nlike bro, you had 1 job.",
            "title_similarity": "0.6087673",
            "sentiment_compound": 0.5719
        },
        {
            "id": "hyto7o6",
            "score": 1,
            "text": "wonder how fast turkey can supply even more....",
            "title_similarity": "0.38551593",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyto80f",
            "score": 2,
            "text": "The drones need to target those thermobaric weapons before they're unleashed.",
            "title_similarity": "0.54578847",
            "sentiment_compound": -0.4404
        },
        {
            "id": "hytoeyb",
            "score": 1,
            "text": "Cant wait for the time when nations just use drones for combat instead of humans. \n\nWars would become like chess, if you win the war, you get the nation.",
            "title_similarity": "0.5802027",
            "sentiment_compound": -0.5574
        },
        {
            "id": "hytos51",
            "score": 7,
            "text": "War is a perpetual rock-paper-scissors.\n\nMy Turkish drones (carrying armor-penetrating smart missiles) beat your armored Russian tanks.\n\nI'm liking what a shit show this is turning out to be for Putin.\n\nI just hope that he doesn't become even more unhinged and orders nuclear weapons used on Ukraine or a NATO nation.  \n\nIt's all fun and games playing a proxy war and supplying Ukraine with weapons (which are both morally correct things to do in this situation) until the short petulant man child decides to deploy one or more nukes on you.  Putin is isolated and growing desperate.  Either this does not end well for him or for the world at large.",
            "title_similarity": "0.76976043",
            "sentiment_compound": -0.8595
        },
        {
            "id": "hytotyu",
            "score": 2,
            "text": "Remember to save photos and footage of all Russian operatives for record and retribution.",
            "title_similarity": "0.5134778",
            "sentiment_compound": 0.4939
        },
        {
            "id": "hytowxv",
            "score": 1,
            "text": "I find it hard to believe molotov cocktails can kill a tank unless with a very lucky hit. I think the professional weapons supplied by the west over recent years are what's proving particularly lethal against an underwhelming Russian force.",
            "title_similarity": "0.6658902",
            "sentiment_compound": -0.7102
        },
        {
            "id": "hytp29f",
            "score": 6,
            "text": "From the footage it doesn’t look like the Russians have any (or little ) air defence to protect their convoys. These drones look like they can drop payloads “at will” and no missiles coming back their way.",
            "title_similarity": "0.4993464",
            "sentiment_compound": 0.5325
        },
        {
            "id": "hytp8lv",
            "score": 1,
            "text": "And now they also have Turkey's S400 system. Lol",
            "title_similarity": "0.4174372",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hytp9iu",
            "score": 1,
            "text": "First use in major conflict? What about Syria, Libya and Arzakh?",
            "title_similarity": "0.41465998",
            "sentiment_compound": -0.4503
        },
        {
            "id": "hytpck7",
            "score": 1,
            "text": "I would have really thought that Russian mobile AA would have done better against these.\n\nDoes anyone know the reasons for the lack of effectiveness? Are these drones particularly stealthy to Russia defenses?",
            "title_similarity": "0.563001",
            "sentiment_compound": 0.3109
        },
        {
            "id": "hytpo4w",
            "score": 1,
            "text": "Are they doing this to the big convoy?",
            "title_similarity": "0.2932213",
            "sentiment_compound": 0.0
        },
        {
            "id": "hytpp7k",
            "score": 1,
            "text": "Turkey & Russia have a long history. The Crimean war started between them, before sucking in many others.",
            "title_similarity": "0.5711602",
            "sentiment_compound": -0.5994
        },
        {
            "id": "hytppzs",
            "score": 11,
            "text": "I heard Turkish drones are pretty good and battle tested over Syria and Iraq.",
            "title_similarity": "0.7151679",
            "sentiment_compound": 0.5423
        },
        {
            "id": "hytpqv9",
            "score": 1,
            "text": "Always looking for French podcasts or audiobooks and I didn’t know about all these slate ones! Thanks!",
            "title_similarity": "0.3786443",
            "sentiment_compound": 0.5399
        },
        {
            "id": "hytque3",
            "score": 3,
            "text": "The ancient Turkish vs Russian conflict enters a new era.",
            "title_similarity": "0.4475581",
            "sentiment_compound": -0.3182
        },
        {
            "id": "hytqvsk",
            "score": 6,
            "text": "Not first. Used extensively in nagornonkarabach no?",
            "title_similarity": "0.1541745",
            "sentiment_compound": 0.0
        },
        {
            "id": "hytqvui",
            "score": 26,
            "text": "Nice one Turkey, send more!",
            "title_similarity": "0.36593914",
            "sentiment_compound": 0.4753
        },
        {
            "id": "hytqzbu",
            "score": 1,
            "text": "\nHey /u/Parking_Web,\n\n\nThis is now the top post on reddit. It will be recorded at /r/topofreddit with all the other top posts.",
            "title_similarity": "0.41358787",
            "sentiment_compound": 0.3818
        },
        {
            "id": "hytr7ms",
            "score": 19,
            "text": "They were extremely effective in destroying Russian equipment in Libya and that is a major war with far more countries involved than this one.",
            "title_similarity": "0.6870956",
            "sentiment_compound": -0.6872
        },
        {
            "id": "hytr7rp",
            "score": 1,
            "text": "The context of the word eviscerating is tremendously satisfying",
            "title_similarity": "0.15521942",
            "sentiment_compound": 0.5095
        },
        {
            "id": "hytr81n",
            "score": 9,
            "text": "the era of the tank is slowly coming to a close. i genuinely do not know if that is ultimately good or bad",
            "title_similarity": "0.08634475",
            "sentiment_compound": -0.1531
        },
        {
            "id": "hytre2e",
            "score": 10,
            "text": "Absolutely insane that Russia has not achieved complete air superiority at this point. Really shows there must be huge issues in the Russian military, this goes beyond simple overconfidence.",
            "title_similarity": "0.48776993",
            "sentiment_compound": 0.1796
        },
        {
            "id": "hytrfna",
            "score": 1,
            "text": "I hope we will use it through to pkk camps.",
            "title_similarity": "0.34942722",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hytrlne",
            "score": 3,
            "text": "Big bada boom",
            "title_similarity": "0.14111383",
            "sentiment_compound": 0.0
        },
        {
            "id": "hytrqak",
            "score": 2,
            "text": "great, i wonder if its the same drones they let Azeri forces use on Armenia.",
            "title_similarity": "0.58483744",
            "sentiment_compound": 0.6249
        },
        {
            "id": "hytrrhl",
            "score": 1,
            "text": "Is there any footage of this?",
            "title_similarity": "-0.036247306",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyts36t",
            "score": 29,
            "text": "The Turkish delight",
            "title_similarity": "0.24552718",
            "sentiment_compound": 0.5994
        },
        {
            "id": "hytsdpk",
            "score": 1,
            "text": "Any Person that sees this footage surrenders.\n\n10-50 lifes gone in a second.",
            "title_similarity": "0.2909274",
            "sentiment_compound": 0.0
        },
        {
            "id": "hytsect",
            "score": 2,
            "text": "It is worth mentioning that some messaging out of Russia said that countries providing lethal aid to Ukraine would be held accountable if those tools were used on Russians. Not that what they say or think fucking matters at this point.  \n\nFuck Putin.",
            "title_similarity": "0.6408843",
            "sentiment_compound": -0.2975
        },
        {
            "id": "hytsint",
            "score": 3,
            "text": "How wonderful to see these cocksuckers bombing. :)",
            "title_similarity": "0.43681234",
            "sentiment_compound": 0.4767
        },
        {
            "id": "hytskv5",
            "score": 3,
            "text": "Good. There’s another 3 mile long convoy coming that they can practice on. Too bad we can’t send them 6 or 8  A-10’s.",
            "title_similarity": "0.4511632",
            "sentiment_compound": -0.1531
        },
        {
            "id": "hytspu2",
            "score": 2,
            "text": "Tanks are going to be obsolete soon.",
            "title_similarity": "0.18039757",
            "sentiment_compound": -0.296
        },
        {
            "id": "hytsth0",
            "score": 1,
            "text": "Gottem!",
            "title_similarity": "0.03128264",
            "sentiment_compound": 0.0
        },
        {
            "id": "hytsvvj",
            "score": 2,
            "text": "I wish we could give them predators so badly",
            "title_similarity": "0.31748968",
            "sentiment_compound": -0.3163
        },
        {
            "id": "hytte45",
            "score": 1,
            "text": "This could be used as a textbook lecture on word of mouth.",
            "title_similarity": "0.20130862",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyttel5",
            "score": 1,
            "text": "https://imgur.com/a/uT9NQGW",
            "title_similarity": "0.11728354",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyttiqt",
            "score": 2,
            "text": "Oh, so IT trumps Heavy metal.\n\nWho would have guessed the tools of the next technological age would render the previous age of technologies weapons obsolete.\n\n&#x200B;\n\nObviously everyone would think that.",
            "title_similarity": "0.48355603",
            "sentiment_compound": -0.6249
        },
        {
            "id": "hyttm4a",
            "score": 1,
            "text": "I wonder if I can get a model of this drone... hmmm",
            "title_similarity": "0.31782234",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyttv1b",
            "score": 68,
            "text": "5 star product, quick delivery, would buy again.",
            "title_similarity": "0.16103713",
            "sentiment_compound": 0.0
        },
        {
            "id": "hytu2w0",
            "score": 1,
            "text": "I think the guy who built it is a son of a rich guy who went to MIT, came back to Turkey and built a drone using COTS parts. The engine was purchased from an EU country and should have been used for civilian purposes only I believe.  Not sure if the found a new supplier for the engines.",
            "title_similarity": "0.6548604",
            "sentiment_compound": 0.3895
        },
        {
            "id": "hytu458",
            "score": 1,
            "text": "Turkey should close the straits",
            "title_similarity": "0.38710052",
            "sentiment_compound": 0.0
        },
        {
            "id": "hytu4dj",
            "score": 1,
            "text": "Can we please see a similar video for that 3.5 mile Russian convoy headed to Kyiv? Anyone have an updated on that convoy?",
            "title_similarity": "0.496064",
            "sentiment_compound": 0.3939
        },
        {
            "id": "hytu8k1",
            "score": 5,
            "text": "Ukraine just told Russia “we are using the weapons they are sending” and specifically trapped Turkey. If Putin was serious about his threat, Turkey can expect a response shortly.",
            "title_similarity": "0.75278467",
            "sentiment_compound": -0.875
        },
        {
            "id": "hytuema",
            "score": 2,
            "text": "Is there any chance for an internal attempt at ousting Putin? You'd think with how unpopular this invasion is that it would be the perfect time to make a move against him.  Does Putin really have almost 100% support from the higher ups?",
            "title_similarity": "0.505988",
            "sentiment_compound": 0.8167
        },
        {
            "id": "hytuk8k",
            "score": 2,
            "text": " links to the examples\n\n[https://www.youtube.com/watch?v=nyVmySTUkxs](https://www.youtube.com/watch?v=nyVmySTUkxs)\n\nUkrainian Drone Missile Attack on Russian Army Convoy. Bayraktar TB 2 in Action.\n\n[https://www.youtube.com/watch?v=TdTGT1dLSKA](https://www.youtube.com/watch?v=TdTGT1dLSKA)\n\nUkraine War - Ukrainian Bayraktar TB2 Drones Destroy Russian Convoys",
            "title_similarity": "0.7594118",
            "sentiment_compound": -0.9092
        },
        {
            "id": "hytulx7",
            "score": 1,
            "text": "So does Russia not have drones?",
            "title_similarity": "0.3770644",
            "sentiment_compound": 0.0
        },
        {
            "id": "hytum9y",
            "score": 1,
            "text": "Russia has some pretty scary mobile missile systems. Can the Turkish TB2's be used to take those out?",
            "title_similarity": "0.7047134",
            "sentiment_compound": 0.0
        },
        {
            "id": "hytunnx",
            "score": 12,
            "text": "Ukraine/Turkey: Fuck around and find out.",
            "title_similarity": "0.51360637",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hytuu0s",
            "score": 2,
            "text": "tanks need air supremacy, which may not be possible in drone-enabled modern warfare.\n\nand as we are seeing, they also require a ton of support. their required maintenance and support also very vulnerable to drones. them big tanker trailers go up fwoosh.\n\nfascinating, and morbid, and horrible.",
            "title_similarity": "0.5621269",
            "sentiment_compound": 0.2975
        },
        {
            "id": "hytuupc",
            "score": 1,
            "text": "So Turkey being a NATO member has given direct assistance to Ukraine. Russia has already announced dire consequences for anyone providing assistance. Will that be the tipping point to have a NATO member attacked and bring everyone into the conflict?",
            "title_similarity": "0.72411245",
            "sentiment_compound": -0.8074
        },
        {
            "id": "hytuuw1",
            "score": 2,
            "text": "[Coming to a war zone near you!! ](https://youtu.be/3XpImo80neo)",
            "title_similarity": "0.4184605",
            "sentiment_compound": -0.6688
        },
        {
            "id": "hytuvdx",
            "score": 6,
            "text": "Turkish Drones are very effective. See Ethiopia turning the tide of civil war with rebels at the doorstep of addis ababa following the sale of a dozen drones to The Federal Government",
            "title_similarity": "0.7906218",
            "sentiment_compound": -0.3197
        },
        {
            "id": "hytuvva",
            "score": 12,
            "text": "I remember reading somewhere when this all started that Russias army was really going to struggle despite reputation and size because their tech is so far behind that they don’t have answers for some modern weapons. I guess this is evidence of that theory. \n\nIt’s amazing to think that all these mega weapons we’ve had for decades, the most fearsome machines man creates, can be booped out of existence by the military version of something you can by on Amazon for a hundred bucks. Blows my mind. \n\nI’m no war expert, but I’m starting to think tech is getting so advanced we’re gonna see a world soon where wars are fought without soldiers. Which is wild. And terrifying",
            "title_similarity": "0.5995187",
            "sentiment_compound": -0.8952
        },
        {
            "id": "hytv3pj",
            "score": 3,
            "text": "If Turky has an arsenal of these, what's to stop them from dropping mana from the sky? How would Russia know the difference?",
            "title_similarity": "0.4774257",
            "sentiment_compound": -0.3736
        },
        {
            "id": "hytva1t",
            "score": 24,
            "text": "Putin, knowing he doesn’t have air superiority, is literally just sending his convoys in to get blown to pieces. Not only does he not give a fuck about Ukrainians lives, he clearly has no regard for his own Russian lives.",
            "title_similarity": "0.4706101",
            "sentiment_compound": 0.6956
        },
        {
            "id": "hytveug",
            "score": 12,
            "text": "First ? these exact drones are known to be very good at taking out Russian made SAM-systems\n\nhttps://www.oryxspioenkop.com/2021/12/a-monument-of-victory-bayraktar-tb2.html",
            "title_similarity": "0.75693625",
            "sentiment_compound": 0.4927
        },
        {
            "id": "hytvtcl",
            "score": 25,
            "text": "Turkish drones win wars",
            "title_similarity": "0.68958306",
            "sentiment_compound": 0.0516
        },
        {
            "id": "hytvv9g",
            "score": 15,
            "text": "Turks have been waiting to do this!! Woot!",
            "title_similarity": "0.34902874",
            "sentiment_compound": 0.6281
        },
        {
            "id": "hytvz6a",
            "score": 6,
            "text": "ELI5 Why doesn't Russia have air superiority, and blow the drones out of the sky? They have far more planes than Ukraine. Why aren't they using them more, and dominating the sky /combat. It seems weird.",
            "title_similarity": "0.6611375",
            "sentiment_compound": -0.4902
        },
        {
            "id": "hytw02q",
            "score": 8,
            "text": "Turkey, please send more.  Lots more.",
            "title_similarity": "0.35051456",
            "sentiment_compound": 0.3182
        },
        {
            "id": "hytw6cz",
            "score": 2,
            "text": "Is this the video of the image? \n\nhttps://youtu.be/m5zzvSgusN4",
            "title_similarity": "0.17698261",
            "sentiment_compound": 0.0
        },
        {
            "id": "hytw6gp",
            "score": 3,
            "text": "Ready player Ukraine!",
            "title_similarity": "0.29626748",
            "sentiment_compound": 0.4199
        },
        {
            "id": "hytwgn5",
            "score": 4,
            "text": "They were used by Azerbaijan against Armenia in 2020 and by Turkish-backed Libyan forces (and also by the Turks in Syria) so I don’t think this is their first use in a “major conflict”",
            "title_similarity": "0.56359804",
            "sentiment_compound": 0.0
        },
        {
            "id": "hytwhhb",
            "score": 2,
            "text": "Any bets that Boston Dynamics has paws on the ground in Ukraine?",
            "title_similarity": "0.50149053",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hytwp7g",
            "score": 2,
            "text": "How does someone determine authenticity on what's going on in Ukraine? There is so much information it's really hard to follow how well Ukraine is doing but I've found myself reading about it daily.",
            "title_similarity": "0.44899645",
            "sentiment_compound": 0.0525
        },
        {
            "id": "hytwumk",
            "score": 9,
            "text": "Russia took a 20th century army into a 21st century conflict. GG Putin.",
            "title_similarity": "0.5459305",
            "sentiment_compound": 0.1613
        },
        {
            "id": "hytwvmf",
            "score": 25,
            "text": "Thank you Turkey!!!",
            "title_similarity": "0.31181186",
            "sentiment_compound": 0.5229
        },
        {
            "id": "hytx072",
            "score": 2,
            "text": "Fish in a barrel. Russia is fighting like it’s still 1940.",
            "title_similarity": "0.46827495",
            "sentiment_compound": 0.0
        },
        {
            "id": "hytx4az",
            "score": 3,
            "text": "Unmanned machines will change the scope of war for the rest of humanity. Well until cyborg soldiers with brain hacking come about. The US uses drones for a substantial amount of its war efforts despite having elite soldiers. Ukraine is using a much cheaper model than the US uses and it’s still effective. Russia has powerful drones as well which I’m sure they use in combo with troops and their tanks. It’s a different world",
            "title_similarity": "0.7426667",
            "sentiment_compound": 0.5267
        },
        {
            "id": "hytx5tc",
            "score": 10,
            "text": "Never thought I would be thanking Turkey or Britain but hey, Putin has made us all friends I guess.",
            "title_similarity": "0.4820119",
            "sentiment_compound": 0.631
        },
        {
            "id": "hytx6s7",
            "score": 4,
            "text": "I’m not a military expert by any stretch of the imagination. It seems to me if you’re going to be fighting an asymmetric urban war, you probably don’t need to drive your vehicles in a miles long convoy. But what do I know",
            "title_similarity": "0.4117375",
            "sentiment_compound": -0.4939
        },
        {
            "id": "hytxm8q",
            "score": 1,
            "text": "Was that the 5 km long train of supplies Russia was sending?",
            "title_similarity": "0.37786606",
            "sentiment_compound": 0.0
        },
        {
            "id": "hytxs4r",
            "score": 15,
            "text": "Go Turks!",
            "title_similarity": "0.289694",
            "sentiment_compound": 0.0
        },
        {
            "id": "hytxzke",
            "score": 2,
            "text": "The elephant in the room is obviously Russia's nuclear arsenal... which is probably where most of their money and technology is spent in. I think they bluffed about their conventional capabilities but I don't think the nuclear arsenal is a bluff. I just hope the Russian government does an emergency stfu on the president, and tries to mend something after they lose the ground war vs the world's collective military technology.",
            "title_similarity": "0.64853406",
            "sentiment_compound": -0.8573
        },
        {
            "id": "hyty0rr",
            "score": 2,
            "text": "Could I get uhhhhhh Turkey Drone on rye please?",
            "title_similarity": "0.3819564",
            "sentiment_compound": 0.3182
        },
        {
            "id": "hyty1n3",
            "score": 14,
            "text": "Go Turkey !",
            "title_similarity": "0.33816004",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyty60g",
            "score": 4,
            "text": "Shh... that’s nobody’s business but the Turks.",
            "title_similarity": "0.3573386",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyty65i",
            "score": 2,
            "text": "It's like watching a real version of star wars, except darth vadar is an unintelligent, spineless fool.",
            "title_similarity": "0.37144017",
            "sentiment_compound": -0.7906
        },
        {
            "id": "hytycuh",
            "score": 2,
            "text": "Just to keep it real, they have like 20 of them. For comparison Russia fields 420 attack helicopters. Then there's the jets etc.  \n\n\nI guess what I am saying is I hope they keep them running, but it will be down to the infantry at some point unless they get more drones gifted to them.",
            "title_similarity": "0.6528919",
            "sentiment_compound": 0.1655
        },
        {
            "id": "hytyi7u",
            "score": 1,
            "text": "Moar drooooness!!!",
            "title_similarity": "0.026357181",
            "sentiment_compound": 0.0
        },
        {
            "id": "hytyicb",
            "score": 2,
            "text": "We may not feel super United in America right now but goddamn if this doesn’t feel good rising up with one voice against tyranny",
            "title_similarity": "0.2944597",
            "sentiment_compound": -0.4659
        },
        {
            "id": "hytytmc",
            "score": 2,
            "text": "Holy shit man. If anything good comes from this invasion of Ukraine it will be that land invasions will become a thing of the past. Hell raining down from the heavens should be a huge deterrent to roll slow ass vehicles down roads to go take over a city.",
            "title_similarity": "0.65081316",
            "sentiment_compound": -0.7003
        },
        {
            "id": "hytyuqa",
            "score": 6,
            "text": "I’ve learned more about modern war technology over the last 5 days than I ever wanted too :(",
            "title_similarity": "0.48421335",
            "sentiment_compound": -0.7943
        },
        {
            "id": "hytyw8s",
            "score": 2,
            "text": "Anyone have a eli5 answer for how drones differ tactically from traditional air power?  Like how come they aren’t just being shot down? Are there more of them? Just less risky to fly?",
            "title_similarity": "0.5034823",
            "sentiment_compound": 0.4503
        },
        {
            "id": "hytywh8",
            "score": 2,
            "text": "Is this getting the giant convoy heading to Kiev?",
            "title_similarity": "0.45953184",
            "sentiment_compound": 0.0
        },
        {
            "id": "hytz916",
            "score": 1,
            "text": "[Thanks for the missiles](https://m.dw.com/en/turkey-to-produce-new-s-500-missile-system-with-russia/a-48792240).  Here’s [something in return](https://mobile.twitter.com/ArmedForcesUkr/status/1497997019515961347?ref_src=twsrc%5Etfw%7Ctwcamp%5Etweetembed%7Ctwterm%5E1497997019515961347%7Ctwgr%5E%7Ctwcon%5Es1_&ref_url=https%3A%2F%2Fwww.businessinsider.com%2Fukraine-hypes-bayraktar-drone-as-videos-show-destroyed-russia-tanks-2022-2)",
            "title_similarity": "0.6199694",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hyu078e",
            "score": 1,
            "text": "@lordmotor-boat do u see this ?",
            "title_similarity": "0.13487634",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyu0y3p",
            "score": 18,
            "text": "Ukraine finally gets help! Go Turkey!",
            "title_similarity": "0.5483078",
            "sentiment_compound": 0.508
        },
        {
            "id": "hyu13s9",
            "score": 5,
            "text": "I feel sorry for the kids they gathered up to be the first to attack.  The people of Russia need to gain strength from within and try and stop this.  He's already pulled them \\~20 years backwards with this decision.",
            "title_similarity": "0.5663718",
            "sentiment_compound": 0.25
        },
        {
            "id": "hyu1pp3",
            "score": 2,
            "text": "It's like the plot of \"The Russia House\". The Russian Knight is Dead inside his suit of Armour. The myth of an all powerfull Soviet Union ( and then Russia) served the powers that be in Russia and the west both, but only the west relied on proper r&d and heavy defense spending on only the most modern technology while the Russians spent mkst of the money in corruption and misinformation. Should have stuck to misinformation because they're brilliant at that but anytime Russian gear has been faced with US or Nato gear, it hasn't geared well (Gulf War, Services, etc).",
            "title_similarity": "0.664758",
            "sentiment_compound": -0.8727
        },
        {
            "id": "hyu2iuw",
            "score": 16,
            "text": "Thank you Turkey!",
            "title_similarity": "0.31151175",
            "sentiment_compound": 0.4199
        },
        {
            "id": "hyu2nt6",
            "score": 2,
            "text": "We fight for Zev!",
            "title_similarity": "0.24472678",
            "sentiment_compound": -0.4389
        },
        {
            "id": "hyu49nn",
            "score": 10,
            "text": "Get fucked Putin. The world hates you ;) Congrats.",
            "title_similarity": "0.41622317",
            "sentiment_compound": -0.4588
        },
        {
            "id": "hyu4oi7",
            "score": 2,
            "text": "It’s just amazing to me how many people replying seem to be experts re the condition of Russia’s military equipment and the extent of Russia’s military capability (or lack thereof).  I hope everyone is right but how do we really know?",
            "title_similarity": "0.5600598",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hyu4pap",
            "score": 2,
            "text": "This is just Tower Defense irl.",
            "title_similarity": "0.16603227",
            "sentiment_compound": 0.128
        },
        {
            "id": "hyu4y9l",
            "score": 3,
            "text": "I had hope the US would do this as well.  We don’t have to be boots on the ground to make a massive difference.  Drones could decimate the Russian convoys all over the country.",
            "title_similarity": "0.6953983",
            "sentiment_compound": 0.6124
        },
        {
            "id": "hyu4yeq",
            "score": 8,
            "text": "Wow, Erdogan pleasantly surprises! He will gain a strong ally in the Eastern Europe.\n\nOh, yeah, Daddy Vlad will be furious!",
            "title_similarity": "0.5218742",
            "sentiment_compound": 0.9272
        },
        {
            "id": "hyu63wt",
            "score": 5,
            "text": "What the hell happened to the famous s300/s400 systems that could shoot down “anything” ??? Pfftttt they can’t even control the airspace around their invasion troops. Russia is paper kitten",
            "title_similarity": "0.5996381",
            "sentiment_compound": -0.8196
        },
        {
            "id": "hyu6eft",
            "score": 8,
            "text": "funny. I had read an article on these drones and how they were not only competing with and at times outclassing they're competitors, but also at a cheaper cost.",
            "title_similarity": "0.36886376",
            "sentiment_compound": 0.2382
        },
        {
            "id": "hyu6upd",
            "score": 1,
            "text": "At this point I’m afraid of what would happen if Ukraine went on the attack, \n\nlike if they decided to invade Russia for revenge and then we had to go against them, could we even do anything about it?\n\nThese guys seem pretty lethal at this point",
            "title_similarity": "0.5070293",
            "sentiment_compound": -0.2023
        },
        {
            "id": "hyu7a6h",
            "score": 1,
            "text": "I prepared an article with plenty of visuals on the features of [Turkish drones](https://www.turkishvibe.com/turkey/game-changer-turkish-drones/) and which countries they are sold to. Interested people can take a look :) https://www.turkishvibe.com/turkey/game-changer-turkish-drones/",
            "title_similarity": "0.63690585",
            "sentiment_compound": 0.765
        },
        {
            "id": "hyu7lfk",
            "score": 1,
            "text": "The way people discrediting what Putin can do against all these sanctions and what not, is so concerning …",
            "title_similarity": "0.37562993",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyu7m9g",
            "score": 72,
            "text": "FYI the TB2 is turkeys entry level drone.",
            "title_similarity": "0.63201964",
            "sentiment_compound": 0.368
        },
        {
            "id": "hyu7nhs",
            "score": 13,
            "text": "Is this Turkish delight?",
            "title_similarity": "0.23183024",
            "sentiment_compound": 0.5994
        },
        {
            "id": "hyu7sum",
            "score": 2,
            "text": "Glory to Ukraine! Glory to heroes!💙💛",
            "title_similarity": "0.341647",
            "sentiment_compound": 0.9652
        },
        {
            "id": "hyu7tq0",
            "score": 2,
            "text": "This reminds me of the shift in technology that happened at the beginning of World War II. Everyone thought battleships were going to be incredibly important, turns out it was Air Superiority and aircraft carriers that dominated. Tanks are the battleships of our generation; slow easy to hit and very expensive.",
            "title_similarity": "0.59372485",
            "sentiment_compound": 0.1263
        },
        {
            "id": "hyu8lgk",
            "score": 1,
            "text": "The drone wars begin.",
            "title_similarity": "0.4914786",
            "sentiment_compound": -0.5574
        },
        {
            "id": "hyu8r0g",
            "score": 8,
            "text": "How many do they have? There was a report earlier:\n\n>The Ukrainian military's Operational Command \"North\" claims it destroyed 96 Russian tanks, 20 grad rocket launchers, and eight fuel trucks using the Turkish-made Bayrakatar drone near Sumy\n\nNumbers are probably exaggerated but if this is even close to true thats insane. Do they have a a whole swarm or are a few drones enough to destroy so many vehicles?",
            "title_similarity": "0.79333735",
            "sentiment_compound": -0.8053
        },
        {
            "id": "hyu90id",
            "score": 10,
            "text": "Turkey’s armament industry is big and expanding . The delicate sensitivity of nuts in the West created perfect opportunity.",
            "title_similarity": "0.5016844",
            "sentiment_compound": 0.7506
        },
        {
            "id": "hyu92oi",
            "score": 1,
            "text": "The drone is just targeting, no?  What is the impact from?  Guided munitions?",
            "title_similarity": "0.48706657",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyu9g62",
            "score": 7,
            "text": "Those drones have never had such a target rich opportunity, and Ukraine is absolutely putting them to best use. \n\nThe future of warfare is being written in front of our faces.",
            "title_similarity": "0.68408453",
            "sentiment_compound": 0.8555
        },
        {
            "id": "hyu9jxg",
            "score": 1,
            "text": "More along the lines of Russia has always backed itself with having nukes and everyone’s always backed off because let’s face it he’s a nut job that would actually use them",
            "title_similarity": "0.56120324",
            "sentiment_compound": 0.0516
        },
        {
            "id": "hyu9rij",
            "score": 1,
            "text": "crabrave",
            "title_similarity": "-0.050972987",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyua0yk",
            "score": 1,
            "text": "How many drones would it take to wipe out that convoy heading toward Kiev?",
            "title_similarity": "0.66560924",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyuabcj",
            "score": 1,
            "text": "Stock ticker?",
            "title_similarity": "0.10980147",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyubf7a",
            "score": 2,
            "text": "Hopefully some of them can take out that 17 mile long convoy headed towards Kyiv. It would be sweet to see that turned into the highway of death for the Russians.",
            "title_similarity": "0.69054323",
            "sentiment_compound": 0.2023
        },
        {
            "id": "hyubgcf",
            "score": 2,
            "text": "For price of one fighter jet you can get 20 killer drones.Putin is going to be pissed at Recep Tayyip Erdoğan.",
            "title_similarity": "0.6538693",
            "sentiment_compound": -0.836
        },
        {
            "id": "hyubkn7",
            "score": 2,
            "text": "I first read how how effective these drones were when reading about the Azerbaijan/Armenian war not too long ago.  Pretty scary stuff.",
            "title_similarity": "0.7483236",
            "sentiment_compound": -0.2023
        },
        {
            "id": "hyubyfi",
            "score": 1,
            "text": "Alright, so is this Putin playing the long-term invasion gain and spending his most untrained conscripts and old ass equipment before he sends in the good stuff….or is this all the Russian army has got? Because this is pathetic and laughable and he’s got to know it.",
            "title_similarity": "0.5703436",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hyucb63",
            "score": 1,
            "text": "I though Turkey and Russia were Allie’s. They were both in Syria helping? What’s going on here?",
            "title_similarity": "0.50982356",
            "sentiment_compound": 0.3736
        },
        {
            "id": "hyucl36",
            "score": 1,
            "text": "So is this just saying that tanks are basically useless these days? Or is it just against shitty older tanks?",
            "title_similarity": "0.2652342",
            "sentiment_compound": -0.7757
        },
        {
            "id": "hyuctpd",
            "score": 1,
            "text": "Hooray us!",
            "title_similarity": "-0.01820521",
            "sentiment_compound": 0.5562
        },
        {
            "id": "hyud4mv",
            "score": 16,
            "text": "Turkey has been an excellent and underrated support",
            "title_similarity": "0.26402998",
            "sentiment_compound": 0.7506
        },
        {
            "id": "hyud4wa",
            "score": 1,
            "text": "Crimean War 2, Electric Boogaloo. Ironically had the last guy in America won we might’ve been considering joining the Russians again.",
            "title_similarity": "0.6077037",
            "sentiment_compound": -0.0516
        },
        {
            "id": "hyudbqc",
            "score": 1,
            "text": "Keep fighting don’t give up the good fight Ukraine!! 🇺🇦 This American stands behind you! Love and health 🇺🇸🇺🇸🇺🇸",
            "title_similarity": "0.47736478",
            "sentiment_compound": 0.5962
        },
        {
            "id": "hyudnby",
            "score": 1,
            "text": "Keep seeing photos of a 3 Mile long convoy advancing on Kyiv. Why isn't every one of those vehicles smoking right now? Seems like a good job for a drone.",
            "title_similarity": "0.6018307",
            "sentiment_compound": 0.6597
        },
        {
            "id": "hyudpco",
            "score": 24,
            "text": "Now Thats what i call a Turkish delight!",
            "title_similarity": "0.2777965",
            "sentiment_compound": 0.636
        },
        {
            "id": "hyue1ox",
            "score": 1,
            "text": "Let’s put a bajillion tanks and trucks on a 2 lane road into Ukraine! No air support needed. Putin says we can’t be defeated. Boom!",
            "title_similarity": "0.65493953",
            "sentiment_compound": -0.7988
        },
        {
            "id": "hyueafv",
            "score": 6,
            "text": "The Russian Central Bank has raised interest rates to 20%, Russian currency is in free fall, oligarchs are losing billions, and Ukrainian Forces are holding up better than anticipated. This situation is devastating for Putin. A major unforced error. The world community is rallying behind Ukraine and there are even anti-Putin protests in Moscow.",
            "title_similarity": "0.5601183",
            "sentiment_compound": -0.3774
        },
        {
            "id": "hyuedo7",
            "score": 7,
            "text": "tragic to see such destruction of life. please end this war",
            "title_similarity": "0.40572542",
            "sentiment_compound": -0.8519
        },
        {
            "id": "hyueuhk",
            "score": 1,
            "text": "Isn't it ironic that TB-2 drones use Canadian optoelectronics sensors and optics and Canadian Bombadier engines.",
            "title_similarity": "0.57986844",
            "sentiment_compound": 0.0951
        },
        {
            "id": "hyueuy5",
            "score": 2,
            "text": "And Germany had has discussions about drones with weapons for years and they just don't want to develop them. I'm generally against military spending, but are we not aware that this is the future of how war will be like? And what's the alternative? Sending humans that may die? So stupid",
            "title_similarity": "0.5126163",
            "sentiment_compound": -0.959
        },
        {
            "id": "hyufkir",
            "score": 6,
            "text": "Turkish gold",
            "title_similarity": "0.20977059",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyughcs",
            "score": 1,
            "text": "How's Ukrainian leaned to drive those drones in one day.",
            "title_similarity": "0.6884899",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyugjhb",
            "score": 113,
            "text": "Once again the Turks showing they do not fuck about in war.",
            "title_similarity": "0.33656132",
            "sentiment_compound": -0.2617
        },
        {
            "id": "hyuhn1t",
            "score": 2,
            "text": "And to think Erdogan is actually dependant on Russia for loads of stuff (gas, wheat etc)",
            "title_similarity": "0.5848561",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyuitkn",
            "score": 1,
            "text": "After watching the Russian military in action I’m certain that the US could easily kick their Ass",
            "title_similarity": "0.66699505",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyuiywl",
            "score": 8,
            "text": "27 Hour flight time and 200km control range. I need one of this to replace my DJI :)",
            "title_similarity": "0.39050096",
            "sentiment_compound": 0.4588
        },
        {
            "id": "hyuj353",
            "score": 3,
            "text": "It really bothers me that the article uses metric for every measurement, except altitude. 25,000 ft = 7,620 m",
            "title_similarity": "0.3478102",
            "sentiment_compound": -0.2716
        },
        {
            "id": "hyuj5n7",
            "score": 2,
            "text": "The irony of reading this article on business insider…",
            "title_similarity": "0.35804203",
            "sentiment_compound": -0.0516
        },
        {
            "id": "hyujcpt",
            "score": 49,
            "text": "Turks and their weapons man, turning tides all throughout history",
            "title_similarity": "0.50280917",
            "sentiment_compound": -0.4404
        },
        {
            "id": "hyujenb",
            "score": 2,
            "text": "They just need one A10 squadron and the Russian convoy would be history in less than 30 min",
            "title_similarity": "0.47145522",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyujvph",
            "score": 2,
            "text": "Why are they not being used on that huge armoured column headed for Kyiv we keep hearing about",
            "title_similarity": "0.5373814",
            "sentiment_compound": 0.3182
        },
        {
            "id": "hyujwnl",
            "score": 3,
            "text": "How do we get together and send Ukraine endless Turkish bombing drones?",
            "title_similarity": "0.7348987",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyujyy2",
            "score": 1,
            "text": "When did Ukraine acquire drones?",
            "title_similarity": "0.56716835",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyujzws",
            "score": 2,
            "text": "Hopefully this isn’t like the Russo-Japanese war where we previewed how destructive new tech was compared to old tech…in the future it’s gonna be robots vs robot with civs caught in the middle.",
            "title_similarity": "0.58921033",
            "sentiment_compound": -0.5719
        },
        {
            "id": "hyuk636",
            "score": 9,
            "text": "TB2 is solid…lots of business heading Turkeys way with the positive press.",
            "title_similarity": "0.4457764",
            "sentiment_compound": 0.5574
        },
        {
            "id": "hyuk9kt",
            "score": 2,
            "text": "There’s a 17 mile stretch they can practice on.",
            "title_similarity": "0.23282573",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyukcbu",
            "score": 3,
            "text": "Vladimir Puta mothera!",
            "title_similarity": "0.21513732",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyukdbv",
            "score": 1,
            "text": "https://youtu.be/yuHfyNEiAcE.   This one was from today, looks like they still flying",
            "title_similarity": "0.21761478",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hyukynr",
            "score": 2,
            "text": "Tank driver’s wanted. Starting pay: your life.",
            "title_similarity": "0.3053167",
            "sentiment_compound": -0.1027
        },
        {
            "id": "hyulova",
            "score": 10,
            "text": "Turkish Delight is no longer just a delicious candy",
            "title_similarity": "0.26681924",
            "sentiment_compound": 0.7506
        },
        {
            "id": "hyum21o",
            "score": 5,
            "text": "People are cheering now but this isn't a net positive for humanity.",
            "title_similarity": "0.09542392",
            "sentiment_compound": -0.409
        },
        {
            "id": "hyunakq",
            "score": 1,
            "text": "They sold them in the war with Azerbaijan and Armenia and those drones turned the tide of that war and made Armenia loose…. Nasty things those drones I hear.",
            "title_similarity": "0.6995815",
            "sentiment_compound": -0.9081
        },
        {
            "id": "hyunnm4",
            "score": 1,
            "text": "Tanks for show, drones for a pro.",
            "title_similarity": "0.4496268",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyunsfx",
            "score": 1,
            "text": "Does anyone know if they have any drones left?",
            "title_similarity": "0.28080755",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyuny7d",
            "score": 2,
            "text": "Good for Ukraine.",
            "title_similarity": "0.24607065",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hyuo8m9",
            "score": 2,
            "text": "Now do it with this new 40 mile long convoy we got on satellite",
            "title_similarity": "0.44997895",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyuoe9h",
            "score": 5,
            "text": "Go grandmother Ukraine",
            "title_similarity": "0.31457186",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyuoyif",
            "score": 2,
            "text": "Does anybody actually have images of destroyed Russian tanks, I have mostly seen softskin, MRAPs or  BMPs been hit. \n\nI have seen abandoned tanks, but none destroyed.   I was hoping to see how NLAW top kill stuff has been working against sunshades and such, but there is is a paucity of dead tanks.",
            "title_similarity": "0.6441944",
            "sentiment_compound": -0.8503
        },
        {
            "id": "hyuq39r",
            "score": 3,
            "text": "Need more drones and planes, hit that dam convoy, 2 hits each half mile",
            "title_similarity": "0.56698745",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyuqa1s",
            "score": 2,
            "text": "Didn't Azerbaijan do the same thing to Armenian tanks and armored vehicles with the same types of Turkish drones?",
            "title_similarity": "0.6698861",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyuqd4n",
            "score": 2,
            "text": "So what? The Russians are like target practice for other countries and their new military toys now? Nice.",
            "title_similarity": "0.58567846",
            "sentiment_compound": 0.6868
        },
        {
            "id": "hyuqr95",
            "score": 2,
            "text": "You folks are excellent",
            "title_similarity": "-0.082342446",
            "sentiment_compound": 0.5719
        },
        {
            "id": "hyuqv27",
            "score": 3,
            "text": "Turkish drones are badass. Very formidable.",
            "title_similarity": "0.51831496",
            "sentiment_compound": 0.34
        },
        {
            "id": "hyura7m",
            "score": 6,
            "text": "Now go use them all on that 40 mile convoy heading your way, they are all lined up nicely for you",
            "title_similarity": "0.3828532",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hyurgk8",
            "score": 1,
            "text": "I feel like this is a really dumb question but why can’t Russian send in drones to take down Ukraine’s drones? Do they not have any?",
            "title_similarity": "0.6351061",
            "sentiment_compound": -0.2279
        },
        {
            "id": "hyurh9l",
            "score": 6,
            "text": "Turkey was like : Oops my hand slipped, so sorry.",
            "title_similarity": "0.38011",
            "sentiment_compound": 0.6258
        },
        {
            "id": "hyus16o",
            "score": 6,
            "text": "Appreciate you Turkey 🧡🧡🧡🇹🇷🇹🇷🇹🇷",
            "title_similarity": "0.26146916",
            "sentiment_compound": 0.9022
        },
        {
            "id": "hyusr07",
            "score": 2,
            "text": "Oh man there will be so many military analyses papers written on this just because of the way it’s turning out.",
            "title_similarity": "0.43772697",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyut8z1",
            "score": 8,
            "text": "US needs to surreptitiously amplify this and lay waste to the convoy headed to assassinate the civilians in Kyiv.  Give Ukraine/Turkey the credit.",
            "title_similarity": "0.6914004",
            "sentiment_compound": -0.0516
        },
        {
            "id": "hyutahv",
            "score": 9,
            "text": "Finally! Sabaton can sing a song where the Turks are the good guys for once! /s\n\nFuck yeah Turkey, love you guys too!",
            "title_similarity": "0.51990616",
            "sentiment_compound": 0.7701
        },
        {
            "id": "hyuud3a",
            "score": 42,
            "text": "Fun fact: Turkey had to develope these drones because USA, their NATO ally, banned Turkey to get drones.",
            "title_similarity": "0.70071673",
            "sentiment_compound": 0.0772
        },
        {
            "id": "hyuv085",
            "score": 6,
            "text": "I jerked off to this.",
            "title_similarity": "-0.008317413",
            "sentiment_compound": -0.2023
        },
        {
            "id": "hyuvqm3",
            "score": 2,
            "text": "Well, I sure hope Ukraine has a fuck-ton of those drones because CNN is now reporting a 40-mile long Russian convoy headed towards Kyiv. Russia has also declared air superiority but you can't believe a word those fuckwits say.",
            "title_similarity": "0.775031",
            "sentiment_compound": 0.5927
        },
        {
            "id": "hyuw4ql",
            "score": 2,
            "text": "Do it again!",
            "title_similarity": "0.014076175",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyuwjer",
            "score": 3,
            "text": "Drone bomb me!",
            "title_similarity": "0.4363864",
            "sentiment_compound": -0.5411
        },
        {
            "id": "hyux8si",
            "score": 1,
            "text": "Real question - is there thought that future wars with more unmanned tech may become more of an economic/technology war as opposed to causing mass destruction of infrastructure and humans as a means of victory? Once the loser runs out of resources, can no longer fight, then they would have to surrender?",
            "title_similarity": "0.4633978",
            "sentiment_compound": -0.943
        },
        {
            "id": "hyuxc06",
            "score": 2,
            "text": "Hope they use the drones on that 40 mile long convoy.",
            "title_similarity": "0.5591461",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hyuy944",
            "score": 1,
            "text": "Wouldn’t Russia have equally strong drones or stronger? What’s stopping them from using them?",
            "title_similarity": "0.52924514",
            "sentiment_compound": 0.6868
        },
        {
            "id": "hyuybio",
            "score": 1,
            "text": "I would like to ask a serious question. What is the \"goop\" that splashes down on the right moments after impact? Fuel? Liquid explosive material? Or something completely different?",
            "title_similarity": "0.37654388",
            "sentiment_compound": 0.4871
        },
        {
            "id": "hyuzqwp",
            "score": 1,
            "text": "Wondering if those long Russian Convoys have been attacked yet?",
            "title_similarity": "0.4864243",
            "sentiment_compound": -0.4588
        },
        {
            "id": "hyuzs11",
            "score": 3,
            "text": "I can only hope Turkey gets them more of them.",
            "title_similarity": "0.41548777",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hyv017b",
            "score": 2,
            "text": "Ottomans take a bow please!!!",
            "title_similarity": "0.17877325",
            "sentiment_compound": 0.4898
        },
        {
            "id": "hyv0fi2",
            "score": 3,
            "text": "I never really thought much of Turkish drones, until this conflict. Dirt cheap compared to the rest and surprisingly effective.",
            "title_similarity": "0.5102229",
            "sentiment_compound": 0.0708
        },
        {
            "id": "hyv0i73",
            "score": 2,
            "text": "🇹🇷 gun running like it’s their job with these drones. Bravo",
            "title_similarity": "0.56823665",
            "sentiment_compound": 0.0258
        },
        {
            "id": "hyv0jri",
            "score": 2,
            "text": "Why doesn’t Turkey fly the rest of their drones to Ukraine.  Heck Turkey can still pilot them.  No one would know the difference.  More Drones would be huge plus !!!",
            "title_similarity": "0.6999726",
            "sentiment_compound": 0.2444
        },
        {
            "id": "hyv10m7",
            "score": 3,
            "text": "I’ve been waiting for this conflict just to see how effective the Turkish terminator drones would be on major tank formations. Turkish drones are a very potent weapon, possibly better than Chinese or American",
            "title_similarity": "0.69995123",
            "sentiment_compound": 0.2255
        },
        {
            "id": "hyv1l4z",
            "score": 2,
            "text": "Get ‘em turkey",
            "title_similarity": "0.36530635",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyv265p",
            "score": 1,
            "text": "So is Turkey now at war with Russia then?",
            "title_similarity": "0.4741237",
            "sentiment_compound": -0.5994
        },
        {
            "id": "hyv26yd",
            "score": 2,
            "text": "It’s good but also scary. So many countries nowadays with military toys. \n  The idea of world peace isn’t even possible. So many weapons out there. \n Is it even possible?",
            "title_similarity": "0.49714404",
            "sentiment_compound": -0.4343
        },
        {
            "id": "hyv2n0p",
            "score": 4,
            "text": "Whatever the outcome of this, the winner is the Bayraktar and its manufacturer",
            "title_similarity": "0.25465015",
            "sentiment_compound": 0.5859
        },
        {
            "id": "hyv377l",
            "score": 3,
            "text": "I’m really just beginning to understand the dynamics here so forgive me…why is Turkey so willing to aggressively supply these drones?",
            "title_similarity": "0.6146699",
            "sentiment_compound": 0.2333
        },
        {
            "id": "hyv39vh",
            "score": 2,
            "text": "🇹🇷🇹🇷🇹🇷",
            "title_similarity": "-0.15946092",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyv3gad",
            "score": 3,
            "text": "I wonder how North Korea feels when watching this? I assume NK wouldn't be able to access this level of tech, and perhaps the South could use these drones to cripple the Norths artillery before they could do significant damage.",
            "title_similarity": "0.5618614",
            "sentiment_compound": -0.34
        },
        {
            "id": "hyv3pf1",
            "score": 4,
            "text": "How about sending some to that 40 mile long convoy?",
            "title_similarity": "0.34181386",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyv3thw",
            "score": 6,
            "text": "WE NEED MORE!!   Russia  said that Turkey is a crap country and they have a weak leader who eats inferior hummus.   Show them where its at Turkey!   Send more drones!\n\nPutin says Chechens make better hummus!",
            "title_similarity": "0.65233463",
            "sentiment_compound": -0.7556
        },
        {
            "id": "hyv4o48",
            "score": 1,
            "text": "Didn’t Russia just arm turkey a few years ago?",
            "title_similarity": "0.54067636",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyv4vaf",
            "score": 5,
            "text": "Use those drones on that 40 mile convoy going to Kiev!!!!!!",
            "title_similarity": "0.62570643",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyv5mas",
            "score": 1,
            "text": "It’s not over yet. Keep using them effectively.",
            "title_similarity": "-0.10285296",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hyv5wnr",
            "score": 6,
            "text": "Ah, the Turks once again tip the scales of a major conflict through air power.",
            "title_similarity": "0.60897577",
            "sentiment_compound": -0.3804
        },
        {
            "id": "hyv62mh",
            "score": 2,
            "text": "Fuck Erdogan but at the same time I’m glad Putin pissed him off.",
            "title_similarity": "0.46059197",
            "sentiment_compound": -0.6187
        },
        {
            "id": "hyv7jc0",
            "score": 5,
            "text": "I see in the news now that there's a Russian convoy, 64km's long, outside of Kyiv. Time to let the drones loose on that....",
            "title_similarity": "0.7237697",
            "sentiment_compound": -0.3182
        },
        {
            "id": "hyv7vsq",
            "score": 1,
            "text": "I really worry about hearing this kind of stuff, also the possibility of turkey closing off the black sea. They are a NATO member, and if they stumble into direct conflict with Russia, we could all be right fucked.",
            "title_similarity": "0.5936801",
            "sentiment_compound": -0.8718
        },
        {
            "id": "hyvacqd",
            "score": 3,
            "text": "Karaboga says hi \n\n🦃 > 🐻",
            "title_similarity": "-0.0028537102",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyvb0gz",
            "score": 1,
            "text": "Why are the Russians always gathering and huddling together in the age of drones and satellites lol. \n\nHollywood has really spoiled in terms of how competent players in war really are.",
            "title_similarity": "0.6516303",
            "sentiment_compound": 0.0516
        },
        {
            "id": "hyvbdkl",
            "score": 5,
            "text": "Man never knew Turkey has the second biggest army in NATO, and they have some of the greatest drone weapons in existence on this planet?\n\nVery interesting, instead of aerial military vehicles will we see more investments in getting drones to do all the fighting instead? Or is it still far too expensive to create that many.\n\nRegardless interest in using drones for wars will surely increase, this will cause a massive new industry to boom in the 21st century",
            "title_similarity": "0.68543446",
            "sentiment_compound": 0.834
        },
        {
            "id": "hyvd1e4",
            "score": 3,
            "text": "I can’t help but wonder why Ukraine is not trying to take out their Convoys.",
            "title_similarity": "0.43523118",
            "sentiment_compound": 0.2144
        },
        {
            "id": "hyvdvb6",
            "score": 3,
            "text": "Reminder that those Drones are made with some major components embargoed by Canadian government and many western companies including Xilinx( AMD)",
            "title_similarity": "0.5762689",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyvfkpx",
            "score": 3,
            "text": "How is Ukraine faring so much better than Georgia, Crimea, and Chechnya? More EU/NATO support? Better preparation? A broader war that Russia was not prepared for? All the above?",
            "title_similarity": "0.52301055",
            "sentiment_compound": 0.6922
        },
        {
            "id": "hyvh1gj",
            "score": 3,
            "text": "I am wondering just how long before we see civiliens driving around in Toyota Hilixs with anti-tanks and anti aircraft armmaments bolted on to the Toyotas and slaying the Russian troops.",
            "title_similarity": "0.75551695",
            "sentiment_compound": -0.3182
        },
        {
            "id": "hyvj2oo",
            "score": 2,
            "text": "Widely underestimated. Who’d have thought Erdogan would have turned on Putin?",
            "title_similarity": "0.38231045",
            "sentiment_compound": -0.2732
        },
        {
            "id": "hyvlv2z",
            "score": 2,
            "text": "Ukraine is soon to be the best military equipped country in the EU.",
            "title_similarity": "0.47960514",
            "sentiment_compound": 0.6369
        },
        {
            "id": "hyvm1gd",
            "score": 1,
            "text": "Jfc, Russia *just* said that countries whose weapons kill their soldiers will be held liable... Turkey is in NATO. Are they *trying* to start WWIII? Don't @ me with accusations of apologism. This is seriously toying with nuclear apocalypse.",
            "title_similarity": "0.721735",
            "sentiment_compound": -0.891
        },
        {
            "id": "hyvmwlu",
            "score": 1,
            "text": "Can someone educate me? I have a couple questions in regards to this war alone. \n\nFirst one being; what broke the camels back between Ukraine and Russian. I’ve always know the animosity was there but never learned what got them there to begin with. Why did Putin finally decide to attack after so many years of threatening to invade.\n\nAnd secondly; this one is more about war in general. Or perhaps it’s just the way Russia has chosen to go about things. But I have seen one too many videos of civilians literally getting killed with zero ounce of remorse and/or hesitation. It has triggered me and I’m just saddened by the situation of these innocent people. \n\nRussian militants are going out their way to killing them. Will there be any consequences to these actions? I always thought war were more tactical with commanders attacking forefront enemies in order to capture certain territories. But the mindset from these Russian bastards seem more savage with only purpose of killing civilians. What is the end goal? And more importantly, how will Russia or those in command suffer another than economic sanctions.",
            "title_similarity": "0.64917314",
            "sentiment_compound": -0.9975
        },
        {
            "id": "hyvny66",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "-0.052017633"
        },
        {
            "id": "hyvnzdy",
            "score": 1,
            "text": "Hulk smash stuff!",
            "title_similarity": "0.3246952",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyvs5bt",
            "score": 1,
            "text": "Are they the same that opened fire on Australian aid workers?",
            "title_similarity": "0.45035976",
            "sentiment_compound": -0.34
        },
        {
            "id": "hyw1bzw",
            "score": 2,
            "text": "Is there a video of the attack?",
            "title_similarity": "0.2925235",
            "sentiment_compound": -0.4767
        },
        {
            "id": "hyw6iez",
            "score": 3,
            "text": "Were these drones very advanced? In the sense if Russians had normal/decent Anti air craft systems they would have still worked?",
            "title_similarity": "0.54120785",
            "sentiment_compound": -0.0943
        },
        {
            "id": "hyw8aeu",
            "score": 1,
            "text": "Might be a silly question but how many missiles can one drone carry? How many targets could a drone take out in one go?",
            "title_similarity": "0.5401171",
            "sentiment_compound": 0.1053
        },
        {
            "id": "hyw9p7u",
            "score": 2,
            "text": "Can we move it to drones-only wars on special arenas? Who needs human casualties.",
            "title_similarity": "0.5625436",
            "sentiment_compound": -0.2263
        },
        {
            "id": "hywa2ct",
            "score": 1,
            "text": "https://youtu.be/1qS6J-WbTD8",
            "title_similarity": "0.08533281",
            "sentiment_compound": 0.0
        },
        {
            "id": "hywb18a",
            "score": 3,
            "text": "Great work Turkey!\n\nLet's get more drones out there and blast those columns of Russian crap off the map.\n\nCome on Europe...USA...drones are the way to go. A few missiles up Russian tailpipes will soon get them running home to Momma.",
            "title_similarity": "0.7424269",
            "sentiment_compound": 0.4199
        },
        {
            "id": "hywbe1x",
            "score": 1,
            "text": "Gonna need a ton of these, and Javelins to fuck up that convoy. I hope there is a plan for dealing with that.",
            "title_similarity": "0.49917945",
            "sentiment_compound": -0.1531
        },
        {
            "id": "hywe9iy",
            "score": 2,
            "text": "You know, A small country such as Ukraine 'sucessfully' 'defending' itself from a superpower really is a miracle.. I mean.. thats like Ireland fighting America. This propaganda bs you read and pass on is complete shit.",
            "title_similarity": "0.60412276",
            "sentiment_compound": -0.1372
        },
        {
            "id": "hywg28i",
            "score": 2,
            "text": "so how do we crowdsource them a fuckton more ?",
            "title_similarity": "0.17542526",
            "sentiment_compound": 0.0
        },
        {
            "id": "hywhh5e",
            "score": 1,
            "text": "No war ❌",
            "title_similarity": "-0.058054417",
            "sentiment_compound": 0.4847
        },
        {
            "id": "hywia7s",
            "score": 1,
            "text": "If drones were so affective, why can’t they just use a few hundred of them to prevent Russian convoy from coming in",
            "title_similarity": "0.64425766",
            "sentiment_compound": 0.0258
        },
        {
            "id": "hywmi7c",
            "score": 3,
            "text": "Can’t they drone the whole convoy that is stretching over 30 miles?",
            "title_similarity": "0.37851208",
            "sentiment_compound": 0.0
        },
        {
            "id": "hywpt96",
            "score": 3,
            "text": "I believe the tchechen will never arrive because of this Turkish pearl",
            "title_similarity": "0.42891008",
            "sentiment_compound": 0.0
        },
        {
            "id": "hywrs85",
            "score": 2,
            "text": "Is there a reason they aren’t currently using these to tear into that massive convoy heading towards Kyiv",
            "title_similarity": "0.39248058",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyx4z6h",
            "score": 3,
            "text": "First use in major? Qarabag? Libya? In Middle east against Russia and USA? Wtf you say first?",
            "title_similarity": "0.50456977",
            "sentiment_compound": -0.6966
        },
        {
            "id": "hyx6yts",
            "score": 5,
            "text": "Holy sh\\*t! Is... Is this real?!\n\n&#x200B;\n\nA positive post about Turkey on Reddit?",
            "title_similarity": "0.5154218",
            "sentiment_compound": 0.6751
        },
        {
            "id": "hyxhiod",
            "score": 1,
            "text": "Lol yes everyone made fun of him for one night then it turns out it is legit information and Ukraine Embassy took it seriously.",
            "title_similarity": "0.52878773",
            "sentiment_compound": 0.7964
        },
        {
            "id": "hyyxqg5",
            "score": 1,
            "text": "I know it's self defence. Think yourself in that",
            "title_similarity": "0.115418136",
            "sentiment_compound": 0.1027
        },
        {
            "id": "hyzmk15",
            "score": 2,
            "text": "Putin has problems.  The fact the the line of tanks outside Kyiv has barely moved says volumns.  I've even read that some of the Russian soldiers in that tank line are sabotaging their own tanks.  Add to that the fact they are running out of food and other provisions then you know Putin's not holding the winning cards.  Drones need to take out at least the front and rear tanks in that long line and wedge them in until the remaining tanks can be taken out or they retreat. I can't help but feel somewhat sorry for the Russian troops.  Putin lied to them from the start.  They thought they were \"liberating \" Ukraine  and they would be welcomed by Ukrainians.  So wrong.  They are dying for no reason other than their president is a war criminal and a nut case.",
            "title_similarity": "0.68589556",
            "sentiment_compound": -0.9736
        },
        {
            "id": "hz76n04",
            "score": 3,
            "text": "Thank you Turkey,  Ukraine has requested A-10 gun ships from the U.S, why aren't they being supplied, or when are they going to Ukraine, every minute counts!",
            "title_similarity": "0.6831112",
            "sentiment_compound": 0.1007
        },
        {
            "id": "hzfkruy",
            "score": 1,
            "text": "Ah hypocrisy of the West. While we shot down a Russian Jet that invaded our air space. They turned their back on us and refuse to sell us Patriots. And when we were on our own we tried to ease the tension between us and russia by buying theirs. Seeing this West amborgoed us even harder. When we supported Azerbaijan against the Armenia( which is a Russian Puppet state) they condemned us like how warmongering Turks were. \n\n\nRussia invades Ukraine\n\nWhole Nato: Surprised Pikachu face\n\nTurkey: Facepalms.\n\n\nTurkey defended Nato more than Nato did and received nothing but punishment.\n\n\nI'm not saying Erdogan isn't a part of this. He is literally the cause of where we are right now. But i hate how West now tries to Depict Turkey as a hero when we were the villains for a long time.",
            "title_similarity": "0.69465506",
            "sentiment_compound": -0.6866
        },
        {
            "id": "hzi9nz6",
            "score": 1,
            "text": "Dear President Volodymyr Zelensky, Ukraine\r  \nIt was heart breaking to see Ukraine kids say bye to their fathers who are going to fight with Russia. Are you aware you are being deliberately ill-advised by the NATO for war with Russia in order to sell future Hi-Tech Arms to other countries?! Please see these arms making companies share prices have gone up. This is not the first time wars were being used for making trillions of dollars! Capitalism and Market Economy will remain number one threat to global peace. You can check these prices by yourself! \r  \nLockeed Martin share price on 14 Feb 2022 - $365 gone up 4 March 2022 - $458\r  \nGeneral Dynamics share price on 14 Feb 2022 -$211 gone up 4 March 2022 - $243\r  \nNorthrop Grumman share price on 14 Feb 2022 -$386 gone up 4 March 2022 - $471",
            "title_similarity": "0.68203425",
            "sentiment_compound": 0.8472
        }
    ]
}