{
    "Zelensky calls Russia's missile strike on Kharkiv's Freedom Square a 'war crime' and 'state terrorism'\n": [
        {
            "id": "hyxvpjx",
            "score": 14,
            "text": "For Palestinians, it’s just like another random Thursday. Decades of conflict and death with Israel and Palestine. World keeps on moving. 4 days of Ukraine, whole world rallies around the conflict. I support Ukraine but you can’t bring up any other conflict without people downvoting you on Reddit. No other conflict matters unless you’re white and European. Lol.",
            "title_similarity": "0.4863788",
            "sentiment_compound": -0.1548
        },
        {
            "id": "hyxg4wk",
            "score": 14,
            "text": "Terrorism, you say? *The United States wants to know the location of your oil reserves*",
            "title_similarity": "0.6738434",
            "sentiment_compound": -0.4215
        },
        {
            "id": "hyxx18b",
            "score": 7,
            "text": "the line between who is a civilian and who is a military target is blurred. \nUkraine insists on handing out weapons to civilians, broadcasting to civilians how to make Molotov cocktails, and denying people the option to flee the country",
            "title_similarity": "0.7420546",
            "sentiment_compound": -0.6486
        },
        {
            "id": "hyx2m6r",
            "score": 116,
            "text": "History will never forget the Tyrant Dictator Vladolf Putler.",
            "title_similarity": "0.39201415",
            "sentiment_compound": 0.1695
        },
        {
            "id": "hyxx6v9",
            "score": -8,
            "text": "This literally cannot be classified as a war crime because that would mean that other countries, notably the U.S. that have recently/are currently doing the same might be held to account. Unless the EU/NATO goes full mask off and admits that they condone aggression from allies, which, now that I mention it, isn't impossible in this timeline.",
            "title_similarity": "0.5710976",
            "sentiment_compound": -0.8126
        },
        {
            "id": "hyy13hb",
            "score": -7,
            "text": "Funny how the building was occupied for military training and recruiting then nuked and suddenly it's all civilians.",
            "title_similarity": "0.55003005",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hyxzln4",
            "score": 1,
            "text": "I hope they live stream Putin’s execution when the time comes. I’d watch the hell out of that.",
            "title_similarity": "0.5168638",
            "sentiment_compound": -0.4019
        },
        {
            "id": "hyxv7q9",
            "score": 2,
            "text": "Fuck Russia and Fuck China",
            "title_similarity": "0.6555468",
            "sentiment_compound": -0.7906
        },
        {
            "id": "hyy5s1g",
            "score": 2,
            "text": "Yet he doesn't call it war crimes or state terrorism when israel does it",
            "title_similarity": "0.37101054",
            "sentiment_compound": -0.3515
        },
        {
            "id": "hyy2t7o",
            "score": 1,
            "text": "[deleted]",
            "title_similarity": "0.22977525"
        },
        {
            "id": "hyxvsl4",
            "score": -4,
            "text": "[deleted]",
            "title_similarity": "0.22977525"
        },
        {
            "id": "hyxswkg",
            "score": 14,
            "text": "I know this is gonna be unpopular but at what point do civilians that arm themselves stop being civilians. Obviously it's Russia's fault that civilians are arming themselves at all, but having said that there's a difference (to me at least) between bombing civilians in a shelter and bombing them in a fortified area that they are attacking you from. Russia is obviously the aggressor and all this blood on their hands but it just seems weird that half the pictures here are about how civilians and everyone is taking up arms to defend there country (which is beyond brave and respectable) then the other half is how Russia is killing civilians.",
            "title_similarity": "0.76422024",
            "sentiment_compound": -0.9052
        },
        {
            "id": "hyxz7ac",
            "score": -9,
            "text": "So...how do we know the Russians actually hit this?  What verification is there?  After hearing that Ukrainian soldiers are preventing Africans and Indians from leaving - and even **torturing** some...I'm not taking **anything** at face value.  \n\nMost people do not know enough about the geopolitics of this region to have a valid position for or against Russia or Ukraine.  I include myself in that group people, so I'm not believing anything from either side without evidence.",
            "title_similarity": "0.5780345",
            "sentiment_compound": -0.4696
        },
        {
            "id": "hyx5yhp",
            "score": 49,
            "text": "Well he’s not wrong.\n\nPutin must be stopped. He’s killing these people for a business deal with China - and Russia as a country will be finished if he succeeds. China will own them and have a strong foothold in Europe.",
            "title_similarity": "0.6445626",
            "sentiment_compound": 0.5932
        },
        {
            "id": "hyxpete",
            "score": -6,
            "text": "He’s a very good looking man.",
            "title_similarity": "0.04981722",
            "sentiment_compound": 0.4927
        },
        {
            "id": "hyxyd0e",
            "score": 23,
            "text": "Fuck every last person in here whatabout’ing",
            "title_similarity": "0.3425607",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hyxhz0z",
            "score": -65,
            "text": "Funny when US was doing this in Iraq it was called an \"effective military doctrine\" but now that Russia is the one doing it suddenly everyone agrees it's war crimes and terrorism.\n\nEdit: Thank you all for your delicious downvotes. After 20 years of mass murdering brown people and calling them \"collateral damage\" and \"meat shields\" suddenly you realized that actually murdering civilians is bad. The world is watching and your hypocrisy is on full display for the world to see.\n\nEdit 2: Now I am outright being [blocked by reddit](https://i.imgur.com/45EJ1z9.png) itself from replying to baseless accusations made against me in this thread. This is systemic harassment.",
            "title_similarity": "0.7146534",
            "sentiment_compound": -0.9878
        },
        {
            "id": "hyxz998",
            "score": 4,
            "text": "Pakistan just signed a massive trade deal with Russia. The absolute dicks",
            "title_similarity": "0.72984827",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyy0dkx",
            "score": 3,
            "text": "[removed]",
            "title_similarity": "0.20272559"
        },
        {
            "id": "hyytf3s",
            "score": 3,
            "text": "If so,then nato commited a war crimes and state terrorism by bombing serbian national tv station RTS where 16 people died but i guess its ok.",
            "title_similarity": "0.7497994",
            "sentiment_compound": -0.7615
        },
        {
            "id": "hyxxc1d",
            "score": -12,
            "text": "Remember the US drone strike on a family home in Afghanistan. What ever happened to that?",
            "title_similarity": "0.6339257",
            "sentiment_compound": -0.128
        },
        {
            "id": "hyyceyx",
            "score": 6,
            "text": "Oh man, if y'all are mad about war crimes wait until you hear about the bombings of Baghdad and Fallujah during the illegal Iraq War that lasted 20 years. \n\n\nOh wait, Americans don't care about war crimes being committed until they're committed against white people.",
            "title_similarity": "0.6699678",
            "sentiment_compound": -0.8975
        },
        {
            "id": "hyyggy8",
            "score": 0,
            "text": "What does condemning Russian war crimes really gonna change exactly? Putin clearly doesn't give an f about it, the West is just losing their time with petty politics while people in Ukraine are dying.",
            "title_similarity": "0.7142282",
            "sentiment_compound": -0.6808
        },
        {
            "id": "hyyquju",
            "score": 0,
            "text": "I saw a video of this Russian soldier who stated that if he refused to invade, he'd be considered a traitor and face like 20 years in prison, which is code for death.",
            "title_similarity": "0.6493001",
            "sentiment_compound": -0.7845
        },
        {
            "id": "hyxz0tl",
            "score": -7,
            "text": "[removed]",
            "title_similarity": "0.20272559"
        },
        {
            "id": "hyy816s",
            "score": -4,
            "text": "How about Zelensky, who bombed DNR and LNR for years?",
            "title_similarity": "0.53522545",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyygdwr",
            "score": -5,
            "text": "THANK YOU BIDEN THIS LAST YEAR HAS BEEN GREAT!!!!!!",
            "title_similarity": "0.101201296",
            "sentiment_compound": 0.8302
        },
        {
            "id": "hyym9xl",
            "score": -1,
            "text": "Its a fucking war, what do you expect",
            "title_similarity": "0.58026",
            "sentiment_compound": -0.6361
        },
        {
            "id": "hyzc1bq",
            "score": -1,
            "text": "Why is EU/NATO not doing anything to stop? Can someone explain?",
            "title_similarity": "0.35992587",
            "sentiment_compound": -0.3736
        },
        {
            "id": "hyy5o3o",
            "score": -6,
            "text": "[removed]",
            "title_similarity": "0.20272559"
        },
        {
            "id": "hyxjq1y",
            "score": -13,
            "text": "This may sound stupid to a lot but we won't put boots on the ground out of fear for nuclear war. What if we send troopers in dressed as civilians with weapons etc",
            "title_similarity": "0.55888766",
            "sentiment_compound": -0.9493
        },
        {
            "id": "hyxq5vr",
            "score": 14,
            "text": "The more actions I see from the active Russian Troops the more I can't distinguish them from the likes of Al Queada :/ \n\nEven after Putin is toppled I still feel we can never trust their troops, they need to answer to these war crimes.",
            "title_similarity": "0.6693285",
            "sentiment_compound": -0.5426
        },
        {
            "id": "hyx3443",
            "score": -9,
            "text": "[removed]",
            "title_similarity": "0.20272559"
        },
        {
            "id": "hyy8t5r",
            "score": -10,
            "text": "Dude hase been doing war crime since 2014 and calls russia terrorist? This clown actress president.",
            "title_similarity": "0.7816714",
            "sentiment_compound": -0.9201
        },
        {
            "id": "hyxorxo",
            "score": -2,
            "text": "Well I don't think it's state terrorisme cause that's an oxymoron. It's straight up invasion and war crimes tho.",
            "title_similarity": "0.6664183",
            "sentiment_compound": -0.34
        },
        {
            "id": "hyy7bu9",
            "score": -2,
            "text": "DontheCon and his cult followers call it genius!",
            "title_similarity": "0.32453448",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyz7oj8",
            "score": -3,
            "text": "Easy boy, there's still some that remember Hiroshima and Nagasaki.",
            "title_similarity": "0.18389198",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hyxgfh8",
            "score": -59,
            "text": "[removed]",
            "title_similarity": "0.20272559"
        },
        {
            "id": "hyxiwec",
            "score": -44,
            "text": "[removed]",
            "title_similarity": "0.20272559"
        },
        {
            "id": "hyxxudg",
            "score": -5,
            "text": "Think in a few days we will find that the attack never happened, a LA snake island?\n\nPeople really should be more cognizant if the massive psy ops campaign happening with this war and not take reports literally or seriously, especially during the thick of it.",
            "title_similarity": "0.5585023",
            "sentiment_compound": -0.8564
        },
        {
            "id": "hyy4vti",
            "score": -6,
            "text": "[removed]",
            "title_similarity": "0.20272559"
        },
        {
            "id": "hyy18kx",
            "score": -2,
            "text": "[deleted]",
            "title_similarity": "0.22977525"
        },
        {
            "id": "hyyuxuu",
            "score": -3,
            "text": "How about when he bombed innocent civilians in russia?",
            "title_similarity": "0.7921192",
            "sentiment_compound": 0.34
        },
        {
            "id": "hyz7fhu",
            "score": -3,
            "text": "You guys ever heard of Iraq, Libya, or Yemen ???",
            "title_similarity": "0.33318442",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyxpl4o",
            "score": 54,
            "text": "The concept of war crimes cracks me up. The act of inciting a war and invading another country to kill people is not a crime in itself?",
            "title_similarity": "0.6735722",
            "sentiment_compound": -0.8922
        },
        {
            "id": "hyxu3ox",
            "score": 0,
            "text": "It's true. This is a disgusting unprovoked attack. These are crimes against the humanity. Putin is sick and must be stopped.",
            "title_similarity": "0.7256386",
            "sentiment_compound": -0.836
        },
        {
            "id": "hyxunjb",
            "score": 0,
            "text": "Accurate",
            "title_similarity": "-0.048065353",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyxupan",
            "score": 0,
            "text": "Agreed",
            "title_similarity": "-0.07189347",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hyxv2d5",
            "score": 0,
            "text": "Zelenskyy is correct:  arm's length warfare tactics involving non-military installations using missiles is disgusting.",
            "title_similarity": "0.72752404",
            "sentiment_compound": -0.6808
        },
        {
            "id": "hyxv2qq",
            "score": 0,
            "text": "Russia just invading is a war crime",
            "title_similarity": "0.8427688",
            "sentiment_compound": -0.8126
        },
        {
            "id": "hyxvb6h",
            "score": 0,
            "text": "Absolute criminal mafia runs the Russian state.",
            "title_similarity": "0.6952231",
            "sentiment_compound": -0.5267
        },
        {
            "id": "hyxvbtt",
            "score": 0,
            "text": "Is it actually a (legally speaking) war crime or is it just a horrific act?",
            "title_similarity": "0.692366",
            "sentiment_compound": -0.9081
        },
        {
            "id": "hyxvpqt",
            "score": 0,
            "text": "According to Russia those are not war crimes but \"military operation\" crimes.",
            "title_similarity": "0.51837283",
            "sentiment_compound": 0.267
        },
        {
            "id": "hyxvz0h",
            "score": 0,
            "text": "Same same",
            "title_similarity": "-0.08926985",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyxw5br",
            "score": 0,
            "text": "Yes",
            "title_similarity": "-0.043576263",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hyxwbgr",
            "score": 0,
            "text": "Add it to the list of other war crimes Russia has committed. \n\nIt's like they are playing war crime bingo.",
            "title_similarity": "0.7583895",
            "sentiment_compound": -0.7845
        },
        {
            "id": "hyxwfoa",
            "score": 0,
            "text": "So I get that Nato has it's whole not getting involved with disputed between non Nato states but at what point is someone going to go in and fucking bitch slap Putin for this shit.",
            "title_similarity": "0.608529",
            "sentiment_compound": -0.9169
        },
        {
            "id": "hyxy2q7",
            "score": 0,
            "text": "Investigate and charge them! Also, Depleted uranium on the tips of bullets are also war crimes that need investigated",
            "title_similarity": "0.64448667",
            "sentiment_compound": -0.636
        },
        {
            "id": "hyxya5g",
            "score": 0,
            "text": "I was thinking about a well described fact regarding empathy and the number of people. It’s interesting the more the war escalates in terms of numbers our empathy circuit gets confused. It’s natural to care about a single tragic death but hundreds of them our brain doesn’t know what to do with. How might this come into play as the Russian attacks get more brutal?",
            "title_similarity": "0.62820107",
            "sentiment_compound": -0.8787
        },
        {
            "id": "hyxz6h6",
            "score": 0,
            "text": "is there enough air support ? , are the jets coming in from european countries ?",
            "title_similarity": "0.32082012",
            "sentiment_compound": 0.4696
        },
        {
            "id": "hyxzm36",
            "score": 0,
            "text": "I haven't seen the freedom square but the crossing is still in my mind. The video was just... i don't know. Still can't really process it. \n\nThere are cars, people just minding their everyday business. One car is in the process of turning into another street. Did these people think about the war? About what to cook for dinner? And then suddenly out of nowhere a missile hits right into the crossing. And everyone is gone.",
            "title_similarity": "0.52125716",
            "sentiment_compound": -0.8357
        },
        {
            "id": "hyy0x7v",
            "score": 0,
            "text": "He’s not wrong but he might want to think about risking some jets on destroying that cluster eff of a huge column coming toward Kyiv",
            "title_similarity": "0.63630474",
            "sentiment_compound": -0.568
        },
        {
            "id": "hyy0zmj",
            "score": 0,
            "text": "“The Ukranians will learn of our peaceful ways, by force.”\n\n-Russia",
            "title_similarity": "0.45342508",
            "sentiment_compound": 0.4939
        },
        {
            "id": "hyy1az9",
            "score": 0,
            "text": "Well Russia just made the square free of humanity.",
            "title_similarity": "0.4511096",
            "sentiment_compound": 0.6597
        },
        {
            "id": "hyy1e37",
            "score": 0,
            "text": "2022 Headline.  Russia starts a war in Europe and destroys the world on all our tomb stones.  One man can be a disaster for the world just like the nazi Hitler.",
            "title_similarity": "0.76521397",
            "sentiment_compound": -0.8779
        },
        {
            "id": "hyy1fsk",
            "score": 0,
            "text": "I’m sure this will stop them!",
            "title_similarity": "0.3249062",
            "sentiment_compound": 0.1007
        },
        {
            "id": "hyy1ihx",
            "score": 0,
            "text": "What’s “funny” is that this seems to be Russia holding back because the eyes of the world are on them. They’re used to Afghanistan and the whole Middle East where they get to do whatever they want. If you ask any Older Afghan person I’m sure they’ll tell you what we’re seeing is the Russian military on somewhat of a leash for the first time. \n\nIf people are horrified by accidental collateral in US operations in the Middle East they’d be sickened to hear about what the Russians got/get up to there, we’re talking mass rape and plundering",
            "title_similarity": "0.7201938",
            "sentiment_compound": -0.886
        },
        {
            "id": "hyy1lxd",
            "score": 0,
            "text": "It’s both.",
            "title_similarity": "0.0071497075",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyy266j",
            "score": 0,
            "text": "Would an assassination of Putin stop the war? Maybe we should think about drone bombing his location",
            "title_similarity": "0.76267624",
            "sentiment_compound": -0.875
        },
        {
            "id": "hyy28c9",
            "score": 0,
            "text": "I'm assuming peace talks are off the table now.",
            "title_similarity": "0.26142803",
            "sentiment_compound": 0.5423
        },
        {
            "id": "hyy2e2y",
            "score": 0,
            "text": "They're fixing the human travesties that have been happening in Ukraine (A Russian lie) to kill even more people faster! Russian people, wake up!",
            "title_similarity": "0.6909861",
            "sentiment_compound": -0.7418
        },
        {
            "id": "hyy4utz",
            "score": 0,
            "text": "It literally is",
            "title_similarity": "0.00923303",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyy4vjk",
            "score": 0,
            "text": "Its so sad how you can notably see the stress and tiredness on this mans face getting worse with each passing day. My god, i hope this stops for the sanity of the Ukrainian people. Hang on. My prayers are with you guys. 🇺🇦🙏💙💛",
            "title_similarity": "0.42968762",
            "sentiment_compound": 0.5199
        },
        {
            "id": "hyy5k4c",
            "score": 0,
            "text": "I really hope all the war mongers in the comments realize what it means for the US or NATO to step in and do something like impose a no fly zone. Russia has one strength. They can escalate this to something everyone on the planet will regret.\n\nThe way out of this is reaching the Russian people. They are clearly divided. They can be inspired to overthrow Putin.  I hope you all can be more mindful of the bloodthirsty froth you're contributing to",
            "title_similarity": "0.720597",
            "sentiment_compound": 0.8122
        },
        {
            "id": "hyy69sj",
            "score": 0,
            "text": "Guy looking more tired every day, how to age 10 years in week, wonder how much or if even he sleeps",
            "title_similarity": "0.24019739",
            "sentiment_compound": -0.4927
        },
        {
            "id": "hyy6owd",
            "score": 0,
            "text": "It is a fucking war crime. Russia is targeting civilians",
            "title_similarity": "0.84773034",
            "sentiment_compound": -0.839
        },
        {
            "id": "hyy7r74",
            "score": 0,
            "text": "It's both and it's gonna get much much worse",
            "title_similarity": "0.43634105",
            "sentiment_compound": -0.4767
        },
        {
            "id": "hyycmsr",
            "score": 0,
            "text": "True to form. \nThis kind of shit is what earned Putin the title “The Butcher of Grozny”.",
            "title_similarity": "0.60163164",
            "sentiment_compound": -0.2716
        },
        {
            "id": "hyycv1d",
            "score": 0,
            "text": "You see: If in Afghanistan they had this kind of commitment, we would still be backing them.",
            "title_similarity": "0.2171784",
            "sentiment_compound": 0.3415
        },
        {
            "id": "hyyczg5",
            "score": 0,
            "text": "Time to get an assassination group going",
            "title_similarity": "0.4803388",
            "sentiment_compound": -0.5994
        },
        {
            "id": "hyye6d9",
            "score": 0,
            "text": "Please pray for Ukraine!\n\nhttps://youtu.be/fA9s5Da4lqs",
            "title_similarity": "0.2897275",
            "sentiment_compound": 0.5983
        },
        {
            "id": "hyypq0t",
            "score": 0,
            "text": "I will take this one with a grain of salt.",
            "title_similarity": "0.1845601",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyyq8y0",
            "score": 0,
            "text": "Putin has committed war crimes over the last week. Are we gonna do anything about it? Probably not",
            "title_similarity": "0.63944113",
            "sentiment_compound": -0.4215
        },
        {
            "id": "hyyuuxr",
            "score": 0,
            "text": "\"War crimes\" only matter if you win",
            "title_similarity": "0.45582995",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyyvozj",
            "score": 0,
            "text": "brutally selfish , why dont we just negoatiate somehow? with the whole world, talk wtf thats  your fucken job not killing us civilians? So we gonna hate each other and start real war for you people in the suits",
            "title_similarity": "0.7264212",
            "sentiment_compound": -0.9486
        },
        {
            "id": "hyxes6i",
            "score": -43,
            "text": "This is the same guy who supported Israel bombing Palestine civilians exactly 1 year ago, I guess karma really exist.",
            "title_similarity": "0.51541066",
            "sentiment_compound": 0.3182
        },
        {
            "id": "hyxdrif",
            "score": 23,
            "text": "Shoigu is in charge of military. Shoigu is a terrorist. Putin too.",
            "title_similarity": "0.7969097",
            "sentiment_compound": -0.6908
        },
        {
            "id": "hyy7iwu",
            "score": 5,
            "text": "It just hit me:  War will never be the same now that every civilian has a smartphone capable of livestreaming the horrors and atrocities.\n\nThis is the first war in the history of civilization where there is no fog and shadow.  And that is absolutely going to affect everything about \"war\" going forward.\n\n&#x200B;\n\nIt's a new day, people.  And the sun is shining a little bit brighter.",
            "title_similarity": "0.44478202",
            "sentiment_compound": -0.9284
        },
        {
            "id": "hyy8yjh",
            "score": -5,
            "text": "It is.  So is everything Azov Battalion did.  ICC please.",
            "title_similarity": "0.2730232",
            "sentiment_compound": 0.3182
        },
        {
            "id": "hyytmye",
            "score": -4,
            "text": "Zelensky is a dictator who shut down four opposition media stations and is forcing men in Ukraine who want to flee to stay and fight for him. 1 downvote = 1 “I need a heroin injection to ease the pain of hearing a hard truth.”",
            "title_similarity": "0.6709582",
            "sentiment_compound": -0.7717
        },
        {
            "id": "hyyxcxx",
            "score": -5,
            "text": "Why is he acting so appalled? This is war. As if war has any limits.",
            "title_similarity": "0.6505413",
            "sentiment_compound": -0.913
        },
        {
            "id": "hyy6hsv",
            "score": -11,
            "text": "[removed]",
            "title_similarity": "0.20272559"
        },
        {
            "id": "hyxbto6",
            "score": 38,
            "text": "Russian army needs to turn around and head towards Moscow. It’s about time!",
            "title_similarity": "0.5419966",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyysc96",
            "score": -5,
            "text": "interesting how nobody has mentioned that Russia deliberately gave a 3 hour warning to evacuate and ukranian officials were completely silent on this  \nNATO and Ukraine are deliberately allowing the death of their own civilians just for their own propaganda",
            "title_similarity": "0.6033468",
            "sentiment_compound": -0.6808
        },
        {
            "id": "hyxux8z",
            "score": 1,
            "text": "What a shitty fucking website, doesn't even work",
            "title_similarity": "0.45376462",
            "sentiment_compound": -0.5574
        },
        {
            "id": "hyxv2uu",
            "score": 1,
            "text": "> The strike hit an opera house, concert hall, and a local government building in Freedom Square, local officials told the BBC.\n\nThese are the \"precision strikes against security targets\" that Putin was talking about then?\n\n> \"I am satisfied that there is a reasonable basis to believe that both alleged war crimes and crimes against humanity have been committed in Ukraine,\" Karim Khan said in a statement on Monday.\n\nWho?  This was the first and only mention of this Karim Khan dude in the article.  Google tells me:\n\n> Karim Asad Ahmad Khan QC is a British lawyer and a specialist in international criminal law and international human rights law.\n\nSo basically an expert opinion from someone who is not in a position to do anything about it, I guess.",
            "title_similarity": "0.6118527",
            "sentiment_compound": 0.1431
        },
        {
            "id": "hyxwtws",
            "score": 1,
            "text": "Vote for petition to delete new places!!!  \nWe quote:  \nHey!  I am writing to you from Kyiv. Unfortunately, your tags on Google maps are used by Russian terrorists to adjust the fires of our gas stations and government agencies!  We ask you to limit the creation of labels on the territory of Ukraine until the end of the war with Russia.  Now we are afraid on our own to mark these places as non-existent, but this takes time and people, and the terrorists add more and more new marks!  We will be very grateful for your help!  \nhttps://support.google.com/maps/thread/152809911/terrorists-use-google-maps-tags-to-adjust-the-fires-please-help",
            "title_similarity": "0.69881964",
            "sentiment_compound": -0.6096
        },
        {
            "id": "hyy04yh",
            "score": -1,
            "text": "It was a plane",
            "title_similarity": "0.14908555",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyy11de",
            "score": 1,
            "text": "They literally say that they did not lose a single soldier, did not kill a single civilian and that they killed hundreds of \"fascists\". Every missile strike is a mistake/malfunction by Ukrainian air defenses - which they reported to be completely destroyed in, like, the second day of the invasion. Also, the media is prohibited to call it war and reporting losses is a criminal offense. It's like Orwell, but it's a dark comedy with fucking clowns.",
            "title_similarity": "0.71709615",
            "sentiment_compound": -0.3435
        },
        {
            "id": "hyy258z",
            "score": 1,
            "text": "It is !!!! Arrest Putin , he is insane !!!!",
            "title_similarity": "0.7008649",
            "sentiment_compound": -0.7405
        },
        {
            "id": "hyy4uv0",
            "score": -1,
            "text": "Ironic considering Ukraine has been bombing civilians in Donbas for the past 8 years",
            "title_similarity": "0.6327379",
            "sentiment_compound": -0.128
        },
        {
            "id": "hyy57kc",
            "score": 1,
            "text": "And we all know that war crimes are taken seriously by global politics, and that *any* country that commits a war crime will be punished. **Any** country. Right??👀",
            "title_similarity": "0.6257999",
            "sentiment_compound": -0.9456
        },
        {
            "id": "hyy5r0e",
            "score": -1,
            "text": "Makes me sad how what russia is doing to Ukraine is similar to what my country has done in the Middle East. I know it isn’t exactly the same, but fuck it is shockingly similar when you think about it. If I could click a button and live somewhere else it would be so tempting.",
            "title_similarity": "0.60475093",
            "sentiment_compound": -0.8338
        },
        {
            "id": "hyyb09i",
            "score": -1,
            "text": "If this is a war crime every leader who participated in the Iraq war, Afghan War, the Nato operations in Yugoslavia, and Libya should be hanged. (It is and Putin should swing with them)",
            "title_similarity": "0.7528691",
            "sentiment_compound": -0.9451
        },
        {
            "id": "hyye0s5",
            "score": -1,
            "text": "You know what’s also a war crime Zelensky? Providing Azerbaijan weapons to murder Armenians and chemicals to burn down Armenia’s forests last year to steal Armenian land. But please tell us more.",
            "title_similarity": "0.72546923",
            "sentiment_compound": -0.7684
        },
        {
            "id": "hyyl0ny",
            "score": 1,
            "text": "This is where we do not know all the facts. If there is a war and there is fighting did you really expect not to have civilian’s killed? Every single war we have entered has left civilians dead. How is this different?",
            "title_similarity": "0.5694319",
            "sentiment_compound": -0.966
        },
        {
            "id": "hyyutca",
            "score": -1,
            "text": "They are delicious, much like Partridge",
            "title_similarity": "0.123517916",
            "sentiment_compound": 0.7351
        },
        {
            "id": "hyyvizg",
            "score": 1,
            "text": "It seems to me that many Ukrainians think that the world is just leaving them out to dry for no good reason. Like we get that Putin’s Russia is doing truly abominable things, but they also have the capacity to destroy the entire world. It’s understandably difficult to be pragmatic, and frankly callous, when the country and people you love are being ravaged. The reality is that directly defending Ukraine could escalate an invasion with thousands of casualties to a war with tens or even hundreds of millions, and untold other repercussions.",
            "title_similarity": "0.74239945",
            "sentiment_compound": -0.7617
        },
        {
            "id": "hyywyyi",
            "score": -1,
            "text": "Allegedly.",
            "title_similarity": "0.04981767",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyz4x0z",
            "score": -1,
            "text": "Why can’t we all listen to nickelback and just get along",
            "title_similarity": "0.29189795",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyz5h36",
            "score": -1,
            "text": "Anyone else feel like it's just a matter of time before NATO takes military action?",
            "title_similarity": "0.36835736",
            "sentiment_compound": 0.3818
        },
        {
            "id": "hyzi4h7",
            "score": 1,
            "text": "Well America sure is one.",
            "title_similarity": "0.11757985",
            "sentiment_compound": 0.5267
        },
        {
            "id": "hyzig0y",
            "score": 1,
            "text": "It time the US military and coalition forces stop Putin. He is committing crimes against humanity.",
            "title_similarity": "0.80972475",
            "sentiment_compound": -0.2263
        },
        {
            "id": "hyziwhv",
            "score": 1,
            "text": "War crime no, terrorism not so much. \n\n\nIt’s War it’s fucking horrible on the best days, maybe they should all have followed the Minsk agreement?",
            "title_similarity": "0.74627095",
            "sentiment_compound": -0.9268
        },
        {
            "id": "hz061vz",
            "score": -1,
            "text": "As if using civilians as human shields is not a war crime",
            "title_similarity": "0.32996207",
            "sentiment_compound": 0.7181
        },
        {
            "id": "hyy89wr",
            "score": -7,
            "text": "Zelensky has too much pride. He's trying to ask for help in the war but won't outright say \"please help us fight this war.\"\n\nPride always comes before the fall. And the rest of the world, especially here in the US, are weak cowards who don't have half the heart as Ukrainians show now in the midst of impending total destruction. \n\nI fucking hate how our world leaders talk all this fucking bullshit about war crimes and human rights and using our strong words to condemn their horren-\n\nNo. Shut the fuck up and DO something. The world is being ran by pussies and two mean countries, china and Russia, are finally calling the world's bluff. Cause they know our leaders ain't got the fucking balls to DO what's right. What an embarrassing sight.",
            "title_similarity": "0.64130986",
            "sentiment_compound": -0.9891
        },
        {
            "id": "hyxhxda",
            "score": 82,
            "text": "And he's fucking right\n\nI hope we get to see that bastard in Russia in the Hague. As well as every person involved in the planning. \n\nSlava Ukraini!",
            "title_similarity": "0.5503607",
            "sentiment_compound": 0.263
        },
        {
            "id": "hyxyzgl",
            "score": 10,
            "text": "Russia under Putin are an evil regime. \n\nPutin, Stalin & Hitler . All the same: murderous pigs.",
            "title_similarity": "0.7674146",
            "sentiment_compound": -0.8625
        },
        {
            "id": "hyy8ud9",
            "score": -9,
            "text": "Just a reminder to Zelensky; it's war and your country is under attack. Russia has some military power that can destroy the whole world. \n\nI'm not supporting Putin's actions at all. The reality is painful and, Zelensky and his military guys should make a perfect plan to stop this. When Russia starts to use missiles that will be really catastrophic.\n\nAnd I have a question to Zelensky, when Israel bombs Gazza and kills civilians would he consider that as a crime?",
            "title_similarity": "0.85190034",
            "sentiment_compound": -0.9744
        },
        {
            "id": "hyxpk1q",
            "score": 2,
            "text": "the guys gotta go bruh",
            "title_similarity": "0.28595355",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyxw4hx",
            "score": 2,
            "text": "Putin is the biggest terrorist in the world.",
            "title_similarity": "0.6385246",
            "sentiment_compound": -0.6908
        },
        {
            "id": "hyxy66n",
            "score": -2,
            "text": "Why is that in quotes? Its a litteral fucking warcrime",
            "title_similarity": "0.66965264",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyxyk86",
            "score": 2,
            "text": "War is crime. War is terrorism.",
            "title_similarity": "0.699895",
            "sentiment_compound": -0.9509
        },
        {
            "id": "hyy1cej",
            "score": -2,
            "text": "[removed]",
            "title_similarity": "0.20272559"
        },
        {
            "id": "hyy54xa",
            "score": 2,
            "text": "[deleted]",
            "title_similarity": "0.22977525"
        },
        {
            "id": "hyy6b0e",
            "score": 2,
            "text": "Sadly, I don't see a winning scenario for Ukraine. Putin will absolutely not allow himself to be embarrassed by leaving Ukraine as a loser. He will fight more ruthlessly the longer it takes. For all the support the world has show to Ukraine, no one is going to intervene militarily because of the nuclear threat.",
            "title_similarity": "0.581089",
            "sentiment_compound": -0.9511
        },
        {
            "id": "hyy7t87",
            "score": 2,
            "text": "These dumb fucks in the EU worried about their Gas supply from russia should wake up and realize it is well within Ukraine's reasonable defensive measures to begin counter attacking russian assets, including their source of revenue to fund the war effort.\n\nA couple cruise missiles to the existing fossil fuel pipelines will put Germany in a bad position That isn't as easy to recover from as just turning off the faucet for a while. If you turn off the faucet, you have the chance to turn it back on. If Ukraine destroys the russian pipeline to deny their enemy a revenue stream, you can't just turn it back on. you have to spend months rebuilding.\n\nWake up EU.\n\nAlso, with all their forces deployed and looking to the west, russia should keep in mind that their backside is turned to a bunch of rebels in the east/south. I can see the rebels giving russia a good up the bum set of hit and run raids to destroy fuel infrastructure, just as a general F You for all the years of suppression. EU should keep THIS in mind also.",
            "title_similarity": "0.7534067",
            "sentiment_compound": -0.9794
        },
        {
            "id": "hyyhr3z",
            "score": -2,
            "text": "I didn't know there were rules in war.",
            "title_similarity": "0.4330871",
            "sentiment_compound": -0.5994
        },
        {
            "id": "hyyixf3",
            "score": -2,
            "text": "As dirty as this is the saying goes all is fair in love and war.",
            "title_similarity": "0.47722283",
            "sentiment_compound": -0.0772
        },
        {
            "id": "hyyulq7",
            "score": -2,
            "text": "Passenger Pigeon   extermination was of the new source of food..\n\nWHEAT not over hunting...\nThe bird could not digest this new diet. The wheat would ferment in the birds stomach causing a drunkrness where many flew into  barns etc, killing them.",
            "title_similarity": "0.517435",
            "sentiment_compound": -0.6597
        },
        {
            "id": "hyy0fct",
            "score": -2,
            "text": "[deleted]",
            "title_similarity": "0.22977525"
        },
        {
            "id": "hyy2nik",
            "score": 3,
            "text": "Trump:  Putin is genius and smart guy\n\nEverybody else:  Putin is a terrorist.",
            "title_similarity": "0.5924487",
            "sentiment_compound": -0.4588
        },
        {
            "id": "hyy5sk4",
            "score": -3,
            "text": "He can call whatever he wants. Like before. But all turns out to be fake.",
            "title_similarity": "0.32113355",
            "sentiment_compound": -0.5267
        },
        {
            "id": "hyy7vlz",
            "score": 3,
            "text": "You can start seeing the lack of sleep on his eys",
            "title_similarity": "0.22237453",
            "sentiment_compound": -0.3182
        },
        {
            "id": "hyycpqj",
            "score": 2,
            "text": "Guys, can anyone know if there is an opportunity in your country for a Russian to migrate to you? My country is fucked up, no one here gives a fuck about what's going on around here, and I absolutely do not want any part of it. I don't want to live among passive assholes who turn a blind eye, I don't want to live among fucking genetic slaves. Can you please tell me if this is an option?",
            "title_similarity": "0.6243273",
            "sentiment_compound": -0.9184
        },
        {
            "id": "hyyhdv9",
            "score": -3,
            "text": "War is war. They can do whatever they want and nobody can stop them.",
            "title_similarity": "0.43396816",
            "sentiment_compound": -0.8658
        },
        {
            "id": "hyzaa14",
            "score": 3,
            "text": "I really don’t understand how we (as in the rest of the world) can sit back and watch these atrocities happen?",
            "title_similarity": "0.47475678",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyymgb8",
            "score": 13,
            "text": "Putin has LOST.  He might not know it yet, but he has lost:\n* the world has seen through his lies, and he has unified the world against Russia.\n* the truth of how he has invaded Ukraine with force, unnecessarily killing Russian troops who were just following orders, cannot be covered up… no matter how hard he tries.  Russians will be embarrassed to discover that Putin is the new Hitler and that he is responsible for killing his own people AND his “brothers” in Ukraine.  \n* USA has not taken the bait.  He can’t blame the USA, because we aren’t there.  The people he is fighting and killing are not Westerners.\n* the sanctions put on Russia have killed its economy already, and they are designed to hurt over a long period of time, so it’s only getting worse.\n* not only is the economy ruined, but Ukraine is putting up a good fight, and with every piece of equipment that is damaged, it weakens his own military and with the sanctions, it will be difficult for Russia to rebuild this army.\n* even if Putin takes Ukraine, he’s bombing the hell out of it.  The cost to rebuild is going to be a huge burden on Russia. And Ukrainians who survive after witnessing what Russia did to them… they will never be proud of Russia.  They will hate Putin forever.  This is unforgivable.  This fight will continue- this region will be unstable under Russian control. \n* To this point, the world hates Putin.  They don’t hate Russians… but if Russians support their leader in forcefully killing their own people and their own brothers in Ukraine… soon the world will hate Russians.  The next generations of Russians will be embarrassed and they will despise their own heritage.  “Russian pride” will be similar to “Nazi Pride” - it will be shameful.  \n* Putin has lost.  Even if he wins this war, Putin has LOST.  The only question now is, will Russians join him and lose their honor?  Or will Russians regain their pride by stopping the killing and no longer following Putin?  If they revolt against Putin, they might save their heritage.",
            "title_similarity": "0.77546644",
            "sentiment_compound": -0.9991
        },
        {
            "id": "hyxsd80",
            "score": 282,
            "text": "A serious question:\n\nWhat do you think the final line is before the Allies intervene with actual force?  I mean, we are witnessing war crimes.  And with the time we are in, we see them in real time and HD, spread across the world.",
            "title_similarity": "0.67118263",
            "sentiment_compound": -0.6369
        },
        {
            "id": "hyyfgg9",
            "score": 3,
            "text": "It is.\n\nHow do you solve a problem like Putin? We've been here before with Hitler. National grievances. Overweening power.\n\nHitler did not have the ability to end the world in an afternoon however, so this naturally gives us pause. History would suggest the correct course of action here is to go on the offensive against this mad dog. Bomb Russian columns with NATO jets, attack their staging grounds, pound THEIR media towers and government buildings with cruise missiles. How do you like Might making things Right ***now*** Putin supporters?\n\nRetaliation. Escalation. Thermonuclear strikes and the end of civilisation.\n\nSo Putin gets what he wants, again. Let's not delude ourselves, if the threat of nuclear annihilation works this time it will work pretty much every time. So next on the chopping block, in response to *Illegitimate Western Sanctions*, of course, will be Latvia, Estonia, northern Poland and Finland.\n\nNATO members! NATO's response will be nuclear! It will not. It will be conventional. Things will escalate. Will NATO go nuclear first? no. It will back down. Putin will get what he wants.\n\nAgain.\n\nPutin will keep getting what he wants until Western leaders are forced to dance nude while  blowing him kisses and signing over their birthrights to him personally.\n\nAt some point you take a spade to his fevered head, while you still can. And we've reached that point. NATO forces should, surprisingly and swiftly and efficiently and devastatingly tear Putins' invasion forces to pieces. Then let him decide if he wants to escalate.\n\nThis is man that sits 20 ft away from other world leaders in case he gets covid. He is a coward, a liar, a bully and a drug addled NAZI. It's time to grow a spine and *smash* his comfortable little velvet cocoon, spill his vodka, free his concubines, and give the Russian people **the help and friendship they** ***should*** **have received** when the Soviet Union Collapsed.\n\nPutin is a paper thin shithead. He will fold instantly. His 'friends' will rip his bollocks off.",
            "title_similarity": "0.742425",
            "sentiment_compound": -0.9285
        },
        {
            "id": "hyyue06",
            "score": 5,
            "text": "Russian propagandists everywhere in this posts comments",
            "title_similarity": "0.41781354",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyx4cec",
            "score": 767,
            "text": "Bombing civilian sites under the excuse of having potential combatants in the area. Where have I heard that one before.",
            "title_similarity": "0.7005744",
            "sentiment_compound": 0.0772
        },
        {
            "id": "hyy4go7",
            "score": 6,
            "text": "Zelensky calls a deliberate war crime a war crime",
            "title_similarity": "0.77764785",
            "sentiment_compound": -0.9413
        },
        {
            "id": "hyyaeja",
            "score": 6,
            "text": "Please help Ukraine!! They are bombing civilians. Same thing happened in Poland in 1939 and no one did anything. This is atrocity in 2022, west needs to send troops to help them defeat and prosecute Putin for war crimes against humanity, just like in WW2. They cannot do it alone",
            "title_similarity": "0.74875796",
            "sentiment_compound": -0.3493
        },
        {
            "id": "hyy443r",
            "score": 7,
            "text": "Lemme get this straight. Russia 1. Is a terrorist state 2. Has oil. 3. Has WMDs. \n\nHmmmmmmmmmmmmmmmmmmmm",
            "title_similarity": "0.7732011",
            "sentiment_compound": -0.5537
        },
        {
            "id": "hyy22hd",
            "score": -8,
            "text": "[removed]",
            "title_similarity": "0.20272559"
        },
        {
            "id": "hyy7oeq",
            "score": 10,
            "text": "Yet the world is STILL buying Russian oil. They're literally helping finance this",
            "title_similarity": "0.42554006",
            "sentiment_compound": 0.296
        },
        {
            "id": "hyygqau",
            "score": -9,
            "text": "Yea attacking white countries is a war crime",
            "title_similarity": "0.698966",
            "sentiment_compound": -0.886
        },
        {
            "id": "hyxw9hj",
            "score": 44,
            "text": "Isn't the entire invasion a war crime?",
            "title_similarity": "0.7649466",
            "sentiment_compound": -0.8126
        },
        {
            "id": "hyy2a4e",
            "score": -10,
            "text": "[removed]",
            "title_similarity": "0.20272559"
        },
        {
            "id": "hyy7thj",
            "score": -8,
            "text": "Why is that a war crime. In war you do what you can to win",
            "title_similarity": "0.6010238",
            "sentiment_compound": -0.8176
        },
        {
            "id": "hyxxamb",
            "score": -9,
            "text": "[removed]",
            "title_similarity": "0.20272559"
        },
        {
            "id": "hyxy4nj",
            "score": 10,
            "text": "Russia striking civilians period. Regardless of my opinion on the matter (for the record: fuck Russia), that seems like a particularly grotesque strategy. And I’m well aware my country has done it in other places too, it’s in no way a double standard. It’s bad enough to even need wars in this day and age, to send people to die unnecessarily, but worse when you’re targeting regular folks like Russia is. “State terrorism” indeed.",
            "title_similarity": "0.7958869",
            "sentiment_compound": -0.8126
        },
        {
            "id": "hyx2v0k",
            "score": 1811,
            "text": "Can we just rename Russia to North North Korea?",
            "title_similarity": "0.4687761",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyy0mfz",
            "score": -12,
            "text": "[removed]",
            "title_similarity": "0.20272559"
        },
        {
            "id": "hyxqn80",
            "score": 178,
            "text": "\"de-nazification\" by desecrating a memorial dedicated to Holocaust victims. Makes total sense/s",
            "title_similarity": "0.66536725",
            "sentiment_compound": 0.1779
        },
        {
            "id": "hyxe2xu",
            "score": 382,
            "text": "Putler is a war criminal and should be tried for crimes against humanity.",
            "title_similarity": "0.7245019",
            "sentiment_compound": -0.8074
        },
        {
            "id": "hyx5nrq",
            "score": -38,
            "text": "[removed]",
            "title_similarity": "0.20272559"
        },
        {
            "id": "hyy1rsd",
            "score": 39,
            "text": "Fact: the UN Ukrainian-English interpreter broke down momentarily due to the sheer emotional impact of Zelensky’s speech.\n\nLink: https://www.washingtonpost.com/world/2022/03/01/interpreter-breaks-down-during-zelenskys-speech-european-union/",
            "title_similarity": "0.5890358",
            "sentiment_compound": -0.296
        },
        {
            "id": "hyxqbzn",
            "score": 107,
            "text": "The Russian narrative on this incident is that the missile was launched from the Ukraine army in order to facilitate a false flag operation.\nInterestingly, lots of serbian news websites write the exact same thing, stating that the missile could have not come from the russian army because of the angle of the impact and so forth.\nThe arguments of  the anti-western propaganda agencies remind me of the flat earther theories..its completely insane",
            "title_similarity": "0.81492984",
            "sentiment_compound": -0.5799
        },
        {
            "id": "hyxjbty",
            "score": -19,
            "text": "[removed]",
            "title_similarity": "0.20272559"
        },
        {
            "id": "hyx2uaf",
            "score": 726,
            "text": "“So that’s the kind of fight it’s gonna be.” \n\nEdit\n\nAlright, I chose to use the word “stuff”, because it sounded nice. I didn’t want a kid to read the stronger version. \nSince this war is happening, I heard that Ukraine president is a comedian and I just know, light hearted humor helps morale the troops. That’s all.  My bad for causing any offense, it was not meant. Peace and prayers to you all. Good night.",
            "title_similarity": "0.5303662",
            "sentiment_compound": 0.0083
        },
        {
            "id": "hyxmlqz",
            "score": 684,
            "text": "[removed]",
            "title_similarity": "0.20272559"
        },
        {
            "id": "hyxor7c",
            "score": 43,
            "text": "Putin goes after those strategic grandmothers.",
            "title_similarity": "0.48821676",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyxyjrz",
            "score": 184,
            "text": "Russia is coming to \"liberate\" the people of Ukraine from it's democratic government by recklessly tossing missiles into residential areas and deploying ridiculous weapons like the TOS-1a whos only purpose is widespread death and destruction... \n\n\nThis is like the aliens in Mars Attacks running around shouting \"we come in peace\" while exterminating everyone.",
            "title_similarity": "0.7969954",
            "sentiment_compound": -0.8126
        },
        {
            "id": "hyxx7im",
            "score": 357,
            "text": "He's correct. Directly targeting non-military targets violates the Geneva and Hague Conventions (Law of Armed Conflict, LOAC) and International Humanitarian Law (IHL)\n\n[https://www.genevacall.org/wp-content/uploads/dlm\\_uploads/2013/11/The-Law-of-Armed-Conflict.pdf](https://www.genevacall.org/wp-content/uploads/dlm_uploads/2013/11/The-Law-of-Armed-Conflict.pdf)",
            "title_similarity": "0.615156",
            "sentiment_compound": -0.6808
        },
        {
            "id": "hyxn9dd",
            "score": 2944,
            "text": "Unfortunately, I think we're about to see a real escalation of violence in the next few days.  The Russians initially came in lightly thinking they weren't going to meet much resistance, but obviously the Ukrainians are putting up a much stiffer fight than Putin predicted.\n\nNow the Russians are committed.  They can't withdraw after a bloody nose.  They'd look weak in the eyes of the world.  Which is completely unacceptable to Putin.  The Russians are going to be coming in much heavier and will be employing much more aggressive tactics.  I think we're about to see some of the more brutal tactics used in Chechnya and Syria make an appearance in Ukraine, and the casualties (both military and civilian) are going to start to really ramp up as a consequence.",
            "title_similarity": "0.6500809",
            "sentiment_compound": -0.9789
        },
        {
            "id": "hyx65p5",
            "score": 520,
            "text": "Add it to the pile they've already accumulated.",
            "title_similarity": "0.12426013",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyxqlq1",
            "score": 4853,
            "text": "\"de-nazification\" by desecrating a memorial dedicated to Holocaust victims. Makes total sense/s",
            "title_similarity": "0.66536725",
            "sentiment_compound": 0.1779
        },
        {
            "id": "hyxo7vi",
            "score": 734,
            "text": "So sad, the audacity for them to request talks while still doing this",
            "title_similarity": "0.39536816",
            "sentiment_compound": -0.5256
        },
        {
            "id": "hyx2hkg",
            "score": 6567,
            "text": "From the article:\n\n> Ukrainian President Volodymyr Zelensky called Russia's missile strike on Kharkiv's Freedom Square a \"war crime\" and \"state terrorism.\"\n\n> “This attack on Kharkiv is a war crime. This is state terrorism of the Russian Federation,\" Zelensky said in a video statement posted on Telegram on Tuesday. \"After that, Russia is a terrorist state, obviously.\"\n\n> Zelensky said that Freedom Square in Ukraine's second-largest city was hit on Tuesday by a cruise missile strike and that there were \"dozens of victims.\" It was not immediately clear how many individuals were killed or injured.",
            "title_similarity": "0.9016218",
            "sentiment_compound": -0.9892
        },
        {
            "id": "hyy3kg4",
            "score": 236,
            "text": "The entire Russian invasion is a crime against humanity.",
            "title_similarity": "0.7927917",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hyxtlnt",
            "score": 2,
            "text": "He looks so exhausted.",
            "title_similarity": "0.1019261",
            "sentiment_compound": -0.5009
        },
        {
            "id": "hyxtneu",
            "score": 1,
            "text": "I have a bad feeling that the tide is about to turn in Russia’s favor in Ukraine.",
            "title_similarity": "0.54261345",
            "sentiment_compound": -0.0772
        },
        {
            "id": "hyxvtir",
            "score": 3,
            "text": "Be prepared for Putin to follow the Chechnya model:  Install a puppet government which in turn will use brutal methods to exert total control so he can keep his own hands clean.",
            "title_similarity": "0.6306231",
            "sentiment_compound": -0.128
        },
        {
            "id": "hyxvvlk",
            "score": 2,
            "text": "Well it is, objectively, but what's anyone even gonna do about it.",
            "title_similarity": "0.2162193",
            "sentiment_compound": 0.1406
        },
        {
            "id": "hyxwodb",
            "score": 3,
            "text": "the word war crimes is a gateway word to getting other nations involved",
            "title_similarity": "0.53068155",
            "sentiment_compound": -0.5994
        },
        {
            "id": "hyxx2vq",
            "score": 1,
            "text": "Why is no one doing anything about it?",
            "title_similarity": "0.2392742",
            "sentiment_compound": -0.296
        },
        {
            "id": "hyxxasa",
            "score": 3,
            "text": "Explanation for the confused: the world has witnessed Russia do these things to Ukraine, as well as to other places. What difference would it make if it was classified as an act of terror? Wouldn't Putin continue to do what he's doing now, regardless of what other countries are saying? He's been hit with sanctions, cyber attacks, removal of important international opportunities, etc. and continues this invasion. Why would being called terrorist change anything? To be clear: NOT SUPPORTING RUSSIA, I just don't understand what the difference would be.",
            "title_similarity": "0.785524",
            "sentiment_compound": -0.8654
        },
        {
            "id": "hyxxlto",
            "score": 1,
            "text": "In war is it that important to publicly denounce the opposing country? Like at this point doesn't it appear obvious?",
            "title_similarity": "0.65677464",
            "sentiment_compound": -0.5204
        },
        {
            "id": "hyxy3su",
            "score": 2,
            "text": "Mmm poo",
            "title_similarity": "0.10011874",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyy0j8y",
            "score": 2,
            "text": "I think we should resurrect the soul of George Washington and crown him god emperor of America.",
            "title_similarity": "0.47652352",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hyy0reo",
            "score": 1,
            "text": "[Thread](https://www.reddit.com/r/worldnews/comments/t3vdv8/russian_news_agency_publishes_then_deletes/) and [direct link to archive](https://web.archive.org/web/20220226051154/https://ria.ru/20220226/rossiya-1775162336.html)",
            "title_similarity": "0.47504044",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyy1o1w",
            "score": 2,
            "text": "Yeah guys, it’s easy to express your opinion when you outside Russia and Ukraine. Inside Russia it’s like tv show, you can just sit and watch…if you want to be against war, so, as minimum you will lose your job, your money will be arrested, it will ruin your life and family…police and special forces everywhere on the streets. Older people watches TV shows controlled by state, and they believe Ukrainian people are nazis! Total misinformation. As a matter of fact, there is propaganda even in Europe news, so there is no source of truth for people around the world. War is baddest thing that can happen, nobody in Russia wanted war! The only future that I can accept, is outside this country. My homeland is not mine anymore. Homeland is where you are in safe and your family don’t afraid to be involved in WAR. Peace to the world ✌️",
            "title_similarity": "0.67537117",
            "sentiment_compound": -0.927
        },
        {
            "id": "hyy1xfl",
            "score": 1,
            "text": "I keep hearing people talk about the nuances of the definition of \"war crimes\" and saying that official buildings are considered \"fair game\". \n\nMy question: does the Geneva Convention take into account the reluctance of the other \"side\" in the conflict? I mean, most wars end up with some kind of casus belli to set things off to justify looking like the good guys, but if you're just chilling doing your thing and your neighbor country decides they want to invade, does that make otherwise \"legal\" acts of war okay?\n\nBasically: are wars ever so without legitimate pretext that any and all military acts are considered illegal?",
            "title_similarity": "0.6087234",
            "sentiment_compound": -0.953
        },
        {
            "id": "hyy2mmd",
            "score": 1,
            "text": "Does Ukraine have traditional military sites to hit? War seems to not be a term that should be used anymore. War should mean destroying whatever the fuck is in front of you.",
            "title_similarity": "0.6979589",
            "sentiment_compound": -0.9423
        },
        {
            "id": "hyy2q94",
            "score": 3,
            "text": "Fuck Putin",
            "title_similarity": "0.52721196",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hyy2w85",
            "score": 5,
            "text": "At this point Putin should just fake his own death, get facial reconstruction surgery, and spend the rest of his worthless life in oblivion.\n\nThere’s no other way out for him, I truly believe the Russians oligarchs won’t allow him to resort to nuclear warfare. If he doesn’t stage his death he will hang.",
            "title_similarity": "0.6265757",
            "sentiment_compound": -0.9246
        },
        {
            "id": "hyy316a",
            "score": 3,
            "text": "Any one notice the Russian sub saying that the reason schools are getting attacked is because the military is putting tanks / vehicles on school properties? Then shows a picture of some tanks and armored cars defending a school. \n\nRussia is probably going to come out saying that it was attacked because it was a command center, with no proof and only a photo of some military members defending it since Russia had invaded it and been killing civilians when they were there. \n\nThey attack civilians, Ukraine setups protections for civilians, then Russia claims they can attack 'around' civilians because of the protections setup by Ukraine.",
            "title_similarity": "0.7717739",
            "sentiment_compound": -0.9571
        },
        {
            "id": "hyy3641",
            "score": 6,
            "text": "So, like after ww2, can we start prosecution of these crimes?",
            "title_similarity": "0.5458331",
            "sentiment_compound": -0.1779
        },
        {
            "id": "hyy3hzm",
            "score": 1,
            "text": "Пошёл он на хер наркоман и нацист ублюдок!",
            "title_similarity": "0.2988878",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyy4qc5",
            "score": 3,
            "text": "Isn't attacking civilians a war crime as well?",
            "title_similarity": "0.6352355",
            "sentiment_compound": -0.5886
        },
        {
            "id": "hyy614r",
            "score": 1,
            "text": "It is!!",
            "title_similarity": "0.00046859495",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyy70gd",
            "score": 2,
            "text": "that's because \"it was\"",
            "title_similarity": "0.066310115",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyy72lq",
            "score": 2,
            "text": "Was it also state terrorism when he was shelling Donbas?",
            "title_similarity": "0.70099103",
            "sentiment_compound": -0.6808
        },
        {
            "id": "hyy75q0",
            "score": 1,
            "text": "Like they give a shit",
            "title_similarity": "0.17660454",
            "sentiment_compound": -0.2732
        },
        {
            "id": "hyy7ad2",
            "score": 2,
            "text": "Doesn't really meet the definition.",
            "title_similarity": "0.22271615",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyy7lv1",
            "score": 2,
            "text": "I will weep genuine tears if anything happens to this guy",
            "title_similarity": "0.39960223",
            "sentiment_compound": -0.6808
        },
        {
            "id": "hyy7p7y",
            "score": 1,
            "text": "No kiddin’! I called it the same thing.",
            "title_similarity": "0.15660782",
            "sentiment_compound": -0.3595
        },
        {
            "id": "hyy8an1",
            "score": 10,
            "text": "And he's right. This whole invasion is a terrorist attack",
            "title_similarity": "0.7228335",
            "sentiment_compound": -0.8316
        },
        {
            "id": "hyy9ka7",
            "score": 6,
            "text": "Clearly the actions of psychopaths who wish to inflict terror and pain on their victims. Grotesque.",
            "title_similarity": "0.6448135",
            "sentiment_compound": -0.5574
        },
        {
            "id": "hyya85n",
            "score": 5,
            "text": "They are now cluster bombing cities.",
            "title_similarity": "0.67181295",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyya8wb",
            "score": 6,
            "text": "The missile in question was a Khaliber cruise missile. The takeaway message was how utterly imprecise the Russian missile is. The U.S. Tomahawk can hit within 10 meters without GPS, and 10 cm with GPS. If that building was a military asset filled with radios and staff, they probably would be able to keep functioning.",
            "title_similarity": "0.6253736",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hyyad1k",
            "score": 4,
            "text": "Holy shit, no amount of Russian operative social media comments are going to counteract those images of that non-military building with cars driving in front of it being blasted.\n\nI’m seeing some of these obvious Russian trolls/operatives’ comments and thinking “wow, you guys’ country is over and they don’t even realize it yet.”\n\nPoor bastards, they just signed their own death certificates.",
            "title_similarity": "0.69794756",
            "sentiment_compound": -0.9501
        },
        {
            "id": "hyyb259",
            "score": 1,
            "text": "So Poland and other countries not sending them airplanes anymore? Or yes?",
            "title_similarity": "0.45667168",
            "sentiment_compound": 0.4696
        },
        {
            "id": "hyyb919",
            "score": 3,
            "text": "real blood is on Russian oligarchs who turned blind eye on Putler for past decade plus, despite knowing full well the danger of doing so. as long as Putler was on their side and helped them get their wallets fatter, they let Putler stay in power and get away with all kinds of murders, censorship, and terrorist activities. \n\nnow shit is really hitting the fan thanks to Russian oligarchs",
            "title_similarity": "0.65107536",
            "sentiment_compound": -0.9408
        },
        {
            "id": "hyycoiz",
            "score": 1,
            "text": "I mean, it was, so what else would he call it.",
            "title_similarity": "0.13706934",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyyd63u",
            "score": 2,
            "text": "The world seems to be super comfy with him using questionable bombs on the ukraine as long as he doesn't use them on us",
            "title_similarity": "0.5457399",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hyydzgb",
            "score": 1,
            "text": "https://twitter.com/njohnson_145/status/1498752993558106112?s=21",
            "title_similarity": "0.17252396",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyyecla",
            "score": 1,
            "text": "What’s the consequences of war crimes? Seems like world is going to let Russia invade and massacre Ukraine into submission and eventually we all go back to business.",
            "title_similarity": "0.7262007",
            "sentiment_compound": -0.34
        },
        {
            "id": "hyyevlz",
            "score": 1,
            "text": "Facts",
            "title_similarity": "-0.0043943534",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyyevtl",
            "score": 3,
            "text": "This is like an attack on the Washington Monument or the Lincoln Memorial for Americans.",
            "title_similarity": "0.64868003",
            "sentiment_compound": -0.1531
        },
        {
            "id": "hyyfdwf",
            "score": 3,
            "text": "I wish people had cared this much for the last 40 years. Could have prevented a lot of strife. But I guess it wasn't cool when it was the US and Russia doing it to Syria, Iraq, and Afghanistan.",
            "title_similarity": "0.5499348",
            "sentiment_compound": 0.0918
        },
        {
            "id": "hyyfeuh",
            "score": 1,
            "text": "It was a war crime the second he threatened invasion.",
            "title_similarity": "0.7197124",
            "sentiment_compound": -0.886
        },
        {
            "id": "hyyfmhj",
            "score": 6,
            "text": "If Russia wins this there is no going back. I hope Ukraine and Moldova are worth it, because after this Russia is going to be more isolated than North Korea.",
            "title_similarity": "0.48644617",
            "sentiment_compound": 0.5729
        },
        {
            "id": "hyyfuvz",
            "score": 8,
            "text": "He isn't wrong. Those are the definition of words. He is intentionally bombing civilians, a war crime, and he is doing it with cluster bombs to maximize the terror and chaos.",
            "title_similarity": "0.68949026",
            "sentiment_compound": -0.9177
        },
        {
            "id": "hyyg0x5",
            "score": 1,
            "text": "So if nato countries say the same, we will eventually have wwiii? Is there any company prepare for that yet?",
            "title_similarity": "0.34338415",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyyg5xw",
            "score": 2,
            "text": "Can’t be a war crime. Russia is only on a peace keeping mission. No war here /s",
            "title_similarity": "0.40839803",
            "sentiment_compound": -0.1911
        },
        {
            "id": "hyygtgu",
            "score": 1,
            "text": "I do believe that the sanctions and the cutting off of monies will have a huge effect on the people of Russia.  The ordinary citizens do not want a war.\n\nNATO needs to step up!  \n\nPutin should be put on trial in Russia!",
            "title_similarity": "0.7172867",
            "sentiment_compound": 0.6495
        },
        {
            "id": "hyyhmmy",
            "score": 1,
            "text": "If the rest of the world doesn’t get involved this will be another 20 year occupation war",
            "title_similarity": "0.4820145",
            "sentiment_compound": -0.5994
        },
        {
            "id": "hyyhngb",
            "score": 1,
            "text": "I wonder if Putin will live to see a trial at The Hague.",
            "title_similarity": "0.4464737",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyyillv",
            "score": 1,
            "text": "We all need to call on Kim Jong Un to save the day. He's our only hope. Only Kim Jong is crazy and enough to actually call Putin on his nuclear threat with a threat of his own and believable enough to have it work. Help us, Kimmy!",
            "title_similarity": "0.64874476",
            "sentiment_compound": -0.1759
        },
        {
            "id": "hyyinji",
            "score": 2,
            "text": "NSFW *Graphic warning* Aftermath of 3/01/22 kiev explosion.\n\nhttps://twitter.com/njohnson_145/status/1498760386702544901?s=21",
            "title_similarity": "0.5468383",
            "sentiment_compound": -0.34
        },
        {
            "id": "hyyknts",
            "score": 1,
            "text": "It is a crime, so is invading a country just because you miss the old days.",
            "title_similarity": "0.6161473",
            "sentiment_compound": -0.6249
        },
        {
            "id": "hyyl8a1",
            "score": 1,
            "text": "Rules broken without consequence seems to be an international problem. Why is no one held accountable for anything anymore?",
            "title_similarity": "0.48292908",
            "sentiment_compound": -0.7906
        },
        {
            "id": "hyylkcb",
            "score": 1,
            "text": "What is the most probable way this will end? Ww3, MAD, some kind of agreement?",
            "title_similarity": "0.44065458",
            "sentiment_compound": -0.3369
        },
        {
            "id": "hyymwaf",
            "score": 6,
            "text": "Um… obviously. The whole fucking thing’s a war crime",
            "title_similarity": "0.73284376",
            "sentiment_compound": -0.8255
        },
        {
            "id": "hyyn68h",
            "score": 6,
            "text": "It is a war crime..unfathomable that this is happening in 2022. Putin is a war criminal and his judgement day will come",
            "title_similarity": "0.7765903",
            "sentiment_compound": -0.9042
        },
        {
            "id": "hyynk5o",
            "score": 2,
            "text": "Russians now can either revolt against Putin or accept losing tons of their own people and kill all the people left in Ukraine over his senseless war. I want to think they will make the right choice but I don’t have a lot of faith.",
            "title_similarity": "0.6957662",
            "sentiment_compound": -0.1154
        },
        {
            "id": "hyyo3l1",
            "score": 6,
            "text": "and he is absolutely right.",
            "title_similarity": "-0.010735053",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyyowkp",
            "score": 1,
            "text": "The memorials in Freedom Square are irreplacable. Such a rich history, and Russia is leveling it all.",
            "title_similarity": "0.6881133",
            "sentiment_compound": 0.8316
        },
        {
            "id": "hyypmvv",
            "score": 1,
            "text": "bc it is",
            "title_similarity": "0.019380651",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyyq8hg",
            "score": 1,
            "text": "Crazy idea - what if NATO decides to place troops in Ukraine to participate in the “Denazification”, whereby there are few to none, and then asking Russia, “k, now what?” Just call their bluff. I’m not a political scientist so tell me why this might be a bad idea but, I don’t see how else you stand up to a bully.",
            "title_similarity": "0.6921837",
            "sentiment_compound": -0.8047
        },
        {
            "id": "hyyqlr8",
            "score": 2,
            "text": "[deleted]",
            "title_similarity": "0.22977525"
        },
        {
            "id": "hyyqotb",
            "score": 1,
            "text": "Putin needs to come to trial in Den Haag",
            "title_similarity": "0.5411351",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyysmwl",
            "score": 1,
            "text": "What was the actual target? \n\nLooks like Putin's missile just hit a bunch of cars and pedestrians",
            "title_similarity": "0.71843743",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hyysnfd",
            "score": 2,
            "text": "God this poor man. I feel for him so much and I feel for all of these people. Russia has been so damn nasty. I've never seen so many war crimes being committed on camera in my life from them. It's disgusting and heartbreaking.",
            "title_similarity": "0.6188464",
            "sentiment_compound": -0.9574
        },
        {
            "id": "hyytf16",
            "score": 2,
            "text": "I think Zelensky not being a career politician in the slightest sense has really made us take notice. So many times heads of state are whisked away to stronger, mostly western states, when their country crumbles. Zelensky didn't get that memo, and is on the ground, with the people, not batting an eyelid against the world's richest and most megalomaniacal dictators. Time will tell what he accomplishes with Ukraine in the years to come, but even without that, his presence in the moment should be remembered and heralded for many ages to come. What a man",
            "title_similarity": "0.5327554",
            "sentiment_compound": 0.5927
        },
        {
            "id": "hyyts2r",
            "score": 2,
            "text": "Not the only war crime",
            "title_similarity": "0.4770453",
            "sentiment_compound": -0.091
        },
        {
            "id": "hyyu7wp",
            "score": 1,
            "text": "Very true and it is awful. Unfortunately, Putin doesn’t give a rat’s ass.",
            "title_similarity": "0.4706446",
            "sentiment_compound": -0.701
        },
        {
            "id": "hyywhb9",
            "score": 3,
            "text": "The Nuremberg prosecutors concluded that the ultimate war crime is a war of aggression against a sovereign country.  \n\n(Source: 50th anniversary of Nuremberg Prosecutors, Washington, DC)",
            "title_similarity": "0.7683047",
            "sentiment_compound": -0.926
        },
        {
            "id": "hyywzoo",
            "score": 1,
            "text": "☁️",
            "title_similarity": "-0.0039704368",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyyy1pn",
            "score": 1,
            "text": "More awareness",
            "title_similarity": "-0.055635322",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyyy2pb",
            "score": 3,
            "text": "And it is",
            "title_similarity": "-0.04285017",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyyzycl",
            "score": 2,
            "text": "I’ve seen people watching this happen like it’s a reality TV show. The reality star president is gone. This is a president who cares about his people and his country",
            "title_similarity": "0.48288223",
            "sentiment_compound": 0.6705
        },
        {
            "id": "hyz071r",
            "score": 1,
            "text": "I totally get definitions and all that. But like wouldn't a military invasion of another country be an act of state terrorism. It's literally displacing people and killing a lot of people are sure the military might not be intending to kill civilians but every time a country has invaded another country there have been deaths of civilians. Like you have thousands of deaths of people crashing into people every year. You would think a military invasion would kill people that aren't intended to be killed when the intent is to actually kill people lol.",
            "title_similarity": "0.6822169",
            "sentiment_compound": -0.9864
        },
        {
            "id": "hyz0g1v",
            "score": 1,
            "text": "Poor guy looks unbelievably tired in that thumbnail...",
            "title_similarity": "0.25871807",
            "sentiment_compound": -0.7425
        },
        {
            "id": "hyz0hav",
            "score": 1,
            "text": "I mean. He's factually correct.",
            "title_similarity": "0.02866356",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyz3pmn",
            "score": 2,
            "text": "Genuinely curious about this: intentionally targeting civilians is a war crime, but how does that work when the Ukrainian government is arming civilians? How would Russia differentiate between unarmed civilians and armed civilians?\n\nThis issue propped up in Afghanistan with the US military as well, regarding enemy combatants hiding amongst civilians.",
            "title_similarity": "0.7884775",
            "sentiment_compound": -0.8523
        },
        {
            "id": "hyz4e83",
            "score": 1,
            "text": "Honestly, I don't think we can expect he'll be alive too much longer since he's saying the parts out loud Putin won't tolerate. Sadly this is Putin's primary MO.",
            "title_similarity": "0.5167078",
            "sentiment_compound": 0.7865
        },
        {
            "id": "hyz4l8t",
            "score": 2,
            "text": "Just a message to Ukraine, protect your guy at all costs!  Keep him safe! \n\nJust a few more days, we hope!",
            "title_similarity": "0.26618987",
            "sentiment_compound": 0.8604
        },
        {
            "id": "hyz5ebr",
            "score": 1,
            "text": " I've always had nightmares that would end with a nuclear explosion I really don't want this to become a reality, Putler has gone completely nuts with all the bombing. When the war is over the destruction will still be there and all the dead people will stay dead, the damage cannot be undone, fuck",
            "title_similarity": "0.65126234",
            "sentiment_compound": -0.9668
        },
        {
            "id": "hyz6mlt",
            "score": 1,
            "text": "Zelensky looks exhausted. Slava Ukraine.",
            "title_similarity": "0.2691545",
            "sentiment_compound": -0.3612
        },
        {
            "id": "hyz6p8n",
            "score": 1,
            "text": "How much people died in this tragic event.",
            "title_similarity": "0.432651",
            "sentiment_compound": -0.765
        },
        {
            "id": "hyz7bkw",
            "score": 1,
            "text": "If you're looking for a good way to help, Revived Soldiers Ukraine is a charity that provides transportation to hospitals in and out of Ukraine and medical care for injured Ukrainian soldiers. Don't just be an observer... An injustice anywhere is an injustice everywhere.",
            "title_similarity": "0.42507508",
            "sentiment_compound": 0.128
        },
        {
            "id": "hyz7f57",
            "score": 1,
            "text": "He's spot on. \nIt shows how bad living under Russian rule is by how hard the people of Ukraine are fighting to not go back to that kind of ruling state.\nThey truly have something to fight for.",
            "title_similarity": "0.64150333",
            "sentiment_compound": -0.7269
        },
        {
            "id": "hyz7sg3",
            "score": 2,
            "text": "Putin is finished.",
            "title_similarity": "0.2733389",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyz8nt9",
            "score": 3,
            "text": "It's a fact that it happened and complete bullshit to call it anything different.",
            "title_similarity": "0.45875782",
            "sentiment_compound": -0.5859
        },
        {
            "id": "hyzaj9b",
            "score": 3,
            "text": "Will the world step in and assist Ukraine militarily if Russia appears on the brink of victory?  \n\nIt seems at this point that Putin is all in and will stop at nothing until Russia 'conquers' Ukraine... even it if means crippling his own country economically.  I don't see how Russia ever recovers from this.  The world will never forgive them for many many decades to come.  They will be outcasts on the world stage.\n\nIt's a frightening prospect to entertain other Western nations engaging Russia in direct warfare.  Everything is on the table at that point... the proverbial WW3.\n\nBut just leaving Ukraine to fight this alone (albeit with indirect Western support) seems like such an injustice for these brave people.",
            "title_similarity": "0.7056356",
            "sentiment_compound": -0.1734
        },
        {
            "id": "hyzbc1g",
            "score": 1,
            "text": "Next season of 'tiger king' co-star with corrupt former presidents and former public servants.",
            "title_similarity": "0.4265766",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyzgash",
            "score": 1,
            "text": "Maybe a stupid question, but Russia has this massive convoy (slowly) approaching Kiev - Ukraine has a host of drones and freshly minted Mig-29's that Poland just gave them, why haven't they blown the convoy to hell?",
            "title_similarity": "0.70114267",
            "sentiment_compound": -0.8625
        },
        {
            "id": "hyzh2bx",
            "score": 2,
            "text": "Hang Putin for war crimes",
            "title_similarity": "0.80226064",
            "sentiment_compound": -0.5994
        },
        {
            "id": "hyzhfsw",
            "score": 2,
            "text": "Russia is a terrorist state and Putin is a war criminal.",
            "title_similarity": "0.85458976",
            "sentiment_compound": -0.9186
        },
        {
            "id": "hyzjgu3",
            "score": 2,
            "text": "Add it to the pile of other war crimes that vile waste of cum keeps committing.",
            "title_similarity": "0.65468633",
            "sentiment_compound": -0.8885
        },
        {
            "id": "hyzjrge",
            "score": 1,
            "text": " He refer to missile attack that landed on corner of building intersection right? There are photos from inside too, there is an Azov base station.",
            "title_similarity": "0.6047957",
            "sentiment_compound": -0.4767
        },
        {
            "id": "hyzlpbg",
            "score": 2,
            "text": "Yes, all he's done over the past week would probably class as a warcrime. Yet I don't think he'll ever face any repercussions for this.\n\nI hate to say it but I honestly don't think there's any circumstance in which NATO would intervene, unless he would outright attack a NATO country.\nEven if he brought out the warheads, \"accidently\" missed Ukraine and wiped out half of a neighbouring NATO country, and declared it as an accident, they'd still not intervene as that would mean the end for us all.\n\nMeanwhile, there's no way he'll leave Ukraine without his objectives completed. Russia would look weak for the eyes of the whole world to see. I think he'd rather end the world than face that shame.\n\nBy the time he captures Ukraine, the Russian economy will be in complete shambles, yet I don't think he cares about it as much as we all think. It's unlikely he'd have to lower his standard of living. His people would, but he clearly does not care about them anyway. best case scenario he gives us some sanctions that destroy our economy. Worst case scenario, he decides the rest of the world needs some \"de-nazification\" too...\n\nEven if we let him take Ukraine, I think it's a matter of time before he tries the same BS with the next country on his list within a few years. I believe it was only 8 years ago when he took Crimea.\n\nHonestly, I'm scared shitless. I can't even begin to imagine how the Ukrainean people feel...\n\nI can't believe how our best bet for now is to hope the complete psychopath in the Kremlin will not to destroy the planet within the next few days.",
            "title_similarity": "0.5822801",
            "sentiment_compound": -0.9381
        },
        {
            "id": "hyznyj2",
            "score": 1,
            "text": " N n.v••bbe",
            "title_similarity": "0.08387056",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyzseec",
            "score": 2,
            "text": "Someone get this man some cover so he can sleep, dude looks like he needs it",
            "title_similarity": "0.2466987",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hyzte47",
            "score": 1,
            "text": "Breaking Benjamin - So Cold",
            "title_similarity": "0.48012182",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyzth7q",
            "score": 3,
            "text": "Zelensky is handling this so amazingly well. I'd be proud to have him as a leader.",
            "title_similarity": "0.13081422",
            "sentiment_compound": 0.6976
        },
        {
            "id": "hz077fy",
            "score": 1,
            "text": "The ASOV Idiots posted on Telegram, that at that location is a place for volunteers to enlist.\n\nOf course. No one mentions this tiny detail..",
            "title_similarity": "0.4266562",
            "sentiment_compound": -0.296
        },
        {
            "id": "hz0fna2",
            "score": 1,
            "text": "can or will anything be done to Putin?",
            "title_similarity": "0.43711412",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz0idbu",
            "score": 1,
            "text": "Send missiles into Russian cities?",
            "title_similarity": "0.7306441",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz0iyyd",
            "score": 1,
            "text": "Putin want to re create the Soviet Union again",
            "title_similarity": "0.5090599",
            "sentiment_compound": 0.34
        },
        {
            "id": "hz0v0b4",
            "score": 1,
            "text": "That’s true!",
            "title_similarity": "-0.027058152",
            "sentiment_compound": 0.4753
        },
        {
            "id": "hz0w8ip",
            "score": 3,
            "text": "It's terrorism when we do it to poor brown innocent civilians in the middle east, yet the politicians who order the drone strikes are walking free to this day. If you're going to grandstand about Putin who I agree needs to be punished we also need to lock up our war criminals too. \n\nWe can't be enforcing a law that we don't abide by ourselves. It's time to clean up.",
            "title_similarity": "0.6948651",
            "sentiment_compound": -0.8979
        },
        {
            "id": "hz0wonb",
            "score": 1,
            "text": "A*6*6,6,5\"5\"\"5\"",
            "title_similarity": "0.09630066",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz0zscf",
            "score": 1,
            "text": "putting civilians holding guns in the street isn't a war crime?",
            "title_similarity": "0.42764083",
            "sentiment_compound": 0.7181
        },
        {
            "id": "hz11y2e",
            "score": 1,
            "text": "When dit reddit became so overwhelming.",
            "title_similarity": "0.3366866",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz12v9z",
            "score": 1,
            "text": "Rumor is, Putin is willing to use chemical weapons and threatening nukes. That would be it for me if I were US President. I'd immediately begin drone strikes against Russian military and send in the CIA and Delta and have Putin \"disappear\"",
            "title_similarity": "0.80082625",
            "sentiment_compound": -0.8658
        },
        {
            "id": "hz1cv6n",
            "score": 1,
            "text": "If I were Russian, I'd never want to admit being Russian. What a disgusting and embarrassing nation, a stain on world history. Russia's been a tyrant country for centuries, I would love to see the day Russia gets its retribution. Its long overdue.",
            "title_similarity": "0.70971733",
            "sentiment_compound": -0.3847
        },
        {
            "id": "hz1czg9",
            "score": 1,
            "text": "Need to rid the world of bullies. Trump Putin Kim",
            "title_similarity": "0.73295164",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz1eqwf",
            "score": 1,
            "text": "The same happens in the middle east, and no media bats an eye.",
            "title_similarity": "0.18135363",
            "sentiment_compound": -0.296
        },
        {
            "id": "hz1lh3r",
            "score": 1,
            "text": "Finally some accountability",
            "title_similarity": "0.0023120795",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz1t79c",
            "score": 1,
            "text": "Zelensky is such a little bittle bubber 🥺 lil guys getting picked on",
            "title_similarity": "0.32197416",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz20nuj",
            "score": 2,
            "text": "And Republicans still find the time to kiss the ass of their most recent employer.",
            "title_similarity": "0.32779375",
            "sentiment_compound": -0.1779
        },
        {
            "id": "hz2g2pg",
            "score": 1,
            "text": "It is a war crime and state terrorism, he didn't say it to be provocative, it's one of the least controversial statements you can make. Don't act like he's the only one recognizing it, if you don't then there is something seriously wrong with you.",
            "title_similarity": "0.6136074",
            "sentiment_compound": -0.954
        },
        {
            "id": "hz5jwdx",
            "score": 1,
            "text": "Why bomb a hospital full of Cancer patients? Hitler wanna be?",
            "title_similarity": "0.6700124",
            "sentiment_compound": -0.8385
        },
        {
            "id": "i5momfp",
            "score": 1,
            "text": "Why cant we at least get the civilians out safely????????\nTalk wont fix it\nTime for nato 400 plus F35",
            "title_similarity": "0.48542678",
            "sentiment_compound": 0.6322
        }
    ]
}