{
    "Russia’s secret documents: war in Ukraine was to last 15 days. Ukraine has seized Russian military plans concerning the war against Ukraine from the 810th Brigade of the battalion tactical group of Russia’s Black Sea Fleet Marines\n": [
        {
            "id": "hz38xd0",
            "score": 32,
            "text": "How dumb should you be to believe that kind of shit?..",
            "title_similarity": "0.14467584",
            "sentiment_compound": -0.8016
        },
        {
            "id": "hz3o3ho",
            "score": -9,
            "text": "Fakkkke",
            "title_similarity": "-0.037779856",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz3swln",
            "score": -30,
            "text": "[removed]",
            "title_similarity": "0.055294536"
        },
        {
            "id": "hz3ka4f",
            "score": 21,
            "text": "Watching these Russia apologists like Matt Taibi, Glenn Greenwald and Aaron Mate twist themselves into pretzels is incredible. Grown men who simply can't admit they're wrong and they were duped. Reminds me of Trump voters in a way...",
            "title_similarity": "0.5387306",
            "sentiment_compound": 0.1685
        },
        {
            "id": "hz3jbil",
            "score": 2,
            "text": "THEY DIDN’T CODIFY OR ENCRYPT THEIR PLANS??? WHY IS THE RUSSIAN ARMY SO MUCH MORE INCOMPETENT THEN WE THOUGHT??",
            "title_similarity": "0.5362588",
            "sentiment_compound": -0.6825
        },
        {
            "id": "hz3m58t",
            "score": 49,
            "text": "[deleted]",
            "title_similarity": "0.09003144"
        },
        {
            "id": "hz3mca4",
            "score": -7,
            "text": "The world may have to pay a heavy price for shaming and embarrassing a megalomaniac.  I'm worried Putin will do something even more drastic, like a rat that's been cornered.",
            "title_similarity": "0.5178915",
            "sentiment_compound": -0.5456
        },
        {
            "id": "hz3lwlv",
            "score": 19,
            "text": "Bullshit propaganda…",
            "title_similarity": "0.09696544",
            "sentiment_compound": -0.5859
        },
        {
            "id": "hz42t6z",
            "score": -6,
            "text": "why every one ragging from this war and most European countries and USA  did a lot of sanction on Russia even FIFA applied sanction and no one care about Palestine when USA create isreal and occupied  their country even when some arabs players protest in FIFA no one talk and threat the players who protest about this under \" Politics and sports cannot be combined \"",
            "title_similarity": "0.5750818",
            "sentiment_compound": -0.9428
        },
        {
            "id": "hz3s0iq",
            "score": 0,
            "text": "Kinda like when Trump leaked tax returns from on year when he paid a few hundred in taxes to Rachel madow and she came in her pants",
            "title_similarity": "0.5417325",
            "sentiment_compound": -0.024
        },
        {
            "id": "hz3ucsk",
            "score": 0,
            "text": "Things we now know: Russia is bad at war",
            "title_similarity": "0.52594507",
            "sentiment_compound": -0.8126
        },
        {
            "id": "hz3anvc",
            "score": 0,
            "text": "This is Keystone Cops. When a movie is made of this, they gotta make two. One from the Ukrainian which is a heroic war movie, and another from the Russian perspective which is a black, tragic comedy.\n\nIf this war had a soundtrack, it would be Benny Hill.",
            "title_similarity": "0.5845548",
            "sentiment_compound": -0.6908
        },
        {
            "id": "hz4zdb4",
            "score": -3,
            "text": "Damn, someone be honest and straight forward. Sorry if someone already said this, I haven't read through the comments. And I don't want any bot accounts to reply. Just people with a comment history with some dialog a normal human would have. I'm not going to pay attention to a user with only political comments and all for one side. I'm done reading those.\n\nBut it is impossible not to say that reddit has been flooded with propaganda. I'm not pro Russia invading. My heart sank when Russia entered Ukraine. I honestly thought it was all talk and an invasion wouldn't happen. Things like this should not happen in these times. FYI, I'm in the US. Yes, I can't stand when we send over our military to \"help\". It's disgusting. But what is going on here?\n\nI would think there is no damn way a country with a small military (and I mean small compared to the rest of the world combined) would invade another country. The world could stop that in an instant if they wanted to. They could do it financially or physically. This stuff just shouldn't be happened.\n\nSo knowing that, there are people that would say that Russia had been saying they were going to do this for awhile and they knew nobody would try to stop them. Ok, I get that. Alex Jones already knew that this war will happen last year. Don't believe me? I'll send the video if you want it. Back in November he specifically said that there will be war in February. I don't care if you like him or not. I don't care what he said in the past. He called war and he called the month. The way he said it, you can tell someone had told him. You are an idiot if you can't see someone told him about it. The US knew about it coming.\n\nNow look at Reddit. Why in the hell are we getting spammed with SO MUCH propaganda about Ukraine? You have to notice this. Like I said, I'm all about Ukraine stopping this. But this propaganda is too much. This is coming from the US. Either the government or the financial industry. Probably both. I'm sorry, this isn't about Russia and Ukraine. The Russia/Ukraine is a side story. You'll call me insane and insensitive. Go ahead. I feel awful for all the people over there. But wake up people. People are dying over there because of something the top .001% are doing. Look at the freaking propaganda here. This war is just a tool. \n\nSomebody tell me what exactly is going on. There is no way Ukraine or Russia is the main player in all this. This war was started for a reason I don't know. I absolutely hate it, but I am almost positive the US is very involved in this. I'm just tired of the BS. Tired of the same responses with generic thoughts or name calling. I'm really trying to find someone who knows what's going on. Who started this war and why? This was planned for a long time. And who the heck is falling for all this propaganda on here? Are there really people who does not see it? I'm sure there are a few, but Jesus, this government think we are dumb as hell. It pathetic.",
            "title_similarity": "0.5217851",
            "sentiment_compound": -0.9982
        },
        {
            "id": "hz3msed",
            "score": 20,
            "text": "Isn't it a tactic to leak fake documents though? I'm probably just paranoid but I'm worried Russia is playing 12d chess and everything is going exactly as they wanted",
            "title_similarity": "0.5349645",
            "sentiment_compound": -0.5927
        },
        {
            "id": "hz38kbk",
            "score": 3,
            "text": ">The plans anticipated that the capture of Ukraine must be executed within 15 days, from 20 February to 6 March\n\nI don't know guys, it isn't March 6th yet, they could still do it /s",
            "title_similarity": "0.7621285",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz3rhmc",
            "score": 3,
            "text": "Stop Russian aggression. All people must unite!!!",
            "title_similarity": "0.501965",
            "sentiment_compound": -0.6458
        },
        {
            "id": "hz30rme",
            "score": 17,
            "text": "They had anticipated the winter war to last two weeks. Look how well that went for them, cough cough 450,000 dead, wounded, missing, or captured.",
            "title_similarity": "0.62956715",
            "sentiment_compound": -0.8519
        },
        {
            "id": "hz3okye",
            "score": 7,
            "text": "Sounds like more Ukrainskaganda to me.",
            "title_similarity": "0.1808039",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hz3msac",
            "score": 8,
            "text": "I watched the karma on this post going from 14,000 to 4,000 in seconds. Russian bots are really out here doing the most right now smh",
            "title_similarity": "0.6243729",
            "sentiment_compound": -0.3744
        },
        {
            "id": "hz3qroh",
            "score": 12,
            "text": "Don’t people check sources before commenting? You people are literal tools. Russia wants you to read this.",
            "title_similarity": "0.53399634",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz3ptds",
            "score": 1,
            "text": "“Western hysteria”",
            "title_similarity": "0.25963134",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz3so8f",
            "score": 1,
            "text": "If you say anything  against the Russians/ Republicans money connection  ? Are we automatically banned?",
            "title_similarity": "0.49243307",
            "sentiment_compound": -0.5204
        },
        {
            "id": "hz4fs6o",
            "score": -1,
            "text": "Russia are amateurs with plans and all. In America we don't have plans that's why they last in perpetuity--just the way Military Industry likes it.",
            "title_similarity": "0.4852442",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hz4merb",
            "score": -1,
            "text": "This brings in to question to me personally the content and timing of Trumps statements. Leads me to believe he had knowledge.",
            "title_similarity": "0.31488734",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz3ql20",
            "score": 16,
            "text": "Dumbest thing to post it online? Wtf fake news. This sub is cirppled with fake news.",
            "title_similarity": "0.3622697",
            "sentiment_compound": -0.9231
        },
        {
            "id": "hz3lr2t",
            "score": 5,
            "text": "What happened to not discussion Ukrainian tactics and movements and the like?",
            "title_similarity": "0.35849646",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hz3uue7",
            "score": -3,
            "text": "Ukrainian civilians making backyard style napalm cocktails. This stuff is nastier than Molotovs they will stick on to whatever they hit. \nhttps://twitter.com/njohnson_145/status/1499145354901536775?s=21",
            "title_similarity": "0.55558276",
            "sentiment_compound": -0.5106
        },
        {
            "id": "hz4q2fw",
            "score": 1,
            "text": "This is fake... VERY FAKE LOL. EVEN A DIVERSION EVEN. This wouldn't be out on social media if those plans were actually predictions that were right with time. Either that, or Ukraine realized how outgunned Russia is here; Ukraine isn't fighting alone it's more economies pouring there products, but this is cocky to release",
            "title_similarity": "0.52678746",
            "sentiment_compound": -0.2618
        },
        {
            "id": "hz33q1a",
            "score": -6,
            "text": "wow, awesome! Ukrainians are just amazing!",
            "title_similarity": "0.18148959",
            "sentiment_compound": 0.9229
        },
        {
            "id": "hz3kqez",
            "score": 10,
            "text": "They have 8 more days. Ukraine even with how it’s been doing won’t be looking for good in 8 days",
            "title_similarity": "0.5550765",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hz33i8z",
            "score": 4,
            "text": "The Schlieffen plan was supposed to completed in 30 + days during WWI. It was grossly miscalculated. Im sure this laughable 15 day plan was thrown together by 2 idiots.",
            "title_similarity": "0.61435896",
            "sentiment_compound": 0.1655
        },
        {
            "id": "hz40ct1",
            "score": 4,
            "text": "Has to be fake this for a number of reasons:\n- why would Ukraine divulge that they have this critical information for fake internet points.  It would be like the allies in WW2 announcing to everyone that they cracked the enigma machine.  If it was true Ukraine would use the info to destroy the Russians, or at least until the Russians realised that they must have the plans somehow.\n- a top Russian general wouldn't leave plans hanging around, there will be strict protocols to get them destroyed.\n- all plans are not sent to all squadrons, exactly for this reason, it leaves whole war efforts compromised in the event of capture.  The plans would only have what that battilion had to do or how they join a major mission.\n\nI call bullshit on this one",
            "title_similarity": "0.65641105",
            "sentiment_compound": -0.938
        },
        {
            "id": "hz3ayjp",
            "score": 22,
            "text": "Please consider the 'source'",
            "title_similarity": "0.0018186346",
            "sentiment_compound": 0.3182
        },
        {
            "id": "hz4kuko",
            "score": 8,
            "text": "Yeah this is 100% Ukrainian propaganda. There is absolutely no way in hell a brigade on the frontline would have “secret documents” detailing all their war plans, much less the chances of Ukraine ever getting their hands on them",
            "title_similarity": "0.5672587",
            "sentiment_compound": -0.8826
        },
        {
            "id": "hz3yfh2",
            "score": 4,
            "text": "This is probably fake, used as propaganda in war. That's my guess",
            "title_similarity": "0.39033684",
            "sentiment_compound": -0.8402
        },
        {
            "id": "hz3yx1y",
            "score": 0,
            "text": "Buddy seem more planned than Russia to be quiet honest",
            "title_similarity": "0.2765671",
            "sentiment_compound": 0.5106
        },
        {
            "id": "hz3zcc4",
            "score": 0,
            "text": "So if the war was to last only 15 days, I would assume it’s because they don’t have the resources or logistics to keep it up. Russian platoons are constantly being stranded without gas and have Amos’s no supplies.\n\nWould it be possible for Ukraine to launch a counter invasion and take back Crimea?",
            "title_similarity": "0.7611361",
            "sentiment_compound": -0.7479
        },
        {
            "id": "hz3zsgb",
            "score": 0,
            "text": "Isn't Pravda a Russian propagada outlet?",
            "title_similarity": "0.50156385",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz425b2",
            "score": 0,
            "text": "The use of the word \"was\" sounds like we are past 15 Days. But the war/invasion hasn't gone past 8(?) days?",
            "title_similarity": "0.63858634",
            "sentiment_compound": 0.2755
        },
        {
            "id": "hz42vpj",
            "score": 0,
            "text": "This sounds conflicting with reports of Putin being frustrated, no?\n\nRussia is well within the 15 days they planned.",
            "title_similarity": "0.742187",
            "sentiment_compound": -0.6124
        },
        {
            "id": "hz43e4q",
            "score": 0,
            "text": "So whatever happened to wikileaks? Or do they only leak stuff it benefits Russia?",
            "title_similarity": "0.5462512",
            "sentiment_compound": 0.1431
        },
        {
            "id": "hz43scd",
            "score": 0,
            "text": "Putin will announce Russia police state Friday.  Exit visas to be required if you want to leave.  All citizens' bank assets seized for the 'national good'. Internet shut down. Food rationing. Amazing the insanity that 140 million sheep will put up with.",
            "title_similarity": "0.7182838",
            "sentiment_compound": 0.5859
        },
        {
            "id": "hz441il",
            "score": 0,
            "text": "Lol sure",
            "title_similarity": "-0.14934674",
            "sentiment_compound": 0.6249
        },
        {
            "id": "hz44ys5",
            "score": 0,
            "text": "It's bad now but shit is going to get REALLY dark next week if they still haven't captured Kyiv. This isn't an economic and industrial powerhouse with strong allies like Nazi Germany. This is a pitiful regime lead by a psychopath with very little time to spare before his own people overthrow him for ruining their futures, turning everybody against them and destroying their economy. \n\nPutin is against the clock. He cannot afford to drag this war out like the US in Iraq with it's infinite resources and plethora of allies. He has made a grave miscalculation and I wouldn't be surprised to see him deploy catastrophic weaponry out of desperation.",
            "title_similarity": "0.6322615",
            "sentiment_compound": -0.984
        },
        {
            "id": "hz477wh",
            "score": 0,
            "text": "Hey hey not fair, now we have to come up with another plan to invade your ass",
            "title_similarity": "0.39398676",
            "sentiment_compound": -0.6664
        },
        {
            "id": "hz48n6p",
            "score": 0,
            "text": "Is it normal for a countries military to print their war plans on excel tables and crayon drawn maps?",
            "title_similarity": "0.51955104",
            "sentiment_compound": -0.2263
        },
        {
            "id": "hz4b08q",
            "score": 0,
            "text": "The Russian comment at the bottom of the article are interesting. Some seem like Russian soldiers. And others say it’s part of the plan. Documents planted. 🤷🏼‍♂️ false pretexts",
            "title_similarity": "0.5812208",
            "sentiment_compound": 0.6369
        },
        {
            "id": "hz4bkdh",
            "score": 0,
            "text": "Фейк",
            "title_similarity": "0.10821387",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz4jg7x",
            "score": 0,
            "text": "Ukraine's been giving Russia hell and I hope they continue to do so.",
            "title_similarity": "0.5687655",
            "sentiment_compound": -0.0772
        },
        {
            "id": "hz4jpel",
            "score": 0,
            "text": "If it takes longer than 15 days I wonder what Putin will do to speed things up.",
            "title_similarity": "0.64944005",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz4n84y",
            "score": 0,
            "text": "Russia is making it very hard at the moment for Russians to receive true, factual news about the war in Ukraine. I will send a daily newsletter, by email, of news from reputable reporters like the BBC to any Russians who would like to see what is actually happening.\nDM or email for details: artaccon@gmail.com\nPass along to friends/family/fellow Russians \n\nВ настоящее время Россия очень затрудняет получение россиянами правдивых, фактических новостей о войне на Украине. Я буду рассылать по электронной почте ежедневный информационный бюллетень новостей от авторитетных репортеров, таких как BBC, всем россиянам, которые хотели бы увидеть, что происходит на самом деле.\nDM или по электронной почте для деталей: artaccon@gmail.com\nПередайте друзьям/родным/соотечественникам",
            "title_similarity": "0.73957074",
            "sentiment_compound": 0.2975
        },
        {
            "id": "hz4uuv6",
            "score": 0,
            "text": "Sounds more like Russia gave them some plans. I don't believe they are that inept",
            "title_similarity": "0.4688792",
            "sentiment_compound": 0.4201
        },
        {
            "id": "hz5glss",
            "score": 0,
            "text": "Watch this video and tell me what you guy think.\n\nhttps://m.youtube.com/watch?v=K5BAZ2bBUzM",
            "title_similarity": "0.27570838",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz3fn0j",
            "score": 10,
            "text": "I mean this could be easily faked, and some words on the big table are quite random \"raccoon, magnesium, marshmallow\", mixed with some cities in russia and Ukraine (could be codewords for operations tho) but on the other hand I don't really see the point of Ukrainians faking this so it might just be true.\npravda being the source doesn't really convince me tbh, but I really hope for more info on this",
            "title_similarity": "0.46654755",
            "sentiment_compound": 0.834
        },
        {
            "id": "hz3ktgd",
            "score": 9,
            "text": "The documents are either fake, or carried by someone less than intelligent. Who the fuck brings the playbook  into the field of play?",
            "title_similarity": "0.3072741",
            "sentiment_compound": -0.3566
        },
        {
            "id": "hz3yh1f",
            "score": 10,
            "text": "sounds like completely real true news and definitely not made-up propaganda.",
            "title_similarity": "0.027801141",
            "sentiment_compound": 0.8409
        },
        {
            "id": "hz40dix",
            "score": 5,
            "text": "Propaganda. If you had the plan of your enemies the dumbest thing to do would be to reveal that info.",
            "title_similarity": "0.37514532",
            "sentiment_compound": -0.8176
        },
        {
            "id": "hz3vo0q",
            "score": 11,
            "text": "Do people really believe this shit?\nSounds like total propaganda, remember the good guys have their own Kool aid brand as well",
            "title_similarity": "0.32139778",
            "sentiment_compound": -0.0958
        },
        {
            "id": "hz3kvpl",
            "score": 6,
            "text": "This is all sorts of suspicious:\n\n1. Why would plans for the entire thing be in a fleet that can be captured?\n\n2. Why would Ukraine reveal they obtained these documents so publicly?",
            "title_similarity": "0.565824",
            "sentiment_compound": -0.4329
        },
        {
            "id": "hz3m1yb",
            "score": 1,
            "text": "Why in the name of god would you report this to the media? Oops they found plan a, switch to plan b. Reminds me of the time the media reported about Seals in Iraq, ended up with 4 men dead.",
            "title_similarity": "0.6035527",
            "sentiment_compound": -0.4939
        },
        {
            "id": "hz3m4sk",
            "score": 1,
            "text": "[deleted]",
            "title_similarity": "0.09003144"
        },
        {
            "id": "hz3n0d0",
            "score": 1,
            "text": "\nMake it public and viewable!! Block out Ukrainian sensitive info. But pit Russia on blast. When we really need WikiLeaks...",
            "title_similarity": "0.6264263",
            "sentiment_compound": -0.3682
        },
        {
            "id": "hz3odhz",
            "score": 1,
            "text": "Coming from a news sources that calls itself pravda. Lol what a joke",
            "title_similarity": "0.37282643",
            "sentiment_compound": 0.6124
        },
        {
            "id": "hz3oh82",
            "score": -1,
            "text": "Bit of a side note but we’ve heard Putin is on steroids for potential cancer (conjecture) but I was wondering if they are known to cause aggression?",
            "title_similarity": "0.5720284",
            "sentiment_compound": -0.872
        },
        {
            "id": "hz3ovpb",
            "score": -1,
            "text": "I don't get it, I read the article that was accidentally published the other day by Russian main propaganda sites and it indicated that Putin was expecting to take Ukraine in like a couple of days. So which report is fake?",
            "title_similarity": "0.7401171",
            "sentiment_compound": -0.6124
        },
        {
            "id": "hz3qcvk",
            "score": 1,
            "text": "Fake",
            "title_similarity": "-0.02853886",
            "sentiment_compound": -0.4767
        },
        {
            "id": "hz3rnlw",
            "score": 1,
            "text": "Dummy plans. Not real.",
            "title_similarity": "0.072437085",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz3rut1",
            "score": 1,
            "text": ">When one of the captured Russian soldiers says that   \nthey came to participate in drills and got lost, do not believe it! They  \n knew, they carefully planned and prepared.\n\nIsn't it too far fetched to claim that average soldier knew about invasion? I mean those documents are definitely commander eyes only. They could also got them in a sealed envelope with \"open only after given the signal\" order. They didn't have to inform soldiers about a detail. There are many reasons why Russians could've decided to not give info to their soldiers - they don't value their enlisted men that much and they don't trust them with this kind of info (They have to be on their toes with the OPSEC because entire western intelligence is looking at them 24/7). I might be stupid or naive, but I trust that those soldiers are telling the truth about the sudden drills -> invasion for them, being told less than need-to-know basis.",
            "title_similarity": "0.55169594",
            "sentiment_compound": 0.7596
        },
        {
            "id": "hz3vpwz",
            "score": -1,
            "text": "So World War III was supposed to last 15 days? BOoooooooooooooooooooooo",
            "title_similarity": "0.6229994",
            "sentiment_compound": -0.6344
        },
        {
            "id": "hz3vtqx",
            "score": 1,
            "text": "All Russia has are nukes, and if any of the equipment, or terrible logistical planning is an indication; those nukes and facilities are probably in horrible shape. NATO smokes Russia without China. We have to remember, Nazi Germany had the largest free standing army in the world, and all of the top scientists. Hitler literally started planning revenge when he took power in 33’. Everything he said and did was a plan leading up to the Blitzkrieg. Also, Russia now has nowhere near the amount of evil genius allstars like Nazi Germany. I think what we are seeing now is an autocrat who has had a choke hold on power and never delegated any power or creative decision making to anyone else without his approval; and we get this logistical shit show where he just throws infantry and bombers and see what sticks.",
            "title_similarity": "0.64002323",
            "sentiment_compound": -0.9388
        },
        {
            "id": "hz3wojd",
            "score": 1,
            "text": "Seems legit",
            "title_similarity": "-0.063178465",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz3wqll",
            "score": -1,
            "text": "Wars planned on Microsoft office lol",
            "title_similarity": "0.47379678",
            "sentiment_compound": -0.2023
        },
        {
            "id": "hz3wzax",
            "score": 1,
            "text": "Unlikely to be true.\n\nIf truly possessed what you believed were battle plan, why release that information? Think about the Turing machine…\n\nProbably a decoy, or fake.",
            "title_similarity": "0.34224945",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz3wze7",
            "score": -1,
            "text": "Yeah this is convenient... they left their \"secret documents\" behind because they were in a rush.",
            "title_similarity": "0.23259217",
            "sentiment_compound": 0.296
        },
        {
            "id": "hz3xvlr",
            "score": 1,
            "text": "How convenient that they wrote this in English for us!",
            "title_similarity": "0.15192872",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz3ya0f",
            "score": 1,
            "text": "Who goes to war with a country and only plans out a couple weeks?",
            "title_similarity": "0.64310414",
            "sentiment_compound": -0.5994
        },
        {
            "id": "hz3yco0",
            "score": 1,
            "text": "Ah, I see \"leaked\" plans have a nice out for Putin. How convient.",
            "title_similarity": "0.30971926",
            "sentiment_compound": 0.128
        },
        {
            "id": "hz3ymtq",
            "score": 1,
            "text": "Seems sketchy, like some kind of a ruse.  \nWho carries plans like that into battle?!",
            "title_similarity": "0.3630963",
            "sentiment_compound": 0.4003
        },
        {
            "id": "hz3zhuw",
            "score": 1,
            "text": "This reads like a tom Clancy novel.  Military gore, poor upper management and an underdog whooping ass.",
            "title_similarity": "0.46542254",
            "sentiment_compound": -0.4215
        },
        {
            "id": "hz40jz2",
            "score": -1,
            "text": "Russia's secret documents: war in Ukraine was to last 15 days.\n\nUkraine has now seized those documents.",
            "title_similarity": "0.9209174",
            "sentiment_compound": -0.5994
        },
        {
            "id": "hz41032",
            "score": 1,
            "text": "We're gonna be making those Hitler \"everyone leave the room but x,y,z\" meme's coming soon with Putin cheaply deep faked over the top.  The next few weeks should be fun on the internet.",
            "title_similarity": "0.5974949",
            "sentiment_compound": 0.7615
        },
        {
            "id": "hz42vzv",
            "score": 1,
            "text": "Since when did a war have a deadline lol",
            "title_similarity": "0.44860804",
            "sentiment_compound": -0.2732
        },
        {
            "id": "hz43fb6",
            "score": -1,
            "text": "Fact checks anyone or that is not required in the new age of talking heads media ?",
            "title_similarity": "0.21743312",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz4452m",
            "score": 1,
            "text": "Ok maybe they should’ve kept this one to themselves, like the information war is important but tactically they should’ve not of said anything about this one",
            "title_similarity": "0.29397553",
            "sentiment_compound": 0.0772
        },
        {
            "id": "hz4c8el",
            "score": 1,
            "text": "I saw a story on reddit a few weeks back from a military strategist outside of the 2 countries claiming Ukraine would only be able to defend herself for 2 weeks at best.  I guess this kind of lines up with that.",
            "title_similarity": "0.6656947",
            "sentiment_compound": 0.6369
        },
        {
            "id": "hz4gqyq",
            "score": -1,
            "text": "I think it’s fake, because I’ve searched it up and have found that the who filled it in was Василчук 1st rank of the 41st brigade, however from my russain sources it’s Валерий Павлович and not Василчук. Now I think that the Russains have better knowledge of whom their captain 1st rank is.",
            "title_similarity": "0.4783344",
            "sentiment_compound": -0.0516
        },
        {
            "id": "hz4gv03",
            "score": -1,
            "text": "(463)203-7083 call me",
            "title_similarity": "0.14624722",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz4h8dh",
            "score": 1,
            "text": " Propaganda Everywhere *5th GEN War at Play*",
            "title_similarity": "0.48162448",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hz4jao0",
            "score": 1,
            "text": "Just ask the question…\nWhy did this news get out? \nThe war isn’t over. Knowing this info while keeping quiet could lead to a lot more intelligence discoveries. \n\nThough, this is a W for the good guys.",
            "title_similarity": "0.35043764",
            "sentiment_compound": 0.3384
        },
        {
            "id": "hz4jptu",
            "score": -1,
            "text": "Let’s not under estimate what Putin can do. This is his life’s work. There’s a point to all of this. Remember he’s done some sick shit in his life. He’s in his golden years so he not give 2 fucks about the world. He wants the arctic to melt. Russia gains land. And becomes more hospitable in winter.",
            "title_similarity": "0.6309705",
            "sentiment_compound": -0.449
        },
        {
            "id": "hz4k6xs",
            "score": -1,
            "text": "I think this is probably just a Ukranian attempt to control the narrative and say a defense past 15 days against a world power is a victory, but also I'm for it. It will make Russia look even worse. Putin, go fuck yourself.\n\nSo Reddit, Im asking you nicely, please don't do your usual thing and debunk this.",
            "title_similarity": "0.72781074",
            "sentiment_compound": -0.431
        },
        {
            "id": "hz4k9k5",
            "score": 1,
            "text": "Now I'm not even surprised Washington D.C. was telling everyone what the Russian plans were. It seems like they were too incompetent to keep it secret.",
            "title_similarity": "0.52264124",
            "sentiment_compound": -0.3107
        },
        {
            "id": "hz4kflo",
            "score": -1,
            "text": ":/ guys I think we should fight russia I think we could take them. I'm not saying america 2 electric boogaloo but....",
            "title_similarity": "0.64331144",
            "sentiment_compound": -0.3612
        },
        {
            "id": "hz4mgys",
            "score": 1,
            "text": "Hitler rearmed Germany and started WW2 in Europe to avenge the humiliation Germany suffered in WW1.\n\nPutler rearmed Russia and started the Ukraine War to avenge the humiliation the Soviet Union suffered in the Cold War.",
            "title_similarity": "0.68316174",
            "sentiment_compound": -0.9705
        },
        {
            "id": "hz4ob5s",
            "score": 1,
            "text": "I have no idea who this publication is.  Is this independently verified?  I get this is Reddit (and obligatory fuck Putin) but is this just propaganda or real?",
            "title_similarity": "0.43655854",
            "sentiment_compound": -0.6917
        },
        {
            "id": "hz4oi43",
            "score": -1,
            "text": "I wonder if the information was planted as a diversion.\n\nThough it seems like they just fucked up it doesn't seem to far fetched for them to plant fake plans.",
            "title_similarity": "0.2203609",
            "sentiment_compound": -0.7184
        },
        {
            "id": "hz4q2ub",
            "score": -1,
            "text": "Sounds a little sketchy to me! \nHow do they know they didn’t leave them on purpose just to make the Ukrainians think they’re real, right? It does happen!\n\nI just read in the NY Times Russia just seized control of Kherson in the south and the first major city. \n\nIn regards to Kiev can you say…. “thermobaric”? If Russia uses this weapon there will be hell to pay!",
            "title_similarity": "0.73639286",
            "sentiment_compound": -0.8731
        },
        {
            "id": "hz4rkgu",
            "score": -1,
            "text": "Couldn’t they have just given fake plans to high risk battalions to confuse the enemy",
            "title_similarity": "0.43377548",
            "sentiment_compound": -0.8625
        },
        {
            "id": "hz4xgxq",
            "score": -1,
            "text": "Yay sounds like Ukraine is winning right? right? Nop",
            "title_similarity": "0.34626305",
            "sentiment_compound": 0.8645
        },
        {
            "id": "hz5esl0",
            "score": 1,
            "text": "This has to be bullshit.",
            "title_similarity": "0.10201727",
            "sentiment_compound": -0.5859
        },
        {
            "id": "hz5hpe2",
            "score": 1,
            "text": "I think it’s referring to the radio frequencies document which had frequencies from 20th Feb till 6th March.\n\nSo considering that the war started on 24th, they are either running behind the schedule or there was a safety net of 4 days before the attack, which could mean that they planned a safety net for after the attack as well which would lead to 24thFeb-2ndMar instead of 20th Feb 6th Mar\n\nEither this or they simply decided to start later for some reason (in that case it will be 24th Feb- 10thMar)",
            "title_similarity": "0.6165107",
            "sentiment_compound": -0.5267
        },
        {
            "id": "hz6033z",
            "score": 1,
            "text": "This war is fucking embarassing for Russia. Running out of food. Running out of fuel. Professional soldiers refusing to go to war, so the Russian military is forcing conscripts to go to Ukraine under false pretenses. High Russian casualties. Etc. I thought Russia was supposed to be a military power. Looking crummy.",
            "title_similarity": "0.6625654",
            "sentiment_compound": -0.8885
        },
        {
            "id": "hz65ylp",
            "score": 1,
            "text": "It’s amazing what documents they can find at Mar-a-lago.",
            "title_similarity": "0.17209084",
            "sentiment_compound": 0.5859
        },
        {
            "id": "hz37go1",
            "score": 6,
            "text": "15 days seems pretty optimistic. Does Russia really think they can keep this up for that long?",
            "title_similarity": "0.5700594",
            "sentiment_compound": 0.6705
        },
        {
            "id": "hz35fui",
            "score": 8,
            "text": "I think you're going to miss your 15 day deadline Putin. \n\nIt seems the people of Ukraine disagree with that timeframe.",
            "title_similarity": "0.66285646",
            "sentiment_compound": -0.4939
        },
        {
            "id": "hz37vjo",
            "score": 2,
            "text": "Omfg sloppiest invasion in the history of ever",
            "title_similarity": "0.36546323",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz3dvup",
            "score": -2,
            "text": "Who knew there was a Cousin Greg working for the Fasc...Russians:  https://www.youtube.com/watch?v=TOjkCF0oWGk",
            "title_similarity": "0.56843543",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz3kzbu",
            "score": 2,
            "text": "Very skeptical of this being real. You really shouldn't just take countries at war at their word for things that make their enemy look bad, especially \"captured documents\". Why would one brigade even keep a plan of the whole war?",
            "title_similarity": "0.48048788",
            "sentiment_compound": -0.9545
        },
        {
            "id": "hz3l7vv",
            "score": 2,
            "text": "A lot of people are going to be really baffled, when Russia takes the gloves off. News like this spreading is rather counter productive and only serves to poke the bear, if you will.",
            "title_similarity": "0.52313995",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hz3l8vs",
            "score": 2,
            "text": "If this is all a disinformation campaign to pretend to be incompetent and catch us off guard, they're doing a really good job",
            "title_similarity": "0.18839845",
            "sentiment_compound": -0.079
        },
        {
            "id": "hz3obxc",
            "score": 2,
            "text": "15 days is not inconceivable at this point. Kherson is down. By all accounts Mariupol is surrounded and going to follow. Kherson being down opens up a lot of Southern Ukraine and you have to find the troops from somwehere to defend that.\n\nWere only on day 7 after all.",
            "title_similarity": "0.6375482",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz3oc3l",
            "score": 2,
            "text": "If Ukraine gained any valuable intelligence from these documents, they would not be releasing it to the media. I don’t totally buy it",
            "title_similarity": "0.42522526",
            "sentiment_compound": 0.8316
        },
        {
            "id": "hz3p4wy",
            "score": -2,
            "text": "Asshole",
            "title_similarity": "0.057240456",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz3p8b6",
            "score": -2,
            "text": "I dunno,this is unconfirmed by any non Ukrainian source,like a lot of other fake news that has been debunked",
            "title_similarity": "0.342913",
            "sentiment_compound": -0.5574
        },
        {
            "id": "hz3qeoh",
            "score": 2,
            "text": "If you steal secret documents, should you post that on reddit?",
            "title_similarity": "0.43569553",
            "sentiment_compound": -0.4939
        },
        {
            "id": "hz3vj3s",
            "score": 2,
            "text": "If this story is true, this shouldn't have been released publicly. They shouldn't show their cards. Seems like they prioritized PR over intelligence gathering. Someone chime in if I'm not seeing it right.",
            "title_similarity": "0.33417135",
            "sentiment_compound": 0.8126
        },
        {
            "id": "hz3xhcx",
            "score": 2,
            "text": "Why would we advertise that we have captured their plans?\n\nCome on guys… does that make strategic sense? \n\nI neither believe nor disbelieve this news.",
            "title_similarity": "0.28818053",
            "sentiment_compound": -0.254
        },
        {
            "id": "hz3ykqq",
            "score": -2,
            "text": "Is it true, China has had machine gun robots on the border of Tibet and India since the end of December? Anyone else hear about this?",
            "title_similarity": "0.5994477",
            "sentiment_compound": 0.1926
        },
        {
            "id": "hz3ymzg",
            "score": -2,
            "text": "So why is there a map of North America in the top right of his little master plan map?  \n\n\n&#x200B;\n\nEdit: [https://youtu.be/I79gEfr7qDY](https://youtu.be/I79gEfr7qDY) Said map of North America is here sorry in this briefing.",
            "title_similarity": "0.53652567",
            "sentiment_compound": 0.128
        },
        {
            "id": "hz3zn2m",
            "score": 2,
            "text": "this lines up with some rumors about how much money Russia has to fund this and why they sent the B team... this will not end well for Russia or Putin",
            "title_similarity": "0.56642264",
            "sentiment_compound": -0.2057
        },
        {
            "id": "hz3zuqv",
            "score": 2,
            "text": "Boy were they seriously underestimating the willpower and determination of the Ukrainian people.",
            "title_similarity": "0.36223263",
            "sentiment_compound": 0.25
        },
        {
            "id": "hz41z3g",
            "score": -2,
            "text": "Maybe Putin knows exactly what he's doing and everything was planned in such a way, all the sanctions, that the world makes fun of him because he can't beat Ukraine.  Maybe he didn't miscalculate.",
            "title_similarity": "0.46065784",
            "sentiment_compound": 0.5106
        },
        {
            "id": "hz43x80",
            "score": 2,
            "text": "Do you know what Maskirovka is? It’s Russian military doctrine and essentially calls for war to be less using decoys, dummies, and misinformation.\n\nI can’t help but think this level of constant incompetence is part of the plan. But time will tell. \n\nYou can read more about Maskirovka on the pedia (not sure if my comment will get deleted if I share the link)",
            "title_similarity": "0.6781515",
            "sentiment_compound": -0.7463
        },
        {
            "id": "hz447gi",
            "score": -2,
            "text": "Yeah sure, also ukraine is winning the war /s (according to western media)….",
            "title_similarity": "0.5577786",
            "sentiment_compound": 0.4588
        },
        {
            "id": "hz44vi7",
            "score": -2,
            "text": "This is all about fiat and crypto if you ask me",
            "title_similarity": "0.35031265",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz460ze",
            "score": 2,
            "text": "The day after this invasion was authorized Biden had one of his classic Bidenisms where he talked about \"minor incursion\" and everyone flipped their lid at him.\n\nTurns out yeah he had good reason to be worried and everyone can fucking eat their humble pie.\n\nAlso makes more sense why Putin went into this thing half cocked thinking NATO was going to roll over after that minor scandal.",
            "title_similarity": "0.5278965",
            "sentiment_compound": -0.0
        },
        {
            "id": "hz46n59",
            "score": -2,
            "text": "Who cares",
            "title_similarity": "-0.037623994",
            "sentiment_compound": 0.4588
        },
        {
            "id": "hz4iume",
            "score": -2,
            "text": "I would be weary of such plans, could be plant or some deception. Either way Russia is taking Ukraine fast and with the Ukraine army encircled, they can do what they want with nothing to stop them.",
            "title_similarity": "0.65701485",
            "sentiment_compound": -0.4238
        },
        {
            "id": "hz4pdbu",
            "score": -2,
            "text": "Why would somebody attacking have the whole plan with them?",
            "title_similarity": "0.37050647",
            "sentiment_compound": -0.4588
        },
        {
            "id": "hz4pglr",
            "score": -2,
            "text": "There's a cartoon from before the invasion im trying to find.  \nIt showed putin/zelensky/macron and leyden I think huddling and talking in one corner and telling an isolated america to f off basically while america hysterically yelled about war.  \nDoes anyone have a link for it?",
            "title_similarity": "0.61315465",
            "sentiment_compound": -0.7351
        },
        {
            "id": "hz4z3a5",
            "score": -2,
            "text": "What's up with the western portrayal of the Russian invasion. It's being portrayed as though the Russians are incompetent and that Ukraine is having no trouble holding them back. In reality the Russians are surrounding Ukraine and are likely to take over. If a country needed help shouldn't the portrayed image be that they need help instead of making it appear as though they're doing fine. Or is this a way to make it appear as though Ukraine does not need the help in order to excuse the responsibilities of Ukraines allies.",
            "title_similarity": "0.59458935",
            "sentiment_compound": 0.5267
        },
        {
            "id": "hz57rj9",
            "score": 2,
            "text": "When you capture your enemy’s battle plans and secret documents, you don’t post them online for all to see. \n\nThe fact it was permitted to be captured at all is amateur hour, and not what a disciplined army would do.\n\nThis must be disinformation; possibly Russian, possibly Ukrainian, most likely both.",
            "title_similarity": "0.5498341",
            "sentiment_compound": -0.3818
        },
        {
            "id": "hz3i72y",
            "score": -10,
            "text": "[deleted]",
            "title_similarity": "0.09003144"
        },
        {
            "id": "hz37bh9",
            "score": 3,
            "text": "Dang, the war is gonna be over in like 8 days. Russians gonna leave?",
            "title_similarity": "0.66632843",
            "sentiment_compound": -0.3818
        },
        {
            "id": "hz3bsqv",
            "score": 3,
            "text": "ah... i thought when you break the enemy's code you don't let them know?! Doctor Strange told me that.",
            "title_similarity": "0.50751716",
            "sentiment_compound": -0.2714
        },
        {
            "id": "hz3e486",
            "score": -3,
            "text": "How does Russia watch the most funded military on earth take 2 months to invade an unmotivated nation and they thought it would take 2 weeks?",
            "title_similarity": "0.70750993",
            "sentiment_compound": -0.34
        },
        {
            "id": "hz3kv12",
            "score": 3,
            "text": "It seems like this is the reality though isnt it? With the massive collumn of armored vehicles currently going to Kyiv (Which is likely there by now) that the city is going to fall pretty quickly right?",
            "title_similarity": "0.6072475",
            "sentiment_compound": 0.7236
        },
        {
            "id": "hz3kx7n",
            "score": 3,
            "text": "How credible is this? Seems like a very short amount of time to take over a country. Crazy to think someone would expect that to work",
            "title_similarity": "0.27917647",
            "sentiment_compound": 0.0258
        },
        {
            "id": "hz3rdnn",
            "score": 3,
            "text": "Its so funny how many people think this info is correct.\n\nIf Ukraine had knowledge of Russian movements they wouldn't announce it; that would just make Russia abandon that plan and institute a new one",
            "title_similarity": "0.56636673",
            "sentiment_compound": 0.0754
        },
        {
            "id": "hz3suwo",
            "score": 2,
            "text": "I cant believe you people believe any of this crap...was it the ghost of Kiev that found them?",
            "title_similarity": "0.3710422",
            "sentiment_compound": -0.3182
        },
        {
            "id": "hz3t9hw",
            "score": 3,
            "text": "15 days ain't over yet.",
            "title_similarity": "0.29783767",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz3wenj",
            "score": -3,
            "text": "wtf war was to last at least 15 days? so it's not the Ukraine's being \"strong\"...it was planned out by the Russians to drag out this war....?",
            "title_similarity": "0.8674967",
            "sentiment_compound": -0.9308
        },
        {
            "id": "hz3xi50",
            "score": 1,
            "text": "Christ people, stop arguing with Russian bots. \n\nIf they’re calling this fake news/propaganda, their accounts are less than 2 years old, especially less than a few weeks old and there entire post history is anti Ukraine nonsense with a sprinkle of sports or porn…it’s a bot\n\n\nJust downvote and move on.",
            "title_similarity": "0.60692513",
            "sentiment_compound": -0.9157
        },
        {
            "id": "hz3xqse",
            "score": -2,
            "text": "News media agrees: this should not be happening to “ blue eyed European people\" in “ a civilized place” , “these are not “refugees”, these are ordinary  Europeans.  \n\nTheir words, not mine. Watch.\n\nhttps://www.reddit.com/r/facepalm/comments/t3n3ip/reporters_this_isnt_just_some_uncivilized/?utm_source=share&utm_medium=ios_app&utm_name=iossmf",
            "title_similarity": "0.35691622",
            "sentiment_compound": 0.2023
        },
        {
            "id": "hz42psc",
            "score": 4,
            "text": "Yeah, as much as I hate Russia I don’t buy this crap. Propaganda at its best",
            "title_similarity": "0.40044528",
            "sentiment_compound": -0.3182
        },
        {
            "id": "hz42wym",
            "score": -2,
            "text": "Remember 2 weeks back when Tucker said we should keep our noses out of this?\n\nRemember last week when TFG said how Putin was \"smart\" and \"savvy\" and for $2 he can just \"walk in\" and take the country?\n\nWe should never forget this...",
            "title_similarity": "0.6003233",
            "sentiment_compound": 0.5756
        },
        {
            "id": "hz4443y",
            "score": 4,
            "text": "Anyone notice the end, they seem to think that Russian soldiers turning themselves in and saying that they didn't know what the plan was is a ruse.\n\nIf so that is troubling, I hope they lock those PoWs up securely til this has been decided.",
            "title_similarity": "0.6019186",
            "sentiment_compound": 0.1372
        },
        {
            "id": "hz47plb",
            "score": -3,
            "text": "Damn.  Anything with Trump in it yet.",
            "title_similarity": "0.24040307",
            "sentiment_compound": -0.4019
        },
        {
            "id": "hz48gc3",
            "score": -3,
            "text": "Seems to be going to plan for Russia. First city has fallen. Sad but the end of getting closer for Ukraine.",
            "title_similarity": "0.6459219",
            "sentiment_compound": -0.4215
        },
        {
            "id": "hz4j2w6",
            "score": -3,
            "text": "It is surreal to me that people believe without pause that a military with the fourth highest budget in the world relies on paper documents and hand drawn maps without any satelite imagery in 2022. A little crital thinking is all it takes to realize that this is manufactured news.",
            "title_similarity": "0.45985729",
            "sentiment_compound": 0.4939
        },
        {
            "id": "hz4qs38",
            "score": -3,
            "text": "This is just silly.. Putin's goal is to put in a govt tolerable to the ukranians that is anti-nato, if that fails, he'll occupy the country forever.   The paleoconservatives understand what is happening.  essentially repeating John Mearsheimer thesis: russia will do whatever it takes to stop ukraine from joining NATO.   biden/zelensky's recent statements about Ukraine joining NATO had a predictable response according to Meersheimer (from his univ of chicago vids from 2015)...  Shouldn't be a surprise to anyone.   Russia is a global military super power - they can do whatever they want to a border nation militarily.   Their goal is to not kill civilians.  You can see this when a single person can stop a line of tanks.",
            "title_similarity": "0.7309603",
            "sentiment_compound": 0.2556
        },
        {
            "id": "hz4rs75",
            "score": -3,
            "text": "This is obviously propaganda.",
            "title_similarity": "0.092585005",
            "sentiment_compound": -0.25
        },
        {
            "id": "hz5oc4o",
            "score": 3,
            "text": "What’s the chance of a soldier carrying around secret documents and then accidentally losing them? \n\nSounds like what the allies did in WW2, with that corpse with false documents about the allies invading Greece, only for them to actually invade Italy",
            "title_similarity": "0.56309193",
            "sentiment_compound": -0.6369
        },
        {
            "id": "hz33sz3",
            "score": 48,
            "text": "This is really turning into a comedy of errors on Russia's part.  They used to say 'Everyone is useful,  even if only as a bad example'.  The Russian military seems to have found it's purpose.",
            "title_similarity": "0.5178097",
            "sentiment_compound": -0.128
        },
        {
            "id": "hz3mo72",
            "score": 15,
            "text": "How far fetched is it to consider that a high ranking government official or military office “leaked” the documents in hopes that it would bring the invasion to an end quicker than it would have otherwise?",
            "title_similarity": "0.5232584",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hz33q31",
            "score": 4,
            "text": "There were a couple dozen buy 1 get 1 big mac coupons and some preprinted IOU's for gas stations",
            "title_similarity": "0.36114",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz3kxjk",
            "score": 3,
            "text": "Why would they give a printout of invasion plans to this brigade? Shouldn’t we question the legitimacy of the docs?",
            "title_similarity": "0.49260703",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz3v4tn",
            "score": 3,
            "text": "Used to work at an Army base.  A Colonel once told me make all the plans you want, once you get past the line of departure everything changes!!  GO  UKRAINE!!",
            "title_similarity": "0.7012024",
            "sentiment_compound": 0.3544
        },
        {
            "id": "hz3bt0s",
            "score": 16,
            "text": "Are they still printing war plans? Like is this a video game where you find a journal and know top secret mission status? Haha I love it though haha Slava yukes baby",
            "title_similarity": "0.48911536",
            "sentiment_compound": 0.8738
        },
        {
            "id": "hz3eu5j",
            "score": 16,
            "text": "I have to say, russia has outdone themselves.  This is by far one of, if not the biggest fuck-up with an invasion that we've seen in modern history.  \n\nIt is mind boggling, just about every thing russia could have screwed up with this, they did.  I swear putin was aiming for the prize as the worst attacking dicktator that we've seen yet.  Bravo you fucking dipshit.",
            "title_similarity": "0.5699886",
            "sentiment_compound": -0.8908
        },
        {
            "id": "hz3kjad",
            "score": 5,
            "text": "Did they find perfectly intact IDs and Passport amongst the burning rubble also?",
            "title_similarity": "0.2370818",
            "sentiment_compound": 0.7184
        },
        {
            "id": "hz4jdc0",
            "score": -4,
            "text": "If you guys like sad rap/ melodic music, check out my YouTube. [https://youtu.be/WRmSIuj_SRg](https://youtu.be/WRmSIuj_SRg)",
            "title_similarity": "0.30648682",
            "sentiment_compound": -0.1531
        },
        {
            "id": "hz4zfni",
            "score": -5,
            "text": "Russian army are in Kiev and u think that Ukraine have a chance to win?",
            "title_similarity": "0.6809554",
            "sentiment_compound": 0.7003
        },
        {
            "id": "hz35p4s",
            "score": 21,
            "text": "Is that a fucking *powerpoint*? Jesus Christ I can’t escape them.",
            "title_similarity": "0.279153",
            "sentiment_compound": 0.1779
        },
        {
            "id": "hz3qnff",
            "score": 6,
            "text": "This has to be one of the most inept wars ever fought. The Russian military, their doctrine, their equipment and even the leadership on the ground and in the kremlin has shown itself to be utter garbage and nothing but smoke and mirrors. \n\nRussia is, was and always will be a complete dumpster fire and a laughing stock.",
            "title_similarity": "0.49940288",
            "sentiment_compound": -0.4194
        },
        {
            "id": "hz3vhkl",
            "score": -7,
            "text": "Love that people are eating this bs up.",
            "title_similarity": "0.112994745",
            "sentiment_compound": 0.6369
        },
        {
            "id": "hz3qkzp",
            "score": 26,
            "text": "Something doesn’t feel right. I find it hard to believe that Russia, a country that scared the living fuck out of America, is fighting a war like the three stooges. Especially against a sovereign nation that’s literally recruiting people from the streets. Either Russia is up to something or Ukraine is killing it with the disinformation game.\n\nEither way. Good for the little guys.",
            "title_similarity": "0.63446784",
            "sentiment_compound": -0.9217
        },
        {
            "id": "hz5zfyu",
            "score": -9,
            "text": "Probably not. It’s another Hollywood tactic like most of the fuel thrown on the fires around the world. America has become a rogue state. An extremely dangerous rogue state.",
            "title_similarity": "0.4816035",
            "sentiment_compound": -0.2247
        },
        {
            "id": "hz32a5q",
            "score": 99,
            "text": "Putin is looking more incompetent by the moment",
            "title_similarity": "0.34057456",
            "sentiment_compound": -0.5256
        },
        {
            "id": "hz3jok8",
            "score": 52,
            "text": "**”The Joint Forces Operational Command also said: \"When one of the captured Russian soldiers says that they came to participate in drills and got lost, do not believe it! They knew; they carefully planned and prepared.”**\n\nI got downvoted and fought with a few days ago a world news thread for saying that the Russian troops knew what they were doing.  They all have the same line; it’s a programmed part of the script.  Russians are going to Russian.  \n\nI was bot bombed to hell for suggesting that the Russian troops in Ukraine were not surprised by war when out for a little friendly drill along the border.  THEY KNOW WHAT THEY ARE DOING AND ALWAYS HAVE.  \n\nMy empathy is deep for them because I know many can’t back out or stand up to anyone in Purim’s Russia.  But they are lying on the commands of Putin.\n\nLet’s show deep compassion and mercy for Russian deserters, detectors, and POW’s who surrendered peacefully.  The cold blooded troops who continue to fight this senseless war, not so much.\n\nThey our 21st century former SS agents.  Persona non grata.",
            "title_similarity": "0.6685425",
            "sentiment_compound": -0.6057
        },
        {
            "id": "hz4l9jt",
            "score": -12,
            "text": "Putin's a smart guy, his plan was simply to wreck Ukraine, not occupy it. Realist international relations thinkers such as Mearsheimer already predicted such moves by Russia as a consequence of NATO expansion and Ukraine's ambition to align itself with the West. Too bad Western politicians and Ukrainians are too dumb to understand the basics of international politics.",
            "title_similarity": "0.6222925",
            "sentiment_compound": -0.7906
        },
        {
            "id": "hz2zbxw",
            "score": 62,
            "text": "Is this legit?",
            "title_similarity": "0.028592696",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz3i150",
            "score": 15,
            "text": "Russia sure is being made into a laughing stock via social media, but I worry because that's exactly the kind of energy that makes people want to shoot up the school or the nuke the earth. I mean at this point everyone probably has doubts that the Russian nukes even work, so all the more reason for a loser like Putin to be backed into a corner and push the doomsday button.",
            "title_similarity": "0.5601655",
            "sentiment_compound": -0.9142
        },
        {
            "id": "hz5fi5l",
            "score": -14,
            "text": "Let me preface this with saying that I don’t support war no matter who is fighting and I definitely don’t support the Kremlin or the United States puppet governments regardless of which side of the fake political duopoly is in power.\n\nAnybody still want to deny the Ukrainians using Neo-Nazis to commit genocide on ethnic Russians. One the top in command even said in a press conference that without their force, the 2014 coup (backed by the CIA) would have been “nothing more than a gay parade”. Anybody else notice how Biden didn’t mention the issue of overdose or addiction in his SOTU? Probably because it would put a highlight on Hunter Biden using his family name to get a lucrative position on a Ukrainian gas board when he has no knowledge of the industry. It never would have happened if the coup had not taken place.\n\nThe CIA has funded and trained terrorist groups all around the world but for some reason, people refuse to acknowledge the reality that they are now training Neo-Nazis. These are the same people that in the Philippines during the 50’s, upon learning of locals fear of vampires, had an operation where they would kill one of the Huk soldiers, make puncture wounds in the neck, hang them upside down to drain them of blood and leave them for the other guerrilla soldiers to find. They would then flee the area immediately. This is just one of the many examples of psychological warfare that the CIA has used not to leave out the incredibly popular MK Ultra. I hear it has great Yelp reviews!\n\nIf any of the ignorant mask toters want to criticize the gun owners without knowing anything about guns, you may want to make sure your tyrannical government facading as a peace keeping operation stops arming terrorist groups while trying so hard to remove your second amendment rights which is one of the few that actually still exist. Under the 2012 NDAA, Congress removed Habeas Corpus which means they can indefinitely detain anyone without trial if they deem them a terrorist… while funding terrorists simultaneously. Who cares if those same extremists then create more problems and attack the US? At least the weapons manufacturer stocks will soar! \n\n[Azov Battallion](https://en.m.wikipedia.org/wiki/Azov_Battalion)\n\n[CIA Operation Vampire](https://greatgameindia.com/how-cia-used-vampires-as-weapons-of-war/)",
            "title_similarity": "0.5997305",
            "sentiment_compound": -0.9887
        },
        {
            "id": "hz3157l",
            "score": 14,
            "text": "Russian military aren’t exactly Turing are they?",
            "title_similarity": "0.41754454",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz38fn1",
            "score": 14,
            "text": "Now I want a Top Secret! version of this story where a handsome Ukrainian smuggles Putin's secret plans to Zelenskyy with Rock & Roll and sight gags. It could end with a musical number on the streets of Kyiv with Zelenskyy playing himself.",
            "title_similarity": "0.58216214",
            "sentiment_compound": 0.6114
        },
        {
            "id": "hz3en3s",
            "score": 15,
            "text": "Baring the information war that is actually going on here, if sanctions and what not are actually enacted in a timely manner, as they appear to be, then what might very well stop Russia, is a financial collapse before anything else.\n\nIn that regard, and again if the sanctioning moves fast, Ukraine only needs to wait for the collapse.\n\nBoth nations are going to carry a very heavy burden. Ukraine will bootstrap faster than Russia, but the Russia problem is and will remain a global problem.\n\nMy bigger concern is that we may very well see the stage being set for something worse. Putin will not come off of this well, but who in his ranks are we aggravating enough that 10 or 20 years from now returns as the 'saviour'.\n\nHistory has a way of repeating itself, and it does repeat itself.",
            "title_similarity": "0.6408985",
            "sentiment_compound": -0.9401
        },
        {
            "id": "hz3tdq4",
            "score": 14,
            "text": "Okay a couple of things don't make a whole lot of sense about this. One is that why a brigade level unit would have plans for the entire invasion and two is that based on apparent supply issues if the news reports are to be believed, it really seems like the Russians were planning on this thing taking three or four days",
            "title_similarity": "0.6153901",
            "sentiment_compound": 0.5688
        },
        {
            "id": "hz3efk9",
            "score": 16,
            "text": "Dear Russia,\n\nWe all know you’re a proud and powerful people with a really cool history both recent and ancient.\n\nWhy the hell are you allowing yourself to still be led by a madman who has decided to burn everything down? \n\nWhy is your leadership so ill prepared and incompetent?\n\nYou’re better than these shits.\n\n-The Rest of the World (minus Belarus and North Korea)\n\nPS: Isis says to cut this shit out too.",
            "title_similarity": "0.56079406",
            "sentiment_compound": -0.7879
        },
        {
            "id": "hz2zgk6",
            "score": 207,
            "text": "[removed]",
            "title_similarity": "0.055294536"
        },
        {
            "id": "hz3ezxd",
            "score": 54,
            "text": "Putin's war strategy is working out almost as well as Kayne's \"get Kim back\" strategy",
            "title_similarity": "0.48072585",
            "sentiment_compound": -0.4728
        },
        {
            "id": "hz36fc1",
            "score": 89,
            "text": "How reputable is this news organisation?",
            "title_similarity": "0.1694977",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz3b9et",
            "score": 20,
            "text": "So 15 days? So they have like 8 days left? So they are still in schedule or? I dont understand that stuff",
            "title_similarity": "0.48249835",
            "sentiment_compound": 0.5112
        },
        {
            "id": "hz3lauz",
            "score": 23,
            "text": "Hold up. The source for this is from Facebook? What's the legitimacy of the page that it came from? Is it a Ukrainian government page? Furthermore, why would you alert the enemy that you have obtained a copy of their invasion plans, losing the ability to anticipate their movements? This is fishy.",
            "title_similarity": "0.60978055",
            "sentiment_compound": -0.5514
        },
        {
            "id": "hz309hm",
            "score": 1819,
            "text": "Discovering secret plans and documents should be taken with a grain of salt.  Deception and misdirection is a very old and very effective tactic.",
            "title_similarity": "0.35190356",
            "sentiment_compound": 0.1263
        },
        {
            "id": "hz37c2b",
            "score": 990,
            "text": "> When one of the captured Russian soldiers says that they came to participate in drills and got lost, do not believe it! They knew, they carefully planned and prepared.\n\nGlad someone is finally saying this. We're a week into this now, that excuse is long gone even if you assume it was true.",
            "title_similarity": "0.6005297",
            "sentiment_compound": 0.7574
        },
        {
            "id": "hz342zf",
            "score": 223,
            "text": "SECRET PLANS: DO NOT READ",
            "title_similarity": "0.16809742",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz3b6pu",
            "score": 450,
            "text": "How do we know this is for real? When I saw this, operation mincemeat come to mind... \n\nNot saying this is a fake plan, but it kinda make me wonder...",
            "title_similarity": "0.31686383",
            "sentiment_compound": -0.2617
        },
        {
            "id": "hz32ay8",
            "score": 6310,
            "text": "British and American intelligence services have completely penetrated Russia.",
            "title_similarity": "0.5523263",
            "sentiment_compound": 0.4767
        },
        {
            "id": "hz34rt5",
            "score": 1296,
            "text": "15 days seems about right given their strategy. \n\nGet Kiev, install Yanchovych and then stomp out resistance. \n\nHowever, they did not perceive the resistance that Ukraine would put up and they may have bitten off a bit more than what they can chew.",
            "title_similarity": "0.64362144",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz2zepv",
            "score": 1987,
            "text": "I'm starting to think the whole Donbass thing was just a pretext.",
            "title_similarity": "0.37901008",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz33xo0",
            "score": 2846,
            "text": "So they planned for the invasion to last over 2 weeks and STILL didn't prepare their supply lines to make sure they had enough fuel, food, equipment maintenance, etc. \n\nSays a lot about the Russian brass.",
            "title_similarity": "0.63263",
            "sentiment_compound": 0.3182
        },
        {
            "id": "hz3jo2u",
            "score": 660,
            "text": "I’m a Gen X child of the Cold War.  It is beyond weird to me to trust anything from a site called “Pravda”.",
            "title_similarity": "0.58279026",
            "sentiment_compound": -0.3182
        },
        {
            "id": "hz2zidf",
            "score": 1337,
            "text": "I wonder what their plans is after the 15 days. Interesting article",
            "title_similarity": "0.5826617",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hz379kt",
            "score": 4213,
            "text": "I remember a few weeks ago that there were reports that some Russian military commanders we're trying (in vain) to get Putin to understand that an invasion of Ukraine was not going to be nearly as easy as he believed.  Everything that's happened since definitely lends credence to the notion that Putin thought it'd be pretty quick.",
            "title_similarity": "0.7163213",
            "sentiment_compound": 0.7184
        },
        {
            "id": "hz2z9do",
            "score": 8512,
            "text": ">\tAmong the retrieved documents are a working map, combat mission, call sign table, control signal tables, hidden control tables, personnel list, etc.\n\n>According to this information, the plans for the war with Ukraine were approved on 18 January 2022. The plans anticipated that the capture of Ukraine must be executed within 15 days, from 20 February to 6 March.\"\n\n>Details: This unit of Russia’s Black Sea Fleet intended to disembark from the large landing ship \"Orsk\" near the town of Stepanovka-1 and then work with military units of the 58th Army of the Russian Federation, namely the 177th Separate Regiment of the Russian Black Sea Fleet Marines.\n\n>The ultimate goal of these forces was to blockade and take control of Melitopol.\n\n*On a similar, concerning note, Indian embassy today asked all Indians stranded in Kharkiv to IMMEDIATELY leave the city  even if it requires them to travel by foot. This is huge! Coming directly from the government.*\n\n*It means shit is about to ~~hit the fan~~ break the ceiling in Kharkiv.. Officials are afraid Putin is going all in...*\n\nEDIT: \n>\tIndian ministry of external Affairs spokesperson said that advisory issued by Indian embassy for nationals to leave Kharkiv by 6 p.m. local time was given on **“basis of information from Russia”**\n\nSo Russia directly alerted Indian govt about Kharkiv. In all probability, something big is about to go down.",
            "title_similarity": "0.9078798",
            "sentiment_compound": -0.636
        },
        {
            "id": "hz32jwo",
            "score": 886,
            "text": "The first casualty in any battle is the battle plan.",
            "title_similarity": "0.49640805",
            "sentiment_compound": -0.8225
        },
        {
            "id": "hz37pfk",
            "score": 301,
            "text": "In fairness, Donald Rumsfeld did say the duration of the Iraq War was:\n\n“Five days or five weeks or five months, but it certainly isn’t going to last any longer than that.”",
            "title_similarity": "0.56881756",
            "sentiment_compound": 0.1655
        },
        {
            "id": "hz2z12p",
            "score": 11125,
            "text": ">we will say one thing to the Russian invaders: Leave your equipment and secret documents behind, we will need them for our defenders. And we will need them for the Hague.",
            "title_similarity": "0.60770094",
            "sentiment_compound": 0.0258
        },
        {
            "id": "hz2z22w",
            "score": 5845,
            "text": "Wasnt the 810th Brigade the same ones that apparently refused to join the seaborne invasion the other day?",
            "title_similarity": "0.486983",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz300uy",
            "score": 16915,
            "text": "So much shady shit is going to get exposed as documents get captured",
            "title_similarity": "0.35369006",
            "sentiment_compound": -0.6326
        },
        {
            "id": "hz33gru",
            "score": 1841,
            "text": "So... how far behind are they, if at all? We're only halfway through that playbook.",
            "title_similarity": "0.32318306",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz2zbjn",
            "score": 6977,
            "text": "It's cool to see the actual plans. I don't speak or read Russian. Can anyone who can take a look and let us know what the most interesting parts are?",
            "title_similarity": "0.3679555",
            "sentiment_compound": 0.6478
        },
        {
            "id": "hz3fokl",
            "score": 439,
            "text": "They were lying to the world for months and months.  \"Of course we're not going to invade Ukraine!  We have no interest in doing that!\"\n\n*[approves detailed battle plans for invasion of Ukraine]*",
            "title_similarity": "0.672168",
            "sentiment_compound": -0.7479
        },
        {
            "id": "hz38iax",
            "score": 2,
            "text": "I figured they were hoping for another Russo-Georgian war, which itself was about 2-3 weeks. And had they stuck to only invading the eastern regions, maybe that could've happened.",
            "title_similarity": "0.66743267",
            "sentiment_compound": -0.4767
        },
        {
            "id": "hz39xga",
            "score": 1,
            "text": "Its very unlikely that any brigade has the entire war plans. It will have its initial operational plans for 15 days. follow on plan would be issued later.",
            "title_similarity": "0.71512985",
            "sentiment_compound": -0.5994
        },
        {
            "id": "hz3a6t2",
            "score": 1,
            "text": "Well, it’s been 7 so far and only partial control of Kherson to show for it.",
            "title_similarity": "0.3125432",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hz3bfgu",
            "score": 1,
            "text": "Oh, yeah!  Well make that **16 days**!\n\n/s",
            "title_similarity": "0.3606016",
            "sentiment_compound": 0.5972
        },
        {
            "id": "hz3bmu5",
            "score": 1,
            "text": "Man! Russia is really dropping the ball on this one. Lists of enlisted soldiers. Secret plans Maybe they should stick to making Vodka and not killing folks.",
            "title_similarity": "0.56841886",
            "sentiment_compound": 0.587
        },
        {
            "id": "hz3bph1",
            "score": 1,
            "text": "Whoops....",
            "title_similarity": "-0.04541655",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz3c9bb",
            "score": 1,
            "text": "Spoiler Alert!",
            "title_similarity": "0.1176919",
            "sentiment_compound": 0.3595
        },
        {
            "id": "hz3d1n0",
            "score": 1,
            "text": "Why is Pravda being used as a source of anything but examples of blatant propaganda?!",
            "title_similarity": "0.33401853",
            "sentiment_compound": -0.4199
        },
        {
            "id": "hz3d5uw",
            "score": 1,
            "text": "And then have crippled their economy whose effects will last for decades.",
            "title_similarity": "0.51461387",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz3darj",
            "score": 1,
            "text": "Very important news",
            "title_similarity": "0.15921",
            "sentiment_compound": 0.2716
        },
        {
            "id": "hz3dd64",
            "score": 1,
            "text": "\"On the 16th day we run out of money to pay the troops. DO NOT LET IT GO OVER 15 DAYS!\"\n\n/s",
            "title_similarity": "0.6136469",
            "sentiment_compound": -0.1759
        },
        {
            "id": "hz3dgja",
            "score": 2,
            "text": "I'm as anti Russian as it gets here, but i cannot believe any newspaper calls правда says.. inherited this inability from soviet times...\n\nAlso, any marines have the best secret document destroying device all around them: the sea. How would they not use that?",
            "title_similarity": "0.6020199",
            "sentiment_compound": -0.6043
        },
        {
            "id": "hz3dqpx",
            "score": 1,
            "text": "Genuine question: if these documents are secret, why show to the entire world that you got them? Wouldn't it make sense to use the knowledge and only reveal that you knew the plan all along after all is done? Or are all of these plans obsolete already?",
            "title_similarity": "0.39124906",
            "sentiment_compound": -0.4098
        },
        {
            "id": "hz3eta1",
            "score": 1,
            "text": "Is it dangerous to release this info, or release the fact that you have this? I would imagine holding this info secret would give you an advantage. If the Russians find out their info has been leaked, they would then change their plans.  \n(Sorry, I'm super ignorant to combat strategy)",
            "title_similarity": "0.48341665",
            "sentiment_compound": -0.5106
        },
        {
            "id": "hz3evxc",
            "score": 1,
            "text": "so what's our take on this? does it seem legitimate?",
            "title_similarity": "0.03424064",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz3f4et",
            "score": 1,
            "text": "Could be a decoy. I don't think Russia would be putting plans on pen and paper and entrusting foot foot soldiers.",
            "title_similarity": "0.40819475",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz3fa3x",
            "score": 1,
            "text": "15 days Russia had high hopes.",
            "title_similarity": "0.6002208",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hz3fb4i",
            "score": 1,
            "text": "“We’ll be home by Christmas!”",
            "title_similarity": "0.29630917",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz3fgrh",
            "score": 6,
            "text": "WTF is wrong with the Russians?  Should we just remove them from Hollywood and video games as the baddies b/c this is just sad at military regardless of who they are attacking",
            "title_similarity": "0.56577957",
            "sentiment_compound": -0.9291
        },
        {
            "id": "hz3fnta",
            "score": 2,
            "text": "I mean it makes more sense than the rumours going around that they were expecting to win in two days.",
            "title_similarity": "0.27376288",
            "sentiment_compound": 0.5859
        },
        {
            "id": "hz3fz3a",
            "score": 2,
            "text": "Sekrit dokuments",
            "title_similarity": "0.03833147",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz3g5l7",
            "score": 2,
            "text": "They are still not going to get Ukraine by that date.",
            "title_similarity": "0.39700854",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz3gdn2",
            "score": 2,
            "text": "Putin’s quagmire.",
            "title_similarity": "0.42185485",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz3gh9c",
            "score": 1,
            "text": "It’s too bad this was not leaked to the world a month or two ago.",
            "title_similarity": "0.39529276",
            "sentiment_compound": -0.3691
        },
        {
            "id": "hz3gp78",
            "score": 1,
            "text": "Hand-drawn invasion plan maps? In 2022?",
            "title_similarity": "0.454489",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz3gubv",
            "score": 1,
            "text": "They can still meet that deadline.",
            "title_similarity": "0.06777299",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz3gvgt",
            "score": 1,
            "text": "what if they were meant to be found?",
            "title_similarity": "0.04900176",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz3h9k2",
            "score": 61,
            "text": "Who could have possibly imagined invading a country of 40 million people would be harder than invading a country of 4 million?\n\nThat’s big if true.",
            "title_similarity": "0.48816615",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hz3hdwd",
            "score": 1,
            "text": "I'm afraid Putin will wage war against NATO. They have weapons that use hybrid ammo. 500% sure it's not coincidence.",
            "title_similarity": "0.67294836",
            "sentiment_compound": -0.6705
        },
        {
            "id": "hz3hxhg",
            "score": 2,
            "text": "This gives off operation mincemeat vibes...I’d be cautious about the truthfulness of those plans",
            "title_similarity": "0.19380255",
            "sentiment_compound": 0.3182
        },
        {
            "id": "hz3i0vf",
            "score": 1,
            "text": "serious question how do they know these weren't planted to find?",
            "title_similarity": "0.23554926",
            "sentiment_compound": -0.0772
        },
        {
            "id": "hz3i2a4",
            "score": 1,
            "text": "Why would they make this public",
            "title_similarity": "0.14373305",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz3icnc",
            "score": 2,
            "text": "why is this being released?",
            "title_similarity": "0.084089786",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz3igft",
            "score": 1,
            "text": "Дорогий Ісусе, ми молимося цією молитвою до Святого Архангела Михаїла, Покровителя України в бою.\n\n«Святий архангел Михаїле, захисти Україну в бою. Будь їм захистом від нечестивості та пасток злого духа диявола, що живе в Путіні. Нехай докорить йому Бог, смиренно молимося, а ти, князю небесних сил, силою Божою кинути до пекла сатану та всіх злих духів, що бродять по світу, шукаючи загибелі душ. Амінь». Захистіть усіх українців, особливо воїнів, жінок та дітей. Захисти їх, Ісусе. Покликайте легіони, якщо Ангели та захистіть всю Україну та поверніть російську зброю до росіян, які її прислали.\nДякую Тобі Ісусе і дякую святому Михаїлу за відповідь на наші молитви.",
            "title_similarity": "0.39460006",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz3iulm",
            "score": 2,
            "text": "This is some top level intel here ... yowza.",
            "title_similarity": "0.16063935",
            "sentiment_compound": 0.2023
        },
        {
            "id": "hz3j0ca",
            "score": 1,
            "text": "The source is Facebook...",
            "title_similarity": "0.15871876",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz3j26d",
            "score": 2,
            "text": "I don't believe it.\n\nThere's no benefit to making it publicly known that these plans were captured.",
            "title_similarity": "0.21919917",
            "sentiment_compound": -0.357
        },
        {
            "id": "hz3j2v4",
            "score": 2,
            "text": "I thought Pravda is a Russian newsource. Could this be a fake?",
            "title_similarity": "0.5412129",
            "sentiment_compound": -0.4767
        },
        {
            "id": "hz3jh3c",
            "score": 2,
            "text": "Now that’s some nice hacking",
            "title_similarity": "0.041225076",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hz3jipv",
            "score": 1,
            "text": "Does it say anywhere that Russia is sending in conscripted folks to throw Ukraine off or deplete them of resources? Because this whole thing is very weird. It’s hard to believe the Russian army is so depleted that they would send teachers and janitors to go fight, and on top of that, have their tanks and military equipment stolen. What is going on?",
            "title_similarity": "0.69106865",
            "sentiment_compound": -0.7916
        },
        {
            "id": "hz3jnq9",
            "score": 2,
            "text": "15 weeks maybe, and you'll still have internal resistance from people for many years. 15 days? lol",
            "title_similarity": "0.60948515",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hz3jwxy",
            "score": 1,
            "text": "2 weeks to slow the Russian spread??",
            "title_similarity": "0.5985199",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz3jx6k",
            "score": 1,
            "text": "Why were they carrying these into battle? Did they need to check them for reference? I don't understand.",
            "title_similarity": "0.42345053",
            "sentiment_compound": -0.4515
        },
        {
            "id": "hz3k1dj",
            "score": 2,
            "text": "I think it’s a fake piece that helps Putin safe face. Previous reports and Russian strategy say they expected to take Kiev in 3-4 days",
            "title_similarity": "0.6545501",
            "sentiment_compound": 0.34
        },
        {
            "id": "hz3k341",
            "score": 1,
            "text": "I would be very sceptical about this...",
            "title_similarity": "0.07759621",
            "sentiment_compound": -0.3597
        },
        {
            "id": "hz3k3h2",
            "score": 1,
            "text": "This is Russia we're talking about, I'm expecting fake documents to be planted everywhere for the good guys to \"seize\" and to be mislead by what they read.",
            "title_similarity": "0.5932833",
            "sentiment_compound": -0.0516
        },
        {
            "id": "hz3k7gu",
            "score": 1,
            "text": "Ok but are these real plans or decoy and how do we determine that? I keep hearing conflicting evidence about this being a carefully premeditated event and a total shitshow",
            "title_similarity": "0.3607154",
            "sentiment_compound": -0.296
        },
        {
            "id": "hz3k7xl",
            "score": 2,
            "text": "\"810th Brigade of the battalion tactical group of Russia’s Black Sea Fleet Marines\"\n\nIs that the group that has to go in armoured personnel carriers as their name badges are too long to walk in groups ?",
            "title_similarity": "0.7130209",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz3k85o",
            "score": 1,
            "text": "Why so long, why 15 days? It is baffling how ill-prepared the Russians have been, given their supposed strength, not to mention that they were no where near as incompetent in Syria. Granted it was a much smaller area but still. \n\nWhatever is going on I hope the Ukrainians win.",
            "title_similarity": "0.61298907",
            "sentiment_compound": 0.875
        },
        {
            "id": "hz3k9t4",
            "score": 2,
            "text": "Cant be real.  No way the Ukrainians would be stupid enough to publish how much they know.  It would render the information meaningless.",
            "title_similarity": "0.3779146",
            "sentiment_compound": -0.661
        },
        {
            "id": "hz3kbkc",
            "score": 1,
            "text": "I guess they did attack that ship.",
            "title_similarity": "0.44099733",
            "sentiment_compound": -0.4767
        },
        {
            "id": "hz3kcvq",
            "score": 1,
            "text": "Ah yes... This sounds familiar. Schlieffen plan anyone?",
            "title_similarity": "0.119696945",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hz3kgbp",
            "score": 2,
            "text": "Sending troops with secret docs? Seems like a decoy to me.",
            "title_similarity": "0.4091081",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hz3kh9p",
            "score": 1,
            "text": "15 days? Let's. Fucking. Go! Come on Ukraine! 🇺🇦🇺🇦🇺🇦",
            "title_similarity": "0.6622691",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz3ki9j",
            "score": 1,
            "text": "Are they doing hand drawings as war plans?",
            "title_similarity": "0.47277015",
            "sentiment_compound": -0.1779
        },
        {
            "id": "hz3km8y",
            "score": 2,
            "text": "Vladimir Putin, grandmaster 7000D chess strategist, has committed one of the worst military blunders in history. Bwa ha ha ha ha!",
            "title_similarity": "0.5786246",
            "sentiment_compound": 0.5411
        },
        {
            "id": "hz3knew",
            "score": 1,
            "text": "As a Finnish person I'm having some major deja vu right about now.",
            "title_similarity": "0.31307298",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz3koj3",
            "score": 2,
            "text": "Does this mean they wanted it wrapped up in 15 days, or that they were gonna pull out regardless after 15 days?",
            "title_similarity": "0.61902845",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz3kq35",
            "score": 1,
            "text": "Well , just heard on MSNBC Ukraine received ~ 200 stingers ( maybe javelins too ) on Monday.",
            "title_similarity": "0.5497156",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hz3kr1f",
            "score": 1,
            "text": "I haven’t heard of this news source. Is this credible?",
            "title_similarity": "0.1632798",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz3krb2",
            "score": 1,
            "text": "Pravda?",
            "title_similarity": "0.11368863",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz3kryd",
            "score": 1,
            "text": "They didn't even give them enough food and gas for 5 days.",
            "title_similarity": "0.42113936",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz3ksat",
            "score": 1,
            "text": "So, it was planned all along? I hope Ukraine's resilience wasn't included in the plan.",
            "title_similarity": "0.48690337",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hz3kt4p",
            "score": 1,
            "text": "Can someone set me straight on this source. Looks like Pravda to me. Is Pravda.com.ua the Ukrainian branch office?",
            "title_similarity": "0.5720065",
            "sentiment_compound": 0.5267
        },
        {
            "id": "hz3kthb",
            "score": 1,
            "text": "I'm pretty sure I read earlier about these documents being retrieved by Anonymous? Or am I crazy?",
            "title_similarity": "0.36979175",
            "sentiment_compound": 0.5362
        },
        {
            "id": "hz3kuf8",
            "score": 1,
            "text": "It's interesting they chose to leak this to the media",
            "title_similarity": "0.27193773",
            "sentiment_compound": 0.0772
        },
        {
            "id": "hz3kvye",
            "score": 2,
            "text": "Would like to see what the dipshits who tried to defend Russia have to say now.",
            "title_similarity": "0.5719103",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hz3kwfg",
            "score": 1,
            "text": "Decoys.",
            "title_similarity": "0.04695144",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz3ky50",
            "score": 2,
            "text": "Was it found with a signed copy of Art of the Deal?",
            "title_similarity": "0.24859983",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz3l0c3",
            "score": 2,
            "text": "Man, this stuff is fishy. It’s just hard to believe a nuclear power is this incompetent.",
            "title_similarity": "0.30515525",
            "sentiment_compound": -0.6155
        },
        {
            "id": "hz3l0k1",
            "score": 8,
            "text": "January 18th approval. So exactly when putin was lying openly about not planning to invade.\n\nWhen this ends, we can never trust another word the kremlin ever provides. I mean ever. They are so fucking full of shit",
            "title_similarity": "0.60426474",
            "sentiment_compound": -0.7824
        },
        {
            "id": "hz3l0zj",
            "score": 1,
            "text": ">The Joint Forces Operational Command also said: \"When one of the captured Russian soldiers says that they came to participate in drills and got lost, do not believe it! They knew, they carefully planned and prepared.\n\nHow does this change things for the Russian soldiers who already surrendered?",
            "title_similarity": "0.60830027",
            "sentiment_compound": 0.1007
        },
        {
            "id": "hz3l1nw",
            "score": 1,
            "text": "As a lot of this has been... oops",
            "title_similarity": "0.043867297",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz3l4n0",
            "score": 5,
            "text": "Hasn’t been 15 days yet… i bet this ages poorly",
            "title_similarity": "0.34616065",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz3l66p",
            "score": 3,
            "text": "15 ~~days~~ years\n\nfixed that for you, Putin",
            "title_similarity": "0.6414307",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz3l7bi",
            "score": 2,
            "text": "Is Black Adder a Russian General because the fuckups are never ending for these clowns, which is great.",
            "title_similarity": "0.48336706",
            "sentiment_compound": 0.6249
        },
        {
            "id": "hz3la16",
            "score": 2,
            "text": "Ukraine only has to hold out another week!",
            "title_similarity": "0.5112491",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz3la9f",
            "score": 1,
            "text": "Makes sense — timed for the end of the Olympics as long, long predicted and coinciding with the scheduled end of drills in Belarus. Guessing US intel caused them to delay a few days, potentially contributing to supply issues.",
            "title_similarity": "0.639314",
            "sentiment_compound": -0.3182
        },
        {
            "id": "hz3lc26",
            "score": 2,
            "text": "FYI this probably wasn’t “found”. It was probably stolen by a spy/sympathizer\n\nThey are trying to protect the identity by saying it was found",
            "title_similarity": "0.33135098",
            "sentiment_compound": 0.2342
        },
        {
            "id": "hz3ldn2",
            "score": 1,
            "text": "Now that is some game changing intel",
            "title_similarity": "0.2131749",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz3lfan",
            "score": 1,
            "text": "I know exactly what this means",
            "title_similarity": "0.002162437",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz3lgaj",
            "score": 3,
            "text": "We need world peace ✌🏽",
            "title_similarity": "0.11834042",
            "sentiment_compound": 0.7717
        },
        {
            "id": "hz3lgti",
            "score": 5,
            "text": "Oh jeez not another 15 day plan to fix something…",
            "title_similarity": "0.44815943",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz3li8o",
            "score": 3,
            "text": "Does anybody else get Mussolini vibes from lukashenko?",
            "title_similarity": "0.31796747",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz3ljhw",
            "score": 2,
            "text": "Still the weirdest war. Very fitting for 2022",
            "title_similarity": "0.45519352",
            "sentiment_compound": -0.7003
        },
        {
            "id": "hz3lkyx",
            "score": 2,
            "text": "This is probably the most \"embarrassing\"war, ever. Not for the Russian people of course, but for the leadership, this is just downright ABYSMAL.",
            "title_similarity": "0.5215565",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz3ln9v",
            "score": 1,
            "text": "Interesting 🤔",
            "title_similarity": "-0.0687616",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hz3lnd2",
            "score": 1,
            "text": "Really kinda sad that saying I found secret plans on a social network removes any tactical advantage of finding said secret plans.",
            "title_similarity": "0.33804667",
            "sentiment_compound": -0.2698
        },
        {
            "id": "hz3lnda",
            "score": 1,
            "text": "I smell a War-Crimes trial",
            "title_similarity": "0.47117427",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz3lqtb",
            "score": 1,
            "text": "battleship potemkin moment",
            "title_similarity": "0.40986",
            "sentiment_compound": -0.0258
        },
        {
            "id": "hz3lrkm",
            "score": 7,
            "text": "Russia may win the battle but they have already lost the war due to world isolation.",
            "title_similarity": "0.5870935",
            "sentiment_compound": -0.9052
        },
        {
            "id": "hz3lt73",
            "score": 1,
            "text": "[deleted]",
            "title_similarity": "0.09003144"
        },
        {
            "id": "hz3lzcb",
            "score": 1,
            "text": "Lol.  These guys suck.",
            "title_similarity": "0.06277406",
            "sentiment_compound": -0.0258
        },
        {
            "id": "hz3lzea",
            "score": 1,
            "text": "Sure. Same as Afghanistan. Easy Peasy!",
            "title_similarity": "0.04158741",
            "sentiment_compound": 0.6696
        },
        {
            "id": "hz3m0ou",
            "score": 1,
            "text": "Fuck yeah on them getting this intel.",
            "title_similarity": "0.14686635",
            "sentiment_compound": -0.3182
        },
        {
            "id": "hz3m1yk",
            "score": 1,
            "text": "I’m going to guess they have contingency plans.",
            "title_similarity": "0.203222",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz3m4rm",
            "score": 1,
            "text": "This war has officially become a farce for Russia.",
            "title_similarity": "0.6506696",
            "sentiment_compound": -0.765
        },
        {
            "id": "hz3m5rd",
            "score": 1,
            "text": "Russia’s special ops leaked their plans? That’s fuckin comical. Who the hell was training these people?",
            "title_similarity": "0.58183926",
            "sentiment_compound": -0.6767
        },
        {
            "id": "hz3m7ra",
            "score": 1,
            "text": "So the plans were Vladdy pitching an easy war: “trust me, propaganda is in full force, we take them like we took Crimea, not even our best units will be needed.”\nThis aint gonna end well for Putin.",
            "title_similarity": "0.5253108",
            "sentiment_compound": -0.689
        },
        {
            "id": "hz3m95s",
            "score": 2,
            "text": "I cannot wait to see all the other documents they come in to possession of. This has got to be one of the most sloppiest military assaults I’ve ever seen. And I’ve seen the documentary of when the Austrian  army accidentally attacked themselves In a drunken brawl🤣",
            "title_similarity": "0.58365643",
            "sentiment_compound": -0.7152
        },
        {
            "id": "hz3majb",
            "score": 2,
            "text": "Ran out of food & fuel on day ~4 of a supposedly 15 day war?",
            "title_similarity": "0.6225023",
            "sentiment_compound": -0.5994
        },
        {
            "id": "hz3mh7d",
            "score": 1,
            "text": "I don't understand... So presumably they wanted to kill a bunch of politicians and destroy a bunch of military hardware, but what were they going to do after that in 15 days?  Just leave and expect the Ukrainian people to bow down to whatever dictates Russia issued?  Expect them not to form a new anti-russian government?",
            "title_similarity": "0.7536243",
            "sentiment_compound": -0.7131
        },
        {
            "id": "hz3mhra",
            "score": 2,
            "text": "Lol imagine running out of fuel when you have vast resources",
            "title_similarity": "0.31174466",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hz3mhss",
            "score": 1,
            "text": "pentagon enters the chat",
            "title_similarity": "0.32421732",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz3mhw9",
            "score": 6,
            "text": "Does anyone else feel like this is a decoy? There’s no way Russians and Putin are this inept. I mean, they did tamper with the 2016 election as well as all of our Nation’s current division.",
            "title_similarity": "0.6187548",
            "sentiment_compound": 0.34
        },
        {
            "id": "hz3mi50",
            "score": 24,
            "text": "I want to believe this, but it's too good to be true. I hope it's not just another piece of propaganda to boost morale.",
            "title_similarity": "0.13698807",
            "sentiment_compound": 0.9274
        },
        {
            "id": "hz3mkne",
            "score": 1,
            "text": "\"Why the fuck were you carrying those plans? You were supposed to mail them to the Kremlin!\"\n\n\"I needed to keep my place in this book and then I kind of forgot about them.\"\n\n\"Why the fuck did you bring your book on the mission!\"\n\n\"It's a really good book.\"",
            "title_similarity": "0.4802216",
            "sentiment_compound": -0.6587
        },
        {
            "id": "hz3mln2",
            "score": 6,
            "text": "Could there be a chance Russia is purposefully leaving misleading documents to be discovered?",
            "title_similarity": "0.44319996",
            "sentiment_compound": -0.1779
        },
        {
            "id": "hz3mou9",
            "score": 3,
            "text": "Why though did they share this info with the media though? Keep it to yourself and strategise against Russia/Belarus with it!",
            "title_similarity": "0.55852175",
            "sentiment_compound": 0.3595
        },
        {
            "id": "hz3mp53",
            "score": 1,
            "text": "Fuck Adolf Putin.",
            "title_similarity": "0.4137249",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hz3mxyc",
            "score": 2,
            "text": "Is there any reason to believe this wasn’t intentionally left to misinform about Russia’s plans? I know Britain did that to the Nazis and I’m sure it happens a lot",
            "title_similarity": "0.567263",
            "sentiment_compound": 0.3182
        },
        {
            "id": "hz3n76s",
            "score": 7,
            "text": "15 days huh? Well we're on year 8",
            "title_similarity": "0.43146962",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hz3nd3t",
            "score": 2,
            "text": "\"Quick adventure, in and out\"",
            "title_similarity": "-0.0124298",
            "sentiment_compound": 0.3182
        },
        {
            "id": "hz3neil",
            "score": 3,
            "text": "So the Ukrainians just need 15 days to slow the spread of fascism.",
            "title_similarity": "0.7158404",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz3nezi",
            "score": 3,
            "text": "Shouldn't they have pocketed this and kept it to themselves?",
            "title_similarity": "0.14746438",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz3nf59",
            "score": 1,
            "text": "Taking Kyiv is not winning the war. You need to take all the 454 city's and they only have a few in 7 days",
            "title_similarity": "0.6216206",
            "sentiment_compound": 0.0951
        },
        {
            "id": "hz3ng8f",
            "score": 2,
            "text": "its so nice we can read Russias secret documents every day , the mole is working hard",
            "title_similarity": "0.46063334",
            "sentiment_compound": 0.4005
        },
        {
            "id": "hz3nj20",
            "score": 1,
            "text": "15 days? not even the US could take the whole Ukraine in 15 days without nukes. They are hella optimistic.",
            "title_similarity": "0.6555184",
            "sentiment_compound": 0.3804
        },
        {
            "id": "hz3nmm5",
            "score": 1,
            "text": "If this is true then its very reminiscent of a pig headed English officer in World War 2 who insisted on carrying the plans for Operation Market Garden on his person which was bad enough in itself but when the self righteous knobhead got himself caught the Germans knew exactly where to be to give the para's a welcoming committee. So yeah its not unheard of for military personnel to carry sensitive documents on them, obviously its not a recommended practice!\n\nI am intrigued why Putin hasnt gone all out, in war terms hes actually played quite nice so far. He couldve found a way to weaponise covid sent infiltration groups into the ukraine and poisoned the water supplies, lakes, reservoirs etc to debilitate the local populous before putting boots on the ground. And the other thing is given the amount of stuff he has available, all that seems to be rumbling through so far seems to be a hardcore expeditionary group. Hes got enough people to pretty much line the border and blitzkrieg the country in a few days but yet hes got groups of units using what look like old tech, pretty sure i saw Mil-Mi-24 Hinds on a news report, that helicopter is about as old as me! Havnt seen a Havoc or Hokum anywhere yet! So yeah early days yet given he hasnt even really brought out the big guns yet. But then in chess u dont sacriice your best pieces til u absolutely have to do you? \n\nWonder if hes realised if he takes the Ukraine hes then gonna be responsible for the sizable bill when Chernobyl needs a new containment shield?!?\n\nR.I.P to all those lost so far.",
            "title_similarity": "0.5162424",
            "sentiment_compound": 0.8859
        },
        {
            "id": "hz3nn47",
            "score": 1,
            "text": "If this is true then its very reminiscent of a pig headed English officer in World War 2 who insisted on carrying the plans for Operation Market Garden on his person which was bad enough in itself but when the self righteous knobhead got himself caught the Germans knew exactly where to be to give the para's a welcoming committee. So yeah its not unheard of for military personnel to carry sensitive documents on them, obviously its not a recommended practice!\n\nI am intrigued why Putin hasnt gone all out, in war terms hes actually played quite nice so far. He couldve found a way to weaponise covid sent infiltration groups into the ukraine and poisoned the water supplies, lakes, reservoirs etc to debilitate the local populous before putting boots on the ground. And the other thing is given the amount of stuff he has available, all that seems to be rumbling through so far seems to be a hardcore expeditionary group. Hes got enough people to pretty much line the border and blitzkrieg the country in a few days but yet hes got groups of units using what look like old tech, pretty sure i saw Mil-Mi-24 Hinds on a news report, that helicopter is about as old as me! Havnt seen a Havoc or Hokum anywhere yet! So yeah early days yet given he hasnt even really brought out the big guns yet. But then in chess u dont sacriice your best pieces til u absolutely have to do you? \n\nWonder if hes realised if he takes the Ukraine hes then gonna be responsible for the sizable bill when Chernobyl needs a new containment shield?!?\n\nR.I.P to all those lost so far.",
            "title_similarity": "0.5162424",
            "sentiment_compound": 0.8859
        },
        {
            "id": "hz3nohs",
            "score": 1,
            "text": "Wow wowwhee",
            "title_similarity": "-0.090747885",
            "sentiment_compound": 0.5859
        },
        {
            "id": "hz3npbo",
            "score": 2,
            "text": ">All warfare is based on deception. Hence, when we are able to attack, we must seem unable; when using our forces, we must appear inactive; when we are near, we must make the enemy believe we are far away; when far away, we must make him believe we are near - Sun Tzu\n\nI know throwing out Sun Tzu quotes is amateurish but still, this could well be deception. It’s not unheard of for false intel to be planted on units likely to be captured.",
            "title_similarity": "0.4200484",
            "sentiment_compound": -0.7935
        },
        {
            "id": "hz3nqfv",
            "score": 1,
            "text": "Well, we’re on day 6 now. Nine more days and they’ll have no more plans.",
            "title_similarity": "0.46892998",
            "sentiment_compound": -0.0258
        },
        {
            "id": "hz3nqyj",
            "score": 1,
            "text": "Just because you slap the word Marine on something doesn't make them the ultimate warrior. Look I was in the US Marines and met some of the dumbest mother fuckers around known to the world, even some that would print and carry war plans like this who were officers. So long story short this to me is a very real possibility that Russian Soldiers would have this on them and forget to destroy the evidence.",
            "title_similarity": "0.57872057",
            "sentiment_compound": -0.9246
        },
        {
            "id": "hz3nrtq",
            "score": 2,
            "text": "The longer this goes on, the more I feel that Putin isn't ex-KGB but used to be an Agent of KAOS.\n\nI half expect Maxwell Smart and Agent 99 to make an appearance.\n\nWhat a fucking joke",
            "title_similarity": "0.5356593",
            "sentiment_compound": 0.7776
        },
        {
            "id": "hz3ntjz",
            "score": 1,
            "text": "I really don’t think Russia is dumb enough to hand over Russian tactical plans to Spetsnaz or any low ranking soldier. For all we know it could be a distraction. Germans did this back in WW2 where they would fight in regions that were not necessary as distraction.",
            "title_similarity": "0.5771344",
            "sentiment_compound": -0.6388
        },
        {
            "id": "hz3nty9",
            "score": 2,
            "text": "I really don’t think Russia is dumb enough to hand over Russian tactical plans to Spetsnaz or any low ranking soldier. For all we know it could be a distraction. Germans did this back in WW2 where they would fight in regions that were not necessary as distraction.",
            "title_similarity": "0.5771344",
            "sentiment_compound": -0.6388
        },
        {
            "id": "hz3nv9o",
            "score": 3,
            "text": "Should have kept this secret so Russia would be less likely to readjust things.",
            "title_similarity": "0.3702287",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz3nxnl",
            "score": 1,
            "text": ">The plans anticipated that the capture of Ukraine must be executed within 15 days, from 20 February to 6 March\n\n[https://www.aljazeera.com/news/2022/2/17/us-says-war-appears-imminent-after-shelling-on-ukraine-front-line](https://www.aljazeera.com/news/2022/2/17/us-says-war-appears-imminent-after-shelling-on-ukraine-front-line)   \n\n\nWell damn. Literally had it within days.",
            "title_similarity": "0.82270515",
            "sentiment_compound": -0.1531
        },
        {
            "id": "hz3nytz",
            "score": 1,
            "text": "The whole world straight CLOWNING on Russia 😭😂",
            "title_similarity": "0.46905935",
            "sentiment_compound": 0.1779
        },
        {
            "id": "hz3o00s",
            "score": 2,
            "text": "Looks like Russia is only good at being invaded and not invading other countries.",
            "title_similarity": "0.4618241",
            "sentiment_compound": 0.6597
        },
        {
            "id": "hz3o4ix",
            "score": 1,
            "text": "I hate when Ivan just drops things. Never pays attention to his surroundings. Getting lost getting stuck in mud having no gas.",
            "title_similarity": "0.27342758",
            "sentiment_compound": -0.8481
        },
        {
            "id": "hz3o56g",
            "score": 10,
            "text": "“Everybody has a plan until they get punched in the mouth.” -Mike Tyson",
            "title_similarity": "0.42110246",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz3o9bm",
            "score": 1,
            "text": "What day are we on now?",
            "title_similarity": "0.13754214",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz3obwt",
            "score": 1,
            "text": "[deleted]",
            "title_similarity": "0.09003144"
        },
        {
            "id": "hz3obx8",
            "score": 1,
            "text": "Note feb 20 was the last day of the olympics, as predicted. So they delayed by 4 days for some reason, perhaps logistics.",
            "title_similarity": "0.5551718",
            "sentiment_compound": -0.2911
        },
        {
            "id": "hz3oed7",
            "score": 3,
            "text": "Things are starting to sound weird to me.\n\nIs the Russian military really this inept? I don’t mean to disrespect the Ukrainian military, but it feels like the Russians don’t know how to war effectively, and that just baffles me.\n\nSo many unforced errors on the Russian side, that I’m really wondering if it’s a bit of a ruse on some level.",
            "title_similarity": "0.54672825",
            "sentiment_compound": -0.6118
        },
        {
            "id": "hz3oeld",
            "score": 1,
            "text": "Its crazy how much of a cluster fuck this is for putin",
            "title_similarity": "0.47389734",
            "sentiment_compound": -0.7096
        },
        {
            "id": "hz3ohtk",
            "score": 1,
            "text": "Back in my day this shit was top secret AF, hilariously sobering and revealingly insightful in this age of opensource intelligence affirming what I always suspected, the Russians are decades behind in the art of war.",
            "title_similarity": "0.62130356",
            "sentiment_compound": -0.7876
        },
        {
            "id": "hz3oj67",
            "score": 1,
            "text": "\"Leave your secret documents and equipment behind. We will need them for our defense and we will need them for The Hague.\"\n\nClassic.",
            "title_similarity": "0.42094222",
            "sentiment_compound": 0.0772
        },
        {
            "id": "hz3ojpn",
            "score": 1,
            "text": "*And the ones who hold high places, must be the ones who start*",
            "title_similarity": "0.0850773",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz3on2q",
            "score": 1,
            "text": "“We will need them for The Hague” 💀",
            "title_similarity": "0.23571348",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz3oobc",
            "score": 1,
            "text": "These look like they were done in a grade school drafting class and a 1950s era typewriter.",
            "title_similarity": "0.36003232",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hz3op0n",
            "score": 1,
            "text": "Why would you trust this isn’t also an elaborate misinformation campaign?",
            "title_similarity": "0.15655488",
            "sentiment_compound": 0.25
        },
        {
            "id": "hz3or00",
            "score": 2,
            "text": "Wait a sec. Putin specifically told us there were no plans for an invasion. Did he lie??",
            "title_similarity": "0.4676323",
            "sentiment_compound": -0.3736
        },
        {
            "id": "hz3or2g",
            "score": 5,
            "text": "In spite of what Ukraine is going through, shouldn't this be a tell tale sign to Europe and the US that the Russian military really isn't all that they crack it up to be? Besides the nuclear missiles, I don't think Russia could hold a candle to combined European and us forces from what we have seen so far.",
            "title_similarity": "0.61164725",
            "sentiment_compound": -0.5267
        },
        {
            "id": "hz3ovbs",
            "score": 2,
            "text": "Idk if I’d trust these were left behind on accident.",
            "title_similarity": "0.29966015",
            "sentiment_compound": -0.0516
        },
        {
            "id": "hz3oxdg",
            "score": 1,
            "text": "Some asshole is going to get us Rule Nined.",
            "title_similarity": "0.43973517",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz3oywy",
            "score": 2,
            "text": ">The plans anticipated that the capture of Ukraine must be executed within 15 days, from 20 February to 6 March\n\nI'm curious about their use of the word \"must\" in that sentence, rather than \"expects to\", or \"plans to\".  Must seems to imply that they will back off if they fail to capture Ukraine in that timeframe.",
            "title_similarity": "0.8033693",
            "sentiment_compound": -0.2263
        },
        {
            "id": "hz3p3qt",
            "score": 2,
            "text": "Looking forward to the sequel to that classic film: “The Death of Stalin”\n\n“The Fall of Putin”\n\nHoping Buscemi can play Putin in this one.",
            "title_similarity": "0.53385866",
            "sentiment_compound": 0.0772
        },
        {
            "id": "hz3p4da",
            "score": 1,
            "text": "any source besides pravda? isnt that just Russian propaganda source",
            "title_similarity": "0.51396245",
            "sentiment_compound": -0.25
        },
        {
            "id": "hz3p4yj",
            "score": 2,
            "text": "Are Russian soldiers still using the “we came for training and got lost” excuse… like Comrade, your bombing the fuck out of the 2 largest cities MILES away from Russian borders.. who the fuck is going to believe you?",
            "title_similarity": "0.68416655",
            "sentiment_compound": -0.6705
        },
        {
            "id": "hz3pd4n",
            "score": 1,
            "text": "Didn't they mean 15 years?",
            "title_similarity": "0.40180773",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz3pd60",
            "score": 1,
            "text": "Wow the only way to get a decisive victory in Ukraine, for Russia, is to pry it from their cold dead hands.  Putina found out though.",
            "title_similarity": "0.6696061",
            "sentiment_compound": 0.1027
        },
        {
            "id": "hz3pecw",
            "score": 2,
            "text": "You guys seriously think that,  the Ukranian army will publish that they know the plans of the enemy?",
            "title_similarity": "0.5492295",
            "sentiment_compound": -0.6369
        },
        {
            "id": "hz3pf7s",
            "score": 1,
            "text": "How can they be sure these aren't planted (fake) plans? And how do we know if this isn't just fake news/propoganda?\n\nOperation Mincemeat comes to mind. Stuff like that happens all the time.",
            "title_similarity": "0.40682846",
            "sentiment_compound": 0.8507
        },
        {
            "id": "hz3phdj",
            "score": 2,
            "text": "I cant believe he didnt just assassinate and replace with a puppet to do his biddings a la every powerful nation EVER.  Wouldve cost them literally hundreds/thousands of dollars.  Then just smile and deny.",
            "title_similarity": "0.54223627",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hz3piku",
            "score": 2,
            "text": "“no plan survives contact with the enemy”",
            "title_similarity": "0.36590388",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz3pq5w",
            "score": 1,
            "text": "But isn’t it obvious that Russians didn’t plan for the war to take years, but just a few days or weeks? Nothing unexpected here, though some of the other intelligence/plans they captured may be useful.",
            "title_similarity": "0.5257473",
            "sentiment_compound": -0.3612
        },
        {
            "id": "hz3prle",
            "score": 2,
            "text": "So, the Russians don’t have a plan rn is what I’m hearing.",
            "title_similarity": "0.40147537",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz3pui9",
            "score": 1,
            "text": "Can't understand the language, but can we use it against Putin ?",
            "title_similarity": "0.48923242",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz3pyeg",
            "score": 7,
            "text": "Russia is basically a digital marketing firm with nukes. \n\nGreat at web, social media, SEO / SEM, astroturfing, etc. \n\nTerrible at war.",
            "title_similarity": "0.56091356",
            "sentiment_compound": -0.4404
        },
        {
            "id": "hz3pyv3",
            "score": 2,
            "text": "Man, Im still laughing at the fact that Russia was seen as this big almighty threat and a worthy adversary to west and the Ukrainian people are holding them strong.",
            "title_similarity": "0.4585565",
            "sentiment_compound": 0.6369
        },
        {
            "id": "hz3q2ok",
            "score": 3,
            "text": "The Joint Forces Operational Command also said: \"When one of the captured Russian soldiers says that they came to participate in drills and got lost, do not believe it! They knew, they carefully planned and prepared.",
            "title_similarity": "0.6019312",
            "sentiment_compound": 0.1007
        },
        {
            "id": "hz3q32m",
            "score": 1,
            "text": "Could Putin just fuck over Lukashenko and take Belarus at some point?",
            "title_similarity": "0.5957697",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hz3q3iy",
            "score": 2,
            "text": "\"And we will say one thing to the Russian invaders: Leave your equipment and secret documents behind, we will need them for our defenders. And we will need them for the Hague\"\n\nAmazing.",
            "title_similarity": "0.6172225",
            "sentiment_compound": 0.5994
        },
        {
            "id": "hz3q4o3",
            "score": 1,
            "text": "Does this really matter? Russia literally started a war for no reason anyway.",
            "title_similarity": "0.5896932",
            "sentiment_compound": -0.6915
        },
        {
            "id": "hz3q7pj",
            "score": 1,
            "text": "Why would you expose the fact that you captured the plans?",
            "title_similarity": "0.33121568",
            "sentiment_compound": -0.1531
        },
        {
            "id": "hz3q8n0",
            "score": 1,
            "text": "Ok let's do some math?\n\nWe take out 110 people to resolve this:\n\n122 millions (- 110) and 44 millions (- x(the one which already had to die of this madness)) =\n\na better situation and cease fire. what great would that be.\n\nPutin lovers, go fuck yourselves btw.",
            "title_similarity": "0.579862",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hz3q9lz",
            "score": 1,
            "text": "Isn’t this source Russian State media intentionally translated to English as propaganda? This is what Russia wants you to read.",
            "title_similarity": "0.5378515",
            "sentiment_compound": -0.25
        },
        {
            "id": "hz3qbol",
            "score": 2,
            "text": "Somewhere in Russia is a Project Manager having to explain to Putin why the war is going to take multiple sprints and has cost overruns.",
            "title_similarity": "0.74451923",
            "sentiment_compound": -0.5994
        },
        {
            "id": "hz3qgit",
            "score": 1,
            "text": "of COURSE!",
            "title_similarity": "-0.1037416",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz3qgzy",
            "score": 2,
            "text": "Well well well all the Russian soldier apologists out there might wanna rethink their so called innocence and ignorance",
            "title_similarity": "0.5660581",
            "sentiment_compound": 0.6887
        },
        {
            "id": "hz3qila",
            "score": 1,
            "text": "https://www.reddit.com/r/mapsforlife/",
            "title_similarity": "0.24395901",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz3qknl",
            "score": 1,
            "text": "I am sure these are 100% real and in no way a Russian plant.",
            "title_similarity": "0.24521694",
            "sentiment_compound": 0.0258
        },
        {
            "id": "hz3qlbc",
            "score": 3,
            "text": "Plans were approved Jan 18th...when did all this freedom convoy nonsense start again?",
            "title_similarity": "0.38469765",
            "sentiment_compound": 0.7269
        },
        {
            "id": "hz3qr9l",
            "score": 1,
            "text": "So, it was supposed to start on the 18th, but only started the 24th (I believe?).  \n\n\nThe question is: Now that we have the plans, according to the plans, are they ahead, behind, or even with the planned turning of events? We've all been saying for half a week \"putin probably expected to meet less resistance\" => Was it true or nah?",
            "title_similarity": "0.58469427",
            "sentiment_compound": 0.5632
        },
        {
            "id": "hz3qrsp",
            "score": 1,
            "text": "So from 810th BotBTGoRBSFM?",
            "title_similarity": "0.22341272",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz3qvbe",
            "score": 1,
            "text": "\"And we'll need them for the Hauge\" \n\nWhat an absolute beast!",
            "title_similarity": "0.34332561",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz3qvc5",
            "score": 3,
            "text": "Guys, guys! I figured it out. Putin's plan is to give the Ukrainians so many POWs to feed that they run out of food. Then, he will strike!",
            "title_similarity": "0.64971113",
            "sentiment_compound": -0.2695
        },
        {
            "id": "hz3qvuw",
            "score": 1,
            "text": "That’s a quickly forged fake plan as an excuse for the current shit.",
            "title_similarity": "0.31713632",
            "sentiment_compound": -0.7506
        },
        {
            "id": "hz3qvy3",
            "score": 1,
            "text": "How big is the chance these documents are planted there to be found?",
            "title_similarity": "0.3218188",
            "sentiment_compound": 0.25
        },
        {
            "id": "hz3qx0m",
            "score": 1,
            "text": "I don't know for sure, but I suspect the game of disinformation has begun and anything reported should be suspect until it pans out.\n\nRussia will most certainly take advantage of media outlets wanting a pro-Ukranian dispersion tactic for their own disinformation warfare campaign.\n\nBut if they really are this stupid, it's historic on so many levels.",
            "title_similarity": "0.59406775",
            "sentiment_compound": -0.857
        },
        {
            "id": "hz3qy5h",
            "score": 1,
            "text": "Omg it’s ww1 all over again",
            "title_similarity": "0.26700255",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz3qyie",
            "score": 1,
            "text": "this article is so sus",
            "title_similarity": "-0.015519623",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz3r3yy",
            "score": 1,
            "text": "Cool so only 10 more days!",
            "title_similarity": "0.20074937",
            "sentiment_compound": 0.3802
        },
        {
            "id": "hz3r4gg",
            "score": 1,
            "text": "This is official Russian news?",
            "title_similarity": "0.44656387",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz3r55k",
            "score": 1,
            "text": "Putin is turning into a what if a southpark character went to war",
            "title_similarity": "0.61980987",
            "sentiment_compound": -0.5994
        },
        {
            "id": "hz3r5ut",
            "score": 1,
            "text": "just 15 days to expand the russian border guys",
            "title_similarity": "0.7138256",
            "sentiment_compound": 0.3182
        },
        {
            "id": "hz3rbps",
            "score": 2,
            "text": "If this is true, wouldnt you want to keep this info to yourself to steal signals, defend etc? Doesnt make sense to publish it.",
            "title_similarity": "0.2527598",
            "sentiment_compound": -0.1586
        },
        {
            "id": "hz3rdjc",
            "score": 1,
            "text": "I’m afraid Putin is going to take the nuclear option.",
            "title_similarity": "0.50377405",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz3rf1c",
            "score": 2,
            "text": "The initial reports stating 10 days wasn’t too far off",
            "title_similarity": "0.20969883",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz3rfvx",
            "score": 2,
            "text": "I am still worried that the Russian sheer force of numbers will win out. Yeah that convoy ran out of fuel, but they can always get more fuel... and the more land they capture the less they'll have to travel to resupply...",
            "title_similarity": "0.504952",
            "sentiment_compound": 0.34
        },
        {
            "id": "hz3rgy7",
            "score": 2,
            "text": "Ukrainian gets directly shelled and acts like it’s just another day in the office. \n\nhttps://twitter.com/njohnson_145/status/1499139502404554755?s=21",
            "title_similarity": "0.6021636",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hz3rhjw",
            "score": 1,
            "text": "It probably would last for 15 days...... But only if Ukraine would not get support in weapons and other material.",
            "title_similarity": "0.71239865",
            "sentiment_compound": -0.7742
        },
        {
            "id": "hz3rj30",
            "score": 1,
            "text": "Let’s also not forget that intentionally planting diversionary plans has been used many times before by many countries. Anyone read about how this was used to trick the Nazis when the Allies wanted to go into Italy? I believe it was the Brits, that planted fake invasion plans on dead body at sea. Germans got it and ran with that info…",
            "title_similarity": "0.5444221",
            "sentiment_compound": -0.7866
        },
        {
            "id": "hz3rlnj",
            "score": 1,
            "text": "Okay either The Russians are running one of the greatest decoy army ploys in history or this invasion is a total and complete clusterfuck.",
            "title_similarity": "0.6460321",
            "sentiment_compound": 0.7269
        },
        {
            "id": "hz3rlvq",
            "score": 1,
            "text": "Oh sad",
            "title_similarity": "0.054505885",
            "sentiment_compound": -0.4767
        },
        {
            "id": "hz3rol6",
            "score": 1,
            "text": "A dictator over estimating his abilities? Well I never.",
            "title_similarity": "0.2814038",
            "sentiment_compound": 0.4767
        },
        {
            "id": "hz3rq8y",
            "score": 1,
            "text": "[deleted]",
            "title_similarity": "0.09003144"
        },
        {
            "id": "hz3rtzm",
            "score": 1,
            "text": "They are still drawing battle plans with a red marker these days…",
            "title_similarity": "0.4272421",
            "sentiment_compound": -0.3818
        },
        {
            "id": "hz3ruau",
            "score": 2,
            "text": "WTF is pravada news?",
            "title_similarity": "0.21596253",
            "sentiment_compound": -0.6739
        },
        {
            "id": "hz3rul4",
            "score": 1,
            "text": "Remindme! 8 days",
            "title_similarity": "0.26312056",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz3rvdh",
            "score": 3,
            "text": "Lol they think the Ukrainians won't still be contesting the territory 10 days from now. It's gonna get bad but the Urkrainians are badder",
            "title_similarity": "0.62774813",
            "sentiment_compound": -0.09
        },
        {
            "id": "hz3s60o",
            "score": 2,
            "text": "This sounds AWESOME!  Please keep in mind that the truth is the first casualty of war.  This could be disinformation as easily as it could be truth",
            "title_similarity": "0.38988477",
            "sentiment_compound": 0.729
        },
        {
            "id": "hz3s70a",
            "score": 1,
            "text": "It says the source is Facebook, how reputable is the paper?",
            "title_similarity": "0.2979999",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz3s965",
            "score": 2,
            "text": "I wonder if the 15 day time frame is set by how much resources they have and how much money Russia can spend on the invasion? It sounds like each day is costing them millions if not a billion per day just to keep the operation going.",
            "title_similarity": "0.7180399",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hz3s9tw",
            "score": 2,
            "text": "Was?  It's day 6.",
            "title_similarity": "0.23956113",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz3sc1b",
            "score": 1,
            "text": "Heard the Germans just seized Asamov's $800 million yacht",
            "title_similarity": "0.5961382",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz3sck0",
            "score": 1,
            "text": "This whole thread calls to mind that great quote from Mike Tyson \"Everyone has a plan until they get punched in the mouth.\"",
            "title_similarity": "0.479114",
            "sentiment_compound": 0.6249
        },
        {
            "id": "hz3sdzr",
            "score": 1,
            "text": "“Ah I LOVE rumors. Facts can be so misleading but rumors, true or false, are often revealing”",
            "title_similarity": "0.18781741",
            "sentiment_compound": 0.662
        },
        {
            "id": "hz3sez8",
            "score": 1,
            "text": "“Everyone has a plan until they get a punch to the face” \n\nHopefully putin doesn’t do something crazy as he’s getting jabs to the face repeatedly now.",
            "title_similarity": "0.503509",
            "sentiment_compound": 0.0772
        },
        {
            "id": "hz3sgmj",
            "score": 4,
            "text": "if you want to be with the rest of the world start by cleaning you own coruption Russia",
            "title_similarity": "0.5555844",
            "sentiment_compound": 0.0772
        },
        {
            "id": "hz3sie3",
            "score": 4,
            "text": "“Everybody has a plan until the get punched in the mouth” - Mike Tyson",
            "title_similarity": "0.41770124",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz3sj3z",
            "score": 2,
            "text": "This has got to be the sloppiest war effort in living memory. Honestly what is Putin thinking? They probably needed like 5 times are much preparation than they had. Did they really just underestimate the Ukrainians that much?",
            "title_similarity": "0.60698235",
            "sentiment_compound": -0.3046
        },
        {
            "id": "hz3skfo",
            "score": 4,
            "text": "Note that \"Pravda\" is Russian for \"Truth\"\n\nThe Pravda that most people are thinking of is the official propaganda organ of the Communist Party of the Soviet Union, and is now split into the newspaper of the Communist Party of the Russian Federation, and an online privately owned version, which is not connected to the party, but is still Russian.\n\nTHIS Pravda is a Ukrainian online newspaper founded about 22 years ago and is entirely unrelated to the other Pravda.",
            "title_similarity": "0.613734",
            "sentiment_compound": 0.5719
        },
        {
            "id": "hz3snyk",
            "score": 1,
            "text": "Propaganda  that hopes to give  Russians a reason  why their army is not doing well.",
            "title_similarity": "0.54319227",
            "sentiment_compound": -0.0036
        },
        {
            "id": "hz3srno",
            "score": 2,
            "text": "-Putin-: \"Let's go, Xi. In & out. 15 day adventure.\"\n\nSituation was FUBAR on day 2, it's why China took that time not saying anything and when they got SITREP they started sloooooowly backing away from being all buddy buddy with fearless leader.",
            "title_similarity": "0.62049794",
            "sentiment_compound": -0.1111
        },
        {
            "id": "hz3ss6w",
            "score": 1,
            "text": "Two weeks... So they're still ahead of schedule.",
            "title_similarity": "0.13306668",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz3swil",
            "score": 1,
            "text": "late to the party but... are you saying they were carrying war plans and the plans are still paper based?",
            "title_similarity": "0.49880898",
            "sentiment_compound": -0.6705
        },
        {
            "id": "hz3sxeb",
            "score": 2,
            "text": "Vladimir Puto! Fvcked around and found out!",
            "title_similarity": "0.3016864",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz3sxei",
            "score": 8,
            "text": "Had Putin let freedom ring, made sure the average Russian benefitted from the mineral and agricultural resources of Russia, and accept some criticism now and then, he’d get all his wishes of reuniting the Soviet Union’s territories under one banner and probably be more wealthy than he is today.\n\nHe is doing it all backwards.\n\nEdit: not saying it’s easy, but “me win” instead of “we win” tends to make more losers and less win for those who think they win.",
            "title_similarity": "0.5255061",
            "sentiment_compound": 0.8851
        },
        {
            "id": "hz3syhi",
            "score": 1,
            "text": "*in Russian* OOF!!!",
            "title_similarity": "0.40460023",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz3syt1",
            "score": 1,
            "text": "Any experts in the field have an opinion/source on why there was a delay?\n\nAdditionally, what are the options Putin has if the 14 day plan fails? Does he go hell for leather to try and complete within the 14 days? Or is there a ‘plan B’ post-14 day schedule?",
            "title_similarity": "0.71271306",
            "sentiment_compound": -0.8924
        },
        {
            "id": "hz3sz7j",
            "score": 2,
            "text": "How’s that working out?",
            "title_similarity": "-0.00953315",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz3t31r",
            "score": 3,
            "text": "Of course they thought it would be swift. The extent of Putin’s out-of-touch of reality expectations remind me of my senior executives who live in la-la-land. They’re so far away from the ground operations that they can’t fathom all of the realities that need to be addressed",
            "title_similarity": "0.5224011",
            "sentiment_compound": 0.2023
        },
        {
            "id": "hz3t3i6",
            "score": 6,
            "text": "If anyone tries to sell you on a war that’s easy, cheap, and will be over fast, you should be very skeptical.",
            "title_similarity": "0.33896875",
            "sentiment_compound": -0.5563
        },
        {
            "id": "hz3t659",
            "score": 2,
            "text": "Just surprised somebody in the Russian military actually had any plans.\n\nThe rest of them all seem to be making it up as they go.",
            "title_similarity": "0.52761483",
            "sentiment_compound": 0.2263
        },
        {
            "id": "hz3ta1s",
            "score": 2,
            "text": "So is this real or a decoy?",
            "title_similarity": "0.10748505",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz3tbz1",
            "score": 5,
            "text": "ukraine needs to be careful because russia could very well be adding details to make ukraine think what the intel they captured was accurate but then deliberately provide false info in other spots after making people think it was legit from the spot that looked accurate, allies in ww2 placed fake plans on a dead body prior to dday if i remember correct",
            "title_similarity": "0.64321005",
            "sentiment_compound": -0.878
        },
        {
            "id": "hz3tc0m",
            "score": 1,
            "text": "Was the plan take kiev in 15 days, or have the whole new puppet government set up and the old one eliminated in 15 days.",
            "title_similarity": "0.7613543",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz3tcb9",
            "score": 2,
            "text": "Jan 18th 2022 is a date going into infamy",
            "title_similarity": "0.30757013",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz3thhv",
            "score": 3,
            "text": "“When one of the captured Russian soldiers says that they came to participate in drills and got lost, do not believe it! They knew, they carefully planned and prepared.”",
            "title_similarity": "0.5724883",
            "sentiment_compound": -0.2714
        },
        {
            "id": "hz3tsy4",
            "score": 2,
            "text": "“No battle plan survives contact with the enemy” - Helmuth von Moltke.",
            "title_similarity": "0.45801598",
            "sentiment_compound": -0.3818
        },
        {
            "id": "hz3u3cg",
            "score": 3,
            "text": "Is this supposed to be good or bad? 15 days? It's only day 6 - it sounds like they're right on schedule?",
            "title_similarity": "0.46110332",
            "sentiment_compound": 0.3485
        },
        {
            "id": "hz3u75s",
            "score": 1,
            "text": "Any news on how Snowdon is doing?",
            "title_similarity": "0.3844719",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz3u8jn",
            "score": 2,
            "text": "What are the chances of disinformation and misdirection?",
            "title_similarity": "0.19244868",
            "sentiment_compound": 0.2023
        },
        {
            "id": "hz3u8tt",
            "score": 1,
            "text": "We have the Enigma.",
            "title_similarity": "0.08959153",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz3u8yj",
            "score": 2,
            "text": "They made it pretty clear they had plans to do this... I mean, military brass all over the world make contingency plans for nearly any scenario. This isn't really some shocking revelation.",
            "title_similarity": "0.4035819",
            "sentiment_compound": 0.8055
        },
        {
            "id": "hz3u9ft",
            "score": 1,
            "text": "WTF ?",
            "title_similarity": "0.07629133",
            "sentiment_compound": -0.6739
        },
        {
            "id": "hz3uacs",
            "score": 1,
            "text": "Sounds and looks like misinformation",
            "title_similarity": "0.11187035",
            "sentiment_compound": 0.0516
        },
        {
            "id": "hz3uafk",
            "score": 1,
            "text": "Honestly I think some this some might be false 😂. Russia can’t be this inept",
            "title_similarity": "0.36921442",
            "sentiment_compound": 0.7096
        },
        {
            "id": "hz3uaka",
            "score": 1,
            "text": "     This conflict and all of the media surrounding it is a circus of psyops and misinformation designed to confuse the West. Don't believe what you see on the internet. This war isn't going to be short or easy. The Ukrainians are fighting incredibly bravely, but what happens during the first week does not come close to indicating what the future will hold.\n\n      If this lasts until the early summer, Russian armored divisions will  be able to move cross country and avoid obvious choke points like main highways . This will make defense extremely difficult without air superiority and something close to equal armoured capabilities. This is not the same situation as guerrilla warfare in Afghanistan or Iraq, this is conventional warefare on a scale which has not been seen in the west since the Korean War.",
            "title_similarity": "0.64277816",
            "sentiment_compound": -0.9683
        },
        {
            "id": "hz3ub8e",
            "score": 1,
            "text": "These plans could also be fake and allowed to fall into Ukrainian hands. It’s happened before.",
            "title_similarity": "0.4537116",
            "sentiment_compound": -0.4767
        },
        {
            "id": "hz3ug6v",
            "score": 1,
            "text": "The Soviet Union also had a plan to take on NATO during the cold war, that war was also to last 14 days. Russia is not very good at planning out wars, they seem to mistakenly think they'll just steamroll everyone.",
            "title_similarity": "0.7325293",
            "sentiment_compound": -0.9453
        },
        {
            "id": "hz3uh1h",
            "score": 1,
            "text": "Meinertzhagen's haversack?",
            "title_similarity": "0.26275524",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz3uh1w",
            "score": 2,
            "text": "Do not underestimate stupidity of people who never get NO for an answer and are thinking that being Putins bitch is a honor.",
            "title_similarity": "0.29064742",
            "sentiment_compound": 0.6279
        },
        {
            "id": "hz3uhgd",
            "score": 1,
            "text": "You don't know what you don't know",
            "title_similarity": "0.0029183524",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz3ukdu",
            "score": 2,
            "text": "Man, everyone knows you under-promise and over-deliver, not the other way around!",
            "title_similarity": "0.1870892",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz3ulhd",
            "score": 2,
            "text": "This season of television just got a whole lot juicier",
            "title_similarity": "0.28273737",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz3uls9",
            "score": 1,
            "text": "They always say it will be over quick, no doubt because telling the truth (This could take 18 months) doesn't do anything for your military career or cabinet post...",
            "title_similarity": "0.49272537",
            "sentiment_compound": 0.5283
        },
        {
            "id": "hz3uml5",
            "score": 1,
            "text": "There are speculations based on effectiveness of Russian forces in South and East, and complete failure in North near Kiev, that Kiev was added as a target last minute by Putin and his army was completely unprepared and it actually detracted from attacks from South and East. There is huge contrast in how those campaigns are conducted and level of preparedness. This also explains last minute Belarus involvement. \n\nThe invasion from Crimea has been the most successful of all fronts (probably years of preparation) conducted by the more experienced military units, and Kharkiv would’ve been already taken if Kiev forces were also committed there instead. \n\nAlso notice how far away Putin sits from his generals during his cabinet meetings. These generals were not on board with the entire plan, and there is fear of treason within Russian camp. There is fear that Putin may end up like Beria in 1953.",
            "title_similarity": "0.696299",
            "sentiment_compound": -0.6712
        },
        {
            "id": "hz3unjo",
            "score": 1,
            "text": "It is a good time table, obviously not a realistic one, but if they couldn't keep it the invasion would be much harder.",
            "title_similarity": "0.2594974",
            "sentiment_compound": 0.2382
        },
        {
            "id": "hz3up57",
            "score": 1,
            "text": "Woo-pie!",
            "title_similarity": "0.038795084",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz3upon",
            "score": 1,
            "text": "Code name : operation speedy resolution 2\n\nOperation speed resolution 1 having already been taken by the hundred years war",
            "title_similarity": "0.49673027",
            "sentiment_compound": -0.5994
        },
        {
            "id": "hz3ur79",
            "score": 2,
            "text": "Never realized Curly from the 3 Stooges became a Russian dictator after his film career. Actually, the resemblance is uncanny",
            "title_similarity": "0.616765",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz3utl4",
            "score": 2,
            "text": "I wonder if the talking heads on the American right will stop blaming Biden/Dems for causing the war now.",
            "title_similarity": "0.52091455",
            "sentiment_compound": -0.8519
        },
        {
            "id": "hz3uu7h",
            "score": 18,
            "text": "The BBC has launched a new shortwave radio service in Ukraine to ensure the resilience of its news operations in Ukraine and Russia, the corporation has announced.\n\nThe new broadcasts will make four hours of World Service English news available every day and will reach audiences in Ukraine and parts of Russia.\n\nListeners in the area will be able to tune into the broadcasts at 15735 kHz from 16:00-18:00 GMT and 5875 kHz from 22:00-00:00 GMT",
            "title_similarity": "0.6859663",
            "sentiment_compound": 0.4939
        },
        {
            "id": "hz3uufs",
            "score": 1,
            "text": "So they thought they could redo the Crimea play and nobody would notice!",
            "title_similarity": "0.51857585",
            "sentiment_compound": 0.4003
        },
        {
            "id": "hz3uziq",
            "score": 1,
            "text": "I don't know...\n\nThis seems a little too weird to be broadcasting to the world. Wouldn't you want to keep secret documents secret to use against the enemy so they don't change their plans?",
            "title_similarity": "0.3531474",
            "sentiment_compound": -0.6302
        },
        {
            "id": "hz3v0rd",
            "score": 1,
            "text": "Should anyone outside of Ukraine’s military even know about this?",
            "title_similarity": "0.46615404",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz3v3w5",
            "score": 3,
            "text": "This reeks of propaganda.",
            "title_similarity": "0.1644018",
            "sentiment_compound": -0.25
        },
        {
            "id": "hz3v7o3",
            "score": 1,
            "text": "Doesn’t necessarily mean that was actually the Russian government’s actual plans, they could just as likely have told that to their troops as a lie to boost morale or deter internal resistance to the initial deployment.",
            "title_similarity": "0.50433016",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hz3v8n9",
            "score": 2,
            "text": "Everybody is against Putin rn even his own comrades.",
            "title_similarity": "0.45425582",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz3v8nx",
            "score": 1,
            "text": "Well assuming this is not another Operation Mincemeat, then this is a huge advantage.",
            "title_similarity": "0.15196791",
            "sentiment_compound": 0.6597
        },
        {
            "id": "hz3v9t9",
            "score": 3,
            "text": "Pravda is state propaganda. Everyone knows this. They are owned by the Communist Party of the Russian Federation. Smh",
            "title_similarity": "0.5868784",
            "sentiment_compound": -0.1531
        },
        {
            "id": "hz3vf9u",
            "score": 5,
            "text": "I'm sorry, I thought this was a training mission /peace keeping mission",
            "title_similarity": "0.1131028",
            "sentiment_compound": 0.4939
        },
        {
            "id": "hz3vo0p",
            "score": 2,
            "text": "> According to this information, the plans for the war with Ukraine were approved on 18 January 2022. The plans anticipated that the capture of Ukraine must be executed within 15 days, from 20 February to 6 March\n\nSo US intelligence was right all [along](https://www.google.ca/amp/s/www.aljazeera.com/amp/news/2022/2/18/biden-says-us-believes-putin-has-decided-to-invade-ukraine)",
            "title_similarity": "0.81221354",
            "sentiment_compound": 0.3134
        },
        {
            "id": "hz3vszq",
            "score": 1,
            "text": "They honestly believed they would be greeted as liberators. They believed their own propaganda. Little self delusion goes a long way.",
            "title_similarity": "0.19192384",
            "sentiment_compound": 0.4767
        },
        {
            "id": "hz3vtqk",
            "score": 1,
            "text": "Russia has been exposed as a complete top to bottom disaster. This “military operation” looks like it was put together by an overzealous 11 year old boy with a grudge. What a joke.",
            "title_similarity": "0.5985782",
            "sentiment_compound": 0.0258
        },
        {
            "id": "hz3vvko",
            "score": 5,
            "text": "Once that frozen dirt turns fully to mud those Russians forces aren’t moving.  The olympics may have indirectly helped save Ukraine",
            "title_similarity": "0.60342413",
            "sentiment_compound": 0.2023
        },
        {
            "id": "hz3vwti",
            "score": 2,
            "text": "Found this surprising:\n\n“The Joint Forces Operational Command also said: \"When one of the captured Russian soldiers says that they came to participate in drills and got lost, do not believe it! They knew, they carefully planned and prepared.”",
            "title_similarity": "0.6090842",
            "sentiment_compound": 0.1511
        },
        {
            "id": "hz3vy5w",
            "score": 1,
            "text": "Хто думає що Путін Хуйло✊",
            "title_similarity": "0.229716",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz3w1cd",
            "score": 1,
            "text": "If this is actually true, I'm starting to think Russia doesn't really know how to fight a war due to the sole reliance on human waves tactics, reputations for being vodka-fueled assholes, empty threats, and nukes...\n\nSo it has to be false, right? An army like the bloody Russian army has to understand more than just human waves tactics, reputations for being vodka-fueled assholes, empty threats, and nukes...\n\nOh no.",
            "title_similarity": "0.5636414",
            "sentiment_compound": -0.9633
        },
        {
            "id": "hz3w31o",
            "score": 4,
            "text": "Always have to keep in mind these things can be misinformation",
            "title_similarity": "0.18386534",
            "sentiment_compound": -0.3182
        },
        {
            "id": "hz3w4ru",
            "score": 2,
            "text": "How do we know we weren’t meant to find this document?",
            "title_similarity": "0.23348661",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz3w5g0",
            "score": 1,
            "text": "Were they seized or did Lukashenko send an email and accidentally cc earth?",
            "title_similarity": "0.44328403",
            "sentiment_compound": -0.34
        },
        {
            "id": "hz3w6k6",
            "score": 1,
            "text": "Pravda credibility?",
            "title_similarity": "0.06932141",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz3w819",
            "score": 1,
            "text": "Was this a plan to take \"All\" of Ukraine in 2 weeks? I mean, taking Kyiv is one thing, but you will still face strong resistance further west. Feels like they severely miscalculated.",
            "title_similarity": "0.6758193",
            "sentiment_compound": 0.5719
        },
        {
            "id": "hz3w8vn",
            "score": 2,
            "text": "I don’t necessarily trust this. There are so many smart ways to release fake plans in wars, for example, operation mince meat. The Brit’s dropped a dead body with fake secret plans near Spain and the nazis fell for it (SUPER BRIEF over generalization of it, go watch thoughty 2s video on it)",
            "title_similarity": "0.5275341",
            "sentiment_compound": -0.492
        },
        {
            "id": "hz3wgoe",
            "score": 1,
            "text": "big if true",
            "title_similarity": "0.015570455",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hz3wh9p",
            "score": 1,
            "text": "Is this propaganda? Possibly.",
            "title_similarity": "0.06837277",
            "sentiment_compound": -0.25
        },
        {
            "id": "hz3wibv",
            "score": 1,
            "text": "Well the way it's going Russia is gonna have to surrender in that time",
            "title_similarity": "0.5777105",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hz3wie6",
            "score": 1,
            "text": "Today, March 2 is only Day 7.  They are still on schedule, aren't they?",
            "title_similarity": "0.26319954",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz3wjfx",
            "score": 1,
            "text": "15 days?! Their soldiers are already starving.",
            "title_similarity": "0.5644014",
            "sentiment_compound": -0.4753
        },
        {
            "id": "hz3wjlc",
            "score": 1,
            "text": "Is Russia trying to lose? What the fuck is going on. The ineptitude of their military leaders is mind boggling",
            "title_similarity": "0.54593694",
            "sentiment_compound": -0.7351
        },
        {
            "id": "hz3wmhl",
            "score": 3,
            "text": "Man, the Russian armed forces are really coming off as trash tier.",
            "title_similarity": "0.54268193",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz3wrd3",
            "score": 2,
            "text": "Seized or planted? So many WW2 documents were purposely placed to be captured and send false information.",
            "title_similarity": "0.4194236",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz3wrlc",
            "score": 1,
            "text": "A feel like someone or a group of someones at the top of Russian military command is in store for a very bad time pretty soon.",
            "title_similarity": "0.6419608",
            "sentiment_compound": 0.4535
        },
        {
            "id": "hz3wuei",
            "score": 1,
            "text": "From the masters of espionage and disinformation. I would not place much reliability on these documents.",
            "title_similarity": "0.2811377",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz3wyou",
            "score": 1,
            "text": "America lost 2,000 soldiers in 20 years in Afghanistan.  Russia lost 2,000 soldiers in under a week in Ukraine.  And all Russian citizens lost access to their money.  This can't be the plan.",
            "title_similarity": "0.6328021",
            "sentiment_compound": -0.7096
        },
        {
            "id": "hz3x00w",
            "score": 4,
            "text": "Everyone has a plan until they get punched in the face",
            "title_similarity": "0.39178258",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz3x2kn",
            "score": 1,
            "text": "Learning from the best I see.\n\n\"Five days or five weeks or five months, but it certainly isn't going to last any longer than that,\" Rumsfeld said.",
            "title_similarity": "0.42482919",
            "sentiment_compound": 0.6908
        },
        {
            "id": "hz3x3yp",
            "score": 1,
            "text": "sussy amogus",
            "title_similarity": "0.050499164",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz3x3zp",
            "score": 1,
            "text": "If they only planned fuel and supplies for 15 days then they are seriously screwed",
            "title_similarity": "0.619415",
            "sentiment_compound": -0.5994
        },
        {
            "id": "hz3x4o7",
            "score": 1,
            "text": "About as real as snake island",
            "title_similarity": "0.1260252",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz3x5m0",
            "score": 1,
            "text": "And why would they come out and say this?",
            "title_similarity": "0.12376793",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz3x5wp",
            "score": 1,
            "text": "I wish I could read and speak Ukrainian and Russian.",
            "title_similarity": "0.53478146",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hz3x6q1",
            "score": 2,
            "text": "Just saying, wouldn't it be better strategically if you don't reveal to the enemy that you discovered their plans? Flaunting your intentions to provide evidence to the Hague before you repel the invaders is putting the cart before the horse, no?",
            "title_similarity": "0.46740264",
            "sentiment_compound": -0.7404
        },
        {
            "id": "hz3x7bb",
            "score": 1,
            "text": "Is this a movie or what?",
            "title_similarity": "0.15783474",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz3x91w",
            "score": 3,
            "text": "I don’t know who needs to hear this, but fuck putin.",
            "title_similarity": "0.39354736",
            "sentiment_compound": -0.6956
        },
        {
            "id": "hz3xcqg",
            "score": 1,
            "text": "*\"When one of the captured Russian soldiers says that they came to participate in drills and got lost, do not believe it! They knew, they carefully planned and prepared.*\n\n*And we will say one thing to the Russian invaders: Leave your equipment and secret documents behind, we will need them for our defenders. And we will need them for the Hague.\"*",
            "title_similarity": "0.62328184",
            "sentiment_compound": 0.126
        },
        {
            "id": "hz3xejr",
            "score": 2,
            "text": "holy shit the state worshipping in these comments is so cringe",
            "title_similarity": "0.27313855",
            "sentiment_compound": -0.25
        },
        {
            "id": "hz3xfla",
            "score": 1,
            "text": "the world watching so Russia is taking it easy on them",
            "title_similarity": "0.30690867",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hz3xmq6",
            "score": 1,
            "text": "Wow such a reliable source for news, document that was posted by a Facebook page, because these things cannot be produced otherwise; it must be legal.",
            "title_similarity": "0.3022881",
            "sentiment_compound": 0.6486
        },
        {
            "id": "hz3xnp8",
            "score": 2,
            "text": "So why only 15 days?",
            "title_similarity": "0.38422617",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz3xsj0",
            "score": 1,
            "text": "Do people in here really believe that a country as big as Russia doesn’t know how to plan out a military strategy?",
            "title_similarity": "0.57180583",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz3xsqp",
            "score": 1,
            "text": "Sadly, they are still on schedule.",
            "title_similarity": "0.01534073",
            "sentiment_compound": -0.4215
        },
        {
            "id": "hz3xwm5",
            "score": 1,
            "text": "I mean hope they don’t think that was not on purpose \nCmon",
            "title_similarity": "0.08289997",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hz3xyyi",
            "score": 1,
            "text": "Reddit being Reddit it jumped me when going to reply to a comment and now I cannot find the comment to reply to.\n\nWas a Canadian I belive talking about how Lithuania, Poland and Latvia don’t have any pro Russian so Russia wouldn’t be interested.\n\nI would like to point out to you that while in Latvia they are pushing the Latvian language and culture and trying to remove Russian influence it has hardened the Russian speaking Latvians resolve. They are not all pro putin but in 2018 they returned the largest party after elections. If Putin wanted to invade by doing a Donbas style approach it could very well work in Latvia.",
            "title_similarity": "0.6192808",
            "sentiment_compound": 0.8761
        },
        {
            "id": "hz3xzmn",
            "score": 1,
            "text": "What's the fastest a nation has been invaded and taken over before?",
            "title_similarity": "0.40847707",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz3xzpz",
            "score": 1,
            "text": "how many faux documents will be planted?",
            "title_similarity": "0.37116092",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz3xzzv",
            "score": 1,
            "text": "cant make this stuff up",
            "title_similarity": "0.08331488",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz3y0no",
            "score": 1,
            "text": "[deleted]",
            "title_similarity": "0.09003144"
        },
        {
            "id": "hz3y0ta",
            "score": 1,
            "text": "They have 7 days to win.",
            "title_similarity": "0.34006524",
            "sentiment_compound": 0.5859
        },
        {
            "id": "hz3y132",
            "score": 2,
            "text": "I thought Russian soldiers were told they would be welcomed, with smiles and flowers.",
            "title_similarity": "0.28124565",
            "sentiment_compound": 0.6705
        },
        {
            "id": "hz3y3z7",
            "score": 1,
            "text": "May be Russian planting instead of Ukraine seizing. Could be fake",
            "title_similarity": "0.46765435",
            "sentiment_compound": -0.4767
        },
        {
            "id": "hz3y5mn",
            "score": 1,
            "text": "Russian history books will say it was done in a week.",
            "title_similarity": "0.6270888",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz3y6c9",
            "score": 1,
            "text": "Sufferin succotash! If this isn’t bait planted by the Russians I’m going  😂 myself to death.",
            "title_similarity": "0.5678716",
            "sentiment_compound": -0.3164
        },
        {
            "id": "hz3yd2l",
            "score": 2,
            "text": "Cold war is back, everyone take news right now with a giant grain of salt.",
            "title_similarity": "0.5160911",
            "sentiment_compound": -0.5994
        },
        {
            "id": "hz3ydee",
            "score": 2,
            "text": "Putin is still, technically, not off pace for a 15 day campaign and that’s what worries me.",
            "title_similarity": "0.5729382",
            "sentiment_compound": -0.4215
        },
        {
            "id": "hz3yhm4",
            "score": 2,
            "text": "so like 8 days to go then",
            "title_similarity": "0.29275978",
            "sentiment_compound": 0.4201
        },
        {
            "id": "hz3ykql",
            "score": 2,
            "text": "Oops",
            "title_similarity": "-0.073297836",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz3yphl",
            "score": 1,
            "text": "If this proceed. I’m a man of my word, I’ll take down the aggressors for Europa. Brethren, in battle we rejoice, we are family, and we must uphold the things we trust. Stand steady and ready, embrace death.\n\n— Sweden",
            "title_similarity": "0.47260988",
            "sentiment_compound": 0.3818
        },
        {
            "id": "hz3yr51",
            "score": 1,
            "text": "Cool so it’s about 1/2 over and Ukraine can return to freedom and peace and Russia will have a new regime next week.",
            "title_similarity": "0.56886876",
            "sentiment_compound": 0.875
        },
        {
            "id": "hz3yt1v",
            "score": 1,
            "text": "\"What are you gonna announce? Did someone lose their super secret shit? I don't think so\". \n\nThis is like some Coen brothers-type comedy.",
            "title_similarity": "0.3674342",
            "sentiment_compound": 0.4515
        },
        {
            "id": "hz3yt62",
            "score": 1,
            "text": "Honestly with how much propaganda both sides are (understandably) producing, I'm not sure what to officially trust. But big if true!",
            "title_similarity": "0.2982306",
            "sentiment_compound": 0.732
        },
        {
            "id": "hz3ytyq",
            "score": 1,
            "text": "From a militaristic viewpoint Russia is getting the literal People's Elbow.",
            "title_similarity": "0.60101247",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz3yvu7",
            "score": 2,
            "text": "NATO should just invade Belarus and give the exact same reasons Putin is giving in Ukraine and put a no fly zone in affect over it. Then wait for crappy Russian planes to cross and shoot those raggedy junkets out the sky",
            "title_similarity": "0.6804678",
            "sentiment_compound": -0.7003
        },
        {
            "id": "hz3yyb2",
            "score": 2,
            "text": "Ukraine should have kept this quiet to use to their advantage. Why advertise that u know what you’re not supposed to?",
            "title_similarity": "0.4130029",
            "sentiment_compound": 0.25
        },
        {
            "id": "hz3z0ci",
            "score": 1,
            "text": "I still can’t believe this is the same Russian army that we feared for 75 years. Everything just comes across as amateur. Lucky for us, I guess.",
            "title_similarity": "0.5529545",
            "sentiment_compound": -0.1027
        },
        {
            "id": "hz3z1nk",
            "score": 1,
            "text": "omg is the first time I see double digits number of k upvotes",
            "title_similarity": "0.2971758",
            "sentiment_compound": 0.0772
        },
        {
            "id": "hz3z4ec",
            "score": 3,
            "text": "Why is this phrased as if 15 days have already passed...?",
            "title_similarity": "0.48852828",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz3z72u",
            "score": 1,
            "text": "Taking bets the Russian Diplomat at UNSC says these are Ukraine's plans to invade... themselves?",
            "title_similarity": "0.73249435",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz3z97g",
            "score": 2,
            "text": "Its just pure speculation on my part, but it's possible that these documents could have been designed to be \"found\" and are a means of misdirecting Ukraine and the West. There are examples of this occuring in WW2, where detailed battleplans were used to misdirect the enemy. Just something to consider.",
            "title_similarity": "0.5860965",
            "sentiment_compound": -0.6956
        },
        {
            "id": "hz3zfab",
            "score": 1,
            "text": "I watch a lot of movies. Outnumbered force recovers plans of invaders. Sus? Fake plans?",
            "title_similarity": "0.4049102",
            "sentiment_compound": -0.5362
        },
        {
            "id": "hz3zhal",
            "score": 1,
            "text": "hold up, why would the Ukranians leak that they found this? Rather than use it to their advantage and mount a counter defense?",
            "title_similarity": "0.3469678",
            "sentiment_compound": 0.1179
        },
        {
            "id": "hz3zhm0",
            "score": 2,
            "text": "Please, let's negotiate to restore world peace.",
            "title_similarity": "0.14804524",
            "sentiment_compound": 0.7906
        },
        {
            "id": "hz3zi6e",
            "score": 1,
            "text": "Wow. Someone's one-on-one meeting with their boss is gonna have HR hop on.",
            "title_similarity": "0.44641763",
            "sentiment_compound": 0.5859
        },
        {
            "id": "hz3ziou",
            "score": 2,
            "text": "In all honesty do they really need to control the whole country, or just the parts that they really wanted to begin with?",
            "title_similarity": "0.40570685",
            "sentiment_compound": 0.4939
        },
        {
            "id": "hz3zjtr",
            "score": 2,
            "text": "so 4 more days left in this insane attack plan?",
            "title_similarity": "0.54018605",
            "sentiment_compound": -0.7371
        },
        {
            "id": "hz3zk0a",
            "score": 1,
            "text": "lol get fucked.",
            "title_similarity": "0.14183024",
            "sentiment_compound": -0.3818
        },
        {
            "id": "hz3zsfi",
            "score": 2,
            "text": "Maybe Ukraine is just a distraction for something bigger",
            "title_similarity": "0.38383916",
            "sentiment_compound": -0.3818
        },
        {
            "id": "hz3zudk",
            "score": 3,
            "text": "Just leaving this part here. I wonder why they’re all saying the same thing. Some sort of tactic or just the easiest way to go AWOL without the locals murdering them?\n\n>The Joint Forces Operational Command also said: \"When one of the captured Russian soldiers says that they came to participate in drills and got lost, do not believe it! They knew, they carefully planned and prepared.",
            "title_similarity": "0.59311485",
            "sentiment_compound": 0.5575
        },
        {
            "id": "hz3zyfa",
            "score": 2,
            "text": "\"We will be greeted as liberators.\"",
            "title_similarity": "0.16264321",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hz4009x",
            "score": 1,
            "text": "Whoops!",
            "title_similarity": "-0.04246716",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz401qr",
            "score": 1,
            "text": "Когда же эта ёбань вся с путлером сдохнет...",
            "title_similarity": "0.30507702",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz409o0",
            "score": 1,
            "text": "I'd be surprised if this wasn't a plant 😴",
            "title_similarity": "0.08431949",
            "sentiment_compound": 0.2263
        },
        {
            "id": "hz40b61",
            "score": 3,
            "text": "Everyone is clowning on Putin (allegedly) thinking this war would only last 15 days while also calling it a Ukrainian victory not even a week into it. \n\nGet some perspective, please. I know the internet has fried your attention but Russia has literally just taken Kherson, a regional capital, and has bombarded and surrounded several other cities. Several pockets are forming throughout Eastern Ukraine as well, which seems to be the overall strategy for seizing control. \n\nIt's possible for the Russians to have met more resistance than anticipated while also keeping the upper hand in this conflict. Russia is fudging their numbers no doubt, but you can't go blindly accepting everything that Ukraine or the US puts out. They've all got skin in this game.\n\nWe probably won't get anything close to the truth until this conflict is over and even then I'd doubt the numbers.",
            "title_similarity": "0.7872752",
            "sentiment_compound": -0.1339
        },
        {
            "id": "hz40brz",
            "score": 1,
            "text": "The part where the troops were ordered to say \"they did not know\" if captured is wild.",
            "title_similarity": "0.3579871",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz40cus",
            "score": 1,
            "text": "Questions are, what are the contingency plans? How does this find and actual war events change the outcome of the conflict? How can you trust the Russians anyway?",
            "title_similarity": "0.6537806",
            "sentiment_compound": -0.533
        },
        {
            "id": "hz40geh",
            "score": 3,
            "text": "That’s what they all think.",
            "title_similarity": "-0.019778695",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz40jtz",
            "score": 2,
            "text": "Looks like their plans have been foiled. Putin should call it quits now.",
            "title_similarity": "0.44772238",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hz40jyb",
            "score": 1,
            "text": "Holy",
            "title_similarity": "0.002492249",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz40kdt",
            "score": 4,
            "text": "2022 and one of the (apparently) biggest armed forces in the world is hand drawing invasion maps?   😬",
            "title_similarity": "0.5468139",
            "sentiment_compound": 0.2023
        },
        {
            "id": "hz40nhf",
            "score": 1,
            "text": "Russia military is probably just giving it to them.",
            "title_similarity": "0.541283",
            "sentiment_compound": 0.34
        },
        {
            "id": "hz40reg",
            "score": 2,
            "text": "Turds need flushed",
            "title_similarity": "0.14223611",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz40s38",
            "score": 3,
            "text": "“A three hour tour, a three hour tour”\n\nFuck em",
            "title_similarity": "0.3921886",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hz40w8m",
            "score": 1,
            "text": "So if they really know Russia's battle plan wouldn't be revealing that information an awful thing to do?\n\nPutin wouldn't just say \"oh they know my plan? Guess I'll stick to the orginal strategy\".\n\nMakes no sense to reveal the counter intelligence you have on your enemy.",
            "title_similarity": "0.5672252",
            "sentiment_compound": -0.8327
        },
        {
            "id": "hz40we4",
            "score": 2,
            "text": "Misdirection..",
            "title_similarity": "0.1040488",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz410pa",
            "score": 1,
            "text": "What day are we at?",
            "title_similarity": "0.14542222",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz411lj",
            "score": 2,
            "text": "Is this confirmed? You have got to be shitting me. Did they also print out the Mapquest directions s to Kyiv?",
            "title_similarity": "0.5084572",
            "sentiment_compound": -0.4871
        },
        {
            "id": "hz414no",
            "score": 3,
            "text": "Judging by the fact that the soldiers have already been mislead multiple times about this war, I have a feeling the plan in these documents isn't very concrete",
            "title_similarity": "0.4805512",
            "sentiment_compound": -0.628
        },
        {
            "id": "hz419m4",
            "score": 1,
            "text": "Lol",
            "title_similarity": "-0.109153256",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hz41a3s",
            "score": 3,
            "text": "Why would Ukraine make it known they have these plans? If real wouldn't you keep it a secret advantage? I don't believe any of this.",
            "title_similarity": "0.44051337",
            "sentiment_compound": 0.3313
        },
        {
            "id": "hz41b7e",
            "score": 3,
            "text": "How do we 100% know Russia didn’t set this up on purpose to have a fake set of documents leak?",
            "title_similarity": "0.5372092",
            "sentiment_compound": -0.6705
        },
        {
            "id": "hz41bk6",
            "score": 3,
            "text": "All this situation is so odd, the time, the incompetence of the invasion, seems like Putin just woke up one day and said, \"today's a good day to invade\"",
            "title_similarity": "0.6014299",
            "sentiment_compound": -0.2243
        },
        {
            "id": "hz41bt7",
            "score": 3,
            "text": "Classic blunders:\n1. Never get involved in a land war in Asia.\n\n2. Never go in against a Sicilian when death is on the line.\n\n3. Don't half ass an invasion of Ukraine and leave your war plans lying around. Especially after 10 years of being all like, \"I hate not being President of the USSR, I'm going to burn this mother down,\" and almost every developed nation being all like, \"you better not, you better not.\"",
            "title_similarity": "0.57432497",
            "sentiment_compound": -0.9128
        },
        {
            "id": "hz41eql",
            "score": 1,
            "text": "Yikes, what a strategic blunder",
            "title_similarity": "0.12235159",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz41fk8",
            "score": 1,
            "text": "If anyone wants to learn things and share things they’ve learned they should join my group nd lmk what u specialize in",
            "title_similarity": "0.2737195",
            "sentiment_compound": 0.5267
        },
        {
            "id": "hz41lhu",
            "score": 2,
            "text": "Maybe this is the timeline where Putin tries to gain Ukraine, and ends up losing Crimea back to Ukraine",
            "title_similarity": "0.670001",
            "sentiment_compound": 0.2023
        },
        {
            "id": "hz41pj0",
            "score": 6,
            "text": "I hate everything about this conflict right now. My sister-in-law and her family are in Ukraine right now, living in some makeshift bunker because of what Russias doing right now. Flinching and scared to death everytime they hear a raid siren going off. Fuck Russia, seriously",
            "title_similarity": "0.61513114",
            "sentiment_compound": -0.954
        },
        {
            "id": "hz41pob",
            "score": 2,
            "text": "It just goes to show that if you have 5k+ nuclear weapons, it doesn't matter how good your army is.",
            "title_similarity": "0.42617804",
            "sentiment_compound": -0.6575
        },
        {
            "id": "hz41sxu",
            "score": 1,
            "text": "Shock and Flaw",
            "title_similarity": "0.10175474",
            "sentiment_compound": -0.3818
        },
        {
            "id": "hz422tc",
            "score": 2,
            "text": "Seems like the sent in the cannon fodder, a lot of Ukrainian civilians and Russian separatists all from the Donbas region, to clear the way to the airport around Kyiv. They were all expendable, in order to capture the airport to send in the actual Russian Federation's trained soldiers with no losses (maybe. Or maybe they really are this weak and stupid). They really thought 200,000 untrained sacrifices were strong enough to defeat 200,000 trained military personnel (plus 900,000 in reserve). They also didnt expect the entire population of Ukraine to fight back. Russia fucked up. They look more weak now than in all of history. Ukraine is fucking them up AND showing them compassion. Amazing people.",
            "title_similarity": "0.65424716",
            "sentiment_compound": -0.5913
        },
        {
            "id": "hz42a3m",
            "score": 1,
            "text": "Well, Putin did [say back in 2014](https://time.com/3259699/putin-boast-kiev-2-weeks/) he could take Kyiv in two weeks, at least his plans are consistent.",
            "title_similarity": "0.6428952",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hz42f3g",
            "score": 1,
            "text": "Seems like info you’d want to not let anyone know if you had and let everyone know that you did if you didn’t.",
            "title_similarity": "0.26659653",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hz42ocg",
            "score": 1,
            "text": "I don’t believe any of this",
            "title_similarity": "0.032343168",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz42pu0",
            "score": 1,
            "text": "They may be leaving those behind on purpose. Can’t trust anything.",
            "title_similarity": "0.17729951",
            "sentiment_compound": 0.5106
        },
        {
            "id": "hz42ska",
            "score": 3,
            "text": "No plan survives contact with the enemy.",
            "title_similarity": "0.38467366",
            "sentiment_compound": -0.6908
        },
        {
            "id": "hz42t81",
            "score": 2,
            "text": "I was expecting one of those KFC generals to yeet it out of the door yelling ...\n\n\"LeeRoy Jenkins!!!\"",
            "title_similarity": "0.4605024",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz42vwm",
            "score": 4,
            "text": "There's so much disinformation and propaganda being floated around. I wont really believe anything until it's all over",
            "title_similarity": "0.35793662",
            "sentiment_compound": -0.25
        },
        {
            "id": "hz42wd9",
            "score": 1,
            "text": "Taiwan eyes are  watching you.",
            "title_similarity": "0.047336966",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz430u7",
            "score": 2,
            "text": "I hope for Ukraine’s sake it’s not a false flag",
            "title_similarity": "0.28050488",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hz4327x",
            "score": 1,
            "text": "Is this real?",
            "title_similarity": "-0.051645454",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz4384z",
            "score": 1,
            "text": "واو",
            "title_similarity": "-0.06677674",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz43brh",
            "score": 1,
            "text": "I’m sure if this info had any relevance it wouldn’t have been shared.",
            "title_similarity": "0.18404469",
            "sentiment_compound": 0.5719
        },
        {
            "id": "hz43bun",
            "score": 1,
            "text": "First, it was 10 days and they are losing 20 billion a day.",
            "title_similarity": "0.43488485",
            "sentiment_compound": -0.3818
        },
        {
            "id": "hz43jk0",
            "score": 2,
            "text": "Russia isn’t as big and scary as it was in WW2 and Cold War. They seem… kinda stupid and pathetic now. It seems like Ukrainians are waking up in the morning and throwing a Molotov cocktail as they have their morning coffee and take out some Russians.",
            "title_similarity": "0.5607945",
            "sentiment_compound": -0.9031
        },
        {
            "id": "hz43jp1",
            "score": 1,
            "text": "In and out 15 day adventure",
            "title_similarity": "0.45833087",
            "sentiment_compound": 0.3182
        },
        {
            "id": "hz43m6l",
            "score": 1,
            "text": "Is this 1962? PAPER documents? Immutable evidence????\n\nPutin are you this f\\*\\*king outdated? You deserve to lose for being this incompetent.",
            "title_similarity": "0.39986128",
            "sentiment_compound": -0.8066
        },
        {
            "id": "hz43mks",
            "score": 1,
            "text": "Russia just having big fucking oof's after big fucking oof's.",
            "title_similarity": "0.5667708",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz43q8b",
            "score": 1,
            "text": "Putin has made such an arse of it",
            "title_similarity": "0.3803008",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz43r95",
            "score": 2,
            "text": "Occam's razor",
            "title_similarity": "0.17733651",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz43un2",
            "score": 2,
            "text": "China not only knew, they coordinated to avoid Olympic interference.\n\nIt’s very hard, but to the extent you can avoid China products, boycott them.",
            "title_similarity": "0.43278468",
            "sentiment_compound": -0.7715
        },
        {
            "id": "hz43z5v",
            "score": 1,
            "text": "You know it’s bad when the FSB is handing intelligence to the defending country.",
            "title_similarity": "0.42575005",
            "sentiment_compound": -0.1027
        },
        {
            "id": "hz4426k",
            "score": 2,
            "text": "So... Are these just released intentionally to sow confusion and get preparations to be made in the wrong locations/under incorrect assumptions? Or are these like legit-legit.",
            "title_similarity": "0.24480292",
            "sentiment_compound": -0.4215
        },
        {
            "id": "hz444n4",
            "score": 5,
            "text": "What if it’s deliberate misinformation? This is a very common tactic used in counterintelligence fields.",
            "title_similarity": "0.3311594",
            "sentiment_compound": -0.3182
        },
        {
            "id": "hz4499n",
            "score": 2,
            "text": "> The plans anticipated that the capture of Ukraine must be executed within 15 days, from 20 February to 6 March.\n\nTick tock, motherfuckers.",
            "title_similarity": "0.82147497",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz44ag8",
            "score": 2,
            "text": "were they just carrying the war plans around in their back pocket?",
            "title_similarity": "0.38115966",
            "sentiment_compound": -0.5994
        },
        {
            "id": "hz44fo6",
            "score": 1,
            "text": "Why do people insist on making intelligence public like they have any military involvement in this? Doesn't this seriously jeopardize people's positions?",
            "title_similarity": "0.36344922",
            "sentiment_compound": 0.7655
        },
        {
            "id": "hz44hsr",
            "score": 2,
            "text": "It still could last 15 days... It's like people have forgotten it's only been 6 days so far....",
            "title_similarity": "0.4243729",
            "sentiment_compound": 0.1531
        },
        {
            "id": "hz44j8m",
            "score": 2,
            "text": "Trying to be like the US and get into a two week war that drags out 20 years.",
            "title_similarity": "0.68554807",
            "sentiment_compound": -0.4767
        },
        {
            "id": "hz44k7u",
            "score": 2,
            "text": "I encourage everyone to look at everything coming out of Ukraine and Russia through a certain lens. We are seeing and are going to see communist/socialist/Soviet/war time propaganda like we’ve never seen before. I expect both sides to use propaganda, it’s the nature of the beast. I love the narrative that’s taking light, Ukraine = strong willed, Russia = incompetent. But don’t be upset if some of these stories or images are falsehoods. Be aware.",
            "title_similarity": "0.54845273",
            "sentiment_compound": 0.1901
        },
        {
            "id": "hz44kvw",
            "score": 1,
            "text": "Assuming this is legit intel and not something the Russians wanted \"captured\", why would the Ukrainian media publicise it? Not prudent at all.",
            "title_similarity": "0.41407448",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz44m5v",
            "score": 2,
            "text": "Yeah. Seems like the worst thing that can happen to Putin and his merry band, is to be \"pathetic.\"  And they are pathetic.",
            "title_similarity": "0.35743392",
            "sentiment_compound": -0.6486
        },
        {
            "id": "hz44pi6",
            "score": 3,
            "text": "15 days is all russia could afford for an invasion effort. They gonna go for broke now.",
            "title_similarity": "0.76507545",
            "sentiment_compound": -0.4215
        },
        {
            "id": "hz44qlt",
            "score": 2,
            "text": "Considering how 2020 & 2021 went,  I'm going to guess people believing these are legit plans will cause them to fall into the places needed by Putin's real plan",
            "title_similarity": "0.5325511",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz44r3d",
            "score": 5,
            "text": ">And we will say one thing to the Russian invaders: Leave your equipmentand secret documents behind, we will need them for our defenders. And wewill need them for the Hague.\n\nThat's a killer last line.\n\n&#x200B;\n\nSlava Ukraini.",
            "title_similarity": "0.6470403",
            "sentiment_compound": -0.6369
        },
        {
            "id": "hz44tk0",
            "score": 1,
            "text": "How likely is it Russia didnt believe that, but just lied to the troops to boost their morale thinking this bs would've been done quickly",
            "title_similarity": "0.46652454",
            "sentiment_compound": 0.0387
        },
        {
            "id": "hz44vqx",
            "score": 1,
            "text": "This is a minor typo. But it should be “from a battalion in the 810th brigade tactical group”. Batallions can never be TGs.",
            "title_similarity": "0.4141907",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz451kr",
            "score": 1,
            "text": "Could just be basic things your supposed to learn in 15 days or risk being shot by your superiors if your Russian🤷‍♂️",
            "title_similarity": "0.62327456",
            "sentiment_compound": -0.0258
        },
        {
            "id": "hz45342",
            "score": 2,
            "text": "So they only brought enough supplies for 20 days?",
            "title_similarity": "0.35900724",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz455x6",
            "score": 1,
            "text": "Of course any day more of the conflict is horrible, but it certainly will be almost incredible, and welcomed by most, if it does not extend beyond one more week.",
            "title_similarity": "0.47403997",
            "sentiment_compound": 0.3428
        },
        {
            "id": "hz45b6f",
            "score": 3,
            "text": "Having worked in the intelligence space (hard to prove so take it with a pinch of salt) a tried and true method of throwing the enemy off is a 'limited hangout' or, release a document that makes them prepare for 'Plan A' meanwhile you are prepping for 'Plan B'. You get the drift. It can even be managed internally. The whole army on the floor is expecting to deploy to 'Plan A' and 24 hours before it shifts to 'Plan B' \n\nThis may not be the case but its a moot point at this stage.",
            "title_similarity": "0.6015676",
            "sentiment_compound": 0.0129
        },
        {
            "id": "hz45h18",
            "score": 1,
            "text": "Why would their battle plans for the entire operation be on the battlefield in enemy territory?",
            "title_similarity": "0.56208026",
            "sentiment_compound": -0.8271
        },
        {
            "id": "hz45np3",
            "score": 1,
            "text": "I don't think they planned on having well armed citizens, or much resistance. Pretty sure Russian state media has been telling everyone the citizens and military of Ukraine wants to be part of Russia again. May the Hague have a field day, and soon.",
            "title_similarity": "0.68851495",
            "sentiment_compound": 0.765
        },
        {
            "id": "hz45qqu",
            "score": 2,
            "text": "Sure they did",
            "title_similarity": "-0.11496355",
            "sentiment_compound": 0.3182
        },
        {
            "id": "hz45rao",
            "score": 1,
            "text": "what happens on the sixteenth day?",
            "title_similarity": "0.3809788",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz45xq1",
            "score": 2,
            "text": "15 business days 😅",
            "title_similarity": "0.45719445",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hz46300",
            "score": 2,
            "text": "This feels like a cover up for all the reports that says Russia expected to win in 3 days. It’s day 6? now so this might just be giving them optics cover for their “failed plan”. Even if this plan is legit, if it’s more than a few days old I bet it’s been greatly changed.",
            "title_similarity": "0.631443",
            "sentiment_compound": 0.8271
        },
        {
            "id": "hz4682n",
            "score": 3,
            "text": "Oops. Maybe don’t reveal to Russia that Ukraine has the invasion plans.",
            "title_similarity": "0.59572625",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz46a8n",
            "score": 2,
            "text": "Hand written battle plans in the 21st century. Wow. Haha",
            "title_similarity": "0.46263355",
            "sentiment_compound": 0.8126
        },
        {
            "id": "hz46knl",
            "score": 1,
            "text": "The USA couldn't get out of the Middle east for over 20 years?",
            "title_similarity": "0.5245817",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz46omc",
            "score": 1,
            "text": "Someone’s getting executed",
            "title_similarity": "0.21330835",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz46qpf",
            "score": 1,
            "text": "This is a bunch of bull... It's and old KGB tactic - let disinformation leak as accurate information :)",
            "title_similarity": "0.45396212",
            "sentiment_compound": 0.1531
        },
        {
            "id": "hz46s9w",
            "score": 1,
            "text": "15 days is way too optomistic. Even the very successful US invasion of Iraq in 2003 lasted close to 6 weeks (same for Battle of France and Poland during WW2).",
            "title_similarity": "0.67635465",
            "sentiment_compound": 0.3597
        },
        {
            "id": "hz46yg3",
            "score": 1,
            "text": "Are these legitimate? What if they are part of some sort of diversion tactic? The Allies did something like that prior to D-Day.",
            "title_similarity": "0.400969",
            "sentiment_compound": 0.4329
        },
        {
            "id": "hz470hk",
            "score": 1,
            "text": "Wouldn't it have done more good to keep this secret so that Ukraine forces could have the upper hand at certain sites and beat back the Russians? I'm no military strategist, but anything to help the Ukraine forces on the ground.",
            "title_similarity": "0.59598684",
            "sentiment_compound": 0.7715
        },
        {
            "id": "hz474zm",
            "score": 1,
            "text": "Someone should go speak to the manager of Russia, because despite all of their firepower, they don't know what the fuck they're doing.",
            "title_similarity": "0.5870497",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hz47amk",
            "score": 1,
            "text": "Cheese on the trap is what y’all lookin at here and on tv briefings",
            "title_similarity": "0.34348723",
            "sentiment_compound": -0.3182
        },
        {
            "id": "hz47mxo",
            "score": 2,
            "text": "I hope they hang on and choke the Russian economy to the dumper.  Billions in aid will rebuild Ukraine.   Hang on!",
            "title_similarity": "0.68713295",
            "sentiment_compound": -0.4753
        },
        {
            "id": "hz47oa6",
            "score": 1,
            "text": "False flag? Hopefully the details are real",
            "title_similarity": "0.029886346",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hz47q8b",
            "score": 1,
            "text": "Anyone else having flashbacks to when the head of Google or Amazon's streaming service insisted \"telecom companies will do the right thing\" when faced with broadband internet demands for things like streaming videogames?\n\nThis is what actually happens when you exist in a bubble where you're told all your ideas are brilliant, and people behave in predictable fashions: you make dumbfuck decisions like this.",
            "title_similarity": "0.39530423",
            "sentiment_compound": 0.8316
        },
        {
            "id": "hz47unu",
            "score": 1,
            "text": "Let's go!",
            "title_similarity": "0.12544556",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz48iay",
            "score": 2,
            "text": "I look forward to all the completely unrealistic \"how Russia could have one if they didn't lose this one set of plans\" alternate history in like 30 years.",
            "title_similarity": "0.6504854",
            "sentiment_compound": 0.5801
        },
        {
            "id": "hz48oj2",
            "score": 2,
            "text": "Everyone has a plan until they get punched in the mouth.",
            "title_similarity": "0.37848946",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz48p6w",
            "score": 2,
            "text": "Dammit 810th Bridage of the battalion tactical group of Russia's Black Sea Fleet Marines you had one job!",
            "title_similarity": "0.6848632",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz48wkx",
            "score": 2,
            "text": "Hmm... how come I am hearing on TV that a lot of the troops were only given 3 days of rations? Part of the reason for low morale and some Russians surrendering.",
            "title_similarity": "0.4848373",
            "sentiment_compound": -0.2732
        },
        {
            "id": "hz48wzw",
            "score": 1,
            "text": "That’s a big \n\n“Ooooooops”",
            "title_similarity": "0.085041404",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz48yjq",
            "score": 1,
            "text": "One of the soldiers had it in his back pocket. By chance it fell out of his pocket in a public restroom when he stopped to pee. \n\nWhat are the odds.",
            "title_similarity": "0.28487822",
            "sentiment_compound": 0.0258
        },
        {
            "id": "hz493uf",
            "score": 1,
            "text": "This seems like something they would like to keep close to the chest.",
            "title_similarity": "0.03814859",
            "sentiment_compound": 0.6124
        },
        {
            "id": "hz49avj",
            "score": 1,
            "text": "How do we know that these aren’t fake plans purposely planted by the Russians? I’m paranoid lol",
            "title_similarity": "0.4377337",
            "sentiment_compound": -0.3182
        },
        {
            "id": "hz49kql",
            "score": 1,
            "text": "Is it just me, or is it strange that pravda of all sites posted this article?",
            "title_similarity": "0.36163035",
            "sentiment_compound": -0.2023
        },
        {
            "id": "hz49xsv",
            "score": 1,
            "text": "Operation Mincemeat",
            "title_similarity": "0.19031328",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz4afm9",
            "score": 1,
            "text": "Excellent.\n\nBtw, I hearing that the Russian Nazi police state is making it harder for Russians to leave, NK style.",
            "title_similarity": "0.63683987",
            "sentiment_compound": 0.5423
        },
        {
            "id": "hz4arab",
            "score": 1,
            "text": "So if the Ukrainians can last 1 month, they win.",
            "title_similarity": "0.43573335",
            "sentiment_compound": 0.5859
        },
        {
            "id": "hz4asgo",
            "score": 1,
            "text": "Isn't Pravda owned by the Communist Party of Russia? Why would I want to believe this source?",
            "title_similarity": "0.5470458",
            "sentiment_compound": 0.5204
        },
        {
            "id": "hz4atdq",
            "score": 2,
            "text": "Xi told him to wait until after the Olympics.",
            "title_similarity": "0.469235",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz4aw1y",
            "score": 1,
            "text": "Idk how anyone can wage a war these days, what with cameras EVERYWHERE, in hands, in space. We can observe this 24/7.",
            "title_similarity": "0.48162943",
            "sentiment_compound": -0.6486
        },
        {
            "id": "hz4b2jw",
            "score": 1,
            "text": "These are the type of things you keep secret till after the conflict.",
            "title_similarity": "0.33118963",
            "sentiment_compound": -0.3182
        },
        {
            "id": "hz4b4pv",
            "score": 1,
            "text": "Motherfuckers are treating an invasion like some sort of financial project.",
            "title_similarity": "0.3720659",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hz4baod",
            "score": 1,
            "text": "It could just be a deception.",
            "title_similarity": "0.048662078",
            "sentiment_compound": -0.4404
        },
        {
            "id": "hz4bee5",
            "score": 1,
            "text": "Is the 15 timeline a timeline for the whole war, or just a timeline to capture Melitopel by these guys?",
            "title_similarity": "0.72003645",
            "sentiment_compound": -0.5994
        },
        {
            "id": "hz4bept",
            "score": 1,
            "text": "This stinks of a set up .....",
            "title_similarity": "0.17384082",
            "sentiment_compound": -0.25
        },
        {
            "id": "hz4bfx5",
            "score": 1,
            "text": "Дорогие русские братья,не дайте продолжаться этому вторжению на Украину. За последние несколько дней погибло более 5000 российских солдат. Тысячи украинских гражданских лиц были убиты в результате российских бомбардировок. Экономика в России упала, рабочие места теряются, люди теряют свои сбережения, уровень жизни резко упадет для всех. Выходите на улицы. Если вы соберете достаточно большое количество людей, ваш лидер будет вынужден прислушаться. Вы можете предотвратить катастрофу.",
            "title_similarity": "0.44947386",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz4biw2",
            "score": 1,
            "text": "Huh, guess not everyone in Russia was on board with the invasion of Ukrain.",
            "title_similarity": "0.5986882",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz4c13u",
            "score": 2,
            "text": "Any chance it’s a red herring?",
            "title_similarity": "0.15990916",
            "sentiment_compound": 0.25
        },
        {
            "id": "hz4c8cd",
            "score": 1,
            "text": "Could still happen if Ukraine surrenders once Russia starts bombing eve more civilian areas.",
            "title_similarity": "0.66115034",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz4cke7",
            "score": 1,
            "text": "Sure...",
            "title_similarity": "-0.14914809",
            "sentiment_compound": 0.3182
        },
        {
            "id": "hz4cmpc",
            "score": 1,
            "text": "18th of January, time to cross-reference where and what Russian oligarchs were doing.",
            "title_similarity": "0.6545421",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz4cpom",
            "score": 1,
            "text": "Fucking Russian how many times have I told you not to take the plans with you to the surrender.. I mean war??  Now they know what you want to do..  🤦🤦🇺🇦🇺🇦. \n\nProbably not real plans.  Just a hunch.",
            "title_similarity": "0.6762687",
            "sentiment_compound": -0.6072
        },
        {
            "id": "hz4cxvd",
            "score": 1,
            "text": "I would be very careful about Russia intentionally leaking flase information. It seems like there wouldn't be negative consequences to believing this information if it was false but I also have no idea if there's more sensitive documents they didn't share.",
            "title_similarity": "0.42420253",
            "sentiment_compound": -0.235
        },
        {
            "id": "hz4d2pt",
            "score": 1,
            "text": "Smokescreen they were probably meant to be found",
            "title_similarity": "0.1160042",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz4d4m7",
            "score": 1,
            "text": "You know, as people are talking about how dumb they were for revealing their plans, I feel like it's worth remembering that D-Day was only truly possible because the Allies ensured the Axis \"captured\" \"secret\" documents detailing plans in all the locations D Day wasn't planned for. \n\nI'm sure leaders are planning for this, but just bear in mind the \"leaking totally real battle plans\" has been an effective strategy before.",
            "title_similarity": "0.46314985",
            "sentiment_compound": 0.4556
        },
        {
            "id": "hz4d68w",
            "score": 2,
            "text": "This has a whiff of Operation Mincemeat.",
            "title_similarity": "0.17932665",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz4dkmw",
            "score": 1,
            "text": "Date lines up with Julian Calender Lent, Mar 7",
            "title_similarity": "0.31900647",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz4e632",
            "score": 1,
            "text": "Is this real or more fake stuff",
            "title_similarity": "0.045073926",
            "sentiment_compound": -0.5256
        },
        {
            "id": "hz4e8cd",
            "score": 1,
            "text": "Given the predictions coming out of NATO, I wonder if at least part of these plans were leaked to them before hand. Ironic given the Russian denial at the time.",
            "title_similarity": "0.6183934",
            "sentiment_compound": 0.1027
        },
        {
            "id": "hz4eaou",
            "score": 1,
            "text": "It’s all sounds dodgy.\nDid they really forget these papers or leave them there on purpose with false info",
            "title_similarity": "0.23718631",
            "sentiment_compound": -0.5095
        },
        {
            "id": "hz4enly",
            "score": 1,
            "text": "I want this to be true but given that it’s Pravda it’s a little hard to accept.",
            "title_similarity": "0.17684689",
            "sentiment_compound": 0.5986
        },
        {
            "id": "hz4eoah",
            "score": 1,
            "text": "Unless it's a trap...",
            "title_similarity": "0.10936921",
            "sentiment_compound": -0.3182
        },
        {
            "id": "hz4erje",
            "score": 1,
            "text": "Seems like a lot of they Vids with broken down tanks aswell",
            "title_similarity": "0.32386798",
            "sentiment_compound": -0.1531
        },
        {
            "id": "hz4es9b",
            "score": 4,
            "text": "Ghost of Kyev has personally grasped those plans from the hands of dead invaders while flying at ground level. Right after the blew the Russian Death Star. /s",
            "title_similarity": "0.554447",
            "sentiment_compound": -0.8885
        },
        {
            "id": "hz4euqv",
            "score": 1,
            "text": "Why would this be leaked and published?",
            "title_similarity": "0.21729961",
            "sentiment_compound": -0.3182
        },
        {
            "id": "hz4f7yb",
            "score": 2,
            "text": "Civilian here, so please excuse my ignorance. Soldiers actually carry secret operation plans on them out into the field? Ones that are labeled \"secret\"? I don't believe this",
            "title_similarity": "0.40230373",
            "sentiment_compound": 0.3463
        },
        {
            "id": "hz4f9ug",
            "score": 1,
            "text": "Could be fake plans, people forget that false information tactics have been used for years",
            "title_similarity": "0.30715835",
            "sentiment_compound": -0.6124
        },
        {
            "id": "hz4ffhz",
            "score": 1,
            "text": "are we believing Pravda now? :D",
            "title_similarity": "0.2082527",
            "sentiment_compound": 0.6166
        },
        {
            "id": "hz4fg6c",
            "score": 1,
            "text": "I’m married to someone who hates to lose to a fault.\n\nI wonder what happens when that personality is multiplied by 10 and then put in charge of a massive military machine armed with nuclear weapons.\n\nHe isn’t going to lose. He’ll die first.",
            "title_similarity": "0.5496088",
            "sentiment_compound": -0.9501
        },
        {
            "id": "hz4fj83",
            "score": 1,
            "text": "21st century war is so fucking weird. Why is this on Reddit? How can that help Ukraine? Maybe Putin wants it out there.",
            "title_similarity": "0.66322005",
            "sentiment_compound": -0.5902
        },
        {
            "id": "hz4fnf1",
            "score": 1,
            "text": "I assumed these would be made digitally. \n\nThese look like original hand-drawn and handwritten pages.\n\nIt looks like they aren't even copied or printed, because that usually leaves an edge on the paper.",
            "title_similarity": "0.30816317",
            "sentiment_compound": 0.743
        },
        {
            "id": "hz4fnkv",
            "score": 1,
            "text": "If Cryptonomicon has taught me anything, is that they are false plans left behind on purpose!",
            "title_similarity": "0.3411383",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz4fqf3",
            "score": 1,
            "text": "'let me go into battle with these highly classified documents'\n\nBs",
            "title_similarity": "0.43471417",
            "sentiment_compound": -0.3818
        },
        {
            "id": "hz4g0fb",
            "score": 2,
            "text": "Oopsie whoopsie, someone committed a tactical fucky wucky.",
            "title_similarity": "0.26321113",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hz4g9aq",
            "score": 1,
            "text": "Counter intelligence and misinformation is what the Russians are best at. This info shouldn’t be blindly trusted",
            "title_similarity": "0.44107568",
            "sentiment_compound": 0.8442
        },
        {
            "id": "hz4ggze",
            "score": 1,
            "text": "So they could still be om track",
            "title_similarity": "0.052510288",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz4gqne",
            "score": 1,
            "text": "It’s a secret trust me",
            "title_similarity": "0.08855584",
            "sentiment_compound": 0.5106
        },
        {
            "id": "hz4gs9g",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.055294536"
        },
        {
            "id": "hz4gsws",
            "score": 1,
            "text": "Could this be a direct attempt as disinformation?",
            "title_similarity": "0.12232205",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz4h2sh",
            "score": 1,
            "text": "Are you saying the Russians...lied???  For reals??  O M G!\n\nGoogle operation mincemeat",
            "title_similarity": "0.5122239",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz4h41e",
            "score": 1,
            "text": "Russia doesn't seem quite as formidable as once thought",
            "title_similarity": "0.29754543",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz4h5nh",
            "score": 1,
            "text": "It was all just a money grab for the oligarchy. I don’t think it worked out quite how they thought it would. They may end up actually losing everything instead.",
            "title_similarity": "0.39792645",
            "sentiment_compound": -0.3818
        },
        {
            "id": "hz4h7hc",
            "score": 1,
            "text": "Thats suspicious , why would Ukrainians even put those photos into light. That doesnt make any sense what so ever. If they are real , Russians can easily deny them , if they're fake they just poke the bear. \n\nWorse in the situation assuming they are real , Russians are now 100% sure they have plans etc , units movement , soldiers and equipement locations and directions , main targets etc , instead using is as advantage to prepare traps etc , Russian army will change their plans. \n\nThere is always possibility it is bogus, dropped on purpose to do the oposite as above to make them put focus on something they are least interested in and  in reality advance to real targets.\n\nAlso it is so weird , because only way to get those documents are to either betray or die. No one would leave that kind of papers behind,  if that really happened , person or whole unit could end up killer by their own.",
            "title_similarity": "0.602371",
            "sentiment_compound": -0.9741
        },
        {
            "id": "hz4hfis",
            "score": 2,
            "text": "Why does this map look like it's from 1982? Not just the map, but everything in that room. Straight out of the 80s.",
            "title_similarity": "0.32252803",
            "sentiment_compound": 0.4767
        },
        {
            "id": "hz4hlsh",
            "score": 1,
            "text": "We haven't hit 15 days yet.",
            "title_similarity": "0.30022353",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz4i2b9",
            "score": 1,
            "text": "What are you guys guesses for the life expectancy of Putin. I say a week or two after all attacks are suppressed after massive civilian death.",
            "title_similarity": "0.7153155",
            "sentiment_compound": -0.7783
        },
        {
            "id": "hz4i35s",
            "score": 2,
            "text": " \"When one of the captured Russian soldiers says that they came to participate in drills and got lost, do not believe it! They knew, they carefully planned and prepared.",
            "title_similarity": "0.5649698",
            "sentiment_compound": 0.1007
        },
        {
            "id": "hz4ida9",
            "score": 1,
            "text": "I was wondering why everyone of the captured soldiers all stuck to the same story, “ we were doing drills and didn’t know” the last paragraph from this excerpt says to not believe them.. they knew and had catered responses at the ready.",
            "title_similarity": "0.4319598",
            "sentiment_compound": 0.128
        },
        {
            "id": "hz4ii20",
            "score": 1,
            "text": "Sekrit dokuments",
            "title_similarity": "0.038331464",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz4ik3g",
            "score": 2,
            "text": "Not saying this is a fake plan, but it kinda make me wonder...",
            "title_similarity": "0.12903899",
            "sentiment_compound": -0.2617
        },
        {
            "id": "hz4itv3",
            "score": 1,
            "text": "15 days? It's just the 5th day right? So by the 15 day the rub would be less than a jap yen or the korean currenc(won) I think?",
            "title_similarity": "0.45391774",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz4j1po",
            "score": 1,
            "text": "Does anyone else think that they have the plans shouldn’t be disclosed?",
            "title_similarity": "0.17379038",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz4j5q9",
            "score": 1,
            "text": "They seriously thought this hunk of junk army would seize the country in 15 fucking days? Are they high?",
            "title_similarity": "0.7481885",
            "sentiment_compound": -0.264
        },
        {
            "id": "hz4ji43",
            "score": 1,
            "text": "They still have 7 more days…..just sayin …….",
            "title_similarity": "0.27858514",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz4jl3p",
            "score": 2,
            "text": "They may have found documents but remember false information does not only exist online.",
            "title_similarity": "0.20273575",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz4jsy6",
            "score": 1,
            "text": "Black sea flea  market",
            "title_similarity": "0.2416051",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz4jwdk",
            "score": 1,
            "text": "It’s possible the Russians viewed the situation like the Taliban last year in Afghanistan.",
            "title_similarity": "0.6266862",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hz4k1n6",
            "score": 1,
            "text": "Or maybe these plans are only for the first 15 days.",
            "title_similarity": "0.50036055",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz4k2ep",
            "score": 1,
            "text": "Well, seems like a perfect time for the \"Mission Accomplished\" ceremony on the closest black sea naval vessel. Congrats Vlad!",
            "title_similarity": "0.40950716",
            "sentiment_compound": 0.9312
        },
        {
            "id": "hz4ke7y",
            "score": 1,
            "text": "Homecoming",
            "title_similarity": "0.1438592",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz4knmk",
            "score": 1,
            "text": "8 more days is a long time when you consider they are only on day 7 now and have Kiev and Kharkov  all but encircled and have essentially cut off the Black Sea despite having a really poor first 4 days.",
            "title_similarity": "0.6271114",
            "sentiment_compound": -0.8042
        },
        {
            "id": "hz4ktd4",
            "score": 2,
            "text": "Idiots",
            "title_similarity": "0.005038278",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz4l3ry",
            "score": 2,
            "text": "SIKE! THAT’S THE WRONG NUMBAAA!!",
            "title_similarity": "0.11883354",
            "sentiment_compound": -0.6093
        },
        {
            "id": "hz4mbu3",
            "score": 1,
            "text": "“The Joint Forces Operational Command also said: \"When one of the captured Russian soldiers says that they came to participate in drills and got lost, do not believe it! They knew, they carefully planned and prepared.”",
            "title_similarity": "0.6139338",
            "sentiment_compound": -0.2714
        },
        {
            "id": "hz4muf6",
            "score": 1,
            "text": "So as of tomorrow it will have been a week considering the attacks started last Thursday. Does this mean the attacks will only get more intense in desperation to end the war by then? Having really bad vibes here. Putin might go completely nuts within the next week and further...",
            "title_similarity": "0.63939923",
            "sentiment_compound": -0.9569
        },
        {
            "id": "hz4nm18",
            "score": 1,
            "text": "Crazy!",
            "title_similarity": "0.054927006",
            "sentiment_compound": -0.4003
        },
        {
            "id": "hz4nqt5",
            "score": 1,
            "text": "So two can play at this game.",
            "title_similarity": "0.0071003903",
            "sentiment_compound": 0.3947
        },
        {
            "id": "hz4nvw2",
            "score": 2,
            "text": "lol - so Russia Fs up royally and, out of embarrassment, they reverse engineer a plan that makes it look like what's happening now was always the plan? And we are supposed to believe that all the screw ups and unnecessary losses were part of the plan all along?",
            "title_similarity": "0.60131145",
            "sentiment_compound": -0.264
        },
        {
            "id": "hz4oh3s",
            "score": 1,
            "text": "So just two more weeks?",
            "title_similarity": "0.2964094",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz4oiyy",
            "score": 1,
            "text": "Isn’t Pravda what Elon was going to name his journalism site?",
            "title_similarity": "0.41587326",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz4ooj8",
            "score": 3,
            "text": "I doubt Putin would’ve started this fight if his narcissistic power-hungry ass had the foresight to see what a massive tool he’d make of himself💀 He’s really dug his own grave in a lot of ways, it’s devastating he’s bringing down lots of innocent people in the process. Slava Ukraini",
            "title_similarity": "0.5640179",
            "sentiment_compound": -0.926
        },
        {
            "id": "hz4oqs6",
            "score": 2,
            "text": "Crazy!",
            "title_similarity": "0.054927006",
            "sentiment_compound": -0.4003
        },
        {
            "id": "hz4ozpc",
            "score": 2,
            "text": "And China asked them to wait until after the Olympics, nice.",
            "title_similarity": "0.42454278",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hz4paec",
            "score": 1,
            "text": "If this is legit and not just a fake to throw them off I just don’t understand why they would release it to the public and not keep it secret so they can follow what they’re doing to get ahead of them? Just curious what the benefit is to releasing them.",
            "title_similarity": "0.2462397",
            "sentiment_compound": 0.7817
        },
        {
            "id": "hz4pl7s",
            "score": 1,
            "text": "Just excited to see if the bots will win this post",
            "title_similarity": "0.23347715",
            "sentiment_compound": 0.7351
        },
        {
            "id": "hz4prjs",
            "score": 2,
            "text": "Maybe that is why they ran out of food and gas?",
            "title_similarity": "0.2708937",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz4q2ac",
            "score": 3,
            "text": "It would be nice to see the war come to an end and for Putin to be called into the Hague",
            "title_similarity": "0.41873613",
            "sentiment_compound": -0.2732
        },
        {
            "id": "hz4qhq3",
            "score": 1,
            "text": "I’m amazed I’m reading this headline on a social media app tbh",
            "title_similarity": "0.28334203",
            "sentiment_compound": 0.4939
        },
        {
            "id": "hz4qksx",
            "score": 1,
            "text": "Uh, huh, because \"Vladimir six pack\" would be carrying those secret plans into battle... give your head a shake ffs.",
            "title_similarity": "0.64998364",
            "sentiment_compound": -0.7964
        },
        {
            "id": "hz4qr4w",
            "score": 1,
            "text": "Isn’t this the type of thing the Ukrainians would want us to keep under wraps so they can act on this Intel?",
            "title_similarity": "0.50135595",
            "sentiment_compound": 0.0772
        },
        {
            "id": "hz4rm9r",
            "score": 1,
            "text": "Should this be discussed publically?  I mean, I guess it's already done, but might it have been better to not let them know you have the plan?",
            "title_similarity": "0.30309904",
            "sentiment_compound": 0.6381
        },
        {
            "id": "hz4rzr2",
            "score": 1,
            "text": "Aside from the horrific nature of it all, I gotta say, Putin’s War is damn juicy.",
            "title_similarity": "0.45530483",
            "sentiment_compound": -0.9001
        },
        {
            "id": "hz4s58c",
            "score": 5,
            "text": "“Everyone has a plan 'till they get punched in the mouth.” - Mike Tyson",
            "title_similarity": "0.44019115",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz4s6h0",
            "score": 1,
            "text": "Okay, so are we saying that the captured Russian soldiers' narratives are now, without a doubt, lies?",
            "title_similarity": "0.53250587",
            "sentiment_compound": 0.0541
        },
        {
            "id": "hz4seb6",
            "score": 6,
            "text": "I urge all Russians and military people  to topple the Putin government. \n\n If you did that, you will always be remembered as heroes.",
            "title_similarity": "0.62481266",
            "sentiment_compound": 0.5106
        },
        {
            "id": "hz4sqz1",
            "score": 2,
            "text": "The said documents? Probably powerpoints. \n\nDeath by powerpoints is a universal military experience.",
            "title_similarity": "0.52617764",
            "sentiment_compound": -0.5994
        },
        {
            "id": "hz4sra9",
            "score": 3,
            "text": "American intelligence is inside Putin inner circle. They knew about the invasion. Ukraine knew too. That’s why they were preparing. Now, people around the world go to Ukraine to fight for freedom!!!",
            "title_similarity": "0.70746404",
            "sentiment_compound": 0.7633
        },
        {
            "id": "hz4sung",
            "score": 2,
            "text": "This shit is propaganda. This is an unprecedented failure by Putin. Sending in kids to die.",
            "title_similarity": "0.52334803",
            "sentiment_compound": -0.9153
        },
        {
            "id": "hz4sv3t",
            "score": 3,
            "text": "Please excuse my cynicism, but I feel like performing poorly and “loosing the playbook” is classic playbook shenanigans.",
            "title_similarity": "0.31865934",
            "sentiment_compound": 0.4939
        },
        {
            "id": "hz4sxjq",
            "score": 3,
            "text": "Shitheads don't even have good EDP in place.",
            "title_similarity": "0.1411587",
            "sentiment_compound": -0.7189
        },
        {
            "id": "hz4tkl1",
            "score": 2,
            "text": "Just take Putin out",
            "title_similarity": "0.40727842",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz4tl72",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.055294536"
        },
        {
            "id": "hz4tmv9",
            "score": 1,
            "text": "Step 1: Invade Ukraine\n\nStep 2: oh shit oh shit oh shit oh shit oh shit\n\nStep 3: Abandon Ukraine",
            "title_similarity": "0.5808436",
            "sentiment_compound": -0.9678
        },
        {
            "id": "hz4tr45",
            "score": 2,
            "text": "So much overly positive news yet so many bombing videos. Are they just bombing empty fields? Honestly confused why so many bombings if it ain't working.",
            "title_similarity": "0.38943952",
            "sentiment_compound": 0.5809
        },
        {
            "id": "hz4trwy",
            "score": 1,
            "text": "That unit name doesn’t make sense… Brigades are bigger than Battalions. Maybe a mistranslation?",
            "title_similarity": "0.3334539",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz4tv1t",
            "score": 1,
            "text": "Turkey just denied Russian war ships access to the black sea",
            "title_similarity": "0.6387464",
            "sentiment_compound": -0.7783
        },
        {
            "id": "hz4vcso",
            "score": 1,
            "text": "I find it really hard to believe that Russia has made this many genuine mistakes in a row. When the enemy is that incompetent it would serve you well to be at least a little bit suspicious.",
            "title_similarity": "0.5024999",
            "sentiment_compound": -0.8725
        },
        {
            "id": "hz4w0de",
            "score": 3,
            "text": "The source is Facebook.\n\nI'm sure that's all you really need to know about the validity of this.",
            "title_similarity": "0.24912682",
            "sentiment_compound": 0.3182
        },
        {
            "id": "hz4wigt",
            "score": 1,
            "text": "Help",
            "title_similarity": "-0.09345701",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hz4wpoz",
            "score": 1,
            "text": "as US comedian Chris Rock said (years ago and in a different context): \"Two weeks?! You couldn't take over **Baltimore** in two weeks!\"",
            "title_similarity": "0.5144602",
            "sentiment_compound": 0.4912
        },
        {
            "id": "hz4wtw2",
            "score": 1,
            "text": "Russia is in deep dodo for at least 10 years!Not good to hitch your wagon with Putin unless your as crazy as he is!",
            "title_similarity": "0.66571915",
            "sentiment_compound": 0.2695
        },
        {
            "id": "hz4wz72",
            "score": 1,
            "text": "It a trap",
            "title_similarity": "0.09724712",
            "sentiment_compound": -0.3182
        },
        {
            "id": "hz4x3ge",
            "score": 1,
            "text": "So that means all their supplies ends on 3/7.  We'll see what happens to the great invasion force then.",
            "title_similarity": "0.53038144",
            "sentiment_compound": 0.6249
        },
        {
            "id": "hz4xc0h",
            "score": 1,
            "text": "This whole thing is so sloppy, sad, and unnecessary!",
            "title_similarity": "0.15834537",
            "sentiment_compound": -0.5676
        },
        {
            "id": "hz4xf9k",
            "score": 1,
            "text": "All of this is truly interesting.   Yet what matters is today and tomorrows actions.   Not a good feeling.",
            "title_similarity": "0.30618453",
            "sentiment_compound": 0.4449
        },
        {
            "id": "hz4yeci",
            "score": 1,
            "text": "Pravda.lol is not a source.",
            "title_similarity": "0.14014721",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz4ym6x",
            "score": 1,
            "text": "Theres no stamps. How can this be real? We all know embolded stamps are the official seal of approval",
            "title_similarity": "0.3241486",
            "sentiment_compound": 0.2263
        },
        {
            "id": "hz4z4ud",
            "score": 1,
            "text": "Can we all agree that neither the Russian citizens nor the majority of the military want to be there?",
            "title_similarity": "0.47673792",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hz4zdgo",
            "score": 2,
            "text": "This would be amazing if it was actual plans, but it’s clearly something they would have sent as a decoy",
            "title_similarity": "0.27387607",
            "sentiment_compound": 0.714
        },
        {
            "id": "hz4zmti",
            "score": 1,
            "text": "99999iioioo98000000000000999999z x x1 has the",
            "title_similarity": "0.1881971",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz4zsni",
            "score": 2,
            "text": "Russian military is failing so bad right now and I'm 100% here for it!",
            "title_similarity": "0.52066875",
            "sentiment_compound": -0.8435
        },
        {
            "id": "hz517at",
            "score": 2,
            "text": "Hey, we know there's a bunch of hackers in Russia, so I backed up the images to my Google drive in case this website or others go down. It might help if a bunch of others made public backups, too.\n\n[Russian secret stuff for Ukraine](https://drive.google.com/folderview?id=1dlgEjWWn1nSPhqKQVZDVQkEEJReEXnWt)",
            "title_similarity": "0.6637442",
            "sentiment_compound": 0.4728
        },
        {
            "id": "hz51k1p",
            "score": 1,
            "text": "this reeks of the allied troop washing up on a beach with allied invasion plans in his coat pockets.....",
            "title_similarity": "0.3582623",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz51olz",
            "score": 2,
            "text": "Can’t believe they just leaked the plans to Order 66 like that…",
            "title_similarity": "0.43774486",
            "sentiment_compound": 0.0516
        },
        {
            "id": "hz51oqo",
            "score": 2,
            "text": "Secret plans show up when they are suppose to. Never think you know what’s going on in war.",
            "title_similarity": "0.47372475",
            "sentiment_compound": -0.5994
        },
        {
            "id": "hz52ybq",
            "score": 1,
            "text": "   I jujujii  m. Oo",
            "title_similarity": "0.065863416",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz53gh1",
            "score": 1,
            "text": "Absolute bumbling morons",
            "title_similarity": "0.079926826",
            "sentiment_compound": -0.3182
        },
        {
            "id": "hz53iup",
            "score": 1,
            "text": "Well, that gives the Ukrainians a goal to shoot for, at least.",
            "title_similarity": "0.3313942",
            "sentiment_compound": -0.0772
        },
        {
            "id": "hz54oox",
            "score": 3,
            "text": "Not to be a buzzkill, but what if those plans were intentionally allowed to be found by the Ukrainians to lull them into a false sense of confidence? Of course I want them to pull through but I’m worried Russia hasn’t pulled out it’s big guns yet",
            "title_similarity": "0.5433456",
            "sentiment_compound": 0.4767
        },
        {
            "id": "hz54yvw",
            "score": 4,
            "text": "Take this all with a grain of salt. This can very well be propaganda.",
            "title_similarity": "0.2400399",
            "sentiment_compound": 0.0334
        },
        {
            "id": "hz55f99",
            "score": 3,
            "text": "Step 1. Invade Ukraine \n\nStep 2. ???  \n\nStep 3. Profit",
            "title_similarity": "0.54507804",
            "sentiment_compound": 0.533
        },
        {
            "id": "hz55trr",
            "score": 2,
            "text": "Could they be playing dumb on purpose to lead into an ambush?",
            "title_similarity": "0.22949612",
            "sentiment_compound": -0.3612
        },
        {
            "id": "hz57zdn",
            "score": 4,
            "text": "I hope 15 days is a promise",
            "title_similarity": "0.44534546",
            "sentiment_compound": 0.6369
        },
        {
            "id": "hz58b2i",
            "score": 3,
            "text": "Fuck Putin. That’s all.",
            "title_similarity": "0.31320482",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hz58d2e",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.055294536"
        },
        {
            "id": "hz58lht",
            "score": 1,
            "text": "Christ Russian army is looking doggy around the edges",
            "title_similarity": "0.5218189",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz58mof",
            "score": 3,
            "text": "“We’ll be greeted as liberators.”",
            "title_similarity": "0.15958847",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hz59jo8",
            "score": 1,
            "text": "Ruh Ro…",
            "title_similarity": "0.08025772",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz59pyv",
            "score": 2,
            "text": "It should be like the 15 minute rule in college where, if the professor fails to show up in 15 minutes, everyone can leave. Except, because it’s war, maybe 15 days for conquest. If not, go back home and study.",
            "title_similarity": "0.6859289",
            "sentiment_compound": -0.6597
        },
        {
            "id": "hz59x2y",
            "score": 6,
            "text": "Aleksey Navalnys team literally bought the info online of all the FSB agents that tailed him for years then poisoned him using novichok. Every fabric of the Russian government and society is soaked in corruption",
            "title_similarity": "0.61736226",
            "sentiment_compound": -0.4939
        },
        {
            "id": "hz5acmt",
            "score": 2,
            "text": "So those Russian boys are lying through their teeth when they say they don’t know what’s happening",
            "title_similarity": "0.39799428",
            "sentiment_compound": -0.5267
        },
        {
            "id": "hz5av6f",
            "score": 3,
            "text": "The title sounds about right. War in Ukraine will last about 15 days. Russia is losing at a drastic speed. 🇺🇦🇺🇦🇺🇦",
            "title_similarity": "0.80759645",
            "sentiment_compound": -0.7579
        },
        {
            "id": "hz5br4d",
            "score": 2,
            "text": "Did they not see where the Blitzkrieg got Germany?",
            "title_similarity": "0.44795066",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz5cfw1",
            "score": 1,
            "text": "Fk putin",
            "title_similarity": "0.3547542",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz5dwrv",
            "score": 1,
            "text": "Yes everyone is a noncombatant lamb when they have to surrender. They will say whatever they need to not get their comeuppance.",
            "title_similarity": "0.30492282",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hz5e0lv",
            "score": 2,
            "text": "If true, then today would be the halfway point. Hang in there Ukrainians, the world is with you!",
            "title_similarity": "0.5465199",
            "sentiment_compound": 0.4753
        },
        {
            "id": "hz5e690",
            "score": 3,
            "text": "Yup that checks out. Putin thought he could take the largest country in Europe in at most 15 days but ideally 1 week. If Ukraine can hang on for several months Russia will crumble.",
            "title_similarity": "0.7416576",
            "sentiment_compound": 0.5719
        },
        {
            "id": "hz5eqws",
            "score": 2,
            "text": "[removed]",
            "title_similarity": "0.055294536"
        },
        {
            "id": "hz5er40",
            "score": 2,
            "text": "But what about the article that was published in the Russian media, announcing the victory after barely 2 days? At some point they announced that Kyiv will fall until March 3rd too. Idk, to me, this new leak could be a form of disinformation and damage control, though I'm sure Ukraine has a better intel and they know what to do with it.",
            "title_similarity": "0.7275573",
            "sentiment_compound": -0.296
        },
        {
            "id": "hz5ihcf",
            "score": 1,
            "text": "Realistically speaking: how likely is it that he’s getting so desperate that he would actually nuke everyone else?",
            "title_similarity": "0.39287907",
            "sentiment_compound": -0.4572
        },
        {
            "id": "hz5loq8",
            "score": 3,
            "text": "Why would you announce you know the plans by your enemy? This is either incredibly stupid or just plain propaganda.",
            "title_similarity": "0.39353544",
            "sentiment_compound": -0.8479
        },
        {
            "id": "hz5o5md",
            "score": 3,
            "text": "So on day 16 they’re just gonna go home? Lol",
            "title_similarity": "0.34365758",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hz5qa6w",
            "score": 4,
            "text": "How likely is it that this is Russian disintel?",
            "title_similarity": "0.47111884",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz5uxmd",
            "score": 3,
            "text": "How is it possible that nobody, not on BBC or any other paper or broadcast center is talking about this?",
            "title_similarity": "0.23747358",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz5vjek",
            "score": 6,
            "text": "\"The Joint Forces Operational Command also said: \"When one of the captured Russian soldiers says that they came to participate in drills and got lost, do not believe it! They knew, they carefully planned and prepared.\"\n\n&#x200B;\n\nI think the \"Drills\" or \"got lost\" or \"didn't know what I was doing\" was said to the Russians as a cover story to tell if they got captured.",
            "title_similarity": "0.60916513",
            "sentiment_compound": -0.3595
        },
        {
            "id": "hz5vylf",
            "score": 1,
            "text": "There is a bit of an explanation of the documents here around the 12:00 min mark [https://www.youtube.com/watch?v=K5BAZ2bBUzM](https://www.youtube.com/watch?v=K5BAZ2bBUzM)",
            "title_similarity": "0.42371702",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz5x308",
            "score": 4,
            "text": "Fuck you putin and your enablers. We hate you.",
            "title_similarity": "0.39487657",
            "sentiment_compound": -0.802
        },
        {
            "id": "hz61yv6",
            "score": 1,
            "text": "So when the 15 days expire they'll find a 30 day plan?",
            "title_similarity": "0.47533202",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz66yl5",
            "score": 1,
            "text": "What if this was all left behind on purpose?",
            "title_similarity": "0.16355783",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz6ahbc",
            "score": 1,
            "text": "sounds suspicious....",
            "title_similarity": "0.021337558",
            "sentiment_compound": -0.3612
        },
        {
            "id": "hz6bjtx",
            "score": 2,
            "text": "Would be great to see Anonymous hack the Russian satellites and other systems.",
            "title_similarity": "0.5457029",
            "sentiment_compound": 0.6249
        },
        {
            "id": "hz6cyrh",
            "score": 2,
            "text": "Russian army, go fuck your self 🙏",
            "title_similarity": "0.5922742",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hz6vc19",
            "score": 1,
            "text": "This could be Putin downfall and I hope Belarus will pay for helping him.Last two dictators of Europe.",
            "title_similarity": "0.58010906",
            "sentiment_compound": 0.5719
        },
        {
            "id": "hz7dwfn",
            "score": 2,
            "text": "How can we be sure these are legit? Common practice to leak fake plans to make the opposing side misalign resources.",
            "title_similarity": "0.34743804",
            "sentiment_compound": -0.4939
        },
        {
            "id": "hz7hjzg",
            "score": 1,
            "text": "Site blocked in Russia 🪆",
            "title_similarity": "0.5248534",
            "sentiment_compound": -0.2732
        },
        {
            "id": "hz7ibmn",
            "score": 1,
            "text": "Jesus H. Christ. Everything on paper and no encrypted radios? They aren't kidding when they say new cold war cause the Russians are still fighting like it's the 80s!",
            "title_similarity": "0.60379785",
            "sentiment_compound": -0.7709
        },
        {
            "id": "hz8uyrl",
            "score": 1,
            "text": "It's hard to believe that this wasn't leaked on purpose. Russia were clearly supposed to have finished the invasion already. This is most likely disinformation.",
            "title_similarity": "0.584648",
            "sentiment_compound": 0.5043
        },
        {
            "id": "hz9t1vu",
            "score": 1,
            "text": "Any hints of Russian submarines in there?",
            "title_similarity": "0.54785615",
            "sentiment_compound": 0.0
        },
        {
            "id": "hzakvmi",
            "score": 1,
            "text": "This is good and all but from one soldier to another don’t tell the world you found stuff like this. this should be kept secret so it can be used against the Russians.",
            "title_similarity": "0.52022505",
            "sentiment_compound": 0.6369
        },
        {
            "id": "hzdvx82",
            "score": 2,
            "text": "They just showed some ignorant woman in russia she doesn't even believe they are invading Ukraine.. or they would have years agao and there is nothing on the news she said . Sad the countries people are clueless to the real world around them being kept from knowing the truth.",
            "title_similarity": "0.55496216",
            "sentiment_compound": -0.6597
        },
        {
            "id": "hzif22c",
            "score": 1,
            "text": "Hey Russia  \nAre you aware NATO's economy is growing very fast on cold blood!  \nLockeed Martin share price on 14 Feb 2022 - $365 gone up 4 March 2022 - $458  \nGeneral Dynamics share price on 14 Feb 2022 -$211 gone up 4 March 2022 - $243  \nNorthrop Grumman share price on 14 Feb 2022 -$386 gone up 4 March 2022 - $471",
            "title_similarity": "0.65296394",
            "sentiment_compound": 0.8268
        },
        {
            "id": "hznysuf",
            "score": 2,
            "text": " I Putin is so old he still thinks he can control information like it’s 1960 haha. \n\nSome truth for the masses:\n\nOver 11,000 Russian troops have been killed since the invasion began, Ukrainian military says\n\nThe Russian coward police are beating up old babushkas who survived ww2 and the seige of Leningrad:\n\nhttps://youtu.be/mG3Z1iiynRc\n\nRussian cowards beating up its own people:\n\nhttps://youtu.be/YAZqjIllcaE\n\nCapture Russian soldier videos you won’t see on russia state controlled media there is hundreds of them\n\n\nhttps://youtu.be/_C1X9mutDzo\n\nhttps://youtu.be/l7CfoDByXso\n\nhttps://youtu.be/1jOfY9y7gVg\n\nhttps://youtu.be/nyEoyTUl3_4\n\nhttps://youtu.be/5CdXqr5Fa3M\n\nhttps://youtu.be/fd6tOdLUdkM\n\nhttps://youtu.be/r37jds7hGBY\n\n\nhttps://youtu.be/7Y3YqgWtPq4\n\nhttps://youtu.be/GTdDSnNfrmQ\n\nhttps://youtu.be/CZKuSwjLK_s\n\nhttps://youtu.be/x47eNyXmPDo\n\nhttps://youtu.be/BuaMpxtzo_0\n\nhttps://youtu.be/DH-IYh1ANVc\n\nhttps://youtu.be/C6v3nnxOrh4\n\nhttps://youtu.be/3j_XGQ4lcGg\n\nhttps://youtu.be/xWHTnJ1y4CI\n\n\n\n\n\nChild killed in Ukraine by Russians\n\nhttps://youtu.be/ZIG6U6Gea-k\n\n\n\nThe truth is out there all over the Kremlin cannot stop the Russian people from the truth even with the  crack down on any opposition to Putin the coward.\n\nУважаемые россияне, ваши СМИ подвергаются цензуре. Кремль лжет. Тысячи ваших солдат и украинских братьев гибнут на Украине. Узнайте правду в свободном Интернете и в приложении Telegram. Время свергнуть диктатора Путина!\n\nKremlin stick king opposition to war by oppressing \n\nhttps://www.nytimes.com/2022/03/04/world/europe/russia-censorship-media-crackdown.html",
            "title_similarity": "0.7430937",
            "sentiment_compound": -0.8911
        },
        {
            "id": "hzpqvzx",
            "score": 1,
            "text": "This war was happening a long time ago. Weird how all the sudden it’s now relevant.",
            "title_similarity": "0.4572107",
            "sentiment_compound": -0.6808
        },
        {
            "id": "hzps0am",
            "score": 1,
            "text": "1 Tony Stark or IRONMAN could tear up this invasion. Hes not enhanced or super powered...whats the delay? There are definitely super soldier suits out there. I dont know how far they have gotten.",
            "title_similarity": "0.5033157",
            "sentiment_compound": 0.2856
        },
        {
            "id": "hzq7b09",
            "score": 1,
            "text": "We defend Sweden, the country's interests, our freedom and the right to live as we choose.",
            "title_similarity": "0.21383387",
            "sentiment_compound": 0.7351
        },
        {
            "id": "hzr6lzq",
            "score": 1,
            "text": "Nice I’m glad they gathering intelligence.  If only we can take over the Russian silo we\nCan take over their nucular missle supply",
            "title_similarity": "0.5362825",
            "sentiment_compound": 0.836
        },
        {
            "id": "hzrcclt",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.055294536"
        },
        {
            "id": "hztojwc",
            "score": 1,
            "text": "everyone who asks why this is happening. You should watch this 2015 French movie. https://youtu.be/AEOy0eRcJxo",
            "title_similarity": "0.46775588",
            "sentiment_compound": 0.0
        },
        {
            "id": "hzy8fjj",
            "score": 1,
            "text": "https://www.youtube.com/watch?v=f2USarGkg2o",
            "title_similarity": "0.18002664",
            "sentiment_compound": 0.0
        }
    ]
}