{
    "Zelensky says he doesn't want Ukraine's history to be 'a legend about 300 Spartans' and calls for peace\n": [
        {
            "id": "hz7p5dz",
            "score": 6,
            "text": "[deleted]",
            "title_similarity": "0.22408122"
        },
        {
            "id": "hz7zvup",
            "score": 21,
            "text": "This was inevitable when he decided to give his citizens arms and encourage them to fight and die. While I understand the sentiment it was extremely irresponsible. He put targets on his citizens backs instead of calling for a national draft and giving these guys uniforms they blend in with ordinary citizens and makes everyone a target. Gives Russia the legal ability to murder a citizen and claim it's a potential threat. \n\nNow that it's gotten to this point I don't for see Russia conceding and going for simple peace. Sure they're supply lines blow and convoys are being lost but Russia is still gaining control over supply lines to the east of Ukraine. \n\nI'm predicting a split along the river if anything which I'm assuming Russia wanted to begin with.",
            "title_similarity": "0.6542229",
            "sentiment_compound": 0.0525
        },
        {
            "id": "hz82awp",
            "score": -10,
            "text": "Russia is being strangled economically while Ukraine is receiving an endless flow of money, armament, and even manpower in the form of foreign volunteers.\n\nThere is no winning scenario for Russia in this. None.",
            "title_similarity": "0.50300723",
            "sentiment_compound": -0.7412
        },
        {
            "id": "hz7jusp",
            "score": -23,
            "text": "UKRAINE is going to rewrite the script of 300, same movie about fearless warriors who defend there ho.land against all odd, but the ending is a happy one, in which the enemy is driving back to the sea.",
            "title_similarity": "0.5871369",
            "sentiment_compound": 0.1531
        },
        {
            "id": "hz80h0f",
            "score": -12,
            "text": "Dude is a clown. 99% of people who are praising him on reddit act like they know the guy for decades. Meme whores for 5 second sound bites and catchy post titles. He is a leader of a country that made decisions over the years that lead to it being invaded under his term. Pretty much the definition of failing at his job.",
            "title_similarity": "0.38927108",
            "sentiment_compound": 0.2263
        },
        {
            "id": "hz7osn1",
            "score": -22,
            "text": "That's an insult to the Spartans.",
            "title_similarity": "0.4733369",
            "sentiment_compound": -0.5106
        },
        {
            "id": "hz7vx7g",
            "score": 5,
            "text": "Lol is this dude in the fight or not? First he says him and his countrymen is alone in this fight and must carry on said fight, and then says he wants NATO to enforce a no fly zone that would DEFINITELY START WW3, and also complains about how the US and the EU aren’t doing enough even though he’s received massive amounts of military equipment, not to mention worldwide sanctions from most of the western countries and yet he’s still indicating or perhaps more hinting that he wants western countries boots on the ground. Yet again which would start WW3. Lol is he putting on a front or something? Cheesus.",
            "title_similarity": "0.69554603",
            "sentiment_compound": -0.6029
        },
        {
            "id": "hz7w0mf",
            "score": -8,
            "text": "I wish we had a leader like him. I wish Every country had a leader like him",
            "title_similarity": "0.47754362",
            "sentiment_compound": 0.8555
        },
        {
            "id": "hz7qg3i",
            "score": -7,
            "text": "Maybe it is time to stop holding back and invading Russia?",
            "title_similarity": "0.49565396",
            "sentiment_compound": -0.296
        },
        {
            "id": "hz7vp8m",
            "score": 6,
            "text": "Well, I've been monitoring ukrainian forums for a while now. I can confidently say they are only still holding because they still hope for NATO to intervene at some point, so they just have to buy time. Since those hopes are futile, Ukraine is doomed and will eventually fall. Guess they are destined to be Russia's colony forever.\n\nIt was certainly an inspiring tale of bravery and yearning for freedom, but it lacked a happy ending.",
            "title_similarity": "0.62634397",
            "sentiment_compound": 0.926
        },
        {
            "id": "hz86hjq",
            "score": -4,
            "text": "[removed]",
            "title_similarity": "0.20185685"
        },
        {
            "id": "hz82lbq",
            "score": 0,
            "text": "Give this man the Nobel peace prize",
            "title_similarity": "0.38383734",
            "sentiment_compound": 0.7783
        },
        {
            "id": "hz7qk9s",
            "score": -43,
            "text": "[removed]",
            "title_similarity": "0.20185685"
        },
        {
            "id": "hz8izgq",
            "score": -1,
            "text": "Lol this zelensky guys is worse than Trump and the media really got yall sucking his dick. The elites are laughing their asses off at all you sheep. Keep watching CNN",
            "title_similarity": "0.4369349",
            "sentiment_compound": -0.1027
        },
        {
            "id": "hz7ogmq",
            "score": -9,
            "text": "If ever there was a modern day David and Goliath story... this is it. - I'm really in complete support for the \"underdog\" here... underdog is misleading though, because everything Putin lacks in strength, courage and leadership - Zelensky has, and more.\n\nAnd maybe that makes Putin the weakest of all.",
            "title_similarity": "0.56623954",
            "sentiment_compound": 0.5209
        },
        {
            "id": "hz82htx",
            "score": -8,
            "text": "I get the Ukraine support but could any of you white knights in blue and yellow tell me one other war going on right now without googling it.",
            "title_similarity": "0.63406706",
            "sentiment_compound": -0.6705
        },
        {
            "id": "hz80x0f",
            "score": 11,
            "text": "As an American leftist that isn't thirsting over this guy like so many others, I'm seeing him start to strike a different tone. A more compromising one. I think that's a positive sign because it's inevitable that the Ukrainian military and government will be crushed as long as Putin doubles down and refuses to relent. It sucks that this is happening to Ukraine and Putin should have to pay for this war (which he is, by way of the economic isolation of Russia that's occurring). But I think we all want to see the bloodshed end. War is hell.",
            "title_similarity": "0.7045853",
            "sentiment_compound": -0.9489
        },
        {
            "id": "hz89dqz",
            "score": 0,
            "text": "I’m confused, so we don’t want war but he’s basically saying he doesn’t want it to end because he doesn’t want to look weak and surrender?",
            "title_similarity": "0.7098915",
            "sentiment_compound": -0.6973
        },
        {
            "id": "hz8d04i",
            "score": 0,
            "text": "Zelensky is the most noble politician ( probably the only really noble one ) on the planet atm.",
            "title_similarity": "0.3817982",
            "sentiment_compound": 0.764
        },
        {
            "id": "hz8j0pb",
            "score": 0,
            "text": "Please start world war 3, nato dominates in every area of military, putin is only equal in nukes but not dominant, it's like a goose intidating an elefant. He is bluffing with his nukes and will eventually attack europe, ukraine is a very important strategic spot to make that happen. Fuck our politicians, fuck nato, fuck EU. You guys are being played like a fiddle. If zelenksy gets slaughtered I loose all hope in humanity and europe can die for all I care, at that point there is no point in supporting politicians who are sniffing their own farts all day and wait till those assholes burn down our parlament. You won't fix this by waiting either for them to march into our cities or till putin retires and handpicks the next psychopath into power after you let him kill millions and restore the ussr, you only make matters worse.",
            "title_similarity": "0.6632193",
            "sentiment_compound": -0.9833
        },
        {
            "id": "hz7utz7",
            "score": 1,
            "text": "With this much hopium I hope people are prepared when the reality coming that the war is not in ukraine favor anymore, because it'll only hurt us more. \nWithout any direct ground troops military support from the west, i'm afraid it's likely to be so. I do really hope that the ukrainian can crush the russian and win the war, but we need to manage our expectation realistically.",
            "title_similarity": "0.68462145",
            "sentiment_compound": -0.0727
        },
        {
            "id": "hz8pjm9",
            "score": 2,
            "text": "Can we please collectively boycott Coca-cola? They said they are staying in Russia. They have factories there too - blood money they are paying to fund the war!",
            "title_similarity": "0.5510538",
            "sentiment_compound": -0.636
        },
        {
            "id": "hz7jktl",
            "score": 18,
            "text": "Ok, but can he at least get to kick Putin down a giant hole while yelling this. is. for. UKRAINE!!!",
            "title_similarity": "0.44576755",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz81w9d",
            "score": 17,
            "text": "He encouraged people to take up arms and fight.  He wanted to join NATO, disregarding the conditions upon which Ukraine was created, and thought he could joke around about taking on the 2nd strongest military in the world.   The ship's already sailed man.  Best case scenario, Ukraine gets split into west Ukraine and east ukraine with the two lesser republics.",
            "title_similarity": "0.61596",
            "sentiment_compound": 0.8885
        },
        {
            "id": "hz8d9wj",
            "score": 6,
            "text": "As a softcore anarchist, I was supporting him against this brutal invasion. But.. I saw many propaganda shit, racism and lies and fell into a doubt now.\n\nNot sure if a hero or a charlatan he is. It seems like he is 'acting' as a role.\n.\n.\nBeside of that, Putin is an aggressor and criminal.\nAnd I am perfectly sure that Ukrainian people is suffering and it makes everyone inc.me, sad.",
            "title_similarity": "0.53719074",
            "sentiment_compound": -0.9706
        },
        {
            "id": "hz8d18v",
            "score": -4,
            "text": "This mf should have thought about peace earlier. And because of his stupidity both our countries got into bloody sh*t!",
            "title_similarity": "0.6350632",
            "sentiment_compound": -0.3802
        },
        {
            "id": "hz7q4v3",
            "score": 2,
            "text": "To keep up the fight against Russia.. the price of gas,foods will increase higher",
            "title_similarity": "0.3874229",
            "sentiment_compound": -0.0772
        },
        {
            "id": "hz82m2s",
            "score": -7,
            "text": "History has already been written for Ukraine and the Ukrainian people. The most badass, amazing, patriotic, and empathetic people of the world. ZELENSKY is my idol.",
            "title_similarity": "0.40241688",
            "sentiment_compound": 0.8581
        },
        {
            "id": "hz7rf1r",
            "score": -9,
            "text": "This man, his people are heroes.",
            "title_similarity": "0.25347573",
            "sentiment_compound": 0.5106
        },
        {
            "id": "hz8397x",
            "score": 1,
            "text": "That 40 mile convoy is gonna be Ukraine down fall",
            "title_similarity": "0.31849152",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz844td",
            "score": 1,
            "text": "Out of all the wars I've seen my country fight needlessly and stupidly and arrogantly in my lifetime, finally there's a moral reason for us to go to war axe true moral human reason to save people and their land that is literally being taken from them illegally if there was ever a time we should go to war to defend something this is it again I'm not advocating for war but I'm just saying if we went the reasoning would be just",
            "title_similarity": "0.64530516",
            "sentiment_compound": -0.7208
        },
        {
            "id": "hz88130",
            "score": -1,
            "text": "Wow such a hero /s",
            "title_similarity": "0.14190999",
            "sentiment_compound": 0.8126
        },
        {
            "id": "hz8euwo",
            "score": 1,
            "text": "Lets collaborate and bomb the fuck out of Moscow. A tooth for a tooth. Fuck Russia. And Fuck Belarus",
            "title_similarity": "0.4161275",
            "sentiment_compound": -0.9287
        },
        {
            "id": "hz8ghyd",
            "score": -1,
            "text": "Too bad Ukraine the U.S. and NATO need this war to last 10-20 years",
            "title_similarity": "0.5176019",
            "sentiment_compound": -0.8452
        },
        {
            "id": "hz7t1ie",
            "score": 0,
            "text": "I am so conflicted, as to whether the US should get involved. There are so many factors and outcomes that can seriously impact the world.  It sucks!",
            "title_similarity": "0.40828675",
            "sentiment_compound": -0.5411
        },
        {
            "id": "hz7xa9y",
            "score": 0,
            "text": "Slawa Ukraine",
            "title_similarity": "0.1608757",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz84qaf",
            "score": 0,
            "text": "The only reason they lost at Thermopylae is they were betrayed.  The world is with them.",
            "title_similarity": "0.5009436",
            "sentiment_compound": -0.743
        },
        {
            "id": "hz8rp04",
            "score": 0,
            "text": "Peace is what we all want, this people don’t tho. https://youtu.be/fy910FG46C4",
            "title_similarity": "0.5370282",
            "sentiment_compound": 0.5859
        },
        {
            "id": "hz932ui",
            "score": 0,
            "text": "It's a shame that he has to keep saying things like \"I am not a superhero\" and \"this isn't sparta\" just because the west has a nauseating habit of awarding status- and that being more important than true thoughtful analysis.",
            "title_similarity": "0.69297445",
            "sentiment_compound": 0.8425
        },
        {
            "id": "hz82lfw",
            "score": -5,
            "text": "[deleted]",
            "title_similarity": "0.22408122"
        },
        {
            "id": "hz7guqd",
            "score": 13,
            "text": "We can hold these gates",
            "title_similarity": "0.023270868",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz82ps2",
            "score": 1,
            "text": "at this point they should surrender and begin a tight non-violent resistance movement in which all ukrainians were to cooperate against the new government\n\nthat would mean so much less destruction and death. the russians won't be able to arrest every ukranian",
            "title_similarity": "0.73008466",
            "sentiment_compound": -0.866
        },
        {
            "id": "hzajfd7",
            "score": -2,
            "text": "He is cocaine user. Watch his videos.",
            "title_similarity": "0.20038375",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz8eyo4",
            "score": -3,
            "text": "[removed]",
            "title_similarity": "0.20185685"
        },
        {
            "id": "hz81yi7",
            "score": 27,
            "text": "I thought he was winning? Reddit told me so",
            "title_similarity": "0.33072096",
            "sentiment_compound": 0.5267
        },
        {
            "id": "hz7js9h",
            "score": -17,
            "text": "Nah, WE want Ukraine's history to be a legend about 44 million Spartans  \n\nHeroes don't get to choose their call. The call chooses them. Putin has zero intentions of stopping",
            "title_similarity": "0.77524734",
            "sentiment_compound": 0.3818
        },
        {
            "id": "hz7kh1o",
            "score": 10,
            "text": "Pretty sure this guy reads reddit comments.",
            "title_similarity": "0.22346649",
            "sentiment_compound": 0.6705
        },
        {
            "id": "hz7riu5",
            "score": 7,
            "text": "His analogy to 300 is spot on, that's how its going to end for him and his government, they will die and turn into a legend while Biden says a prayer for their soul to reach heaven.",
            "title_similarity": "0.57717294",
            "sentiment_compound": -0.128
        },
        {
            "id": "hz82686",
            "score": -7,
            "text": "If/When Ukraine falls the hope for a unified response from democratic countries will be proven to be a failure. The will of the entire world will not have been a enough to stop a single madmen from slowly murdering millions and taking whatever he wants.\nI have continually seen support for Russians to take to the streets and fight to stop Putin. An act that will almost certainly end in their deaths. I have seen support for Ukrainians to stay and fight Russian forces. An act that could almost certainly lead to their death. Yet the rest of the world sits comfortably unwilling to take the same risk. If we do not act then what does it matter strongmen will take what they want and we will all be slaves to their will. We should be willing to take the same risks we should be willing to fight ourselves not put all our hopes on others. I'm tired of being scared of weak men with big sticks.",
            "title_similarity": "0.704481",
            "sentiment_compound": -0.9323
        },
        {
            "id": "hz7q7dd",
            "score": -5,
            "text": "THIS. IS. UKRAINA!",
            "title_similarity": "0.0037498698",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz81zj1",
            "score": 1,
            "text": "i really like zelensky but whats the end game here. russia wants to topple the government. i think you can give him that and zelensky resigns? im not sure what exactly they want. even if russia takes it over, the people hate russia, and will revolt. just a matter of time. it happened before in 2014",
            "title_similarity": "0.60343623",
            "sentiment_compound": -0.8379
        },
        {
            "id": "hz85up1",
            "score": -1,
            "text": "Peace or not, Spartans you have become either way.\n\nYou have definitely become David in the tale of David vs Goliath.",
            "title_similarity": "0.4852082",
            "sentiment_compound": 0.7351
        },
        {
            "id": "hz88yrb",
            "score": 1,
            "text": "This is not going to end well I believe.\n\nI think think from Putin's point of view he'd rather have his soldiers spent establishing a firebreak against NATO than having Ukraine join NATO and give them a launching off point into Russia.\n\nThis is not a war that is going to end in peace talks, one side will have to eliminate the other.  NATO appears ready to sacrifice Ukraine in order to avoid a conflict with Russia and Putin knows this.  He's been stepping up show of force exercises (hitting random cargo ships, flying planes over NATO countries and neutral countries, etc) as well as issuing rhetoric designed to scare civilians in order to blunt the NATO countries political will for a direct conflict.\n\nThe elites in the NATO countries simply don't care enough about Ukraine, unfortunately.  As much as the common people in the countries want to help this democratic nation out... the elites will drag their feet until it is too late.\n\nIt seems like they're trying to help but it is just a cynical means of indirect warfare with Russia.  The weapon and equipment shipments are simply a cheap way to spend NATO equipment to obtain Russian casualties using Ukrainian forces as proxy.  It allows for the elites of NATO countries to simultaneously damage Russian combat readiness vs NATO, inflict damage economic damage to the Russian elites while appearing that they're following the political will of their population.\n\nI want Ukraine to win, but currently the only thing preventing their immediate destruction is that Putin wants to integrate Ukraine back into Russia.  Civilian casualties will make that more difficult and require more security expenditures in the form of increased police/intelligence presence in Ukraine for the next 25+ years.  \n\nIf it is looking remotely likely that Russia will lose I would imagine he would settle for a pacified puppet state and will be less concerned about civilian casualties.\n\nThe only way this ends in Russia's defeat is by direct NATO intervention for which there is zero political will amongst the elites.",
            "title_similarity": "0.7397789",
            "sentiment_compound": -0.9769
        },
        {
            "id": "hz8f2nz",
            "score": -1,
            "text": "Who cares? He has no choice but to see how it turns out. Like everyone else. What a load of bollocks.",
            "title_similarity": "0.4570353",
            "sentiment_compound": 0.5647
        },
        {
            "id": "hz8je5n",
            "score": 1,
            "text": "Yeah so maybe there should have never been combat in the first place. Seriously.",
            "title_similarity": "0.5730549",
            "sentiment_compound": 0.3687
        },
        {
            "id": "hz8jfgc",
            "score": 1,
            "text": "Ukraine's position is not sustainable. They hold the cities but Russia has full control of the roads, ports, and sky. The Ukrainians can fight as long as they want, but they have no way to transport food and supplies to the cities. They will starve eventually as Russia continues to encircle one city at a time. The war is already lost from a strategic standpoint barring some miraculous counter offensive to secure the roads to the western border so food can come in and be distributed. And even in that scenario Russia will likely just bomb any incoming supply convoys on the roads anyway.",
            "title_similarity": "0.64024734",
            "sentiment_compound": -0.9753
        },
        {
            "id": "hzaq6eu",
            "score": -1,
            "text": "i saw that movie with my gf as a kid and it turned her on so badly she agreed to blow me on the way home. THIS IS SPARTA. lol.",
            "title_similarity": "0.27822357",
            "sentiment_compound": 0.0445
        },
        {
            "id": "hz840go",
            "score": 18,
            "text": "I just don't understand how the world can just sit by and watch this happen.\n\nI understand Russia has nukes.  So I guess now the world has to keep Russia isolated and sanctions imposed until they give up all their nuclear weapons because they clearly can not be trusted.",
            "title_similarity": "0.68937945",
            "sentiment_compound": -0.6546
        },
        {
            "id": "hz8432r",
            "score": 9,
            "text": "He is exactly what the US needs for a president.",
            "title_similarity": "0.3131324",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz7vyn3",
            "score": -5,
            "text": "USA should be helping force that peace if necessary",
            "title_similarity": "0.4024452",
            "sentiment_compound": 0.6908
        },
        {
            "id": "hz7zaus",
            "score": 5,
            "text": "THIS! IS! BAYRAKTAR!!\n\n<boom>\n\nok i'm sorry",
            "title_similarity": "0.17526093",
            "sentiment_compound": 0.471
        },
        {
            "id": "hz85nw2",
            "score": -6,
            "text": "And the Oscar is for...",
            "title_similarity": "0.21209338",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz87lc5",
            "score": -6,
            "text": "Maybe he shouldn't have given citizens AKs then? Or had them make molotovs?\n\nLike idk, maybe turning your entire population into combatants is bad.",
            "title_similarity": "0.64052916",
            "sentiment_compound": -0.4137
        },
        {
            "id": "hz8e1sf",
            "score": -6,
            "text": "[removed]",
            "title_similarity": "0.20185685"
        },
        {
            "id": "hz7zks5",
            "score": -2,
            "text": "We need people like this more than ever. Word.",
            "title_similarity": "0.14509022",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hz826gw",
            "score": -2,
            "text": "Anyone thinking Zelenskyy might pull a Godfather III Lucchesi assassination on Putin?",
            "title_similarity": "0.4677806",
            "sentiment_compound": -0.5994
        },
        {
            "id": "hz86ybv",
            "score": 3,
            "text": "He’s 100% right. All the sanctions in the world won’t stop this genocide. If NATO doesn’t step in, Russia will continue on into Moldova and Romania and wherever else it pleases. \n\nI know intercession would lead to world war. Do we really have a choice, though??",
            "title_similarity": "0.5709386",
            "sentiment_compound": -0.5803
        },
        {
            "id": "hz8ee2z",
            "score": 3,
            "text": "Yeah but how does he feel about black people, Indians, and Muslims?",
            "title_similarity": "0.27834857",
            "sentiment_compound": 0.1531
        },
        {
            "id": "hzaxdh7",
            "score": -3,
            "text": "Then stop talking all your shit or tell your western mouth pieces to shut the fuck up. You are fucking with Putin with Ukrainian blood being shed. The westerner loves how you act like that hero in their fav movie, but this shit is not the movie, and in case you haven’t noticed, these online keyboard jedis are not joining your fucking fight.",
            "title_similarity": "0.6991269",
            "sentiment_compound": -0.8578
        },
        {
            "id": "hz7tqal",
            "score": 9,
            "text": "If he wants peace that badly, then he better be ready to make some concessions at the negotiating table.\n\nI'm under no illusion that Ukraine can win against Russia. Ukraine's going to be smaller by the end of this. It's only a question of how much smaller.",
            "title_similarity": "0.69907737",
            "sentiment_compound": 0.8126
        },
        {
            "id": "hz86009",
            "score": 8,
            "text": "Can we stop riding this guy’s nuts? He stood up for his country, cool. No need to make him into the next King Leonidas.",
            "title_similarity": "0.6831556",
            "sentiment_compound": -0.5267
        },
        {
            "id": "hz7w489",
            "score": -4,
            "text": "USA should be helping force that peace if necessary",
            "title_similarity": "0.4024452",
            "sentiment_compound": 0.6908
        },
        {
            "id": "hz8a8ae",
            "score": -6,
            "text": "Please EU, please NATO, please USA, let's go to war. Ukraine is us.",
            "title_similarity": "0.46972698",
            "sentiment_compound": 0.25
        },
        {
            "id": "hz7rwsz",
            "score": 35,
            "text": "Sparta didn't have the rest of Europe supporting them.\n\nI know the consequences of Europe actually joining in this war but what else? Peace?\n\nFine, Russia can keep invading. Another peace deal? Fine Russia keeps bullying and taking lives and killing civilians.\n\nShall we just give Russia everything they want? Just because they can end the world as we know it. What if it's your country that's next in line?\n\nWouldn't it be easier to announce 1 Trillion $ to the person that kills Putin? Get that filth of this planet.",
            "title_similarity": "0.62423515",
            "sentiment_compound": -0.8648
        },
        {
            "id": "hz7kaml",
            "score": -14,
            "text": "RIP Ukraine.. only way they will find peace is giving up that country to russia",
            "title_similarity": "0.5858556",
            "sentiment_compound": 0.7096
        },
        {
            "id": "hz7qa8r",
            "score": 15,
            "text": "I heard that he can play piano with no hands as well",
            "title_similarity": "0.35182607",
            "sentiment_compound": 0.3182
        },
        {
            "id": "hz7moim",
            "score": -11,
            "text": "Putin wished he was a percent as badass as Xerxes is",
            "title_similarity": "0.5418664",
            "sentiment_compound": 0.34
        },
        {
            "id": "hz7rwci",
            "score": -2,
            "text": "Please for the love of god. I’m not religious lol but i just don’t want people to die. \n\nWhy can’t we all just love each other?",
            "title_similarity": "0.6758472",
            "sentiment_compound": 0.6167
        },
        {
            "id": "hz7zn0u",
            "score": -7,
            "text": " calls for peace...\n\nseems like a mistake - they are winning,  they say  Russians have almost depleted their fuel and food, \n\nand Russian generals will not flatten the cities from the distance  due to big Russian ethnic population",
            "title_similarity": "0.69346845",
            "sentiment_compound": 0.7906
        },
        {
            "id": "hz7j95c",
            "score": 47,
            "text": "Massive balls AND heart that's a rare combination",
            "title_similarity": "0.112007245",
            "sentiment_compound": 0.6369
        },
        {
            "id": "hz866rh",
            "score": 9,
            "text": "HE is the president other presidents should aspire to be. I wish my country had him as president then again im norwegian so we have a king and I like him too",
            "title_similarity": "0.49670854",
            "sentiment_compound": 0.6369
        },
        {
            "id": "hz8060m",
            "score": 0,
            "text": "Yup, basically said stop glorifying war.",
            "title_similarity": "0.60333586",
            "sentiment_compound": -0.4019
        },
        {
            "id": "hz82p91",
            "score": 0,
            "text": "Yeah, it's literally in russias best interest to not stop lmao",
            "title_similarity": "0.50461024",
            "sentiment_compound": 0.7988
        },
        {
            "id": "hz82xoe",
            "score": 3,
            "text": "That’s it…. I’m writing his name on my 2024 US ballot.",
            "title_similarity": "0.31158206",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz8312o",
            "score": 4,
            "text": " Can someone take out Putin???",
            "title_similarity": "0.4138096",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz834ef",
            "score": 0,
            "text": "You could have had all that without all this.",
            "title_similarity": "0.2961346",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz861hi",
            "score": 3,
            "text": "I hate to be that person but I have to be that person, but as a history lover I hate to tell you guys that the Sparta 300 event isn't real. There was a battle but they were in the thousands and were a collection of territories fighting.",
            "title_similarity": "0.62949115",
            "sentiment_compound": -0.8338
        },
        {
            "id": "hz87hgc",
            "score": 0,
            "text": "Movies are not reality. I guess some people will learn this the hard way in the near future.",
            "title_similarity": "0.44837043",
            "sentiment_compound": -0.1027
        },
        {
            "id": "hz88c6p",
            "score": 0,
            "text": "I say it and get down voted. Zelensky says it and gets praise.",
            "title_similarity": "0.3510517",
            "sentiment_compound": 0.5574
        },
        {
            "id": "hz88ut2",
            "score": 0,
            "text": "Don’t worry, no one sees it as such.",
            "title_similarity": "0.39293465",
            "sentiment_compound": -0.6249
        },
        {
            "id": "hz89q1p",
            "score": 0,
            "text": "I would think he is thinking about whether  for Ukraine to become another Afghanistan or not.",
            "title_similarity": "0.48868325",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz8bbhj",
            "score": -5,
            "text": "[removed]",
            "title_similarity": "0.20185685"
        },
        {
            "id": "hz8bjvt",
            "score": 0,
            "text": "If there were 300 Ukrainians at Thermopylae, they would have won.",
            "title_similarity": "0.4715304",
            "sentiment_compound": 0.5719
        },
        {
            "id": "hz8j97g",
            "score": 0,
            "text": "Ohhh I wish I was at the peace talks. I think I know why the [whole war](https://www.youtube.com/watch?v=s062H1xEvuw) started in the first place.",
            "title_similarity": "0.499042",
            "sentiment_compound": 0.7351
        },
        {
            "id": "hz8jq3m",
            "score": 0,
            "text": "Credible source that [Zelensky is finding unorthodox ways to fund the effort](https://www.reddit.com/r/memes/comments/t62h8n/a_credible_anonymous_source_submitted_provided/?utm_source=share&utm_medium=ios_app&utm_name=iossmf)",
            "title_similarity": "0.42628926",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz8pvt9",
            "score": 0,
            "text": "Um…The Battle of Thermopylae absolutely happened and is a historical event:\n\nhttps://www.britannica.com/event/Battle-of-Thermopylae-Greek-history-480-BC\n\nWhile I understand the point he’s trying to make, tales of this battle have reached legendary status presently, but it has always been viewed as an actual event. \n\nI also don’t know if we can truly call Putin a Xerxes.  Maybe a Xerxes-lite or Xerxes-in-training.  Comparing him to such larger than life character in the historical record is a disservice to our ancestors and gives Putin way to much credit.",
            "title_similarity": "0.49175292",
            "sentiment_compound": 0.6858
        },
        {
            "id": "hz8ucue",
            "score": 0,
            "text": "I don’t think you’ve got much of a choice in the matter dude.",
            "title_similarity": "0.4282487",
            "sentiment_compound": 0.0258
        },
        {
            "id": "hz8v5nq",
            "score": 0,
            "text": "The Battle of the Alamo during Texas' war for independence from Mexico lasted thirteen days, from February 23, 1836-March 6, 1836.\n\nYou're telling me that the entire country of Ukraine is less defensible than the Alamo?",
            "title_similarity": "0.4395934",
            "sentiment_compound": -0.7178
        },
        {
            "id": "hz95mhd",
            "score": 0,
            "text": "I’m nervous about if Russia succeeds or fails at this invasion. If they win Ukraine falls, if Russia loses Putin will start a nuclear warfare not just against poor Ukraine but all his enemies. I’m definitely preparing for WW3. It just makes angry that will never know peace with these psychopaths running the world which is robbing us young people of our futures, businesses of prospering and families of safety. Just so depressing.",
            "title_similarity": "0.5754025",
            "sentiment_compound": -0.8604
        },
        {
            "id": "hz9acbn",
            "score": 0,
            "text": "But I thought Ukraine is winning the war, or is that just propaganda ?",
            "title_similarity": "0.5511308",
            "sentiment_compound": -0.5023
        },
        {
            "id": "hz9anh2",
            "score": 0,
            "text": "\r  \nBonjour Mme/Mr\r  \nVous êtes dans un besoin de prêts particuliers pour faire face aux difficultés ou vous sortir de l\\`impasse que provoquent les banques par le rejet de vos dossiers de demande de crédits ou vous êtes fiché en Europe .Vous êtes interdit bancaire et vous n\\`avez pas la faveur des banques,vous avez un projet et besoin de\r  \nfinancement, un mauvais dossier de crédit ou besoin d\\`argent pour payer des factures, fonds à investir sur les entreprises. Alors n\\`hésitez pas à me contacter\r  \nau plus tôt pour en savoir plus sur cette spécial promo",
            "title_similarity": "0.38767654",
            "sentiment_compound": 0.0
        },
        {
            "id": "hzi9u2i",
            "score": 0,
            "text": "Dear President Volodymyr Zelensky, Ukraine\r  \nIt was heart breaking to see Ukraine kids say bye to their fathers who are going to fight with Russia. Are you aware you are being deliberately ill-advised by the NATO for war with Russia in order to sell future Hi-Tech Arms to other countries?! Please see these arms making companies share prices have gone up. This is not the first time wars were being used for making trillions of dollars! Capitalism and Market Economy will remain number one threat to global peace. You can check these prices by yourself! \r  \nLockeed Martin share price on 14 Feb 2022 - $365 gone up 4 March 2022 - $458\r  \nGeneral Dynamics share price on 14 Feb 2022 -$211 gone up 4 March 2022 - $243\r  \nNorthrop Grumman share price on 14 Feb 2022 -$386 gone up 4 March 2022 - $471",
            "title_similarity": "0.6147266",
            "sentiment_compound": 0.8472
        },
        {
            "id": "hzlj8ld",
            "score": 0,
            "text": "Unwilling to compromise before and during a conflict is generally not thought of as wanting peace.  It is best described as a leader that is willing to sacrifice all the welfare/lives of their military (including civilians you arm) to the end.    Either way, not sure why he asks for help after having previously decided the Ukrainian military/civilians were up to the job - whilst he sought Ukraine EU/NATO membership and nukes.   He played with a rattler on behalf of Ukrainians because he personally believed it \"shouldn't bite\" and Ukrainians got bit.",
            "title_similarity": "0.77864623",
            "sentiment_compound": 0.8604
        },
        {
            "id": "hz82r9q",
            "score": 15,
            "text": "I find this level of hero worship very unpleasant.",
            "title_similarity": "0.37818226",
            "sentiment_compound": 0.3415
        },
        {
            "id": "hz7me6b",
            "score": 29,
            "text": "“I come in peace. I didn’t bring artillery. But I’m pleading with you, with tears in my eyes: If you fuck with me, I’ll kill you all.”~ Maddog Mattis",
            "title_similarity": "0.6312232",
            "sentiment_compound": -0.9246
        },
        {
            "id": "hz83ptr",
            "score": 40,
            "text": "With Russia’s economy tanking , how does Putin think he will rebuild Ukraine? With what money ? Much respect to Zelensky . Whether he wins or falls with Ukraine, zelensky will be the Hero ….. Putin on the other hand will be lost to history and will slowly be irrelevant\n\nAnd the ultimate opportunist China is carefully crafting a plan to take advantage of Russia and Ukraine. Will not be surprised if China owns Ukraine and Russia",
            "title_similarity": "0.6724553",
            "sentiment_compound": 0.9286
        },
        {
            "id": "hz7xsqa",
            "score": 5,
            "text": "He really is a good actor.",
            "title_similarity": "0.16414215",
            "sentiment_compound": 0.4877
        },
        {
            "id": "hz835bd",
            "score": 5,
            "text": "To be honest those 300 Spartans are probably the one thing you don't want to be compared to. \n\nWhile it maybe glorified by Hollywood as a David vs Goliath thing.  Sparta was a fascist state which was run by Spartans who raped little kids in training.",
            "title_similarity": "0.5971261",
            "sentiment_compound": -0.4257
        },
        {
            "id": "hz7qt9t",
            "score": 34,
            "text": "He's basically saying don't let us all die before you assholes decide to stop this.",
            "title_similarity": "0.6231017",
            "sentiment_compound": -0.872
        },
        {
            "id": "hz7udw0",
            "score": 13,
            "text": "Got that gamer-chair warmongerers? Nobody wants to go down to the last man, they want to be warm and live to see their families and have their old lives back, not to provide you with stories you think are badass.\n\n“I do not love the bright sword for its sharpness, nor the arrow for its swiftness, nor the warrior for his glory. I love only that which they defend.”\nJRR Tolkien",
            "title_similarity": "0.72795415",
            "sentiment_compound": 0.7598
        },
        {
            "id": "hz7uxmz",
            "score": 1,
            "text": "It's less Spartans more the bully picks on the nerd who has a 12 gauge stashed in his pocket and runs home to mum.",
            "title_similarity": "0.57583046",
            "sentiment_compound": -0.6887
        },
        {
            "id": "hz82ers",
            "score": -1,
            "text": "It may be the only way to get the rest of the world directly involved.  If everyone sees them die in a last stand it will cause a lot of support",
            "title_similarity": "0.49497834",
            "sentiment_compound": -0.296
        },
        {
            "id": "hz82pl0",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.20185685"
        },
        {
            "id": "hz87g2j",
            "score": 1,
            "text": "Finally. It’s time we stopped acting as if constant military aggression both offensively and defensively is the only way to resolve conflict. Because the ONLY way this proceeds under present circumstances is with significant death. Putins war is a resource war. Even if he destroys Ukraine the west must accept his move because they need Russian oil. Or we go to war with Russia which results in a global war which the west would lose if China and North Korea are allied with Russia. \n\nThe only other outcome is a Russian Revolution. If it is a civilian revolution it will most likely fail and most likely it won’t happen at all. The ONLY PATH TO PEACE IS FOR ARMIES TO LAY DOWN THEIR WEAPONS AND REFUSE TO FIGHT NEEDLESSLY FOR THE INTERESTS OF A FEW POWERFUL PEOPLE.",
            "title_similarity": "0.72073495",
            "sentiment_compound": -0.987
        },
        {
            "id": "hz87l2k",
            "score": 1,
            "text": "Ooh, burnnn!\n\nThere's the comedian they voted for.",
            "title_similarity": "0.3309793",
            "sentiment_compound": 0.4389
        },
        {
            "id": "hz88sw7",
            "score": 1,
            "text": "Too late for that haha",
            "title_similarity": "0.28231576",
            "sentiment_compound": 0.4588
        },
        {
            "id": "hz89dsg",
            "score": 1,
            "text": "Too late. Putin will not stop  he will raise Ukrainian towns to the ground. Millions will be expelled to EU then he  will talk peace.",
            "title_similarity": "0.6676045",
            "sentiment_compound": 0.5248
        },
        {
            "id": "hz8bp2d",
            "score": 1,
            "text": "redditors in shambles",
            "title_similarity": "0.2635293",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz8bpbk",
            "score": 1,
            "text": "Rightly so....The West is using Ukraine to settle issues with Russia and vice versa. Don't let Ukraine be Syria, the European proxy war between Russia and USA.",
            "title_similarity": "0.6765548",
            "sentiment_compound": -0.5994
        },
        {
            "id": "hz8e1wv",
            "score": -1,
            "text": "This is insane. I literally just finished watching 300.",
            "title_similarity": "0.38786837",
            "sentiment_compound": -0.4019
        },
        {
            "id": "hz8eeb5",
            "score": 1,
            "text": "Wow and everyone called me a Russian bot for saying this is exactly how this was gonna end. Karabakh 2.0",
            "title_similarity": "0.3994053",
            "sentiment_compound": 0.5859
        },
        {
            "id": "hz8enyu",
            "score": 1,
            "text": "The longer the war goes on, the more likely his army will not want a part of it. They will question why it's taking so long and what exactly is happening. Seeing the pure destruction of the cities in Ukraine will show them what truly is going on.",
            "title_similarity": "0.6641698",
            "sentiment_compound": -0.7115
        },
        {
            "id": "hz8ew8f",
            "score": 1,
            "text": "Wait, didn't Greece win the war?",
            "title_similarity": "0.5218166",
            "sentiment_compound": -0.7889
        },
        {
            "id": "hz8ghpt",
            "score": 1,
            "text": "Ill do you one better: Zelensky is the greatest comedian of human history. Why?Because even a clown is better at leading a country than most of- if not all, the country leaders of the world.\n\nIf you don't know: Zelensky was a comedian before he was the leader of Ukraine.",
            "title_similarity": "0.43794286",
            "sentiment_compound": 0.9081
        },
        {
            "id": "hz8h06j",
            "score": -1,
            "text": "[deleted]",
            "title_similarity": "0.22408122"
        },
        {
            "id": "hz8ipbn",
            "score": 1,
            "text": "Good thinking...why all the posturing until now then? Why did NATO not do more if they were so friggin sure of their intelligence? Why didn't they help Ukraine before the invasion if they were so certain? Why didn't they take up Russia's security proposals and engage positively by engaging all of Europe? Why did they lead Ukraine up the garden path? Why did they encourage Ukrainians to fight?",
            "title_similarity": "0.6661465",
            "sentiment_compound": 0.9666
        },
        {
            "id": "hz8ivni",
            "score": -1,
            "text": "Imagine Donald Trump listening to this press conference.\n\n\"Spartans? They were Romans, yes? What have Romans got to do with this? I'm going to label this guy Lazy Brain Zelensky, or Confused Zelensky.\"\n\nMr. President, Sparta is a city in Greece that...\n\n\"No, Sparticus was a Roman gladiator who fought against the Christians. Don't tell me! I watched the movie. I know Roman history better than anyone. It was a good movie. All the gladiators were jealous of Sparticus and claimed they were Sparticus. Just like Dummy DeSantis and Fat Jersey Chris Christi think they can be Donald stable genius Trump. This Zelensky is so dumb, so Lazy Brain, he couldn't even get a deal done when I phoned him about millions in aid.\"",
            "title_similarity": "0.60056233",
            "sentiment_compound": -0.7611
        },
        {
            "id": "hz8iwg6",
            "score": 1,
            "text": "For the love of God NATO and especially the US DO SOMETHING MORE!",
            "title_similarity": "0.35998246",
            "sentiment_compound": 0.7644
        },
        {
            "id": "hz8kkhz",
            "score": 1,
            "text": "Imagine how that legend of 300 goes if they had the whole world witnessing and cheering them on. While constantly supplied with food and top of the line heat seeking spears. \n\n\nI am sure if they get cut off, it largely ends the same, but the west can actively try to prevent this by establishing things like a no fly zone.",
            "title_similarity": "0.5879359",
            "sentiment_compound": 0.7351
        },
        {
            "id": "hz8kmgq",
            "score": -1,
            "text": "Ukraine doesn't stand a chance, it's only a matter of time before they fall.",
            "title_similarity": "0.5883602",
            "sentiment_compound": -0.163
        },
        {
            "id": "hz8l6gb",
            "score": 1,
            "text": "I am an American and I am trying to help your country and people by volunteering to defend your country and people. I am currently trying to communicate with the Ukrainian embassy in the United States. If anyone knows a direct line of communication please DM me.",
            "title_similarity": "0.53556496",
            "sentiment_compound": 0.7783
        },
        {
            "id": "hz8mhor",
            "score": -1,
            "text": "Putin is not going to pursue peace when he already has his foot at the door. Sadly I Believe Ukraine will fall, and then we’ll see where Putin sets his sights next. We’re at the brink of war.",
            "title_similarity": "0.6609688",
            "sentiment_compound": -0.4939
        },
        {
            "id": "hz8mvei",
            "score": -1,
            "text": "About time",
            "title_similarity": "0.0077067614",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz8oabn",
            "score": 1,
            "text": "This makes me so sad. And makes me sick that we (USA) won’t assist. Or nato. I mean truly assist. Had no problem invading Iraq. Fuck putin",
            "title_similarity": "0.70550853",
            "sentiment_compound": -0.7672
        },
        {
            "id": "hz8riw1",
            "score": -1,
            "text": "This dude is the truth.",
            "title_similarity": "0.18590601",
            "sentiment_compound": 0.3182
        },
        {
            "id": "hz8sllq",
            "score": 1,
            "text": "A one know if there is a “go fund me” where we can hire some mercenaries ?",
            "title_similarity": "0.36448783",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz8tt5a",
            "score": -1,
            "text": "After days of successful defense, it seems Russia's pushing and winning more. Sometimes, you can't win against the bullies. I imagine Putin wouldn't be eager to stop the invasion now. Based on his personality, I think he went into this war with the single goal of forcing Ukraine to surrender no matter what.",
            "title_similarity": "0.6335961",
            "sentiment_compound": -0.5237
        },
        {
            "id": "hz8u0b9",
            "score": -1,
            "text": "if only Zelensky was President of Afghanistan, Yemen, or Somalia the US wouldn't have killed so many innocent ppl",
            "title_similarity": "0.5701103",
            "sentiment_compound": 0.7406
        },
        {
            "id": "hz8uwdu",
            "score": 1,
            "text": "Unfortunately Russia doesn’t want peace",
            "title_similarity": "0.5347919",
            "sentiment_compound": 0.34
        },
        {
            "id": "hz8vxox",
            "score": 1,
            "text": "This should have happened way before. US keeps teasing Ukraine with NATO but has no actual plan on adding them to NATO and just wants to poke at Russia. Meanwhile Russia is pissed off by the teasing of US missiles right off their border and pleas with Ukraine however Ukraine is salty af about Crimea and wants to join NATO. Which is fair, I would wanna join NATO too. And the Crimea thing…. Anyways…. unfortunately for them Russia is their neighbor and they have a large Russian populace so joining NATO is a pipe dream. Ukraine and Russia needed to have talks a long time ago things should have never resulted into a legit war.  Shame on the governments of Ukraine Russia and US. The people don’t want war, the governments do.",
            "title_similarity": "0.7073362",
            "sentiment_compound": -0.962
        },
        {
            "id": "hz9ctiz",
            "score": -1,
            "text": "Can u internet commentator community be quiet and let grown ups deal with this… he is starting to do the right thing",
            "title_similarity": "0.5184691",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz815gq",
            "score": 6,
            "text": "That’s what you get when you elect a comedian. Plenty of natural wit and beautiful acid tongue.",
            "title_similarity": "0.17582697",
            "sentiment_compound": 0.8402
        },
        {
            "id": "hz7sgvl",
            "score": 15,
            "text": "Of course he does. The people saying \"you guys are so badass and will go down in history\" like it is a compliment and they aren't fighting for their lives. These people are so fucking blind and removed it is disgusting.",
            "title_similarity": "0.6331468",
            "sentiment_compound": 0.4862
        },
        {
            "id": "hz7zqvj",
            "score": 13,
            "text": "I can imagine that Hollywood would not care and make that movie in 15 years anyways:\n\nPutin: \"My rockets will block out the sun!\"\n\nZelenskyy: \"Then we will fight in the shade!\"",
            "title_similarity": "0.679145",
            "sentiment_compound": -0.8277
        },
        {
            "id": "hz7t9n0",
            "score": 103,
            "text": "I don’t think having nukes should be a free card to do as you please. I think we should have a law as to where someone threatens nukes the entire world should sanction them. No one should be able to put the world at risk and get away with it. US included.",
            "title_similarity": "0.7155536",
            "sentiment_compound": -0.0772
        },
        {
            "id": "hz7umqi",
            "score": 15,
            "text": "Zelensky and Ukraine are already legendary to me!",
            "title_similarity": "0.2744296",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz865gm",
            "score": 7,
            "text": "Whatever happens, this man is a cut above the rest. \nGreat example to set for other countries.",
            "title_similarity": "0.3254789",
            "sentiment_compound": 0.4588
        },
        {
            "id": "hz7rpin",
            "score": 2,
            "text": "After the war ends he will be like Ciaphas Cain. He is gonna tell us how he was shitting his pants the whole time. Thats true courage. I gotta shield my girlfriend from any intel on this guy",
            "title_similarity": "0.58080816",
            "sentiment_compound": 0.2023
        },
        {
            "id": "hz7ug8a",
            "score": -2,
            "text": "He’s kinda lying but this war needs to end",
            "title_similarity": "0.61572766",
            "sentiment_compound": -0.8128
        },
        {
            "id": "hz7ywrw",
            "score": 2,
            "text": "It's not official Russian policy but both Putin and Lavrov have said they think Ukraine's existence was a mistake and if it was up to them Ukraine should be assimilated into Russia.",
            "title_similarity": "0.6780806",
            "sentiment_compound": -0.4767
        },
        {
            "id": "hz7z565",
            "score": -2,
            "text": "Motherfucker…",
            "title_similarity": "0.18636979",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz7z9mv",
            "score": 2,
            "text": "To late, Zeleonidas",
            "title_similarity": "0.15944348",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz81ots",
            "score": -2,
            "text": "I don't understand why they don't just give the two eastern provinces over to russia and then immediately ask to join nato. Should have done this in the beginning and saved all the heartache.",
            "title_similarity": "0.64477885",
            "sentiment_compound": 0.6124
        },
        {
            "id": "hz83ivs",
            "score": -2,
            "text": "Zelensky should consider the Gandhi route.",
            "title_similarity": "0.3067888",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz84i01",
            "score": 2,
            "text": "Why would he do that if, as the best informed people on the internet (Redditors) assured me, he was winning?",
            "title_similarity": "0.42574793",
            "sentiment_compound": 0.8779
        },
        {
            "id": "hz86qns",
            "score": 2,
            "text": "It's unwanted, I don't hope for this, but there will be a headline soon about Zelensky's death. I'm sure of it. It will be a horrible day.",
            "title_similarity": "0.5435635",
            "sentiment_compound": -0.8835
        },
        {
            "id": "hz8e0qk",
            "score": 2,
            "text": "Well yeah, as noble as the fight is, Ukraine will lose and it will be very costly.\n\nIt’s a shit situation, but that’s been the tale of war and the world since people began invading one another.\n\nUkraine needs to sue for peace, but, the west needs to keep the clamps on Russia. The future conflict with Russia is mostly unavoidable but you can weaken her along the way.\n\nRemove Nukes and Russia is an outdated empire dependent on land wars and can be starved to deaths themselves.\n\nRussia cannot battle across an ocean.",
            "title_similarity": "0.680856",
            "sentiment_compound": -0.9444
        },
        {
            "id": "hz8hd8t",
            "score": -2,
            "text": "Now he's saying that , what happened now, pissed his pants , no no , he had balls of steel right , they fell off ??",
            "title_similarity": "0.43395433",
            "sentiment_compound": -0.5679
        },
        {
            "id": "hz8iu51",
            "score": -2,
            "text": "Imagine Donald Trump listening to this press conference.\n\n\"Spartans? They were Romans, yes? What have Romans got to do with this? I'm going to label this guy Lazy Brain Zelensky, or Confused Zelensky.\"\n\nMr. President, Sparta is a city in Greece that...\n\n\"No, Sparticus was a Roman gladiator who fought against the Christians. Don't tell me! I watched the movie. I know Roman history better than anyone else. It was a good movie. All the gladiators were jealous of Sparticus and claimed they were Sparticus. Just like Dummy DeSantis and Chris Christi think they can be Donald Trump.\"",
            "title_similarity": "0.5995209",
            "sentiment_compound": 0.4082
        },
        {
            "id": "hz8p80n",
            "score": 2,
            "text": "I’m from rus, but against war( You can ask me a questions.",
            "title_similarity": "0.55390334",
            "sentiment_compound": -0.7469
        },
        {
            "id": "hz9s1sp",
            "score": -2,
            "text": "This guy is brilliant. If he’s an actor, he could win Oscar!",
            "title_similarity": "0.3274211",
            "sentiment_compound": 0.8356
        },
        {
            "id": "hzap203",
            "score": -2,
            "text": "azerbaijan was invading Nagorno-Karabakh same way as russia, did zelenskiy support them..? i guess he did, karma is indeed a bitch.",
            "title_similarity": "0.4431116",
            "sentiment_compound": -0.2732
        },
        {
            "id": "hz7mrbd",
            "score": -4,
            "text": "If somebody has a translation of his 300 Jews parody please post it!",
            "title_similarity": "0.4144686",
            "sentiment_compound": 0.3802
        },
        {
            "id": "hz7sdek",
            "score": -3,
            "text": "There is petition to help Ukraine with invasion, please sign it and spread if you can:\n\nhttps://www.change.org/p/boris-johnson-close-the-sky-over-ukraine",
            "title_similarity": "0.44984913",
            "sentiment_compound": 0.6124
        },
        {
            "id": "hz7xg3x",
            "score": -2,
            "text": "Zelensky is a modern-day George Washington.",
            "title_similarity": "0.23140904",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz7ymgt",
            "score": 4,
            "text": "One of the cheesiest things he could say.",
            "title_similarity": "0.14123976",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz7ztlr",
            "score": 3,
            "text": "He has to decide whether to go that route or to sell out his country. \n\nThere is realistically no middle option in the near term.\n\nAnd trust me when I say this, any peace that Russia might agree to now will involve Ukraine being an truncated impoverished buffer state shackled to Russia.",
            "title_similarity": "0.7103026",
            "sentiment_compound": 0.7964
        },
        {
            "id": "hz807ez",
            "score": 3,
            "text": "I dont understand this war, people fighting and dying there for literally nothing, just for Putin wet dreams",
            "title_similarity": "0.5806152",
            "sentiment_compound": -0.6625
        },
        {
            "id": "hz80hwa",
            "score": 4,
            "text": "Too late, he's secured his memory as a legend no matter how this turns out.",
            "title_similarity": "0.39422244",
            "sentiment_compound": 0.3871
        },
        {
            "id": "hz80njh",
            "score": 2,
            "text": "This is important. \n\nSome people might be wondering \"why is Zelensky holding back, and not attacking the Russian columns, which are stuck or stopped.\"\n\nBut Zelensky doesn't want Ukraine to fight to the last man. And if Putin doesn't stop (which seems likely) it's better to have Ukraine surrender, so the Army can fight again later (during the occupation). \n\nHit-and-run tactics are better. Make the Russians fight for every advance.\n\nIt's probably a good idea to have their air-force retreat into a friendly NATO country, rather than have their jet fighters either destroyed or captured.\n\nNor does he want the Russians to have a humiliating withdrawal. Because then Putin just sends in the bombers and just hits them day-and-night without any concern about casualties, then sends in a bigger invasion force.",
            "title_similarity": "0.7472745",
            "sentiment_compound": 0.3519
        },
        {
            "id": "hz81rgv",
            "score": 3,
            "text": "One day I want to meet this person and shake his hand. Hell, I want to hug him right now. Selfishly, I want him to survive all this so that remains possible.",
            "title_similarity": "0.48619255",
            "sentiment_compound": -0.128
        },
        {
            "id": "hz82xxo",
            "score": 4,
            "text": "Zelensky calls for peace instead of this war whilst Putin calls for the glory of this war.",
            "title_similarity": "0.69983757",
            "sentiment_compound": -0.3664
        },
        {
            "id": "hz82zor",
            "score": 4,
            "text": "But can it end with Zelensky kicking Putin into a pit and yelling \"THIS IS KYIV!!!!!'?",
            "title_similarity": "0.41329294",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz83ihh",
            "score": 1,
            "text": "This mother fucker don’t miss..",
            "title_similarity": "0.3056916",
            "sentiment_compound": -0.7096
        },
        {
            "id": "hz83tx6",
            "score": -3,
            "text": "damn i thought they were winning, why they giving up?",
            "title_similarity": "0.44577795",
            "sentiment_compound": 0.4767
        },
        {
            "id": "hz84twy",
            "score": -4,
            "text": "Anyone know the brand of sweater he wears in this pic? It’s fire.",
            "title_similarity": "0.3132167",
            "sentiment_compound": -0.34
        },
        {
            "id": "hz86vsj",
            "score": 5,
            "text": "This man is a cut above the rest. Great example for other countries.",
            "title_similarity": "0.23566812",
            "sentiment_compound": 0.4588
        },
        {
            "id": "hz8936v",
            "score": 2,
            "text": "Politician of the century",
            "title_similarity": "0.20556314",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz8b6k1",
            "score": 3,
            "text": "Really hope there will be peace. They are already shutting off their electricity, heat, and water. In Crimea they also systematically tortured opposition in cruel ways (electroshock, sexual abuse), terrorizing the innocent to scare into submission. It's terrible.\n\nNato should let countries join discretely without Russia knowing.",
            "title_similarity": "0.5939039",
            "sentiment_compound": -0.9119
        },
        {
            "id": "hz8br40",
            "score": 2,
            "text": "I genuinely worry about this man. I know Twitter accounts are not a measure on whether someone is ok or not but it went silent for like 8 hours yesterday and I was so afraid something happened to him. \n\nHe’s so incredibly important. Not just to the people of Ukraine but to the people of the world. I’ve been living in the shadow of Russia since I was a kid. Not exactly afraid but often on edge, wondering what they’re up to. Zelensky for me is the man standing up to the worlds biggest bully and I admire him immensely for this.",
            "title_similarity": "0.5908617",
            "sentiment_compound": 0.701
        },
        {
            "id": "hz8e3sw",
            "score": 3,
            "text": "His tune has changed 🤔",
            "title_similarity": "0.20073608",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz8l60x",
            "score": 2,
            "text": "I believe Zelensky will not be remembered as Leonidas. He will be remembered as Washington.",
            "title_similarity": "0.63910437",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz82xvm",
            "score": 12,
            "text": "If aliens ever come to our planet during our lifetime, I want to elect Zelensky to be our Earth/Human Ambassador.",
            "title_similarity": "0.41933712",
            "sentiment_compound": 0.0772
        },
        {
            "id": "hz9r8dn",
            "score": -13,
            "text": "The problem is that Zelensky has done everything to provoke Russia and Russia's core demands are still not addressed. I see no peace until those are addressed.",
            "title_similarity": "0.5739773",
            "sentiment_compound": -0.8047
        },
        {
            "id": "hz810lk",
            "score": -3,
            "text": "All those lives, i am not pro russ in any way but i sometimes wonder if they should just surrender and live to see another day",
            "title_similarity": "0.63824844",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz83972",
            "score": 4,
            "text": "They don’t need to be compared to some old story, they are forging their own story for the history books right now!",
            "title_similarity": "0.6316241",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz83lnc",
            "score": 3,
            "text": "Haha total shot at Fox News trying to compare them to it.",
            "title_similarity": "0.2621685",
            "sentiment_compound": 0.4588
        },
        {
            "id": "hz8aewn",
            "score": 4,
            "text": "Why can’t America have a leader like this?",
            "title_similarity": "0.46630237",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hz8bzht",
            "score": -3,
            "text": "[deleted]",
            "title_similarity": "0.22408122"
        },
        {
            "id": "hz9l04r",
            "score": -5,
            "text": "Not Bipolar badly badly mold sick from flooding, storms, and aging homes and buildings without the resources to fix it and being 'confined' to them by the pandemic.\n\nI'm zero % kidding. Mold illness disrupts executive brain function causes severe depression anxiety paranoia and makes it very hard to consume complex information.\n\nI learned this by watching it happen to my own family. I watched mold illness turn my father into a conspiracy theory chasing paranoid and depressed person unable to take in the complexity of the world around him. And he was not alone in the town but he lived in which was flooded to the point of being considered a disaster area 3 years before. Mold illness was all over the town.\n\nI have this hypothesis and have been meaning to lay flooding and disaster area data over top of political voting maps of the US. There's so many other confounding factors that would be impossible to say that it's causal but I certainly wonder.",
            "title_similarity": "0.53676623",
            "sentiment_compound": -0.9701
        },
        {
            "id": "hz7xsa6",
            "score": -15,
            "text": "Globalist puppet",
            "title_similarity": "0.056748964",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz7rhv4",
            "score": 46,
            "text": "“… But make no mistake: If the needs of the Ukrainian people are overshadowed by geopolitical concerns… Then we shall fight in the shade!”",
            "title_similarity": "0.5981988",
            "sentiment_compound": -0.2819
        },
        {
            "id": "hz81vpf",
            "score": 4,
            "text": "It's really a case where NATO should be applying to join Ukraine! These people are ossum!",
            "title_similarity": "0.4367544",
            "sentiment_compound": 0.4184
        },
        {
            "id": "hz8o65q",
            "score": -4,
            "text": "What a weird title - last week he call for civilian to arm and all ourt war. Now, he is praise for a man of peace.\n\nHis ability to play both side is only second to Jesus",
            "title_similarity": "0.570673",
            "sentiment_compound": 0.7351
        },
        {
            "id": "hz84jlh",
            "score": 7,
            "text": "Zelensky and the Ukrainians are already living legends.",
            "title_similarity": "0.27017677",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz89brm",
            "score": 6,
            "text": "Alot of people (myself included) were happy and smug about how the war took longer than russia expected. But forget(or havent realized yet) recent seized documents show that its actually still on schedule with plans for it to take upwards of 15 days (or more) rather than 3. Unless there is more direct support from other countries than simply supplying weapons Ukraine will absolutely lose. Their eastern front is already seeing encirclement and alot of these tactics are pretty close to what soviets did to defeat german forces. Shock and awe was never the plan, they want ukraine just intact enough to be worth keeping. Sending their worst first is actually pretty common for them, russian expectation of heavy losses doesnt have as much of a psychological impact as it does with western countries.  \n\nThe writing is on the wall, either WW3 or an evil man shall (again) demonstrate that any nuclear armed country can do whatever they want without worry that other nuclear armed countries can properly retaliate. Expect the same treatment for taiwan.\n\nIt is dumb to think Russia didnt expect and plan for  the mother of all sanctions years ahead of the second invasion, and that putin is simply some crazy idiot as a result. If you dont respect your enemy you will always be surprised by them in the end. \n\nLets see if i did this reddit  bot thing right:\n\n!remind me 12 days status of ukraine after this post.",
            "title_similarity": "0.6978352",
            "sentiment_compound": -0.9706
        },
        {
            "id": "hz8agmg",
            "score": -6,
            "text": "give them eastern ukraine, don’t join EU and tell\nrussia to not invade or get involved in their country anymore done peace",
            "title_similarity": "0.7368589",
            "sentiment_compound": 0.6908
        },
        {
            "id": "hz8py9i",
            "score": -5,
            "text": "Zelensky is a comedian. He loves to tweet, to post, to dramatized. A president must be a politician.",
            "title_similarity": "0.35338974",
            "sentiment_compound": 0.743
        },
        {
            "id": "hz8r8yy",
            "score": -6,
            "text": "this is all interesting, of course it turns out how absolutely your entire Western world has hated us Russians 😂 you are ridiculous, victims of propaganda.  blocked all Russian media why is it? afraid of something?  your nature is to hate in the back.  damn hypocrites!  I say hello to all thinking people in the world. And to all those who build their thoughts based on the words of their TV, me and all my loved ones, we tell you to go fuck yourself 😅",
            "title_similarity": "0.47866046",
            "sentiment_compound": -0.8922
        },
        {
            "id": "hzaehcu",
            "score": -7,
            "text": "So this is the guy who gave weapons to ignorant civilians to go fight a war against professional soldiers who can call in fuel air and heavy equipment when it gets too tough all to preserve the power of a corrupt political elite in a non democracy that censors opposition voices.\n\nThe escalation of casualties outside the military is Zelensky's fault, they're not fighting police, the Russian came in soft now they are going hard.\n\nThe government in Ukraine is pure evil.\n\nIt's trite but the Spartans move where Leonidas asks what is your profession encapsulates it nicely [https://www.youtube.com/watch?v=gI6sARmxEuc](https://www.youtube.com/watch?v=gI6sARmxEuc).",
            "title_similarity": "0.62314",
            "sentiment_compound": -0.7721
        },
        {
            "id": "hz83qty",
            "score": 53,
            "text": "Fuck me man... it’s like... he’s an actual human leading for the pure benefit of the people that entrusted him with that role/privilege. \n\nHe has his finger on the pulse of every living thing under his jurisdiction, invading encroachers and all!",
            "title_similarity": "0.33427376",
            "sentiment_compound": 0.4753
        },
        {
            "id": "hz7ig6p",
            "score": 887,
            "text": "Uh yeah, comparing them to the Spartans is basically saying they are doomed to fall. I wouldn't want this analogy being made either",
            "title_similarity": "0.7372168",
            "sentiment_compound": -0.4976
        },
        {
            "id": "hz80mcc",
            "score": 8,
            "text": "If people have time watch “Winter on Fire” on Netflix. It’s about how Ukrainians fought against the Russian backed government for their freedom in 2014. I don’t think the Ukrainians will give up even if the cities are gone.",
            "title_similarity": "0.5766496",
            "sentiment_compound": 0.4588
        },
        {
            "id": "hz83j68",
            "score": -6,
            "text": "He wants peace so what concessions is he willing to give?",
            "title_similarity": "0.45344812",
            "sentiment_compound": 0.5423
        },
        {
            "id": "hz8g1qm",
            "score": 7,
            "text": "The irony for everyone, is people are literally watching his nation turn to dust.  And we have the power to stop it, but instead we go on social media and fawn on him and his people\n\n“Awe he’s such a great leader!”\n\n“I love the Ukrainian people!”\n\nAll the while in everyone of his messages he’s begging for the praise and clapping to stop, and for actual actions that save his people to begin.\n\nUkrainians are literally the latest reality show.  What a horrible position for him to be in watching the world around him say it’s on his side when he knows they have the power to save his people",
            "title_similarity": "0.51810193",
            "sentiment_compound": 0.9652
        },
        {
            "id": "hz9h7b5",
            "score": -7,
            "text": "How come the Yemen / Saudi  conflict never got this much attention it was much more severe than this!  In December 2020, it reported that the conflict had caused an estimated 233,000 deaths, including 131,000 from indirect causes such as lack of food, health services and infrastructure. Tens of thousands of civilians have been killed or wounded as a direct result of the fighting, including more than 10,000 children.   https://www.bbc.com/news/world-middle-east-29319423",
            "title_similarity": "0.43971556",
            "sentiment_compound": -0.944
        },
        {
            "id": "hz9qjs7",
            "score": -8,
            "text": "Zelensky made zero effort to address the fundamental issues that are provoking the war. Ukraine is cutting off vital supplies to the Crimean peninsula, mostly water. Ukraine is seeking to host advanced offensive weapons and create western bases on their soil. Ukraine is habitually stealing gas and power that transits their soil. but most of all Ukraine is in a good spot to host invasions of Russia because its in flat ground and open on all sides. not much to do about that.",
            "title_similarity": "0.6864912",
            "sentiment_compound": -0.2263
        },
        {
            "id": "hz7vv4r",
            "score": -7,
            "text": "Choose your next words carefully, Mr. Zelensky, for they may be your last",
            "title_similarity": "0.43034363",
            "sentiment_compound": 0.128
        },
        {
            "id": "hz885rg",
            "score": 8,
            "text": "People criticize and joke that he was a comedian, but seriously, comedians are the best, they see the darkness of the world and try to make it humorous. There’s no hunger for power, it’s just about bringing laughter. I know it’s a loose link, but I can see why he’s so human every time he speaks and I bet the deaths of his brothers and sisters actually weigh heavily on him.",
            "title_similarity": "0.49214184",
            "sentiment_compound": 0.9261
        },
        {
            "id": "hz8f57a",
            "score": -9,
            "text": "Who will hold the Ukrainian president accountable for damning his people. He sympathized with the US and wanted to use his peoples land to stage US weaponry. This guy loves the spotlight.",
            "title_similarity": "0.5448688",
            "sentiment_compound": 0.1027
        },
        {
            "id": "hz81gch",
            "score": 10,
            "text": "Sounds like things are pretty dire",
            "title_similarity": "0.17811036",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hz8aaq7",
            "score": 10,
            "text": "\"There is a battle of two wolves inside of all of us.One is evil. It is anger, jealousy, greed, resentment, lies, inferiority, and ego.The other is good. It is joy, peace, love, hope, humility, kindness, empathy, and truth.The wolf that wins? The one you feed.\" - Cherokee Proverb",
            "title_similarity": "0.38925588",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hz81oux",
            "score": 10,
            "text": "Dont be dense, Zelenskyy has been calling for peace the entire time. The only peace that is acceptable is a full Russian withdrawal.",
            "title_similarity": "0.6305979",
            "sentiment_compound": 0.8555
        },
        {
            "id": "hz85jkd",
            "score": 13,
            "text": "Is there any higher award than the Nobel Peace Prize? Cause damn he deserves it!",
            "title_similarity": "0.46925873",
            "sentiment_compound": 0.8356
        },
        {
            "id": "hz7tguk",
            "score": -13,
            "text": "[removed]",
            "title_similarity": "0.20185685"
        },
        {
            "id": "hz822x3",
            "score": 13,
            "text": "Undoubtly a valiant goal from a president who truly looks after his countrymen. But I fear this issue while currently being fought in Ukraine have grown far beyond Ukraine. Russias government has proven to be the real issue.\n\nIt's time for Russia and the west to bury their differences. The people of EU has spoken - it wants to share a union of democracy with the Ukrainian people and obviously also the once proud Russian people. The one treading on our dreams is Vladimir Putin and he is hellbent on his own dream.",
            "title_similarity": "0.6366732",
            "sentiment_compound": 0.7717
        },
        {
            "id": "hz83ejv",
            "score": 14,
            "text": "Putler will gladly sacrifice tens of thousands of his soldiers as long as he can take the victory from the invasion and take the glory himself.\n\nthis is a man that gets orgasm just looking at those russian nukes, as these nukes give him the sense of russian military superiority. his life is all about ego, power, terror, and sinister destruction of basic human rights.",
            "title_similarity": "0.5144185",
            "sentiment_compound": -0.5719
        },
        {
            "id": "hz857cr",
            "score": 12,
            "text": "If someone can arrest Putin and remove him from power - both Russia and Ukraine would have peace.\n\nThis would obviously take all those near Putin to simultaneously go against him together.",
            "title_similarity": "0.61176836",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hz7tjyu",
            "score": -16,
            "text": "Pussy 😂",
            "title_similarity": "0.073220074",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hz8i27s",
            "score": -15,
            "text": "[removed]",
            "title_similarity": "0.20185685"
        },
        {
            "id": "hz7ydbf",
            "score": -18,
            "text": "Zelensky cant even think of comparing himself and his \"army\" to 300 spartans. The Spartans were actually under threat from a foe that legitamently wanted to just overtake the world. Where Zelensky has a country at a very good geographical location that CLEARLY NATO wanted and Russia warned him and NATO that if he joins this will follow up because Russia already has what 3/4 NATO countries bordering with Russia. On top of that they wanted to build a nuclear weapon in Ukraine if they joined NATO, Putin aint stupid. So that comparison is so irrelevant. Especially to a country with 0 history behind its back. Also the 300 Spartans was not a \"legend\" so that further shows how badly educated this man is.",
            "title_similarity": "0.7493697",
            "sentiment_compound": -0.3607
        },
        {
            "id": "hz8l5rq",
            "score": -17,
            "text": "[removed]",
            "title_similarity": "0.20185685"
        },
        {
            "id": "hz86wpj",
            "score": 21,
            "text": "This fucking man. He is the blueprint for what a leader should be. It’s like the first time you see a healthy relationship and you’re like FUCK! Is that what it’s supposed to look like?",
            "title_similarity": "0.46182793",
            "sentiment_compound": 0.6439
        },
        {
            "id": "hz7rkdm",
            "score": 247,
            "text": "It’s one thing to rally the people you represent. But to be able to rally a good portion of the world for your people is impressive, and he can never be denied that",
            "title_similarity": "0.31685263",
            "sentiment_compound": 0.9083
        },
        {
            "id": "hz7pi7b",
            "score": 2644,
            "text": "I mean yeah. Leonidas and his 300 Spartans is an epic story, but they did lose in the end. Obviously Zelenskiy doesn't want that",
            "title_similarity": "0.74853075",
            "sentiment_compound": -0.5078
        },
        {
            "id": "hz8208g",
            "score": 116,
            "text": "Its pretty easy cheering for 300 spartans and heroic deaths as long as you are not one of  them",
            "title_similarity": "0.56010807",
            "sentiment_compound": 0.9186
        },
        {
            "id": "hz82u5e",
            "score": 75,
            "text": "PEACE NOW 🙏 THIS WAR IS STUPID",
            "title_similarity": "0.54922473",
            "sentiment_compound": -0.7537
        },
        {
            "id": "hz81b73",
            "score": 455,
            "text": "In a way, a comedian/actor doing so well in a time of crisis makes sense. A good comedian connects with his audience, which requires empathy. Something the vast majority of politicians *don't* have.",
            "title_similarity": "0.4218491",
            "sentiment_compound": 0.4838
        },
        {
            "id": "hz84zqj",
            "score": 34,
            "text": "If peace talks do come to an agreement, I really hope that the sanctions against Russia don’t stop. Russia needs to pay and the sanctions need to continue until that government is overthrown. Maybe its just hopeful thinking though",
            "title_similarity": "0.59712374",
            "sentiment_compound": 0.8908
        },
        {
            "id": "hz7p9yl",
            "score": 500,
            "text": "I'm so glad he said \"peace\". Now, Mr. Putin. What do you say to the nice man?",
            "title_similarity": "0.4518988",
            "sentiment_compound": 0.8622
        },
        {
            "id": "hz7g2u5",
            "score": 7139,
            "text": "As always this man seems to know exactly what to say to make him sound even more awesome. I wish Ukrainians as much strength as this man's spirit.",
            "title_similarity": "0.37587705",
            "sentiment_compound": 0.9053
        },
        {
            "id": "hz7xs5z",
            "score": 1719,
            "text": "The Macron comment is very concerning: Macron saying the worst is yet to come after speaking with Putin.  I wonder just how far off-his-fucking-rocker Putin had to go to convince Macron of that.\n\nEdit: just saw the article about Macron calling for a meeting...",
            "title_similarity": "0.5871122",
            "sentiment_compound": -0.4767
        },
        {
            "id": "hz7jmr4",
            "score": 3830,
            "text": "I can't imagine that Russia is going to concede. I don't see the peace talks giving anyone what they want. Putin would need to either completely reverse or die. Everything points to him digging in his heels.",
            "title_similarity": "0.7394787",
            "sentiment_compound": -0.6501
        },
        {
            "id": "hz7oc1r",
            "score": 469,
            "text": "A little rain would change a lot in Ukraine.",
            "title_similarity": "0.35987303",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz7zl5z",
            "score": 349,
            "text": "I hope Zelensky survives this mess. He could teach the rest of the world a thing or two.",
            "title_similarity": "0.45474035",
            "sentiment_compound": 0.0065
        },
        {
            "id": "hz7g6ql",
            "score": -90,
            "text": "[deleted]",
            "title_similarity": "0.22408122"
        },
        {
            "id": "hz7smfq",
            "score": 732,
            "text": "Peace talks didn't go well today.  Russia wants a DMZ, the two oblasts to become an independent country and at the high end of negotiations, a fully demilitarized Ukraine.\n\nThe only good that came out of the talks is they agreed that tomorrow certain paths will become humanitarian highways.  But this agreement ends the second any weapons shipments show up on these paths.",
            "title_similarity": "0.7171566",
            "sentiment_compound": 0.7326
        },
        {
            "id": "hz85p98",
            "score": 593,
            "text": "This is disheartening. It seems like Putin is going to fight until he gets what he wants. That said, I hope the sanctions stick and continue to grow until Putin is forced to resign or retire. As well, the rest of Europe needs to be ready for his next move.",
            "title_similarity": "0.58383566",
            "sentiment_compound": -0.2023
        },
        {
            "id": "hz7g7wo",
            "score": 16568,
            "text": "From the article:\n\n> Ukrainian President Volodymyr Zelensky on Thursday said he doesn't want Ukraine's history to be \"a legend about 300 Spartans,\" and called for an end to Russia's ongoing war.\n\n> \"I am so confident with our military and with our people defending our state, because our state is very special and our people are very special,\" Zelensky said. \"I don't want them destroyed, I want them all to remain.\"\n\n> \"I want peace, and I want peace in my country,\" Zelensky said during the press conference. \"We are on our land, we are ready for anything.\"",
            "title_similarity": "0.8113683",
            "sentiment_compound": 0.9571
        },
        {
            "id": "hz7neb1",
            "score": 1,
            "text": "A man doesn’t choose the moment. The moment chooses the man",
            "title_similarity": "0.5185669",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz7ps3f",
            "score": 1,
            "text": "Blagoslovite UKRAINI 🇺🇦 !",
            "title_similarity": "0.1516592",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz7rsyz",
            "score": 1,
            "text": "Of course Zelensky, I get you. \n\n\nLeonidas could only bring 300 soldiers to the front, his politicians were corrupted. \n\n\nYou brought together millions of Ukrainians to stand up for democracy, injustice and a nuclear menace.",
            "title_similarity": "0.5560159",
            "sentiment_compound": -0.7845
        },
        {
            "id": "hz7sb6n",
            "score": 1,
            "text": "[MANOWAR - THE FIGHT FOR FREEDOM](https://www.youtube.com/watch?v=K3HgBcz8Jac)",
            "title_similarity": "0.32801327",
            "sentiment_compound": -0.516
        },
        {
            "id": "hz7sej0",
            "score": 1,
            "text": "You can see his heart breaking over the suffering of his people.",
            "title_similarity": "0.3175643",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hz7u2e5",
            "score": 1,
            "text": "I smell a new Zack Snyder movie",
            "title_similarity": "0.2698164",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz7uo25",
            "score": 2,
            "text": "You don’t see many people living by their beliefs when it becomes difficult.",
            "title_similarity": "0.37083",
            "sentiment_compound": -0.3612
        },
        {
            "id": "hz7vild",
            "score": 6,
            "text": "Spartans got betrayed. Hope it doesn’t happen to him!",
            "title_similarity": "0.71074206",
            "sentiment_compound": -0.3382
        },
        {
            "id": "hz7vsjs",
            "score": 1,
            "text": "Fair enough my guy",
            "title_similarity": "0.1967566",
            "sentiment_compound": 0.3182
        },
        {
            "id": "hz7x5lq",
            "score": 1,
            "text": "How many writers have been commissioned to write this movie before another studio gets to production first?",
            "title_similarity": "0.31176126",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz7y6jh",
            "score": 2,
            "text": "And that… made him the goat.",
            "title_similarity": "0.16885343",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz7zwe8",
            "score": 2,
            "text": "300 woulda held much longer had it not been for the traitorous goatherder Quasimodo guy",
            "title_similarity": "0.5531266",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz7zy4a",
            "score": 3,
            "text": "Volodymyr Zelensky reminds us of who we are. Deceivers are on short notice. Toxic kleptocrats are no match for 50 million (no, more like 8 billion) berszerkers. Welcome to the human race.",
            "title_similarity": "0.5980191",
            "sentiment_compound": 0.5563
        },
        {
            "id": "hz804n7",
            "score": 3,
            "text": "Wasnt the 300 falling the beginning of a massive war?",
            "title_similarity": "0.47262853",
            "sentiment_compound": -0.5355
        },
        {
            "id": "hz80r44",
            "score": 2,
            "text": "That is a politician. A real fucking politician.",
            "title_similarity": "0.24773517",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz80x14",
            "score": 2,
            "text": "Greece. Always the definition of a legend. In almost everything.",
            "title_similarity": "0.24806264",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz81tl1",
            "score": 5,
            "text": "When people look up the phrase \"Rises to the Occasion\", It will just be a picture of Zelensky.",
            "title_similarity": "0.25875962",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz81xqt",
            "score": 2,
            "text": "It’s going to become one if they can manage to hold them off.",
            "title_similarity": "0.24411586",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz824an",
            "score": 2,
            "text": "I think he's already pretty legendary. But yes, happier ending this time",
            "title_similarity": "0.32593656",
            "sentiment_compound": 0.882
        },
        {
            "id": "hz830ow",
            "score": 2,
            "text": "\nHey /u/samplestiltskin_,\n\n\nThis is now the top post on reddit. It will be recorded at /r/topofreddit with all the other top posts.",
            "title_similarity": "0.21844618",
            "sentiment_compound": 0.3818
        },
        {
            "id": "hz8391b",
            "score": 2,
            "text": "The pose he’s pulling in the thumbnail is renaissance as fuck",
            "title_similarity": "0.25547922",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hz83hks",
            "score": 1,
            "text": "This poor man. Why can’t humans just get along",
            "title_similarity": "0.494707",
            "sentiment_compound": -0.4767
        },
        {
            "id": "hz83m9a",
            "score": 2,
            "text": "This feels like a direct response to that one redditor who was saying Ukraine was delivering Sparta-level quotes to be remembered.",
            "title_similarity": "0.44447142",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hz83umg",
            "score": 5,
            "text": "I'm hoping & praying for peace talks with a resolution in the meantime just to get the conflict to end. Then, the world stage could deal with Putin. Tbh idk if our modern world will ever quite be the same as it was before last week tho. Zelenskyy looked so exhausted during his press conference earlier, dude deserves a break.",
            "title_similarity": "0.6731538",
            "sentiment_compound": 0.4327
        },
        {
            "id": "hz84707",
            "score": 1,
            "text": "Zach Snyder puts away his pen about the cyborg president of Ukraine who sacrifices himself against the space zombies....",
            "title_similarity": "0.5126685",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz848dk",
            "score": 2,
            "text": "Yeah the problem is the invading country’s leader does not feel the same.",
            "title_similarity": "0.46151587",
            "sentiment_compound": -0.128
        },
        {
            "id": "hz84cre",
            "score": 3,
            "text": "He really bet on Ukraine being able to fight for their country. That’s not what most leaders would do, they would leave and flee to safety.",
            "title_similarity": "0.68633157",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz84f1l",
            "score": 1,
            "text": "Imagine how tired these people are after 8 days of this. I have to wonder if that was the plan. Go slow and terrorize them over a long period of time. For the first while they prepare and are tough but as they run out of supplies and get bored they may become more interested in just ending it.",
            "title_similarity": "0.48090926",
            "sentiment_compound": -0.3634
        },
        {
            "id": "hz84rvn",
            "score": 3,
            "text": "He is incredibly wise. Very profound",
            "title_similarity": "0.13385421",
            "sentiment_compound": 0.5256
        },
        {
            "id": "hz84yd5",
            "score": 3,
            "text": "They are already a legend, and so is he.",
            "title_similarity": "0.18026005",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz84z5t",
            "score": 6,
            "text": "He wants a better ending for both Russian and Ukraine.",
            "title_similarity": "0.5052896",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hz85btg",
            "score": 1,
            "text": "This isn’t Sparta!!!!!",
            "title_similarity": "0.37785727",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz85bzz",
            "score": 1,
            "text": "Putin doesn't care what he wants.",
            "title_similarity": "0.6078594",
            "sentiment_compound": -0.3875
        },
        {
            "id": "hz85dvj",
            "score": 2,
            "text": "I wish we could do more. I wish nukes weren't the be all end all. When Russia is done invading non NATO countries, they are gonna direct their attention to NATO countries. And he will still have his nukes then, so what do we do then?",
            "title_similarity": "0.5995726",
            "sentiment_compound": 0.6887
        },
        {
            "id": "hz85luj",
            "score": 1,
            "text": "The lockstep reddit posts seemed to be leading to the conclusion that Ukraine was about a week away from repelling the attack.",
            "title_similarity": "0.5034716",
            "sentiment_compound": -0.4767
        },
        {
            "id": "hz85uvy",
            "score": 2,
            "text": "War is bad. Peace is good. tf is wrong with Putie.",
            "title_similarity": "0.44891676",
            "sentiment_compound": -0.6249
        },
        {
            "id": "hz86dvr",
            "score": 1,
            "text": "How much strategic brass reserve does Ukraine have? With all these brass balls, they should have depleted it.",
            "title_similarity": "0.62102646",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz86eg7",
            "score": 1,
            "text": "Za-Ledge-sky - spread the word",
            "title_similarity": "0.046766754",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz86h7j",
            "score": 2,
            "text": "Your lack of faith disturbs me.",
            "title_similarity": "0.4198712",
            "sentiment_compound": -0.34
        },
        {
            "id": "hz86o4w",
            "score": 6,
            "text": "This just means Putin needs more time to get a new strategy in place. It buys him time to regroup and reinforce his military assets. \n\nThe world will someday learn that we have already started WW3 and that nuclear winter is already on the table. The only reason Putin hasn’t used nukes this far is because he believes he can win without them.",
            "title_similarity": "0.6507027",
            "sentiment_compound": 0.6705
        },
        {
            "id": "hz86spg",
            "score": 2,
            "text": "Well duh!",
            "title_similarity": "-0.013773429",
            "sentiment_compound": 0.3382
        },
        {
            "id": "hz86zq7",
            "score": 1,
            "text": "Yeah but does Putin want to be Xerxes and are the Russians willing to support him? That’s the important question.",
            "title_similarity": "0.52971464",
            "sentiment_compound": 0.7783
        },
        {
            "id": "hz871f6",
            "score": 3,
            "text": "World leaders could learn a lot from Zelensky. From now on if there's a war, the leader of the country has to stay and fight like he did.",
            "title_similarity": "0.5084362",
            "sentiment_compound": -0.6124
        },
        {
            "id": "hz871qr",
            "score": 1,
            "text": "How is the guy still going. I get shagged out doing nothing all day. Ukraine will thrive in peace.",
            "title_similarity": "0.5246694",
            "sentiment_compound": 0.5423
        },
        {
            "id": "hz8749x",
            "score": 1,
            "text": "Blessings 🙏🙏",
            "title_similarity": "0.14470677",
            "sentiment_compound": 0.5423
        },
        {
            "id": "hz8757t",
            "score": 1,
            "text": "Thank god",
            "title_similarity": "0.056660652",
            "sentiment_compound": 0.5574
        },
        {
            "id": "hz87apb",
            "score": 1,
            "text": "Man! I made that reference last weekend!",
            "title_similarity": "0.20694208",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz87iq8",
            "score": 1,
            "text": "He's just saying all the right things",
            "title_similarity": "0.18934792",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz87l9n",
            "score": 1,
            "text": "Seems like he knows when to push the gas and pump the breaks. Good on him!",
            "title_similarity": "0.30556357",
            "sentiment_compound": 0.69
        },
        {
            "id": "hz87nup",
            "score": 2,
            "text": "It's too late. He's already a badass LEADER that will be forever remembered no matter the outcome, but I think he's about to kick Putin into the pit shouting SLAVA UKRAINI! He doesn't want to keep killing children defending his home. The blood is on Putin's hands.",
            "title_similarity": "0.621308",
            "sentiment_compound": -0.7942
        },
        {
            "id": "hz87q80",
            "score": 1,
            "text": "The man has led with Chillhill-ian vibes through all of this.",
            "title_similarity": "0.1407994",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz87qdf",
            "score": 1,
            "text": "I’m thinking it’s time UN, US or NATO move in as peacekeepers.  Or even better, let’s put some of that massive military spend to work and wreck Putin’s military capabilities.  See how the russians stack up against non civilians.",
            "title_similarity": "0.571854",
            "sentiment_compound": 0.3818
        },
        {
            "id": "hz87qh1",
            "score": 2,
            "text": "For real. You could have put him into a lineup a few weeks ago & I’d have never been able to pick him out.\n\nToday - I’d put myself through a brick wall for this guy. He stands up for humanity. We need more like him.",
            "title_similarity": "0.61478746",
            "sentiment_compound": 0.4201
        },
        {
            "id": "hz87t85",
            "score": 1,
            "text": "Kinda late for this these guys are already legends.",
            "title_similarity": "0.3369417",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz87unp",
            "score": 1,
            "text": "Its time we recognize that Rhiannas baBy doesn't Have a clue whats happening in Russia and the 500MILLION of EU arms that will make sure she never knows",
            "title_similarity": "0.5690344",
            "sentiment_compound": 0.3182
        },
        {
            "id": "hz87vlk",
            "score": 4,
            "text": "People have a hard time accepting some things he done before becoming the President - and I fully understand their point; but to me he seems like a genuine man who wants his people to be free and live in a free country. All of them are desperate there, to protect themselves, to protect their country, their children, their home - to survive. Bigger side of the world doesn’t understand how serious the situation is or think this doesn’t affect them as people, when in fact - it does.",
            "title_similarity": "0.64061606",
            "sentiment_compound": 0.9528
        },
        {
            "id": "hz87x96",
            "score": 1,
            "text": "This is the first time that social nefarious has documented war like this. Honestly, I've learned more here in reddit than anywhere else!",
            "title_similarity": "0.37571937",
            "sentiment_compound": 0.2244
        },
        {
            "id": "hz87ypl",
            "score": 2,
            "text": "So sad.",
            "title_similarity": "0.18161741",
            "sentiment_compound": -0.5256
        },
        {
            "id": "hz882gz",
            "score": 1,
            "text": "Soon everyone involved will get to work with us.",
            "title_similarity": "0.071917415",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz882w8",
            "score": 1,
            "text": "Transference is a bitch lol 😆",
            "title_similarity": "0.24203122",
            "sentiment_compound": 0.128
        },
        {
            "id": "hz8841l",
            "score": 1,
            "text": "Zelenskys attitude is scaring me a bit. He seems like he’s backed into a corner and panicking. I hope it is t true but you feel the sheer terror in his voice lately.",
            "title_similarity": "0.4103859",
            "sentiment_compound": -0.5927
        },
        {
            "id": "hz888va",
            "score": 1,
            "text": "HUGE MAN CRUSH",
            "title_similarity": "0.21681818",
            "sentiment_compound": 0.1779
        },
        {
            "id": "hz88aai",
            "score": 1,
            "text": "Let me hop in with a spas minis and a scar with $9kvbucks I’ll win imagine 🙄",
            "title_similarity": "0.22665754",
            "sentiment_compound": 0.5859
        },
        {
            "id": "hz88al3",
            "score": 1,
            "text": "form a coalition of the willing and end this war before its too late.",
            "title_similarity": "0.53561133",
            "sentiment_compound": -0.6833
        },
        {
            "id": "hz88gct",
            "score": 2,
            "text": "Russia can't occupy Ukraine, but it can destroy it. He's right to calling for peace as soon as humanly possible.",
            "title_similarity": "0.7180365",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz88pjc",
            "score": 2,
            "text": "Great, now I want Zelensky to throw a spear at putin",
            "title_similarity": "0.30643225",
            "sentiment_compound": 0.6597
        },
        {
            "id": "hz88ru2",
            "score": 1,
            "text": "I wouldn’t trust him for a second. \n\nBut do we know what type of madman he is? He has to be more than a narcissist; is he a megalomaniac? What even is that? What was his childhood like? Who/what formed him into such an evil killing machine?",
            "title_similarity": "0.49448818",
            "sentiment_compound": -0.8948
        },
        {
            "id": "hz88tl8",
            "score": 3,
            "text": "The rest of Europe should send in an air force of \"vacationers\" to enforce a no fly zone.",
            "title_similarity": "0.48649102",
            "sentiment_compound": -0.296
        },
        {
            "id": "hz88vqx",
            "score": 3,
            "text": "300 Spartans with fucking massive balls.\n\nJokes aside, he's 100% right",
            "title_similarity": "0.30265468",
            "sentiment_compound": 0.3102
        },
        {
            "id": "hz88z51",
            "score": 1,
            "text": "Whatever the case, DO NOT let yourself be martyred.  The world does not respect martyrs like it did in the past.  The world clapped for you for 1 minute, knowing full damn well they weren't going to do anything tangible to help you.  And those same assholes are going forget you in even less time than that when you die.  To be honest, the fact you keep fighting back is an inconvenience to the world, because you are soaking up the attention, resources and money they would rather keep to themselves.\n\nAnd if you think that is just leadership thinking that, you would be mistaken.  The overwhelming vast majority of these well wishes from ordinary people are just as fleeting.\n\nUkraine is losing, badly.  It is not so obvious you cannot ignore yet, but when it gets to the point where the news is 100% bad, with no good news in sight, not even a ray of hope, you will lose interest very fast.  Of course you would begin to ignore it, you are guilty of standing by and watching.  You don't want to live with that guilt, so you will look away.",
            "title_similarity": "0.7111261",
            "sentiment_compound": -0.9687
        },
        {
            "id": "hz88z99",
            "score": 1,
            "text": "Baba",
            "title_similarity": "0.02564278",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz89a7c",
            "score": 1,
            "text": "I hate that I'm so pessimistic but I truly hope that he's as good as he makes himself seem to be. I mean, I know no one is perfect but I hope he didn't just seize this as an opportunity to manipulate people to cover any corrupt deeds.\n\nI hope to God I'm completely wrong about that. This dude is a beast.",
            "title_similarity": "0.6231495",
            "sentiment_compound": 0.9674
        },
        {
            "id": "hz89dlb",
            "score": 2,
            "text": "The Spartans eventually defeated the Persians due to the legend of “The 300” or so some historians believe.",
            "title_similarity": "0.52381516",
            "sentiment_compound": -0.4767
        },
        {
            "id": "hz89ldu",
            "score": 1,
            "text": "And that’s exactly how they will be remembered",
            "title_similarity": "0.07525621",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz89mg2",
            "score": 1,
            "text": "i didn't know Business Insider did satire",
            "title_similarity": "0.48315477",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz89mgv",
            "score": 1,
            "text": "Yes, because he realizes that the occident won't ever really help them and because whatever you might argue, Russia has a bigger army than Ukraine's. They will ultimately lost if Russia really release the full force, which they did not for now. And when you consider the fact that he called his people to make guerillas, but the most organised guerillas are nazi ones... it will be even more bloody than today and he's right to want peace and negociate",
            "title_similarity": "0.7235602",
            "sentiment_compound": -0.0841
        },
        {
            "id": "hz89nw3",
            "score": 1,
            "text": "Europe, start to draw your own lines and get involved. Help Zelensky and Ukraine before the Russians obtain air supremacy.",
            "title_similarity": "0.47828025",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hz89o20",
            "score": 1,
            "text": "Hey!  I'm watching this movie right now!",
            "title_similarity": "0.13344231",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz89pb6",
            "score": 2,
            "text": "Imo Putin only attacked Ukraine because of its natural resources. Most of these resources, gas, oil, titanium, coal, lithium can be found in the Donbass and Crimea. If Ukraine would become a Eu member, all these resources would benefit Europe and not Russia. Europe would become less dependent of Russia and the Ukraine could become one of the richest countries. So he will only stop when he gets what he wants.",
            "title_similarity": "0.6172863",
            "sentiment_compound": 0.5719
        },
        {
            "id": "hz89r6f",
            "score": 2,
            "text": "No matter what happens, history will be kind to Ukraine and their fierce resistance.",
            "title_similarity": "0.4842674",
            "sentiment_compound": 0.5149
        },
        {
            "id": "hz89sgs",
            "score": 11,
            "text": "Never forget Russia brought crémation machines.",
            "title_similarity": "0.3298142",
            "sentiment_compound": 0.1695
        },
        {
            "id": "hz89z1o",
            "score": 1,
            "text": "This man is a human fuxking treasure. Role modelling leadership like no one’s business.",
            "title_similarity": "0.43374974",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hz89zwb",
            "score": 2,
            "text": "I think a path to survival is:\n\n1. Survive long enough so that the sanctions start hurting Russia and putting pressure on Putin.\n2. Agree to give up Donetsk and Luhansk. Putin now has an out, and can claim the goal was to get those provinces in question all along, and he can claim victory.\n3. Once cease fire is done and Russian troops withdraws, have an agreement ready to immediately join the EU or NATO, skip the years long application process.",
            "title_similarity": "0.6285486",
            "sentiment_compound": 0.4767
        },
        {
            "id": "hz8a1he",
            "score": 1,
            "text": ".",
            "title_similarity": "-0.050764225",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz8a1w6",
            "score": 1,
            "text": "[deleted]",
            "title_similarity": "0.22408122"
        },
        {
            "id": "hz8a5dx",
            "score": 3,
            "text": "Just as long as he doesn't go near the talks.  Putin would love to slip him some poison.",
            "title_similarity": "0.5816422",
            "sentiment_compound": 0.1779
        },
        {
            "id": "hz8a7ax",
            "score": 1,
            "text": "Putin is holding a gun to the world’s head while we watch another stalingrad, siege of leningrad, srebenica, grozny, Sarajevo, fallujah, and mt sinjar happen in our lifetimes.",
            "title_similarity": "0.31735462",
            "sentiment_compound": -0.34
        },
        {
            "id": "hz8agm5",
            "score": 1,
            "text": "Honestly I should about “300” when Ukraine was holding Russia back",
            "title_similarity": "0.4461191",
            "sentiment_compound": 0.4588
        },
        {
            "id": "hz8ajw6",
            "score": 1,
            "text": "I don't know shit about shit so I can't comment on his actions. War is terrible and I urge everyone to avoid flaming the fires of WW3.\nBut... If I see 1 more nazi flag I swear...",
            "title_similarity": "0.74250877",
            "sentiment_compound": -0.6945
        },
        {
            "id": "hz8ao8q",
            "score": 5,
            "text": "What does it say that a young comedian is 10x the leader of the standard Old Politician usually in these roles",
            "title_similarity": "0.3148599",
            "sentiment_compound": 0.3818
        },
        {
            "id": "hz8aonn",
            "score": 1,
            "text": "I can imagine, considering how it ended for those Spartans. Sure the war was won, but they all lost the battle",
            "title_similarity": "0.5822263",
            "sentiment_compound": -0.7003
        },
        {
            "id": "hz8ap91",
            "score": 2,
            "text": "Bad things happen when good people do nothing",
            "title_similarity": "0.46080357",
            "sentiment_compound": -0.1531
        },
        {
            "id": "hz8aq1g",
            "score": 2,
            "text": "Putin should be hunted down & killed like Sadam Husain, Russian masses should pooled together & kill this. SOB , Putin & his cronies  give peanuts to Russian  masses , Putin  & his buddies  have steak  daily.\nCome on wake up Russian s hunt Putin & eliminate the asshole with his cronies",
            "title_similarity": "0.44510078",
            "sentiment_compound": -0.8972
        },
        {
            "id": "hz8azj1",
            "score": 2,
            "text": "While the 300 spartans thing is cool, people keep forgetting how it ended in reality. That ending is what he is trying to avoid.",
            "title_similarity": "0.7623078",
            "sentiment_compound": 0.0258
        },
        {
            "id": "hz8b2f5",
            "score": 1,
            "text": "22 million Spartans could win WW3.",
            "title_similarity": "0.33279005",
            "sentiment_compound": 0.5859
        },
        {
            "id": "hz8b6zr",
            "score": 2,
            "text": "What's stopping other countries including the US from attacking Belarus now that they are involved?",
            "title_similarity": "0.52444756",
            "sentiment_compound": -0.5574
        },
        {
            "id": "hz8bget",
            "score": 2,
            "text": "All of this horror due to one madman! One. How is this possible? Is the world truly this powerless? This weak? Unforgivable.",
            "title_similarity": "0.44707805",
            "sentiment_compound": -0.8868
        },
        {
            "id": "hz8bie6",
            "score": 1,
            "text": "the smart, and odious choice\n\nBe heroic and resist against all odds\n\nor negotiate with an odious enemy",
            "title_similarity": "0.3964991",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hz8bm1x",
            "score": 2,
            "text": "The cracks in the Ukrainian winning the story are starting to show. It’s a Shame since they won the hearts of the world",
            "title_similarity": "0.47868925",
            "sentiment_compound": 0.8519
        },
        {
            "id": "hz8bnl9",
            "score": 2,
            "text": "This is just so damn awful...Russia isnt going to stop...\n\nWhy is the world like this?? Genocide in Africa, Middle East , China ,and so much more and now Ukraine..\n\nWhy? Whats the fucking point?",
            "title_similarity": "0.5156939",
            "sentiment_compound": -0.2647
        },
        {
            "id": "hz8bnof",
            "score": 1,
            "text": "Waiting for the \"This is Ukraine\" gif with Putin being kicked into a well.",
            "title_similarity": "0.3930224",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hz8bocr",
            "score": 1,
            "text": "Waiting for the \"This is Ukraine\" gif with Putin being kicked into a well.",
            "title_similarity": "0.3930224",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hz8bp4o",
            "score": 1,
            "text": "Masses of the world is just getting  up  with this COVID pandemic  just to get up above water & breathe some dread air SOB PUTIN & his cronies started this war, hunt Putin & kill the SOB  just as we did to Saddam Husain , communism’s  is nice fairy tale",
            "title_similarity": "0.42764476",
            "sentiment_compound": -0.9432
        },
        {
            "id": "hz8bt72",
            "score": 1,
            "text": "Finally",
            "title_similarity": "0.0030527655",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz8bw19",
            "score": 1,
            "text": "More needs to be done. When is enough, enough!",
            "title_similarity": "0.25493827",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz8c3zf",
            "score": 2,
            "text": "In paraphrase: please just get TF out of my country.",
            "title_similarity": "0.48107225",
            "sentiment_compound": 0.3182
        },
        {
            "id": "hz8c6q0",
            "score": 2,
            "text": "I hope he's not surrendering. Just let them roll in then snipe, snipe and snipe.",
            "title_similarity": "0.45968673",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hz8c8sc",
            "score": 2,
            "text": "I'm not Ukrainian, and Russians have never done anything directly to me, but I want to cause extreme harm to Russian soldiers for this man..",
            "title_similarity": "0.6773999",
            "sentiment_compound": -0.6946
        },
        {
            "id": "hz8cdh0",
            "score": 1,
            "text": "This.. Is… UKRAAAAINNEE",
            "title_similarity": "0.029535275",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz8chxa",
            "score": 1,
            "text": "I honestly hate writing like that.\n\nThe Teaser\n\nThe Headline\n\nThe Headline again but slightly diffrent\n\nThe Actual Quote Wich is in the Headline and the Teaser.\n\nSome context we all know, that's why we clicked.\n\nSome useless explanation.\n\n&#x200B;\n\nDuring All that shit I discovered nowoya gaseta from moscor with Translation. Acutally well written articles.",
            "title_similarity": "0.44913188",
            "sentiment_compound": -0.8608
        },
        {
            "id": "hz8ckwp",
            "score": 2,
            "text": "From an actor acting as a president to a president acting as a hero. Respect.",
            "title_similarity": "0.40920776",
            "sentiment_compound": 0.7717
        },
        {
            "id": "hz8cslr",
            "score": 3,
            "text": "God i hope this man survives this and lives on for many years, what a leader! As far as Putin, i hope his death is slow and he is anally raped nonstop by large horses for all of eternity.",
            "title_similarity": "0.42266285",
            "sentiment_compound": -0.4389
        },
        {
            "id": "hz8d6wp",
            "score": 2,
            "text": "Everyone always forgets the 900 Helots (Spartan slaves), 700 Thespians and 400 Thebans.",
            "title_similarity": "0.5122247",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz8dagk",
            "score": 1,
            "text": "I literally made a comparison of the situation to Thermopylae and the 300 spartans the other day…",
            "title_similarity": "0.3383944",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz8dbch",
            "score": 2,
            "text": "Waiting for the conservative media to make fun of him for being \"weak\"",
            "title_similarity": "0.5963553",
            "sentiment_compound": 0.1027
        },
        {
            "id": "hz8dcm5",
            "score": 1,
            "text": "Not sure about Ukraine history (their bravery is insane) \n\nBut russian invasion will definitly part of the simpsons with homer as putin :-)",
            "title_similarity": "0.6511736",
            "sentiment_compound": 0.4057
        },
        {
            "id": "hz8dkb0",
            "score": 1,
            "text": "How is Ukraine using Bitcoin during the war?  \nwe also are seeing the Ukrainian government now using crypto for fundraising.   \n[https://youtu.be/RxEOHn\\_hTpE](https://youtu.be/RxEOHn_hTpE)",
            "title_similarity": "0.46491468",
            "sentiment_compound": -0.5994
        },
        {
            "id": "hz8dtvf",
            "score": 2,
            "text": "This guy doesn't want him and his people to die  and you can tell he's ready to die alongside his people. He won't abandon his people and his country. He just wants help with stopping this war. He wants for countries to really put the pressure on Putin and russia to stop this war without the need to escalate to a WW. Russia has not been 100% excluded from the world and that's the problem.",
            "title_similarity": "0.7313813",
            "sentiment_compound": -0.9558
        },
        {
            "id": "hz8dvb5",
            "score": 2,
            "text": "I said the same thing yesterday.. they are the 300",
            "title_similarity": "0.26913062",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz8dyos",
            "score": 1,
            "text": "We know Zelensky, problem is you are facing a madman and his Persian empire. I believe you wont be the 300 spartans. I believe you will be David giving Goliath a proper beating.",
            "title_similarity": "0.5963768",
            "sentiment_compound": -0.5106
        },
        {
            "id": "hz8e4as",
            "score": 2,
            "text": "Zelensky's legend is being written already. Some quotes from this conflict will be remembered for decades to come and all from Ukrainian citizens and their president.",
            "title_similarity": "0.34679455",
            "sentiment_compound": -0.3869
        },
        {
            "id": "hz8e4zo",
            "score": 1,
            "text": "There is no way that Russia stops until he is gone, either capture, death, or him fleeing the country is the only way Putin is going to stop. The only way it ends in any other way is if Russians end up removing Putin from power, but that seems like it would never happen.",
            "title_similarity": "0.70910877",
            "sentiment_compound": -0.1779
        },
        {
            "id": "hz8e5ve",
            "score": 1,
            "text": "The only outcome Ukraine should have is a full Russian retreat, no exceptions.\n\nAnd Russia owes them compensation for a full rebuild, no exceptions.\n\nAnd Russia owes them so much more.\n\nI like to believe that there is a special place in hell for Putin for eternity.",
            "title_similarity": "0.5517622",
            "sentiment_compound": -0.4062
        },
        {
            "id": "hz8e7gx",
            "score": 1,
            "text": "No ways! They are running out of Babkas for Russian Army. 😿",
            "title_similarity": "0.5829376",
            "sentiment_compound": -0.68
        },
        {
            "id": "hz8ebw0",
            "score": 1,
            "text": "Putin needs to be extracted and tried in the Hague!",
            "title_similarity": "0.37120527",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz8edkb",
            "score": 2,
            "text": "It takes 2 to tango. Zelensky is absolutely right however it would appear Putin isn’t listening. Support ukraine in any and all ways!",
            "title_similarity": "0.5542408",
            "sentiment_compound": 0.4574
        },
        {
            "id": "hz8ehg4",
            "score": 2,
            "text": "If we dont step in soon i can see Putin dropping a nuke just to try and satisfy his crazy evil ego",
            "title_similarity": "0.5508087",
            "sentiment_compound": -0.5859
        },
        {
            "id": "hz8el5k",
            "score": 2,
            "text": "All this breaks my heart so damned much.  An escalated international war would be a horrendous waste of life but damnit, I can't stand to see Ukraine fall, while we all sit around and watch.\n\nI want us to just deploy everything and everyone we can muster to Ukraine",
            "title_similarity": "0.6142875",
            "sentiment_compound": -0.8585
        },
        {
            "id": "hz8esqi",
            "score": 10,
            "text": "If NATO doesn't help to win the war, Ukraine will fail.\nWeapons are not enough. Civilians are dying.",
            "title_similarity": "0.6672261",
            "sentiment_compound": -0.9396
        },
        {
            "id": "hz8etso",
            "score": 1,
            "text": "What is the death count right now?",
            "title_similarity": "0.30807698",
            "sentiment_compound": -0.5994
        },
        {
            "id": "hz8f6ki",
            "score": 1,
            "text": "❤️",
            "title_similarity": "0.006411977",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz8fhjh",
            "score": 2,
            "text": "My favorite thing I’ve seen about Zelensky, “he is the clown who became a leader when leaders became clowns”. Slava Ukraini!",
            "title_similarity": "0.33519575",
            "sentiment_compound": 0.5093
        },
        {
            "id": "hz8fi37",
            "score": 3,
            "text": "Yeah, people alluding to the Ukrainians as the 300 Spartans are forgetting the fact that they all got wiped out.",
            "title_similarity": "0.6416708",
            "sentiment_compound": 0.296
        },
        {
            "id": "hz8fiif",
            "score": 2,
            "text": "Fuck it. Zelensky should march to Moscow. If Putin is going to make shit up about Ukrainian aggression and invade based on nothing, you might as well go all in.",
            "title_similarity": "0.63352203",
            "sentiment_compound": -0.802
        },
        {
            "id": "hz8fut2",
            "score": 3,
            "text": "Must be very frustrating to be a leader of a powerful nation right now. Can’t step in because ww3 but this could be ended with a few morons being replaced in Russia. It’s not like the Russian people are thinking to themselves everyday “damn wouldn’t it be nice if we had Ukraine too”. Ukraine wants nothing but to be left alone and this other asshat thinks he owns Ukraine.",
            "title_similarity": "0.6968505",
            "sentiment_compound": -0.5591
        },
        {
            "id": "hz8g12m",
            "score": 2,
            "text": "Zeldnsky is a hero of the free world and what Putin doesn't relies is there all ready to die for there beliefs ,Ukraine will become the Russian military grave yard .",
            "title_similarity": "0.607837",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hz8g3u8",
            "score": 1,
            "text": "This is what leaders should aspire for.",
            "title_similarity": "0.13925958",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz8gbwz",
            "score": 3,
            "text": "How long has it been since America has had a leader like that? Not in my lifetime and I'm in my 4th decade of existence.",
            "title_similarity": "0.30438375",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hz8gc9p",
            "score": 1,
            "text": "LOL ridiculous",
            "title_similarity": "0.11776242",
            "sentiment_compound": 0.2577
        },
        {
            "id": "hz8gekr",
            "score": 2,
            "text": "This guy is quickly becoming the name in the history books we all had to learn about who went down as a hero and an inspiration. Someone like him doesn’t come along too often in this capacity and context. I’m hoping so much for him and the Ukrainian people to somehow make it out on top. No matter what happens, I’m sure people around the world will remember their bravery forever. 🇺🇦",
            "title_similarity": "0.5772979",
            "sentiment_compound": 0.9554
        },
        {
            "id": "hz8gm4q",
            "score": 2,
            "text": "I can't understand why the whole world isn't deploying troops to stop this",
            "title_similarity": "0.61888313",
            "sentiment_compound": -0.296
        },
        {
            "id": "hz8gm57",
            "score": 1,
            "text": "Keep Slaying you fucking Savage!",
            "title_similarity": "0.27533263",
            "sentiment_compound": -0.5551
        },
        {
            "id": "hz8gr2d",
            "score": 2,
            "text": "What a beautiful human",
            "title_similarity": "0.04562857",
            "sentiment_compound": 0.5994
        },
        {
            "id": "hz8gxw3",
            "score": 1,
            "text": "You have many slaves, Putin, but few warriors. It wont be long before they fear my anti tank and aircraft missiles, more than your gulag.",
            "title_similarity": "0.5508484",
            "sentiment_compound": -0.8047
        },
        {
            "id": "hz8gyhv",
            "score": 1,
            "text": "Gerard Butler is going to play him in the movie of all of this either way.",
            "title_similarity": "0.3004306",
            "sentiment_compound": 0.34
        },
        {
            "id": "hz8gz6z",
            "score": 1,
            "text": "Legend..\n\nThis guy is fcking awesome…\n\nProve me wrong",
            "title_similarity": "0.31678236",
            "sentiment_compound": -0.4767
        },
        {
            "id": "hz8gzhl",
            "score": 3,
            "text": "Considering the 300 Spartans died and the Persians went through and torched Athens, I agree with Volodymyr.",
            "title_similarity": "0.49205357",
            "sentiment_compound": -0.2732
        },
        {
            "id": "hz8h0ku",
            "score": 1,
            "text": "Forget Spartan bravery and the military competence: “Russia was defeated by 300 mothers handing out hot tea and homemade borscht” … imagine the of impact if you could safely set up soup tables along the 40 mile long stalled convoy manned by grandmothers doing the Slavic equivalent of “There there dear, it’s okay. Sit. Eat.” …",
            "title_similarity": "0.4130578",
            "sentiment_compound": 0.6249
        },
        {
            "id": "hz8h3q0",
            "score": 1,
            "text": "I’m pissed that the west is not providing them with more",
            "title_similarity": "0.57134247",
            "sentiment_compound": -0.6369
        },
        {
            "id": "hz8h4dc",
            "score": 1,
            "text": "It's going to be heart breaking if Russia doesn't stop this pointless war because nothing good will come out of this. The world needs Zelensky as a leader, not as a martyr.",
            "title_similarity": "0.7490828",
            "sentiment_compound": -0.0562
        },
        {
            "id": "hz8h5vb",
            "score": 1,
            "text": "[deleted]",
            "title_similarity": "0.22408122"
        },
        {
            "id": "hz8h6b7",
            "score": 1,
            "text": "This is true leadership and respecting him because of it is the only reaction that should be had really.\n\nI can see leaders and ex leaders of the US saying something like this and the *other side* implying it's a sign of weakness or some bull shit.",
            "title_similarity": "0.5349434",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hz8h6bn",
            "score": 1,
            "text": "I hate that feeling. You feel like you're doing something really important and everyone should be behind you but nobody comes and helps, in any meaningful way. It's the shittiest feeling",
            "title_similarity": "0.6010151",
            "sentiment_compound": 0.0507
        },
        {
            "id": "hz8h6xd",
            "score": 1,
            "text": "Dear Ukraine, can we have this man for like 8 years after this whole thing is over with? Thanks. \n\n-An American",
            "title_similarity": "0.5348878",
            "sentiment_compound": 0.7906
        },
        {
            "id": "hz8h8a2",
            "score": 1,
            "text": "Ukraine has some young handsome leader while my country has some old fart who was been in politics long before Putin was even born and has accomplished nothing meaningful in all those decades of service. #TermLimits",
            "title_similarity": "0.5623052",
            "sentiment_compound": 0.6295
        },
        {
            "id": "hz8h8ji",
            "score": 1,
            "text": "We’ll trade Biden for Zelensky plus our next 10 first round draft picks.",
            "title_similarity": "0.32689404",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz8hcda",
            "score": 1,
            "text": "Somebody give this man a Promotion.",
            "title_similarity": "0.25522086",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz8heyx",
            "score": 10,
            "text": "Very unfortunate. There is no peace as long as Putin is alive. If he can’t make Ukrainian as his slave, he will destroy the country. With years of brain wash, probably the culture as well, Putin has lots of fans in China and Russia. Even Hitler was popular in Germany at that time",
            "title_similarity": "0.56394494",
            "sentiment_compound": -0.4841
        },
        {
            "id": "hz8hf2f",
            "score": 1,
            "text": "Zelensky is a prime example of having a young and inspiring leader.",
            "title_similarity": "0.10684832",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hz8hiiz",
            "score": 2,
            "text": "Didn't the 300 Spartans all die?",
            "title_similarity": "0.4580529",
            "sentiment_compound": -0.5994
        },
        {
            "id": "hz8hkym",
            "score": 2,
            "text": "Hate to be that guy but… does anyone really know the deals that were made between Putin & Zelenskyy back in November last year?  Do your own research on that one.",
            "title_similarity": "0.56594974",
            "sentiment_compound": -0.5719
        },
        {
            "id": "hz8hp69",
            "score": 1,
            "text": "He's so glorified",
            "title_similarity": "0.10971327",
            "sentiment_compound": 0.5563
        },
        {
            "id": "hz8hr6e",
            "score": 2,
            "text": "Putin will sacrifice every Russian before he stops. He's lost his mind.",
            "title_similarity": "0.51586276",
            "sentiment_compound": -0.4404
        },
        {
            "id": "hz8huz0",
            "score": 1,
            "text": "Russia should quit now. Their 40 mile convoy ain't going anywhere even after this war.",
            "title_similarity": "0.69904155",
            "sentiment_compound": -0.6833
        },
        {
            "id": "hz8hx9s",
            "score": 1,
            "text": "That’s almost exactly what the internet is making it sound like, sadly",
            "title_similarity": "0.15895773",
            "sentiment_compound": -0.0772
        },
        {
            "id": "hz8i1c3",
            "score": 2,
            "text": "Even with the fear of WW3 that we all keep talking about and fear, I do not see how we can stay on the side line and watch Ukraine fall. This is an unprovoked war, and Russia is being absolutely brutal in their attacks not only on the Ukrainian military, but the civilians as well.",
            "title_similarity": "0.6166873",
            "sentiment_compound": -0.7681
        },
        {
            "id": "hz8i9aa",
            "score": 1,
            "text": "I am Russian and live in Russia. I can say one civilian population is not interested in this war. We are more interested in the consequences and the current economic situation. If you have any questions please ask.",
            "title_similarity": "0.67838013",
            "sentiment_compound": -0.218
        },
        {
            "id": "hz8ibi0",
            "score": 1,
            "text": "Give fighters to Ukraine! The Soviets provided them to the US/NATO/UN enemy in Korean War!",
            "title_similarity": "0.4472369",
            "sentiment_compound": -0.8475
        },
        {
            "id": "hz8ij9a",
            "score": 1,
            "text": "I’m in my 30’s so I hope when I grow up I can be like this man.",
            "title_similarity": "0.38028958",
            "sentiment_compound": 0.6887
        },
        {
            "id": "hz8im55",
            "score": 1,
            "text": "This man seems to have the most common sense.",
            "title_similarity": "0.13543978",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz8ira7",
            "score": 1,
            "text": "This is a man who has his life sorted out. He know what he wants and truly is a great leader of his people..  glory to his name..",
            "title_similarity": "0.27163726",
            "sentiment_compound": 0.8885
        },
        {
            "id": "hz8iujz",
            "score": 1,
            "text": "Keanu… err I mean Zelensky sure is a cool down to earth chap isn’t he? Very relatable.",
            "title_similarity": "0.36839396",
            "sentiment_compound": 0.5574
        },
        {
            "id": "hz8iwzi",
            "score": 1,
            "text": "The United States is supposed to defend the ideals of democratic government. Perhaps if we succeed in protecting Ukraine’s, we can give hope that ours will stay intact.",
            "title_similarity": "0.5543055",
            "sentiment_compound": 0.8885
        },
        {
            "id": "hz8ixf4",
            "score": 1,
            "text": "Isn’t it actual “war” already? What more is needed to be a “declaration of war”? More deaths? I dont get it",
            "title_similarity": "0.48980996",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz8j1oy",
            "score": 4,
            "text": "I still cant fundamentally understand how the world is letting a democrat state be overrun by a Communist Regime, in 2022",
            "title_similarity": "0.6265582",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz8j416",
            "score": 1,
            "text": "That is the biggest fear. What will happen to the memory of these brave patriots when Russia inevitably overwhelms the Ukrainian people? Will they be treated like enemies? Nazis? It's a sad thought that the victor (and the puppet gov they put in place) will twist history in a way that makes these brave fighters look like usurpers and their dreams of democracy look unjust.",
            "title_similarity": "0.56545246",
            "sentiment_compound": -0.212
        },
        {
            "id": "hz8j4is",
            "score": 2,
            "text": "Crazy seeing people ask the US or EU to intervene after years of complaining about the US meddling in other country’s affairs.",
            "title_similarity": "0.5040462",
            "sentiment_compound": -0.4939
        },
        {
            "id": "hz8j5uq",
            "score": 1,
            "text": "especially since those Spartans all died.",
            "title_similarity": "0.43469685",
            "sentiment_compound": -0.5574
        },
        {
            "id": "hz8j8nh",
            "score": 2,
            "text": "It's disgusting to me that the west is letting this all play out. Eastern Europe is already showing dissatisfaction on how the west has been handling this. If Ukraine falls to Russia, the western democracy would be dealt a tremendous blow. Surely they know this and yet they place so much faith on their sanctions. Putin has made it clear that he is going all in. He is banking on the west's inaction. Proving how weak they are to everyone. Next it's going to be China moving towards Taiwan and Russia expands towards Moldova. West is scared to do anything because they are scared of what Putin might do... Are you kidding me... Almost entire globe is against Russia on this and WE are scared????? Diplomacy will never solve this if it is not respected and Putin does not respect diplomacy. Putin has made it clear that he is atleast 2 steps ahead of US/EU and NATO....",
            "title_similarity": "0.6851237",
            "sentiment_compound": -0.9043
        },
        {
            "id": "hz8j9rd",
            "score": 1,
            "text": "We all need to have a hard look at all our current leaders because of this man. The standard has been completely blown through the stratosphere and governments should be very worried about the confidence or should I say lack of from the common people. Revolt, reform, replenish.",
            "title_similarity": "0.4610349",
            "sentiment_compound": -0.2247
        },
        {
            "id": "hz8jb7d",
            "score": 1,
            "text": "Nobody wants to be remembered in the same way as the 300 Spartans. As brave as they were and as valiantly as they taught, they still lost the battle and the war.",
            "title_similarity": "0.70923644",
            "sentiment_compound": -0.6597
        },
        {
            "id": "hz8jb8y",
            "score": 1,
            "text": "Damn wish Trudeau and Biden were more like this guy.",
            "title_similarity": "0.45399284",
            "sentiment_compound": 0.4201
        },
        {
            "id": "hz8jf7c",
            "score": 1,
            "text": "God I fucking love this guy. \n\nIn a perfect world he’d replace Putin",
            "title_similarity": "0.40481296",
            "sentiment_compound": 0.8832
        },
        {
            "id": "hz8jga8",
            "score": 1,
            "text": "It’s kinda cool to be living during a time where there is a leader worthy of being on a countries money.\n\nThis dude is going to be on their dollar bill someday.",
            "title_similarity": "0.33663997",
            "sentiment_compound": 0.6003
        },
        {
            "id": "hz8jhud",
            "score": 1,
            "text": "This war, Trump, covid, Afghanistan, and the crazy super racism. All to weird for me and I just can't believe all this isn't some rich people bullshit. Covid might have been legit and not purposely released but the rest is too fishy. Something is going on much deeper. Whether they are sick of people getting upset with them, or they are battling each other, or something. I just don't buy trump/putin/wealthy not doing crazy stuff and putting all of us on the line. I don't like it.",
            "title_similarity": "0.6568603",
            "sentiment_compound": -0.9557
        },
        {
            "id": "hz8jjqh",
            "score": 1,
            "text": "Is there a way to buy them more Bayraktar?",
            "title_similarity": "0.33734256",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz8jknm",
            "score": 2,
            "text": "It’s pretty clear there will only be peace when Russia conquers Ukraine... \n\nAsking Putin to stop invading is basically asking billionaires to pay their fair share of taxes and stop exploiting front line workers (which we all know they won’t). \n\nThe people that suffer are the day-to-day citizens in both sides of the border. And they have no influence to go back to normal lives as this rages on (and probably living in the aftermath).",
            "title_similarity": "0.7328193",
            "sentiment_compound": -0.4981
        },
        {
            "id": "hz8joaj",
            "score": 2,
            "text": "Defenders Of Truth Requested\n\nReddit, r/InternetWarfare is asking for your help and support in this bold initiative to take the fight to the Fascists\n\nHead to r/InternetWarfare and get briefed on how we can take the fight to the lies and misinformation spread by Russian Trolls and Bots.\n\nThis is more than a request, it’s a call to arms to cleanse this platform and many others of Russian Bots for good.\n\nThey are not at our doorstep, they are in our house.\n\n100+ Members in less than 24 hours.\n\n[This](https://www.reddit.com/r/InternetWarfare/comments/t60c9z/rinternetwarfare_briefing_room_3322/) is what r/InternetWarfare is about.\n\nHope to see you there, Слава Україні 🇺🇦\n\n-Members of r/InternetWarfare\n\nPlease spread the word.",
            "title_similarity": "0.52192134",
            "sentiment_compound": 0.765
        },
        {
            "id": "hz8jvsn",
            "score": 1,
            "text": "What would it take for Putin to retreat and come to a peaceful resolution?",
            "title_similarity": "0.6033313",
            "sentiment_compound": 0.6124
        },
        {
            "id": "hz8k0ke",
            "score": 2,
            "text": "I like how is defining what being a leader means, it's not the guy that says \"let's die in the battlefield with honor to the last blood drop hurr durr\", it's the one that says \"let's give them hell while I convince them to fucking stop this madness\"",
            "title_similarity": "0.653468",
            "sentiment_compound": -0.9135
        },
        {
            "id": "hz8k29e",
            "score": 2,
            "text": "If Ukraine falls we will see WW3. Russia will pick countries off one by one while destabilizing the UK and US governments.",
            "title_similarity": "0.43308735",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz8k2pd",
            "score": 1,
            "text": "That is currently my concern.",
            "title_similarity": "0.090392634",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz8k752",
            "score": 3,
            "text": "BUUUUT NOOOOO! West was so ready to fight to last Ukrainian!!111",
            "title_similarity": "0.46598822",
            "sentiment_compound": 0.3079
        },
        {
            "id": "hz8kosi",
            "score": 3,
            "text": "Putin doesn’t care whether he rules Ukrainians. He wants the land they’re sitting on. They’re in his way, and if he has to kill them or force them out, he will. That’s the enemy Ukraine is facing.",
            "title_similarity": "0.7040905",
            "sentiment_compound": -0.7184
        },
        {
            "id": "hz8ktny",
            "score": 1,
            "text": "Here's hoping he gets his wish and his people get a well deserved rest.",
            "title_similarity": "0.42079756",
            "sentiment_compound": 0.765
        },
        {
            "id": "hz8m5rz",
            "score": 1,
            "text": "Wouldn’t it be awesome if Ukraine went on the offensive and at least blew up Putin’s mansion?",
            "title_similarity": "0.4226867",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hz8n1ii",
            "score": 3,
            "text": "I’ve grown to admire Zelensky because of this whole situation. He’s the only leader I’d want if my country came under attack. It sucks watching him plead for assistance everyday while still standing strong. And not much can be done unless WW3 breaks out. And he understands that. But fuck man. I really feel for this guy and the Ukrainian people. Stand firm Ukraine!",
            "title_similarity": "0.59044117",
            "sentiment_compound": -0.6696
        },
        {
            "id": "hz8n6vj",
            "score": 2,
            "text": "Anyone really interested about the history of Ukraine should watch the documentary Ukraine on fire by Oliver stone",
            "title_similarity": "0.5171132",
            "sentiment_compound": 0.1513
        },
        {
            "id": "hz8piwk",
            "score": 2,
            "text": "Damn, if it wasn't for nukes the rest of us could just push Russia out of Ukraine easily.",
            "title_similarity": "0.51434165",
            "sentiment_compound": -0.0772
        },
        {
            "id": "hz8px7i",
            "score": 1,
            "text": "👌",
            "title_similarity": "0.006411977",
            "sentiment_compound": 0.7297
        },
        {
            "id": "hz8q852",
            "score": 2,
            "text": "Nice invitation for all nations to get involved.",
            "title_similarity": "0.07458718",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hz8r00g",
            "score": 4,
            "text": "This is the prime example of why we need to get career politicians the fuck out everywhere. This dude is a true leader. I hope the conflict comes to an end soon.",
            "title_similarity": "0.5198384",
            "sentiment_compound": -0.0258
        },
        {
            "id": "hz8rtyi",
            "score": 2,
            "text": "Slava Ukraini!",
            "title_similarity": "0.14947417",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz8squk",
            "score": 2,
            "text": "with all madness going on for days i am happy to hear this words. Going against full out on Russia can be good for most states but people of Ukrain needs peace more then anyone. While other states are seizing Russian yachts, arts etc. Ukranian people are getting Russian bombs instead. States can say \"Russia should be stopped\" but the expense should not be the lives of Ukranian people.",
            "title_similarity": "0.62146395",
            "sentiment_compound": 0.6956
        },
        {
            "id": "hz8t17b",
            "score": 2,
            "text": "Why do I keep seeing his name spelled wrong in articles? It’s Zelenskyy. Why do they not put the extra y?",
            "title_similarity": "0.5369019",
            "sentiment_compound": -0.5362
        },
        {
            "id": "hz8ue1g",
            "score": 1,
            "text": "The Spartans probably didn't wanna become a legend. We do not get to choose the time in which we live, only what we do with the time that is given to us. While my heart goes out to Ukraine, they need to stand up to putin, no one else will do it for them.",
            "title_similarity": "0.77386665",
            "sentiment_compound": 0.4588
        },
        {
            "id": "hz8uqwc",
            "score": 2,
            "text": "Fake tough guy bullies only understand one language.",
            "title_similarity": "0.46677855",
            "sentiment_compound": -0.5574
        },
        {
            "id": "hz8vt3x",
            "score": 1,
            "text": "I thought they were winning",
            "title_similarity": "0.18391095",
            "sentiment_compound": 0.5267
        },
        {
            "id": "hz8vwzl",
            "score": 1,
            "text": "While Zelensky obviously cant say it there are pretty much only two options this war ends, either Putin dies/loses control or he wins this war. I see no way that Ukraine in any way will win this war if Putin stays in Power/alive (and NATO will 100% not intervene with military action).",
            "title_similarity": "0.75827706",
            "sentiment_compound": -0.7488
        },
        {
            "id": "hz8w0d2",
            "score": 1,
            "text": "Those 300 Spartans died, I believe is his point",
            "title_similarity": "0.48868608",
            "sentiment_compound": -0.5574
        },
        {
            "id": "hz8w54f",
            "score": 1,
            "text": "The Russians want the civilians out of the cities so they can sit back and level cities with artillery",
            "title_similarity": "0.6034543",
            "sentiment_compound": 0.0772
        },
        {
            "id": "hz8wv3q",
            "score": 1,
            "text": "Honestly, probably best case for him overall is \"let's just go back where it was February 20. Donetsk/Luhansk get autonomy/federal status within Ukraine. Crimea goes to Russia since they already had it.\"",
            "title_similarity": "0.46203732",
            "sentiment_compound": 0.802
        },
        {
            "id": "hz8x7lr",
            "score": 2,
            "text": "President Biden said NO! \n\nOnly NATO Allies during his state of the union, \n\nGiving green light for Putin to take Ukraine, nothing can be changed. His army will not be stopped by any power in the world. Biden made that clear\nUSA will not intervene anymore, Ukraine good 👍 luck",
            "title_similarity": "0.72883785",
            "sentiment_compound": 0.897
        },
        {
            "id": "hz8xuyf",
            "score": 2,
            "text": "I'm ashamed of my country (USA) and the world. The one war worth fighting and we choose to sit by and let innocent people get slaughtered and let a madman run wild. And I say all this as an Afghanistan vet, not that it should matter at all. Wtf is the point of this life if we allow stuff like this to happen?",
            "title_similarity": "0.63983357",
            "sentiment_compound": -0.7579
        },
        {
            "id": "hz8xwfh",
            "score": 1,
            "text": "Someday in retirement I want to run a small business to keep busy.  Maybe a bar, or a small shop.  Doesn’t really matter.  But I can tell you one thing Ukrainian citizens will never pay for a thing.  All of Ukraine is heroes and we all owe them so much.  They are doing what nobody could…not the US, not Reagan, not Europe could do, which is cripple the “might” of Russia.  President Z and the fierce Ukrainian nation when confronted by the bully, punched him in the nose.  Hard.  And kept punching.  We owe them, we cannot allow their extinction.  World leaders keep stepping up your game, do more everyday to end this war and send Russia home for good where they belong.  We all owe Ukraine, I will never forget.  Slava Ukraini! 🇺🇦",
            "title_similarity": "0.6611515",
            "sentiment_compound": -0.6946
        },
        {
            "id": "hz8z57v",
            "score": 1,
            "text": "Xerses enters the chat",
            "title_similarity": "0.0001467648",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz8zo04",
            "score": 1,
            "text": "This is exactly how I’ve felt about this. It feels very 300.\nI’m fucking rooting for Ukraine. Those people are some of the most heroic on our planet right now. \n\nWhen we all ask ourselves, what would you do in this situation, I really hope that we have the fire that the Ukrainians have.",
            "title_similarity": "0.49641615",
            "sentiment_compound": 0.6894
        },
        {
            "id": "hz90ib1",
            "score": 1,
            "text": "I think by this point the best we can hope for is that Ukraine gives up Crimea and the east and they get to keep their country.",
            "title_similarity": "0.6183498",
            "sentiment_compound": 0.7964
        },
        {
            "id": "hz91art",
            "score": 3,
            "text": "Remember that bully in school who wouldn’t leave you alone even though you begged them to stop? To stop threatening you. To stop harassing you. To stop hitting you. To stop instigating others to hit you or jump you. \n\nRemember telling the adults that you were being bullied and being told to keep your head down or fight back? \n\nThat’s Russia… Russia is the school yard bully of the world.",
            "title_similarity": "0.57843566",
            "sentiment_compound": -0.9842
        },
        {
            "id": "hz91mho",
            "score": 3,
            "text": "Damn, Zelensky is sure the Ukranians can make this go on for years even without any Western help, but he doesn't want to lose the lives of any more of his men fighting for Ukraine.\n\nHe doesn't want them to die, and knows every day that passes by more heroes fighting against the 2nd largest firepower on this planet will die for Ukraine.\n\nHe knows they can defend forever until Russia's economy is flushed in the toilet but doesn't want his people to suffer, for the Russian people to suffer.\n\nThis has never even been done before in any war time History, the leader of a people calling for it to end & for peace purely to spare the lives of more of his citizens.",
            "title_similarity": "0.7108414",
            "sentiment_compound": -0.9771
        },
        {
            "id": "hz91uil",
            "score": 1,
            "text": "Everyone is worried about WW3. Is it better to have a putin going around takng countries but holding the threat of nuclear war over the world's head to not intervene? When is enough enough? The Ukranian armed forces are doing an amazing job right now. Imagine NATO forces combined attacking? It would decimate Russian military forces. If putin wants to launch nuclear weapons you have to think his generals and other will take him out because they know they are going to be wiped out in retaliation. If not when do you stand up to a bully, dictator and sociopath? Just give him what he wants and hope he goes away or doesn't take your stuff?",
            "title_similarity": "0.5936324",
            "sentiment_compound": -0.9399
        },
        {
            "id": "hz9342d",
            "score": 1,
            "text": "Bayraktar",
            "title_similarity": "-0.008498093",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz93yn7",
            "score": 1,
            "text": "Slava Braco!\nSmrt Fazismu! Sloboda Narodu!",
            "title_similarity": "0.22001925",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz93ywl",
            "score": 1,
            "text": "I understand why NATO  won't allow Ukraine to join Nato but are there any loopholes they can use to send more help than just weapons ?.",
            "title_similarity": "0.7497968",
            "sentiment_compound": 0.1044
        },
        {
            "id": "hz960q0",
            "score": 2,
            "text": "That’s an incredibly sensible position given I don’t see many situations where annihilation is the best option when there are alternatives available to you.",
            "title_similarity": "0.54787177",
            "sentiment_compound": 0.6369
        },
        {
            "id": "hz969nh",
            "score": 1,
            "text": "It wasn’t even 300 Spartans. More like 3000. Not to mention that Athens was also in play.",
            "title_similarity": "0.49795508",
            "sentiment_compound": 0.6361
        },
        {
            "id": "hz98yif",
            "score": 1,
            "text": "https://youtu.be/KBRwmTVVKQk",
            "title_similarity": "0.0886962",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz99n3r",
            "score": 1,
            "text": "Since they are applying for EU membership, doesn’t that mean as soon as they approve troops go in?\n\nZ didn’t want too many foreign boots at the onset. If this is a reverse, what is nato willing to do?",
            "title_similarity": "0.61867857",
            "sentiment_compound": 0.168
        },
        {
            "id": "hz9aak6",
            "score": 2,
            "text": "They are already the spartans of today. At least in my heart, in that they stood up and are fighting with bravery. I admire the Ukrainian incredibly. But I understand that the people the families the children need to be protected above all else.",
            "title_similarity": "0.47364014",
            "sentiment_compound": 0.8338
        },
        {
            "id": "hz9emmj",
            "score": 2,
            "text": "Good analogy. I’ve often thought of the people of Ukraine in that context.",
            "title_similarity": "0.16275449",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hz9fs09",
            "score": 1,
            "text": "You need people to be alive in order for a legend to exist",
            "title_similarity": "0.29658464",
            "sentiment_compound": 0.3818
        },
        {
            "id": "hz9g8lv",
            "score": 1,
            "text": "The Greeks won that war",
            "title_similarity": "0.3129422",
            "sentiment_compound": -0.0516
        },
        {
            "id": "hz9h8y1",
            "score": 4,
            "text": "I’ve been thinking about this a lot. I’d rather hear that Ukraine is safe and the fighting is over than have to hear about how bravely they resisted until eventually being squashed as Ukraine becomes a Russian annex",
            "title_similarity": "0.66861284",
            "sentiment_compound": 0.5719
        },
        {
            "id": "hz9lcd9",
            "score": 5,
            "text": "I think he's done a perfect job tbh, or at least the best he can.\n\nI don't think peace will ever happen, but still, if I were a Ukrainian I would be proud of him.",
            "title_similarity": "0.60415745",
            "sentiment_compound": 0.8006
        },
        {
            "id": "hz9o2ol",
            "score": 1,
            "text": "A university history teacher here said on the radio it's not a question if he's going to win or not but rather when. Most likely will be just like what they did to Georgia.",
            "title_similarity": "0.59432775",
            "sentiment_compound": 0.6858
        },
        {
            "id": "hz9ouco",
            "score": 1,
            "text": "Yeah the rest of us don't either because the next battle was basically a world war.",
            "title_similarity": "0.575968",
            "sentiment_compound": -0.6486
        },
        {
            "id": "hz9quj2",
            "score": 1,
            "text": "It is big power game.",
            "title_similarity": "0.08937684",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz9qy6z",
            "score": 1,
            "text": "he's just fishing for photoshops of himself as Leonidas",
            "title_similarity": "0.43549538",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz9vzy2",
            "score": 3,
            "text": "he is an incredible leader",
            "title_similarity": "0.082144156",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz9wjby",
            "score": 3,
            "text": "This guy is next level human being.",
            "title_similarity": "0.07150151",
            "sentiment_compound": 0.0
        },
        {
            "id": "hzaarav",
            "score": 1,
            "text": "We must protect this man at all costs!",
            "title_similarity": "0.31574228",
            "sentiment_compound": 0.4389
        },
        {
            "id": "hzafbi9",
            "score": 2,
            "text": "If zelensky dies because of russian actions, i think that could be the balkan powder keg that ignites WW3 . All I can imagine is the beautiful martyr this great leader would become and how it would incite the wests passions and Ukrainian citizens even further.",
            "title_similarity": "0.5224279",
            "sentiment_compound": 0.9042
        },
        {
            "id": "hzahqv1",
            "score": 1,
            "text": "Putin attacking the powerplant is him signalling that there is no line he is not willing to cross to obtain his goals.\n\nWhy?\n\nhttps://youtu.be/If61baWF4GE",
            "title_similarity": "0.6822408",
            "sentiment_compound": -0.6369
        },
        {
            "id": "hzb56r1",
            "score": 1,
            "text": "This man is the real life John Connor",
            "title_similarity": "0.29329678",
            "sentiment_compound": 0.0
        },
        {
            "id": "hzbgh0y",
            "score": 2,
            "text": "This guy is already a fucking legend. So much respect for Zelenskyy. Slava Ukraini!",
            "title_similarity": "0.3601839",
            "sentiment_compound": 0.5676
        },
        {
            "id": "i064uge",
            "score": 1,
            "text": "How about The 14 th Waffen SS Division, during WWII, staffed by Ukrainians? Or the fact Ukraine sided with Nazi Germany and assisted in the Holocaust killing hundreds of thousands of Jews, etc? How about the former prisoners stating the Ukrainian Guards were the most brutal? How about fighting against the Soviet Union and the US/UK and killing thousands of soldiers. Oh, I forgot bout that historical fact.",
            "title_similarity": "0.44531414",
            "sentiment_compound": -0.9663
        }
    ]
}