{
    "What did people in Afghanistan do for fun after the Taliban banned nearly every pastime?\nAccording to Wikipedia,\n\n> The Taliban forbade pork and alcohol, many types of consumer technology such as music, television, and film, as well as most forms of art such as paintings or photography, male and female participation in sport, including football and chess; recreational activities such as kite-flying and keeping pigeons or other pets were also forbidden, and the birds were killed according to the Taliban's ruling. Movie theaters were closed and repurposed as mosques. Celebration of the Western and Iranian New Year was forbidden. Taking photographs and displaying pictures or portraits was forbidden, as it was considered by the Taliban as a form of idolatry. Women were banned from working, girls were forbidden to attend schools or universities, were requested to observe purdah and to be accompanied outside their households by male relatives; those who violated these restrictions were punished. Men were forbidden to shave their beards and required to let them grow and keep them long according to the Taliban's liking, and to wear turbans outside their households.\n\nBanning everything from pet-ownership and sport to nearly every form of art and performance seems like it would make the life of an ordinary person immensely boring.\n\nHow widely were these policies enforced? \n\nAnd if they were enforced, what did ordinary Afghans living under the Taliban do in their free time?": [
        {
            "id": "gv1vp1d",
            "score": 1,
            "text": "#[Click Here to summon the RemindMeBot for this thread!](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps://www.reddit.com/r/AskHistorians/comments/mth922/what_did_people_in_afghanistan_do_for_fun_after/%5D%0A%0ARemindMe!%202%20days)\r\n\r\nHello everyone, \r\n\r\nIf you are a first time visitor, welcome! This thread is trending high right now and getting a lot of attention, but it is important to remember those upvotes represent interest in the question itself, and [it can often take time for a good answer to be written](/r/AskHistorians/comments/7s66yf/a_statistical_look_at_askhistorians_in_2017_part_i/). The mission of /r/AskHistorians is to provide users with **[in-depth and comprehensive responses](https://www.reddit.com/r/AskHistorians/comments/f7ffl8/rules_roundtable_ii_the_four_questions_what_does/)**, and our [rules](/r/AskHistorians/wiki/rules) are intended to facilitate that purpose. *[We remove comments which don't follow them for reasons including unfounded speculation, shallowness, and of course, inaccuracy](https://www.reddit.com/r/AskHistorians/comments/h8aefx/rules_roundtable_xviii_removed_curation_and_why/)*. Making comments asking about the removed comments simply compounds this issue. So please, before you try your hand at posting, check out the [rules](/r/AskHistorians/wiki/rules), as we don't want to have to warn you further.\r\n\r\nOf course, we know that it can be frustrating to come in here from your frontpage or /r/all and see only *[removed]*, but we thank you for your patience. If you want to be reminded to come check back later, or simply find other great content to read while you wait, [this thread](https://www.reddit.com/r/AskHistorians/comments/i6b42q/rules_roundtable_xxvi_be_kind_remind_revisited/) provides a guide to a number of ways to do so, including the RemindMeBot- [**Click Here to Subscribe**](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps://www.reddit.com/r/AskHistorians/comments/mth922/what_did_people_in_afghanistan_do_for_fun_after/%5D%0A%0ARemindMe!%202%20days) - or\r\nour [Twitter](http://twitter.com/askhistorians).\r\n\r\nFinally, while we always appreciate feedback, it is unfair to the OP to further derail this thread with META conversation, so if anyone has further questions or concerns, I would ask that they be directed to [modmail](http://www.reddit.com/message/compose?to=%2Fr%2FAskHistorians&subject=Question%20Regarding%20Rules), or a [META thread](http://www.reddit.com/r/AskHistorians/submit?selftext=true&title=[META]). Thank you!",
            "title_similarity": "0.37833068"
        },
        {
            "id": "guzliav",
            "score": 14,
            "text": "Welcome to /r/AskHistorians. **Please [Read Our Rules](https://www.reddit.com/r/AskHistorians/wiki/rules) before you comment in this community**. Understand that [rule breaking comments get removed](https://www.reddit.com/r/AskHistorians/comments/h8aefx/rules_roundtable_xviii_removed_curation_and_why/).\n\n#Please consider **[Clicking Here for RemindMeBot](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps://www.reddit.com/r/AskHistorians/comments/mth922/what_did_people_in_afghanistan_do_for_fun_after/%5D%0A%0ARemindMe!%202%20days)** as it takes time for an answer to be written. Additionally, for weekly content summaries, **[Click Here to Subscribe to our Weekly Roundup](https://www.reddit.com/message/compose/?to=AHMessengerBot&subject=Subscribe&message=!subscribe)**.\n\nWe thank you for your interest in this *question*, and your patience in waiting for an in-depth and comprehensive answer to show up. In addition to RemindMeBot, consider [using our Browser Extension](https://www.reddit.com/r/AskHistorians/comments/d6dzi7/tired_of_clicking_to_find_only_removed_comments/), or getting the [Weekly Roundup](https://www.reddit.com/message/compose?to=subredditsummarybot&subject=askhistorians+weekly&message=x). In the meantime our [Twitter](https://twitter.com/askhistorians), [Facebook](https://www.facebook.com/askhistorians/), and [Sunday Digest](https://www.reddit.com/r/AskHistorians/search?q=title%3A%22Sunday+Digest%22&restrict_sr=on&sort=new&t=all) feature excellent content that has already been written!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AskHistorians) if you have any questions or concerns.*",
            "title_similarity": "0.54536426"
        },
        {
            "id": "gv0cfaw",
            "score": 73,
            "text": "[removed]",
            "title_similarity": "0.20822649"
        },
        {
            "id": "gv2zmg1",
            "score": 847,
            "text": "PART 1\n\nTo start with, I don’t want to downplay the restrictions that the Taliban placed especially over urban life. Most of the things in the original post did indeed take place, and especially in Kabul and other large towns/cities. An article by Juan Cole, ‘The Taliban, Women, and the Hegelian Public Sphere’ (1), describes much of this in analytical perspective that focuses on the spectacle of violence and restriction: public executions for immorality took place, but even more common was to see things like cassettes or electronic entertainment equipment ritually ‘hung’ as well in public. Regarding birds, this was partly due to the fact that people frequently kept birds like pigeons and especially quails or partridges for competitive sports that would also involve gambling; and even if no money changed hands, this kind of spiritually and materially unproductive time-passing was seen by the Taliban’s parent school of thought as frivolous at best, and were frowned upon. The Taliban took this, and made it into a prohibition.\n\nAddressing your larger point about prescriptions and prohibitions that include entertainment but extend far beyond them to include eg. dress, Cole writes about all this in terms of public sphere theory. To his view I would add a more recent material theory by Kusha Sefat, who writes about ‘Things and Terms’ in post-Revolutionary Iran. (2) The setting is different, but Sefat’s ideas work for Kabul post 1996, when the Taliban took over, and implemented policies like the uniformity of men’s and women’s physical presentations outside the home, and the removal of ‘westernized’ objects as signifiers for ‘un-Afghan’ and ‘un-Islamic’ lifestyles. In practice, the uniformity that the Taliban demanded was also heavily skewed in the direction of ‘Pashtun’ dress, and residents of Kabul, which gets much icier than Kandahar or Jalalabad in the winter, found it highly distressing to have to wear heavy sandals and a wool shawl in the snow, as opposed to shoes/boots and a coat; and apologies that this is anecdotal from my own fieldwork in Kabul, rather than from a printed source). In any case: the Taliban period, in Kabul, was heavily marked by attempts to reshape the material landscape, to create a proliferation of certain kinds of objects and block the visibility of other kinds, as a way to change (or ‘reform’) people’s interiority into the direction that the Taliban wanted. In other words, the material world around one, and the way that one moves through it, have an effect on the kinds of thoughts that one thinks/can think, and will produce a new kind of ideal society in which the Taliban were raised to an almost higher level of reality, which would seem natural and thus uncontestable. Indeed Cole, analyzing list of Taliban prohibitions, says that they all fit organically into what he calls an ‘episteme’. Many entertainment forms, like TV and radio and cinema, depicted landscapes that cut against this episteme; and the objects they depicted were especially singled out as well: the Taliban specifically outlawed Leonardo DiCaprio’s hairstyle in Titanic, which had been popular in Kabul among youths.\n\nAs Cole writes, much of this applied to ‘public’ space, but the Taliban also employed morality squads who could search homes for contraband objects, as well as practices. Weddings and things could not be accompanied by instrumental music, although the punishment for drum music was apparently discretionary to the particular inspector. Additionally, the Taliban, like the Mujahidin and the PDPA before them, had a well-developed network of informants, formal and informal/coerced, who could help police the domestic. Anecdotally, again, many families simply used kitchenware to produce music for happy occasions.\n\nReturning to Cole’s article, you’re also right that urban society generally seems to have been ‘not much fun’. That is, Cole cites a Swedish Physicians for Human Rights report that says, among other things, that 97% of women surveyed (in 1998) showed clinical signs of major depression.\n\nIn the midst of this, sometimes, resistance itself could be a source of … not \\*fun\\*, exactly; but I’ll let the following speak for itself. Anne Brodsky quotes an activist in the Revolutionary Afghan Women’s Association, who ran underground educational and other services, especially for women, who were particularly restricted in their access to social goods:\n\n“Our life is not without pleasure and meaning. Our sacrifice is for the value of freedom, not just for anything. I will not be able to achieve my personal goals in life—they were stolen by my country’s history. But for the children in this school I will sacrifice so they can reach theirs—they must be able to achieve. I am so angry at my own suffering and lost future that these innocent children must be aided.” (3) \n\nWITH ALL THAT, THOUGH:",
            "title_similarity": "0.68338263"
        }
    ]
}