{
    "At what point did American Amish become noticeably \"behind the times\" technologically compared to their rural non-Amish neighbors? To 19th century Americans, were the Amish distinctive in terms of their use/non-use of technology? If not, were they distinctive in other ways?\n": [
        {
            "id": "gvdzyxx",
            "score": 1,
            "text": "Welcome to /r/AskHistorians. **Please [Read Our Rules](https://www.reddit.com/r/AskHistorians/wiki/rules) before you comment in this community**. Understand that [rule breaking comments get removed](https://www.reddit.com/r/AskHistorians/comments/h8aefx/rules_roundtable_xviii_removed_curation_and_why/).\n\n#Please consider **[Clicking Here for RemindMeBot](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps://www.reddit.com/r/AskHistorians/comments/mvt4vq/at_what_point_did_american_amish_become/%5D%0A%0ARemindMe!%202%20days)** as it takes time for an answer to be written. Additionally, for weekly content summaries, **[Click Here to Subscribe to our Weekly Roundup](https://www.reddit.com/message/compose/?to=AHMessengerBot&subject=Subscribe&message=!subscribe)**.\n\nWe thank you for your interest in this *question*, and your patience in waiting for an in-depth and comprehensive answer to show up. In addition to RemindMeBot, consider [using our Browser Extension](https://www.reddit.com/r/AskHistorians/comments/d6dzi7/tired_of_clicking_to_find_only_removed_comments/), or getting the [Weekly Roundup](https://www.reddit.com/message/compose?to=subredditsummarybot&subject=askhistorians+weekly&message=x). In the meantime our [Twitter](https://twitter.com/askhistorians), [Facebook](https://www.facebook.com/askhistorians/), and [Sunday Digest](https://www.reddit.com/r/AskHistorians/search?q=title%3A%22Sunday+Digest%22&restrict_sr=on&sort=new&t=all) feature excellent content that has already been written!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AskHistorians) if you have any questions or concerns.*",
            "title_similarity": "0.44611752"
        },
        {
            "id": "gvegdl3",
            "score": 10,
            "text": "[removed]",
            "title_similarity": "0.26938987"
        },
        {
            "id": "gvepd4r",
            "score": 2939,
            "text": "#**Distinctiveness**\n\nThis is a central verse to Amish nonconformity:  “Do not be conformed to this world, but be transformed by the renewing of your minds, so that you may discern what is the will of God—what is good and acceptable and perfect.” Romans 12:2\n\n**The Anabaptist religions have a lot of differences from the Catholic and mainline Protestant religions that were dominant throughout most of modern American and European history.**\n \n\n**Origins and primary distinctions of Anabaptism (Amish, Mennonite, Brethren):**\n\n**Believers' Baptism**\n\nThe Amish (along  with other Anabaptists) were always distinct because of their pacifism and refusal to baptize infants (Anabaptists - which includes Amish, Mennonites, Brethren, and Hutterites).  This got them into a lot of trouble with the European governments at the time - they originally came from Switzerland, South/West Germany, Amsterdam, and Tyrol about the time of the reformation.  Anabaptist means to “baptize again” – Anabaptists baptized adults again, who had previously been baptized as children, because they did not think the baptism of an infant into a religion could be legitimate. The child, unlike an adult, had no idea what they were agreeing to.  This is why Amish young adults have the “Rumspringa,” which you may have heard about, before being admitted into the church.  After learning all about their religion as children, they are allowed to see what the rest of society is like in this period (to drive cars, drink, etc.), before committing to join the church.  In any case this re-baptism was viewed as heresy by both the Catholic church and Luther’s Protestant church.\n\n(It is worth noting that, although the Anabaptist religions are associated with Protestantism, they are separate from Luther's reforms in Wittenberg– although they broke off during the Reformation and were influenced by the movement, they were more associated with the reforms of Ulrich Zwingli, Tomas Müntzer, Melchior Hoffman, Dirk Philips, Menno Simmons, and others).\n\n**Pacifism**\n\nAnother main distinction of the Anabaptist religions is pacifism and nonresistance.  This comes from many places in the Bible - including the commandment “Do not murder,” “Do not resist an evil person…turn him to the other [cheek] also,” (Matthew 5:39), “Blessed are the peacemakers” (Matthew 5:9), “Live by the sword die by the sword,” “The Lord will fight for you, you need only to be still” (Exodus 14:13). The very violent governments and churches around them influenced this belief.  This belief was also influenced by the violent Münster Rebellion of Anabaptists who tried to establish a communal government in Münster 1534-1535, and who were in turn very violently and gruesomely put down, tortured, executed publicly, and exhibited in cages that to this day hang on the Münster church.  This pacifism was very contrary to the violent Germanic states and Europe as a whole at the time, military complexes which continued to be supported by the old Catholic, Anglican, Orthodox, and Reformed churches, and obviously did not bide well with these kings who tried to draft pacifist Anabaptists who refused to fight.  \n\nThere is a famous story about Dirk Willems, who in 1569 was condemned by the Catholic church and imprisoned for being re-baptized,  escaped, and was pursued by a guard who then fell through the ice.  Willems felt obligated to save his drowning pursuer but nonetheless was re-imprisoned and burned at the stake despite the rescued guard’s objections.  This demonstrates how these distinctions led to major problems, larger in Europe, but also still some issues in the United States.\n\n**Moving to the United States**\n\nThe Amish, Mennonites, and Brethren thus moved largely to Pennsylvania, where William Penn offered religious freedom and there was many similarities with the Quakers – **pacifism, simplicity, freedom of religion, priesthood of all believers** (the Anabaptist churches are very decentralized and focused on the individual), **separation of church and state, nonconformity to the world, believer’s baptism, simple living.**  You can see how they fit much better into the new United States.\n\n**Alternative Service, Conscientious Objection**\n\nThere were still major issues, though, with the pacifism in particular.  This got the Anabaptists into trouble many times when the draft was instated, including the Civil War, World War I, and World War II.  The Anabaptists, willing to give time to serve society but unwilling to support the military, are responsible for the creation of Alternative Service civil works projects in the United States for conscientious objectors if they were drafted, during World War II.   They worked with the government to establish this as what they saw as more productive alternative to wasting away time and resources in jail.  They have been, and continue to be, antagonized for what some view as too hard a stance on pacifism.  For example, there has been continuous controversy about Mennonite colleges such as Goshen refusing to play the Star Spangled Banner for sports (instead singing America the Beautiful), as it is too violent.\n\n#**Regarding the first part of your question, Becoming Behind the Times**\n\n**Split of Old Order Sects**\n\nthe more traditional old order groups began to split off of the more technology friendly groups of Anabaptism around 1850.  (Some people are not aware that many Mennonites and Brethren are not Old Order and do not restrict such technology – these have “normal” lifestyles and technology use – and that various Amish groups have various levels of adaptation of technology.  However, most still strive to be somewhat simple when possible and continue traditions such as A Capella 4-part singing rather than using instruments in church).  There were always different factions due to the decentralized nature but around this period 1850-1878 these factions failed to reconcile on various progressive/conservative issues at the yearly conferences, factions started to boycott, and the Old Order groups began to separate more from the “progressive” groups (again note how these groups are decentralized, as in, there is no singular Amish church or Mennonite church like there is a single organized Catholic church.  Rules are up to the different affiliations and the individual churches.)  The non-Old-Order Amish factions eventually merged with the Mennonites.\n\n**Similarities to normal rural 19th century American life**\n\nUp until about 1920 or so the lifestyle, while still more religious than average, would not have been that drastically different than most other farmers despite following the strict \"Ordnung\" rules.  Until the introduction of the affordable car, the tractor, the telephone, rural electricity, radios, and many other consumer products, the average rural family would not have traveled, farmed, dressed, or lived a drastically different lifestyle than the Amish.  The Amish would have strived to be more simple, with solid color or black dress rather than patterns, A-Capella singing rather than instruments, less decoration, probably more religious rules and involvement (comparable to orthodox Judaism perhaps), particular Wedding protocol, meeting in fellow members' homes (Mennonites have simple and plain churches, Amish meet in homes) rather than fancy churches with ornamentation and stained glass, etc., but the overall lifestyle would still be very similar.  Amish educate to 8th grade and are exempt from social security (because they take care of their own retired) which wouldn't have been different before 1930 or so.\n\nThe point of not adopting certain new technologies is to focus on family (by not traveling too far), hard work, God, and a simple way of life.\n\n**The German Language/PA Dutch Dialect**\n\nAnother distinction is that Amish and some Mennonites, Brethren, and Hutterites in the Americas (including Canada and Latin America) continue to speak primarily German, in order to not-conform, remain traditional, and separate from the modern way of life here.  They use a Hochdeutsch (High German/ Standard German) Bible.  In Pennsylvania, much of the state also spoke the German “Pennsylvania Dutch” dialect (which is very similar to the dialect in the Palatinate, Germany) for much of the commonwealth’s  history – not just the “plain Dutch” Anabaptists but also many “Fancy Dutch,” often Lutheran, farmers and businessmen who also had German ancestry.  Pennsylvania was officially bilingual (German/English) until 1950 with bilingual laws and the choice of public schools to teach in either language.\n\nPennsylvanians usually write German in the old Fraktur print and Kurrent script, which has not really been used in Germany since WWII (they use regular latin print and cursive.  You have probably seen Fraktur before but Kurrent cursive is pretty interesting).\n\n*This is already too long - but if you want to learn more about any of this, a lot of information is available online about the Reformation, Anabaptism, and Pennsylvania Dutch people and language!  These are huge topics*\n\n#**Sources:**\n\nThe Bible\n\nJ. van Braght, Thieleman. Martyrs Mirror.  Amsterdam 1660\n\nC. Arnold Snyder. Anabaptist History and Theology: An Introduction. Kitchener, Ontario, 1995.\n\nNolt, Steven M. (1992), A History of the Amish, Intercourse: Good Books\n\nDonald B. Kraybill, Karen M. Johnson-Weiner, Steven M. Nolt: The Amish, Baltimore 2013, page 73.\n\nThomas, Heath A.; Evans, Jeremy; Copan, Paul (2013). Holy War in the Bible: Christian Morality and an Old Testament Problem. Downers Grove, Illinois: InterVarsity Press\n\nMarshall, Peter (2017). Reformaatio [The Reformation: A Very Short Introduction] (in Finnish). Translated by Kilpeläinen, Tapani. Tampere: niin & näin.\n\nArmour, Nancy. “Anthem debate has already been played out at Indiana college.” USA Today, 8 Sep. 2016\n\nGingerich, Melvin (1949). Service for Peace, A History of Mennonite Civilian Public Service. Mennonite Central Committee.",
            "title_similarity": "0.6006666"
        }
    ]
}