{
    "In the UK, we can largely roam the countryside without fear of being attacked by wild predators. At what stage in our history did the threat of attack by animals largely subside, and which animals posed the greatest threat?\n": [
        {
            "id": "gvp53wn",
            "score": 1,
            "text": "Welcome to /r/AskHistorians. **Please [Read Our Rules](https://www.reddit.com/r/AskHistorians/wiki/rules) before you comment in this community**. Understand that [rule breaking comments get removed](https://www.reddit.com/r/AskHistorians/comments/h8aefx/rules_roundtable_xviii_removed_curation_and_why/).\n\n#Please consider **[Clicking Here for RemindMeBot](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps://www.reddit.com/r/AskHistorians/comments/mxkb4h/in_the_uk_we_can_largely_roam_the_countryside/%5D%0A%0ARemindMe!%202%20days)** as it takes time for an answer to be written. Additionally, for weekly content summaries, **[Click Here to Subscribe to our Weekly Roundup](https://www.reddit.com/message/compose/?to=AHMessengerBot&subject=Subscribe&message=!subscribe)**.\n\nWe thank you for your interest in this *question*, and your patience in waiting for an in-depth and comprehensive answer to show up. In addition to RemindMeBot, consider [using our Browser Extension](https://www.reddit.com/r/AskHistorians/comments/d6dzi7/tired_of_clicking_to_find_only_removed_comments/), or getting the [Weekly Roundup](https://www.reddit.com/message/compose?to=subredditsummarybot&subject=askhistorians+weekly&message=x). In the meantime our [Twitter](https://twitter.com/askhistorians), [Facebook](https://www.facebook.com/askhistorians/), and [Sunday Digest](https://www.reddit.com/r/AskHistorians/search?q=title%3A%22Sunday+Digest%22&restrict_sr=on&sort=new&t=all) feature excellent content that has already been written!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AskHistorians) if you have any questions or concerns.*",
            "title_similarity": "0.42824697"
        },
        {
            "id": "gvpt9nd",
            "score": -18,
            "text": "[removed]",
            "title_similarity": "0.12175514"
        },
        {
            "id": "gvq52tj",
            "score": 1791,
            "text": "I have an answer about wolves in medieval Europe, especially England (where they went all but extinct by the end of the M.A.) that might interest you!\n\n* [A common trope in RPGs is very aggressive fauna. as in if you come across a wolf. that wolf will fight you to the death. How concerned would a medieval traveler be of encountering aggressive wildlife?](https://www.reddit.com/r/AskHistorians/comments/gp7i5j/a_common_trope_in_rpgs_is_very_aggressive_fauna/frln6tc/)\n\nSo the game designers sure got one thing right: if your DM does put a wolf along your path, your medieval-esque character would be terrified.\n\nMedieval western Europeans were so scared of wolves, specifically, that they often equated wolves and outlaws. As I've [written on AH](https://www.reddit.com/r/AskHistorians/comments/4ufacg/in_fantasy_literature_travelling_groups_are_often/d5pnxur/):\n\n\"While Gerard Breen points out that *many* cultures link criminals and dangerous animals, the association between wolves and wandering outlaw-criminals is particularly strong across western Europe.\n\nThe Norse sagas, for example, use dog and hound imagery to discuss exiles and avengers. But straight-up murderers and criminals might wear wolf cloaks or earn the sobriquet *Ulfr.*\n\nIn England, too, the connection between wolves and outlaws was strong--strong enough to be codified as law! An outlaw could be declared \"wolfesheed\"--literally, *a wolf's head.* In the later Middle Ages, this meant that the outlaw could be hunted like a wolf, that is, with abandon and all due legality. In the pre-Norman Conquest days, when the term seems to originate, the point was that killing an outlaw and killing a wolf earned the same bounty.\"\n\nWhere this equation comes into play here is the not-unjustified notion of outlaws as bandits along the roads. It's not a one-one connection, and medieval people knew that perfectly well. However, bandits were a *major* threat to travelers across the entire world. \n\nThey're one of the reasons even the account of Ibn Battuta, the audacious and fearless 14th century Moroccan, has him easily convinced to travel across the North African coast in a caravan on his hajj. And why Christian and Jewish pilgrims to Jerusalem were willing to be exorbitant prices (to people of all religions) for accompaniment across assorted deserts.\n\nBut I've diverted from the point: fear of wild animals. Some of our richest sources for medieval travel come from the narratives of pilgrims to the Near East. Most pilgrims follow a standardized format of pretty much just listing which holy sites they visited. Others are more effusive. And we hear a lot more about *fear* of animal attacks than actual attacks.\n\nNiccolo da Martoni, for example, has to use a standard (and rather wrong) description of the crocodile, because he never even saw one--he only heard about it. However, his description specifically notes that crocodiles attacked boats in order to eat the people. Felix Fabri was similarly unhappy about the hippopotami in the Nile. Crossing the Alps, travelers stick wild animals in with simple catalogues of the dangers they faced.\n\nBut there's a little more to our story.\n\nBertrandon de La Brocq́uière describes coming across a giant lizard he did not recognize...and his guides, who did recognize it, were so scared they ran away. The Europeans, SO BRAVE, dismounted their horses and it ATTACKED THEM, and one of them eventually cut its throat.\n\n...The part of the story I didn't tell you there, however, was that when the guides fled, so did the lizard. And it tried to hide. The European pilgrims pursued it, swords already in hand. The lizard jumped at one of them in self defense *after* it had been attacked. (SO BRAVE.)\n\nThe point here is: travelers were so scared of wild animals that they talked about attacks by ones they never saw. They *added* mentions of attacks by wild animals onto standard encyclopedia (bestiary) descriptions. *They didn't even need to be attacked to be scared of wild animals.*\n\nAnd then there's a wolf attack, one that actually happened and that was initiated by the wolves. It wasn't against travelers, but it certainly amped up fear of the wild animals.\n\nIn the late Middle Ages--as human settlements increased and spread out, and wilderness shrank--there were multiple accounts of wolves threatening Paris (of all places). The most notable is certainly the winter of 1438. That year, [and I am not making this up](http://visualiseur.bnf.fr/Visualiseur?Destination=Gallica&O=NUMM-102925), wolves *slid into Paris on the frozen Seine River* and attacked the prey they could find in the streets--pigs, dogs...one chronicler even says they killed a baby, although that could easily be apocryphal or actually the work of a pig.\n\n...But why did the wolves ice-skate into Paris? Because they were starving. Not because they were the brutal beasts who were so dangerous that they were sometimes used as iconography for the devil. They were, if you will, chaotic neutral. It was a matter of survival and circumstance, not innate evil.\n\nThat's not what medieval Europeans tended to see, however. And to circle back right to the beginning, including as I've [previously written](https://www.reddit.com/r/AskHistorians/comments/4ufacg/in_fantasy_literature_travelling_groups_are_often/d5powzs/) on AH:\n\n\"Perhaps most interesting in the current context is a particularly fearsome wolf who became infamous enough in Paris to earn the nickname Courtaud or 'short-tail.' Courtaud appeared in the midst of a wave of wolves actually killing humans of all ages in Paris, and 'people spoke of him like they would a bandit of the forest'--an outlaw robber of the highways.\"\n\nGet your swords and your spells ready.\n\n~~\n\nIf you're interested in reading more about topics like this--including more about how to Not Get Eaten by wolves, sea monsters, and *pirate cannibals* (yes, really)--you can pre-order my book [*How to Slay a Dragon: A Fantasy Hero's Guide to the Real Middle Ages*](https://amzn.to/3602Ttr) for some great summer (or winter) reading!\n\n*ETA: And if you prefer not to use Amazon, we have an AskHistorians affiliate link for my book through [bookshop.org](https://bookshop.org/a/24392/9781982164119) as well!*",
            "title_similarity": "0.59272695"
        },
        {
            "id": "gvq02cv",
            "score": -3,
            "text": "[removed]",
            "title_similarity": "0.12175514"
        }
    ]
}