{
    "Is there a reason why no Pope ever chose the names \"Luke\" or \"Matthew\"?\nOf the 4 evangelists, the name \"John\" was commonly chosen by 23 Popes, and \"Mark\" was chosen once.\n\nIn contrast, no Popes ever took their name from the other 2 evangelists. Is there a stigma around those names? If so, why?": [
        {
            "id": "gx95kzn",
            "score": 1,
            "text": "Welcome to /r/AskHistorians. **Please [Read Our Rules](https://www.reddit.com/r/AskHistorians/wiki/rules) before you comment in this community**. Understand that [rule breaking comments get removed](https://www.reddit.com/r/AskHistorians/comments/h8aefx/rules_roundtable_xviii_removed_curation_and_why/).\n\n#Please consider **[Clicking Here for RemindMeBot](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps://www.reddit.com/r/AskHistorians/comments/n6ubpp/is_there_a_reason_why_no_pope_ever_chose_the/%5D%0A%0ARemindMe!%202%20days)** as it takes time for an answer to be written. Additionally, for weekly content summaries, **[Click Here to Subscribe to our Weekly Roundup](https://www.reddit.com/message/compose/?to=AHMessengerBot&subject=Subscribe&message=!subscribe)**.\n\nWe thank you for your interest in this *question*, and your patience in waiting for an in-depth and comprehensive answer to show up. In addition to RemindMeBot, consider [using our Browser Extension](https://www.reddit.com/r/AskHistorians/comments/d6dzi7/tired_of_clicking_to_find_only_removed_comments/), or getting the [Weekly Roundup](https://www.reddit.com/message/compose?to=subredditsummarybot&subject=askhistorians+weekly&message=x). In the meantime our [Twitter](https://twitter.com/askhistorians), [Facebook](https://www.facebook.com/askhistorians/), and [Sunday Digest](https://www.reddit.com/r/AskHistorians/search?q=title%3A%22Sunday+Digest%22&restrict_sr=on&sort=new&t=all) feature excellent content that has already been written!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AskHistorians) if you have any questions or concerns.*",
            "title_similarity": "0.35224923"
        },
        {
            "id": "gxcp2af",
            "score": 16,
            "text": "That’s really fascinating that popes aren’t required to change their name to something pope-ish. So it’s not completely impossible that one day we will have a Pope Wyatt or Pope Keith?",
            "title_similarity": "0.6101872"
        },
        {
            "id": "gx98cno",
            "score": 24,
            "text": "[removed]",
            "title_similarity": "0.04471717"
        },
        {
            "id": "gxaaz0p",
            "score": 3357,
            "text": "Excellent question, with a small clarification - according to official Catholic canon, there have been 21 Pope Johns, with the number John XX missed by clerical error in the Tenth Century; two Antipopes (that is, rival popes not recognized by the Catholic Church) named John, specifically numbers XVI and XXIII, although confusingly, John XXIII is also the name of a canonized Pope while XVI is not; and two Popes named John Paul. So, in total, we have 21 Pope Johns, 2 Antipope Johns, and 2 John Pauls. As you pointed out, this is heavily skewed against the other evangelists, with a single Pope Mark in the 4th Century (who did not choose his name) and no Popes named Matthew or Luke. It is also the most commonly chosen Papal name by a fair margin, with the second and third most common names being Gregory and Benedict, at 16 and 15, respectively. \n\n*Edit: these numbers fail to account for the antipopes who claimed the name Benedict; technically there have been nineteen people who sought to be called Pope Benedict. X, XIII, and two XIVs were all antipopes, and while there was never an official Pope Benedict X, there has been an official XIII and XIV.*\n\nInterestingly, for the first five hundred years of the papacy, Popes did not take a new name upon their ascension. This is why we see a hodgepodge of random ancient names that are never repeated by later Popes, since the newly-elected pontiff would simply adopt the title of Pope on top of their birth name. This would change in 533, when a man named Mercurius was elected to the papacy and opted to change his name to John II. We have no definitive reason why, or at least, any definitive reason given by John II has been lost to history. Historian Roger Collins offers the suggestion that “John probably did so because his original name, Mercurius, was that of a pagan god, though he had used it as a priest” (Collins 86) though this argument carries with it the qualification that some 300 years earlier, Pope Dionysius held the papacy without changing his name from a pagan god’s and, as far as we know, never received any criticism for it. However, we must also keep in mind that Pope Dionysius preceded Constantine’s conversion to Christianity and the subsequent spread of the faith, while the rules and internal structure of the Church were still being established, but this is a rabbit trail away from your original question. \n\nJohn II was the first person to adopt a new name upon becoming the Pope, though later Popes would point out that their forefather, Saint Peter, received a new and symbolic name upon his divine appointment, and would use this to set the precedent - although, ironically, John II’s example would only be followed intermittently for the next five hundred years. For almost a millennia, Popes were technically free to choose whether or not they adopted a new name upon election (and still are, but it has not been done in nearly 500 years). After John II changed in 533, John III would change in 561 with no reason given, and John XII would change in 955 in the same way. John XIV adopted his name in 983 (and was only the fourth Pope to take a new name) because “his baptismal name was Peter...he did not wish to take the papal name of the Blessed Apostle himself” (McBrien, 163). The practice would begin ramping up after the turn of the millennium and became so common that by the 16th Century, only two popes since the turn of the millennium had kept their \nbaptismal names, those being Pope Hadrian VI in 1522 and Pope Marcellus II in 1555, Marcellus being the last Pope to not take a new name (McBrien 278, 284). \n\nBy this point, the papacy was already on Pope John XXII, almost all of those names adopted by the incoming Pope, and now we get to the heart of your question. While many of these Popes’ reasons for choosing their names have been lost to history, we can look at more recent Popes and project backwards. Many Popes in recent history have chosen their names to invoke a great Pope or saint from history, typically one they admire and wish to emulate with their papacy. For instance, Pope Francis chose his name to honor Saint Francis of Assisi, specifically because he admired the saint’s dedication to humility and helping the poor, especially through his Franciscan Order. Pope John Paul II, meanwhile, chose his name to honor his predecessor John Paul I as a sign that he would carry on his work, while John Paul I chose his name to invoke the works of Popes John XXIII and Paul VI, who had guided the Church through Vatican II. So, we can begin to see a bit of a pattern emerge, and can cast that vision backwards. \n\nSpeaking of John XXIII, he provides an excellent point that gets to the root of your question - simply put, “he loved the name John because it was borne by the two men closest to Jesus: John the Baptist and John the Evangelist. He called himself John, he said finally to the cardinals, in order to renew the exhortation of the Apostle John that we should love one another” (McBrien, 371). The simplest answer to your question is that the name John carries a substantial amount of weight in the Christian world. John was the name of the cousin of Jesus who prepared the way for Him; John was also one of Jesus’ closest friends and disciples, “the disciple whom Jesus loved”, and author of five books of the New Testament including one Gospel, three letters, and the prophetic Book of Revelation. John has a name of great significance in the way that, say, Americans might hear the name “Washington” or “Lincoln”. Additionally, as more and more popes took the name of John, a precedent was set for the value of the name and more Popes emerged as examples to emulate (though not always, John XII died in the bed of a married woman). The name John emerged as a simple but profound reference to two of the most important men in the early Church and the Gospels, and as the legacy of the name grew, it grew exponentially. While this is less of a “stigma” around the names of Matthew, Mark, Luke, it’s also worth pointing out that the historical Luke never met Jesus and merely joined the Church after His ascension to Heaven, Pope Mark did not choose his name but instead retained his baptismal name, and as for why there has never been a Pope Matthew, we can only speculate. Likely, it has to do with the fact that the Disciple Matthew did comparatively little in the Gospels when weighed up against men like Peter and John, nor did he write any New Testament canon beyond his Gospel (and that claim is seriously doubted by the overwhelming majority of Biblical historians). Feel free to reach out if you have follow-up questions or if I made any mistakes! \n\nSources:\n\n*Keepers of the Keys of Heaven*, Roger Collins\n\n*Lives of the Popes*, Richard P. McBrien",
            "title_similarity": "0.7862541"
        }
    ]
}