{
    "Today, when I go out for dinner, I can choose to visit an Italian, Indian, or Chinese restaurant. How old is the idea of “ethnic” restaurants that specialize in the food of a particular foreign culture? Could a hungry Roman go out for some Persian takeout?\n": [
        {
            "id": "gxuig95",
            "score": 1,
            "text": "Welcome to /r/AskHistorians. **Please [Read Our Rules](https://www.reddit.com/r/AskHistorians/wiki/rules) before you comment in this community**. Understand that [rule breaking comments get removed](https://www.reddit.com/r/AskHistorians/comments/h8aefx/rules_roundtable_xviii_removed_curation_and_why/).\n\n#Please consider **[Clicking Here for RemindMeBot](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps://www.reddit.com/r/AskHistorians/comments/nanuzq/today_when_i_go_out_for_dinner_i_can_choose_to/%5D%0A%0ARemindMe!%202%20days)** as it takes time for an answer to be written. Additionally, for weekly content summaries, **[Click Here to Subscribe to our Weekly Roundup](https://www.reddit.com/message/compose/?to=AHMessengerBot&subject=Subscribe&message=!subscribe)**.\n\nWe thank you for your interest in this *question*, and your patience in waiting for an in-depth and comprehensive answer to show up. In addition to RemindMeBot, consider [using our Browser Extension](https://www.reddit.com/r/AskHistorians/comments/d6dzi7/tired_of_clicking_to_find_only_removed_comments/), or getting the [Weekly Roundup](https://www.reddit.com/message/compose?to=subredditsummarybot&subject=askhistorians+weekly&message=x). In the meantime our [Twitter](https://twitter.com/askhistorians), [Facebook](https://www.facebook.com/askhistorians/), and [Sunday Digest](https://www.reddit.com/r/AskHistorians/search?q=title%3A%22Sunday+Digest%22&restrict_sr=on&sort=new&t=all) feature excellent content that has already been written!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AskHistorians) if you have any questions or concerns.*",
            "title_similarity": "0.3962826"
        },
        {
            "id": "gxvv2bh",
            "score": 1226,
            "text": "This isn't quite Roman era, but I can give some detail that the idea of \"ethnic\" restaurants existed in the Soviet Union as early as the 1930s.\n\nStalin had consolidated his leadership by 1929, and while he had long dismissed a Georgian national identity in favour of a more broad Soviet one, he was still a Georgian at heart. One thing he kept up was his love of Georgian food. At the crossroads of Europe and Asia, for long stretches it directly bordered Russia, Persia, and the Ottoman Empire, and thus took in cuisine from all three regions. As such Georgian food is quite varied, and has a mix of European and Middle Eastern tastes. \n\nIt was this type of food that Stalin had brought to him in Moscow, and enjoyed not just by Stalin but his fellow Caucasians (meaning the geographic region, not a racial term in this context): Lavrenti Beria, the head of the NKVD (secret police) was also from Georgia, as was Sergo Orjonikidze (commissar of heavy industry) and Avel Enukidze (secretary of the Presidum of the Central Committee), while Anastas Mikoian (a member of the Politburo) was Armenian and Sergei Kirov (also a Politburo member) had spent considerable time in Azerbaijan. Stalin was also known for hosting long dinner parties that would stretch into the early hours of the morning, and these meetings were not just for eating: important policy decisions were made during these feasts.\n\nAnyways, as Stalin enjoyed his native Georgian food Enukidze, who used to travel between Georgia and Moscow frequently, would bring some food back with him, mainly wine and tangerines (both are fairly prominent in Georgia, and in my opinion quite tasty). This was further developed over the years into an official set up, and by the late 1930s the Georgian Ministry of Food Production had an office in Moscow; this allowed Georgian staples like wine (Stalin was particularly fond of kindzmareuli, a semi-sweet red), Borjomi mineral water, sulguni cheese, and spices, to easily be transported to the capital. Georgian personal were also brought in to oversee things, led by Stalin’s childhood friend Aleksandre Egnatashvili; this role was vital enough that Egnatashvili was made an NKVD officer and deputy chief of Stalin’s personal security service of household affairs. \n\nWith Stalin leading the way, Georgian food became popular among the Moscow elites, which trickled down to the masses. Restaurants began to serve some Georgian dishes, stores would offer spices and the like, and cookbooks began printing Georgian recipes. This culminated in 1940 with the opening of Aragvi, the first Georgian restaurant in Moscow. Aragvi (the name comes from a major Georgian river) catered to the elites, and to get a seat there was a sign of high standing (Beria would frequently eat there, using a private booth on the second floor). The director, Longinoz Stazhadze, was of course Georgian and had previously cooked for Stalin (he was also an NKVD officer). The restaurant itself was controlled by the Georgian Ministry of Trade, and it was the Georgians who ensured a steady stream of supplies were sent to Moscow (under the auspices of the NKVD, food security falling under their watch). \n\nThe restaurant was exceedingly popular, and after the Second World War was followed by similar ethnic restaurants that represented the peoples of the USSR: Ararat served Armenian food, Baku offered Azerbaijani, and the Uzbekistan, not surprisingly had Uzbek (evidently they were not creative with the names). Foreigners were allowed in the Aragvi, with John Steinbeck visiting in 1947, and it was later mentioned in a 1950 *Time* article on Soviet cuisine.\n\nThese restaurants outlasted Stalin (though Stazhadze would be removed and later arrested for corruption), which is a testament to its popularity: in 1960 the head chef estimated they were selling up to 800 portions of tabaka (a fried chicken dish) a day, among other dishes. It remained a popular spot to host important parties and gatherings into the 1970s, and was frequently a place the Soviets would bring foreign delegations. That said, it was not a place you could just walk into off the street: aside from the high prices, a former deputy chef said that “it was almost impossible to get a table around the holidays unless you knew someone or could rely on connections”. Still, it was well-known, and starting in the 1960s Soviet cookbooks would include some famous recipes from the Aragvi.\n\n\nA little post-script to the Aragvi: it managed to outlast the Soviet Union, but in the post-Soviet era became a meeting place for the Russian and Georgian Mafia (the Georgian Mafia was quite prominent in the later Soviet era). It shut down in 2003, but was bought shortly after and after extensive renovations was opened in 2016, but closed again in 2019, and has no signs of re-opening. That said, there is no lack of Georgian restaurants in Moscow these days.\n\nMy main source on this is one of my favourite articles: \"Edible Ethnicity How Georgian Cuisine Conquered the Soviet Table\" by Erik R. Scott, *Kritika* Vol. 13 No. 4, Fall 2012, pp. 831-858. Scott later used this as a chapter in his book *Familiar Strangers: The Georgian Diaspora and the Evolution of Soviet Empire* (2016).",
            "title_similarity": "0.68207026"
        },
        {
            "id": "gxvsetd",
            "score": 1054,
            "text": "The entire modern concept of a \"restaurant\" is inextricably bound with one nation-based cuisine: France, of course. But (for example) 19th-century Americans weren't necessarily going to a restaurant because the cuisine was French, they were going because of what French cuisine symbolized in terms of haute culture.\n\nI have an earlier answer that deals a little with the lure of the \"exotic\" as a major drawing point for some of the predecessors of restaurants, namely British coffeehouses, and then goes into how U.S. restaurants started off as French cuisine and then Americanized. (The *question* is sort of the reverse, but the answer has the info you're looking for!)\n\n* [In America, ethnic restaurants (Italian, Chinese, Jewish, etc) started to appear when those immigrants arrived en masse in the early 20th century. What were the most popular types of restaurants before the 20th century?](https://www.reddit.com/r/AskHistorians/comments/7yeifc/in_america_ethnic_restaurants_italian_chinese/dugew8h/)\n\nMacaroni and cheese. Even the finest American restaurants through the nineteenth century served *a lot* of macaroni and cheese.\n\nAllow me to explain.\n\nThe arrival of the restaurant and the restaurant experience--that is, attending a sit-down establishment whose primary focus was providing food, for the primary of eating the specific food offered there--in America is usually linked to the 1820s and 30s, with the opening of restaurants like the Union Oyster House in Boston, and the revamping of Delmonico's in New York City into the trend-setter of elite cuisine. This wasn't the beginning of \"dining out,\" of course, and those traditions would continue.\n\nThe most important predecessors are, loosely speaking, taverns/inns (which often overlapped in function) and coffeehouses. Travelers needed a place to eat where they stayed, of course, and non-travelers wanted something to eat while they drank. \"Abundant but not delicate,\" was how Frances Trollope *delicately* described American tavern menus in 1832, and Scottish general James Edward Alexander (1803-1885) agreed wholeheartedly:\n\n> [There were] Tables covered with meat, vegetables, preserved fruit, tea, coffee, and bread--both of maize and wheat--and soft hoe and waffel [sic] cakes...\n\n> No ceremony was used; each man helped himself with his own knife and fork [from the serving dish] and reached across his neighbor...bones were picked with both hands, knives were drawn through the teeth with the edge to the lips...Beefsteaks, apple tart, and fish were seen on the same plate the one moment, and had disappeared the next!\n\nAlexander describes a basic lineup of dishes--recognizable even to an international traveler without needing menu descriptions to inform what was being eaten. For some travelers, the lack of a description was both a curse and a blessing. In the 18th century, a Connecticut teacher and diarist had described one of her own inn...meals...as:\n\n> a twisted thing like a cable, but something whiter...[which the cook laid] \"on the bord, tugg’d for life to bring it into a capacity to spread.\n\nThe tradition of eating connected with hosting would actually play a role in the evolution of \"dining out\"--with increased and richer international travel came nicer travelers' quarters, that is to say, hotels; and with that came nicer eating rooms and eventually restaurants that catered to locals as well as travelers.\n\nCoffeehouses also played a role in creating a public desire for dining out, in America as they had begun to do in England by the late 18th century. At first, coffeehouse culinary offerings had sought to mirror the exotic allure and reputation of coffee *from the East* with heavily spiced and candied foods. In England and America, \"France\" was as good as the East for exotic; pastries were also on offer in some places. But it turned out people really like to be social to eat as well as to drink (alcohol or caffeine). By 1800, coffeehouses had introduced [tables and booths](http://www.britishmuseum.org/collectionimages/AN00321/AN00321183_001_l.jpg), a [waitstaff](http://www.britishmuseum.org/collectionimages/AN00093/AN00093726_001_l.jpg), and sometimes the types of nicer food one would not necessary be used to at home paired with a nice glass of wine! John Byng, grouchy about the state of *provincial* coffeehouses on his travels through countrysides, dreamed of home:\n\n> A London gentleman steps into a coffeehouse, orders venison,\nand turtle, in the instant; and (if known) a delicious bottle of port or claret: upon a clean cloth, without form, he dines at the moment of his appetite and walks away at the moment, he is satisfied.\n\nDelmonico's, usually considered the first American restaurant worthy of the name, actually started life as a coffeehouse serving pastries in 1827. But its proprietors presumably noticed their clientele's focus on the food, and took a risk. They bought the building next door and, over the 1830s, turned themselves into a fine-dining *restaurant*.\n\nThey were fighting an uphill battle. \"Abundant but not delicate\" remained the dominating perception of American cuisine. Charles Dickens was horrified by the rustic nature of the dishes he ate at New York's City Hotel in 1842--duck with olives, more duck, grilled mutton chops. To defend themselves, the hotel owners and cooks could point out he was emphasizing the wrong thing: he had been served *thirty-eight dishes*.\n\nThe preference for *abundant* remained even as more and more chefs strove for *delicate*. If we can use menus as a guide for what people were eating, a meal would consist of one or more appetizers (soups, salads, fish); an intervening course called an entree that was basically the chance for the cook to show off something fancy (visually as well as culinarily) without having to worry about actually satisfying the patrons' stomachs; the main course of roast meat or fowl accompanied by vegetable side dishes; and then *two* dessert courses.\n\nAmerican fine dining across the middle of the 19th century, spiraling ever-upward in its closing Gilded Age years, retained an Anglo-American core but took on French trappings. Yes, French cooking was already the standard aspirational cuisine--not just the word \"restaurant\" is French, but \"chef,\" \"a la carte\", even \"cuisine\" comes from the French for kitchen. So those roast duck and venison main courses were smothered in French sauces: Espagnole or poulette; or in English ones: Cumberland or jellies. And, of course, wine-based sauces in abundance.\n\nMenus also feature some stock French and English dishes, like beef a la mode (which does not involve ice cream), pork with fried apples, lamb blanquette. Mutton was extremely popular, mostly owing to French influence rather than English. Hilariously, it was apparently also \"fine dining\" to feature modern American barbecue basics, namely, baked beans with pork or cooked in pork lard. \n\nAnd then there were the oysters and macaroni.\n\nThese were kind of the go-to menu fillers for restaurants that wanted to save some money while still offering expansive menu options. Macaroni specifically was an American staple from the 18th century; the first pasta factory in the U.S. was apparently established in 1798. This was a heritage of English rather than directly Italian influence. London cook and author William Verral's 1759 *Complete System of Cookery* provided two versions of macaroni and cheese, which were prepared by mixing the pasta, cream, and cheese and then baking the dish. The Americans were not to be outdone: they produced, among other things, the *Ladies' New Book of Cookery* with *nine* macaroni dishes, many being further riffs on macaroni with cheese (and cream and butter) cooked and recooked.\n\nAs the fine-dining scene developed, spearheaded by Delmonico's success and other cities' desire to be as happening as Manhattan, other dining-out options appeared on the scene. The first is actually the appearance of, as you say, ethnic eating establishments! These were founded either within an immigrant community to serve the social function of restaurants as well as the hunger-satisfying one; or as lunchtime quick-stops for wage workers (which would eventually evolve into diners). These places do seem to have appealed primarily or entirely to the specific immigrant community they were founded and run by, though.\n\nThe second was the rise of ice cream parlours! Although ice cream had been on elite restaurant menus as a final course since the 1830s, it was actually increasing attention to women's roles in public as consumers and shoppers that spurred the popularity of ice cream parlours. They were built and marketed as the *ladies'* alternative to saloons and taverns--places where alcohol (the man's/adult's drink) was not sold but sweet things (children's food) were.\n\nIn 1798, John Byng preached the refined, civilized glory of the London coffeehouse over the country bumpkin alehouse. In 1898, women ducked into ice cream parlours while out shopping, maybe with a kid in tow. I think it's really interesting how directly the evolution of \"dining out\" across the American 19th century mirrors and even reinforces social stratifications in society. But this just goes back to the coffeehouse owners of a earlier age, and the medieval feast hosts before them, who understood that food can be a social experience as much as a culinary one.",
            "title_similarity": "0.677184"
        },
        {
            "id": "gxyvo2t",
            "score": 147,
            "text": "Oh boy, a question I can actually answer after so many years!\n\nSo, to touch on the Romans, the answer is yes, but not in the sense of going out to eat a particular cuisine in a restaurant. Street food was very much a thing in the ancient Roman world, but mostly consisted of cooked breads or meats that a worker could grab on the go, but the idea of a sit-in restaurant wouldn't come about for millennia. However, one of the staples of Roman society (at least for the middle and upper class elites) was the dinner party. These were one of the most important gatherings in the strictly defined Roman social arrangement and were one of the handiest ways for the elite to reinforce their position over their less-affluent social underlings. \n\nBy the end of the Republic and the early Imperial age the expansion of the vast Roman Empire and the contact with foreign cultures it necessarily brought led to Roman writers beginning to question what constituted the traditional Roman identity, and this included cuisine. The \"traditional\" Roman food was that of the earliest Italians and Romans - pork and emmer. Emmer was eaten not as bread but as a porridge, *puls*, and Purcell notes that this choice of preparation is distinctively Roman. This was the humble, honest food of a working, farming people, not decadent like the Greeks to the east whom they were coming into contact with in the earliest years of Roman expansion on the Italian peninsula. Ovid describes in the Fasti that in the idyllic days of history, the only food eaten by Roman men was beans, spelt and pork. He explicitly states that fish, shellfish and fowl were not eaten, and so they are not “Roman” food. Eventually this did give way to imported cereals and vegetables and fruits from the south which were subsumed into the Roman food identity but the basic image of what was \"proper\" Roman food remained similar throughout. \n\nSo these are the \"non-ethnic\" foods, what about the foreign food? Generally speaking, food travelled westwards in the Mediterranean. Many types of food such as the peach, the apricot, the chicken were all brought from more eastern climes and cultivated and grown in Greece and later Italy. Much of this happened before the time of the Roman empire, and in fact the famously Roman wine relied on the transportation of Greek viticulture into Italy. By the time the Empire was in full swing (1st centuries BCE and CE or so) the inclusion of foreign and exotic foodtypes into an elite Roman's dinner was highly desirable and relatively commonplace. Even in the satires of Juvenal – who is so often decrying the loss of true Roman values and is none too pleasant regarding the Syrian people, he is happy to grow Syrian pears on his estate. Furthermore, they are part of his ideal meal, representing the virtues of an honest, home-grown country meal.\n\nThat's not to say that every Roman's meal was filled with the lavishes of the empire. In fact, a good deal of Roman meals, though far more lavish than the “pork and spelt” of old, do seem to feature typically Roman ingredients, most of which were most likely sourced locally from no further than the Italian peninsula, probably closer to the site of the meal (Dalby). From this we can determine that it was a conscious choice to eat foods that were not traditionally Italian, not a happy accident of living in the empire. Fresh food seems to have been preferred which would naturally call for local food over imported. It also allows the host of a dinner party to boast that he has sourced the ingredients from his own estates, thus making the meal rustic and home-grown, no matter how lavish, which for more conservative Romans was seen as desirable. As a bonus, of course, it would also have been cheaper than buying them at a market. To think that these meals were purely Roman affairs is wrong, though, as they often featured accoutrements, flavourings, aromas and spices from exotic lands and while they may have taken a good deal of ingredients from close to home, very few meals we find in the literature are devoid of any exotic items. Not quite fusion food, but primarily Roman cuisine with added extras. \n\nRomans dinner hosts were well aware of what was imported food and what wasn't, and given the expense of importing food from abroad into Italy (or elsewhere) it was a clear sign of luxury. There are lots of references of parties featuring food from Greece, Anatolia, Africa and even as far as India, and there were ingredients and dishes mentioned by authors that would have had to be imported as they could not have been locally grown in Italy. It's also worth mentioning that the aforementioned street food could, depending on where it was located, consist of foreign-style foods as techniques and styles were brought over by immigrants and slaves who might continue cooking and eating the kind of food they were used to back home - but this would've been localised and quick and wouldn't have been the kind of thing a less affluent urban Roman would \"go out\" to eat in the evening. \n\nSome did feature foreign foods more than others, though. A dinner held for the college of pontiffs in Rome, on the occasion of a member's inauguration at which Julius Caesar was present featured an extraordinary variety of food. It is likely that almost all of the ingredients will have been found near Rome, but the types of food being eaten are very telling. Shellfish, seafood in general, was considered a very Greek thing to eat and the pontiffs' meal is very heavy on them – mussels, oysters, palourdes, piddocks, clams etc. The significance of this meal must be emphasised. The pontiffs were symbols of Roman tradition and culture, and a gathering of such would not have been viewed lightly: they symbolised the *mos maiorum* (ancestral traditions) and would have been expected to behave suitably “Roman” when acting in this sacred position. Cicero lays out just how important the pontiffs were in Rome and how important they were viewed in Roman culture (although he was flattering them just a little bit): “being such that the dignity of the whole republic, the safety of all the citizens, their lives, their liberties, their altars, their hearths, their household gods, their properties and condition as citizens, and their homes, all appear to be committed and entrusted to your wisdom, integrity, and power.”\n\nThese were important Romans, then. Also present at the meal are four Vestal Virgins, bastions of Roman religious tradition. They too are notable, for the same reasons as with the pontiffs but also because their position provides a clear contrast with the meal. One of the duties of the Vestals was to prepare and mix the grain and salt which was to be used in the religious rituals in Rome, these two ingredients being significant in Roman culture as we have seen, so they provide us with evidence that their important position involved food as a means of social identity. Pliny actually contrasts the use of salted spelt in religious ceremonies as offerings to the gods with the practice of using foreign spices for the same – saying that the gods are better disposed to the humble Roman offering than the foreign goods. However we don't find these men and women eating moderate meals of pork and spelt, as we might expect those who uphold the traditions of Rome to do. They are instead reclining to eat a luxurious and elaborate meal with ingredients that we know to have been viewed as essentially Greek in nature, despite the occasion being steeped in \"Romanness\".\n\nRomans were very aware of what was foreign or ethnic food and what wasn't. When the elites held their dinner parties, there was a clear choice made as to whether it would be a typically Roman offering - whether that was exclusively the humble food of old or more a recognition of food that had been grown on the Italian peninsula as being Roman - and food that was considered foreign in style or taste. Therefore, it was a conscious decision as to whether a meal would be deliberately \"ethnic\" in design or considered more Roman - it was possible to fashion meals without any of the empire's exotica and for the wealthy it was possible to put spreads on that showcased the Roman's reach around the ancient world. Those in attendance would have been well aware of what they represented and most likely specifically where they came from and would have been conscious of what parts of a meal, if it was not wholly of foreign style, were \"not Roman\".\n\n\nSources:  \nPurcell, N, “The Way We Used To Eat: Diet, Community and History at Rome” in The American Journal of Philology, Vol. 124, No. 3, Special Issue: Roman Dining (Autumn, 2003), pp. 329-358 \n\nDalby, A. Empire of Pleasures: Luxury and Indulgence in the Roman World (Routledge, 2000)\n\nWilkins, J. and Hill, S. Food in the Ancient World (Blackwell, 2006)\n\nOvid, Fasti, trans. Boyle, A.J.\n\nCicero, de Domo Sua\n\nPliny the Elder, Natural Histories: A Selection, trans. Healey, J (Penguin Classics, 1991)\n\nJuvenal, The Sixteen Satires, trans. Green, P. (Penguin Classics, 1974)",
            "title_similarity": "0.80149215"
        }
    ]
}