{
    "Let's educate ourselves on the history of Israel/Palestine\nHi everyone,\n\nThis post is somewhat unorganized, I am having a hard time putting my thoughts together.\nAlso, I am not sure that this is the right sub for it.\n\nI want to educate myself on the history of this conflict and I need help in getting objective sources untainted by political interests and such. I'd like to build some kind of timeline based on these sources to put everything together in one place, so that anyone could dive into it to some depth.\n\nI am of jewish ancestry but I am an atheist. I live in Tel-Aviv, Israel.\n\nI was just reading the news and I am shocked, people are organizing in mobs and spread violence, jews chant \"death to all arabs\" and arabs chant \"death to all jews\".\nThe concept of hurting a random person, be it a jew or an arab, based on their race is mind boggling to me. I can't understand it.\n\nI never cared for politics and history and so I feel clueless, even though it's all happening under my nose. The internet is full of lies and given a text, I can't differentiate between truth and fiction. Parties with interesets take advantage of social platforms to spread disinformation. \nThe only thing I understand is that I hate racism and I want to  spread some common sense and make an impact.\n\nPlease help me educate myself on the subject.": [
        {
            "id": "gy0oh85",
            "score": 1,
            "text": "Hi there anyone interested in recommending things to OP! While you might have a title to share, this is still a thread on /r/AskHistorians, and we still want the replies here to be to an /r/AskHistorians standard - presumably OP would have asked at /r/history or /r/askreddit if they wanted non-specialist opinion. So give us some indication why the thing you're recommending is valuable, trustworthy, or applicable! Posts that provide no context for why you're recommending a particular podcast/book/novel/documentary/etc, and which aren't backed up by a historian-level knowledge on the accuracy and stance of the piece, will be removed.",
            "title_similarity": "0.6992942"
        },
        {
            "id": "gy0i7xb",
            "score": 26,
            "text": "Welcome to /r/AskHistorians. **Please [Read Our Rules](https://www.reddit.com/r/AskHistorians/wiki/rules) before you comment in this community**. Understand that [rule breaking comments get removed](https://www.reddit.com/r/AskHistorians/comments/h8aefx/rules_roundtable_xviii_removed_curation_and_why/).\n\n#Please consider **[Clicking Here for RemindMeBot](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps://www.reddit.com/r/AskHistorians/comments/nboxcw/lets_educate_ourselves_on_the_history_of/%5D%0A%0ARemindMe!%202%20days)** as it takes time for an answer to be written. Additionally, for weekly content summaries, **[Click Here to Subscribe to our Weekly Roundup](https://www.reddit.com/message/compose/?to=AHMessengerBot&subject=Subscribe&message=!subscribe)**.\n\nWe thank you for your interest in this *question*, and your patience in waiting for an in-depth and comprehensive answer to show up. In addition to RemindMeBot, consider [using our Browser Extension](https://www.reddit.com/r/AskHistorians/comments/d6dzi7/tired_of_clicking_to_find_only_removed_comments/), or getting the [Weekly Roundup](https://www.reddit.com/message/compose?to=subredditsummarybot&subject=askhistorians+weekly&message=x). In the meantime our [Twitter](https://twitter.com/askhistorians), [Facebook](https://www.facebook.com/askhistorians/), and [Sunday Digest](https://www.reddit.com/r/AskHistorians/search?q=title%3A%22Sunday+Digest%22&restrict_sr=on&sort=new&t=all) feature excellent content that has already been written!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AskHistorians) if you have any questions or concerns.*",
            "title_similarity": "0.56352586"
        },
        {
            "id": "gy343m1",
            "score": 213,
            "text": "Well if you think the internet is full of lies, good luck with the sources, they’re just as biased as the internet. Anyway...\n\nIf you want to fully understand the conflict I suggest you start with the beginning of Arab nationalism in the Ottoman Empire. Egypt, Syria and The Arab Revolt are the key places. In Egypt you’ll go down the al-Afghani/Muhammad Abduh path towards the Wafd, here you’ll see roughly two types of nationalism, new-elite nationalism and popular nationalism. In Syria much of the same happened, but you’ll see new modernisation theories being applied. Both lead to the Sherif Revolt, which will explain what was promised to the Arabs (Note that, if I recall correctly, Palestine was never promised to the Sherif), and what was actually given. Whilst studying the Revolt you’ll come across the Balfour declaration, which is now infamous. Here you’ll see a lot of perspectives about the intent of the declaration. This is basically the introduction to the conflict. \n\nNext you should study the mandate period, which is where things get messier. There’s revolts in Palestine and Iraq, Jewish immigration starts and the son of the Sherif, Faisal, is expelled from Syria by France after he tried to start the kingdom that was promised to him. He’s an interesting character, juggling between being an Arab nationalism icon and a British ally during his reign in Iraq. This shows another part of the problem, the UK wanted to have a good reputation with the Arabs but allowed Jewish immigration to go on (even though they, at several times, curtailed it). Whilst this is happening, the Jewish community settling in Palestine is roughly divided between moderates and radicals. I can’t exactly recall what each group wanted but I think the radical set up violent and paramilitary organisations in the Jewish areas, which would later help establish the state of Israel in 1948, but also bullied the local Palestinian population. \n\nYou should study 1948 (and leading to it) with great detail, because, in my opinion, this is where the deep\nscars of the conflict come from. Unfortunately I haven’t studied it enough to be sure of what I am saying, so instead I’ll provide some sources. After 48 you’ll see why Arab nationalism is important, as several wars break out between Israel and her neighbours. \n\nTo sum up, to understand the start of the conflict you need to study both Jewish and Arab movements before 1948. Furthermore, you should familiarise yourself with the history of the countries around Israel, since they contributed greatly to the conflict. In the end I don’t think you’ll come to a conclusion, academic history has many shades of grey, there’s theories and debates, and in the end, no one is ‘right’ in causing death and destruction, whichever your identity is.\n\nSources:\n\nArab revolt/Mandates -\n\nWilson, M.C., (1991) “The Hashemites, the Arab Revolt, and Arab Nationalism”\n\nSluglett, P., (2004) “Les Mandates/The Mandates: Some Reflections on the British Presence in Iraq (1914-1932) and the French Presence in Syria”\n\nJames L. Gelvin, “The League of Nations and the Question of National Identity in the Fertile Crescent”\n\n1948-\n\nMorris, B., (2004) “Chapter 2: The idea of ‘transfer’”\n\nKhalidi, R.,  (2007) “The Palestinians and 1948 the underlying causes of failure”\n\nAvi Shlaim, “The Debate about 1948”\n\nShabtai Teveth, “Charging Israel with Original Sin”",
            "title_similarity": "0.6927767"
        },
        {
            "id": "gy0tzxw",
            "score": 947,
            "text": "You may be interested in [this very similar question](https://www.reddit.com/r/AskHistorians/comments/nbg7q3/can_someone_explain_the_history_of_the/) by u/Inaerius from a few hours ago, and the answers it receives, or r/AskHistorians' [FAQ on the Middle East](https://www.reddit.com/r/AskHistorians/wiki/middle_east#wiki_the_history_of_israel.2C_palestine_and_the_conflict_between_the_jews_and_muslims).  Since these are on r/AskHistorians, they presumably meet the subreddit's standards.",
            "title_similarity": "0.6837679"
        },
        {
            "id": "gy1jw25",
            "score": 506,
            "text": "Would love to get any book recommendations on this as well.",
            "title_similarity": "0.4187618"
        },
        {
            "id": "gy2hoyt",
            "score": 2,
            "text": "[removed]",
            "title_similarity": "0.1724405"
        },
        {
            "id": "gy3bcv2",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "0.1724405"
        },
        {
            "id": "gy4msoj",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.1724405"
        },
        {
            "id": "gy6hbe1",
            "score": 31,
            "text": "People have already referred you to the /r/askhistorians book list which has a decent selection (the Charles D. Smith book is probably the best general overview of the conflict and it's one of the standard college textbooks on the subject so maybe start there). Here's a bunch of other books I'd recommend on the subjects of Israel, Palestine, Zionism and Palestinian nationalism. I think these books provide a solid grounding in some of the most important and interesting aspects of and trends in Israeli and Palestinian history, particularly the Ottoman era, though it is far from comprehensive. In particular I'd love it if someone could provide more works about Palestinian social and internal political history post-1948 as those aren't subjects I've studied as much. I tried to include both Israeli and Palestinian scholars (as well as scholars who are neither) though given my own academic background in Jewish history I'm more familiar with the former. Also, keep in mind that a scholars national origins do not necessarily indicate their views. Some notable authors of Palestinian history whose works I haven't read include Nur Masalha, Beshara Doumani, Alexander Schölch and Neville Mandel.\n\n**Zionism & Palestinian Nationalism**\n\n*The Zionist Ideology* by Gideon Shimoni- A relatively thick volume this is (IMO) by far the most comprehensive history of Zionist ideology before 1948 there is. It covers the pre-Herzl origins of the movement and devotes different chapters to to exploring the diversity of the Zionist movement from the Buberites who advocated a bi-national Jewish-Arab state to the most right wing Revisionist Zionists who Ben-Gurion described as \"Jewish Nazis\". It's a thick book (almost 400 pages) but if there's one book you get on Zionism it should be this one.\n\n*Zionism a Brief History* by Michael Brenner- Much lighter reading than Shimoni's work (fewer than 170 pages). While Shimoni's book focuses more on the various ideological aspects and developments of Zionism, Brenners work functions more as an historical overview of the movement as a whole and functions more as a historical narrative whose scope ranges from the origins of the movement to present day debates over post-Zionism. Overall the book serves as a good introduction to Zionism and it's history.\n\n*The Rise of the Israeli Right From Odessa to Hebron* by Shindler: This book traces the historical evolution of the right wing of Zionism  from Jabotinsky and the Lehi to Netanyahu and Sharon. It is a great way to understand how the Likud came to dominate a country that had been founded by Labour Zionists.\n\n*Remembering and Imagining Palestine: Identity and Nationalism from the Crusades to the Present* by Haim Gerber- The counterpart to the Zionist movement was the development of Palestinian nationalism and this book explores the historical origins of the latter and how it evolved into a fully fledged national identity before tracing the history of that identity in the 20th century. Gerber is an Israeli and his book seeks to push back against claims in traditional Zionist historiography that Palestinian nationalism was solely a reaction to the Zionist movement and argues that Palestinian identity has independent and older origins.\n\n*Palestinian Identity* by Rashid Khalidi: Khalidi is one of the biggest names of Palestinian history and this book is probably one of his most important as it traces the origins of modern Palestinian national identity. The book seeks to establish the independent origins of Palestinian nationalism and does so by looking at figures from every level of Palestinian society from the Ottoman era onwards.\n\n*Planted Flags* by Irus Braverman- A fascinating look at the role of trees within Jewish and Palestinian nationalism. Braverman examines the role of pine trees and the Jewish National Fund within Zionism as well as the role of olive trees and their cultivators within Palestinian nationalism as well as how each side views the trees of the other.\n\n**General Histories**\n\n*Side by Side: Parallel Histories* of Israel-Palestine by Adwan, Bar-On and Naveh- A somewhat unique book in terms of format, this work was a collaboration between Israeli and Palestinian history teachers with the objective of presenting historical narratives as they are taught in school to students on both sides. The left-hand pages present the Israeli narrative and the right-hand pages the Palestinian one.\n\n*Israel a History* by Anita Shapira: A good overview of Israeli history (beyond just the conflict) from the POV of a Liberal Zionist historian. It covers the political, social and economic background of Israel which is arguably essential to understanding the conflict with Palestinians and the wider Arab world. Shapira also includes a lot of book recommendations at the end of each chapter to encourage further reading which you may find useful.\n\n*The 100 Years War on Palestine A History of Settler Colonialism and Resistance, 1917-2017* by Khalidi: Viewing the conflict through the lens of settler colonialism, Khalidi's most recent book examines the history of Zionist and Israeli clashes with Palestinians and the Arab world and his chapters are organized around certain key eras in the history of Israel and Palestine.\n\n*Between Ruin and Restoration: An Environmental History* of Israel by Orenstein, Tal & Miller- A collection of scholarly essays on the environmental history of the land of Israel/Palestine over the last 150 years. Covering topics such as the impact of conflict on environment, the role of water, and the development of environmentalism and green politics within Jewish and Arab society, this book is a great read on a little discussed aspect of Israel and Palestine.\n\n*Struggle for Survival in Palestine/Israel* edited by Levine & Shafir- This book consists of a multitude of biographies of mostly ordinary individuals (both Israeli and Palestinian) including, activists, refugees, immigrants and Rabbis who have been involved in the conflict in one way or another over the past century. This work, written by a number of scholars, highlights the human element of the conflict; how it has shaped the lives of these people and vice-versa.\n\n**Ottoman Palestine**\n\n*Ottoman Brothers* by Michelle Campos: This is a really interesting book that looks at the role of Ottomanism in late Ottoman Palestine after the 1908 revolution. It looks at the ways that both Jews and Arabs embraced a common imperial identity at a time when their own national movements were emerging. This work is especially good for anyone interested the role of the Ottoman Empire in this conflict.\n\n*Arabs and Jews in Ottoman Palestine* by Dowty: This book looks at the Ottoman roots of the Israeli-Palestinian conflict by examining the encounter between Zionist Jews and Arabs and puts particular emphasis on the period of the First Aliyah (defined by Dowty as 1882-1904) which is often underemphasized in other histories. It's a very readable introduction to the Ottoman era and if you only read one book about this era it should be this one.\n\n*Defining Neighbors* by Jonathan Gribetz: This book is important for understanding the earliest origins of the conflict as it looks at how both Zionists and Arabs in Ottoman Palestine viewed and understood one another. To quote the Amazon blurb on the book, \"Gribetz shows how these communities perceived one another, not as strangers vying for possession of a land that each regarded as exclusively their own, but rather as deeply familiar, if at times mythologized or distorted, others\".  \n\n*An Unpromising Land Jewish Migration to Palestine in the Early Twentieth Century* by Alroey: This book looks at the Jewish immigrants to late Ottoman Palestine and asks who they actually were and what did they experience when they arrived? Why did they choose to go there as opposed to more popular destinations such as America or Argentina and to what extent were they actually motivated by and committed to Zionism? In answering these questions Alroey traces the lives of these immigrants from their motivations and decision to emigrate to their arrival in and (in the case of many who came in the initial aliyot) departure from Ottoman Palestine.\n\n*Land, Labor and the Origins of the Israeli-Palestinian Conflict, 1882-1914* by Shafir: Gershon Shafir is one of Israel's \"New Historians\" and this is one of his most important works. Viewing Zionism as a form of colonialism, Shafir looks at the rise of Jewish agricultural settlements during the Ottoman era and how they led to hostilities with the Arab Palestinian population.\n\n*The Great War and the Remaking of Palestine* by Salim Tamari- An examination of Palestinian society and nationalism in the early twentieth century and how World War One impacted the development of both.\n\npt.1\n\nEdit: Forgot to italicize book titles.",
            "title_similarity": "0.7164705"
        },
        {
            "id": "gyqo12c",
            "score": 3,
            "text": "Recommend “Bitter Harvest” by  Sami Hadawi.  Like you, I was looking for historical, timeline information to better understanding this long, standing conflict. Well historically footnoted work that helped me understand the Palestinian viewpoint.",
            "title_similarity": "0.7548454"
        }
    ]
}