{
    "How did tracksuits (especially the ones with stripes on their sides) become an inherent part of Russian/East Slavic culture?\nMy grandma was telling me a story about visiting Russia in the mid 70' and remembered that in GUM (the main shopping mall in Moscow) tracksuits cost more than confectionary suits. Even more that they visited a spa and that they would wear them there too. She hypothesised that it could have been the price of man amde materials, but couldn't say for sure.\n\nHave they been a status symbol? And how did they stay popular till today?": [
        {
            "id": "gybv6fp",
            "score": 1,
            "text": "Welcome to /r/AskHistorians. **Please [Read Our Rules](https://www.reddit.com/r/AskHistorians/wiki/rules) before you comment in this community**. Understand that [rule breaking comments get removed](https://www.reddit.com/r/AskHistorians/comments/h8aefx/rules_roundtable_xviii_removed_curation_and_why/).\n\n#Please consider **[Clicking Here for RemindMeBot](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps://www.reddit.com/r/AskHistorians/comments/ndpx06/how_did_tracksuits_especially_the_ones_with/%5D%0A%0ARemindMe!%202%20days)** as it takes time for an answer to be written. Additionally, for weekly content summaries, **[Click Here to Subscribe to our Weekly Roundup](https://www.reddit.com/message/compose/?to=AHMessengerBot&subject=Subscribe&message=!subscribe)**.\n\nWe thank you for your interest in this *question*, and your patience in waiting for an in-depth and comprehensive answer to show up. In addition to RemindMeBot, consider [using our Browser Extension](https://www.reddit.com/r/AskHistorians/comments/d6dzi7/tired_of_clicking_to_find_only_removed_comments/), or getting the [Weekly Roundup](https://www.reddit.com/message/compose?to=subredditsummarybot&subject=askhistorians+weekly&message=x). In the meantime our [Twitter](https://twitter.com/askhistorians), [Facebook](https://www.facebook.com/askhistorians/), and [Sunday Digest](https://www.reddit.com/r/AskHistorians/search?q=title%3A%22Sunday+Digest%22&restrict_sr=on&sort=new&t=all) feature excellent content that has already been written!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AskHistorians) if you have any questions or concerns.*",
            "title_similarity": "0.40293348"
        },
        {
            "id": "gyd63yu",
            "score": 686,
            "text": "[removed]",
            "title_similarity": "-0.095173426"
        },
        {
            "id": "gydt7ae",
            "score": 380,
            "text": "Wow, longtime lurker and I can *finally* answer something! Fingers crossed I cited enough for the mods.\n\nAs is often the case with fashion, how a particular trend came to be a cornerstone relies on several reinforcements over time. Although I'm certain there are even more reinforcements I'm not aware of, let's focus on how the 70s, 80s, and 90s reinforced tracksuit love in different ways.\n\n*First let's take a stroll down memory lane with general clothing production issues in the 1970s:*\n\nAlthough the USSR had subsidies for children's clothes, adult clothes were largely difficult and expensive to buy^(1) due to limitations of in-state producers and artisans coupled with the obvious ban on imported consumer goods. Two-thirds of an average worker's wages would have been devoted to food and clothing with the latter being scarce as the USSR focused on investment over production. The USSR tried to confront the issue several times after the population failed to make their own clothing as initially recommended. In a decade's time (mid-1960s to mid-1970s) clothing production had increased by 2.5x, however the demand was still far higher than the production.^(2) \n\nJust because you lived in the USSR did not mean brand name was meaningless to you. We can see this with the incredibly popular Levi jeans which would have cost you about 200 rubles ($270 USD).^(3) Despite this price point and difficulty in buying an American brand, Levis were seen in the USSR fashion especially that of youths. Any foreign brand name you wanted would be very expensive *if* you could get it. Even if you don't care about brands another thing to consider is that most of the USSR is *quite* cold meaning you would need heavy (expensive) winter clothes. So how do people keep their expensive and hard to find clothes nice? The way that many societies have throughout time - house clothes. At home women would have changed into an outfit consisting of a simple dress and for men it would have been what we think of as track clothes today (a sweatshirt and loose pants).\n\n*Oh, how I love old memories, but if we were to pop in a tv-recorded VHS from 1980 we might see a fraction of a big event many countries boycotted:* The 1980 Olympics in Moscow. Clothing was still in high demand and production was not at a pre-soviet level, but obviously the home team needed to look sharp. You would have to recognize it by its iconic stripes because the USSR's team stripped the logos right off the German-made Adidas tracksuits they donned.^(4) These Olympic tracksuits had a clear impact on Soviet fashion trends, but only insomuch as any Olympic event would have on the host country.\n\n*Ring, ring, ring... what's that? The 90s just called and let me know that jogging is cool now.* That's right - up until the late 80s/early 90s jogging for exercise was not that common. As it became popular as a hobby so did fashion surrounding jogging which of course included tracksuits. This new style of athletic clothes for the average person became popular worldwide and just like with denim in the 70s - Soviets wanted it. Similar to the example of Levis in the 70s, name brand athletic clothes also would have been incredibly expensive. So expensive, in fact, they become a status symbol and who loves status more than gangsters? \n\nAlthough the USSR had \"fallen,\" the black market created by rising demand and stifling production lived on giving plenty of opportunities for a gopnik to make a dime. And what does a gopnik wear you might ask? Only the finest brand name clothes which naturally includes the coveted adidas tracksuit.^(5) \n\nSo now we have a fashion that grew from the necessity of comfy and cheap house clothes and then became mainstream through athletics. Many soviets would have grown up wearing house clothes and associating them with comfort and home, once that fashion became a status symbol all bets were off. Who doesn't want to be comfortable and look expensive?\n\n&#x200B;\n\n1. Cook, L. J. (1993). The Soviet social contract and why it failed: welfare policy and workers' politics from Brezhnev to Yeltsin. Harvard University Press.  \n2. Johnson, B. P., \\&amp; Raynes, E. A. (n.d.). The Quality of Life in the Soviet Union. The Research Foundation of CUNY Queens College.\n3. Tempest, Richard. “Youth Soviet Style,” Problems of Communism, May-June, 1984, 60-64.\n4. Routledge Handbook of Sport and Politics. (2019). S.I.: Routledge.\n5. Eror, Aleks. “Dizelaš: The ‘Serbian Gopnik’ Style That Defined the 90s Is Making a Comeback.” The Calvert Journal, 6 Sept. 2017, www.calvertjournal.com/articles/show/8931/dizelasi-serbian-gopnik-style-90s-comeback.",
            "title_similarity": "0.80652094"
        },
        {
            "id": "gyda5qw",
            "score": 2417,
            "text": "I have Russian origin, my parents lived through that time, and I'm deeply interested in different topics of history, but I'm not a professional historian by any means. I hope the quality of my answer and my sources will satisfy the standards of this subreddit.\n\nWhen we talk about clothing and consumer goods in the Soviet Union in general, two things are important to understand: everything \"Western\", starting from simple blue jeans, was automatically a status symbol and getting nice clothes was a challenge because the planned economy rarely produced what the customers wanted. It led to the emergence of \"the second economy\", a huge black market the size of a country. A fairly detailed description of this phenomenon is provided in [this paper](https://www.ucis.pitt.edu/nceeer/1986-620-5-O'Hearn.pdf). Although it was written in the mid-80s, the phenomenon it describes had been evolving, I'd say, since at least the early 70s.\n\nNow let's get to tracksuits in general and Adidas tracksuits in particular. Adidas was one of the very first \"Western\" brands the Soviet citizens learned about: already in the 1960s they saw athletes from the friendly German Democratic Republic wearing Adidas tracksuits during the events that were shown on TV. Don't forget that back then the USSR had a [sizeable military presence in East Germany](https://en.wikipedia.org/wiki/Group_of_Soviet_Forces_in_Germany), and while contacts between the soldiers and the locals were limited, it was absolutely possible to buy German consumer goods, bring them to the Soviet Union and re-sell with a huge margin. \n\nLove for Adidas increased tenfold right after the 1980 Olympics in Moscow. For many Soviet citizens, the Olympics were a window to the West that opened in an instant and introduced many consumer goods (still a \"deficit\") previously unheard of - for example, Coca Cola ([see here, not an academic source](https://www.rbth.com/history/330168-soviet-pepsico-and-coca-cola)) and Pepsi ([here](https://www.rbth.com/business/327568-pepsi-first-russia) - its production started earlier but by anecdotal evidence it was completely out of reach for the average Soviet citizen).\n\nFor the 1980 Moscow Olympics, Adidas manufactured the sportswear for the Soviet team. However, the USSR Communist party leaders forbid to put the labels of the capitalist company on tracksuits of Soviet athletes. Traditional three stripes were limited to one red. The dress shoes preserved its stripes, since the stripes resembled the letter “M”, stressing that the Olympics were taking place in Moscow. Although the company name did not appear on clothing, sneakers and tracksuits Adidas become wildly popular in USSR. Since then, it became THE sports wear label. According to some sources, Adidas even started production in the Soviet Union in 1979. Some more info can be found in [this article from Sueddeutsche Zeitung](https://worldcrunch.com/business-finance/retro-sports-diplomacy-adidas-and-the-iron-curtain) and there is even a [book on the subject](https://www.amazon.de/Unternehmen-Sport-Die-Geschichte-adidas/dp/3827501229). \"Western\" clothes, famous German quality and no alternatives - comfortable Adidas tracksuits were bound to succeed.\n\nNow, how did Adidas tracksuits stay popular until 2000? (They are still popular today, I'll just omit the last 20 years not to break the subreddit rules). To answer this question, let's take a look at what happened right after the collapse of the Soviet union. With the economy in shambles and underfunded police, organized crime took hold. Being in a gang was the fastest way to get rich, and the newly rich almost always had some ties to the organized crime. Gangs actively recruited former police officers, veterans and athletes. [This paper](https://www.ojp.gov/pdffiles1/nij/187085.pdf) provides more info on the phenomenon: although it's focused on one Russian region, the situation was the same throughout the country. (There are quite a lot of academic sources on the subject, this was the one with its full text freely available without registration). Tracksuits became the uniform of the mob because they still were the status symbol from the Soviet times and because this is what so many former athletes, now in the mob, used to wear. I didn't have enough time to find good sources on the role of \"romance of prison\" in Russia in the 90s but I'm sure there are plenty. The younger generation, fascinated by the mob and the prison culture, followed suit (no pun intended) - that's how the *gopnik* culture was born and Adidas tracksuits gained popularity among them.",
            "title_similarity": "0.7786341"
        },
        {
            "id": "gycajs3",
            "score": -8,
            "text": "[removed]",
            "title_similarity": "-0.095173426"
        }
    ]
}