{
    "In Vietnam War movies, you constantly see American soldiers wearing altered uniforms like torn sleeves and bandanas, and using non-standard equipment like bows and arrows. How common was this really? Why isn't it as present in WWII or Afghanistan War films / reality?\n": [
        {
            "id": "gyy23z1",
            "score": 1,
            "text": "Welcome to /r/AskHistorians. **Please [Read Our Rules](https://www.reddit.com/r/AskHistorians/wiki/rules) before you comment in this community**. Understand that [rule breaking comments get removed](https://www.reddit.com/r/AskHistorians/comments/h8aefx/rules_roundtable_xviii_removed_curation_and_why/).\n\n#Please consider **[Clicking Here for RemindMeBot](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps://www.reddit.com/r/AskHistorians/comments/nhtm7n/in_vietnam_war_movies_you_constantly_see_american/%5D%0A%0ARemindMe!%202%20days)** as it takes time for an answer to be written. Additionally, for weekly content summaries, **[Click Here to Subscribe to our Weekly Roundup](https://www.reddit.com/message/compose/?to=AHMessengerBot&subject=Subscribe&message=!subscribe)**.\n\nWe thank you for your interest in this *question*, and your patience in waiting for an in-depth and comprehensive answer to show up. In addition to RemindMeBot, consider [using our Browser Extension](https://www.reddit.com/r/AskHistorians/comments/d6dzi7/tired_of_clicking_to_find_only_removed_comments/), or getting the [Weekly Roundup](https://www.reddit.com/message/compose?to=subredditsummarybot&subject=askhistorians+weekly&message=x). In the meantime our [Twitter](https://twitter.com/askhistorians), [Facebook](https://www.facebook.com/askhistorians/), and [Sunday Digest](https://www.reddit.com/r/AskHistorians/search?q=title%3A%22Sunday+Digest%22&restrict_sr=on&sort=new&t=all) feature excellent content that has already been written!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AskHistorians) if you have any questions or concerns.*",
            "title_similarity": "0.43830872"
        },
        {
            "id": "gyylvz0",
            "score": 17,
            "text": "[removed]",
            "title_similarity": "0.14555925"
        },
        {
            "id": "gyz1t7n",
            "score": 58,
            "text": "[removed]",
            "title_similarity": "0.14555925"
        },
        {
            "id": "gz19r60",
            "score": 591,
            "text": "Apologies if formatting is off. I’m writing this at 2 AM on my iPhone. \n\nTL; DR: Unique supply constraints in Vietnam made resupplying troops with fresh uniforms impossible. \n\nA similar question was asked about several years ago, with a [great answer](https://www.reddit.com/r/AskHistorians/comments/1m5x69/how_were_uniforms_modified_by_soldiers/) with regard to the British military’s uniform modification given by /u/vonstroheims_monocle. \n\nIn short, as /u/vonstroheims_monocle writes, the weather of any given locale plays a major role in the decision of troops to make modifications to their uniforms. Given Vietnam’s swelteringly hot and humid climate, it makes sense that forward operating infantry would modify their uniforms to make it easier to do their jobs. But this observation doesn’t get precisely at your question, which is why, at least in popular media, military personnel in Vietnam appear to have had greater leeway in customizing their uniforms; sure, Vietnam’s climate was the root cause behind why troops chopped off their sleeves, but the reason why those modifications and any type of choice uniform artistry stuck around—not just in-country but in media—has everything to do with *supply and logistics.*\n\nVietnam wasn’t the first time that the American military had fought in humid jungle climate. World War II’s Pacific Theatre pitted the Americans against the Japanese in such jungle terrains as Guadalcanal. Since 1958, in fact, the American military has used part of the island of Okinawa as home to the Marine Corps’ Jungle Warfare Training Center. \n\nWhat made Vietnam different was the American military’s access to stable and secure supply lines, or, rather, its lack thereof. As the Department of the Army’s Vietnam Studies section notes in *Logical Support*: “For the first time in modern history, the U.S. Army was required to establish a major logistical base in a country where all areas were subject to continuous enemy observation and hostile fire, with no terrain under total friendly control.”\n\nTo cut through the military jargon, the Army is saying that, resupplying deep jungle patrols aside, *even setting up a supply base* in contested territory was a true challenge. Surrounded on all sides by jungle and villages, both of which could be home to Vietcong guerillas, any foothold carved out by the U.S. was in constant danger. Understandably, this meant that logistical bases, especially those deep in-country, could not be stocked with every good that Uncle Sam had to offer—often, there was only room for the bare essentials: fuel, firepower, and food. \n\nBut say the military did set up a logistical base and would, periodically, send out active patrols from within its precarious position. What challenges would arise from that? The authors of *Logistical Support* point out another problem: “There was no communications zone; in fact, combat and communications zones were one and the same, and the logistics soldier was frequently and quite literally right with the front line tactical soldier.” Again, to translate, this meant that the guys who were supposed to be coordinating resupply—which could include uniform items—were, “frequently,” trudging through the jungle alongside the grunts. One can’t exactly fault a logistical troop for not focusing on logistics as he worries for his life on the frontlines. \n\nA second problem is found in the simple fact that much of Vietnam was covered in dense jungle. Considering that resupply vehicles took exactly three forms—truck, plane, and helicopter—it becomes clear that while shipping supplies into Vietnam was already an issue, actually *getting* those supplies to troops in the jungle was a whole different beast. Good luck driving a truck or landing a helicopter through dense vegetation. Airdropping supplies by plane was a good solution, but don’t forget the 3 F’s: fuel, firepower, and food! Those three were the priority and liquids, especially water, are heavy enough as-is. Simply put, it would be a waste to airdrop in uniforms, when what was most important was keeping troops in fighting shape. \n\nThis didn’t mean that the U.S. was letting its men fight in tatters. According to *Logistical Support*, when troops deployed to Vietnam in July 1967, they received “five combat uniforms and two pairs of combat boots.” A month later, in August 1967, the number of uniforms was reduced to four, but the message remained the same: those uniforms were meant to last that troop through their whole tour. If a soldier or a marine modified those uniforms in any way, given the difficulty of resupply, it was *very* unlikely that they would be offered replacements. \n\nWe can see evidence of the importance of intact supply lines in previous military engagements that were under similar, albeit more temporary, supply constraints. To return once more to WW2’s Guadalcanal, you can actually see many [pictures](https://images.app.goo.gl/WZDXeotsG5qEJuDf9) of Marines entirely leaving off their shirts as their man their posts. If you’ve ever seen the HBO series, *The Pacific*, you’d also note the general dirty, disheveled appearance of the Marines fighting on that island. This is because, during the Battle of Savo Island, the U.S. Navy was defeated by the Imperial Navy, leaving Marines onshore in Guadalcanal without many of their supplies. They did eventually manage to resupply, but not before the Marines on Guadalcanal endured a beating. \n\nFinally, I cannot comment on the durability of issued uniforms, but I can explain why some troops would continue to wear uniforms in various states of disrepair. This boils down a simple explanation: saltiness. A Marine scholar [once](https://www.jstor.org/stable/26439151?seq=1#metadata_info_tab_contents) put it this way, writing in 1996: “As used in the Marine Corps more than 40 years ago when I was doing my bit by the Cold War, *salty* was usually, though by no means always, a term of praise. To speak of an NCO, for example, that he was salty was to speak of him very well indeed... he knew how to reduce his herringbone ‘utilities’ (Marine-speak for ‘fatigues’) from a dull dark green when issued to just the right shade of ghostliness.” In other words, a good sign—though not always—that you’re in the presence of a good Marine is the state of relative disrepair that their uniform is in. That scholar is, of course, only referencing the color of a “salty” Marine’s uniform, but the point remains the same: to a fighter in-country in Vietnam, the more scuffed your uniform looked, the more experience you had and the tougher you were. \n\nNowadays, U.S. troops in the Middle East have much less leeway with what they can do to their uniforms. They can be constantly resupplied by the U.S.’ tactical superiority on all levels and, in the desert, keeping sleeves on protects against exposure to the sun. Also, tactically speaking, sleeves down protects a troop’s arms from being cut, typically when they move or fire from the prone position. But, even today, a “salty” military member will demonstrate their individuality with the faded color of their fatigues—the saltier they are, the lighter they’ll be. \n\n\n\n\nSources:\n\nU.S. Department of the Army, *Logistical Support*, Chapter III: Supply Support in Vietnam \n\nJohn Taylor, *Taking the Odium Out of Sodium*",
            "title_similarity": "0.7143152"
        },
        {
            "id": "gz03ya4",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.14555925"
        },
        {
            "id": "gz0j720",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.14555925"
        }
    ]
}