{
    "I am a 20 year old factory worker in a slum in London in 1850 without a penny to my name. I dream of traveling to exotic British India to adventure and make my fortune. Is it possible for me to do so? And if so what might I find in way of employment when I get there?\n": [
        {
            "id": "gzhzd9l",
            "score": 1,
            "text": "Welcome to /r/AskHistorians. **Please [Read Our Rules](https://www.reddit.com/r/AskHistorians/wiki/rules) before you comment in this community**. Understand that [rule breaking comments get removed](https://www.reddit.com/r/AskHistorians/comments/h8aefx/rules_roundtable_xviii_removed_curation_and_why/).\n\n#Please consider **[Clicking Here for RemindMeBot](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps://www.reddit.com/r/AskHistorians/comments/nle0qj/i_am_a_20_year_old_factory_worker_in_a_slum_in/%5D%0A%0ARemindMe!%202%20days)** as it takes time for an answer to be written. Additionally, for weekly content summaries, **[Click Here to Subscribe to our Weekly Roundup](https://www.reddit.com/message/compose/?to=AHMessengerBot&subject=Subscribe&message=!subscribe)**.\n\nWe thank you for your interest in this *question*, and your patience in waiting for an in-depth and comprehensive answer to show up. In addition to RemindMeBot, consider [using our Browser Extension](https://www.reddit.com/r/AskHistorians/comments/d6dzi7/tired_of_clicking_to_find_only_removed_comments/), or getting the [Weekly Roundup](https://www.reddit.com/message/compose?to=subredditsummarybot&subject=askhistorians+weekly&message=x). In the meantime our [Twitter](https://twitter.com/askhistorians), [Facebook](https://www.facebook.com/askhistorians/), and [Sunday Digest](https://www.reddit.com/r/AskHistorians/search?q=title%3A%22Sunday+Digest%22&restrict_sr=on&sort=new&t=all) feature excellent content that has already been written!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AskHistorians) if you have any questions or concerns.*",
            "title_similarity": "0.35037804"
        },
        {
            "id": "gziwjfa",
            "score": 54,
            "text": "I can offer a partial answer to this. Partial because while I can give some material on the India side of things, I don't have the best information on what life in mid-19th century slums looked like. I do not know what sort of education you might have had, which makes it difficult to provide a complete answer to this sort of question.\n\nAnother thing to remember is that the flow of history complicates the answer to this question. India was shortly to undergo the Great Revolt of 1857, which would provoke a great panic in the British communities in India. The revolt wasn't foreseen ofcourse, but my point is, I can offer no deep insights on how those disruptions might have disrupted such plans, because I cannot know where in India the OPs hypothetical factory worker might have settled.\n\nFirst things first, the answer to this depends atleast in part on whether you are a man or a woman. Men and women could (and did) live very different lives, and the sorts of opportunities available to them by way of work varied significantly as well. I don't condone this, nor am I making some sort of anti-equality argument. But Victorian Britain was a deeply gendered society, and the answer to this question has to reflect that.\n\nThe common response applicable to both men and women is this: The easiest way to make your way to India would be to go as a servant. It would be easier to become the servant of someone *in* Britain who was travelling to India. However there were ways to try and get to India directly too, which I'll explain in a sec. But once in India, working as a servant for someone in the British community was also feasible. India was, by this time, open to all British who could make their way there, but this was still relatively recent (the opening had occurred in 1833, prior to which you couldn't travel without approval from the EIC) so white immigration was still sort of picking up. Other than individual British middle class and upper class individual, you could have also worked as a servant for entities such as missionary groups and churches. This is where education levels come in to play for men in particular. What sort of work you could get *would* depend on how much an ordinary factory worker in the slums knew. If you were totally unlettered you would struggle, and more likely to fail. Servant jobs would have been more reliable than not in Britain over India. If lettered and basically competent there would have been other lower order jobs of a clerical nature in different institutions such as trading companies, government entities, churches, etc that could have also been available and offered some path of advancement. I cannot offer you a detailed response beyond this though, because the details of job getting aren't known to me. I know some form of referencing and your history of apprenticing would have played a role in what sort of job you might have hoped to get.\n\nWomen had slightly different options. The first was marriage. They could marry someone lower middle class, and/or an Anglo-Indian in India to secure some sort of stability. A sole woman travelling alone would have, as far as I know, raised considerable eyebrows, but even so it did happen. It was relatively infrequent though. Aside from service and working for churches, women would have been somewhat in demand to provide domestic care duties, particularly for children. An english maidservant/nanny was preferable to many English in India by the mid-19th century onwards, especially as ideas of racial superiority and anglicist exceptionalism became more deeply rooted.\n\nBeyond service however, there aren't likely to have been too many other opportunities. British India had some deeply racialized principles underlying the society, and an influx of poor whites would have undermined it. There was no shortage of labor to be had, and thus, unlike settler colonies as in the Americas and later Africa and Australia, there was no incentive to bring poor whites to India. If you were a factory worker in this time, it was much more likely that you would look to New Zealand, Australia, even South Africa as more viable destinations for emigration than India.\n\nIf you wanted to travel however, and hadn't found someone to sponsor you, how would you get there? For men, working on a ship as a shiphand was the easiest possibility. Indenture of English to India wasn't really a thing, and as mentioned above, if you wanted to emigrate chances are you'd look to Australia not India.  I do not believe a single, unaccompanied woman, without prospects already lined up would have been able to travel. She would, at the very least, need to either go as a child sponsored by some missionary group hoping to raise wives for British men in India, or would need a prior sponsor as an adult. With no money, simply hopping onto a ship wouldn't have been feasible.\n\nWhat I would say here is this: You would not likely have been making a fortune in India. The idea of making a fortune in the Indies was an opportunity available to those in the lower middle classes who received a formal education and hoped, through connections and introductions, to land a formal position of employment in the colonies. Britain was a deeply hierarchical society though, and a penniless factory worker is extremely unlikely to be given *those* sorts of opportunities in their own lives. If they could have ensured formal education for their children, who in turn could secure lower order jobs for their lifetimes and forge the connections necessary to get their own children the introductions necessary, then your grandchildren might be set to do the rapid ascension of wealth. The rapid fortune making era in India had however faded by the mid 19th century. The era of the *Nabobs* that you see Edmund Burke railing about (see for instance *Impeachment of Warren Hastings* by P.J Marshall or *Scandal of Empire* by Nicholas Dirks) was largely done and dusted by the 1830s or so, as the relationship between India, Britain, and the EIC changed dramatically.\n\nOf the top of my head, I can't think of readings that directly address the issue of lower-class professional migration to India, so if someone provides better resources please see those as well. But where I can recommend you get started are as follows.\n\n*Imperial bodies* by E.M Collingham\n\n*Business of Empire* by H. V. Bowen\n\n*The East India Company at Home* ed. Margot Finn and Kate Smith\n\n*Ideologies of the Raj* Thomas Metcalfe\n\n*The Absent Minded Imperialists* Bernard Porter\n\n*Replenishing the Earth* James Belich",
            "title_similarity": "0.60156184"
        },
        {
            "id": "gziqw2m",
            "score": 3393,
            "text": "This is a pretty interesting question, not least because the job you're doing in London and the date you are considering emigration to India are going to make things a lot harder for you than you might imagine. Broadly speaking, you've picked almost the worst possible time to realise the ambitions that you have, and you would find it potentially very difficult to improve your lot in India in this period, much less make your fortune; odds are, in fact, that your attempt to \"better yourself\" would quite possibly kill you.\n\nWhy? 1850 falls at the tail end of the period during which the East India Company controlled India, but well before the one in which medical advances made it possible to control the diseases that European incomers almost inevitably contracted there. The EIC was a private chartered company of a very peculiar sort – it's charter, which it purchased from the British crown and was required to renew periodically, gave it a monopoly on the export of goods from India to Britain and permitted it to maintain its own armed forces and run its own foreign relations with Indian governments. These were the conditions in which, during the 18th century, it had indeed been possible for EIC employees – at least the senior ones – to literally make their fortunes on the subcontinent, if they were lucky enough and ruthless enough, and if they survived long enough to return to Britain to enjoy their almost certainly ill-gotten gains. This was because the EIC's activities in India were, in the previous century, well beyond the effective control of London, creating a situation in which a number of lucrative but technically illegal practices – beginning with conducting private trade on one's own behalf, rather than for the profit of the company, but moving all the way up, in the case of some Governors General, to deliberately initiating wars of conquest against Indian polities – were possible. If you chose to venture down this path, and were successful enough to benefit Company and country, as well as yourself, it was quite likely the actual actions you'd taken to make your money would be overlooked. The men who did enrich themselves in these circumstances, and did survive to return home, were known as \"nabobs,\" and were amongst the wealthiest people in the Britain of the 18th century.\n\nBy the middle of the 19th century, however, things had changed. For one thing, telegraphic contact was established between India and London, which meant the EIC representatives in India were placed on a much tighter leash; and the voyage out was shorter, too, in the steamship age – as little as six weeks stood between you and someone sent out from Britain to stop you. For another, the actions of the worst of the EIC's nabobs had already soured public opinion in Britain against their rapacious greed ... quite an achievement given the colonialist, imperialist, and supremacist attitudes of the time. And, finally, India in 1850 was very different from the subcontinent of a century earlier; most of its richest territories had already been seized by Company armies, and more or less stable relations had been established with the polities that remained at least nominally independent, so long as they recognised EIC suzerainty. All of this meant there were very few places you could travel to and begin acting rapaciously without being stopped. There were many fewer opportunities to exploit India's wealth by the date you specify.\n\nIn addition to all this, your own status as a factory worker would count heavily against you. It was certainly possible for private individuals to emigrate to India and try to make a living there outside the purview of the Company, but India was not an industrialised country – this was a deliberate EIC policy, since export of manufactured goods and finished textiles to India was one way the Company attempted to manage what would otherwise have been a considerable balance of payments issue – and so there would have been few of the jobs you were actually qualified to do available to you if you did make it out. If you had the right specialist skills, it might have been possible to find work in a government run factory; the EIC made its own munitions and built its own ships in India, for instance. But work of this sort was scarce, since India had plenty of manpower, and EIC economics depended quite heavily on exploiting a poorly-paid indigenous workforce where possible. In any case, factory work would not make your fortune. Similarly, while you would have been very welcome to join up to the Company's army and fight for it, the lowly start you got in life would almost have certainly have precluded you working your way up into the officer class, where pay and opportunities would eventually, after 15 or 20 years, render you tolerably affluent.\n\nFinding work elsewhere would have been tough. There was, for obvious reasons, almost no demand for European servants in India. The few independent entrepreneurs that India boasted tended to be planters of various sorts – growing indigo, or coffee, for instance (opium was a government monopoly) – but to get a start there required considerable capital that it doesn't seem to me you'd have access to. Without a wealthy relative ready to back your fresh start, in short, or without adventure-novel-hero levels of good looks and good fortune, you'd be far more likely than not to find yourself returning to Britain a year or two later, as destitute as when you began your journey, and probably with your health badly undermined by the various tropical diseases you'd acquired during your stay on the subcontinent. Or you'd find yourself dying unmourned of alcoholism in some sweltering Indian town, another extremely common fate among the less fortunate expatriates in India at this time.\n\nAll this may sound like tough luck from your British factory worker's point of view, but of course we need to conclude by pointing out that that's to look at things from a very Eurocentric perspective. From the Indian one, the balances were just about to start redressing themselves – the rebellion of 1857 was only a few years away, and the earliest significant independence movements were not that far behind it. The days of freelance Brits looting and stealing their way across India were already over by then, and a very good thing too. The Company was still acting in this way of course, and the British government would continue to do so in its stead from 1858. But for an individual actor of the working class, 1850 was a better time to head for Australia, Canada or the United States than India.",
            "title_similarity": "0.60002947"
        },
        {
            "id": "gzi66ks",
            "score": 4,
            "text": "[removed]",
            "title_similarity": "-0.03315658"
        },
        {
            "id": "gziq8n0",
            "score": 6,
            "text": "As a follow-up, I imagine the best route would be through the British East India Company. How would one go about getting a commission in this, the most shadowy of private armies?",
            "title_similarity": "0.48048568"
        },
        {
            "id": "gzj5rrn",
            "score": 67,
            "text": "I have a slightly different perspective and question about British India. I was wondering what was life like for the hundreds and thousands of low or middle level bureaucrats in the British Raj - after they retired? Surely, on their posting to India, they got used to living in large bungalows, all the privilege they enjoyed from being white in a sea of brown people and having a gaggle of servants to service their needs. How did they adapt to life back home in the UK - where they suddenly weren’t privileged anymore and had no army of servants?",
            "title_similarity": "0.6860124"
        },
        {
            "id": "gzjclpk",
            "score": 20,
            "text": "Would the EIC not recruit soldiers from the working class? And was there good enough pay to make it a desirable job to take?",
            "title_similarity": "0.4734727"
        }
    ]
}