{
    "Say Hello to Our Little Friends! Introducing William Snoollace and the Empress Dowager Snooxi!\n": [
        {
            "id": "gzz1x0m",
            "score": 1,
            "text": "Hello everyone!\n\nAs any long time Redditor knows, the Snoo is the site mascot, and many communities put their own spin on the design with customized versions. Here on AskHistorians Snoostinian has long been our own little stylization, and a few years back he was joined by [a bevy of friends](https://www.askhistorians.com/our-snoos) who we use to decorate the subreddit and adorn our our swag. Ranging through time and around the globe, they include figures from [Shaka Snoolu](https://imgur.com/QlfMi6D) to the [Lady of Snoolche](https://imgur.com/fYOfaEf). \n\nMore recently, Reddit introduced a new ‘Snoo style’, and as such, we thought it was only right for us to commission a new collection to join them, and now it is time for you to start meeting them! Starting today, and continuing for the next several Sundays, we’ll be rolling out a selection of the new Snoos, along with a brief biography of the historical figures they are based on. We’ll also be soon incorporating them into into our next collection of AskHistorians swag, which can be won by our end of the year Awardees… and is also [available to supporters of the AskHistorians 2021 Conference](https://fundrazr.com/91nni4). You'll get to meet the rest of the crew over the coming weeks.\n\nAnd finally, a shoutout to the incredible /u/akau who has done the art for all of the Snoos, and has been a joy to work with.",
            "title_similarity": "0.57972634"
        },
        {
            "id": "h00webc",
            "score": 4,
            "text": "Empress Snooxi looks ready to tell me that there is no war in Ba Sing Se",
            "title_similarity": "0.43422407"
        },
        {
            "id": "gzz8710",
            "score": 1,
            "text": "love it!!!",
            "title_similarity": "0.43833536"
        },
        {
            "id": "gzza5d1",
            "score": 1,
            "text": "Lovely!",
            "title_similarity": "0.42810348"
        },
        {
            "id": "h0285ad",
            "score": 4,
            "text": "Thanks I hate it",
            "title_similarity": "0.17150512"
        },
        {
            "id": "h01h3ch",
            "score": 1,
            "text": "The dynasty is finished the dynasty is finished the dynasty is finished",
            "title_similarity": "0.365962"
        },
        {
            "id": "h01gsfe",
            "score": 2,
            "text": "All hail the Empress Dowager Snooxi Cixi!!!",
            "title_similarity": "0.68080115"
        },
        {
            "id": "h01tqrv",
            "score": 2,
            "text": "These are great but I'm slightly freaked out. I introduced my high school students to Dowager Empress Cixi less than two hours ago, then this appears in my feed...",
            "title_similarity": "0.57581353"
        },
        {
            "id": "gzz5znj",
            "score": 17,
            "text": "They look so awesome. Long may they reign on the subreddit!",
            "title_similarity": "0.5543405"
        },
        {
            "id": "gzzkc5r",
            "score": 4,
            "text": "*YES*",
            "title_similarity": "0.36631462"
        },
        {
            "id": "gzz6nsa",
            "score": 21,
            "text": "I'm severely disappointed that William Snoollace lacks face paint.",
            "title_similarity": "0.3000986"
        },
        {
            "id": "gzz6ngp",
            "score": 26,
            "text": "Who's the current profile snoo of r/AskHistorians?",
            "title_similarity": "0.37483126"
        },
        {
            "id": "h006h9i",
            "score": 14,
            "text": "The empress allows her nails to grow long to show the world she doesn't work with her hands, instead she has reddit admins who do the comment deletion for her",
            "title_similarity": "0.35803294"
        },
        {
            "id": "gzz4yza",
            "score": 144,
            "text": "Very little is known about Sir William Wallace’s early life, including his date of birth. Historians are confident that Wallace’s family was originally of Welsh extraction; however, a long-held belief about the identity of William’s father was recently debunked. Wallace was neither the peasant depicted by the film *Braveheart*, nor was he the noble suggested by the erroneous belief that his father was Malcolm Wallace of Auchenbothie. The truth is that he was somewhere in between the two, and his father Alan Wallace was a crown tenant in Ayrshire.\n\nNo record of Wallace exists before 1297, yet the Scotland in which he came of age was a land deeply unsettled by an ongoing succession crisis. In 1286, Scotland’s king Alexander III died leaving no direct male heirs. His only direct female heir was his three-year-old granddaughter, daughter of the King of Norway, who drowned at the age of seven when her ship sank en route to Scotland. In response, dozens of Scottish nobles emerged to press their claims to the throne of Scotland, citing various levels of relationship to previous Scottish kings. Overwhelmed by the sheer number of claimants, the regency council invited England’s King Edward I to adjudicate the process, and he, capitalizing upon their desperation, used the invitation as an opportunity to assert his feudal overlordship over the kingdom of Scotland. Stupidly, the regency council agreed to recognize Edward as Scotland’s feudal overlord, and Scotland spent the next sixty years fighting to both reassert their independence as a non-subordinate kingdom and expel the English from Scotland for good.\n\nIn 1296, the king that Edward had chosen for Scotland contracted an  independent treaty with France without seeking Edward’s permission. In retaliation for this so-called act of feudal defiance, Edward invaded Scotland, removed King John from power, and installed an administration of English nobles to govern Scotland. Disaffection for this state of affairs was widespread, and in May 1297, William Wallace slew William Heselrig, the English sheriff of Scottish Lanark, kicking off a full-scale rebellion against the English.\n\nThe late fifteenth-century Scottish poet Blind Hary presents the death of Heselrig as Wallace’s revenge for the murder of his mistress, who had spurned the sheriff’s son. The truth, however, was much less romantic. Heselrig represented an oppressive, foreign regime and was in Lanark to hold a justice court, symbolizing English authority in the region. It is likely, therefore, that this attempt upon a prominent English official who was acting in his administrative capacity was simply a symbolic act of resistance. The Scottish chronicler John of Fordun described Wallace's followers at this time as \"those who were bitter in heart, and heavily oppressed by the intolerable servitude of English dominion\" (Fordun, 2.321). The English chronicler, Walter of Guisborough, on the other hand, saw Wallace and his followers as \"vagrants, fugitives, and outlaws\" (*Chronicle of Walter of Guisborough*, 294).\n\nFrom Lanark and the murder of Heselrig, Wallace continued his campaign against the English, first targeting Edward I’s justiciar William Ormsby at Scone and then harrying and harassing the English out of Fife and Perth. In August 1297, William joined his fellow patriot Andrew Murray and marched on Stirling to meet Edward’s lieutenant John de Warenne in battle.\n\nIn an act of contempt, de Warenne sought to dissuade the Scots from fighting, reminding them of English victories at Irvine and Dunbar, and inviting Wallace and Murray to surrender for the sake of their men’s lives. To the messengers sent by de Warenne Wallace made a justly celebrated response: \"Go back and tell your people that we have not come here for peace: we are ready, rather, to fight to avenge ourselves and to free our country. Let them come up to us as soon as they like, and they will find us prepared to prove the same in their beards\" (*Chronicle of Walter of Guisborough*, 300).\n\nThis was the response of one committed to a cause and sure of the outcome. Wallace and Murray had drawn up their army on the south-facing slope of the Abbey Crag, looking towards Stirling Castle and the narrow wooden bridge across the Forth which stood below it. The English army was stationed on the south side of the Forth, between it and the castle, and would have to cross a narrow bridge to engage the Scots. When the English army was only partly across, the Scottish infantry charged downhill and seized their side of the bridge, cutting the English vanguard off from the main army. Some 5000 infantry and 100 knights are said to have perished, killed by the Scots or drowned in the Forth. De Warenne had not crossed the bridge and fled to Berwick after ordering the destruction of the bridge to hinder a pursuit by the victorious Scots.\n\nStirling did not end the war but its significance was not lost on contemporaries. In its aftermath Dundee Castle surrendered, as did Stirling itself. Edinburgh and Berwick also fell to the Scots, although their castles remained in English hands. Haddington and Roxburgh were burnt. The English hold on Scotland had been severely weakened. The collaboration of Wallace and Murray was not destined to last; wounded at Stirling, Murray died early in November. On Wallace alone thus fell the burden of leading the Scots in the continuing war.\n\nTo what extent Wallace could rely on the support of the Scottish nobility in this is debatable; many had agreed to serve Edward I in Flanders in 1296, and Scottish tradition suggests that some at least were not reconciled to Wallace's rise to power. If Fordun is to be believed, Wallace did not hesitate to employ harsh measures against these recalcitrant lords, imprisoning them until they submitted to his will. By contrast, the shock of Stirling had reunited the English behind their king who, in the wake of a truce with France, returned from Flanders to lead his army north. Edward advanced into Scotland through Lauderdale, over country scorched by Wallace and empty of inhabitants so that, as Guisborough has it, the English \"could not discover a single soul to tell them the whereabouts of the Scottish army\" (*Chronicle of Walter of Guisborough*, 324).\n\nBy March 1298, Wallace was styling himself as not only the leader of the army in the name of King John but as knight and guardian of the kingdom as well. When he was knighted and by whom is not recorded, although an English source suggests that one of the premier earls of Scotland was involved in the ceremony. His election to the guardianship as the first sole occupant of the office arose naturally from his military achievements; whether or not the nobles approved, he was the obvious choice. As guardian Wallace now imposed on the Scots a strategy hitherto alien, eschewing confrontation on the line of advance, and instead withdrawing to the north and leaving country systematically wasted by fire.\n\nThe wisdom of Wallace's strategy was soon apparent. As Edward pushed deeper into Scotland in an attempt to bring Wallace to battle, he found himself increasingly short of supplies, unable to live off the land and with insufficient provision by sea. Desperate to bring Wallace to battle, he finally received news of the Scots army on 21 July: the Scots were at Falkirk. Seizing the initiative from Wallace, Edward pressed on to Falkirk and engaged the Scots army. As at Irvine the previous year, the Scots cavalry composed primarily of nobles and their knights, abandoned the army, unwilling to bear the consequences to their estates should Edward win. Wallace and his schiltrons put up a valiant resistance but were no match against Edward’s superior numbers and tactics. There is reason to believe, however, that he supervised the escape of Scottish survivors. The English, exhausted by the battle and still without adequate supplies, could not follow up their victory and Wallace had time to reach Stirling, where he burnt the town and castle. Following these actions, there is little evidence of Wallace's next movements. At some date between Falkirk and the following December he resigned the guardianship, to be succeeded by Robert Bruce, earl of Carrick, and John Comyn the younger of Badenoch, an uneasy coalition reflecting the Scottish nobles’ innate conservatism.\n\nFollowing a series of English victories in 1303 and 1304, a parliament at St Andrews in March 1305 outlawed Wallace. On 3 August 1305, he was seized by servants of Sir John Menteith, Edward's Scottish keeper of Dumbarton Castle. After Edward refused to see him, Wallace was brought to London on 22 August. Early the next morning, he was taken to Westminster Hall on horseback. Inside the hall he was made to stand on a scaffold at the south end. Wallace denied the charge of treason, since he had never sworn allegiance to Edward, but admitted the other charges. There was no trial in the modern sense. The proceedings were a formality, as was the judgment, given on the same day. Since his legal standing was by 1305 that of an outlawed thief, the law allowed him no defense. Consequently he was to be drawn on a hurdle to the gallows at Smithfield, hanged, his heart and bowels taken out and burnt, his body quartered. His head was to be cut off and placed on London Bridge, his quarters displayed at Newcastle, Berwick, Stirling, and Perth. The sentence, the standard one for treason, was carried out immediately.\n\nNo contemporary equaled Wallace in courage and constancy in the cause of Scottish independence. When he might have saved his life by submission, he judged the price, the abandonment of the cause to which he had devoted himself, too great. Immortalized in folklore, epic, film, and statuary, Wallace remains to this day a popular figure in the Scottish imagination. Our knowledge of Wallace is limited, but such reliable evidence as we have points to a quite exceptional figure whose reputation requires no romantic invention.",
            "title_similarity": "0.23192948"
        },
        {
            "id": "gzz6n78",
            "score": 54,
            "text": "Empress Snooxi is not impressed.",
            "title_similarity": "0.2125521"
        },
        {
            "id": "gzz2i4t",
            "score": 384,
            "text": "Empress Xiaoqin 孝欽, known for most of her life as the Dowager Empress Cixi 慈禧 (Tsysi ᡮᡟᠰᡳ), is perhaps one of the most iconic political figures of the late imperial era in China, though the extent and nature of her role in the period’s history is still debated. Entering the imperial family in 1851, she came to hold varying degrees of power at court until her death in 1908, shortly before the collapse of the Qing state.\n\nAs with most Manchu women in the Qing period, Cixi’s personal name was unfortunately never recorded. We do know that she was born into the Yehe Nara ᠶᡝᡥᡝ ᠨᠠᡵᠠ clan in November 1835, the daughter of a relatively junior civil servant named Huizheng 惠徵. In 1851, aged seventeen, she was selected to be a junior concubine to Yizhu 奕詝 (I Ju  ᡳ ᠵᡠ,) the recently-enthroned Xianfeng 咸豐 Emperor (Gubci Elgiyengge ᡤᡠᠪᠴᡳ ᡝᠯᡤᡳᠶᡝᠩᡤᡝ), and rose rapidly through the court hierarchy, especially after having his only male heir, Zaichun 載淳 (Dzai Šun ᡯᠠᡳ ᡧᡠᠨ), in 1856. When the Xianfeng Emperor died in 1861, she received the title of Dowager Empress Cixi, and along with the former chief consort Dowager Empress Ci’an 慈安, oversaw a board of regents appointed by the late emperor. However, this board was soon deposed in a coup orchestrated between the dowager empresses and the late emperor’s brother Yixin 奕訢 (I Hin  ᡳ ᡥᡳᠨ), styled Prince Gong 恭. The new emperor’s reign title, Tongzhi 同治 (Yooningga Dasan ᠶᠣᠣᠨᡳᠩᡤᠠ ᡩᠠᠰᠠᠨ), which may be translated literally as ‘joint rule’, perhaps hints at the power-sharing that was involved from there on out.\n\nAs regent to the Tongzhi Emperor, Cixi, Ci’an and Prince Gong presided over a period of major recovery for the Qing Empire, which traditional historiography has called the ‘Tongzhi Restoration’. The various anti-Manchu rebellions that had sprung up since early 1851 were suppressed – albeit typically with great bloodshed – by a reinvigorated Qing military; international relations became normalised through the establishment of a regular foreign office; and the reconstruction of devastated regions proceeded rapidly. The extent of her role in this has been debated, and it is probably reasonable to say that much of the impetus for reform came from the provinces and not the court; at the same time there is little to no evidence to suggest significant resistance to these reforms from the centre, either. The death of the Tongzhi Emperor in 1875 saw Cixi retaining power at court nonetheless, as she sought to resolve the childless emperor’s succession by adopting her nephew, the four-year-old Zaitian 載湉 (Dzai Tiyan ᡯᠠᡳ ᡨᡳᠶᠠᠨ), as a second successor to the Xianfeng Emperor. After the death of Ci’an in 1882, she presided as sole regent over the Guangxu 光緒 (Badarangga Doro ᠪᠠᡩᠠᡵᠠᠩᡤᠠ ᡩᠣᡵᠣ) Emperor, leading eventually to perhaps her most controversial series of actions.\n\nThe Qing resurgence that had begun in the Tongzhi period came to a screeching halt in 1894, when a series of military defeats to Japan prompted a wave of radical reformist sentiment among Chinese intellectuals that also drew in the Guangxu Emperor. In the summer of 1898, in conjunction with the radicals, he began what became known as the Hundred Days’ Reforms, to which, initially, Cixi assented. However, one particular set of reforms particularly alarmed the Dowager Empress, and those were the proposals to do away with the Banner system. Since the 1750s, the Banners, in which all Manchu households were enrolled and through which they had been entitled to government stipends and legal protections, had been the cornerstone of Manchu status and identity. The emperor’s apparently positive response to the proposal to eliminate these privileges, if not the Banner system outright, led Cixi to see him and the reformers as a political enemy, and on 22 September generals loyal to Cixi marched into Beijing and rounded up the reformers, many of whom were later executed. The Guangxu Emperor was placed under house arrest, and would remain as emperor in name only until his death. The crackdown against the 1898 reforms alienated most of the growing liberal movement, while the emperor’s arrest created great uncertainty about the status of the imperial court. Amid this uncertainty, Cixi attempted to cement her position by appointing Pujun 溥儁, the son of one of her favoured nobles, Zaiyi 載漪 (Dzai I ᡯᠠᡳ  ᡳ), as crown prince in 1900, which was retracted after protests by supporters of the imprisoned emperor. Following this, Cixi attempted another power-play by co-opting the Yihetuan 義和團, also known as Boxers, an anti-foreign mass religious movement which called for the expulsion of Christian missionaries and their converts. The international military response to the Boxer uprising proved disastrous for the Qing court, which was deserted by many of its generals during the crisis, and subsequently forced to pay a vast indemnity to the foreign powers.\n\nYet Cixi was not by any means a dyed-in-the-wool conservative. From 1901 onward, she issued a series of edicts and proclamations promising wide-ranging reforms. These reforms, known as the New Policies, revitalised the Qing state, reforming its education and law enforcement, and opening opportunities for economic investment. In an attempt to reconcile with the reformist tendencies, 1904 saw Cixi issue pardons (albeit, in many cases, posthumously) to most of those involved in the ‘1898 affair’. In 1905, she sent missions to foreign countries to investigate forms of constitutional government, in preparation for eventual plans to introduce parliamentary bodies – the first provincial assemblies would be elected in 1909, the year after Cixi’s death. And perhaps most notably from a women’s history standpoint, the Qing state formally outlawed foot binding in 1902, having aborted their first attempts to do so all the way back in the 17th century. Unlike 1898, these reforms did not attempt to make major changes to the Banner system, but this produced significant problems: anti-Manchu sentiment among Han Chinese was not appeased, and there was also little effort to ameliorate economic distress among the Banners, whose stipends were not enough to live on without taking on additional employment. On the other hand, the continued assertion of the Banners as the locus of Manchu identity helped to solidify the sense of identity held by the Manchus, not just during the remainder of Qing rule, but into the post-imperial period and down to the present.\n\nIn 1908, Cixi died less than 24 hours after the Guangxu Emperor, leading many to suggest she had him poisoned. Whatever the case, her final major act was to select Puyi 溥儀 (Pu Yi ᡦᡠ ᠶᡳ) as heir apparent, and his father Zaifeng 載灃 (Dzai Feng ᡯᠠᡳ ᡶᡝᠩ) as his regent. This proved to be a rather unfortunate choice, as Zaifeng seemed to have a knack for making exactly the wrong choice at every turn, and the empire was dissolved in February 1912 following a series of military mutinies and popular revolts in late 1911.\n\nCixi’s popular image has largely gravitated between two extremes: that of a power-hungry, Manchu-centric, reactionary despot; and that of a pan-Chinese, anti-foreign, feminist hero. Both are stereotypes that fail to capture the complex series of choices that she made amid a constantly changing backdrop of court authority within the Qing Empire and its place in international politics. Cixi was, without a doubt, often ruthless in how she handled her rivals, and her efforts were unable to prevent the collapse of the Qing state soon after her death. The extent of her direct authority over Qing policy was also limited, and so for the most part she exercised influence, rather than control. Yet under her auspices, the Qing underwent two periods of major recovery, and the Manchus as a minority developed a coherent group identity that survived the fall of the state that had created it. Cixi was, ultimately, only human: deeply flawed, yet not defined solely by those flaws.\n\n### Recommended Reading:\n\nThere is, as yet, no full-length scholarly biography of Cixi in English. The recent treatment by Jung Chang, *Empress Dowager Cixi: The Concubine Who Launched Modern China* (2013), was well-received by some (particularly newspaper reviewers) at the time but has also come in for some withering criticism for its accuracy and interpretations, particularly by Pamela Crossley: see [her review in the LRB](https://www.lrb.co.uk/the-paper/v36/n08/pamela-crossley/in-the-hornets-nest); a more restrained but still pretty critical review by Jeffrey Wasserstrom can be read [here](https://www.ft.com/content/b60f459e-51de-11e3-8c42-00144feabdc0).\n\nA summary narrative of Cixi’s life in English can be found in Arthur Hummel’s *Eminent Chinese of the Ch’ing Period* (1943, revised edition 2018), which has an entry for her under Hsiao-Ch’in (Xiaoqin in the 2018 edition). Crossley’s review above is also a good general overview of Cixi’s life.\n\nA couple of books covering the period and which include contrasting discussions of Cixi’s role in it are [Pamela Crossley’s *The Wobbling Pivot* (2010)](https://bookshop.org/a/24392/9781405160803) and [Edward Rhoads’ *Manchus and Han* (2000)](https://bookshop.org/a/24392/9780295980409) (the latter is also open-access on JSTOR). Crossley’s book covers Chinese history in general from 1800 onwards, and sees Cixi as being of relatively limited importance overall; Rhoads looks specifically at ethnic relations in the last six decades or so of the Qing, and sees Cixi as quite significant within that particular sphere.\n\nFor those with some form of journal access, there is Sue Fawn Chung’s ‘The Much Maligned Empress Dowager: A Revisionist Study of the Empress Dowager Tz'u-hsi (1835–1908)’, in *Modern Asian Studies* 13:2 (1979), which specifically focuses on 1898-1900 and discusses the origins of Cixi’s poor reputation in Western historiography. Also, *Nan Nü* Volume 14, Issue 1 (2012) contains a series of articles on Cixi and the arts which may also be of interest.",
            "title_similarity": "0.39300394"
        },
        {
            "id": "gzz4n10",
            "score": 13,
            "text": "That's fun. I might have to try my hand at making a Frederick Barbarossa *(Frederick BarbaSnoossa)* version.",
            "title_similarity": "0.5856496"
        },
        {
            "id": "gzzegvd",
            "score": 21,
            "text": "Can I xpost the Empress Snooxi to another sub?",
            "title_similarity": "0.5753148"
        },
        {
            "id": "gzzfi4z",
            "score": 60,
            "text": "This costume historian thanks you for not putting William Snoollace in a kilt.",
            "title_similarity": "0.4813511"
        },
        {
            "id": "gzzjkg7",
            "score": 20,
            "text": "Can we get an Isaac Snooton for our history of science representation?",
            "title_similarity": "0.38361079"
        },
        {
            "id": "gzzvazg",
            "score": 15,
            "text": "[deleted]",
            "title_similarity": "0.19848719"
        },
        {
            "id": "gzzwrzm",
            "score": 14,
            "text": "This \"I'm so done with this\" dead pan look has always been my favourite to see in art, does anyone know what it's called?",
            "title_similarity": "0.497639"
        },
        {
            "id": "gzzz6m4",
            "score": 9,
            "text": "That's awesome (I'm excited to be able to make a comment on this sub)",
            "title_similarity": "0.5265198"
        },
        {
            "id": "gzzz6u9",
            "score": 2,
            "text": "They look awesome! My pfp is actually a Snoo of one of my favourite historical figures as well!",
            "title_similarity": "0.58861613"
        },
        {
            "id": "h002y6n",
            "score": 13,
            "text": "That damned anachronistic sword",
            "title_similarity": "0.1323996"
        },
        {
            "id": "h00bdib",
            "score": 52,
            "text": "It was really exciting to be able to work with the Askhistorians team to design these, I'm glad they're well received! :)",
            "title_similarity": "0.506197"
        },
        {
            "id": "h00eo1r",
            "score": 2,
            "text": "Love it! Thanks!\n\nAlso... Snoojamin Franklin is coming? Please?",
            "title_similarity": "0.7113291"
        },
        {
            "id": "h00f9sw",
            "score": 16,
            "text": "The dowager Empress Cixi was once given a car as a gift. She got into the back seat, but was shocked to see the driver get in the front of the car with his back to her, a serious breach of protocol. So she demanded the driver turn round and kowtow properly. This made driving the car very hard for the poor fellow, who didn't get far before crashing. The Empress got out, incredibly displeased, and declared an intention never to get in a car again. Which she didn't.",
            "title_similarity": "0.31026503"
        },
        {
            "id": "h00xnt8",
            "score": 3,
            "text": "Changs book is incredible. Empress Cixi is a fascinating subject. My professor from Korea explained that she is often vilified in chinese history due to her relationship with western influence. But this book broke away from that myth.",
            "title_similarity": "0.5029967"
        },
        {
            "id": "h01ajhg",
            "score": 1,
            "text": "She doesn't have the head lightbulb thing?  That's how you can tell they're not humans!",
            "title_similarity": "0.16566873"
        },
        {
            "id": "h01ih33",
            "score": 3,
            "text": "Quick question: I am still using old Reddit, and the Snoo used in that version has remained steadfast for years, but now I realise I haven't seen anyone put a name to the face. My money is on Anna Komnenos. Would you satisfy my curiosity?",
            "title_similarity": "0.4085192"
        },
        {
            "id": "h01xghk",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.17192614"
        },
        {
            "id": "h020vp4",
            "score": 2,
            "text": "I'd love to see Mansnoo Musa in the future as well!",
            "title_similarity": "0.4697312"
        },
        {
            "id": "h0220dc",
            "score": 1,
            "text": "Love this! Alba Gu Bràth!",
            "title_similarity": "0.5353537"
        },
        {
            "id": "h02lk6l",
            "score": 2,
            "text": "OMG beautifule",
            "title_similarity": "0.40703344"
        },
        {
            "id": "h038gm7",
            "score": 1,
            "text": "Highly recommend the show Towards the Republic, a 2003 TV show, for a compelling picture of the transition between the late Qing and early republican eras. Fortunately, it is subbed, albeit partially, on YouTube. Also recommend Ming Dynasty 1566 by the same director and which is fully subbed.",
            "title_similarity": "0.6141653"
        },
        {
            "id": "hevwd34",
            "score": 2,
            "text": "I sent the one of Snooxi to my mom and she got so freaked out that she did a mini exorcism in our house",
            "title_similarity": "0.43143684"
        }
    ]
}