{
    "How did the name “Lucifer”(meaning “Lightbringer”), originating from Roman Folklore as the name for the planet Venus, become the name of the biblical Devil aka Satan?\n": [
        {
            "id": "h0s8yve",
            "score": 1,
            "text": "Welcome to /r/AskHistorians. **Please [Read Our Rules](https://www.reddit.com/r/AskHistorians/wiki/rules) before you comment in this community**. Understand that [rule breaking comments get removed](https://www.reddit.com/r/AskHistorians/comments/h8aefx/rules_roundtable_xviii_removed_curation_and_why/).\n\n#Please consider **[Clicking Here for RemindMeBot](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps://www.reddit.com/r/AskHistorians/comments/ntjlj4/how_did_the_name_lucifermeaning_lightbringer/%5D%0A%0ARemindMe!%202%20days)** as it takes time for an answer to be written. Additionally, for weekly content summaries, **[Click Here to Subscribe to our Weekly Roundup](https://www.reddit.com/message/compose/?to=AHMessengerBot&subject=Subscribe&message=!subscribe)**.\n\nWe thank you for your interest in this *question*, and your patience in waiting for an in-depth and comprehensive answer to show up. In addition to RemindMeBot, consider [using our Browser Extension](https://www.reddit.com/r/AskHistorians/comments/d6dzi7/tired_of_clicking_to_find_only_removed_comments/), or getting the [Weekly Roundup](https://www.reddit.com/message/compose?to=subredditsummarybot&subject=askhistorians+weekly&message=x). In the meantime our [Twitter](https://twitter.com/askhistorians), [Facebook](https://www.facebook.com/askhistorians/), and [Sunday Digest](https://www.reddit.com/r/AskHistorians/search?q=title%3A%22Sunday+Digest%22&restrict_sr=on&sort=new&t=all) feature excellent content that has already been written!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AskHistorians) if you have any questions or concerns.*",
            "title_similarity": "0.3936582"
        },
        {
            "id": "h0st745",
            "score": 17,
            "text": "[removed]",
            "title_similarity": "0.180421"
        },
        {
            "id": "h0smb2h",
            "score": 23,
            "text": "[removed]",
            "title_similarity": "0.180421"
        },
        {
            "id": "h0tsv5k",
            "score": 214,
            "text": "This was crossposted on r/AcademicBiblical so I'll just copy+paste my response from there.\n\n*Lucifer qui mane oriebaris* is the Latin translation of the Hebrew *hȇlēl ben šāḥar*. The LXX renders the name *ἑωσφόρος ὁ πρωὶ ἀνατέλλων*. The literal translations are: \"the Morning Star, that rose in the morning\" (LXX), \"The Morning Star, that used to rise in the morning\" (Vulgate), and \"Day Star, son of Dawn\" (NRSV) in Hebrew. This refers to the planet Venus, which rose before dawn and was called Lucifer in Latin. The idea that Dawn begets the morning star is found in classical literature, where Eos (called Erigineia, \"Early-born\", an epithet for 'Dawn') \"brought forth... the Star Eosphoros\".\n\nBut the folklore here isn’t Roman, it’s Canaanite. John Day, *Yahweh and the Gods and Goddesses of Canaan*:\n\n>That the verses represent an excerpt from a myth that was first recognized by Herder and it was Gunkel who first suggested either a Babylonian or a Phoenician origin. On the basis of a number of words and phrases used it is now generally accepted that the origin of the myth must be sought specifically in Canaanite mythology, and this has especially become clear in the light of Ugaritic parallels. Thus, Zaphon (Isa. 14.13) is well known from the Ugaritic texts as the mountain which constituted Baal's throne (cf. *KTU*^2 1.5.I.11; 1/6/I/57-9, etc.), and the words 'I shall ascend above the heights of the clouds' (Isa. 14.14a) again recall Baal, one of whose stock epithets was *rkb 'rpt*, 'Rider of the clouds' (*KTU*^2 1.5.II.7,etc.). \n\n[...]\n\n>Is it possible to identify the morning  star Venus with a figure from Canaanite mythology? It is very probable that this role was filled by the god Athtar, even though this is nowhere explicitly stated. In South Arabia the god Athtar was certainly identified with Venus, and in Mesopotamia the cognate deity, the goddess Ishtar (sometimes represented as male) likewise represented the planet Venus. Similarly, the Canaanite female equivalent of Athtar, Astarte (Athtart), was equated with the Greek goddess Aphrodite (=Venus). It is probably that Athtar and Astarte represent Venus as the morning and the evening star respectively. Interestingly, Athtar was equated in the Ugaritic pantheon list with the Hurrian war god Ashtabi, which fits the warlike context of Isaiah 14.\n\n[...]\n\n>Now, it so happens that we possess a Canaanite myth from Ugarit, part of the Baal cycle, which speaks of Athtar's abortive attempt to occupy Baal's throne on Mt Zaphon and this has most commonly been thought to be the prototype of the myth in Isa. 14.12-15. It is to be found in the Ugaritic text *KTU*^2 1.6.I43-67, where after Baal's descent into the underworld the god Athtar was appointed by El and Athirat to the kingship in succession to Baal on Mt Zaphon, but he proved to be too small to occupy Baal's throne and therefore had to descend to the earth and rule from there.\n\nThe association of Athtar with Venus is also supported by Mark S. Smith in *The Origins of Biblical Monotheism: Israel's Polytheistic Background and the Ugaritic Texts*:\n\n>At Emar Athtar is once called *Aš-tar* MUL, \"Ashtar of the stars,\" and Aramaic texts from the ninth century onward attest to *'tršmn*, \"Athtar of heaven,\" apparently a reference to the god's astral character. References to the astral character of Ishtar in Mesopotamian sources are also commonly used to bolster a case for Athtart as an astral god. Taken together, such textual references lend credence to the old view that Athtar and Athtart represent the morning and evening \"star\" (Venus).\n\nThis is also bolstered by Athtar being a member of the family of El and Athirat, which was composed of astral deities. Which segues into the next connection: \"above the stars of El\" (*mimma'al lěkōkěbě-'ēl*) refers to the council of divine beings, referenced again (indirectly) in v.13's \"mount of assembly\" on Zaphon (the Greek parallel would be Mount Olympus). See also Job 38:67,\n\n>Who set its cornerstone when the morning stars sand together, and all the divine beings [*běnȇ 'ělōhîm*, lit.: \"sons of god(s)\"] shouted for joy?\n\nedit: As to the question about the connection between this figure and Satan, I'd refer to Philip Harland's [Religions of the Ancient Mediterranean](http://www.philipharland.com/Blog/religions-of-the-ancient-mediterannean-podcast-collection-page/) podcast for a good overview on the development of Satan.",
            "title_similarity": "0.62195694"
        },
        {
            "id": "h0v3ift",
            "score": 132,
            "text": "It’s starts with Isiah 14:12.\n\nIn English translations, the text is translated in the King James Bible as:\n\n“How you are fallen from heaven,\nO Lucifer, son of the morning!\nHow you are cut down to the ground,\nYou who weakened the nations!”\n\nAnd the Wycliffe Bible (approx. 1395):\n\n“A! Lucifer, that risedest early, how fellest thou down from heaven; thou that woundedest folks, felledest down (al)together into [the] earth. (O! Lucifer, who risedest up early, how thou hast fallen down from heaven; thou who hast wounded the nations, fell down to the ground.)”\n\nBoth are believed to be drawn from the Latin Vulgate, a translation attributed to Jerome of Stridon, though it’s generally agreed that the work is a composite and Jerome is only responsible for parts of it.\n\nThere are multiple versions of the Vulgate, though most agree on Isiah 14:12.\n\nHere is Isiah 14:12 from the Clementine Vulgate:\n\n“quomodo cecidisti de caelo lucifer qui mane oriebaris corruisti in terram qui vulnerabas gentes”\n\nThe Vulgate is credited as the first known translation of the Hebrew Tanakh, more properly called Mikra or Miqra, which is a collection of Hebrew canon found in the Old Testament, though Jerome had worked on a translation of the Greek Septuagint prior, though according to Jerome, those translations were allegedly lost “through someone’s dishonesty”, translated by Wace and Schaff (1890-1900). \n\nAugustine of Hippo (405) states Jerome translated directly from Hebrew, though scholars, such as Adam Kamesar (1993) believe Jerome may have been working from the Greek, rather than the Hebrew texts.\n\n\nThe Leningrad Codex’s, a preserved Hebrew version of the Tanakh which is dated around 1000, text of Isiah 14:12 reads:\n\nאֵ֛יךְ נָפַ֥לְתָּ מִשָּׁמַ֖יִם הֵילֵ֣ל בֶּן־שָׁ֑חַר נִגְדַּ֣עְתָּ לָאָ֔רֶץ חֹולֵ֖שׁ עַל־גֹּויִֽם׃\n\nAnd the Masoretic Text (700-900), another extant Hebrew set of documents that includes the Old Testament  says:\n\nאֵי נָפַלְתָּ מִשָּׁמַיִם הֵילֵל בֶּן־שָׁחַר נִגְדַּעְתָּ לָאָרֶץ חוֹלֵשׁ עַל־גּוֹיִם\n\nThis transliterated is:\n\nëykh' näfal'Tä miSHämayim hëylël Ben-shächar nig'Da'Tä lääretz chôlësh al-Gôyim\n\nWhatever Hebrew texts Jerome used are lost to us, but the key term for us here is “הֵילֵל” which appears in both texts and is transliterated as hëylël or Hêlêl \n\nThat is likely the term Jerome translates to  “Lucifer” if he directly translated it.\n\nThe term helel is translated in Strong’s concordance as “Shining One” and it’s coupled with “Ben-shächar”, which translates to “son or child of shächar”.\n\nShächar, also Shahar, meaning Dawn. Hinnels (2007) identifies Shahar as an Ugarit god of the Dawn, a twin of another Ugarit god Shalim, god of dusk.\n\nWhich explains Jerome’s “lucifer qui mane oriebaris” or “light bringer, son of the morning”.  Shining One, Son of Dawn.\n\nIt’s association with “The Morning Star” can be seen in the Greek Septuagint:\n\nπῶς ἐξέπεσεν ἐκ τοῦ οὐρανοῦ  ὁ noἀνατέλλων συνετρίβη εἰς τὴν γῆν ὁ ἀποστέλλων πρὸς πάντα τὰ ἔθνη\n\nWhich Google transliterates as:\n\npós exépesen ek toú ouranoú o eosfóros o proḯ anatéllon? synetrívi eis tín gín o apostéllon prós pánta tá éthni.\n\nThe key term here is “eosfóros”, which is also transliterated to Heosphoros, also called Phosphoros, which is the Ancient Greek Term for Venus the planet as seen in the morning and a minor god who was a brother of Hesperus, which is the term for the planet Venus as seen in the evening (which parallels Shahar and Shalim as heavenly bodies and divine siblings)\n\nHeosphoros also translates literally as “bringer or carrier (phoros) of Dawn (Heos or Eos)”, Phosphoros means “bringer/carrier (phoros) of Light (Phos or FPS) and lucifer (lux being light and fer being a diminutive of ferre, meaning to carry) is the direct translation.\n\nSo Jerome is likely agreeing with the Septuagint’s translation of the Hebrew, or he is deferring to it, depending on which reading you take on his Hebrew skills.\n\nSo Jerome is where we get Lucifer in relation to the Bible, whether as a credible translation from the Hebrew, Shiner, son of Dawn or the Greek, Light-Bringer.\n\nAs for Lucifer, the fallen Angel, The Adversary and the Devil, all conflated as one?\n\nWe likely have Origen of Alexandria to blame.\n\nIn his work “Contra Celsum” Book VI Chapter 43 he writes:\n\n“And besides all these instances, in the book of Job, which is older even than Moses himself, the devil is distinctly described as presenting himself before God”\n\nOrigen is directly connecting the idea of the Devil with Ha Satan, the adversary in Job, which does have examples in an earlier Christian and Hebrew traditions.\n\nHe then proceeds to rattle off a number of examples of the Devil in the Bible, including “those in Isaiah, where lament is made for the king of Babylon”. (Translation by Crombie 1885)\n\nThis is the earliest example I can find of a Christian writing that conflates the Devil with the Serpent, the Adversary and Lucifer, though the figure in 14:12 would be called Phosphoros in the Septuagint Origen was reading.\n\nWhile then development and conflation of those ideas is present before Origen, connecting Isiah 14:12 with these other supernatural characters of the Old Testament seems original to him.\n\nIndeed, in First Principles (Book 1, Chapter 5) you can see the development of this thought, as he concludes the figure of 14:12 cannot be a human, but is instead an Angel of some kind, though he hadn’t fully connected this fallen Angel with Satan or the Serpent yet, though  the only extant translation is by Tyrannius Rufinius, a contemporary of Jerome’s, and apparently he modified the text to adhere to adhere to his contemporary orthodoxy (Heine 2010), so whether Origen’s connexion was closer to his writings in Contra Celsa and Rufinius edited him, or whether the idea was emerging is unknown\n\nOrigen, of course, was one of the greatest early writers in the Christian tradition, and his theology was considered a standard for Christian orthodoxy (Olsen 1999), so it’s little surprise his thinking regarding Lucifer (as translated by Rufinius, we don’t know what Origin called Lucifer in Greek).\n\nSo in summary: we know Origen, a major pillar of Christian thinking, conflated Helel Ben-Shahar, as named in the Tanakh, with Ha-Satan as well as some other satans that appear throughout the Old Testament and presented as Angels, and the serpent in Revelations and Genesis.\n\nWe know Rufinius and Jerome both choose to translate Phosphoros as Lucifer. \n\nAnd we know the English Renaissance were drawing from Origen, Rufinius and Jerome as they were conceiving their own English Vulgate which culminated in the King James Bible.\n\nHopefully I’ve drawn the line from Ancient Hebrew mythology referring to a non Hebrew God believed to be Venus at Dawn to renaissance Christian mythology \nof a fallen Angel that was once the brightest star in heaven.",
            "title_similarity": "0.68176985"
        },
        {
            "id": "h0tsxya",
            "score": 118,
            "text": "So there's a lot in this question, which I'll do my best to unpack.\n\nThe connection between Lucifer and the devil arises from this passage in Isaiah, Isaiah 14:12 (quoted from the King James Version).\n\n>How art thou fallen from heaven, O Lucifer, son of the morning! how art thou cut down to the ground, which didst weaken the nations!\n\nand this passage, Luke 10:18 (KJV):\n\n>And he said unto them, I beheld Satan as lightning fall from heaven\n\nMore modern translations of this passage frequently translate the Latin word \"lucifer\" as \"morning star\" (NIV) or as \"Day Star\" (NRSV), whereas the KJV translates it as the proper name \"Lucifer\"--I've used the KJV here because the translation of \"lucifer\" as a proper name most clearly illustrates the connection that some claim between these two passages. \n\nThat said, many, including noted theologians, such as Martin Luther and John Calvin, have vigorously disputed the connection between Lucifer and the devil. The proponents of the view that Lucifer and Satan are not the same draw their main argument from the context of this passage. From Isaiah 14:4 (KJV):\n\n>That thou shalt take up this proverb against the king of Babylon, and say...\n\n14:12 is still contained in what the speaker (who is probably the historic Isaiah ben Amoz) is instructing. As such, theologians have claimed that \"lucifer\" is here referring to the King of Babylon, and not to the devil.  The analogy with a word relating to Venus, the morning star, may have also had specific import to the audience of Isaiah's work. The rise and fall of Venus (both literally and observably, in the sky, and figuratively, in the doings of the gods) played a role in Near Eastern religious myths, and so Isaiah may have been using religious imagery his audience would have been familiar with, but in a different context, to further his own points.\n\nAnother point in support of this connection being incorrect is the use of the Latin word \"lucifer\" to mean simply \"light-bringer\". This construction is seen elsewhere in Latin (cf. Catullus 62.8, 'noctifer', meaning night-bringer); and it is clear from other uses of the Latin word \"lucifer\" in the Bible that the word does not, at the time of writing, mean only the Devil. It is used elsewhere in the Bible with the meaning light-bringer, and is used to describe Jesus, both in the Bible and in early Christian hymns.\n\nAnother difference between Lucifer and Satan is the following: generally, Lucifer is used to refer to the Archangel before his fall, while Satan is used after. In his depictions in literature, Lucifer is generally placed in a position of high esteem before his fall. A quotation from the Cursor Mundi describes his high status, saying \"\\[God\\] sett him \\[Lucifer\\] beste in his \\[i.e., God's\\] halle / As prynce & sire of othere alle.\" Later, Lucifer is often associated with bright light, making the name's connection to Venus and light more sensible. However, these depictions are all much later than the Bible's writing, and so their foundations are not necessarily sound. \n\nIn summary, the word \"lucifer\" derives from the Latin for 'light-bringer'. Early Christian thinkers drew that Lucifer was the Devil from the biblical passages Luke 10:18 and Isaiah 14:12; while this idea was not without pushback, including from prominent theologians, it was eventually generally accepted. Depictions of Lucifer in literature often feature motifs of bright, dazzling light, so his name makes sense in that context. Given the rise and fall of Venus in the sky, the Roman word for Venus being used to describe an angel who rose to God's side and then fell from heaven is not inconsistent with nearby non-Judeo-Christian religious traditions either. However, the word 'lucifer' is used elsewhere in the Bible to describe Jesus, and is used with its meaning of \"light-bringing\", so its association with the Devil is not without controversy.\n\n&#x200B;\n\nSources:\n\nSmith, Gary V. (2007) *Isaiah 1-30*.\n\nBloom, Harold. (2005) *Satan*.\n\nMARTIN, DALE BASIL. “When Did Angels Become Demons?” Journal of Biblical Literature, vol. 129, no. 4, 2010, pp. 657–677. JSTOR, [www.jstor.org/stable/25765960](http://www.jstor.org/stable/25765960). Accessed 6 June 2021.\n\nLee, Judith. “Lucifer: a Fantastic Figure.” Journal of the Fantastic in the Arts, vol. 8, no. 2 (30), 1997, pp. 218–234. JSTOR, [www.jstor.org/stable/43308294](http://www.jstor.org/stable/43308294). Accessed 6 June 2021.",
            "title_similarity": "0.7764289"
        },
        {
            "id": "h0spmqt",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.180421"
        }
    ]
}