{
    "Two of my favorite movies, “The King’s Speech” and “Darkest Hour”, paint very different pictures of the relationship between Winston Churchill and King George VI\nIn the former film, Churchill is seen as a respected advisor to the royal who seems to oppose Edward’s marriage to Wallis Simpson, and is the one who suggests Bertie use King George VI as his name. \n\nIn the latter, King George seems to despise Churchill and they certainly don’t seem to have the relationship that they had in “The King’s Speech” (though they do develop one later). Churchill also states in that movie that King George “never forgave him for supporting his brother’s marriage to Wallis Simpson”.\n\nWhich of these portrayals more accurately represents the relationship of the two? Also, where did Churchill stand on Edward’s marriage to Simpson?": [
        {
            "id": "h118xu2",
            "score": 1,
            "text": "Welcome to /r/AskHistorians. **Please [Read Our Rules](https://www.reddit.com/r/AskHistorians/wiki/rules) before you comment in this community**. Understand that [rule breaking comments get removed](https://www.reddit.com/r/AskHistorians/comments/h8aefx/rules_roundtable_xviii_removed_curation_and_why/).\n\n#Please consider **[Clicking Here for RemindMeBot](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps://www.reddit.com/r/AskHistorians/comments/nv5rcr/two_of_my_favorite_movies_the_kings_speech_and/%5D%0A%0ARemindMe!%202%20days)** as it takes time for an answer to be written. Additionally, for weekly content summaries, **[Click Here to Subscribe to our Weekly Roundup](https://www.reddit.com/message/compose/?to=AHMessengerBot&subject=Subscribe&message=!subscribe)**.\n\nWe thank you for your interest in this *question*, and your patience in waiting for an in-depth and comprehensive answer to show up. In addition to RemindMeBot, consider [using our Browser Extension](https://www.reddit.com/r/AskHistorians/comments/d6dzi7/tired_of_clicking_to_find_only_removed_comments/), or getting the [Weekly Roundup](https://www.reddit.com/message/compose?to=subredditsummarybot&subject=askhistorians+weekly&message=x). In the meantime our [Twitter](https://twitter.com/askhistorians), [Facebook](https://www.facebook.com/askhistorians/), and [Sunday Digest](https://www.reddit.com/r/AskHistorians/search?q=title%3A%22Sunday+Digest%22&restrict_sr=on&sort=new&t=all) feature excellent content that has already been written!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AskHistorians) if you have any questions or concerns.*",
            "title_similarity": "0.56752956"
        },
        {
            "id": "h14j403",
            "score": 651,
            "text": "Neither for the relationship with George VI, and like many things over the course of his life, Churchill changed as the political winds did with David and Wallis.\n\nI'm going to divide this in ~~two~~ ~~(edit: ok, three)~~  (meh, ok, four) parts; this one will focus on the movie portrayals, the second on Edward VIII, the third on the effects of the abdication between the brothers, and the fourth on how the relationship developed.\n\nBoth *The King's Speech* and *Darkest Hour* take a number of liberties with the underlying history on portions of the story that aren't critical to their main plots.  This doesn't take away from their internal drama or watchability of the films, but it does mean some of the historical accuracy is sacrificed, particularly on the edges.\n\nThis goes a little further with *The King's Speech*: it was made in strange circumstances as far as movies go partially because there was strong pressure from the Queen Mother to not tell the story while she was still alive - it was still too raw for her - but also because Lionel Logue's files and diaries were discovered at a very late date in preproduction.  Among other things, this meant the accompanying book was developed alongside the movie with the author, his grandson, helping the scriptwriters fit in some of the research.  It also meant that the decision by Tom Hooper, Geoffery Rush, and Colin Firth to make the heart of the movie an Odd Couple buddy film partially about the class differences between the King and Logue from when they had relatively little in the way of primary sources stayed intact. (In reality, Logue was at times almost obsequious to His Majesty, and the wartime speech wasn't as important as another.)\n\nMeanwhile, while there have been a zillion Churchill adapations and even more books, at least in theory *Darkest Hour* does focus in on one area that hasn't received as much attention as others: the struggle by Churchill to gain the support of fellow Tories (and others) as he was offered the premiership following the Chamberlain government surviving a confidence vote by such diminished margins after the Fall of Norway that Leo Amery was correct in telling the latter to 'In the Name of God, Go!'  This intraparty struggle did indeed happen, although not in a way close to what the film represents.  Nor did the opposition parties tend towards treason either; the other motivating factor in the fall of the Chamberlain government was that Labour had made it known they would not serve in a coalition government headed by Chamberlain - but would with Halifax or Churchill, and indeed both Labour and the Liberals were smack dab in the midst of the later War Cabinet and provided strong support to Churchill until 1945.\n\nSo both films really use much of their supporting material to bulk up the main plots, and in doing so they cut a few corners.  Churchill would never have hopped on The Tube to interact with commoners, nor even with his frequent bouts of depression did his self confidence ever vary much - it was almost always other people that were at fault, not him! - and his biggest concern upon taking power was that he might have gained it 'too late' rather than that he'd badly misjudged the way the war would be fought on land for decades as well as the French military.  However, in terms of his struggles, all the fictional world-against-Winnie arcs dovetail nicely into the main story.  Lionel Logue never worked as a defacto therapist with the King to discuss his brother; during the abdication crisis, there was no falling out. Bertie had just improved enough and was under severe enough strain so that he didn't really have time for him.\n\nSo since both movies use the relationship between King George VI and Churchill to advance the main plot, it shouldn't be terribly surprising that neither are particularly careful to represent what we know about the real life one.\n\nBut there's another issue.  [As I've mentioned before](https://www.reddit.com/r/AskHistorians/comments/hbbw97/how_did_winston_churchill_become_so_revered_in/fva18jq/), Churchill is not the most terribly reliable narrator particularly when it comes to things he was personally involved with.  (One related side note: during the nine months of his second term as First Lord of the Admiralty, Churchill's lengthy and prolific letters on strategy to fellow members of the War Cabinet were viewed - as it turned out quite properly - as being written not so much to convince them as they were for whatever book the man would be writing soon.  Chamberlain was particularly annoyed.)  This has played a significant role in a number of evaluations by historians.  One example: there are something like 6 or 7 versions of the meeting between Chamberlain, Churchill, and Halifax that resulted in Churchill becoming PM, and most use Churchill's version - recalled and written years later, and not even consistent with a couple tellings of it prior to this - as the baseline for events, which creates a real problem when it was only Churchill and King George VI in the same room.  While some stories like the D-Day one have been known for a while thanks to staff, many others had to rely solely on Churchill - which is an issue.\n\nFortunately, Queen Elizabeth II has personally made two terrific decisions for historians about the Windsor family archives in the last decade or so.  First came the decision to open up the archives for a particular researcher on Edward VII, and the resulting work on that monarch [is a book I highly recommend](https://www.reddit.com/r/AskHistorians/comments/kcece4/askhistorians_2020_holiday_book_recommendation/gfryyv1/) as it affects understanding of events far beyond him.  And second, directly related to your question, in 2016-2017 she also allowed a researcher to look at the royal diaries - most notably King George VI's - for the specific purpose of seeing what they recorded about his meetings with Churchill.",
            "title_similarity": "0.8174473"
        },
        {
            "id": "h11z1xd",
            "score": -10,
            "text": "[removed]",
            "title_similarity": "0.1848337"
        }
    ]
}