{
    "Mass graves of Indigenous peoples keep getting discovered at the sites of Canadian residential schools. Should I expect mass graves to be found at Aboriginal missions here in Australia?\nJust 4 hours ago, [even more mass graves were found at the site of a Canadian residential school](https://www.bbc.com/news/world-us-canada-57592243). Considering that this source is the BBC, I strongly doubt that a British media outlet are fabricating or exaggerating an atrocity that makes a close ally like Canada look bad.\n\nAustralia had the [Stolen Generations](https://en.wikipedia.org/wiki/Stolen_Generations). In 1997, a governmental inquiry into this was published, known as the [\"Bringing Them Home\" report](https://www.aph.gov.au/About_Parliament/Parliamentary_Departments/Parliamentary_Library/pubs/BN/0708/BringingThemHomeReport#:~:text=On%2026%20May%201997%20the,Home%2C%20was%20tabled%20in%20Parliament.&text=A%20key%20recommendation%20in%20the,by%20policies%20of%20forced%20removal.). The report estimated that between 1 in 10 and 1 in 3 Indigenous Australian children were forcibly taken from their families and communities between 1910 and 1970. These children were then put into the care of Aboriginal missions run by governmental or church groups, which, like the [Canadian residential schools](https://en.wikipedia.org/wiki/Canadian_Indian_residential_school_system), were rife with abuse.\n\nDo historians expect that there are mass graves at Aboriginal missions in Australia? If not, why not?\n\nOn a side note, is the \"Bringing Them Home\" report trustworthy? Or is even the \"between 1 in 10 and 1 in 3\" estimate in the report a deliberate underestimate by our government?": [
        {
            "id": "h2xtn1l",
            "score": 1,
            "text": "Welcome to /r/AskHistorians. **Please [Read Our Rules](https://www.reddit.com/r/AskHistorians/wiki/rules) before you comment in this community**. Understand that [rule breaking comments get removed](https://www.reddit.com/r/AskHistorians/comments/h8aefx/rules_roundtable_xviii_removed_curation_and_why/).\n\n#Please consider **[Clicking Here for RemindMeBot](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps://www.reddit.com/r/AskHistorians/comments/o7c9rc/mass_graves_of_indigenous_peoples_keep_getting/%5D%0A%0ARemindMe!%202%20days)** as it takes time for an answer to be written. Additionally, for weekly content summaries, **[Click Here to Subscribe to our Weekly Roundup](https://www.reddit.com/message/compose/?to=AHMessengerBot&subject=Subscribe&message=!subscribe)**.\n\nWe thank you for your interest in this *question*, and your patience in waiting for an in-depth and comprehensive answer to show up. In addition to RemindMeBot, consider [using our Browser Extension](https://www.reddit.com/r/AskHistorians/comments/d6dzi7/tired_of_clicking_to_find_only_removed_comments/), or getting the [Weekly Roundup](https://www.reddit.com/message/compose?to=subredditsummarybot&subject=askhistorians+weekly&message=x). In the meantime our [Twitter](https://twitter.com/askhistorians), [Facebook](https://www.facebook.com/askhistorians/), and [Sunday Digest](https://www.reddit.com/r/AskHistorians/search?q=title%3A%22Sunday+Digest%22&restrict_sr=on&sort=new&t=all) feature excellent content that has already been written!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AskHistorians) if you have any questions or concerns.*",
            "title_similarity": "0.50306976"
        },
        {
            "id": "h2yib3d",
            "score": 25,
            "text": "[removed]",
            "title_similarity": "0.0018157605"
        },
        {
            "id": "h2y4272",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "0.0018157605"
        },
        {
            "id": "h30auy3",
            "score": 37,
            "text": "Has there ever been any comparative work done with regard to other similar contemporary Catholic institutions (schools/orphanages) in other countries? \n\n\n>[Mass grave of babies and children found at Tuam care home in Ireland\n](https://www.theguardian.com/world/2017/mar/03/mass-grave-of-babies-and-children-found-at-tuam-orphanage-in-ireland)\n\n>The home, run by the Bon Secours Sisters, a Catholic religious order of nuns, received unmarried pregnant women to give birth. The women were separated from their children, who remained elsewhere in the home, raised by nuns, until they could be adopted.\n\nAnd in Scotland:\n\n>[The Scottish child abuse inquiry is to investigate claims that the bodies of at least 400 children from a home once run by Catholic nuns are buried in an unmarked mass grave.](https://www.theguardian.com/uk-news/2017/sep/10/smyllum-park-lanark-orphanage-catholic-nuns-children-mass-grave-allegedly)\n\nThere's an interesting thread here, but I'm not qualified to comment.",
            "title_similarity": "0.5684649"
        },
        {
            "id": "h2zynxv",
            "score": 118,
            "text": "Just add one point of clarification to your question, none of the reports are actually of mass graves. They are of unmarked burials. What these represent our high numbers of student deaths over a span of many years. Sometimes they were unmarked from the beginning, other times they had the markings removed. For example at the most recent reported large body of unmarked graves, the community is suggesting that most of the markers were removed in the 60s. At the previous large amount of graves, the Truth and reconciliation commission had reported 50 confirmed deaths. That is why the discovery of 215 Graves was so shocking. It was four times the number of previously reported deaths.\n\nTalking about what a person should expect is obviously speculation, but it would not be unreasonable to assume that there are also graveyards attached to Australian Aboriginal missions as well. The question of whether those graveyards have accurate records associated with them depends on a number of factors, and can't really be assumed one way or the other. On the other hand, it is very likely that the number of Graves at these missions will represent a higher mortality rate then was prevalent in the general population of children of that age, and if it is significantly higher in this conversation will probably continue in Australia. \n\n Part of what is interesting about what is going on right now in Canada is that none of what is being reported are things that were unknown. Communities told the Truth and reconciliation commission that these graveyards existed. They also gave some indication of how many graves there were. They asked for money to determine how many, and were denied. What has happened now is some communities have begun to do this work on their own and so the numbers are coming out confirming what people already knew, and for some reason everybody is shocked. Maybe it is just the right moment for some new outrage, maybe even some action. What I'm saying is that whether or not this becomes a story in Australia largely depends on whether people want to talk about it or not.",
            "title_similarity": "0.7077102"
        },
        {
            "id": "h2ytco2",
            "score": 299,
            "text": "Firstly, [there's a very detailed discussion of what happened in the Canadian residential schools](https://www.reddit.com/r/AskHistorians/comments/np9lez/who_is_this_child_an_indigenous_history_of_the/) from this sub from the start of the month, which is worth reading for detail and context (which was posted by /u/edhistory101 but was a collaborative work of a team).\n\nAustralia shares some deep cultural similarities with Canada and the US, given its dominant white Anglophone Christian cultural background, and given its history of the dispossession of indigenous peoples across, basically, the span of an entire continent and over a long period of time. Unsurprisingly, during a fundamentally similar time period to Canada's Residential Schools, Australia also had a similar practice with children of Aboriginal origin being placed in residential schools usually called Missions, with a similar objective: the 'civilisation' of Aboriginal peoples. As in the Residential School in Canada, the missions in Australia were often run by religious groups (most prominently Lutherans, seemingly, which is a little odd given the much more prominent Anglican and Catholic churches here), to whom Australian governments were happy to pawn off their responsibilities.\n\nAustralians will be aware of Kevin Rudd's apology to the Stolen Generations in 2007. This was ultimately motivated by the  plenty of heartbreaking stories in the [1997 'Bringing Them Home' report (this links to a PDF of the actual 500+ page report)](https://bth.humanrights.gov.au/sites/default/files/documents/bringing_them_home_report.pdf) of children being forcibly removed from their families and often put in missions. You are curious as to whether the 'Bringing Them Home' report is accurate/politically motivated, and the answer is that it aimed to be above partisan politics: while it was commissioned in 1995 by the Keating government, it was conducted by the Human Rights and Equal Opportunity Commission; its co-authors were Sir Ronald Wilson (a former High Court judge and the President of the HREOC) and Mick Dodson, a barrister and member of the Yawuru people from Western Australia. On pages 30 and 31 of the report, it details their methodology for arriving at an estimate of the proportion of people affected; they say it is:\n\n>not possible to state with any precision how many children were forcibly removed, even if that enquiry is confined to those removed officially. Many records have not survived. Others fail to record the children's Aboriginality\n\nHowever, given an analysis of surveys and census data, etc, they say that 1 in 10 is the minimum, and various means of estimating the proportion likely suggest it's more like 2 or 3 in 10. \n\nYounger Australians will often have studied literature and music in school which artistically represents Aboriginal peoples' feelings at the situation of being sent off to these Missions, [such as Archie Roach's 1990 song 'Took The Children Away'](https://www.youtube.com/watch?v=IL_DBNkkcSE). Roach sings about how: \n\n>...they fenced us in like sheep.\n\n> Said to us come take our hand\n\n> Sent us off to mission land.\n\nIn the second verse, Roach sings a blistering indictment of the practice: \n\n> The welfare and the policeman\n\n> Said you've got to understand\n\n> We'll give them what you can't give\n\n> Teach them how to really live.\n\n> Teach them how to live they said\n\n> Humiliated them instead\n\nSome might have also come across [the Mission Songs Project](https://www.performinglines.org.au/projects/mission-songs-project/), which perform (secular) songs associated with the Missions - the 'songs sung after Church'.\n\nIn regards to what happened in Australia versus what happened in Canada, [a 2002 paper by Antonio Buti](https://heinonline.org/HOL/Page?handle=hein.journals/uwsydl6&id=29&collection=journals&index=) directly compares the removal of indigenous children in Canada and Australia, finding them to be fairly similar on several levels, including the level of care and abuse in the Missions/Residential Schools: \n\n> [a survey] conducted by the Aboriginal Legal Service of Western Australian (ALSWA) gives further support to the sub-standard treatment and abuse many Aborigines placed in missions and other institutional care suffered. Out of a survey response of 483, of whom 411 spent some time in a mission, 81 percent experienced physical abuse and 13 percent experienced sexual abuse during their mission stay.\n\nAnd like in Canada and the US, as others have so vividly depicted in the post I refer to at the top of this comment, the *point* wasn't education, but was a removal of indigeneity if possible (in Australia, with special emphasis on civilising those Aboriginal children who were potentially light-skinned enough to potentially *pass* as not-indigenous). This is a quote from an person who spent time in the mission from interviews conducted by the ALSWA published in 1995, and quoted by Buti:\n\n> We were inculcated into a Christian religion and my Aboriginal culture or history was non-existent. That was completely irrelevant to our lifestyles at that stage. It was really an understatement to say that we were not taught anything about our Aboriginal culture or history. The fact is that our Aboriginality was never mentioned, it was never a consideration.\n\nRosalind Kidd's 1997 book *The Way We Civilise* is focused on Aboriginal people in Queensland in particular, and is based on access to Queensland government files. Kidd isn't specifically focused on the Missions, and sees the Missions as being part of a wider project to *civilise* (thus the title of the book). She portrays further detail of the 'civilising' practices that ultimately left generations of people traumatised (Beverley Raphael, an Australian psychiatrist specialising in intergenerational trauma responses, is quoted in the Bringing Them Home report comparing the trauma response in many Aboriginal families as a result of this process to that in Holocaust survivors). Kidd especially focuses on the endemic health problems in the Missions resulting from, at times, malnutrition, but more commonly poor living conditions, and...a lack of caring/official will to fix poor hygiene practices in the Missions (rather than a lack of understanding of the issues), which resulted in regular deaths. And probably, this isn't a surprise to anyone who read the post on Canadian and US practices linked above.\n\nThere are also lost/poorly documented graves in Australia associated with the Missions which have been discussed ([e.g., this news article on some on Fraser Island](https://www.abc.net.au/news/2014-11-09/scientists-discover-70-aboriginal-graves-on-fraser-island/5877802)). [There is also a 2013 academic paper on unmarked graves near a mission in Cape York](https://link.springer.com/article/10.1007/s10761-013-0242-1). Given everything that's come out about the mistreatment of First Nations people in Canada in Residential Schools, and the similarities in practices in Australia and Canada discussed by Buti, I would not be surprised if there are some similarly horrific secrets buried in unmarked graves near Missions in Australia, because the situations otherwise seem fairly similar. However, if those exist, they don't appear to have yet been the topic of sustained historical or archaeological research on the topic in Australia.",
            "title_similarity": "0.773138"
        },
        {
            "id": "h2ysfga",
            "score": 1087,
            "text": "Australian history grad student here - although my research doesn't cover the whole country in depth. /u/djiti-djiti could also provide a solid answer - especially for WA.\n\nMy cautious answer would be that, yes, we should prepare ourselves for the possibility that more mass graves are found in Australia. A mass grave was found two years ago at Cherbourg in Queensland, which was an Aboriginal reserve in the early twentieth century. Most of those buried died during the Spanish Flu epidemic - at a rate vastly disproportionate to non-indigenous communities. It is possible that similar graves might be found elsewhere in much of Australia - as specifically Aboriginal settlements, camps and missions existed throughout the country. There have also been several grave sites associated with the frontier wars in Australia.\n\nThe conditions that existed on some missions, cattle stations and plantations in Queensland and the Northern Territory are worth particular concern. Ronald and Catherine Berndt were two anthropologists who conducted a report on the health and safety conditions of Indigenous labourers and their families on stations in the Territory. They found many cases of tuberculosis, malnutrition, work-related injuries, serious infections and many other preventable illnesses. There was also a very high rate of infant and mother mortality. When the Berndt's were at Wave Hill in 1946, they observed four births; three of the children and two of the mothers died. Their report, however, was officially suppressed and was only published in the late 1980s - more than 40 years later. \n\nIndigenous people often went to great lengths to ensure proper burials where they could - Victor Vincent, a Gurindji man, recounted that he had to carry a friend's body at night time, by hand, to bury him several kilometres away from the main camp. However, there are accounts of people who weren't able to be buried until long after their deaths - and multiple Gurindji accounts discuss how some bodies were left hanging on trees, while station managers refused to allow workers time to properly bury them.\nThe station, at the time, was owned by Samuel Vestey, the 3rd Baron Vestey - who was then the wealthiest non-royal in Britain. His company, Vestey's Group, paid no tax at all because of several loopholes - and incidentally was the world's largest retailer of meat at the time. In other words - the deplorable conditions on many stations were entirely avoidable.\n\nIf there are mass graves in Australia, like those found in Canada, they're likely at some of the missions, stations and other settlements in the NT, Queensland and Northern WA which had similar conditions to the ones discussed above.\n\nSources and Further Reading\n\nThalia Anthony. \"Unmapped Territory: Wage Compensation for Indigenous Cattle Station Workers\". *Indigenous Law Review* 3. 2007\n\nCatherine and Ronald Berndt. *End of an Era: Aboriginal Labour in The Northern Territory*. Australian Institute of Aboriginal Studies, 1987.\n\nNoel Loos. *Invasion and Resistance: Aboriginal-European Relations on the North Queensland Frontier 1861-1897.* Australian National University Press, 1981\n\nAnne Scrimgeour. *On Red Earth Walking: The Pilbara Aboriginal Strike, Western Australia 1946-1949.* Monash University Publishing, 2020\n\nCharlie Ward. *A Handful of Sand : The Gurindji Struggle, after the Walk-off*. Melbourne, Monash University Press, 2016",
            "title_similarity": "0.7735465"
        },
        {
            "id": "h2ymdqe",
            "score": -1,
            "text": "[removed]",
            "title_similarity": "0.0018157605"
        },
        {
            "id": "h328m4w",
            "score": 4,
            "text": "Could I follow up and ask about if the same is likely to apply to New Zealand?",
            "title_similarity": "0.2708188"
        }
    ]
}