{
    "My Great-Grandfather's sister went missing in Chicago in 1898 at the age of 14 while walking to her piano lesson. What likely happened to young children like her who were abducted during the turn of the century in large American cities like Chicago? (Her missing person's ad included!)\n**R5**: This is the full page ad that my great-grandfather's father took out in the Chicago Tribune following his daughter's abduction. The story goes that she was walking to her piano lesson in southside Chicago (at the time a wealthier neighborhood), but never made it to the piano lesson. They searched for her for years - going to brothels, factories, the works, but never found her.\n\n**Some personal context** is that my grandfather (this would have been his aunt) is likely dying (after a long wonderful life). Him and his wife (my grandma) have always been a huge history buffs and love talking about their family histories, and I would love to shed some new light on this story before he passes :)\n\nEDIT: To make the third paragraph more sensitive so I could share with my parents/siblings \n\nhttps://preview.redd.it/6cng5hrjru771.jpg?width=2448&format=pjpg&auto=webp&s=1bdc13ba3ea733aac2e05b6b3eb42c1a809dded8": [
        {
            "id": "h38l9w9",
            "score": 1,
            "text": "Welcome to /r/AskHistorians. **Please [Read Our Rules](https://www.reddit.com/r/AskHistorians/wiki/rules) before you comment in this community**. Understand that [rule breaking comments get removed](https://www.reddit.com/r/AskHistorians/comments/h8aefx/rules_roundtable_xviii_removed_curation_and_why/).\n\n#Please consider **[Clicking Here for RemindMeBot](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps://www.reddit.com/r/AskHistorians/comments/o931b4/my_greatgrandfathers_sister_went_missing_in/%5D%0A%0ARemindMe!%202%20days)** as it takes time for an answer to be written. Additionally, for weekly content summaries, **[Click Here to Subscribe to our Weekly Roundup](https://www.reddit.com/message/compose/?to=AHMessengerBot&subject=Subscribe&message=!subscribe)**.\n\nWe thank you for your interest in this *question*, and your patience in waiting for an in-depth and comprehensive answer to show up. In addition to RemindMeBot, consider [using our Browser Extension](https://www.reddit.com/r/AskHistorians/comments/d6dzi7/tired_of_clicking_to_find_only_removed_comments/), or getting the [Weekly Roundup](https://www.reddit.com/message/compose?to=subredditsummarybot&subject=askhistorians+weekly&message=x). In the meantime our [Twitter](https://twitter.com/askhistorians), [Facebook](https://www.facebook.com/askhistorians/), and [Sunday Digest](https://www.reddit.com/r/AskHistorians/search?q=title%3A%22Sunday+Digest%22&restrict_sr=on&sort=new&t=all) feature excellent content that has already been written!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AskHistorians) if you have any questions or concerns.*",
            "title_similarity": "0.42016095"
        },
        {
            "id": "h39no9g",
            "score": 47,
            "text": "[removed]",
            "title_similarity": "-0.08041237"
        },
        {
            "id": "h39rgwj",
            "score": 3999,
            "text": "The sorts of things that happened to 14 year old girls who disappeared in Chicago in 1898 were not that different from the sorts of things that can happen today. They could run away from home, with or without someone else; suffer an accident; be kidnapped for ransom; or be attacked, abducted, robbed, raped, or murdered. Elsie Stahl was never, apparently, found, so it's very hard to know what the range of possibilities in her case actually were, but a survey of the contemporary Chicago press makes it clear the police considered most or all of these circumstances at one time or another, and that the case remained news, on a small scale, for almost a year.\n\nTo begin with the coverage itself, Stahl was last seen on Thursday 3 November, 1898, when she left her – apparently pretty affluent – family home at 104 Cleveland Street, Chicago \\[*Chicago Tribune*, 8 November 1898\\]; she told her family that she was heading to the home of her music teacher, a Miss L. Reubhausen, which was only five blocks away on Eugenie Street \\[*Chicago Daily News* 18 November 1898\\]. There had been some sort of family row that day or the night before, and several papers reported that she had been \"scolded\" shortly before her disappearance \\[*Daily News*, 16 + 18 November 1898; *Inter-Ocean,* 30 July 1899\\].\n\nThe first reports I've found do suggest there was initially some reason to suppose Elsie had chosen to disappear. She had been staying out each evening between the hours of 7 and 9 or 10pm, claiming she was practising the piano at her teacher's house; this was apparently untrue, and it's unclear what she was doing at those times, though one of her friends reported she had been seen on Clybourn Avenue – one of the city biggest and most bustling thoroughfares, and hence the sort of place two people might arrange to meet. Miss Reubhausen, the teacher, was tracked down by the press and reported that, while Elsie (\"a swell little girl... \\[with\\] an air of dignity and breeding\")  had apparently been taking money from her parents regularly for her music lessons, she had not actually seen her since late July. This led to suggestions that the girl had been hoarding money to run away, that her disappearance had been triggered by the fear her deceptions were about to be found out, and that she had perhaps been \"persuaded by some friend who had an influence over her and was now hiding her.\" \\[All *Daily News*, 18 November 1898\\]\n\nIt seems that Elsie's mother was initially prepared to concede that something of this sort had happened. She almost immediately hired a private Pinkerton detective, who discovered (or claimed to have discovered) something or other that Mrs. Stahl chose not to reveal to the press, but which persuaded her \"that the money she paid... was not wasted.\" \\[*Daily News*, 18 November 1898\\]  Her father, Gottlieb, on the other hand – he was the owner of a furniture store on Division Street \\[*Daily News*, 16 November 1898\\] – always strongly denied that his daughter had run away from home, pointing out that Elsie had left both her meagre savings and a gold watch behind in the house when she left it \\[*Dziennik Chicagoski*, a daily paper published in Chicago in Polish, 17 May 1899\\].\n\nThe idea that Elsie had run off, and would eventually return, must have begun to seem less persuasive as the days and weeks passed, and a number of other reports suggested the possibility of abduction, but police \"scouted\" (doubted) the suggestion that \"a strange woman\" had been seen \"hanging around the Stahl house\" at the time of the disappearance \\[*Tribune*, 8 November 1898\\], and don't seem to have followed up on a report made, months later, by a reprographic company salesman by the name of Allen O'Brien to the effect that he had seen a girl closely resembling her at Chicago's Union station accompanied by an elderly woman \\[*Daily News*, 16 May 1899\\]. This last report may have been a hoax, as, almost certainly, was the strange tale that appeared in the papers six months after the disappearance to the effect that three schoolboys playing truant from their school had found a message in a bottle on the shore of Lake Michigan which read: \"I am a prisoner at the foot of Randolph Street pier. For God's sake notify my parents. Elsie Stahl.\" This last lead was one that the police did – unsuccessfully – pursue. \\[*Inter-Ocean*, 16 May 1899\\]. They also shared information about the missing girl with the authorities in nearby towns \\[*Daily News*, 18 November 1898\\].\n\nThe theory the police seem to have given most credence to was the idea that Stahl's \"intimate friend\", a girl named Kittie Boyer, knew something about the disappearance. Detectives informed the press that Boyer had been \"plentifully supplied with money lately\", and although, interviewed by journalists, the Boyer family disclaimed all knowledge of the disappearance \\[*Daily News*, 16 November 1898\\], the police plainly found it suspicious that the girl failed to visit the Stahl family after Elsie vanished \\[*Tribune*, 17 November 1898\\].\n\nIt doesn't seem all that plausible that the authorities would have described the theft of cash sufficient to pay for a few piano lessons (these were apparently charged at the rate of $2.25 per month \\[*Daily News*, 18 November 1898\\]), which is all it seems Elsie might have had on her at the time, as a \"plentiful supply,\" even for a teenage girl, so I'm not convinced this last report necessarily implies that Boyer was suspected of attacking her friend herself. Rather, it seems to me to possibly hint at one of the potential outcomes that you mention in your query – that Stahl had been abducted and forced into the sex trade. Certainly some of the Chicago newspapers seem to have imagined this was a potential motive; why else note that Elsie was \"as well developed as a girl of 15 or 16\"? \\[*Daily News,* 17 November 1898\\]  Moral panics concerning the so-called \"white slave trade\" were fairly common at the time, and certainly did occur in Chicago; Karen Abbott's *Sin in the Second City*, a book about the city's famous, and upmarket, Everleigh Club brothel, covers a number of such rumours dating back to 1887, when a police raid on a Michigan lumber camp uncovered nine prostitutes, one of whom secured an acquittal when her case came to court by successfully pleading she had been forced into sexual slavery.\n\nAbbott very much downplays the likelihood that such coercion was actually commonplace, noting that the proprietors of the Everleigh Club, for instance, were adamant that they forbade drink, drugs and violence on their premises, and made regular medical check-ups available to the women who who worked there, with the result that \"there was actually a waiting list, spanning the continental United States, eager to join the house.\" This may well paint a far too rosy picture of the contemporary Chicago sex trade as a whole, but Abbott unpicks a number of contemporary rumour-panics to show that the term \"white slavery\" was mostly applied, by evangelical Christian organisations, to sex workers who were, in fact, consenting adults. Certainly a missionary named Charlton Edholm, who worked for the Woman's Christian Temperance Union, claimed in 1899 that \"there is a slave trade in this country, and it is not black folks at this time, but little white girls —thirteen, fourteen, sixteen, and seventeen years of age—and they are snatched out of our arms, and from our Sabbath schools and from our Communion tables.\" So the idea that teenage girls were being abducted and sold into \"white slavery\" was definitely current at the time of Stahl's disappearance. This may explain why the police were so suspicious of Kittie Boyer and her apparently recent and unexplained affluence, but it's reasonable to conclude by saying that historians of the Chicago of this period are pretty sceptical of such claims, and that Stahl's disappearance remains, very sadly, an almost complete mystery.",
            "title_similarity": "0.760998"
        },
        {
            "id": "h39bkhp",
            "score": -3,
            "text": "[removed]",
            "title_similarity": "-0.08041237"
        },
        {
            "id": "h4n7e1c",
            "score": 8,
            "text": "You should consider having a dna test for the appropriate grandparent. There is a good chance the missing girl had children who could show up as your grandparent’s cousin in the DNA test. You can review the names that appear as relatives and identify people without a known connection. Then reach out to them to see how you may be related.",
            "title_similarity": "0.5650481"
        }
    ]
}