{
    "When and why did the general political tone of American country music shift from left-wing to right-wing?\nI’m not sure if this is even objectively true, but I listen to a lot of country music and I’ve noticed in the latter half of the 20th century, any political notes usually were left leaning. Steve Earle, Johnny Cash, Willie Nelson, John Prine, all were considered pioneers of progressivism and at least one was a self-declared socialist. However modern country music seems to be overwhelmed by the “America fuck yeah” type of country, thinking Luke Bryan, Florida Georgia Line, etc. While left-leaning country still exists (Jason Isbell and Steve Earle for example), it seems like there’s been a tone shift between 1960 and today. Why is that, and when did the shift occur? If I had to guess I’d say around 9/11 so I don’t think this violates rule 8.": [
        {
            "id": "h3vdtdz",
            "score": 1,
            "text": "Welcome to /r/AskHistorians. **Please [Read Our Rules](https://www.reddit.com/r/AskHistorians/wiki/rules) before you comment in this community**. Understand that [rule breaking comments get removed](https://www.reddit.com/r/AskHistorians/comments/h8aefx/rules_roundtable_xviii_removed_curation_and_why/).\n\n#Please consider **[Clicking Here for RemindMeBot](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps://www.reddit.com/r/AskHistorians/comments/ocnhum/when_and_why_did_the_general_political_tone_of/%5D%0A%0ARemindMe!%202%20days)** as it takes time for an answer to be written. Additionally, for weekly content summaries, **[Click Here to Subscribe to our Weekly Roundup](https://www.reddit.com/message/compose/?to=AHMessengerBot&subject=Subscribe&message=!subscribe)**.\n\nWe thank you for your interest in this *question*, and your patience in waiting for an in-depth and comprehensive answer to show up. In addition to RemindMeBot, consider [using our Browser Extension](https://www.reddit.com/r/AskHistorians/comments/d6dzi7/tired_of_clicking_to_find_only_removed_comments/), or getting the [Weekly Roundup](https://www.reddit.com/message/compose?to=subredditsummarybot&subject=askhistorians+weekly&message=x). In the meantime our [Twitter](https://twitter.com/askhistorians), [Facebook](https://www.facebook.com/askhistorians/), and [Sunday Digest](https://www.reddit.com/r/AskHistorians/search?q=title%3A%22Sunday+Digest%22&restrict_sr=on&sort=new&t=all) feature excellent content that has already been written!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AskHistorians) if you have any questions or concerns.*",
            "title_similarity": "0.4645331"
        },
        {
            "id": "h3w6oiz",
            "score": 1842,
            "text": "(1/2)\n\nBroadly speaking, the assumption that American country music used to be significantly more left-wing is incorrect. Commercial American country music has generally been focused around the Nashville establishment that coalesced in the 1940s around music publishers like Acuff/Rose and the outposts established by record companies in the wake of the 1920s/1930s success of the likes of Jimmie Rodgers and the Carter Family. Broadly speaking, this Nashville establishment, and the network of commercial radio stations, live venues (Nashville's Grand Old Opry, most famously), and record stores that serves this music's audience has *always* pandered to its audience, which is predominantly white, relatively rural, and Southern. As such, where that music touches on politics, it almost always has done so based on a mix of the establishment's politics and their understanding of the political and cultural orientations of their audience, which they saw as being focused around the traditions of the South (which of course in the 1940s and 1950s *did* include various Jim Crow laws). To the extent that the Southern audience for country music's values change over time, the politics of the music will also likely change over time.\n\nOf course, the existence of an establishment almost guarantees the existence of rebels against that establishment of some form or another, those discontented with the way things are, whether because they think the Nashville establishment is *too* focused on tradition, or whether they think it's fundamentally ignoring the important part of the tradition, etc. The South as an area of America, obviously, contains a lot of people with a variety of different cultural backgrounds and outlooks, and not everyone there sees themselves in the same way, even if they still identify with the area and thus the musical origins of the area. Finally, of course, there's plenty of fans of country music who aren't Southern, who are fascinated by the way the music sounds, but don't always share the shared cultural background of the Nashville establishment. Broadly speaking, we might call the tradition of musicians strongly influenced by country music - and most often influenced by the country music of the past, rather than what's currently selling - 'Americana'.\n\nAmericana is, understandably, less likely to be embraced by the country music establishment, as it often has quite different values both in the music and in the attitude and orientation of the music. Jason Isbell, who you mention as a modern left-wing country artist, is an example of Americana; [assuming the facts on his Wikipedia page are accurate](https://en.wikipedia.org/wiki/Jason_Isbell#Discography), he's been nominated for over a dozen Americana Music awards and has only ever been nominated for one Country Music Association Award; he has #1 country albums (which these days is based on his being categorised as such by Billboard - you may remember some controversy about the classification of Lil Nas X's 'Old Town Road'), but doesn't have hit singles on the country charts (which requires airplay on country music stations). But as the example of Jason Isbell also suggests, Americana often can gain a wider audience than establishment country music; Jason Isbell will get the opportunity to, say, get interviewed on coastal NPR stations in a way more establishment country stars likely wouldn't, because Isbell is interesting to their audiences. \n\nIn terms of the Nashville establishment, one illustration of their conservatism is in their support for Senator George Wallace, the Governor of Alabama who ran on a segregationist third-party platform in the 1968 election, winnnig the states of Alabama, Arkansas, Georgia, Louisiana, and Mississippi. Tammy Wynette sang 'Stand By Your Man' at a George Wallace appearance (and which became an unofficial Wallace anthem) and Hank Snow ('I've Been Everywhere') went on tour with Wallace during his Presidential campaign. \n\nWallace, in 1968, was fond of joking about long-haired hippies as they were protesting him, saying things like:\n\n> That’s alright, that’s alright honey – that’s right sweetie-pie – oh, that’s a he. I thought you were a she\n\nand\n\n>  You come up when I get through and I'll autograph your sandals for you. That is, if you got any on . . . You need a good haircut. That's all that's wrong with you. . . There are two four-letter words I bet you folks don't know: 'w-o-r-k' and 's-o-a-p.'\n\nIn 1972, after Wallace had been seriously injured after being shot, a crowd of 7,000 gathered at 'Wallace's Woodstock' at the Old Plantation Music Park near Highland City in Florida (basically part of George Jones and Tammy Wynette's property) to hold a benefit for Wallace, which featured performances from Jones and Wynette, Ferlin Husky, Del Reeves, and George Wallace Jr.\n\nNot everyone in country music was a Wallace supporter in 1968; Roy Acuff, one of the biggest figures in the Nashville establishment, was a prominent supporter of Richard Nixon during the 1968 election. Nixon ran ads on Porter Wagoner's television show - one of the most prominent country music shows in the south - during the campaign, warning that a vote for Wallace was a vote for Hubert Humphrey, the (Northern) Democratic candidate.\n\nIn essentially this same era, there were several prominent country hits that were strongly pro-Vietnam (which had what you'd describe as 'America fuck yeah' vibes), in marked contrast to all those protesting long-haired hippies Wallace was making fun of: \n\n* 'Hello Vietnam' by Johnny Wright (a #1 country single in October-November 1965), which featured the lyrics 'America has trouble to be stopped...we must stop Communism in that land'. \n\n* 'Tell Them What We're Fighting For' by Dave Dudley (which hit #4 on the country charts in mid-January 1966), with lyrics from the perspective of the soldier writing home: why, he asks, is it the case that 'people marching are in our streets?' He exhorts: 'Mama, tell them what we're fighting for'.\n\n* Dave Dudley's 'Viet Nam Blues' (a #12 on the Country chart in April 1966), which narratively is a soldier reacting in disbelief to protestors in Washington DC (who he thinks support the Communists instead).\n\n* Autry Inman's 1968 'The Ballad Of Two Brothers' (a #14 on the country chart, and a #48 on the mainstream chart), which portrays a serving soldier in Vietnam and his draft resister brother - the draft resister changes his mind in favour of war after his brother dies valiantly.\n\n* 1970's 'The Fightin' Side Of Me' by Merle Haggard (a #1 country hit), which attacks those 'harping on about wars', saying 'if you don't love it, leave it: let this song...be a warning'.\n\nAs these examples suggest, the country music establishment in the 1960s and 1970s was perfectly happy with intrinsically right-wing sentiments in terms of the big issues of the day.",
            "title_similarity": "0.8422953"
        },
        {
            "id": "h3vtypa",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "0.03472516"
        },
        {
            "id": "h3vug51",
            "score": 21,
            "text": "[removed]",
            "title_similarity": "0.03472516"
        },
        {
            "id": "h3vuof9",
            "score": 21,
            "text": "[removed]",
            "title_similarity": "0.03472516"
        }
    ]
}