{
    "USA which is considered fairly advanced in women rights have never seen a women leader, but countries like India, Pakistan, Bangladesh which are considered to be backward in women rights have had women prime minsters. Why is this so?\n": [
        {
            "id": "h4c0zkm",
            "score": 1,
            "text": "Welcome to /r/AskHistorians. **Please [Read Our Rules](https://www.reddit.com/r/AskHistorians/wiki/rules) before you comment in this community**. Understand that [rule breaking comments get removed](https://www.reddit.com/r/AskHistorians/comments/h8aefx/rules_roundtable_xviii_removed_curation_and_why/).\n\n#Please consider **[Clicking Here for RemindMeBot](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps://www.reddit.com/r/AskHistorians/comments/ofern4/usa_which_is_considered_fairly_advanced_in_women/%5D%0A%0ARemindMe!%202%20days)** as it takes time for an answer to be written. Additionally, for weekly content summaries, **[Click Here to Subscribe to our Weekly Roundup](https://www.reddit.com/message/compose/?to=AHMessengerBot&subject=Subscribe&message=!subscribe)**.\n\nWe thank you for your interest in this *question*, and your patience in waiting for an in-depth and comprehensive answer to show up. In addition to RemindMeBot, consider [using our Browser Extension](https://www.reddit.com/r/AskHistorians/comments/d6dzi7/tired_of_clicking_to_find_only_removed_comments/), or getting the [Weekly Roundup](https://www.reddit.com/message/compose?to=subredditsummarybot&subject=askhistorians+weekly&message=x). In the meantime our [Twitter](https://twitter.com/askhistorians), [Facebook](https://www.facebook.com/askhistorians/), and [Sunday Digest](https://www.reddit.com/r/AskHistorians/search?q=title%3A%22Sunday+Digest%22&restrict_sr=on&sort=new&t=all) feature excellent content that has already been written!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AskHistorians) if you have any questions or concerns.*",
            "title_similarity": "0.40022382"
        },
        {
            "id": "h4chkye",
            "score": 10,
            "text": "[removed]",
            "title_similarity": "0.11721811"
        },
        {
            "id": "h4d9tam",
            "score": -19,
            "text": "[removed]",
            "title_similarity": "0.11721811"
        },
        {
            "id": "h4cy24i",
            "score": 113,
            "text": "This is at the end an opinion question. But I will try to explain the social and cultural reasoning which should provide some insight, mainly about the subcontinent. The second para is mainly for setting the contrast and can be skipped.\n\nI won't go deep for USA as I don't have any data backed insight. I will note that while USA might stand out as a sore thumb for having no elected female leader, many western nations have lower instances of female top leaders overall. For instance France has had no female President, only a female Prime Minister. [Cresson](https://en.wikipedia.org/wiki/%C3%89dith_Cresson). Soviet Union, and current Russia, have not had any female President, Chairman, Vice President or General Secretary. This is in contrast to the higher number of women getting elected compared to subcontinent. Currently women constitute 38.8% of French National Assembly [French National Assembly](http://www.lemonde.fr/elections-legislatives-2017/article/2017/06/19/legislatives-2017-223-femmes-elues-un-record_5146848_5076653.html). On the other hand, India has only 10% of its parliamentarians as women (which is a high at least for the last two decades) [2020 Women Parliamentatrians India](https://thewire.in/women/women-parliament-lok-sabha-rajya-sabha-politica-parties). I suspect that it is systemic and societal sexism that still pose hurdle for electing women head of state in western societies (although I would again say this is a personal conjecture). But I wanted to highlight that western society does have a higher representation of women compared to subcontinent in elected / decision making bodies. So it cannot be said that subcontinent is more accepting of women in politics in general or have higher participation.  \n\n\nThe actual answer to why women as head of state is more frequent (but still a rarity) in the subcontinent is anti-climatic; it is because of dynastic politics. The young democracies still have a lot more dynastic parties compared to the more mature democracies. In the three democracies, India, Bangladesh and Pakistan, at least one major party has its roots in the Independence movement (I am not aware of Sri Lankan politics a lot) and the leader families still control a lot of them. This does not mean the politics is still governed by issues of 1940s (or 1970s) but that most of the parties are under familial control established by the movements.\n\n&#x200B;\n\nIn India the Independence movement was led Indian National Congress (INC), which was at the time large democratic in selection of leader (or at least non family based). After Independence, it easily retained control over most of the constituencies under the popular leader Jawaharlal Nehru who remained Prime Minster (PM) till his death in mid 1960s. This long leadership of both the party and the government had in a way undermined its capacity to elect future leadership. While Lal Bahadur Shastri was selected as PM, he had a short term due to an unexpected demise (1964-66). The party elected Indira Gandhi in a hope to bank on the Nehru legacy and have a puppet (she was nicknamed [gungi gudiya](https://books.google.com/books?id=UKBcLhCxSvQC&pg=PAPA27&q=%2522goongi%2520gudiya%2522%2520indira)/mute doll by opposition) but gained control by a combination of assertiveness, merit and family legacy. Indira Gandhi had several terms and became the longest serving PM after her father. Her family continues to lead the party. Her daughter in law and wife of former PM Rajiv Gandhi, Sonia Gandhi was the party leader for INC victory in 2004 and 2009 Lok Sabha elections. But she declined the top position, presumably due to her heritage (Italian born and bred) and resultant controversy. But she was considered the defacto leader of the party and nicknamed [High Command](https://theprint.in/opinion/sonia-gandhi-continuing-is-no-surprise-congress-high-command-culture-goes-back-over-50-yrs/489428/) during the term of Manmohan Singh.\n\nThis long winded tale was to give an idea of how dynastic politics rules in India and for dynasts, gender may present both a challenge and an opportunity. Similarly, first female PM of Pakistan, Benazir Bhutto, was the daughter of former PM Zulfikar Bhutto. Bangladesh's longest serving PM Sheikh Hasina is the daughter of first President (later PM) and 'Father of the Nation' Sheikh Mujibur Rahman. Her current opposition and the first female PM of Bangladesh Khaleda Zia is the wife of former President Ziaur Rahman.\n\nWhile, you mentioned subcontinent countries, similar pattern can be seen in other young nations. Aung San Suu Kyi the former State Counsellor of Myanmar was the daughter of Father of the Nation, Aung San. As democracies mature, dynastic politics is expected to weaken. This can be currently seen in both India and Pakistan (at least at union government level). Bangladesh is younger so probably have a few decades. So it will be left to seen if women can continue to occupy the highest post.\n\nJust a clarification - this does not mean that all leaders in subcontinent are dynastic. Or only females are dynastic leaders. But to show that female head of state are likely to be daynasts as of now. Similarly west also has dynastic leaders but they are less likely. Also, this does not imply that the female leaders were merely elected due to dynastic connections. But in a men's world, such opportunities may not be available to all women.\n\nEdit: corrected info on France PM",
            "title_similarity": "0.80258363"
        },
        {
            "id": "h4d05fq",
            "score": 2643,
            "text": "Before I begin, full disclosure: I’m not a historian. Rather, I’m a political scientist who studies representation, including gender representation, albeit mostly in advanced democracies.  As such I’m able to speak to broad trends of the history of women’s representation, but I may miss some finer points about specific cases, and will am basing my answer off of political science rather than historical research. \n\n\nTo begin, it’s important to make a distinction between the representation of women overall, and women as head of government/head of state. While the United States has never had a woman as president, unlike the examples you mention, it actually performs better in terms of the percentage of women in its federal legislature (although it is still very far from parity).  The factors that determine these two things are also fairly different, as women’s legislative representation his heavily influenced by factors such as the presence of quotas (which Pakistan and Bangladesh both have in the form of reserved seats)(Hughes 2011), levels of corruption (corruption generally inhibits women’s representation (Stockemer 2011; Swamy et al. 2001)), and parties’ political recruitment practices(Bjarnegård 2013; Norris and Lovenduski 1995). \n\nIt’s also important to note that, contrary to popular belief, discrimination by voters is actually not well-established as a major barrier to women’s representation, at least in advanced western democracies (Sevi, Arel-Bundock, and Blais 2019; Darcy and Schramm 1977). By and large, women receive more-or-less the same number of votes as their male counterparts, although there is some debate as to if women need to be more qualified in order to get the chance to run (Fulton 2012; Black and Erickson 2003). As such, even accepting that the US is more gender egalitarian, this doesn’t necessarily address all of women’s barriers to entry in politics. \n\nAll this said though, you are indeed hitting on a real phenomenon. “In the post World War II period only fifty women have been elected heads of state of their respective countries. Of these fifty women, eleven have come from South and Southeast Asia”(Wijekoon 2000). The reasons for this, unfortunately, are a bit murky, but there’s a few factors we can point to. First, it’s worth noting the role of family dynasty in all of this. For example, India’s Indira Gandhi and Pakistan’s Benazir Bhutto both are the daughters of prime ministers. Wijekoon’s article places a fair deal of emphasis on this factor, arguing that the political culture of South/South-East Asia is very amenable to political dynasties.\n\nBeyond this, the parliamentary systems used in these countries have been pointed to by many scholars as more favourable to electing female leaders, for a number of reasons (Jalalzai 2018). Among these are greater hesitancy women may have to enter a primary race in a presidential system (such as the US), and way that political parties can better mitigate gender discrimination in a parliamentary system. \n\nA final factor pointed to in the literature to explain women’s rise to power in South/South-East Asian countries, and indeed around the world, has been response to political crises. Many female leaders have come to power in the wake of an assassination, corruption scandal, or other political event that calls for dramatic and visible change. In these situations, female politicians can capitalise on many gender stereotypes (women as nurturing, as virtuous, as mothering, etc) and political parties can use a female leader to demonstrate their commitment to real change. This goes hand-in-hand with parliamentary systems, as it is much easier to replace a prime minister than it is to replace a US president, due to the latter’s very fixed election cycle. \n\nIn conclusion, I hope this answer isn’t too dissatisfying. Explaining women’s representation is a very complex topic, particularly in attempting to explain why something *didn’t* happen (in the US case). Hopefully an actual historian will be able to come along and provide more detail on the particular female leaders of the countries you mention in your question. \n\n\nCited sources: \n\n* Bjarnegård, Elin. 2013. Gender, Informal Institutions and Political Recruitment: Explaining Male Dominance in Parliamentary Representation. London: Palgrave Macmillan Limited.\n\n* Black, J. H, and L Erickson. 2003. ‘Women Candidates and Voter Bias: Do Women Politicians Need to Be Better?’ Electoral Studies 22 (1): 81–100. https://doi.org/10.1016/S0261-3794(01)00028-2.\n\n* Darcy, R., and Sarah Slavin Schramm. 1977. ‘When Women Run Against Men’. Public Opinion Quarterly 41 (1): 1–12. https://doi.org/10.1086/268347.\n\n* Fulton, Sarah A. 2012. ‘Running Backwards and in High Heels: The Gendered Quality Gap and Incumbent Electoral Success’. Political Research Quarterly 65 (2): 303–14. https://doi.org/10.1177/1065912911401419.\n\n* Hughes, Melanie M. 2011. ‘Intersectionality, Quotas, and Minority Women’s Political Representation Worldwide’. American Political Science Review 105 (3): 604–20. https://doi.org/10.1017/S0003055411000293.\n\n* Jalalzai, Farida. 2018. ‘Women Heads of State and Government’. In Measuring Women’s Political Empowerment across the Globe, 257–82. Springer.\n\n* Norris, Pippa, and Joni Lovenduski. 1995. Political Recruitment  Gender, Race and Class in the British Parliament. Cambridge: University Press.\n\n* Sevi, Semra, Vincent Arel-Bundock, and André Blais. 2019. ‘Do Women Get Fewer Votes? No.’ Canadian Journal of Political Science 52 (1): 201–10. https://doi.org/10.1017/S0008423918000495.\n\n* Stockemer, Daniel. 2011. ‘Women’s Parliamentary Representation in Africa: The Impact of Democracy and Corruption on the Number of Female Deputies in National Parliaments’. Political Studies 59 (3): 693–712. https://doi.org/10.1111/j.1467-9248.2011.00897.x.\n\n* Swamy, Anand, Stephen Knack, Young Lee, and Omar Azfar. 2001. ‘Gender and Corruption’. Journal of Development Economics 64 (1): 25–55. https://doi.org/10.1016/S0304-3878(00)00123-1.\n\n* Wijekoon, Lavanga. 2000. ‘Why Do South and Southeast Asians Vote for Female Heads of State?’ Asian Journal of Political Science 2: 57–72.",
            "title_similarity": "0.7754309"
        },
        {
            "id": "h4czw9m",
            "score": 305,
            "text": "I'll take a stab at this, in a limited way, as a political scientist, since I think what you're asking has as much to do with institutional arrangements within political systems as it does historical, cultural, and religious trends.\n\nIf you take just the four countries you listed, what you're comparing is one presidential system (the US) to three parliamentary systems. So, to start, it helps to understand the differences between these two systems with regard to how a head of government gets elected. In a presidential system, if you're an aspiring head of government, you have to face the entire electorate as an individual and, in most cases, you have to secure a majority of the vote yourself. One exception to that, of course, is the US, where you can certainly become president without a majority of the vote, but in many presidential systems, runoff elections are popular and guarantee that the winner has a majority of the vote.\n\nIn a parliamentary system, if you were an aspiring head of government, you'd run as an individual in the specific district you represent in the parliament, but becoming head of government (prime minister, in most cases) depends on how you've risen within your party and whether your *party* gets a majority of seats in parliament. Even more important, your role as head of government could be secured in a parliamentary system even if your party got a relatively low plurality of the popular vote or a low plurality of seats (which of these matters more would depend on the type of electoral system, but that's for another post), since you could always form a coalition with other parties in order to govern.\n\nIt's possible in a presidential system without runoff elections (the US) to become head of government with a low plurality of votes, but it's less common, since voters will generally split their votes between two or three main candidates, which means most victors will get majorities or at least pretty large pluralities. In short, the electoral threshold for becoming head of government in a parliamentary system is often lower than it is in a presidential system. Likewise, securing a majority of seats in a parliamentary system is also less dependent on voters' affinity for the specific individual who would be head of government, compared to a presidential system.\n\nThese institutional features answer your question, at least in part. [Jalalzai and Krook](https://journals.sagepub.com/doi/abs/10.1177/0192512109354470) wrote a paper in 2010 that explored this:\n\n>In general, women are more likely to serve in parliamentary systems and more often as prime ministers than as presidents: there have been 40 female prime ministers and 31 female presidents. Some studies attribute the greater success of women in obtaining prime ministerial posts to their ability to bypass a potentially biased general public and be chosen by the party as parliamentary rules dictate (Whicker and Isaacs, 1999). Margaret Thatcher of the United Kingdom and Angela Merkel of Germany are good examples of women rising to power through party promotion (Clemens, 2006; King, 2002). This is different from the processes involved in becoming president within a presidential system, which typically relies on some sort of popular vote for ascension.\n\nBasically, what the authors are suggesting is that it's much more difficult for women to overcome gender biases in a presidential system, where they have to face the entire electorate as individuals, than it is for women in parliamentary systems to rise to leadership positions within their parties and then see their parties to victory (which results in those women becoming heads of government). The institutional arrangements of parliamentary systems, then, would explain why it's possible to see a woman prime minister in countries where women's rights aren't as advanced while simultaneously seeing a lack of female leadership in presidential systems where women's rights might be more advanced. On top of that, in several examples where we have women as heads of government in presidential systems, their rise to power was precipitated by instability, such as the assassination or death of their male spouse, who was president himself, or their rise to power as members of politically prominent families. We see less of this in the US, although Hillary Clinton, as an example, was certainly a member of a politically prominent family.\n\nMoreover, Jalalzai and Krook (2010) note that, in parliamentary systems,\n\n>collaboration is fundamental: the qualities necessary for successfully formulating programs are negotiation, collaboration, and deliberation, all typically considered more feminine. In contrast, presidents in presidential systems act independently of the legislature and generally are expected to lead in a quick and decisive manner, traits which are more often associated with masculinity (Duerst-Lahti, 1997; Jalalzai, 2008).\n\nSo in addition to helping women overcome potential gender biases in the electorate better than presidential systems, parliamentary systems also tend to be more conducive to leadership traits that some researchers would argue are considered more feminine anyway. However, it should be noted, and Jalalzai and Krook point this out, that\n\n>the women who reach top political positions do not always seek to promote women  \nas a group. Leaders like Gandhi, Meir, and Thatcher invoked masculine styles of leadership and did not take steps to improve women’s status during their tenures in office.\n\nThat sort of follows from their point about leadership traits and gender. It's possible that, even though parliamentary systems may be more favorable to traditionally feminine leadership styles, prominent female heads of government still adopt traditionally masculine leadership styles, which might also contribute to overcoming gender bias in the population. \n\nIn sum, the answer to your question may largely come down to the type of government in the countries you reference. However, I will note that, in two of your examples - Pakistan and India - prominent female leaders ended up getting assassinated. Indira Gandhi in India was assassinated in 1984, and Benazir Bhutto in Pakistan was assassinated in 2007. So while parliamentary systems may produce female leaders in countries where women have fewer rights, they don't necessarily guarantee safety, stability, and long-term success for those women.",
            "title_similarity": "0.44280028"
        },
        {
            "id": "h4ddvpz",
            "score": 109,
            "text": "[removed]",
            "title_similarity": "0.11721811"
        }
    ]
}