{
    "Why is organized crime such as Yakuza still thriving but Al-Capone style Italian mob disappeared?\n": [
        {
            "id": "h4x0zak",
            "score": 1,
            "text": "Welcome to /r/AskHistorians. **Please [Read Our Rules](https://www.reddit.com/r/AskHistorians/wiki/rules) before you comment in this community**. Understand that [rule breaking comments get removed](https://www.reddit.com/r/AskHistorians/comments/h8aefx/rules_roundtable_xviii_removed_curation_and_why/).\n\n#Please consider **[Clicking Here for RemindMeBot](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps://www.reddit.com/r/AskHistorians/comments/oir2xr/why_is_organized_crime_such_as_yakuza_still/%5D%0A%0ARemindMe!%202%20days)** as it takes time for an answer to be written. Additionally, for weekly content summaries, **[Click Here to Subscribe to our Weekly Roundup](https://www.reddit.com/message/compose/?to=AHMessengerBot&subject=Subscribe&message=!subscribe)**.\n\nWe thank you for your interest in this *question*, and your patience in waiting for an in-depth and comprehensive answer to show up. In addition to RemindMeBot, consider [using our Browser Extension](https://www.reddit.com/r/AskHistorians/comments/d6dzi7/tired_of_clicking_to_find_only_removed_comments/), or getting the [Weekly Roundup](https://www.reddit.com/message/compose?to=subredditsummarybot&subject=askhistorians+weekly&message=x). In the meantime our [Twitter](https://twitter.com/askhistorians), [Facebook](https://www.facebook.com/askhistorians/), and [Sunday Digest](https://www.reddit.com/r/AskHistorians/search?q=title%3A%22Sunday+Digest%22&restrict_sr=on&sort=new&t=all) feature excellent content that has already been written!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AskHistorians) if you have any questions or concerns.*",
            "title_similarity": "0.3959592"
        },
        {
            "id": "h4zz1lq",
            "score": 33,
            "text": "[removed]",
            "title_similarity": "0.08319226"
        },
        {
            "id": "h4y8rb9",
            "score": 2316,
            "text": "Several reasons:\n\n1. Japanese society is structured differently than American society. Organized crime in the United States was/is often engaged in by immigrant or other outsider groups who didn't have access to usual methods of economic success. In the end of the 1800s gangs were often Irish, then in the 1920s/30s organized crime was dominated by Italians and Jews. Prejudice against these groups both lowered opportunities for economic advancement and incentivized living in tight knit communities distrustful of outsiders - essential for the kind of \"don't snitch\" community mentality that organized crime thrives in. Now days, Irish, Italians, (Ashkenazi) Jews are all considered typical white people assimilated into mainstream American society. and these kinds of external/internal pressures don't exist. I'm less knowledgeable about modern organized crime but I would guess most American organized crime still fits this pattern of outsider/immigrant groups.\n\nJapanese Yakuza and their place in Japanese society is slightly different. Now there are some of the same elements, for example there is a significant presence of ethnic Koreans, as well as people of burakumin heritage. Burakumin are a caste somewhat analogous to the dalit or \"untouchables\" in India. In the Edo era due to Buddhist influence jobs connected with death such as butchers, leather tanners, etc. faced deep stigma. Since the start of the Meiji era prejudce against Burakumin has been de jure illegal but continued into the 20th centuary. According to the 1986 book *Yakuza* by David Kaplan and Alec Dubro 70% of Yamaguchi-gumi, one of the largest syndicates could trace their heritage to the burakumin caste.\n\nWith those huge caveats aside, and acknowledging that all these situations are nuanced, the Yakuza overall doesn't connect to the idea of \"ousider capitalism\" the same way as the US mafia. Yakuza traces it's origins to a class of merchant/traders called tekiya and bakuto who arose in the Edo period. Just as in Europe, the transition from a feudal society to a capitalist society was marked by the the rise of a merchant class over a medieval aristocratic class. It is from parts of this rising merchant class that the Yakuza traces it's earliest origins.\n\n2) Yakuza is much more accepted in Japanese society than mafia in American society by authorities (and to a lesser extent the public). Obviously the mafia is romanticized in American movies/TV, and crime leaders are occasionally viewed as \"Robin Hood\" types. In Japan this occurs as well, but even to a greater degree. Yakuza headquarters are widely known to the public and authorities. Yakuza groups had official websites ([here is a link to the Yamaguchi-gumi website which appears](http://mjyouka.web.fc2.com/) to have been recently taken down, [but was operating in the open as recently as 2014.](http://www.japansubculture.com/ninkyodo-dude-even-the-yakuza-are-speaking-english-now/)). There was a dispute/war between several groups during 2014-16, [this USA Today article talks about a 100 car parade/show of force in a town called Toyama.](https://www.usatoday.com/story/news/world/2015/10/24/japan-yakuza-organized-crime-gangs-violence/74338418/) I lived in Toyama at the time and witnessed it with my own eyes, quite impressive. I could be wrong, but I don't remember a time in the modern era when any organized crime group in the United States did such a brazen show of force.\n\nYakuza groups are part of the community - for example giving away candy every Halloween. [Even working with government to stop during the covid pandemic](https://www.asahi.com/ajw/articles/13550644) to avoid gatherings to spread the disease.\n\n3) Yakuza have connections to politics, particularly right wing political figures. Of course the American mafia had many connections to the government as well, such as infamously working with US government during WWII and the CIA/mafia connection in the 1960s with regard to Cuba. This is even more true in Japan, with many far right groups having connections and even coordinating with the Yakuza. Since the 1950s the Yakuza has been a useful tool in combating left wing groups/movements in Japan as well as providing muscle/support for far-right hate groups. They famously were even bodyguards for President Eisenhower during his 1960 visit, as arranged by Liberal Democratic Party supporter Yoshio Kodama (the Liberal Democratic Party is the main \\*conservative\\* party, don't get confused by how the word liberal is used in American politics). This continues to this day with far right and hate groups coordinating with various Yakuza groups.\n\nSources:[Yakuza, by David E. Kaplan and Alec Dubro](https://www.jstor.org/stable/10.1525/j.ctt1ppxb2)\n\n[Zaitokukai and the Problem of Hate Groups in Japan](https://www.jstor.org/stable/10.1525/as.2015.55.4.715)\n\nFurther reading/information:[Japan Subculture Research Center](http://www.japansubculture.com/)\n\n[Vice Documentary on connection between Yakuza and Japanese Right Wing](https://www.youtube.com/watch?v=qeWfPTCMCTo)",
            "title_similarity": "0.76014924"
        }
    ]
}