{
    "The Simpson family was supposed to represent the typical American family. Could someone with just a GED realistically support a 5 member family, a four bedroom house and two cars just with just one blue collar job in the late 80's early 90's?\n": [
        {
            "id": "h5bk68a",
            "score": 1,
            "text": "Welcome to /r/AskHistorians. **Please [Read Our Rules](https://www.reddit.com/r/AskHistorians/wiki/rules) before you comment in this community**. Understand that [rule breaking comments get removed](https://www.reddit.com/r/AskHistorians/comments/h8aefx/rules_roundtable_xviii_removed_curation_and_why/).\n\n#Please consider **[Clicking Here for RemindMeBot](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps://www.reddit.com/r/AskHistorians/comments/ol1uv6/the_simpson_family_was_supposed_to_represent_the/%5D%0A%0ARemindMe!%202%20days)** as it takes time for an answer to be written. Additionally, for weekly content summaries, **[Click Here to Subscribe to our Weekly Roundup](https://www.reddit.com/message/compose/?to=AHMessengerBot&subject=Subscribe&message=!subscribe)**.\n\nWe thank you for your interest in this *question*, and your patience in waiting for an in-depth and comprehensive answer to show up. In addition to RemindMeBot, consider [using our Browser Extension](https://www.reddit.com/r/AskHistorians/comments/d6dzi7/tired_of_clicking_to_find_only_removed_comments/), or getting the [Weekly Roundup](https://www.reddit.com/message/compose?to=subredditsummarybot&subject=askhistorians+weekly&message=x). In the meantime our [Twitter](https://twitter.com/askhistorians), [Facebook](https://www.facebook.com/askhistorians/), and [Sunday Digest](https://www.reddit.com/r/AskHistorians/search?q=title%3A%22Sunday+Digest%22&restrict_sr=on&sort=new&t=all) feature excellent content that has already been written!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AskHistorians) if you have any questions or concerns.*",
            "title_similarity": "0.27860504"
        },
        {
            "id": "h5bmmve",
            "score": 5,
            "text": "[removed]",
            "title_similarity": "-0.0648331"
        },
        {
            "id": "h5bzget",
            "score": 16,
            "text": "[removed]",
            "title_similarity": "-0.0648331"
        },
        {
            "id": "h5bypx3",
            "score": -24,
            "text": "[removed]",
            "title_similarity": "-0.0648331"
        },
        {
            "id": "h5c740t",
            "score": 7855,
            "text": "(Part of the text is adapted [off a post from my blog](https://bluerenga.blog/2021/06/25/dragons-of-hong-kong-1981/).)\n\nIn the season 7 episode Much Apu About Nothing, we find out what Homer's actual paycheck looks like.\n\n[It starts with a bear wandering Springfield](https://www.youtube.com/watch?v=OkV_ztynYDM), and Homer leading a group to city hall demanding protection from bears. This causes Quimby to start a \"bear patrol\", and the following dialogue:\n\n>Homer: Woo-hoo! A perfect day. Zero bears and one big fat hairy paycheck. [Homer opens.] Hey! How come my pay is so low? Bear patrol tax! This is an outrage! It’s the biggest tax increase in history!\n\n>Lisa: Actually, Dad, it’s the smallest tax increase in history.\n\n>Homer: Let the bears pay the bear tax. I pay the Homer tax.\n\n>Lisa: That’s the home-owner tax.\n\n>Homer: Well, anyway, I’m still outraged.\n\nThe brief glimpse notes a \"net pay\" for 40 hours of 362.19 (and an added bear tax of $5).\nCalculating backwards with other taxes, the pre-tax earnings are $479.60, or\n**exactly** $11.99 per hour.\n\nThe episode aired in 1996. Based on inflation, this makes a modern pay rate of $20.78 per hour.\n\n\nIt also would help to know the value of the house. The creator [Matt Groening](https://www.smithsonianmag.com/arts-culture/matt-groening-reveals-the-location-of-the-real-springfield-60583379/)\nconfirmed in an interview the Springfield in question is modeled after Springfield, Oregon,\nso we could technically look at house prices there, but an episode shortly after \nread \"The true location of Springfield is in any state but yours\" as the chalkboard gag; \nit's hence not the best approach to consider the location to be canon. Also, we have an idea of the value of the house from the episodes themselves.\n\nIn the episode Lisa's First Word (season 4, initially aired 1992) it is revealed that\nin 1984 that Grandpa Simpson sold his house (which he had gotten due to a crooked 1950s\nquiz show) in order to pay for the down payment of the new house, of $15,000. In that\ntime 20% for a down payment was quite typical, so let's suppose a house value of\n$75,000.\n\nThis is somewhat low for the US at the time -- the [average value was $89,400](https://www.nytimes.com/1984/03/04/realestate/rate-fears-spur-building-and-buying.html) -- but\nkeep in mind that the house is depicted as part of the low end of the market for the episode,\nplus Springfield itself has a strong chance of depressed property values ([witness the size of their potholes](https://frinkiac.com/gif/S04E12/376759/384901/)).\n\nIn any case, if we back-date the paycheck with inflation, Homer had a $7.94 per hour paycheck once he took the nuclear power plant job, which comes out to $16515.20 pre-tax per year. 1984 was a bad year for buying houses with a 13.88% interest rate, so the actual amount per month would be something like $700/month.\n\nThis leaves about $6100 pre-tax which in 2021 dollars is roughly $16,000. This would be in line with a 1984 estimate from the Bureau of Labor with $20,531 for a 4-person family (this is before Maggie was born) and 31% put into housing (leaving $14,266).\n\n(DIGRESSION AS TO WHY 1984 WAS SO BAD A YEAR FOR HOME BUYING)\n\nThe US was just getting off its worst inflation spike in its history. In brief: in the 1972-1974 period in the United States both food and energy prices rose (there was a Saudi Arabian-led oil embargo on countries thought to support Israel in the Yom Kippur War) and a second food price hike kicked off more inflation from the 1978-1980 range. (There’s some mess in the early 1970s involving Nixon wage-price controls but I’m skipping over that.) The end result was an average inflation of 6.85% over the decade, eye-popping compared to the prior two decades (2.38 and 2.56 percent respectively) and at some points the inflation reached double digits.\n\nInflation was bad enough during the decade that in 1974 there was a WIN (Whip Inflation Now) campaign led by US President Ford [complete with novelty merchandise](https://en.wikipedia.org/wiki/Whip_inflation_now#/media/File:%22WIN%22_earrings.JPG).\n\nWhen Ronald Reagan became president of the United States in 1981, inflation was near 10 percent, and credit for bringing it down goes mostly to Paul Volcker (chairman of the Federal Reserve System, appointed by Carter) who cranked the federal funds rate all the way to an eye-popping 20%, a level it has never been at before or since. (Housing interest rate was at 18.45%.) It took a while for new builds to happen and the housing interest rate to drop, so it was still high in 1984.\n\n(END DIGRESSION)\n\nNow, there's one more thing I haven't accounted for: The Simpsons had a adjustable-rate mortgage (as revealed in No Loan Again, Naturally, season 20, when the subprime crisis hit). They were possible in 1984: adjustable-rate mortgages were approved by the Federal Home Loan Bank Board in 1980 (state savings and loans could issue them before that year), specifically because of sluggish housing. (In 1984, [they accounted for 68 percent of new mortgages](https://www.nytimes.com/1984/08/04/business/mortgage-rates-up-in-july.html).) This turned out not to be so much a problem because the rates [started to drop more or less continuously](https://infogram.com/1peg7nvdnl9e9qtm75ryenpw2msll1ewld0) up into the 1990s.\n\nThis means the Simpsons would normally be fine in their finances with the part of Homer's salary remaining (as their situation would improve over time). Of course, Homer is not necessarily responsible with money, which is why (due to events in the No Loan Again, Naturally episode I already mentioned) Flanders now owns the house, with the Simpsons as renters.\n\n...\n\nBlinder, A. S. (1982). Double-digit inflation in the 1970s. Inflation: Causes and Effects, University of Chicago Press, Chicago, IL.\n\nFreier, R., Cohen, D. (1980). The Federal Home Loan Bank System. United States: Federal Home Loan Banks, Office of Finance.\n\nGroening, M. (2010). Simpsons World The Ultimate Episode Guide: Seasons 1-20. United States: HarperCollins.",
            "title_similarity": "0.43014205"
        },
        {
            "id": "h5bq659",
            "score": 697,
            "text": "There's always more that can be said, but you may find [these responses](https://www.reddit.com/r/AskHistorians/comments/ggozng/in_the_sitcom_married_with_children_protagonist/) from u/BullsLawDan, u/MikeRoykosGhost, u/CSMastermind et al to a similar question about \"Married... with Children\" (one of the Best of 2020) interesting.",
            "title_similarity": "0.36151922"
        },
        {
            "id": "h5bztsw",
            "score": -2,
            "text": "[removed]",
            "title_similarity": "-0.0648331"
        },
        {
            "id": "h5ei4wc",
            "score": 29,
            "text": "Could people really get a job at a nuclear power plant with a GED?",
            "title_similarity": "0.41654724"
        }
    ]
}