{
    "Would people have gone to the beach in medieval times?\n\nWith all the warm weather and increased beach visits recently it got me thinking. Did people go to the beach for leisure in the medieval times? If they did was this something that was limited to a certain class of people? I don’t know if peasants for example had much leisure time. And what sort of things would they have done? Was swimming in the sea an option or would that have been something maybe only for the men as women would have been wearing dresses not really appropriate.": [
        {
            "id": "h5kfkqa",
            "score": 1,
            "text": "Welcome to /r/AskHistorians. **Please [Read Our Rules](https://www.reddit.com/r/AskHistorians/wiki/rules) before you comment in this community**. Understand that [rule breaking comments get removed](https://www.reddit.com/r/AskHistorians/comments/h8aefx/rules_roundtable_xviii_removed_curation_and_why/).\n\n#Please consider **[Clicking Here for RemindMeBot](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps://www.reddit.com/r/AskHistorians/comments/omewir/would_people_have_gone_to_the_beach_in_medieval/%5D%0A%0ARemindMe!%202%20days)** as it takes time for an answer to be written. Additionally, for weekly content summaries, **[Click Here to Subscribe to our Weekly Roundup](https://www.reddit.com/message/compose/?to=AHMessengerBot&subject=Subscribe&message=!subscribe)**.\n\nWe thank you for your interest in this *question*, and your patience in waiting for an in-depth and comprehensive answer to show up. In addition to RemindMeBot, consider [using our Browser Extension](https://www.reddit.com/r/AskHistorians/comments/d6dzi7/tired_of_clicking_to_find_only_removed_comments/), or getting the [Weekly Roundup](https://www.reddit.com/message/compose?to=subredditsummarybot&subject=askhistorians+weekly&message=x). In the meantime our [Twitter](https://twitter.com/askhistorians), [Facebook](https://www.facebook.com/askhistorians/), and [Sunday Digest](https://www.reddit.com/r/AskHistorians/search?q=title%3A%22Sunday+Digest%22&restrict_sr=on&sort=new&t=all) feature excellent content that has already been written!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AskHistorians) if you have any questions or concerns.*",
            "title_similarity": "0.32615262"
        },
        {
            "id": "h5nyhrn",
            "score": 16,
            "text": "We've had a great response, can I ask if anyone knows about the same but in antiquity, or beyond?",
            "title_similarity": "0.3411278"
        },
        {
            "id": "h5ldxmy",
            "score": 3373,
            "text": "Speaking of medieval western Europe: for leisure, no, not really. The rise of beach travel is generally associated with the nineteenth and early twentieth centuries.\n\nThe foundation of this shift is changing ideas of the ocean. While I personally think the evidence from literary sources has been overstated in scholarship, it's pretty clear that people in the Middle Ages viewed the ocean as dark, forbidding, and dangerous, even apocalyptic. A whale washed up on a Dutch beach in 1522, and Martin Luther believed it was a sign of the apocalypse. Near Eastern and European travel accounts are filled with stories of sea monsters eating giant chunks out of ship hulls. The biblical story of Jonah being eaten by a very big fish was equated, in Christian preaching, to people going to hell.\n\nThe rehabilitation of oceans and large seas (Mediterranean, North, &c) in the western cultural imagination came in the late 18th and throughout the 19th century. Scholars such as John Walton and Lena Lencek find the roots of the transformation in, of all things, spa culture.\n\nBathing in hot springs had long been justified as medicinal. (Public baths also had...other...reputations in medieval and early modern Europe). Changing ideas about medicine and hygiene in the beginnings of the modern era increased the importance of the *water* aspect of hot springs--including the utility of cold water, which was accessible to northwest Europe in the non-polluted form of the sea. (A lot of Walton's work is about the northern coast of Spain.) Another important factor in transforming the sea embraced the primitive: the \"back to nature\" attitude, the idea that the untouched and never-civilized *wilderness* is something beneficial to people.\n\nBut this covers the *sea* part of things. As to the beaches? Well, Samuel Coleridge (1772-1834) has you covered on the difference, with a good dose of the swirling mists of the capriciousness and importance of nature for humanity:\n\n> God be with thee, gladsome Ocean!\n\n> How gladly greet I thee once more!\n\n> Ships and waves, and ceaseless motion,\n\n> And men rejoicing on thy shore. \n\n> [...]\n\n> Fashion's pining sons and daughters,\n\n> That seek the crowd they seem to fly,\n\n> Trembling they approach thy waters;\n\n> And what cares Nature, if they die? \n\n...of course, not everyone \"revisiting the seaside\" is so in touch with the raw wilderness of the sea and the sky and the human soul as Coleridge. He wryly points out that a whole lot of people are there essentially to See And Be Seen. And according to scholars, he wasn't wrong.\n\nNow, all of this is not to say that medieval people didn't know how to have fun in *water* or alongside the water. Fifteenth-century German friar (basically a monk who is not restricted to a monastery and ministers to lay people in the world) Felix Fabri made two pilgrimages to Jerusalem, and wrote rather entertaining accounts of it. Fabri's text has to be interpreted through the genre of 15C travel narratives, which (among other things) stress or invent the exotic in order to entice readers (among other reasons). He also has, or pretends to have, a religious agenda in teaching his readers spiritual lessons or affirming the preeminence of his religious order, the Franciscans. Nevertheless, he tells some great stories--and they were stories that his readers would have to understand as plausible.\n\nSo let's talk about the Jordan River. Because Fabri did.\n\nThis was an important pilgrimage site for those taking the extended journey beyond the city of Jerusalem itself. Fabri tries to lend the whole visit a spiritual veneer--that he really was there to stand in the same waters where Jesus was baptized and reflect on the moment--but this is one place where his literary efforts kind of fall apart. No matter how much he talks about saying Mass and quotes Latin prayers, he can't hide from:\n\n> So we stood in the water with\ngreat delight, and jestingly\nbaptized one another.\n\nBut swim across the river? Oh, the Muslim guides tried to warn all the Christian pilgrims off of *that*. People who thought it was fun to play underneath the water often got sucked down into the mud and never came back. Creatures from the Dead Sea might swim up the river and eat you. (Sea monsters, anyone?)\n\nOf course, pilgrims did it anyway. Including Fabri.\n\nAt least, male pilgrims. Fabri notes that while the men were daring each other to go further and further out into the river, the women waded in, indulged in mock baptisms, and...hung out on the shoreline.\n\nIt's not quite a beach party. And the overall story makes it clear that the pilgrims need a justification for playing in the river. While traveling in medieval fashion--pilgrimage--\"going to the beach\" was not legitimate. But seizing an opportunity to splash along the shoreline or hang out on the beach and gossip with your friends a little--sure. Just make sure that sea monster doesn't seize *you*.\n\nFurther Reading:\n\n* Susan Anderson and Bruce Tabb (eds.), *Leisure, Water, and Culture in European History* (2002) - most of the essays deal with 20C, but there are some good, relevant ones in there\n* Lena Lencek and Gideon Bosker, *The Beach: The History of Paradise on Earth* (1998) - not the only history of beaches and beach travel out there, but a solid and well-written one\n* In 100% seriousness, for more information on this exact topic, check out my book [How to Slay a Dragon: A Fantasy Hero's Guide to the Real Middle Ages](https://www.simonandschuster.com/books/How-to-Slay-a-Dragon/Cait-Stevenson/9781982164119), where you can learn how to *survive* that sea monster's jaws using stories of medieval people who did just that. (Also how to survive cannibals, pirates, and *cannibal pirates*. The Middle Ages are truly living their best life.)",
            "title_similarity": "0.63611436"
        }
    ]
}