{
    "There's a meme going around alleging that \"There was a 22-year window in which a samurai could have sent a fax to Abraham Lincoln.\" I have multiple questions.\nA popular [meme](https://himbofisher.tumblr.com/post/656998028944850945) being passed around right now states the following:\n\n\"The samurai were officially abolished as a caste in Japanese society during the Meiji Restoration in 1867\n\n\"The first ever fax machine, the ''printing telegraph,' was invented in 1843\n\n\"And Abraham Lincoln was famously assassinated at Ford's Theatre in 1865\n\n\"Which means\n\n\"There was a 22-year window in which a samurai could have sent a fax to Abraham Lincoln.\"\n\n&#x200B;\n\nSo here are my questions:\n\n\\-Did any samurai ever visit the United States?\n\n\\-Did Lincoln have any relations with samurai-era Japan?\n\n\\-Who was the first president to receive a fax?\n\n\\-When did the fax machine reach Japan?\n\n\\-At what point in history did the technical infrastructure first exist to send a fax from Japan to the White House? \n\nI'd be grateful for answers to any and all of these questions. Thanks so much!": [
        {
            "id": "h5qyvyh",
            "score": 1,
            "text": "Welcome to /r/AskHistorians. **Please [Read Our Rules](https://www.reddit.com/r/AskHistorians/wiki/rules) before you comment in this community**. Understand that [rule breaking comments get removed](https://www.reddit.com/r/AskHistorians/comments/h8aefx/rules_roundtable_xviii_removed_curation_and_why/).\n\n#Please consider **[Clicking Here for RemindMeBot](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps://www.reddit.com/r/AskHistorians/comments/ondszw/theres_a_meme_going_around_alleging_that_there/%5D%0A%0ARemindMe!%202%20days)** as it takes time for an answer to be written. Additionally, for weekly content summaries, **[Click Here to Subscribe to our Weekly Roundup](https://www.reddit.com/message/compose/?to=AHMessengerBot&subject=Subscribe&message=!subscribe)**.\n\nWe thank you for your interest in this *question*, and your patience in waiting for an in-depth and comprehensive answer to show up. In addition to RemindMeBot, consider [using our Browser Extension](https://www.reddit.com/r/AskHistorians/comments/d6dzi7/tired_of_clicking_to_find_only_removed_comments/), or getting the [Weekly Roundup](https://www.reddit.com/message/compose?to=subredditsummarybot&subject=askhistorians+weekly&message=x). In the meantime our [Twitter](https://twitter.com/askhistorians), [Facebook](https://www.facebook.com/askhistorians/), and [Sunday Digest](https://www.reddit.com/r/AskHistorians/search?q=title%3A%22Sunday+Digest%22&restrict_sr=on&sort=new&t=all) feature excellent content that has already been written!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AskHistorians) if you have any questions or concerns.*",
            "title_similarity": "0.5889129"
        },
        {
            "id": "h5rsncx",
            "score": 79,
            "text": "[removed]",
            "title_similarity": "0.11224778"
        },
        {
            "id": "h5s68ey",
            "score": 208,
            "text": "(Partly [adapted off an old post of mine](https://www.reddit.com/r/AskHistorians/comments/gwum35/after_the_cuban_middle_crisis_leaders_of_the_usa/fsxw5gk/).)\n\nAs far as earliest president to use a fax: indirectly or directly?\n\nThe earliest indirect use I know is from Nixon. While traveling for his 1966 and 1968 campaigns, Nixon wanted a \"Daily News Summary\" so Agnes Waldron \n(who was with Nixon on the failed '60 campaign) collected newspaper stories (from major outlets like The New York Times and The Washington Post) and sent them via fax to a team that would \norganize and type excerpts that would end up Nixon's suite when he woke up.\n\nHowever, based on the meme, I don't think \"the staff of the president\" is quite what is being asked for -- the idea is to send a fax intended directly for the eyes of the president.\nAnd that would have to wait until the 1980s and President Reagan.\n\nThis is regarding the \"red line\" between Moscow and Washington, which I should first emphasize was _never_ a telephone. The concern was that with telephone, leaders would need to use rapid translation, which potentially could cause misunderstanding. The MOLINK or MOscow Link used teletype. The Pentagon had one teleprinter, the Kremlin had another, and messages could be sent between each other in several minutes. (The White House Communications Agency has a backup console, and the White House was linked up so the president could operate it without physically going to the Pentagon.)\n\nThey operated -- and still operate today -- continuously, with pairs on the US side consisting of a Presidential Communicator and a Presidential Translator in 8-hour shifts.\n\nDuring the Six-Day War, the Soviets sent multiple messages; here is [an official translation of one:](https://www.cryptomuseum.com/crypto/hotline/files/hotlinemssg1967bgr.jpg)\n\n>Dear Mr. President,\n\n>Having received information concerning the military clashes between Israel and the United Arab Republic, the Soviet Government is convinced that the duty of all great powers is to secure the immediate cessation of the military conflict.\n\n>The Soviet Government has acted and will act in this direction. We hope that the Government of the United States will also act in the same manner and will exert appropriate influence on the Government of Israel particularly since you have all opportunities of doing so. This is required in the highest interest of peace.\n\nDuring the same conflict, when the Israelis attacked a US intelligence vessel (the USS Liberty) for unclear reasons, Johnson used the hotline to send a message letting the Soviets know they were not planning on entering the war.\n\nHowever, the line did get a fax machine upgrade in 1985, and Reagan and Gorbachev could send letters more or less directly (with a translator in-between). There was, for example, a 15-page handwritten letter faxed direct from Gorbachev to Reagan. Here's a sample [from the translation:](https://www.thereaganfiles.com/19851224.pdf)\n\n>With regard to Afghanistan, one gets the impression that the U.S. side intentionally fails to notice the \"open door\" leading to a political settlement. Now there is even a working formula for such a settlement. It is important not to hinder the negotiations in progress, but to help them along. In that event a fair settlement will definitely be found.\n\n...\n\nBohn, Michael (2003) Nerve Center: Inside the White House Situation Room. Potomac Books, Inc.\n\nBohn, Michael (1 August 2013). [Hot Line: Even without a Cold War, the Washington-Moscow link is still up.](https://www.washingtonpost.com/lifestyle/magazine/hot-line-even-without-a-cold-war-the-washington-moscow-link-is-still-up/2013/07/31/5f3305d8-ea34-11e2-8f22-de4bd2a2bd39_story.html) The Washington Post.\n\nBuchanan, P. J. (2017). Nixon's White House Wars: The Battles That Made and Broke a President and Divided America Forever. United States: Crown Publishing Group.\n\nEgilsson, H. Þ. (2003). The Origins, Use and Development of Hot Line Diplomacy. Netherlands Institute of International Relations.",
            "title_similarity": "0.754463"
        },
        {
            "id": "h5rp7tk",
            "score": 611,
            "text": "A 22-year window is a bit generous, but a case could be made for a smaller 5-to-12 year window.\n\nA bit of background to begin. Under the Tokugawa shogunate Japan officially had an isolationist foreign policy (Sakoku) that allowed for an extremely limited amount of foreign trade into the country with China, Korea, the Dutch East India Company, and the Ainu people. With in the zones of trade movement was extremely restricted (on pain of death) and the stranded sailor that ended in Japan during this period was likely to be executed as well. The short answer as to why these policies were enacted in 1633 is that it was an attempt to halt the spread of foreign culture (primarily from Spain and Portugal), and Christianity in particular with the Shimabara Rebellion  in 1637 in which Japanese Christian rose up with the aid of rōnin.\n\nAfter 214 years of the sakoku it came to an end with a display of gunboat diplomacy on the part of Commodore Perry's Expedition of 1853 - 1854 in which the black ships (due to the pitch used to paint the hulls) of the expedition steamed into the bay of Edo and threated to attack the city if Japan did not start trading with the West. After negotiations The Treaty of Peace and Amity was signed, but some parts of it were deferred for later diplomatic negotiations.\n\nThis leads us to the Bakumatsu and the end of the Tokugawa shogunate, opening of Japan, and eventual Meji Restoration. In 1860 the diplomatic mission of the Tokugawa shogunate was dispatched to the United States to negotiate and ratify the Treaty of Friendship, Commerce, and Navigation onboard the warship Kanrin Maru, the first sail and screw-driven steam corvette and signifier of things to come during the Mejin Restoration. If you look at photographs of the exhibition members (e.g., [one](https://en.wikipedia.org/wiki/Japanese_Embassy_to_the_United_States#/media/File:1860_Japanese_Delegation_to_US.jpg), [two](https://en.wikipedia.org/wiki/Japanese_Embassy_to_the_United_States#/media/File:Kanrin_Maru_members.jpg)) you will notice that some of them are wearing katana, either in the form of a single katana (indicating official status) or as daishō (i.e., katana and wakizashi) indicating that they are members of the samurai class.\n\nSo now we can start checking off questions! Since members of the diplomatic mission were members of the samurai class it is clear they visited the United States. While the delegation was hosted at one point by the White House, they were hosted by James Buchanan as Abraham Lincoln would not take office until March 4, 1861. However, the establishment of diplomatic relations with the Tokugawa shogunate and duration of the Lincoln Administration (1861 - 1865) actually means that Lincoln never actually saw the Meji Restoration in 1868.\n\nTo return to the 5-to-12 year window, the duration really depends upon where you start counting from. If you start from the Perry Exhibition then you have about 12 years where as if you start with the diplomatic mission you have about five years. However, while transatlantic cables were completed in 1866, it wouldn't be until 1871 that Japan was connected to a cable network. At that point a telegraph could conceivability been sent from the White House to a diplomatic mission in Japan, although the nuance of that question is outside the scope of my knowledge.\n\n&#x200B;\n\nEdits: note on swords (thanks to /u/TheNthMan) and grammatical issues.",
            "title_similarity": "0.72186023"
        },
        {
            "id": "h5rkfjq",
            "score": 1714,
            "text": "I think I can answer the first question as I had been looking into a similar question.\n\n[Kaoru Ishiguro for Shukan NY Seikatsu](https://citylimits.org/2020/01/23/samurais-on-broadway-recounting-the-first-japanese-mission-to-the-u-s-160-years-later/) dug into the newspaper clippings at the New York Public Library to find records of the first Japanese mission to the US which occurred in 1860. This was following the 1858 signing of the Treaty of Amity and Commerce signed between the United States and Japan.\n\nThis occurred after Matthew Perry \"opened\" the country, though Japan wasn't closed as much as extremely restricted and limited trade to five \"gateways\" including Nagasaki where the Chinese traded with Japan and the Dutch East India Company also were permitted to operate.\n\nBut to the point of samurai in America, Masao Miyoshi in As We Saw Them: The First Japanese Embassy to the United States discusses this Japanese envoy coming to the United States to ratify the treaty. \n\nIt appears they departed from Uraga they first arrived in San Francisco and stayed for a month. The head of the mission was Admiral Kimura Yoshitake. They were accompanied by an American who had been shipwrecked in 1859 in Yokohama, John Mercer Brooke. The Japanese government asked Brooke to accompany the mission aboard the Kanrin Maru, the Japanese corvette that made the trip. \n\nBoth Miyoshi and Young (journal article cited below) discuss samurai being part of this group. The mission was under the command of Kimura Yoshitake, who Brooke referred to as \"admiral.\" His title in Japanese translated to \"Magistrate of Warships.\"  The samurai in charge of the ship was Katsu Rintarō, who was seasick during the trip. He later became the chief architect of the Imperial Japanese Navy. (Rintarō was a childhood name he had, and he has several names attributed to him. Katsu Kaishu is another well known name as well as Katsu Yasuyoshi). Another samurai on the trip, Fukuzawa Yukichi, later went on to author several books, including and English to Japanese dictionary and a children's book that become an official textbook, *All the Countries of the World, for Children Written in Verse.* He also founded Keio University.\n\nEdit: I should add that this delegation met with President James Buchanan in DC. The delegation boarded the USS Powhatan and the Kanrin Maru escorted it to DC. \n\nWikipedia has [this picture of Fukuzawa Yukichi with Theodora Alice in San Francisco in 1860](https://en.wikipedia.org/wiki/File%3A_Fukuzawa_Yukichi_with_the_girl_of_the_photo_studio.jpg) while they were there. \n\nThe Voyage of the Kanrin Maru to San Francisco, 1860. Dana B. Young\nCalifornia History Vol. 61, No. 4 (Winter, 1983), pp. 264-275",
            "title_similarity": "0.7542025"
        },
        {
            "id": "h5rc9zq",
            "score": -9,
            "text": "[removed]",
            "title_similarity": "0.11224778"
        }
    ]
}