{
    "Wikipedia says forced and mostly public anilingus was used as a form of punishment, usually of prisoners, during the Thirty Years War. How did this work? Who was having their ass licked? How did this practice originate and how did it die out? Did it happen elsewhere at any time in history?\nThe relevant quote from the Anilingus article, https://en.wikipedia.org/wiki/Anilingus: \"Forced and mostly public anilingus was used as a form of humiliation and punishment, usually of prisoners. The use of the practice in the Thirty Years' War was described by Grimmelshausen in Simplicius Simplicissimus (1668).[17] The practice is commonly referred to as \"arse licking\", and the term is still at times applied to the behaviour of someone who is overly respectful or helpful to someone in authority.[18] \"\n\nThe primary source simply leads to the name of a translated edition of a German picaresque novel from the 17 century, without citing any source of the real historicity of this kind of punishment.": [
        {
            "id": "h6hzvyx",
            "score": 1,
            "text": "Welcome to /r/AskHistorians. **Please [Read Our Rules](https://www.reddit.com/r/AskHistorians/wiki/rules) before you comment in this community**. Understand that [rule breaking comments get removed](https://www.reddit.com/r/AskHistorians/comments/h8aefx/rules_roundtable_xviii_removed_curation_and_why/).\n\n#Please consider **[Clicking Here for RemindMeBot](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps://www.reddit.com/r/AskHistorians/comments/orh231/wikipedia_says_forced_and_mostly_public_anilingus/%5D%0A%0ARemindMe!%202%20days)** as it takes time for an answer to be written. Additionally, for weekly content summaries, **[Click Here to Subscribe to our Weekly Roundup](https://www.reddit.com/message/compose/?to=AHMessengerBot&subject=Subscribe&message=!subscribe)**.\n\nWe thank you for your interest in this *question*, and your patience in waiting for an in-depth and comprehensive answer to show up. In addition to RemindMeBot, consider [using our Browser Extension](https://www.reddit.com/r/AskHistorians/comments/d6dzi7/tired_of_clicking_to_find_only_removed_comments/), or getting the [Weekly Roundup](https://www.reddit.com/message/compose?to=subredditsummarybot&subject=askhistorians+weekly&message=x). In the meantime our [Twitter](https://twitter.com/askhistorians), [Facebook](https://www.facebook.com/askhistorians/), and [Sunday Digest](https://www.reddit.com/r/AskHistorians/search?q=title%3A%22Sunday+Digest%22&restrict_sr=on&sort=new&t=all) feature excellent content that has already been written!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AskHistorians) if you have any questions or concerns.*",
            "title_similarity": "0.61080194"
        },
        {
            "id": "h6ij8b0",
            "score": -20,
            "text": "[removed]",
            "title_similarity": "0.23268479"
        },
        {
            "id": "h6ip3n6",
            "score": -3,
            "text": "[removed]",
            "title_similarity": "0.23268479"
        },
        {
            "id": "h6kt63n",
            "score": 817,
            "text": "Regarding this Wikipedia entry, Grimmelshausen succeded in what he was trying to do when writing his Simplicius Simplicissimus. This is a common example of using a source without considering its intention: The Simplicius wasnt a factual book per sé, it largely wasnt based on Grimmelshausens first hand experiences, but, very common practice in the cultural practice in Early Modern Germany, some kind of synthesis of all kinds of rumors, stories and other books. Grimmelshausen tried to write a partly satirical, partly factual book. He molded those together to create a believable book which entertains while it informs. As a historian, this comes at a huge price of authenticity as a whole.\n\nFor example, the narration of the battle of Wittstock, which laid for a long time the foundation for Grimmelshausen's reputation as a profound baroque writer with first hand experience, turned out to be a copy of Sir Philip Sidneys \"Arcadia\" (See Source #1). This by the way wasnt too frowned upon; copyright was still a very loose term.\n\nI am not saying that Grimmelshausen's work are from beginning to end fairy tales or copies, he indeed provided his own perspectives here and there. \n\nBut for your case, you are on the right track doubting what the Wikipedia author took from this quote of Grimmelshausen. I checked my sources for Early Modern punishment practices (a topic pretty vividly researched in Germany in the last 15 years) and I did not find similar sources. What the Wikipedia author took from this quote is simply unfounded. It is true however, that \"Arschlecken\", especially however in the term \"Arschkriechen\" does mean your stated meaning.\n\nTLDR, it is most likely based on hear-say. Does that mean it must be a myth? No. It's one of the many things we can't quite figure out because we need sources we can trust; documents from a prison that order this punishment, for example. Until then, the punishment of Anilingus remains a piece in the literary reception of the horrors of the Thirthy Years' War, which often fall back to overstatements and fear mongering.\n\n---\n\nSecondary Sources:\n\n* Achim Aurhammer: Simplicius zwischen Herzbruder und Olivier : Historizität und Überzeitlichkeit der Konfigurationsstrukturen im Simplicissimus Teutsch, in: Simpliciana: Schriften der Grimmelshausen-Gesellschaft, 25 (2003), S. 47-62.\n* Dieter Breuer: Grimmelshausen-Handbuch. München 1999.\n* Peter Triefenbach: Der Lebenslauf des Simplicius Simplicissimus: Figur, Initiation, Satire. Stuttgart 1979.\n* James Nee: Myth and the \"Bildungsroman\" : an archetypal study of Grimmelshausen's \"Simplicissimus\", 1970 O.O.",
            "title_similarity": "0.6386439"
        }
    ]
}