{
    "During his lifetime, Julius Caesar had been to both Egypt and Britain on military campaign. In summer months, a day in London lasts about 2hrs longer than one in Alexandria. Did Caesar or any of his contemporaries have an explanation for this? Did they even notice it?\n": [
        {
            "id": "h6m1wly",
            "score": 1,
            "text": "Welcome to /r/AskHistorians. **Please [Read Our Rules](https://www.reddit.com/r/AskHistorians/wiki/rules) before you comment in this community**. Understand that [rule breaking comments get removed](https://www.reddit.com/r/AskHistorians/comments/h8aefx/rules_roundtable_xviii_removed_curation_and_why/).\n\n#Please consider **[Clicking Here for RemindMeBot](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps://www.reddit.com/r/AskHistorians/comments/os4aiw/during_his_lifetime_julius_caesar_had_been_to/%5D%0A%0ARemindMe!%202%20days)** as it takes time for an answer to be written. Additionally, for weekly content summaries, **[Click Here to Subscribe to our Weekly Roundup](https://www.reddit.com/message/compose/?to=AHMessengerBot&subject=Subscribe&message=!subscribe)**.\n\nWe thank you for your interest in this *question*, and your patience in waiting for an in-depth and comprehensive answer to show up. In addition to RemindMeBot, consider [using our Browser Extension](https://www.reddit.com/r/AskHistorians/comments/d6dzi7/tired_of_clicking_to_find_only_removed_comments/), or getting the [Weekly Roundup](https://www.reddit.com/message/compose?to=subredditsummarybot&subject=askhistorians+weekly&message=x). In the meantime our [Twitter](https://twitter.com/askhistorians), [Facebook](https://www.facebook.com/askhistorians/), and [Sunday Digest](https://www.reddit.com/r/AskHistorians/search?q=title%3A%22Sunday+Digest%22&restrict_sr=on&sort=new&t=all) feature excellent content that has already been written!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AskHistorians) if you have any questions or concerns.*",
            "title_similarity": "0.25802973"
        },
        {
            "id": "h6mt0ip",
            "score": 3249,
            "text": "Yes, this was a well known phenomenon and was correctly understood as caused by the spherical shape of the earth, and the seasonal variation as caused by the angle between the earth's equator and the plane of the ecliptic. The most to-the-point discussion in ancient sources is in Cleomedes' *On the heavens*, ch. 1.4: he was writing later than Caesar, but his work is based on material going back to long before Caesar's time.\n\nThe main difference between then and now is that, since essentially everyone in that time was a geocentrist, the ecliptic was understood as a purely celestial phenomenon, rather than a result of the earth's axial tilt. That is, it was imagined that the sun, moon, and planets followed the plane of the ecliptic ... just because.\n\nAnyway, the earth's shape was a perfectly well known interpretation of variable daylight hours at different latitudes. It can be clearly seen in, for example, Pliny the Elder's account of latitude measurements for various cities. The earth's shape was well known enough that it gets referred to in poetry, like in the opening paragraph of Ovid's epic poem the *Metamorphoses*.\n\nBut of course it hadn't always been known that the earth is (nearly) spherical. Prior to around 400 BCE or a little earlier, there were no round-earthers. Before that time natural philosophers who tried to take account of the phenomenon had to come up with some slightly weird explanations.\n\nThe original discovery of the phenomenon was probably based on the experiences of traders and colonists in the Greek speaking world who ranged from Ukraine to Egypt. Some stars were known to be visible only at extreme latitudes; and that, in conjunction with the phenomenon of the tropics (the sun's latitude at midsummer and midwinter), the observation that the sky has spherical geometry and all points on earth lie immediately beneath some point in the sky, and the spherical geometry implied by the angle between the equator and the ecliptic, all pointed to a spherical earth. Cleomedes spends some time looking at competing interpretations, and none of them stacked up.\n\nThe discovery was probably in the late 400s BCE, when a Greek astronomer named Oenopides performed some kind of study on the ecliptic. Our sources say that he was the first to discover the ecliptic and measure the angle between it and the equator; but that can't be right, as ~~the angle of~~ the ecliptic had been known to Babylonian astronomers centuries earlier. It must have been some other kind of study.\n\nBefore that, as I say, there were some different interpretations. The 6th century Milesian philosophers (Anaximander, Anaximenes) regarded the earth as flat, but with the innovation that the earth wasn't the *base* of the cosmos but rather suspended in the centre of the cosmos. This may have been because of observation of the sky's spherical geometry. Their best effort at a theory for *how* the earth was suspended was air pressure beneath the earth, like hot air holding up the lid on a pot. We can see a similar picture in Anaxagoras in the mid-400s.\n\nBut around the same time we start to see philosophers trying to take account of varying daylight hours. One popular theory was that the earth isn't perfectly flat, but concave, and that this is why the sun appears to different people at different times. Archelaus' phrase was 'high in a ring, and concave in the middle' (60 A 4.4 Diels-Kranz). Leucippus declared that the earth is flat but tilted, and higher altitude means colder as everyone knows, and this is why the far north is colder than the south. And Democritus combined all of these, saying that the earth is 'disc-shaped in its surface, but concave in the middle' (68 A 94 Diels-Kranz), that it tilts downwards to the south (68 A 1.33 Diels-Kranz), and that it's suspended in space by air pressure underneath (13 A 20 Diels-Kranz).\n\nThat was the rather chaotic picture of things before Oenopides came along and whoever else was involved in the discovery of the earth's shape. After 400 BCE it's relatively rare to find evidence of flat-earthers in the Mediterranean world. The Epicureans did cling on to a cosmos arranged in layers, which implies a flat earth. Some Christian biblical literalists in Syria in the 4th-5th centuries CE insisted on a flat earth. But other than that, it's round-earthers all the way to the horizon.\n\nEdit: minor edits for flow\n\nEdit 2: a correction about Oenopides: he wasn't just credited with discovering the angle of the ecliptic, but discovering the ecliptic itself. It's that which had been known to Mesopotamian astronomers in the 2nd millennium BCE. His measurement, by the way, is reported as 24°, pretty accurate to the actual figure of just under 23.9° in his time (the earth's axial tilt wobbles slowly over the millennia: nowadays it's 23.5°).\n\nEdit 3: I had a brainfart earlier and was citing *FGrHist* instead of Diels-Kranz for the pre-Socratics. Fixed now.",
            "title_similarity": "0.5352304"
        },
        {
            "id": "h6mt3gl",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "-0.011877237"
        }
    ]
}