{
    "In the movie “Nuremberg”, when footage of the Holocaust is shown during the trial, there is pin-drop silence in the courtroom. Then one judge abruptly gets up to leave and vomit, followed by the rest. Is this dramatization or did the Allies have this strong of a gut reaction to the Holocaust?\nedit: 15 hours, 2000 upvotes, 0 responses. Thanks guys. Maybe we’ll have better luck next time.\n\nedit2: okay looks like we’re up to 3000 upvotes and absolutely no replies that haven’t been removed! Might be setting a record!": [
        {
            "id": "h9uchp8",
            "score": 1,
            "text": "Welcome to /r/AskHistorians. **Please [Read Our Rules](https://www.reddit.com/r/AskHistorians/wiki/rules) before you comment in this community**. Understand that [rule breaking comments get removed](https://www.reddit.com/r/AskHistorians/comments/h8aefx/rules_roundtable_xviii_removed_curation_and_why/).\n\n#Please consider **[Clicking Here for RemindMeBot](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps://www.reddit.com/r/AskHistorians/comments/p911g1/in_the_movie_nuremberg_when_footage_of_the/%5D%0A%0ARemindMe!%202%20days)** as it takes time for an answer to be written. Additionally, for weekly content summaries, **[Click Here to Subscribe to our Weekly Roundup](https://www.reddit.com/message/compose/?to=AHMessengerBot&subject=Subscribe&message=!subscribe)**.\n\nWe thank you for your interest in this *question*, and your patience in waiting for an in-depth and comprehensive answer to show up. In addition to RemindMeBot, consider [using our Browser Extension](https://www.reddit.com/r/AskHistorians/comments/d6dzi7/tired_of_clicking_to_find_only_removed_comments/), or getting the [Weekly Roundup](https://www.reddit.com/message/compose?to=subredditsummarybot&subject=askhistorians+weekly&message=x). In the meantime our [Twitter](https://twitter.com/askhistorians), [Facebook](https://www.facebook.com/askhistorians/), and [Sunday Digest](https://www.reddit.com/r/AskHistorians/search?q=title%3A%22Sunday+Digest%22&restrict_sr=on&sort=new&t=all) feature excellent content that has already been written!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AskHistorians) if you have any questions or concerns.*",
            "title_similarity": "0.47833484"
        },
        {
            "id": "h9w0cmz",
            "score": 9,
            "text": "[removed]",
            "title_similarity": "0.08185293"
        },
        {
            "id": "h9xx2no",
            "score": 634,
            "text": "I am not an expert in these matters, but having quite enjoyed this sub and as a bit of a hobby of mine studying law, especially Nuremberg since it set many precedents and was very unique, I think I can answer this. I welcome any and all feedback on this.\n\nNot having watched \"Nuremberg\", I'm admittedly assuming that the scene you're referencing is at least loosely based on the testimony on the afternoon of the eighth day of court- November 29, 1945. On this day, Commander James Britt Donovan of the prosecution entered into evidence an hour long film entitled simply \"Nazi Concentration Camps.\" If this is wrong, let me know and I'll delete this comment myself.\n\nI first want to address your actual question in saying the vomiting is likely a dramatization- that's not to say that there weren't physical reactions, but crying and breaking down seemed more common. In doing further scouring of this, I am not finding any notes on any type of a visceral reaction. However, [a letter dated December 1st, 1945](https://www.trumanlibrary.gov/library/research-files/letter-robert-jackson-harry-s-truman-accompanied-related-materials?documentid=NA&pagenumber=1) from Robert H Jackson, the chief prosecutor for the United States, to Harry Truman stated:\n> Our photographic evidence of concentration camps was so good that three of the defendants broke down and cried.\n\nNow as mentioned, the film was submitted just 8 days into the trial, and this was the the longest film entered into evidence up to this point. However by this point all members of the court had spent months actively preparing this effort, with the London Conference starting in June of that year. Nor was it unknown by any stretch the atrocities committed, as information gathering had been unfolding since the start of the war. These atrocities were even formally recognized in the [Moscow Declaration of 1943](https://avalon.law.yale.edu/wwii/moscow.asp) (Section: Statement on Atrocities), which is referenced often through the formation of the International Military Tribunal.\n\nWhile I'm not sure of any films specifically looking at the IMT, I have found a reaction video from the US Holocaust Memorial Museum [here](https://encyclopedia.ushmm.org/content/en/film/reactions-to-film-shown-at-nuremberg) where we can see the reactions of some of the defendants and some others in the courtroom. While there is clearly uneasiness, there's no vomiting, or even particularly rushing to leave the room filmed here. In another of their articles [here](https://encyclopedia.ushmm.org/content/en/article/combating-holocaust-denial-evidence-of-the-holocaust-presented-at-nuremberg#photographs-and-film-as-evidence-2) we do see the following:\n> When the lights came up in the Palace of Justice all assembled sat in silence. The human impact of this visual evidence was a turning point in the Nuremberg trial. It brought the Holocaust into the courtroom.\n\nThere's further evidence that this likely was a dramatization from the trial transcripts: \"[the Blues Series](https://www.loc.gov/rr/frd/Military_Law/NT_major-war-criminals.html)\" is a set of such transcripts provided by the Library of Congress. The related information is in [Volume 2 (pdf)](https://www.loc.gov/rr/frd/Military_Law/pdf/NT_Vol-II.pdf), pages 432-434, which quite clearly shows the lack of any statements regarding what they just witnessed- they watched the film, and then adjourned for the day. \n\nDue to the time the court was involved in this effort, even by this point relatively early in the actual trial, the court still knew what they were getting into, which might explain the lack of more gut wrenching reactions.\n\nEdit:  \nI want to clarify my use of \"likely a dramatization\" above- Off hand, there were 8 members of the Tribunal, 18 members of the general secretariat, 51 members of the prosecution, 40 members of the defense, as well as any staff that may not have been listed, and 24 defendants, not including a few groups of defendants such as SS and Gestapo (Counts taken from [Volume 1 of the Blue Series (pdf)](https://www.loc.gov/rr/frd/Military_Law/pdf/NT_Vol-I.pdf)). To get each individuals reaction, assuming many were in attendance, would be quite the task that at this point in time I'm unable to do. It is absolutely possible that some vomited, especially in private, however I know of no such obvious recorded evidence that they did.",
            "title_similarity": "0.7821691"
        },
        {
            "id": "ha2sjfu",
            "score": 39,
            "text": "/u/Kugelfang52 has previously answered: \n\n* [Why was it official U.S. Policy not to use the word \"Jew\" in connection with the Nazi Concentration Camps?](https://www.reddit.com/r/AskHistorians/comments/gm7pr7/why_was_it_official_us_policy_not_to_use_the_word/)\n\n* [Did American soldiers who saw the racist atrocities of the Holocaust realize the horrors of prejudice and have a moral awakening or did they go back to nonchalantly eating at whites only diners?](https://old.reddit.com/r/AskHistorians/comments/eo0jta/did_american_soldiers_who_saw_the_racist/)\n\n\nI have also collected answers about [Dwight Eisenhower and the liberation of Dachau](https://www.reddit.com/r/AskHistorians/comments/if711i/comment/g2mj2uu/) by /u/commiespaceinvader and /u/PeculiarLeah.",
            "title_similarity": "0.6987798"
        }
    ]
}