{
    "[X-Post] Reddit's unwillingness to properly contain COVID-19 misinformation is part of a broad trend of inadequate action by the Admins against bad faith actors. We stand with our fellow mod teams in calling on reddit to improve.\n": [
        {
            "id": "hacfhsp",
            "score": 1,
            "text": "Hello everyone,\n\nWe are cross-posting this call to the reddit Admins today in solidarity with other reddit communities and mod teams who find themselves continually fighting against misinformation which is being spread on reddit without adequate controls to combat it. While, strictly speaking, this is not an issue of history - although history shows us that it takes group effort and concern for the common good to properly fight back against disease and epidemics - it is a reddit issue, and one which has long been near and dear to our hearts. [We have long been vocal advocates for social media companies to be more mindful of the content they allow on their platforms, and the very real harm that can come from allowing it to spread there](https://slate.com/technology/2018/07/the-askhistorians-subreddit-banned-holocaust-deniers-and-facebook-should-too.html). When it comes to history, this can have serious harms for how people understand the past and how they apply that to the present and future. When it comes to something like COVID-19, this can have serious harms for our very lives.\n\nReddit has shown time and again that they are slow to act against such threats, and when they do it is never proactively. We join other subreddits in calling on reddit to take decisive action in combatting COVID-19 misinformation on their platform, and more broadly to consider how they can better fight against bad actors who seek to use the site in bad faith to spread hate, lies, and disinformation.\n\nWe are sharing this post in the general interest of reddit as a site and community, but for those who wish to discuss this protest further, we encourage you to click through to the main crosspost on /r/vaxxhappened. If you have questions or concerns about our moderation policies, please reach out to us via modmail.\n\n-The Mods",
            "title_similarity": "0.78855264"
        }
    ]
}