{
    "Happy 10th Birthday AskHistorians! Thank you everyone for a wonderful first decade, and for more to come. Now as is tradition, you may be lightly irreverent in this thread.\n": [
        {
            "id": "haofta7",
            "score": 1,
            "text": "That's right, we're half-way to asking questions about the subreddit without a META tag! The Mods want to thank the AskHistorians community for ten awesome years, since whether you've contributed by asking questions, writing answers, or just being a lurker, you all have been a critical part of what makes this community so wonderful.\n\nIf you haven't heard yet, we would also remind everyone that we're hosting the second annual [**AskHistorians Digital Conference**](https://www.reddit.com/r/AskHistorians/comments/ms3zzg/announcing_the_askhistorians_digital_conference/) this October! If you are interested in supporting it and getting cool swag, [**check out our Fundrazr**](https://fundrazr.com/91nni4)**.** If you want to make sure you don't miss any updates about panels, networking, or the keynote, [sign up for the Conference Newsletter](https://forms.gle/R8gyY37PQjr4x9x2A)!\n\nAdditionally, if you haven't done so yet, definitely consider [**signing up for the weekly mailer**](https://www.reddit.com/r/AskHistorians/comments/m8h3jo/tired_of_missing_askhistorians_content_want_to/) \\- just [click here](https://www.reddit.com/message/compose/?to=AHMessengerBot&subject=Subscribe&message=!subscribe) and hit send - to receive a round up of some of the best content of the past week every Friday.\n\nThank you again, everyone, for the past ten years, and cheers to another ten to follow!",
            "title_similarity": "0.77086174"
        },
        {
            "id": "hapssmx",
            "score": 5,
            "text": "I want the world to know that I once commented on this sub.\n\nWho's not accurate enough now ?!",
            "title_similarity": "0.4806019"
        },
        {
            "id": "haqkh6w",
            "score": 4,
            "text": "This post breaks the 20 year rule 😂",
            "title_similarity": "0.43497014"
        },
        {
            "id": "haokewb",
            "score": 3,
            "text": "Ey what da dog doing doe?",
            "title_similarity": "0.131827"
        },
        {
            "id": "haqfy7g",
            "score": 5,
            "text": "I have such a love hate relationship with this sub\n\nKeep up the good work",
            "title_similarity": "0.44700438"
        },
        {
            "id": "haomvqr",
            "score": 7,
            "text": "Thank you for all you do!!! This is my favorite sub to explain to non redditors",
            "title_similarity": "0.5983504"
        },
        {
            "id": "haoyn9s",
            "score": 8,
            "text": "Is there a flaired user for internet history? I know there's a YouTube channel [The Internet Historian](https://youtube.com/c/InternetHistorian) but while I recommend the channel they aren't really doing History work. Have there been interesting articles about BBSes, Webrings, and Usenet?",
            "title_similarity": "0.35175484"
        },
        {
            "id": "hap110t",
            "score": 8,
            "text": "I love clicking a interesting subject on AskHistorians and seeing a page full of deleted comments. I also had a comment with a huge Karma deleted by them, but i deserved it as it was a joke.",
            "title_similarity": "0.47247627"
        },
        {
            "id": "haot359",
            "score": 7,
            "text": "Feliz cumpleaños! To the best sub ever!",
            "title_similarity": "0.64903355"
        },
        {
            "id": "haokas0",
            "score": 11,
            "text": "Happy birthday! This sub has been a gift and I'm thankful for the mod team & all historians/questioners for posting and answering on here. Will be there in ten years as well!",
            "title_similarity": "0.81996864"
        },
        {
            "id": "haok9vq",
            "score": 12,
            "text": "Posting in the historic thread.",
            "title_similarity": "0.3417573"
        },
        {
            "id": "haouyyg",
            "score": 12,
            "text": "Happy birthday from your kids over at badHistory!",
            "title_similarity": "0.7895403"
        },
        {
            "id": "haouu9i",
            "score": 14,
            "text": "Sometimes I wish I could read the comments that you have deleted.",
            "title_similarity": "0.38994694"
        },
        {
            "id": "haoxbuo",
            "score": 13,
            "text": "Finally, an AH thread with the advertised number of comments!",
            "title_similarity": "0.3907318"
        },
        {
            "id": "hap3brs",
            "score": 13,
            "text": "*breathes deeply*\n\nWhen I'm not reading AH I'm reading wikipedia!!\n\n*runs away*",
            "title_similarity": "0.30787456"
        },
        {
            "id": "hap6sxy",
            "score": 13,
            "text": "today I commented on /r/askhistorians",
            "title_similarity": "0.4252243"
        },
        {
            "id": "haospmz",
            "score": 13,
            "text": "Finally, I can speak! It's as if I've held my breath for ten years!",
            "title_similarity": "0.6101477"
        },
        {
            "id": "haox2dh",
            "score": 15,
            "text": "What is the historical basis for the known fact that historians are sexy effers that make the best lovers?",
            "title_similarity": "0.5588082"
        },
        {
            "id": "haonhyl",
            "score": 16,
            "text": "[deleted]",
            "title_similarity": "0.13039212"
        },
        {
            "id": "haoygqp",
            "score": 16,
            "text": "Everytime there is an interesting question, I'm always greeted with [Deleted]\nHow do you guys get most out of this sub?",
            "title_similarity": "0.43983647"
        },
        {
            "id": "hap393m",
            "score": 16,
            "text": "I will cross the line with a fake fact and bad usage of colons; Vikings had big old horns on their helmets. Curvy ones, horns with loops, sometimes just a single narwal tusk. The main usage of the horns was twofold; (i) to look hardcore: and (ii) carry around snacks for a quick pillage break. You can trust this fake fact, it's on AskHistorians.",
            "title_similarity": "0.5421338"
        },
        {
            "id": "hap8lwo",
            "score": 20,
            "text": "I have hereby posted a top level comment on r/askhistorians that won't immediately get deleted, probably.",
            "title_similarity": "0.5479709"
        },
        {
            "id": "haojygb",
            "score": 22,
            "text": "Burble gurble doo",
            "title_similarity": "0.3404619"
        },
        {
            "id": "haoubtb",
            "score": 22,
            "text": "\\[removed\\]",
            "title_similarity": "0.19020517"
        },
        {
            "id": "haotnma",
            "score": 22,
            "text": "[The years keep coming and they don’t stop coming](https://i.imgur.com/kZt3bZP.jpg).",
            "title_similarity": "0.56288064"
        },
        {
            "id": "haol157",
            "score": 38,
            "text": "[Does this count as lightly irreverent? ](https://youtu.be/dQw4w9WgXcQ)",
            "title_similarity": "0.3890534"
        },
        {
            "id": "haope29",
            "score": 36,
            "text": "Let us take a moment to give a shoutout to all the mods for putting in the effort to maintain this subreddit ladies and gentlemen.",
            "title_similarity": "0.40204257"
        },
        {
            "id": "haolexn",
            "score": 36,
            "text": "Welcome to r/AskHistorians. Please Read Our Rules before you comment in this community. Understand that rule breaking comments get removed.\n\nPlease consider Clicking Here for RemindMeBot as it takes time for an answer to be written. Additionally, for weekly content summaries, Click Here to Subscribe to our Weekly Roundup.\n\nWe thank you for your interest in this question, and your patience in waiting for an in-depth and comprehensive answer to show up. In addition to RemindMeBot, consider using our Browser Extension, or getting the Weekly Roundup. In the meantime our Twitter, Facebook, and Sunday Digest feature excellent content that has already been written!\n\nI am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.",
            "title_similarity": "0.49230784"
        },
        {
            "id": "haornos",
            "score": 72,
            "text": "We're only a decade away from:\n\n'I am a person in my mid-20's in July 2011. How do I go about finding useful and well sourced answers to historical questions in a community based setting?'",
            "title_similarity": "0.54749465"
        },
        {
            "id": "haojl9b",
            "score": 196,
            "text": "I subscribe to an alternative chronology that holds that the subreddit is only eighteen months old and any older threads are simply cunning fakes made by Big History.",
            "title_similarity": "0.55728763"
        },
        {
            "id": "haofne7",
            "score": 405,
            "text": "We are exactly halfway to being able to ask about the history of the sub! Who is going to be the first person flaired in \"Askhistorians History\"? Place your bets!",
            "title_similarity": "0.4407619"
        },
        {
            "id": "haogiz9",
            "score": 386,
            "text": "Don't mind me, I'm just here to be lightly irreverent.",
            "title_similarity": "0.38759884"
        },
        {
            "id": "haohszq",
            "score": 78,
            "text": "This sub is the reason I'm still on reddit. Oh and to look at other people's nail art!",
            "title_similarity": "0.3833965"
        },
        {
            "id": "haoiaes",
            "score": 550,
            "text": "Please note anyone found crossing the line into moderate irreverence in this thread will be permabanned.\n\n\nHappy birthday, r/askhistorians!",
            "title_similarity": "0.6787938"
        },
        {
            "id": "haoik6v",
            "score": 181,
            "text": "I'd just like to thank the people who take the time to provide some fascinating and informative answers on this sub.  I have learned things I didn't even know I wanted to learn.\n\nAnd this may be the only opportunity for shitposting commentary so .... let's see.....\n\nOh, I got one.  George Washington was the only American President who ever received a unanimous vote from the electoral college.",
            "title_similarity": "0.55972415"
        },
        {
            "id": "haoj5dw",
            "score": 362,
            "text": "God, I have suffered so much from repressing all the hilarious jokes and puns that come to me when I scan new post titles. But thank you for keeping people like me quiet and the level of discourse here so high. Happy birthday!",
            "title_similarity": "0.5841795"
        },
        {
            "id": "haoj93b",
            "score": 116,
            "text": "Four score, minus three and a half score, we founded a community. A community built on aiding those in need to query the past (but sometimes just helping someone with a history paper). And today we honor those brave souls who make this information available to the public! \n\nThanks all who participate in this sub, it is truly my favorite subreddit to begin a discovery on new facets of history and share my knowledge with others!",
            "title_similarity": "0.58672905"
        },
        {
            "id": "haojke7",
            "score": 326,
            "text": "Finally, I can comment",
            "title_similarity": "0.36105365"
        },
        {
            "id": "haokgwj",
            "score": 108,
            "text": "\\[single sentence\\]",
            "title_similarity": "0.25604677"
        },
        {
            "id": "haolb36",
            "score": 16,
            "text": "I just want to thank all people who provide the awesome answers here and to all the mods who make this my favorite sub on reddit! Cheers!",
            "title_similarity": "0.5822889"
        },
        {
            "id": "haolde0",
            "score": 33,
            "text": "So you guys are all dogs?",
            "title_similarity": "0.15833336"
        },
        {
            "id": "haolgsg",
            "score": 53,
            "text": "Happy birthday, friends! \n\nAlas, ten years is far too short a time to live among such excellent and admirable ~~hobbits~~ historians!",
            "title_similarity": "0.79690367"
        },
        {
            "id": "haoljuf",
            "score": 40,
            "text": "Perhaps the only time I can comment on my favorite subreddit. Happy birthday r/AskHistorians!!!",
            "title_similarity": "0.7372719"
        },
        {
            "id": "haollk5",
            "score": 30,
            "text": "Since I can ask this here: Historians, what is your favourite meme about the part of history you're expert in?",
            "title_similarity": "0.48746908"
        },
        {
            "id": "haolrh5",
            "score": 32,
            "text": "[Personal anecdote with no sources about topic].\n\nHappy birthday and thank you for giving me oddly specific opinions and understandings of varied events that I otherwise never would have known about!",
            "title_similarity": "0.7397081"
        },
        {
            "id": "haonu27",
            "score": 32,
            "text": "This is the only place where I can finally write my favourite sources without being downvoted for them being of dubious historiographic quality and also a bit too old. There you go:\n\n[Cabras, Solán de (1790).](https://solandecabras.es/)\n\n[Mondariz, Balneario de (1873).](https://www.balneariomondariz.es/)\n\n[Sousas, Aguas de (1859)](https://sousas.com/).\n\nDo feel free to list here your favourite sources. u/Iphikrates any source you recommend from the Netherlands? How about a source from Argentina, u/aquatermain ?",
            "title_similarity": "0.53710103"
        },
        {
            "id": "haoora9",
            "score": 53,
            "text": "O magnificent and august flaired regular contributors, what historical figure from your time/place of expertise would you most like to have a beer with, and why?",
            "title_similarity": "0.45558217"
        },
        {
            "id": "haoos4w",
            "score": 4,
            "text": "Making history for the sake of posterity.",
            "title_similarity": "0.39983118"
        },
        {
            "id": "haoou3n",
            "score": 29,
            "text": "What did Hitler do on his 10th birthday?",
            "title_similarity": "0.6642334"
        },
        {
            "id": "haop571",
            "score": 28,
            "text": "The other day there was a pristine question with no deleted comments etc! I really wanted to comment on it about how no one had broken a rule..... But I didn't so now I will here!",
            "title_similarity": "0.58060616"
        },
        {
            "id": "haopakc",
            "score": 10,
            "text": "Blaboo dodo ferskin lambdu thenga paal in paal payasam",
            "title_similarity": "0.33915186"
        },
        {
            "id": "haopwu7",
            "score": 54,
            "text": "[deleted]",
            "title_similarity": "0.13039212"
        },
        {
            "id": "haoqea2",
            "score": 17,
            "text": "42 more years to our first New Fire ceremony! Not too early to start planning!",
            "title_similarity": "0.614859"
        },
        {
            "id": "haoqlvq",
            "score": 8,
            "text": "Woo! What a fantastic, impressive milestone. And this just couldnt be done without the brilliant community we have here. Question askers, flairs, lurkers, mods, answer writers, everyone. This truly is a team effort!",
            "title_similarity": "0.54947156"
        },
        {
            "id": "haorg6o",
            "score": 41,
            "text": "In ten more years we can ask about the creation of r/AskHistorians in r/AskHistorians",
            "title_similarity": "0.6217116"
        },
        {
            "id": "haorugq",
            "score": 34,
            "text": "Sorry, but I'm going to have to report this thread for violation of the 20 year rule. Come back here in another 10 years!\n\nHappy Birthday AH! Thanks for being one of the only places where I can talk about 20th Century Italy without having to deal with actual fascists.",
            "title_similarity": "0.66088474"
        },
        {
            "id": "haos2rq",
            "score": 27,
            "text": "Congratulations! I am putting on my most festive [historical garments](https://i.postimg.cc/ydWp3V6N/DE760910-DFD8-479-A-A65-C-0-B3-ADB401852.jpg) for the occasion.\n\nEdit: shame on me for not citing my source. I collect old magazines. I can’t remember which one I took that photo of but I found that ad in both a 1916 issue of Harper’s Bazaar and a 1920 issue of Vogue.",
            "title_similarity": "0.5920583"
        },
        {
            "id": "haos4pq",
            "score": 7,
            "text": "Would you call someone with just a bachelor in history a historian? If no, who qualifies as a historian according tk you?",
            "title_similarity": "0.34070402"
        },
        {
            "id": "haosguv",
            "score": 45,
            "text": "Winston Churchill is known to have pissed off a cliff after British troops landed in France. The area looked a lot windy. Is it possible he wet himself and the soldiers just went on with it because he was their boss?",
            "title_similarity": "0.3420269"
        },
        {
            "id": "haosw3k",
            "score": 18,
            "text": "this subreddit has been a part of the impetus for me to seriously consider going back to school to study history in real depth, and really i’m just commenting here now because otherwise it’ll be years or never before i probably do so again. love this place. thanks for all that y’all do here.",
            "title_similarity": "0.6175017"
        },
        {
            "id": "haotyds",
            "score": 12,
            "text": "Oh man, ten years? \n\nI'm not up to par to write responses yet, but hopefully by our 20 year reunion I'll be able to do more than just lurk",
            "title_similarity": "0.665207"
        },
        {
            "id": "haou5gt",
            "score": 28,
            "text": "Such timing! I have a question for AskHistorians which is, if not irreverent, selfish! Who published my APUSH textbook, c. 1998? It was hardcover, a blue clothbound with embossed lettering. I’ve spent hours trying to figure it out, but all the nineties textbooks I’ve been seeing have annoyingly glossy covers of Lincoln and Washington on the Delaware. Surely some of you were also taking AP US in the late nineties!\n\nFWIW, I intend to use this knowledge for good, not evil. I’m seeing so many variations of ‘Well, I was never taught that America was founded on racism!’ I want to see exactly what I was taught, because I remember there being a lot of racism....",
            "title_similarity": "0.49642444"
        },
        {
            "id": "haoukwl",
            "score": 23,
            "text": "Congrats from the r/science team!",
            "title_similarity": "0.5581249"
        },
        {
            "id": "haov1ew",
            "score": 12,
            "text": "This subreddit is a treasure, and you mods are diamonds for keeping it that way. Thank you for keeping the quality here so high!",
            "title_similarity": "0.58810776"
        },
        {
            "id": "haovlhh",
            "score": 2,
            "text": "Happy birthday AH!",
            "title_similarity": "0.73659486"
        },
        {
            "id": "haovsle",
            "score": 6,
            "text": "Thank you all of you for the work you put into teaching us. Here's to another ten years!",
            "title_similarity": "0.77334654"
        },
        {
            "id": "haowe8p",
            "score": 3,
            "text": "Thanks to all the collaborators and mods in this sub, it's allways a pleasure to read.",
            "title_similarity": "0.49178976"
        },
        {
            "id": "haowqd1",
            "score": 6,
            "text": "Here's something I always wanted to ask! What's the best definition for history? My 6th grade textbook gave a list of quotes from historians/writers without a neat little 'technical' definition and it has been needling me ever since.",
            "title_similarity": "0.49295318"
        },
        {
            "id": "haowxhl",
            "score": 7,
            "text": "It feels weird to not have the pinned Automod message in a thread here",
            "title_similarity": "0.29949808"
        },
        {
            "id": "haowy8h",
            "score": 9,
            "text": "Thanks to everyone for making high quality content accessible to the average redditor.  \nThats not an easy thing to do when you want to appeal to all users!",
            "title_similarity": "0.6091473"
        },
        {
            "id": "haox4is",
            "score": 10,
            "text": "I’m very excited for an opportunity to actually post a comment! Seriously, this place is great. I’ve given my parents strict instructions to stay off Reddit… except for this sub.",
            "title_similarity": "0.54949635"
        },
        {
            "id": "haoy9hc",
            "score": 8,
            "text": "wow, i have a longer history on reddit than this sub? congrats, definitely one of my favorite ones. though i am oft disappointed when i click on an interesting question with a high comment count, and it's a wasteland lorded over by a sticky comment, i know that's because we need these redditors on the walls, 24/7. this ain't no askHistory!\n\nkeep up the great work!",
            "title_similarity": "0.6276386"
        },
        {
            "id": "haoyd7x",
            "score": 4,
            "text": "Adorable Birthday pictures!\n\nFairly new member who has greatly enjoyed their time here, learning so much. Happy Birthday and well done on lasting a whole decade, here's to many more to come.",
            "title_similarity": "0.82987165"
        },
        {
            "id": "haoydkg",
            "score": 8,
            "text": "I appreciate and admire you all so much! I think it's amazing that any question, no matter how obscure or specialized or arcane, has at least one avid, well informed expert who will respond with a rich tapestry of information representing the best knowledge we have on the topic along with background and contextual color. \n\nSo much of our knowledge these days is reduced to sound bites and talking points; it is really wonderful to have an explanation in depth. Thank you so much, and Happy Birthday!",
            "title_similarity": "0.7100537"
        },
        {
            "id": "haoyh6l",
            "score": 8,
            "text": "We have crossed the Rubicon, now let's avoid the knives.  To 10 more years!",
            "title_similarity": "0.58854824"
        },
        {
            "id": "haoyn6k",
            "score": 14,
            "text": "This is a wonderful community and I'm very thankful to the mods and posters who lead us into a better knowledge of history.\n\nCertainly, this subreddit knows more about history than any 10 year old I know. This subreddit should really consider a future in history with that kind of prodigious knowledge!",
            "title_similarity": "0.7356982"
        },
        {
            "id": "haozc24",
            "score": 28,
            "text": "[cOmMeNt ReMoVeD]",
            "title_similarity": "0.13796312"
        },
        {
            "id": "hap02j2",
            "score": 15,
            "text": "Only 7 more years before the subreddit can be entered into the draft.",
            "title_similarity": "0.3590802"
        },
        {
            "id": "hap0hu2",
            "score": 7,
            "text": "A big shout out to everyone involved in this sub 😘\n\nAlso it's nice to be able to just chat without a mod deleting your comment 😂",
            "title_similarity": "0.5481162"
        },
        {
            "id": "hap1bmi",
            "score": 4,
            "text": "Thanks for the sub, it's greatly appreciated. Far more than my actual secondary school teacher who destroyed my love of history for a long time.",
            "title_similarity": "0.574301"
        },
        {
            "id": "hap2j2k",
            "score": 15,
            "text": "r/AskHistorians is the best subreddit by miles and miles! Keep up the good work.",
            "title_similarity": "0.62316763"
        },
        {
            "id": "hap2xsz",
            "score": 7,
            "text": "Is this what freedom feels like?",
            "title_similarity": "0.28974527"
        },
        {
            "id": "hap2y7p",
            "score": 44,
            "text": "As somebody who loves to read history but has no academic background beyond high school, this is a rare chance to have my comment here that isn't deleted.\n\nHistory was made today. I made a comment on AskHistorians. Let me go and update my résumé.\n\nEdit: me -> my. \n\nAlso, thank you mods for making this place as great as it is.",
            "title_similarity": "0.6521383"
        },
        {
            "id": "hap3hpr",
            "score": 14,
            "text": "\"The creation of AskHistorians cannot be regarded merely as the creation of a subreddit within subreddit bounds. It is, primarily, a subreddit of an all-reddit, all-internet scale, for it signifies a radical turn in the world history of mankind, a turn from the old, bad-historical world to the new, good-historical world. [...] But the AskHistorians subreddit did not and could not stop there. Having destroyed the old, bad-historical order, it began to build the new, good-historical order. The 10 years of the AskHistorians subreddit have been 10 years of building the panel of Moderators, Flairs, Interesting Inquirers, Quality Contributors, community members, upvoters, reporters, conference organizers. History has been freed from the shackles of the old internet and moved into the new. We must not stop now. Forward, comrades, to a worldwide subreddit!\"  \n— Georgy_K_Zhukov, probably\n\nOkay, but seriously, sheesh, ten years. I've gone from looking at this subreddit whenever it hit the front page, complaining about strict moderation, and naively thinking I could answer that question about Afghanistan, to posting actual answers, loving the moderation style, and knowing that I really can't answer that question about Afghanistan. I've really only been active in the subreddit for a year — the 9th-birthday announcement was around the time I started — but here's to many more.",
            "title_similarity": "0.5790782"
        },
        {
            "id": "hap3k52",
            "score": 10,
            "text": "Thank you to everyone who puts effort and time into this sub! Really look forward to reading questions I’ve never thought to ask and the thoughtful and detailed responses.",
            "title_similarity": "0.5941342"
        },
        {
            "id": "hap4o7g",
            "score": 4,
            "text": "Longtime lurker, really appreciate this place. Thanks!",
            "title_similarity": "0.52549636"
        },
        {
            "id": "hap4xm1",
            "score": 18,
            "text": "There are tales of an older sub, a mighty subreddit conceived in great enlightenment with access to the greatest of AntiquiTech, a subreddit named r/AskTartaria.\n\nWhat became of r/AskTartaria? It was buried in a flood of internet mud. Why? They had invested all their energy into cybermantic 'starfort' protective geometry community awards, but failed to appreciate the true importance of moderation. Without moderation, there is nothing to stop the flood of internet shitposts that will, in time, be faced by all communities. Let us learn from their lessons and not get mudflooded like AskTartaria. Amen.",
            "title_similarity": "0.5091391"
        },
        {
            "id": "hap5e97",
            "score": 6,
            "text": "Also a longtime lurker… Thanks to every person who takes time out of their days to answer questions (with detailed answers, no less) asked by random strangers on the internet.",
            "title_similarity": "0.41458365"
        },
        {
            "id": "hap5jzd",
            "score": 71,
            "text": "I've said this before elsewhere, maybe here as well, I can't remember. r/AskHistorians is to me what I imagined the internet would be when I first read Enders Game in High School back in the 28.8 baud modem days. The debates Peter and Val had on the net as Locke and Demostheses rose the level of conversation among the people.\n\nIn real life, well, we got what we got.\n\nLong story short, I love this place. Thank you everybody for making this sub what it is.",
            "title_similarity": "0.5281851"
        },
        {
            "id": "hap5mdv",
            "score": 10,
            "text": "10 years?! Oh wow. Biggest congratulations to everyone part of the sub. \n\nI must thank AskHistorians for single-handedly getting me interested in history. I wish there were more such places online.",
            "title_similarity": "0.80385256"
        },
        {
            "id": "hap6h84",
            "score": 3,
            "text": "[deleted]",
            "title_similarity": "0.13039212"
        },
        {
            "id": "hap73xj",
            "score": 6,
            "text": "Congratulation for mod team, contributors and of course, people asking question for 10 years service at this subreddit, all of you made reddit a better place. :)",
            "title_similarity": "0.7822565"
        },
        {
            "id": "hap75pj",
            "score": 12,
            "text": "C'mon guys, admit it, the dinosaurs left on their space ship.",
            "title_similarity": "0.24813077"
        },
        {
            "id": "hap8crc",
            "score": 5,
            "text": "Oh, is this the time I get the rare askHistorians ~~achievement~~ comment? Nice",
            "title_similarity": "0.58053607"
        },
        {
            "id": "hap8uqw",
            "score": 9,
            "text": "Comment deleted",
            "title_similarity": "0.13048871"
        },
        {
            "id": "hap9pct",
            "score": 5,
            "text": "I can comment without it being taken down now",
            "title_similarity": "0.32816356"
        },
        {
            "id": "hapaggi",
            "score": 6,
            "text": "Happy birthday r/AskHistorians! You're one of my favorite places for knowledge.",
            "title_similarity": "0.7603306"
        },
        {
            "id": "hapaqy9",
            "score": 11,
            "text": "YAHOO!\n\nSo I've been looking through some old threads, including the [\"You're at a party; what question do you dread?\"](https://www.reddit.com/r/AskHistorians/comments/1dv49y/tt_youre_at_a_party_the_people_around_you_find/) classic from 2013. Given how the subreddit has grown in the past eight years (and the world having shifted so much, would there be any interest in a redux?",
            "title_similarity": "0.50997233"
        },
        {
            "id": "hapbevi",
            "score": 9,
            "text": "[this thread](https://youtu.be/roRQ2mNwMMQ)",
            "title_similarity": "0.28653103"
        },
        {
            "id": "hapbg54",
            "score": 10,
            "text": "[deleted]",
            "title_similarity": "0.13039212"
        },
        {
            "id": "hapdnqa",
            "score": 7,
            "text": "I'm sure it's been asked before, but what drives mods and contributors to provide such quality answers to questions?\n\nI'm in the academia myself, and I know better than anyone how absolutely tiresome and hard is it to properly source and research your findings. Even the simplest and most obvious of answers require a great deal of care to turn it from \"anectodal\" to \"factual\".\n\nI'd love to dedicate myself to the sub, but it's really hard and time consuming. Do you guys treat this as a hobby? Or it's complimentary to your formal educational backgrounds?\n\nAlso thanks for all the mods, contributors and users who are responsible for making this sub the best in reddit! Here's to another 10 years!",
            "title_similarity": "0.43464732"
        },
        {
            "id": "hapdvmw",
            "score": 7,
            "text": "Taking advantage of my only opportunity to post after years of lurking.  \n\nCongratulations, enjoy the sub very much.",
            "title_similarity": "0.66573507"
        },
        {
            "id": "hapdxrl",
            "score": 5,
            "text": "happy birthday!!! thank you to the mods for moderating this community so well and thank you for everyone who answers all our burning questions!! \n\nthis is easily one of, if not the best sub on reddit",
            "title_similarity": "0.7017837"
        },
        {
            "id": "hapeqhj",
            "score": 3,
            "text": "Who would win in a boxing match: Stalin or Abraham Lincoln ?",
            "title_similarity": "0.2239688"
        },
        {
            "id": "hapf3ml",
            "score": 16,
            "text": "This is the only subreddit I’d feel ashamed for trolling in",
            "title_similarity": "0.3438019"
        },
        {
            "id": "hapg04p",
            "score": 9,
            "text": "I want an AskHistorians animated series on Netflix, NOW!\n\nBut in all seriousness, happy birthday to the best subreddit on Earth ( Mars too, probably)",
            "title_similarity": "0.629301"
        },
        {
            "id": "hapgx2z",
            "score": 7,
            "text": "[deleted]",
            "title_similarity": "0.13039212"
        },
        {
            "id": "haph8rt",
            "score": 6,
            "text": "These anniversary posts are the only ones I will ever be able to comment in so while I have the chance I would like to say thank you to all of you that do reply and comment regularly. I've learnt a great deal from lurking this sub.",
            "title_similarity": "0.58972585"
        },
        {
            "id": "haphi0s",
            "score": 2,
            "text": "Yay! Finally!",
            "title_similarity": "0.46516925"
        },
        {
            "id": "haphohs",
            "score": 5,
            "text": "Happy birthday to the best sub on Reddit by a long-shot.  Thanks to all of the work the mods do here, I've learned so much from this place.",
            "title_similarity": "0.69570524"
        },
        {
            "id": "hapilqk",
            "score": 10,
            "text": "Can we be mirthful or is this thread limited to lightly irreverent only?",
            "title_similarity": "0.37427396"
        },
        {
            "id": "hapnx85",
            "score": 6,
            "text": "[Removed]",
            "title_similarity": "0.10392267"
        },
        {
            "id": "haprd5n",
            "score": 10,
            "text": "I feel like this is the only time I'll be able to comment on this sub.",
            "title_similarity": "0.331458"
        },
        {
            "id": "haprklh",
            "score": 3,
            "text": "Happy birthday! I hope this community will become even bigger and merrier!",
            "title_similarity": "0.7178229"
        },
        {
            "id": "haps1yl",
            "score": 4,
            "text": "Happy Birthday all, thanks for the hard work in making this the Internet that millennia of librarians would expect an Internet to be.",
            "title_similarity": "0.6646583"
        },
        {
            "id": "hapsc02",
            "score": 6,
            "text": "I have always wanted to know the origin of the usernames of some of the historians here. Is u/commiespaceinvader from Mars (you know, because... Red Plantet)? Is u/Georgy_K_Zhukov somehow related to the Marshal? Is u/aquatermain a good shot in real life too?",
            "title_similarity": "0.43443108"
        },
        {
            "id": "hapsyhs",
            "score": 6,
            "text": "Nice.",
            "title_similarity": "0.3556357"
        },
        {
            "id": "haptc1z",
            "score": 3,
            "text": "🎵*What's the story, Wishbone?*🎶",
            "title_similarity": "0.3283893"
        },
        {
            "id": "haptcgt",
            "score": 7,
            "text": "Have a smashing Birthday\n\nAn example to the Internet in how to do things right. Personally I think all the mods should get into some heavy breeding so that you can bring your \"brutal moderation\" to all corners of the 'net via your offspring.",
            "title_similarity": "0.5239222"
        },
        {
            "id": "hapv324",
            "score": 2,
            "text": "happy birthday! here to comment :)",
            "title_similarity": "0.76544285"
        },
        {
            "id": "hapwaxo",
            "score": 6,
            "text": "I claim this land for the Queen of Spain!",
            "title_similarity": "0.36741197"
        },
        {
            "id": "hapwwsg",
            "score": 3,
            "text": "many happy returns!",
            "title_similarity": "0.545333"
        },
        {
            "id": "hapxip7",
            "score": 6,
            "text": "it's my bday too hehehe",
            "title_similarity": "0.39585394"
        },
        {
            "id": "hapxt1m",
            "score": 6,
            "text": "Half way to the history of r/askhistorians! Happy anniversary to the best subreddit out there!",
            "title_similarity": "0.79941684"
        },
        {
            "id": "hapxx4v",
            "score": 7,
            "text": "Thank you all for the amazing knowledge, insights, and effort I've seen put into this sub! Y'all clearly care quite a bit not only about history, but about informing people to levels of accuracy that are both amazing and robust.\n\n  \n\n\nKeep up the great work, everybody!\n\n  \n\n\n  \n\n\nSincerely,\n\nOne of your many faceless admirers. We may not be able to talk, but the knowledge I see here usually leaves me speechless anyway. ;)\n\n  \n\n\n(since this is probably the only time I'll get to comment in this sub, it kinda feels like Ralph Wiggum is in my head exclaiming, \"I'm *contributing*!\")",
            "title_similarity": "0.6419268"
        },
        {
            "id": "hapyeww",
            "score": 3,
            "text": "The opportunity of a lifetime, at last. I lightly snub your delicately sourced facts with this: \"egg\"",
            "title_similarity": "0.67266315"
        },
        {
            "id": "hapz1fe",
            "score": 5,
            "text": "Haha! I will be irreverent, without the slightly!",
            "title_similarity": "0.43947104"
        },
        {
            "id": "hapzixi",
            "score": 6,
            "text": "As a long time lurker congratulations and thanks for the all amazing questions and answers.",
            "title_similarity": "0.6413268"
        },
        {
            "id": "haq0121",
            "score": 5,
            "text": "Yaaaay 👏\n\nHappy b day!",
            "title_similarity": "0.65789646"
        },
        {
            "id": "haq021t",
            "score": 3,
            "text": "Happy Birthday AH! For those historians out there my question is: what is the most outrageous historical claim you've heard someone try to pass aa true?",
            "title_similarity": "0.67319924"
        },
        {
            "id": "haq0g6g",
            "score": 3,
            "text": "Yay. Thank you MOD GODs of past, present and future for maintaining this sub. Thank you to the inquisitive people who ask the questions and the helpful people who take out time to write comprehensive answers.",
            "title_similarity": "0.65774083"
        },
        {
            "id": "haq0m82",
            "score": 4,
            "text": "Taking the opportunity... We NEED a mashup of r/askhistorians and r/highqualitygifs. Who's watching that can make this happen?! Also.... Happy birthday or cakeday or whatever...\n\nAlso... What's the history of ellipses and why do I love them so much?",
            "title_similarity": "0.7726575"
        },
        {
            "id": "haq0o1z",
            "score": 4,
            "text": "I'm going to suggest it again.\n\nI hate waiting a year for April Fool's Day.  You know, the day where AskHistorians has a historian posing as a famous figure, people have to guess who it is and ask relevant questions.\n\nCan you do this (or other things) once a month?",
            "title_similarity": "0.5493727"
        },
        {
            "id": "haq15yn",
            "score": 4,
            "text": "IM FREEEEE",
            "title_similarity": "0.37042278"
        },
        {
            "id": "haq1bbn",
            "score": 3,
            "text": "Happy birthday, thank god history isn't real, eh? Some of the stories here would be terrifying.",
            "title_similarity": "0.61543953"
        },
        {
            "id": "haq2v36",
            "score": 7,
            "text": "My irreverant history opinion is that the sac of the library of alexandria wasn't that much of a loss! Most of what was burned was already copied elsewhere, and the library was crumbling and mostly disused by that point. Hah! As a former librarian and life-long bookworm, this is so freeing to say in public!",
            "title_similarity": "0.44779092"
        },
        {
            "id": "haq382u",
            "score": 3,
            "text": "Happy birthday to the most academic sub on reddit (that I know of)! Thanks to the mod teams for keeping it so!",
            "title_similarity": "0.7602973"
        },
        {
            "id": "haq3xjh",
            "score": 3,
            "text": "History is cyclic so technically this sub is going to end up like r/jokes very soon.\n\nBad jokes aside, I love you people and your detailed answers and strict as hell modding. Can't wait until we repeat the whole dance all over again and start collecting sources for the small Bing that ended the universe.",
            "title_similarity": "0.6064794"
        },
        {
            "id": "haq45zm",
            "score": 3,
            "text": "I'm sorry, we're going to have to disallow this post, as it isn't properly cited or confirmed by a third party source that's a published historian.",
            "title_similarity": "0.2668873"
        },
        {
            "id": "haq69of",
            "score": 3,
            "text": "I'm somehow always curious about deleted comments (even though it's certainly the least interesting aspect of this sub). \nStill I wish more subs could be this tightly moderated, especially stuff like Suicide Watch or Ask Science",
            "title_similarity": "0.45602334"
        },
        {
            "id": "haq7nz1",
            "score": 15,
            "text": "This sub doesn’t feel like Reddit and that’s the highest compliment I can give. Thank you to all the dedicated, brilliant mods and historians who sacrifice their time and energy to make this place worth visiting. \n\nSee y’all in the nuked thread about Hitler’s wiping habits tomorrow.",
            "title_similarity": "0.6246714"
        },
        {
            "id": "haq7tme",
            "score": 2,
            "text": "And we even get an opportunity to politely celebrate! A great birthday for a great subreddit.",
            "title_similarity": "0.78295505"
        },
        {
            "id": "haq91ds",
            "score": 2,
            "text": "My life is a better place for all the things I learn and don’t remember on this sub.",
            "title_similarity": "0.55496323"
        },
        {
            "id": "haq92x0",
            "score": 5,
            "text": "I finally get to comment!!\n\nI've been subscribed here from what feels like the beginning and always have enjoyed it. The heavy moderating can really kill the buzz of most subreddits, but I feel like that is what makes this community thrive.\n\nThank y'all for doing what you do!",
            "title_similarity": "0.5974841"
        },
        {
            "id": "haq9b73",
            "score": 2,
            "text": "Well done for being a great source of quality for so long and for answering many interesting questions in detail.",
            "title_similarity": "0.5238542"
        },
        {
            "id": "haq9dj1",
            "score": 2,
            "text": "VanFailin of Halicarnassus herein presents the results of his investigation, so that great things done by the flaired shall not be forgotten with time, and that great and marvelous posts, some by the mods and others the laypeople, not lose their karma; including among other things a thorough debunking of book 2 of this volume.",
            "title_similarity": "0.5323546"
        },
        {
            "id": "haq9pd9",
            "score": 5,
            "text": "[Oh man, I read a book about this once, hang on hang on I think I know part of the answer!]\n\nwoo that felt nice!",
            "title_similarity": "0.4963148"
        },
        {
            "id": "haqb2pk",
            "score": 2,
            "text": "a moderate amount of irrelevancy here",
            "title_similarity": "0.3297239"
        },
        {
            "id": "haqbitz",
            "score": 7,
            "text": "So how long until we can post gifs in comments?",
            "title_similarity": "0.3657285"
        },
        {
            "id": "haqceyd",
            "score": 8,
            "text": "My most likely only opporunity to ever post a comment on this sub :)",
            "title_similarity": "0.3899768"
        },
        {
            "id": "haqdjqb",
            "score": 5,
            "text": "Historians, what impact on your profession would the creation of the multiverse have, if you resided in the Marvel comics universe and covered history? \n\nTime to chuck everything and learn to crochet bulky (but comfortable!) super-hero costumes? \n\nOr, would this present an unexpected career enhancement, considering every historical book written would now require a follow-up covering the myriad alternative histories of the given topic?\n\nWould the existence a thousand-year-old Norse god who has likely witnessed most significant events of Earth (our Earth, not those silly knock-off ones) be a boon or a liability to your discipline? On one hand, his being a primary witness would be an incredible source of information. On the other, well, mead is really potent, and he seems to drink quite a lot of it.",
            "title_similarity": "0.47234723"
        },
        {
            "id": "haqjs35",
            "score": 4,
            "text": "In 10 more years, you can legit ask historical questions about this sub...",
            "title_similarity": "0.63207275"
        },
        {
            "id": "haqk377",
            "score": 2,
            "text": "Well, actually, I think it's just...",
            "title_similarity": "0.27051973"
        },
        {
            "id": "haqla56",
            "score": 2,
            "text": "Ahhh hey everyone, any theories on Aristotle’s favorite ice cream flavor?",
            "title_similarity": "0.5641676"
        },
        {
            "id": "haqlhv5",
            "score": 3,
            "text": "I have so much useless Film trivia in my head. Alas my only citations for proof and verification are imdb and other user generated wikis",
            "title_similarity": "0.2512273"
        },
        {
            "id": "haqlmur",
            "score": 3,
            "text": "Happy birthday.",
            "title_similarity": "0.73072493"
        },
        {
            "id": "haqlpqj",
            "score": 6,
            "text": "I feel giddy at the thought of posting a response in this sub without it being removed…",
            "title_similarity": "0.60486007"
        },
        {
            "id": "haqmyvo",
            "score": 2,
            "text": "If I wanted to learn more about history, where should I start? I watch a show or hear about a period of time and realize how little I know, but I have no idea where to start. \n\nAny direction would be greatly appreciated!",
            "title_similarity": "0.4912336"
        },
        {
            "id": "haqp0mj",
            "score": 4,
            "text": "Happy birthday, Best Subreddit.",
            "title_similarity": "0.7602337"
        },
        {
            "id": "haqq1g5",
            "score": 1,
            "text": "But where's the history of the historians?",
            "title_similarity": "0.23081228"
        },
        {
            "id": "haqsyzc",
            "score": 5,
            "text": "This is honestly my favorite sub. Thank you everyone for making me want to visit every day!",
            "title_similarity": "0.67066336"
        },
        {
            "id": "haqt4d3",
            "score": 3,
            "text": "I joined three years after the subreddit's foundation. It has just dawned on me that there has been more time in this subreddit's life where I have been here than there has been time when I have not been here. This is very strange to me, as I had always considered this subbredit an immovable and unchanging object with traditions etched in stone from before time began.",
            "title_similarity": "0.41581675"
        },
        {
            "id": "haqtx26",
            "score": 2,
            "text": "Holy Hannah, I can't believe I've been on this site this long. Keep fighting the good fight, you guys are part of what keeps Reddit decent.",
            "title_similarity": "0.61035407"
        },
        {
            "id": "haqu149",
            "score": 2,
            "text": " Now you see me....now you",
            "title_similarity": "0.3073888"
        },
        {
            "id": "haqwucn",
            "score": 5,
            "text": "Thank You for your efforts to keep the information and posts on topic.",
            "title_similarity": "0.42915285"
        },
        {
            "id": "haqxiir",
            "score": 5,
            "text": "Just 10 more years until we can ask questions about r/askhistorians on r/askhistorians.",
            "title_similarity": "0.6269518"
        },
        {
            "id": "haqxp04",
            "score": 4,
            "text": "Love you guys. Thanks for educating the masses and keeping the wonderful world of history alive!",
            "title_similarity": "0.6113187"
        },
        {
            "id": "haqy3g6",
            "score": 7,
            "text": "I love this sub. The irreverence.. Umm.. Fart?",
            "title_similarity": "0.48161983"
        },
        {
            "id": "haqz99u",
            "score": 2,
            "text": "Hello and happy birthday!",
            "title_similarity": "0.7476988"
        },
        {
            "id": "har09qq",
            "score": 2,
            "text": "I can finally ask how many whips and fedoras are collectively possessed by the mod team.",
            "title_similarity": "0.28178045"
        },
        {
            "id": "har0c29",
            "score": 5,
            "text": "Alexander the Great conquered Egypt by splitting the Gordion knot, forcing them to acknowledge him as their emperor. He then went on to marry Cleopatra and found the fifth dynasty, which constructed the pyramids.\n\nSource: Trust me. The mods aren't removing my comment, so it's obviously correct.",
            "title_similarity": "0.49252146"
        },
        {
            "id": "har18og",
            "score": 1,
            "text": "Thank you to everyone for making and keeping this place interesting, it's so refreshing to see a community of users that not only is extremely helpful but actively ensures that the community remains as high quality as it was when it started. It's always a lot of fun to scroll through and learn things I wouldn't have even thought of before.",
            "title_similarity": "0.6200448"
        },
        {
            "id": "har1q0h",
            "score": 3,
            "text": "I been waiting on a question for months someone save me hahah",
            "title_similarity": "0.4543463"
        },
        {
            "id": "har3nom",
            "score": 4,
            "text": "It’s my birthday too!!",
            "title_similarity": "0.68290657"
        },
        {
            "id": "har499u",
            "score": 3,
            "text": ":O the same birthday as Worcestershire sauce production. Love you!",
            "title_similarity": "0.7143884"
        },
        {
            "id": "har7fzg",
            "score": 8,
            "text": "Perhaps the best subreddit in existence. It truly illustrates what powerful potential the internet has to share knowledge, when so much of the internet is used for the opposite.  Ty mods and contributors",
            "title_similarity": "0.4687728"
        },
        {
            "id": "har89ir",
            "score": 3,
            "text": "Happy birthday!\nThank you for the interesting facts and thoughts you add to my life.\n\nMy favorite \"special event\" was April Fools the other year when we made up AITA posts for historical and literary figures.\nSo fun!\nLet's do that again!",
            "title_similarity": "0.78823435"
        },
        {
            "id": "har9988",
            "score": 5,
            "text": "I wish this subreddit a somber and respectful birthday.",
            "title_similarity": "0.67687345"
        },
        {
            "id": "har9ajz",
            "score": 2,
            "text": "Now, this is a history moment.",
            "title_similarity": "0.432913"
        },
        {
            "id": "harazlc",
            "score": 1,
            "text": "Ayy lmao",
            "title_similarity": "0.28505242"
        },
        {
            "id": "hardsh0",
            "score": 1,
            "text": "History in the making here everyone. Someday a reddit historian may comment on one of us making a comment here today ;)",
            "title_similarity": "0.4993251"
        },
        {
            "id": "harf224",
            "score": 2,
            "text": "How many historians does it take to change a light bulb?",
            "title_similarity": "0.3146408"
        },
        {
            "id": "harjb2c",
            "score": 2,
            "text": "It has been a long and illustrious track record to point to for the askhistorians team of strictly yet fairly enforcing the rules and etiquette: simply that answers to poignant questions be engaged by knowledgeable, qualified experts, be they professional or enthusiast, and even those highly esteemed gentlepersons will be expected to provide sourced materials AND out of an abundance of good will, defend, debate and guide discussion upon said topic amidst the great unwashed masses scattered far and wide.  Many thanks and job well done. \nI now hereby nominate this wonderful mod team to be in charge of the rest of the internet as well.",
            "title_similarity": "0.5024024"
        },
        {
            "id": "harjeab",
            "score": 1,
            "text": "Wonderful 10th bday to the sub! Thanks to everyone who keeps it alive and well :)",
            "title_similarity": "0.7669445"
        },
        {
            "id": "harjjbe",
            "score": 1,
            "text": "How many more years until we can submitting questions about this subreddit?",
            "title_similarity": "0.4530655"
        },
        {
            "id": "harkn5o",
            "score": 3,
            "text": "As someone who loves to simplify history it's my bane to see questions I know the answer to but don't have the time to lay everything out on here, I'd like to just thank everyone who puts in all of the work into this sub.",
            "title_similarity": "0.55030394"
        },
        {
            "id": "harl7gp",
            "score": 3,
            "text": "yo bitches be like why Christmas got Satana Claus innit. source *THAT*",
            "title_similarity": "0.51372504"
        },
        {
            "id": "harlzg2",
            "score": 3,
            "text": "Did that mean in 10 years time we can start asking questions about the founding of /r/askhistorians",
            "title_similarity": "0.62720054"
        },
        {
            "id": "haro3qf",
            "score": 9,
            "text": "God bless the mods for being draconian as fuck.",
            "title_similarity": "0.43293577"
        },
        {
            "id": "harpqrm",
            "score": 4,
            "text": "Wow, ten years of deleting comments! Keep it up...",
            "title_similarity": "0.67965853"
        },
        {
            "id": "harpsmk",
            "score": 4,
            "text": "I'm sorry for not being irreverent. I'd just like to take this opportunity to thank all the dedicated people of this subreddit for the high quality content of their posts and even questions. In my opinion r/AskHistorians is the most valuable sub on reddit.",
            "title_similarity": "0.6262282"
        },
        {
            "id": "harq7n7",
            "score": 3,
            "text": "Happy birthday.",
            "title_similarity": "0.73072493"
        },
        {
            "id": "harqsbw",
            "score": 3,
            "text": "This comment hasn't been deleted?\n\nFirst time in my life",
            "title_similarity": "0.4705475"
        },
        {
            "id": "harrgcf",
            "score": 2,
            "text": "Happy birthday and thanks to everyone who helps make this place what it is :)",
            "title_similarity": "0.7566423"
        },
        {
            "id": "hars4j2",
            "score": 5,
            "text": "Is it true that Hitler and Stalin were actually the same person? Why is the Second World War so underrated? Is it true that the unpopularity of the Second World War is because of how unpopular Mean Girls 2 was?\n\nThanks",
            "title_similarity": "0.39530754"
        },
        {
            "id": "harsasl",
            "score": 2,
            "text": "I just my name on the records! Hooray!",
            "title_similarity": "0.49983895"
        },
        {
            "id": "hart52s",
            "score": 3,
            "text": "This subreddit is a truly remarkable thing and I’m incredibly proud of my small contributions to it. Cheers to everybody who makes this place what it is.",
            "title_similarity": "0.61999923"
        },
        {
            "id": "harwmho",
            "score": 3,
            "text": "Fart",
            "title_similarity": "0.2649994"
        },
        {
            "id": "harxlel",
            "score": 3,
            "text": "Even with a degree and a publication, this is the only time I might have the confidence to post on here!",
            "title_similarity": "0.36917585"
        },
        {
            "id": "harxt7m",
            "score": 2,
            "text": "Ich bin berliner. That is all.",
            "title_similarity": "0.2545562"
        },
        {
            "id": "haryc25",
            "score": 5,
            "text": "Just coming out of lurking for some cake. :3\n\nHere's to 10 more years!",
            "title_similarity": "0.72754544"
        },
        {
            "id": "harznp0",
            "score": 3,
            "text": "Historic comment! Best subreddit!",
            "title_similarity": "0.5351175"
        },
        {
            "id": "has2slz",
            "score": 5,
            "text": "I'd love to apply for flair someday, since I finally got my BA History done, but I hardly feel qualified looking at all the other medievalists that answer questions here.",
            "title_similarity": "0.47233474"
        },
        {
            "id": "has4hio",
            "score": 2,
            "text": "I have waited so patiently to finally have the freedom to be irreverent on here, but now I have said freedom I don't have anything to say. I disappoint myself.",
            "title_similarity": "0.41856688"
        },
        {
            "id": "has6apx",
            "score": 5,
            "text": "Congratulations! This sub definitely is my favorite place to lurk on Reddit, albeit the chances to comment are far and few between. But it's just amazing how much I learn here about topics I never even knew I wanted to learn something about. Keep it up, you wonderful band of rascals!",
            "title_similarity": "0.65555793"
        },
        {
            "id": "has7bfu",
            "score": 2,
            "text": "Happy birthday! \n\nSo we've already had academic papers written about this place- how long before we have some young, hungry postgrads seeking to overturn our established wisdom?",
            "title_similarity": "0.62903786"
        },
        {
            "id": "hasamp7",
            "score": 2,
            "text": "I am so afraid about somehow abusing the definition of being lightly irrelevant and thus getting my comment deleted, that I just want to say \"Thank you\". \n\nThat being said, it is definitely part of the charm and complication of being in this subreddit - the constant worry that anything you say will be swiftly and decisively executed.",
            "title_similarity": "0.5407125"
        },
        {
            "id": "hasc4tu",
            "score": 3,
            "text": "Yay! Time for us filthy casuals to finally enjoy those deeply coveted shitposts, or rather, shit-comments.\n\n[removed by moderator]",
            "title_similarity": "0.53648716"
        },
        {
            "id": "hasdwrr",
            "score": 3,
            "text": " I am Maximus Decimus Meridius, commander of the Armies of the North, General of the Felix Legions, loyal servant to the true emperor, Marcus Aurelius.",
            "title_similarity": "0.3780023"
        },
        {
            "id": "hasfiks",
            "score": 2,
            "text": "Happy birthday! I am irreverent!",
            "title_similarity": "0.6354687"
        },
        {
            "id": "hash0pi",
            "score": 2,
            "text": "Thank you, mod team, for keeping this sub such a joy and a thronging hive of interesting information. I wish other places were as tightly moderated and had as strict requirements for information presented. We would propably be better off for it in this day and age.\n\nMore than that, happy birthday! Here's for another ten! Cheers!",
            "title_similarity": "0.8179157"
        },
        {
            "id": "hashglo",
            "score": 4,
            "text": "Just posting something so I can say I have a top-level comment on askhistorians",
            "title_similarity": "0.45754468"
        },
        {
            "id": "hasjvjv",
            "score": 5,
            "text": "I often say that Reddit is the best and the worst of the Internet. And by that I mean, there is /r/AskHistorians and there is the rest of Reddit.",
            "title_similarity": "0.45223302"
        },
        {
            "id": "hasmbik",
            "score": 1,
            "text": "My favorite historical fact: James K Polk was not only pivotal in creating a independent treasury, but he also brought the Tennessee tradition of tapas to the White House.",
            "title_similarity": "0.4956234"
        },
        {
            "id": "hasp5le",
            "score": 1,
            "text": "Lightly irreverent question for the mods: if someone were to post the contents of [this article](https://twitter.com/swgannon/status/1431881243050876934) here as an answer, I know you would remove it, but what would be your justification to the poster in response?",
            "title_similarity": "0.36879563"
        },
        {
            "id": "haspmjc",
            "score": 1,
            "text": "Would an open AMA to historians he lightly irrelevant?\n\nIf so, historians, ask away!",
            "title_similarity": "0.32063508"
        },
        {
            "id": "hasr02k",
            "score": 3,
            "text": "I was reading and writing the occasional answer where I felt confident I could provide something better-than-nothing for years, but it wasn't until like last week that I actually thought of joining. What a great place made possible by unchecked council dictatorship.",
            "title_similarity": "0.7063395"
        },
        {
            "id": "hasrpif",
            "score": 3,
            "text": "Half way to being able to ask history about askhistory on askhistory without breaking the rules of askhistory.\n\n/remindmeorwhatever in 10 years",
            "title_similarity": "0.7026355"
        },
        {
            "id": "hastjjl",
            "score": 4,
            "text": "Please, oh users of AskHistorians, please stop mistaking this for AskMindReadersOfTheDead.  No one knows what anyone was “thinking”, ever, now or in the past.  “What was Nixon thinking when he wore a light grey suit to the Kennedy debate?”  What answer would satisfy this?  This is definitely an arena where there ARE stupid questions.  \n\n\nIf you haven’t the courtesy to take the time to frame the question into an answerable form, like “What possible motivations…” or “What options did they have…” then you should not expect a proper response.\n\nI also believe at this stage the mods should recognize and remove the unanswerable question a swiftly as they would a careless opinionated answer.  I think it would be easier to bat away one silly question than to bat away dozens of sincere, but ultimately inappropriate answers.  Whew!\n\n\nThis, and AMAs are why I joined Reddit.  I love reading these, and I love contributing and I am grateful for the opportunity to rant about a pet peeve on an otherwise model sub.  Carry on!",
            "title_similarity": "0.4128039"
        },
        {
            "id": "hateq3e",
            "score": 1,
            "text": "\"Now listen here you Chuckaboo, do not hold distain for my attractive physique. Perhaps if you groomed yourself more eloquently you would not find yourself a bachelor still. Even more so, perhaps the young lady you court will return your correspondence after she tires of the surgeon or magistrate she fancies. Saddle-goose!\"  \n\\- Some guy at some point in time.",
            "title_similarity": "0.519994"
        },
        {
            "id": "hauvy19",
            "score": 1,
            "text": "Happy birthday, here’s to another ten.",
            "title_similarity": "0.79980326"
        },
        {
            "id": "hav37yq",
            "score": 3,
            "text": "Puppies!",
            "title_similarity": "0.21924695"
        },
        {
            "id": "hazg7wj",
            "score": 3,
            "text": "Congartulations!\n\nI would like to add:\n\n[Comment removed]",
            "title_similarity": "0.4151038"
        },
        {
            "id": "hbd6sza",
            "score": 6,
            "text": "Mom, I'm on Ask Historians!",
            "title_similarity": "0.38552323"
        },
        {
            "id": "hbi87xx",
            "score": 3,
            "text": "*taps screen* Anyone still here?\n\nHappy Birthday, Historians/Herstorians/Ourstorians and may we all continue to seek the truth however we may find it. Those who watch over this subreddit are heroes and thank you.  \n\n                        🎂🎁\n\n       🎁 🎁🎁🎁  🎁🎁 🎂🎁🎁🎁\n\n    🎁 🎁 🎁🎁🎁 🎂🎁  🎁🎁 🎁 🎁\n\n🎁 🎂🎁 🎁🎁 🎁  🎂🎁🎁 🎁🎁🎁🎁",
            "title_similarity": "0.7550432"
        },
        {
            "id": "hbnldp0",
            "score": 1,
            "text": "Finally! Can I ask a question about Hitler, the historicity of Jesus, or the American Civil War?",
            "title_similarity": "0.30536368"
        },
        {
            "id": "hbwm22b",
            "score": 1,
            "text": "I finally get to comment, yay!",
            "title_similarity": "0.57797897"
        }
    ]
}