{
    "Zoroastrianism was probably the most followed monotheistic religion for at least a thousand years. Yet to my knowledge, the Christian Bible and Jewish Talmud is silent on its existence. Why?\nThere were many Zoroastrian communities living under Roman rule during the time of Paul. Why didn’t early Christians focus on converting them?  Was their political ramifications for Christians challenging Zoroastrianism?  \n\nDid early Jews view Zoroastrians as believers in the same god?  They must have had contact with Zoroastrian believers during their exile to Persia.\n\nDid either the Jews or the early Christians recognize the similarities between their religions and Zoroastrian beliefs?": [
        {
            "id": "hbvv18r",
            "score": 1,
            "text": "Welcome to /r/AskHistorians. **Please [Read Our Rules](https://www.reddit.com/r/AskHistorians/wiki/rules) before you comment in this community**. Understand that [rule breaking comments get removed](https://www.reddit.com/r/AskHistorians/comments/h8aefx/rules_roundtable_xviii_removed_curation_and_why/).\n\n#Please consider **[Clicking Here for RemindMeBot](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps://www.reddit.com/r/AskHistorians/comments/pje30i/zoroastrianism_was_probably_the_most_followed/%5D%0A%0ARemindMe!%202%20days)** as it takes time for an answer to be written. Additionally, for weekly content summaries, **[Click Here to Subscribe to our Weekly Roundup](https://www.reddit.com/message/compose/?to=AHMessengerBot&subject=Subscribe&message=!subscribe)**.\n\nWe thank you for your interest in this *question*, and your patience in waiting for an in-depth and comprehensive answer to show up. In addition to RemindMeBot, consider [using our Browser Extension](https://www.reddit.com/r/AskHistorians/comments/d6dzi7/tired_of_clicking_to_find_only_removed_comments/), or getting the [Weekly Roundup](https://www.reddit.com/message/compose?to=subredditsummarybot&subject=askhistorians+weekly&message=x). In the meantime our [Twitter](https://twitter.com/askhistorians), [Facebook](https://www.facebook.com/askhistorians/), and [Sunday Digest](https://www.reddit.com/r/AskHistorians/search?q=title%3A%22Sunday+Digest%22&restrict_sr=on&sort=new&t=all) feature excellent content that has already been written!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AskHistorians) if you have any questions or concerns.*",
            "title_similarity": "0.44733226"
        },
        {
            "id": "hbwjswi",
            "score": 59,
            "text": "[removed]",
            "title_similarity": "0.047798205"
        },
        {
            "id": "hcil51n",
            "score": 25,
            "text": "This is more a book rec than an answer, unfortunatlely, but I hope it's sufficient to point you in the right direction.\n\nJewish sources aren't silent on Zoroastrianism, but one has to know where to look.  Generally Jewish texts don't talk a whole lot about other religions--they are mentioned in passing when relevant, but Jewish texts are meant for internal consumption.  Furthermore, talking about other religions was a good way to get your texts censored.  If a scholar tried to reconstruct, say, Christianity from Jewish texts alone, they would be able to figure out some generalities of what Christians believe, terminology, specific Christian practices, and the like, but not actually get a picture of what Christianity is (edit: you'd probably have a hard time finding words like \"Christian\" or \"communion\".  \"Priest\" you would get in the weird term \"galach\", meaning \"shaven\".  You'd know that Christianity is sort of monotheistic, believes in a man who's also God (the details of which are very fuzzy in Jewish texts), and also saints are around and there are images. Not exactly a robust description).  And the volume of Jewish texts produced in Christian-majority societies is far larger than in Zoroastrian-majority ones.\n\nAnyway, the place to look is the Talmud.  Specifically, the Babylonian Talmud.  It was redacted/produced under the Sasanian Empire.  The Talmud is primarily interested in Jewish law, but has (sometimes lengthy) narratives that are often tangential to the main topic under discussion.  Often they discuss non-Jewish figures, or contrast Jewish views with non-Jewish ones.\n\nUnfortunately I don't know enough to say what the Talmud actually says here.  I've never really come across these narratives in my own Talmud-reading, and even if I have, the meaning of the narratives is often kind of hard to parse without knowing historical context.  So, here's where this turns from answer to book rec.\n\nShai Secunda has written a few books recently about this.  Most obviously, \"The Iranian Talmud\", which discusses the Talmud in the Sasanian context.  He's also recently published \"The Talmud's Red Fence\", which is about the interplay between menstrual impurity in Jewish law and non-Jewish Sasanian society.  If I'd read these books I'd have more of an answer for you...but I've heard good things.",
            "title_similarity": "0.71092117"
        },
        {
            "id": "hbxijy5",
            "score": 538,
            "text": "This only touches on one small portion of your question but, [Was Zoroastrianism the source for Christianity?](https://www.reddit.com/r/AskHistorians/comments/aimx8s/was_zoroastrianism_the_source_for_christianity/) written by u/lcnielsen touches on possible influences between Judaism and Zoroastrianism and Christianity and may be of interest\n\nAdditionally, [To what extent did Zoroastrianism, particularly in the Parthian Empire, influence Judaism?\n](https://www.reddit.com/r/AskHistorians/comments/9zbhjf/to_what_extent_did_zoroastrianism_particularly_in/ea922dz/) again by u/lcnielsen talks about the last part of your question.",
            "title_similarity": "0.738845"
        },
        {
            "id": "hbwcfb2",
            "score": 55,
            "text": "[removed]",
            "title_similarity": "0.047798205"
        }
    ]
}