{
    "The Irish Potato Famine (1845-1852), while often viewed as a tragedy, largely escapes being labelled as a genocide by the academic community. In contrast to this, the Holodomor/Soviet Famine (1932-1933) is actively labelled as a genocide by 16 countries. What are the causes behind this difference?\nFrom cursory overview, the events share a large amount of similarities. Both countries were victim to failed economic policies instituted by their occupiers, whether it be Britain's strict adherence to *laissez faire* capitalism or Stalin's rush to modernisation. \n\nThe Irish potato famine, though an atrocity, is generally not referred to as a genocide due to a lack of proof of genocidal intent and is rather categorised as an act of historical neglect and incompetence. The general trend is that although the British both contributed to the circumstances that led to the famine, and did a terrible job responding to it, the famine wasn't a deliberate act of mass-murder with the extinction of Catholic Irish as its goal. A tragedy of apathy and economics rather than one of hatred. \n\nMeanwhile the Ukranian Holodomor's \"genocide question\" seems to be far more heated and readily discussed. What were the core differences in the two situations? Is there much more substantial proof of genocidal intent in the Soviet regime? Or is it more of a historiographical issue that's still conflated with charged Cold War era rhetoric?\n\nMuch appreciated! This is a question genuinely borne out of good faith, I'm on a bit of a \"Genocide Studies\" binge at the moment. The difference in classifications and arguments used are fascinating.": [
        {
            "id": "hdbe9wv",
            "score": 1,
            "text": "Welcome to /r/AskHistorians. **Please [Read Our Rules](https://www.reddit.com/r/AskHistorians/wiki/rules) before you comment in this community**. Understand that [rule breaking comments get removed](https://www.reddit.com/r/AskHistorians/comments/h8aefx/rules_roundtable_xviii_removed_curation_and_why/).\n\n#Please consider **[Clicking Here for RemindMeBot](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps://www.reddit.com/r/AskHistorians/comments/pqjz96/the_irish_potato_famine_18451852_while_often/%5D%0A%0ARemindMe!%202%20days)** as it takes time for an answer to be written. Additionally, for weekly content summaries, **[Click Here to Subscribe to our Weekly Roundup](https://www.reddit.com/message/compose/?to=AHMessengerBot&subject=Subscribe&message=!subscribe)**.\n\nWe thank you for your interest in this *question*, and your patience in waiting for an in-depth and comprehensive answer to show up. In addition to RemindMeBot, consider [using our Browser Extension](https://www.reddit.com/r/AskHistorians/comments/d6dzi7/tired_of_clicking_to_find_only_removed_comments/), or getting the [Weekly Roundup](https://www.reddit.com/message/compose?to=subredditsummarybot&subject=askhistorians+weekly&message=x). In the meantime our [Twitter](https://twitter.com/askhistorians), [Facebook](https://www.facebook.com/askhistorians/), and [Sunday Digest](https://www.reddit.com/r/AskHistorians/search?q=title%3A%22Sunday+Digest%22&restrict_sr=on&sort=new&t=all) feature excellent content that has already been written!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AskHistorians) if you have any questions or concerns.*",
            "title_similarity": "0.530991"
        },
        {
            "id": "hdcev2l",
            "score": 216,
            "text": "[removed]",
            "title_similarity": "0.13539383"
        },
        {
            "id": "hdc38la",
            "score": -28,
            "text": "[removed]",
            "title_similarity": "0.13539383"
        },
        {
            "id": "hdc1wz0",
            "score": 267,
            "text": "While more can always be said highlighting the specific differences, some questions and answers that might interest you:   \n\nhttps://www.reddit.com/r/AskHistorians/comments/2zqz3z/i_often_hear_people_say_that_the_irish_potato/ especially that by /u/Cenodoxus   \n\nhttps://www.reddit.com/r/AskHistorians/comments/49hslg/was_the_irish_famine_of_184549_due_to_english/ where /u/Instantcoffees  has a slightly different perspective   \n\nMore recently there is a great answer by /u/IrishHistorian in https://www.reddit.com/r/AskHistorians/comments/l6uy5q/is_there_any_evidence_to_suggest_that_the_irish/   \n\nOn the Holodomor side:    \n\n/u/Kochevnik81 has a great answer in this thread https://www.reddit.com/r/AskHistorians/comments/b3e0xo/how_isnt_the_holodomor_not_a_genocide/eiz6jf1/",
            "title_similarity": "0.6906996"
        },
        {
            "id": "hddi42z",
            "score": 1423,
            "text": "Prepare yourself, this is an extremely lengthy and unnescessarily complicated explanation. Also, it didn't fit in a single comment, so I continued it in the replies. Click the link at the bottom of each comment for a short-cut.\n\n\\---\n\nThe likely explanation is that Social Scientists and National Governments just use different vocabularies to talk about this stuff.\n\nIn my experience, having done archaeology on the famine, it comes down to what you'd consider genocidal intent. The British heavily bought into Malthusian theory, which they viewed as the cause of the famine. Malthusian theory says that famines are the result of the population becoming too large for the land to support (this is incorrect; we now understand that famines are more commonly the result of chain failures in complex societal systems). Many British intellectuals blamed the Irish peasantry for having too many children while living in a state of poverty, which they viewed as irresponsible (again, not accurate). This is one of the reasons why the British instituted the workhouse system, which I'll cycle back to in a sec.\n\nSo in actuality the famine was caused by monoculture of the potato, which existed because it was the only economical way for poor farmers to operate within the tenant system utilized in British Ireland. The tenant system involved large landowners renting to middlemen under a fairly firm renting agreement, giving stability to the middlemen but requiring them to make rent consistently. They achieved this by renting at-will to small tenant farmers. Since middlemen were constantly competing for land, the ones most aggressive in returning profits would win out. The middlemen kept dividing the land into smaller and smaller parcels, so that they could rent to as many tenant farmers as possible. Now obviously there was a lower limit on how much they could shrink the land parcels, because there needed to be at least enough land for the tenant farmers to feed themselves and to make money for rent. But there were different ways in which tenant farmers could feed themselves, and these all involved different efficiencies of land use. The best way to feed yourself using the smallest amount of land possible is to grow potatoes. So since all these tenant farmers were competing for increasingly small parcels of land, the system gradually pushed them to all adopt potato monoculture to feed themselves. Which from a nutrition angle actually worked reasonably well for them, as potatoes are quite nutrient and calorie dense. But from a stability angle, it was catastrophic. When the potato blight came, these subsistence crops failed completely, and the tenant farmers were left starving. But *here's the thing*. Remember, the tenant farmers weren't just using their land to feed themselves, but also to make money to pay rent. Also, there were parts of Ireland which weren't as potato focused, and they continued to be productive. It's debatable whether or not Ireland actually remained a net exporter of food during the famine (meaning that they exported more than they imported). But they still continued to export. In the late 1700s, the British halted exports from Ireland to combat a famine, but actively opted against this for the great famine, on the basis of preferring market solutions. It might not have been possible to eliminate the great famine by halting exports, but it would have helped reduce the severity. Coupled with the fact that tenancy policy drove potato monoculture in the first place, and the famine was unquestionably a human-made tragedy.\n\nSo why didn't they just distribute the food which they had? Well, because again, the British blamed poor moral character for the famine. They thought that by just handing out food, it would encourage laziness, resulting in even more overpopulation as people ignored the consequences of having more kids. So the British insisted on food being conditioned on entering a workhouse, in order to build an ethic of able employment in exchange for assistance. Problem is that the workhouses basically involved cramming a ton of malnourished and thus immunocompromised people together in poor living conditions. Disease was rampant. The workhouses were seen as a place that people went to die. Since any person without tenancy or an occupation ended up in the workhouses, tenant farmers became even more desperate to retain tenancy on their small parcels. What's more, the British also provided for some limited relief to be given to people who remained working on their lands, without the requirement of entering a poorhouse. The problem? The landholders were expected to pay for it, which seems great on face value, but combined with the workhouses, the system resulted in landholders evicting tenants into the workhouses rather than pay to support them. This only exacerbated the underlying factors contributing to the famine.\n\nSo was the famine a genocide? It's complicated. We have two main factors to consider, and both involve intent. Question one. Was the intent of the British in formulating their Irish policy during the famine to eliminate the Irish people? Question two. What actually is a genocide, and does intent matter?\n\nLet's talk about the intent of the British. Prejudice and power relations were unquestionably a major contributing factor to the famine. But the British weren't trying to kill the Irish people, at least not overtly. In theory, the British were trying to 'save' the Irish. This is speaking as a matter of intent. As a matter of actual events, the British were definitely making things worse.\n\nExcept here's where it gets complicated. See, the British were justifying a lot of their efforts on the basis of Malthus, and Malthus' theory states that famine is caused by overpopulation. So the British were, by their own basis of justification, definitely intending to deliberately reduce the Irish population. They weren't even shy about that. But the British of the time would tell you that their plan wasn't to reduce the Irish population by killing lots of people, but rather by instilling strong moral character in the Irish so that they'd be responsible enough not to have more children than they can support (ahem, prejudice). But that's still intentional reduction of population. Is that genocide? Well, right now the West finances plenty of programs in the developing world to educate people about contraceptives and provide them access to family planning resources. That carries overt intent to limit population. We can probably agree that these programs don't constitute a genocide. But on the other hand, consider the American Eugenics Program, where women were forcibly sterilized (a practice which we see echoes of today in ICE actions). That's something we hopefully can agree is abhorrent. So what's the difference between forced sterilization and contraception education? The main thing is consent.\n\nOkay, so here's another question. At one point does power become an instrument of coersion so effective that it functionally limits the ability for consent? In theory, Irish tenant farmers had the choice whether or not to switch onto potato monoculture. In theory, Irish tenant farmers had the choice to negotiate their contracts. In theory, Irish tenant farmers had the choice to find a job, or a tenancy, in order to avoid the workhouses. But *did they really*? I once participated in an archaeological excavation of famine-era huts which we discovered to actually be converted from reclaimed shale pits (not a great way to live ... no drainage, no land for crops, and based on the crude fire pits we found, they would have been filled with smoke). We have records of these pits being used for shale up until soon before the famine, meaning that the people who moved into those sites did so during famine times, likely after losing tenant land. So when the Irish had a choice, *any* choice, they did exercise it. This is the length people would go to in order to avoid the workhouse. Meaning that most of those who entered the workhouse really did so because they had no other option. What does this mean? Well, let's say we buy the British explanation that they genuinely thought that the workhouses would be beneficial to the Irish. Is this more like contraception education in the developing world, or is it more like forced sterilization?\n\nAnd this all assumes, incidentally, that the British actually really did genuinely think that the workhouses were helpful. Now, for what it's worth, I actually do suspect that plenty of British people were just straight-up true believers. Malthus was considered 'cutting-edge' at the time, thus many British considered themselves to be operating from a rational and scientific basis. Incidentally, stuff like this is why it's so important to be skeptical about appeals to a more rational temperament, such as in the \"facts over feelings\" type of slogan. Science is a process, not a personality trait. Many people at the time definitely bought into the latter, a problem which people today still replicate. Most records of the policy discussion showed a strong focus on Malthus and market solutions to economic problems, so it's likely that large parts of Parliament were genuinely just wrong. So if you buy that, the situation looks more like a misguided intent to do good, rather than a guided attempt to do bad.\n\n[Continued in Reply](https://www.reddit.com/r/AskHistorians/comments/pqjz96/the_irish_potato_famine_18451852_while_often/hddihwt/?utm_source=reddit&utm_medium=web2x&context=3)",
            "title_similarity": "0.83183277"
        },
        {
            "id": "hdtrfd7",
            "score": 2,
            "text": "Very thorough answer!",
            "title_similarity": "0.0031439324"
        }
    ]
}