{
    "On 2 October 1968, the Mexican army killed hundreds of student protesters, 10 days before the Mexico 68 Olympics began. Why is this event mostly ignored in English-language material when discussing the global '68 protests, or even student massacres in general (as opposed to Tiananmen or Kent State)?\n": [
        {
            "id": "hewq53j",
            "score": 1,
            "text": "Welcome to /r/AskHistorians. **Please [Read Our Rules](https://www.reddit.com/r/AskHistorians/wiki/rules) before you comment in this community**. Understand that [rule breaking comments get removed](https://www.reddit.com/r/AskHistorians/comments/h8aefx/rules_roundtable_xviii_removed_curation_and_why/).\n\n#Please consider **[Clicking Here for RemindMeBot](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps://www.reddit.com/r/AskHistorians/comments/pyux4z/on_2_october_1968_the_mexican_army_killed/%5D%0A%0ARemindMe!%202%20days)** as it takes time for an answer to be written. Additionally, for weekly content summaries, **[Click Here to Subscribe to our Weekly Roundup](https://www.reddit.com/message/compose/?to=AHMessengerBot&subject=Subscribe&message=!subscribe)**.\n\nWe thank you for your interest in this *question*, and your patience in waiting for an in-depth and comprehensive answer to show up. In addition to RemindMeBot, consider [using our Browser Extension](https://www.reddit.com/r/AskHistorians/comments/d6dzi7/tired_of_clicking_to_find_only_removed_comments/), or getting the [Weekly Roundup](https://www.reddit.com/message/compose?to=subredditsummarybot&subject=askhistorians+weekly&message=x). In the meantime our [Twitter](https://twitter.com/askhistorians), [Facebook](https://www.facebook.com/askhistorians/), and [Sunday Digest](https://www.reddit.com/r/AskHistorians/search?q=title%3A%22Sunday+Digest%22&restrict_sr=on&sort=new&t=all) feature excellent content that has already been written!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AskHistorians) if you have any questions or concerns.*",
            "title_similarity": "0.36721826"
        },
        {
            "id": "hexs0tt",
            "score": 1089,
            "text": "Tiananmen Square is probably the most apt comparison, since you have in both cases:\n\n- mostly student-led protest happening in near proximity to an event that would attract world journalists\n(Olympics in the case of Mexico, a visit by Gorbachev in the case of China)\n\n- enthusastic suppression of information by the government\n\nWith China, there were international, around-the-clock cameras. Bernard Shaw from CNN noted \"You could say that that was the beginning of the ‘CNN effect'\" -- that is, where 24-hour news became a real thing influencing world events.\n\nIn the case of Mexico, there was the _potential_ for live coverage -- geostationary satellites allowed for broadcasts over the entirety of the Earth by 1967 (the year before the Games). ABC did 44 hours live, and Japan, Australia, and\nboth Western and Eastern Europe did live broadcasts as well. The Olympic Games had the largest audience for\n*any* event up until that time.\n\nHowever, these cameras weren't running yet when the Tlatelolco Massacre occurred; while there were journalists there (some with still cameras)\nyou didn't get anything like the vivid \"CNN effect\" that would happen 21 years later. On the other hand, when John Carlos and Tommie Smith\ngave the Black Power salute -- more remembered now than the athletics -- it was during the medal ceremony, right on camera, potential audience in the hundreds of millions. It was not so easily forgotten.\n\nSo if you'd like the simplest answer, that's an easy one to point to, but it doesn't quite explain _everything_, especially since the ruling party (PRI) eventually lost power when Vicente Fox won the elections in July 2, 2000, and those who cared still wanted answers.\n\n>The 1968 Olympics\nin Mexico City stand out from other tragedies because the ruling Mexican Institutional\nRevolutionary Party (PRI) used the international attention of the Olympic games to justify\nintimidating student opposition groups.\n\n>-- Lauren Harper of the National Security Archive\n\n[The following has a swear word in Spanish used in context.]\n\nThe events of the massacre unfolded on the 2nd of October, 1968, 10 days before the opening ceremony of the Olympics.\n\nIn Tlatelolco (a suburb of Mexico City) a student demonstration was unfolding at the Plaza of the Three Cultures. A month before, President \nGustavo Díaz Ordaz had in his state of the nation speech accused the students of attempting to \"prevent the celebration of the Olympic Games\" and\ndeclared that the Mexican government would \"do what we have to\" in order to stop the protests.\n\nThe students felt like the PRI had betrayed the promise of the revolution of the 1910s, and no longer cared about social justice.\nThroughout Mexico, while some students had volunteered to help with the games, others thought to use the opportunity of the world stage\nto spread their message -- the local media in the 1960s, unfortunately, was heavily controlled by the government (i.e. some violence in protests already were\nblamed on students even when instigated by the riot police, the granaderos). Similar suppression techniques, the logic ran, wouldn't work on international\njournalists.\n\nThe Plaza on the 2nd gathered thousands; generally cheerful rather than foreboding, despite government helicopters flying overhead. Speeches began a little before 6 pm.\n\n6:10 pm, hell broke loose. Flares shot up at a nearby church. Shots began firing.\n\nThis was Operation Galeana, run by General Marcelino Garcia, with the objective of\narresting the leaders of the movement, \"without dead or injured\".\n\nThe Batallón Olimpia (plainclothes except for white gloves or handkerchiefs on their left hands, \nthey were dubbed _blancos_) was intended to do the arrests, with prisons cleared of space just\nfor the task.\n\nThe shooting was not part of the original plan.\n\nOn a nearby balcony, the _blancos_ had entered up metal stairs:\n\n>Now we are going to give you your revolution, you hijueputa!\n\nA boy, approximately fifteen, tried to get a microphone to warn people in to plaza, but he was shot. People were lined up and clubbed with pistol butts. Students and reporters alike were clubbed.\n\nGunfire began to erupt from _blancos_ on the Plaza towards the balcony, and one of them tried to call\n\n>Don't shoot, we're wearing white gloves!\n\nbut none had any method of signaling that they were being attacked by their own group. Snipers were also in position shooting from upper floors.\n\nThe crossfire lasted for about half and hour. Some students found soldiers who were as upset by the bloodshed as they were. It turns out,\nat the time the shooting started, General Jose Toledo -- who was coordinating from the Plaza -- was announcing over a megaphone to the students\nto clear peacefully, but only several minutes later he was shot, and the soldiers under his command began firing randomly.\n\n>Then someone else was hit and there was some terrible groaning. The girl was slumped across the floor and I saw blood which appeared to be at the side of her temple. I prayed, I put my arm round the Mexican journalist next to me. I kept asking him what was going on, and I still had it firmly confirmed in my mind that I was with the students who were fighting against the militia.\n\n>The worst moment came when someone with a machine gun high up was spraying bullets down, and the firing line was catching the edge of the walls and sending up sparks and sprinkling the corner where I was covered in cement and concrete chips. A girl student wearing slacks was hurt, but whether she got a direct hit or was caught from a ricochet I cannot say.\n\n>-- [John Rodda, writing for the Guardian on October 3rd](https://www.theguardian.com/cities/from-the-archive-blog/2015/nov/12/guardian-mexico-tlatelolco-massacre-1968-john-rodda)\n\nDespite the presence of many journalists, there was mass confusion, and the official government line --\nthat there were Communist infiltrators amongst the students who caused the violence, and the first\nshooting began when snipers started shooting at the helicopters -- was not necessarily believable, but\nit was hard to sort out the truth of what happened, other than hundreds of students died. (Note\nRodda's story: \"the students who were fighting the militia\".)\n\nThis -- plus very tight control over the local media -- allowed the PRI government to deflect blame. Brundage, president of the International Olympic Committee, was already blasé about\nthe events (\"We live in that kind of world\") and the Mexican government managed to\nassure the Olympic Organizing Committee that this was a \"police action that\nhad nothing to do with the Olympic Games\". The Olympics started, and there was a wash of other news, most of it covered by live cameras in some form, allowing the events 10 days before to pass by the consciousness of the world.\n\n...\n\nThe final complication -- part of the reason why, even now, this isn't as well-known a story -- is that various documents and information have only been unearthed recently, and it still is an open question who to blame. You see, according to some admittedly uncertain testimony, there were infiltrators amongst the _blancos_ themselves -- a group of ten agents from the Presidential Staff placed by General Oropeza, who supposedly had orders from ... someone ... and who, unlike those of Operation Galeana, had orders to shoot machine guns, not to arrest peacefully.\n\nThe culprit most obviously would be President Díaz Ordaz himself -- and he is the one most commonly blamed -- but it is possible the orders came from his Minister of the Interior (Luis Echeverría) or even General Oropeza himself.\n\nThe official government photographer heard the President say \"They fooled me! They fooled me!\" muttering to himself a few days later -- did he approve the use of agents but assumed for a different purpose? Echeverría was incidentally arrested in 2006 regarding his role in the massacre, that \"he surely had knowledge\". There is one other person potentially of blame, that of the President of the IOC himself, Avery Brundage, who had sent a warning message in September that any more trouble could cause the Olympics to be called off. His level of complicity is still in question, although he has been accused of not only knowing of the likely massacre ahead of time but even encouraging it.\n\nThis confusion and indirection (and some still-yet-to-be-released documents from Mexico) make it hard to reconstruct the complete story and make it better known to the world, but there is still time for it to happen (after all, many only learned of the 1921 Tulsa Massacre quite recently).\n\n...\n\nBlutstein, H. (2021). *Games of Discontent: Protests, Boycotts, and Politics at the 1968 Mexico Olympics*. McGill-Queen's Press-MQUP.\n\nMurtha, R. T. (2018). *\"When the guns boom\": the 1968 Olympics and the massacre at Tlatelolco* (Doctoral dissertation).\n\n[add, since it came up in the comments: This is something that wasn't known internationally until recently so isn't relevant to the main answer, and it was banned in Mexico for nearly the entire time the PRI was in power (only shown in secret), but there is a documentary, *El Grito*, with footage from the summer. It uses stills for a lot of the massacre section, including a series a snapshots taken of the flares when they went up, but there is some footage -- Leobardo López Aretche, the documentarian, was arrested right at the Plaza -- and viewer discretion is very much advised.]",
            "title_similarity": "0.72376084"
        },
        {
            "id": "hexsh7b",
            "score": 2,
            "text": "[removed]",
            "title_similarity": "0.038314708"
        },
        {
            "id": "hf082b7",
            "score": 6,
            "text": "Follow up. Are there any estimates on how many students/soldiers died?",
            "title_similarity": "0.5984932"
        }
    ]
}