{
    "META - As much as I've enjoyed r/AskHistorians for the past 10 years, I firmly believe that this subreddit should make a better effort to redirect people seeking more of a skin-deep understanding to subreddits more conducive to casual discussion. This would be a huge benefit to all.\nAs a teacher, there is a principle that comprehension is often more important than accuracy, and in some cases an oversimplification or other heuristics is a great starting off point in learning something new.  And as you learn more, the corrections in accuracy become more and more important. \n\nSince most of you are academic writers, I understand that there is a very strict mindset one must have in order to be as accurate as possible (lest you be destroyed by your colleagues).  This is why the intense policing of this sub is so incredibly scrutinized, and the result is it does provide for some of the most comprehensive and exhaustive answers I've seen on the internet.  \n\nBut where do people go who just want to ask a question where they might not know what information it is they're seeking?  If I'm trying to get an understanding of what kind of life a Greek mercenary that fought for Xerxes would have been after the Persian invasion was thwarted, I don't even know what exactly it is I'm trying to learn.  And that's where this subreddit seems to break down, and instead the focus turns on only answering questions that have a clear answer. Because after ten years, every one of these kinds of questions has already been asked and answered.\n\nI think this subreddit should actually try to reach out to subs like r/history or r/AskHistory (at the very least, link them in the FAQ, wiki, or about section so casual buffs can head there), or work with them to both ensure misinformation isn't being spread on theirs and redirect academic answers to here.\n\nSomething tells me, however, that at least one historian will reply with, \"We don't care about raising general knowledge and interest in history. That's not the job of a historian, and if you don't like it, you go somewhere else.\" But that's kind of what I mean: *where should we go to start?*\n\nTL;DR This sub is perfect for what it wants to be, but for the sake of raising standards of the general public and the quality of comments in this sub, please work with the other history subreddits to help build the knowledge of all or at least redirect people.": [
        {
            "id": "hgczzou",
            "score": 1,
            "text": "Others have addressed more than sufficiently the underlying misconceptions of this post so I won't pile on. However, as META threads do often bring in people with thought on sub content, I do want to forcefully plug the AskHistorians Newsletter. It is a once-a-week curated mailer that sends highlights of the past weeks content right to your inbox! All answers, no graveyards!\n\nTo sign up, just [Click Here](https://www.reddit.com/message/compose/?to=AHMessengerBot&subject=Subscribe&message=!subscribe) and send the message. Feedback we have so far is pretty much universal in improving the browsing experience of the subreddit, so don't hesitate!\n\nAlso, of course, I'd be remiss not to plug the upcoming AskHistorians 2021 Digital Conference which starts next week. [Learn more at the Conference home page](https://www.askhistorians.com/2021-digital-conference) and also don't miss your chance to [sign up for the live keynote](https://us02web.zoom.us/webinar/register/6516340505394/WN_cNNfK79IQWeTqj5O9SnVAQ)\n\nAlso we JUST announced the Networking schedule! [Check it out here!!!](https://www.reddit.com/r/AskHistorians/comments/q6q88l/registration_is_open_for_askhistorians_digital/?utm_medium=android_app&utm_source=share)",
            "title_similarity": "0.6870085"
        },
        {
            "id": "hgewlbh",
            "score": 0,
            "text": "My biggest problem is that questions simply don't get answered. I'd rather get a skin-deep understanding than no understanding at all.",
            "title_similarity": "0.42932898"
        },
        {
            "id": "hgd0t9h",
            "score": -13,
            "text": "Out of any sub I visit, this one always has the most deleted comments",
            "title_similarity": "0.32628715"
        },
        {
            "id": "hge0d0m",
            "score": 3,
            "text": "If you really wanted to improve this subreddit you would find a way to prevent a post from being upvoted until it has an acceptable response.  99% of the time what happens is that I will see a post in my feed, be really interested, see plenty of upvotes and 11 comments, open it up.... nothing.  11 comments all have been removed.  By the time it gets answered it is no longer showing up in my feed and, quite frankly, I have forgotten it.  It is actually really rare for me to see a question answered on here.",
            "title_similarity": "0.6677186"
        },
        {
            "id": "hgd8d1k",
            "score": -17,
            "text": "The responses in this thread, by mods and others, do not fill me with enthusiasm.\n\nYou have a good point. The moderation is what it is, but good lord are there some snooty, touchy folks playing in this particular sandbox.",
            "title_similarity": "0.45074862"
        },
        {
            "id": "hgfut7a",
            "score": -7,
            "text": "As a historian, I find the attitude of the mods and most of the sub to be dismissive and quite frankly rude. This sub reminds me of “those” students who most of our class would roll our eyes at because they were so full of themselves and devoid of any understanding of social and academic ettiequte.  Just my 2 cents.",
            "title_similarity": "0.51125"
        },
        {
            "id": "hge0jnu",
            "score": 5,
            "text": "YES PLEASE.\n\nthe few times I asked questions on this sub, I read the rules, worked as hard as possible to articulate the question I had as best as possible (spent at least half an hour trying to figure out how to ask what I wanted to know in the manner I was most curious about), only to have it removed. Read the reasons why it was removed, worked on the post again, and... removed.\n\nI get that this is supposed to enable historical accuracy and quality content, but it just left me bummed out and made me feel dissuaded to learn history. As my question wasn't answered, and it had still been stewing in my head, four months later I finally sent the mods a message regarding the matter and they explained why it doesn't fit. I never did get that question answered - I tried on one of the sister subs but they didn't really answer what I was asking about and at that point I just gave up.\n\nI get it, I really do. But it leaves a sour taste in your mouth, when all you wish is to learn but you don't know how",
            "title_similarity": "0.69862187"
        },
        {
            "id": "hgd7ey7",
            "score": -9,
            "text": "There are so many times where I coulf get someone pointed in the right direction or give them a basic foundation in general knowledge about their question but don't answer because I havent got the time to defend or source my answer. I feel this post.",
            "title_similarity": "0.5318346"
        },
        {
            "id": "hgd0oi7",
            "score": -28,
            "text": "This sub has great content, and I do not mean to offend the amazing writers here when I say this. It 100% reminds me of my worst college professors and their disconnect between the lay people and the academics. If you don't ask a question in the right way you are removed. If you ask a followup in the wrong way, removed. If you even discuss an answer in the wrong way, gtfo. It comes off as snobbery to me more so than an effort to keep the sub high quality. The mods and writers here are amazing people but it is definitely a microcosm of the impenetrable academic community I grew to hate during my time at university.",
            "title_similarity": "0.71462387"
        },
        {
            "id": "hgew4kr",
            "score": -2,
            "text": "I wonder if (and this would be a question of what capabilities Reddit has rather than this sub in particular) it would be possible to flag an answer as inadequate without deleting it, or maybe to hide it for a week or a similar period and then unhide it if no better answer comes along.  I think most seekers would prefer an educated guess or a pointer in the right direction to no answer at all, and the right now the policy seems to be a perfect answer or no answer.  Obviously this is a great sub, and I know most comments deleted are very bad and well short of even a halfway standard, but that is my two cents.",
            "title_similarity": "0.66795576"
        },
        {
            "id": "hgd0h2y",
            "score": -18,
            "text": "While I am generally very happy with the answers on this sub, one related problem that I see is an explicit ban of concise answers. At least some of the questions on this sub can be answered in just a few sentences.\n\nFor example, today's [question about Columbus](https://www.reddit.com/r/AskHistorians/comments/q6ay21/did_christopher_columbus_do_all_that_bad_stuff/) could be answered relatively shortly: \"Columbus was criticized already by his contemporaries X and Y for being cruel and dishonest. That said, there were other explorers of his time like Z and T who were just as bad, so he wasn't really such an outlier\". (This is just an example, not the actual answer.)\n\nI am definitely not saying that such an answer is _better_ than a normal /r/AskHistorians answer, but such a short answer is better than no answer at all (provided it is generally correct and refers to some sources). Besides that, in some cases I found that I am interested in some question and would like to know a TLDR answer but not interested enough to read a multi-page essay on the topic.",
            "title_similarity": "0.6794255"
        },
        {
            "id": "hgctf2u",
            "score": -56,
            "text": "I agree.\n\n&#x200B;\n\nThe last few days I've been thinking about unsubscribing to this sub because every thread I click on has some replies but they are always deleted and there's nothing of substance in the threads.",
            "title_similarity": "0.49763882"
        },
        {
            "id": "hgd0znm",
            "score": -26,
            "text": "Excellent post, thank you for making it!",
            "title_similarity": "0.43636"
        },
        {
            "id": "hgdbwwt",
            "score": -23,
            "text": "You’re getting long winded responses about how it isn’t a problem. It’s absolutely a huge problem. Really good answers are deleted and leave questions unanswered regularly because they are great answers. This sub has a real problem that won’t get fixed because mods won’t acknowledge a problem. This issue is frequently brought up in other subs",
            "title_similarity": "0.6901156"
        },
        {
            "id": "hgcpyes",
            "score": 165,
            "text": "You are wrong on a number of different levels.\n\n>Since most of you are academic writers, I understand that there is a very strict mindset one must have in order to be as accurate as possible (lest you be destroyed by your colleagues).\n\nWe're not strict because we have a paranoid mindset influenced by being academics. Most of us on the mod team are not even in academia, and don't have PhDs! We care about history, and we want to see justice done to all topics.\n\n>But where do people go who just want to ask a question where they might not know what information it is they're seeking? If I'm trying to get an understanding of what kind of life a Greek mercenary that fought for Xerxes would have been after the Persian invasion was thwarted, I don't even know what exactly it is I'm trying to learn.\n\nFirst of all, there's nothing wrong with asking that question here. We get a lot of vaguer, \"what was life like for ... ?\" questions here, and they do get answered, with the caveat that they get answered \"sometimes\", as every type of question only gets answered \"sometimes\" - we have more askers than qualified answerers. Which brings me to a second point, relating more to your post as a whole than this tidbit: the major, ongoing problem that makes us remove comments is that they're uninformed. It can be more useful to a student to get a broad, comprehensible overview than something highly accurate, but if someone is just making up what they think life would be like for that Greek mercenary based on their video-game concept of mercenary life plus *Game of Thrones*, what do you gain? You could make up your own answer before even asking.\n\n>Something tells me, however, that at least one historian will reply with, \"We don't care about raising general knowledge and interest in history. That's not the job of a historian, and if you don't like it, you go somewhere else.\"\n\nThis is frankly ridiculous (and offensive) speculation on your part. The answerers on this sub put in an extraordinary amount of time to share knowledge and raise \"interest in history\". Why would we say that it's \"not the job of a historian\"?\n\nIf you just want to chat about history, there is always /r/history; if you want to ask questions and do not care about the quality or accuracy of the answers, there is /r/askhistory. We freely recommend them to users - we are not forcing people to stay here because of the lack of other history-centric subreddits. If anything, it's more likely that our users are familiar with the existence of /r/history, since it has *16 million subscribers*, more than ten times as many as us. It's also linked in our sidebar and in some of our macros, I'm pretty sure.",
            "title_similarity": "0.61714333"
        },
        {
            "id": "hge5l3x",
            "score": -11,
            "text": "People who come to the sub to learn often have their posts ignored or shot down with deletion or \"search older posts\" statements.\n\nI see it all the time and most of my attemts to seek information or wisdom here have ended the same way.\n\nPart of teaching is patience and guidance for those who have a genuine desire to learn",
            "title_similarity": "0.6684449"
        },
        {
            "id": "hgdw2ys",
            "score": 6,
            "text": "Maybe do an r/askhistoriansofftopic the same way r/legaladvice has a sister sub. It allows the rest of us distinctly non-expert fans have a general discussion without harming the original intent of r/askhistorians. Might make it more interesting for everyone.",
            "title_similarity": "0.62506807"
        },
        {
            "id": "hgfywc1",
            "score": -4,
            "text": "I hardly ever see interesting questions with replies that haven’t been deleted. I keep meaning to unfollow but I haven’t because I always hope to see something cool.",
            "title_similarity": "0.563442"
        },
        {
            "id": "hge35ju",
            "score": 3,
            "text": "Just like many subreddits before it, history repeats itself.",
            "title_similarity": "0.41647798"
        },
        {
            "id": "hge7peo",
            "score": 2,
            "text": "I do not know how to. My knowledge is in European genealogy. But my resources are not in English. \n\nI DO want to make people enthousiastic about history (and often their roots). \n\nI just mainly tell a quick story because my words do not get believed anyway without sources; but my sources are in 1500 Dietsch? (or other old Germanic languages?). And if I post them I get downvoted too because they are not in English? Yeah sorry but noone spoke modern English in Europe in 1500.. or US.. or anywhere actually :') Or before that..\n\nAlso: I do not get your question. There is evidence how Greek mercenary's lived. In general. Not specific after they fought for who. There is evicende though how people lived áfter the Persian war. But they are not mercenaries. There is just not 1 clear answer often. Just some pieces of a puzzle.",
            "title_similarity": "0.5352471"
        },
        {
            "id": "hggh3rk",
            "score": -6,
            "text": "I can’t even count the amount of times I’ve read a compelling question on the front page and clicked through, only to disappointedly find a thread with 100% of the dozens of comments having been deleted. I don’t know why I even bother subscribing to this sub anymore honestly, that’s been my experience with it more often than not.",
            "title_similarity": "0.56094384"
        },
        {
            "id": "hgdgcgx",
            "score": 34,
            "text": "AskHistorians is, for me, a small shining example of what the internet can be (and what the optimists among us once thought it could grow into). It is eye-opening and rich in entertaining detail about topics both large and small, arguably the most rigorous source of historical information most readers will encounter, and somehow completely free and open to anybody to participate. \n\nAnd somehow, *this* is the page you choose to gratuitously insult and demand that it cater to your whims? You are aware that the people here are doing it for free, right? That one of your stated goals of 'fighting misinformation' is in tension with your other stated goal of fostering 'casual discussion'? That you have not just r/history and r/askhistory but *the whole internet* to ask any question you want, and discuss opinions ad nauseum? That \"what kind of life a Greek mercenary that fought for Xerxes would have...\" is very much like many questions asked and answered here?\n\nThe contributors here are doing us all a grand favour; let's be grateful and enjoy AskHistorians for what it is.",
            "title_similarity": "0.62771153"
        },
        {
            "id": "hgcsgi3",
            "score": -89,
            "text": "Yes, but that would take the joy out of it for the mods.  \n\nSummarily destroying first-person accounts of historical events and forcing their views on discourse on others - THAT'S how you run a sub.  \n\nHow many great-grandfather's written accounts on here have been destroyed because that doesn't fit the rules?  \n\nA couple of years ago, a 90+ year old D-Day vet told us that he had never discussed his experiences on that day, then wrote out a hugely long and detailed account of his experiences. Must have took him HOURS.  \n\nGone. Deleted.  \n\nMight have been his last words . .   but that is just TRASH to a \"historian.\"",
            "title_similarity": "0.56926835"
        },
        {
            "id": "hgee8qq",
            "score": -14,
            "text": "So this post is being heavily upvoted... but all of the comments seemingly in support of it (and most of OP's comments) are being heavily downvoted.... and most of the comments telling OP why he is wrong are heavily upvoted... Weird. Probably draw some conclusions from that. Not sure exactly what, but something.",
            "title_similarity": "0.53730947"
        },
        {
            "id": "hgcx1p0",
            "score": 32,
            "text": "[/r/ImNotAHistorianBut ](https://old.reddit.com/r/ImNotAHistorianBut/)",
            "title_similarity": "0.33062574"
        },
        {
            "id": "hgecrfv",
            "score": -9,
            "text": "As someone who loves this subreddit, I agree with you fully. I just wish sometimes there was a Tl;Dr at the beginning (or the end), so I understand the basis and I can then understand the details.",
            "title_similarity": "0.6948952"
        },
        {
            "id": "hgdeovt",
            "score": 78,
            "text": ">Something tells me, however, that at least one historian will reply with, \"We don't care about raising general knowledge and interest in history. That's not the job of a historian, and if you don't like it, you go somewhere else.\" But that's kind of what I mean: where should we go to start?\n\n...No historian would say that, at all, ever.  It's such an absurdly and unnecessarily provocative statement that it's hard to imagine you are interested in good faith conversation...",
            "title_similarity": "0.42979658"
        },
        {
            "id": "hgel4wt",
            "score": 5,
            "text": "r/askHistorianish",
            "title_similarity": "0.21318775"
        },
        {
            "id": "hgfua4y",
            "score": 5,
            "text": "Not going to pretend to read the whole thread.\n\nJust want to mention that it's a running joke in my house about my excitement when something  I'm interested shows up on Ask Historians, with the almost inevitable lack of anything that might yield an answer. \n\nIt's a Charlie Brown and Lucy football kind of joke, and the good answers that eventually show sometimes make up for the disappointment.",
            "title_similarity": "0.52819246"
        },
        {
            "id": "hgcl19i",
            "score": 118,
            "text": "The mods are usually on META questions like ducks on a junebug, but I did feel I should reply to this:\n>But where do people go who just want to ask a question where they might not know what information it is they're seeking? \n\nA book. Or a class- maybe taught by you. We can answer some specific questions, but we can't teach a course. We do, however, often recommend books. So, if someone asked, is there a good book I can read about Xerxes' Greek mercenaries, someone here might know of it. Or it might already be on the Booklist.",
            "title_similarity": "0.62172437"
        },
        {
            "id": "hgg696r",
            "score": 13,
            "text": "These are the worst posts. \"I wish this sub was like a different sub that already exists.\" Then fuck off to those subs! You already know about them, why are you here?",
            "title_similarity": "0.4229928"
        },
        {
            "id": "hgeuhar",
            "score": -6,
            "text": "I like this idea! I’ve also had an idea for a while that each post could have a sticky comment, and quick shallow answers could be given as a reply to that comment.",
            "title_similarity": "0.64960265"
        },
        {
            "id": "hgcoutz",
            "score": 91,
            "text": "[deleted]",
            "title_similarity": "0.03103586"
        },
        {
            "id": "hgdgj00",
            "score": -16,
            "text": "I support use of automod to create a 'casual users chat'.  It keeps your history discussion pure, and let's the plebians like me play around in our lil sandbox and throw memes or stupid questions or etc.  \nThis website is all about interaction and discussion, and excluding 90% of the user base from that discussion doesn't make sense.  Give them some, just a little, room to play as well",
            "title_similarity": "0.65105164"
        },
        {
            "id": "hge6jsv",
            "score": -19,
            "text": "[deleted]",
            "title_similarity": "0.03103586"
        },
        {
            "id": "hgcmcbg",
            "score": 89,
            "text": "I sort of agree with you as I  would really appreciate a more consistent citation requirement and format.  However without a vetting process and a similar commitment to moderation in the linked subreddits I think it could end with misinformation presenting itself with the AskHistorians seal of approval.",
            "title_similarity": "0.6919311"
        },
        {
            "id": "hgkrlnl",
            "score": 2,
            "text": "Guess what?! I asked [a question about the Greeks who served Xerxes ~~in the Peloponnesian War~~ ](https://old.reddit.com/r/AskHistorians/comments/q717wg/what_was_life_like_for_greek_mercenaries_who/) and /u/Trevor_Culley answered in less than 48 hours!\n\n\nEdit: Had second thoughts on how to spell 'Peloponnesian'.",
            "title_similarity": "0.46405953"
        },
        {
            "id": "hgcxlnl",
            "score": 95,
            "text": "This is the best quality sub on reddit, by an order of magnitude; the standards and the quality are incredibly high. This is a rare and valuable thing. Change all the other subs instead, to be be more like here.",
            "title_similarity": "0.7048019"
        },
        {
            "id": "hgcxxnp",
            "score": -65,
            "text": "Agree these dorks take all the fun out if history.",
            "title_similarity": "0.5256901"
        },
        {
            "id": "hgdrbr1",
            "score": -40,
            "text": "Lol. \n\nAll you have to do is copy paste a few paragraphs from wiki with the sources and suddenly you are a “historian”.",
            "title_similarity": "0.5308688"
        },
        {
            "id": "hgdw7wo",
            "score": 6,
            "text": "If the goal of this post is to \"raise standards of the general public\" I'd like to piggyback one suggestion - maybe a sidebar link could include some resources.\n\nHow can one approach critical thinking about history like a trained historian?  \n\nI totally understand critical thinking.  I totally understand the concept of history.  I understand things like corroborating sources.  I do not understand anything else, or how this looks in practice, and I would very much like to.  Even if I'm not doing the research and generating scholarship myself, it would help me understand when someone is presenting a pretty thin argument from a historian's perspective.",
            "title_similarity": "0.71044505"
        },
        {
            "id": "hgh0sxh",
            "score": 7,
            "text": "I appreciate the well thought out nature of your post, but I disagree.  \n\n\nMost responses on this sub are absolutely digestible/accessible assuming a reasonable level of literacy and some effort on the part of the reader. The sub welcomes clarification questions and the responder will often take the time to respond personally. I don’t think there’s a big problem to solve.  \n\nI enjoy other history subs (and I respond more often on them than I do here which is reflective of my credentials or lack thereof). But there is a consequence to less strict standards, and that’s poorer quality contributions and a low level but persistent volume of misinformation. That’s fine too, but if this sub were to promote those subs it doesn’t just legitimise them - it potentially undermines the credibility of this one.  \n\nTLDR: I go to other history subs for when I can contribute a basic response to someone (safe in the knowledge that it’s better than what they currently know), or because I want to peruse a lively and fairly casual discussion - *infotainment*, basically.  \nI come to this sub if I want extremely well sourced and argued content - *information*.  \n\nThere’s a place for both, but they are different needs and anything which might conflate the two isn’t a good thing.",
            "title_similarity": "0.7299988"
        },
        {
            "id": "hgcstuk",
            "score": 277,
            "text": "I’m also a teacher but I disagree. I come here for academic answers and personally it helps keep me connected with the academic world in a non formal sort of way. I appreciate the niche the subreddit fulfills and I would personally be unhappy if I saw the answers being translated to fulfill a vernacular. I do appreciate your opinion though and you bringing this up. It’s definitely worth a conversation!",
            "title_similarity": "0.742896"
        },
        {
            "id": "hgdxr53",
            "score": 54,
            "text": "I'm genuinely very confused by the requests for casual discussions on this sub. The purpose is quite literally in the name: ask *historians.* There are hundreds upon hundreds of other ways to get a cursory view of a historical topic via the internet, and several other places to do so on reddit, but a dedicated space to ask random questions and get detailed, well-sourced answers is nowhere near as easy to find! When I open a thread here, I would rather see a comment graveyard and hit the \"save\" button and check back later for an actual answer than see dozens of joke comments and a highly upvoted but obviously flawed answer. \n\n\nThis format is just not conducive to casual discussion, and you know what? That's fine. There's tons of other places to talk about history but only one r/AskHistorians. Every time I come to this sub, I feel like I genuinely got something out of it, which is a truly rare phenomenon. If it takes heavy moderation to get there, so be it.",
            "title_similarity": "0.5842755"
        },
        {
            "id": "hgd78fm",
            "score": 117,
            "text": ">Something tells me, however, that at least one historian will reply with, \"We don't care about raising general knowledge and interest in history. That's not the job of a historian, and if you don't like it, you go somewhere else.\"\n\nI'm going to let you in on a secret- the historians who spend their time on Reddit are here BECAUSE they care about raising general knowledge and interest in history. Yeah, there are probably some tenure track professors who don't see public engagement as a part of their job, but those aren't the historians who answer questions online or help run an Internet forum.  Read the room that you're addressing- there is a community of moderators and flaired users that do a lot of work because we see public engagement as a crucial aspect of the historian's job. This is changing within the academic discipline too- to some extent, all historians need to be public historians.  We take this seriously, and that's why we strive to provide quality posts and answers that give people an understanding of history.\n\n&#x200B;\n\n>If I'm trying to get an understanding of what kind of life a Greek mercenary that fought for Xerxes would have been after the Persian invasion was thwarted, I don't even know what exactly it is I'm trying to learn. \n\nAsk this- *What was life like for Greek mercenaries that fought for Xerxes after the Persian invasion was thwarted?*\n\nWe allow follow ups and you can reach out to us through modmail if you need help formulating a question, so I don't actually know what the problem is that led to this META if its you not knowing how to ask things in the form of a question.\n\n&#x200B;\n\nTLDR- OP, don't be dismissive that the community here has a commitment to public history and please rate my rhetoric skills too.",
            "title_similarity": "0.55965686"
        },
        {
            "id": "hgguy7w",
            "score": 6,
            "text": ">Something tells me, however, that at least one historian will reply with, \"We don't care about raising general knowledge and interest in history. That's not the job of a historian, and if you don't like it, you go somewhere else.\" But that's kind of what I mean: where should we go to start?\n\nYou imply that the rules against non-expert answers are enforced so that gatekeeping historians can feel smug. But as a non-historian and casual reader, I like to think that if I ask a question, I will get a quality answer instead of a bunch of jokes and surface-level trivia from avid Wikipedia readers like myself.\n\nSo the rules are actually in service to the users asking the questions, not the people who take their time to answer them. I appreciate that.",
            "title_similarity": "0.5655976"
        },
        {
            "id": "hgep3ot",
            "score": 27,
            "text": "I'm a very casual reader here mostly because it's so interesting as to be an uncontrollable time sink. I can only let myself start clicking around when I have no other tasks to complete anytime soon. \n\nI don't know why I feel so defensive, but must admit I was pretty annoyed/offended on behalf of the regular contributors and mods at\n\n> \"We don't care about raising general knowledge and interest in history. That's not the job of a historian, and if you don't like it, you go somewhere else.\"\n\nEven an occasional visitor is pretty much smacked across the face with the explicit, articulated goals to the contrary. This is sooo not a historian circle jerk. Many people are working tremendously hard to provide an intellectually generous environment and it is evident.\n\nThe imagined characterization is just so off base.",
            "title_similarity": "0.6019148"
        },
        {
            "id": "hgfpifu",
            "score": 11,
            "text": "I think my crowning achievement in life is that I once answered a question on here and for a while it was the only response that wasn't deleted.  Then an hour or two later someone wrote a much better response.  Mine was still up but got nudged from the top comment podium.",
            "title_similarity": "0.7097739"
        },
        {
            "id": "hgd38yd",
            "score": 35,
            "text": "I am not a contributor to this subreddit as I am not a historian, but I love reading the responses to various questions that peak my interest. And the reason I love the responses is because the responses don't just attempt to narrowly answer only the question that was asked; they tend to provide extra information about context or related factors that influenced the main topic.\n\n> But where do people go who just want to ask a question where they might not know what information it is they're seeking? If I'm trying to get an understanding of what kind of life a Greek mercenary that fought for Xerxes would have been after the Persian invasion was thwarted, I don't even know what exactly it is I'm trying to learn. And that's where this subreddit seems to break down, and instead the focus turns on only answering questions that have a clear answer. Because after ten years, every one of these kinds of questions has already been asked and answered.\n\nWhile I do agree with the final sentence, in that there are many questions that people ask which have been answered before, the answer to the question in that paragraph is: here. This subreddit right here.\n\nI've seen threads posted where the OP didn't really know what they were asking about, but they tried their best to describe it anyway, and different people responded to provide a wealth of information that they thought related to the question. After that, it would be up to the OP to go through the answers and learn, and then if the information they were looking for isn't provided they can revamp their question using the new knowledge they've obtained.\n\nOn the other hand I've also seen posts that have no major replies, but I don't think that's a failing of the subreddit so much as a fact of life that some topics are unknown to the contributors here, since the contributors here aren't omniscient. They're well learned, but if someone wants to know \"Do we understand why the chinese volunteers to north korea during the korean war was composed by a lot of southern Chinese soldiers and not those from the north which were more acclimated to the harsh winters of the north?\" from here https://www.reddit.com/r/AskHistorians/comments/q6k8gm/do_we_understand_why_the_chinese_volunteers_to/, then the only way that OP is going to get a reply is if one or more of the contributors here actually know the answer.",
            "title_similarity": "0.6606362"
        },
        {
            "id": "hggocut",
            "score": 12,
            "text": "Just want to say this subreddit is fantastic. As a non student/non academic of modest financial means it gives me access to information that is usually behind a paywall. The hardcore moderation of the sub (by unpaid volunteers no less!) Ensures that what I read here is feels reliable and trustworthy. The multiple points of view on answers gives a nuance that I sorely miss these days when I read a proper history book. When I want shallow answers and broad strokes there is an absolute multitude of places to go for that all over the internet (that are usually easy to find without needing to be directed to them) and that simply isn't what I come here for.\n\nMy personal experience of using the sub has been incredibly fruitful. When asking a question about the use of disease weapons in the Korean war I was redirected to a great answer by Georgy_k_zukov that gave a definitive answer to a question that every other source on the internet seemed to find unanswerable. On another question I asked about ancient Persian literature I had to wait a a while for a response but eventually got a fantastic and detailed answer from Trevor_Culley as to why the question was unanswerable and although this was frustrating for me anything else would have been disinformation so I was grateful for it and discovering Culley's great podcast was a nice consultation prize. I suppose what I'm saying here is if I want casual discussion of history by non experts I'll talk to my mates at the pub. What I come here for is free access to professional historians.",
            "title_similarity": "0.67871857"
        },
        {
            "id": "hgfi6cv",
            "score": 12,
            "text": "well, you say you don’t know where to go for the casual skin deep analysis but you answer your own question in your post ; go to r/history or r/askhistory. \n\nI think that about does it. I could see them adding this as a disclaimer to the wiki as you suggest but beyond that I’m not sure I really can visualize what it is you’re suggesting. What does “reaching out to the other subs” even look like?",
            "title_similarity": "0.52044755"
        },
        {
            "id": "hge7hrs",
            "score": 14,
            "text": "I just want to say, this is the best moderated subreddit I've encountered. Without the quality of moderation the sub would be something very different.",
            "title_similarity": "0.62424076"
        },
        {
            "id": "hgcphb4",
            "score": 213,
            "text": "It's probably worth pointing out that a huge part of education is learning which questions don't have answers, and simply *not* giving glib easy answers to unanswerable questions is the best possible way to educate people about that.  \n\n\nPeople with questions often want the answer to provide them with a sense of understanding, or of \"betterment\", but often the answer is a very simple \"no one knows\" and people are usually disappointed by that, but honestly, the most important thing to learn is that this answer is *good,* it's an *exciting* answer.  \n\n\nThe fact that this subreddit does not give easy answers or direct to other material when a question isn't answerable is why I come here! Knowing what historians consider answerable is  *wonderful.* I feel I learn as much from that as I learn from the answers themselves.",
            "title_similarity": "0.7725349"
        },
        {
            "id": "hgej9q4",
            "score": 49,
            "text": "I'd like to add something to what my colleagues /u/SarahAGilbert and /u/Gankom have expressed.\n\nWhile we all know that the majority of reddit users are based in the US or other English speaking countries, not all of us are. When a native English speaker googles an historical question, they're going to receive information in English. Thing is, unless you know how to properly navigate a google search in order to avoid misinformation, chances are you're going to find sources written based on an entirely English-centric perspective. While that's all well and good for histories of English speaking territories, and while there is certainly a wealth of valuable and valid scholarship written in English about otherness and non English histories, the sad fact we need to come to terms with is this: there are a **lot** sources, scholarly but especially non scholarly ones that are based on misconceptions, preconceptions and confirmation biases, all of which stem from the deep wounds of epistemological colonialism.\n\nThat's where people like me and the many other contributors from non English speaking regions come in. Our work allows our readers to access scholarship written in the places you want to learn about, by people who understand the language perfectly and who can access, interpret and transmit the information contained in the sources in a way native English speakers, through no fault of their own, can't.\n\nTake Argentina's last military dictatorship, a topic a lot of people are interested in. If you Google \"Argentina's dictatorship\", the first result is a wikipedia article called \"Dirty War\". The most frequently asked questions all include the term \"Dirty War\" in them. So what's the problem with that? Well, we don't call it the \"Dirty War\", we call it the State Terrorism Period, because \"Dirty War\" is a term used by the dictators to justify perpetrating crimes against humanity for close to a decade. I'm actually presenting a paper in our Digital Conference next week about this particular issue.\n\nThis is just one tiny example that might help illustrate just how important the need to be careful about how we ask questions, how we \"discuss\" and \"debate\" history can be difficult if we only have access to a fraction of the academic consensus on a topic. The fact that every time I answer a question about Argentina's last dictatorship, I receive pushback from negationists that can go as far as threats against my safety, is precisely why encouraging casual discussion isn't such a great thing. As others have pointed out we do direct people to other subreddits, but what we do here matters.",
            "title_similarity": "0.6325528"
        },
        {
            "id": "hgd64wa",
            "score": 18,
            "text": "I get the want for something different! For my part, I really appreciate AskHistorians. I am not sure when I joined exactly, but it was at least five years ago. In that time, I've found the answers to be enjoyable, the moderation (frankly, in the current social media moment) to be inspiring, and I was personally delighted the couple of times I was able to give an answer.  I saw a commenter above mention how this community ties us back into academic spaces in a casual way, and I get value from that as well. This sub does what it does well, and as a result is a bit of a byword for moderated spaces. I'd hope for no changes that would reduce that success. It's a uniquely great resource, imo.\n\nfwiw, I am not sure the historian's impulse to be accurate is due to fear of being destroyed by colleagues. Nor do I think there's a lack of care about raising knowledge and interest in history among the profession, and I'd be surprised to see that kind of comment from anyone. Rather, I think that, like any professional, a historian wants to do their job well. I think that (plus the need to push back on the harmful potential of social media) is where the standards that make their sub excellent originate.\n\nI also think learners earnestly approaching topics in good faith don't need a lot of redirection. I haven't used the /r/history sub myself, but searching for history on reddit did turn it up as the first result, yeah? At the same time, I don't have a problem with linking to more casual subs for people who are asking in good faith but do need help finding resources—the child, as it were, who does not even know how to ask a question. Ta!",
            "title_similarity": "0.67411685"
        },
        {
            "id": "hgcz6zc",
            "score": 58,
            "text": "I have been reading this sub for about 8-9 years. There have multiple times, that a question on has been referred to r/AskAnthropology or r/asklinguistics with sometimes more or less of an answer to consider why the topic is more fitting to those subs.\n\nI am Regular Joe when it comes to academic history. If I have a question about history and I know this is the place to ask about this topic. Obviously my question might not be worded correctly since I might not exactly know exactly what I want to know. Often I have seen flairs trying to direct posters as well as I have been directed to word questions more accurately and/or ask at another sub.\n\nThe strict moderation policy is exactly why I love this sub. I can be safe in knowing that an answer on here is at least somewhat correct. At least compared to some other places ok the internet.",
            "title_similarity": "0.5990586"
        },
        {
            "id": "hgds14b",
            "score": 60,
            "text": ">\"We don't care about raising general knowledge and interest in history. That's not the job of a historian, and if you don't like it, you go somewhere else.\n\nAs a professional historian (i.e. a senior academic historian at a US university) that is *exactly* what I think my job is, and so would 100% of my departmental colleagues. I spend a lot of my own time writing for general audiences, giving public talks, and engaging K-12 teachers to help raise awareness of and interest in history.\n\nThat attitude might crop up here as a reflection of the generally poor quality of other subs. For example, I don't even subscribe to /r/history and have no interest in wading in there. I come to Reddit to be amused or to learn things, which I do in a range of other places; my sole reason to read (and respond) in /r/askhistorians is to promote and support an alternative to things like /r/history.  It's fine for what it is, but I have zero interest in reading or participating in discussions on a general level. I come here specifically to hear from people who are experts in their subfield/topic or for whom it's a personal passion so they know a LOT more than I might ever find with a casual search.\n\nPeople who have general knowledge questions or are just curious about history have the entire world of knowledge at their fingertips: use the library, search wiki, look at web pages. I come here to learn from people who have actually asked complex questions and have been answered by people who are familiar with the relevant literature and primary sources on the topic. Synthesis I can find elsewhere.",
            "title_similarity": "0.68641627"
        },
        {
            "id": "hgdpcbh",
            "score": 24,
            "text": "Others have pointed it out but it never fails to reiterate\n\nHistory's hard man.\n\nSome questions here could be answered reliably by an amateur if they really put effort in the answer and not just wrote what they know from memory\n\nSome other questions... are just unanswerable. Not because they are meaningless or stupid but because there are some things that are literally too vague to give an answer that isn't full of conjecture\n\nThere's also nothing wrong in saying \"look friend this question is hard to answer but here are some other answers that are related in topic and they might be able to give you a better idea\"\n\nPersonal example:I've recently asked a question because I spent a day walking for many kilometers, I was going to the church where supposedly the \"Vespri\" rebellion of Sicily started in 1282; that place was on the other side of where I was staying in Palermo, some 20km away.As I walked through the city, passing along castles and churches, I kept imagining what it would be like for a person back in the middle ages to take a long walking trip alone.\n\nSo I asked a question here, trying to be as specific as possible, but even then no one could give me an answer.  \nThat said, someone pointed me to another answer that, while not answering my question, made me aware of the fact that back then it would have been hard to walk for miles and miles without passing through a settlement",
            "title_similarity": "0.61888343"
        },
        {
            "id": "hgcphcm",
            "score": 1145,
            "text": "A few of your suggestions are already implemented—we regularly recommend r/AskHistory to users who want more discussion or want an answer but aren't necessarily interested in having it vetted for accuracy and we're also in regular contact with moderators of r/history (some folks are mods of both subs); we aren't in regular contact with the moderators of r/AskHistory, mostly because they take a very different approach to moderation than we do—theirs is a very hands off approach to moderation in which mis/disinformation is addressed (or not) through users via decentralized moderation (i.e., votes) rather than mod intervention. Both subs are listed in the sidebar as part of the history network of subreddits. \n\nI'm not an historian—I'm an information scientist who studies moderation, but I have a background in library and information studies. What you're describing in your second paragraph: \n\n>But where do people go who just want to ask a question where they might not know what information it is they're seeking?\n\nhas a name in LIS: Anomalous State of Knowledge (ASK)—you know you want to know something, but you don't know enough to be able to articulate it. This can make question asking (or searching for information in google) really difficult. Browsing (or looking through existing information) is a much better solution for people in the ASK state. Being a Q&A sub, this is a bit of a challenge and one that moderators and flaired members of the team address through the FAQ in the wiki, so that someone who wants to read through background information on Greek mercenaries can read through the existing answers and, ideally, ask their own question from there. Another thing moderators here do that's less visible because it tends to happen in modmail or in removed question chains is provide coaching on how to ask questions. For users who want a quick answer we direct them to the dedicated thread for short answers and try to prioritize answering those when we can. There are also a set of flairs who regularly respond to those kinds of questions too. \n\nThese are all initiatives undertaken by mods and supported by expert flairs to make sure our users have as many ways of getting the information they want while still maintaining the goals of the subreddit—to provide question askers with comprehensive, accurate, and trustworthy responses to their question. I guarantee that no one on the mod team is going to say: \"We don't care about raising general knowledge and interest in history\" because that's the foundational goal of the subreddit and the primary reason why members of the modteam dedicate hours of their time everyday to the community—I've written about that [here](https://old.reddit.com/r/AskHistorians/comments/a5j123/meta_im_back_with_the_final_post_summarizing_my/) and published more details [here](https://drum.lib.umd.edu/bitstream/handle/1903/25576/CSCW_Paper_Final_Final.pdf?sequence=1&isAllowed=y). \n\nThere are a few challenges of course—Reddit's design means that these efforts are harder to find (for a while, and perhaps still, the wiki wasn't available on mobile, which is where the vast majority of the sub's traffic comes from) and it all takes time and labour. Every time a moderator makes a visible comment they are always at risk of pushback (which is benign in intent, but can be stressful, particularly when it happens en masse) and at risk of abuse. So it's often a balance between wanting to do more and having the time and the emotional energy. Because some of the feedback requires specialist knowledge it's not simply a case of adding more moderators. Moderation is a lot of work and moderators are human. There's a ton of stuff that the team works on and does to address the issues you raise, it's just hard to get it out there and make sure people see it.",
            "title_similarity": "0.66334164"
        },
        {
            "id": "hgddal5",
            "score": 32,
            "text": "One thing I havent seen mentioned yet is that when a question is removed, the macro/blurb almost always suggests a better place to post it. This is almost always some of the other history subs, or more specific places like Anthropology or Linguistics. Sometimes its specific threads on here like the Short Answer or Friday thread. But even when something is removed we go out of our way to suggest another place they can go, and link the wider history or associated nets.",
            "title_similarity": "0.6290583"
        },
        {
            "id": "hgcpq6j",
            "score": 159,
            "text": "I think I understand where you're coming from, but it seems to me that questions posted on this sub that have a \"clear\" answer (the trivia type) are generally removed unless they're posted to the Short Answers for Simple Questions weekly feature. \n\nThere are links to related subs like r/AskHistory in the sidebar (at least, on old Reddit there are). This sub's mods regularly suggest reposting questions that violate this sub's rules on other history-related subs with less stringent guidelines. As they don't control the other history subs, there's not much more we can ask of them. \n\nAs an historian, it can be fulfilling to provide a short, simple answer sometimes, but that's not really the point of this sub. This sub is here to provide fleshed-out answers that engage with both primary and secondary sources and delve into the historiographical debates around issues. \n\nThe biggest problem with questions on this sub doesn't seem to be the asker not knowing what they are trying to learn but them failing to craft a clear, focused, and unambiguous question. So, \"what kind of life a Greek mercenary that fought for Xerxes would have been after the Persian invasion was thwarted\" is, in my mind (though I'm not an expert on Ancient Greece), an *excellent* question and one that will likely receive an answer. A bad question, in my opinion, would be: \"What was it like being a soldier in Ancient Greece?\"  \n\nThe first question is focused and answerable in less than 2,000 words. But the second might require years and several volumes to answer! I'm always amazed that users will ask such extraordinarily broad questions like this and expect an answer in under 24 hours. I'm even more amazed when another user actually attempts to answer them, keeping in mind we are generally anonymous and are not compensated for our efforts.",
            "title_similarity": "0.66098934"
        },
        {
            "id": "hgd7uoy",
            "score": 247,
            "text": "Just as a comparison if you want, there's another sub that was made to cross link exclusively AskHistorians posts that get answered. I often like to browse through the [comment queue for it](https://www.reddit.com/r/HistoriansAnswered/comments/), because it gives a remarkably accurate snapshot of the kind of things that get removed. Some are brief attempts at answers, some are crappy jokes, some are often full out denial of one sort or another.",
            "title_similarity": "0.6584022"
        },
        {
            "id": "hgglzkc",
            "score": 2,
            "text": "I’ve never heard of those subs, thanks.",
            "title_similarity": "0.059412956"
        },
        {
            "id": "hghedzl",
            "score": 6,
            "text": "There is a related subreddit tab to the right, and both r/history and r/AskHistory are on it. Not sure what else you expect them to do. Either you expect strict answers or you expect misinformation.  It's also a lot of work to expect someone to be in charge of two different subreddits, considering that it's a hobby for most.\n\nSecondly, I think what most people want is a discussion, with bad answers getting eventually eliminated and then the good answers to override the incorrect and the garbage. But reddit simply rewards the \"first answers\" too high, because most of the votes come in immediately when the question hits people's front page. So eventually, when a long and thorough explanation does arrive, which takes time as all good things do, it might have been already thought of as \"answered\" and it won't consistently have enough inertia to take over the others. So you have to eliminate these non-answers with extreme prejudice.\n\nNot to mention that the voting system isn't limited, and not everyone actually is focused on history when upvoting in these threads.",
            "title_similarity": "0.7713758"
        },
        {
            "id": "hk8vuf7",
            "score": 2,
            "text": "What if we had a casual Fridays?",
            "title_similarity": "0.2392951"
        }
    ]
}