{
    "Why didn't Norway's elite steal oil money? How did Norway manage to create and save its huge pension fund?\nThis may sound strange, but I am from Eastern Europe. \n\nAlmost all oil countries have weak economies. Why is it different in Norway? Were there any incidents of corruption in Government Pension Fund of Norway or attempts to steal oil money?": [
        {
            "id": "hl0d0hs",
            "score": 1,
            "text": "Welcome to /r/AskHistorians. **Please [Read Our Rules](https://www.reddit.com/r/AskHistorians/wiki/rules) before you comment in this community**. Understand that [rule breaking comments get removed](https://www.reddit.com/r/AskHistorians/comments/h8aefx/rules_roundtable_xviii_removed_curation_and_why/).\n\n#Please consider **[Clicking Here for RemindMeBot](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps://www.reddit.com/r/AskHistorians/comments/qw42pr/why_didnt_norways_elite_steal_oil_money_how_did/%5D%0A%0ARemindMe!%202%20days)** as it takes time for an answer to be written. Additionally, for weekly content summaries, **[Click Here to Subscribe to our Weekly Roundup](https://www.reddit.com/message/compose/?to=AHMessengerBot&subject=Subscribe&message=!subscribe)**.\n\nWe thank you for your interest in this *question*, and your patience in waiting for an in-depth and comprehensive answer to show up. In addition to RemindMeBot, consider [using our Browser Extension](https://www.reddit.com/r/AskHistorians/comments/d6dzi7/tired_of_clicking_to_find_only_removed_comments/), or getting the [Weekly Roundup](https://www.reddit.com/message/compose?to=subredditsummarybot&subject=askhistorians+weekly&message=x). In the meantime our [Twitter](https://twitter.com/askhistorians), [Facebook](https://www.facebook.com/askhistorians/), and [Sunday Digest](https://www.reddit.com/r/AskHistorians/search?q=title%3A%22Sunday+Digest%22&restrict_sr=on&sort=new&t=all) feature excellent content that has already been written!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AskHistorians) if you have any questions or concerns.*",
            "title_similarity": "0.39128822"
        },
        {
            "id": "hl7iyf8",
            "score": 600,
            "text": "I am sure that somewhere, a historian of Scandinavia is feverishly writing an answer on the history of Norwegian democracy, Norwegian checks and balances, and their role in guaranteeing the effective management of the Norwegian pension fund. In the meantime, I think it might be useful to think of this question from the perspective of histories of institutions. Can this question be approached by trying to understand why some institutions lead to comparatively better outcomes and other institutions have comparatively worse outcomes? \n\nWhile the short answer to the question is, “Not really and it leads to a lot of arguing” (we are, effectively, working with counterfactuals, which is a very difficult thing to do) those who have tried generally come to similar conclusions: Good institutions will succeed, bad institutions will not succeed. Norway, we can safely say, has effective institutions: Not just its pension funds, but its system of government, social safety net, and relations between key stakeholders like workers, private enterprise, and political as well as non-political associations. This means Norway would probably still be a prosperous country even without its natural resources, even though its economy would be very different. We can make direct comparisons: Sweden, Denmark, and even Finland, who have similar institutional setups and backgrounds to Norway (minus the oil-fueled pension fund) are similarly prosperous countries by western european standards (of course, they like all countries are beset with complicated histories and their own modern problems, but in general terms I think we can agree they these are prosperous countries with successful institutions). \n\nConversely, countries which are rich in natural resources but are not prosperous are instead often plagued by poor institutions. In other words, in all probability no amount of natural resources would be able to compensate for their institutional shortcomings.\n\nThis idea is called “Institutional Development Theory,” and while it’s not exactly a detailed formula that explains everything, it’s the best consensus that academia has come up with. \n\nYou might be interested in [this related discussion](https://www.reddit.com/r/AskHistorians/comments/5f5su8/why_did_western_europe_develop_at_a_faster_pace/dahugtr/) on economic development that I participated in a few years ago, which might shed some light on what generally constitute successful institutions and how they contribute to economic success.",
            "title_similarity": "0.72139084"
        },
        {
            "id": "hl1rqte",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.015898407"
        },
        {
            "id": "hl4t76o",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.015898407"
        }
    ]
}