{
    "Was Nancy Reagan really renown for performing oral sex in her days as a film actress?\nI understand that this question is rather uncouth, but in light of current events I have become curious as to the validity of rumors of Nancy Reagan's past sexual exploits that have been recently floating around Twitter and beyond. To my knowledge most of these rumors have their roots in Kitty Kelly's 1991 book *Nancy Reagan: The Unauthorized Biography*, but how much verifiable truth is there to the claims made in this book?": [
        {
            "id": "hoh0vwd",
            "score": 1,
            "text": "Welcome to /r/AskHistorians. **Please [Read Our Rules](https://www.reddit.com/r/AskHistorians/wiki/rules) before you comment in this community**. Understand that [rule breaking comments get removed](https://www.reddit.com/r/AskHistorians/comments/h8aefx/rules_roundtable_xviii_removed_curation_and_why/).\n\n#Please consider **[Clicking Here for RemindMeBot](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps://www.reddit.com/r/AskHistorians/comments/rfz7ek/was_nancy_reagan_really_renown_for_performing/%5D%0A%0ARemindMe!%202%20days)** as it takes time for an answer to be written. Additionally, for weekly content summaries, **[Click Here to Subscribe to our Weekly Roundup](https://www.reddit.com/message/compose/?to=AHMessengerBot&subject=Subscribe&message=!subscribe)**.\n\nWe thank you for your interest in this *question*, and your patience in waiting for an in-depth and comprehensive answer to show up. In addition to RemindMeBot, consider [using our Browser Extension](https://www.reddit.com/r/AskHistorians/comments/d6dzi7/tired_of_clicking_to_find_only_removed_comments/), or getting the [Weekly Roundup](https://www.reddit.com/message/compose?to=subredditsummarybot&subject=askhistorians+weekly&message=x). In the meantime our [Twitter](https://twitter.com/askhistorians), [Facebook](https://www.facebook.com/askhistorians/), and [Sunday Digest](https://www.reddit.com/r/AskHistorians/search?q=title%3A%22Sunday+Digest%22&restrict_sr=on&sort=new&t=all) feature excellent content that has already been written!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AskHistorians) if you have any questions or concerns.*",
            "title_similarity": "0.5176633"
        },
        {
            "id": "hoik3m1",
            "score": 2055,
            "text": "There is not going to be an entirely satisfying answer to your question. I kick things off that way to be pretty clear. We can make fairly safe assumptions that Nancy Reagan didn't discuss this in her own memoirs, nor would it be something she would ever allow to be included in an *authorized* biography. As such, I am not really answering your primary question - \"Was she known for this?\" and focusing mostly on your sub question about verifiable claims in Kelley's book. We'll get to the claim itself, eventually, but it isn't as simple as pointing to what Kelley was using as sources as the book, as the book itself is pretty controversial.\n\nI would also digress briefly here to note the context for those confused about all of this. The claim comes from a 1991 book, but resurfaced this week on Twitter. Someone [tweeted a comparison of Nancy Reagan to Madonna, both in their 60s](https://twitter.com/classicallyabby/status/1468999557833007117), intending it to be a negative commentary on the latter's open display of sexuality. The most popular reply, in turn, [was a screenshot referencing this claim in Kelley's book](https://twitter.com/zachheltzel/status/1469408538019598336). I would stress though that if it is true... so what? If it is something she enjoyed doing, good for her. While quite a few people are making crass jokes that amount to slut shaming (How many of those people would refuse to accept oral sex though?) the intention in that reply is less to call out *Nancy* for enjoying sex than to call out the people holding her up as a paragon of their specific vision of domestic virtue, and pointing out that she was also a sexual person. If she wanted to give a bunch of blow jobs, good for her just like good for Madonna if she wants to be sexy at 60. Briefly putting on my mod hat here, but we've banned a bunch of people for comments in the above vein, and will continue to do so. (Edit: Yes, there is a second order intention there, it has been touched on below, but quite purposefully *not* the focus here, as the main point is to tell people to knock it off with the shitty, crass \"jokes\" in the comments).\n\n*Now*, as for the claim at hand. Like I said in the opening, we simply can't verify it completely without Nancy herself affirming it, so this is less a matter of getting to the very bottom of the matter than it is about going over source criticism and evaluating the *over all* reliability of Kelley's work. I'm going to start on the fringes here. Obviously there has been a *lot* of discourse on this, and a few historians have spoken up on the matter too. I would point, for instance, to Rick Perlstein - one of the absolute best historians out there working on modern American conservatism, can't recommend *Nixonland* enough - [offered a tweet](https://twitter.com/rickperlstein/status/1469750717632204802) that was nothing but the highest praise for Kitty Kelley as an historian, writing:\n\n>Can I just: Kitty Kelly? She did the ONLY review of my last book me convinced me the reviewer absorbed every  word. Her Nancy  biography is overwhelmingly researched, far better than  the many Reagan biographies that, say... [/] ..treat Reagan's memoirs like documents, even though they oft contradict each other. A certain sort of elite must despise her because she doesn't defer to polite consensus.\n\nPerlstein also provided what might be the closest thing to verification from Nancy herself in [tweeting out a summary of a telegram she sent to Ronald](https://twitter.com/rickperlstein/status/1469737078929989636):\n\n>When I've visited the Reagan Library, one of the telegrams on the display was from Nancy to an absent Ronnie on how much she missed his \"hot dog.\" (Like Rush used to say: I'm just reporting here, folks!)\n\nIts coded, to be sure, and you can make what you want of that, but certainly no one can be faulted in reading that as a very sexualized way, and one that brings in an oral element as well. It isn't enough to say with satisfaction just how accurate the claim is - both because it is done in metaphor, as well as the fact it speaks to a very different context with her husband only - but I expect for some that might be enough to decide there is some truth to the whole thing. But its only Twitter, of course, and doesn't get to the heart of the source itself, so from here I'll shift to Kelley's book. \n\n*Not* the book itself though, but rather reviews. As I said my focus here is on your sub question, and I think that going over the reception of the book is the best course to answer that. When the book came out it was *big* news, getting cover stories on national magazines, and sparking controversy, with sharp retorts from the Reagans themselves - \"*While I am accustomed to reports that stray from the truth, the flagrant and absurd falsehoods cited in a recently published book clearly exceed the bounds of decency*\" - due to the lurid nature of the book as a whole (oral sex is *hardly* the biggest thing in there), so as you might expect, there is no end to writing on the book from the time of its release, and we'll look at a few of them.\n\nI'll start with the review by Maureen Dowd, if only because the purpleness of her prose just jumps out at you, although it also includes a very interesting perspective. I'm quoting the opening paragraph in full because I enjoyed reading it so much:\n\n>Kitty Kelley's achievement is extraordinary. She has provided a reason for sympathy with Nancy Reagan. She has taken one of the shrewdest, coldest, most manipulative women in American politics, a woman who broke new ground in spousal power, and transformed her into a victim. Kelley is a mean and greedy writer, so drunk on sensationalism that she lacks compassion and understanding. Her subject was a mean and greedy First Lady, so drunk on power that she lacked compassion and understanding. Both believe that nothing succeeds like excess and pettiness. Both are soap opera vixens who accrued so many enemies in their climb to respectability and riches that the air around them is rancid with revenge. \n\nDowd goes on to note how the book is \"tawdry\" and \"in some spots, loosely sourced and over the top\", but she has quite a few positives as well, and she has an amusingly praiseful view of what the work ends up being in the whole when she writes the following about how *good* the book is:\n\n>Bob Woodward may have been able to document incontrovertibly every line of coke that John Belushi enjoyed, btit he was never able to capture the spirit of Belushi, or to explain the allure of drugs. Robert Caro's skills as an investigative reporter inspire awe, yet there is reason to believe that Means of Ascent, the second instalmeiit of his biography of Lyndon Johnson, is wrong in the fundamentals of its interpretation. There are the trees and there is the forest. Woodward and Caro produced a blizzard of particulars, but they just didn't get it. The same cannot be said of Kelley, even if she writes recklessly and employs some dubious methods and is promoted hysterically by lier publisher.\n\nThe book, despite its faults, and its willingness to rely on anecdotes (and the oral sex one is *hardly* the only one, and hardly the biggest. Perhaps the claim that Nancy and Frank Sinatra had sex in the White House as part of a long running affair? Or that Ronald committed rape in 1951?) with sketchy verification at best nevertheless paints what Dowd terms a 'familiar face'. In the end, the biggest fault Dowd sees *isn't* Kelley's willingness to report *everything* she heard, per se, but simply the lack of balance to that part. The entire review is riotous if you're able to find it though.\n\n\n⅓",
            "title_similarity": "0.7243762"
        },
        {
            "id": "hoheitd",
            "score": -9,
            "text": "[removed]",
            "title_similarity": "0.050479963"
        }
    ]
}