{
    "My Uncle was a Tunnel Rat in Vietnam and has agreed to do an interview with me in the next 2 days, I need help finding the right questions to ask him.\nSorry if I posted this to the wrong subreddit but I am currently scrambling trying to think of questions to ask my uncle. He currently has probably about a year left due to his kidneys failing and other complications due to agent orange. He has never been one to talk about his experiences in Vietnam even his own brother only knows of one experience he has had.\n\nMy uncle has agreed to do the interview with me on either 12/24/2021 or 12/25/2021. What I am struggling with is finding the right questions to ask. I don’t want to bring up anything too traumatizing for him but I also want to be able to figure out the stuff he did differently than other individuals in order to survive such a high attrition rate job. If anyone would be interested in having a question answered from my uncle please comment it below and I can ask him.\n\nEdit: I had the body in the comment section\n\nUpdate: i created a [post](https://www.reddit.com/r/history/comments/rn3fg1/my_uncle_was_a_tunnel_rat_in_vietnam_and_has/?utm_source=share&utm_medium=ios_app&utm_name=iossmf)  in r/history as advised by the mods so specific lines of potential questions can be brought up there! Thank you all so much for the assistance in this I believe some important information can be recorded\n\nUpdate: Update: hello everyone! I have just finished up my first interview with my uncle a few minutes ago, we talked for about an hour and 20 minutes just about pretty much everything from before he was drafted and how that made him feel then onto his travels from the states to Vietnam, his initial experience in Vietnam such as what he was doing when he got there. From there we started to talk about Him being moved out to the “boondocks” with his unit and then becoming a tunnel rat. \n\nWe then talked about equipment,training and initial feelings of the job. \n- what would be found in the tunnels\n- booby traps (the different types)(how they go about finding them)\n- time spent in tunnels and what would be a reason he wouldn’t continue \n-injuries \n\nWe talked about a lot! And I was sure to record everything. My plan from here is to take everything we talked about and get a more detailed list of what I want to get more information about.\nAt the end of our talk today he said he would like to talk more and would tell me “whatever” I wanted to know so I think the plan is to try and do this once a week so I can get as much information about him as possible \nI would love to be able to share everything I find out with everyone! I just have to find out the best way to do that\n\nI received some really great advice from this subreddit in resources that I can utilize one piece of advice I got that really helped this whole process a lot is, “when there is silence don’t speak and wait for the interviewee to continue” \nThat piece of advice really helped get a lot more information than I thought was possible and is an area I need to improve in for next time because I can tell there was a lot more that my Uncle wanted to say before I sometimes asked the next question \n\nThis post gained much more attention Than I initially expected and I am truly thankful for everybody’s input and advice, I do not know what I am doing when it comes to interviewing but am learning so much! I want to be able to share the material that I learn and want to be sure I do that in the correct way!": [
        {
            "id": "hppg0kg",
            "score": 1,
            "text": "A quick note to anyone coming to this thread to post. We allow questions like this in the interest of helping inquirers get useful information on the methodology of conducting this kind of interview, and tips which will help them get the most out of the experience. Responses still need to conform to the expectations of this subreddit. This is not an AMA, and while responses which provide a slate of questions to ask, and do so in a way that engages with how to ask that in a way that conforms to best practices for doing oral history, will of course be allowed, we will be removing comments which are solely along the lines of \"Hey, ask them about [X]\".",
            "title_similarity": "0.4682325"
        },
        {
            "id": "hpp33or",
            "score": 55,
            "text": "[removed]",
            "title_similarity": "0.006190097"
        },
        {
            "id": "hppqe3l",
            "score": 187,
            "text": "I recently listened to the [AskHistorians podcast episode on the Sephardi Voices UK oral history project](https://www.reddit.com/r/AskHistorians/comments/jg8ddu/askhistorians_podcast_episode_161_oral_history/).\n\nOne thing they said was that it can be tempting to prematurely fill a silence with your own comments or questions rather than giving time to the interviewee to tell their story at their own pace in their own words. So try to keep an eye on how much you talk and leave a gap for them to elaborate before moving on to the next question or topic.",
            "title_similarity": "0.58447635"
        },
        {
            "id": "hpper4k",
            "score": 336,
            "text": "I'm not going to offer suggestions on *what* to ask, but I do want to offer some advice on how to conduct this. Doing the interview for your own edification, or getting a family history, obviously has its value, but to really get the most out of this and provide a service to *historians*, there are certain things you ought to do.\n\nIn this regards, I cannot speak highly enough for the [Veteran's History Project](https://www.loc.gov/vets), which is part of the Library of Congress. They are a really cool group which seeks to preserve the accounts of veterans of America's conflicts, and we've helf multiple AMAs with them - [I](https://www.reddit.com/r/AskHistorians/comments/3zevmy/ama_the_library_of_congress_veterans_history/), [II](https://www.reddit.com/r/AskHistorians/comments/5e4aj0/we_are_the_library_of_congress_veterans_history/).\n\nA big part of what they are all about is collecting and preserving interviews conducted with veterans! So if you are going to be doing an interview with your uncle, I can't recommend highly enough that you do so with an eye on providing the result to the VHP. To do that though, and to ensure that it provides maximum value to future researchers, [*please* give a look at the Field Kit that they provide on their website](https://www.loc.gov/vets/kitmenu.html). While I believe they *will* accept material which doesn't strictly conform to the guidelines they lay out there, as you have not done the interview yet, and have a day or two still to prepare, reading through the information they provide, and making sure that you follow the guidance that they have there, would make donating the interview a very easy process, and also help researchers get the most use out of your uncle's account to utilize in future histories of the Tunnel Rats.\n\nI also would add, of course, that they do provide a [long list of suggested questions](https://www.loc.gov/vets/kit-generalquestions.html) which would help with your *direct* question here, and I'd encourage you to check out whether or not you plan to provide the result to the VPH, but I do hope you'll consider it!",
            "title_similarity": "0.6011411"
        },
        {
            "id": "hppab86",
            "score": 2089,
            "text": "Journalist/Educator here. I have done maybe 30 or 40 veteran interviews in my life and everyone of them has been a priceless opportunity for me and those I have shared them with AND the person being interviewed. \n\nI cannot talk to you about the questions themselves but a true historian on this subreddit will surely be better informed to suggest. \n\nBut I can tell you about the space *between* questions. And how to prepare yourself. You are doing a lot of listening and you are taking notes that support your interview during the interview itself. I would not try to do a verbatim note on everything they say, that is for professional journalists to do and it is a difficult skill to master and there are many opportunities to make mistakes so just avoid that if you can.\n\nA few years ago I edited an interview with a Vietnam vet and the interviewer had many questions but many looped back around on one another because the subject ideally does not just answer what you asked, they answer what you did not think to ask. And they may answer things out of order that you wrote them down in don't let that bother you, it's usually a sign that you planned good questions. And the things they say will lead to new questions. Feel free to go with them or circle back to them as time allows. \n\nThe interview itself should be recorded and there are many phone apps if you do not have a recorder for this purpose. As an educator I am partial to the entire \"Story corps\" platform and trainings. However, storycorps are recorded with the intention of sharing the interview publicly and for archival purposes which may not fit your usage. But the ideas about how to set up and structure the interview are helpful and those are all freely available to anyone.\n\nThe value of an audio or maybe audio video recording is that you have that recording to listen back to at whatever pace you want forever. The time the two of you have blocked off for this is finite and a precious resource. Take as much of it for him to be saying the things and you to be listening to the things that is the most important part of all. \n\nI would go into it understanding that there will be feelings and things like tears or possibly expressions of anger and other \"uncomfortable\" feelings. Let those things happen. If you decide to share the interview, you don't need to share all of it. But those emotionally challenging bits often are the gateway to greater truths, insights, and even historical fact so do not hide from them and don't mercilessly press into them either. Just sort of let them happen, acknowledge and move through them with dignity and tact. \n\nFinally, most of the veterans in my family passed away without having anyone record their stories for our family to have and cherish. Just last Friday I lost my Korea war era Naval veteran to Alzheimer's disease and complications. Eventually you simply run out of time and it is sad every time that happens. So good for you doing this now. This thing you are doing is a tremendous gift to your family, to yourself, and to whomever you may choose to share it with. Cherish the experience, be in the moment with your uncle. And be respectful about taking breaks and changing the subject from difficult lines of inquiry. But also give lots of permission for feelings to surface. How he feels about things that happened and the other people in the stories are arguably the most important aspect of this interview. Dates and lines on maps and names of commanders and missions and so on are often also covered in significant detail elsewhere. But not always so do get those. The things that we need more of and the things that matter most to you and your family is how these experiences informed him as a human being. And what matters to him that he really wants to communicate is possibly something that he will truly cherish, as well. \n\nOne more thing. Make a backup recording. Years of doing these things and a lot of times something goes really wrong. A lot of times it is batteries so charge those and bring back up. But try to get it from another source. If you are recording on a smartphone bring a tablet or other recording device to get the backup. If you are making a video, get a cheap actual video camera for $20 or so at a pawn shop or dig one out of the closet and have that for a backup, too. Bring a small tripod if you have one as that takes one more element out of the mix of things that will often go wrong.\n\nIf all else fails just be yourself listening as a nephew and be grateful for the experience. I'm actually getting pretty excited for you both. If whatever you capture is shared or shareable I would love to hear about it when the time may arise.",
            "title_similarity": "0.6529243"
        },
        {
            "id": "hpq6eug",
            "score": 567,
            "text": "I am not a military historian. However, I conduct ethnographic interviews as part of my historical research. The most important thing I was taught about ethnography is to always leave the subject in the *present* at the end of the interview. You will be probing into some deep and traumatic experiences for your uncle. There is nothing wrong with this, clearly by agreeing to the interview he wants to share this with you.\n\nHowever, it is considered very important in ethnographic practice to never *end* where the interviewee is left to stew in difficult old memories without being brought back to the present. Even if the end of your conversation will be edited out of your final recording, make sure you talk to your uncle at the end of the conversation about something going on now. It can be as simple as an anecdote about your pet, checking in about upcoming family plans, or asking him about a show he's been watching lately. Bringing up all these memories won't be easy for him, so it is good to help return him to the present a little at the end of your interview.",
            "title_similarity": "0.7229103"
        },
        {
            "id": "hpp315g",
            "score": 64,
            "text": "[removed]",
            "title_similarity": "0.006190097"
        },
        {
            "id": "hpp3dhu",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "0.006190097"
        },
        {
            "id": "hppxptg",
            "score": 123,
            "text": "Having both been interviewer and a consumer of interviews, I'll toss a few resources at you and then offer a few suggestions.\n\nMy first thought was to refer you to the massive collection of Navy oral history project transcripts of the US Naval Institute (mostly done by Paul Stillwell) as they are superb examples of what academic oral interviews with veterans look like, but unfortunately that's mostly paywalled.  The Coast Guard's [actually are available](https://www.history.uscg.mil/our-collections/oral-histories/), and this is a fascinating one by the [Naval Historical Foundation](https://www.navyhistory.org/programs/oral-histories/) with [Chester Nimitz's son](https://www.navyhistory.org/oral-history-rear-admiral-chester-nimitz-jr/) - a rear admiral in his own right, and one of the key participants in fixing the BuOrd torpedo disaster in 1942 and 1943 - where you can see the interviewer mix her knowledge of contemporary peers and events to ask deeper questions of someone who participated in them.\n\nHowever, the main difference between what you're doing and what academics do is that you won't have the background knowledge to ask detailed operational and theater questions...and it's ok!  This is another [featured NHF interview](https://www.navyhistory.org/wp-content/uploads/2018/01/Fix-Oral-History.pdf) with an example of someone who almost always was ignored by historians - a seaman in World War I who talks extensively about his experience at the bottom of the food chain who was transcribed by his daughter and niece.  There's an incredible amount of tremendously valuable information in it, and same goes for several of the VMI [cadets interviewing various vets for a history class requirement.](https://digitalcollections.vmi.edu/digital/collection/p15821coll13)\n\nThe Army being the Army - Naval officers tended to not keep much in the way of records (for instance, Spruance's comprised a grand total of a single box, where a number of Army officers had a literal room in their house dedicated to them!) - they have an [outright official publication for how to conduct oral history interviews](https://history.army.mil/html/books/oral/oral.html), which is worth a read.\n\nThe two most important takeaways from that which I'd emphasize are don't interrupt and don't fill silence.  It is *amazing* what interview subjects will talk about if you just let them talk, and if your uncle is willing to do this interview, there are clearly things he wants to discuss about his time in Vietnam.  Let him!\n\nHope that helps and if there's anything else I or anyone else can pass along as to specific structure, let us know.",
            "title_similarity": "0.62347853"
        },
        {
            "id": "hpqeast",
            "score": 32,
            "text": "I'm glad you're pursuing something like this. I recently did an oral history interview with a civilian in Saigon during the Viet Nam War, so what my answer will be about will be my anecdotal experience with my professor's guidance and with the interview itself.\n\nI think the most clear way to get to your goal of asking the right questions is to do background research. Before we did our interview, we spent a couple weeks learning about the background of the Viet Nam War and tried to criticize or at least gain a new perspective from mainstream American accounts and civilian accounts. For example, we studied the time period before American involvement and some bits afterwards. Because your uncle is largely outside the American narrative of the war, I would highly suggest you look for oral histories of civilians on both sides of the war (such as the [Dartmouth Viet Nam History Project](https://dvp.dartmouth.edu/s/dvp/page/welcome)). Oral history projects are very carefully documented (in my experience at least), and you can listen to recordings or look at transcripts. There are other documents called life maps (an outline of their life), transcript summaries (basically timestamped topics in the interview), abstracts, and other supplemental information. You could try to narrow it down to some key words to make your search easier, like the time periods, names of places he might have been, etc.. For my interview, my professor had sent out a background survey ahead of time, so it was easier for us to focus our research. \n\nWhen it comes to the actual interview, I do agree with other commentors that you should let your uncle speak for himself. While a list of questions is important to guide your discussion, this is ultimately about his experience and what he wants to share. If he doesn't want to share anything, you can't really force him to because then the story isn't genuine. I personally struggled a little bit with my oral interview because it was hard for me to identify stopping points to probe a question. \n\nI think the most critical part of an interview is actually the follow-up question. It can be daunting at first, but the most critical thing you can do is to be an attentive listener. What this can mean is making eye contact, body language cues (like smiling and etc.). It's just things that assure the narrator that you're listening, and in theory, it's supposed to build a level of trust and respect between the narrator and the interviewer. One thing that I encountered a lot in my oral interview is that my narrator would generalize a lot of experiences and sometimes, they would need a question like \"You mentioned \\[x\\], can you talk a little bit more about that?\" to follow up and see where it was going. However, if he doesn't want to talk about it or avoids the questions, don't push it.\n\nOne of the things that I found most helpful was a kind of scripted beginning. What I mean by that is most of the oral history interviews (full ones) will start with an introduction of who the narrator is and their background. Things like \"Tell me about your family,\" etc. kind of questions really brought up a lot of topics for us to ask follow-up questions on. For example, my narrator talked about curfew sometimes. I asked a follow-up question on his interactions with the military force in Saigon, and he kind of gave me a good idea of the attitude about being out after dark, interacting with police, etc.. I personally thought (during the interview) that it was a bit lackluster, but after going through the transcript, it helped me realize that he had answered my question and done a little bit more. The moral of the story there is don't be disappointed (or at least try not to be) when you don't get an answer that you expect. Maybe a follow-up or one of the questions you had didn't get the answer you wanted; that's fine, move on. Oral history interviews are often like conversations, but they can be way more nerve-wracking than one. \n\nThat's all the advice off the top of my head right now, but feel free to DM me or reply to the comment if you have any questions. I was actually very excited writing this post because I rarely see things on this subreddit I can meaningfully contribute to.",
            "title_similarity": "0.78362817"
        },
        {
            "id": "hpt6bl8",
            "score": 2,
            "text": "Sorry to ask, but what’s a tunnel rat?",
            "title_similarity": "0.4045084"
        },
        {
            "id": "hr1q3o1",
            "score": 1,
            "text": "\nCan anyone tell me, what role did the tunnel system in the Vietnam War play for the resistance here?\nI have toured several tunnel systems in Quang Tri and know about how people build and live here, but I don't know if the US and Saigon military consider the tunnel systems to be dangerous. How about them?",
            "title_similarity": "0.7143828"
        }
    ]
}