{
    "Why isn’t the genocide of Native American’s spoken of in the same vein as the Jewish Holocaust?\nAs a subject, this wasn’t brought up at all in my experience at school, and in general it isn’t talked about even comparably as often as the Holocaust is when it comes to historical atrocities. I find this hard to explain given conservative estimates of the death toll of Native American is said to be roughly 12 million according to Russell Thornton, and vary significantly with a toll of 100 million documented by D.E Stannard, author of ‘The American Holocaust’, the reasonable conclusion seems to land at around 75 million lives lost between Columbus’ arrival in 1492-1900, which works out to be close to 90% of the entire Native American population, with 5 million remaining today. Could someone please explain why, with a conservative estimate of twice as many lives lost, it isn’t spoken of with the same condemnation as the Holocaust, or if you were educated on the subject differently to what I was.": [
        {
            "id": "hq9anfn",
            "score": -6,
            "text": "[deleted]",
            "title_similarity": "0.13998295"
        },
        {
            "id": "hq97oeh",
            "score": 19,
            "text": "Welcome to /r/AskHistorians. **Please [Read Our Rules](https://www.reddit.com/r/AskHistorians/wiki/rules) before you comment in this community**. Understand that [rule breaking comments get removed](https://www.reddit.com/r/AskHistorians/comments/h8aefx/rules_roundtable_xviii_removed_curation_and_why/).\n\n#Please consider **[Clicking Here for RemindMeBot](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps://www.reddit.com/r/AskHistorians/comments/rqau26/why_isnt_the_genocide_of_native_americans_spoken/%5D%0A%0ARemindMe!%202%20days)** as it takes time for an answer to be written. Additionally, for weekly content summaries, **[Click Here to Subscribe to our Weekly Roundup](https://www.reddit.com/message/compose/?to=AHMessengerBot&subject=Subscribe&message=!subscribe)**.\n\nWe thank you for your interest in this *question*, and your patience in waiting for an in-depth and comprehensive answer to show up. In addition to RemindMeBot, consider [using our Browser Extension](https://www.reddit.com/r/AskHistorians/comments/d6dzi7/tired_of_clicking_to_find_only_removed_comments/), or getting the [Weekly Roundup](https://www.reddit.com/message/compose?to=subredditsummarybot&subject=askhistorians+weekly&message=x). In the meantime our [Twitter](https://twitter.com/askhistorians), [Facebook](https://www.facebook.com/askhistorians/), and [Sunday Digest](https://www.reddit.com/r/AskHistorians/search?q=title%3A%22Sunday+Digest%22&restrict_sr=on&sort=new&t=all) feature excellent content that has already been written!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AskHistorians) if you have any questions or concerns.*",
            "title_similarity": "0.43424267"
        },
        {
            "id": "hq98tzf",
            "score": 2,
            "text": "[removed]",
            "title_similarity": "0.099970154"
        },
        {
            "id": "hq9iyyg",
            "score": 633,
            "text": "Hi there! You’ve asked a question along the lines of ‘why didn’t I learn about X’. We’re happy to let this question stand, but there are a variety of reasons why you may find it hard to get a good answer to this question on /r/AskHistorians.\n\nFirstly, school curricula and how they are taught vary strongly between different countries and even different states. Additionally, how they are taught is often influenced by teachers having to compromise on how much time they can spend on any given topic. More information on your location and level of education might be helpful to answer this question.\n\nSecondly, we have noticed that these questions are often phrased to be about people's individual experiences but what they are really about is why a certain event is more prominent in popular narratives of history than others.\n\nInstead of asking \"Why haven't I learned about event ...\", consider asking \"What importance do scholars assign to event ... in the context of such and such history?\" The latter question is often closer to what people actually want to know and is more likely to get a good answer from an expert. If you intend to ask the 'What importance do scholars assign to event X' question instead, let us know and we'll remove this question.\n\nThank you!",
            "title_similarity": "0.550908"
        },
        {
            "id": "hq9thyd",
            "score": 1362,
            "text": "As often happens, many of the removed comments are simply \"what happened to the comments\"? However, we've also removed a number of comments that reflect common misunderstandings around the genocide(s) of American Indians. \n\nThis message is not intended to provide all the answers, but simply to address some of the basic facts, as well as genocide denialism in this regard, and provide a short list of introductory reading. Because this topic covers a large area of study, the actions of the United States will be highlighted. There is always more that can be said, but we hope this is a good starting point. \n\n##What is Genocide?\n\nSince the conceptualization of the act of genocide, scholars have developed a variety of frameworks to evaluate instances that may be considered genocide. One of the more common frameworks is the definition and criteria implemented by the United Nations. The term \"genocide,\" as coined by Raphael Lemkin in 1943, [was defined by the U.N. in 1948](https://redd.it/6mg3j3). The use of this term was further elaborated by [the genocide convention.](https://treaties.un.org/doc/Publication/UNTS/Volume%2078/volume-78-I-1021-English.pdf)\n\nArticle II describes two elements of the crime of genocide:\n\n1. The mental element, meaning the \"intent to destroy, in whole or in part, a national, ethnical, racial or religious group, as such\", and\n2. The physical element which includes five acts described in sections a, b, c, d and e. A crime must include both elements to be called \"genocide.\"\n\nArticle II: In the present convention, genocide means any of the following acts committed with intent to destroy, in whole or in part, a national, ethnical, racial, or religious group, as such:\n\n* (a) Killing members of the group;\n* (b) Causing serious bodily or mental harm to members of the group;\n* (c) Deliberately inflicting on the group conditions of life calculated to bring about its physical destruction in whole or in part;\n* (d) Imposing measures intended to prevent births within the group;\n* (e) Forcibly transferring children of the group to another group.\n\n##American Indian Genocides – Did they happen?\n\nSince the arrival of Europeans to the Americas, typically signaled with the appearance of Columbus in 1492, Indigenous Peoples have experienced systematic oppression and extermination at the hands of colonial powers. These colonizing governments either organized or sponsored acts of genocide perpetrated by settlers, targeting Indigenous settlements for complete destruction; eliminating sources of food and access to life-sustaining resources; instituting child separation policies; and forcefully relocating Indigenous populations to often times inhospitable tracts of land, now known as “reservations.” All of these acts constitute what scholars now recognize as genocide. The horrendous acts that occurred in the Americas were even an example proposed by Lemkin himself, where it is noted from his writings:\n\n>[Lemkin applied the term to a wide range of cases including many involving European colonial projects in Africa, New Zealand, Australia, and the Americas. A recent investigation of an unfinished manuscript for a global history of genocide Lemkin was writing in the late 1940s and early 1950s reveals an expansive view of what Lemkin termed a “Spanish colonial genocide.” He never began work on a projected chapter on “The Indians of North America,” though his notes indicate that he was researching Indian removal, treaties, the California gold rush, and the Plains wars.](https://oxfordre.com/americanhistory/view/10.1093/acrefore/9780199329175.001.0001/acrefore-9780199329175-e-3)\n\nThese actions took place over the entirety of the Americas, exacerbating the rapid depopulation of Indigenous Nations and communities. Exact figures of the population decline are inconclusive, giving us only estimates at best, with Pre-Columbian population numbers ranging anywhere from as low as 8 million to as high as ~100 million inhabitants across North, Central, and South America. What we do know is that in the United States, records indicate the American Indian population had dropped to approximately 250,000 by 1900. Despite any debate about population statistics, the historical records and narratives conclude that, at least according to the U.N. definition, genocide was committed.\n\n##Mental Element: Establishing Intent\n\nIn order for genocide to be committed, there must be reasonable evidence to establish an intent to commit what constitutes genocide. Through both word and action, we can see that colonial powers, such as the United States, did intend at times to exterminate American Indian populations, often with public support. Government officials, journalists, scholars, and public figures echoed societal sentiments regarding their desire to destroy Indians, either in reference to specific groups or the whole race.\n\n>”This unfortunate race, whom we had been taking so much pains to save and to civilize, have by their unexpected desertion and ferocious barbarities justified extermination and now await our decision on their fate.”\n\n[--Thomas Jefferson, 1813]( https://www.loc.gov/resource/mtj1.047_0147_0150/?sp=3)\n\n>\"That a war of extermination will continue to be waged between the races until the Indian race becomes extinct must be expected.\"\n\n[--California Governor Peter Burnett, 1851](http://governors.library.ca.gov/addresses/s_01-Burnett2.html)\n\n>\". . .these Indians will in the end be exterminated. They must soon be crushed - they will be exterminated before the onward march of the white man.\"\n\n[--U.S. Senator John Weller, 1852, page 17, citation 92](http://digitalcommons.law.utulsa.edu/cgi/viewcontent.cgi?article=2654&context=tlr)\n\n##Physical Element: Acting with Purpose\n\n**U.S. Army Policy of Killing Buffalo (Criterion C)**\n\n[In this post,](https://redd.it/4j42ag) it is explained how it was the intention and policy of the U.S. Army to kill the buffalo of America off in an attempt to subdue, and even exterminate, the Plains Indians.\n\n**Sterilization (Criterion D)**\n\nThe Indian Health Service (IHS) is a federally run service for American Indians and Alaska Natives. It is responsible for providing proper health care for American Indians as established via the treaties and trust relationship between tribes and the U.S. Government. However, on November 6, 1976, the Government Accountability Office (GAO) released the results of an investigation that concluded that [between 1973 and 1976, IHS performed 3,406 sterilizations on Native American women.](https://cbhd.org/content/forced-sterilization-native-americans-late-twentieth-century-physician-cooperation-national-) Per capita, this figure would be equivalent to sterilizing 452,000 non-Native American women. Many of these sterilizations were conducted without the consent of the women being sterilized or under coercion.\n\n**Boarding Schools (Criterion E)**\n\nThe systematic removal of Indian children from their parents and placement into boarding schools was a policy implemented by the United States meant to [force American Indian children to assimilate into American culture,]( https://redd.it/8zgozt) thus “[killing] the Indian, [and saving] the man.” These schools were operated by various entities, including the federal government and church/missionary organizations. While constituting cultural genocide as well, American Indian children were beaten, neglected, and barred from practicing their cultures. Some children even died at these schools.\n\n##But What About the Diseases?\n\nIn the United States, a subtle state of denial exists regarding portions of this country's history. One of the biggest issues concerning the colonization of the Americas is whether or not this genocide was committed by the incoming colonists. And while the finer points of this subject are still being discussed, few academics would deny that acts of genocide were committed. However, there are those who vehemently attempt to refute conclusions made by experts and assert that no genocide occurred. These [“methods of denialism”](https://redd.it/6kywre) are important to recognize to avoid being manipulated by those who would see the historical narratives change for the worse.\n\nOne of the primary methods of denial is the over severity of diseases introduced into the Americas after the arrival of the colonizers, effectively turning these diseases into ethopoeic scapegoats responsible for the deaths of Indigenous Peoples. While it is true that disease was a huge component of the depopulation of the Americas, often resulting in up to a 95% mortality rate for many communities and meaning *some* communities endured more deaths from disease, these effects were greatly exacerbated by actions of colonization.\n\n##Further Reading\n\nThough there is much information about this topic, this introductory list of books and resources provide ample evidence to attest the information presented here:\n\n* [*Beyond Germs: Native Depopulation in North America* edited by Catherine Cameron, Paul Kelton, and Alan Swedlund](https://books.google.com/books/about/Beyond_Germs.html?id=yUw-rgEACAAJ)\n* [*American Indian Holocaust and Survival: A Population History Since 1492* by Russell Thornton](https://books.google.com/books/about/American_Indian_Holocaust_and_Survival.html?id=9iQYSQ9y60MC)\n* [*Murder State: California's Native American Genocide, 1846-1873* by Brendan Lindsay](https://books.google.com/books/about/Murder_State.html?id=TfiD-E7VBKYC)\n* [*Blood and Soil: A World History of Genocide and Extermination from Sparta to Darfur* by Ben Kiernan](https://books.google.com/books/about/Blood_and_Soil.html?id=XR91bs70jukC)\n* [*American Holocaust: The Conquest of the New World* by David Stannard](https://books.google.com/books/about/American_Holocaust.html?id=RzFsODcGjfcC)\n* [*Myths of Conquest*](https://redd.it/2vf565) by /u/anthropology_nerd\n* [AskHistorians FAQ](https://www.reddit.com/r/AskHistorians/wiki/nativeamerican#wiki_european_contact_and_conquest)",
            "title_similarity": "0.66506636"
        },
        {
            "id": "hqai7wy",
            "score": 2143,
            "text": "Just to address this from a different perspective, ie why is the Holocaust considered unique, I will link to an answer by  u/commiespaceinvader to the question [\"When people discuss the Holocaust, why do they focus mainly on the killing of the 6 million Jews?\"](\nhttps://www.reddit.com/r/AskHistorians/comments/564gvm/comment/d8g92dz/).\n\nSpecifically:\n\n>\"In short the Western imagination of itself had experienced atrocities and horrors inflicted against political opponents, \"deviants\", and colonial subjects but it had never experienced that all it used to define itself as good and progressive – the modern state and its bureaucracy, industry, science, the police – was used to murder an entire group of European peoples.\"\n\nIt's old but I will also link to a [comment](https://www.reddit.com/r/AskHistorians/comments/1nj5uj/was_the_holocaust_unique/ccja56t/) by u/400-rabbits on Stannard, which adds a bit of complexity - there are multiple historic Holocausts and they are all unique, if interrelated.\n\nOne thing I will add in addition to those answers is that when one is comparing the Holocaust to Indigenous peoples of the Americas, you're dealing with vastly different things in terms of time and scale - it's not just a numbers game. When we are talking about indigenous peoples of the Americas, we are discussing hundreds of different groups, who had very different experiences at the hands of different actors. Which is to say it makes it hard to talk about a singular \"genocide\" - the answer from u/EdHistory101 specifically focuses on the United States government in the 19th and 20th centuries, but that is part of a much larger history of conflict and dispossession of indigenous peoples lasting from the 1490s to [literally this very moment](https://www.survivalinternational.org/brazilgenocide), involving a vast array of actors. To be more comparable you'd probably need to compare the entire history of European anti-semitism from 1492 to the present. \n\nThe Holocaust itself is historically a much more concentrated event, involving one government as a prime mover (the NSDAP regime in Germany), which intentionally targeted Jews in Europe for industrialized mass killing, most of which took place over a three year period during the war (ETA a 2019 study found 25% of Holocaust victims were actually murdered in a [three month period](https://www.ncbi.nlm.nih.gov/pmc/articles/PMC6314819/)). Not only was this genocide extremely intentional and organized and planned to an exceptional level of detail, but Germany made it an overriding policy objective, even in its relations with friendly/allied countries - there were even low-level discussions between German and Japanese officials about the possibility of murdering the 20,000 Jewish refugees in Shanghai (the Japanese refused). \n\nHowever, even with that said I should point out via this [thread](https://www.reddit.com/r/AskHistorians/comments/pyuvqy/how_true_is_the_claim_that_the_united_states_of/) that there is an ongoing historic debate at the moment as to how much white settlement of the Americas directly inspired Nazi policies and goals in Eastern Europe.",
            "title_similarity": "0.7119867"
        },
        {
            "id": "hqda4zp",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.099970154"
        }
    ]
}