{
    "Was my famous ancestor a Nazi collaborator?\nGrowing up, I always knew that one of my great-grandparents was very famous. We had several busts and placards of *Grandpere Henri* in the house, and my mom told me several stories about the famous civil engineer who was (apparently) approached to run for president of France. When I learned how to use Wikipedia, I also learned how General Giraud had been a colleague of De Gaulle, and had helped liberate France from the Nazis. \n\nThere's only one problem. I don't talk to that branch of the family much, so this took me a while to figure out. But I recently pieced together that my famous ancestor was not [Henri Giraud](https://en.wikipedia.org/wiki/Henri_Giraud), the war hero, but [Henri Giraud](https://fr.wikipedia.org/wiki/Henri_Giraud_(secr%C3%A9taire_d%27%C3%89tat), the head of Paris' public works department– and also Secretaire d'Etat for the Petain government. \n\nSo, you can imagine this was a pretty big surprise, and I can't help feeling a certain morbid curiosity about Grand-pere's role in the war. I know a civil engineer wouldn't necessarily have participated in loading up the train cars, but I still can't help wondering how actively he participated in the occupation. \n\nI feel like there are so many unanswered questions, and my french is way too shitty to find the answers. I'd be very grateful if anyone can help find things out about my famous grandfather.\n\nSo, here's what I'm trying to find out:\n\n1. What sort of work would Henri Giraud have been responsible for, as Secretaire d'Etat under Petain? Would this have benefited the Axis war effort?\n2. What's the historical consensus on the Vichy bureaucracy? Were they more likely to have been active supporters, or simply civil servants who \"did their jobs\"?\n3. As a member of the Vichy government, would grand-pere Henri have been \"in the room\" for discussions about Jewish deportations, or other war crimes?\n4. Did he ever publicly express any public sympathy with the Germans or their racial program?\n\nAlors, merci pour votre aide.": [
        {
            "id": "hqx3ysf",
            "score": 1,
            "text": "Welcome to /r/AskHistorians. **Please [Read Our Rules](https://www.reddit.com/r/AskHistorians/wiki/rules) before you comment in this community**. Understand that [rule breaking comments get removed](https://www.reddit.com/r/AskHistorians/comments/h8aefx/rules_roundtable_xviii_removed_curation_and_why/).\n\n#Please consider **[Clicking Here for RemindMeBot](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps://www.reddit.com/r/AskHistorians/comments/ru6mte/was_my_famous_ancestor_a_nazi_collaborator/%5D%0A%0ARemindMe!%202%20days)** as it takes time for an answer to be written. Additionally, for weekly content summaries, **[Click Here to Subscribe to our Weekly Roundup](https://www.reddit.com/message/compose/?to=AHMessengerBot&subject=Subscribe&message=!subscribe)**.\n\nWe thank you for your interest in this *question*, and your patience in waiting for an in-depth and comprehensive answer to show up. In addition to RemindMeBot, consider [using our Browser Extension](https://www.reddit.com/r/AskHistorians/comments/d6dzi7/tired_of_clicking_to_find_only_removed_comments/), or getting the [Weekly Roundup](https://www.reddit.com/message/compose?to=subredditsummarybot&subject=askhistorians+weekly&message=x). In the meantime our [Twitter](https://twitter.com/askhistorians), [Facebook](https://www.facebook.com/askhistorians/), and [Sunday Digest](https://www.reddit.com/r/AskHistorians/search?q=title%3A%22Sunday+Digest%22&restrict_sr=on&sort=new&t=all) feature excellent content that has already been written!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AskHistorians) if you have any questions or concerns.*",
            "title_similarity": "0.52933997"
        },
        {
            "id": "hqxfaxy",
            "score": -21,
            "text": "[removed]",
            "title_similarity": "-0.07553253"
        },
        {
            "id": "hqxz6de",
            "score": 2047,
            "text": "[removed]",
            "title_similarity": "-0.07553253"
        },
        {
            "id": "hr0p0u1",
            "score": 2,
            "text": "[removed]",
            "title_similarity": "-0.07553253"
        },
        {
            "id": "hr2ul7n",
            "score": 274,
            "text": "So hopefully someone else can add more to this since I know little about the individual in question and don't speak French but I can (hopefully) elaborate a bit on questions 1-3. My primary source for this is \"Vichy France: Old Guard and New Order\" by Robert Paxton. I will tackle your questions a little out of order and I apologize for that but it seems the best way to construct this.  \n\n\nWhat's the historical consensus on the Vichy Bureaucracy exactly? Well that could frankly be an entire post of its own, but simply put it is a very hot-button and controversial subject. While it is not the universal opinion I would say that academic consensus has mostly shifted to the views of Robert Paxton which is that the Vichy Government was not merely a collaborationist/puppet government of Nazi Germany but was rather its own fascist state which pursued its own independent agenda (albeit with limited ability to do so). The efforts of the Petain government were not widely condemned internally during the contemporary period: this is to say the Petain government had considerably more support (especially initially) than the Free France movement which in the beginning numbered only about 7,000 troops with the majority of French troops in the UK requesting repatriation to either the occupied territories or the Vichy territories.  \n\n\nSo were Vichy Bureaucrats active supporters or people just doing their job? Well that's unfortunately difficult to make a generalization on, and it will vary case-to-case. The reality in France is that the vast-majority of the population (Vichy or occupied) engaged in some form of collaboration with the Nazis at some point or another. (I'd point to u/mikedash's [answer](https://www.reddit.com/r/AskHistorians/comments/7u5cvz/comment/dtijaps/?utm_source=share&utm_medium=web2x&context=3) on the effectiveness of the resistance for a lil more detail on this) But basically: for many in France active resistance just wasn't worth it, especially early in the occupation. Meanwhile the Vichy government acted with a degree of autonomy: they administered the vast majority of the colonies which had remained loyal to them initially, they were not *officially* a member of the Axis, and were able to pursue their own policies (albeit while still being largely kowtowed to Germany). Their autonomy would increasingly diminish after Operation Torch and Case Anton, but there did nonetheless remain a strong collaborationist strain throughout France prior to Operation Overlord. They formed their own paramilitary death squads in 1943 known as the Milice and prior to the German occupation in Case Anton the Vichy government pursued their own policy of oppression against Jews, Communists, Romani and others. Indeed the degree of relative autonomy afforded to the Vichy government in regards to internal affairs and the manner in which they conducted themselves with the support (or at least complicity) of the majority of the population was and continues to be a point of controversy and shame in French discourse. There was a large attempt to pave over this in the post-war years for the sake of reconciliation but this often had to involve censorship or half-truths to maintain the illusion that support for the fascist movements was vanishingly thin and the resistance wildly popular. One notable example of this would be the Holocaust documentary \"Night and Fog\" which was censored upon release from showing a picture which clearly depicts a French officer guarding a concentration camp as seen [here](https://upload.wikimedia.org/wikipedia/en/0/02/Night_and_fog_Pithiviers_uncensored.jpg).  \n\n\nSo now on to your ancestor. According to the wikipedia page you linked he was General Secretary for the \"Services de l'Équipement National\" (National Equipment Services) which I *believe* is referring to the General Delegation for National Equipment (DGEN) though again, information on this is difficult to come-by especially without speaking French. This would effectively put him in charge of managing French economic and industrial development from February of 1941 to November of 1942. This involved building bridges, hydroelectric dams, and tunnels. This would have benefitted the Axis only tangentially, insofar as the economic developments would contribute towards the Vichy payment for German occupation (yes they had to pay to Germans to occupy Northern France) and in the form of an improved economy and infrastructure once southern France had also been occupied; this is however far from damning. To this end, it seems unlikely that he was involved in much of the decision making in regards to collaboration, racial policy, or other *questionable* government actions in Vichy France. Notably the policies and plans of development led by the DGEN were largely incorporated and continued by the Provisional government and later the fourth republic. Which, to my mind at least, would say that overall what your ancestor was in charge of was at least not outright dastardly.  \n\n\nWould he have been in the room for these decisions? It's difficult to say as I'm not overly familiar with how exactly the prime ministers and Petain preferred to operate their cabinets, couple this with the fact that the position Giraud occupied was far from the most prestigious or important (as well as being largely irrelevant for many of these decisions) would lead me to believe that he wouldn't be \"In-the-room\" as it were for these decisions, and if he was I doubt he would be consulted for input on it. Absence of evidence is not evidence of absence however, so take that with a grain of salt. I would however say that given his relatively high standing in the government there is very little chance that he was not at least *aware* of the kinds of policies this government was pursuing. For instance he was in office during July of 1942 when the Vichy government deported over 10,000 Jews to Germany to be sent to the death camps. While I doubt he was involved in this decision, I also think it's unlikely that he was not at least partially aware of it. But this gets back to the trickiness of collaboration and knowledge of the Holocaust, the unfortunate reality is that many people had at least *some* knowledge of it and went along with it to some extent, be it out of fear, indifference, or convenience.  \n\n\nDid he ever publicly express support for this racial program? This is a realm in which I must bow out and say that I truly have no idea. Even for question 3, I had to base my answer off very limited information. He died on the day of Case Anton which means that he died before the worst of it, which makes it even harder to gauge. I genuinely hope someone else who speaks French and has access to some kind of archives or interviews could perhaps elaborate on that point for you, assuming that such sources exist.  \n\n\nFor sources:  \n\"Vichy France: Old Guard and New Order, 1940-1944\" by Robert Paxton  \n\n\n[This French Govt Website](https://www.siv.archives-nationales.culture.gouv.fr/siv/rechercheconsultation/consultation/ir/pdfIR.action?irId=FRAN_IR_017032) which confirms which agency your ancestor worked for (Thank you google translate)  \n\n\n[Another Govt Website](http://www.archives.developpement-durable.gouv.fr/delegation-generale-a-l-equipement-national-dgen-r6883.html) detailing the agency, its role, and its accomplishments  \n\n\nIf anyone else could possibly elaborate on the last question I would really appreciate it as I'm sure it is probably the point you're most concerned with. Hope this helps, please let me know if there's anything else you'd like to know and I'll try my best.",
            "title_similarity": "0.5922352"
        }
    ]
}