{
    "My grandmother once said that, as a young woman in 1930s New York, she would chat with her friends in French when their husbands were around, because all the young ladies in her social circle learned French in school but all the young men learned German or Russian instead. Was this a common split?\nThis was certainly true of my grandmother and grandfather. They were middle (later upper-middle) class Jews in New York, born around the end of World War One. My grandfather spoke fluent German and Russian, while my grandmother only ever learned French. Neither of them ever spoke any Yiddish (which they considered low-class) and only a tiny amount of Hebrew. I remember my grandfather had very strict ideas about what languages were “appropriate” for men versus women to learn - French and Spanish for women, German Greek and Russian for men. Was this a common attitude at the time?": [
        {
            "id": "hri6byh",
            "score": 1,
            "text": "Welcome to /r/AskHistorians. **Please [Read Our Rules](https://www.reddit.com/r/AskHistorians/wiki/rules) before you comment in this community**. Understand that [rule breaking comments get removed](https://www.reddit.com/r/AskHistorians/comments/h8aefx/rules_roundtable_xviii_removed_curation_and_why/).\n\n#Please consider **[Clicking Here for RemindMeBot](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps://www.reddit.com/r/AskHistorians/comments/rxhth4/my_grandmother_once_said_that_as_a_young_woman_in/%5D%0A%0ARemindMe!%202%20days)** as it takes time for an answer to be written. Additionally, for weekly content summaries, **[Click Here to Subscribe to our Weekly Roundup](https://www.reddit.com/message/compose/?to=AHMessengerBot&subject=Subscribe&message=!subscribe)**.\n\nWe thank you for your interest in this *question*, and your patience in waiting for an in-depth and comprehensive answer to show up. In addition to RemindMeBot, consider [using our Browser Extension](https://www.reddit.com/r/AskHistorians/comments/d6dzi7/tired_of_clicking_to_find_only_removed_comments/), or getting the [Weekly Roundup](https://www.reddit.com/message/compose?to=subredditsummarybot&subject=askhistorians+weekly&message=x). In the meantime our [Twitter](https://twitter.com/askhistorians), [Facebook](https://www.facebook.com/askhistorians/), and [Sunday Digest](https://www.reddit.com/r/AskHistorians/search?q=title%3A%22Sunday+Digest%22&restrict_sr=on&sort=new&t=all) feature excellent content that has already been written!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AskHistorians) if you have any questions or concerns.*",
            "title_similarity": "0.4202174"
        },
        {
            "id": "hrjwt4h",
            "score": 1232,
            "text": "What a great question and thanks for the excuse to fall down a rabbit hole trying to answer it! It's entirely possible that someone more familiar with the social norms of the era could arrive at a different answer but for an educational history perspective, the best answer I can give you is: Maybe? \n\nFirst off, I'm assuming by New York, you mean New York City. I'm also going to assume that they went to a public mixed-gender high school and not a private, single-gender high school. It's it the later - your grandparents went to single-sex private schools - the answer can be as simple as the girls school had a French teacher but not a German/Russian teacher and the boys school had a German/Russian teacher but not a French teacher. (Let's set aside the why behind that for a second.) New York State has historically been fairly hands off in terms of private school curriculum but private schools have generally speaking, followed the same overall blueprint as public schools in terms of a comprehensive liberal arts curriculum. And New York State has followed a structure for high school curriculum that is unlike any other state in the country.  \n\nBy around 1910 or so, the comprehensive liberal arts curriculum in Kindergarten to 8th grade had mostly taken the shape we're familiar with today: reading/writing, math, science, history, music, art, physical education, and some instruction in a language other than English. In high school the granular size of the curriculum got smaller and came in one of two varieties: *academic* (also known as *ordinary* or *core*) courses and  *electives* (also known as *special* or *ornamental*.) \n\nAcademic courses included 3 or 4 different branches of mathematics, 3 or 4 difference branches of science, history (American and global), English class (mostly the study of writing done by other people), general music, general art, and physical education, and general instruction in a language other than English (further broken down into classical: Greek and Latin and modern: Spanish, French, German, Italian, Hebrew). Electives were courses such as choral or performance music, pottery or painting, bookkeeping, advanced language instruction, homemaking, etc.\n\nThis structure of core and elective wasn't unique to NYS - what was unique, though, was the structure of testing that accompanied the curriculum. Beginning in the mid-1800s, the [Board of Regents of the University of the State of New York] (https://en.wikipedia.org/wiki/Board_of_Regents_of_the_University_of_the_State_of_New_York) (I researched the appointment dates and terms of every single person on that list - Imma gonna link to that Wiki article every chance I get) instituted what became known as the Regents Testing Program. Basically, NYS leaders wanted a diploma from a designated, approved New York State public high school to have value and the best way to ensure that was the case, was to establish criteria. So, they brought teachers together from across the state to write high school exit exams in the core subjects, plus some electives. There's a lot more to the history of NYS schools but that's the gist - what this functionally meant is that while NYS did not tell teachers how or what to teach, students across the state would take the same exam on the same day. A test written by their teachers who had spent the last school year teaching the content likely to appear on the exam. Not all students wanted a Regents diploma - which was most often used for college admission - and were fine with a local diploma awarded by the high school or school district. \n\nBy the 1930s, students at NYS high schools needed to take and pass 7-10 Regents courses and exams in order to graduate with a Regents diploma. 5 to 7 from the core academic courses (math, science, history, English, foreign language), 3 to 4 from an electives. It varied based on year and the specific kind of Regents diploma, but **if your grandparents attended high school in New York State, they took at least one year of instruction in a language other than English**. That, though, is just the surface of your question. So, let's look at the languages themselves.\n\n#**Russian**\n\nYour grandparents probably didn't study Russian in school - your grandfather likely picked that up somewhere else. While it's not impossible that there was a teacher who taught a class of Russian-language instruction, high schoolers' days were pretty full with the required courses and Russian was never (as far as I can tell - but there were lots of one-off exams that were field tested but never made official) a Regents-level language. I get into it a bit more in [this answer](https://www.reddit.com/r/AskHistorians/comments/bgchqe/was_russian_available_as_a_second_language_in/elkg4t6/) about Russian language instruction during the Cold War but basically there simply wasn't enough of an interest before then. That said, by 1980 or so, Russian-speaking students could take Math Regents exams in Russian. \n\n#**Hebrew**\nWhile there wasn't a sufficient political or educational push for Russian, members of the NYC Jewish community, through direct and purposeful advocacy, made Hebrew a part of the Regents curriculum. (You can see what a Hebrew Regents exam looks like [here](https://nysl.ptfs.com/knowvation/app/consolidatedSearch/#search/v=list,c=1,q=qs%3D%5B*%5D%2Cfacet-fields%3D%5Bbrowse1_ss%3A%22All%20Government%20Collections%22%3E%3Ebrowse2_ss%3A%22New%20York%20State%20Government%20Documents%22%3E%3Ebrowse3_ss%3A%22Education%20Department%22%3E%3Ebrowse4_ss%3A%22Office%20of%20Elementary%2C%20Middle%2C%20Secondary%20and%20Continuing%20Education%22%3E%3Ebrowse5_ss%3A%22Office%20of%20Standards%2C%20Assessment%20and%20Reporting%22%3E%3Ebrowse6_ss%3A%22Regents%20high%20school%20examinations%22%3E%3Ebrowse7_ss%3A%22Hebrew%22%3E%3Ebrowse8_ss%3A%22Three%20Years%22%5D%2CqueryType%3D%5B16%5D,sm=s,l=library1_lib).) The advocacy started at two NYC high schools in 1930 where local religious leaders pushed for Hebrew to be given the same weight as other modern languages. *Power, Protest, and the Public Schools: Jewish and African American Struggles in New York City* by Melissa F. Weiner offers a history of the rise of Hebrew as a language in New York State schools.\n\n#**German, French, Spanish, Italian**\nThe \"modern\" languages made their way into NYS high schools in the 1800s and were part of the high school experience for nearly every student. While German became verboten in some communities during and after WWI, it remained a language of instruction in NYS schools until the 1990s. Schools typically offered Italian and/or French and/or Spanish but students usually picked only one. The languages were only very recently phased out of the official Regents exam batting order. Alas, I wasn't able to find any explicit gender-coding attached to them specific to 1930s NYC.\n\n#**Greek**\nGreek was for sure taught in NYC schools - but we're talking OG, not modern, Greek. Greek - and more commonly Latin - were essential for young people who were planning on attending college or who wanted to use their HS diploma of evidence of academic skills. In some places, a school principal or superintendent would write *Greek with Credit* or *Latin with Credit* on a student's official New York State Regents diploma to communicate that the student not only took general Latin or Greek, but they took one of the electives such as Prose Composition or Verse at Sight.\n\n#**Gender**\nWas there a gender division in language? Sort of - but not because, as far as I can tell through the lens of education history, of the languages themselves but because of who took languages in high school. There are a whole bunch of contributing factors but for a whole bunch of reasons, girls have always outperformed boys at school. Pick a random New York City high school on a June day in the 1930s and walk into a Senior-level modern language classroom and you're likely to see mostly - if not only - girls. In the 1930s, boys were more likely to stop going to school and start their adult life without a diploma as it wasn't as necessary for employment as it would be for their sons. (Unless they knew they were heading to college  - and in that case, they'd be in a Greek or Latin classroom. Girls would also be in that classroom, to be sure, but again, it was likely because they were college-bound - Vassar or another one of the seven sisters (more on them [here](https://www.reddit.com/r/AskHistorians/comments/ab2ewe/how_has_womens_enrollment_in_college_changed_from/ecy0uao/?context=999)). \n\nAnd again, someone who is more familiar with the social norms and cultural capital of post-World War I middle class Jews in NYC might be able to offer a different perspective, but my hunch is that any gender-related associations with French and Spanish were related to why a young person would be studying them and the context for that study than the language itself. That said, the 30s did see an increase in gender-coded Regents courses such as homemaking and agriculture or construction. These classes, however, were stand alone. Gender-based programs - meaning girls took one sequence and boys took another - had mostly faded out of NYS high schools by the 1880s but it's possible French/Spanish class picked up gender coding in some communities based on how teachers presented them to parents.",
            "title_similarity": "0.589108"
        },
        {
            "id": "hrjkyn8",
            "score": -3,
            "text": "[removed]",
            "title_similarity": "-0.05652467"
        },
        {
            "id": "hrkq0v4",
            "score": 24,
            "text": "[removed]",
            "title_similarity": "-0.05652467"
        },
        {
            "id": "hrl87c7",
            "score": 25,
            "text": "[removed]",
            "title_similarity": "-0.05652467"
        }
    ]
}