{
    "The first Harry Potter movie, with a budget of $125 Million, began production just two years after the first book by a completely unknown British author was first published. How did the Harry Potter series explode in popularity so incredibly quickly compared to other similar book series?\nIt's crazy to me how *quickly* Harry Potter caught on, especially given that it wasn't an established IP or author. To be clear, I'm not looking for a literary analysis (I'm sure the content helped, but great books get missed all the time). Rather, I am curious what external factors allowed such an incredible rise in popularity. Did some media giant pick up the series early and decide \"we're going to market the hell out of this\"? Was there a lull in children's fiction at the time that led to a huge demand? Did the english-speaking world just decide that 1997 was the year to read to their kids a lot more than they used to?": [
        {
            "id": "hu2ogoi",
            "score": 1,
            "text": "Welcome to /r/AskHistorians. **Please [Read Our Rules](https://www.reddit.com/r/AskHistorians/wiki/rules) before you comment in this community**. Understand that [rule breaking comments get removed](https://www.reddit.com/r/AskHistorians/comments/h8aefx/rules_roundtable_xviii_removed_curation_and_why/).\n\n#Please consider **[Clicking Here for RemindMeBot](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps://www.reddit.com/r/AskHistorians/comments/sbxc8t/the_first_harry_potter_movie_with_a_budget_of_125/%5D%0A%0ARemindMe!%202%20days)** as it takes time for an answer to be written. Additionally, for weekly content summaries, **[Click Here to Subscribe to our Weekly Roundup](https://www.reddit.com/message/compose/?to=AHMessengerBot&subject=Subscribe&message=!subscribe)**.\n\nWe thank you for your interest in this *question*, and your patience in waiting for an in-depth and comprehensive answer to show up. In addition to RemindMeBot, consider [using our Browser Extension](https://www.reddit.com/r/AskHistorians/comments/d6dzi7/tired_of_clicking_to_find_only_removed_comments/), or getting the [Weekly Roundup](https://www.reddit.com/message/compose?to=subredditsummarybot&subject=askhistorians+weekly&message=x). In the meantime our [Twitter](https://twitter.com/askhistorians), [Facebook](https://www.facebook.com/askhistorians/), and [Sunday Digest](https://www.reddit.com/r/AskHistorians/search?q=title%3A%22Sunday+Digest%22&restrict_sr=on&sort=new&t=all) feature excellent content that has already been written!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AskHistorians) if you have any questions or concerns.*",
            "title_similarity": "0.37135392"
        },
        {
            "id": "hu4vqmb",
            "score": 60,
            "text": "Such a terrific set of answers for a question I’d never think to ask but always wanted to know",
            "title_similarity": "0.45034096"
        },
        {
            "id": "hu4pyaa",
            "score": 15,
            "text": "Follow up question, how much did the Harry Potter series sell in the first 2 years? Especially compared to other best selling novels. \n\nThere has already been detailed answers on the main question, but I feel if we have a quantitative answer, it would give us a wider understanding on the phenomenon.",
            "title_similarity": "0.8013636"
        },
        {
            "id": "hu3xw2r",
            "score": 3931,
            "text": "When books are bought by publishers, they are at the same time sent around to all the big film companies/production houses by film agents and scouts working for the author. The film companies buy the book option, which means the right to adapt the book for a year. They can renew it, or not. Normally if your book is bought, you get around $10,000 for a year, for doing nothing, which is a sweet deal for an author who might only be getting $10,000 for writing the whole book anyway. You then get $100,000 or so if the book is made into a film or TV series. There's around a 1% chance of any optioned book becoming a film.\n\n*Harry Potter* was in some ways unlucky. It was passed around in 1995/6 by film scouts to pretty much every film company on earth, and no film company bought it. The manuscript ended up on the piles of paper that used to be the norm in the film development world before iPads and Kindles. It was, as you've said, an unknown manuscript from an unknown author, being published by a then very small British company called Bloomsbury. Everyone passed on it.\n\nWhat changed? Publishers send out books to bookshops/reviewers about 6 months before publication. Bookshops loved *Harry Potter*. The British book trade had been looking for a Roald Dahl type author for ten years, and the comparisons were made immediately. Also, the publishers leaned in heavily on the 'wrote it in a cafe' 'single mother on benefits' angle - when you're promoting a debut author, literally any hook you can get the press to report is gold, and this was perfect. \n\nAlso, there's just the fact that JK Rowling can write. Kids responded immediately to her action and humour, and the mix of dark and light. Adults, strangely, loved it too.\n\n\nWith this word of mouth buzz happening in Britain, Rowling's literary agent sold the books at the Bologna Book Fair, which is the world's biggest for kids books, to Scholastic in the US, which was then the market leader across the world for children's books. The rights sold for $105,000, which would be pretty big for what's known as Middle Grade today, but was a *huge* amount then.\n\nThis American sale is what reignited interest in the film rights, as well as a few big awards in the UK, and the simply the word of mouth buzz that built up with kids and bookshops. As any person who works in books will tell you, word of mouth is basically impossible to conjure up, but when it happens (in about 0.1% of books), it happens *big*. It's the easiest (yet hardest) way to sell books. The book trade would murder to figure out how to do it more.\n\nHeyday Productions were a small-ish British production house, which had made one film, the amazing cannibal thriller *Ravenous*. More importantly, they were the British preferred production partner of Warner Bros, who were desperate for family friendly entertainment franchises. The *Batman* films had just gone down in flames and *Superman* was in development hell. The various attempts at making franchises out of *Major League*, *Gremlins*, *Free Willy* etc had failed. Everyone knew *Star Wars* was coming back. \n\n*Harry Potter* was winning major book prizes in the US now. It landed on film producers doors again in 1998, now with much bigger word of mouth. It was still ignored. However, this time, the right person in the right place, a development assistant called Tanya Seghatchian, read it, forwarded it to her bosses, who then bumped it up the chain to Warner Bros corporate. The rights were locked down for around $1m, in a complex negotiation with multiple interested parties, which tends to happen when one set of film producers get interested in something.\n\nThings could still have gone wrong. Many, many books are optioned for that amount or close and never go anywhere. There were dozens of kids books optioned by Warner Bros in 1998 for big ticket prices that you will never have heard of.\n\nBut David Heyman, producing for Warner's, hired the right screenwriter, Steve Kloves, who delivered a dynamite script. And then it still took two years from then to get the film cast, and the director assigned, and the pre-production to happen, and the script ironed out. Things could have gone wrong until the moment the cameras rolled (or even after). But enough things happened in the right order for it to work out.\n\nSo, partly Rowling's talent, partly word of mouth, partly the right people (at Scholastic, at Bloomsbury, at various UK and US trade magazines, at Warner's) liking the book at the right time for it to go ahead. Luck, lots of luck, as always.\n\nSources: Eccleshare, J, *A guide to the Harry Potter novels* (2004)\n\nSmith, S, *JK Rowling, A biography* (2002)\n\nAnelli, M, *Harry, A history* (2008)",
            "title_similarity": "0.7781422"
        },
        {
            "id": "hu4ike4",
            "score": 504,
            "text": "My major source for this post is *A Guide to the Harry Potter Novels* (2002) by Julia Eccleshare, who was children’s books editor for *The Guardian* until 2016.\n\n*Harry Potter and the Philosopher’s Stone* was published in the UK in June 1997 by Bloomsbury Publishing, a then-small company founded in 1986 that had only started publishing children’s books in 1994. Joanne Rowling’s agent, Christopher Little, had shopped the manuscript unsuccessfully to a number of publishers (nine? twelve? thirteen? depends on who you ask) over the course of a year or so before Bloomsbury obtained the rights in August 1996 and paid Rowling an advance of £2,500. On her publishers’ advice, Joanne adopted the *nom de plume* J. K. (she has no middle name; the K comes from her grandmother, Kathleen) on the theory that it made the book more appealing to boys. *Philosopher’s Stone* was published in an initial run of just 500 copies, a standard size for a debut children’s book from an unknown author.\n\nAt around 90,000 words, the book was seen by many publishers as too long (much like this post I expect lmao). Several other factors made *Harry Potter* in some ways an unlikely candidate for a future smash hit. Michelle Smith of Deakin University argues that in the British children’s publishing world, by the 1990s, “nobody wanted to touch fantasy stories — they were seen as old-fashioned.” Additionally, *Harry Potter* can be seen as inheriting from a long tradition of popular British boarding-school stories such as *Tom Brown’s School Days* (1857) or various series by Enid Blyton such as the *Malory Towers* series (1941-1945), a tradition that had largely fallen out of fashion after WWII as children’s librarians sought more “modern” material to engage a wider variety of young readers. Eccleshare writes that “children’s book publishing since the mid-1970s has concentrated, with some notable exceptions, on social realism and emphasized brevity and simplicity of language.” In bucking this trend, “Harry Potter was not unique but it was published against what was seen as the most flourishing strand in children’s books.” However, there was at this time some degree of opportunity for a disruptive force in British children’s literature. Since the death of the bestselling British author Roald Dahl in 1990, sales of newly published children’s books in the UK had dominated by American imports such as R. L. Stine’s *Goosebumps*; Eccleshare argues that “an heir to Dahl had long been looked for” by the British children’s publishing industry.\n\nAs usual with any new book, Bloomsbury sent copies to booksellers, librarians, professional reviewers, and so forth in hopes of generating some positive press; otherwise there was no marketing campaign to speak of, as the print run was too small to justify it. Favorable early reviews appeared in smaller media outlets such as *The Scotsman*, *The Herald*, and various specialist children’s literature periodicals; Eccleshare writes that “reviews of children’s books in the UK are rarely other than positive, so it is their existence as much as what they say that is important.” Likely drawing on these early reviews, further positive coverage appeared in major national papers such as *The Guardian* and *The Sunday Times*. Several reviewers compared Rowling’s work to Dahl’s.\n\nIn addition to (and indeed perhaps itself influencing) the positive media coverage, the early success of *Philosopher’s Stone* was due in no small part to grassroots, word-of-mouth buzz among children, who genuinely just liked the book a lot, and said as much to their parents, teachers, and librarians. Nigel Newton, chairman of Bloomsbury, gave the first three chapters to his eight-year-old daughter Alice, who read them eagerly and demanded more, saying, “Dad, this is so much better than anything else.” Beverly Lyon Clark, in *Kiddie Lit: The Cultural Construction of Children's Literature in America*, writes:\n\n>Part of the popularity of the Harry Potter series, especially initially, results from word-of-mouth recommendations, child to child. Reviewers and other critics cite librarians who stress how avidly children take to it, how much it has done to encourage children to read. Jim Trelease, the author of *The Read-Aloud Handbook*, has claimed, “‘Harry Potter' is the best thing to happen to children's books since the invention of the paperback.”\n\nA panel of adult judges shortlisted *Philosopher’s Stone* for the 1997 Nestlé Smarties Book Prize, which the BBC described as “one of the UK's most prestigious prizes in children's literature.” (Incidentally, Eccleshare chaired the prize from 2001 to 2007.) The three shortlisted books were then voted on by British schoolchildren; *Philosopher’s Stone* won “by a healthy margin.” Per Eccleshare, this was the critical event in the book's trajectory: just being shortlisted was a major coup for a debut novel, but winning outright “gave it a high profile within the first six months of publication, very different from most children’s books which take years to become established as successes.” Elsewhere Eccleshare writes: “Children’s books are traditionally slow performers since it takes time first for adults and then for children to adopt and so promote them.” *Philosopher’s Stone* would soon go on to win a number of other British awards voted on by children.\n\nArthur Levine at Scholastic, who had already acquired *Redwall* and *His Dark Materials* for American publication, bought the American publication rights to *Philosopher's Stone* at auction in April 1997—two months before its first British publication—for the unusually high sum of $105,000, which *Vox* asserts was \"10 times more than the average foreign rights sale at the time.\" Levine's love for the book, and his past success, convinced Scholastic execs that it was worth the gamble. This in turn necessitated a substantial marketing push in the US in an effort to recoup the publication cost, and also led to media curiosity about such a big sale. Upon its American publication in September 1998, aided by its British reviews, prizes, and sales numbers, *Harry Potter and the Sorcerer’s Stone* was an immediate success and won a number of American prizes as well. *Vox* argues that it was the huge sale of *Philosopher's Stone*'s American rights that really put it on the path to the stratosphere.\n\nSo what about the movie? Film producer David Heyman was in the market for a children’s book to turn into a film, but couldn’t secure the rights to his first choice, Diana Wynne Jones’s *The Ogre Downstairs*. According to Melissa Anelli’s *Harry, A History*, Heyman focused on filming books “because they had a higher chance of being produced than other types of projects,” and collected various candidates for his staffers to read. Heyman’s secretary, Nisha Parti, read the pre-publication proof of *Philosopher’s Stone* (which Little sent along after another staffer had read about it in a trade journal) and told Heyman to read it. Heyman “fell in love” with the book and got in touch with Warner Brothers, who eventually secured the film rights in October 1998 for “a seven-figure sum.” This was over a year after the publication of *Philosopher’s Stone* and three months after the publication of *Chamber of Secrets*; by that point the series was already well on its way to becoming a global phenomenon.",
            "title_similarity": "0.7324436"
        },
        {
            "id": "hu3ipyx",
            "score": -38,
            "text": "[removed]",
            "title_similarity": "-0.02789948"
        }
    ]
}