{
    "In a recent interview with Joe Rogan, Jordan Peterson claimed: \"Now, in many ways, the first book was the Bible. I mean, literally.\" To what extent (if at all) is this true?\nYou can watch him make this claim [here](https://www.youtube.com/watch?v=Vt9K6kmpx44) at 1:02, and I've transcribed it below:\n\n>Now, in many ways, the first book was the Bible. I mean, literally. Because, at one point, there was only one book. Like, as far as our Western culture is concerned, there was one book. And, for a while, literally, there was only one book, and that book was the Bible, and then, before it was the Bible, it was scrolls and writings on papyrus, but we were starting to aggregate written text together. And it went through all sorts of technological transformations, and then it became books that everybody could buy -- the book  everybody could buy -- and the first one of those was the Bible. And then became all sorts of books that everybody could buy, but all those books, in some sense, emerged out of that underlying book, and that book itself -- the Bible isn't a book; it's a library. It's a collection of books.\n\nIs this true at all? \n\n(Disclaimer: I'm a fan of neither Rogan nor Peterson. I'm only interested in fact-checking this seemingly falsifiable statement.)": [
        {
            "id": "hv3x3cr",
            "score": 1,
            "text": "Just putting this here at the top.\n\nIf you have an opinion that *what Jordan Peterson really meant was* (insert Gutenberg Bible, written word, impact on culture, or anything else) and are not providing an in-depth answer that meets out community rules. **Please do not post, your hot-take will be removed and if necessary further action may be taken.** \n\nIf you are just here to dogpile on why Jordan Peterson, Joe Rogan, or anyone else is the worst person, best person, or best-worst person, **please do not post.**\n\nAskHistorians is about history and how the public interacts with history. The question pertains to the history and your opinions are not History.\n\nThank you,\n\n-Soviet_Ghosts",
            "title_similarity": "0.5360221"
        },
        {
            "id": "hv12bv1",
            "score": 15,
            "text": "Welcome to /r/AskHistorians. **Please [Read Our Rules](https://www.reddit.com/r/AskHistorians/wiki/rules) before you comment in this community**. Understand that [rule breaking comments get removed](https://www.reddit.com/r/AskHistorians/comments/h8aefx/rules_roundtable_xviii_removed_curation_and_why/).\n\n#Please consider **[Clicking Here for RemindMeBot](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps://www.reddit.com/r/AskHistorians/comments/sh92go/in_a_recent_interview_with_joe_rogan_jordan/%5D%0A%0ARemindMe!%202%20days)** as it takes time for an answer to be written. Additionally, for weekly content summaries, **[Click Here to Subscribe to our Weekly Roundup](https://www.reddit.com/message/compose/?to=AHMessengerBot&subject=Subscribe&message=!subscribe)**.\n\nWe thank you for your interest in this *question*, and your patience in waiting for an in-depth and comprehensive answer to show up. In addition to RemindMeBot, consider [using our Browser Extension](https://www.reddit.com/r/AskHistorians/comments/d6dzi7/tired_of_clicking_to_find_only_removed_comments/), or getting the [Weekly Roundup](https://www.reddit.com/message/compose?to=subredditsummarybot&subject=askhistorians+weekly&message=x). In the meantime our [Twitter](https://twitter.com/askhistorians), [Facebook](https://www.facebook.com/askhistorians/), and [Sunday Digest](https://www.reddit.com/r/AskHistorians/search?q=title%3A%22Sunday+Digest%22&restrict_sr=on&sort=new&t=all) feature excellent content that has already been written!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AskHistorians) if you have any questions or concerns.*",
            "title_similarity": "0.46366417"
        },
        {
            "id": "hv41z5n",
            "score": 131,
            "text": "Given there's already an answer that explains why large parts of the statement are wrong with respect to the Middle East, I wonder if anyone can answer one question in specific: are there any books from China that would be older?\n\nBy this, I mean, if you take the date when the earliest parts of the Bible were first written in the Middle East - if I was an educated, well-connected and rich Chinese person could I go out and buy the equivalent of a book at that time? Or maybe find one somewhere like a temple or palace even if it's not for sale?",
            "title_similarity": "0.553879"
        },
        {
            "id": "hvb480r",
            "score": 33,
            "text": ">Not directly your field, but, any quick comments on notable Chinese or \"Indian\" specimens? (from u/doodoopop24)\n\nI could chip in on the ancient Chinese examples. \n\nLet me begin with [this photo of Da Yu ding](https://upload.wikimedia.org/wikipedia/commons/2/26/%E5%A4%A7%E7%9B%82%E9%BC%8E_Da_Yu_ding.jpg), a typical Western Zhou era (c. 1045 BC - 771 BC) ritual bronze vessel currently in the National Museum of China collections. While this may not look like a “book” we typically think of today, the appearance can be deceiving: [here is an image of the rubbing showing the inscription inside the Da Yu ding](https://upload.wikimedia.org/wikipedia/commons/1/17/Da_Yu_ding_inscription.jpg). The content of the inscription is about a nobility named Yu who cast this *ding* (a type of bronze ritual vessel) to commemorate the noble’s benefactor, King Kang of Zhou by enumerating the King’s great achievements at great length.  According to its inscriptions, Da Yu ding was completed in March on the twenty-third year of King Kang’s reign, or **1003 BC,** and it represents one of the oldest surviving Chinese “book” artifacts we have today. \n\nWhile Chinese bronze scripts originated during the late Shang period around 1300 BC, the length of inscriptions on an individual bronzeware increased dramatically around 12th century BC. The Da Yu ding example above is hardly unique or unusual. Western Zhou rulers tended to transcribe an entire book-length worth of text (as the length of a typical book contained in Chinese classical collections such as the *Shangshu*) in their bronze vessels. Note that bronze scripts were written in highly condensed grammar, with frequent use of shorthands in order to pack more information with fewer characters. \n\n[Here is arguably the **most famous** example of early Zhou “book” in the form of bronze scripts](https://upload.wikimedia.org/wikipedia/commons/4/4e/Mao_kung_Ting.JPG) – **Mao Gong ding ** – and if you zoom in this photo, you will see that the *ding*’s inside is completely covered in dense but artfully arranged texts, which presents the detailed biography of King Xuan of Zhou (828 BC - 782 BC). See also [this photo of Shi Qiang plate](https://upload.wikimedia.org/wikipedia/commons/7/77/Shi_Qiang_pan.jpg) made during the reign of King Gong of Zhou (962 BC - 900 BC), with its dense blocks of bronze scripts clearly visible. It describes the major achievements of the first six kings of Zhou, and is an invaluable artifact in verifying written history from Early Imperial China which served as the basis of traditional Chinese historiography.  Similarly, [here is a photo of the Lai plate](https://upload.wikimedia.org/wikipedia/commons/thumb/5/5c/Lai_Pan.JPG/1280px-Lai_Pan.JPG) made during the reign of King Xuan of Zhou (828 BC - 782 BC). Its 53.6cm diameter plate surface is completely covered in exceptionally fine bronze scripts, which records the history of the Shan noble clan for eight generations and their deeds in assisting the first twelve Kings of Zhou. The Lai plate confirmed the records of Zhou Tianzi's lineage as recorded in Sima Qian’s *Zhou Benji.*",
            "title_similarity": "0.51868516"
        },
        {
            "id": "hv1x5vm",
            "score": 11097,
            "text": "It'd be really hard to be more wrong. Every statement here but one ('It's a collection of books') is outright false.\n\n> Now, in many ways, the first book was the Bible.\n\nThe speaker seems very unclear about what they think 'book' means, but no definition could justify this. 'Books' in the sense of a single coherent and substantial piece of writing go back at least to the early 2nd millennium BCE. By contrast, the earliest parts of the Hebrew Bible date to around the 7th century BCE (somewhat earlier for isolated passages), and parts are as late as the 100s BCE; the Christian New Testament is 1st-2nd century CE.\n\n> I mean, literally. Because, at one point, there was only one book.\n\nIt's hard to imagine what scenario the speaker could be thinking of here. There are thousands of older books.\n\n> Like, as far as our Western culture is concerned, there was one book.\n\nThis has never been remotely true. The individual texts in the Hebrew Bible were composed over a period of, let's say, around 750 to 150 BCE (and the canon of which books to include wasn't decided until some centuries later). We have lots of books written before that period.\n\nEven if we grant that many older books were forgotten for much of history -- the hundreds of ancient Mesopotamian, Levantine, and Egyptian ancient texts that we have today -- even so, from the same period we have hundreds of books written by Greek authors. Nearly all of *Genesis* is younger than Hesiod and Homer. In the case of *Daniel*, we even have some books by Roman (Plautus) and Berber-Roman (Terence) authors that are older. Some New Testament texts contain quotations from pagan Greek books. Proto-*Isaiah* (*Isaiah* 1-39) is older than any Greek books -- but it isn't older than, say, *Gilgamesh*, which was still circulating in the 1st century BCE.\n\n> And, for a while, literally, there was only one book, and that book was the Bible, and then, before it was the Bible, it was scrolls and writings on papyrus, but we were starting to aggregate written text together. And it went through all sorts of technological transformations, and then it became books that everybody could buy -- the book everybody could buy -- and the first one of those was the Bible. And then became all sorts of books that everybody could buy, but all those books, in some sense, emerged out of that underlying book, and that book itself -- \n\nIt's hard to extract any concrete claims from this rambling. 'Scrolls and writings on papyrus' was the normal medium for publishing books in antiquity. 'Books that everybody could buy' were on sale in 5th century BCE Athens, nearly a millennium before the Bible was compiled. It's insane to claim that the *Book of the Dead* and the *Odyssey* and the *Aeneid* 'emerged out of' the Bible.\n\nThere have indeed been technological transformations over the millennia, but they have nothing to do with the Bible, except in that the Bible benefited from them. The use of alphabets (in western languages) rather than abjads, the use of parchment rather than papyrus, the use of the codex rather than the scroll, the use of minuscule writing rather than uncial: the Bible didn't drive any of these. It just benefited from them, in exactly the same way that every other book did. The first book we know of to be published in codex format (pages bound at the spine, as opposed to a scroll) and put on sale in a public bookshop wasn't the Bible, it was Ovid's *Metamorphoses* (reported in Martial [14.192](https://archive.org/details/martialepigrams02martiala/page/506/mode/2up?view=theater)) --\n\n> Look at this bulk! It's built out of many-layered leaves!  \n&nbsp; &nbsp; &nbsp; It holds fifteen books of Naso's poem.\n\nThe speaker finishes with the only true claim in their statement:\n\n> the Bible isn't a book; it's a library. It's a collection of books.\n\nThe individual texts in the Bible were written by various different authors at various different times over a period of many centuries: roughly 750-150 BCE in the case of the Hebrew Bible, roughly 40s-110s in the case of the Christian New Testament. For each corpus, the idea of compiling them together into a single canon is considerably later. The Torah (*Genesis-...-Deuteronomy*) was probably assembled not too long after the Exile, so roughly 5th-4th centuries BCE; *Joshua-Judges-Samuel-Kings* may have been assembled as a unit around the same time. The full Hebrew canon was decided centuries later, reaching its final form sometime not too long before 200 CE. A Christian canon was in the process of being formed in the late 100s (a fragment of a canonical list of texts survives from that time, the Muratorian Canon) but the full western Christian canon wasn't finalised until the Council of Rome in 382 CE. The deuterocanonical books weren't excised from Protestant Bibles until the 1500s. Based how the speaker refers to this history, though, it isn't clear how much of this they've grasped. Given how they understand the word 'book', my guess is: not much.\n\n*Edit:* corrected a formatting error in the Martial quotation, and an infelicity of wording in the following sentence.",
            "title_similarity": "0.7561573"
        },
        {
            "id": "hv1r9zn",
            "score": 42,
            "text": "[removed]",
            "title_similarity": "0.10275586"
        },
        {
            "id": "hv1wifx",
            "score": -15,
            "text": "[removed]",
            "title_similarity": "0.10275586"
        },
        {
            "id": "hxdvuwh",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.10275586"
        }
    ]
}