{
    "We have heard the term “Russian oligarchs” so often in the news lately for obvious reasons. Apparently this means a wealthy and politically connected person which carries specific connotations in post-USSR Russia. Why isn’t this term used in western countries?\n": [
        {
            "id": "hzegbxh",
            "score": 1,
            "text": "Welcome to /r/AskHistorians. **Please [Read Our Rules](https://www.reddit.com/r/AskHistorians/wiki/rules) before you comment in this community**. Understand that [rule breaking comments get removed](https://www.reddit.com/r/AskHistorians/comments/h8aefx/rules_roundtable_xviii_removed_curation_and_why/).\n\n#Please consider **[Clicking Here for RemindMeBot](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps://www.reddit.com/r/AskHistorians/comments/t6z8xb/we_have_heard_the_term_russian_oligarchs_so_often/%5D%0A%0ARemindMe!%202%20days)** as it takes time for an answer to be written. Additionally, for weekly content summaries, **[Click Here to Subscribe to our Weekly Roundup](https://www.reddit.com/message/compose/?to=AHMessengerBot&subject=Subscribe&message=!subscribe)**.\n\nWe thank you for your interest in this *question*, and your patience in waiting for an in-depth and comprehensive answer to show up. In addition to RemindMeBot, consider [using our Browser Extension](https://www.reddit.com/r/AskHistorians/comments/d6dzi7/tired_of_clicking_to_find_only_removed_comments/), or getting the [Weekly Roundup](https://www.reddit.com/message/compose?to=subredditsummarybot&subject=askhistorians+weekly&message=x). In the meantime our [Twitter](https://twitter.com/askhistorians), [Facebook](https://www.facebook.com/askhistorians/), and [Sunday Digest](https://www.reddit.com/r/AskHistorians/search?q=title%3A%22Sunday+Digest%22&restrict_sr=on&sort=new&t=all) feature excellent content that has already been written!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AskHistorians) if you have any questions or concerns.*",
            "title_similarity": "0.35761058"
        },
        {
            "id": "hzf8gb6",
            "score": -5,
            "text": "[removed]",
            "title_similarity": "0.0152709335"
        },
        {
            "id": "hzf4x36",
            "score": 44,
            "text": "[removed]",
            "title_similarity": "0.0152709335"
        },
        {
            "id": "hzgjfv6",
            "score": 1540,
            "text": "Let me take you back to 1995.\n\nRussia was out of money.\n\nThis was not an unusual thing -- as the Soviet Union fell apart things\ngot so bad with the space program [there were (untrue) rumors they\nwere going to sell the Mir](https://www.reddit.com/r/AskHistorians/comments/hn8xnf/the_mir_space_station_was_in_orbit_from_1986_to/fxgzdr6/),\nand later in the 90s (after money from a US space partnership ran out) they hawked space pens for QVC and got conned\nby a \"British businessman\" with a non-existent company.\n\nBut in 1995, Russia was _really_ out of money. The IMF and World Bank were tapped out for loans. That's where \"loans for shares\"\nhappened, and by no coincidence at all, exactly the year where \"Russian oligarch\" starts appearing together as a phrase. Before\nthat, the word's association was more loose, and if you meant anything by default in the 1980s, it was probably the government\nof Haiti.\n\nIt wasn't necessarily that oligarchs didn't exist before that point in Russia, but they weren't quite recognized as such yet. Going back to the\nfailed coup of 1991 and solidification of Yeltsin as leader of Russia, the journalist Yevgenia Albats later said in an interview:\n\n>I was running around Moscow on the last night of the coup, August 21. The city was dark. There were a lot of people on the streets. And I remember this very strong feeling that I lived through the best days of my life. Absolutely. It was such a great sense of victory, probably the first time in my journalistic life that I felt so tied to the people of the streets, and this amazing feeling--we did it.\n\nBehind the scenes, those in power soon after\n\n>... were involved in dividing offices that formerly belonged to the Central Committee of the Communist Party, and deciding who was going to get the crystal plates and china.\n\nThe seeds for this were set even earlier, during Communism. The attempts to make central planning rational were falling apart. The mathematician Naishul\nat Gosplan tells of complex mathematical models in the 1970s where after the work was done and an answer was given on such-and-such a decision,\nthose in charge simply modified the answers to what they wanted. Factory managers lobbied and pulled for resources, and as the Soviet Union\ncame closer and closer to collapse, the managers tugged harder and acquired more power, where the trading and dealing essentially took over.\n\nWhen Gorbechev in the late 80s reached for openness, the future oligarchs started their journey. Just picking one at\nrandom, Mikhail Fridman started a cooperative selling photography chemicals, and using the money from\nthat enterprise, eventually was a founder of Alfa-Bank (with Petr Aven) in January 1991, before the coup.\n\nThe company lasted past the coup and Fridman gained in power until he became known as Semibankirschina, one\nof the \"seven bankers\" in Yeltsin's inner circle:\n\n>...they control the access to budget money and basically all investment opportunities inside the \ncountry. They own the gigantic information resource of the major TV channels. They form the President's \nopinion. Those who didn't want to walk along them were either strangled or left the circle.\n\nThe \"loans-for-shares\" of 1995 was proposed by one of the bankers (Potanin of UNEXIM Bank) which was essentially\na hyper-privatization scheme. The government still owned a great many assets in various companies,\nand there was a series of auctions that were essentially a direct fraud, with very undervalued\nassets being traded for the instant cash Yeltsin needed. (To be fair, again: this was desperate\ncircumstance, and some people had gone without salaries for months by this point.)\n\nThere was a last gasp of an attempt at reform in 1998 -- when the economy was still dipping, and so\nwere Yeltsin's poll numbers -- that was far too late. Yeltsin tried to hand off economic development\nfrom one of the oligarchs (Chernomyrdin) to the reform-minded politician Sergei V. Kiriyenko, but, as noted by Gregory Freidin in the article \"Yeltsin Yields to the Oligarchs\":\n\n>...the moment of truth came when the oligarchs found out about Kiriyenko's plans to pull the plug on several major banks. The Central Bank was supposed to take them over and auction them off to the highest bidder (probably some financial institution in \nthe West, given the cash-strapped Russian economy). Threatened with the loss of their property, the oligarchs last weekend put the screws on Yeltsin. He caved and passed the reins back to Chernomyrdin, the principal draft horse of the energy and financial interests.\n\nYeltsin winning the election in 1998 required airdropping in so much money that the government and the oligarchs were intertwined. Yeltsin's single-digit poll numbers were\nsuch a liability and caused so much pressure that he finally resigned at the end of 1999, ahead of the next election, [handing over power to Putin](https://www.nytimes.com/2000/01/01/world/yeltsin-resigns-overview-yeltsin-resigns-naming-putin-acting-president-run-march.html).\n\n>Mr. Putin, 47, is the latest and most popular of a string of prime ministers Mr. Yeltsin had appointed in hopes of finding a malleable and viable successor. Since his appointment in August, Mr. Putin, a former K.G.B. official, has become Russia's most popular politician because of his tough-minded conduct of the war in Chechnya.\n\n...\n\nPostscript: The word does get applied to other countries, it is just the circumstances of Russia were so extreme it became almost sacrosanct. Jeffrey Winters argues in his 2011 book _Oligarchy_ that Singapore and the United States both count as \"Civil Oligarchies\", but that's starting to get into political science, and we're in the wrong venue for that.\n\nYou can watch a 1998 video of the QVC Space Pen segment on Youtube [here](https://www.youtube.com/watch?v=LGp9B7tSjgk).\n\nGoldman, M. I. (2003). _The Piratization of Russia: Russian Reform Goes Awry_. Taylor & Francis.\n\nHoffman, D. E. (2011). _The Oligarchs: Wealth And Power In The New Russia_. PublicAffairs.\n\nYavlinsky, G. (1998). Russia’s Phony Capitalism. _Foreign Affairs_, 77(3), 67–79. https://doi.org/10.2307/20048877",
            "title_similarity": "0.5608772"
        },
        {
            "id": "hzfl3nk",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.0152709335"
        },
        {
            "id": "hzgzktg",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.0152709335"
        }
    ]
}