{
    "\"Sk8er Boi\" (A. Lavigne 2002) argues that in high school dynamics, the so-called 'skaters' were low on the social pecking order. How accurately does this work represent turn-of-the-century teenage social order (at least in North American city/suburban schools)?\n[The artistry in question](https://www.youtube.com/watch?v=TIy3n2b7V9k). \n\nI find the implication that Sk8er is a *loser* intriguing because I feel like media has led me to associate skateboarding with being cool, and this song kinda subverts that understanding. The description that he's a punk I think lines up more with my perception of high school cliques and clichés—and I'm noticing now that I think the song actually frames him *more* as punk than skater, despite the song title—so I guess I'm curious if historically there's a connection between these subcultures, or if those are just two different facets of this individual. \n\nAnd if this *is* an accurate depiction, then is there an explanation in history as to why I tend to assume skateboarders are supposed to be cool despite reality?": [
        {
            "id": "hzn3ks1",
            "score": 1,
            "text": "Welcome to /r/AskHistorians. **Please [Read Our Rules](https://www.reddit.com/r/AskHistorians/wiki/rules) before you comment in this community**. Understand that [rule breaking comments get removed](https://www.reddit.com/r/AskHistorians/comments/h8aefx/rules_roundtable_xviii_removed_curation_and_why/).\n\n#Please consider **[Clicking Here for RemindMeBot](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps://www.reddit.com/r/AskHistorians/comments/t8cb38/sk8er_boi_a_lavigne_2002_argues_that_in_high/%5D%0A%0ARemindMe!%202%20days)** as it takes time for an answer to be written. Additionally, for weekly content summaries, **[Click Here to Subscribe to our Weekly Roundup](https://www.reddit.com/message/compose/?to=AHMessengerBot&subject=Subscribe&message=!subscribe)**.\n\nWe thank you for your interest in this *question*, and your patience in waiting for an in-depth and comprehensive answer to show up. In addition to RemindMeBot, consider [using our Browser Extension](https://www.reddit.com/r/AskHistorians/comments/d6dzi7/tired_of_clicking_to_find_only_removed_comments/), or getting the [Weekly Roundup](https://www.reddit.com/message/compose?to=subredditsummarybot&subject=askhistorians+weekly&message=x). In the meantime our [Twitter](https://twitter.com/askhistorians), [Facebook](https://www.facebook.com/askhistorians/), and [Sunday Digest](https://www.reddit.com/r/AskHistorians/search?q=title%3A%22Sunday+Digest%22&restrict_sr=on&sort=new&t=all) feature excellent content that has already been written!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AskHistorians) if you have any questions or concerns.*",
            "title_similarity": "0.5506934"
        },
        {
            "id": "hznglk3",
            "score": 2,
            "text": "[removed]",
            "title_similarity": "0.14387368"
        },
        {
            "id": "hzo3yf8",
            "score": 5508,
            "text": "The premise of this question is incorrect. At no point in the song is there a lyric that implies the skaters are low on the social pecking order.\n\nWhat the lyrics do describe are two separate social niches. The titular skater boy is a punk, and the girl who is initially interested in him is a ballerina. Her friends, presumably other ballet type girls, don’t consider the skaters someone worthy of dating, because the skaters were punks and wore baggy clothes. This makes sense if young ballerinas conceive of themselves as belonging to a refined, classy profession. For more on the way ballet has been perceived, [here's](https://www.reddit.com/r/AskHistorians/comments/1hlz5a/comment/cavp5lp/?utm_source=share&utm_medium=web2x&context=3) an (old) answer by [/u/Pizzaboxpackaging](https://www.reddit.com/user/Pizzaboxpackaging/). \n\nThe song doesn't describe the ballerinas as being popular, or looking down on the skaters because they are losers. It is simply the case that group social dynamics in this high school setting preclude one from associating with an out-group judged incompatible, regardless of where the two groups sit in a school-wide pecking order. \n\nWhile skaters in a given school may or may not be regarded as popular, since the lyrics describe a typically feminine profession looking down on a typically male archetype, the dynamic at play may instead be more focused on gender norms, rather than social pecking order per se. Kelly (2005) describes girls who try to involve themselves in the skater or punk subculture. In this study, skaters are specifically described as being among the cool people in school. Buckingham (2009) describes skater culture as having been used by clothing manufacturers to convey an image of 'cool' in marketing to a broader audience. All of which is to say, there is no indication that I could find that skaters were at all considered uncool, at least among the trendy press of North America. \n\nSo, to reiterate my original point: the skater boy was not considered undateable because he was low on the social pecking order. He was considered undateable because the girl who liked him was in a group that considered themselves too proper to date someone from a grungy subculture.  \n\nSources: \n\nKelly, DM; Pomerantz, S; Currie, D. 2005. Skater girlhood and emphasized femininity: ‘you can’t land an ollie properly in heels’. Gender and Education 17: 129-148.\n\nBuckingham, D. 2009. Skate perception: self-representation, identity, and visual style in a youth subculture. ‘Video Cultures: Media Technology and Everyday Creativity’ (eds Buckingham and Willett, Palgrave 2009)",
            "title_similarity": "0.6978248"
        },
        {
            "id": "hzo3uiv",
            "score": 1694,
            "text": "*I'm a communication professional who minored in music in college and specifically did courses in music history and music psychology/affect (and heard this song plenty as a skater at actual skateparks in the early 2000s), but there's an element of this that's sociological and a bit beyond my academic expertise (EDIT: which /u/noelparisian adds some academia for in his excellent answer). I'll do the best I can on the history of music and skateboarding, though:*\n\nFirst off, I think you may not quite be getting the lyrics: where you say that they paint the \"skaters as low on the pecking order\" all that it explicitly says is that the ballet clique thought the skaters were beneath them. This is an important distinction because it says as much about the dancers as it does about the skaters. That out of the way...\n\nSkateboarding, like punk, has historically been seen as a counter-culture activity all the way back to its origins as \"sidewalk surfing.\" Counter-culture in general has carried varying degrees of \"cool\" cachet over the years (beats, hippies, and so on) and skateboarding and punk were no different. The punk movement really started in the 1970s and skateboarding coalesced into the form we know it today (polyurethane wheels and purpose-built trucks) around the same time.\n\nLavigne's song came out right at the peak of skateboarding's popularity in the public consciousness. Skateboarding finally became shortlisted as a potential Olympic sport in 2015 and made its debut in ~~2001~~ 2021—after the X-Games launched in 1995 which put skateboarding on ESPN for the first time, and the Tony Hawk's Pro Skater video game series launched in 1999 and spread awareness of the sport/activity even further—and it's no coincidence that Lavigne released *Sk8r Boi* in 2002 (ETA:) during the period when X-Games attendance was at an all-time high in the 200,000+ range ([source](https://www.statista.com/statistics/205228/total-x-games-attendance/#:~:text=The%20first%20X%20Games%20in,attended%20by%20111.5%20thousand%20people.)).\n\nOne of the best primary sources for how connected punk culture and skater culture were at that time is soundtracks of the Tony Hawk video games: punk rock, ska, hip hop, and alternative rock. Obviously these genres are also associated with other activities, but the music in those games is basically what you would've heard at any skatepark in the early 2000s.\n\nSo why is the boy seen as somehow less? Because the girl represents highbrow culture (\"she did ballet\") and the boy represents the counterculture. To make a musical analogy, this is like a classical music aficionado in the 1920s looking down on jazz or a middle-America mom in 1958 reacting negatively to Elvis (who took a lot of stagecraft and musical flair previously associated with black artists and set it in front of a white audience). Whether the girl and her friends are right to look down on the boy is open to debate, and the whole point of the song is to take the stance that that idea of a cultural pecking order is flawed because their perceived social class is inverted in adulthood.\n\nIn short:\n\n* Punk and skateboarding were seen as related cultures at the time (and to some extent still are) which draw their \"cool\" image as a consequence of being counter-culture movements\n* The point of the song is to challenge the mainstream culture's preconceptions about the counter-culture, one of which is that the counter-culture is \"lesser\" in some way\n\nEDIT: Here's the soundtrack listing for games [1](https://tonyhawkgames.fandom.com/wiki/Tony_Hawk%27s_Pro_Skater_Soundtrack), [2](https://tonyhawkgames.fandom.com/wiki/Tony_Hawk%27s_Pro_Skater_2_Soundtrack), and [3](https://tonyhawkgames.fandom.com/wiki/Tony_Hawk%27s_Pro_Skater_3#Soundtrack) as a reference (these were the games which had been released by the time of *Sk8r Boi's* release)\n\nEDIT 2: For a dramatized sense of what skateboarding looked like in the 1970s as it transitioned from \"street surfing\" to the park-focused tricks we think of today, I recommend watching [Lords of Dogtown](https://www.imdb.com/title/tt0355702/). This is based on the real Zephyr skateboard team, who are also covered by the documentary [Dogtown and Z-Boys](https://www.imdb.com/title/tt0275309/?ref_=nv_sr_srsg_3).\n\nIf you want to know more about the history of punk music and culture, I recommend reading [Please Kill Me](https://www.goodreads.com/book/show/14595.Please_Kill_Me), which is an oral history of the punk subculture. Getting into whether the music of 1990s and 2000s skateparks was truly \"punk\" is another discussion, but there is still generally held to be a sort of musical lineage even if the newer music isn't truly \"punk\" in the 1970s sense.\n\nEDIT 3: Since this is a bit confusing and I don't clarify (I wrote the original answer just before falling asleep): as with any sport, skateboarding becoming widely popular must necessarily predate its inclusion in the Olympics (snowboarding is a good parallel as it was added in 1998 after the first worldwide competitions coalesced in the mid 1980s; this shows how relatively slow the IOC can be to adopt a sport). The \"peak popularity\" here refers to the period in the late 90s/early 2000s when skateboarding was prominent in popular culture; this is in contrast to earlier periods when it was relatively niche, and certainly in contrast to the 1980s when it experienced a relative lowpoint—there are numerous articles out there that discuss the sales dip in skateboard equipment in the 1980s relative to the 1970s and the resurgence in the mid/late 1990s. I certainly could've explained that better in the original post, but hopefully this clears up why I mention 2015 as an indicator of popularity in 2002.",
            "title_similarity": "0.7132906"
        },
        {
            "id": "hznjz1v",
            "score": -1,
            "text": "[removed]",
            "title_similarity": "0.14387368"
        }
    ]
}