{
    "While he was president of the Screen Actors Guild, Reagan fought for the members of the union to get residuals, healthcare, a pension and the ability to strike. When he became President of the US, Reagan was staunchly anti-union. What changed in that short 20-year period?\n": [
        {
            "id": "i1nhym1",
            "score": 1,
            "text": "Welcome to /r/AskHistorians. **Please [Read Our Rules](https://www.reddit.com/r/AskHistorians/wiki/rules) before you comment in this community**. Understand that [rule breaking comments get removed](https://www.reddit.com/r/AskHistorians/comments/h8aefx/rules_roundtable_xviii_removed_curation_and_why/).\n\n#Please consider **[Clicking Here for RemindMeBot](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps://www.reddit.com/r/AskHistorians/comments/tk1q8p/while_he_was_president_of_the_screen_actors_guild/%5D%0A%0ARemindMe!%202%20days)** as it takes time for an answer to be written. Additionally, for weekly content summaries, **[Click Here to Subscribe to our Weekly Roundup](https://www.reddit.com/message/compose/?to=AHMessengerBot&subject=Subscribe&message=!subscribe)**.\n\nWe thank you for your interest in this *question*, and your patience in waiting for an in-depth and comprehensive answer to show up. In addition to RemindMeBot, consider [using our Browser Extension](https://www.reddit.com/r/AskHistorians/comments/d6dzi7/tired_of_clicking_to_find_only_removed_comments/), or getting the [Weekly Roundup](https://www.reddit.com/message/compose?to=subredditsummarybot&subject=askhistorians+weekly&message=x). In the meantime our [Twitter](https://twitter.com/askhistorians), [Facebook](https://www.facebook.com/askhistorians/), and [Sunday Digest](https://www.reddit.com/r/AskHistorians/search?q=title%3A%22Sunday+Digest%22&restrict_sr=on&sort=new&t=all) feature excellent content that has already been written!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AskHistorians) if you have any questions or concerns.*",
            "title_similarity": "0.45496684"
        },
        {
            "id": "i1o1479",
            "score": 10,
            "text": "[removed]",
            "title_similarity": "0.065305695"
        },
        {
            "id": "i1o9qot",
            "score": -15,
            "text": "[removed]",
            "title_similarity": "0.065305695"
        },
        {
            "id": "i1qgy8k",
            "score": 1149,
            "text": ">They remind us that where free unions and collective bargaining are forbidden, freedom is lost. They remind us that freedom is never more than one generation away from extinction.\n\n>-- Ronald Reagan, talking on Labor Day, 1980\n\nYou might be a touch puzzled by the quote above, given just a year later Reagan was firing every one of the striking Air Traffic\nControl workers (11,345 of them) in a public address on television.  If you characterize Reagan's position as \"pro-everything-union-related\" or\n\"anti-everything-union-related\" you get something of a paradox. He did have particular principles, and tried to articulate those\nprinciples, but they have often been misunderstood, even at the historical moments the\nevents were happening.\n\n...\n\nHistorians -- and the direct writings of Reagan himself -- are essentially unanimous that his change in politics from a New Dealer to\na free-market conservative (that led up to\nhis 1964 speech in support of Goldwater) came from his time working for General\nElectric from 1954 to 1962. His primary job was hosting their Sunday television show. [You can watch an episode\nof the show here which he also acted in](https://www.youtube.com/watch?v=aa5vihLT6UE), where his introduction includes the slogan:\n\n>At General Electric, progress is our most important product.\n\nAlso as part of Reagan's job he was a \"goodwill ambassador\" and spent a quarter of his time touring in GE plants and giving speeches.\n\nAbout a year in Reagan's work he still considered himself a Democrat; he was accompanied on his GE tours by press secretary George Dalen\nand Reagan teased Dalen about his black suit marking him as a Republican, with Dalen replying that\nReagan had been \"taken in by Eleanor Roosevelt\".\n\nIn the meantime, though, part of Reagan's tour involved speechmaking to executives who were familiar with the ideas of the VP of GE (and union negotiator) Boulware, and Reagan\nwanted to be familiar too so he could communicate at the same wavelength. Reagan started to find what he called\n\"concrete examples\" of \"collectivism that threatens to inundate what remains of our free economy.\"\n\nWhen Reagan left GE, he had what he self-described as a \"postgraduate course in\npolitical science\" he no longer was. He soaked in GE's messages, including the GE vice president Boulware during his\nnegotations with labor (Boulware's philosophies of the free market where sometimes termed Boulwarism). \n\nTo give an example of the sort of reading Reagan was doing, consider Lewis Haney’s book _How You Really Earn Your Living_ and Henry Hazlitt's\n_Economics in One Lesson_, the latter being nearly a foundational text for late-20th-century free market thinkers.  They make an argument regarding the \"booms and busts\" of business:\n\n>America under free enterprise has been a land of surplus.\n\nand the driver of government deficit is war, but deficits under war can simply be corrected after war is over:\n\n>... for if we assume that there is any advantage in a budget deficit, then precisely the same budget deficit could be maintained as before by simply reducing taxes by the amount previously spent in supporting the wartime army.\n\nThis essentially formed the idea (for Reagan) that deficits are acceptable for national defense but should be avoided otherwise, that is, with social programs.\n\nIn the middle of Reagan's work with GE, he became president of the Screen Actor's Guild for a brief term from 1959 to 1960 (as opposed to his longer SAG presidency held from 1947 to 1952).\nThe big problem brewing at the time was a possible strike against movie producers for movies being shown on television without residuals being\npaid out. Simultaneous to all this, GE had their own strike to worry about, as members of the International Union of Electricians were themselves\nset to strike. So GE found themselves in the awkward scenario of their goodwill spokesperson urging a strike in one group while simultaneously\ntrying to quell a strike amongst themselves.\n\n(There is incidentally some grumbling that the final deal between SAG and the producers gave too much away, essentially trading away residuals\nfor movies produced before 1960 for a lump sum, but this seems to have been normal negotiation-trading as opposed to bending too quickly for a deal.)\n\nReagan registered no opinion on IUE's scenario, and Reagan was taken off his plant-speech tour while the IUE negotiations were getting close to start. This wasn't his choice but wasn't really Boulware's either,\nas having a company spokesman (Reagan) talking with workers could be considered an unfair labor practice, as it would constitute a secondary\nnegotiating representative. Roughly the same time as this there was a National Labor Relations Board case (Herman Sausage) that noted\nit an unfair practice to have a campaign not only during negotiations but also beforehand.\n\nSo paradox #1 (SAG union vs. IUE union negotiations happening simultaneously) is resolved that Reagan simply couldn't offer comment in the IUE case because as a company representative it\nwould violate labor practice.\n\n...\n\nParadox #2 happened when he was governor of California. In 1968 he signed the Meyers Milias Brown Act – which gave public employees collective bargaining rights. This was far\nfrom an anti-labor stance -- it actually greatly increased the number of unions in California.\n\nOn the other hand, during the exact same time, there was the Delano grape strike. This was kicked off when a thousand Filipino farm workers\nstarted a strike against grape growers, Mexican workers were hired as replacement workers, and Cesar Chavez's union was enlisted to helped \norganize the Mexican workers to join the strike as well. At the same time, Reagan ate a grape on TV and stated \"there is no strike\" and called what happened an \"illegal and\nimmoral maneuver\". Specifically, Reagan claimed that some of the workers as part of the protest were pressured by Chavez's union, and that\n\n>You organize a union by going to the workers themselves, and they choose voluntarily the organization they want, the group they want to belong to that they believe will represent them in securing the best in wages and working conditions. Cesar Chavez has sought to go over the heads of the workers to management ...\n\nI'm going to pass over if Reagan's characterization was fair -- the important point here is that by Reagan's principles, the union wasn't operating above board, and he still considered himself a union supporter. (It should be noted that the efforts on Chavez and the United Farmer Workers' part eventually led to the signing of the California Agricultural Labor Relations Act in 1975, considered a triumph by labor.)\n\n...\n\nFor the third paradox, we can refer to the Solidarity movement in Poland, where workers banded a million-strong in opposition to the Soviet government, demanding better working conditions. This led to a Soviet crackdown and Reagan's speech.\n\nPerhaps you might say ah-ha, that's simply self-serving as opposition to communism considering what happened the next year: the PATCO strike. The strike was actually in regard to a long-bubbling problem with Air Traffic Control workers (all employees of the federal government) and there was potential for the strike to happen during Carter's rather than Reagan's administration. The PATCO strike essentially was around a wage increase of $10,000 and a shorter workweek, but the union had a serious problem: all employees were required to sign an oath that they wouldn't strike. That is, by definition, a strike would be breaking the law. However, there was so little progress on PATCO demands that a strike was nonetheless voted for as an act of \"civil disobedience\".\n\nReagan didn't blink: he announced that every air traffic controller had 48 hours to return to work or be fired. This was by far the most public shutdown a union had seen for many years, and it emboldened conservatives -- George Will actually called it the day liberalism died.\n\nHowever, in the speech Reagan gave, he added himself text that he made very clear his standpoint: he was doing his act because a strike against the government was illegal, and that he was formerly SAG president, and he still fully supported the right to strike against private companies. This argument still has logical issues (the Poland worker strike, after all, was also technically against the government) but at least, it meant in his mind there was no contradiction, and according to his diary entries at the time he was genuinely furious about the illegality of the strike.\n\nThere was some pressure in Reagan's government to allow some of the fired workers to regain their jobs due to the difficulty of all the retraining required, although this never happened. At the least, the workers that did return were given significant wage increases (11.6%/year versus 4.8%/year for other federal workers), a point the Reagan administration raised against the claim they were anti-Union. \n\nWhatever Reagan's intention, that vast scope of Reagan's firing gave the energy to anti-union forces for many years after in all circumstances, public and private. Still, it really seemed from all evidence Reagan's issue was more directed. His action was not spur of the moment. Reagan writing in May 25, 1977:\n\n>A strike of pub. emps. manifests nothing less than an intent on their part to prevent or obstruct the operations of govt. until their demands are satisfied. Such action looking toward the paralysis of govt. by those who have sworn to support it is unthinkable & intolerable.\n\nWhile those were written in a Reagan essay, they were not his words. He was quoting the words of FDR.\n\n...\n\nEvans, T. W. (2008). *The Education of Ronald Reagan: The General Electric Years and the Untold Story of His Conversion to Conservatism*. Columbia University Press.\n\nMcCartin, J. A. (2011). *Collision Course: Ronald Reagan, the Air Traffic Controllers, and the Strike that Changed America*. Oxford University Press.",
            "title_similarity": "0.8208831"
        }
    ]
}