{
    "I AM LEONIDAS, KING OF SPARTA! ASK ME ANYTHING!\nGREETINGS, REDDIT! I AM LEONIDAS, THIRD SON OF KING ANAXANDRIDAS AND FIRST IN FAME OF THE AGIAD HOUSE! THE EPHORS HAVE DECREED A RARE DAY OF OPENNESS TO THE CURIOSITY OF FOREIGNERS!\n\n[PROOF!](https://imgur.com/az1mAT5)": [
        {
            "id": "i2zrfbl",
            "score": 0,
            "text": "Why all caps bro chill out",
            "title_similarity": "0.27438974"
        },
        {
            "id": "i2zfez6",
            "score": 1,
            "text": "You suck and Sparta is overrated.  That's not a question. Fight me.",
            "title_similarity": "0.36579007"
        },
        {
            "id": "i323n51",
            "score": -1,
            "text": "Of course they don’t delete this fucking post. This sub is an array of disgrace.",
            "title_similarity": "0.2639795"
        },
        {
            "id": "i30078j",
            "score": -1,
            "text": "all caps? unreadable.",
            "title_similarity": "0.08329334"
        },
        {
            "id": "i307yj2",
            "score": -1,
            "text": "Is it allowed to think this is cringe?",
            "title_similarity": "0.19514775"
        },
        {
            "id": "i30j1qf",
            "score": 1,
            "text": "Who would win IF Philip of Macedon challenged you to a 1v1?",
            "title_similarity": "0.53036386"
        },
        {
            "id": "i30jzbx",
            "score": 1,
            "text": "Do you think you could have bested scipio africanus in a fight?",
            "title_similarity": "0.43882596"
        },
        {
            "id": "i2zrcyw",
            "score": 2,
            "text": "The Persian Empire was better than anything the Greeks cobbled together. \n\nYeah. I said it. What are you gonna do about it?",
            "title_similarity": "0.6027644"
        },
        {
            "id": "i304qrn",
            "score": 2,
            "text": "What is this?",
            "title_similarity": "0.102661215"
        },
        {
            "id": "i2zw329",
            "score": 4,
            "text": "What are your suggestions for proper loincloth care? Are there tactical considerations?",
            "title_similarity": "0.20004863"
        },
        {
            "id": "i2zvwo5",
            "score": 5,
            "text": "Do you ever have sex with other men? And if so would you like to have sex with me?",
            "title_similarity": "0.33350122"
        },
        {
            "id": "i2zge0d",
            "score": 8,
            "text": "Are you straight or is that just Persian propaganda!",
            "title_similarity": "0.3131259"
        },
        {
            "id": "i2zdkld",
            "score": 32,
            "text": "I AM KING XERXES BOW DOWN TO ME AND MY NIPS",
            "title_similarity": "0.5695263"
        },
        {
            "id": "i2zf4lc",
            "score": 11,
            "text": "Many visitors—even diplomats—do not know where they are when they visit your lovely city-state.  It's gotten so bad that you have to constantly remind them that THIS.  IS.  SPARTA.  As king of the Lacedaemons, how do you plan to improve Greek education, particularly geography?",
            "title_similarity": "0.6531544"
        },
        {
            "id": "i2yvu86",
            "score": 35,
            "text": "Greetings son of war!\n\nI come from tall golden towers of Phoenicia, I have 2 questions for you",
            "title_similarity": "0.7248694"
        },
        {
            "id": "i2z6r8t",
            "score": 40,
            "text": "How did you get those abs?",
            "title_similarity": "0.2837652"
        },
        {
            "id": "i2yukmc",
            "score": 62,
            "text": "Have you ever thought of not using the caps lock key for writing answers or would that be borderline Athenian?",
            "title_similarity": "0.38316494"
        },
        {
            "id": "i2ypsww",
            "score": 85,
            "text": "I've heard you're not very kind to the children of Sparta :( Is it true that you subject them to a grueling, psychologically damaging training and indoctrination regiment in a twisted attempt to secure loyalty and military security?",
            "title_similarity": "0.47735864"
        },
        {
            "id": "i2yyd1c",
            "score": 110,
            "text": "Do you prefer to identify as Laconian, Lacedaemonian, or Spartan? In my translation of Herodotus I’m pretty sure you were using the battle cry: “This is Lacedaemon!”\n\nAnd what is your honest opinion about the Lesbians?",
            "title_similarity": "0.550986"
        },
        {
            "id": "i2z2yww",
            "score": 168,
            "text": "You Spartans and your talk of your men-only barracks and your disinterest in women. I put it to you that if the women of Sparta organised themselves and withheld sex from their husbands, then the men of Sparta would fall to their knees, willing to do whatever it took - coming to a truce with Athens, for instance - in order to feel the sweet touch of a woman. What say you?",
            "title_similarity": "0.5183027"
        },
        {
            "id": "i2ypx1w",
            "score": 579,
            "text": "Hello, I am a helot. I don't think I'm supposed to be here, I just wandered in by accident. If you could just point me to the nearest unworked field, I would much appreciate it and be on my way. Please don't declare war on us again.",
            "title_similarity": "0.45488054"
        },
        {
            "id": "i2yp1fa",
            "score": 1235,
            "text": "In light of recent events, have you updated your opinions on javelins?",
            "title_similarity": "0.39366966"
        },
        {
            "id": "i2yosts",
            "score": 485,
            "text": "Truly, you were a king of much *pru*, but we must inquire as to why you did not chose to charge from the start. As Justin has written, but six hundred of you were able to slay many of the Persian horde with little difficulty. Surely with four thousand noble *hommes d'armes* you could have put the Saracen to flight, no matter his countless numbers?",
            "title_similarity": "0.5879555"
        },
        {
            "id": "i2yqs08",
            "score": 60,
            "text": "What is your honest opinion on black soup?",
            "title_similarity": "0.24187008"
        },
        {
            "id": "i2yqs5p",
            "score": 347,
            "text": "I always wanted to know... Is that Sparta? Or is this Sparta?",
            "title_similarity": "0.50675434"
        },
        {
            "id": "i2yr4on",
            "score": 114,
            "text": "Whilst your defense of Thermopylae is an epic tale waiting to be written, how do you feel about the Athenians who already now are claiming to be the real saviours of Greece from the Persian invaders?\n\nCould they ever be a threat to Sparta and how might a war against them play out?",
            "title_similarity": "0.6256181"
        },
        {
            "id": "i2yrc13",
            "score": 266,
            "text": "How likely are you to participate in another epic rap battle of history? Because if you do, I wrote a line for you:  \n\n\nTo answer the question, profession is flexin' on Esther and Nestor.",
            "title_similarity": "0.6195444"
        },
        {
            "id": "i2yrtzj",
            "score": 81,
            "text": "What is your opinion of Thebans?",
            "title_similarity": "0.23896722"
        },
        {
            "id": "i2ys2lq",
            "score": 171,
            "text": "What's the best Greek holding action of the Persian Wars and why is it Artemision?",
            "title_similarity": "0.6255017"
        },
        {
            "id": "i2ysb9w",
            "score": 9,
            "text": "Why didn’t 300 continue the 10,000 Spartans story instead of boats",
            "title_similarity": "0.457472"
        },
        {
            "id": "i2ysl3q",
            "score": 709,
            "text": "Why do you guys have a deep hole without any railings in the middle of town?",
            "title_similarity": "0.21751428"
        },
        {
            "id": "i2yudts",
            "score": 149,
            "text": "Would you ever consider acting in a role in an Athenian theatre play?",
            "title_similarity": "0.34719184"
        },
        {
            "id": "i2yvxbd",
            "score": 13,
            "text": "Hello,\nDo you have a PR department that works on your bad ass remarks/ replies? Or did you came up with all of them on your own?",
            "title_similarity": "0.4382224"
        },
        {
            "id": "i2yws77",
            "score": 114,
            "text": "I've heard having 2 kings is alright, but have you ever thought about 3 kings? That's where it's at!",
            "title_similarity": "0.6184597"
        },
        {
            "id": "i2yynrn",
            "score": 33,
            "text": "Greetings, king. Just like Xenophon (who hasn't been born yet), I am positively fascinated by the oddity of your institutions and inheritance laws. What do you make of the enormous fortunes accrued by your women? It is said that sometimes even the kings themselves depend on loans from these women. Or is it just Athenian slander and exaggeration? \n\n\nOn a more personal level, how hard is to rule alongside another king? Do you quarrel often? Do you see matters eye to eye?",
            "title_similarity": "0.5971675"
        },
        {
            "id": "i2yz2wl",
            "score": 77,
            "text": "Hail noble Spartan! What did you think of your elder brother Dorieus the Coloniser?",
            "title_similarity": "0.68843675"
        },
        {
            "id": "i2z03de",
            "score": 81,
            "text": "My hair is a bit unruly, do you have any tips for hair care?",
            "title_similarity": "0.25379783"
        },
        {
            "id": "i2z0e5d",
            "score": 3,
            "text": "Is cereal soup?",
            "title_similarity": "0.20041198"
        },
        {
            "id": "i2z1xe5",
            "score": 99,
            "text": "If Sparta was a democracy, do you think Spartans would vote to support your use of ALL CAPS?",
            "title_similarity": "0.52308965"
        },
        {
            "id": "i2z2bk3",
            "score": 3,
            "text": "Where is this?",
            "title_similarity": "0.09478155"
        },
        {
            "id": "i2z2ve4",
            "score": 13,
            "text": "How do you feel about Peloponnese going to war? Do feel sad that your people will fight former allies?",
            "title_similarity": "0.45607498"
        },
        {
            "id": "i2z3lox",
            "score": 6,
            "text": "The feats of *your* 300 are well known and we sing about them today, indeed μολὼν λαβέ is still used today by militaries and writers of lucid plays we call \"moving pictures\" (similar to Plato's cave allegory but in color with more detail, and snacks), but what of Sparta's *other* 300 who fared *not* so well against Argos?",
            "title_similarity": "0.65414315"
        },
        {
            "id": "i2z3o4x",
            "score": 33,
            "text": "Alkman or Tyrtaios?",
            "title_similarity": "0.301237"
        },
        {
            "id": "i2z4izf",
            "score": 3,
            "text": "What are your opinions on Kratos?",
            "title_similarity": "0.3197249"
        },
        {
            "id": "i2z4q1q",
            "score": 229,
            "text": "DO YOU REALIZE YOU MIGHT HAVE A HEARING IMPAIRMENT?",
            "title_similarity": "0.15750062"
        },
        {
            "id": "i2z5mt8",
            "score": 111,
            "text": "Do you have an inside voice?",
            "title_similarity": "0.12940034"
        },
        {
            "id": "i2z6wwy",
            "score": 41,
            "text": "What is your opinion of the Makedonians, and how likely do you think they ever are to surpass the glories of Sparta?",
            "title_similarity": "0.57109314"
        },
        {
            "id": "i2z7k73",
            "score": 2,
            "text": "Hello mighty King. How does your fellow countrymen hold a spear? Over the shoulder? Or under the arm?",
            "title_similarity": "0.48757917"
        },
        {
            "id": "i2z7vll",
            "score": 2,
            "text": "Always good to hear from you your majesty. I congratulate you on your sixth anniversary on reddit! I always wondered, is it true Sparta had two lines of kings? If so, whatever for?",
            "title_similarity": "0.67888236"
        },
        {
            "id": "i2z916i",
            "score": 36,
            "text": "As the leader of one of the most famous small forces in history, do you have any advice for leaders of small forces today?",
            "title_similarity": "0.5286219"
        },
        {
            "id": "i2za56k",
            "score": 39,
            "text": "Did you really shout \"molan labe\" to Xerxes when he asked Sparta to lay down their weapons or was that exaggerated?",
            "title_similarity": "0.5766407"
        },
        {
            "id": "i2zaaks",
            "score": 3,
            "text": "Would you rather fight 100 duck-sized horses or one horse-sized duck?",
            "title_similarity": "0.4130226"
        },
        {
            "id": "i2zayva",
            "score": 100,
            "text": "Sorry, you're kind of stood in the way here. Would it be possible to get past please?",
            "title_similarity": "0.26144785"
        },
        {
            "id": "i2zbbnu",
            "score": 6,
            "text": "It has been remarked by some that \"History is written by the victors,\" yet I think this is not always so. Have you Spartans ever considered making an effort to commit your histories to writing, as is the practice of the Athenian boy-lovers, lest postarity come to remember you only through the eyes of those weaklings whom you have defeated?",
            "title_similarity": "0.61454684"
        },
        {
            "id": "i2zcfco",
            "score": 23,
            "text": "Are you Scottish?",
            "title_similarity": "0.21309258"
        },
        {
            "id": "i2zcu6p",
            "score": 179,
            "text": "Would you rather fight 10 Persian sized ducks or 10,000 duck sized Persians?",
            "title_similarity": "0.42309347"
        },
        {
            "id": "i2zcu8p",
            "score": 2,
            "text": "How was your agoge, you fucking maniac?",
            "title_similarity": "0.36434117"
        },
        {
            "id": "i2zcy4m",
            "score": 6,
            "text": "I just saw Pliny The Elder was here, but you won't know about him.",
            "title_similarity": "0.45787978"
        },
        {
            "id": "i2zeb03",
            "score": 9,
            "text": "How do you feel about having house cats named after you?",
            "title_similarity": "0.2594837"
        },
        {
            "id": "i2zebqq",
            "score": 1,
            "text": "thoughts of persians?",
            "title_similarity": "0.28915876"
        },
        {
            "id": "i2zevhf",
            "score": 2,
            "text": "Is it true that Cleomenes died of ligma?",
            "title_similarity": "0.3717156"
        },
        {
            "id": "i2zg7ru",
            "score": 2,
            "text": "Hi Lionel! Long time fan. My question: \n\nDo you prefer hard or soft shell tacos?",
            "title_similarity": "0.51518416"
        },
        {
            "id": "i2zhsu1",
            "score": 3,
            "text": "Why did Macedonia leave sparta alone?",
            "title_similarity": "0.3138338"
        },
        {
            "id": "i2zhx55",
            "score": 2,
            "text": "So Kanye said the 300 were romans. Thoughts?",
            "title_similarity": "0.53858256"
        },
        {
            "id": "i2ziaij",
            "score": 1,
            "text": "Do you ever look back at the other people claiming to be leonidas on this sub in past years and want to call them out for being wrong?",
            "title_similarity": "0.4663694"
        },
        {
            "id": "i2ziffg",
            "score": 1,
            "text": "Was the spartan military really all that or have we all just fallen pray to the worlds longest propaganda campaign?",
            "title_similarity": "0.6458566"
        },
        {
            "id": "i2zj1og",
            "score": 1,
            "text": "What do you think of Macedon?",
            "title_similarity": "0.37936532"
        },
        {
            "id": "i2zj83o",
            "score": 1,
            "text": "Why did you guys talk about freedom and not being enslaved by the Persians when you yourselves have slaves and a king?  Its not like you were much better.",
            "title_similarity": "0.5209018"
        },
        {
            "id": "i2zkm6z",
            "score": 1,
            "text": "How did you learn English ?",
            "title_similarity": "0.19278303"
        },
        {
            "id": "i2zl5y3",
            "score": 1,
            "text": "I would like to invite you and your lovely wife for a nice dinner. What are your favorite foods?",
            "title_similarity": "0.41091788"
        },
        {
            "id": "i2znpu5",
            "score": 10,
            "text": "Are we related?",
            "title_similarity": "0.19750367"
        },
        {
            "id": "i2zod56",
            "score": 17,
            "text": "I think we're all familiar with Leonidas the warrior, but tell me more about Leonidas the guy. When you get home at the end of a battle, what comes next? Hang up your cloak, crack open a Cold One, do some needlepoint -- how does Leonidas unwind at the end of a stressful day?",
            "title_similarity": "0.49115694"
        },
        {
            "id": "i2zp5ec",
            "score": 5,
            "text": "Hello my King. What city state has the second greatest warriors, after Sparta?",
            "title_similarity": "0.68997085"
        },
        {
            "id": "i2zplkr",
            "score": 1,
            "text": "what is your opinion of twinks",
            "title_similarity": "0.21687633"
        },
        {
            "id": "i2zppcw",
            "score": 1,
            "text": "Is it true that most Spartans are gay?",
            "title_similarity": "0.47804767"
        },
        {
            "id": "i2zqozb",
            "score": 8,
            "text": "This is madness!",
            "title_similarity": "0.14662236"
        },
        {
            "id": "i2zquc9",
            "score": 3,
            "text": "How do you feel about Themistokles taking much of the credit for the Greek victory in the Persian war?",
            "title_similarity": "0.5502702"
        },
        {
            "id": "i2zrmrr",
            "score": 60,
            "text": "Leo my man, I always appreciate how you take time out of your busy schedule to join us (almost) every year. So I'll ask, what do you feel about the current state of your image? Pleased that the PR keeps working thousands of years later?",
            "title_similarity": "0.6316249"
        },
        {
            "id": "i2zrwx4",
            "score": 1,
            "text": "Were yall actually super ripped and muscular, every man with a six pack?",
            "title_similarity": "0.3486021"
        },
        {
            "id": "i2zrxbs",
            "score": 1,
            "text": "Thoughts on the new *Halo* TV show?",
            "title_similarity": "0.42685425"
        },
        {
            "id": "i2zs4ka",
            "score": 1,
            "text": "I loved your work on the rock/Persian scout wall. Do you offer any other building services?",
            "title_similarity": "0.4766032"
        },
        {
            "id": "i2zsdtb",
            "score": 1,
            "text": "Have you heard of the Master Chief? Do you consider him or any like him to be true Spartans?",
            "title_similarity": "0.53004396"
        },
        {
            "id": "i2zsik1",
            "score": 1,
            "text": "FELLOW MAN OF COMBAT! WHAT IS THE BEST WAY TO SUBMIT THY FOE?",
            "title_similarity": "0.45008257"
        },
        {
            "id": "i2zstpn",
            "score": 10,
            "text": "Have you become comfortable making your own decisions yet?",
            "title_similarity": "0.14552428"
        },
        {
            "id": "i2zsukd",
            "score": 5,
            "text": "How do you feel about Michigan State University and their appropriation of your culture for the sports teams?",
            "title_similarity": "0.46934405"
        },
        {
            "id": "i2ztob4",
            "score": 1,
            "text": "Have you considered apologizing to Athens and the other cities who contributed ships for failing to hold the Hot Gates and thus undermining their excellent victories at Artemesium?",
            "title_similarity": "0.5502795"
        },
        {
            "id": "i2ztw0z",
            "score": 1,
            "text": "So, breasts or thighs? Also, worcestershire sauce or mustard?",
            "title_similarity": "0.29767174"
        },
        {
            "id": "i2ztyhj",
            "score": 3,
            "text": "Pants?",
            "title_similarity": "0.073124014"
        },
        {
            "id": "i2zu3wk",
            "score": 1,
            "text": "Your tactics and training have been found to be *overhyped* at best and barbaric at worst compared to your contemporaries. What do you have to say in your defense?",
            "title_similarity": "0.37739956"
        },
        {
            "id": "i2zu6ag",
            "score": 1,
            "text": "How do you feel about Aristodemus after all that went down up to and including Platea?",
            "title_similarity": "0.39153478"
        },
        {
            "id": "i2zufx0",
            "score": 1,
            "text": "You seem super hostile. Have you thought about seeing a therapist?",
            "title_similarity": "0.32288045"
        },
        {
            "id": "i2zuns8",
            "score": 1,
            "text": "What would you have done different at Thermopylae?",
            "title_similarity": "0.28036195"
        },
        {
            "id": "i2zv3oc",
            "score": 17,
            "text": "So, just to be definitive:\n\nLEE-OH-NIGH-DUS or LEOH-NEE-DAS?",
            "title_similarity": "0.40114394"
        },
        {
            "id": "i2zv8yz",
            "score": 1,
            "text": "you disappointed me, i was expecting a rick roll of [unspeakable](https://twitter.com/UnrivaledHaloAd/status/1509919779074707459/photo/1) proportions",
            "title_similarity": "0.5719979"
        },
        {
            "id": "i2zvise",
            "score": 1,
            "text": "Didn't you die?",
            "title_similarity": "0.18093255"
        },
        {
            "id": "i2zw5bs",
            "score": 1,
            "text": "WHERE ARE WE?",
            "title_similarity": "0.117614314"
        },
        {
            "id": "i2zwetm",
            "score": 1,
            "text": "I thought Spartans spoke laconically what’s with the drawn out sentences",
            "title_similarity": "0.44301823"
        },
        {
            "id": "i2zwoce",
            "score": 2,
            "text": "who is the other king of Sparta?",
            "title_similarity": "0.4391706"
        },
        {
            "id": "i2zwxsh",
            "score": 1,
            "text": "what’s your workout routine",
            "title_similarity": "0.18784212"
        },
        {
            "id": "i2zx6t2",
            "score": 1,
            "text": "Hello I have joined the efforts of great spartan King Dorieus to establish a colony in along the Libyan coast. Apparently the locals are gathering and are being given weapons by some small insignificant city state called \"Carthage\". Should I be concerned?",
            "title_similarity": "0.62939674"
        },
        {
            "id": "i2zx8hy",
            "score": 4,
            "text": "Just curious and not saying this is definitely going to happen or not, but how would you feel if a contingent of Spartan fighting men became surrounded by their enemies (the soldiers of another Greek city, let us imagine) and, finding their situation desperate, the Spartans allowed themselves to be taken as prisoners by their enemies? I'm thinking this would probably take place on an island.",
            "title_similarity": "0.53807086"
        },
        {
            "id": "i2zxe46",
            "score": 2,
            "text": "What is your opinion of the Athenian Alkibiades? Is it true that Astyochus ordered him killed? Was Astyochus wrong to do so?",
            "title_similarity": "0.41774023"
        },
        {
            "id": "i2zxqre",
            "score": 2,
            "text": "Do you prefer soup or salad?",
            "title_similarity": "0.11530939"
        },
        {
            "id": "i2zy1da",
            "score": 10,
            "text": "You do know you’re meant to *survive* the battles you lead so you can utterly crush your opponent, right old chap?",
            "title_similarity": "0.50718164"
        },
        {
            "id": "i2zyyxk",
            "score": 1,
            "text": "You've previously mentioned that this is, in fact, your inside voice. What then is your outside voice?",
            "title_similarity": "0.22813134"
        },
        {
            "id": "i2zz62a",
            "score": 1,
            "text": "Why did people shun Aristodemus? You ordered him to go back and he did. Would it have been better for him to disobey you and refuse to leave? Seems like a lose-lose situation",
            "title_similarity": "0.37261453"
        },
        {
            "id": "i3001ig",
            "score": 1,
            "text": "What are the pros and cons of duarchy?",
            "title_similarity": "0.3397325"
        },
        {
            "id": "i30041c",
            "score": 1,
            "text": "Have you heard of Kangaroos?",
            "title_similarity": "0.21809281"
        },
        {
            "id": "i3004d4",
            "score": 1,
            "text": "What if this is not Sparta?",
            "title_similarity": "0.15863404"
        },
        {
            "id": "i300dqa",
            "score": 1,
            "text": "Where'd you get the coconut?...",
            "title_similarity": "0.27305847"
        },
        {
            "id": "i300g3f",
            "score": 1,
            "text": "Has anybody ever told you that you really look like the Egyptian god Set? It's Uncanny",
            "title_similarity": "0.544797"
        },
        {
            "id": "i300j30",
            "score": 1,
            "text": "What do you think about your nephew and grand-nephew's alliance with Persia in their war against Athens?",
            "title_similarity": "0.5617181"
        },
        {
            "id": "i300jlv",
            "score": 2,
            "text": "Why are you the only one capable of protecting Morgan Freeman?",
            "title_similarity": "0.37813705"
        },
        {
            "id": "i300l9d",
            "score": 23,
            "text": "What's it like being the most famous loser in history?",
            "title_similarity": "0.49466807"
        },
        {
            "id": "i300zmq",
            "score": 1,
            "text": "What did you think of the movie \"300\"?",
            "title_similarity": "0.3682092"
        },
        {
            "id": "i3012zu",
            "score": 2,
            "text": "are you circumcised?",
            "title_similarity": "0.21930575"
        },
        {
            "id": "i301chc",
            "score": 2,
            "text": "What were your favorite hobbies as a young lad?",
            "title_similarity": "0.42506537"
        },
        {
            "id": "i301lef",
            "score": 2,
            "text": "Do you consider Sparta more a military or PR power?  Answer honestly.",
            "title_similarity": "0.4908591"
        },
        {
            "id": "i301oyn",
            "score": 2,
            "text": "Why did you really throw Alexios off of Mount Taygetos?",
            "title_similarity": "0.43971425"
        },
        {
            "id": "i301peu",
            "score": 2,
            "text": "With the retirement of Stephanos son of Hodkin, have the ephors seen fit to appoint a worthy successor to teach us the truth of Lakonia?",
            "title_similarity": "0.54579246"
        },
        {
            "id": "i301rus",
            "score": 3,
            "text": "If Alexander invades Laconia, will you be destroyed, never to rise again?",
            "title_similarity": "0.4186378"
        },
        {
            "id": "i301sk1",
            "score": 2,
            "text": "so i've readied my breakfast and eaten heartily... where should we go for dinner tonight??",
            "title_similarity": "0.43778622"
        },
        {
            "id": "i302duc",
            "score": 2,
            "text": "Why didn’t you go for the head of Xeroxes?",
            "title_similarity": "0.3830136"
        },
        {
            "id": "i302er7",
            "score": 2,
            "text": "What's your favorite food?",
            "title_similarity": "0.30179352"
        },
        {
            "id": "i3032fk",
            "score": 2,
            "text": "So why skirts n sandals for battle wear ?",
            "title_similarity": "0.32171774"
        },
        {
            "id": "i303brc",
            "score": 2,
            "text": "Now we hear a lot of your great city Sparta. And of course Sparta is the greatest city in the world, but what do you think of other Greek cities like Byzantium, Smyrna, Angora?",
            "title_similarity": "0.6965152"
        },
        {
            "id": "i303i04",
            "score": 2,
            "text": "Lmao this is hilarious",
            "title_similarity": "0.32664907"
        },
        {
            "id": "i3053wa",
            "score": 2,
            "text": "Should be a day for silly historical AMAs every month I swear this is freaking awesome",
            "title_similarity": "0.6125474"
        },
        {
            "id": "i3057py",
            "score": 1,
            "text": "How long is it",
            "title_similarity": "0.08679061"
        },
        {
            "id": "i305unx",
            "score": 7,
            "text": "Dear Leonidas,\n\n\nThat kick - yes, **that** kick - was mighty. How often does leg day come around. And can you give us some tips?\n\n\nThanks, \n\nWannabekicker",
            "title_similarity": "0.58825076"
        },
        {
            "id": "i3068ie",
            "score": 2,
            "text": "How do you respond to the allegations that Heracles was not a historical figure which puts Spartan lineage in question?",
            "title_similarity": "0.38993323"
        },
        {
            "id": "i306gur",
            "score": 2,
            "text": "Have you heard the news, noble lord, about the uprising of the Helots?",
            "title_similarity": "0.50466096"
        },
        {
            "id": "i307cy5",
            "score": 6,
            "text": "How do you respond to those who say your chocolate is inferior to Pierre Marcolini and Neuhaus?",
            "title_similarity": "0.37202138"
        },
        {
            "id": "i3081t7",
            "score": 4,
            "text": "Do you have a view on the Greek debt crisis?",
            "title_similarity": "0.3614455"
        },
        {
            "id": "i308b6m",
            "score": 1,
            "text": "Why am I reading this?",
            "title_similarity": "0.22070122"
        },
        {
            "id": "i308lop",
            "score": 2,
            "text": "You know, if the Makedons ever invade Lacedaemon, they shall turn you out.",
            "title_similarity": "0.47413865"
        },
        {
            "id": "i308lpm",
            "score": 2,
            "text": "What are your feelings on the Battle of the Persian Gate? Homage, or ripoff?",
            "title_similarity": "0.407682"
        },
        {
            "id": "i309xg7",
            "score": 2,
            "text": "Is this sparta?",
            "title_similarity": "0.2928399"
        },
        {
            "id": "i30a0f7",
            "score": 2,
            "text": "Oh mighty king, i am currently planning a great orgy to celebrate great victory! All desires of the flesh shall be fullfilled to the fullest and the moans of pleasure shall not cease till dawn! Now my question :\nShall i invite women to the orgy?",
            "title_similarity": "0.5935179"
        },
        {
            "id": "i30a6t3",
            "score": 2,
            "text": "You are no spartan. You talk too much. https://en.m.wikipedia.org › wiki\nLaconic phrase - Wikipedia",
            "title_similarity": "0.4169965"
        },
        {
            "id": "i30a7s3",
            "score": 2,
            "text": "What is your skincare routine?",
            "title_similarity": "0.17818402"
        },
        {
            "id": "i30ajaz",
            "score": 2,
            "text": "You are LEONIDAAAS not LEONIDAS.\n\n/r/QUITYOURBULLSHIT",
            "title_similarity": "0.26602197"
        },
        {
            "id": "i30as4l",
            "score": 2,
            "text": "#WHY DO YOU SPEAK SO SOFTLY?",
            "title_similarity": "0.1382027"
        },
        {
            "id": "i30bb2z",
            "score": 2,
            "text": "What is your opinion on the cult of Kosmos?",
            "title_similarity": "0.3542713"
        },
        {
            "id": "i30bk64",
            "score": 2,
            "text": "With everyone hanging dong, do you guys ever slap dicks or yank someone down when you are frustrated with them?",
            "title_similarity": "0.3962854"
        },
        {
            "id": "i30boz2",
            "score": 2,
            "text": "Do you remember meeting Xeones?",
            "title_similarity": "0.36135244"
        },
        {
            "id": "i30c6g4",
            "score": 12,
            "text": "What in the name of the gods happened to [your Xerxes?](https://preview.redd.it/ots6g9hr05771.jpg?width=1024&auto=webp&s=1c4d0cf771b16de0c8737284e70cf95175e4781c) Why is he so tall, pierced, beardless, Egyptian-looking, and bald?",
            "title_similarity": "0.5794333"
        },
        {
            "id": "i30c8cr",
            "score": 2,
            "text": "You seem to use a lot of words. Is sparta not also known for it’s spartan use of words?",
            "title_similarity": "0.48475778"
        },
        {
            "id": "i30cxyq",
            "score": 7,
            "text": "What's your favorite olympic sport?",
            "title_similarity": "0.4806174"
        },
        {
            "id": "i30d2rh",
            "score": 1,
            "text": "This is why I love Reddit. Praise King Leonidas",
            "title_similarity": "0.6174315"
        },
        {
            "id": "i30dq26",
            "score": 23,
            "text": "What modern weapon would you most desire to take back with you to Sparta(aaa)\n\nI also just wanted to take the opportunity to comment on this thread that won't immediately be deleted by the mods because I'm not a proper historian.",
            "title_similarity": "0.4778365"
        },
        {
            "id": "i30dvql",
            "score": 2,
            "text": "Have you played assassin's creed odyssey? it's about your family",
            "title_similarity": "0.47064212"
        },
        {
            "id": "i30e4km",
            "score": 2,
            "text": "Ephialtes of Trachis is waving hi from Hades and asking if you two can be besties :)",
            "title_similarity": "0.6943794"
        },
        {
            "id": "i30en5w",
            "score": 2,
            "text": "Would you work with Persia if they gave you loads of money?",
            "title_similarity": "0.37971967"
        },
        {
            "id": "i30eqel",
            "score": 2,
            "text": "What is the correct pronunciation of your full name?",
            "title_similarity": "0.3008166"
        },
        {
            "id": "i30f9ix",
            "score": 2,
            "text": "What is your opinion on Kratos, so called Ghost of Sparta and self-proclaimed God of War?",
            "title_similarity": "0.5376231"
        },
        {
            "id": "i30fa0a",
            "score": 2,
            "text": "If your descendants someday learn that your crown was taken from Sparta and is held in a museum in some foreign land, how politely should they ask for its repatriation? Should they offer to buy it back?",
            "title_similarity": "0.46134406"
        },
        {
            "id": "i30fco7",
            "score": 3,
            "text": "I call bullshit. Speak to me in Doric Greek.",
            "title_similarity": "0.47821686"
        },
        {
            "id": "i30ffcf",
            "score": 2,
            "text": "Pics of your spear?",
            "title_similarity": "0.24815452"
        },
        {
            "id": "i30fj53",
            "score": 4,
            "text": "Is it true that you went through the Agoge despite being a king?",
            "title_similarity": "0.50266993"
        },
        {
            "id": "i30fn5v",
            "score": 2,
            "text": "Tell us how you really feel about Cleon!",
            "title_similarity": "0.40675837"
        },
        {
            "id": "i30ftst",
            "score": 2,
            "text": "I want to be able to kick people into pits but I have noodly legs. What kind of leg workouts can I do so I can kick insolent messengers into pits too?",
            "title_similarity": "0.41306537"
        },
        {
            "id": "i30fy0e",
            "score": 2,
            "text": "My king, do you have a collection of red underwear?",
            "title_similarity": "0.4029337"
        },
        {
            "id": "i30g988",
            "score": 4,
            "text": "What's your favorite festival food? Mine's the Karneia Asada",
            "title_similarity": "0.4532045"
        },
        {
            "id": "i30gi75",
            "score": 2,
            "text": "Is it pronounced \"Lee - O -Ni  Dus\" or \"Lee - on - eh - dus\"?",
            "title_similarity": "0.2957616"
        },
        {
            "id": "i30gy0a",
            "score": 2,
            "text": "This is Madness",
            "title_similarity": "0.10310811"
        },
        {
            "id": "i30halo",
            "score": 2,
            "text": "How do you feel when Frank Millar wrote that you are contemptious of boy-man love when your society heavily promoted it?",
            "title_similarity": "0.5217576"
        },
        {
            "id": "i30hexf",
            "score": 2,
            "text": "Where is this?",
            "title_similarity": "0.09478155"
        },
        {
            "id": "i30i7bw",
            "score": 3,
            "text": "What are your feelings on that weird innovation, the oblique order?",
            "title_similarity": "0.32899818"
        },
        {
            "id": "i30iwk9",
            "score": 3,
            "text": "Wait. Weren't you dead?",
            "title_similarity": "0.17756972"
        },
        {
            "id": "i30jco2",
            "score": 2,
            "text": "Leonidas, what is best in life?",
            "title_similarity": "0.40408242"
        },
        {
            "id": "i30kp91",
            "score": 2,
            "text": "Opinion on right wing chuds using \"Μολον λάβε\"?",
            "title_similarity": "0.43709642"
        },
        {
            "id": "i30krlw",
            "score": 2,
            "text": "Did you guys really go into battle wearing only a cape, greaves and a diaper?",
            "title_similarity": "0.333731"
        },
        {
            "id": "i30kvaf",
            "score": 2,
            "text": "King of Sparta, You say? Ha! Please.. I am Sparta",
            "title_similarity": "0.62599397"
        },
        {
            "id": "i30kxct",
            "score": 2,
            "text": "When will the matter of expanding spartiatehood be discussed? I understand that’s a bit of a demographic time bomb there.",
            "title_similarity": "0.5208864"
        },
        {
            "id": "i30lsdc",
            "score": 3,
            "text": "Alexios or Kassandra?",
            "title_similarity": "0.24980372"
        },
        {
            "id": "i30m1x7",
            "score": 4,
            "text": "What do you have to say about the 700 Thespians and 400 Thebans who stayed behind to fight alongside you?",
            "title_similarity": "0.4044271"
        },
        {
            "id": "i30mfxd",
            "score": 2,
            "text": "What would you do different on that fateful day on Thermopylae.",
            "title_similarity": "0.38385195"
        },
        {
            "id": "i30n7sb",
            "score": 2,
            "text": "What is your profession?",
            "title_similarity": "0.14050281"
        },
        {
            "id": "i30n875",
            "score": 2,
            "text": "Hail, Leonidas, the people's of Egypt greet thee. Our God-King wonders why history does not remember the other city states who were present at the hot gates? Did not the Athenians, Corinthians, and more rally to repel vast, powerful Persia as well as your noble Spartans?\n\nAs a side inquiry, we have heard tell that your accent, to outsiders at least, is reminiscent of Picts from far northwest",
            "title_similarity": "0.7194375"
        },
        {
            "id": "i30ndrf",
            "score": 2,
            "text": "Do you like to fish",
            "title_similarity": "0.10710028"
        },
        {
            "id": "i30nune",
            "score": 5,
            "text": "Did you really kick a guy down a hole after screaming \"THIS IS SPARTA\"",
            "title_similarity": "0.47324067"
        },
        {
            "id": "i30nycu",
            "score": 1,
            "text": "Okay so I'm having a bit of trouble with my math homework. Can you explain the concept of prime numbers?",
            "title_similarity": "0.332805"
        },
        {
            "id": "i30odau",
            "score": 2,
            "text": "Just how Greek is a Greek Salad? You and the boys enjoy one after a hard day of fighting?",
            "title_similarity": "0.5287138"
        },
        {
            "id": "i30p0af",
            "score": 1,
            "text": "WHAT. IS. THIS???",
            "title_similarity": "0.15213723"
        },
        {
            "id": "i30pdmk",
            "score": 1,
            "text": "What are your thoughts on the town of Sparta, in the US state of Tennessee?",
            "title_similarity": "0.38149336"
        },
        {
            "id": "i30q3pp",
            "score": 1,
            "text": "What do you make of this Brasidas fellow who has been shaking things up lately? Some call him un-Spartan, but he is clearly courageous and cunning. I am curious as to your take.",
            "title_similarity": "0.52644634"
        },
        {
            "id": "i30r41d",
            "score": 1,
            "text": "How big is your penis? And did your men like it?",
            "title_similarity": "0.4606501"
        },
        {
            "id": "i30rxf2",
            "score": 2,
            "text": "How did your verbal battle of wits with Master Chief Petty Officer John-117 fare?",
            "title_similarity": "0.47781402"
        },
        {
            "id": "i30skgb",
            "score": 1,
            "text": "Ελληνικά;",
            "title_similarity": "0.25079957"
        },
        {
            "id": "i30ts0v",
            "score": 1,
            "text": "Leonidas, what's your take on the fictional recreation of your story, 'Meet The Spartans'?",
            "title_similarity": "0.59943116"
        },
        {
            "id": "i30v3xa",
            "score": 1,
            "text": "What is your take on the assertion that Sparta was only famous for this one battle, but from there, performed badly in war? \n\nFollow up question.\nDo you think Spartas lack of success has anything to do with not wearing any armour?",
            "title_similarity": "0.5239648"
        },
        {
            "id": "i30vl51",
            "score": 1,
            "text": "What are your thoughts on the Will Smith slapping Chris Rock? Would a kick have been better?",
            "title_similarity": "0.41699043"
        },
        {
            "id": "i30vwwd",
            "score": 1,
            "text": "Where’d the messenger end up?",
            "title_similarity": "0.17941397"
        },
        {
            "id": "i30xguv",
            "score": 1,
            "text": "Where is this?",
            "title_similarity": "0.09478155"
        },
        {
            "id": "i30yj7j",
            "score": 1,
            "text": "Finally the man himself to settle this damn dispute. You really said \"***THUS*** IS SPARTA\", not \"THIS\", didn't you? I've got 9 obols riding on this.",
            "title_similarity": "0.5185619"
        },
        {
            "id": "i30ysbg",
            "score": 2,
            "text": "Άδεια να φορέσω ένα πουκάμισο βασιλιά μου.",
            "title_similarity": "0.33352438"
        },
        {
            "id": "i3109kg",
            "score": 1,
            "text": "Why only 300 men at Thermopylae? Why no archers as well as spearmen?",
            "title_similarity": "0.42500433"
        },
        {
            "id": "i310p93",
            "score": 1,
            "text": "why do you scream all the time?",
            "title_similarity": "0.3469023"
        },
        {
            "id": "i310qnj",
            "score": 2,
            "text": "Γιατί ομιλάς βαρβαρικά βασιλεύς ω Σπάρτα;",
            "title_similarity": "0.3566366"
        },
        {
            "id": "i3111a5",
            "score": 2,
            "text": "Did yall really have butt sex when out to war?",
            "title_similarity": "0.43736288"
        },
        {
            "id": "i3119tc",
            "score": 2,
            "text": "When and why did you decide to open up a [chocolate shop in Belgium](https://leonidas-chocolate.com/)? The chocolates are delicious, by the way, but this seems like an unusual career choice for a Spartan warrior.",
            "title_similarity": "0.56196475"
        },
        {
            "id": "i312vwf",
            "score": 1,
            "text": "Can you help me with my self esteem problem?",
            "title_similarity": "0.24580678"
        },
        {
            "id": "i3143pd",
            "score": 1,
            "text": "Was Xerxes really 11ft tall or nah homie just exaggerating on his Tinder profile?",
            "title_similarity": "0.4017701"
        },
        {
            "id": "i315hv7",
            "score": 1,
            "text": "Any tips for Ukranian soldiers?",
            "title_similarity": "0.3289579"
        },
        {
            "id": "i315kvr",
            "score": 2,
            "text": "Spartan wives are notoriously unfaithful. Is this because they lack the honor of Ithacan women, or is this because Spartan men are so much weaker than those of Ithaca?",
            "title_similarity": "0.38584638"
        },
        {
            "id": "i315zqk",
            "score": 1,
            "text": "Oh brave King Leonidas I have a question did King Xerxes really offered riches beyond belief for you to surrender?\n\nIs it true that a Spartan is worth 10 Greeks in battle and at the same time be proficient in dance and singing?",
            "title_similarity": "0.64866793"
        },
        {
            "id": "i3163qe",
            "score": 1,
            "text": "What is your opinion on men lying with other men?",
            "title_similarity": "0.26823434"
        },
        {
            "id": "i316uda",
            "score": 1,
            "text": "What's your opinion on the economic effects of the Greek national dept?\n\nAlso, what are your thoughts on modern fashion?",
            "title_similarity": "0.43951094"
        },
        {
            "id": "i317kpl",
            "score": 1,
            "text": "The fuck happened at Thermopylae? You really fucked that one, didn't ya?",
            "title_similarity": "0.49776495"
        },
        {
            "id": "i318y7r",
            "score": 1,
            "text": "What is your opinion on Lost Causers? Do you congratulate them for supporting a state that fought for slavery, or do you think that they are cowards for not admitting it?\n\nHow are you going to solve the demographic problem of the steady decline of hómoioi?",
            "title_similarity": "0.5050664"
        },
        {
            "id": "i31905y",
            "score": 1,
            "text": "Where is this?",
            "title_similarity": "0.09478155"
        },
        {
            "id": "i319kai",
            "score": 1,
            "text": "Do you feel you owe any credit to the other Greek city-states? I mean they had more troops there than you and they stayed and actually fought alongside your troops so just wondering.",
            "title_similarity": "0.5579498"
        },
        {
            "id": "i319m5z",
            "score": 1,
            "text": "Bro ain't you a bitch?",
            "title_similarity": "0.24851182"
        },
        {
            "id": "i319r31",
            "score": 1,
            "text": "Where exactly is this?",
            "title_similarity": "0.1020415"
        },
        {
            "id": "i31a1rt",
            "score": 1,
            "text": "Leonidas my son, you may not be a man of peace, but surely you are a man of war. \n\nWhy did Japanese kamikaze pilots wear helmets?",
            "title_similarity": "0.5552388"
        },
        {
            "id": "i31agt8",
            "score": 1,
            "text": "Why 300 soldiers?",
            "title_similarity": "0.29999602"
        },
        {
            "id": "i31au97",
            "score": 2,
            "text": "You ever regret only bringing 300 Spartans and not say 1,000?",
            "title_similarity": "0.48356047"
        },
        {
            "id": "i31b3i3",
            "score": 1,
            "text": "Πόσο σου αρέσει να κλωτσάς ανθρώπους;",
            "title_similarity": "0.3570207"
        },
        {
            "id": "i31bdps",
            "score": 1,
            "text": "What's your outside voice like?",
            "title_similarity": "0.025460636"
        },
        {
            "id": "i31biwg",
            "score": 1,
            "text": "Hail, Spartan! Your warriors are feared and respected for their prowess on land. Some say, however, that those sniveling Athenians are superior in their ability to make war on the seas. Do you plan to show those fools the error of their ways?",
            "title_similarity": "0.60922676"
        },
        {
            "id": "i31cqb8",
            "score": 1,
            "text": "WHAT THROAT LOZENGE WOULD YOU RECOMMEND?",
            "title_similarity": "0.21965435"
        },
        {
            "id": "i31cqr8",
            "score": 1,
            "text": "How far can you Sparta kick a kid ?",
            "title_similarity": "0.34802383"
        },
        {
            "id": "i31dbng",
            "score": 1,
            "text": "Do you eat ass?",
            "title_similarity": "0.2698298"
        },
        {
            "id": "i31dm5t",
            "score": 1,
            "text": "What was your last Uber Eats order?",
            "title_similarity": "0.34910524"
        },
        {
            "id": "i31e0ms",
            "score": 1,
            "text": "April's fool!",
            "title_similarity": "0.31786066"
        },
        {
            "id": "i31e10r",
            "score": 1,
            "text": "Do you think the long process of training Spartiates might be unsustainable, especially if they go on suicide missions?",
            "title_similarity": "0.37682766"
        },
        {
            "id": "i31e4c2",
            "score": 1,
            "text": "What do you think of your Athenian counterpart themistocles?",
            "title_similarity": "0.40096867"
        },
        {
            "id": "i31e6kt",
            "score": 1,
            "text": "I hear Spartan men study dance and poetry. Care to share a poem?",
            "title_similarity": "0.39802274"
        },
        {
            "id": "i31ef2z",
            "score": 1,
            "text": "Did you guys adopt the pikes after Alexander the Scum took over the Greek world (except for Sparta 😎)",
            "title_similarity": "0.5947845"
        },
        {
            "id": "i31ekmz",
            "score": 1,
            "text": "This is madness!?",
            "title_similarity": "0.15642785"
        },
        {
            "id": "i31elh0",
            "score": 1,
            "text": "Are spartan woman really that masculine?",
            "title_similarity": "0.38027394"
        },
        {
            "id": "i31fcfl",
            "score": 1,
            "text": "Are you bummed there’s no condom brand named after y’all?",
            "title_similarity": "0.30406818"
        },
        {
            "id": "i31fmzr",
            "score": 1,
            "text": "Yeah hi, how do I permanently disable sticky keys in Windows XP?",
            "title_similarity": "0.41688013"
        },
        {
            "id": "i31htux",
            "score": 1,
            "text": "Hey Leonidas, how do you feel about Cleomenes and his army that he took to Athens having their asses kicked by a bunch of peasants while they were trying to institute Isagoras and his friends? Pretty shameful huh?",
            "title_similarity": "0.5077741"
        },
        {
            "id": "i31i3e0",
            "score": 1,
            "text": "Don’t you feel like if you’re gonna change headlong into battle you oughta wear at least… like a shirt?",
            "title_similarity": "0.36920974"
        },
        {
            "id": "i31i9ey",
            "score": 1,
            "text": "How do I pronounce your name correctly?",
            "title_similarity": "0.32963777"
        },
        {
            "id": "i31iouz",
            "score": 1,
            "text": "Is this Sparta?",
            "title_similarity": "0.2928399"
        },
        {
            "id": "i31ips5",
            "score": 1,
            "text": "Hey Leonidas, Aristophanes here. \n\nDo you feel lucky now that you fell gloriously at Thermopylae and didn't have to suffer Lycistrata's torture during the Peloponesian War? \n\nDon't answer with too many words, mate: “Το λακωνίζειν εστί φιλοσοφείν”",
            "title_similarity": "0.6425859"
        },
        {
            "id": "i31j15r",
            "score": 2,
            "text": "How'd you conclude that the best concubines are young boys? Was it through trial and error, or did you just fuck a boy and then kept rolling with it?",
            "title_similarity": "0.53893757"
        },
        {
            "id": "i31jzjp",
            "score": 1,
            "text": "What do you do on your rare days off?",
            "title_similarity": "0.33203113"
        },
        {
            "id": "i31kzog",
            "score": 2,
            "text": "Agree or Disagree, the reply of “IF,” the single greatest communication in the history of world diplomacy?!",
            "title_similarity": "0.59785944"
        },
        {
            "id": "i31lf5v",
            "score": 1,
            "text": "Prostagma?",
            "title_similarity": "0.20067339"
        },
        {
            "id": "i31lt5x",
            "score": 1,
            "text": "Should we be concerned about that goat trail…?",
            "title_similarity": "0.19928563"
        },
        {
            "id": "i31o3zb",
            "score": 1,
            "text": "As a loser and mercenary of the Greeks, how do you feel that 2500 years later, Persia still exist but there’s no country or region called Sparta?",
            "title_similarity": "0.5289998"
        },
        {
            "id": "i31orvt",
            "score": 1,
            "text": "What are your thoughts on the current economic difficulties of the Greek state and what would you do to rectify these issues?",
            "title_similarity": "0.38776037"
        },
        {
            "id": "i31pqeb",
            "score": 1,
            "text": "Boobs or Ass?",
            "title_similarity": "0.1580183"
        },
        {
            "id": "i31qt1q",
            "score": 1,
            "text": "Ahem… \n\nwhat is this?",
            "title_similarity": "0.15273772"
        },
        {
            "id": "i31rf6e",
            "score": 1,
            "text": "What have you been doing in the past 365 days? Also did you learn anything interesting from the foreigners questions last time?",
            "title_similarity": "0.440405"
        },
        {
            "id": "i31tywq",
            "score": 1,
            "text": "What are your thoughts on naval combat?",
            "title_similarity": "0.29447764"
        },
        {
            "id": "i31w22h",
            "score": 1,
            "text": "Finish the line.\n\nThis! Is!",
            "title_similarity": "0.2198138"
        },
        {
            "id": "i31yd7d",
            "score": 1,
            "text": "Which version of yourself do you prefer people think of when they see/hear/say your name?\n\nThe one from Fate: Grand Order, the one from \"300\", or the version from Epic Rap Battles of History?",
            "title_similarity": "0.5941585"
        },
        {
            "id": "i31z6zz",
            "score": 1,
            "text": "Shall we drink wine, practice for battle, or drink wine and practice for battle?",
            "title_similarity": "0.32544464"
        },
        {
            "id": "i31zamo",
            "score": 2,
            "text": "I *love* the internet.\n\nI especially love how you cite your sources, honored king.",
            "title_similarity": "0.5292611"
        },
        {
            "id": "i321xyu",
            "score": 2,
            "text": "What is this???",
            "title_similarity": "0.13784415"
        },
        {
            "id": "i32462v",
            "score": 1,
            "text": "What's your favorite breakfast, oh mighty king of Sparta?",
            "title_similarity": "0.6261018"
        },
        {
            "id": "i324qmf",
            "score": 1,
            "text": "Why do you subjugate the helots when they are your Messenian cousins?",
            "title_similarity": "0.51862323"
        },
        {
            "id": "i3256tf",
            "score": 1,
            "text": "How will you fight your enemies, in the modern age, who wage war not with spears and swords but with guns and tanks?",
            "title_similarity": "0.36339957"
        },
        {
            "id": "i326yw9",
            "score": 2,
            "text": "*walks in to village square* \n\nhello im a bit lost...is this sparta?",
            "title_similarity": "0.36971438"
        },
        {
            "id": "i329klo",
            "score": 2,
            "text": "How do you feel about Pineapple on pizza?",
            "title_similarity": "0.35562277"
        },
        {
            "id": "i32cs6b",
            "score": 1,
            "text": "What does Xerxes smell like?",
            "title_similarity": "0.3608563"
        },
        {
            "id": "i32d0ea",
            "score": 1,
            "text": "Hi Leonidas! What’s your skin care routine? I love your glow!",
            "title_similarity": "0.46111357"
        },
        {
            "id": "i32gtjj",
            "score": 1,
            "text": "Oh mighty king, and purveyor of fine baked goods. You seem to have several hundred men following you. What is their profession?",
            "title_similarity": "0.55316436"
        },
        {
            "id": "i32k5z1",
            "score": 1,
            "text": "How did you feel about the homoerotic portrayal of you and your fellow Spartans in the film 300? Did you enjoy Assassin's Creed Odyssey?",
            "title_similarity": "0.60263675"
        },
        {
            "id": "i32lel7",
            "score": 1,
            "text": "Did you have to travel far for decent Mexican food? Any taco trucks in the neighbourhood?",
            "title_similarity": "0.31992272"
        },
        {
            "id": "i32m62i",
            "score": 1,
            "text": "Hello Great King, thank you for taking questions, so generous of you to spend your time answering the queries of us helots and barbarians\n\nAnyways my question is do you have a favorite play or book? Who is your favorite playwright or author?",
            "title_similarity": "0.57096654"
        },
        {
            "id": "i32nvy3",
            "score": 1,
            "text": "We really ought to do MORE in this AMA style. Im loving it! Like once a month??",
            "title_similarity": "0.57645005"
        },
        {
            "id": "i32ohqg",
            "score": 1,
            "text": "This is the best community on reddit",
            "title_similarity": "0.4806887"
        },
        {
            "id": "i32otuv",
            "score": 1,
            "text": "What's 6 times 50?",
            "title_similarity": "0.1769774"
        },
        {
            "id": "i32q3aj",
            "score": 1,
            "text": "do you like Deng Xiaoping?",
            "title_similarity": "0.27267367"
        },
        {
            "id": "i32sues",
            "score": 1,
            "text": "How was your first tree fuck?",
            "title_similarity": "0.3692091"
        },
        {
            "id": "i32sx8z",
            "score": 2,
            "text": "Why are you yelling?",
            "title_similarity": "0.25998735"
        },
        {
            "id": "i32t11r",
            "score": 1,
            "text": "Where would you like to dine tonight?",
            "title_similarity": "0.23444553"
        },
        {
            "id": "i32v5zt",
            "score": 1,
            "text": "What would you say to me if I said “this is blasphemy. This is madness!”",
            "title_similarity": "0.2746434"
        },
        {
            "id": "i32xd4z",
            "score": 1,
            "text": "My neighbour has in secret feed his cattle on my lands, would this entitel me to the cattle itself or just the meat and milk? And would it be apropriate to enslave him?",
            "title_similarity": "0.2758714"
        },
        {
            "id": "i32zlhi",
            "score": 1,
            "text": "My pepe size is too small, do you have any tips for that?",
            "title_similarity": "0.25190964"
        },
        {
            "id": "i330qeh",
            "score": 1,
            "text": "You ever heard of the Romans? They are descendants of Troy and they will rule your lands one day.",
            "title_similarity": "0.6361111"
        },
        {
            "id": "i330x68",
            "score": 1,
            "text": "When will you be a playable character in Mortal Kombat?",
            "title_similarity": "0.35759413"
        },
        {
            "id": "i333b9s",
            "score": 2,
            "text": "This is madness.",
            "title_similarity": "0.117103234"
        },
        {
            "id": "i335te2",
            "score": 1,
            "text": "What do you eat in a typical day?",
            "title_similarity": "0.16924097"
        },
        {
            "id": "i336hut",
            "score": 1,
            "text": "What is your opinion of King Leotychidas II, considering he won Mycale (it was a big battle against the Persians after you died)?",
            "title_similarity": "0.65643287"
        },
        {
            "id": "i3379gt",
            "score": 1,
            "text": "Why?",
            "title_similarity": "0.12661807"
        },
        {
            "id": "i338lub",
            "score": 1,
            "text": "Mou Vasileios! I would like a word from you. Do you... Do you Spartiatis train like animals in the art of war everyday?",
            "title_similarity": "0.44562864"
        },
        {
            "id": "i478sf1",
            "score": 1,
            "text": "What's the best weapon?",
            "title_similarity": "0.3096274"
        }
    ]
}