{
    "In one Calvin and Hobbes comic, Calvin imagines he's a future archaeologist trying to discern the purpose of a wire hanger. He imagines it served a religious function or was used for eating. Is there an infamous example in your field of a similar mis-identification of an artifact?\n": [
        {
            "id": "i454dsv",
            "score": 1,
            "text": "Welcome to /r/AskHistorians. **Please [Read Our Rules](https://www.reddit.com/r/AskHistorians/wiki/rules) before you comment in this community**. Understand that [rule breaking comments get removed](https://www.reddit.com/r/AskHistorians/comments/h8aefx/rules_roundtable_xviii_removed_curation_and_why/).\n\n#Please consider **[Clicking Here for RemindMeBot](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps://www.reddit.com/r/AskHistorians/comments/u0dfil/in_one_calvin_and_hobbes_comic_calvin_imagines/%5D%0A%0ARemindMe!%202%20days)** as it takes time for an answer to be written. Additionally, for weekly content summaries, **[Click Here to Subscribe to our Weekly Roundup](https://www.reddit.com/message/compose/?to=AHMessengerBot&subject=Subscribe&message=!subscribe)**.\n\nWe thank you for your interest in this *question*, and your patience in waiting for an in-depth and comprehensive answer to show up. In addition to RemindMeBot, consider [using our Browser Extension](https://www.reddit.com/r/AskHistorians/comments/d6dzi7/tired_of_clicking_to_find_only_removed_comments/), or getting the [Weekly Roundup](https://www.reddit.com/message/compose?to=subredditsummarybot&subject=askhistorians+weekly&message=x). In the meantime our [Twitter](https://twitter.com/askhistorians), [Facebook](https://www.facebook.com/askhistorians/), and [Sunday Digest](https://www.reddit.com/r/AskHistorians/search?q=title%3A%22Sunday+Digest%22&restrict_sr=on&sort=new&t=all) feature excellent content that has already been written!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AskHistorians) if you have any questions or concerns.*",
            "title_similarity": "0.5349093"
        },
        {
            "id": "i462eyp",
            "score": -6,
            "text": "[removed]",
            "title_similarity": "0.08071616"
        },
        {
            "id": "i46c78j",
            "score": 473,
            "text": "The idea of [\"Nacirema\"](https://en.wikipedia.org/wiki/Nacirema), that archaeologists and anthropologists just love interpreting practical things as ritual and in mystical ways, is one that emerged as a self critique in the disciplines and has captured the wider public (I think particularly with social media, although as your question demonstrates not exclusively with it). It makes sense why it is appealing, there is an irresistible \"snobs vs slobs\" aspect to a bunch of out of touch, ivory tower eggheads debating over what arcane ritual function a particular vessel has before some salt of the earth type tells them it's a toilet. Also while it feels a bit dramatic to talk about \"well funded disinformation campaigns\" when discussing the Akkadians, it is certainly worth noting that the many of the purportedly educational television networks in the United States have decided to dedicate their resources ([and celebrity appearances](https://www.history.com/shows/the-unxplained)) to informing their viewers that archaeologists don't want you to know about the aliens. By which I mean that there is a certain ambient dislike of archaeologists in the culture, and that this critique rides in its wake.\n\nWhich is not to say the critique has no validity, saying something is \"ritual\" is a bit of a thought terminating cliche. Saying something had a ritual function essentially means that its function was highly idiosyncratic and its form was leaden with meaning such that it is difficult, if not impossible, to use it to interpret its function. It is also very easy to say something has a \"ritual function\" because, well, anything might. All this said, one of the reasons that \"ritual\" is a common interpretation is because \"ritual\" objects are extremely common in human society, and particularly in the sorts of objects and structures that remain for archaeologists to find. For example, in practically every town in Europe there is one building that is older than everything else, has a highly distinct architectural form and decorative elaboration, is in a central location and set off from every other building: the church. Likewise no matter how secular and demystified society becomes, it is hard to deny that the single most set apart day of the year is December 25. And of course just because something is \"ritual\" does not mean there is not a multiplicity of meanings: think Halloween, Mardi Gras and St. Patrick's Day as being religious days in which common custom is to wear unusual, distinctive attire and take part in ritual behaviors distinctive to those days, while *also* being just a bit of fun. If ritual is common in anthropological and archaeological interpretation, that is because it is common in human society and practice.\n\nNow to actually get close to answering your question, it is less that there are direct \"it's a toilet\" moments than there are cases where interpretation is unclear and \"ritual\" is one of the plausible interpretations. For example, in Iron Age and Roman northwest Europe a somewhat common feature is an underground cellar like structure that varies in particularity of construction and name being called \"souterrain\" or \"fougou\". And there is debate about what these are: are the simple storage cellars? Are they places of concealment and refuge? Are they, indeed, connected to some sort of ritual connected to chthonic forces that we are unaware of? You pays your money and you takes your choice. Likewise the cave paintings of the European Ice Age have been interpreted as part of a quasi-shamanic ritual of spiritual journey or as a historical record of deeds and hunts (which is arguably a kind of ritual, but leaving that aside).\n\nThese sorts of debates can have higher stakes as well: a perennially popular debate is whether the so-called Minoan civilization was unusually peaceful and free of strife (\"Minoan flower people\" as a well known article dubbed it). One arguing this position--for which there is real support--has to explain away the presence of weapons, and \"ritual\" is invoked here. There is absolutely nothing absurd about this, sacrifices are real, important social phenomena and they require tools. But there could also be a whiff of Nacirema about this.\n\nInterpretations can also change due to increasing information. For example, [one story that has gone around the news recently](https://www.cambridge.org/core/journals/antiquity/article/sacred-pool-of-baal-a-reinterpretation-of-the-kothon-at-motya/329646E6561765FD30A9D6EC5FD5B6CB) involves a large pool in the Phoenician site of Motya, in Sicily. This pool has often been interpreted as a harbor because it somewhat resembles a harbor structure from Carthage, however recent excavations have pointed towards its surroundings being very temple-heavy and that it was not, in fact, connected to the open sea, leading to the conclusion that it was (wait for it) a sacred space of ritual activity. It is, in fact, a two way street.\n\nThis is all a way of saying that there are certainly cases where the term \"ritual\" is used a bit loosely, but it tends to be when the function and context are quite vague and up for debate, and also that interpretation is often good and correct.",
            "title_similarity": "0.6664743"
        },
        {
            "id": "i46vc82",
            "score": 38,
            "text": "[removed]",
            "title_similarity": "0.08071616"
        },
        {
            "id": "i46bd3s",
            "score": 54,
            "text": "[removed]",
            "title_similarity": "0.08071616"
        },
        {
            "id": "i48dskh",
            "score": 100,
            "text": "Just such puzzling was at the center of a bit of pop culture in the 1970s: the well-known illustrator David Macaulay created *Motel of the Mysteries,* [a humorous book that imagined future archaeologists interpreting the objects found in and around an off-ramp motel.](https://www.google.com/books/edition/Motel_of_the_Mysteries/Tq_5c8Tsp_gC?hl=en) The book was excerpted in *Readers Digest,* giving it a very broad reach.",
            "title_similarity": "0.595299"
        },
        {
            "id": "i45vlnd",
            "score": 4526,
            "text": "The study of the history of decorative arts does present challenges like this, when artifacts survive without sufficient contextual information like written descriptions, illustrations, and the like. In my field (14th-19th century British silver), one entertaining example comes to mind.\n\nThe introduction of drinking chocolate to Britain in the mid-late 17th century entailed the need for a variety of new vessels and implements for preparing and serving. Chocolate was expensive and its consumption was initially restricted to the upper class. Silver was the mark of sophistication in home goods for the elite, and so any of these vessels or implements that were to be used in public (as opposed to in the kitchen) were wont to be made in silver. It's fascinating to trace how craftsmen serving the British upper class (i.e. silversmiths) responded to this demand, with a proliferation of diverse designs for chocolate pots and the like.\n\nOne key difference from modern hot chocolate is that in the 17th and early 18th century, hot chocolate lacked the emulsifiers that allowed the beverage to be smoothly, homogeneously mixed (and to stay that way). As a result, to prevent the drink from becoming an oily and chunky mess, it needed to be stirred, in the pot, immediately before pouring. This couldn't be done in the distant kitchen, as the liquid would congeal before it could be brought out and served. This stirring implement, then, also needed to be made in silver. Such items came to be known as \"molinets\" from the French *molin*, meaning \"mill\". Again, there were various designs, but typically with a little imagination they resemble whisks (at the risk of self-promotion, [here's](https://shrubsole.com/products/a-george-ii-antique-english-silver-molinet) an image of a fairly typical example, from my firm's website).\n\nNow, with the introduction of emulsifiers in the mid-18th century, molinets were instantly obsolete. And because silver is a currency metal, the vast majority of molinets were melted down to recover their value. Only a few managed to survive until today, and because we see them so rarely, even specialists in the field sometimes scratch their heads when they come across one.\n\nIf you look at the above image without context, I think you can see how it might be misunderstood. In fact that very example was recently sold at a major English auction house whose antique silver specialist had described it as a \"mace\".\n\nI suppose in a pinch you *could* club someone with it...but better to make chocolate, not war.",
            "title_similarity": "0.5641186"
        },
        {
            "id": "i46ty0d",
            "score": 517,
            "text": "My general go-to example for the history of technology is the so-called \"Baghdad Battery\" ([image here](https://www.iraqicivilsociety.org/wp-content/uploads/2016/01/568b6205c36188af468b45e1-500x281.jpg)), which I've written about recently, so I'll reproduce\nmy comments about it below. The general thing to point out is that the versions on Mythbusters and the like\nall had to be variations; it could be turned into a battery with some tweaks, but those tweaks did not exist\non the original single artifact that was found and are part of the 20th century imagination.\n\n...\n\nIn 1930, four jars of earthenware were found in a University of Michigan excavation at Opis, a trading post on the Tigris river. Three of the jars were toppled with metal rods nearby, one being iron, the remainder being bronze. Each also contained a bronze cylinder. The bronze cylinder contained fragments of papyrus. The fourth was found upright also had pieces of a glass bottle.\n\nRoughly the same time, there were some excavations on a different\nsite of the Tigris that had six sealed jars, each with different contents:\n\n1. ten rolled up bronze cylinders, sealed, containing decomposed papyrus,\ndescribed by Upton at the time as \"probably exorcisms or blessings\" ([picture here](https://imgur.com/a/ETO3hCl))\n\n2. three bronze rolls\n\n3. three bronze sealed rolls\n\n4. one bronze roll, where the jar and roll were sealed with bitumen (asphalt),\nand there were traces of tin, iron, and lead\n\n5. a jar with \"bitumen stoppers\" some corroded \"earthy substance\" that appeared to be lead.\n\n6. A jar with ten corroded iron nails, previously wrapped with\nan organic material. ([picture here](https://imgur.com/a/e6Q1mYf))\n\nAll were dated to the 5th-6th century.\n\nAnother find from 1936 was a sealed ceramic vessel, 15 cm high, with\nan asphalt stopper. Inside there was both a copper cylinder closed on one end\nwith a copper plate (soldered with a lead/tin alloy) and an iron spike\nheld by an asphalt stopper. The spike came out roughly a centimeter from the\ntop. \n\nIt supposedly was dated from the 2nd century CE (although the design suggests it was\nactually from the same time as the other finds; the provenance was unfortunately not\nwell documented).\n\nIts discovery was announced by the Austrian archaeologist König, where, due to some acidic material inside, he theorized it was used for electroplating, and after became known as the Baghdad Battery.\n\nI first want to be clear that while \"acidic material\" led people\nto theorize it was filled with vinegar or the like, it does not necessarily\nmean such. Just like with Egyptian mummies could test positive for nicotine\nby eating celery or eggplant ([and not smoking nicotine from another continent](https://www.reddit.com/r/AskHistorians/comments/nvj04f/is_there_a_working_theory_for_how_ancient/h1476k4/)), acidic substances can come from multiple sources, like any organic material that is acidic.\n\nIssue #1: the concrete stopper is a complete seal. The iron spike pokes out but not the copper. There is no method for the battery to have a \"connection\". Any alleged replicas have to modify the device to account for this.\n\nIssue #2: the residue is not what'd we expect. If it was\nactually a battery, what we'd expect to have a significant\nresidue of copper salts.\n\nIssue #3: the device would need to be refilled regularly to work, but it was designed as sealed.\n\nWhile the _exact_ configuration of this particular device is unique, it _strongly_\nresembles the other finds in basic form, some which definitively had papyrus.\n\nThe procedure appears to have been:\n\n1. take a sacred scroll (\"exorcisms or blessings\")\n\n2. wrap it around a rod, it could be iron or bronze\n\n3. put it in a copper tube or glass flask\n\n4. then put this inside a plugged clay jar to be protected from decay.\n\nThe only thing suspicious about the supposed battery is that the iron spike pokes out; the one\nwith iron nails is large enough to contain them without such a design. However, again, there is\nno practical way for there to be a battery, and the matching jars found in the same region clearly\ndon't resemble batteries at all.\n\n...\n\nP. Emmerich. (1989, translated from a 1985 article). Electricity Generation or Magic? The Analysis of an Unusual Group of Finds From Mesopotamia. From *History of Technology: The Role of Metals*. United States: University of Pennsylvania Press. p. 31-38.",
            "title_similarity": "0.5696893"
        },
        {
            "id": "i46d56r",
            "score": 737,
            "text": "A hunter in the 16th -18th c. would carry a  muzzle-loader. Matchlocks, wheel locks and flintlocks all need a good bit of tinkering. For a flintlock, the flint needs to be knapped lightly to keep it sharp, or replaced when it's too worn. The powder fouling builds up in the pan, and can obstruct the touchhole in the side of the barrel. The whole lock gets fouled, too, and it's necessary to be able to take it off and clean it. And to clean the barrel, there has to be some sort of cleaning rod or at least something that looks like a corkscrew to fit the end of the ramrod, to hold tow ( linen fibers too short to spin into yarn) or scraps of cloth. All of this might have to be done out in the field. The result was  a [multi-tool](https://www.northernshooterssupplies.com.au/Flint-Rifle-and-Musket-tool-p/frmt.htm) that often is called a gun hammer now...but there is more than just a hammer: there'd be at least one  screwdriver, a touch-hole pick, a \"worm\" for holding tow, maybe also a brush, a screw that could be used for pulling out the ball to unload the gun... In the period some of these could be quite complex ingenious things, rivaling the multi-tools that you see hauled around by hikers, stage techs, etc. today. And just as lots of people today have the newest Leatherman who will never carry it on a hike or use even half of the tools, you suspect that plenty of men who did little hunting in the 18th c. would still plunk down money for one of these just because they were so cool.\n\nOnce flintlocks ceased to be used, however, these little multi-tools stopped having much of a function. In the mid-to-later 19th c. a French painter and photographer, Jean-Louis-Henri Le Secq des Tournelles , began to collect iron objects of earlier centuries. He was one of the first to pay attention to mundane objects; they had been mostly ignored even though they were often quite ornamental. His collection would later become the basis for the Secq des Tournelles Museum in Rouen. He photographed his collection, and a book of the photos was later reprinted by Dover as [Decorative Antique Ironwork]( https://books.google.com/books/about/Decorative_Antique_Ironwork.html?id=PIzXxgEACAAJ ). It is still a very useful source for scholars. However, many of those gun hammers he identified as \"tobacco tools\" or as woodworking tools. And they will still puzzle collectors today,  who will sometimes think they were used for making button-holes , or carried like bunches of keys on the belts of household servants- as they do resemble the chatelaine holding all the keys to the house, that would be carried by the housekeeper... the *châtelaine*.\n\n\n\n\nShaffer, James B.; Rutledge, Lee A.; Dorsey, R. Stephen. (1992). *Gun Tools: Their History and Identification (Volume 1)*. Collector's Library\n\nEDIT Yes, I should add that there would be gun multi-tools afterwards, especially for military arms, not only screw driver/nipple wrench combinations but screw driver/broken shell extractor combinations, etc. etc...but these earlier gun multi-tools tended to have more tools. And they were usually a lot prettier.",
            "title_similarity": "0.5671357"
        }
    ]
}