{
    "Men who don’t remove their shorts/underwear by kicking them up into the air and catching them before they hit the ground, when did you become so old and grumpy?\nThose that do this, what happens when you fail to catch them? Do you give it the old college try and attempt it from the floor, admit defeat and bend over to pick them up, or leave them, knowing they’ll never be worn again?\n\nAs for me, I shame myself for failing by spending the extra energy to bend over and pick them up.": [
        {
            "id": "gvd0y53",
            "score": 1,
            "text": "Can we stop asking these kinds of questions? ffs",
            "title_similarity": "0.40246144",
            "sentiment_compound": -0.7184
        },
        {
            "id": "gvczfwx",
            "score": 0,
            "text": "when i permanently damaged my spine at 22 working for 16 dollars an hour in a capitalist society",
            "title_similarity": "0.49325547",
            "sentiment_compound": -0.4404
        },
        {
            "id": "gvbxph1",
            "score": 11,
            "text": "This is it chief. This is the post",
            "title_similarity": "0.058442026",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvc9iju",
            "score": -5,
            "text": "These are the same men that drink white claw lol",
            "title_similarity": "0.2830882",
            "sentiment_compound": 0.4215
        },
        {
            "id": "gvcn7qg",
            "score": 8,
            "text": "Wait a minute, Why are you calling me old and grumpy i am just 13 u grandpa",
            "title_similarity": "0.59881693",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvcctm3",
            "score": 1,
            "text": "man, it's been a while since I've done that and I hadn't even realized it. I felt dead inside and now I know why. I'm taking my pants and underwear off rn just for the sake of it",
            "title_similarity": "0.69808173",
            "sentiment_compound": -0.6486
        },
        {
            "id": "gvcx8lw",
            "score": -1,
            "text": "Part contains fecal matter and anal juices.  Remember that.",
            "title_similarity": "0.22622395",
            "sentiment_compound": 0.0258
        },
        {
            "id": "gvfvusc",
            "score": -1,
            "text": "Who upvotes this shit?",
            "title_similarity": "0.23725179",
            "sentiment_compound": -0.6428
        },
        {
            "id": "gvchjzt",
            "score": -3,
            "text": "I just let them fall and the wife gets them. Handle my own underwear, you philistines!",
            "title_similarity": "0.50881684",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvctfnj",
            "score": 4,
            "text": "Old and grumpy because we don't need theatrics when undressing?  When did you become so judgmental?",
            "title_similarity": "0.75814736",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvc3lvo",
            "score": 59,
            "text": "40 yr old woman here and I do this every time, bonus points for then flinging them into the laundry basket!",
            "title_similarity": "0.37019596",
            "sentiment_compound": 0.5848
        },
        {
            "id": "gvc19aa",
            "score": 8,
            "text": "> What happens when you fail to catch them?\n\nHahaha look at this loser who sometimes has to try twice.",
            "title_similarity": "0.66624904",
            "sentiment_compound": -0.5994
        },
        {
            "id": "gvc8fb6",
            "score": 40,
            "text": "I have never done that.  I guess I was never a child.",
            "title_similarity": "0.27336532",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvc6z05",
            "score": 37,
            "text": "This is a guy thing? I'm a girl and I do this lol! If I fail I also try to flick it in the air with my feet, sometimes more than once before giving up and bending over.",
            "title_similarity": "0.5725298",
            "sentiment_compound": 0.3489
        },
        {
            "id": "gvc4giy",
            "score": 86,
            "text": "Wait, that's not how all men remove their shorts??? I thought the overhead kick with slapping it against the ceiling and catching it behind your back is the usual ritual how we men remove them!!?!",
            "title_similarity": "0.73993087",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvcls77",
            "score": 27,
            "text": "ive never done this in my life",
            "title_similarity": "0.2952719",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvc27h4",
            "score": 46,
            "text": "One day the underwear gets caught on an unlit lamp and forgotten. Until the lamp is lit. And something starts burning.",
            "title_similarity": "0.551436",
            "sentiment_compound": -0.2263
        },
        {
            "id": "gvc6sv8",
            "score": 139,
            "text": "If I miss the catch my SO usually shouts at me for throwing clothes across the room. I then have to walk over. Try and kick it back up and catch it on round two all whilst she's complaining that I don't just pick them up like a normal human being... I tell her I'm not alone but she don't believe me",
            "title_similarity": "0.7478536",
            "sentiment_compound": 0.1078
        },
        {
            "id": "gvbzigw",
            "score": 231,
            "text": "Hey now!  I've been old and grumpy for a while and I still do this.  Don't go dumping on us old grumps.",
            "title_similarity": "0.5982882",
            "sentiment_compound": 0.308
        },
        {
            "id": "gvbz1ns",
            "score": 100,
            "text": "I always include a Bruce Lee \"WaaaaaAaaaa\" as I do it, so I never miss... I simply don't know what that feels like.",
            "title_similarity": "0.4021704",
            "sentiment_compound": 0.4952
        },
        {
            "id": "gvbvtx6",
            "score": 557,
            "text": "My missed catches are the worst, my hand juuust barely snags them so they get flung across the damn room",
            "title_similarity": "0.6827821",
            "sentiment_compound": -0.7003
        },
        {
            "id": "gvc1uzu",
            "score": 743,
            "text": "I take my trousers, boxers and socks in a single motion. Ends up all bundled on the floor together =)",
            "title_similarity": "0.3462354",
            "sentiment_compound": 0.4939
        },
        {
            "id": "gvc5j74",
            "score": 370,
            "text": "Kicking it straight into the hamper is the pro gamer move",
            "title_similarity": "0.46468014",
            "sentiment_compound": 0.2263
        },
        {
            "id": "gvbvh55",
            "score": 3350,
            "text": "I kick them back up and try again.",
            "title_similarity": "0.30304664",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvbvjti",
            "score": 1691,
            "text": "When I tripped and knocked over my TV.",
            "title_similarity": "0.45953244",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvbx3sw",
            "score": 3,
            "text": "I was born this way, hey",
            "title_similarity": "-0.0011860132",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvbyq3j",
            "score": 1,
            "text": "When you get older, bending can hurt.\n\nI have friends slightly older than me that need assistive gear just to help them put on socks.\n\nBodies fail. It's not that people purposefully decide to be curmudgeonly, it's just that over time your balance, your flexibility, and your speed start to go and you subconsciously start eliminating behaviors that require the things you had as a youth.\n\nEver seen small kids? They RUN everywhere. They are so excited that something new is about to happen, they practically tear off at full running speed when circumstances change. That eventually fades into middle age, where you actually think through whether it's worth the exertion to stand up.",
            "title_similarity": "0.7572921",
            "sentiment_compound": 0.6504
        },
        {
            "id": "gvbzzpz",
            "score": 1,
            "text": "Nah I'm just lazy",
            "title_similarity": "0.2712505",
            "sentiment_compound": -0.4404
        },
        {
            "id": "gvc1008",
            "score": 4,
            "text": "It's too hard to get it over my stomach nowadays.",
            "title_similarity": "0.4349579",
            "sentiment_compound": -0.1027
        },
        {
            "id": "gvc52p1",
            "score": 15,
            "text": "I’m about 40 and I kick underwear into clothes washing machine. I strongly convinced that they have been made horizontally solely for that.",
            "title_similarity": "0.47681555",
            "sentiment_compound": 0.5859
        },
        {
            "id": "gvc5pm1",
            "score": 3,
            "text": "I’ve been old and grumpy since I was about 22 or so maybe younger.",
            "title_similarity": "0.4653586",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvc6vvy",
            "score": 2,
            "text": "Because normally I'm already lying in bed when I peel them off.  Pick them up with a toe pinch the next morning, though.",
            "title_similarity": "0.47080752",
            "sentiment_compound": -0.5267
        },
        {
            "id": "gvc6yvd",
            "score": 3,
            "text": "I'm close to 40 and in good shape (work out 3-4 times per week) but damn if I get lazier with shit like this. I sit on the bed and take shit off to not have to bend over anymore.",
            "title_similarity": "0.46127075",
            "sentiment_compound": -0.9393
        },
        {
            "id": "gvc79sq",
            "score": 6,
            "text": "I stand in the laundry basket when I take them off. No time wasted.",
            "title_similarity": "0.22505358",
            "sentiment_compound": 0.1098
        },
        {
            "id": "gvc7kct",
            "score": 96,
            "text": "You don't have my back son. I now just pick them up with my toes and yet them across the room into the basket",
            "title_similarity": "0.5250268",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvc8hhl",
            "score": 3,
            "text": "If I miss I'd probably just kick 'em in the direction of the washing basket.\n\n\n\n_If I missed._",
            "title_similarity": "0.62216866",
            "sentiment_compound": -0.4215
        },
        {
            "id": "gvc9dya",
            "score": 12,
            "text": "The feeling when you throw it up with your foot and then grab it with your hand and throw it around like Mcree does with his revolver and then basketball throws it into the pile perfectly is something extraterrestrial",
            "title_similarity": "0.4649889",
            "sentiment_compound": 0.886
        },
        {
            "id": "gvc9g6p",
            "score": 2,
            "text": "I kick them straight into the basket, more efficient that way.",
            "title_similarity": "0.30107725",
            "sentiment_compound": 0.6115
        },
        {
            "id": "gvcaeb4",
            "score": 2,
            "text": "I play basketball so I shoot my dirty clothes into my hamper while yelling Kobe instead",
            "title_similarity": "0.5218773",
            "sentiment_compound": -0.4902
        },
        {
            "id": "gvcavle",
            "score": 2,
            "text": "Wait, this isn't cool? I thought it was cool.",
            "title_similarity": "0.16260992",
            "sentiment_compound": 0.0869
        },
        {
            "id": "gvcax34",
            "score": 20,
            "text": "Punishing yourself for failing by having to pick them up is the way to go.\n\nMy worst ever attempt at this was when my kick was way too over-enthusiastic and the boxers ended up flying straight into the open toilet bowl.",
            "title_similarity": "0.7237805",
            "sentiment_compound": -0.8779
        },
        {
            "id": "gvcb92j",
            "score": 1,
            "text": "Y'all young mfers wait until the first time you throw your back out doing that shit that was once a bunch of fun. Or pull a hamstring.  Your time is coming too.",
            "title_similarity": "0.642502",
            "sentiment_compound": -0.0772
        },
        {
            "id": "gvcbpjn",
            "score": 3,
            "text": "I try to flip them straight into the hamper. Bypass the hands entirely.",
            "title_similarity": "0.46145418",
            "sentiment_compound": 0.2263
        },
        {
            "id": "gvcbvxj",
            "score": 1,
            "text": "Apparently, I've been old and grumpy my entire life.",
            "title_similarity": "0.453843",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvcc5b3",
            "score": 3,
            "text": "Try to kick them up at least twice. Though the second the attempt is always a little shameful lol.",
            "title_similarity": "0.6162709",
            "sentiment_compound": -0.099
        },
        {
            "id": "gvcc652",
            "score": 2,
            "text": "After i pull them down i gotta deadlift my 10ton jimmy out of em first and them im too tired",
            "title_similarity": "0.70257056",
            "sentiment_compound": -0.4404
        },
        {
            "id": "gvccg13",
            "score": 1,
            "text": "Just enjoying my brown ability to still bend over old man",
            "title_similarity": "0.39297223",
            "sentiment_compound": 0.6908
        },
        {
            "id": "gvccgvi",
            "score": 2,
            "text": "You have to try again.... HAVE TO. Miss twice you pick them up and sulk for a few min.",
            "title_similarity": "0.6199777",
            "sentiment_compound": -0.1531
        },
        {
            "id": "gvccywd",
            "score": 2,
            "text": "I try to kick them into the dirty clothes basket from the floor",
            "title_similarity": "0.47025287",
            "sentiment_compound": -0.4404
        },
        {
            "id": "gvcdykb",
            "score": 1,
            "text": "I don't wear underwear, so no hassle",
            "title_similarity": "0.25934577",
            "sentiment_compound": -0.4341
        },
        {
            "id": "gvce7e4",
            "score": 2,
            "text": "When 13 years of working in manufacturing finally started taking its toll. And I'm only 32 now.",
            "title_similarity": "0.44155425",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvcesl8",
            "score": 2,
            "text": "I was ten. Had a surgery and never kicked them off again.",
            "title_similarity": "0.40845665",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvcf8xq",
            "score": 2,
            "text": "I became old and grumpy when my back permanently went out and I could no longer do this.",
            "title_similarity": "0.5776626",
            "sentiment_compound": -0.296
        },
        {
            "id": "gvcfidf",
            "score": 2,
            "text": "I grab them with my feet and pass them to my hands.",
            "title_similarity": "0.10477981",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvcfqpt",
            "score": 2,
            "text": "I stopped doing this cause I kept hitting things(bed frame, chair, desk, my girlfriend etc) and my knees hurt...don’t ask me how old I am",
            "title_similarity": "0.7163321",
            "sentiment_compound": -0.2263
        },
        {
            "id": "gvcfy0v",
            "score": 2,
            "text": "Lmao thank-you! Made my day! Fellow wife who now understands. 😂",
            "title_similarity": "0.18265326",
            "sentiment_compound": 0.8118
        },
        {
            "id": "gvcgv7o",
            "score": 2,
            "text": "About 20 years ago. I'm in my thirties and have had a bad back (as well as way too much fat on my body) so doing stuff like that would have resulted in hurting myself a lot more than I'd care to do.",
            "title_similarity": "0.6570302",
            "sentiment_compound": 0.2795
        },
        {
            "id": "gvchzdv",
            "score": 3,
            "text": "I didn't even know that they exist tbh.",
            "title_similarity": "0.3448553",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvchzjm",
            "score": 2,
            "text": "I do this with shopping bags at work....\n\nAnd no I don't use then as underwear",
            "title_similarity": "0.42766955",
            "sentiment_compound": -0.296
        },
        {
            "id": "gvci5mj",
            "score": 1,
            "text": "A wasted effort they come off together with said pants or shorts then will be picked up at an appropriate time because at that moment just got home from work.",
            "title_similarity": "0.5395547",
            "sentiment_compound": -0.4939
        },
        {
            "id": "gvcifry",
            "score": 3,
            "text": "This is weird. I don’t do this with my shorts/clothes, but I use my feet to try to pick up various other things that would be a lot harder to pick up. Like one time I was putting up a shelf and put the wall anchors in and had the shelf ready on the brackets, but realized I left the screws on the desk. So I held it in place while using my toes to try to pick each one of the screws up...",
            "title_similarity": "0.6360254",
            "sentiment_compound": 0.2846
        },
        {
            "id": "gvciihs",
            "score": 1,
            "text": "I have no idea what you are talking about..but if I was to try such a thing you bet your ass you are going to try it at least a few more times till you make it or get them stuck on the ceiling fan.",
            "title_similarity": "0.6442572",
            "sentiment_compound": -0.6597
        },
        {
            "id": "gvciixv",
            "score": 1,
            "text": "Oh wow I genuinely thought it was just me who did this 🤣 anyone else do a spin of they need to get up and reach for something behind at the same time?",
            "title_similarity": "0.5030064",
            "sentiment_compound": 0.7964
        },
        {
            "id": "gvcik8j",
            "score": 3,
            "text": "Never stop trying to kick them up. If you fail a few times in a row, you leave them and come back in a few hours. If that doesn’t work, get some rest so your toes are strong for the next day so you can give it your best shot in the morning.",
            "title_similarity": "0.6092886",
            "sentiment_compound": 0.6896
        },
        {
            "id": "gvcj0vd",
            "score": 5,
            "text": "I’m 67 and still doing it. If there is something small on the floor that needs to be picked up I always try with my toes first. Do I get a prize?",
            "title_similarity": "0.5045409",
            "sentiment_compound": 0.5106
        },
        {
            "id": "gvcj2y6",
            "score": 2,
            "text": "Catch them in your teeth.",
            "title_similarity": "0.117457375",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvcjfrt",
            "score": 1,
            "text": "Always impressive move in front of your gf after sex. Especially when you miscalculate and they fly onto her face...",
            "title_similarity": "0.4931696",
            "sentiment_compound": 0.5106
        },
        {
            "id": "gvcjvl5",
            "score": 1,
            "text": "I know that this is completely against The Bro Code but I taught my wife how to do this. I bought her a bunch of underwear from Tomboy X so I get to see gay, trans, octopus and Hello Kitty pantys fly through the air. We have actually \"swap kicked\" underwear with each other. Having her as a wife is almost like having a little brother.",
            "title_similarity": "0.6029149",
            "sentiment_compound": 0.4235
        },
        {
            "id": "gvcjzyh",
            "score": 3,
            "text": "I embrace my inner simian by grabbing them with my toes and bringing them up to my hand.  I am old, grumpy and have a bad back.",
            "title_similarity": "0.54496205",
            "sentiment_compound": 0.25
        },
        {
            "id": "gvck33x",
            "score": 3,
            "text": "I'm English. Born that way.",
            "title_similarity": "0.049484972",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvcketa",
            "score": 5,
            "text": "When my spine started trying to kill me and sciatica prevents many of those movements, I stopped. :-(",
            "title_similarity": "0.67055273",
            "sentiment_compound": -0.8316
        },
        {
            "id": "gvcki1l",
            "score": 1,
            "text": "It's not that I'm grumpy, it's just a good way to pull a hammy that way.",
            "title_similarity": "0.3936822",
            "sentiment_compound": 0.4404
        },
        {
            "id": "gvckyql",
            "score": 3,
            "text": "When I started undressing myself apparently",
            "title_similarity": "0.21750152",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvclfmd",
            "score": 6,
            "text": "When I turned 25 and realized everytime I attempt it I end up pulling a muscle somehow.",
            "title_similarity": "0.44899684",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvclqad",
            "score": 3,
            "text": "If the catch is missed, then the toe grab it is. \n\n-Yoda (probably)",
            "title_similarity": "0.48525465",
            "sentiment_compound": -0.296
        },
        {
            "id": "gvclyyh",
            "score": 8,
            "text": "I haven’t don’t that, but I have successfully removed my underwear by sliding them off from my ankles while jumping.",
            "title_similarity": "0.460635",
            "sentiment_compound": 0.6486
        },
        {
            "id": "gvcm7kz",
            "score": 4,
            "text": "The last time I did it I broke my toe kicking the drawers.",
            "title_similarity": "0.58208156",
            "sentiment_compound": -0.4215
        },
        {
            "id": "gvcmrr3",
            "score": 2,
            "text": "Back when I was 14.",
            "title_similarity": "0.009295809",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvcmw1w",
            "score": 3,
            "text": "grab em with foot and yeet em with strong \"KEE-YAI\"",
            "title_similarity": "0.30794543",
            "sentiment_compound": 0.5106
        },
        {
            "id": "gvcn2w2",
            "score": 2,
            "text": "If I don’t catch them I pick them up with my toes , bring me foot to my ass up and grab them with the hand",
            "title_similarity": "0.41880864",
            "sentiment_compound": -0.0772
        },
        {
            "id": "gvcn5hd",
            "score": 2,
            "text": "Man I’m only 20, and I don’t remember. Actually I don’t remember ever doing this",
            "title_similarity": "0.4463879",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvcn8ui",
            "score": 1,
            "text": "I fell 25 feet out of a tree and can’t use my left foot so well anymore :/",
            "title_similarity": "0.48758683",
            "sentiment_compound": 0.02
        },
        {
            "id": "gvcnab1",
            "score": 3,
            "text": "I NEVER miss! AND if it looks like I did, I was just moving them there!!",
            "title_similarity": "0.25601822",
            "sentiment_compound": 0.5886
        },
        {
            "id": "gvcnanm",
            "score": 2,
            "text": "This question made me audibly laugh and now my dog is looking at me funny",
            "title_similarity": "0.37453458",
            "sentiment_compound": 0.7579
        },
        {
            "id": "gvcnefs",
            "score": 2,
            "text": "It's more like I became so fat and useless that it's hard to even pull off that maneuver anymore. Maybe some day I'll get my shit together and go back to being a boxer-flipping skinny guy, but it is not this day.",
            "title_similarity": "0.72813916",
            "sentiment_compound": -0.389
        },
        {
            "id": "gvcngs3",
            "score": 2,
            "text": "I do this with the resistance band at the gym -- so far I've impressed no one...other than myself! 😎",
            "title_similarity": "0.5323043",
            "sentiment_compound": 0.6658
        },
        {
            "id": "gvcnjcv",
            "score": 2,
            "text": "Oh my gosh.... my husband does this. I did not realize this was a thing for some men.",
            "title_similarity": "0.63783044",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvcnm3p",
            "score": 4,
            "text": "Oh my god I forgot I did this. I don’t do this anymore but I don’t know why. I’m gonna pick it up again",
            "title_similarity": "0.59290713",
            "sentiment_compound": 0.1406
        },
        {
            "id": "gvcnmbo",
            "score": 19,
            "text": "You guys are still wearing underwear?  We've been working from home for over a year.\n\nI basically live in board shorts, a white Hanes t-shirt, and a bathrobe with my tiny dog sometimes stuffed in one of the bathrobe pockets.  This is the fvcking way.",
            "title_similarity": "0.41091722",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvco1g8",
            "score": 1,
            "text": "Three knees ago",
            "title_similarity": "0.16985479",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvco1ub",
            "score": 2,
            "text": "Next level move is when you kick the underwear and shorts off and simultaneously  remove your shirt before the short/ underwear hit the floor.",
            "title_similarity": "0.47156686",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvco41h",
            "score": 3,
            "text": "Phil Dunphy? Is this you?",
            "title_similarity": "0.091651306",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvco5rx",
            "score": 2,
            "text": "Somewhere around 12 I stopped. It wasn't a super regular thing though, and I'll still do it once or twice a year.",
            "title_similarity": "0.39750445",
            "sentiment_compound": -0.6182
        },
        {
            "id": "gvco8du",
            "score": 2,
            "text": "I had no idea other people did that",
            "title_similarity": "0.25596046",
            "sentiment_compound": -0.296
        },
        {
            "id": "gvcoii6",
            "score": 1,
            "text": "Hahaha bro sadly long time ago. \nAnd after reading it I realised \"oh yeah thats true\".",
            "title_similarity": "0.35037822",
            "sentiment_compound": 0.7003
        },
        {
            "id": "gvcp145",
            "score": 1,
            "text": "When I moved out and most of my paycheck went to rent.",
            "title_similarity": "0.292601",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvcp4rt",
            "score": 2,
            "text": "If i misjudge the kick and they fly away i always pick them up with my toes, them monkeys aint better than me!",
            "title_similarity": "0.6674989",
            "sentiment_compound": -0.4015
        },
        {
            "id": "gvcp5aj",
            "score": 2,
            "text": "I didn't know this was a thing, but I'm gonna start doing it",
            "title_similarity": "0.3237863",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvcp8sf",
            "score": 2,
            "text": "They land directly in the laundry hamper now.",
            "title_similarity": "0.19928117",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvcpb5b",
            "score": 2,
            "text": "What happens if your scoobies land on your face trunk side down?!",
            "title_similarity": "0.47039145",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvcpd51",
            "score": 1,
            "text": "I've never done that and I also don't want to kick the wall or something else. I don't live in a palace like OP.",
            "title_similarity": "0.52972674",
            "sentiment_compound": 0.3134
        },
        {
            "id": "gvcph0q",
            "score": 5,
            "text": "There are men out there that dont do this??",
            "title_similarity": "0.502632",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvcpphj",
            "score": 2,
            "text": "That's for amateurs. I've been training the feet fingers for years. I can grab the clothes with them now.",
            "title_similarity": "0.41924793",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvcppzh",
            "score": 1,
            "text": "I’ll probably throw my back out attempting any shit like this lol.",
            "title_similarity": "0.4819098",
            "sentiment_compound": 0.1779
        },
        {
            "id": "gvcq27d",
            "score": 2,
            "text": "At 27 when my auto immune disease prevented me from snap movements. I am trying to learn how to remove and flip them using only my mind",
            "title_similarity": "0.53097624",
            "sentiment_compound": 0.3182
        },
        {
            "id": "gvcq2di",
            "score": 2,
            "text": "Failing is for the weak.\n\nAlso wow, now that you mention it, I've never not done this for as long as I can remember.",
            "title_similarity": "0.50278074",
            "sentiment_compound": -0.34
        },
        {
            "id": "gvcq2eq",
            "score": 1,
            "text": "The womb.",
            "title_similarity": "-0.03597592",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvcq8a7",
            "score": 1,
            "text": "Once while drunk I spent a good 3 minutes doing it over and over. Eventually I gave up trying to catch them and fell asleep in the bathtub.",
            "title_similarity": "0.5728566",
            "sentiment_compound": 0.128
        },
        {
            "id": "gvcqer0",
            "score": 2,
            "text": "damn when did i start being old and stopped throwing them like that....being 35 sucks!",
            "title_similarity": "0.63710415",
            "sentiment_compound": -0.5983
        },
        {
            "id": "gvcqk8d",
            "score": 2,
            "text": "Once a girl was dating asked me if I also do it if she's not around. She thought I was showing off.",
            "title_similarity": "0.42388445",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvcqkfl",
            "score": 2,
            "text": "Catch them? I'm trying to make it into the dirty laundry from across the room. Catching them is day one stuff bud.",
            "title_similarity": "0.56138104",
            "sentiment_compound": -0.4404
        },
        {
            "id": "gvcqlc8",
            "score": 3,
            "text": "I usually try to do it when the wife is in the room.  My first attempt is to launch them at her to see if she notices what I am doing.  If I miss, it gives me an excuse to stride around the room pant-less.  I don’t think we, as men, get to do that enough.",
            "title_similarity": "0.6935047",
            "sentiment_compound": -0.0772
        },
        {
            "id": "gvcqmni",
            "score": 2,
            "text": "I’m not old and grumpy. College just got me tired.",
            "title_similarity": "0.4975369",
            "sentiment_compound": -0.4404
        },
        {
            "id": "gvcqqax",
            "score": 1,
            "text": "So many times my wife has been on the receiving end of flying underwear. \n\nNever gets old.",
            "title_similarity": "0.44643196",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvcqrcz",
            "score": 1,
            "text": "I stop doing that when i had an accident a few years ago. I lifted the boxers and the empty plastic bags in the same way.\n\nThe Story goes like this:\n\nOnce after a quick job with some friends and their girlfriends. They were finishing smoking pot. I was gathering all the tools, there was a gray bag that seemed empty but had small nails. .\n\nI kicked the bag as usual, it flew and hit the wall and nails flew everywhere.\n\nmy friends who were quite high saw the whole scene and said almost in unison: \"we smoke but he get high\"\n\n&#x200B;\n\n(english is not my native lenguage)",
            "title_similarity": "0.70504427",
            "sentiment_compound": 0.5423
        },
        {
            "id": "gvcqzcf",
            "score": 2,
            "text": "I didnt relize this was an option",
            "title_similarity": "0.2780345",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvcrb2a",
            "score": 1,
            "text": "I don’t understand the question. Do you mean when you undress? Because then I’d already be touching the shorts.",
            "title_similarity": "0.5059245",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvcrg34",
            "score": 3,
            "text": "Bold of you to assume that it is possible to fail. My toes are so fucking dexterous that it's the same as if my primate butler had wandered over and handed me my boxers expecting to receive a banana for his troubles. You disgust me with your weak toe game. I would say good day sir, but you deserve no such blessing.",
            "title_similarity": "0.7602556",
            "sentiment_compound": -0.8791
        },
        {
            "id": "gvcrjm1",
            "score": 1,
            "text": "Look, I'm not trying to fall over and break my *other* hip.",
            "title_similarity": "0.30331194",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvcrlib",
            "score": 2,
            "text": "Stopped when I became more likely to injure myself than catch the clothes.  Now I just let the clothes drop to the floor, then grab with my toes and kick into the laundry pile in the corner.",
            "title_similarity": "0.6629127",
            "sentiment_compound": -0.4588
        },
        {
            "id": "gvcrmef",
            "score": 3,
            "text": "Thanks OP, now I am going to over think it and fail. I have been on a winning streak for I don't know how long. I'll probably double up on difficulty and kick them into the hamper from the floor.",
            "title_similarity": "0.6767958",
            "sentiment_compound": 0.1027
        },
        {
            "id": "gvcrokz",
            "score": 3,
            "text": "Ummmm, you guys don't take them off by bending at the waist, keeping your knees straight, and giggling? Have I been doing this wrong my whole life????",
            "title_similarity": "0.655347",
            "sentiment_compound": -0.2926
        },
        {
            "id": "gvcrrf2",
            "score": 3,
            "text": "Bold of you to assume they were ever on in the first place",
            "title_similarity": "0.24838275",
            "sentiment_compound": 0.3818
        },
        {
            "id": "gvcrumw",
            "score": 3,
            "text": "I have never ever done that or even thought to do that. Don't even understand why you would want or need to do this? Doesn't everyone else just have a pile of laundry on the floor that they kick worn clothes into once off? lol.",
            "title_similarity": "0.6736014",
            "sentiment_compound": 0.3094
        },
        {
            "id": "gvcrx9n",
            "score": 2,
            "text": "Ha! I love this question. As a lifelong football (soccer) player I get more excited than I should at the opportunity to do this. \n\nThere is no failure",
            "title_similarity": "0.3942341",
            "sentiment_compound": 0.9133
        },
        {
            "id": "gvcrz50",
            "score": 1,
            "text": "Shots fired 😂",
            "title_similarity": "0.14980489",
            "sentiment_compound": -0.1779
        },
        {
            "id": "gvcs1gh",
            "score": 2,
            "text": "Since I fucked my knees up in an accident. If I kicked my pants up in the air now I wouldn't be sure whether I'd be catching my pants or my lower leg on the way down.",
            "title_similarity": "0.7128396",
            "sentiment_compound": -0.8925
        },
        {
            "id": "gvcs3pb",
            "score": 2,
            "text": "Im surprised to find this thread, I do this a lot with clothes I have on the floor. I kind of grab it with my toes and yeet them into the air to catch it. Got to get that dopamine rush when I do something successful.\n\nMy girlfriend stares at me in awe like i’m some crazy man.  But realistically my back just hurts 24/7 and she slaps my ass every time I bend over.",
            "title_similarity": "0.6892236",
            "sentiment_compound": -0.7906
        },
        {
            "id": "gvcs3wu",
            "score": 3,
            "text": "Get. Off. My. LAWN!!!!",
            "title_similarity": "0.264213",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvcs4vv",
            "score": 2,
            "text": "About 37 years old. I didn’t think pain from aging would come so soon. Lol. Sitting at a computer 8+ hours a day for decades has done a number on me.",
            "title_similarity": "0.43149626",
            "sentiment_compound": 0.0202
        },
        {
            "id": "gvcsbdo",
            "score": 2,
            "text": "I have an apparently “weird” skill where I can use my feet about as effectively as I use my hands. I am a very effective ape when running around the house doing laundry. \n\nSo I just grab them with my foot and soccer yeet them bitches again until I catch them.",
            "title_similarity": "0.48846173",
            "sentiment_compound": 0.3384
        },
        {
            "id": "gvcsdfo",
            "score": 2,
            "text": "When everything started hurting, my knees are fucked and got some other issues, I did not win the body lottery.",
            "title_similarity": "0.7301947",
            "sentiment_compound": -0.8799
        },
        {
            "id": "gvcsgjw",
            "score": 1,
            "text": "Simple. I went commando about 2 years ago. Best decision ever.",
            "title_similarity": "0.33168042",
            "sentiment_compound": 0.6369
        },
        {
            "id": "gvcsrpv",
            "score": 2,
            "text": "I had to pause it for while because I fucked up my back/hip, and simply didn't have the necessary snappyness to launch my underwear to an acceptable height, so I just had to shimmy out of it and pick them up from the floor. \n\nI'm better now. It's only my left side that needs 15mins of mobility/stretching in the morning before I can attempt any true feat of athleticism. Beware your late 30s!",
            "title_similarity": "0.7236712",
            "sentiment_compound": 0.4389
        },
        {
            "id": "gvctgh9",
            "score": 2,
            "text": "When you shit yourself as regularly as I do this becomes a dangerous game.",
            "title_similarity": "0.56581837",
            "sentiment_compound": -0.7717
        },
        {
            "id": "gvctpdy",
            "score": 2,
            "text": "Around the same time I picked up socks with my toes and flung them behind me to catch them in the air. Its called upgrades people!",
            "title_similarity": "0.42175624",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvctvbf",
            "score": 2,
            "text": "When my back no longer allowed me to perform such feats.",
            "title_similarity": "0.46775213",
            "sentiment_compound": -0.296
        },
        {
            "id": "gvctyep",
            "score": 2,
            "text": "I just unzip them and jump so they slip straight off onto the ground. But that's usually because I'm going to wear those shorts again. How many jumps they take to come off is how much weight I need to lose.",
            "title_similarity": "0.62979513",
            "sentiment_compound": -0.453
        },
        {
            "id": "gvctzs4",
            "score": 1,
            "text": "Dirty clothes belong on the floor at the exact place you stepped out of them.\n\nSincerely, \n\nNot old men\n\nP.S. Putting your laundry in a hamper makes you old.",
            "title_similarity": "0.6479188",
            "sentiment_compound": 0.0516
        },
        {
            "id": "gvcu1xb",
            "score": 1,
            "text": "You wear underwear? Go commando or go home.",
            "title_similarity": "0.33578154",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvcu2ab",
            "score": 1,
            "text": "F You @DaddyJMo1381 !\n\nYour mom‘a got my briefs clenched in her teeth like a pit bull. With as wet as she gets it wouldn’t be safe to try kicking anything in the air.",
            "title_similarity": "0.66216034",
            "sentiment_compound": 0.69
        },
        {
            "id": "gvcuhej",
            "score": 2,
            "text": "I just shortcut to kicking them directly into the dirty pile.",
            "title_similarity": "0.53960586",
            "sentiment_compound": -0.4404
        },
        {
            "id": "gvcumf9",
            "score": 2,
            "text": "What are you on about? When I'm taking off my shorts or underwear, I'm already bent over with my hands at my ankles. I'm already down there. Might as well finish the job by grabbing hold of them before righting myself.\n\nI genuinely don't know what you're talking about.\n\nFor age reference I am 18",
            "title_similarity": "0.64424694",
            "sentiment_compound": 0.2732
        },
        {
            "id": "gvcuqyf",
            "score": 1,
            "text": "Probably the same time I threw out my back.",
            "title_similarity": "0.2655859",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvcus3b",
            "score": 2,
            "text": "this is a thing? that sounds fun i have to try it",
            "title_similarity": "0.12898636",
            "sentiment_compound": 0.5106
        },
        {
            "id": "gvcusnt",
            "score": 1,
            "text": "I feel directly attacked lol",
            "title_similarity": "0.22331566",
            "sentiment_compound": -0.0516
        },
        {
            "id": "gvcv1x7",
            "score": 2,
            "text": "I must be boring then. I take mine off sexually with sexy music and stage lighting.",
            "title_similarity": "0.52585113",
            "sentiment_compound": 0.2732
        },
        {
            "id": "gvcv35h",
            "score": 2,
            "text": "Oh shit I was born grumpy I guess. I am born anew today and much less grumpy.",
            "title_similarity": "0.4328816",
            "sentiment_compound": -0.5574
        },
        {
            "id": "gvcv3hk",
            "score": 1,
            "text": "I don't understand the question, why are you kicking the underwear? And where are you kicking them too?",
            "title_similarity": "0.62062633",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvcv5k3",
            "score": 1,
            "text": "It happened in 2018 when I started work and it broke me",
            "title_similarity": "0.4848289",
            "sentiment_compound": -0.4215
        },
        {
            "id": "gvcv7xz",
            "score": 2,
            "text": "Why would I want to touch them? I kick them right into the fireplace.",
            "title_similarity": "0.43982852",
            "sentiment_compound": 0.0772
        },
        {
            "id": "gvcvdda",
            "score": 2,
            "text": "About to be 38 and I still do this every single time",
            "title_similarity": "0.13323763",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvcvmty",
            "score": 1,
            "text": "Wait what?  I havent heard of this",
            "title_similarity": "0.2829293",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvcvp86",
            "score": 2,
            "text": "I’ve never missed a catch.",
            "title_similarity": "0.109945446",
            "sentiment_compound": 0.2235
        },
        {
            "id": "gvcvqrz",
            "score": 2,
            "text": "Drop 'em, pich them with your big toe, and back-kick them over your sholder to catch in front of you / drop in the basket.\n\nunfortunately at 45 I'm getting less flexible and more back pain from doing this.",
            "title_similarity": "0.66887534",
            "sentiment_compound": -0.8211
        },
        {
            "id": "gvcvvax",
            "score": 3,
            "text": "Used to have a trick where I would remove my underwear while wearing a pair of shorts (they were the stretchy \" brief\" variety), but since my dog eventually destroyed all my underwear, (chewed out the taint area), I now go commando and will never go back.\nGetting naked is pretty fast.\n I became grumpy when I saw myself in the mirror.",
            "title_similarity": "0.74071723",
            "sentiment_compound": -0.0258
        },
        {
            "id": "gvcw8v4",
            "score": 1,
            "text": "When I broke my hip trying to kick my undies. Fuck off.",
            "title_similarity": "0.6279191",
            "sentiment_compound": -0.743
        },
        {
            "id": "gvcw9p1",
            "score": 1,
            "text": "I’ve been doing this since a toddler. I’m damnear a pro at kicking clothes in the air and catching them.",
            "title_similarity": "0.380145",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvcwc15",
            "score": 1,
            "text": "No but for real WHAT are you talking about?",
            "title_similarity": "0.16672505",
            "sentiment_compound": -0.1531
        },
        {
            "id": "gvcwdzy",
            "score": 1,
            "text": "If I dont get them on the first try I grab them with my toes and bring them to my hand. Bending down is so plain.",
            "title_similarity": "0.4311107",
            "sentiment_compound": 0.4939
        },
        {
            "id": "gvcwifn",
            "score": 1,
            "text": "When you play HS sports and change in watery, grimy bathrooms, you keep your britches off the goddam floor. And the gym too. If you’ve ever been without water for an extended amount of time and don’t like being naked in the locker room, you change in the shower. I just use the same method every time I change. Lower the waist band slightly. Grab the bottom of the leg curf. Slide out of the whole pant leg and repeat on the other side.",
            "title_similarity": "0.59099",
            "sentiment_compound": -0.5574
        },
        {
            "id": "gvcwkec",
            "score": 1,
            "text": "The first time I missed and kicked my dank dingy drawers right into my wife's face. She was not as amused as I was.",
            "title_similarity": "0.6793789",
            "sentiment_compound": -0.5472
        },
        {
            "id": "gvcwpj1",
            "score": 3,
            "text": "I don't want to touch my dirty underwear with my hands. I kick them right into the hamper.",
            "title_similarity": "0.630732",
            "sentiment_compound": -0.4805
        },
        {
            "id": "gvcwr9y",
            "score": 1,
            "text": "Since im 7.....",
            "title_similarity": "-0.034519143",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvcwwv8",
            "score": 2,
            "text": "Na kick em against the wall till they slop into the washing basket",
            "title_similarity": "0.5082115",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvcwy6l",
            "score": 2,
            "text": "The true test is if you can flick them up from behind.  \n\nAlso, underwear kicking is dangerous, please use caution as I have broken toes hahah",
            "title_similarity": "0.6143434",
            "sentiment_compound": -0.2732
        },
        {
            "id": "gvcx25b",
            "score": 2,
            "text": "Because now I launch them with my feet at the laundry basket. I've gotten pretty good over the years.",
            "title_similarity": "0.3162285",
            "sentiment_compound": 0.7269
        },
        {
            "id": "gvcx25i",
            "score": 2,
            "text": "I’ve never thought to do this? I guess I’ve always been an old man? Like I just drop my pants and shorts on the floor in my room.",
            "title_similarity": "0.6662975",
            "sentiment_compound": 0.1926
        },
        {
            "id": "gvcx3dt",
            "score": 2,
            "text": "I just developed better aim, now I just kick them straight into the hamper across the room.",
            "title_similarity": "0.47747257",
            "sentiment_compound": 0.5859
        },
        {
            "id": "gvcxcqt",
            "score": 1,
            "text": "Sometimes I do them backwards. They flip back just above my shoulders.",
            "title_similarity": "0.26475632",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvcxmdz",
            "score": 2,
            "text": "You don’t just leave them on the floor?",
            "title_similarity": "0.24202004",
            "sentiment_compound": -0.0516
        },
        {
            "id": "gvcxq6z",
            "score": 2,
            "text": "Kick them back into the air but after three consecutive fails i will admit defeat.",
            "title_similarity": "0.6166489",
            "sentiment_compound": -0.7579
        },
        {
            "id": "gvcy2jg",
            "score": 1,
            "text": "Of course I do. \n\nAnd if I fail to catch them or get them in the hamper, I helicopter until the downdraft blows them under the nearest piece of furniture.",
            "title_similarity": "0.54042107",
            "sentiment_compound": -0.5423
        },
        {
            "id": "gvcy3nq",
            "score": 2,
            "text": "Wait...you're saying there's some other way to remove these?",
            "title_similarity": "0.34611583",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvcy5rv",
            "score": 2,
            "text": "I do this with trousers as well 😎",
            "title_similarity": "0.04595592",
            "sentiment_compound": 0.6249
        },
        {
            "id": "gvcy803",
            "score": 1,
            "text": "I got grumpy as soon as my back hurt too much to do that. Pain makes me grumpy.",
            "title_similarity": "0.67597675",
            "sentiment_compound": -0.7717
        },
        {
            "id": "gvcyazo",
            "score": 1,
            "text": "It tends to waft a fartish, arsey smell about the place, so my missus doesn't really dig it.",
            "title_similarity": "0.61415315",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvcyjyn",
            "score": 1,
            "text": "I just don't wear any anymore...",
            "title_similarity": "0.29549024",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvcyp55",
            "score": 1,
            "text": "when bending over became painful. God it sucks to get old.",
            "title_similarity": "0.58309484",
            "sentiment_compound": -0.5106
        },
        {
            "id": "gvcysjc",
            "score": 1,
            "text": "I obtained a wonderful level of dextery, being able to land it anywhere, even on my wife's head. Now I am training the other foot.",
            "title_similarity": "0.35288328",
            "sentiment_compound": 0.5719
        },
        {
            "id": "gvcyvaf",
            "score": 1,
            "text": "When i dislocated my hip. To be fair i still try when its not sore but most times i just end up slapping the shorts/underwear against the wall.",
            "title_similarity": "0.6061597",
            "sentiment_compound": 0.2971
        },
        {
            "id": "gvcyvr8",
            "score": 1,
            "text": "When I slammed my foot into the wall doing it and snapped my toe in half.",
            "title_similarity": "0.3954317",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvcyzej",
            "score": 1,
            "text": "When they failed to marry women who can remove their bras in seconds without taking off their shirts.",
            "title_similarity": "0.58791506",
            "sentiment_compound": -0.5106
        },
        {
            "id": "gvcz47i",
            "score": 1,
            "text": "I don't need to catch them; they land in the washing basket.",
            "title_similarity": "0.3668892",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvczbl4",
            "score": 2,
            "text": "For me, when I fail. It turns into a game similar to the claw game at arcades. My big toe and \"index\" toe become the claw and I try to pick it up.\n\nWhen that fails I usually decide to kick it towards the hamper and blame the cat for going in there and pulling it out. This way my GF doesn't get mad and I can continue my claw game for another round on another day!",
            "title_similarity": "0.6525974",
            "sentiment_compound": -0.7479
        },
        {
            "id": "gvcze2x",
            "score": 1,
            "text": "can't anymore, bad knee. hard to balance on just that leg and it doesn't always want to move quite the way i need it to for kicking them off",
            "title_similarity": "0.66095066",
            "sentiment_compound": 0.3022
        },
        {
            "id": "gvcztco",
            "score": 2,
            "text": "I don’t kick them into my hands, I aim for the hamper and try to get them in from there. I’ve gotten pretty good",
            "title_similarity": "0.4951334",
            "sentiment_compound": 0.7269
        },
        {
            "id": "gvczy56",
            "score": 1,
            "text": "When I broke my leg and ankle",
            "title_similarity": "0.40825814",
            "sentiment_compound": -0.4215
        },
        {
            "id": "gvd05nm",
            "score": 1,
            "text": "When I miss I look around, hoping no one noticed and is coming to take away my man card",
            "title_similarity": "0.71650803",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvd08yz",
            "score": 1,
            "text": "WHO DOESNT DO THIS?MEN?WOMEN?KIDS?NEIGBOURS?YOUR PETS?seriously,who doesnt do this.\n\n&#x200B;\n\nif they fall i jsut pikc them with my toes adn throw them in the air wiht my leg.",
            "title_similarity": "0.69975746",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvd0h5v",
            "score": 2,
            "text": "I haven’t failed at this since I was a wee lad. \n\nSadly, my wife is never impressed by this feat of athleticism and display of virility",
            "title_similarity": "0.4898138",
            "sentiment_compound": -0.825
        },
        {
            "id": "gvd0zhx",
            "score": 1,
            "text": "I messed up my right knee",
            "title_similarity": "0.3982978",
            "sentiment_compound": -0.34
        },
        {
            "id": "gvd0zp1",
            "score": 1,
            "text": "I try again!!",
            "title_similarity": "0.10382379",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvd11gv",
            "score": 1,
            "text": "I don't have this much talent.",
            "title_similarity": "0.25434378",
            "sentiment_compound": 0.4215
        },
        {
            "id": "gvd1kqm",
            "score": 2,
            "text": "I still do this, but I add a nice helicopter as a flourish. \n\nMy girlfriend has yet to appreciate this finely honed skill.",
            "title_similarity": "0.505229",
            "sentiment_compound": 0.8047
        },
        {
            "id": "gvd1msc",
            "score": 1,
            "text": "I work remote and have for the last few years (minus unemployment for a little bit last year).  What shorts and underwear?",
            "title_similarity": "0.338561",
            "sentiment_compound": -0.4404
        },
        {
            "id": "gvd1my0",
            "score": 1,
            "text": "> Those that do this, what happens when you fail to catch them? Do you give it the old college try and attempt it from the floor \n\nYup. Grab it between my toes, toss it again in the air and when I grab it I make sure I do my victory dance body shake.",
            "title_similarity": "0.6248701",
            "sentiment_compound": -0.4404
        },
        {
            "id": "gvd1nb8",
            "score": 2,
            "text": "So this is one of those things that everyone does but nobody talks about huh?",
            "title_similarity": "0.48409274",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvd1sp6",
            "score": 2,
            "text": "Now that I’ve stopped to think about I have absolutely no idea what I usually do, I’ve never paid any attention to it before. I gotta go conduct some experiments",
            "title_similarity": "0.5312895",
            "sentiment_compound": -0.5256
        },
        {
            "id": "gvd1vpm",
            "score": 1,
            "text": "I swear Phil does this in modern family ಠ_ʖಠ",
            "title_similarity": "0.19607607",
            "sentiment_compound": -0.0516
        },
        {
            "id": "gvd22yx",
            "score": 2,
            "text": "I usually fling them into the laundry basket with my feet. Is that ok or no?",
            "title_similarity": "0.4033596",
            "sentiment_compound": 0.296
        },
        {
            "id": "gvd251g",
            "score": 2,
            "text": "Who says im old and grumpy because i dont kick them off?! I just take them off and shoot them into the laundry basket across the room like a basketball.... Now whos old and grumpy",
            "title_similarity": "0.7078249",
            "sentiment_compound": 0.1007
        },
        {
            "id": "gvd2592",
            "score": 1,
            "text": "A fun one is taking a running leap at your bed and trying to put on your underwear both legs at a time in the air.  \n\nDon’t try full on pants till you’re confident with shorts.  \n\nThat’s expert level",
            "title_similarity": "0.5177314",
            "sentiment_compound": 0.7579
        },
        {
            "id": "gvd26d3",
            "score": 1,
            "text": "i don't wear underwear so sadly i cant kick them into the air",
            "title_similarity": "0.4648676",
            "sentiment_compound": -0.5598
        },
        {
            "id": "gvd28sd",
            "score": 1,
            "text": "When my back started hurting too much and my legs lost too much flexibility to be able to do this. Sometime in my mid 20s.\n\nBoy am I not looking forward to actually being old",
            "title_similarity": "0.66406596",
            "sentiment_compound": -0.3818
        },
        {
            "id": "gvd294j",
            "score": 1,
            "text": "I'm only 26, and consider myself rather childish at heart. What the fuck are you on about XD",
            "title_similarity": "0.5348977",
            "sentiment_compound": 0.6166
        },
        {
            "id": "gvd2e8q",
            "score": 2,
            "text": "I do this with my socks too. That's a hat trick that never fails to brighten my day.",
            "title_similarity": "0.29481468",
            "sentiment_compound": -0.0706
        },
        {
            "id": "gvd2j2l",
            "score": 1,
            "text": "Did this with doc martens once, got a nose bleed for my trouble",
            "title_similarity": "0.6054248",
            "sentiment_compound": -0.4019
        },
        {
            "id": "gvd2raw",
            "score": 1,
            "text": "When I was born.",
            "title_similarity": "-0.045973435",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvd2rjm",
            "score": 2,
            "text": "My wife thinks it's the weirdest thing I do that she laughs every time. And I'm like WTF it only makes sense why wouldn't you do this?",
            "title_similarity": "0.51278466",
            "sentiment_compound": -0.186
        },
        {
            "id": "gvd2t0g",
            "score": 2,
            "text": "I don't miss.",
            "title_similarity": "-0.044446733",
            "sentiment_compound": 0.1139
        },
        {
            "id": "gvd2t1d",
            "score": 1,
            "text": "Was born in 80's... Didn't know this is thing",
            "title_similarity": "0.27325633",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvd2tyd",
            "score": 1,
            "text": "2019",
            "title_similarity": "-0.017821126",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvd31u1",
            "score": 1,
            "text": "I just drop them to the floor. Don't kick them up to catch them. Don't pick them up immediately. That's older me's problem. Usually post shower or just woke up in the morning me's problem.",
            "title_similarity": "0.70237714",
            "sentiment_compound": -0.7579
        },
        {
            "id": "gvd32np",
            "score": 1,
            "text": "Plot twist:I dont wear underwear",
            "title_similarity": "0.3896569",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvd3638",
            "score": 2,
            "text": "Roll over on bed, kick the underwear will all my might. It touches the fan moving at full speed, the underwear moves with the speed of light and lands on my dad's face.\n\nThat's when it ended.\n\nP.s., my dad is old and grumpy",
            "title_similarity": "0.67046434",
            "sentiment_compound": 0.3182
        },
        {
            "id": "gvd399v",
            "score": 1,
            "text": "I had to stop when my toenails got so long and sharp that my underwear was shredding across the skid marks.",
            "title_similarity": "0.59674335",
            "sentiment_compound": -0.296
        },
        {
            "id": "gvd3e6h",
            "score": 1,
            "text": "I just grab ‘em with my foot and try again. I ain’t surrendering to a pair of shorts.",
            "title_similarity": "0.4582684",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvd3gih",
            "score": 1,
            "text": "Implying I wear underwear \n\nI wear tight sport shorts instead and when I untie them at the end of the day I hula dance out of them them soccer kick them at the wall above the cloths basket. Then I put on judo style super loose fitting sweat pants on and walk around shaking my legs and wiggling my toes while organizing everything for a relaxing evening before I wear foot thong slippers.",
            "title_similarity": "0.47459543",
            "sentiment_compound": 0.6249
        },
        {
            "id": "gvd3l10",
            "score": 2,
            "text": "My wife is a lovely lady. She takes my underwear off for me. To this day I still kick her into the air and try to catch her.",
            "title_similarity": "0.42541003",
            "sentiment_compound": 0.5859
        },
        {
            "id": "gvd3mhm",
            "score": 2,
            "text": "I kick mine behind me and grab them behind me back. Beat that, boys!",
            "title_similarity": "0.47027868",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvd3vxp",
            "score": 2,
            "text": "Oh I forgot about that. I forgot I ever did that. I forgot that that even was a thing.",
            "title_similarity": "0.47271425",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvd3xvo",
            "score": 2,
            "text": "I honestly didn't know people did this, and now that I do know I'll be trying it every chance I get",
            "title_similarity": "0.4384396",
            "sentiment_compound": 0.6124
        },
        {
            "id": "gvd3ypo",
            "score": 2,
            "text": "This is exactly the kind of sophisticated content I come to this sub for.",
            "title_similarity": "0.09004305",
            "sentiment_compound": 0.5118
        },
        {
            "id": "gvd3zfv",
            "score": 1,
            "text": "Why grab them again instead of kicking them into the hamper?",
            "title_similarity": "0.5150683",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvd41cx",
            "score": 1,
            "text": "I like to catapult them of me. Especially when I sense the snu snu is gonna happen.",
            "title_similarity": "0.356902",
            "sentiment_compound": 0.3612
        },
        {
            "id": "gvd41s0",
            "score": 2,
            "text": "My drawers are generally far too sweaty to whip them around like that.",
            "title_similarity": "0.5680963",
            "sentiment_compound": 0.3612
        },
        {
            "id": "gvd42jy",
            "score": 1,
            "text": "My knees dont work so good any more, im getting old.",
            "title_similarity": "0.5641044",
            "sentiment_compound": 0.5777
        },
        {
            "id": "gvd46bk",
            "score": 1,
            "text": "Around the age of 22",
            "title_similarity": "-0.03710881",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvd4bit",
            "score": 1,
            "text": "Juvenile arthritis, my knees and hips just don’t bend at speeds fast enough to flick them for height. \n\nNow for distance into the laundry bin that I have nearly mastered.",
            "title_similarity": "0.62949467",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvd4i1r",
            "score": 1,
            "text": "Oh ho, I kick my shorts/underwear off directly into my dirty clothes bin. \n  \nI. Am. A. God.",
            "title_similarity": "0.57009786",
            "sentiment_compound": -0.2023
        },
        {
            "id": "gvd4i45",
            "score": 2,
            "text": "Can't thinkmof any instance where I missed it though.  Not saying i never missed catching, it is just that it has become such a natural thing to do i barely remember doing it consciously",
            "title_similarity": "0.40977514",
            "sentiment_compound": 0.2933
        },
        {
            "id": "gvd4lk5",
            "score": 2,
            "text": "I have hella long toes and I'm surprisingly flexible for a chonk; I just grab them with my toes and throw them to the hamper with accuracy.",
            "title_similarity": "0.42306957",
            "sentiment_compound": 0.4767
        },
        {
            "id": "gvd4mp8",
            "score": 2,
            "text": "If I catch it, I give a ~~meat spin~~ helicopter or two.",
            "title_similarity": "0.3072022",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvd4p56",
            "score": 1,
            "text": "To be honest, I just never thought about doing it. Guess I'll have to give it a try",
            "title_similarity": "0.42948082",
            "sentiment_compound": 0.5106
        },
        {
            "id": "gvd4urv",
            "score": 2,
            "text": "Amateurs catch with their hands.\n\n Pro's land it on there head.",
            "title_similarity": "0.41469264",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvd4xia",
            "score": 1,
            "text": "If I drop them on my first attempt I grab them with my foot and launch it up and over my head and try to catch it that way.",
            "title_similarity": "0.46928725",
            "sentiment_compound": -0.2732
        },
        {
            "id": "gvd52vz",
            "score": 1,
            "text": "What I do is bunch it up and throw a three pointer at the laundry basket at the corner of the room. Most times it lands on the floor.",
            "title_similarity": "0.3514915",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvd53l9",
            "score": 1,
            "text": "I always do it a second time as if there is a camera and live studio audience.",
            "title_similarity": "0.26659638",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvd56cd",
            "score": 1,
            "text": "I dunno. But for three years I simply removed my underwear. Like some robot with no emotion. Now I kick mine up but their crusty so I usually dont catch them. Thats gwoss.",
            "title_similarity": "0.6745453",
            "sentiment_compound": 0.1154
        },
        {
            "id": "gvd5ayz",
            "score": 2,
            "text": "You have been doing it wrong my friend. You set your laundry hamper up across the room, and you flick then across the room like chucking a 3 pointer. If you miss, well that's sad, pick it up later",
            "title_similarity": "0.7117621",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvd5rm0",
            "score": 1,
            "text": "Getting a few zippers to the face puts a damper on the mood.",
            "title_similarity": "0.49883142",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvd61he",
            "score": 2,
            "text": "The time honored tradition, unlike any other.",
            "title_similarity": "0.13755366",
            "sentiment_compound": 0.5859
        },
        {
            "id": "gvd61mk",
            "score": 1,
            "text": "If ya droppem, it's a great opportunity for a stretch.",
            "title_similarity": "0.26288235",
            "sentiment_compound": 0.7845
        },
        {
            "id": "gvd65co",
            "score": 1,
            "text": "When I got a job",
            "title_similarity": "0.1182932",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvd69w8",
            "score": 2,
            "text": "Jokes on you clowns I got my wife AND kids doing it too.",
            "title_similarity": "0.39549786",
            "sentiment_compound": 0.25
        },
        {
            "id": "gvd6ajc",
            "score": 1,
            "text": "I grab them with my toes and left it to my hand.",
            "title_similarity": "0.24491388",
            "sentiment_compound": 0.4939
        },
        {
            "id": "gvd6i5c",
            "score": 1,
            "text": "I try to do this but my giant johnson gets in the way.",
            "title_similarity": "0.5120155",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvd6mvn",
            "score": 2,
            "text": "Admit defeat and pick them up. If it ain't this swift motion the first time, I failed the mission....",
            "title_similarity": "0.6521448",
            "sentiment_compound": -0.7383
        },
        {
            "id": "gvd6oe5",
            "score": 2,
            "text": "After I lost an eye to the end of my belt.",
            "title_similarity": "0.40893963",
            "sentiment_compound": -0.3182
        },
        {
            "id": "gvd6qdy",
            "score": 2,
            "text": "I got old and grumpy when my back started acting up and I could no longer do this trick.",
            "title_similarity": "0.6353619",
            "sentiment_compound": -0.3506
        },
        {
            "id": "gvd6ski",
            "score": 1,
            "text": "College",
            "title_similarity": "0.07574621",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvd6v06",
            "score": 2,
            "text": "I still do this at 48.",
            "title_similarity": "0.013391026",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvd7cv3",
            "score": 2,
            "text": "If I'm already refusing to bend over to pick them up, then I use my toes to pick them up if it's it's rare occasion I miss.",
            "title_similarity": "0.58090514",
            "sentiment_compound": -0.5106
        },
        {
            "id": "gvd7qz1",
            "score": 2,
            "text": "Well it all started when I was about 6 or 7, I was in my parents room taking a bath, and of course I did the usual. Take off the socks halfway, then throw them up and catch them. Then the pants, and then the underwear. This time I felt a little extra, so I just threw the underwear as hard as I could, and didn’t look back. I was planning on cleaning them up afterwards, as I was going to have to anyway to put my clothes in the laundry basket. Anyway, as I was taking my bath, I heard a crackling noise and saw that my underwear had fallen on a lamp with no lampshade, and my underwear was on fire on top of it. I yell for my parents, and my dad extinguished the fire and threw my underwear away. After that, I always kept lampshades on lamps and never kicked my clothes again.",
            "title_similarity": "0.6012992",
            "sentiment_compound": -0.7184
        },
        {
            "id": "gvd7ubg",
            "score": 1,
            "text": "When I fell 20 feet, shattered an ankle, and broke my leg in 3 places.",
            "title_similarity": "0.4198296",
            "sentiment_compound": -0.7096
        },
        {
            "id": "gvd7wrc",
            "score": 2,
            "text": "I'm too old and fat to bend over. If I miss the kick, I use my prehensile toes to pick them up.",
            "title_similarity": "0.6102261",
            "sentiment_compound": -0.1531
        },
        {
            "id": "gvd83o9",
            "score": 1,
            "text": "I don’t believe this sort of man exists without having some kind of physical ailment to stop them.",
            "title_similarity": "0.6047431",
            "sentiment_compound": -0.296
        },
        {
            "id": "gvd85h6",
            "score": 1,
            "text": "I dont understand this question. How do you remove your underwear by kicking it into the air?\n\nIm 32(m) and Ive looked through the comments, but im missing r/restofthefuckingowl",
            "title_similarity": "0.6937364",
            "sentiment_compound": -0.4215
        },
        {
            "id": "gvd87ss",
            "score": 1,
            "text": "I guess I’m old and grumpy because this post just pissed me off?",
            "title_similarity": "0.681147",
            "sentiment_compound": -0.6369
        },
        {
            "id": "gvd889y",
            "score": 1,
            "text": "I think around the time I got the training wheels off my bike so between 5 and 6.",
            "title_similarity": "0.30125666",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvd8kzd",
            "score": 1,
            "text": " **when did you become so old and grumpy?** \n\n&#x200B;\n\nAfter my first knee and back injuries",
            "title_similarity": "0.63002485",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvd8w4m",
            "score": 1,
            "text": "Who are you kickers? Do your toes not grasp?",
            "title_similarity": "0.49377325",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvd8yel",
            "score": 2,
            "text": "r/ModernFamily",
            "title_similarity": "0.07835938",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvd972n",
            "score": 1,
            "text": "Am I the only one who's been doing it more everysince I've gotten older?\n\n1. I moved in with someone who does not enjoy me having my clothes in the hallway. I used to just take everything off the moment I got into the house and leave it on the floor. Mind you, I only wear my own clothes for 20 minutes a day during my commute, the rest I wear scrubs so I might wear the same shirt twice. It's easier access in the morning, I get dressed on the way to the toilet in the morning. \n\nand 2. My back is messed up, so I don't like to bend down.",
            "title_similarity": "0.647991",
            "sentiment_compound": -0.5861
        },
        {
            "id": "gvd98hp",
            "score": 1,
            "text": "I struggle sometimes to put my leg in my pants, after the first one has gone in.\n\nMy balance is not what it was.",
            "title_similarity": "0.5231045",
            "sentiment_compound": -0.3182
        },
        {
            "id": "gvd9ktd",
            "score": 1,
            "text": "I was born old, but I do that when I dropped some kind of cloth on the floor, so I don't need to move too much to pick it up",
            "title_similarity": "0.5713452",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvd9wfr",
            "score": 2,
            "text": "Quite the opposite.  I’ve found at a later age (50) that it’s easier to kick them up than bend over.",
            "title_similarity": "0.40674573",
            "sentiment_compound": 0.4215
        },
        {
            "id": "gvd9yuo",
            "score": 1,
            "text": "About when I ruptured a couple of discs.\n\n\n\nMy current approach is: stand up with back to bed, whip them down with both hands, and land on my backside on the bed, flip the shorts off with both hands with my legs in the air, flip back up into a standing position, then Kobe to the washing basket for 3 points.\n\n\n\nPromotes back strength, flexibility, and pure sex appeal (or laughter if my wife catches me doing it).",
            "title_similarity": "0.5090325",
            "sentiment_compound": 0.8807
        },
        {
            "id": "gvd9zjh",
            "score": 1,
            "text": "I stand on my head and use the door knob to catch the elastic as I lower myself to the floor.  If I'm successful, my dirty gonch will slip off and land on my face so I can get a good satisfying whiff before I fold them into a filter to make my morning coffee.  No better way to wake up and start yoru day.",
            "title_similarity": "0.5659263",
            "sentiment_compound": 0.4929
        },
        {
            "id": "gvda5bl",
            "score": 2,
            "text": "As a man I am scared of bending so I casually kick them shorts into the basket every time without fail",
            "title_similarity": "0.6889042",
            "sentiment_compound": 0.2331
        },
        {
            "id": "gvda7uj",
            "score": 1,
            "text": "Damn I thought I was the only one who did this",
            "title_similarity": "0.22529218",
            "sentiment_compound": -0.4019
        },
        {
            "id": "gvda88l",
            "score": 1,
            "text": "After a failed attempt I pinch them with my toes from the floor.",
            "title_similarity": "0.5043054",
            "sentiment_compound": -0.5106
        },
        {
            "id": "gvdade1",
            "score": 1,
            "text": "I dont wanna pull something bro",
            "title_similarity": "0.32701722",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvdaesj",
            "score": 1,
            "text": "When I had my hip replaced",
            "title_similarity": "0.21512249",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvdaf2p",
            "score": 1,
            "text": "So at a certain point, your knees just won’t let this happen any more. That being said, I do still enjoy the “Jordan from the half court line” toss in to the laundry basket once I do pick them up. Never give up on the classics",
            "title_similarity": "0.6251017",
            "sentiment_compound": 0.6771
        },
        {
            "id": "gvdaf6e",
            "score": 1,
            "text": "I didn't I kick them across the room at the laundry pile football style",
            "title_similarity": "0.5024133",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvdakrf",
            "score": 1,
            "text": "Early 20s",
            "title_similarity": "0.022347864",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvdaqzi",
            "score": 2,
            "text": "At some point I just started walking to the bed and letting them fall off during the walk. I'm 23, I don't know when i died inside",
            "title_similarity": "0.5022714",
            "sentiment_compound": -0.5574
        },
        {
            "id": "gvdaszj",
            "score": 2,
            "text": "I did this the other day. It landed all the way at back of my wardrobe. I tried again until it landed on the top of wardrobe. \n\nI felt so accomplished that day.",
            "title_similarity": "0.38646346",
            "sentiment_compound": 0.6748
        },
        {
            "id": "gvdayrt",
            "score": 1,
            "text": "Simple, I kick them directly into the pile next to my hamper.",
            "title_similarity": "0.35820478",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvdb1cg",
            "score": 2,
            "text": "I let out a fairly loud giggle when I read this. Glad to know I’m not alone",
            "title_similarity": "0.26219928",
            "sentiment_compound": 0.7929
        },
        {
            "id": "gvdb8iu",
            "score": 2,
            "text": "I've had a long day and just opened Reddit to disengage from the stress of life. This was the first post I saw and it genuinelly made me laugh at a volume that likely upset my neighbours. Thank you for that!",
            "title_similarity": "0.63084245",
            "sentiment_compound": 0.2481
        },
        {
            "id": "gvdb8u4",
            "score": 1,
            "text": "Bonus points for snagging your hat this way",
            "title_similarity": "0.3154481",
            "sentiment_compound": 0.5423
        },
        {
            "id": "gvdbewd",
            "score": 1,
            "text": "GFY.. Damn kids trying to tell me how to live my life, when I was your age. . . .",
            "title_similarity": "0.44296283",
            "sentiment_compound": -0.4019
        },
        {
            "id": "gvdbh2d",
            "score": 1,
            "text": "I pick them back up with my strangely finger-like toes",
            "title_similarity": "0.22094896",
            "sentiment_compound": -0.296
        },
        {
            "id": "gvdbkck",
            "score": 2,
            "text": "(squeaky wheelchair noises as you roll back out of the room)",
            "title_similarity": "0.3886016",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvdbrhf",
            "score": 1,
            "text": "I actually flick them directly into the hamper right as the come down my leg.",
            "title_similarity": "0.38938776",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvdbvwu",
            "score": 1,
            "text": "I've had gout since I was 19 so it's too painful to do",
            "title_similarity": "0.655376",
            "sentiment_compound": -0.4877
        },
        {
            "id": "gvdc0tq",
            "score": 1,
            "text": "I did this until a couple of slipped discs made it more.. Problematic.",
            "title_similarity": "0.4672432",
            "sentiment_compound": -0.4927
        },
        {
            "id": "gvdc7fp",
            "score": 1,
            "text": "I don't wear underwear, but I do this with shorts",
            "title_similarity": "0.25424454",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvdc811",
            "score": 1,
            "text": "If I fail I just kick it into the laundry bin",
            "title_similarity": "0.5426303",
            "sentiment_compound": -0.5423
        },
        {
            "id": "gvdc917",
            "score": 1,
            "text": "When I was 20yo",
            "title_similarity": "0.08252797",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvdcb8w",
            "score": 1,
            "text": "I leave them where they lay",
            "title_similarity": "0.16427296",
            "sentiment_compound": -0.0516
        },
        {
            "id": "gvdcdqu",
            "score": 1,
            "text": "since i didn't catch it one time and got bad luck. this bad luck shit repeated always I didn't catch it.   I guess this has to be linked with black magic or any other sorcery",
            "title_similarity": "0.7130326",
            "sentiment_compound": -0.6808
        },
        {
            "id": "gvdcg5c",
            "score": 1,
            "text": "I just don't want to pull a muscle",
            "title_similarity": "0.40285423",
            "sentiment_compound": -0.0572
        },
        {
            "id": "gvdci0i",
            "score": 1,
            "text": "So we all the same huh?",
            "title_similarity": "-0.06697098",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvdcm73",
            "score": 2,
            "text": "I just asked my 74 year old mom if she kicks her panties or shorts in the hamper.  She said she still does.",
            "title_similarity": "0.43224978",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvdcqrx",
            "score": 2,
            "text": "I have got to be honest, I've half the comments and I still have no clue what this \"kicking them into the air and catching them\" thing is? Someone vare to explain the technique? I'm a 24 yo male btw, and I'm embarrassed to ask...",
            "title_similarity": "0.7231641",
            "sentiment_compound": -0.1926
        },
        {
            "id": "gvdcwzm",
            "score": 1,
            "text": "When I didn't wear boxer shorts and just wore normal underpants that fit your posture, I guess. Also most of my underwear is too small.",
            "title_similarity": "0.40693045",
            "sentiment_compound": 0.3612
        },
        {
            "id": "gvddij7",
            "score": 1,
            "text": "I do the \"get down Mr. President!\" Dive and roll if i fail the catch. I mean, i don't ever fail, i was just choosing that moment to show off my dive and roll prowess.",
            "title_similarity": "0.54997665",
            "sentiment_compound": -0.2363
        },
        {
            "id": "gvddkxa",
            "score": 2,
            "text": "Probably sometime in my early 20s. Also probably when I stopped sprinting up the stairs on all fours like a jaguar chasing its prey. Life has been bleak since those days.",
            "title_similarity": "0.60176694",
            "sentiment_compound": 0.1531
        },
        {
            "id": "gvddrz0",
            "score": 1,
            "text": "When my back started to hurt for no apparently good reason and I repeatedly pulled my patellar tendon doing such arduous tasks as existing.",
            "title_similarity": "0.6102168",
            "sentiment_compound": -0.7909
        },
        {
            "id": "gvddvxf",
            "score": 1,
            "text": "Not grumpy. Your mom just pulls them off before I get a chance.",
            "title_similarity": "0.418801",
            "sentiment_compound": 0.25
        },
        {
            "id": "gvddxf9",
            "score": 2,
            "text": "I actually like to do a nice deep squat down to get them while freeballing.  I enjoy my newfound mobility and the feeling of the fresh air on my taint.",
            "title_similarity": "0.37236243",
            "sentiment_compound": 0.8834
        },
        {
            "id": "gvde337",
            "score": 1,
            "text": "When the music died.",
            "title_similarity": "0.27885506",
            "sentiment_compound": -0.5574
        },
        {
            "id": "gvdefve",
            "score": 1,
            "text": "Toe flick to the right spot",
            "title_similarity": "0.23643242",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvdeipx",
            "score": 1,
            "text": "I prefer to kick them into the basket.",
            "title_similarity": "0.32984346",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvdekkg",
            "score": 1,
            "text": "It’s more so because they’re covered in shitstains I don’t want to touch.",
            "title_similarity": "0.56552064",
            "sentiment_compound": 0.0772
        },
        {
            "id": "gvdexi5",
            "score": 1,
            "text": "Sometime in 2017, that’s when my body was causing me shit. Now I’m on disability lol.",
            "title_similarity": "0.4617061",
            "sentiment_compound": -0.2023
        },
        {
            "id": "gvdf2j4",
            "score": 2,
            "text": "I don't think I've ever done this! I'll have to give it a try later!",
            "title_similarity": "0.48059362",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvdf2k1",
            "score": 1,
            "text": "I use my feet to grab them",
            "title_similarity": "0.062396765",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvdf2q8",
            "score": 2,
            "text": "I'm 17 and have never done this. I'm sorry. I have failed you.",
            "title_similarity": "0.48444033",
            "sentiment_compound": -0.5574
        },
        {
            "id": "gvdf5to",
            "score": 2,
            "text": "I give myself one more try from the floor. If I don’t get it, I take the walk of shame, pick them up and put them in the hamper",
            "title_similarity": "0.53707457",
            "sentiment_compound": -0.4767
        },
        {
            "id": "gvdfh9i",
            "score": 1,
            "text": "When I had that accident where I lost a leg",
            "title_similarity": "0.4243527",
            "sentiment_compound": -0.6597
        },
        {
            "id": "gvdfopi",
            "score": 2,
            "text": "I feel like this is a direct attack. \n\nAnd you're wrong, the point is to make them into your hamper/basket and yell \"Gooooooaaaaaaallllllllll!!!!\" until your wife threatens divorce.",
            "title_similarity": "0.6953996",
            "sentiment_compound": -0.816
        },
        {
            "id": "gvdfp4s",
            "score": 1,
            "text": "It was the first time I twisted something funny and heard a funny snap. I couldn’t bend my knee for a week.",
            "title_similarity": "0.4983048",
            "sentiment_compound": 0.7003
        },
        {
            "id": "gvdfroo",
            "score": 1,
            "text": "My favorite childhood memory is not knowing back pain.",
            "title_similarity": "0.48932388",
            "sentiment_compound": 0.691
        },
        {
            "id": "gvdg5eb",
            "score": 1,
            "text": "One of the best ways to maintain mobility and flexibility is to just use it. Pick things off the ground by bending over with your back straight, or squat. Do this a few times a day when it comes up and you won't become stiff and inflexible. Like an old grumpy man.",
            "title_similarity": "0.55882084",
            "sentiment_compound": 0.875
        },
        {
            "id": "gvdg9yl",
            "score": 1,
            "text": "Alternative method: pinch underwear between toes, lift gracefully to hand. Can't miss and helps keep you flexible!",
            "title_similarity": "0.3049598",
            "sentiment_compound": 0.7936
        },
        {
            "id": "gvdgbeo",
            "score": 1,
            "text": "The day I was born apparently, because I've literally never done this.",
            "title_similarity": "0.37713283",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvdgbyl",
            "score": 2,
            "text": "I kick them into the hamper. If it fails I just pick them up with my toes and place them in the hamper with my feet.",
            "title_similarity": "0.47469538",
            "sentiment_compound": -0.4215
        },
        {
            "id": "gvdgzm0",
            "score": 2,
            "text": "I fall to my knees, raise both fists to an indifferent and uncaring sky and scream a scream that would shake the foundations of mountains in rage.  Then I get up, go to the bathroom and poop.",
            "title_similarity": "0.5757562",
            "sentiment_compound": -0.8885
        },
        {
            "id": "gvdh1j8",
            "score": 1,
            "text": "Just grab them with my toes and bring them up to my hand",
            "title_similarity": "0.14760661",
            "sentiment_compound": 0.4939
        },
        {
            "id": "gvdh36u",
            "score": 2,
            "text": "I'm old and grumpy and I still do this. Sometimes I'll kick them up and try to make them land on my head. If I fail to catch the undies, I'll kick them with a straighter leg to ensure I get the height required for the catch.",
            "title_similarity": "0.7025248",
            "sentiment_compound": -0.2263
        },
        {
            "id": "gvdh6gi",
            "score": 1,
            "text": "I throw them up in the air with my toes and attempt to catch them again",
            "title_similarity": "0.31891012",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvdh782",
            "score": 1,
            "text": "I didn't realize I'm not the only one who does this. Awesome.",
            "title_similarity": "0.2566644",
            "sentiment_compound": 0.7073
        },
        {
            "id": "gvdh8ac",
            "score": 1,
            "text": "I didn’t, I got fat.",
            "title_similarity": "0.3060184",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvdhr5l",
            "score": 1,
            "text": "I became efficient. I can toss in the clothes hamper with my foot.",
            "title_similarity": "0.2706722",
            "sentiment_compound": 0.4215
        },
        {
            "id": "gvdi89c",
            "score": 8,
            "text": "I stopped when I made a mistake and accidentally smacked them into my wife's face. She was...not exactly pleased. I continued in private for a while, but it just isn't the same without an audience.",
            "title_similarity": "0.680872",
            "sentiment_compound": -0.2263
        },
        {
            "id": "gvdie0t",
            "score": 1,
            "text": "I usually just toe grab just about anything I need off the floor, bending is for suckers",
            "title_similarity": "0.46371457",
            "sentiment_compound": -0.5106
        },
        {
            "id": "gvdip23",
            "score": 1,
            "text": "I leave them there, my wife will get them eventually",
            "title_similarity": "0.23351113",
            "sentiment_compound": -0.0516
        },
        {
            "id": "gvdivsc",
            "score": 1,
            "text": "When I dislocated my toe kicking the doorknob by accident.",
            "title_similarity": "0.53552747",
            "sentiment_compound": -0.4767
        },
        {
            "id": "gvdj246",
            "score": 2,
            "text": "I am a woman and I assure I do this",
            "title_similarity": "-0.05435459",
            "sentiment_compound": 0.34
        },
        {
            "id": "gvdj2at",
            "score": 1,
            "text": "I’ve never done this. Even as a kid. Too much energy to do that.",
            "title_similarity": "0.44832793",
            "sentiment_compound": 0.2732
        },
        {
            "id": "gvdj4nb",
            "score": 1,
            "text": "Maybe I’m really clumsy, but how do you this without tripping or falling ? Do you just let the clothes drop and try to jump and then kick it in the air ?",
            "title_similarity": "0.600997",
            "sentiment_compound": -0.3278
        },
        {
            "id": "gvdj967",
            "score": 1,
            "text": "When the weight of the world crushes your spirit.\n(This is the answer to many questions)",
            "title_similarity": "0.5195687",
            "sentiment_compound": -0.296
        },
        {
            "id": "gvdjb4l",
            "score": 1,
            "text": "I missed the catch knocked the potpourri all over the floor underwear ended up in the toilet.",
            "title_similarity": "0.5968362",
            "sentiment_compound": -0.296
        },
        {
            "id": "gvdjbuz",
            "score": 1,
            "text": "Around 38.",
            "title_similarity": "0.01749951",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvdjdmn",
            "score": 1,
            "text": "It Depends.",
            "title_similarity": "0.049828894",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvdjdvm",
            "score": 1,
            "text": "It was around the time someone on reddit criticized me for not playing games with my dirty underwear. ;p",
            "title_similarity": "0.65970796",
            "sentiment_compound": -0.7177
        },
        {
            "id": "gvdjfrf",
            "score": 1,
            "text": "I’m so glad others do this",
            "title_similarity": "0.07954687",
            "sentiment_compound": 0.5095
        },
        {
            "id": "gvdklg2",
            "score": 1,
            "text": "Low ceilings my man. Not a whole lot I can do",
            "title_similarity": "0.47241652",
            "sentiment_compound": -0.2732
        },
        {
            "id": "gvdko1p",
            "score": 1,
            "text": "hard to sustain a smile when you've been farting for 32 years, four months and 8 days straight, thanks for asking",
            "title_similarity": "0.55674404",
            "sentiment_compound": 0.7096
        },
        {
            "id": "gvdkvso",
            "score": 1,
            "text": "When I did my back in trying to catch it. So I just kick into the pile of laundry now.",
            "title_similarity": "0.49974117",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvdl4pw",
            "score": 1,
            "text": "You can find me in my house after I get home by following the trail of clothes I flung off that lead to my most current location in the house",
            "title_similarity": "0.25692105",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvdl69u",
            "score": 1,
            "text": "I lack a utility belt, so kicking off my shorts/pants at the end of the day could mean ruining someone else's if an item gets lost.\n\nPlus, wrinkles. I'll fold and lay them down everytime if it means not looking for an iron.",
            "title_similarity": "0.7347946",
            "sentiment_compound": -0.6808
        },
        {
            "id": "gvdldhr",
            "score": 1,
            "text": "Kick it up and catch it before it hits the ground?\n\nNoobs, I kick up and catch it with my leg and kick it into the washing basket.\n\nEdit: grammar",
            "title_similarity": "0.49173486",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvdlr02",
            "score": 1,
            "text": "I don't do the kick up, but I do pick them up with my toes like a chimp!",
            "title_similarity": "0.4922549",
            "sentiment_compound": 0.5487
        },
        {
            "id": "gvdlrqu",
            "score": 1,
            "text": "I play football (soccer) so I’m pretty good with my feet. I thought I was the only one that does this!",
            "title_similarity": "0.356844",
            "sentiment_compound": 0.8532
        },
        {
            "id": "gvdm1wi",
            "score": 1,
            "text": "Bitch ass kids and their underwear.",
            "title_similarity": "0.38533905",
            "sentiment_compound": -0.8074
        },
        {
            "id": "gvdm59o",
            "score": 1,
            "text": "sometimes when I try to kick it up it goes forward instead. I feel too embarrassed and just pick it up.",
            "title_similarity": "0.6265186",
            "sentiment_compound": -0.3612
        },
        {
            "id": "gvdm7xi",
            "score": 1,
            "text": "fuck off",
            "title_similarity": "0.22194818",
            "sentiment_compound": -0.5423
        },
        {
            "id": "gvdm97g",
            "score": 1,
            "text": "Oooh. They is talking to me. Um...I guess I have always been \"old and grumpy\". I used to kick my shoes until I was 12, but that seemed fun. What you describe does not seem fun. I rather grab the waist band, pull off, put in clothes bin.",
            "title_similarity": "0.7534596",
            "sentiment_compound": 0.2256
        },
        {
            "id": "gvdmb4z",
            "score": 1,
            "text": "I'm not old and grumpy, I'm depressed and lazy.  BIG DIFFERENCE.",
            "title_similarity": "0.44997013",
            "sentiment_compound": -0.7003
        },
        {
            "id": "gvdmkdu",
            "score": 1,
            "text": "I’ve never kicked them up to catch them. However I can’t answer your question as I’ve never Eve one old or grumpy. Though it seems you carry a lot of resentment yourself adding in that last part to the question",
            "title_similarity": "0.6384936",
            "sentiment_compound": -0.4404
        },
        {
            "id": "gvdml4t",
            "score": 1,
            "text": "Still do it. To impress the ladies.",
            "title_similarity": "0.14369403",
            "sentiment_compound": 0.4404
        },
        {
            "id": "gvdmnt9",
            "score": 1,
            "text": "I just wanna play my PS5 after a 10hr shift and gym sesh. The theatrics can take a seat",
            "title_similarity": "0.41226047",
            "sentiment_compound": 0.34
        },
        {
            "id": "gvdmtgb",
            "score": 1,
            "text": "This is great.  I thought I was the only one that did this.  Lmao",
            "title_similarity": "0.19470817",
            "sentiment_compound": 0.8666
        },
        {
            "id": "gvdn2el",
            "score": 1,
            "text": "I love the feeling of having to calculate the different trajectory and the forces applied each time while i am doing that, just a man of science i guess xD",
            "title_similarity": "0.40394747",
            "sentiment_compound": 0.8591
        },
        {
            "id": "gvdn61u",
            "score": 1,
            "text": "Wait.. I do this and I'm a 50 yr old woman",
            "title_similarity": "0.13125905",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvdnb4l",
            "score": 1,
            "text": "Laughs in kilt",
            "title_similarity": "0.024695802",
            "sentiment_compound": 0.4939
        },
        {
            "id": "gvdo263",
            "score": 1,
            "text": "I take my underwear off at the same time as my pants and socks. Because EFFICIENCY!",
            "title_similarity": "0.353289",
            "sentiment_compound": 0.5461
        },
        {
            "id": "gvdo2d7",
            "score": 1,
            "text": "I'm 28, bad back due to years of abuse from older siblings. I have fibromyalgia and am a chronic pain sufferer. I gave up doing things like that a long time ago.",
            "title_similarity": "0.66950226",
            "sentiment_compound": -0.91
        },
        {
            "id": "gvdo5zo",
            "score": 1,
            "text": "When my goddamn back went out.  Now get off my lawn!",
            "title_similarity": "0.41684508",
            "sentiment_compound": -0.5255
        },
        {
            "id": "gvdo7e7",
            "score": 1,
            "text": "Dive at the ground like I'm trying to save a volleyball.",
            "title_similarity": "0.37059793",
            "sentiment_compound": 0.6908
        },
        {
            "id": "gvdocxd",
            "score": 1,
            "text": "I try again until I get it. I also pick up everything I can like this. Once tried to kick up and catch a 40lb dumbbell. Pulled my hip flexor. Still caught the dumbbell!",
            "title_similarity": "0.50718564",
            "sentiment_compound": -0.1007
        },
        {
            "id": "gvdooae",
            "score": 1,
            "text": "Probably around the time I pulled a muscle putting on a sock.",
            "title_similarity": "0.29919195",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvdoqnr",
            "score": 1,
            "text": "when my first week of 12 hour shifts started",
            "title_similarity": "0.24775",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvdotc5",
            "score": 1,
            "text": "When it put a kink in my back. Don’t worry, it’ll happen to you too!",
            "title_similarity": "0.3993121",
            "sentiment_compound": -0.4926
        },
        {
            "id": "gvdoxfc",
            "score": 1,
            "text": "I kick them in the air with a trajectory towards the dirty clothes bin. The farther and higher away I am, the better.",
            "title_similarity": "0.52784526",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvdp09h",
            "score": 1,
            "text": "When I've got my 14-month old on my hip, I pick everything up this way. \n\nClothes, garbage, cups, markers, toys... If it's flexible, just flick it up with your toes. If it's solid, use your big toe and second toe to grab it and pull it up to your other hand. \n\nFuck trying to bend over while holding a baby.",
            "title_similarity": "0.48354682",
            "sentiment_compound": 0.296
        },
        {
            "id": "gvdp1t4",
            "score": 1,
            "text": "it's all about taking them off to the ankles lying on ur back then slingshotting them",
            "title_similarity": "0.49085867",
            "sentiment_compound": -0.5267
        },
        {
            "id": "gvdp3p4",
            "score": 1,
            "text": "When you drop them you have to pick it up by curling your toes and using them as a hand to pass it up to your actual hands",
            "title_similarity": "0.35083073",
            "sentiment_compound": 0.2732
        },
        {
            "id": "gvdp5k0",
            "score": 1,
            "text": "Bout 27",
            "title_similarity": "0.05973287",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvdp9sq",
            "score": 2,
            "text": "What if they stick to the wall?",
            "title_similarity": "0.15870741",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvdpmzn",
            "score": 2,
            "text": "Bad back makes it harder to do so, wish I could still do it",
            "title_similarity": "0.6210046",
            "sentiment_compound": -0.2023
        },
        {
            "id": "gvdpsdc",
            "score": 2,
            "text": "Fail to catch them? Pah! That's a good joke.",
            "title_similarity": "0.4151535",
            "sentiment_compound": 0.2244
        },
        {
            "id": "gvdpvvg",
            "score": 2,
            "text": "I’m 40. Still do it. Lol",
            "title_similarity": "0.15225232",
            "sentiment_compound": 0.4215
        },
        {
            "id": "gvdpzbn",
            "score": 4,
            "text": "At the old age of 29, I kicked my boxers into the air and hyper extended my back. Reaching down to pick up my boxers, because I didn’t catch them, I pulled something and started a chain reaction of muscle spasms.  Laying in the fetal position, staring at my boxers, I realized it’s better to free ball.",
            "title_similarity": "0.6673459",
            "sentiment_compound": 0.7906
        },
        {
            "id": "gvdq3zo",
            "score": 2,
            "text": "I just take mine off and fold them. I am humbly accepting your fury, angry Redditors.",
            "title_similarity": "0.44668633",
            "sentiment_compound": -0.6597
        },
        {
            "id": "gvdqidx",
            "score": 1,
            "text": "I kick them into the dirty clothes basket.",
            "title_similarity": "0.439434",
            "sentiment_compound": -0.4404
        },
        {
            "id": "gvdqlb8",
            "score": 1,
            "text": "This is a thing other people do?!? Mind blown",
            "title_similarity": "0.2923334",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvdqtiq",
            "score": 1,
            "text": "When did I become so old and grumpy? After 40 years of picking them up your body gives out",
            "title_similarity": "0.6161983",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvdqxh0",
            "score": 1,
            "text": "I'm not a grump, I'm old.",
            "title_similarity": "0.1687285",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvdr1ap",
            "score": 1,
            "text": "When I tuned 60",
            "title_similarity": "0.06274052",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvdr88k",
            "score": 1,
            "text": "My whole life. Sounds like extra work for no reward to me.",
            "title_similarity": "0.40970197",
            "sentiment_compound": -0.1275
        },
        {
            "id": "gvdrgg9",
            "score": 1,
            "text": "My body has decided that \"needing to pee\" means \"it's real swamp-ass hours\" so no I'm not going to full grab my underwear even if I'm getting in the shower right after.",
            "title_similarity": "0.67944765",
            "sentiment_compound": -0.4341
        },
        {
            "id": "gvdrgin",
            "score": 2,
            "text": "I over shot it and my dirty boxers hit me in the face.",
            "title_similarity": "0.53308654",
            "sentiment_compound": -0.4404
        },
        {
            "id": "gvdrk6f",
            "score": 1,
            "text": "don't have enough energy, plus i've never done it before cause changing is utilitarian in nature for me so i've never considered it before.",
            "title_similarity": "0.5486757",
            "sentiment_compound": -0.2057
        },
        {
            "id": "gvdrluv",
            "score": 1,
            "text": "I'm too old and sore. If I tried to kick my undercrackers from my toes to catch in my hand I'd pull a hamstring, buckle my knee. Probs land on my distended ball sack(the older you get the lower they drop) and throw up.\n\nIs that your plan. Making fun out of a early 40 Yr old man.\n\nI used to be flexible until covid. No gyms. No focus. No chance. No dice",
            "title_similarity": "0.82432544",
            "sentiment_compound": 0.5145
        },
        {
            "id": "gvdrmej",
            "score": 1,
            "text": "I see the challenge & raise it - In my early 20's, when I was a dishwasher, my coworkers were amazed when I would drop a fork, then step hard on the prongs so they flipped up so I could catch them & wash them.",
            "title_similarity": "0.5734255",
            "sentiment_compound": 0.25
        },
        {
            "id": "gvdrq86",
            "score": 1,
            "text": "I kick them up into the air and try and catch them on my head, if my SO is in the room she will try to intercept them, mid air. If they land on my head, she admits defeat and if I get them on my head I run a full victory lap of our apartment with them up on my bonce.",
            "title_similarity": "0.5673692",
            "sentiment_compound": -0.2023
        },
        {
            "id": "gvdryda",
            "score": 1,
            "text": "About 4-5 years ago",
            "title_similarity": "-0.00080588553",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvdrzr1",
            "score": 1,
            "text": "When that daily back pain hit",
            "title_similarity": "0.37212244",
            "sentiment_compound": -0.5106
        },
        {
            "id": "gvdrzyc",
            "score": 1,
            "text": "What underwear?",
            "title_similarity": "0.0758984",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvds7r0",
            "score": 1,
            "text": "I always try to be as Phil Dumphy as possible.",
            "title_similarity": "0.2564801",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvds93t",
            "score": 1,
            "text": "When I moved out of my parent's house and had nobody around asking to pick them up",
            "title_similarity": "0.44466037",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvdsdbh",
            "score": 1,
            "text": "When I stopped having a bathroom large enough to do this in. :((",
            "title_similarity": "0.48903805",
            "sentiment_compound": -0.2263
        },
        {
            "id": "gvdsdkz",
            "score": 1,
            "text": "I did this a lot as a kid but haven’t in AGES!Guess what I’m doing tonight??",
            "title_similarity": "0.44501078",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvdseoo",
            "score": 1,
            "text": "They go on the ground for my wife to pick up/wash. Not my problem.",
            "title_similarity": "0.3229009",
            "sentiment_compound": 0.3089
        },
        {
            "id": "gvdsjg9",
            "score": 1,
            "text": "Mid 30s",
            "title_similarity": "0.03941027",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvdsq9o",
            "score": 1,
            "text": "Gosh I’ve never been so offended by something trivial like this",
            "title_similarity": "0.37361148",
            "sentiment_compound": -0.0557
        },
        {
            "id": "gvdsrfe",
            "score": 1,
            "text": "Gosh I’ve never been so offended by something trivial like this",
            "title_similarity": "0.37361148",
            "sentiment_compound": -0.0557
        },
        {
            "id": "gvdt33p",
            "score": 1,
            "text": "I’m 55. I shall resume STAT.",
            "title_similarity": "0.018695947",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvdt9in",
            "score": 1,
            "text": "This post made me realize that I've stopped doing this. I apologize and I'll start doing it again. Thanks",
            "title_similarity": "0.45559436",
            "sentiment_compound": 0.34
        },
        {
            "id": "gvdtc8z",
            "score": 1,
            "text": "Holy shit I thought I was the only one who did this! 59 years old BTW",
            "title_similarity": "0.37465072",
            "sentiment_compound": -0.5983
        },
        {
            "id": "gvdtd5c",
            "score": 1,
            "text": "I just kick them across the room and have them land on my chair.",
            "title_similarity": "0.3215357",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvdtk8l",
            "score": 1,
            "text": "underwear?",
            "title_similarity": "0.034408703",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvdtr1o",
            "score": 1,
            "text": "Not grumpy ,now as an adult I just like kicking it to the hamper",
            "title_similarity": "0.41544834",
            "sentiment_compound": 0.3612
        },
        {
            "id": "gvdtu9l",
            "score": 1,
            "text": "I pinch them with my toes and kick them onto my head when I'm alone\n\nEDIT: CLEAN ONES",
            "title_similarity": "0.5116353",
            "sentiment_compound": 0.347
        },
        {
            "id": "gvdtx3i",
            "score": 1,
            "text": "Pick them Up with my toes",
            "title_similarity": "0.17076276",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvdu1v5",
            "score": 1,
            "text": "I grab them with my toes and try to flick them behind me and catch them. It’s sort of a double or nothing kind of scenario.",
            "title_similarity": "0.42680776",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvdu2cd",
            "score": 1,
            "text": "I can’t do it cause I don’t have legs, but I’m young and would do it if I could",
            "title_similarity": "0.4557632",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvdudly",
            "score": 1,
            "text": "With a badass soundtrack in the background ofc",
            "title_similarity": "0.35200542",
            "sentiment_compound": 0.34
        },
        {
            "id": "gvdur9h",
            "score": 1,
            "text": "I’m 44 and still do it with my pants and boxers.",
            "title_similarity": "0.21952204",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvdv00x",
            "score": 1,
            "text": "After I attempted to do so in front of a date and ripped ass in the process.",
            "title_similarity": "0.5139257",
            "sentiment_compound": -0.5423
        },
        {
            "id": "gvdv0jh",
            "score": 1,
            "text": "I don’t because when I try or try to kick them into the basket it never flies right consistently and ends up on the floor / I have to pick them up  anyway so THAT makes me grumpy this I don’t usually try",
            "title_similarity": "0.7474927",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvdv730",
            "score": 1,
            "text": "I grab with toes so I dont miss.",
            "title_similarity": "0.19963172",
            "sentiment_compound": 0.1798
        },
        {
            "id": "gvdvhew",
            "score": 1,
            "text": "1993",
            "title_similarity": "-0.024519783",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvdvq3l",
            "score": 1,
            "text": "My back wont let me.",
            "title_similarity": "0.3739761",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvdvve2",
            "score": 1,
            "text": "I claw-lift them into the hamper with my finger toes",
            "title_similarity": "0.3126447",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvdvvra",
            "score": 1,
            "text": "Haha it’s been 13 months of me working from home. Bold of you to assume I’m wearing any underwear",
            "title_similarity": "0.39192182",
            "sentiment_compound": 0.6808
        },
        {
            "id": "gvdw3kb",
            "score": 1,
            "text": "I just kick them and aim for the laundry basket, as of now I have a nearly 100% accuracy rate!",
            "title_similarity": "0.38348562",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvdwcwj",
            "score": 1,
            "text": "Since that became the slightest bit too much effort? So more-so lazy than grumpy... Nothing any of us can do about getting older though. Well, unless you commit suicide, ending the whole aging/life thing.",
            "title_similarity": "0.7420228",
            "sentiment_compound": -0.6096
        },
        {
            "id": "gvdwhm8",
            "score": 1,
            "text": "Can't remember last time I changed my underwear!!",
            "title_similarity": "0.4690758",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvdwp9p",
            "score": 1,
            "text": "Tweaking my back doing this exact thing made me feel old and grumpy.",
            "title_similarity": "0.65091586",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvdwse3",
            "score": 1,
            "text": "Don't bother kicking, I leave them on the floor, pinch them with my big and index toe and see how far I can fling them into the hamper.",
            "title_similarity": "0.54258096",
            "sentiment_compound": 0.211
        },
        {
            "id": "gvdwvmr",
            "score": 1,
            "text": "Every thing on the lower half of my body is lowered at once, gathered into a ball and shot into the laundry basket like a basketball",
            "title_similarity": "0.3081546",
            "sentiment_compound": -0.0516
        },
        {
            "id": "gvdwxwu",
            "score": 2,
            "text": "Blew my back out squatting 405lbs when I was 17. Even after years of rehab and continuing to lift and powerlift and eventually hit 605lbs on back squat, I still baby the absolute fuck out of my back in anything that isn't me bracing the unholy hell out of my core. I still have pretty good mobility and can move right and make love, I'm not about to jeopardize that trying to be cool taking my underwear off in front of my lady. I just shuck 'em off and use my toes to throw 'em in the dirty clothes pile across the room, much more stable movement and less explosive at goofy angles.  \n\nYeah. That's shit they don't tell you about being 6'7 and 330lbs and a former D1 athlete. Can't do the fun kick with your underwear anymore :( Can fuckin still pick a quarter of a ton up off the ground but ended up bed ridden after the disk slipped while picking a damn laptop up off a table, and not even a heavy meme gaming one just a regular ass dell. Let my lower back round out instead of picking it up with my arms. L5-S1 ain't nothin to fuck with and plus since I'm so big my shit is goofy and my L5 basically acts like an S1 and forces everything below it to work differently. Apparently it's common in bigger folks and predominantly folks with neanderthal genes (more than normal).",
            "title_similarity": "0.6445205",
            "sentiment_compound": -0.9157
        },
        {
            "id": "gvdx3c7",
            "score": 1,
            "text": "Stopped wearing underwear a long time ago. \n\nMy balls are way less grumpy now.",
            "title_similarity": "0.43130395",
            "sentiment_compound": -0.2263
        },
        {
            "id": "gvdx441",
            "score": 1,
            "text": "Holy shit I didn't realize how relatable this was",
            "title_similarity": "0.3478374",
            "sentiment_compound": -0.5574
        },
        {
            "id": "gvdx6hp",
            "score": 1,
            "text": "I haven’t failed in years. I catch it every time because I do it way too often.",
            "title_similarity": "0.31420815",
            "sentiment_compound": -0.5106
        },
        {
            "id": "gvdxdr5",
            "score": 2,
            "text": "If I drop them, I pick them up with my toes and back roundhouse that bitch into the hamper like a tae kwon do chimp.",
            "title_similarity": "0.50019646",
            "sentiment_compound": -0.5267
        },
        {
            "id": "gvdxfdh",
            "score": 1,
            "text": "After my back fusion",
            "title_similarity": "0.14936589",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvdxqjb",
            "score": 1,
            "text": "I try to kick them into the hamper.",
            "title_similarity": "0.3828051",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvdxrsp",
            "score": 1,
            "text": "This sounds like way to much effort to do every single time.",
            "title_similarity": "0.23258255",
            "sentiment_compound": 0.3612
        },
        {
            "id": "gvdxru1",
            "score": 2,
            "text": "Rhetorical Questions\n\nWhy are women posting on r/men?  \n\nDo any men really care about what they do or their opinion?\n\nIs there nowhere men can go without women interfering?",
            "title_similarity": "0.61052346",
            "sentiment_compound": 0.6166
        },
        {
            "id": "gvdxv5t",
            "score": 1,
            "text": "I have never done that in my life. I'm going to go try this now.",
            "title_similarity": "0.35752034",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvdyb0q",
            "score": 2,
            "text": "I stopped when I kicked them into the high speed ceiling fan and fucked it up and made it wobble. I was like 10. I never told my dad why the fan started to wobble.",
            "title_similarity": "0.7071084",
            "sentiment_compound": -0.0516
        },
        {
            "id": "gvdycpu",
            "score": 1,
            "text": "Idk back you guys but I get some pretty bad swamp ass so I am not super keen to touch them after taking them off",
            "title_similarity": "0.71125615",
            "sentiment_compound": -0.9229
        },
        {
            "id": "gvdynry",
            "score": 1,
            "text": "College.",
            "title_similarity": "0.07418874",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvdyspu",
            "score": 1,
            "text": "I didn't become old and grumpy. I became fat.",
            "title_similarity": "0.22807747",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvdywtk",
            "score": 1,
            "text": "Fuck. When DID i get so old and grumpy...?",
            "title_similarity": "0.5250136",
            "sentiment_compound": -0.5423
        },
        {
            "id": "gvdz6hw",
            "score": 1,
            "text": "The trick is to kick them up and get them to fall perfectly over your head",
            "title_similarity": "0.37453163",
            "sentiment_compound": 0.6124
        },
        {
            "id": "gvdz6vg",
            "score": 1,
            "text": "Wearing underwear is so highschool...",
            "title_similarity": "0.2631091",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvdz8qt",
            "score": 1,
            "text": "I used to have to take showers in my parents bathroom where there was a lot of space and I would aim for the tub since that’s where the dirty clothes went, but then I moved and got a small bathroom",
            "title_similarity": "0.51672363",
            "sentiment_compound": -0.2382
        },
        {
            "id": "gvdzunh",
            "score": 1,
            "text": "I pick them up with my toes, and flick ‘em back up!",
            "title_similarity": "0.33933118",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvdzva9",
            "score": 1,
            "text": "I'm almost 23 and never have tried this",
            "title_similarity": "0.31448597",
            "sentiment_compound": 0.0
        },
        {
            "id": "gve0339",
            "score": 1,
            "text": "I'm fat.  You think I will intentionally do anything athletic?  Let alone lifting my leg swiftly?  Not gonna happen.",
            "title_similarity": "0.61206156",
            "sentiment_compound": 0.1431
        },
        {
            "id": "gve0rbc",
            "score": 1,
            "text": "I don’t have have the flexibility or coordination for that. I’m not some sort of sports expert. Jeez. Messi over here making me feel bad....",
            "title_similarity": "0.61308956",
            "sentiment_compound": -0.2732
        },
        {
            "id": "gve0so8",
            "score": 1,
            "text": "OMG! You mean I'm not the only one? Can't wait to show this to my wife. She thinks I'm crazy.\n\nEdit... I pick them up with my toes and fling 'em again.",
            "title_similarity": "0.55853176",
            "sentiment_compound": -0.4003
        },
        {
            "id": "gve0sz5",
            "score": 1,
            "text": "I can pick things up with my feet like a chimpanzee, don't need to kick",
            "title_similarity": "0.17130016",
            "sentiment_compound": 0.3612
        },
        {
            "id": "gve0uab",
            "score": 1,
            "text": "Haha are you too chubby to lean over and pick them off your feet? I pull them down around one ankle and bring it up to meet my hand, then tossed in hamper.",
            "title_similarity": "0.63635767",
            "sentiment_compound": 0.7351
        },
        {
            "id": "gve13n1",
            "score": 1,
            "text": "Still do lol we are born with some kind of super hero ability I guess",
            "title_similarity": "0.23204616",
            "sentiment_compound": 0.9063
        },
        {
            "id": "gve16n1",
            "score": 1,
            "text": "Get off my lawn",
            "title_similarity": "0.17108536",
            "sentiment_compound": 0.0
        },
        {
            "id": "gve17mq",
            "score": 1,
            "text": "One time I did this and got them caught on the same foot I had kicked them with and when I put my foot down I accidentally stepped on them with my other foot and fell over into my bathroom door and broke it and then fell onto the ground.  This is the first time I have ever mentioned this in any public way.",
            "title_similarity": "0.6306942",
            "sentiment_compound": -0.6369
        },
        {
            "id": "gve19k9",
            "score": 1,
            "text": "pick it up with my toes. have you ever wondered what you got those for?",
            "title_similarity": "0.30957273",
            "sentiment_compound": 0.0
        },
        {
            "id": "gve1avk",
            "score": 1,
            "text": "I never kick my shorts up in the air....they usually have my phone and other stuff still in the pockets.",
            "title_similarity": "0.4050266",
            "sentiment_compound": 0.0
        },
        {
            "id": "gve1eyu",
            "score": 1,
            "text": "FTM and several male s/o’s- have NEVER heard of anyone doing this. Now I will imagine an army of online people doing this when I take off my bottoms.",
            "title_similarity": "0.61753285",
            "sentiment_compound": 0.0
        },
        {
            "id": "gve1fcp",
            "score": 1,
            "text": "I always used to do this and try to catch them with my teeth to be ya know super sexy and shit.  And then one time I got a bit more than I bargained for.",
            "title_similarity": "0.54215336",
            "sentiment_compound": 0.5719
        },
        {
            "id": "gve1k0v",
            "score": 1,
            "text": "When I was paralyzed.  Thanks for reminding me I can't walk or move my legs.",
            "title_similarity": "0.49953187",
            "sentiment_compound": 0.4404
        },
        {
            "id": "gve1kez",
            "score": 1,
            "text": "27 here, I've realized that proper bending and stretching is *really* good for you, so I rather just pick them up by utilizing those techniques.",
            "title_similarity": "0.36980748",
            "sentiment_compound": 0.4927
        },
        {
            "id": "gve1l6q",
            "score": 1,
            "text": "I only do that when I'm taking my underwear off to take a shower, I take shorts off normally. I don't fail often but when I do I just bend over and pick the underwear up, if I mess up the first time I'm probably sleepy enough to miss a good 5 times over, I've done it enough to never fuck it up if I'm fully awake",
            "title_similarity": "0.52858067",
            "sentiment_compound": 0.6597
        },
        {
            "id": "gve1xrw",
            "score": 1,
            "text": "I personally have been able to pinch with my toes since I was a young boy. So when I miss my catch, I either kick them up again or\nI balance on one foot and pick them up with my toes then raise them up to my hand where I grab them",
            "title_similarity": "0.5258248",
            "sentiment_compound": 0.3262
        },
        {
            "id": "gve1zv3",
            "score": 1,
            "text": "I don’t want my ass dust in the air any more than it needs to be",
            "title_similarity": "0.48998234",
            "sentiment_compound": -0.4939
        },
        {
            "id": "gve21vn",
            "score": 1,
            "text": "30 years ago, when i realized commando was the way to go.",
            "title_similarity": "0.3070925",
            "sentiment_compound": 0.0
        },
        {
            "id": "gve23kz",
            "score": 1,
            "text": "Arthritis (27m). I feel old and grumpy 🤣",
            "title_similarity": "0.44424206",
            "sentiment_compound": 0.4939
        },
        {
            "id": "gve24pa",
            "score": 1,
            "text": "I quit doing that shit in my early 60’s when my balance started flaking out and I fell on my ass. Now I sit down to remove my shoes, pants, and underwear mainly because I don’t want to explain to the doctor that replaces my hip what an idiot I was.",
            "title_similarity": "0.74884033",
            "sentiment_compound": -0.8779
        },
        {
            "id": "gve266v",
            "score": 1,
            "text": "Umm... why kick then you have feet? Just grab the pants with your toes and pick them up.",
            "title_similarity": "0.4386759",
            "sentiment_compound": 0.0
        },
        {
            "id": "gve27pu",
            "score": 1,
            "text": "1987",
            "title_similarity": "-0.01769523",
            "sentiment_compound": 0.0
        },
        {
            "id": "gve2dlv",
            "score": 1,
            "text": "Bold of you to assume I ever took off my underwear in the first place.",
            "title_similarity": "0.5008484",
            "sentiment_compound": 0.3818
        },
        {
            "id": "gve2yml",
            "score": 1,
            "text": "If I fail I just pick them up with my toes so I don’t have to bend over",
            "title_similarity": "0.43760633",
            "sentiment_compound": -0.5423
        },
        {
            "id": "gve315v",
            "score": 1,
            "text": "I stopped when I stopped wearing underwear.",
            "title_similarity": "0.3511167",
            "sentiment_compound": -0.4215
        },
        {
            "id": "gve3dvx",
            "score": 1,
            "text": "I don't know who you are.\nI don't know where you came from.\nBut thank you for posting this.",
            "title_similarity": "0.39719856",
            "sentiment_compound": 0.5023
        },
        {
            "id": "gve3n7n",
            "score": 2,
            "text": "I kick them and aim for the laundry bin",
            "title_similarity": "0.39556485",
            "sentiment_compound": 0.0
        },
        {
            "id": "gve3t3b",
            "score": 1,
            "text": "It's not that I'm grumpy I just got tired of licking the swamp ass off my fingers.",
            "title_similarity": "0.60366005",
            "sentiment_compound": -0.7506
        },
        {
            "id": "gve4gpz",
            "score": 1,
            "text": "My husband just leaves his on the floor 😒",
            "title_similarity": "0.4645368",
            "sentiment_compound": 0.0
        },
        {
            "id": "gve4i0b",
            "score": 1,
            "text": "36",
            "title_similarity": "0.0470042",
            "sentiment_compound": 0.0
        },
        {
            "id": "gve4jul",
            "score": 1,
            "text": "I like this question because it says a lot about the person. it's a simple measurement of joy in ones life. you're absolutely right. men that dont do that are probly grumpy fux . I'm 60 but if you dont try to be jocular, merry and even content lifes environments will drag you down to its level. life will never let you get away without suffering some , but you can learn to take it with grace and be inspirational to those around you. be happy n content and ppl will wanna be around you it seems. \n\n\n   https://youtu.be/8VB5aBkRI7w",
            "title_similarity": "0.63206995",
            "sentiment_compound": 0.9796
        },
        {
            "id": "gve4qzs",
            "score": 1,
            "text": "I keep trying, my back hurts too much to bend over and pick them up",
            "title_similarity": "0.5831899",
            "sentiment_compound": -0.4767
        },
        {
            "id": "gve4wbr",
            "score": 1,
            "text": "I just leave it on the floor until I am out of clean clothes then I wash them, why would I pick them up?",
            "title_similarity": "0.5846512",
            "sentiment_compound": 0.3612
        },
        {
            "id": "gve55pn",
            "score": 1,
            "text": "I learned to grip them between my big toe and second toe and now \"hand\" them up to me.",
            "title_similarity": "0.29246485",
            "sentiment_compound": 0.4939
        },
        {
            "id": "gve5c4i",
            "score": 1,
            "text": "So I actually developed an auto immune disorder named \"Hidradenitis Suprativa\" and it cause my sweat glands to sweat inward instead of outward.so it has really messed with my mobility and range of motion. So it's not that I don't want to do it it's that I can't kick my leg fast enough",
            "title_similarity": "0.72026885",
            "sentiment_compound": -0.5291
        },
        {
            "id": "gve5e8s",
            "score": 1,
            "text": "When they start losing their balance!",
            "title_similarity": "0.35723707",
            "sentiment_compound": -0.4389
        },
        {
            "id": "gve5ubc",
            "score": 1,
            "text": "When I kicked my underwear up and realized something wet and smelly was on my foot",
            "title_similarity": "0.45601127",
            "sentiment_compound": 0.0
        },
        {
            "id": "gve618o",
            "score": 1,
            "text": "I gots the monkeytoes so I just hand them to myself.",
            "title_similarity": "0.41648918",
            "sentiment_compound": 0.5367
        },
        {
            "id": "gve64ut",
            "score": 1,
            "text": "Bicycle accident. Bailed over handlebars at 15 mph and had to walk 2 miles out. Hard time standing on my bad leg.",
            "title_similarity": "0.5473461",
            "sentiment_compound": -0.7906
        },
        {
            "id": "gve659v",
            "score": 1,
            "text": "Probably around the time I had to go to the hospital because I woke up one morning and my entire left side was paralyzed.",
            "title_similarity": "0.47205848",
            "sentiment_compound": 0.0
        },
        {
            "id": "gve68bd",
            "score": 1,
            "text": "Wtf wears clothes anymore",
            "title_similarity": "0.053730235",
            "sentiment_compound": -0.5859
        },
        {
            "id": "gve6b5s",
            "score": 1,
            "text": "When?  After my knee surgery.  The one operated on doesn't have the umph to kick them up,  nor does it have the strength to support my weight for the other leg to kick it up.  \n\n\nNow,  I just focus extremely hard and use telekinesis to levitate them into my hands.",
            "title_similarity": "0.63513744",
            "sentiment_compound": 0.6378
        },
        {
            "id": "gve6bvl",
            "score": 1,
            "text": "Omg that. Mine is just on my desk now. Sometimes I take it with my head, put in on my foot and shoot it trough the door.",
            "title_similarity": "0.33572108",
            "sentiment_compound": -0.34
        },
        {
            "id": "gve6jco",
            "score": 1,
            "text": "Being handicapped.",
            "title_similarity": "0.12722933",
            "sentiment_compound": 0.0
        },
        {
            "id": "gve6l3n",
            "score": 1,
            "text": "I have no idea when I started. And I have no idea when I stopped.",
            "title_similarity": "0.37271237",
            "sentiment_compound": -0.6486
        },
        {
            "id": "gve6nv5",
            "score": 1,
            "text": "I never realized I stopped doing that until I read this post",
            "title_similarity": "0.3640095",
            "sentiment_compound": 0.1695
        },
        {
            "id": "gve6pqz",
            "score": 1,
            "text": "If I catch it, I'm Bond impressing Moneypenny. If I miss, there's only 4 seconds left, we're behind by 2 and I'm up for a 25 yard field goal (into the hamper) for the win. I tell myself, \"It's only a chip shot. I can make it.\"\n\nEdit: I'm 53.",
            "title_similarity": "0.5328988",
            "sentiment_compound": 0.7717
        },
        {
            "id": "gve6qch",
            "score": 1,
            "text": "At worst I will hand them to myself with my foot.",
            "title_similarity": "0.4082694",
            "sentiment_compound": -0.2263
        },
        {
            "id": "gve6sg7",
            "score": 1,
            "text": "2018 and when arthritis settled in, respectively",
            "title_similarity": "0.16246",
            "sentiment_compound": 0.34
        },
        {
            "id": "gve722u",
            "score": 1,
            "text": "The first time you throw your back out kicking your undies up into the air is the last time you kick your undies up into the air.",
            "title_similarity": "0.61085314",
            "sentiment_compound": 0.0
        },
        {
            "id": "gve7dql",
            "score": 1,
            "text": "I try again, if I fail the next couple of tries, I just kick it away and go do whatever, though this barely ever happens, I usually get it either the first or second try",
            "title_similarity": "0.5853073",
            "sentiment_compound": -0.5423
        },
        {
            "id": "gve7gta",
            "score": 1,
            "text": "I was wondering if anyone else did this. Now I know!",
            "title_similarity": "0.31504452",
            "sentiment_compound": 0.0
        },
        {
            "id": "gve87f2",
            "score": 1,
            "text": "Well it all started when I joined the military",
            "title_similarity": "0.0935438",
            "sentiment_compound": 0.2732
        },
        {
            "id": "gve8np7",
            "score": 2,
            "text": "I walk my big ass dog 3x a day, and I still try to get his shit bag into the park's trash can from 35 feet away. I punch the air when I make it, and pick it up and try to toss it in from 10 feet if I miss the first time.\n\nAnd yeah I am over 60. \n\nI kick flick my underwear directly into the hamper from across the bathroom too. But I don't try to grab it in mid air because skid marks, yo.",
            "title_similarity": "0.59627557",
            "sentiment_compound": -0.5023
        },
        {
            "id": "gve8v27",
            "score": 1,
            "text": "I was born this way",
            "title_similarity": "-0.02111942",
            "sentiment_compound": 0.0
        },
        {
            "id": "gve9jwg",
            "score": 1,
            "text": "Nah here's the move: drop pantaloon, walk over and grip with toes, throw shorts up and over your shoulder, catch. Bonus points for getting em straight into the laundry bin",
            "title_similarity": "0.45358974",
            "sentiment_compound": 0.4404
        },
        {
            "id": "gve9smb",
            "score": 1,
            "text": "This is why I do single leg work.",
            "title_similarity": "0.15561613",
            "sentiment_compound": 0.0
        },
        {
            "id": "gve9wvx",
            "score": 1,
            "text": "Am I too fruity to understand this??\n\njk... I’ve only done this a few times in my life",
            "title_similarity": "0.3969687",
            "sentiment_compound": 0.0
        },
        {
            "id": "gveabnp",
            "score": 1,
            "text": "I go a step further and I shout “LEBRON JAMES!!!” as I toss my clothes into my laundry basket from across the room. \n\nAnd l wonder what Lebron James shouts when he does this...",
            "title_similarity": "0.5017689",
            "sentiment_compound": 0.5962
        },
        {
            "id": "gveade1",
            "score": 1,
            "text": "Lady here but this question is why I love this sub.\nAlso, in summer I wear boxers at home and yes I do this too!! Second attempt depends on mood.",
            "title_similarity": "0.40266526",
            "sentiment_compound": 0.8986
        },
        {
            "id": "gveap9j",
            "score": 1,
            "text": "I kick them straight into the laundry basket like a civilized person. \n\nIf I miss they stay on the ground",
            "title_similarity": "0.4534094",
            "sentiment_compound": 0.4215
        },
        {
            "id": "gveavbw",
            "score": 1,
            "text": "My husband is on Reddit. Super excited to see his new trick now...",
            "title_similarity": "0.4348976",
            "sentiment_compound": 0.7269
        },
        {
            "id": "gveavj9",
            "score": 1,
            "text": "I've never done that. Frankly I find the whole concept obnoxious. I know women that do it. And it's just as obnoxious. Grow up.\n\n~ *Working inconsistently since 1981*",
            "title_similarity": "0.57183504",
            "sentiment_compound": -0.7184
        },
        {
            "id": "gveb4al",
            "score": 1,
            "text": "My leg is fucked up. But use the other leg for keepups",
            "title_similarity": "0.4879109",
            "sentiment_compound": -0.4019
        },
        {
            "id": "gvebhx3",
            "score": 1,
            "text": "I pick them up with my toes and \"hand\" them to my hand. It feels like more of a flex. My legs are just super bendy. I can also place them in the hamper directly. No back bending required.",
            "title_similarity": "0.36711377",
            "sentiment_compound": 0.891
        },
        {
            "id": "gvebk7a",
            "score": 1,
            "text": "Jokes on you, youngster. I HAVE to do that because my back is too bad to bend down and pick them up.",
            "title_similarity": "0.68298966",
            "sentiment_compound": -0.3612
        },
        {
            "id": "gvebrwa",
            "score": 1,
            "text": "failing to catch them usually leads to me just going \"Ugh fuck it. I'll pick it up whenever i come back into the room\"",
            "title_similarity": "0.6176306",
            "sentiment_compound": -0.8625
        },
        {
            "id": "gvebxub",
            "score": 1,
            "text": "Gonna give this a go later",
            "title_similarity": "0.1629174",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvec32v",
            "score": 1,
            "text": "When I was about 25. Thats when my knee and back started to hurt. Now I'm almost 30 and a grumpy old man",
            "title_similarity": "0.5658237",
            "sentiment_compound": -0.5267
        },
        {
            "id": "gvec4wt",
            "score": 1,
            "text": "you know this is something i never even thought about doing but since i read this ill probably start doing it lol",
            "title_similarity": "0.6234493",
            "sentiment_compound": -0.1717
        },
        {
            "id": "gvec6mk",
            "score": 1,
            "text": "Such a free spirit.",
            "title_similarity": "0.01255645",
            "sentiment_compound": 0.6124
        },
        {
            "id": "gvecj0s",
            "score": 1,
            "text": "When I became a quadriplegic and lost the use of my legs.",
            "title_similarity": "0.4798112",
            "sentiment_compound": -0.3182
        },
        {
            "id": "gvecjrl",
            "score": 1,
            "text": "Apparently I was born old and grumpy because this never would have occurred to me as a thing to do.",
            "title_similarity": "0.693191",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvecpus",
            "score": 1,
            "text": "I make one more attempt at catching them flicking from floor, if fail then 3rd attempt usually is to flick straight to the laundry basket.. IF that misses the laundry basket, I leave it there for someone else to pick it up later! \nI love my life ...",
            "title_similarity": "0.61395025",
            "sentiment_compound": 0.2003
        },
        {
            "id": "gvedan0",
            "score": 1,
            "text": "I grab my underwear with my toes and hand it to my hand. I’ve returned to Monke",
            "title_similarity": "0.25278258",
            "sentiment_compound": 0.7506
        },
        {
            "id": "gvedg7b",
            "score": 1,
            "text": "My washer is stacked under my dryer, so I try to kick them directly into the opening.",
            "title_similarity": "0.43512344",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvedsjr",
            "score": 1,
            "text": "Don't catch, aim for your SO's head.",
            "title_similarity": "0.40744984",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvee5fp",
            "score": 1,
            "text": "My knees hurt",
            "title_similarity": "0.31477857",
            "sentiment_compound": -0.5267
        },
        {
            "id": "gveed6z",
            "score": 1,
            "text": "I threw out my back trying to do that at the ripe old age of 23. I’m much healthier now but will never forget!",
            "title_similarity": "0.46172714",
            "sentiment_compound": 0.3162
        },
        {
            "id": "gveeo78",
            "score": 1,
            "text": "I tend to do all 3 or go commando when it's to hot",
            "title_similarity": "0.33358076",
            "sentiment_compound": 0.0
        },
        {
            "id": "gveeqoo",
            "score": 1,
            "text": "Died inside at age 5.",
            "title_similarity": "0.17191589",
            "sentiment_compound": -0.5574
        },
        {
            "id": "gvefeh0",
            "score": 1,
            "text": "I feel personally attacked.",
            "title_similarity": "0.24797752",
            "sentiment_compound": -0.4588
        },
        {
            "id": "gvefmd4",
            "score": 1,
            "text": "My 67 yo husband still does this, makes me smile every time as he tries to aim for the laundry basket after catching them.",
            "title_similarity": "0.52168703",
            "sentiment_compound": 0.3612
        },
        {
            "id": "gvefub3",
            "score": 1,
            "text": "Well, I typically do this but I am more hesitant now. I always aim for catching them by the waistband but have on numerous occasions misjudged and caught them by the crotch or taintband. And then there's the times where a leg hole betrays me and I end up falling to the ground.",
            "title_similarity": "0.691555",
            "sentiment_compound": -0.8418
        },
        {
            "id": "gvefydn",
            "score": 1,
            "text": "Brother, we're not old and grumpy, we're old and achey.  Sometimes old hips don't wanna flick like that!",
            "title_similarity": "0.6686331",
            "sentiment_compound": -0.3404
        },
        {
            "id": "gveg6pi",
            "score": 1,
            "text": "i do this but make it land on my head and wear it. the gf isn’t too impressed tho.",
            "title_similarity": "0.5487673",
            "sentiment_compound": 0.631
        },
        {
            "id": "gvegbac",
            "score": 1,
            "text": "Wait, there are people who Don't do this? Wtf",
            "title_similarity": "0.35899955",
            "sentiment_compound": -0.6705
        },
        {
            "id": "gveggfw",
            "score": 2,
            "text": "After discovering I can kick it toward my wife and have it cover her head.",
            "title_similarity": "0.3624617",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvehce5",
            "score": 1,
            "text": "Lol the headline made me laugh. Lol",
            "title_similarity": "0.21812025",
            "sentiment_compound": 0.8481
        },
        {
            "id": "gvehq0m",
            "score": 2,
            "text": "Nope, figured out that sitting down and taking them off was easier. Still play basketball with em though. He shoots, he ahhh damit it went into the whites hamper. *grumble, grumble",
            "title_similarity": "0.54387486",
            "sentiment_compound": 0.6369
        },
        {
            "id": "gvei24d",
            "score": 1,
            "text": "catching it is gross i just yeet it across the room and it forgets the ball sweat by the time i rewear it in the morning",
            "title_similarity": "0.69122636",
            "sentiment_compound": -0.4767
        },
        {
            "id": "gvei61c",
            "score": 1,
            "text": "I do not miss.  Gotta go all-in for the catch stunt double style.  I have broken several nightstands, a window, and stepped on three cats but the boxers _never_ hit the ground.",
            "title_similarity": "0.5483927",
            "sentiment_compound": -0.2091
        },
        {
            "id": "gveifuy",
            "score": 1,
            "text": "The worst isn’t the failure to catch, it’s this mis-kick that sends your pants flying halfway across the galaxy",
            "title_similarity": "0.6658039",
            "sentiment_compound": -0.8126
        },
        {
            "id": "gvein2m",
            "score": 1,
            "text": "I'm only 16 and I just don't have the energy to kick into the air??",
            "title_similarity": "0.39478314",
            "sentiment_compound": -0.2901
        },
        {
            "id": "gveiqau",
            "score": 1,
            "text": "I don't do this.  My wife and I like to help each other remove the others.",
            "title_similarity": "0.49362248",
            "sentiment_compound": 0.6369
        },
        {
            "id": "gvej0r6",
            "score": 1,
            "text": "Why stand when you can be sitting on something soft while you take them off. I learned this in my teens.",
            "title_similarity": "0.28890568",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvej3zq",
            "score": 1,
            "text": "Damn you reminded me I lost a major part of myself sometime in the last 7 years...",
            "title_similarity": "0.394397",
            "sentiment_compound": -0.6124
        },
        {
            "id": "gvej88q",
            "score": 1,
            "text": "I’m 17 and apparently am old and grumpy now",
            "title_similarity": "0.40253806",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvejaf0",
            "score": 1,
            "text": "My body hurts too much for athleticism of even the faintest degree.",
            "title_similarity": "0.5725957",
            "sentiment_compound": -0.4767
        },
        {
            "id": "gvejg12",
            "score": 1,
            "text": "People who don’t ride their grocery cart to their car and back- Same question. I’m 31 and still do this. It’s fun, requires less work, and gets you there faster.",
            "title_similarity": "0.5641459",
            "sentiment_compound": 0.5106
        },
        {
            "id": "gvejqhg",
            "score": 1,
            "text": "I feel like became old and grumpy in 2019. Before that I would kick my shorts up. Now they just fall to the floor and I take a second to contemplate whether I should bend down and pick them up and risk a slipped disc, or leave them there start my terminal journey into messy old grumpy old as hell.",
            "title_similarity": "0.7875999",
            "sentiment_compound": -0.7845
        },
        {
            "id": "gvejxs7",
            "score": 1,
            "text": "I am offended. I am not grumpy, just older. As you get older you become lllaazzzyyy so dropping your pants or  undies is sufficient. Lifting the leg, kicking, catching its just too much effort. They come off stay on the floor until I decide when I want to put them in the laundry basket. I am also not really offended, just realised how lazy i am becoming with age haha.",
            "title_similarity": "0.7072127",
            "sentiment_compound": 0.1918
        },
        {
            "id": "gvek0ni",
            "score": 1,
            "text": "I keep going until I get it because no pair of shorts or underwear is gonna beat me at my own game",
            "title_similarity": "0.5716046",
            "sentiment_compound": -0.296
        },
        {
            "id": "gvek0zt",
            "score": 1,
            "text": "I play basket drawers with the laundry hamper",
            "title_similarity": "0.2732847",
            "sentiment_compound": 0.34
        },
        {
            "id": "gvek1if",
            "score": 1,
            "text": "Thanks for making me realise that I used to do this and that I don't do this anymore.\n\n*Thanks*",
            "title_similarity": "0.4607492",
            "sentiment_compound": 0.7003
        },
        {
            "id": "gvek7nm",
            "score": 1,
            "text": "I remember seeing a female performer in an adult video pull this off and being so pleased with herself, until the male performer gave her absolutely zero acknowledgement and just continued on with his rapey vibe. I was so sad for her.",
            "title_similarity": "0.6199325",
            "sentiment_compound": -0.0644
        },
        {
            "id": "gvekehq",
            "score": 1,
            "text": "Well hello Phil Dunphy",
            "title_similarity": "0.04703826",
            "sentiment_compound": 0.2732
        },
        {
            "id": "gvel0ac",
            "score": 1,
            "text": "My Dad went to do that last year and didn't realise his boxers were still around one foot. He went ass over and fractured his spine, he is ok after 3 months of rehab. Took him a month to admit how he fell though",
            "title_similarity": "0.61404395",
            "sentiment_compound": -0.128
        },
        {
            "id": "gvele1i",
            "score": 1,
            "text": "Accept failure? Who fails at the floor kick trick? I do it backwards cos then I can flick with ankle and knee, either catch em from behind or have em do the full arc come.back over front and grab. \n\nI thought that was a normal thing?",
            "title_similarity": "0.61792815",
            "sentiment_compound": -0.6416
        },
        {
            "id": "gvelkp5",
            "score": 1,
            "text": "Kick em up again!",
            "title_similarity": "0.24314463",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvelym5",
            "score": 1,
            "text": ":(",
            "title_similarity": "-0.1014107",
            "sentiment_compound": -0.4404
        },
        {
            "id": "gvemim4",
            "score": 1,
            "text": "There's not enough space in my room to do that 😞",
            "title_similarity": "0.3823255",
            "sentiment_compound": -0.4767
        },
        {
            "id": "gvemrwn",
            "score": 1,
            "text": "It’s more effective to kick them into the hamper.",
            "title_similarity": "0.37517238",
            "sentiment_compound": 0.5256
        },
        {
            "id": "gven5l3",
            "score": 1,
            "text": "Wow I just realised that I'm old and grumpy now I gotta get my game back",
            "title_similarity": "0.60279095",
            "sentiment_compound": 0.5859
        },
        {
            "id": "gven7ld",
            "score": 1,
            "text": "Sometimes my back hurts to bad to do it so I kick them into the laundry basket instead of catching it.",
            "title_similarity": "0.6850364",
            "sentiment_compound": -0.765
        },
        {
            "id": "gven8oz",
            "score": 1,
            "text": "I kick them into the hamper not my hand",
            "title_similarity": "0.42649764",
            "sentiment_compound": -0.3875
        },
        {
            "id": "gvenn3c",
            "score": 2,
            "text": "I was born grumpy.",
            "title_similarity": "0.468738",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvenn74",
            "score": 1,
            "text": "When I stop doing this I know my life is effectively over.\n\nIf I miss, I just kick them towards the laundry basket and deal with their disobedience later. \n\nBut if I do it just right, so the undies seem to hover at eye level, spinning end over end, just waiting for me to snatch them out of the air .... that is one of life's most magical moments. It baffles me how my SO doesn't seem to appreciate such soaring success as much.",
            "title_similarity": "0.7527452",
            "sentiment_compound": 0.4961
        },
        {
            "id": "gvenr14",
            "score": 1,
            "text": "I never miss.",
            "title_similarity": "0.010087253",
            "sentiment_compound": 0.1139
        },
        {
            "id": "gvenvt9",
            "score": 1,
            "text": "I do this AND I’m old and grumpy",
            "title_similarity": "0.40994847",
            "sentiment_compound": 0.0
        },
        {
            "id": "gveolwh",
            "score": 1,
            "text": "I became so old and grumpy in 5th grade.",
            "title_similarity": "0.46705335",
            "sentiment_compound": 0.0
        },
        {
            "id": "gveon1x",
            "score": 1,
            "text": "Typically if I fail to grab them I have to then pick them up with my teeth to make up for my failure in catching them",
            "title_similarity": "0.6139637",
            "sentiment_compound": -0.7783
        },
        {
            "id": "gveon9d",
            "score": 1,
            "text": "About 30 years ago. Is this what my problem is? Thanks for pointing it out.",
            "title_similarity": "0.3332867",
            "sentiment_compound": 0.0516
        },
        {
            "id": "gveonxg",
            "score": 1,
            "text": "I like to give myself an alley oop into the hamper.",
            "title_similarity": "0.3133986",
            "sentiment_compound": 0.3612
        },
        {
            "id": "gveovzb",
            "score": 1,
            "text": "i was able from a small age to pick up things with my toes. clothes are easy, even pencils are ok...",
            "title_similarity": "0.11978659",
            "sentiment_compound": 0.4404
        },
        {
            "id": "gveoxw7",
            "score": 1,
            "text": "am 19  and 6 foot 5 inch tall , if i tried to kick up my underwear while wearing just a towel around my hip  it wouldnt be a good  sight for the person infront of me , \n\nno one wants to see a dong . \n\nif i am alone then i would kick it up,even my pants",
            "title_similarity": "0.668962",
            "sentiment_compound": -0.6814
        },
        {
            "id": "gvepoz4",
            "score": 1,
            "text": "I just step out of them wherever I am and mysteriously they are teleported to the laundry basket and then they end up clean and folded in my drawer. It's weird, I keep trying to tell my wife about the magical laundry fairy but she just gets mad and says don't call her that, whatever that means...",
            "title_similarity": "0.6445805",
            "sentiment_compound": -0.5859
        },
        {
            "id": "gveprh5",
            "score": 1,
            "text": "16 yr old here. I thought I was the only weirdo to do this lmao",
            "title_similarity": "0.39020956",
            "sentiment_compound": 0.4263
        },
        {
            "id": "gvepxbd",
            "score": 1,
            "text": "I have extra long toes, I can pick up a roll of quarters, my boxers on the floor is child’s play.",
            "title_similarity": "0.3616491",
            "sentiment_compound": 0.34
        },
        {
            "id": "gvepyh3",
            "score": 1,
            "text": "When I started straining my hamstring every time I did that.",
            "title_similarity": "0.4262238",
            "sentiment_compound": -0.3182
        },
        {
            "id": "gveq2ur",
            "score": 1,
            "text": "I’m 57 years old and I still do this. I have never failed to catch them. I then throw them at my wife and she ducks them. Every. Single. Time.",
            "title_similarity": "0.46971148",
            "sentiment_compound": 0.4023
        },
        {
            "id": "gveqmxp",
            "score": 1,
            "text": "Asking the real questions",
            "title_similarity": "0.08990268",
            "sentiment_compound": 0.0
        },
        {
            "id": "gveqswx",
            "score": 1,
            "text": "I just kick them up and into the hamper now. Across the room with ya, dirty dick cover! Begone!",
            "title_similarity": "0.49304026",
            "sentiment_compound": -0.7772
        },
        {
            "id": "gveqtx0",
            "score": 1,
            "text": "fuck I haven't worn underwear for like a year.\n\nUnderwear is so pre-covid.",
            "title_similarity": "0.39517772",
            "sentiment_compound": -0.0289
        },
        {
            "id": "gver9wa",
            "score": 1,
            "text": "Pointlessly gendered! Why aren't I doing this also!???",
            "title_similarity": "0.45505333",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvercvb",
            "score": 1,
            "text": "you always get at least 1 extra shot to kick them up before you gotta do the bend.",
            "title_similarity": "0.4601699",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvereuu",
            "score": 1,
            "text": "I just throw them in the hamper with my foot. \nIf that makes me old and grumpy, I've been that way forever.",
            "title_similarity": "0.60507727",
            "sentiment_compound": 0.0
        },
        {
            "id": "gverh6a",
            "score": 1,
            "text": "I always try and kick them across the room and into the hamper instead of up and catching.",
            "title_similarity": "0.51778984",
            "sentiment_compound": 0.0
        },
        {
            "id": "gverhge",
            "score": 1,
            "text": "Around aged 20 tbh",
            "title_similarity": "0.127607",
            "sentiment_compound": 0.0
        },
        {
            "id": "gverhst",
            "score": 1,
            "text": "Back pains.......",
            "title_similarity": "0.20849128",
            "sentiment_compound": -0.4215
        },
        {
            "id": "gvermgf",
            "score": 1,
            "text": "I’m 6’5” and I haven’t picked up a pair of underwear/shorts off the ground, from off my body, since ‘92.",
            "title_similarity": "0.3648227",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvermtn",
            "score": 1,
            "text": "People do this? What the fuck",
            "title_similarity": "0.16809231",
            "sentiment_compound": -0.5423
        },
        {
            "id": "gverqyd",
            "score": 1,
            "text": "Wait... You guys don't toe scoop rainbow-kick them over your shoulder, catch them in front of you, and then throw them in the \"maybe we'll re-wear those tomorrow\" pile?",
            "title_similarity": "0.67920583",
            "sentiment_compound": -0.1139
        },
        {
            "id": "gverssz",
            "score": 1,
            "text": "I've literally never done this nor thought to do this.",
            "title_similarity": "0.31865317",
            "sentiment_compound": 0.0
        },
        {
            "id": "gves7bh",
            "score": 1,
            "text": "I quit doing it when I grew up and wasn't a fucking kid anymore.",
            "title_similarity": "0.4603047",
            "sentiment_compound": 0.0
        },
        {
            "id": "gves86g",
            "score": 1,
            "text": "The washing machine took up all the space in the bathroom so... I couldn't do it anymore",
            "title_similarity": "0.46304956",
            "sentiment_compound": 0.0
        },
        {
            "id": "gveskwx",
            "score": 1,
            "text": "When I take off my shirt I throw it up in the air and karate chop that shit like Akuma.",
            "title_similarity": "0.4494521",
            "sentiment_compound": -0.2732
        },
        {
            "id": "gvesn0j",
            "score": 1,
            "text": "Ever heard of the \"Eagles Talons\" ?\n\nIts an advanced style im working on.",
            "title_similarity": "0.23178978",
            "sentiment_compound": 0.25
        },
        {
            "id": "gvetfx8",
            "score": 1,
            "text": "I try to rabona or scorpion kick them in",
            "title_similarity": "0.33985567",
            "sentiment_compound": 0.0
        },
        {
            "id": "gveti2y",
            "score": 1,
            "text": "I am too stoic. I could never.      /s",
            "title_similarity": "0.3369994",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvetl8n",
            "score": 1,
            "text": "Catch them with what? Hands are cheating. Other foot a little challenging. Teeth risky...\n\n... plus of course the last option, easiest after browsing reddit for NSFW.",
            "title_similarity": "0.584013",
            "sentiment_compound": -0.2568
        },
        {
            "id": "gvets7z",
            "score": 1,
            "text": "My back hurts too much to do that. I can barely kick with one foot.",
            "title_similarity": "0.50809884",
            "sentiment_compound": -0.4767
        },
        {
            "id": "gvetuqg",
            "score": 1,
            "text": "I dump my pants off and walk away from them at the end of the day but kick catch my undies. I used to kick them up but because almost 9/10 times they're filled with screws and stuff I don't like playing 100 pick up",
            "title_similarity": "0.79587877",
            "sentiment_compound": -0.7816
        },
        {
            "id": "gvety9h",
            "score": 1,
            "text": "Damn, I am a man...",
            "title_similarity": "0.28905365",
            "sentiment_compound": -0.4019
        },
        {
            "id": "gveukk0",
            "score": 1,
            "text": "A woman here but I couldn't not comment. I DO THIS!!! I never thought that other people also did it, I'm actually excited!",
            "title_similarity": "0.34005854",
            "sentiment_compound": 0.6449
        },
        {
            "id": "gveuub6",
            "score": 1,
            "text": "As a girl, I swear I’m gonna do this from now on.",
            "title_similarity": "0.051893488",
            "sentiment_compound": -0.0516
        },
        {
            "id": "gvevg4t",
            "score": 1,
            "text": "You're not old until you bend over to pick them up...and you can't reach them.",
            "title_similarity": "0.55158067",
            "sentiment_compound": -0.0191
        },
        {
            "id": "gvevo6o",
            "score": 1,
            "text": "When I was 9 or 10 years old I developed my new, state of the art, undressing technique.\nI usually push my trousers and underpants down in one move with both hands until they reach me ankles. Then, in the same movement, I push down my socks and shoes. Like this I can undres my lower body in less than a second. When finished, my clothes look as if I was punched 👊 out of them, like in a cartoon. I love it!",
            "title_similarity": "0.54024386",
            "sentiment_compound": 0.8122
        },
        {
            "id": "gvevsdz",
            "score": 1,
            "text": "I’m a man and I’ve NEVER done this.",
            "title_similarity": "0.381554",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvevy6y",
            "score": 1,
            "text": "You guys are wearing underpants?",
            "title_similarity": "0.22808865",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvewacp",
            "score": 1,
            "text": "Well its because I had to free up my hands to carry two kids. Now what I do is shake my ass till they fall off then pick them up with my toes and flip them into the basket. Ofc this is when I have shorts under my pants that way I dont moon my kids.",
            "title_similarity": "0.6032672",
            "sentiment_compound": 0.0516
        },
        {
            "id": "gvewnph",
            "score": 1,
            "text": "I pick them up with my feet and pass them to my hand, or toss them up and try again.",
            "title_similarity": "0.354473",
            "sentiment_compound": 0.4939
        },
        {
            "id": "gvewtq8",
            "score": 1,
            "text": "My knees hurt! And I'm 26",
            "title_similarity": "0.41529635",
            "sentiment_compound": -0.5707
        },
        {
            "id": "gvewxyy",
            "score": 1,
            "text": "I’m only 26 and I’ve never done this to my recollection... \n\nWhen do I get the senior discount at the Old Country Buffet?",
            "title_similarity": "0.49603903",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvewywj",
            "score": 1,
            "text": "I usually try to kick them straight into the hamper. Improves my accuracy and form. 10/10 would suggest.",
            "title_similarity": "0.4902943",
            "sentiment_compound": 0.5719
        },
        {
            "id": "gvewz99",
            "score": 1,
            "text": "I don't know. I'll try to be better.",
            "title_similarity": "0.30288628",
            "sentiment_compound": 0.4404
        },
        {
            "id": "gvex414",
            "score": 1,
            "text": "Wait, what? There is a different way to take of your clothes?",
            "title_similarity": "0.33977544",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvex67n",
            "score": 1,
            "text": "When the back spasms started.",
            "title_similarity": "0.27313787",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvex8gi",
            "score": 1,
            "text": "When I lost both my legs in hell. Grenada, '83.",
            "title_similarity": "0.43692005",
            "sentiment_compound": -0.7845
        },
        {
            "id": "gvexzj7",
            "score": 1,
            "text": "When I started wearing thongs",
            "title_similarity": "0.16934596",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvey5ya",
            "score": 1,
            "text": "I had rotator cuff surgery a few months ago and I miss this but I'm not confident enough should I slip and fall over and destroy my healing shoulder.",
            "title_similarity": "0.6952735",
            "sentiment_compound": -0.8588
        },
        {
            "id": "gvey6bg",
            "score": 1,
            "text": "I was born bitter and grumpy.",
            "title_similarity": "0.51441467",
            "sentiment_compound": -0.4215
        },
        {
            "id": "gveyol9",
            "score": 1,
            "text": "College. It's a slow death.",
            "title_similarity": "0.3168629",
            "sentiment_compound": -0.5994
        },
        {
            "id": "gvez8u4",
            "score": 1,
            "text": "Spraining my ankle put a damper on most my underwear flinging endeavors",
            "title_similarity": "0.48499018",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvez8xo",
            "score": 2,
            "text": "i was born old and grumpy",
            "title_similarity": "0.4669463",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvezg5w",
            "score": 1,
            "text": "Let me live yeah",
            "title_similarity": "0.046790585",
            "sentiment_compound": 0.296
        },
        {
            "id": "gvezuyr",
            "score": 1,
            "text": "I usually kick them up and land them on my head. Never really thought about why I do this but my girlfriend has never said anything, so must be normal, phew.",
            "title_similarity": "0.6088886",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvezw6r",
            "score": 1,
            "text": "Oh my god when did I grow up fuck ...",
            "title_similarity": "0.33383632",
            "sentiment_compound": -0.34
        },
        {
            "id": "gvezy6s",
            "score": 1,
            "text": "Cause I'm just going to lay them on the floor snyeay",
            "title_similarity": "0.2702414",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvf04po",
            "score": 2,
            "text": "I'm old and my knees aren't what they used to be, so I just aim for the hamper.",
            "title_similarity": "0.63979053",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvf05e0",
            "score": 1,
            "text": "As someone with a muscle disorder, not able to bend my knees to pick something up. This trick is a godsend.",
            "title_similarity": "0.5578336",
            "sentiment_compound": 0.2144
        },
        {
            "id": "gvf07xl",
            "score": 1,
            "text": "Kick'em back up, or I can grab them with my toes.",
            "title_similarity": "0.39231542",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvf0mz7",
            "score": 1,
            "text": "When things in life are good stuff like that just happens. When things aren't you don't really care for the extra stuff",
            "title_similarity": "0.5541874",
            "sentiment_compound": 0.3726
        },
        {
            "id": "gvf0o7l",
            "score": 2,
            "text": "Fuck! I used to do this and now I don't. What happened?",
            "title_similarity": "0.49742115",
            "sentiment_compound": -0.5848
        },
        {
            "id": "gvf0udd",
            "score": 1,
            "text": "I got pinworms, asshxle.",
            "title_similarity": "0.21695167",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvf26k8",
            "score": 1,
            "text": "I'll let you know when I fail.",
            "title_similarity": "0.21456812",
            "sentiment_compound": -0.5423
        },
        {
            "id": "gvf35mz",
            "score": 1,
            "text": ">when did you become so old and grumpy?\n\nWhen my joints didn't allow me to kick high enough!",
            "title_similarity": "0.7422969",
            "sentiment_compound": -0.2401
        },
        {
            "id": "gvf384e",
            "score": 1,
            "text": "I broke my toe against the foot of my bed doing this",
            "title_similarity": "0.43189934",
            "sentiment_compound": -0.4215
        },
        {
            "id": "gvf3cuz",
            "score": 1,
            "text": "By being surrounded by people like you.",
            "title_similarity": "-0.011904819",
            "sentiment_compound": 0.3612
        },
        {
            "id": "gvf3k4y",
            "score": 1,
            "text": "Grab and flick it behind my back, so it goes over my shoulder into my hands, or if I'm lucky it stays on my shoulder",
            "title_similarity": "0.31975606",
            "sentiment_compound": 0.4215
        },
        {
            "id": "gvf3n7i",
            "score": 1,
            "text": "Well, I kicked it up and due to my distraction over an advertisement On television, I got it vanished from my sight. I gave a look all around and it was nowhere to be found. So I wore a new one and went to the market to some shopping and a guy came up to me and said, \"Dude there's a underwear on your shoulder\".",
            "title_similarity": "0.71033776",
            "sentiment_compound": -0.128
        },
        {
            "id": "gvf3pkn",
            "score": 1,
            "text": "I just realized that I no longer do this, and I can't remember when I stopped. I'm 28. Old and grumpy at 28. A real eye opener",
            "title_similarity": "0.60816765",
            "sentiment_compound": -0.4767
        },
        {
            "id": "gvf44qs",
            "score": 1,
            "text": "I live in an rv with 5 Vietnamese women there is no room for that",
            "title_similarity": "0.3058865",
            "sentiment_compound": -0.296
        },
        {
            "id": "gvf4755",
            "score": 1,
            "text": "I like to take mine off in bed by wriggling them down to my feet and stretching them, and then use the elastic to catapult them into the laundry basket!",
            "title_similarity": "0.46359026",
            "sentiment_compound": 0.4199
        },
        {
            "id": "gvf48m4",
            "score": 1,
            "text": "30th birthday. The day I accepted my fate and allowed the old grump to consume me.",
            "title_similarity": "0.48986387",
            "sentiment_compound": 0.2732
        },
        {
            "id": "gvf4in4",
            "score": 1,
            "text": "It started when I was born 😒",
            "title_similarity": "0.083945744",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvf4mmk",
            "score": 1,
            "text": "Uh, just men?",
            "title_similarity": "0.31839448",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvf4w5v",
            "score": 1,
            "text": "I don't know when this happened to me. I'm only 30 and can't remember the last time I did this. I bet it was the Marine Corps because you have boot bands around your ankles that require hands to take off unless you feel like messing them up and redoing them every day. Gonna start doing this again.",
            "title_similarity": "0.66081667",
            "sentiment_compound": 0.3612
        },
        {
            "id": "gvf4wk2",
            "score": 1,
            "text": "My partner leaves them on the bathroom floor behind the door on a heating vent 🥲🙃 has for 3yrs. 😒",
            "title_similarity": "0.4312428",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvf4x2o",
            "score": 1,
            "text": "I put my back out just thinking about doing this.",
            "title_similarity": "0.34170717",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvf4x58",
            "score": 1,
            "text": "I had both my hips replaced before 30. Range of motion won’t let me 😭",
            "title_similarity": "0.46747947",
            "sentiment_compound": -0.4767
        },
        {
            "id": "gvf5hox",
            "score": 1,
            "text": "I can pick things up with my feet so i do that and put it in the dirty bin.",
            "title_similarity": "0.27878287",
            "sentiment_compound": -0.4404
        },
        {
            "id": "gvf5hq4",
            "score": 1,
            "text": "Well first of all, I’m in a wheelchair",
            "title_similarity": "0.014179008",
            "sentiment_compound": 0.2732
        },
        {
            "id": "gvf5ziw",
            "score": 1,
            "text": "How in the ever loving fuck of all that is sacred on this blue and green dot in a vast ocean of nothingness do you kick off underwear *while it’s already being worn?!?*\n\n“Men who don’t remove their shorts/underwear by kicking...”\n\nAre young guys just kicking themselves in the balls left and right in a spastic attempt at playing soccer with their gooch garments? What. The. Fuck.\n\n/s (in case it wasn’t obvious enough)",
            "title_similarity": "0.71674204",
            "sentiment_compound": -0.6522
        },
        {
            "id": "gvf61f1",
            "score": 1,
            "text": "It's just the coolest way to take off all pants or underwear, I'm sorry, I will never not do this.",
            "title_similarity": "0.48142594",
            "sentiment_compound": -0.0772
        },
        {
            "id": "gvf63jv",
            "score": 1,
            "text": "Why don't you STFU before i kick your bitch ass up into the air and catch some Z's before you hit the ground!",
            "title_similarity": "0.5316643",
            "sentiment_compound": -0.8221
        },
        {
            "id": "gvf6cgd",
            "score": 1,
            "text": "I pick them up with my toes.",
            "title_similarity": "0.15592182",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvf6xmg",
            "score": 1,
            "text": "I just take them off by hand and hold them",
            "title_similarity": "0.11314398",
            "sentiment_compound": 0.4939
        },
        {
            "id": "gvf70k0",
            "score": 1,
            "text": "Fuck. I haven't done this in years.",
            "title_similarity": "0.32189935",
            "sentiment_compound": -0.5423
        },
        {
            "id": "gvf70kh",
            "score": 1,
            "text": "I never drop them.",
            "title_similarity": "0.022199646",
            "sentiment_compound": 0.2057
        },
        {
            "id": "gvf7140",
            "score": 1,
            "text": "I stopped wearing underwears so there isnt really an opportunity.",
            "title_similarity": "0.48212272",
            "sentiment_compound": -0.5327
        },
        {
            "id": "gvf71o7",
            "score": 1,
            "text": "I fart mine off then double ankle kick them into the laundry basket.",
            "title_similarity": "0.45901823",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvf77js",
            "score": 1,
            "text": "I broke my pelvis in a motorcycle accident. I can’t get the vertical trajectory I used to. Now I kick them at my wife. She doesn’t always laugh.",
            "title_similarity": "0.6642227",
            "sentiment_compound": -0.3182
        },
        {
            "id": "gvf7i6d",
            "score": 1,
            "text": "I prefer to grab my undergarments with my toes like a chimp or something and throw them into the laundry spot(hamper, etc).",
            "title_similarity": "0.48499864",
            "sentiment_compound": 0.3612
        },
        {
            "id": "gvf7kuq",
            "score": 1,
            "text": "never heard of this, can anyone please explain how tf this works",
            "title_similarity": "0.4056125",
            "sentiment_compound": 0.3182
        },
        {
            "id": "gvf7ok8",
            "score": 1,
            "text": "I just lost the will to care",
            "title_similarity": "0.47099954",
            "sentiment_compound": 0.2263
        },
        {
            "id": "gvf807h",
            "score": 1,
            "text": "My body is just broken",
            "title_similarity": "0.3624919",
            "sentiment_compound": -0.4767
        },
        {
            "id": "gvf8f4a",
            "score": 1,
            "text": "kicked too hard once. Knew attempt at trying to grab was pointless. Yes. It landed half in the toilet",
            "title_similarity": "0.688264",
            "sentiment_compound": 0.3182
        },
        {
            "id": "gvf8os7",
            "score": 1,
            "text": "Don't forget to have to free throw them into the basket with a jump shot, pretending you have some athletic ability lol",
            "title_similarity": "0.37436044",
            "sentiment_compound": 0.8579
        },
        {
            "id": "gvf91tr",
            "score": 1,
            "text": "I honestly thought I was the only one. How foolish.",
            "title_similarity": "0.36893213",
            "sentiment_compound": 0.2263
        },
        {
            "id": "gvf994b",
            "score": 1,
            "text": "I have a certain threshold that when my underwear exceeds this threshold, it disappears out of existence. Which is a dumb way of saying that I just let it fall until  my wife picks it up. #nevergrowold",
            "title_similarity": "0.7041215",
            "sentiment_compound": -0.5574
        },
        {
            "id": "gvf9co9",
            "score": 1,
            "text": "Am I the only one who slips them off and pushes them with my foot into a dirty clothes pile?",
            "title_similarity": "0.5720427",
            "sentiment_compound": -0.4404
        },
        {
            "id": "gvf9e67",
            "score": 1,
            "text": "When I lost me arms.",
            "title_similarity": "0.2576093",
            "sentiment_compound": -0.3182
        },
        {
            "id": "gvf9euj",
            "score": 1,
            "text": "Hmm I don’t do that, but I always attempt throwing them into the laundry basket from the farthest distance possible, if I fail, I try the challenge again but by flicking them in with my feet\n\nAnd if I then fail, I am a looser and must squat down, get it in there the “normal way” and feel like an embarrassing failure",
            "title_similarity": "0.7494141",
            "sentiment_compound": -0.9398
        },
        {
            "id": "gvf9le1",
            "score": 1,
            "text": "Last time i tried i through my back out and had to take time off from classes. Im too young for this shit.",
            "title_similarity": "0.5817493",
            "sentiment_compound": -0.6428
        },
        {
            "id": "gvf9vcx",
            "score": 1,
            "text": "My back hurts ok, leave me alone.",
            "title_similarity": "0.47117922",
            "sentiment_compound": -0.6486
        },
        {
            "id": "gvfadfh",
            "score": 1,
            "text": "I was 6 years old.",
            "title_similarity": "-0.004139712",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvfannz",
            "score": 1,
            "text": "Guess i was old the day i was born. I just throw them where tomorrow me has to pick em up again",
            "title_similarity": "0.4959156",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvfawht",
            "score": 1,
            "text": "My hip hurts sometimes, fuck off",
            "title_similarity": "0.42495945",
            "sentiment_compound": -0.765
        },
        {
            "id": "gvfax06",
            "score": 1,
            "text": "Wait, you guys wear underwear?",
            "title_similarity": "0.20071416",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvfbac8",
            "score": 1,
            "text": "I take mine off in the bathroom usually and I would smack my shin or ankle on the cupboards or toilet if I tried to do that.",
            "title_similarity": "0.5216375",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvfbdzk",
            "score": 1,
            "text": "I leave mine on the ground to assert dominance.",
            "title_similarity": "0.30779758",
            "sentiment_compound": 0.1531
        },
        {
            "id": "gvfblr0",
            "score": 1,
            "text": "I guess I still do it but Don't have the chance much anymore. My room is small(9x9x9) so I can't do it in there and I don't wear shorts much anymore",
            "title_similarity": "0.4727557",
            "sentiment_compound": -0.2755
        },
        {
            "id": "gvfbnrl",
            "score": 1,
            "text": "After TKR in both knees. I try but can only manage a pathetic skid across the floor.",
            "title_similarity": "0.58129305",
            "sentiment_compound": -0.7227
        },
        {
            "id": "gvfc114",
            "score": 1,
            "text": "You are supposed to remove them?",
            "title_similarity": "0.2595957",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvfc6ty",
            "score": 1,
            "text": "I have arthritis in my hip and STILL do this daily.",
            "title_similarity": "0.3458193",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvfchmf",
            "score": 1,
            "text": "Hahaha I love it. I used to jump over then gate everytime to makensure I can still do it but I dont have a gate anymore.",
            "title_similarity": "0.6099662",
            "sentiment_compound": 0.5994
        },
        {
            "id": "gvfcq9o",
            "score": 1,
            "text": "I don't even know another way to remove underwear.  I cheat though, as I remove them once I get into bed, so I only have to kick them horizontally towards myself, not upwards.",
            "title_similarity": "0.72816044",
            "sentiment_compound": -0.4588
        },
        {
            "id": "gvfcz22",
            "score": 1,
            "text": "Timely question. I currently have a cut in my lip from flicking my shorts up too hard and the steel button hit me in the mouth. I’m 48",
            "title_similarity": "0.5830125",
            "sentiment_compound": -0.3612
        },
        {
            "id": "gvfd88p",
            "score": 1,
            "text": "I grab them between my toes and forefoot then twist my knee to \"hand\" them to myself so I can put them wherever they're going.",
            "title_similarity": "0.40030098",
            "sentiment_compound": 0.4939
        },
        {
            "id": "gvfdgt6",
            "score": 1,
            "text": "Since I graduated college and got a job.",
            "title_similarity": "0.17927395",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvfdj51",
            "score": 1,
            "text": "I kick them back up. This might be the best question ever asked on here",
            "title_similarity": "0.3778543",
            "sentiment_compound": 0.6369
        },
        {
            "id": "gvfebp1",
            "score": 1,
            "text": "When I dropped it",
            "title_similarity": "0.256119",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvfed9n",
            "score": 1,
            "text": "My back sore!",
            "title_similarity": "0.31065047",
            "sentiment_compound": -0.4199
        },
        {
            "id": "gvfeizp",
            "score": 1,
            "text": "About a day after I was born?",
            "title_similarity": "0.081475064",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvfezqq",
            "score": 1,
            "text": "I'm wouldn't say I'm old and grumpy, but when I want to have less clothes on, I generally want to have less clothes on fast, and flicking them up into the air doesn't achieve that very well",
            "title_similarity": "0.6856054",
            "sentiment_compound": 0.611
        },
        {
            "id": "gvff12y",
            "score": 2,
            "text": "Bending over? I Pick them up with my feet and Put it in my hands.\nAnd sometimes the kick up",
            "title_similarity": "0.2844048",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvffmpd",
            "score": 1,
            "text": "Extra points if you can kick it up and catch it ring toss style.",
            "title_similarity": "0.33233896",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvffqjk",
            "score": 1,
            "text": "35. I became old and grumpy at 35.",
            "title_similarity": "0.42795783",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvfg8yq",
            "score": 1,
            "text": "Wow I've never done this didn't know it was a thing. Will try today and report back",
            "title_similarity": "0.44188923",
            "sentiment_compound": 0.5859
        },
        {
            "id": "gvfglmp",
            "score": 1,
            "text": "I just leave them where they fall.",
            "title_similarity": "0.24070409",
            "sentiment_compound": -0.0516
        },
        {
            "id": "gvficsw",
            "score": 1,
            "text": "When I got cancer",
            "title_similarity": "0.2735476",
            "sentiment_compound": -0.6597
        },
        {
            "id": "gvfj3v7",
            "score": 1,
            "text": "Oh God I dont do this anymore..",
            "title_similarity": "0.30008394",
            "sentiment_compound": 0.2732
        },
        {
            "id": "gvfj4vj",
            "score": 1,
            "text": "I'm 53 and I still do this",
            "title_similarity": "-0.00685969",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvfj6gh",
            "score": 1,
            "text": "So I moved recently and the room I moved into is real small, so there's not enough room for me to do it 😢",
            "title_similarity": "0.47091514",
            "sentiment_compound": -0.4767
        },
        {
            "id": "gvfjja9",
            "score": 1,
            "text": "First time my back fucked up for 3 weeks doing it.",
            "title_similarity": "0.41637874",
            "sentiment_compound": -0.6597
        },
        {
            "id": "gvfjtq0",
            "score": 1,
            "text": "This hit me right in my depression.",
            "title_similarity": "0.3072055",
            "sentiment_compound": -0.5719
        },
        {
            "id": "gvfjvyl",
            "score": 1,
            "text": "Why bend over instead of just picking them up with your toes?",
            "title_similarity": "0.427135",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvfk1tc",
            "score": 1,
            "text": "Phil dunphy, that you ?",
            "title_similarity": "0.07074602",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvfkc7z",
            "score": 1,
            "text": "When my knees went to shit before I turned 20.",
            "title_similarity": "0.45301262",
            "sentiment_compound": -0.5574
        },
        {
            "id": "gvfkn6y",
            "score": 1,
            "text": "Well I find I became so old and grumpy about the time I could no longer kick my boxers up into the air and catch them before they hit the ground without pulling and/or injuring something",
            "title_similarity": "0.7950353",
            "sentiment_compound": -0.0258
        },
        {
            "id": "gvfkreu",
            "score": 1,
            "text": "Back surgery bruh. Takes away the limberness and removes the cockiness from your soul. You get real leery about moving your center of gravity.",
            "title_similarity": "0.6603131",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvfllow",
            "score": 1,
            "text": "I grab them with my toes, apes strong together.",
            "title_similarity": "0.24399829",
            "sentiment_compound": 0.5106
        },
        {
            "id": "gvflu0n",
            "score": 1,
            "text": "Right knees gone to shit, hard to flick the previous pair of skivvies up when the other leg is more unstable than your distant uncle at Thanksgiving.",
            "title_similarity": "0.78653276",
            "sentiment_compound": -0.7778
        },
        {
            "id": "gvfm3j6",
            "score": 1,
            "text": "I use my foot to throw them back into the air and catch it.",
            "title_similarity": "0.23250335",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvfm4y7",
            "score": 1,
            "text": "23 is about when",
            "title_similarity": "0.008612122",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvfndb5",
            "score": 1,
            "text": "Never submit",
            "title_similarity": "0.26330474",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvfnelb",
            "score": 1,
            "text": "I've accepted my old grumpy status.",
            "title_similarity": "0.31086892",
            "sentiment_compound": 0.2732
        },
        {
            "id": "gvfnu4j",
            "score": 1,
            "text": "I'm 43 in a few weeks & I still do this.",
            "title_similarity": "0.1356951",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvfo4rm",
            "score": 1,
            "text": "Omg I've never been young! I prefer to lower them enough that I can pull a leg out... And then the other.",
            "title_similarity": "0.4789695",
            "sentiment_compound": -0.3595
        },
        {
            "id": "gvfoyhp",
            "score": 1,
            "text": "I try to catch them on my head.  Just want to make sure we're being clear on where the bar is being set.",
            "title_similarity": "0.32274595",
            "sentiment_compound": 0.6369
        },
        {
            "id": "gvfp6ya",
            "score": 1,
            "text": "My husband has never done this....does that mean he was born a curmudgeon?",
            "title_similarity": "0.62473434",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvfpg1y",
            "score": 1,
            "text": "If I fail the second time I use my toes to pick them up as if I was a monkey.",
            "title_similarity": "0.46269733",
            "sentiment_compound": -0.5423
        },
        {
            "id": "gvfpwee",
            "score": 1,
            "text": "I call this the stage of life test. You only have 3 stages of life that you can't kick flip your undercrackers in the laundry or your hands. 1 is when you are a baby and wearing diapers and training undercracks...and someone has to help. 2 is when you can kick flipping anywhere and with style..and 3 is when you are too old lazy or can't for whatever reason. And someone has to help.",
            "title_similarity": "0.57768875",
            "sentiment_compound": 0.4404
        },
        {
            "id": "gvfr67t",
            "score": 1,
            "text": "https://youtu.be/R3WDe7byUXo",
            "title_similarity": "0.08295296",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvfrtoe",
            "score": 1,
            "text": "You've obviously never kicked-yourself in the balls (literally) while attempting this.",
            "title_similarity": "0.43428403",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvft3kw",
            "score": 1,
            "text": "im usually not the person taking mine off /shrug",
            "title_similarity": "0.30816227",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvftjnf",
            "score": 1,
            "text": "Lol, I’m 43 and do this daily... haha thought it was a me thing.",
            "title_similarity": "0.3141354",
            "sentiment_compound": 0.7003
        },
        {
            "id": "gvftkp1",
            "score": 1,
            "text": "I jumped out of planes for roughly 9 years.  Just reading your title made my back spasm.",
            "title_similarity": "0.5041755",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvfu7of",
            "score": 1,
            "text": "I never did that.",
            "title_similarity": "0.20155832",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvfusa8",
            "score": 1,
            "text": "About 20 years ago.",
            "title_similarity": "0.05603426",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvfv14x",
            "score": 1,
            "text": "I do the toe lift into the hand anyone else use this tactic?",
            "title_similarity": "0.317628",
            "sentiment_compound": 0.4939
        },
        {
            "id": "gvfv1iy",
            "score": 1,
            "text": "I do the toe lift into the hand anyone else use this tactic?",
            "title_similarity": "0.317628",
            "sentiment_compound": 0.4939
        },
        {
            "id": "gvfv5tl",
            "score": 1,
            "text": "It depends on how tired I am and if my joints decide to cooperate",
            "title_similarity": "0.48947895",
            "sentiment_compound": -0.4404
        },
        {
            "id": "gvfvdpw",
            "score": 1,
            "text": "I thought I was the only one that did this!!!",
            "title_similarity": "0.23118375",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvfy4tc",
            "score": 1,
            "text": "When i started having back problems :(",
            "title_similarity": "0.3682831",
            "sentiment_compound": -0.6808
        },
        {
            "id": "gvfz7bd",
            "score": 1,
            "text": "I'll preface by saying I'm 34 and old sports injuries have caught up with me.\n\nI usually do kick them up to catch up or I'll kick-fling them into my laundry basket. But some mornings I wake up and my back is doing it's best impression of an 84 year old and I shuffle over to the shower, undress as gingerly as possible, and hope today is the day I slip and hit my head and don't wake up.\n\nWhat was the question again?",
            "title_similarity": "0.6629864",
            "sentiment_compound": 0.9186
        },
        {
            "id": "gvg0uvq",
            "score": 1,
            "text": "Why would you do that?",
            "title_similarity": "0.14082749",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvg1otb",
            "score": 1,
            "text": "If I miss, I pick up my shorts with my toes and grasp them in my hand and put them in the dirty laundry basket, or just put them there with my foot directly. \n\nFTR, I am a 60-y.o. man with two (functioning) hands and two (functioning) feet. \n\nI also practice dressing in the dark, including tying my shoes, just in case I might lose my sight. ... And to have an excuse for wearing a garish shirt. “Why, yes, I _did_ dress in the dark.”",
            "title_similarity": "0.5600083",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvg28lm",
            "score": 1,
            "text": "When I started throwing my back out by just walking.",
            "title_similarity": "0.45298177",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvg4igi",
            "score": 1,
            "text": "I knocked a vase over.",
            "title_similarity": "0.24866727",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvg8ymy",
            "score": 1,
            "text": "Pretty much the day of the car accident.",
            "title_similarity": "0.25328308",
            "sentiment_compound": 0.0258
        },
        {
            "id": "gvgqxec",
            "score": 1,
            "text": "When I lost enough coordination that they just became tangled and stick on my foot.\nOr\nMaybe that's what boxer briefs do, idk",
            "title_similarity": "0.6224961",
            "sentiment_compound": -0.4019
        },
        {
            "id": "gvhendz",
            "score": 1,
            "text": "Several years ago I was diagnosed with MS. I have difficulty moving my legs. My not “removing my shorts/underwear by kicking them in the air and catching them before they hit the ground” has nothing to do with why I became a grumpy old man.   \n\n\nI became old and grumpy when I was diagnosed with a debilitating neuro-muscular disorder that is slowly killing me (should take about 40 years) and of which I will die unless something else kills me first.\n\n(Really, I am not all that grumpy, I just don’t like the presumption of the OP.)",
            "title_similarity": "0.8320943",
            "sentiment_compound": -0.9371
        },
        {
            "id": "gvho0wf",
            "score": 1,
            "text": "Get with it boomer we kick our shorts directly onto the chair/bed",
            "title_similarity": "0.34177756",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvi0mld",
            "score": 1,
            "text": "Hmm.. now that I think about I don't remember ever failing",
            "title_similarity": "0.22734916",
            "sentiment_compound": 0.4023
        },
        {
            "id": "gviv9ow",
            "score": 1,
            "text": "Go  Commando 😂",
            "title_similarity": "0.1684419",
            "sentiment_compound": 0.4404
        },
        {
            "id": "gvjl8ab",
            "score": 1,
            "text": "The proper way is to pull them down, step out of them and then pick them up clenching them with your toes and throw them just a tiny bit so you can catch then and then dunk them basket style into the hamper. \n\nAny questions?",
            "title_similarity": "0.48081282",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvmbftp",
            "score": 1,
            "text": "Jesus Christ, I didn't realize other people did this! It's not that I thought no one else did it, I just never gave it much thought.\n\nAnyway, I always attempt it from the floor, and if I fail to do that I pick 'em up with my toes.",
            "title_similarity": "0.68794465",
            "sentiment_compound": -0.7177
        },
        {
            "id": "gvo03tk",
            "score": 1,
            "text": "I used to do this, and then one day a breeze came thru the window and tickled my butthole \n\n\nNever again",
            "title_similarity": "0.5720242",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvqpts8",
            "score": 1,
            "text": "REALLY??? 😄😄😄",
            "title_similarity": "0.014055086",
            "sentiment_compound": 0.9522
        },
        {
            "id": "gvxh1gx",
            "score": 1,
            "text": "I got old.",
            "title_similarity": "0.102526315",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw2wx45",
            "score": 1,
            "text": "“It all started when I was born”",
            "title_similarity": "0.044187658",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw36tl6",
            "score": 1,
            "text": "😂😂😂 I did this a lot.",
            "title_similarity": "0.022573605",
            "sentiment_compound": 0.8271
        },
        {
            "id": "gw4zwrx",
            "score": 1,
            "text": "My husband is teacher our littles to do this.",
            "title_similarity": "0.340779",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwb4ase",
            "score": 2,
            "text": "Tch, you should be an expert at disrobing without hands by now. The flower of manhood is being efficient and buying tools to help automate your life 🤣🤣",
            "title_similarity": "0.531811",
            "sentiment_compound": 0.8979
        },
        {
            "id": "gwf7500",
            "score": 2,
            "text": "Lol I've always kicked wildly and never attempted the catch. Let the shorts fly where they may.\n\nPure chaos is the way to go.",
            "title_similarity": "0.59968567",
            "sentiment_compound": -0.2263
        },
        {
            "id": "gwi93ic",
            "score": 2,
            "text": "When did you become a prude and start wearing underwear?",
            "title_similarity": "0.3549186",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwib0y8",
            "score": 2,
            "text": "Catching them is weak sauce. From the foot right into the dirty clothes hamper is the only way.",
            "title_similarity": "0.56936026",
            "sentiment_compound": -0.7003
        },
        {
            "id": "gwm5lb0",
            "score": 1,
            "text": "Religiously",
            "title_similarity": "0.01535058",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwmcwvu",
            "score": 1,
            "text": "Shoutout to all the gents who fling your chones at your S/O when they aren’t looking!! Bonus points when they stick to the face ☝️",
            "title_similarity": "0.60022783",
            "sentiment_compound": 0.6229
        },
        {
            "id": "gwpnj0u",
            "score": 1,
            "text": "Y'all do that?",
            "title_similarity": "-0.041837104",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwpz37r",
            "score": 1,
            "text": "Ok wtf, this is something completely random snd makes no sense but SO many other guys do it..\n\nIm convinced we are in a simulation and are all coded to do this",
            "title_similarity": "0.60923177",
            "sentiment_compound": 0.2846
        },
        {
            "id": "gx5ma6s",
            "score": 1,
            "text": "I moved and now my room is significantly smaller. I'm a gangly bitch. No room for fun in this tiny man hole.",
            "title_similarity": "0.6051428",
            "sentiment_compound": -0.4019
        },
        {
            "id": "gxauk9d",
            "score": 1,
            "text": "23. Leg day.",
            "title_similarity": "0.035578348",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxcxwaq",
            "score": 1,
            "text": "Lol i dont use them",
            "title_similarity": "0.27288133",
            "sentiment_compound": 0.4215
        },
        {
            "id": "gxgi4fj",
            "score": 1,
            "text": "What???",
            "title_similarity": "0.008105058",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxow6ej",
            "score": 1,
            "text": "I pick them up with my feet like how a monkey/ape uses their feet to grab on stuff",
            "title_similarity": "0.3260611",
            "sentiment_compound": 0.3612
        },
        {
            "id": "gxqd834",
            "score": 1,
            "text": "Never done this before.",
            "title_similarity": "0.20153639",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxzjptb",
            "score": 1,
            "text": "A pube hit my face. Now I'm cautious",
            "title_similarity": "0.34442443",
            "sentiment_compound": -0.1027
        },
        {
            "id": "gyq584o",
            "score": 1,
            "text": "When my hips started clicking",
            "title_similarity": "0.09537415",
            "sentiment_compound": 0.0
        },
        {
            "id": "ha7r7xf",
            "score": 1,
            "text": "I do (and assumed everyone did) it behind me, as in quickly bend my knee so the underwear flies up behind my back and then catch it. If it falls, I grab it with my toes and do pretty much the same thing (except for doing it with toes instead of doing it from the ankle obviously)",
            "title_similarity": "0.4878715",
            "sentiment_compound": 0.4939
        }
    ]
}