{
    "Dear men. What is the strangest thing you’ve done for one of your best friends that helped them in the long run?\nI’ll start. My best friend was beat up over this girl and he always looked at her picture that he had in his wallet.\n\nOne days while he was looking at it and I asked him to let me see. I proceeded to put it in my mouth and chew on the picture while making direct eye contact the entire time. I spit it out and asked him if he wanted it back.\n\nHe got this stupid grin on his face and said “nah I’m good” lol\n\nEdit: I’m going to try my best to read all your stories! I didn’t expect it to blow up like this! All of you are awesome. Except that one guy who commented about cooking semen. Fuck you in particular lol": [
        {
            "id": "gxga2s5",
            "score": -3,
            "text": "[removed]",
            "title_similarity": "-0.0038988367"
        },
        {
            "id": "gxgtbvz",
            "score": 1,
            "text": "Are you a dog?",
            "title_similarity": "0.05648269",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxh2onw",
            "score": 0,
            "text": "Tell them about crypto.",
            "title_similarity": "0.15675119",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxh12wc",
            "score": 0,
            "text": ">**\"***Oh, what wasted wanderings! At long last I see the destination in front of me – it is Eden and in the middle a tree. But lo, all is burnt and deserted, the wrath of Man asserted and terrible; miserable cherubs wait beyond its gates, sunken faces and empty plates – starving, crying, Peter waits with key in hand; “What have you done to this once-fine land?” Heaven’s gates are closed now and there is no hope for Man – small and scattered like grains of sand are my people, my blood, my pain. “It was not me,” I think in vain, “I only wanted a bit of rain to whet my tongue and fill my veins. I needed to see what was here, to bring the news of where we were going,” – now I see that Hell is glowing and Satan’s army approaches. What of my companions? Where will they be when they are caught upon that road and high mountain pass? It wasn’t I who spilt that glass. There is a broken altar inside these gates too. Beyond the tree it calmly waits for Elijah’s return, for the faithful to burn an offering to the one true God.5 Truly we cannot tell a lie and say that nobody told us; that nobody warned what would happen if we continued on our path, that Eden would burn for our evil task. Meanwhile, the wolf is here already, healed, satisfied, yet still hungry, clawing at that once green tree, gnawing there on Odin’s knee because the feet have been devoured – his egocentric sacrifice was only that of a coward; someone who couldn’t admit that ‘I Am’s hands are folded, not for helping those emboldened by influence, selfishness, and greed, for those who would rather ride such a terrible steed.*  \n>  \n>*Why is it that Men depend on prophets and thieves to meet our needs? Elijah came bearing long overdue dire warnings about our drifting, spoke genuine words to those not listening to the truth, poisoning themselves and in turn the youth; Prometheus came with ethereal fire stolen from the god’s gossamer palace, caring for it was our priority and chalice. That light-fingered titan, son of Jove, whose name means ‘forethought’ – why should he have suffered for his compassion, martyred and judged to lose his liver daily? Yet for the majority of Men unbalanced and teetering over gluttonous gorges, the helpers’ deeds are done, divided up like favors by uncaring hearts “as false as stairs of sand.”6 The Greeks knew that the Choice of Hercules was Duty not Pleasurei and also that it was he whose compassion freed the flame-bearer. Who now can bear our petty prayer and, more than that, why should they care? Those hollow hallelujahs are hardly helpful; rarely righteous requiems obscured in denial, lacking substance, feigning love but lacking heart. The torch of forethought passed and squandered, the example bartered for 30 pieces of silver and foolishly fettered away, what honors do we deserve? Flags and fools are the first to rush into war – the slogan our banner bears reads, “Property of Pride, Power, and Pleasure.” Yet all we’ve taught our children, the only gauntlet of our soldiers, is the autonomy of mediocrity – Babel, our precious tower, disgraces the landscape.****\"***\n\n[Source:](https://tim4994.pressbooks.com/chapter/memories-mottos-meanderings/)",
            "title_similarity": "0.6040877",
            "sentiment_compound": -0.9809
        },
        {
            "id": "gxhgzsx",
            "score": 0,
            "text": "What if your friend had ermmm left his DNA on that picture!",
            "title_similarity": "0.4298128",
            "sentiment_compound": 0.5411
        },
        {
            "id": "gxg8j6o",
            "score": -44,
            "text": "[removed]",
            "title_similarity": "-0.0038988367"
        },
        {
            "id": "gxidfom",
            "score": 1,
            "text": "I talked him into buying GameStop. Once the MOASS happens we will be wealthy together...as long as he can HODL the Stonk.",
            "title_similarity": "0.5436437",
            "sentiment_compound": 0.3612
        },
        {
            "id": "gxha9gy",
            "score": -3,
            "text": "Uh, she once in sleep put her hand in my pants and I was like what the heck? So, I woke her up but she didn't pull out her hands and I was like 'okay?-'",
            "title_similarity": "0.48029205",
            "sentiment_compound": 0.8321
        },
        {
            "id": "gxgrn8l",
            "score": 15,
            "text": "I took a shower with him without expecting a blowjob.",
            "title_similarity": "0.39115414",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxgu55v",
            "score": 12,
            "text": "I made him and his gf split up. Trust me, it was real funny and required.",
            "title_similarity": "0.65880495",
            "sentiment_compound": 0.7351
        },
        {
            "id": "gxgwn7w",
            "score": 13,
            "text": "Well, I’m not gay but this one time my buddy & I were out hiking & he went to take a leak & got bit on his dick by a rattlesnake.\n\nHe died, but I held his hand the entire time…",
            "title_similarity": "0.6804856",
            "sentiment_compound": -0.8225
        },
        {
            "id": "gxhwnzh",
            "score": 0,
            "text": "I used to always tell my buddy that the reason he doesn't have a lot of friends or gfs is because he never shuts up, talks too much, doesn't chill, always talks about himself, is too heated...and he needs to relax. But he never listened to me lol.",
            "title_similarity": "0.6444169",
            "sentiment_compound": 0.7717
        },
        {
            "id": "gxifjn5",
            "score": 0,
            "text": "I “loaned” on of my good friends $500 knowing he and his kid were struggling.\n\nI never expected or asked for the money back - MF won’t answer my calls or texts since.",
            "title_similarity": "0.6826035",
            "sentiment_compound": 0.4939
        },
        {
            "id": "gxhoz8k",
            "score": 1,
            "text": "Fat jokes. He is ripped as fuck now",
            "title_similarity": "0.4880267",
            "sentiment_compound": -0.3612
        },
        {
            "id": "gxhqkhk",
            "score": 1,
            "text": "I don't help people. Nothing good comes from that",
            "title_similarity": "0.16874734",
            "sentiment_compound": -0.5667
        },
        {
            "id": "gxiuipf",
            "score": 1,
            "text": "I'm actually the friend in this case...\n\nWould tag him but he's not on reddit\n\nLets see\nFound out I needed to sell my gpu to get some cash for my son's doctor's and meds, asked me the price I was letting it go for and gave me the money so we can still play together\n\nHad to sell my sivga pii for the same reason again,he found out and got me a pair of hd600\n\nWe both Need each other in a strange but bro way\n\nNo idea we're i would be without him tho",
            "title_similarity": "0.76544917",
            "sentiment_compound": 0.0516
        },
        {
            "id": "gxgtwv9",
            "score": 28,
            "text": "Anybody on here commented on why OP’s friend was grinning after seeing OP chew on the pic? The amount of sad nights staring at that pic and all the dried, satisfying flui... no? Just me? Okay. My mind is twisted bruh.",
            "title_similarity": "0.77397674",
            "sentiment_compound": 0.7929
        },
        {
            "id": "gxgk8b7",
            "score": 72,
            "text": "2 of them had a fight and I just screamed and punched the wall. It worked and they got things right after that. I was surprised that it actually worked",
            "title_similarity": "0.66452956",
            "sentiment_compound": -0.4588
        },
        {
            "id": "gxgzafj",
            "score": 22,
            "text": "Talked to his girlfriend (My Ex) for 20 minutes, no pressuring, no coercion, and easily arranged for her and I to have a quickie. She confessed to missing our sex a lot, not even being sure why she left me (Spoiler, was the one who left her because she admitted to cheating on me by having wild sex with an older guy).\nI skipped the meeting up with her, though I was greatly tempted to get a load out with a wild romp, and instead, I told my friend 100% exactly what I’d done (Conversation, non-coercion agreement of his girlfriend to have sex with me, and myself actually standing her up and not doing the horizontal tango.)\n\nI asked that he question her about it.\nHe did.\nShe yelled, broke up with him, then later admitted to it.\n\nNow he’s been my best friend for about 15 years. 😊",
            "title_similarity": "0.80610967",
            "sentiment_compound": 0.9465
        },
        {
            "id": "gxhcbdw",
            "score": 8,
            "text": "I’m straight but showed a very good friend how Grindr works so he can hopefully find someone 🤞",
            "title_similarity": "0.51083547",
            "sentiment_compound": 0.9372
        },
        {
            "id": "gxgna9s",
            "score": 49,
            "text": "Nice try, FBI!  Not fooling me...",
            "title_similarity": "0.26879397",
            "sentiment_compound": 0.6542
        },
        {
            "id": "gxglwti",
            "score": 189,
            "text": "I mocked my friend until he decided to get back into shape, and now his back doesn't hurt anymore, and recently a girl asked him out.",
            "title_similarity": "0.60897505",
            "sentiment_compound": 0.5684
        },
        {
            "id": "gxgnjf5",
            "score": 340,
            "text": "My best friend could not get laid 40 yr old virgin kind of thing, and had real issues being able to develop sexual/romantic relationships with woman despite being not gay. I surmised that he was putting sex on a far to high of a pedestal and would get far to anxious once girls started flirting and things went in that direction. I Also have a friend who so happens to be a escort, so I hired her to deal with this problem I payed for a good four hours explained the situation. I invited my guy friend to my home had her in the spare room shoved him in and refused to let him run away. Basically I told him she paid up for four hours you are not leaving that room until that time is up. \n\nShe was also pretty good about it to, it was just a matter of getting him past that anxiousness, the part that would put most woman off, she calmed him down chatted with him made him relax and did the deed. He came out of it with the experience and had more personal confidence about being able to have sex with someone.\n\nHe was a bit annoyed with me after, but ultimately got over that initial anxiousness about sex with woman, stopped getting way to nervous around woman to flirt and make that final push for intimacy. Now he has a girl friend, they moved in with each other and seems happy. Even though he has not thanked me for it, it is kind of an unspoken moment in the friendship.",
            "title_similarity": "0.7852473",
            "sentiment_compound": 0.9478
        },
        {
            "id": "gxgyl04",
            "score": 10,
            "text": "We were teenagers in a small town. He had no license and some toxic family came to visit. He got in abit of trouble. Two driving unlicensed and dui. They wanted to go places and in a small town you gotta drive.i wouldnt knock around with the blow ins\n\nAnyway one day we were on the piss and pot around a friends and i was taking it easy on the beers, as there was a few dodgy  people there and we needed someone in control and to be able to drive. \n\nAnother guy lent us his car to go get weed. It was legal back then. So why they drank i smoked. Country boys can handle thier pot. We had abit of a thrash on the dirt roads..as you do..mate had a drive and lost control.  Car wouldn't start and someone dobbed us in.. anyway , we push started the car and as we got back to party, local copper turned up acting like a hero. It was sad coz when i was around we had fun but never crossed a line. I would keep everyone from going to far. Copper didnt see it that way. Last copper, he knew if i was around, just a quiet chat was in order. In fact he told me  straight out , if hes not on duty behave. The city cops will go to town on you.\n\nAnyway the new one was being a pig. He knew my mate was driving. I took the rap. And pushed his buttuns abit. Got a without due care charge. 3 demerit points and 187 dollar fine. Mate would of been locked up. Hes indigenous so it could of got real bad. The coppers up that way have an official record with the un for torture, of his brother, 7 years later",
            "title_similarity": "0.6946099",
            "sentiment_compound": -0.9476
        },
        {
            "id": "gxg8glz",
            "score": 644,
            "text": "My best friend calls me her \"anti-depressant\".  One time she  and I where hanging out at the mall, and someone made some comment about how could I stand to be with a girl who was so fat. So I  said \"because she's cute and thiccck!\" and took her in my arms and just snogged her heavily. After that she started to cry, laughed a bit and had to rush to to the restroom to vomit.  It was just such a shock for her. \n\nLike before then we where really close bu there was no attraction between us, it was like a buddy comedy or Scully and Mulder dynamic.  So me  kissing her and showing affection like that was  just a chain reaction to what must have been benched for the years we have known each other. \n\n\nAnother time was when she and I went jogging together and she was on my back and doing yoda quotes in a yoda voice.",
            "title_similarity": "0.7856406",
            "sentiment_compound": 0.9763
        },
        {
            "id": "gxgxc0k",
            "score": 91,
            "text": "This kinda sucks but, here we go - my best buddy, classic American good guy. Veteran, good education to become a teacher, saves himself for marriage (against my advice, bro had awesome girls always approaching him), wonderful wife just after college, actual decent family guy you want as a friend/neighbor. Very religious. I am a doubting, questioning everything hyper-educated guy. Very pragmatic, logic reigns over emotion but still try to be compassionate to others and self. Still, poetic enough to personally believe 'Eat, Drink, Be Merry for Tomorrow You Die'. Together, we have been through some scary, tough going. Not childhood hijinks, life or death impasses. In our mid 30's, his Mother is diagnosed with a particularly violent cancer. Close with each other's families, his folks are uber christian fundamentalists. Every person in his church, his extended family is claiming 'healing' via faith. I convinced him to go backwoods, deep off the 'there is no path' camping. I explained the cold science behind the cancer, his Mom would die from it. Told him \"Don't listen to these proselytizing fools. Go to her and spend the last few weeks talking/listening and asking who she is. Love her and your family and yourself.\" He lost precious weeks raising money with his church for 'travel and treatment'. They kept more than half as tithes. He was there four rough days before she died. I think I was the only person in his life to try and prepare him for that grotesque inevitability. We talked twice in the following months. I was not asked/invited to the funeral. Talked to his wife twice after, he was having a tough time. Wouldn't respond to my calls for over a year. We're guys, blockheaded and self important; can't give in but probably should. It's been a decade, still consider him one of my best friends.",
            "title_similarity": "0.66587645",
            "sentiment_compound": 0.0489
        },
        {
            "id": "gxh7vid",
            "score": 22,
            "text": "Had many strange times with my best mate, but one I remember well.. \nI got a call one night about 1am from my best mate, his his flatmate Tom had been out in the city and somehow or other had started talking to this girl, chatting to her for a bit and they were getting on alright apparently, nothing more than pub chat though, apparently. Anyhow, comes to closing time and T decides to call it a night and walk home, but unbeknownst to him this girl decides to follow him in the middle of the night back to the house. \n\nSo they’re sitting there on the sofa after T gets in when they start hearing this tapping on the window, T gets up and looks out but there’s nothing there. Stops for a bit then starts again, they look up and this girls face is just planted against the glass grinning at them. My mate nearly shat himself I think but T being an absolute unit of a bloke and well past 6’ didn’t think much of it and just walks outside where this girl then starts asking to come in. When he says no she starts getting aggressive, which then progresses to possessed level screeching and screaming and starts attacking him, so he pushes her away and slams the door shut, so she starts banging on the door.\nIn the meantime my mate has called the police and then he calls me so I’m hearing the whole thing from now on.\nGirl is standing in their front garden screeching and screaming and she then starts throwing all the change in her pockets at the glass, then peashingle and then starts slamming herself against the front window, banging with her fists and hands and then starts trying to actually boot the glass in with her foot. T’s got the popcorn out by this point, she does this for maybe five minutes and then she just stops and it goes quiet for maybe ten seconds or so and I’m like, “is she gone?” \nThere’s then this hell of a smash through the porch window beside the door, the girl has bareknuckle fist slammed through a pane of glass and then she keeps going as blood is spraying out everywhere. She then keeps going trying to rip out the glass with her bare hands whilst trying to crawl through but can’t, so then goes back to the front window whilst screaming all the time, slaps a load of blood onto the window and bangs her fists again then just runs off down the street and disappears. Police turn up some minutes later and take a statement, so then we hang up. \n\n8 am the next morning I go up there to look at the damage and it’s just a mess, shards of glass and blood everywhere, it’s surprising how far it travels.. We spend the morning cleaning it all up after the police come and take a sample and then go to the hardware shop in the afternoon where, after telling the bloke what had happened, he actually gave us the glass for free and charged half for putty and pins - top bloke. Got the window fixed, washed all the blood off the front of the house and got a few quid in change too. \n\nPolice found the girl after she passed out in a very bad way from blood loss a few streets over and ended up in hospital. Come to find out she’d escaped recently from a not very secure, secure psychiatric hospital bless her, so back she went. She did apparently apologise and offer to pay for the damage but my mate didn’t press charges as she obviously had enough of her own problems and didn’t have money anyhow. \n\nI think he had a bit of a lucky escape that night..",
            "title_similarity": "0.67114735",
            "sentiment_compound": -0.9752
        },
        {
            "id": "gxgofpx",
            "score": 927,
            "text": "This wasn’t for my best friend but for a friend non the less\n\nHe was getting bullied constantly by this group of 3 kids, who would rough him up when he was alone. One day I waited nearby one of their main spots, and when they attacked him I jumped in and used some pepper spray that I got off of Amazon on the 3 of them, (my friend was hit too, but he didn’t get that much) when they were on the ground, I pulled down the leader’s pants, put the pepper spray to his dick and told him if he ever touched my friend again, he would be peeing hot sauce for a week. (I don’t know what pepper spray does to dicks but it sounded scary and it worked) they left my friend alone after that.",
            "title_similarity": "0.84746826",
            "sentiment_compound": -0.1154
        },
        {
            "id": "gxglsfs",
            "score": 836,
            "text": "Tipped over a port a potty with a guy and girl having sex in it.\n\nThis one needs an explanation...So my buddy Tommy was dating this girl Dawn that just liked to bang in weird places.  One friend told him that she was just banging all kinds of dude all over the place and Tommy just did not believe it.  So I am a third party and had not seen this girl out with other guys, but the two guys had been arguing about it in front of me.  So out at this party by Grand Valley State University, its in a cornfield next to a corn maze and there is a row of 5 port a potties and my buddy says:  Look man look, Freaky Dawn is going in Potty #4 to be a whore.  Tommy is on his way here.  I said “How far out”.  He said “5-minutes tops, but you know he ain’t gonna make it in time...she is gonna get away with it.  I looked over at my buddy he had been arguing with and said “Not if I tip it over”.  He looks at me and says $20, my other friend says “Wait, I got a hundred on it...but only if you tip it on the door so it is harder for them to get out and stand on it till Tommy gets here.  I said “$120 tip it on the door, stand on it and yell Dawn is a Whore Cheating on my best friend Tommy and then I run away” cause I had no idea when he was gonna get there.  \n\nSo i take off running and hit this thing with all 6 foot 4 inches and 220 pounds with a shoulder block toward the top of it.  It goes up a bit, tips way up as I bounce and it goes but starts to come back so I grab the bottom corner and give it my all and it goes over.  I jump up on top of the Potty and as I do I say “Dawn the whore is in here having sex and cheating on my friend Tommy”...Well Tommy seen me tip the potty and he was running up to see which one of our friends I was messing over.  He heard me and when I hopped down to take off running...I seen him and took two steps and said “Hey, didnt know you were here”.  \n\nTommy tips the potty on its side, opens the door and basically she was on the toilet legs up and when I tipped it, she landed on dudes dick blue crap water went all over both of them and Tommy said to her “Wow, you really are a whore”.  The end",
            "title_similarity": "0.78477573",
            "sentiment_compound": -0.9188
        },
        {
            "id": "gxh7jmf",
            "score": 32,
            "text": "Old friend 15 years ago was from a family of car mechanics. He used to buy pallet loads of reject merchandise, expired and near expired stuff from large chain pharmacies as his side thing for the weekends. Some of the stuff was Nicotine products. He started selling it locally in the swap meets / flea markets for around $5-$10 a pop. \n\nI told him he could make some real cash selling it on ebay or something, and I'll gladly teach him if he'd buy the weed while we're working on it. He didn't want to do it. Had an aversion to computers or something. . . .Offered me 50% of the *revenue*  to do it for him. Told him that's waaaay too much, just smoke me out and I'll show you how. Nope! He insisted I do it for him. After I sold around a thousand in a week with my personal 100% rated ebay acct, his two older brothers started to talk trash saying things like my share was too big, I'm ripping *HIM* off. etc. etc. \n\nWell . . . ok. I offered to teach *them* how to do it. Like, I'm not trying to screw anyone over here. You really don't need me to, but if you insist that you need your hand held, fine. We spent a few days, going at it. I tried to mentor them into the customer service mindset, but they just couldn't get it. they both got banned from ebay. The brothers this time asked me to do it and offered me the 25% this time around. Rejected it of course, it was more the insult considering they wanted me to do all the work for them after they accused me of shit last time then told me they didn't need me anymore. But I spent a day with them to point out where they went wrong and how to correct it. Then they opened accts in their wives names. First wife got banned, and after that I think they finally got the hang of it. Last I heard, they stopped the cars stuff and went full time into ebay stores and other online merch sales becoming their own bosses.",
            "title_similarity": "0.7148983",
            "sentiment_compound": -0.9739
        },
        {
            "id": "gxghfq6",
            "score": 248,
            "text": "Took all his coke and left it in the street, he doesnt know it was me and I lost touch with him a long time ago",
            "title_similarity": "0.6125882",
            "sentiment_compound": -0.3182
        },
        {
            "id": "gxgj9ft",
            "score": 275,
            "text": "Called their parents(he was in his late 20s).  Told them he needed help and then cut him out of my life. He was dragging me down with him and what I did allowed us both to move forward.",
            "title_similarity": "0.723341",
            "sentiment_compound": 0.1531
        },
        {
            "id": "gxgvjbk",
            "score": 42,
            "text": "I had a project file. I slip my pages into his file so that it would look big. We both got A+ in project.",
            "title_similarity": "0.49185422",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxgvul1",
            "score": 45,
            "text": "[deleted]",
            "title_similarity": "0.04442935"
        },
        {
            "id": "gxgx28k",
            "score": 129,
            "text": "Five years ago I convinced his (ex)girlfriend to have a affair with me to prove she was having affairs (I only texted her, we didn't do anything physical). I showed him the text where she admitted. He dump her the same day, now his engaged to the third greatest woman I ever meet (the other two are my gf and my mother)",
            "title_similarity": "0.75266933",
            "sentiment_compound": 0.8126
        },
        {
            "id": "gxgtud3",
            "score": 58,
            "text": "Talking him into quitting porn, going thoroughly through [Unraveling Penis Size](https://unravelingsize.wordpress.com/unraveling-penis-size/) with him explaining every bit, and drilling through his thick head that size and shape only matter when it comes to methods, not results.\n\nI'm sure his first girlfriend is glad I did.",
            "title_similarity": "0.7978016",
            "sentiment_compound": 0.2819
        },
        {
            "id": "gxgrv1v",
            "score": 60,
            "text": "I am always there to listen. No judgement. Give advice only when asked. Was basically a free psychologist for a lot of people at one time.",
            "title_similarity": "0.47521546",
            "sentiment_compound": 0.2732
        },
        {
            "id": "gxgzqv6",
            "score": 59,
            "text": "Ok. So... I convinced my friend to break up with his girlfriend. She was amazing. He didn’t deserve her. I’m not hating on him. He was habitually cheating on her. She caught him twice and she forgave him. They moved in together. He said he was definitely going to stop cheating. He didn’t. Whenever we hung out and girls would try to flirt with him, I’d 🐓block. I’d let them know that they would be hooking up with a cheater.\n\nHe’d always get pissed and I’d always tell him. Dawg, if you break up with her, you can keep sleeping around w/o having to lie or be secretive. \n\nWhenever she would hangout with me and my friend, I’d make vague comments about infidelity. They’d always get into an argument when I’d leave. Honestly, IDK why they kept inviting me around. She always said that she liked me that I was a “good friend,” an “honest friend.” He told me that she said that she definitely wants me at their wedding.\n\nAnyway many months passed. Many arguments had. He finally told me with a big smile on his face that they broke up. She moved out. It was very amicable. He said being single was the best thing. He told me I was right. He kept sleeping around but didn’t need to lie or be secretive. His ex soon found someone new and better. \n\nAll it took was me 🐓blocking and making vague comments about infidelity for about 6-8 months. [+]",
            "title_similarity": "0.85483015",
            "sentiment_compound": 0.8144
        },
        {
            "id": "gxg7u1n",
            "score": 443,
            "text": "You are a genuine hero.",
            "title_similarity": "0.04364449",
            "sentiment_compound": 0.5574
        },
        {
            "id": "gxgryw6",
            "score": 145,
            "text": "Buddy was going through a bad breakup.  I looked him in the eyes and said, \"I'm not going to sugarcoat it.  It's going to get worse before it gets better.\" It was tough love but he thanked me for it some months later.",
            "title_similarity": "0.6734447",
            "sentiment_compound": 0.5927
        },
        {
            "id": "gxh19zv",
            "score": 365,
            "text": "On a bus we were just chatting away having a laugh then a group of lads aged about 12 got on the bus and stole my friend's hat when they walked passed.\n\nIt was/is his favourite hat.\n\nI told him to go up to them and get it back. He was too scared to confront them. Which was fair enough. But I remained him we were the adults, both in our mid 20s at the time and he was 6 foot 2. While these were just 5 wee brats.\n\nSo he got up, nervously and asked for his hat back. They threw it around him and just took the mick. So I got up, walked up the 'leader' and demand the hat back \"you wee cunt.\"\n\nThen just ripped it out of the child's hand.\n\n\"I'll get ma Da on you!\" the leader shouted as we sat back down. \"I might well be your da, your ma that much of a slut.\" Which got the whole bus laughing including all of his mates.\n\nOne of the lads apologised as they all got off the bus. I told my friend that if he shows any fear, people will just walk over him. He was badly bullied at school but something clicked in his head.\n\nFast forward 10 years, I'm at his BBQ and his daughter is playing with a ball with her friends. There are only about 6/7 years old. And some lads came and stole their ball right out of their garden.\n\nMy friend said he been having trouble with this group of lads a lot lately and they will be hanging around the sport club at the bottom of his street. I asked if he needed help, he said no but to come along if I wanted.\n\nSo we walked to the end of street and there is a group of lads, about 16/17 years old, drinking and smoking and kicking the ball around. I am scared as fuck at this point, at least 3 of lads look massive. He just walked up to them and asked for his daughter's ball back and said a couple of their names. \n\n\"Sorry Mr C, didn't know it was your kid.\"\n\nAnd they volley the ball to me so I can easily catch the ball.\n\n\"I won't tell you mum you're smoking again T.\"\n\nWas this the same lad who shite himself ten years ago? I was so proud.",
            "title_similarity": "0.7885941",
            "sentiment_compound": -0.4515
        },
        {
            "id": "gxh8f2y",
            "score": 408,
            "text": "I introduced my friend to his wife he would have never met had he never been my friend. \n\nWe were big outdoorsman back in college and back when I was a kid my grandma used to put  me in ballroom dancing classes. I met this girl at a dance competition and we were talking about our non-dance hobbies and I told her I was really into mountaineering and rock climbing. She was like, ohh thats sooo cool! After I got to know her more she was really into military guys, dated like ROTC guys a lot and they generally treated her like shit. \n\nMy best friend had also dated horrible women as well. One girl said she wanted to wait for marriage before sex and ended up getting knocked up while only a sophomore in college by some frat douche while they were still together. One girl went psycho on him and destroyed his motorcycle. We were college students and he put a lot of effort into restoring this motorcycle so it was pretty devastating to him. He was always trying to help people too, a genuinely nice person and a person you would want as a friend. \n\nMy birthday was coming up and I invited her to my party, which was at my friends house. When she walked in the door she said the energy in the house was just intoxicatingly positive and she loved it; it was just a bunch of friends sitting around making food, laughing, sitting by a fire and playing music and singing horribly.   \n\n\nI could tell instantly when I introduced the two that both found each other attractive. She was still my friend and guest and didn't know anyone there, I took her under my wing so to speak which is just good manners when inviting people to parties where they don't know a lot of people. But I tried to do as much with my friend as possible so they would have a lot of time to talk to each other that night.   \n\n\nIt was a great time. Later on after many drinks she ended up getting a ride home with a bunch of other girls. She had on her winter coat that night that was actually part of her winter uniform for her old sports team where they had won some tournament or championship and I took it off the coat rack and hid in my friends place.   \n\n\nI knew this jacket would have immense sentimental value to her and low and behold. She calls me early in the morning panicking saying that she forgot it at my friends house. I tell a white lie and say I can't go get it because I am on my way to work but I can text her the address and she can go pick it up. In reality I am hung over in my apartment. Shes like nooo thats embarrassing, please can you just go get it.   \n\n\n\"I cant, not for awhile at least. I have work today then classes after that till 6 and a project meeting with classmates till like 9pm.\"  \n\n\n\"Ok ill go pick it up.\"  \n\n\nOnce I get off the phone with her I franticly chain call my friend, he isnt picking up. Keep calling, finally he picks up. \"Dude WTF, its 9am. I am hung over.\"   \n\n\n\"Rachel, that girl from, last night is on the way over to your house right now.\"  \n\n\n\"Wait. What? Why?\"  \n\n\n\"She left her coat at your place last night\"  \n\n\n\"Bro I kinda cleaned up a little bit last night and there is no coat anywhere.\"  \n\n\n\"I stuck it behind your couch\"  \n\n\n\"LOL Dude that is fucked up.\"  \n\n\n\"Listen, she lives 15 minutes away from you, change your shirt and brush your teeth. Don't take a shower. This has to be natural.\"  \n\n\n\"What is going on?\"  \n\n\n\"I am hooking you up with the love of your life, just listen. You trust me with your life when where 800 feet up on a rock face and I am your belay. You gota trust me now too.\"  \n\n\n\"HAHAHAHAHA, damn bro thats deep. Alright.\"  \n\n\n\"You got 10 minutes, go get the coat and put it somewhere else in your house. Have her sit down for awhile and chat with her while you pretend to look for it. Once you \"find\" it give it to her and she will feel ecstatic. From there, sit down next to her and be like 'fun night, hey are you hungry? You wanna go get breakfast?'. I know you're shy, but there is a 95% chance she is going to say yes. She likes you.\"  \n\n\n\"Dude you're fucking WILD bro. This is crazy man, no way.\"  \n\n\n\"Its your life man, I gota go back to sleep, was fun and lets go do something next weekend\"  \n\n\nLong story short he did it and they ended up falling deeply in love and getting married a few years later.   \n\n\nStill to this day I take credit for the whole thing.",
            "title_similarity": "0.7268715",
            "sentiment_compound": 0.9982
        },
        {
            "id": "gxgaily",
            "score": 85,
            "text": "Wow I want a friend like you",
            "title_similarity": "0.1771141",
            "sentiment_compound": 0.8689
        },
        {
            "id": "gxgss12",
            "score": 759,
            "text": "[deleted]",
            "title_similarity": "0.04442935"
        },
        {
            "id": "gxgp351",
            "score": 420,
            "text": "Drove my college roommate's current girlfriend's car, with her in the trunk, on to my school's campus because there's a gate and the guard wouldn't let her on. They had already tried to walk on together, so he couldn't drive the car with her in the trunk, so I was like fuck it I got you. One of the (many) downsides of going to a military school I guess.",
            "title_similarity": "0.62741154",
            "sentiment_compound": -0.1868
        },
        {
            "id": "gxger8j",
            "score": 273,
            "text": "Stopped smoking weed. And cut him off my supply. He ended up in Kentucky and has finally settled down.",
            "title_similarity": "0.52242225",
            "sentiment_compound": -0.4588
        },
        {
            "id": "gxgz1nt",
            "score": 139,
            "text": "There’s some great, wholesome posts on here. My mates wouldn’t even let me use their phone in the event of an emergency.\n\nI need new friends.",
            "title_similarity": "0.6315995",
            "sentiment_compound": 0.6808
        },
        {
            "id": "gxguejp",
            "score": 334,
            "text": "He was on a post break up/cheating girlfriend bender. A BAD one. I took his van keys and his punch for taking them. I didn’t hit his drunk self back. He passed out shortly afterward. When he finally woke up, he wanted to find and beat the hell out of whoever hit me. He still claims not to remember.",
            "title_similarity": "0.79843473",
            "sentiment_compound": -0.9049
        },
        {
            "id": "gxgxxwc",
            "score": 726,
            "text": "She'd gone through several decades worth of shit in a couple of months (divorce, both parents and a sibling died, got fired, was mugged) and turned to heroin to cope.  Several failed attempts at quitting later, I half jokingly suggested that I just chain her to a radiator for a week.  It ended up happening, and she's been off the stuff for years now.\n\nSecond place probably goes to developing a private language.  A friend of mine has occasional episodes of intense panic and paranoia, verging on schizophrenia.  They're relatively rare (maybe three or four times a year) and it's actually quite easy for him to work through them if he can talk things through with someone he trusts completely.  The problem being that during these episodes he gets paranoid about people spying on his calls/texts/messages, so he'd never reach out to anyone.  A basic conlang known by four of us solved this pretty neatly.",
            "title_similarity": "0.71624637",
            "sentiment_compound": -0.8495
        },
        {
            "id": "gxgugze",
            "score": 1047,
            "text": "A friend showed up at my door drunk because he was high and ordered a hooker to his house...when his fiancé was there. She kicked him out, and he came to my place...I walked into the room the next few days and saw all sorts of pills, many of which I could not identify...\n\nI asked him if he was ok...he looked crazed, million mile stare and sweaty from days of god knows what...so I told him I was taking him to a psych ward. He agreed funny enough and so we went.\n\nHis fiancé and our common group of friends all turned on me saying why did I do this and what not...I broke from that group of friends. I knew something was wrong, didn’t know what, but I knew something was wrong, and I tried the only thing I knew that could help. I was a 20 something year old kid...I didn’t have much experience with what I know now as depression.\n\nLess than 10ish years down the road I heard he committed suicide...those friends that all turned on me, 2 of them actually apologized...I still haven’t spoken to any of the others. His fiancé (then widowed-wife) couldn’t face me either.\n\nI wish I knew more about depression then, I might have been able to put into words better what I saw and why I put him a psych ward...maybe those enablers who were supposedly “friends” if they knew, might’ve continued what I started and got him real help...\n\nThat was one of the most intense things I remember going through when I was younger...there are definitely some other stories, but some are not really shareable as I haven’t come to terms with some of the events yet...but this one is one I like to share so that people stop avoiding those hard conversations. Being a friend doesn’t mean that you ignore your friends issues...being a friend means kicking someone’s ass when they need it for their own good. We are a village...one giant village. We should look out for each other like family, and sometimes families get on your ass because the stupid shit you are doing is dangerous.",
            "title_similarity": "0.81163996",
            "sentiment_compound": 0.4454
        },
        {
            "id": "gxgnnw0",
            "score": 2376,
            "text": "A friend found himself in deep shit with the law. The cops charged him with something that I know for a fact he was totally innocent of. The cops kept calling him and urging him to come to the police station.\n\nThank God he called me first. I told him to stfu when it comes to cops, lawyer up right now and, at least until he talks to his attorney, DO NOT VOLUNTARILY GO TO THE POLICE STATION.\n\nHe took my advice, contacted my attorney, luckily my friend never made any kind of statement to the police and the only contact he had with the cops was through my lawyer.\n\nLater, I sent him the YouTube video of that law professor guy explaining why you never talk to the police ever never fucking ever and he was blown away by it like everybody else is.",
            "title_similarity": "0.7287956",
            "sentiment_compound": 0.92
        },
        {
            "id": "gxgsinv",
            "score": 3242,
            "text": "Buddy called me out of the blue during a bad snow storm. Said he needed help digging his car out and gave me an address of a graveyard. I said I'd bring my upstairs neighbors and he said he'd rather if I didn't. \n\nTurns out he was playing Pokemon Go and drove deep into the unplowed graveyard to catch some rare Pokemon. He's 40.",
            "title_similarity": "0.6007848",
            "sentiment_compound": -0.5267
        },
        {
            "id": "gxgwe7o",
            "score": 568,
            "text": "A friend of mine invited me to go to the gym with him. I thought he wanted to hang out with me (which is true) and get in shape while chill with each other. \n\nLater on I was with him and his girlfriend (at the time). She was insecure about going to the gym but he told her she can go with us. He then said it was because he was insecure about going alone but me being there with him made it a lot easier. Not gonna lie, I felt like I helped my bro.",
            "title_similarity": "0.66517544",
            "sentiment_compound": 0.431
        },
        {
            "id": "gxh3j1h",
            "score": 1439,
            "text": "I had my friend watch my dog when I went on vacation. \n\nHe always thought he didnt like dogs, but he fell in love with my dog while watching him and ended up getting a dog of his own after. \n\nWhile walking his dog, he met a woman who would later become his wife. She was also from a very rich family and basically lifted him into the upper class. Motherfucker lives in a mansion on the Long Island shore with a beautiful wife and 3 kids all because I asked him to watch my dog one weekend.",
            "title_similarity": "0.6959986",
            "sentiment_compound": 0.9124
        },
        {
            "id": "gxgobzm",
            "score": 318,
            "text": "I baked him some cookies and now hes a chef,well i am too but he's better.",
            "title_similarity": "0.46652347",
            "sentiment_compound": 0.5927
        },
        {
            "id": "gxgtspo",
            "score": 754,
            "text": "I helped my friend get out joining army. He had me lie to his recruiter about his family and members that were supposedly sick and dieing and needed a voucher for his story. He was in bootcamp and starting his process but he was doing it all for some girl to like him. Long story short she didn't like him so I lied lol. Sorry uncle sam",
            "title_similarity": "0.77341044",
            "sentiment_compound": 0.0933
        },
        {
            "id": "gxgw5hb",
            "score": 2429,
            "text": "I have a story of the opposite happening to me. When I was a teenager I got mixed up with drugs and formed a really bad habit with opiates. I love music and had some expensive equipment that, of course, started getting pawned. Guitar pedals, gone. Microphones, pawn 'em. Vintage Marshall half stack amp, ill never see it again. And finally my cherished guitar that my father bought me 10 years prior, pawned that too.\n\nShortly after I was busted robbing cars and taken to jail. Was in and out of rehabs and county jail until finally having to do a 2 year bid in state prison for a number of charges. \n\nFinally get out of prison and start to reacclimate to life when I get a call from and old band mate. He says, \"yo dude, um so I think I have your guitar\" an all black Ibanez that's lefty and had red strings.\n\nApparently, shortly after I had gone away, my friend walked into a pawn shop looking for a guitar (he was a lefty too) and noticed mine on the wall and told me he was compelled to get it. He held it for me, and just gave it back, didn't charge me or anything. \n\nActually started a new band with my friend and we played for a few years together until touring became too much hassle, but I still have the guitar to this day and play it every day. If it wasn't for a random coincidence, and a really great friend, I would have never seen my guitar again.\n\nHey quick edit: Everyone's wonderful and kind words have been as humbling as they are beautiful. To anyone looking to get clean or stay clean, stay the course, it only gets better I promise. There is life after dope, and you can continue to make that sweet, sweet music.",
            "title_similarity": "0.74411273",
            "sentiment_compound": 0.9952
        },
        {
            "id": "gxgrdea",
            "score": 944,
            "text": "This question makes me think of that King of the Hill episode where Hank role played Bill's ex wife Lenore to help him find closure. True friend indeed.",
            "title_similarity": "0.57904893",
            "sentiment_compound": 0.8779
        },
        {
            "id": "gxh6l1x",
            "score": 466,
            "text": "Best friend is HS was African American- in a small town that unfortunately had some racist families. Great guy. Multiple state champion in track and is now a lawyer. \n\nOur junior year he met a girl - great girl, shitty racist parents. They were not allowed to date by parental decree. Her parent basically grounded her forever. \n\nWe formulate a plan. I am her pretend BF. I pick her up for dates, buddy hides in the car waiting. I went to prom with this girl and even went to church and some family dinners to keep the ruse going. \n\nEventually it became clear it just wasn’t going to work for them - but it was an interesting 6 months.\n\nPS - I had my own very understanding GF during this whole thing.",
            "title_similarity": "0.7454964",
            "sentiment_compound": 0.7935
        },
        {
            "id": "gxgx3gj",
            "score": 1086,
            "text": "My (now ex)girlfriend's family wasn't big on education, didn't feel college was necessary, and she was kinda okay with that, more like resigned to it.\n\nIt was mostly just to not have to go long-distance after high school, but I fought like hell to get her to go to college (the same one as me). She did well, graduated near the top of her class and started to like studying and reading books. We broke up after college, but she went on to do a post-graduate degree abroad, and I like to think that it made a significant difference to her life.",
            "title_similarity": "0.58116233",
            "sentiment_compound": 0.3206
        },
        {
            "id": "gxgu1cb",
            "score": 638,
            "text": "Paid off their credit card so they could get a place and get out of a shitty situation. Never talked to them again. They did fine according to FB. I'm OK with that. We're different people now.",
            "title_similarity": "0.52625465",
            "sentiment_compound": 0.4084
        },
        {
            "id": "gxguj1o",
            "score": 913,
            "text": "I'm the friend in this case actually. A few years ago my best friend helped me through a really bad breakup by going through my Google photos and deleting everything to do with my ex. This included a lot of nudes and sex tapes we recorded. This man has seen way more of me than any friend should see and yet he's still here. I'm in an Xbox party with him as I type this. What a great guy. I still get a bit haunted by the memories at times, but thanks to him I don't have that stimuli to worsen things. Especially considering google photos has that awful memories feature where it brings up the anniversaries of pictures/videos you've saved. Love this man",
            "title_similarity": "0.82591087",
            "sentiment_compound": 0.9145
        },
        {
            "id": "gxgmf4s",
            "score": 10415,
            "text": "My best friend is the type of person who if you asked him to come pick you up because your car broke down 100 miles away and it’s 3 in the morning he would come get you no questions asked. \n\nI gave him his 20% for a down payment for a home. He was struggling with work at the time and got his girlfriend pregnant. He wanted to raise the kid with her but he was living at home. I am not well off by any means but had enough in the bank to give him something to help out. He is very practical and only was looking for a beginner home and eventually move into something better down the road. I never once asked him to pay me back but he promised he would. I told him to take his time and make sure to be a good dad. I never charged him interest or anything of that sort. We still hang out and grab drinks and stuff and one day 7 years later he hands me a check for the amount I gave him. He was bawling when he handed it to me. That’s what good friends do for each other. Support one another and love them like they are family.\n\nEdit: Folks 20% back then is not what 20% is now. This happened way before the 2008 real estate bubble and collapse.",
            "title_similarity": "0.69448566",
            "sentiment_compound": 0.9847
        },
        {
            "id": "gxgvps0",
            "score": 2360,
            "text": "He called. Said he needed me. He'd gotten a medical discharge from the service, but didn't realize that he'd need to be off base so soon.\n\nHe was 1000+ miles away.\n\nI drove up. We grabbed a trailer. Threw his possessions into my truck and trailer, and I got him a room and a bed till he could get his feet back under him.\n\nHe's married now. Great kid, house, etc.",
            "title_similarity": "0.65297604",
            "sentiment_compound": 0.7684
        },
        {
            "id": "gxgtjme",
            "score": 4,
            "text": "Good job man.. u did good.",
            "title_similarity": "0.120071866",
            "sentiment_compound": 0.7003
        },
        {
            "id": "gxgv3qk",
            "score": 94,
            "text": "my best friend lives in a diff state, but I spent hours w/him on a discord call while he was super high that way he wouldn't get super in the lows of it and start crying. I essentially just let him ramble, but it was nice to be there for him, even if I was in the BG just being someone to talk to and giving him something to watch (I was streaming video games).\n\nI care for him a lot, and I really hope one day I can afford to visit him or vice versa",
            "title_similarity": "0.7503789",
            "sentiment_compound": 0.9066
        },
        {
            "id": "gxgwbd2",
            "score": 168,
            "text": "[deleted]",
            "title_similarity": "0.04442935"
        },
        {
            "id": "gxgxomv",
            "score": 62,
            "text": "Told him to just go for his mba, while sitting in a shady bar drinking cheap beer, the boy works for a big ass investment firm now",
            "title_similarity": "0.5467703",
            "sentiment_compound": -0.5423
        },
        {
            "id": "gxgygey",
            "score": 294,
            "text": "I was the guy that answered his 3 am phone call...",
            "title_similarity": "0.36578035",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxgyzgd",
            "score": 2,
            "text": "Good shit bro.",
            "title_similarity": "0.03053567",
            "sentiment_compound": -0.1779
        },
        {
            "id": "gxgzeqg",
            "score": 2,
            "text": "Gave him a car",
            "title_similarity": "0.10776801",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxh07v1",
            "score": 207,
            "text": "Explained to him how he could graduate on time if he just changed majors to the subject he had more credit hours in. He's now a professor in that field. It sometimes takes some one stupider than you to make you realize what a dumbass you are.",
            "title_similarity": "0.58672786",
            "sentiment_compound": -0.6378
        },
        {
            "id": "gxh0bfx",
            "score": 7,
            "text": "My best friend was in a really abusive relationship for several years, only he was blinded by love and didn't really see the abusive part himself.\n\nSo over the years whenever we were alone, which wasn't often because of her, i would talk to him about their relationship and the absurdity in it. After a while I started doing this to his girlfriend too, to try to get her to see her bad behavior.\n\nIt didn't really get better, but then they suddenly broke it up, and I helped my buddy meet new people. A year later, he met his now girlfriend through one of the apps I gave him. The new girlfriend is wonderful and they're really perfect together.\n\nAnd well, I didn't really know it until last year, but he told me that it was because our many talks and my talks with his girlfriend, that they eventually saw how she was abusive and that he wasn't actually in love with her, just conditioned to love her.\n\nAfter knowing so many men throughout my life who've stuck with their abusive so's, it feels good that I could identify it early and help out to put an end to it before it was too late.",
            "title_similarity": "0.79423213",
            "sentiment_compound": 0.0524
        },
        {
            "id": "gxh0soo",
            "score": 5,
            "text": "Not what I did for my friends, but when my friends did for me, I had just broken up with my first serious girlfriend, they asked me if I had work for the next couple of days, I said no, so they were at my house a few moments later, told me to pack an overnight bag, and \"kidnapped\" me and took me to the beach/boardwalk in Santa Cruz. That was dope.",
            "title_similarity": "0.72737074",
            "sentiment_compound": 0.1531
        },
        {
            "id": "gxh1lhe",
            "score": 1,
            "text": "I had a BMW 740 IL (it’s a long luxury BMW) and one Valentine’s Day, I offered to be the driver for my friend and his girlfriend.\n\nI love to drive, I knew all the romantic back roads, and I thought it would be fun.  \n\nAs I’m driving them towards a scenic overlook, my friend and his girlfriend start to argue.  They sweet romantic trip turned into a nightmare as they fought and fought as I drove them around town.\n\nI didn’t really know what to do, so I just tuned it out and drove.  At the time, I was a sports writer and I learned to focus through just about anything.  So they fought away.\n\nI eventually took them to a mutual friend’s party and dropped them off.  They broke up, went their separate ways, and ended the relationship.\n\nHe was going to propose to her in a few months and instead he met someone knew that he’s still with to the best of my knowledge.",
            "title_similarity": "0.7121824",
            "sentiment_compound": 0.9573
        },
        {
            "id": "gxh1x1u",
            "score": 3,
            "text": "Helped him start his own company after he got fired.  Hes a millionaire now and he has a good amount of employees and a big ass house.",
            "title_similarity": "0.52192664",
            "sentiment_compound": -0.6369
        },
        {
            "id": "gxh2f46",
            "score": 14,
            "text": "I had been retrenched so was sitting on about $80k cash in the bank without a home as I’d planned on buying a new house in a couple of months but not there yet. \n\nWent to an auction with a friend (known her for about 15years at the time, pushing 25 years now) for her to buy her house. A guy was bidding against her and when it got down to just the two of them he started yelling at her to stop trying to steal his house (the agent told us he had **no** connection to the house, he was as a developer and it was a lady selling it to move into a nursing home)\n\nShe was tapped out at about $800k, and this guy was **PISSED**. She would have paid more but didn’t have the money, I knew her parents would just write me a check so I looked at her any went “the $80k is yours if you need it - worst case, that prick gives the old lady an extra $80 grand”\n\nShe bid $80k more, lost the house, but made the developer end up giving the old lady $890k for the house. \n\nNot really strange, but damn sure there are few people I’d just hand $80 grand to without a second thought. \n\nTLDR: gave a friend access to $80,000 hoping to piss off a developer at an auction. Pissed off the developer without having to spend a sent and helped an old lady in the process.",
            "title_similarity": "0.67645395",
            "sentiment_compound": -0.927
        },
        {
            "id": "gxh2h2i",
            "score": 124,
            "text": "I have a similar one, My best friend could not get over his ex gf and it was getting weird day by day. The girl was very rude and seriously did not deserve my best friend. She cheated on him and I saw it coming, I warned my buddy about it beforehand but he did not believe me, until it happened and they broke up. This girl got mad at my bro for breaking up with her and did everything she could to make his life hell. \n\nEventually, she stopped but my friend just could not get over her. After almost 2 years of their breakup, they girl suddenly wanted to go out with him again and asked him for a date, I knew he was stupid enough to say yes to her and he did, little did I know that she thought I was hot, so I asked her out to a different place and same time, not surprisingly she said yes but did not tell my bud about it, only a short text saying she can't come. I deleted the text from his phone before he saw it and never met her after. He went to the place they were supposed to meet but after an hour of waiting he came back home, he thought she was playing with his feelings and was very disappointed, and to this date he ***HATES*** her.",
            "title_similarity": "0.79742867",
            "sentiment_compound": -0.9741
        },
        {
            "id": "gxh2xyd",
            "score": 1,
            "text": "I knew he had a crush on the girl I had a crush on so I never made a move, and now they’re fuck buddies or something? Lmao bruh",
            "title_similarity": "0.7131607",
            "sentiment_compound": -0.2023
        },
        {
            "id": "gxh2yln",
            "score": 6,
            "text": "One of my best friends couldn’t get over his ex and had terrible self image. I told him to grow a beard and get tinder. He got tinder but no beard and no matches. So I photoshopped some photos of him putting a beard on him and took over his Tinder account. Suddenly he started getting loads of matches. I gave him access to his profile again about 2 weeks later with great girls and great opening conversation lines. He has grown a beard since, sharpened up his self image A LOT and has a few matches he really likes a lot who like him back. \n\nHe hasn’t spoken about his ex since",
            "title_similarity": "0.83452916",
            "sentiment_compound": 0.9564
        },
        {
            "id": "gxh33xn",
            "score": 7,
            "text": "My friend was starting a new relationship and was happy for him because he just ended a super toxic relationship 3 months ago. \n\nAnyway he calls me randomly one day and asks me if I do rough sex with my gf. Why? Why are you asking that lmao. \n\nTurns out his new gf told him she likes it very rough, she wanted him to choke her, etc. but he never did it before and wasnt sure what to do or how to do it. He really didnt want to screw things up.\n\nSo I had to explain to him over the phone how to set boundaries so the rough sex is still good sex for both of them, and what things he can try. \n\nHe thanked me 2 weeks later, and he is still with her after 1 year so im glad I helped him at the start of their relationship with sexual advice lmao",
            "title_similarity": "0.8173566",
            "sentiment_compound": 0.9742
        },
        {
            "id": "gxh3q9d",
            "score": 334,
            "text": "Met a friend from an online FPS shooter game back in 2012, and became good friends since then. \n\nKnew something was off about him, because his voice sounded so empty and cold at the time, since he was going through his lowest point of his life due to depression (takes one to know one) and nobody else took him seriously when he just needed someone to be there for him and listen. \n\nChecked up on him from time to time when we both were in similar boats for years, and fastforward a few years later, he's gotten his shit together and has his life pretty much sorted out \n\nNow that it's 2021, he has a stable office job that he's recently gotten, a girl that loves him, and a place of his own where he moved in with her. \n\nNothing but pure happiness for my man, and he still thanks me from time to time for the one time and tried to repay me back",
            "title_similarity": "0.7331489",
            "sentiment_compound": 0.3881
        },
        {
            "id": "gxh42ad",
            "score": 2,
            "text": "I'm always trying to make my friends succeed so I am all about this post",
            "title_similarity": "0.4157396",
            "sentiment_compound": 0.743
        },
        {
            "id": "gxh55rb",
            "score": 2,
            "text": "Ended our friendship. They're better off without me dragging them down.",
            "title_similarity": "0.35502276",
            "sentiment_compound": 0.7003
        },
        {
            "id": "gxh585x",
            "score": 1,
            "text": "I said I had dibs on a girl he liked, he felt rushed and having to be more daring, they're now happily married for several years, it will be 10 years that they are together. She's aware of the story and laughs it off, saying she's happy that he was the one that asked her out. Honestly, we were several people to help him spend some time with her.",
            "title_similarity": "0.6975042",
            "sentiment_compound": 0.9674
        },
        {
            "id": "gxh5ezt",
            "score": 8,
            "text": "A good friend of mine and I were eating lunch. A classmate came up and stole his glasses. Now in context, this was high school, and we had done the full 9 years together at a previous school. He had been bullied much of the time in elementary school. So while it didn't seem like a big thing by itself, the idea that we would escape to high school and have someone start this shit on him triggered me hardcore. I asked him to return them, then I demanded, then I picked up my lunch, which I'm pretty sure was peanut butter on ritz crackers, and crushed it directly into his hair. He just froze up and handed the glasses back, and that was the end of that.",
            "title_similarity": "0.79366267",
            "sentiment_compound": -0.4329
        },
        {
            "id": "gxh65jw",
            "score": 3,
            "text": "I gave my best buddy $350 for car repairs he needed before starting a new job.  He got the job that required a vehicle, fast forward 5+ years and he's moved up the food chain in the company and bought a newer car after a couple years working there.  Sometimes a little help is all it takes.  And, he still insists on buying my drinks when we hang out as a sign of gratitude, so it wasn't totally fruitless for me, either!",
            "title_similarity": "0.67353773",
            "sentiment_compound": 0.8806
        },
        {
            "id": "gxh6zwj",
            "score": 2,
            "text": "I kept telling him he was fat and that he would die young if he didn't lose weight.\n\nHe has now lost over 40 pounds",
            "title_similarity": "0.6485694",
            "sentiment_compound": -0.6049
        },
        {
            "id": "gxh70of",
            "score": 1,
            "text": "date his girlfriend's friend. she ended up marrying him.",
            "title_similarity": "0.48287302",
            "sentiment_compound": 0.4939
        },
        {
            "id": "gxh7p7f",
            "score": 1,
            "text": "Did my friend Math test in elementary school. Almost 20y later and we still remember that 😂",
            "title_similarity": "0.49018556",
            "sentiment_compound": 0.7269
        },
        {
            "id": "gxh7y8f",
            "score": 35,
            "text": "I invested in crypto for my best friend.\n\nMy best friend lended me some money when I did not have a job. As soon as I got a job, crypto was new at that time. I had to save part of my salary for 6 months to pay him back. Instead of keeping that saved money in a savings account I invested it in BTC and ETH. When the time came to pay him back I made twice on my investment. I gave all the original investment + profit to him so that he can build his house.",
            "title_similarity": "0.6586421",
            "sentiment_compound": 0.9756
        },
        {
            "id": "gxh86xl",
            "score": 1,
            "text": "His then girlfriend had just broken up with him. I told him to get on Skype so we could talk, I actually got him to play together. We had a nice time and in hindsight, just this little moment of not thinking about it and making it feel like every other day we played together helped him get through it",
            "title_similarity": "0.7265001",
            "sentiment_compound": 0.7184
        },
        {
            "id": "gxh88pf",
            "score": 1,
            "text": "I don't have any friends",
            "title_similarity": "0.12097243",
            "sentiment_compound": -0.3724
        },
        {
            "id": "gxh8rra",
            "score": 4,
            "text": "A kind-of friend at the gym was flat broke, no work experience other than picking fruit and no qualifications. One of the other dudes had set up a bouncing job at a night club for him but he couldn't taje it because he didn't have the $150 to get his security licence. I was making a bit less than $300 per week tending bar, managed to save a little so I loaned him the money. \n\nHe got licenced, got the job, got on his feet. Never did pay me back - we never talked about it again - but I always figured it wasn't much of a thing to do to make such a huge positive impact on someone who would otherwise be running scams just to get by.",
            "title_similarity": "0.64137566",
            "sentiment_compound": 0.8536
        },
        {
            "id": "gxhb0xb",
            "score": 1,
            "text": "My best friend in grade 12.. fell and broke elbow and wrist on opposing arms.. we were both really close and id take him the homework and like chill with him at his house. We were talking about something random like anime and he deadass asks me if i spanked it to cartoons..I admitted that l might have dabbled. Long story, short; he explained that his need exceeded his shame (and apparently his heterosexuality) and wanted me to mechanically agitate his penis to completion (with the stipulation that l never reveal nor make eye contact during the act)..\n\nEdit: sorry - yeah i jerked him off and made no eye contact. It was not erotic in the least.. and l am gayyyyy.",
            "title_similarity": "0.7674157",
            "sentiment_compound": 0.9022
        },
        {
            "id": "gxhb5kx",
            "score": 1,
            "text": "So this isn't too weird I think, but my best friend had an abusive relationship girlfriend and I kept warning him she was trouble, he did finally break her,  but she mentally screwed him up, to the point where he couldn't walk past her house. So what I would do was when we were on walks, I would walk past her house and be is this ok to walk this way, if he said no I'd leave it and go another route, and if he said yes that fine, I would walk past and let him tell me story's of the stuff that happened there good and bad, it got to the point where we would just walk past her house no issue and he's always been thankful for me doing that and I'm happy I did it for him, he's in a pretty good place now and has a really good girlfriend currently who's is awesome",
            "title_similarity": "0.7716801",
            "sentiment_compound": 0.9809
        },
        {
            "id": "gxhba15",
            "score": 2,
            "text": "I had a friend who was stuck in a very rock and a hard place situation. They were living with their sister and mother at the time. They were bringing in money, but unfortunately, the sister moved out leaving a bigger share of the bills to pay which left it a little tight. A month or so later it also turned out that the bills that were supposed to be paid, weren't. Her mum had just not bothered. To top it all off, her mums new boyfriend was moving in who she wasn't a fan of.\n\nWe talked about her getting out like her sister, but she couldn't move out because of the bills being in the way.\n\nI did the only thing I could do, being that i lived a continent away. I talked to some people we both knew, gave her all the money to pay off the bills, and me and a couple of friends arranged that week for them to drive states away to go pick up her and all her things and bring them back to their place for however long she wanted.\n\nTo this day, I don't regret helping her out despite how much of a ballocking I got from my girlfriend for the money I gave. I'd do it again in a heartbeat. She got back up on her feet and is now a house owner. I couldn't be happier for her and what my friends did for her. We don't speak nearly as much any more, but it's okay! I know she's doing great!",
            "title_similarity": "0.6688595",
            "sentiment_compound": 0.9481
        },
        {
            "id": "gxhbaz3",
            "score": 2,
            "text": "Help a friend understand the importance of time sheets and billing hours. His response to me filling them out was, \"what are you, a boy scout?\"",
            "title_similarity": "0.5468078",
            "sentiment_compound": 0.8126
        },
        {
            "id": "gxhbdz8",
            "score": 20,
            "text": "I stopped being their friend. We had an argument and I was a dick, but when it came to it I apologized and told them I wanted to be friends still but I'd respect it that wasn't how they were feeling. They told me they weren't Interested after what happened and I stepped away.\n\nI sometimes check their social media and they are doing great. So am I, and I think cutting off that friendship was for the best.\n\nSometimes stepping away from someone is the best you can do for them.",
            "title_similarity": "0.6805422",
            "sentiment_compound": 0.9851
        },
        {
            "id": "gxhbxo7",
            "score": 5,
            "text": "I don't think I've ever made that big gestures to my friends. I'm always there for them but in more of a little and constant way.\n\nOne day though my best friend, who was living in Japan at the time, said to me things were so bad for him that he thought of killing himself. Completely out of the blue. It was like 4 am here and I was in my bed, minutes away from falling asleep, but that text shocked me so much that I instantly felt more awake than ever. I talked to him for hours to make him come back to reason. I felt powerless and useless because I couldn't go to his side. I would have took the first plane available if I had the money. Luckily he never did anything harmful to himself.",
            "title_similarity": "0.7720027",
            "sentiment_compound": -0.7459
        },
        {
            "id": "gxhc64w",
            "score": 1,
            "text": "You’re a fucking legend for doing that lmaoo.",
            "title_similarity": "0.49691018",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxhcuvt",
            "score": 1,
            "text": "Had a friend who rings me up at 4.30 am he is in his apartment room with 2 eastern european hookers who brought cocaine with them which he had already consumed - the complete imbecile called them but did not have any money - so he rings me panicking i send him like £500 via bank transfer and he pays me back the week after.\n\nDont sound like much but these hookers allegedly had guys outside in a car who were armed to the teeth (usually are in the hooker / coke business)  - Also allowed me and the rest of the boys to literally intervene and pull him out of the mess he was in.",
            "title_similarity": "0.7949449",
            "sentiment_compound": -0.759
        },
        {
            "id": "gxhdq6b",
            "score": 1,
            "text": "Being stubborn. My best friend is 44 years old and INSANELY picky with food. so I told him how incredibly rude it was, when My gf had made something he had never tasted before but It looked weird so he refused. So I told him what about this : Try a No thank you bite(meaning take a  bite, if you like it continue if you dont say : It wasnt for me). Now hes trying more things and he is all like: I like this.\n\n&#x200B;\n\nI just cant stand it when people say something is bad without trying(Food wise)",
            "title_similarity": "0.7258389",
            "sentiment_compound": -0.6767
        },
        {
            "id": "gxheeu3",
            "score": 2,
            "text": "My best friend used to get super nervous before performances, (he was a singer) and he ALWAYS had to vomit in order to loosen up before going out to perform; not sure why, even til this day. I used to kind of be his hype man and morale booster, and one of the things I would have to do at times is give him a bit of a punch in the gut in order to get the process going so he could go perform. “Yeah bro, you got this! You’re gonna kill it out there! Need me to punch you real quick?”",
            "title_similarity": "0.81217474",
            "sentiment_compound": 0.6276
        },
        {
            "id": "gxhek7h",
            "score": 1,
            "text": "My ex best friend was throwing a pizza party to celebrate his new outdoor pizza oven. He asked me to come help prep the food, we decided we would make the sauce from scratch.\n\nJust as we get back to his house from the market he gets a call, his mum has had a bad fall, I tell him to go to her and deal with this.\n\nWhile he's gone I start prepping, painstakingly flash boiling tomatoes and putting them in an ice bath, so I can peel them easier.\n\nCouple of mutual friends stop by to drop booze off for the party and ask why I'm going to such great lengths to peel the tomatoes, to which I tell them our friend/host is severely allergic to tomato skin. They scoff at this \"made up\" fact and go on their way\n\nLater my friend returns (his mum was fine) everything is ready, I go home to shower and change and when I get back the party is in full flow, he pulls me to one side and thanks me for all my help and for especially peeling the tomatoes. Our mutual friends give some half ass apology",
            "title_similarity": "0.69490236",
            "sentiment_compound": 0.9846
        },
        {
            "id": "gxher3b",
            "score": 2,
            "text": "I have a buddy and we go all the way back to middle school home town type deal. We’ve been through each other’s absolute lows but this one night after a really failed party was the worst\n\nThe girl he was dating at the time snuck off to hook up with another buddy of ours and then disappeared for awhile. I had to get a drunk guy home so I dragged his ass along with me and after drunk guy was home he started to go into the usual depression rant of anger at every thing from himself to society as a whole\n\nHe started crying to a bohemian level and I could take it, we pulled into an old abandoned store parking lot and I threw his ass out to cry it out. I waited by my car for him to cry it out but after awhile the anger and the booze made him convinced it was my fault he started trying to take a swing at me. It wasn’t a fair fight and I wasn’t about to beat my best friend at one of his lowest moments. But I had to get him to snap out of it. So I grabbed his arm and proceeded to snap him hard enough to spin him. He quickly started to realize he was in the wrong and started to apologize and pull himself together \n\nHe got over her super quick and thanks me for not letting him keep spiraling that night",
            "title_similarity": "0.80071324",
            "sentiment_compound": -0.9945
        },
        {
            "id": "gxheuu6",
            "score": 2,
            "text": "Not something i did but what a friend did to me.\nDad died in lungcancer, spent alot of time at the hospital and then alot of time after he died alone, never saw my friends for weeks.\nFinally it was time to meet up some people so went out to a pub with 6 friends.\nNo one really aaid or asked anything about my dad which was kinda weird, youd think they would at least aknowledge it.\nAll of a sudden one of my friens in the corner of the table starts laughing hystericly, laughs and laughs and the dudes around the table are like \"wtf is wrong with you\"?\n\nHe then starts an explenation of how fun its is to imagine my dad floating around the stars just having the time of his life.\n\nIt didnt make much sense but it really did help me, cuz after that everybody started talking about my dad and it was the icebreaker i needed.\nIt was a weird but really nice thing to do, thank you Henke.",
            "title_similarity": "0.7071709",
            "sentiment_compound": 0.8993
        },
        {
            "id": "gxhf72u",
            "score": 1,
            "text": "I've given motivational speeches to bullied depressed kids but I don't know what happened to them as they moved schools. I hope to think that I have them some strength to keep going.",
            "title_similarity": "0.68060625",
            "sentiment_compound": 0.6652
        },
        {
            "id": "gxhfcta",
            "score": 1,
            "text": "Pretended the absolute log that clogged his parents toilet was mine. He would be kicked out",
            "title_similarity": "0.6810137",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxhfin4",
            "score": 2,
            "text": "That stupid grin on his face may have been the silent knowing of just how much dried white stuff was on the pic you just ate.",
            "title_similarity": "0.5746697",
            "sentiment_compound": -0.0772
        },
        {
            "id": "gxhfp1x",
            "score": 1,
            "text": "My story is the other way around... About 11 years back, I lost a big amount in stock market options trading and was scared to ask parents for help to pay the loss, the amount was about my 1 year salary.\nI turned to my best friend and he gave me the amount from his savings.\n\nI paid him back a few months down the line just before moving to a different country. I sold off some assets and paid him so he didn't have to worry.",
            "title_similarity": "0.6682175",
            "sentiment_compound": 0.7435
        },
        {
            "id": "gxhgeln",
            "score": 81,
            "text": "This is kinda the reverse of what op asked for but its a good story. On the receiving end of being helped so I think it belongs. Its long and sad so beware. \n\nA few years ago, I was suffering from severe depression. This had been going on since high school going on to college. I was over it. Every day was just a little bit worse and I couldn't have a solitary thought without digging myself into a figurative pit of dirt. I literally felt like I was watching tv with headphones that muffed away people voices and sounds. The tv was playing my life and I had no part in it. Terrible, terrible time in my life and I was over it.\n\nI started making plans and putting everything together for the end and I was making sure everything would go as smoothly as possible after I die. Accounts, money, everything of importance written down and ready to be found. I planned the uneasy stuff and how I would go and I was ready to go and no one had any idea. I was done after a few months of planning and kinda relieved so I went out drinking with two of my friends, just one last time. I love them and we have some crazy memories. \n\nWell we were all pretty drunk and they were getting ready to go home and I hugged them both and told them goodbye and that I loved them and yada yada. And well shit, one of them gave me this look like, \"You're never this feely willy, and you're not that hammered, what are you getting at?\". Then they jumped on me and questioned me about my hiking trip and why they weren't invited. Well these assholes wouldnt let it go so I told them everything and I didnt expect much of a reaction. For me, this was one of those moments in life where your mind just clicks and boom, they were crying and telling me that they loved me and they didnt want to see me go. I was so shocked honestly. It woke me up I cried till my eyes started burning. \n\nIt was insane for me. Its not strange for people to tell you that they love you but when my friends said it like that, they cut through the clouds and gave me a bit of blood back in my body and that was enough to get my engine going and to seek professional help. They also watched over me like hawks after that lol. Every weekend I was with them. Almost like I was grounded but with friends, really fun actually. They took care of me. \n\nI felt like I was drowning everyday but these beautiful people lifted up my head enough for me to breath. My life is absolutely amazing and I am a survivor. They are my forever heroes and I appreciate the words and emotions they showed me that day, always.",
            "title_similarity": "0.7458308",
            "sentiment_compound": 0.9952
        },
        {
            "id": "gxhgii3",
            "score": 14,
            "text": "In our late teens / maybe early 20s one of my friends wanted to quit smoking. He was doing well except for nights out. 2 beers in and he would spark up. \n\nSo me and a few fews started hitting him in the nuts (not too hard) every time we saw him with one. \n\n2 weeks in he exploded at us and told us all to f off. We didn't. \n\n1 month later he had quit for good. \n\n\nYou're welcome Chris.",
            "title_similarity": "0.79510146",
            "sentiment_compound": 0.8749
        },
        {
            "id": "gxhgmo2",
            "score": 2,
            "text": "I have known this guy for 13 years. We play games online together, though I've never met him in person. I worked with his roommate for a couple years, which is how we met online. Well, about a year ago, he had a power surge at his place and it fried his computer. He was out of commission for a couple weeks. I reached out to him, asking about the parts he could salvage and what his budget was to replace the fried components. His budget was miniscule and he was looking at really cheap and outdated stuff just to be able to get back online. I went on Amazon and shipped a $450 CPU to him. Told him to take his budget and buy better stuff, ill take care of the most expensive part (his GPU was unharmed). Never asked for anything in return. \n\nHe was there for me a long time ago during a difficult break up. This was just me paying him back.",
            "title_similarity": "0.6872055",
            "sentiment_compound": 0.7506
        },
        {
            "id": "gxhgpue",
            "score": 2,
            "text": "Holy shit similar story, I ate my mates lit cigarette. It was hot and tasted like shit but he quit smoking soon after.",
            "title_similarity": "0.6747721",
            "sentiment_compound": -0.431
        },
        {
            "id": "gxhgryo",
            "score": 9,
            "text": "My best friend escaped from a psychiatric facility after I made a quick visit. I was standing outside with his father and my dad (also best friends). Saw a silhouette out of the corner of my eye and his dad says \"there goes 'Sam'\"...\n\nI took off and chased him for about a half mile along a busy highway before tackling him. I held him down while the orderlies caught up, the whole time he was crying and telling me they were trying to kill him. I could tell he was legit scared to death, but I knew it was all in his head. \n\nHe was in there for a couple of months while getting treatment. He struggled for several more years, but eventually they got his meds regulated and he became willing to take them. His life has improved dramatically over the last decade and we still keep in touch, just live 1000 miles apart.",
            "title_similarity": "0.8115791",
            "sentiment_compound": 0.2732
        },
        {
            "id": "gxhhadi",
            "score": 2,
            "text": "Forcefully dragged his chronically depressed ass on a trip with me to Switzerland \n\nHe never traveled prior to that trip and he started traveling more often and it helped him so much develop his personality and confidence",
            "title_similarity": "0.6677182",
            "sentiment_compound": -0.5719
        },
        {
            "id": "gxhhfcx",
            "score": 20,
            "text": "My friend was so nervous talking to professionals in college during career day. He would straight up start sweating profusely and couldn’t string a sentence. Worried he would miss out on a potential internship/job, I took his folder of resumes and pretended to be him. He ended up getting interviewed and eventually a job from it",
            "title_similarity": "0.75724477",
            "sentiment_compound": 0.0534
        },
        {
            "id": "gxhi57h",
            "score": 2,
            "text": "My best mate absolutely ruined one of his past relationships but blamed her entirely. Every time he brought it up in front of people I reminded him that he was the one who fucked it up and then would avoid the subject altogether. He wouldn’t even defend himself on it because we both knew I was right and he was straight up lying.\n\nBy me doing this he eventually saw that he was avoiding the fact that he was the problem and if he didn’t change the cycle would repeat itself. \n\nHe’s doing much better now, a lot Healthier in mind and body. It didn’t feel good constantly calling my mate out in his bullshit but it worked out better for him in the end.",
            "title_similarity": "0.77390164",
            "sentiment_compound": -0.9531
        },
        {
            "id": "gxhiskj",
            "score": 1,
            "text": "reach around.",
            "title_similarity": "-0.19515279",
            "sentiment_compound": 0.0258
        },
        {
            "id": "gxhivb3",
            "score": 1,
            "text": "I did similar to a friend of mine when I was drunk, took the photo of her ex and held a ceremony casting him out of her life and then burnt the photo",
            "title_similarity": "0.73414767",
            "sentiment_compound": 0.2023
        },
        {
            "id": "gxhjebk",
            "score": 18,
            "text": "I set him up with a stripper I used to buy dances from. She was a gem, and we ended up going to a lot of the same parties. He was an introvert tech nerd who needed some fun. She was a party girl who still mostly had her life together.\n\nThey now have two kids and live in suburbia.",
            "title_similarity": "0.6339913",
            "sentiment_compound": 0.7579
        },
        {
            "id": "gxhkfvg",
            "score": 1,
            "text": "I gently and precisely slathered tanning mousse onto his freshly shaved head. He was trying to cover up the fact that his crown was bald and as a consequence his head had two hues.  \nIt was a fight, you see. He is incredibly insecure and I genuinely tried to do a good job. But when he came back and asked me to ‘get closer to the line’, I had to draw the line.  \nI love that dude but I didn’t dare be responsible for wrecking his dome, so I declined and suggested he try using a mirror to touch it up himself.  \n  \nThis actually happened recently. I’m a bit older than him and though I’m used to the younger crowd (in college), I forgot how incredibly insecure people can be. Especially young people.  \nHe’s a good dude and I understand the frustrations of losing one’s hair. Mine is really thin and so very meh. But for the life of me, I can’t convince him to just fake it till he makes it.  \nHe just wants to stress and it drives me fucking bonkers. lol",
            "title_similarity": "0.6803212",
            "sentiment_compound": -0.5228
        },
        {
            "id": "gxhklyw",
            "score": 1,
            "text": "One of my best friends came out in high school. There was this girl that didn’t get the message and she stalked him for about 2-3 months. One day i was hanging out at his place playing some double dash when the girl showed up. He tried explaining that he was gay. So, I got up walked over and gave him a big kiss on the lips and asked, “what’s up babe?” It finally clicked in her head that he was gay. He thanked me and hooked me up with my wife a couple of years after high school.",
            "title_similarity": "0.8130481",
            "sentiment_compound": 0.93
        },
        {
            "id": "gxhlg2d",
            "score": 1,
            "text": "If you were my best friend, probably stop talking/ cutting all lines of communication.  That IS the best thing I could do to help in the long run (aware of my own toxicity).",
            "title_similarity": "0.53676236",
            "sentiment_compound": 0.9118
        },
        {
            "id": "gxhlkgk",
            "score": 1,
            "text": "Not a guy, but my guy friend helped me 6 hours, in the pouring rain before his shift to help me move. I couldn’t afford nor did I want to have random strangers help me. He did not complain at all one bit nor did he ask for anything. I never expected that kindness from a friend before.",
            "title_similarity": "0.5955429",
            "sentiment_compound": 0.9414
        },
        {
            "id": "gxhls23",
            "score": 2,
            "text": "Used to fatshame my obese friend, not he's fit as hell and thanks me whenever someone asks him how did you get so fit.  \n\n\nI'm not proud of it, but it helped him.",
            "title_similarity": "0.6608803",
            "sentiment_compound": 0.01
        },
        {
            "id": "gxhmka4",
            "score": 1,
            "text": "I talked my buddy into selling half his DOGE last night right before SNL started",
            "title_similarity": "0.61992705",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxhmpqm",
            "score": 2,
            "text": "I gave him a new life.",
            "title_similarity": "0.10654715",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxhn69e",
            "score": 1,
            "text": "Let them use my car and helped pay for a hotel for another friend who was short and told no so I paid the difference. I've had what I call a keeper friend get up at 2am and come bail me out of jail. If they are willing to do that then they are a true friend!!!",
            "title_similarity": "0.7135475",
            "sentiment_compound": 0.8928
        },
        {
            "id": "gxhp8h6",
            "score": 7,
            "text": "I paid for a summer semester of by best friend’s tuition and didn’t tell him. He was going to drop out because his financial aid didn’t come through and I couldn’t let that happen. It wiped out my savings, but he graduated and studied abroad the next semester in Korea. Met his now wife and I have a godson now, so it was totally worth it.",
            "title_similarity": "0.6308942",
            "sentiment_compound": 0.5913
        },
        {
            "id": "gxhp9at",
            "score": 1,
            "text": "The OP is 100% what you need as a friend, well done!!",
            "title_similarity": "0.38346177",
            "sentiment_compound": 0.7081
        },
        {
            "id": "gxhpku2",
            "score": 1,
            "text": "I helped my buddys girlfriend wax his ridiculously hairy ass, whole thing, including the b hole. She couldn’t yank em off so I was called in. There was blood, there were tears, but I ended up okay in the end.",
            "title_similarity": "0.7531559",
            "sentiment_compound": -0.2617
        },
        {
            "id": "gxhpqc5",
            "score": 1,
            "text": "My first roommate, a few years after we'd moved on remained in contact, were friendly. He called me up needed about 600 bucks to cover rent a d be was broke. Bone dry.\n\nI didn't have a ton, but enough to hand him the money without expectations. We eventually lost contact. I hope he's doing well these days.",
            "title_similarity": "0.6324981",
            "sentiment_compound": 0.7876
        },
        {
            "id": "gxhprl2",
            "score": 1,
            "text": "mate/buddie was down and out on the other side of the world so I got an uber eats delivery of his favourite dish delivered to his door",
            "title_similarity": "0.57699597",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxhpxmy",
            "score": 1,
            "text": "I caught up with a friend I hadn’t seen for nearly 12 months when we were about 19. “Sorry I’m late I’ve just been for a smear test”....she admitted to never having one and I encouraged her to get one. Lucky-  she was found to have stage 2 cervical cancer. It was successfully treated and she is now in her mid fifties with two lovely daughters. She told me later she would never gone for the test if I didn’t prompt her at the time.",
            "title_similarity": "0.6606754",
            "sentiment_compound": 0.8402
        },
        {
            "id": "gxhqynp",
            "score": 5,
            "text": "I setup my FWBs that ive known for 2 years, with a guy she was telling me she really liked. I helped wing man her into landing a date and theyve been together since. \n\nShes an awesome person, but we were just 2 different people for a relationship to ever work. As long as shes happy now, thats what counts.",
            "title_similarity": "0.7089512",
            "sentiment_compound": 0.864
        },
        {
            "id": "gxhrmzj",
            "score": 2,
            "text": "When I was a teenager I had a friend who was gay, I always knew he was but he always denied it and was uncomfortable with any physical affection, hugs or anything to do with being gay.\n\nAs time went on he began opening up to me and when we were together he started hugging me more and putting his arm around me 'as a joke' when we were together and essentially just being very intimate with me in a non sexual way, more so than two teenage boys tend to be anyway and I just rolled with it because I wanted him to feel comfortable being himself and so he would know that it's okay to be himself. Eventually he came out as gay and said that it helped a lot with accepting himself and that more emotional side of hi self and I was happy to hear it",
            "title_similarity": "0.678586",
            "sentiment_compound": 0.9815
        },
        {
            "id": "gxhrx9k",
            "score": 1,
            "text": "when your bro is caught up over a girl sometimes you gotta be a hard ass.",
            "title_similarity": "0.5808313",
            "sentiment_compound": -0.5994
        },
        {
            "id": "gxhsx1x",
            "score": 2,
            "text": "\"Hey mom, can DJ stay the night?\" \n\nNot at all \"strange\" but sad. Best friend's mom was an abusive alcoholic, he stayed many many many nights over at my place when we were kids. Were almost in our 30s now and I often think he wouldn't be here if it wasn't for those times he was at my house.",
            "title_similarity": "0.6928934",
            "sentiment_compound": -0.5932
        },
        {
            "id": "gxht34e",
            "score": 1,
            "text": "Gave him all of my old DMT jars.   He was able to extract them for a long time afterwards and used it to get clean from a crippling alcohol and cocaine addiction.   He also went vegan.  Has been clean and sober (besides weed) also vegan for over 5 years now.",
            "title_similarity": "0.6256933",
            "sentiment_compound": 0.6597
        },
        {
            "id": "gxhti60",
            "score": 1,
            "text": "I had friends that were really bad with money when we're were in our 20's. They gave me their credit cards for about 6 months so they could get their debt under control. 25 years later they're better, but sometimes they still need talking off the ledge,lol.",
            "title_similarity": "0.6851523",
            "sentiment_compound": 0.1664
        },
        {
            "id": "gxhubmg",
            "score": 1,
            "text": "I bought my son some running shoes and a garmin watch.",
            "title_similarity": "0.49029487",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxhucuo",
            "score": 1,
            "text": "Bought them a smart thermostat. They have saved hundreds.",
            "title_similarity": "0.38422468",
            "sentiment_compound": 0.6705
        },
        {
            "id": "gxhufof",
            "score": 2,
            "text": "This is not me but my friends. I graduated with a master's degree in 2015. In September 2016 I got into a serious motorcycle accident/helicoptered to the hospital/in the ICU with a breathing tube and feeding tube attached to me. \n\nEvery single one of my classmates from my grad school program (there were about 13/15 of us) came to see me. I couldn't speak with anyone and wasn't even cognizant. One of the classmates just sat there and spoke to me for a long time. She said that at one point I smiled, and that made it all worth it. Even better? She was in Florida and she flew to Texas to visit me at the hospital. I graduated undergrad in 2014 and one of my friends from undergrad was in the same school as she was. She also flew out to come see me in the hospital with her boyfriend who was also in the same undergrad school. \n\nIt is now 2021 but when I look at the picture they took of all of them sitting together when they came to visit me in the hospital, it reminds me of just how much I truly love every single one of them who came to see me and support me. There is literally nothing in the world that I could give to them to express my gratitude.",
            "title_similarity": "0.6769352",
            "sentiment_compound": 0.9902
        },
        {
            "id": "gxhur3k",
            "score": 4,
            "text": "My friend worked several different jobs trying to find his niche. He got a job with a moving company, and all seemed to be going well. He got sent to a job in Morgantown, WV, excited to go after how much I talked about the place and WVU, he planned on going sightseeing during his downtime. Day 2 of him being there, I get a phone call at 2:30AM. \"My coworkers are fucking horrible people and I can't be here anymore.\"\nI loaded up into my truck, and drove 3 and a half hours to get him. Picked him up at sunrise, we hit the highlights of MoTown and headed home. He ended up getting a much better job making a lot more money a few days later.",
            "title_similarity": "0.7710116",
            "sentiment_compound": 0.701
        },
        {
            "id": "gxhv68s",
            "score": 1,
            "text": "My friend robbed a college vending machine company and at 5 am we had to go clean all the candy out of his house before the warrant got served after his arrest. We looked like 3rd world Santa clause running across town with huge bags full of candy on our backs.",
            "title_similarity": "0.66587114",
            "sentiment_compound": 0.7964
        },
        {
            "id": "gxhvcu2",
            "score": 1,
            "text": "Started grinding on her creepy rapey ex at a party. I’m a foot taller and about 120 lbs heavier.",
            "title_similarity": "0.6562804",
            "sentiment_compound": 0.4019
        },
        {
            "id": "gxhw3u4",
            "score": 4,
            "text": "Okay, firstly I am stupidly excited to be able to do this. Second, after reading some of the other posts, I realize it doesn't seem quite as impactful. So, ya know, give me a bit of grace.\n\nTLDR: I helped him figure out how to fit his dingus in his pants.\n\nLong version:\nI met my best friend a couple of years ago through a mutual friend. I was asked to run a game of Shadowrun for a group. (I was the Dungeon/Game master for a game in the same vein of Dungeons and Dragons). We bonded over our love of the setting and shared social and mental issues (mostly anxiety). My friend badgered me at a time in my life when I had all but given up on being anything other than alone after my divorce. My friend helped me find the strength to climb out of the hole.\n\nThis is to give background. I've got two kidneys I'd give 'em if they needed it. \n\nSo when a few months ago (around Thanksgiving I think) they asked me a heavy question, I waded in to the neck deep troubles without a second thought. See, Kayla (not their real name at the time) asked me what I would say/think if she wasn't her. Turns out Kayla had long been suppressing their own dysmorphia (disphoria? I'm not the best ally at times. Kinda dumb on this stuff) for decades. I was the second person they told. The first had been their husband.\n\nSo, Caleb (also not his real name) became my brother instead of my sister. I've been blessed with the opportunity to walk some parts of his journey with him, to offer him guidance and advice as some one who wants to be a *man* and not just male. His former husband has been supportive, though they are seperated and pursuing divorce. Caleb's mother was a right c*nd about it. His dad is okay-ish.\n\nCaleb is also active duty military. Which has been, surprisingly, very good for him. All of this rambling is to help build to the week (like, two weeks ago) when he came and stayed with me to get some away time and hangout with the social group (Caleb and his former husband/roommate live in another statw). He got his first packet while he was here.\n\nPacker is a fake dong.\n\nWe had a two hour conversation, complete with drawings, where we tried to help him figure out how to get it to sit right. Turns out, he had gotten the sexy toy style packers. They're hollow and designed to be held on by an actual knob rod. So, I looked up fake wangs on my personal laptop. Found reelmagik. Wonderful site. They make specialized packers. Standard, sit in your pants meat snakes. Bendable, giver her pleasure man slammers. Even let you pee like you were born with a pink fire hose ones. Two hours talking about dicks so he could have the best dishwasher safe penis he could want.\n\nAnd i'd do it again. My best friend deserves all the help I can give so that his pants stuffing yogurt spitter looks good.",
            "title_similarity": "0.7111305",
            "sentiment_compound": 0.9978
        },
        {
            "id": "gxhw7dd",
            "score": 2,
            "text": "I basically told my best friend of the time to not answer any more calls of his clingy gf who was distracting him from his studies,  and she was hopeless and an emotional burden. He for some reason heeded my advice and stopped taking her calls during exam season. \n\nShe realised this was my doing and came to my house, cried, created a scene and demanded I call him and tell him to speak to her... well i didn't and the drama lasted a few days and she hounded me everyday and night over phone and text and in person. \n\nI basically went thru all that while He finished his exams and then 3 days later he called her and told her its over. The aftermath was worse and I won't go into details but it was drama kver 2-3 months.\n\nIn a post graduate course few months after graduation,  he met a nice girl and they've a kid now and been married over a decade.  \n\nSometime 5 years ago, he said didnt want to talk to me anymore as he was in a \"better place and had progressed in career much farther\" than Me and our group of friends from college.  Haven't spoken since.",
            "title_similarity": "0.76696956",
            "sentiment_compound": 0.8784
        },
        {
            "id": "gxhwrh1",
            "score": 1,
            "text": "I called the police on my friend so that they could confiscate his drugs and save him from himself.",
            "title_similarity": "0.657104",
            "sentiment_compound": 0.7506
        },
        {
            "id": "gxhwtvj",
            "score": 1,
            "text": "my friend borrowed 400 bucks for his training since he wasn't getting paid.  after that, that's when his career as DOP started.  he never paid me back nor did i ask him for the money.\n\nwell, i assume, that that's where everything started for him.",
            "title_similarity": "0.6736761",
            "sentiment_compound": 0.6486
        },
        {
            "id": "gxhx3nb",
            "score": 1,
            "text": "Not me but glad i saw It happen.\n\nA Few years back when I was working in a Malaysian cafe that was famous for their cheesecakes and  food. \n\nGreat coworkers and boss there, everyone was really supportive and making an effort to help.\n\nSo a new guy came in asking to be a barista and he worked with us for quite sometime, always showing interest to learn more about culinary arts and cooking. \n\nSo the chefs of the cafe decided to let him be with the kitchen crew, with my ex-boss’ approval. 5 years on and he is now fighting for more Michelin stars in Italy.",
            "title_similarity": "0.63465893",
            "sentiment_compound": 0.9444
        },
        {
            "id": "gxhxc05",
            "score": 4,
            "text": "I turned an overweight friend on to Topo Chico, citing that it curbed my casual beer drinking at the house and led to me changing my entire diet and losing a ton of weight. \n\nHe too stopped drinking beer at home and started drinking Topo Chico. This led to him dropping 15 lbs the first month, which gave him all of the motivation to improve the way he ate and to start exercising. It has been 3 months and he is down 40 lbs and still dropping.",
            "title_similarity": "0.74882877",
            "sentiment_compound": 0.5106
        },
        {
            "id": "gxhxjmm",
            "score": 2,
            "text": "My best friend suffers from schizophrenia and was going through some real tough issues. A large group of us all hung out in a friends garage and played music and smoked weed. One day I was the first person there, or so I thought. The garage door was never locked, but it was this time. I walked around the back and looked through the window and seen my friend hanging from the beam by two electrical cords. He was struggling and kicking his legs so I  kicked the window in and climbed in. I hugged his legs and lifted him up enough for him to get air. I stood there for the longest 17 minutes of my life holding him up and screaming for someone to help. Finally his brother showed up and cut the cords. I sat in the garage with him for 4 hours after balling our eyes out and convincing him that we were all there for him. I'm not going to say he's better, but after almost 20 years of treatment and multiple hospital stays he has a wife, 2 great kids. I haven't thought about this in so long that I'm over here crying again remembering that night",
            "title_similarity": "0.67004323",
            "sentiment_compound": 0.9493
        },
        {
            "id": "gxhxvpm",
            "score": 2,
            "text": "Mac.... is that you? Was it a picture of the waitress?",
            "title_similarity": "0.29322857",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxhzsgj",
            "score": 1,
            "text": "When i was 16 my best friend was struggling to know if he was really gay. Let just say he found out he was a happy bot and i got free bj for 3 years and i found out im bi curious",
            "title_similarity": "0.6888145",
            "sentiment_compound": 0.9313
        },
        {
            "id": "gxi02bx",
            "score": 3,
            "text": "Some really cool stories here but even more some amazing people.",
            "title_similarity": "0.27465737",
            "sentiment_compound": 0.8133
        },
        {
            "id": "gxi07y0",
            "score": 1,
            "text": "Told them to buy AMC stock... now they have money. 💰 🤑🤑👋",
            "title_similarity": "0.38376445",
            "sentiment_compound": 0.4939
        },
        {
            "id": "gxi0g1z",
            "score": 7,
            "text": "When I was in boot camp I would stand watch near the bathroom on the lookout for Drill Instructors while my buddy would take a 15-20 minute nap on the toilet. \n\nIt was strangely necessary and effective.",
            "title_similarity": "0.5978874",
            "sentiment_compound": 0.2263
        },
        {
            "id": "gxi10u4",
            "score": 2,
            "text": "After my best friend’s ex left him for a troll, I took him axe throwing and asked if we could pin a picture of her to the target and they agreed. My man split her face right down the middle and has been doing fantastically without that leech in his life",
            "title_similarity": "0.7840441",
            "sentiment_compound": 0.7096
        },
        {
            "id": "gxi1a78",
            "score": 1,
            "text": "Bought them a boat oar",
            "title_similarity": "0.23669262",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxi1zwt",
            "score": 2,
            "text": "Told him his wife was awful. One year later, he found out she had been cheating (a lot) and they had a messy divorce. I'm the only person that was \"the enemy\" at the time. I'd say he listens a lot more to my advice now :)",
            "title_similarity": "0.7807731",
            "sentiment_compound": -0.8625
        },
        {
            "id": "gxi2d3m",
            "score": 1,
            "text": "Bent them over a desk",
            "title_similarity": "-0.056771968",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxi2oni",
            "score": 1,
            "text": "Doggedly encouraged him to quit his job so I can quit hearing him complain about it. He does much better for himself now",
            "title_similarity": "0.6424496",
            "sentiment_compound": 0.4404
        },
        {
            "id": "gxi2q2f",
            "score": 1,
            "text": "A long time friend had befriended  big time coke dealer.  As a result he had an endless supply of free blow and it was really screwing him up.  I dropped a dime on the dealer and two days later he was gone.",
            "title_similarity": "0.79932916",
            "sentiment_compound": 0.6494
        },
        {
            "id": "gxi2qzl",
            "score": 2,
            "text": "He called me crying (this guy does not cry). He was being blamed for missing money from a cash register at his work and the place was going to get police involved. I showed up and gave him enough cash to replace the money. We went back to my house and I noticed my PS4 and all accessories were gone... After searching a bit, well it was stolen. He came with me to the police station and we filed a report. Well a day or so later he was over hanging out... He confessed to stealing the money from work... And pawning off my PS4. I was pissed.... Really pissed, but I let it go on the condition I was paid back with some interest over the next few months. He was in really bad financial times, and I guess I just appreciated that he confessed. Still one of my best buds and nothing like that has happened since.",
            "title_similarity": "0.7528292",
            "sentiment_compound": -0.3013
        },
        {
            "id": "gxi2x56",
            "score": 1,
            "text": "My best friend was having a hard time getting over this girl that really fucked with his head in bad ways. He was telling this girl I was into a story about them and it was clear to me he wasnt over her.\n\nI was drunk and the urge to kiss him on the mouth came over me, so I did it mid story.\n\nHe stopped and yelled at me for fucking with him, but he lost his place in the story and couldnt pick it back up again. Over the next few weeks, his mental health was improving and he was taking care of himself more.\n\nI like to call that the kiss of mental health lol.",
            "title_similarity": "0.83265555",
            "sentiment_compound": 0.9522
        },
        {
            "id": "gxi3hb7",
            "score": 1,
            "text": "I fought a Canadian geese so he can get rid of the office trash last Friday. I won but I just know that I am fucked tomorrow when I see that geese again",
            "title_similarity": "0.6271007",
            "sentiment_compound": -0.7506
        },
        {
            "id": "gxi3kq0",
            "score": 6,
            "text": "My friend was getting a really bad coke habbit so I broke his nose so he couldn't snort coke anymore for awhile which made him drop his addiction on the long run.",
            "title_similarity": "0.7081356",
            "sentiment_compound": -0.6976
        },
        {
            "id": "gxi45nk",
            "score": 1,
            "text": "My best friend talked me out of killing myself by looking up the most disease ridden vagina and told me “If you go through with this, you will be thought of the worse pussy in the world” it’s been 12 years",
            "title_similarity": "0.7815535",
            "sentiment_compound": -0.0258
        },
        {
            "id": "gxi48y3",
            "score": 1,
            "text": "I have a close friend group of 4 people. We used to just play games together and nothing else. One day a few years ago i just started talking about some of my problems during a play sessions. Turns out everyone has a lot of struggles they want to vent about or want to talk about.",
            "title_similarity": "0.67673874",
            "sentiment_compound": 0.5267
        },
        {
            "id": "gxi4gac",
            "score": 1,
            "text": "I had a roommate that was a cyclical vegan. He’d meet a girl, feel fat, and go “vegan”, but his definition of “vegan” was only eating French fries, sometimes with cheese (that’s why “vegan” is in quotes”). Anyways, after a month or two he’d get really sick and pale and have a hard time staying on his feet. When he hit rock bottom, I would go to kfc and get some chicken tenders and leave them on the kitchen counter. He would find them, eat a couple, and start a several-month cycle of eating normal food again until he met another vegan girl and go back to the fries.\n\nReally really weird that he insisted cheese fries were vegan. No vitamins, no fruit or vegetables, just 2-3 plates of fries a day.",
            "title_similarity": "0.6747738",
            "sentiment_compound": -0.8506
        },
        {
            "id": "gxi4li8",
            "score": 1,
            "text": "This one time my best friend broke both his arms...",
            "title_similarity": "0.6420776",
            "sentiment_compound": 0.6808
        },
        {
            "id": "gxi4mq6",
            "score": 1,
            "text": "Slept with his girlfriend..",
            "title_similarity": "0.44934097",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxi5gh4",
            "score": 2,
            "text": "This is going to seem so weird but here we got. A couple years ago we got into Magic The Gathering, my friend Evan didn't have a job at the time and would ask to use other peoples decks. So one day I just said \"pick 1 out of these 5 color combinations.\" He says \"Blue Black\" so I got him the Dimir deck. Fast forward 2+ years later and he's Consistently diamond in Magic Arena, he made his own commander deck last time we played that did really well. I like to think me getting him that deck really got him into the game. I'd argue he's one of the best players in our group now.",
            "title_similarity": "0.6703911",
            "sentiment_compound": 0.9653
        },
        {
            "id": "gxi5lb5",
            "score": 4,
            "text": "I drove nearly 300 miles to give my friend some Dr Pepper.\n\nA bit of background: I had delivered a truckload of the stuff to a supermarket *way* out in western Texas, and an entire pallet had fallen apart in transit. It wasn't my fault; the trailer was loaded and sealed before I ever got to it. \n\nAnyway, most of the cans on this pallet were still good, but the supermarket refused to take any of them, because of the damaged packaging. My trucking company didn't care what happened with the cans, they just wanted the trailer empty and clean for the next load.\n\nI ended up with about 2 dozen whole cases, plus an irresponsible amount of individual cans, all crammed into my truck's sleeper cab.\n\nI don't even particularly *like* Dr Pepper, but I knew this girl from high school who absolutely loved the stuff, and she was also going to college not too far away from where I'd just made my delivery. \n\nSo I dropped her a line, and set up a meeting. The meeting didn't quite work out, so I literally slept on Dr Pepper for an entire week, until my first day off, at which point I crammed all this soda into my car, and drove out to meet her then.\n\nI didn't find out until later that semester finals were right around the corner at my friend's school, and she was getting super stressed out about the whole ordeal, even on the verge of dropping out. That is, until I showed up on her doorstep one day, with an absolutely insane (even by her standards) amount of her favorite drink in tow. She ended up finishing school, getting her degree, and as of the last time we spoke, she's just waiting on covid to calm down before she gets her dream job.\n\nApparently, that Dr Pepper couldn't've come at a better time. Despite my friend's and her roommates' best efforts, it still took them nearly a month to guzzle down.",
            "title_similarity": "0.68297863",
            "sentiment_compound": 0.926
        },
        {
            "id": "gxi5xkg",
            "score": 6,
            "text": "I let one of my good friends beat the shit out of me.  He was such an angry and frustrated guy.  I had a couple of drinks and he was just driving me crazy with his negativity and anxiety, and I really got under his skin one night.  And finally said if you’re so angry just hit me man.  He did, several times, and then just started bawling. I hugged him and said: “Do you feel better? Do you feel good about this? You’re my friend and I’m always here for you, but man you need to let this anger go.” Long story short he felt worse, and I talked him into getting help.  He’s a really good guy, but had been bullied his whole life (I’d known him since elementary school and he was always mercilessly picked on often).  He just needed something to hurt as much as he did.  He’s got a really nice life now, a good sense of himself and his worth.  Nice lady, house, and beautiful stepdaughter.  Whenever I’m in my hometown we carve out time to have beers and catch up.  He’s one of those guys who would do anything for anyone.  Even drove in the middle of the night to pick me up when he had work at 6am because my car broke down halfway across the state one time in college.",
            "title_similarity": "0.83499265",
            "sentiment_compound": -0.2297
        },
        {
            "id": "gxi614e",
            "score": 5,
            "text": "A friend broke up after a dinner and dance where we performed as a band. Stayed with him as he cried it out and told him he can do much better. Got over it and now he's happily married to a lady much much better. Missed the Manchester Derby cause of that. \n\n2 hours after that, another friend got a horrible stomachache and I took him to the hospital, got him taken care off and stayed with him till he was discharged. He was broke so I paid for his bill and his taxi home. \n\nBy then, it was daylight and I got home after an epic 12 hours. Twas a good night and a better rest knowing them two friends were alright.",
            "title_similarity": "0.72822464",
            "sentiment_compound": 0.9432
        },
        {
            "id": "gxi65z1",
            "score": 2,
            "text": "I got my friend to attend and secure his place as a doctoral student.\nSo, right outta college I got into a research internship at a small but amazing scientific research establishment. I wanted to understand what academic research meant and if I should do a PhD. \nMy friend on the other hand had no doubts about it and had already applied to this place and a few others. \nDuring the PhD interviews he called me up and asked to check why he hadn't been called. Turned out they received his application at the last minute and couldn't send him an email invitation to the interview. Due to a few positions still remaining open they had actually opened up walk-in interviews. \nSo, I call my friend and ask him to get his ass there ASAP. He comes in few minutes before closing time and was shortlisted. His professor talked to him for 2 hours after the interview an offered him a position.\nHe'll be submitted his thesis next year and just got married last month.",
            "title_similarity": "0.5898738",
            "sentiment_compound": 0.9611
        },
        {
            "id": "gxi6hts",
            "score": 5,
            "text": "Close friend of mine has had it tough growing up. Parents kicked him out, and during that time he lost his gf of 4years. He turned to xans and alcohol. Always drinking, always high etc. \n\nOne day he reached his breaking point before a group hangout he said “why doesn’t she want me man?” Referring to his mom. \n\nI refused to give up on him. Stayed at my place, and stayed on his ass about quitting xans and finding a positive outlet through music. Made sure he’s always with my fam during the holidays. 6 months later, he’s moved out, working, and is going back to school in the fall and he has a gf.\n\nWe’re still really close, talk pretty much everyday. He’s family to me, truly a brother",
            "title_similarity": "0.74927497",
            "sentiment_compound": 0.8993
        },
        {
            "id": "gxi6jiq",
            "score": 7,
            "text": "Opposite side of the fence.\n\nI was in a rough spot about 10 years ago. Work hours cut in half, caught my gf cheating, dealing with some new and serious medical issues.\n\nOne day I stopped by my friends house, just to shoot the shit.\n\nWe were standing in his kitchen, and I was telling him how I missed an insurance payment, and they were going to cut off my car insurance unless I paid the rest of the year by the end of the week, and I was stressed out because I still needed my car to get to work and doctor's appointments, etc.\n\nHe asked me how much it was, and I said it was around $1200.\n\nHe reached into his lunch box that was sitting on the counter, pulled out his paycheque, signed it and handed it to me.\n\nHe just gave me his whole paycheque. No questions asked, no stipulations, no \"pay me back\", nothing.\n\nI paid him back as soon as I could, but he totally saved my ass.",
            "title_similarity": "0.7280591",
            "sentiment_compound": -0.7063
        },
        {
            "id": "gxi6rik",
            "score": 5,
            "text": "One of my friends was going through a VERY bad divorce. I looked his property up, to see what it was worth (I wanted a similar home) and saw he was tax delinquent. I told him I could give him $ and did with 0 strings attached. He said his life was one stressor after another and the $ helped him pause work so he could relax and get his head on straight. I'm super glad I did.",
            "title_similarity": "0.7823572",
            "sentiment_compound": 0.8242
        },
        {
            "id": "gxi75i2",
            "score": 1,
            "text": "I could tell you but I don’t think the statute of limitations has expired yet.",
            "title_similarity": "0.16756089",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxi75ts",
            "score": 13,
            "text": "One of my really close friends had to have emergency surgery cause of a large ovarian cyst. She hd one of her ovaries removed and was having a rough time overall. She was kind if a weird girl and i saw that some of her other friends got her flowers and get well cards. I bought her a garden brick and attached a card to it that said \"one down one to go!\". My gf at the time thought i was insane, but i knew this girl better than most. And the brick itself holds no significance besides that it isnt flowers which i know she isnt the biggest fan of. She fucking loved that brick way more than all the flowers and laughed really hard at the card. This was all 5 years ago and she recently moved then sent me a picture of the brick's new spot in her new home which i forgot she even had lol.",
            "title_similarity": "0.70033276",
            "sentiment_compound": 0.951
        },
        {
            "id": "gxi7iz2",
            "score": 1,
            "text": "Me and my mate talk everyday. This time last year he was going through a really bad time with work, home, love life. We talked everyday for weeks about his problems and one by one worked through them. I was late home from work everyday as we just sat talking and talking.\n\nHe now has his best work life, his home life is great and his love life.\n\nNow sadly my own work life is going to shit and he is there for me and supporting me through this. We both work in the construction industry which is very male dominated and has very little discussion of mental health but we have been there for each other and will continue to be there for each other.",
            "title_similarity": "0.69590026",
            "sentiment_compound": 0.5932
        },
        {
            "id": "gxi7ky0",
            "score": 1,
            "text": "Buried the evidence.",
            "title_similarity": "0.20948383",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxi7rng",
            "score": 1,
            "text": "My best friend can be the type to run head first into a shitty relationship and then keep it up for years because he swears that he’s supposed to be with that girl. \n\nWell this one girl in particular was extremely toxic, like she would get mad at him when he wasn’t texting her as he was out white water rafting with me and my family, and other nonsense. Towards the end of their relationship they started breaking up and getting back together while I was constantly offering him this great advice and showing him all the reasons they shouldn’t be together. \n\nWell after he blew off my advice for the 6th time and they got back together, I told him I want nothing to do with her or his relationship because it was painful to see him repeat this toxic process with her. A few days after I told him that, they broke up for good.",
            "title_similarity": "0.82801026",
            "sentiment_compound": 0.8153
        },
        {
            "id": "gxi7vr9",
            "score": 7,
            "text": "My friend and I have known each other our whole lives. He's always been the type of guy to march to his own drum beat, we are polar opposites that equalize each other.\n\nWell about 7 years ago I decided to move to my dads in Connecticut because his work schedule was absolutely crazy, 4am-8pm, just simply had no time to take care of his property or the house and he wanted me to come down and just take care of the house for him and he'd pay me. It was a pretty sweet gig because it was like being a knock-off butler except I didn't have to actually be one and could go enjoy myself as I pleased, block away from the ocean, liquor cabinet filled, wine rack filled, etc. \n\nMy friend and I would talk on the phone once in a while to catch up and one day while he's on the phone he is venting to me about his relationship, they just had a huge argument about bills because he spent a little too much at the bar on their date the other week, and his girlfriend overhears him talking to me about it and pretty much starts packing all his shit.\n\nNow I've known this woman for years, I never imagined her actually doing this but I guess she was just so fed up and wasn't thinking about anything and just started to do it. So my friend obviously asks if he can stay with me, and I'm like sure no problem, stay on the phone with him the entire time because I really don't know how he is taking all of this and don't want to hang up and find out he decided to just drive his car into a tree or something.\n\nHe pulls in the driveway, we get all his stuff set up, and I pour out some water bottles and start making mix drinks in them so we can go to the beach and just chill and drink. While we are at the beach, we obviously are checking out some chicks, having some guy talk, I'm trying to push him to just find someone to bring home so he isn't in his room crying all night like a bitch. \n\nWell this one chick overhears me talking to him about this, and she can tell we are drunk, but I guess she thinks we are both pretty hot and just had a bad breakup too so just wanted to have a wild night. So she comes over to us and we are all talking and then she says she happens to have 3 other friends that are single down the beach and she is going to get them real quick. Honestly, I thought she was fucking with us and was just making an excuse to leave the conversation after chickening out or something. But she actually does come back with 3 of her friends, apparently THEY ALL had bad breakups, decided to go on vacation here and have fun.  I'm just thinking in my head the entire time that there is no fuckin way what I think is going to happen is actually going to happen, but I open the cooler and tell them to take a drink since it sounds like they need one. They eventually want more drinks.\n\nSo I point to the house, tell them that's where I stay, ask them if they feel comfortable coming along and we can all just drink at the house. They agree. My friend and I walk ahead to kind of whisper to each other about how this is the most random fuckin thing to ever happen to us and if anything happens we have to get all 4 of them in on it because this is like a God-given miracle of a situation. Apparently the 4 of them had already pretty much decided that they were going to slut it up and make it a group activity.\n\nWe play some cards for about an hour and are doing shots, and then they all look at each other and nod and just take their bikinis off and start working their magic on us. My friend is kinda hesitant because he don't wanna see my dick but I'm like bro fuck it this aint ever gonna happen again in our life and if you throw this opportunity away I'm never going to look at you the same again. So we pretty much have a sixsome on the dining room table and all over the house.\n\nHe woke up a new man the next day and this went on for the rest of the week until they had to go back home from vacation",
            "title_similarity": "0.68021256",
            "sentiment_compound": 0.9955
        },
        {
            "id": "gxi8i6g",
            "score": 1,
            "text": "I hooked up one of those 120 dollar bidets toilet seat attachments to his basement bathroom.  My girlfriend and I would come over a lot because they invite us for games and movies and I like a clean butt for when I do have to poop over there. Anyways I did not tell him lol his girlfriend knew though but she wanted to see how long it took for him to realize. Almost 3 months. He never would use one at my place and make fun of them. Sometime later he eventually got over himself and tried it and now his other two bathrooms have them. So I helped my friend have cleaner butthole at home I guess.",
            "title_similarity": "0.7768234",
            "sentiment_compound": 0.9272
        },
        {
            "id": "gxi8ni7",
            "score": 1,
            "text": "I pinned a kid to the bathroom wall and threated his life when I was in middle school (11-12 years old) because he was shit talking his family.\n\nWe had around 4 different elementary schools feeding into this school so my bud and I never really shared classes. Turns out this a-hole was trying to be cool by insulting and mud slinging things about my friend. One day he happened to be bullshitting with another one of my school friends when I was taking a piss during gym class. So I calmly washed my hands, dried them, and shoved my forearm under his chin and leaned into the door. Told him that if he kept talking I'd crush his throat and to be a little nicer to people you do not know.\n\nNever spoke an ill word about him afterwards and he tended to avoid me the rest of the year.",
            "title_similarity": "0.7603079",
            "sentiment_compound": 0.1442
        },
        {
            "id": "gxi95ix",
            "score": 1,
            "text": "Beat the shit out of him. I'm not proud but he's been sober for 5 years",
            "title_similarity": "0.53134644",
            "sentiment_compound": -0.4726
        },
        {
            "id": "gxi9dj0",
            "score": 1,
            "text": "This was something a friend did for me....\n\nI broke my jaw playing football when I was younger and had to have it wired shut for 2 months. \n\nIt was still wired shut when my birthday came and as you can imagine I couldn’t really drink or eat any good food or really celebrate, so I was feeling pretty down.\n\nMy buddy came over and could tell my spirits were low, so he said, I’ll be right back. He comes back 20 minutes later with a birthday cake and candles. He told me he didn’t care if I couldn’t eat it, he was gonna sing me happy birthday and we were gonna celebrate. I managed to smash some cake through the wire. It was a small taste of normalcy during a difficult time.\n\nI’ll never forget that gesture. Wherever you are B-Nay, you’re the GOAT!",
            "title_similarity": "0.73334193",
            "sentiment_compound": 0.9683
        },
        {
            "id": "gxi9iw1",
            "score": 1,
            "text": "My friend and I met in university. We were in a band together and spent sundays rehearsing and chilling. He was the singer and he was very talented and well educated ln music. I was playing the bass. \nWe bonded over rpg games and some chick stuff and became besties.\n\n2 years later, I was in 2nd grade but he was still in prep. At that time, I was dating this chick who got me into another band. I was trying to impress her, so I took the 2nd band more seriously. We recorded some songs, did some gigs. I became close friends with the guitarist who offered me a job in a touristic place to play in hotels at some time.\n\nAt this point I have to mention that my friend and I were attending one of the best universities in our country. So I did not give up on that for playing bass guitar in an hotel band.\n\nOne night we were drinking some beer together and he was talking about how much of a mess his academic career was and how much he did not want to study further etc. I told him about this offer with the other band and kind of peer pressured him to accept it.\n\nHer parents supported this decision and a month later he moved to another city for this seasonal gig, dropped out from the university.\n\n2 years later he got accepted to a good conservatory college with full scholarship. Since then he has played in many musicals, written & directed one, sung in many events and basically made a career out of it.",
            "title_similarity": "0.6515828",
            "sentiment_compound": 0.9884
        },
        {
            "id": "gxi9x07",
            "score": 1,
            "text": "Pretending that I'm gay lel",
            "title_similarity": "0.35145473",
            "sentiment_compound": 0.1027
        },
        {
            "id": "gxiafv5",
            "score": 10,
            "text": "In college, I befriended this chick that lived in the same dorm. We always bumped into each other in the smoking area. Turned out we had a lot in common, especially, uh, birdwatching. We had very similar taste in music, booze, and most importantly, women. She was a hard lesbian (as in \"men are yucky\" \"not a chance\" etc. which is important to the outcome of the story).\n\n Pretty quickly, we were ride-or-die bffs. So when I pledged a frat, she couldn't, despite being one of the bros in pertnear every way. \n\nEventually, though, I brought my bff ladybro into the fraternity (I mean, she was always there and always participating anyway, so she fucking deserved to be a brother) and advocated for her to become a sweetheart. It was a title reserved for fiancees of active brothers, but with my advocation we loophole'd the bylaws. It was the best I could do to make her an actual, nationally recognized, brother in the fraternity.\n\nLater she fell in love with one of the brothers, a great big furry motherfucker; y'know, the \"wearing a full sweater despite being butt-ass nekkid\" kinda hairy. Could not in any way, shape, or form be confused as lez-bait, basically. Turned out she was pan, not lesbian, and just didn't realize it, I guess. \n\nThey're happily married now, have a cute little house, and someday there are gon' be some fat little bear cubs runnin' around that house. Can't wait to meet them furry kids, they're gon' be adorable.",
            "title_similarity": "0.7345643",
            "sentiment_compound": 0.9847
        },
        {
            "id": "gxiauxs",
            "score": 4,
            "text": "Slapped him HARD in the face. Long story.... But it worked. Saved his life",
            "title_similarity": "0.5415373",
            "sentiment_compound": 0.4825
        },
        {
            "id": "gxiayez",
            "score": 4,
            "text": "Not something I did, though I do consider myself a solid friend. \n\nWhen I was 20, I was living with my mom and step dad while I worked full time and attended college full time as well. My schedule was pretty intense. I worked 5 am to 1:30 pm M-F at a rental car joint, and went to school from about 2:30 pm to 10:00 pm. My parents felt I wasn’t helping enough around the house and that I was just using them for a place to stay, so they kicked me out. I literally didn’t have any place to stay, and I was only making like $9/hr at the rental car joint. So I was not exactly balling! \n\nI ended up staying at one of my friends houses for a couple days while I tried to find a permanent arrangement. A few days later I was hanging out with an old friend from high school and we started talking about my situation. She insisted that I move in with her. I told her that I wouldn’t be able to split the rent, because of my small wage and she said not to worry about it. I gave her $200 a month for utilities and we shared a small one bedroom flat for the next 6 months. We eventually moved out into a 2 bedroom once I was a little more financially stable. \n\nThis woman quite literally saved my life and I think about her regularly. After living together for about 2 years, I eventually moved to Southern California to work for a pretty large company. I have since worked my way up, and just last week was promoted to GM making a pretty hefty salary. Had she not taken me in, who even knows where I’d be today!",
            "title_similarity": "0.7107365",
            "sentiment_compound": 0.9893
        },
        {
            "id": "gxib3gc",
            "score": 25,
            "text": "I live in the US but I am originally from France. My best friend was my neighbor, living with his Mom. He was sort of depressed, living with emphysema with maybe 10 years to live. He likes to read books, he is very interested in vintage stuff, history, and archeology. He really thinks like many folks I knew back in France.\n\nAnyway, one day, I paid him a ticket to France to stay at my sister's place.\n\n10 years later. He is still in France. He married my sister. He went for further tests in France and it turns out that he doesn't have emphysema at all! He will soon start some gig to dig a B-17 wreckage in France, to help finding fallen US soldiers during WWII. I have a very happy brother-in-law.",
            "title_similarity": "0.6566627",
            "sentiment_compound": 0.9768
        },
        {
            "id": "gxib5f0",
            "score": 7,
            "text": "So my best friend broke up with her boyfriend early July but agreed to let him live in her house for the rest of the month to find a place of his own so long as he paid rent.  End of the month he hasn't found anything and it's a huge fight to get him to pay rent.\n\nMid-august we are on a big group camping trip.  It's mid-afternoon and I am on my way to the camper to grab something.  I see her standing beside her tent crying.  I ask if she's ok.  She hands me her phone with a long ass text from him basically saying she can have August rent or have him move out but not both.   She vented about the stress this was causing her.  I told her 1. you weren't counting on the rent anyway 2. there is no way shithead gets a month rent free for you to be free of him 3. he is out golfing all afternoon and 4. we have a bunch of people right here who would be happy to throw his shit out on the lawn.\n\nWe took her and 4 of the guys in my truck and got another two guys lined up on the hour drive into the city.  She pointed out his stuff, we all carried it into the back yard.  With that many guys it took about an hour.  She texted him telling him that his shit is on the lawn and the door codes are changed.   I bought the lads Burger King and let them drink out of my cooler for the rest of the trip.  When we got back to the campground we watched him over her Nest camera feed loading furniture by himself into his work truck.\n\nFuck Dave, that dude is a lowlife.",
            "title_similarity": "0.68362546",
            "sentiment_compound": -0.903
        },
        {
            "id": "gxibefg",
            "score": 4,
            "text": "When I was a kid I was always in and out of hospitals for suicide. In my life I've had to talk down about 3 people from it. It wasn't anything special but I feel like I was more equipped to help people. I never talked about it again with them but I feel like it's the most I've ever helped a friend",
            "title_similarity": "0.6956272",
            "sentiment_compound": 0.9075
        },
        {
            "id": "gxibmu7",
            "score": 1,
            "text": "Maybe the grin was because he didn't want to tell you that he had came on that picture in the past so you gave him an indirect blowie",
            "title_similarity": "0.5367992",
            "sentiment_compound": 0.4363
        },
        {
            "id": "gxibz78",
            "score": 12,
            "text": "Roommate just after college was in an accident and broke both shoulders. The cast wrapped around his chest and he couldn’t move either arm very much. I fed him, bathed him and helped him piss and shit for 8 weeks until he got the cast off. The first week was awkward as hell!!!  We are still friends but we never talk about that period.",
            "title_similarity": "0.6871089",
            "sentiment_compound": -0.8412
        },
        {
            "id": "gxieiyd",
            "score": 4,
            "text": "I took the phone from my best friend and told the girl he was talking to that we all knew they both liked each other so to cut the bullshit and just seal the deal. They have been together 21 years now.",
            "title_similarity": "0.6330688",
            "sentiment_compound": 0.6151
        },
        {
            "id": "gxieoin",
            "score": 1,
            "text": "E-transferred the $30 she needed for birth control - no little pooping/screaming human was made that month!",
            "title_similarity": "0.5515064",
            "sentiment_compound": -0.3595
        },
        {
            "id": "gxifvga",
            "score": 4,
            "text": "My best friend had gotten divorced a few months prior and was finally ready to do some dating. He had downloaded a dating app but didn’t really have any pictures. \n\nI’m no photographer, but I **made** him let me take pics of him around his home and outside (even made him change shirts and stuff) and his matches skyrocketed afterwards. \n\nHe now has a steady girlfriend and is really happy.",
            "title_similarity": "0.75706697",
            "sentiment_compound": 0.8458
        },
        {
            "id": "gxig29d",
            "score": 4,
            "text": "I have a friend who was in a bad place, drugs hanging out with new people who were no good, lost connection to his son, etc etc. \n\nHe wasnt working at the time, so i brought him 1500km south to a different climate, helped him dry out, gave him work and got him on his feet again. He helped me alot as well that summer so I gave him cash and a  decent vehicle as thanks. \n\nHe got a reset and was able to go find work with dignity and no dependancy.",
            "title_similarity": "0.72421294",
            "sentiment_compound": 0.5798
        },
        {
            "id": "gxig7nj",
            "score": 4,
            "text": "My friend put socks and shoes on my feet after a major surgery so we could go for a walk. I do not touch feet. First time I saw the outdoors in two weeks. Hell of a friend!",
            "title_similarity": "0.57143366",
            "sentiment_compound": 0.2714
        },
        {
            "id": "gxigpr6",
            "score": 2,
            "text": "My friend could never figure out what he wanted to as a profession he was very good at drawing but never really cared about singular pictures he loved action and adventure movies and after years when we were in college I introduced him to shounen anime he absolutely loved it and over time became a huge fan, a few months later he decided that he wanted to be a manga artist after that he transferred to an art school so he could get better at drawing since he never really took art seriously\nNow with a few of his friends he made at art school he’s working on his first ever manga and I sometimes help them if they ever get stuck or run out of ideas since I’m a huge fan of anime and have always been a very creative person",
            "title_similarity": "0.69004166",
            "sentiment_compound": 0.9903
        },
        {
            "id": "gxih2e7",
            "score": 1,
            "text": "I helped get him out of an abusive relationship a couple of years ago. My dad and I gave him free rent for  a few months and he ended up finding a place to stay near my ex and I once we moved. Fast forward a few years and he basically kicked me out of the apartment I found for us after he had  a mental break down.  Said if my then girlfriend now wife wants to sleep over she has to pay rent.  And this apartment isn't big enough for her to live in even though she clearly wasn't.  Then I'm pretty sure he tired to get her in trouble with the government...so yeah fuck that guy.  If you see this dude I'm sorry you ended up just like your mother and I really really hope you find help.",
            "title_similarity": "0.7245892",
            "sentiment_compound": 0.1389
        },
        {
            "id": "gxiikcz",
            "score": 6,
            "text": "Reading this thread has really made me cry like a little bitch \n\nI just lost my best friend in the whole world three days ago. \n\nI miss him.",
            "title_similarity": "0.6929845",
            "sentiment_compound": 0.0334
        },
        {
            "id": "gxiiwi6",
            "score": 1,
            "text": "Drove 933 miles to bail him out of town in a crisis. He ended up getting it together and staying put, I moved back nearby his place and we run a business together now. He's got his own place and his own life with a GF, kids, and cats. Dude just needed a few supporting people in life and some good friends.",
            "title_similarity": "0.61980414",
            "sentiment_compound": 0.5859
        },
        {
            "id": "gxik5l8",
            "score": 4,
            "text": "One of my closest friends had been driving the same 1980s Toyota, unable to buy a newer car because of income/money issues. We had talked about it and I ended up finding a Forester that needed a bunch of engine/interior work but the price was finally in her range, like $1400. After she bought it I spent about a week on it, I had a company fully detail it inside and out and I pulled the engine and did all the maintenance including a new clutch and head gaskets. She’s absolutely in love with the car and really grateful. I’d do it again in a heartbeat.",
            "title_similarity": "0.6794702",
            "sentiment_compound": 0.9513
        },
        {
            "id": "gxilhqj",
            "score": 1,
            "text": "Wait wait wait wait wait wait wait if you gift someone 15k you also have to pay taxes on that gift???? Am i reading this correctly????",
            "title_similarity": "0.43023458",
            "sentiment_compound": 0.7476
        },
        {
            "id": "gximv5s",
            "score": 1,
            "text": "Sit down with him and have the talk about how pegging is the only way to have a truly equal heterosexual relationship. Him and his fiance are closer than ever now.",
            "title_similarity": "0.59040856",
            "sentiment_compound": 0.4404
        },
        {
            "id": "gxin944",
            "score": 3,
            "text": "Can I give you a pik of someone I need to forget??",
            "title_similarity": "0.35314173",
            "sentiment_compound": -0.3094
        },
        {
            "id": "gxininj",
            "score": 1,
            "text": "Back in HS my best friend was trying to get some head from a girl at 2am on a Wednesday night. He had no means of driving and neither did she so he hit me up and explained the situation. It was pretty normal for us to hang out during those hours to just smoke weed and I was excited for him that he was finally ganna get some head. I picked them up and then parked the car in an empty parking lot and went to go chill at a Denny’s for an hour, I felt like a chaperon or something just dropping some kids off at a play date.",
            "title_similarity": "0.7127315",
            "sentiment_compound": 0.9313
        },
        {
            "id": "gxio0co",
            "score": 1,
            "text": "Another in high school: drove a friend to hook up with a girl, as he had no way to get there (where sex was!); she got pregnant, and he was sure that was the time. She had the baby, but that’s all I know. So somewhere in this world is a person whom I directly assisted facilitating into being.",
            "title_similarity": "0.72392154",
            "sentiment_compound": 0.3489
        },
        {
            "id": "gxio47j",
            "score": 1,
            "text": "Me and a friend of mine went to Hawaii to rescue our mutual friend who was becoming a Hari Krishna. It worked",
            "title_similarity": "0.49111944",
            "sentiment_compound": 0.8658
        },
        {
            "id": "gxip3gw",
            "score": 1,
            "text": "My friend was always looking for a GF however was always horny so when he went to places to meet others all he ended up doing was finding sex. So I agreed to give him regular blowjobs and handjobs until he found a GF.",
            "title_similarity": "0.78229195",
            "sentiment_compound": 0.6786
        },
        {
            "id": "gxir2nu",
            "score": 1,
            "text": "I didn't help my friend. A little background:  \n\n\nAt one point my friend was at a very dark place. He was eating anti-depressants and the doctors had put him on mood stabilizers. He met the doctors, but he didn't tell them anything useful, only that things were boring and all that. Like he didn't go into what he was actually thinking and feeling, \"the doctors are just stupid anyway, they can't help.\"  \nAnd one night he called me up and was scared, he had thoughts about committing suicide. So I took him to the hospital, in the middle of the night, where they took care of him.\n\nWell a few days later he was back out and he wrote to me \"I am so depressed, I don't know what to do.\" The thing is, I too was suffering from depression, my girlfriend had left me and my future was bleak, I had no job and all that. So right there and then I couldn't take it anymore and just told him \"Enough!!! You think you're the only one with problems in this universe?\" He just wrote a quick OK.\n\nAnd after that, he started to take more care of himself. He took the doctors treatments more seriously and eventually he got better. Perhaps because the things he would usually tell me he now started to tell the doctor.",
            "title_similarity": "0.69857013",
            "sentiment_compound": -0.9774
        },
        {
            "id": "gxir5f5",
            "score": 2,
            "text": "I went through an abusive relationship, I broke up with her after she cheated on me, put my phone number on the internet and harassed me for months but I didn’t for some reason have to heart to delete her number & all the photos. My buddy Billy deleted them all for me when I couldn’t. I tried getting clean off of self harm, drugs and booze. My buddy Billy has been there for me since the beginning. Gave me my first hug at my first meeting. We still hang out till this day. We have a running joke in our friend group that I’m in love with the dude lol. It’s just when you feel like you’re alone and you feel like nobody fucking likes ya, this random dude gives you a hug and becomes your friend. I owe this man soo damn much. Love you Billy. Bromance & Relationships in general with friends can mean sooo much more then some romantic relationship. Bros before hoes. I’ll always be there for Billy no matter what.",
            "title_similarity": "0.8834047",
            "sentiment_compound": 0.9942
        },
        {
            "id": "gxir5ti",
            "score": 2,
            "text": "You ever wonder if he came on that pic u ate?",
            "title_similarity": "0.4396839",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxis4a3",
            "score": 2,
            "text": "Not my best friend but my classmate. So what I basically did was complained to the teacher that he was not active and not learning in class. He used to bring one copy and good around the whole school session. His marks were getting down and he was on the verge of failing. \nI complained, he got angry, he cried, our mutual friends turned against me and I was kicked outside the group. \nNow, he's doing better than me and Ive developed trust issues leading to having no friends.",
            "title_similarity": "0.70550644",
            "sentiment_compound": -0.9065
        },
        {
            "id": "gxis7ik",
            "score": 1,
            "text": "I once had a friend with a bad tooth, but couldn't afford a trip to the dentist. So, I wait till he wasn't paying me no mind and POW! Punched him square upside his ugly mug is what I did for him, and hard too! Knocked that rotted thing aloose is what I did. Helped him out in both the short and long run.",
            "title_similarity": "0.7822937",
            "sentiment_compound": -0.6654
        },
        {
            "id": "gxisl0y",
            "score": 1,
            "text": "Strangest… no. But most hurtful was i approached a friends parents and accused my friend of breaking in and stealing my weed.  (I didn’t have weed). \n\nWhile someone did break into my home and steal my stuff, it wasn’t him. However his best friend asked me to get him off drugs.   This was the only way I saw it at the time and it drove a wedge between him and many people, however found out later that he got his shit straightened out and now lives a relatively normal life.",
            "title_similarity": "0.7543956",
            "sentiment_compound": -0.5483
        },
        {
            "id": "gxisv36",
            "score": 1,
            "text": "Relatively minor compared to some of the fuckery here, but teach a friend to shave.\n\nI was 17, only just had the hang of it myself, and my mate on T was finally getting his facial hair in. But it was that tufty, weakass hair guys usually get around puberty and he wanted it off. All of his friends were either trans guys earlier on in their transition or cis girls, and his dad didn't agree with his transition. So it fell to me, the token cis guy, to give this guy a shaving lesson. \n\nShitty tuft gone, he then grew the most badass beard I know. It's truly glorious.",
            "title_similarity": "0.78209066",
            "sentiment_compound": 0.9439
        },
        {
            "id": "gxisymr",
            "score": 2,
            "text": "Not really strange but one I'm proud of.  Working as a web designer in '99 (back when being experienced meant you walked past a copy of Photoshop in Best Buy) and my buddy was starting to dabble in it.  Managed to get him a job interview where I was working and almost literally begged my boss to hire him as I just felt he could do the job.  Short of being on my hands and knees begging my boss to hire him I was pretty shameless about it.\n\nFast forward to today...  He's worked in the same or related field ever since.  He's also worked on 2 presidential campaigns and now works for the DoD.",
            "title_similarity": "0.73062825",
            "sentiment_compound": 0.9268
        },
        {
            "id": "gxit50g",
            "score": 1,
            "text": "One time in grade 10 my best friend wasn't doing well in math. His parents were threating to take away his Sega genesis if he didn't study and do well. I was pretty good in math and played sonic with him every day so I agreed to help him study.\n\nWe spent the entire weekend studying and he got 100% on his math test. He did better than me. \n\n\nHe went on to become an engineer. \n\n\nNot saying I take all the credit but like not saying I don't either hahahaha",
            "title_similarity": "0.70653284",
            "sentiment_compound": 0.9341
        },
        {
            "id": "gxitfzo",
            "score": 2,
            "text": "That's a good question",
            "title_similarity": "-0.059316672",
            "sentiment_compound": 0.4404
        },
        {
            "id": "gxitytf",
            "score": 1,
            "text": "In my 20’s I invited my former high school “stalker” to a series of house parties because she’d chilled out and I thought it would be good resolution to that story. Eventually my best friend/ roommate asked her out. They got married in March after dating for 8 years.",
            "title_similarity": "0.63074636",
            "sentiment_compound": 0.9186
        },
        {
            "id": "gxiuash",
            "score": 2,
            "text": "A group of us gamers bought a collection of cards from various games to help a buddy make his mortgage payment for the month.  His wife had just been laid off and they had a two-year-old to support.\n\n\nThen we gave the collection right back to him the next day.",
            "title_similarity": "0.67671436",
            "sentiment_compound": 0.6597
        },
        {
            "id": "gxiui53",
            "score": 2,
            "text": "We told him his girlfriend was still doing porn even though she told him she would stop.",
            "title_similarity": "0.7259886",
            "sentiment_compound": -0.296
        },
        {
            "id": "gxiuutn",
            "score": 2,
            "text": "I told him to buy GameStop at $40. He made 11k",
            "title_similarity": "0.46668792",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxiv0k2",
            "score": 1,
            "text": "Picked my depressed buddy to be my roommate since he was having a hard time and needed cheap rent.\n\nThat fucker makes more than me now.",
            "title_similarity": "0.66375446",
            "sentiment_compound": -0.8402
        },
        {
            "id": "gxiv3o8",
            "score": 4,
            "text": "About 10 years ago my best friend was having problems with his then girlfriend. She kicked him out of the house to move in one of her high school friends who was homeless. They had started a \"friendship\". My buddy is the type to help anyone with anything, while the guy that she moved into their house somehow started hanging out and getting rides from my buddy. I could tell this was tearing my buddy apart but he was to nice to say or do anything about it.\n\nOne day this guy was sitting outside our place of employment waiting for my buddy to come to work to get money off of him and most likely a ride somewhere from him. Before my buddy got there I went out and told this guy to take a flying leap and get lost, explaining to him that my buddy and him are in no way friends. This guy is sleeping with my buddy's girlfriend and that he either gets lost or we will have a larger problem. He asked for a ride out of town from me, so I dropped him off at the bus stop, bought him a ticket for out of state. \n\nA few days later my buddy asked where that guy went and that he was glad he hadn't seen him in a few days. To this day he hasn't been heard from since, and my buddy has no clue that I sent this guy packing.",
            "title_similarity": "0.80360687",
            "sentiment_compound": -0.4554
        },
        {
            "id": "gxiv6ii",
            "score": 1,
            "text": "At a New Years party, where we were planning to go clubbin' later, one of the friends spoke to my good mate, out on a balcony. \n\nHe pulled out a knife at one point, with my mate looking at him perplexed. Asking him why he had a knife on him, he said it was so he could help defend us, if we got into a fight.\n\nWithout skipping a beat, he took the knife out if his hand and threw that bitch out into the darkness of the field ahead, never to be seen again.",
            "title_similarity": "0.7235825",
            "sentiment_compound": 0.6326
        },
        {
            "id": "gxivh4r",
            "score": 2,
            "text": "My friend had a very bad run. His sister died (fuck cancer) then his Dad died a few months later (probably of a broken heart). Everyone was calling him and offering condolences and it got to him.\n\nI went online bought us two tickets to Miami and a hotel rooms for a week and got him the fuck out of town for a week. All I told him was pack a bag we are leaving in a day. \n\nI told him if he wanted to talk, we can talk. If he wanted to not mention anything then that was fine too. \n\nWe had a great time and years later he said it helped him out mentally so much to just get away for a week and be normal. I love that dude.",
            "title_similarity": "0.7652291",
            "sentiment_compound": -0.8399
        },
        {
            "id": "gxivoo9",
            "score": 1,
            "text": "Not sure if this is “stupid” but perhaps a bit odd. My best friend in high school had a birth defect that made his right calf very small compared to his other calf muscle. He NEVER wore shorts, even at the beach he’d wear long windbreaker pants.\n\nI was into working out and nearly wanting to become a bodybuilder so I knew about calf implants. I told him about it and his parents got him the surgery. Dude has been wearing shorts the past 25 years now, you can tell a little but his leg looks much better than before.",
            "title_similarity": "0.6444003",
            "sentiment_compound": 0.8562
        },
        {
            "id": "gxivvdl",
            "score": 1,
            "text": "You bro of the year tho.\n\nMine wasnt something so touching but my buddy was being a quitter this one time and I was like cmon you ain't no bitch. He said you're right that isnt who I am. Sometimes a dude just needs that push when hes down.",
            "title_similarity": "0.71183354",
            "sentiment_compound": -0.0129
        },
        {
            "id": "gxiw0nd",
            "score": 1,
            "text": "Not even a best friend.  A direct report at work.  They were facing some Lowkey racism.  Not the outward and blatant kind and that shit is entrenched and hard AF to expose and so what I did is I encouraged them to look elsewhere, I helped raise their morale again because they were feeling down and reinforced their decision and I provided the best damn reference anyone could get guaranteeing they'd get the job and I although they're my best direct report and I hate to lose them, what's important is their happiness and to be away from that toxic BS so I wish them all the best as they start in a few weeks at their new place of employment.  It's going to suck on my projects in the near future without them and I'm now understaffed but that's something I can deal with.",
            "title_similarity": "0.68229055",
            "sentiment_compound": 0.5032
        },
        {
            "id": "gxiwbko",
            "score": 2,
            "text": "Am not a guy, but my best friend is. \n\nSimilar to OP, my homie was still hung up on his ex. We were leaving a movie and he noticed a little keychain on the ground that so happened to be his ex's favorite character from Overwatch. \n\nHe turned to me and asked me if I thought it meant something. \n\nI took it out of his hands, spit out my bubble gum and covered the whole key chain in it, then flung it as far as I could into the trees. Turned back and looked at my friend and said \"no I don't think it does.\"",
            "title_similarity": "0.7547692",
            "sentiment_compound": 0.9657
        },
        {
            "id": "gxiwdxz",
            "score": 2,
            "text": "Bought a friend a laptop so we could play WoW together, we fell off and don't talk anymore but because of that laptop I bought him he wound up learning how to code and meeting his girlfriend of now almost 4 years.",
            "title_similarity": "0.644182",
            "sentiment_compound": 0.6522
        },
        {
            "id": "gxiwn7v",
            "score": 2,
            "text": "Mannnn my friend gave me the WTF ARE YOU DOING look when my new girlfriend had me bringing up BASKETS of clothes to our place. \n\nHe tried. I didn’t listen. \n\nEmotional trama, 9 years, 2 kids, one house later. I realize he was trying to let me know “that at this moment. Roy fucked up”",
            "title_similarity": "0.72676647",
            "sentiment_compound": -0.7297
        },
        {
            "id": "gxiybkn",
            "score": 2,
            "text": "I tutored a?friend in pre algebra. I worked with him on every homework assignment and he got a C in the class. Then I guess got to good for me and stopped talking to me. No good dead goes unpunished. Lol I don't think he was able to continue because of financial reasons So, yeah guess it was actually done it vane.",
            "title_similarity": "0.68637115",
            "sentiment_compound": 0.7927
        },
        {
            "id": "gxj02wg",
            "score": 2,
            "text": "Blew up part of my back yard. Friend was going through a divorce and needed a distraction.",
            "title_similarity": "0.6029846",
            "sentiment_compound": 0.1531
        },
        {
            "id": "gxj2i4p",
            "score": 4,
            "text": "My best friend from high school and I were on the tennis team together. He was much more talented than I was (he regularly took over #1 for the team while struggled to reach varsity). But one day he asks me, \"Quackmandan1,  your backhand is by far your strongest tennis stroke. What do you do to have such good backhands?\" So after about 2 minutes of me teaching how I do the stroke, it clicks for him. By the end of practice that day, he was smashing two-handed backhands down the line as an approach shot, and it is to this day one of his strongest shots.\n\nHe went on to play a fair bit of college tennis, unlike me. But I like to think I got to contribute to his success, even if it was in a small way.",
            "title_similarity": "0.6830499",
            "sentiment_compound": 0.9852
        },
        {
            "id": "gxj5sts",
            "score": 1,
            "text": "My friend was abusing coke to the point he was stealing from his grandma… one night he had bought $100 and I grabbed it and threw it to the trash. I told him i don’t care if he got mad he’s a bitch for stealing. Even when I went to the restroom and caught him about to do one I’ve knocked out of his hand. \n\n\n2 years now this guy is working not stealing. Now he drinks but he does not use coke anymore. He’s almost done with school!",
            "title_similarity": "0.8172878",
            "sentiment_compound": -0.4927
        },
        {
            "id": "gxj6f2z",
            "score": 1,
            "text": "Both of my friends stopped me from self harming",
            "title_similarity": "0.43235278",
            "sentiment_compound": -0.34
        },
        {
            "id": "gxj8xqn",
            "score": 4,
            "text": "My best friend had been in and on and off again relationship for years with this really abusive jerk. We were both working together at the time and having a cigarette in the parking garage before heading home. Then he tells me 'Yeah I'm going to see Paul after this. I feel like he's changed a lot and we're ready to make it work.' This was only a few months after Paul had brought another guy home and fucked him on the couch while he thought my best friend was sleeping in the next room. The latest on a long list of similar infractions. \n\nSo I snatched my best friend's keys right from his hand and hurled them over the edge of the parking garage and they landed in the city park across the street. I looked him dead in the eye and said \"Oh really? Because I thought we were spending the evening looking for your keys.\". It's probably the smoothest thing I've ever done. Anyway he was super pissed off at me the entire night but he never got back together with Paul.",
            "title_similarity": "0.8133278",
            "sentiment_compound": 0.7281
        },
        {
            "id": "gxjetuh",
            "score": 2,
            "text": "Not sure if this has been mentioned already but that picture was probably really dirty",
            "title_similarity": "0.29286736",
            "sentiment_compound": -0.6976
        },
        {
            "id": "gxkgtlc",
            "score": 2,
            "text": "My friend's father lost the house to drug addiction.  At one point they were so poor they didn't have cable or internet for a few months. For his bday, I bought a 250gb external HDD for $70 and spent like 2 weeks pirating all his favorite shows. I had probably hard like days worth of adult swim shows on that thing plus a bunch of other stuff I know he liked.  It's a shame the hard drive was cheap and died within like a year, but by that point the internet situation got sorted out.  Oh and the father is in a better place all these years later if you are wondering so that's good.",
            "title_similarity": "0.71265215",
            "sentiment_compound": 0.8326
        },
        {
            "id": "gxlyeh0",
            "score": 1,
            "text": "a few years back I decided to help out my best friend by paying for the rest of his lawyer fees as he was getting a bad divorce. I shelled out 2 or 3k without batting an eye. the fact that i don't remember the amount goes to show how little i care about him paying me back.  Today he is financially free from his ex and rebuilding his finances.",
            "title_similarity": "0.7137511",
            "sentiment_compound": 0.9156
        },
        {
            "id": "gxnw0c0",
            "score": 1,
            "text": "Took my friends ps4 pro, we got PCs and his ex bought that ps4 for him. He stopped using it when we built his pc so I took it. Idk if it’s helping because he recently saw her according to him but fuck it he didn’t play god of war on it.",
            "title_similarity": "0.69789517",
            "sentiment_compound": -0.6542
        },
        {
            "id": "gxoeqjd",
            "score": 1,
            "text": "I did her interview test (machine learning programming). She got the job as ML Engineer in San Francisco and she is paid more than me now.\n\nI just wanted to prove to myself that I was able to do it, and also helped her.\n\n*(I've never done machine learning before.)*",
            "title_similarity": "0.6152165",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxpfgmj",
            "score": 2,
            "text": "Have a friend who used to be so addicted to heroin he sold his mother wedding ring. At the time I was experimenting with LSD and told him it might show him something that he wasn’t seeing in his every day life. Went on a camping trip and dropped the  day after, he quit cold turkey and has been sober for nearly a decade now has a great job  and has a beautiful family.",
            "title_similarity": "0.7617941",
            "sentiment_compound": 0.8288
        },
        {
            "id": "gz0gqwq",
            "score": 1,
            "text": "My bestest friend was renting from her dear father For many years. Although the dad was generous in the rental pricing and kept up with general maintenance. She never really got any upgrades. And wanted a newer appliances... \n\nI have a reputation of the pretty handy homegirl, and one day while chatting in her kitchen I noticed her fridge door swung the wrong way. I informed my friend that it was indeed swinging the wrong way and asked how long she had been living like that? Answer: forever 🤷🏾‍♀️ that's when I informed her that you can switch the swing of the doors on a refrigerator. And proceeded to attempt to switch the swing of the doors. I must have lost a piece or two cuz the bottom door never swung back right it would close securely but I couldn't get it the swing properly. I promise to return with some more tools after watching some more YouTube videos but by the time I made it back to her house she had a whole new fridge.",
            "title_similarity": "0.70451593",
            "sentiment_compound": 0.836
        },
        {
            "id": "gzhlk0b",
            "score": 1,
            "text": "Let my girl fuck him so he could lose his virginty",
            "title_similarity": "0.6470146",
            "sentiment_compound": -0.7553
        },
        {
            "id": "gzzc1ww",
            "score": 2,
            "text": "I'm not sure if this constitutes as strange because I did it, or because of the age gap, but regardless:\n\nTL;DR: My Trans Friend (FTM) was worried about coming out to his family, and so I helped him muster up the courage and in the meantime became a father figure to him despite me being only 4 years older than him.\n\nI have a friend who is transgender, we'll call him Lazuli for this. He's Female to Male and has been open about it for about a year now. And for almost two years, I've been a father figure to him (becoming that about 2 months after becoming friends) and wound up being his main push for coming out to his Brother (who I am also friends with) and actual Parents. His Parents aren't too thrilled, but they're not ridiculing him at all. As for his Step Mom though, she's been resisting a lot and calling him \"she/her\" and continuing to call him his birth name rather than preferred name\n\n*But*, I was right (and very glad) about his Brother (we'll call him Copper) being supportive of it. Originally Lazuli thought that Copper wasn't going to be supportive of him, but he came out to Copper first as I provided him evidence that Copper had no problem with transgender people.\n\nI introduced Copper to another friend of mine who was also transgender (Male to Female, we'll call her Gold) and showed Lazuli screenshots of Copper and Gold getting along in a group chat, also sending screenshots of Copper when I told him Gold was Trans (Copper's reaction was more surprised than anything else, his first response being \"Huh, never would've guessed that.\"\n\nNow, you guys know this story has a relatively good ending since Lazuli's got his Brother's support. However, I did mention an age gap before. And the reason I mention it is because theres guys who are like role models to friends and in some cases a semi father figure, usually a similar age. In my case though, I'm 17 and Lazuli is 13. So yeah, thats why I consider it weird, but I have no problem with being a father figure to him whenever his real dad is being, well, a rather shitty dad. Regardless of that, I care a lot about the kid and (despite not even being a legal adult) consider him my kid in return. If he's ever been in a bad situation or scared he's usually come right to me, and from there I get Copper involved so that he can help handle the problem while I try and handle Lazuli (Copper is also 17, however he's much more intimidating than I am so...)",
            "title_similarity": "0.65582836",
            "sentiment_compound": 0.9935
        },
        {
            "id": "h0jexl3",
            "score": 1,
            "text": "I don't know if this is strange -- but I convinced a friend that it sense for him to incur the expense of getting his MBA and forego two years of income doing so. He ROI was huge.",
            "title_similarity": "0.69479203",
            "sentiment_compound": 0.886
        }
    ]
}