{
    "What is a Bro code that you think should be followed internationally?\nAn example would be no chit chat while peeing": [
        {
            "id": "gzv5xcf",
            "score": -5,
            "text": "Bros before hoes…..unless she’s hot",
            "title_similarity": "0.35026315",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzvkbie",
            "score": 1,
            "text": "bro's before hoes",
            "title_similarity": "0.34065002",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzvq96k",
            "score": -2,
            "text": "Be polite and courteous towards everyone.  Jesus do you guys really need a set of rules to teach you not to be an asshole?",
            "title_similarity": "0.565851",
            "sentiment_compound": 0.5106
        },
        {
            "id": "gzvqu7h",
            "score": 3,
            "text": "Honestly, nothing at all.  Bro code usually covers two categories.  Common sense stuff anyone can figure out, or toxic BS that guys try to justify by calling bro code.  Nobody needs bro code to know that sleeping with a guy's wife/gf is wrong.  We also don't need some dickhead chanting bros before hoes when you skip guys night for a date.  Having a bro code is just more harm than good.",
            "title_similarity": "0.6631172",
            "sentiment_compound": 0.3746
        },
        {
            "id": "gzvn2k9",
            "score": 2,
            "text": "Bros before hoes",
            "title_similarity": "0.37687492",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzv25ma",
            "score": -28,
            "text": "What is wrong with chit chat while peeing?",
            "title_similarity": "0.5106677",
            "sentiment_compound": -0.4767
        },
        {
            "id": "gzvo2cf",
            "score": -17,
            "text": "1) Bros before hoes. The bond between two men is stronger than that between a man\nand a woman because on an average, men are stronger than women. That’s just science.\n2) A bro is always entitled to do something stupid as long as the rest of his bros are all\ndoing it. For example... If only one Spanish dude were to run down the street in front of \na bunch of angry bulls, people would have been like \"Dude, come on!!\". The license to\n be stupid is why we have bros in the first place.\n3) If a bro gets a dog, it must be at least as tall as his knee when full grown. Corollary to\nthis states, naming a lap-dog after a pro-wrestler or a character from a Steve McLain\nthe movie does not absolve a bro from this article.\n4) A bro never divulges the existence of the bro code to a woman. It is a sacred document not to be shared with chicks for any reason.\n5) Whether he cares about sports or not, a bro cares about sports\n6) A bro shall not lollygag if he must get naked in front of other bros in a gym locker \nroom. Corollary to this states, if a bro gets naked in the locker room, all other bros shall\n pretend that nothing out of the ordinary is happening while at the same time\nimmediately averting their eyes. When in doubt, remember the old adage. If your towel\ndrops to the ground, so should your eyes.\n7) A bro never sends a greeting card to another bro. There are no sentiments between\ntwo bros that cannot be articulated through the convenience and emotional distance of \nelectronic mail.\n8) A bro never admits he can’t drive a stick even after an accident.\n9) Should a bro lose a body part due to an accident or illness, his fellow bros will not\nmake lame jokes such as \"Gimme three\" or \"Wow!! Quitting your job like that really\ntook a lot of balls!!\" It’s still a hi-five and that bro still has a lot of balls, metaphorically\nspeaking of course.\n10) A bro will drop whatever he is doing and rush to help his bro dump a chick. It’s\nnormal for a bro to get confused and disoriented when dumping a chick. For some\nreason he is worried she will become agitated or even violent after he calmly explains\nhis desire to hook up with her friends. This is when a bro most needs his bro to remind \nhim that there are plenty of chick in the ocean and that a breakup need not be hazardous,\nstressful or even time- consuming. How to dump a chick in 6 words or less...\n- “Maybe try a side salad instead.\"\n- “Cute!! You ‘re growing a moustache too!!\"\n- “She looks like a younger you!!\"\n- “I will finance a boob job.\"\n- “Sorry I threw your shoes out.\"\n- “Your sister let me do that!!\"\n11) A bro may ask another bro to help him move. But only after first disclosing an\nhonest estimate on both time commitment and number of large furniture pieces. If the\n bro has vastly underestimated, either his bros retain the right to leave his possessions\nwhere they are, in most cases stuck in a door-way.\n12) Bros do not share dessert.\n13) All bros shall dub one of their bros his wingman.\n14) If a chick enquires about another bros’ sexual history, a bro shall honor the Br-ode\nof silence and play dumb. Better to have women think that all men are stupid than to tell\nthe truth.\n15) A bro never dances with his hands above his head.\n16) A bro should be able to recite anytime the following reigning champions: Super \n bowl, World series and PlayMate of the year.\n17) A bro shall be kind and courteous to his co-workers unless they are beneath him on\nthe pyramid of screaming. America was built on the backs of men and women who\nwere yelled at to work harder and the tradition has been screamed to generation from\ngeneration. But you just can’t scream at anybody. You can only scream beneath you.\n18) If a bro spearheads a beer run at a party, he is entitled to any excess monies accrued \nafter canvassing the group.\n Note: To avoid confrontation it’s a good idea to jettison the receipt before returning to\nthe party.\n19) A bro shall not sleep with another bro’s sister. However, a bro shall not get angry if \nanother bro says \"Dude, your sister’s hot!!\". Corollary, it is probably better for everyone\nif bros just hide pictures of their sisters when other bros are coming over. When in\ndoubt refers to the checklist for bro-proofing your home.\n20) A Bro respects his Bros in the military because they've selflessly chosen to defend \nthe nation, but more to the point, because they can kick his ass six ways to Sunday.\n21) A Bro never shares observations about another Bro's smoking-hot girlfriend. Even if \nthe Bro with the hot girlfriend attempts to bait the Bro by saying \"she's smoking-hot,\nhuh?\" a Bro shall remain silent, because in this situation, he's the only one who should \n be baiting.\n22) There is no law that prohibits a woman from being a Bro. Women make excellent\n bros because they can translate and navigate the confusing and contradictory whims that\ncomprise the chick code (Chick do have the chick code!!).\n23) When flipping through TV channels with his Bros, a Bro is not allowed to skip past\na program featuring boobs. This includes but is not limited to, exercise shows, women's\nathletics, and on some occasions surgery programs.\n24) When wearing a baseball cap, a Bro may position the brim at either 12 or 6 o'clock.\nAll other angles are reserved for rappers and the handicapped.\n25) A Bro doesn't let another Bro get a tattoo, particularly a tattoo of a girls name. The\nthe average relationship between a man and a woman lasts 83 days. The relationship\n between man and his skin lasts a lifetime and must be nurtured because the skin is the\nlargest and second most important organ a man has.\n26) Unless he has children, a Bro shall not wear his cell phone on a belt clip.\n27) A Bro never removes his shirt in front of other Bros, unless at a resort pool or the\n beach. Corollary, a bro with a coat of fur on his back, keeps that thing covered at all\ntimes even at resorts, pools or beaches.\n28) A Bro will, in a timely manner, alert his Bro to the existence of a fight between two\nfellow human beings of the female variety. If an informed bro is unable to witness the\nfight first hand, a spotter bro is responsible for documenting and relating details of girl\nfight via pictures, video or, barring any other reasonable method, interpretive dance\nand/or pantomime.\n29) If two Bros decide to catch a movie together, they may not attend a screening that\n begins after 4:40pm. Also despite the cost savings, they shall not split a tub of popcorn,\nchoosing instead to procure individual bags.\n30) A Bro doesn't compra-shop.",
            "title_similarity": "0.41368037",
            "sentiment_compound": 0.9673
        },
        {
            "id": "gzvxb69",
            "score": 6,
            "text": "Don't use the term bro code if you're older than 18.",
            "title_similarity": "0.6358298",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzwasw6",
            "score": 1,
            "text": "Don't touch his ex",
            "title_similarity": "0.5642712",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzxieze",
            "score": -1,
            "text": "None.  Bro codes are masochistic and full of toxic masculinity.",
            "title_similarity": "0.45673874",
            "sentiment_compound": -0.4939
        },
        {
            "id": "gzvembf",
            "score": -23,
            "text": "Eat the rich",
            "title_similarity": "0.17894873",
            "sentiment_compound": 0.5574
        },
        {
            "id": "gzvnpxh",
            "score": 9,
            "text": "Respect woman and get involved if you see someone being verbally, physically or emotionally assaulted. For the sake of this post because it's someone else's sister, mother, etc..but generally speaking because they are people too.",
            "title_similarity": "0.34269372",
            "sentiment_compound": -0.0772
        },
        {
            "id": "gzy54a9",
            "score": 0,
            "text": "Cash, Ass or Grass",
            "title_similarity": "0.17473672",
            "sentiment_compound": -0.5423
        },
        {
            "id": "gzybm95",
            "score": 0,
            "text": "10 commandments is the original bro code.",
            "title_similarity": "0.31572855",
            "sentiment_compound": 0.3182
        },
        {
            "id": "gzvxapw",
            "score": -3,
            "text": "Did an American ask this?",
            "title_similarity": "0.3667394",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzxexoo",
            "score": -1,
            "text": "The \"bro mentality\" is fucking stupid and you sound like a moron when you say the word bro.",
            "title_similarity": "0.5091627",
            "sentiment_compound": -0.659
        },
        {
            "id": "gzvntq7",
            "score": -13,
            "text": "I posted the flowing on another post and it was down voted. Not sure if it's just different times we grew up in. But something that stuck with me is to never meddle in the affairs of your friends. Even if he is cheating on his girl, you are not to tell her anything. The only thing you can do is to try to make him see what he is doing is wrong. What do yall think?",
            "title_similarity": "0.65991247",
            "sentiment_compound": -0.8352
        },
        {
            "id": "gzwuaiv",
            "score": 3,
            "text": "Don’t try and get with your friends ex, especially when they’ve only been broken up for a week or two.",
            "title_similarity": "0.5140232",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzvqsab",
            "score": 12,
            "text": "You find out one of your boys hit a girl. He is 1) not one of your boys anymore and 2) should have his chin checked by you and the rest of the boys.",
            "title_similarity": "0.5067599",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzvwv9x",
            "score": 2,
            "text": "When you get into fight you stop once the other one is on the ground.",
            "title_similarity": "0.40031695",
            "sentiment_compound": -0.5859
        },
        {
            "id": "gzvv42n",
            "score": -8,
            "text": "Controversial bro regulation:  you’re on a guys’ trip.  You’re all out at a bar/club.  You see your good buddy, who has a spouse/long-time significant other with whom you are friends — but not as good friends as you are with your buddy — start making out with someone else with whom he disappears for the rest of the night.  You say nothing to your buddy’s spouse/s.o.",
            "title_similarity": "0.3995126",
            "sentiment_compound": -0.7608
        },
        {
            "id": "gzvxif5",
            "score": 6,
            "text": "Never call another grown man “chief” or “boss”",
            "title_similarity": "0.40324262",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzv6xey",
            "score": 3,
            "text": "Wheaton's Law basically covers all bro code.",
            "title_similarity": "0.3937349",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzvobkg",
            "score": 4,
            "text": "Always keep to the left with your shopping cart and make way when another bro wants to pass you",
            "title_similarity": "0.46872863",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzvsvta",
            "score": 6,
            "text": "If you haven’t gotten laid in a certain amount of time your bros should jack you off or offer their holes for your raging hard on. It’s the only way to keep good straight men from turning homosexual",
            "title_similarity": "0.5441854",
            "sentiment_compound": 0.2732
        },
        {
            "id": "gzw1ryr",
            "score": 5,
            "text": "A, B, Up, Down, A, B, Left, Right, A, B, Select, Start.",
            "title_similarity": "0.30982918",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzvo7ck",
            "score": 26,
            "text": "dont joke about everything and call it DaRk HumOr",
            "title_similarity": "0.5308202",
            "sentiment_compound": 0.0547
        },
        {
            "id": "gzwoxe7",
            "score": 6,
            "text": "Don’t try to have sex with super intoxicated women",
            "title_similarity": "0.5279604",
            "sentiment_compound": 0.5994
        },
        {
            "id": "gzvy3y7",
            "score": 1,
            "text": "Don’t date the ex of one of your bros.. that’s just common sense.",
            "title_similarity": "0.75333226",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzw3arz",
            "score": 1,
            "text": "No snitching",
            "title_similarity": "0.4767682",
            "sentiment_compound": -0.296
        },
        {
            "id": "gzwbm0m",
            "score": 1,
            "text": "Don’t fuck your bros ex’s. Shouldn’t even have to be said.",
            "title_similarity": "0.71560663",
            "sentiment_compound": -0.5423
        },
        {
            "id": "gzwq8sd",
            "score": 1,
            "text": "When sucking Putin’s dick, make sure you don’t hog and offer Boris Johnson a couple of bobs down the Russian man meat. Can’t get more international bro-friendly than that.",
            "title_similarity": "0.60380065",
            "sentiment_compound": -0.25
        },
        {
            "id": "gzwy23g",
            "score": -1,
            "text": ">An example would be no chit chat while peeing\n\n\"Nice ring.\"",
            "title_similarity": "0.7289554",
            "sentiment_compound": 0.1531
        },
        {
            "id": "gzwyg1k",
            "score": 1,
            "text": "Dont talk to me when I am at the urinal... thanks",
            "title_similarity": "0.55338365",
            "sentiment_compound": 0.4404
        },
        {
            "id": "gzwyult",
            "score": 1,
            "text": "Every man is your brother and should be treated as such.",
            "title_similarity": "0.42139733",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzxd7mz",
            "score": 1,
            "text": "Don't have sex with your bros ex",
            "title_similarity": "0.63588107",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzygj82",
            "score": 1,
            "text": "[deleted]",
            "title_similarity": "0.31642208"
        },
        {
            "id": "gzvo9fl",
            "score": 34,
            "text": "Bros before hoes. Never let a girl ruin a relationship between you and your bro",
            "title_similarity": "0.59424514",
            "sentiment_compound": -0.5859
        },
        {
            "id": "gzvov2m",
            "score": 15,
            "text": "Don’t use the uranyl by another man.",
            "title_similarity": "0.6154146",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzvocvx",
            "score": 2,
            "text": "Don’t date somebody close to your bro (Sister, Brother, Ex) without talking about it with them first",
            "title_similarity": "0.5808077",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzvtmt5",
            "score": 2,
            "text": "It isnt gay if you have long socks on",
            "title_similarity": "0.51582235",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzvumu4",
            "score": 2,
            "text": "Friends ex is off limits unless you are explicitly given verbal permission to pursue the ex.",
            "title_similarity": "0.6556276",
            "sentiment_compound": 0.4767
        },
        {
            "id": "gzw3isy",
            "score": 2,
            "text": "the brojob of course, choo choooo!!",
            "title_similarity": "0.35314918",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzw3nto",
            "score": 2,
            "text": "I like to ask, \"How's it hangin?\" To make others uncomfortable while peeing.",
            "title_similarity": "0.46648893",
            "sentiment_compound": -0.0258
        },
        {
            "id": "gzw9guu",
            "score": 2,
            "text": "When sleeping with a bros sister/mother always bring flowers the next morning to then as a sign of respect.",
            "title_similarity": "0.32068962",
            "sentiment_compound": 0.4767
        },
        {
            "id": "gzwh19i",
            "score": 2,
            "text": "It's not gay to give you bro head on his birthday.  It's just being a good bro.",
            "title_similarity": "0.60146797",
            "sentiment_compound": 0.4404
        },
        {
            "id": "gzwr2sr",
            "score": 2,
            "text": "Don’t sexually assault women. \n\nSeriously.",
            "title_similarity": "0.59134173",
            "sentiment_compound": -0.6705
        },
        {
            "id": "gzwt623",
            "score": -2,
            "text": "I'm not your bro, \"BRO\". Don't assume someone is your \"bro\" without a written confirmation and expect them to follow some \"bro code\". And NO PHYSICAL CONTACT, EVER, \"BRO\".",
            "title_similarity": "0.76850665",
            "sentiment_compound": -0.4466
        },
        {
            "id": "gzwuajw",
            "score": 2,
            "text": "Don’t fuck around with your homies chick",
            "title_similarity": "0.5899427",
            "sentiment_compound": -0.5423
        },
        {
            "id": "gzwxbep",
            "score": 2,
            "text": "Expressing pain, anxiety, and sorrow in front of your mates is alright and shouldn't be taken as a sign of weakness",
            "title_similarity": "0.50746804",
            "sentiment_compound": -0.8481
        },
        {
            "id": "gzwz37l",
            "score": 2,
            "text": "[deleted]",
            "title_similarity": "0.31642208"
        },
        {
            "id": "gzwzo6t",
            "score": 2,
            "text": "No chit chat while peeing? Really. That's your example of \"bro code\" lol. \n\nYou can absolutely talk while peeing. I think some folks are at their comedic best while we're all holding our own urine guns.",
            "title_similarity": "0.57975703",
            "sentiment_compound": 0.8176
        },
        {
            "id": "gzxeepl",
            "score": 2,
            "text": "Growing up and quitting this \"bro-code\" shit? I'm not 12.",
            "title_similarity": "0.5465729",
            "sentiment_compound": -0.4404
        },
        {
            "id": "gzxjue2",
            "score": 2,
            "text": "Never comment negatively on a bros girl. We all like different things and love is blind.",
            "title_similarity": "0.5092462",
            "sentiment_compound": 0.6124
        },
        {
            "id": "gzxmhrx",
            "score": -2,
            "text": "Never look into another bros eyes during a devils threeway.",
            "title_similarity": "0.44856372",
            "sentiment_compound": -0.5719
        },
        {
            "id": "gzxmjjy",
            "score": 2,
            "text": "Nothing, bro code is dumb. Always do what is morally and ethically right",
            "title_similarity": "0.6101817",
            "sentiment_compound": -0.5106
        },
        {
            "id": "gzxrfi4",
            "score": 2,
            "text": "Never, for any reason, refer to a grown man as 'bro'.",
            "title_similarity": "0.44973257",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzxy9tr",
            "score": -2,
            "text": "if a bro comes up and flirts with your girl, he's testing her. Thank that bro for revealing the truth about the state of your relationship",
            "title_similarity": "0.46456838",
            "sentiment_compound": 0.6705
        },
        {
            "id": "gzxyg7z",
            "score": -2,
            "text": "In the words of a wise man. Fuck bitches. Get money.",
            "title_similarity": "0.3276637",
            "sentiment_compound": -0.6486
        },
        {
            "id": "gzy3vsv",
            "score": 2,
            "text": "If you’d like to date your bro’s sister... ask first",
            "title_similarity": "0.4203345",
            "sentiment_compound": 0.3612
        },
        {
            "id": "gzynrxt",
            "score": 2,
            "text": "If a hoe cheat on yo wit yo bro and yo bro is da one to inform yo. The fault belongs to tha hoe not yo bro.",
            "title_similarity": "0.59207",
            "sentiment_compound": -0.6908
        },
        {
            "id": "gzvoklj",
            "score": 19,
            "text": "Dont talk to your mates gyal when they break up, not even when she tries to talk to you.\n\nIf you see her by accident in the shop its fine, I'm talking about social media, text etc.",
            "title_similarity": "0.6023441",
            "sentiment_compound": -0.3182
        },
        {
            "id": "gzvoqfh",
            "score": 20,
            "text": "Don't date another bro's ex.",
            "title_similarity": "0.62393236",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzvres2",
            "score": 50,
            "text": "Seize the means of production",
            "title_similarity": "0.21896309",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzv857s",
            "score": 98,
            "text": "[removed]",
            "title_similarity": "0.31200892"
        },
        {
            "id": "gzvrdin",
            "score": 2,
            "text": "Always say \"no homo\" after you kiss. Wouldn't want it to be gay.",
            "title_similarity": "0.7239183",
            "sentiment_compound": 0.3773
        },
        {
            "id": "gzvuhny",
            "score": 3,
            "text": "If a mate of yours is interested in a girl, don’t try to compete with him or flirt with said girl. It’s sketchy, more than a little disrespectful, and chances are you and your mate won’t be on good terms if you try anything.",
            "title_similarity": "0.6304723",
            "sentiment_compound": 0.73
        },
        {
            "id": "gzvx4z0",
            "score": 3,
            "text": "It's only gay if the balls touch.",
            "title_similarity": "0.4376697",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzw9mr7",
            "score": 3,
            "text": "You can pick your nose and you can pick your friends. But you can’t pick your friends nose.",
            "title_similarity": "0.66065216",
            "sentiment_compound": 0.7351
        },
        {
            "id": "gzvw7lp",
            "score": 4,
            "text": "If your bro has a proper breakup with his partner, and for some reason you have her on social media, just remove her and make a point of letting him know you have his back.\n\nThis only applies if you only met her through him. If you were already close friends with her it's a bit different. It's just about showing loyalty.",
            "title_similarity": "0.5883621",
            "sentiment_compound": 0.765
        },
        {
            "id": "gzvmwpm",
            "score": 20,
            "text": "Invite him to smash every once in awhile.\n\nTrue bros will understand.",
            "title_similarity": "0.39788124",
            "sentiment_compound": 0.5267
        },
        {
            "id": "gzwop7d",
            "score": 7,
            "text": "Always salt your pasta while boiling it",
            "title_similarity": "0.3082743",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzvfxmi",
            "score": 53,
            "text": "This is the only post where I laughed at ever comment. You people are awesome",
            "title_similarity": "0.32052344",
            "sentiment_compound": 0.7964
        },
        {
            "id": "gzv2sb9",
            "score": 477,
            "text": "[deleted]",
            "title_similarity": "0.31642208"
        },
        {
            "id": "gzvnfxj",
            "score": 94,
            "text": "If a bro commits rape or sexual assault then it is your job to beta the shit out of him",
            "title_similarity": "0.4405579",
            "sentiment_compound": -0.6597
        },
        {
            "id": "gzvusxm",
            "score": 7,
            "text": "Never snitch on you homies unless they do a literal huge crime.",
            "title_similarity": "0.54528946",
            "sentiment_compound": -0.296
        },
        {
            "id": "gzwlxj7",
            "score": 7,
            "text": "If you know a girl has a man, fuck off. That’s not cool. And if you already fucked around with the chick, and later find out she has a man. Tell him. That’s bro code.",
            "title_similarity": "0.5511354",
            "sentiment_compound": -0.8709
        },
        {
            "id": "gzv4isj",
            "score": 751,
            "text": "Always lose your virginity to your friends and never to a girl",
            "title_similarity": "0.5017646",
            "sentiment_compound": 0.1027
        },
        {
            "id": "gzv3esa",
            "score": 386,
            "text": "[deleted]",
            "title_similarity": "0.31642208"
        },
        {
            "id": "gzvm690",
            "score": 28,
            "text": "If you can feel a bro is self conscious about something don’t call him out on it, if he brings it up show nothing but positivity",
            "title_similarity": "0.6726665",
            "sentiment_compound": -0.5504
        },
        {
            "id": "gzvyjkc",
            "score": 32,
            "text": "Never be more funnier around a bro who is trying to impress his crush.",
            "title_similarity": "0.34833467",
            "sentiment_compound": -0.0451
        },
        {
            "id": "gzv7fhy",
            "score": 131,
            "text": "It isn't gay if you keep your socks on",
            "title_similarity": "0.5422053",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzvrtkq",
            "score": 13,
            "text": "That the next time there's a nazi slowly killing a human being with a knee on his neck we all bum rush those fools together.",
            "title_similarity": "0.27517587",
            "sentiment_compound": -0.8225
        },
        {
            "id": "gzv291n",
            "score": 809,
            "text": "Dont kick a dude in the balls",
            "title_similarity": "0.5396259",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzv9z5a",
            "score": 899,
            "text": "Don’t be rapey",
            "title_similarity": "0.51577973",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzvetw9",
            "score": 716,
            "text": "Always kiss the homies goodnight",
            "title_similarity": "0.33686838",
            "sentiment_compound": 0.4215
        },
        {
            "id": "gzvdjdz",
            "score": -17,
            "text": "[removed]",
            "title_similarity": "0.31200892"
        },
        {
            "id": "gzvti6c",
            "score": 18,
            "text": "If a girl rejected your bro, it’s okay for you to date her but bro code indicates you should let your bro know your intentions before you pursue her.",
            "title_similarity": "0.6667987",
            "sentiment_compound": -0.1779
        },
        {
            "id": "gzvo61r",
            "score": 19,
            "text": "No lengthy eye contact. You know who you are.",
            "title_similarity": "0.3797313",
            "sentiment_compound": -0.296
        },
        {
            "id": "gzvdund",
            "score": 167,
            "text": "Talk to the bro if you like an ex of his. And then respect if he says no. This rule is voided if the bro in question is actually a complete dickbag and you dropped him faster than a person drops their shit into a toilet.",
            "title_similarity": "0.5683628",
            "sentiment_compound": 0.25
        },
        {
            "id": "gzvlt6g",
            "score": 51,
            "text": "Oh my fuck, my coworker makes idle chit chat in the bathroom. Bro shut the fuuuck up man",
            "title_similarity": "0.41557306",
            "sentiment_compound": -0.5423
        },
        {
            "id": "gzvj43p",
            "score": 59,
            "text": "Always start off your morning on the throne.",
            "title_similarity": "0.2635362",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzvmt3x",
            "score": 23,
            "text": "Dont date/fuck your bestfriends sister",
            "title_similarity": "0.52845275",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzwermh",
            "score": 24,
            "text": "Be cool to our female bros.",
            "title_similarity": "0.37071162",
            "sentiment_compound": 0.3182
        },
        {
            "id": "gzvskrt",
            "score": 61,
            "text": "Don't put other people down. Period. Full stop.",
            "title_similarity": "0.48020354",
            "sentiment_compound": -0.296
        },
        {
            "id": "gzvo4bv",
            "score": 417,
            "text": "Ask permission before going for a girl that your bro was once an item with.  \n\nYou never know if they still talk, and if you flirting would sway her favor away from him.",
            "title_similarity": "0.5774435",
            "sentiment_compound": 0.5423
        },
        {
            "id": "gzvpfkk",
            "score": 120,
            "text": "X/2+7",
            "title_similarity": "0.16774115",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzw6jah",
            "score": 74,
            "text": "Always accept gum or a mint if offered.",
            "title_similarity": "0.3384366",
            "sentiment_compound": 0.3818
        },
        {
            "id": "gzvnkbe",
            "score": 30,
            "text": "Don’t piss next to me when farther away urinals are available.",
            "title_similarity": "0.64319324",
            "sentiment_compound": -0.4019
        },
        {
            "id": "gzvtlj5",
            "score": 28,
            "text": "Don’t choose the urinal directly next to another guy unless it’s the only one open",
            "title_similarity": "0.5915842",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzvo7d8",
            "score": 378,
            "text": "Don't fuck a bro's mom",
            "title_similarity": "0.6657059",
            "sentiment_compound": 0.431
        },
        {
            "id": "gzvrenj",
            "score": 330,
            "text": "Don't rape, or accept any other guy if he's a rapist. Bros together against pigs.",
            "title_similarity": "0.59977967",
            "sentiment_compound": -0.5181
        },
        {
            "id": "gzva2eu",
            "score": 138,
            "text": "Don't be a dick.",
            "title_similarity": "0.44661248",
            "sentiment_compound": 0.4023
        },
        {
            "id": "gzvix5c",
            "score": 279,
            "text": "Downwards head nod: *you good?* / *you seeing this shit?*\n\nUpwards head nod: *hows it going man?* / *its you you beautiful bastard*",
            "title_similarity": "0.368936",
            "sentiment_compound": -0.3591
        },
        {
            "id": "gzvvvwu",
            "score": 220,
            "text": "When your bro is telling a story don’t correct him just go with it. Stories aren’t meant to be factual they’re meant to entertain",
            "title_similarity": "0.6447178",
            "sentiment_compound": 0.3182
        },
        {
            "id": "gzwb7fl",
            "score": 44,
            "text": "Never make a joke about something a person has no control over.  Ex. Being short",
            "title_similarity": "0.5340408",
            "sentiment_compound": -0.4745
        },
        {
            "id": "gzvf80r",
            "score": 1292,
            "text": "Never BBQ on another mans grill unless explicitly asked",
            "title_similarity": "0.6075038",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzvtjyi",
            "score": 43,
            "text": "If two bros got eyes for the same girl/guy/whomever, then neither of them jumps for it",
            "title_similarity": "0.54371",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzvda9b",
            "score": 508,
            "text": ">An example would be no chit chat while peeing\n\n  \nWhat if his dick is just really nice though and you have to compliment it",
            "title_similarity": "0.6802784",
            "sentiment_compound": 0.1761
        },
        {
            "id": "gzvu5rk",
            "score": 123,
            "text": "Never sleep with another man's wife / girlfriend, even if you don't know the guy and she's the one pursuing you. People get hurt. It's just... not worth it.",
            "title_similarity": "0.5307224",
            "sentiment_compound": -0.6207
        },
        {
            "id": "gzvurek",
            "score": 126,
            "text": "If your bro picks a fight he's on his own, if someone picks a fight with him you help out.",
            "title_similarity": "0.5080078",
            "sentiment_compound": -0.3612
        },
        {
            "id": "gzvn2xe",
            "score": 54,
            "text": "Don't ever come between a man and his meal\n\nEdit: this is a quote by Dave Chappelle in his unforgiven special. Super powerful. I highly recommend y'all give it a watch.",
            "title_similarity": "0.64007413",
            "sentiment_compound": 0.9041
        },
        {
            "id": "gzvnjc3",
            "score": 2282,
            "text": "You treat your friend's sister as your sister.",
            "title_similarity": "0.29224104",
            "sentiment_compound": 0.4019
        },
        {
            "id": "gzvmetp",
            "score": 666,
            "text": "Never fuck with a man's wife, kids, tools, car, house. But nothing is sacred anymore.",
            "title_similarity": "0.55163133",
            "sentiment_compound": 0.2323
        },
        {
            "id": "gzvp65o",
            "score": 382,
            "text": "Borrowing.  If you borrow something bring it back right away, clean.   If it’s motorized make sure it has more file than when you took it.  If you need to borrow something a second time go buy your own.",
            "title_similarity": "0.46002734",
            "sentiment_compound": 0.6124
        },
        {
            "id": "gzvti93",
            "score": 495,
            "text": "When in the bathroom and you are peeing, leave 1 urinal between us. Don't pee right next to me.",
            "title_similarity": "0.58943033",
            "sentiment_compound": -0.0516
        },
        {
            "id": "gzvqi1i",
            "score": 319,
            "text": "If you are no longer bro’s with someone. Don’t go airing out all their dirty laundry.\n\nJust had that happen to me. Dude, we’re adults, I don’t have time for this petty drama.",
            "title_similarity": "0.60218716",
            "sentiment_compound": -0.7269
        },
        {
            "id": "gzva8xs",
            "score": 1034,
            "text": "Don't shoot at medics and stretcher bearers.",
            "title_similarity": "0.5857489",
            "sentiment_compound": 0.2584
        },
        {
            "id": "gzvmqvp",
            "score": 1049,
            "text": "One trip with the groceries. Never two.",
            "title_similarity": "0.46279874",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzvv8qv",
            "score": 223,
            "text": "[deleted]",
            "title_similarity": "0.31642208"
        },
        {
            "id": "gzv3she",
            "score": 1655,
            "text": "Do no harm.\n\nTake no shit.",
            "title_similarity": "0.43416288",
            "sentiment_compound": 0.6979
        },
        {
            "id": "gzvhapa",
            "score": 2554,
            "text": "Always re-rack your weights at the gym",
            "title_similarity": "0.17563935",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzvkj1v",
            "score": 266,
            "text": "Help a bro out when he’s feeling down, being a dude sucks for support so be the support your bros need",
            "title_similarity": "0.4738446",
            "sentiment_compound": 0.7479
        },
        {
            "id": "gzwrenl",
            "score": 447,
            "text": "If a man dies, delete his browser history.",
            "title_similarity": "0.41649294",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzv359z",
            "score": 4009,
            "text": "Don’t fuck with another mans car",
            "title_similarity": "0.49459803",
            "sentiment_compound": -0.5423
        },
        {
            "id": "gzv2tiq",
            "score": 3136,
            "text": "When a friend is chasing a girl, always be his wingman",
            "title_similarity": "0.296148",
            "sentiment_compound": 0.4939
        },
        {
            "id": "gzvplki",
            "score": 880,
            "text": "If he calls you and says he needs help, or he's feeling down, you rush to his side. No questions asked.",
            "title_similarity": "0.5395561",
            "sentiment_compound": 0.25
        },
        {
            "id": "gzvj0pq",
            "score": 1323,
            "text": "If your homie wants to talk about their feelings, listen to them.\n\nNormalise men being open about their emotions, god dammit!",
            "title_similarity": "0.46237934",
            "sentiment_compound": 0.3382
        },
        {
            "id": "gzvpn51",
            "score": 1484,
            "text": "If his girl wants to cheat on him with you, don't do it. Break the news to your bro.\n\nGood luck out there, Kings!\n\nEdit: Thank you for the awards! I'm glad to read your responses and see that we try to keep our brothers' interest at heart. Stay strong out there.",
            "title_similarity": "0.58062077",
            "sentiment_compound": 0.9701
        },
        {
            "id": "gzvpv15",
            "score": 2856,
            "text": "Never put a man down for what he does for a living (unless it’s illegal). Point is, he provides for his own: no man should be judged for that.",
            "title_similarity": "0.62463486",
            "sentiment_compound": -0.7003
        },
        {
            "id": "gzv4hjk",
            "score": 7692,
            "text": "if a another dude heads nods to you, always respond in kind.\n\nedit : ayy  thanks for the upvotes and awards",
            "title_similarity": "0.3927743",
            "sentiment_compound": 0.8519
        },
        {
            "id": "gzvwggq",
            "score": 220,
            "text": "If you you are male and your room mate is also male and entertaining a guest ,   \n\nEither stay in your room or go somewhere else ,\nAnd never barge in the common areas \n\nBe like the wind",
            "title_similarity": "0.51651525",
            "sentiment_compound": 0.6597
        },
        {
            "id": "gzvi0wb",
            "score": 4385,
            "text": "Lift a bro up, don't push a bro down",
            "title_similarity": "0.52662486",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzwdg40",
            "score": 246,
            "text": "If your bro dies doing weights, put some extra weights on the bar THEN can 999",
            "title_similarity": "0.3993262",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzvnam9",
            "score": 2954,
            "text": "If a bro is moving, help your bro move.\nIf you’re the bro moving, provide brewskis.",
            "title_similarity": "0.44041467",
            "sentiment_compound": 0.4019
        },
        {
            "id": "gzvdp25",
            "score": 9518,
            "text": "Hype up your guy when you're around the gal he likes. Don't put him down even if it's jokes",
            "title_similarity": "0.46702856",
            "sentiment_compound": 0.5859
        },
        {
            "id": "gzvrrg4",
            "score": 321,
            "text": "If you told a bro about a girl you like then he should not try to get with her even if it’s only one night. Looking at you Murat.",
            "title_similarity": "0.7023325",
            "sentiment_compound": 0.3612
        },
        {
            "id": "gzv2om0",
            "score": 13784,
            "text": "Don’t embarrass another guy just to impress a girl",
            "title_similarity": "0.46590102",
            "sentiment_compound": 0.1779
        },
        {
            "id": "gzvafss",
            "score": 14449,
            "text": "Never make fun of a bro when he tells you something he cares about. Lift eachother up",
            "title_similarity": "0.6471542",
            "sentiment_compound": 0.0767
        },
        {
            "id": "gzvkz0u",
            "score": 9689,
            "text": "Don't throw shade on a man in front of his crush",
            "title_similarity": "0.5702737",
            "sentiment_compound": -0.1531
        },
        {
            "id": "gzvp7oz",
            "score": 7756,
            "text": "Protect your bro’s dignity even when he is not around.",
            "title_similarity": "0.44693407",
            "sentiment_compound": 0.6486
        },
        {
            "id": "gzvrelq",
            "score": 1390,
            "text": "If you borrow a tool, bring it the fuck back in a timely fashion.",
            "title_similarity": "0.40872133",
            "sentiment_compound": -0.5423
        },
        {
            "id": "gzvhtx4",
            "score": 1,
            "text": "[deleted]",
            "title_similarity": "0.31642208"
        },
        {
            "id": "gzvkxkv",
            "score": 1,
            "text": "Public restroom edict and when you know your best friend and or brother is having sex and your not don't hate congratulate",
            "title_similarity": "0.39490658",
            "sentiment_compound": 0.7979
        },
        {
            "id": "gzvlxe2",
            "score": 1,
            "text": "\"Harry, real quick, don't lie.\"",
            "title_similarity": "0.42447925",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzvmgt7",
            "score": 2,
            "text": "Calling shotgun",
            "title_similarity": "0.26498577",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzvmllr",
            "score": 1,
            "text": "Head up is \"hey\"\n\nHead down is \"Yeah man\"",
            "title_similarity": "0.24966364",
            "sentiment_compound": 0.296
        },
        {
            "id": "gzvnbs3",
            "score": 1,
            "text": "Always give a bro nod when you see someone you kinda know but not too close to actually approach and say hi",
            "title_similarity": "0.5044234",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzvo7jw",
            "score": 9,
            "text": "Don’t cut another mans lunch",
            "title_similarity": "0.55867755",
            "sentiment_compound": -0.2732
        },
        {
            "id": "gzvoap5",
            "score": 1,
            "text": "Bros before ho's",
            "title_similarity": "0.38650948",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzvoavq",
            "score": 1,
            "text": "Never rub another man's rhubarb-The Joker",
            "title_similarity": "0.5235297",
            "sentiment_compound": 0.128
        },
        {
            "id": "gzvp3l7",
            "score": 1,
            "text": "“Nice cock bro”",
            "title_similarity": "0.26226553",
            "sentiment_compound": -0.1531
        },
        {
            "id": "gzvpg6v",
            "score": 1,
            "text": "Don't steal my bench at the gym when I walk away for 15 seconds grabbing some weights.",
            "title_similarity": "0.423007",
            "sentiment_compound": 0.3875
        },
        {
            "id": "gzvpjh3",
            "score": 1,
            "text": "A man should never cockblock another man unless he is trying to fuck his mom",
            "title_similarity": "0.6229049",
            "sentiment_compound": -0.5423
        },
        {
            "id": "gzvps6f",
            "score": 2,
            "text": "Don't mock another dude's facial hair. Even if he doesn't have much growth or whatever, if he likes it you hype it",
            "title_similarity": "0.52360356",
            "sentiment_compound": 0.4493
        },
        {
            "id": "gzvpzjy",
            "score": 1,
            "text": "If you know a guy is interested in someone, never try to get with that someone.",
            "title_similarity": "0.59870297",
            "sentiment_compound": 0.4019
        },
        {
            "id": "gzvpzx7",
            "score": 2,
            "text": "Do not abandon your bros because you are in a relationship.",
            "title_similarity": "0.49478596",
            "sentiment_compound": 0.3412
        },
        {
            "id": "gzvq06u",
            "score": 1,
            "text": "Talk shit get hit unless you're a coward",
            "title_similarity": "0.4832507",
            "sentiment_compound": -0.765
        },
        {
            "id": "gzvqbkc",
            "score": 1,
            "text": "You all are amazing. I've collected codes shared here. I may share as a post if rules permit.",
            "title_similarity": "0.3180192",
            "sentiment_compound": 0.8126
        },
        {
            "id": "gzvqd4m",
            "score": 1,
            "text": "Don’t ever stick your dick in another bro’s wife.",
            "title_similarity": "0.63549733",
            "sentiment_compound": -0.5106
        },
        {
            "id": "gzvqpbl",
            "score": 1,
            "text": "Always be an implied wingman.",
            "title_similarity": "0.3038373",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzvqqpm",
            "score": 13,
            "text": "Follow standard urinal etiquette......spacing, no peering over, minimize useless chatter when approaching urinal, etc",
            "title_similarity": "0.61861074",
            "sentiment_compound": -0.6124
        },
        {
            "id": "gzvqure",
            "score": 1,
            "text": "Don’t get with your mate’s exes, especially behind their backs.",
            "title_similarity": "0.62381166",
            "sentiment_compound": -0.1189
        },
        {
            "id": "gzvr3mf",
            "score": 3,
            "text": "Don't spit in the urinal.",
            "title_similarity": "0.58071357",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzvr4d4",
            "score": 7,
            "text": "Always have one urinal in between 2 people",
            "title_similarity": "0.28487733",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzvr6gb",
            "score": 6,
            "text": "[Never spill yer beans](https://www.youtube.com/watch?v=n1yaq7XWJFE)",
            "title_similarity": "0.64898795",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzvrpxl",
            "score": 3,
            "text": "work together to make women (everyone tbh) feel safe",
            "title_similarity": "0.26367766",
            "sentiment_compound": 0.4404
        },
        {
            "id": "gzvrtoe",
            "score": 1,
            "text": "Leave your mates hot ex alone UNLESS given permission. Don't ask for permission; your mate will let you know what you want.",
            "title_similarity": "0.68288374",
            "sentiment_compound": -0.2263
        },
        {
            "id": "gzvrybg",
            "score": 1,
            "text": "I don’t care to chit chat while peeing. Everyone does it.",
            "title_similarity": "0.65203255",
            "sentiment_compound": 0.4939
        },
        {
            "id": "gzvrydp",
            "score": 13,
            "text": "Bros don't let other bros stay toxic. Talk to your friends when they do something shitty. They respect you and they'll listen to you. An awkward conversation is worth improving both your lives.",
            "title_similarity": "0.52390826",
            "sentiment_compound": 0.6908
        },
        {
            "id": "gzvs0ho",
            "score": 1,
            "text": "Don't BRO me if you know me!",
            "title_similarity": "0.619814",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzvs74o",
            "score": 1,
            "text": "Never like your bro's gf/wife...",
            "title_similarity": "0.53402746",
            "sentiment_compound": -0.2755
        },
        {
            "id": "gzvs90j",
            "score": 1,
            "text": "Regardless of man or women fighting even if it's your friend, break it up and walk away",
            "title_similarity": "0.52170837",
            "sentiment_compound": 0.1779
        },
        {
            "id": "gzvsfxx",
            "score": 1,
            "text": "Don't fuck with his girl.",
            "title_similarity": "0.5742669",
            "sentiment_compound": 0.431
        },
        {
            "id": "gzvspct",
            "score": 1,
            "text": "Bros are the ultimate wingmen",
            "title_similarity": "0.2576567",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzvsq9j",
            "score": 1,
            "text": "One of the codes my brother and I kind of made up when it happened (it only happened once) is if we’re both interested in the same girl one of us has to ask the other for the blessing to ask her out and be 100% ok and no passive aggressive BS, my brother was a man about it and asked for my blessing I respected him for doing and I thought about it and said yes a few minutes later. That relationship ran its course they broke up and we don’t talk to her my brother and I are still super close.",
            "title_similarity": "0.5384758",
            "sentiment_compound": 0.952
        },
        {
            "id": "gzvsuob",
            "score": 1,
            "text": "Be nice. Simple",
            "title_similarity": "0.20022142",
            "sentiment_compound": 0.4215
        },
        {
            "id": "gzvswaj",
            "score": 1,
            "text": "Don't cock block",
            "title_similarity": "0.5263484",
            "sentiment_compound": 0.431
        },
        {
            "id": "gzvsws1",
            "score": 1,
            "text": "Never use the urinal right next to another man unless  it's the only free one.",
            "title_similarity": "0.6126003",
            "sentiment_compound": 0.5106
        },
        {
            "id": "gzvsyff",
            "score": 9,
            "text": "If a bro has something (food) on his face, notify him so it isn't there all day.",
            "title_similarity": "0.6127963",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzvszk4",
            "score": 9,
            "text": "Communicate your feelings to your bro, bro.",
            "title_similarity": "0.47387138",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzvt1si",
            "score": 1,
            "text": "use every other urinal",
            "title_similarity": "0.28691226",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzvtelw",
            "score": 1,
            "text": "Don't date another bro's ex",
            "title_similarity": "0.60500187",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzvti0j",
            "score": 1,
            "text": "A bros N64 isn’t for sale.",
            "title_similarity": "0.57200754",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzvtrf7",
            "score": 1,
            "text": "Don't use the urinal right next to the one your buddy's using. Leave a space. If there's none of those little partition things between the urinals, leave two.",
            "title_similarity": "0.67080176",
            "sentiment_compound": -0.1027
        },
        {
            "id": "gzvtydx",
            "score": 15,
            "text": "No kicks in the balls, no matter how much you hate the dude, some things are off limits.",
            "title_similarity": "0.6074528",
            "sentiment_compound": -0.7162
        },
        {
            "id": "gzvu0rk",
            "score": 8,
            "text": "Don’t kill each other",
            "title_similarity": "0.5043466",
            "sentiment_compound": -0.6908
        },
        {
            "id": "gzvu9dj",
            "score": 1,
            "text": "If there's any absolute rule in the bro code, it's that any other rule of the bro code can be completely overruled with consent by your bros, because that's what the bro code is all about",
            "title_similarity": "0.6496955",
            "sentiment_compound": 0.2878
        },
        {
            "id": "gzvu9ls",
            "score": 3,
            "text": "Be respectful to one another",
            "title_similarity": "0.22373778",
            "sentiment_compound": 0.4588
        },
        {
            "id": "gzvud3d",
            "score": 1,
            "text": "Dude, real bros chit chat whilst they pee. It's called pee buddies.",
            "title_similarity": "0.4311718",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzvuguk",
            "score": 1,
            "text": "Dont fuck another guy's wife",
            "title_similarity": "0.6060014",
            "sentiment_compound": 0.431
        },
        {
            "id": "gzvupzb",
            "score": 1,
            "text": "Default to walking on the right side of the path. Stay to the right, so people can pass you on the left. Similar rules to driving, it's just more efficient that way",
            "title_similarity": "0.35976696",
            "sentiment_compound": 0.4754
        },
        {
            "id": "gzvuyga",
            "score": 1,
            "text": "You and you only take care of your girl, car and gun.",
            "title_similarity": "0.4184005",
            "sentiment_compound": 0.2023
        },
        {
            "id": "gzvv4sl",
            "score": 1,
            "text": "Please don’t bang my mom bro",
            "title_similarity": "0.6900498",
            "sentiment_compound": 0.3182
        },
        {
            "id": "gzvvh04",
            "score": 1,
            "text": "The urinal .--.--.--. concept never fuck that up",
            "title_similarity": "0.56835264",
            "sentiment_compound": 0.431
        },
        {
            "id": "gzvvj0s",
            "score": 1,
            "text": "Don’t fuck your bro’s chick..even after they done",
            "title_similarity": "0.6640529",
            "sentiment_compound": -0.5423
        },
        {
            "id": "gzvvl53",
            "score": 1,
            "text": "Dont go after your bros ex. Or be a douche like my old \"friend\" and lie to me about it",
            "title_similarity": "0.5986183",
            "sentiment_compound": 0.4939
        },
        {
            "id": "gzvvsx0",
            "score": 1,
            "text": "Call them out if they speak disrespectfully toward, or _about_, women.",
            "title_similarity": "0.4651987",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzvvwpl",
            "score": 17,
            "text": "Be excellent to each other.\n\nNot just a bro code.",
            "title_similarity": "0.43039012",
            "sentiment_compound": 0.5719
        },
        {
            "id": "gzvvz21",
            "score": 1,
            "text": "If your boy gets sucker punched the person who hit him better get hit immediately after.",
            "title_similarity": "0.4348029",
            "sentiment_compound": -0.128
        },
        {
            "id": "gzvw0m8",
            "score": 1,
            "text": "Only use the middle urinal if the others are taken.",
            "title_similarity": "0.48440853",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzvw5cu",
            "score": 1,
            "text": "Lol @ no chit chat while peeing.  I seriously once got a office promotion at the urinal.  Formal, conservative environment,  manager starts peeing next to me and says: \"So! I guess you got that promotion!\"  No joke.  Still laugh about it to this day.",
            "title_similarity": "0.46812153",
            "sentiment_compound": 0.4932
        },
        {
            "id": "gzvw7ll",
            "score": 1,
            "text": "Be excellent to each other and party on dudes.",
            "title_similarity": "0.24390966",
            "sentiment_compound": 0.7506
        },
        {
            "id": "gzvwddg",
            "score": 1,
            "text": "Don’t have sex with the girl i like right in front of me, or behind my back and make all my friends and coworkers lie to me about it",
            "title_similarity": "0.5140523",
            "sentiment_compound": 0.6808
        },
        {
            "id": "gzvwfa6",
            "score": 1,
            "text": "Kiss the bro goodnight.",
            "title_similarity": "0.41167086",
            "sentiment_compound": 0.4215
        },
        {
            "id": "gzvwh50",
            "score": 1,
            "text": "Don’t harass women",
            "title_similarity": "0.51612127",
            "sentiment_compound": -0.4939
        },
        {
            "id": "gzvwx8l",
            "score": 1,
            "text": "Always be honest to your bro. Only a true bro will accept honesty.",
            "title_similarity": "0.5456306",
            "sentiment_compound": 0.8979
        },
        {
            "id": "gzvwxyd",
            "score": 1,
            "text": "Don't date my ex.",
            "title_similarity": "0.5737223",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzvxrxq",
            "score": 1,
            "text": "Never ever. And I mean this. Never ever sleep with your homies girls.  Before during or after their relationships. Even if she a hoe. Now if you dont know the guy and his gal a hoe have at it. Cheers",
            "title_similarity": "0.52798355",
            "sentiment_compound": 0.4767
        },
        {
            "id": "gzvxy30",
            "score": 1,
            "text": "Why wouldn't you chat while peeing? What do you just listen to wet tinkling sounds awkwardly instead?",
            "title_similarity": "0.6026969",
            "sentiment_compound": -0.3939
        },
        {
            "id": "gzvy2jb",
            "score": 1,
            "text": "Drive safe, don’t rape",
            "title_similarity": "0.47788876",
            "sentiment_compound": -0.4215
        },
        {
            "id": "gzvy4su",
            "score": 1,
            "text": "Don't act like a cunt",
            "title_similarity": "0.51250225",
            "sentiment_compound": -0.6497
        },
        {
            "id": "gzvy565",
            "score": 1,
            "text": "Don't act like a cunt",
            "title_similarity": "0.51250225",
            "sentiment_compound": -0.6497
        },
        {
            "id": "gzvy864",
            "score": 1,
            "text": "Don't put your bro in compromising situations. A lot of people think bro code is \"don't rat me out\", but the better bro path is to not take action that puts your bros in a situation that puts your friendship at odds with their morality.",
            "title_similarity": "0.7269488",
            "sentiment_compound": 0.8271
        },
        {
            "id": "gzvybek",
            "score": 1,
            "text": "If she’s your girlfriend technically you can cheat",
            "title_similarity": "0.3916716",
            "sentiment_compound": -0.4588
        },
        {
            "id": "gzvybni",
            "score": 1,
            "text": "Hold your beers in non dominant hand for handshakes",
            "title_similarity": "0.40706646",
            "sentiment_compound": 0.4939
        },
        {
            "id": "gzvycbw",
            "score": 1,
            "text": "Don’t touch bro’s food unless invited to do so.",
            "title_similarity": "0.7038026",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzvyhc7",
            "score": 1,
            "text": "Disclaimer: I'm not a man but I'm NB leaning masc so I'll answer anyway\nUplift other men. Compliment them. Applaud their work and effort. Show them you care and that you're there for them.\nMen are too often lacking solidarity with each other. I find this even at my school, men will constantly being each other down whereas women I see will often bring each other up and show they love each other.\nEveryone, men, women, other, need love and friendship and kindness \nSo step up and compliment others",
            "title_similarity": "0.36965042",
            "sentiment_compound": 0.9917
        },
        {
            "id": "gzvymwl",
            "score": 1,
            "text": "If you think a girl has been drugged or taken advantage of a girl under the influence, step in and let authorities/bar staff help understand the situation. Who says you can be a bro to a girl-bro",
            "title_similarity": "0.40078348",
            "sentiment_compound": 0.5719
        },
        {
            "id": "gzvyn3l",
            "score": 1,
            "text": "Be there",
            "title_similarity": "0.15218371",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzvz2b7",
            "score": 1,
            "text": "Don’t date your bros ex",
            "title_similarity": "0.5946703",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzvz38i",
            "score": 1,
            "text": "At the urinal, eyes forward and mouth shut.",
            "title_similarity": "0.37640566",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzvz8fy",
            "score": 1,
            "text": "Don’t date your friends ex, otherwise you’re not a friend.",
            "title_similarity": "0.6125582",
            "sentiment_compound": 0.121
        },
        {
            "id": "gzvzbs9",
            "score": 1,
            "text": "Real bros won't cockblock",
            "title_similarity": "0.6509065",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzvzg3w",
            "score": 1,
            "text": "If you want to joke at somebody else’s expense, always be prepared to laugh at a joke at your own expense. It’s a two way street",
            "title_similarity": "0.48696572",
            "sentiment_compound": 0.8481
        },
        {
            "id": "gzvzk6z",
            "score": 1,
            "text": "No matter how much you may dislike each other, when his or your family is around, you treat each other with respect...",
            "title_similarity": "0.38785887",
            "sentiment_compound": 0.4812
        },
        {
            "id": "gzvzkqy",
            "score": 1,
            "text": "Don't go after a Bro's crush instantly after he gets shot down, even if she tries to start it",
            "title_similarity": "0.6332755",
            "sentiment_compound": -0.1531
        },
        {
            "id": "gzvzp7j",
            "score": 1,
            "text": "Respect Woman.",
            "title_similarity": "0.15794237",
            "sentiment_compound": 0.4767
        },
        {
            "id": "gzvzuhn",
            "score": 1,
            "text": "Don't date a friends ex",
            "title_similarity": "0.556461",
            "sentiment_compound": -0.3724
        },
        {
            "id": "gzvzwvx",
            "score": 1,
            "text": "We are all brothers",
            "title_similarity": "0.28045407",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzvzz9g",
            "score": 1,
            "text": "The last slice of pizza should be fought for with honour. Also eat the fucking crust",
            "title_similarity": "0.46234328",
            "sentiment_compound": 0.34
        },
        {
            "id": "gzvzzqf",
            "score": 1,
            "text": "Don’t date yours bros ex and if you genuinely want to speak to your bro about it.",
            "title_similarity": "0.72755504",
            "sentiment_compound": 0.0772
        },
        {
            "id": "gzvzzwt",
            "score": 1,
            "text": "guide the cock, don’t block it",
            "title_similarity": "0.5630677",
            "sentiment_compound": -0.5423
        },
        {
            "id": "gzw03z5",
            "score": 1,
            "text": "Fucking be easy. To everyone. Watch the world change.",
            "title_similarity": "0.34775382",
            "sentiment_compound": 0.4902
        },
        {
            "id": "gzw056z",
            "score": 1,
            "text": "Never date (or hook up) with their mom.",
            "title_similarity": "0.46243092",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzw0d4v",
            "score": 1,
            "text": "You should respect each others' interests",
            "title_similarity": "0.35474545",
            "sentiment_compound": 0.6249
        },
        {
            "id": "gzw0d78",
            "score": 1,
            "text": "I think some guys here have no clue what the bro code is. And have no sense of humor lol",
            "title_similarity": "0.5843458",
            "sentiment_compound": 0.128
        },
        {
            "id": "gzw0g8b",
            "score": 1,
            "text": "no eye contact on a three way",
            "title_similarity": "0.38798255",
            "sentiment_compound": -0.296
        },
        {
            "id": "gzw0ro0",
            "score": 1,
            "text": "Bring banana/corn dog  to mouth, not the other way around. Or face obligatory ridicule.",
            "title_similarity": "0.5881013",
            "sentiment_compound": -0.4588
        },
        {
            "id": "gzw0vfd",
            "score": 1,
            "text": "Don’t be a bitch.",
            "title_similarity": "0.40711853",
            "sentiment_compound": -0.5859
        },
        {
            "id": "gzw0wrd",
            "score": 1,
            "text": "A lot of gems to learn and teach my future son around here.",
            "title_similarity": "0.25521386",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzw101z",
            "score": 1,
            "text": "If a little kid smiles at you, you fucking smile back!",
            "title_similarity": "0.23725063",
            "sentiment_compound": 0.7102
        },
        {
            "id": "gzw15l0",
            "score": 1,
            "text": "Don't make fun of your homie's love interest. Be rational about it and critique it if need be, but don't mock.",
            "title_similarity": "0.6808276",
            "sentiment_compound": 0.6953
        },
        {
            "id": "gzw17u5",
            "score": 1,
            "text": "Only smash bros that want to smash",
            "title_similarity": "0.43578413",
            "sentiment_compound": 0.0772
        },
        {
            "id": "gzw18fo",
            "score": 1,
            "text": "When a bro is full of shit , do your best to immediately tell him so. Unless he’s trying to pick up some random chick at a bar.",
            "title_similarity": "0.45993346",
            "sentiment_compound": 0.1531
        },
        {
            "id": "gzw1bw3",
            "score": 1,
            "text": "Respect a bro’s time.  If he says he has to go, don’t talk on the phone for another 5 minutes with another line of thinking.  If they can’t make it then they can’t make it (don’t hold it against them).  That final part doesn’t apply to bro’s that promise to be there and never show up.  A true bro tells everyone they can’t make it because of X.",
            "title_similarity": "0.5975778",
            "sentiment_compound": 0.802
        },
        {
            "id": "gzw1hsf",
            "score": 1,
            "text": "bros b4 hoes",
            "title_similarity": "0.13806638",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzw1jol",
            "score": 1,
            "text": "An example would be no chit chat while peeing. That’s not bro code y’all made that shit up. \n\nHow about don’t fuck around with your bros girl? Shit happens all the time",
            "title_similarity": "0.7000822",
            "sentiment_compound": -0.9169
        },
        {
            "id": "gzw1lx1",
            "score": 1,
            "text": "If you sit next to somebody at a bar without space between, you gotta hear a bit of their story.",
            "title_similarity": "0.34156612",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzw1qva",
            "score": 1,
            "text": "If your bro doesn't respect women, he ain't your bro no mo",
            "title_similarity": "0.5306163",
            "sentiment_compound": -0.1695
        },
        {
            "id": "gzw1v38",
            "score": 1,
            "text": "good friends always call out their friends bad behaviors",
            "title_similarity": "0.3325737",
            "sentiment_compound": 0.6808
        },
        {
            "id": "gzw1z15",
            "score": 1,
            "text": "Don't be a dick",
            "title_similarity": "0.4455283",
            "sentiment_compound": 0.4023
        },
        {
            "id": "gzw2mvl",
            "score": 1,
            "text": "Make a car with a steering wheel that doesn't fly off whIle you're driving.",
            "title_similarity": "0.2542622",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzw2tta",
            "score": 1,
            "text": "If your bro has something in his teeth, you must immediately inform your bro.",
            "title_similarity": "0.48624906",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzw2us0",
            "score": 1,
            "text": "No snitching",
            "title_similarity": "0.4767682",
            "sentiment_compound": -0.296
        },
        {
            "id": "gzw2zp6",
            "score": 1,
            "text": "Do you have an Exit Buddy?  If you die unexpectedly your Exit Buddy gets rid of the kinky fuckery your Maw maw doesn't need to know about and deletes your browser history.",
            "title_similarity": "0.57316375",
            "sentiment_compound": -0.5994
        },
        {
            "id": "gzw30gu",
            "score": 1,
            "text": "Bro's never leave a Bro hanging, translate to...no matter what we got your back!",
            "title_similarity": "0.6621351",
            "sentiment_compound": 0.1381
        },
        {
            "id": "gzw39iu",
            "score": 1,
            "text": "What do you mean no taking a leak and talking. Real bros talk while taking a dump",
            "title_similarity": "0.6505878",
            "sentiment_compound": -0.7351
        },
        {
            "id": "gzw3abi",
            "score": 1,
            "text": "When a bro is talking with a girl he likes, never make funnier jokes or seem cooler than the bro. Please.",
            "title_similarity": "0.5443181",
            "sentiment_compound": 0.2737
        },
        {
            "id": "gzw3dk2",
            "score": 1,
            "text": "Latinos everywhere you are joking right\n\nIrish guys everywhere hahahahah if I can sleep with your girlfriend I will\n\nThe bro code is a myth",
            "title_similarity": "0.4648358",
            "sentiment_compound": 0.2263
        },
        {
            "id": "gzw3e9c",
            "score": 1,
            "text": "Help the ladies carry heavy stuff. I worked with a dude who’d always send young women to pick up cases of bottled water and soda for the office and he never once helped them bring it inside. Use your dude muscles for good.",
            "title_similarity": "0.43434387",
            "sentiment_compound": 0.6808
        },
        {
            "id": "gzw3iln",
            "score": 2,
            "text": "If there's no urinal left without having to go next to someone, then hold it until there is one",
            "title_similarity": "0.49631676",
            "sentiment_compound": -0.296
        },
        {
            "id": "gzw3js7",
            "score": 3,
            "text": "Don't start a fight in a bar or club expecting your bros to jump in.",
            "title_similarity": "0.60756004",
            "sentiment_compound": 0.2924
        },
        {
            "id": "gzw3v96",
            "score": 1,
            "text": "Tell bro if she cheated, even if it was with you.",
            "title_similarity": "0.4970005",
            "sentiment_compound": -0.5106
        },
        {
            "id": "gzw3zi3",
            "score": 1,
            "text": "Never nail a bros mom, unless it's your actual brother than it's all good",
            "title_similarity": "0.6317545",
            "sentiment_compound": 0.4404
        },
        {
            "id": "gzw41r0",
            "score": 1,
            "text": "Share the porn link if you find a good one. \n\nBetter watch it with your bro with hands in hand.",
            "title_similarity": "0.47451162",
            "sentiment_compound": 0.8807
        },
        {
            "id": "gzw421i",
            "score": 1,
            "text": "Never fucking unfaithful slut",
            "title_similarity": "0.5237451",
            "sentiment_compound": 0.507
        },
        {
            "id": "gzw43m6",
            "score": 5,
            "text": "Don't make eye contact in a devil's 3 way",
            "title_similarity": "0.5122931",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzw4bj6",
            "score": 3,
            "text": "Thou shalt not use the urinal right next to another bro.",
            "title_similarity": "0.6585509",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzw4cr1",
            "score": 1,
            "text": "HODL gme 🚀🚀🚀",
            "title_similarity": "0.18546304",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzw4cw1",
            "score": 1,
            "text": "Don’t date your friend’s exes. If he’s your bro, she ain’t worth it.",
            "title_similarity": "0.6063116",
            "sentiment_compound": 0.2263
        },
        {
            "id": "gzw4g6w",
            "score": 1,
            "text": "Don't be funnier than him when in front of his crush.",
            "title_similarity": "0.3893397",
            "sentiment_compound": -0.4325
        },
        {
            "id": "gzw4v6k",
            "score": 1,
            "text": "The nod language.\nNod up\nNod down\nNod sideways up\nNod sideways down",
            "title_similarity": "0.35042483",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzw4xm7",
            "score": 2,
            "text": "The middle cubicle in the toilets is never to be occupied.",
            "title_similarity": "0.43772036",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzw50lv",
            "score": 1,
            "text": "Don't dance with your hands above your head.",
            "title_similarity": "0.4760467",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzw50ng",
            "score": 1,
            "text": "Not necessarily \"bro\" code, but back when I was a kid it didn't matter if you were literally fist fighting your biggest enemy, if their parents came around before, during or after the fight you STILL addressed them as sir/ma'am. If they needed help with the groceries or something guess what, you and your sworn enemy were grabbing bags. Bro or anti-bro, your respect for even your enemy's parents does not waiver under any circumstances.",
            "title_similarity": "0.5258455",
            "sentiment_compound": -0.8612
        },
        {
            "id": "gzw53uj",
            "score": 1,
            "text": "Bro up to lift everyone up. We all bro harder when we bro together.",
            "title_similarity": "0.12682752",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzw54ln",
            "score": 1,
            "text": "Ask your bros how they’re doing from time to time. A lot of bros don’t share unless they’re asked",
            "title_similarity": "0.512486",
            "sentiment_compound": 0.296
        },
        {
            "id": "gzw56n6",
            "score": 1,
            "text": "Be nice",
            "title_similarity": "0.15134731",
            "sentiment_compound": 0.4215
        },
        {
            "id": "gzw575i",
            "score": 1,
            "text": "No snitching on your bros.",
            "title_similarity": "0.6602047",
            "sentiment_compound": -0.296
        },
        {
            "id": "gzw59vu",
            "score": 1,
            "text": "Return borrowed games, Andrew. (ignore the name for the wholesome message)",
            "title_similarity": "0.6679998",
            "sentiment_compound": -0.3612
        },
        {
            "id": "gzw5fdc",
            "score": 8,
            "text": "Don't disrespect a mans home (or a woman's for that matter)\n\nIf you're a guest in someone else's home, then you give it the respect as if you're visiting royalty in a castle.\n\nThey disrespect you? Politely leave and deal with it later",
            "title_similarity": "0.51837397",
            "sentiment_compound": 0.3678
        },
        {
            "id": "gzw5icx",
            "score": 1,
            "text": "Bro's before ho's",
            "title_similarity": "0.2831348",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzw5khu",
            "score": 1,
            "text": "idk chit chat while peeing is fine, just no eye contact haha. look forward when peeing",
            "title_similarity": "0.59978044",
            "sentiment_compound": 0.296
        },
        {
            "id": "gzw5mo6",
            "score": 1,
            "text": "[deleted]",
            "title_similarity": "0.31642208"
        },
        {
            "id": "gzw603n",
            "score": 1,
            "text": "Always laugh when your bro is telling you a Chuck Norris joke",
            "title_similarity": "0.30309397",
            "sentiment_compound": 0.7003
        },
        {
            "id": "gzw6fsw",
            "score": 1,
            "text": "Wtf, chit chat while peeing is awesome",
            "title_similarity": "0.30680272",
            "sentiment_compound": 0.0772
        },
        {
            "id": "gzw6jhr",
            "score": 1,
            "text": "Family will Fuck you quicker than true friends.",
            "title_similarity": "0.42089948",
            "sentiment_compound": 0.34
        },
        {
            "id": "gzw7340",
            "score": 1,
            "text": "So no chit chat while peeing, is that the same as talking to someone before walking in the bathroom and continuing the conversation or just starting conversations with random people while peeing?",
            "title_similarity": "0.59065354",
            "sentiment_compound": -0.3597
        },
        {
            "id": "gzw75q1",
            "score": 14,
            "text": "Never use something your bro told you in secret as a weapon to hurt or joke about them. If they tell you something in private then they wanted it to stay that way and it's so unbroly to share it with others.\n\n(Exceptions would be if they plan to hurt/are hurting themselves, or plan to hurt others.)",
            "title_similarity": "0.7141795",
            "sentiment_compound": -0.7927
        },
        {
            "id": "gzw7bqe",
            "score": 2,
            "text": "Bros shouldn't invade a country saying you're bringing them democracy  when really you're taking away their oil.",
            "title_similarity": "0.709725",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzw7d59",
            "score": 1,
            "text": "Don't touch another man's hat",
            "title_similarity": "0.5130208",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzw7eyh",
            "score": 1,
            "text": "Don't talk shit behind his back especially because he's not there and cannot defend himself.\n\nBe a man.",
            "title_similarity": "0.6236093",
            "sentiment_compound": 0.4449
        },
        {
            "id": "gzw7lxo",
            "score": 1,
            "text": "If your bro is going thru hard times invite him to take a little walk around the park, the beach, etc. You'll have the most enlightening talks ever and It will work wonders on both of you, guaranteed.",
            "title_similarity": "0.32507518",
            "sentiment_compound": 0.5849
        },
        {
            "id": "gzw7pot",
            "score": 1,
            "text": "Leave a gap when using bathroom stalls.",
            "title_similarity": "0.40649712",
            "sentiment_compound": -0.0516
        },
        {
            "id": "gzw7pu2",
            "score": 2,
            "text": "Never date a bro's Ex.",
            "title_similarity": "0.4952464",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzw7rmf",
            "score": 1,
            "text": "Do not mess with a man's income. Bad stuff might happen in retaliation",
            "title_similarity": "0.62328917",
            "sentiment_compound": -0.3378
        },
        {
            "id": "gzw7w0o",
            "score": 1,
            "text": "A bro is henceforth defined as any creature that has lived past present or future, regardless of gender, species, or sexuality. All things are bros, and the code applies uniformly",
            "title_similarity": "0.40886486",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzw80gi",
            "score": 2,
            "text": "Don’t go after your bro’s girl. Should be a given.",
            "title_similarity": "0.72676265",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzw82dh",
            "score": 1,
            "text": "on my crew of lineman there is a very strict rule of no snitching. if something is going to get handled, it’ll be handled by us or not the safety man, general foreman, or anyone else who thinks they have a say. \n\nno snitches among tight knit work crews. also get over it everyone takes a piss I just don’t get that lol",
            "title_similarity": "0.61997753",
            "sentiment_compound": -0.684
        },
        {
            "id": "gzw83mb",
            "score": 1,
            "text": "Always bring twice as much beer as you intend to drink.",
            "title_similarity": "0.19640237",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzw8g2q",
            "score": 1,
            "text": "If bro is drunk and not able to take care of himself, don't leave bro alone.",
            "title_similarity": "0.48433",
            "sentiment_compound": 0.3995
        },
        {
            "id": "gzw8lr0",
            "score": 1,
            "text": "If a bro is in an altercation with a stranger and their friends (a losing fight), try to take the bro away and keep him preoccupied till he calms down. He’ll feel like you didn’t have his back at the time, but will appreciate it in the long run. It’s never worth it.",
            "title_similarity": "0.5594901",
            "sentiment_compound": 0.5269
        },
        {
            "id": "gzw8meu",
            "score": 1,
            "text": "If a friend asks for help, you help them.  Applies in many cases outside of friends as well; an example of mine is when I went to get some lunch one day and some guys were trying to lift a motorcycle into the back of a pickup.  They were having a hard time so they asked if I could help so naturally I gave them a hand.",
            "title_similarity": "0.2568556",
            "sentiment_compound": 0.9538
        },
        {
            "id": "gzw8v09",
            "score": 1,
            "text": "When you’re going out to dinner with your bro don’t hold hands when people are looking",
            "title_similarity": "0.525032",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzw8zrp",
            "score": 1,
            "text": "Get a vasectomy and say nothing ever",
            "title_similarity": "0.5144039",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzw97m7",
            "score": 1,
            "text": "No soldier left behind!",
            "title_similarity": "0.39241058",
            "sentiment_compound": -0.3595
        },
        {
            "id": "gzw9a5j",
            "score": 1,
            "text": " When your friend calls his mom start making weird ass noises",
            "title_similarity": "0.36361116",
            "sentiment_compound": -0.25
        },
        {
            "id": "gzw9bo7",
            "score": 1,
            "text": "Always be ready to lie, at a moment's notice. Women ask questions. Know your bros well.",
            "title_similarity": "0.38460356",
            "sentiment_compound": 0.5574
        },
        {
            "id": "gzw9fyi",
            "score": 1,
            "text": "All of these should just apply to people in general lol what the fuck",
            "title_similarity": "0.452201",
            "sentiment_compound": -0.1779
        },
        {
            "id": "gzw9hh6",
            "score": 5,
            "text": "Don't sexually harassment or abuse women.",
            "title_similarity": "0.54257274",
            "sentiment_compound": -0.3291
        },
        {
            "id": "gzw9iu6",
            "score": 3,
            "text": "Dont fall in love with the same girl that your bro likes.",
            "title_similarity": "0.54985124",
            "sentiment_compound": -0.1451
        },
        {
            "id": "gzw9jap",
            "score": 12,
            "text": "Friendship is not a dick swinging match. \n\nBuild each other up and have each others back.",
            "title_similarity": "0.61162233",
            "sentiment_compound": 0.681
        },
        {
            "id": "gzw9kqy",
            "score": 1,
            "text": "An important one is for fights. No jumping in when it's 1v1. Only thing i need you to do is prevent other people from interfering with the fight. If i'm getting mt ass kicked and the fight is over and i clearly lost, do me a favor and break it up.",
            "title_similarity": "0.64139026",
            "sentiment_compound": -0.8225
        },
        {
            "id": "gzwa4yu",
            "score": 1,
            "text": "Bros before Hoes.... Right?",
            "title_similarity": "0.41278324",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzwa7pr",
            "score": 1,
            "text": "The Rome Statutes",
            "title_similarity": "0.27991414",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzwa8wg",
            "score": 3,
            "text": "Always kiss a bro goodnight, you never know what they went through that day, a kiss can relax them before sleep",
            "title_similarity": "0.4453442",
            "sentiment_compound": 0.8176
        },
        {
            "id": "gzwadmz",
            "score": 1,
            "text": "Tell the guy to his face when he's being a jerk with girls.",
            "title_similarity": "0.3802722",
            "sentiment_compound": -0.34
        },
        {
            "id": "gzwajeo",
            "score": 1,
            "text": "When a bro dies, delete his browser history.\n\n\nAnd: DIBS!!",
            "title_similarity": "0.47378623",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzwajpj",
            "score": 1,
            "text": "Never bang a bros sister",
            "title_similarity": "0.5041839",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzwarvg",
            "score": 1,
            "text": "No one does these these things haha but ok.",
            "title_similarity": "0.49669352",
            "sentiment_compound": 0.1027
        },
        {
            "id": "gzwasxd",
            "score": 4,
            "text": "You can insult a bro to their face. But always defend them behind their back l.",
            "title_similarity": "0.5515161",
            "sentiment_compound": -0.2846
        },
        {
            "id": "gzwb3pq",
            "score": 1,
            "text": "Always look someone in the eyes when shaking their hand.",
            "title_similarity": "0.2102772",
            "sentiment_compound": 0.3612
        },
        {
            "id": "gzwb5q1",
            "score": 1,
            "text": "Pee out of the window on sleepovers",
            "title_similarity": "0.28616315",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzwb60y",
            "score": 3,
            "text": "U shouldn't date your bros ex. Now different situations apply and what not but I think generally speaking you shouldn't ever date an ex of your friends.",
            "title_similarity": "0.7250432",
            "sentiment_compound": 0.631
        },
        {
            "id": "gzwbdo2",
            "score": 1,
            "text": "B B Lb B B B Lb Lt Rb Y B Y",
            "title_similarity": "0.24900019",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzwbecu",
            "score": 5,
            "text": "If the top ten plays of the day comes on ESPN at a bar or a house, always nudge the closest bro in case he's not paying attention",
            "title_similarity": "0.32809925",
            "sentiment_compound": 0.4215
        },
        {
            "id": "gzwbgkq",
            "score": 1,
            "text": "Why no chit chat while peeing?",
            "title_similarity": "0.6619419",
            "sentiment_compound": -0.296
        },
        {
            "id": "gzwbm5w",
            "score": 1,
            "text": "Never ask to borrow tools unless it is an emergency.",
            "title_similarity": "0.6062138",
            "sentiment_compound": -0.3818
        },
        {
            "id": "gzwbqkx",
            "score": 1,
            "text": "Never go to the urinal next to a guy using one if there is another open.  Leave a space.",
            "title_similarity": "0.59505713",
            "sentiment_compound": -0.0516
        },
        {
            "id": "gzwbrdt",
            "score": 1,
            "text": "Please also apply all of these even if your bro's crush is a dude.",
            "title_similarity": "0.37843812",
            "sentiment_compound": 0.1779
        },
        {
            "id": "gzwbu19",
            "score": 1,
            "text": "I thought “bros before hoes” is the one?",
            "title_similarity": "0.45853996",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzwc056",
            "score": 1,
            "text": "Hype up your boiz, but tell them straight when they mess up. Take nothing personally, and speak as if your boiz won’t either.",
            "title_similarity": "0.6545612",
            "sentiment_compound": -0.2263
        },
        {
            "id": "gzwc5p1",
            "score": 5,
            "text": "Bro hugs should be more encouraged tbh",
            "title_similarity": "0.43476576",
            "sentiment_compound": 0.7178
        },
        {
            "id": "gzwc5qm",
            "score": 1,
            "text": "Unless he specifically asks for assistance, don't take over grilling or cooking.\n\nWhen getting up to get another beer always ask who else wants one and bring it to them, it must be reciprocated.",
            "title_similarity": "0.7010334",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzwc8oe",
            "score": 3,
            "text": "Not bro code but a general head nod or shake of the head is a universal language between bros",
            "title_similarity": "0.6333868",
            "sentiment_compound": -0.2617
        },
        {
            "id": "gzwcee2",
            "score": 1,
            "text": "Skip a stall if one is available",
            "title_similarity": "0.51945525",
            "sentiment_compound": -0.2023
        },
        {
            "id": "gzwcfe3",
            "score": 1,
            "text": "Don't go for your friend's ex. Never. The sooner the break up, the worse it is.",
            "title_similarity": "0.5459598",
            "sentiment_compound": -0.4767
        },
        {
            "id": "gzwci4m",
            "score": 1,
            "text": "don’t date your bro’s ex girlfriend two months after they break-up",
            "title_similarity": "0.44387186",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzwcias",
            "score": 11,
            "text": "Don't let some absurd definition of masculinity rule your life. My brother in law, his father in law and my stepfather in law all tried to give me shit for taking my wife's last name. I explained very bluntly my last name doesn't define my masculinity. I volunteered to take her last name because it's one of the last things she has left from her dad who died when she was 3. Be the person you want to be and your bro code should be to embrace that in each other not shit on it.",
            "title_similarity": "0.6166905",
            "sentiment_compound": -0.3971
        },
        {
            "id": "gzwciou",
            "score": 1,
            "text": "Don’t talk to me while I’m shitting",
            "title_similarity": "0.5164144",
            "sentiment_compound": -0.4215
        },
        {
            "id": "gzwcl8v",
            "score": 8,
            "text": "Bro code: Never sneak into a bros house in the middle of the night and carve their face off with a rusty knife before wearing it as a mask.",
            "title_similarity": "0.49675655",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzwctei",
            "score": 1,
            "text": "1) always leave AT LEAST ONE urinal between you and the next guy....\n\n2) if you are spotting chest, dont tea bag the guy benching\n\n3) dont mess with another mans TV settings",
            "title_similarity": "0.615788",
            "sentiment_compound": 0.2287
        },
        {
            "id": "gzwcyu2",
            "score": 3,
            "text": "Stay the fuck away from your friends gf.",
            "title_similarity": "0.5822904",
            "sentiment_compound": -0.1027
        },
        {
            "id": "gzwd1hm",
            "score": 3,
            "text": "Clean piss off toilet",
            "title_similarity": "0.316238",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzwd4d3",
            "score": 1,
            "text": "Ten commandments of bros:\n1. Trust thy bro\n2. No other hoes before the bros\n3. Honor your bros family\n4. Keep the days with bros holy\n5. You shall not steal or fuck with his wife or children\n6. You shall not envy thy bros success\n7. You shall protect thy bro's honor\n8. You shall correct thy bro's mistakes and set him straight\n9. You shall stand by thy bro's side even in times of missery\n10. You shall not shame thy bro in front of his crush",
            "title_similarity": "0.5781474",
            "sentiment_compound": 0.9659
        },
        {
            "id": "gzwd75m",
            "score": 3,
            "text": "If you plan on still being friends with someone; don't fucking date their ex.",
            "title_similarity": "0.6841639",
            "sentiment_compound": 0.4767
        },
        {
            "id": "gzwd7ey",
            "score": 1,
            "text": "No eye contact during a devil's three-way",
            "title_similarity": "0.42278802",
            "sentiment_compound": -0.296
        },
        {
            "id": "gzwdl5e",
            "score": 2,
            "text": "Leave an unused urinal between you and other bros",
            "title_similarity": "0.556316",
            "sentiment_compound": -0.0516
        },
        {
            "id": "gzwdn3y",
            "score": 1,
            "text": "Always give a bro a kiss after you spit on his face",
            "title_similarity": "0.368776",
            "sentiment_compound": 0.4215
        },
        {
            "id": "gzwdr4u",
            "score": 1,
            "text": "Saying no homo before kissing your homies goodnight",
            "title_similarity": "0.63676393",
            "sentiment_compound": 0.3612
        },
        {
            "id": "gzwdxi2",
            "score": 4,
            "text": "1. If someone said ill to your bro, tell them you can't believe it unless you have talked with him.\n\n2. If your bro relationship ends for any reason, never share or make a joke about things he told you earlier.",
            "title_similarity": "0.70928335",
            "sentiment_compound": -0.3586
        },
        {
            "id": "gzwe4px",
            "score": 7,
            "text": "Get consent.",
            "title_similarity": "0.27187154",
            "sentiment_compound": 0.2263
        },
        {
            "id": "gzwe6mh",
            "score": 1,
            "text": "The other day I was with my buddy and he was kinda bullshitting this girl it was the most harmless lie, and I called him on it and i just realized that was pretty anti bro, dont call him on his stupid bs he was trying to game this girl if anything just go with it and actually wing man him",
            "title_similarity": "0.511631",
            "sentiment_compound": -0.0534
        },
        {
            "id": "gzwec6i",
            "score": 1,
            "text": "Never date a bro’s ex. \n\n7.5 billion people. Doesn’t make sense to do such things, considering.",
            "title_similarity": "0.48081708",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzwec7u",
            "score": 2,
            "text": "No means no, bro",
            "title_similarity": "0.46615472",
            "sentiment_compound": -0.296
        },
        {
            "id": "gzweh05",
            "score": 1,
            "text": "Wait no chit chat while peeing? Why?",
            "title_similarity": "0.6621249",
            "sentiment_compound": -0.3736
        },
        {
            "id": "gzwehei",
            "score": 1,
            "text": "Tell your friend if he is being cheated on, happened once to a friend no one told him just to evade trouble, just one bro had the guts to tell him in a delicate proper manner.",
            "title_similarity": "0.61114293",
            "sentiment_compound": -0.1531
        },
        {
            "id": "gzwelqm",
            "score": 1,
            "text": "BROS BEFORE HOES !",
            "title_similarity": "0.41303024",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzwem2n",
            "score": 1,
            "text": "Compliment and promote each other.",
            "title_similarity": "0.22527465",
            "sentiment_compound": 0.6908
        },
        {
            "id": "gzwenee",
            "score": 9,
            "text": "That the bro code has no age limits. Little bros to senior bros, everyone gets respect",
            "title_similarity": "0.36061722",
            "sentiment_compound": 0.2263
        },
        {
            "id": "gzweqik",
            "score": 1,
            "text": "Compliment eachother, if youre bros looking good tell him give him a confidence boost",
            "title_similarity": "0.3307237",
            "sentiment_compound": 0.9001
        },
        {
            "id": "gzwes0b",
            "score": 1,
            "text": "Bros should not mess with other bros GFs. Even after they break up. Theresa million great people out there, there's no reason to make bad descions.",
            "title_similarity": "0.5223467",
            "sentiment_compound": 0.1306
        },
        {
            "id": "gzwev2u",
            "score": 1,
            "text": "Don't keep secrets about predatory behavior. This is just enabling your Bro's toxic behavior and promising they will hurt more people.",
            "title_similarity": "0.58955073",
            "sentiment_compound": -0.1779
        },
        {
            "id": "gzwexpc",
            "score": 3,
            "text": "Always make a dad look good in front of his kids.  Avoid disrespecting or belittling him even if he deserves it. \n\nThe illusion of dad as top dog is important.",
            "title_similarity": "0.51490444",
            "sentiment_compound": 0.5106
        },
        {
            "id": "gzwf472",
            "score": 1,
            "text": "Fist bumps when you have a moment of joy",
            "title_similarity": "0.19135144",
            "sentiment_compound": 0.5859
        },
        {
            "id": "gzwfbop",
            "score": 9,
            "text": "No raping",
            "title_similarity": "0.45112008",
            "sentiment_compound": 0.5875
        },
        {
            "id": "gzwfcjc",
            "score": 1,
            "text": "Its 2021, Fuck bro codes  tbh",
            "title_similarity": "0.3983804",
            "sentiment_compound": -0.5423
        },
        {
            "id": "gzwflon",
            "score": 1,
            "text": "Once your bro dates a girl shes off limits for you no questions asked.",
            "title_similarity": "0.59627295",
            "sentiment_compound": -0.296
        },
        {
            "id": "gzwfm0y",
            "score": 1,
            "text": "Never bang your bro's mom",
            "title_similarity": "0.60344005",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzwfoqb",
            "score": 1,
            "text": "Bros before hoes",
            "title_similarity": "0.37687492",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzwfp1y",
            "score": 1,
            "text": "There’s billions of women in the world, so don’t pick a bros ex. 🤦🏾‍♂️",
            "title_similarity": "0.3351112",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzwfu1r",
            "score": 1,
            "text": "Never talk about money when you gathered with lads.",
            "title_similarity": "0.5062387",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzwg5wk",
            "score": 1,
            "text": "So... Why all the gals are divided but the bros are united?",
            "title_similarity": "0.4206082",
            "sentiment_compound": 0.5719
        },
        {
            "id": "gzwgp5e",
            "score": 1,
            "text": "Always compliment a bro's beard.\nNever talk down on bro's growing out, we've all been there at one point.",
            "title_similarity": "0.46072584",
            "sentiment_compound": 0.5859
        },
        {
            "id": "gzwgwjp",
            "score": 1,
            "text": "Don't rape.",
            "title_similarity": "0.48963177",
            "sentiment_compound": 0.5773
        },
        {
            "id": "gzwh0f5",
            "score": 1,
            "text": "how has no one mentioned this one,\n\n***always tell your bro if their partner is cheating on them***",
            "title_similarity": "0.56128275",
            "sentiment_compound": -0.7003
        },
        {
            "id": "gzwh104",
            "score": 3,
            "text": "Lift the damn seat when you pee, toilets are not some game for you to test your poor aim and leave it for the next person",
            "title_similarity": "0.6420624",
            "sentiment_compound": -0.7184
        },
        {
            "id": "gzwh5lq",
            "score": 1,
            "text": "Never tell his significant other you’re gonna go to strip club for his bach party",
            "title_similarity": "0.49190646",
            "sentiment_compound": 0.2751
        },
        {
            "id": "gzwh5r7",
            "score": 1,
            "text": "Friends will be friends, right til the end.",
            "title_similarity": "0.30417985",
            "sentiment_compound": 0.7351
        },
        {
            "id": "gzwh7hw",
            "score": 1,
            "text": "Never flirt with your bro's ex gfs/wifes.",
            "title_similarity": "0.5693765",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzwh7i2",
            "score": 1,
            "text": "Knowing your limits with „male bounding\", step in when it goes too far.",
            "title_similarity": "0.5200201",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzwhhtc",
            "score": 1,
            "text": "If your bro dies at the gym while lifting, you are obliged to add one more plate to either side of the barbell before calling the authorities.",
            "title_similarity": "0.42827088",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzwhq8f",
            "score": 14,
            "text": "Any bro that beats a girl is no longer a bro",
            "title_similarity": "0.48280507",
            "sentiment_compound": -0.296
        },
        {
            "id": "gzwhsie",
            "score": 1,
            "text": "Big up a brother when he is next to a girl he fancies",
            "title_similarity": "0.21706574",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzwhyri",
            "score": 1,
            "text": "Throat the bro's throbbing cock.",
            "title_similarity": "0.22311626",
            "sentiment_compound": -0.1531
        },
        {
            "id": "gzwi6uo",
            "score": 11,
            "text": "If he isn't a bro to women, minority groups, and those less fortunate, don't be a bro to him",
            "title_similarity": "0.49802434",
            "sentiment_compound": 0.3832
        },
        {
            "id": "gzwi9e2",
            "score": 1,
            "text": "Don’t ever hit on a bro’s girl",
            "title_similarity": "0.58550894",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzwj4ms",
            "score": 1,
            "text": "Bro before bitches",
            "title_similarity": "0.3674872",
            "sentiment_compound": -0.5994
        },
        {
            "id": "gzwj8q2",
            "score": 1,
            "text": "Don't thrust in her if you can't trust her.",
            "title_similarity": "0.5611374",
            "sentiment_compound": -0.4023
        },
        {
            "id": "gzwjamg",
            "score": 1,
            "text": "If she’s your friends ex you don’t flirt or go out with that person.",
            "title_similarity": "0.5610255",
            "sentiment_compound": 0.4767
        },
        {
            "id": "gzwjcd8",
            "score": 1,
            "text": "No making fun of obvious insecurities.",
            "title_similarity": "0.53765297",
            "sentiment_compound": -0.7719
        },
        {
            "id": "gzwjcpx",
            "score": 1,
            "text": "Keep right, pass left.",
            "title_similarity": "0.33456382",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzwjf8b",
            "score": 1,
            "text": "Don't make eye contact during a threesome",
            "title_similarity": "0.49360305",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzwjk0s",
            "score": 1,
            "text": "Dont date your bro's ex",
            "title_similarity": "0.59685594",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzwjn7q",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.31200892"
        },
        {
            "id": "gzwjor7",
            "score": 1,
            "text": "Don't keep hitting a man when he falls down in a fight",
            "title_similarity": "0.4961995",
            "sentiment_compound": -0.3818
        },
        {
            "id": "gzwjpu8",
            "score": 1,
            "text": "Never sleep with a chick who is already spoken for.",
            "title_similarity": "0.44623822",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzwjqw7",
            "score": 1,
            "text": "If possible, never pee right next to someone in a public restroom. Skip a urinal.",
            "title_similarity": "0.58094305",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzwjtc8",
            "score": 4,
            "text": "when you see a dude's fly or zipper open, dont tell him. Just stretch out your hand and quietly close it up.",
            "title_similarity": "0.5616371",
            "sentiment_compound": 0.4939
        },
        {
            "id": "gzwjulv",
            "score": 1,
            "text": "Just be a bro to everyone",
            "title_similarity": "0.414348",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzwjxsq",
            "score": 1,
            "text": "have an n64 and a case of natty ice on your person at all times, regardless.",
            "title_similarity": "0.31848624",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzwk16x",
            "score": 1,
            "text": "Not being a cunt",
            "title_similarity": "0.46985",
            "sentiment_compound": 0.3875
        },
        {
            "id": "gzwk9u2",
            "score": 1,
            "text": "dont be a dick be a bro.",
            "title_similarity": "0.6087473",
            "sentiment_compound": 0.4023
        },
        {
            "id": "gzwkm06",
            "score": 1,
            "text": "All bro code should be followed internationally, it's like the \"unwritten rule of the road\" or \"Order of the Brethren\" level shit",
            "title_similarity": "0.6456004",
            "sentiment_compound": -0.2732
        },
        {
            "id": "gzwkm0s",
            "score": 1,
            "text": "Ignoring anything having to do with \"bro code\".  Plain and simply, there are things men do, and do not do. Man-cave, bro code, shit like that does not cement into \"law\" some wished for rule of conduct you hold near and dear to your sense of manliness.  If people were concerned with the effect their every action will dictate and if it's positive outcome will influence things around them, the rest will follow.  Help a stranger in need, defend the weak, care for your family, don't abuse your wife and kids, think before you speak.  Men don't all of a sudden become men by following some list of rules formed at a slumber party.",
            "title_similarity": "0.72710615",
            "sentiment_compound": 0.8877
        },
        {
            "id": "gzwkmfw",
            "score": 1,
            "text": "Very general and not specific for bros but,\n\n“A wrong done in front of public can’t be apologized for in private”. \n\nTried my best in translation but you get the idea",
            "title_similarity": "0.7225299",
            "sentiment_compound": 0.6808
        },
        {
            "id": "gzwkqdv",
            "score": 1,
            "text": "Basically just don't be an asshole.",
            "title_similarity": "0.506444",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzwkr3n",
            "score": 1,
            "text": "Lol my work has everyone talking and looking at each other while taking a leak. I was weirded out at first and was nervous about it but now Im even starting conversations! What a strange place.",
            "title_similarity": "0.27297163",
            "sentiment_compound": -0.4295
        },
        {
            "id": "gzwkrfq",
            "score": 1,
            "text": "Do not rape?",
            "title_similarity": "0.49438724",
            "sentiment_compound": 0.5773
        },
        {
            "id": "gzwl1mu",
            "score": 3,
            "text": "Not dating the woman bro has dated unless there is mutual agreement.",
            "title_similarity": "0.61276865",
            "sentiment_compound": 0.4939
        },
        {
            "id": "gzwle00",
            "score": 1,
            "text": "No using the term 'bro code'.",
            "title_similarity": "0.6543791",
            "sentiment_compound": -0.296
        },
        {
            "id": "gzwlf2v",
            "score": 1,
            "text": "If in a bathroom with many urinals in a row, always choose the one further from the one thats currently being used.",
            "title_similarity": "0.43188903",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzwlg5z",
            "score": 1,
            "text": "Once, my wife and I went on a date night, dinner, cocktails, music, etc….everyone we met we mentioned we were on a Tinder Date. The girls reacted enthusiastically, one guy, as we were leaving, told my wife to “drop that douche-bag” and go with him. I was sadden for my fellow Bro.",
            "title_similarity": "0.3204921",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzwlkvm",
            "score": 12,
            "text": "The nod. If someone nods at you, you must recognise and nod back.",
            "title_similarity": "0.37923717",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzwlvgk",
            "score": 1,
            "text": "Idk if anybody else has seen this, but no sloppy seconds. It seems to be a regular thing to immediately pounce on any female as soon as they break up with a friend.",
            "title_similarity": "0.4488942",
            "sentiment_compound": 0.3182
        },
        {
            "id": "gzwm7o1",
            "score": 1,
            "text": "Help bros get laid instead of competing against one another.\n\nI'm reminded of Maximus Decimus Meridius when he said: \"Whatever comes out of that gate, we have a better chance if we work together\"\n\nGuys should sell/advertise their bros to women instead of chatting the women up themselves (which rarely works anyway)\n\nWe'd all get more of what we want, whatever that is, if we work together and help eachother instead of competing.",
            "title_similarity": "0.5467544",
            "sentiment_compound": 0.8625
        },
        {
            "id": "gzwm9ro",
            "score": 1,
            "text": "No kicks in the nuts",
            "title_similarity": "0.43342897",
            "sentiment_compound": -0.5423
        },
        {
            "id": "gzwmesj",
            "score": 3,
            "text": "If you see a bros zipper down pull it up for him.",
            "title_similarity": "0.4574927",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzwmfc1",
            "score": 1,
            "text": "No tasting a penis twice, if it tastes funny. I have always told my bros that is how I roll.",
            "title_similarity": "0.60390556",
            "sentiment_compound": 0.1779
        },
        {
            "id": "gzwmg6k",
            "score": 1,
            "text": "Don't be a cunt.",
            "title_similarity": "0.5032445",
            "sentiment_compound": 0.3875
        },
        {
            "id": "gzwmhvu",
            "score": 1,
            "text": "If you tell your bro that you like someone, that automatically puts that person on the *do-not-fuck* list",
            "title_similarity": "0.54548645",
            "sentiment_compound": 0.3612
        },
        {
            "id": "gzwmkae",
            "score": 1,
            "text": "Respect women.",
            "title_similarity": "0.13590702",
            "sentiment_compound": 0.4767
        },
        {
            "id": "gzwmmo6",
            "score": 1,
            "text": "Smack his cock every 5 mins",
            "title_similarity": "0.12247331",
            "sentiment_compound": -0.1531
        },
        {
            "id": "gzwmnlk",
            "score": 1,
            "text": "Never get with a friend/bro’s lady, ever.",
            "title_similarity": "0.48856425",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzwmrpj",
            "score": 1,
            "text": "Leave one urinal between you and the guy pissing",
            "title_similarity": "0.49658704",
            "sentiment_compound": -0.4404
        },
        {
            "id": "gzwmu4j",
            "score": 1,
            "text": "Brosbeforehoes",
            "title_similarity": "0.26429194",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzwmv2l",
            "score": 1,
            "text": "Never hook up with your friends ex without their go ahead. Don’t even hook up with someone your friend is interested in.",
            "title_similarity": "0.6044505",
            "sentiment_compound": 0.8402
        },
        {
            "id": "gzwn5gc",
            "score": 1,
            "text": "The nod.",
            "title_similarity": "0.21940742",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzwn7pu",
            "score": 1,
            "text": "When a bro calls you to verify he was with you, you were definitely together",
            "title_similarity": "0.34181273",
            "sentiment_compound": 0.4019
        },
        {
            "id": "gzwn9sp",
            "score": 1,
            "text": "Never cock block a bro, always guide his cock",
            "title_similarity": "0.5826082",
            "sentiment_compound": 0.3071
        },
        {
            "id": "gzwna2y",
            "score": 1,
            "text": "Don't be a cockblocker.",
            "title_similarity": "0.58246195",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzwnadw",
            "score": 1,
            "text": "Call creeps out and support your ladies.",
            "title_similarity": "0.29341197",
            "sentiment_compound": 0.4019
        },
        {
            "id": "gzwnax9",
            "score": 1,
            "text": "If ur bro is struggling to get a gf or get laid. Be his wing man. Work him up to the chick he likes. \n\nDon't bring a fellow bro down, even in a joking way.\n\nWhen a fellow bro wants to talk seriously and not joke around, be serious. Tap into ur deep side and tell him the truth. Bro don't let other bros do things to hurt themselves. Lol",
            "title_similarity": "0.61220455",
            "sentiment_compound": -0.0742
        },
        {
            "id": "gzwndrw",
            "score": 1,
            "text": "No man left behind.",
            "title_similarity": "0.2953509",
            "sentiment_compound": -0.296
        },
        {
            "id": "gzwnhqg",
            "score": 1,
            "text": "Don't talk to me in the bathroom, if I'm holding my dick in my hand I dont wanna hear how your day is going.",
            "title_similarity": "0.62899053",
            "sentiment_compound": -0.0258
        },
        {
            "id": "gzwnka8",
            "score": 1,
            "text": "Don't kick the balls (unless its life threatening)",
            "title_similarity": "0.6478539",
            "sentiment_compound": -0.5267
        },
        {
            "id": "gzwnkgk",
            "score": 1,
            "text": "Bros before hoes unless hoes have no clothes.",
            "title_similarity": "0.48253",
            "sentiment_compound": -0.296
        },
        {
            "id": "gzwnkgv",
            "score": 1,
            "text": "If a girl you don’t know runs up and puts her arm around you and pretends to know you-she needs help and you help her.",
            "title_similarity": "0.3479402",
            "sentiment_compound": 0.6124
        },
        {
            "id": "gzwnogw",
            "score": 1,
            "text": "If you borrow a bro’s car, fill the tank on the way back",
            "title_similarity": "0.34036124",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzwnuyd",
            "score": 1,
            "text": "Uh no *fuck* the “no chit chat while peeing” rule.  \n\nHow about “always acknowledge each other’s presence”",
            "title_similarity": "0.76790386",
            "sentiment_compound": 0.431
        },
        {
            "id": "gzwnvr3",
            "score": 1,
            "text": "If you Respect the man you respect his woman. If you don’t respect the man then.... well you know 🥵",
            "title_similarity": "0.35834283",
            "sentiment_compound": 0.886
        },
        {
            "id": "gzwnzkz",
            "score": 1,
            "text": "If you're gunna rumble, take it outside.",
            "title_similarity": "0.40840378",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzwnzl0",
            "score": 1,
            "text": "Dropping the “ tough guy “ act. Let’s “head-nod”  or say “ what’s up “ instead of trying to intimidate.",
            "title_similarity": "0.6592078",
            "sentiment_compound": -0.3182
        },
        {
            "id": "gzwo9vs",
            "score": 1,
            "text": "Seriously keep a one urinal distance if possible whenever peeing in a public bathroom. Most dudes don't want to sword fight with another dude.",
            "title_similarity": "0.6039603",
            "sentiment_compound": -0.5839
        },
        {
            "id": "gzwoc5l",
            "score": 8,
            "text": "Before dating a friends ex, you are required to ask his permission and he, in return, is required to grant it.  But he's fully within his rights to say, \"man, are you gonna love the way she licks your testicals\".",
            "title_similarity": "0.5573125",
            "sentiment_compound": 0.8625
        },
        {
            "id": "gzwoqab",
            "score": 20,
            "text": "Don’t take back all the beers you brought to a party. You can retrieve as many as will fit in your pockets (The Tuck Rule).",
            "title_similarity": "0.47269017",
            "sentiment_compound": 0.6369
        },
        {
            "id": "gzworpi",
            "score": 1,
            "text": "If one of your bros is trying to get with a girl, you are not funnier than him when you all hang out.",
            "title_similarity": "0.4177974",
            "sentiment_compound": -0.3089
        },
        {
            "id": "gzwozir",
            "score": 8,
            "text": "No cockblocking. I only realized one of my friends wasn't a friend when someone pointed out his constant attempts to cockblock me.",
            "title_similarity": "0.632748",
            "sentiment_compound": -0.1847
        },
        {
            "id": "gzwp0zt",
            "score": 1,
            "text": "Bros before hoes, always",
            "title_similarity": "0.34721988",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzwp8d4",
            "score": 2,
            "text": "Don’t bang his ex.\n\n\nUnless he’s like “Yo, go for it”.",
            "title_similarity": "0.69277406",
            "sentiment_compound": 0.3612
        },
        {
            "id": "gzwphcb",
            "score": 2,
            "text": "It’s not gay if you are wearing gloves.",
            "title_similarity": "0.46929526",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzwpl5n",
            "score": 4,
            "text": "If your bro ever says that he was with you, even if you haven't seen him in years. Then he was with you.",
            "title_similarity": "0.41721058",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzwpm3v",
            "score": 1,
            "text": "Your speech is a tool. Do not use it as a weapon.",
            "title_similarity": "0.60428107",
            "sentiment_compound": -0.296
        },
        {
            "id": "gzwpn9u",
            "score": 10,
            "text": "If a dude has had enough to drink, don't keep offering him more.",
            "title_similarity": "0.5314895",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzwpoz5",
            "score": 1,
            "text": "If you're taller than your bro, never mention it.",
            "title_similarity": "0.4435915",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzwpzv8",
            "score": 1,
            "text": "If your bro likes a girl that’s his life not yours don’t try to go for the same girl ever",
            "title_similarity": "0.60466456",
            "sentiment_compound": 0.4215
        },
        {
            "id": "gzwq47y",
            "score": 1,
            "text": "No talking in the bathroom. I don't care how drunk, high, or just all around stupid you may be, treat the bathroom as the quiet place.",
            "title_similarity": "0.5296935",
            "sentiment_compound": -0.5411
        },
        {
            "id": "gzwq7fx",
            "score": 1,
            "text": "Absolutely NO putting up with sexual assault or harassment. \nGroup up and beat that persons ass.",
            "title_similarity": "0.53646815",
            "sentiment_compound": -0.9328
        },
        {
            "id": "gzwqbao",
            "score": 3,
            "text": "If a bro can be emotionally vulnerable and open up, you listen, be genuine, and keep that shit on lock.",
            "title_similarity": "0.5402677",
            "sentiment_compound": -0.6705
        },
        {
            "id": "gzwqcps",
            "score": 1,
            "text": "Women love self deprecating humor. It exudes big duck energy. 🦆",
            "title_similarity": "0.20035475",
            "sentiment_compound": 0.8126
        },
        {
            "id": "gzwqwf1",
            "score": 1,
            "text": "Urinal selection.",
            "title_similarity": "0.33578056",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzwqyh6",
            "score": 3,
            "text": "Check up on your Bros just to how they're doing.\n\n\n\n A lot of us are bad at opening up a dialouge about how we're feeling, at that makes it a lot easier.",
            "title_similarity": "0.44400507",
            "sentiment_compound": -0.0516
        },
        {
            "id": "gzwr0q9",
            "score": 1,
            "text": "Don’t throw your bro under the bus when his girl ask if he’s swinging other girls , don’t lie but don’t volunteer info",
            "title_similarity": "0.5772013",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzwr2vy",
            "score": 1,
            "text": "If you see any homie struggling, or just having a bad day, take 5 mins to help. If you can’t help, at least get the bro / sis some water to drink. \n\nIt’s a subtle way of showing support, and they’ll appreciate that you’re thinking of them.",
            "title_similarity": "0.3497753",
            "sentiment_compound": 0.5423
        },
        {
            "id": "gzwr70e",
            "score": 1,
            "text": "BROS BEFORE HOES. \n\nI wish I had headed this, The Greatest Rule.",
            "title_similarity": "0.53606695",
            "sentiment_compound": 0.7845
        },
        {
            "id": "gzwr90h",
            "score": 2,
            "text": "Never use the urinal immediately next to one being used.",
            "title_similarity": "0.5275408",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzwrdat",
            "score": 1,
            "text": "All the top comments \" don't do x that makes ur broski feel x in front of girl dude likes \"\nTotal bros here",
            "title_similarity": "0.561218",
            "sentiment_compound": 0.5574
        },
        {
            "id": "gzwrdk4",
            "score": 3,
            "text": "When moving, beer and pizza is always acceptable instead of cash.",
            "title_similarity": "0.45324028",
            "sentiment_compound": 0.3182
        },
        {
            "id": "gzwroyc",
            "score": 1,
            "text": "Hold your “bros” accountable when they fuck up",
            "title_similarity": "0.46844694",
            "sentiment_compound": -0.5423
        },
        {
            "id": "gzwru1g",
            "score": 1,
            "text": "DUI's are really expensive and completely avoidable. If a buddy calls you for a ride home, you give him one. If you can't, then call him an Uber and call the bar to give them a heads up. I've done this a couple times, and it's never not been worth cab faire and 20 minutes of lost sleep.",
            "title_similarity": "0.45841557",
            "sentiment_compound": -0.204
        },
        {
            "id": "gzwrx7r",
            "score": 1,
            "text": "that's a nice looking dong.",
            "title_similarity": "0.15115319",
            "sentiment_compound": 0.4215
        },
        {
            "id": "gzwrz5n",
            "score": 1,
            "text": "Don't let a bro drive drunk.",
            "title_similarity": "0.6293381",
            "sentiment_compound": -0.34
        },
        {
            "id": "gzws3xr",
            "score": 1,
            "text": "\"Do not look down on your Brother, unless you intend to lift him up\".",
            "title_similarity": "0.57998097",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzws9ak",
            "score": 1,
            "text": "I believe this one is unpopular, but don’t put your NEW girl before your boys.",
            "title_similarity": "0.6037503",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzwsc8y",
            "score": 1,
            "text": "If you find the bloke your mrs been rootin behind your back, not his fault, buy him a beer, let him know not to take her seriously. Unless he’s your mate... your mate should just let you know you’re dating a slag without rooting her",
            "title_similarity": "0.60617054",
            "sentiment_compound": 0.1426
        },
        {
            "id": "gzwsgj1",
            "score": 1,
            "text": "Don't sleep with a bro's ex unless you've got explicit permission",
            "title_similarity": "0.66058666",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzwsisq",
            "score": 1,
            "text": "Whenever one of your friends becomes a thing with another girl, respect that she’s off limits.",
            "title_similarity": "0.45519683",
            "sentiment_compound": 0.7351
        },
        {
            "id": "gzwsofs",
            "score": 1,
            "text": "dont try to initiate stuff with a girl if you know she has a boyfriend.",
            "title_similarity": "0.62888175",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzwsqut",
            "score": 1,
            "text": "Never make a move for a bro's ex girlfriend, even he says that it's ok.",
            "title_similarity": "0.56516457",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzwst53",
            "score": 1,
            "text": "Don’t diss a bro.",
            "title_similarity": "0.6061127",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzwsw7i",
            "score": 1,
            "text": "In high school, I had a friend who would insult all of us (his friends) in an attempt to earn the interest of a female of whom he knew was more interested in one of his said friends. So pathetic that they saw right through it. Don’t be that guy. To think, he often questioned as to why we left him out of a lot of our plans...lmao",
            "title_similarity": "0.38985163",
            "sentiment_compound": 0.7142
        },
        {
            "id": "gzwsycj",
            "score": 1,
            "text": "Never mention a mans past flings/relationships etc infront of his new girl..just incase they make it",
            "title_similarity": "0.53342724",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzwt07u",
            "score": 1,
            "text": "Dont sleep with your bro's ex",
            "title_similarity": "0.59877324",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzwtfps",
            "score": 1,
            "text": "Never go for each other's sister",
            "title_similarity": "0.4733461",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzwtgne",
            "score": 1,
            "text": "Bros never forget bros being Bros",
            "title_similarity": "0.3981915",
            "sentiment_compound": 0.1695
        },
        {
            "id": "gzwtm0c",
            "score": 1,
            "text": "When you see a bro being creepy, it’s time to put a stop to that shit.",
            "title_similarity": "0.5443884",
            "sentiment_compound": -0.7003
        },
        {
            "id": "gzwtov1",
            "score": 1,
            "text": "Get vaccinated",
            "title_similarity": "0.36892587",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzwtssw",
            "score": 1,
            "text": "Don’t backstab a bro.",
            "title_similarity": "0.64850914",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzwtw2z",
            "score": 1,
            "text": "Homies help homies...",
            "title_similarity": "0.30543566",
            "sentiment_compound": 0.4019
        },
        {
            "id": "gzwtzwe",
            "score": 1,
            "text": "Bill and Ted code.\n\nBe excellent to each other.",
            "title_similarity": "0.3437167",
            "sentiment_compound": 0.5719
        },
        {
            "id": "gzwu0bc",
            "score": 1,
            "text": "[deleted]",
            "title_similarity": "0.31642208"
        },
        {
            "id": "gzwuaw6",
            "score": 1,
            "text": "[deleted]",
            "title_similarity": "0.31642208"
        },
        {
            "id": "gzwukqg",
            "score": 1,
            "text": "Pinky promise is law.",
            "title_similarity": "0.3887606",
            "sentiment_compound": 0.3182
        },
        {
            "id": "gzwuwwb",
            "score": 1,
            "text": "None",
            "title_similarity": "0.31096607",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzwv5oe",
            "score": 1,
            "text": "You must dap him up unless he’s a real problem, if you don’t like him, too bad, you can only reject daps if it’s a serious enemy.",
            "title_similarity": "0.5768796",
            "sentiment_compound": -0.8807
        },
        {
            "id": "gzwv7ql",
            "score": 1,
            "text": "Don't fuck your bro's girl. No matter what. It's the ultimate bro test. It's never worth the stain it puts on your reputation. There is a good reason why the last ring of hell in Dante's Inferno was for betrayal.",
            "title_similarity": "0.55669844",
            "sentiment_compound": -0.6586
        },
        {
            "id": "gzwv97j",
            "score": 1,
            "text": "Non aggression principle.",
            "title_similarity": "0.50096285",
            "sentiment_compound": -0.296
        },
        {
            "id": "gzwvdxy",
            "score": 1,
            "text": "Don't blow up another guy's children.",
            "title_similarity": "0.60340184",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzwvfni",
            "score": 1,
            "text": "Dicks hard together",
            "title_similarity": "0.113495454",
            "sentiment_compound": -0.1027
        },
        {
            "id": "gzwvptb",
            "score": 1,
            "text": "If you’re going to smash a mates partner, you should probably re-evaluate your life",
            "title_similarity": "0.54741114",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzwvqlf",
            "score": 1,
            "text": "Receive thine permission before going hence on a female a bro hath dated before",
            "title_similarity": "0.50536704",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzwvs5a",
            "score": 1,
            "text": "Never make eye contact during a devil's three-way.",
            "title_similarity": "0.44412917",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzwvtcu",
            "score": 1,
            "text": "You don't need drugs or alcohol to have a good time",
            "title_similarity": "0.49267614",
            "sentiment_compound": 0.4404
        },
        {
            "id": "gzwvtpp",
            "score": 2,
            "text": "If you see a bro hitting on a chick who is not interested, you should tell him she isn't interested just in case he didn't notice.",
            "title_similarity": "0.6007905",
            "sentiment_compound": -0.5448
        },
        {
            "id": "gzwvxhz",
            "score": 1,
            "text": "Skip a urinal if there's room to do so.",
            "title_similarity": "0.6185931",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzwvyi8",
            "score": 1,
            "text": "I wanna see my bro jump roping butt booty naked with maximum efficiency.",
            "title_similarity": "0.42959496",
            "sentiment_compound": 0.3612
        },
        {
            "id": "gzww01e",
            "score": 1,
            "text": "Don't ever bring a friend down in a group setting, whether jocularly or seriously. I have been on the receiving end of this a couple of times. I'm still in \"touch\" with those people, but I've never forgotten the humiliation I was feeling at the time. Hence why I am not close with them anymore. No one needs to be treated like crap, least of all from whom he considers a friend.",
            "title_similarity": "0.5403752",
            "sentiment_compound": 0.8704
        },
        {
            "id": "gzww08k",
            "score": 7,
            "text": "Never sleep with a bro's girl after they have broken up. At any point, ever.",
            "title_similarity": "0.4459781",
            "sentiment_compound": -0.4767
        },
        {
            "id": "gzwwd8f",
            "score": 3,
            "text": "If any bro's girl is trying to start a fight between two or more bro's.. All bro's immediately throw shade on her and get a beer together..",
            "title_similarity": "0.34512797",
            "sentiment_compound": -0.3818
        },
        {
            "id": "gzwwly6",
            "score": 8,
            "text": "Don’t rape.",
            "title_similarity": "0.4935807",
            "sentiment_compound": -0.6908
        },
        {
            "id": "gzwwn06",
            "score": 8,
            "text": "If a Fist is outstretched, You need give the Bump.",
            "title_similarity": "0.38180375",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzwwrik",
            "score": 1,
            "text": "Man so I have a book for you",
            "title_similarity": "0.30694544",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzwwu0z",
            "score": 1,
            "text": "I always see men on this app complaining they never get compliments. Why don’t get guys compliment each other?",
            "title_similarity": "0.57002443",
            "sentiment_compound": 0.0108
        },
        {
            "id": "gzwwx3d",
            "score": 1,
            "text": "Don't be a dick.",
            "title_similarity": "0.44661248",
            "sentiment_compound": 0.4023
        },
        {
            "id": "gzwwyg4",
            "score": 1,
            "text": "Saying Bruh when appropriate",
            "title_similarity": "0.307144",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzwwzyk",
            "score": 3,
            "text": "Never take a mans last beer",
            "title_similarity": "0.4107738",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzwx8du",
            "score": 8,
            "text": "Don't be funnier that your homie around his crush",
            "title_similarity": "0.42758024",
            "sentiment_compound": -0.4325
        },
        {
            "id": "gzwxlhv",
            "score": 2,
            "text": "Always leave at least one urinal between you and another man",
            "title_similarity": "0.45708483",
            "sentiment_compound": -0.0516
        },
        {
            "id": "gzwxm5m",
            "score": 1,
            "text": "Pinkie up",
            "title_similarity": "0.09456945",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzwxxar",
            "score": 3,
            "text": "Bros before.....\n\nYou know.",
            "title_similarity": "0.32866043",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzwxxpp",
            "score": 1,
            "text": "Summary of this: \n\nsupport your bros, bros",
            "title_similarity": "0.39260834",
            "sentiment_compound": 0.481
        },
        {
            "id": "gzwy3n3",
            "score": 1,
            "text": "Always kiss the homies good night.",
            "title_similarity": "0.30613342",
            "sentiment_compound": 0.6908
        },
        {
            "id": "gzwy6yx",
            "score": 2,
            "text": "If you must take a nasty ass shit in your bros house use air freshener if available, open a window if possible and ALWAYS warn said bro of the foulness.",
            "title_similarity": "0.5099342",
            "sentiment_compound": -0.9022
        },
        {
            "id": "gzwy8b1",
            "score": 1,
            "text": "Ye have heard that it hath been said, Thou shalt love thy neighbour, and hate thine enemy. But I say unto you, Love your enemies, bless them that curse you, do good to them that hate you, and pray for them which despitefully use you, and persecute you.",
            "title_similarity": "0.4798971",
            "sentiment_compound": -0.6059
        },
        {
            "id": "gzwyaqu",
            "score": 1,
            "text": "When people ask about your bros, always give the best description of them.",
            "title_similarity": "0.46319538",
            "sentiment_compound": 0.6369
        },
        {
            "id": "gzwydqg",
            "score": 3,
            "text": "Don't talk about yourself in front of their date. You want to talk about how amazing your bro is 👍",
            "title_similarity": "0.6494206",
            "sentiment_compound": 0.6249
        },
        {
            "id": "gzwyi3k",
            "score": 1,
            "text": "Don’t have sex with a bro’s ex without their permission.",
            "title_similarity": "0.58991367",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzwyjxz",
            "score": 1,
            "text": "Don’t start talking with the girl your friend is talking too. Feel like it should be a no brainer yet it’s happened to me multiple times",
            "title_similarity": "0.54258704",
            "sentiment_compound": 0.5423
        },
        {
            "id": "gzwz0vt",
            "score": 3,
            "text": "Do not touch another man's firearms unless he literally hands one to you to look at.",
            "title_similarity": "0.5802245",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzwz2nk",
            "score": 3,
            "text": "If your bro is being out of line with a lady, grab the jerk and drag him away.",
            "title_similarity": "0.45902574",
            "sentiment_compound": -0.5106
        },
        {
            "id": "gzwz62t",
            "score": 2,
            "text": "Don’t get with your bro’s ex",
            "title_similarity": "0.5907023",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzwzbjt",
            "score": 3,
            "text": "When your bro’s lady friend’s around be polite. But when she’s not tell him *exactly* what you think about her. Drop it on them like an anvil in a cartoon, it can sometimes be a bit hurtful but at the end of the day you care about your bro and you’ll be damned before you let a person who doesn’t really love him take advantage of him.",
            "title_similarity": "0.5462816",
            "sentiment_compound": 0.7677
        },
        {
            "id": "gzwzc3n",
            "score": 1,
            "text": "All bros must get express written consent before dating another bros ex.",
            "title_similarity": "0.5032501",
            "sentiment_compound": 0.2263
        },
        {
            "id": "gzwzd9f",
            "score": 1,
            "text": "Never repeat or talk about something that shouldn't be shared with anyone else",
            "title_similarity": "0.5513889",
            "sentiment_compound": -0.2584
        },
        {
            "id": "gzwzden",
            "score": 1,
            "text": "BIRTHDAY BRO SHOTS\n\neven if it's espresso shots",
            "title_similarity": "0.37358838",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzwzetz",
            "score": 2,
            "text": "Never sleep with a friend's ex...ever...",
            "title_similarity": "0.4712897",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzwzifq",
            "score": 2,
            "text": "Never sleep with one of your bros exes. Ever.",
            "title_similarity": "0.53203195",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzwzl48",
            "score": 1,
            "text": "Calling each other out on shitty behavior immediately and not defending each other in toxic or problematic behaviors just because you have history.",
            "title_similarity": "0.6153426",
            "sentiment_compound": -0.7579
        },
        {
            "id": "gzwzm96",
            "score": 1,
            "text": "All these comments are about not making fun of each other but that’s what the best of friends do. True love.",
            "title_similarity": "0.55215627",
            "sentiment_compound": 0.9666
        },
        {
            "id": "gzwzmot",
            "score": 3,
            "text": "Bro applies to all genders.",
            "title_similarity": "0.17033918",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzwzo2j",
            "score": 1,
            "text": "Chit chat while peeing is awesome, made a lot of drunk friendships that way",
            "title_similarity": "0.1366306",
            "sentiment_compound": 0.6486
        },
        {
            "id": "gzwzsh9",
            "score": 1,
            "text": "Urinols",
            "title_similarity": "0.21860883",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzwzv8a",
            "score": 1,
            "text": "don’t date your bro’s ex.",
            "title_similarity": "0.62975067",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzwzx68",
            "score": 1,
            "text": "Respect all women everywhere.",
            "title_similarity": "0.13407183",
            "sentiment_compound": 0.4767
        },
        {
            "id": "gzx00e2",
            "score": 1,
            "text": "Don’t back bite. Just don’t.",
            "title_similarity": "0.5489212",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzx04ba",
            "score": 3,
            "text": "In welding I have a rule. Thou shalt not judge another mans welds unless thy welded it. This goes for more than just welding.\n\nThou shall not judge a man's work unless thy has done the work.",
            "title_similarity": "0.598158",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzx04xu",
            "score": 3,
            "text": "When your bro gives you an advice you hear him out and take some time to think about it.",
            "title_similarity": "0.44733393",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzx07fq",
            "score": 3,
            "text": "Don't date your bros ex's, shouldn't need to be said but I have a pos ex friend who clearly needs to hear it.",
            "title_similarity": "0.7356008",
            "sentiment_compound": 0.8338
        },
        {
            "id": "gzx0cw9",
            "score": 2,
            "text": "Don’t date your boy’s ex",
            "title_similarity": "0.60673344",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzx0h7s",
            "score": 1,
            "text": "Don’t ever contact your bro’s girl best friend.",
            "title_similarity": "0.548292",
            "sentiment_compound": 0.8126
        },
        {
            "id": "gzx0hau",
            "score": 2,
            "text": "Respect everyone!",
            "title_similarity": "0.19081928",
            "sentiment_compound": 0.5255
        },
        {
            "id": "gzx0i1m",
            "score": 3,
            "text": "If a bro ever loved a girl, she's off limits to me, for ever. If your bro really loved her, don't ever make that awkward situation. Even worse if its your bros baby momma.",
            "title_similarity": "0.58550245",
            "sentiment_compound": 0.659
        },
        {
            "id": "gzx0izo",
            "score": 2,
            "text": "Dont have sex with your best friends woman",
            "title_similarity": "0.5350827",
            "sentiment_compound": 0.8074
        },
        {
            "id": "gzx0jr0",
            "score": 2,
            "text": "Never pee in a stall next to someone, stagger",
            "title_similarity": "0.45638958",
            "sentiment_compound": -0.2023
        },
        {
            "id": "gzx0pf0",
            "score": 9,
            "text": "If your bro let’s you borrow his car/truck fill his tank before returning it.",
            "title_similarity": "0.3678254",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzx0prg",
            "score": 1,
            "text": "Never go for a bro’s ex.",
            "title_similarity": "0.58010995",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzx0vzo",
            "score": 1,
            "text": "the dude who throws the first punch gets a hiding from the whole group",
            "title_similarity": "0.33414954",
            "sentiment_compound": -0.296
        },
        {
            "id": "gzx114q",
            "score": 1,
            "text": "Be an excellent wingman, even at personal expense and dignity. Conversely, don't put your wingman in a position that compromises his dignity and/or personal expense. Bros before hos.",
            "title_similarity": "0.4864042",
            "sentiment_compound": 0.8442
        },
        {
            "id": "gzx12bi",
            "score": 1,
            "text": "If you, you're bro, and his crush are all in the same group, no one is allowed to be funnier than him.",
            "title_similarity": "0.3714029",
            "sentiment_compound": -0.0258
        },
        {
            "id": "gzx19qh",
            "score": 1,
            "text": "Don’t screw your mans girl",
            "title_similarity": "0.53883505",
            "sentiment_compound": -0.1027
        },
        {
            "id": "gzx1bvn",
            "score": 1,
            "text": "DRIVE SAFE \n\nDONT RAPE",
            "title_similarity": "0.4885713",
            "sentiment_compound": 0.7676
        },
        {
            "id": "gzx1cgi",
            "score": 1,
            "text": "When in doubt, don't escalate to nuclear war.",
            "title_similarity": "0.63142943",
            "sentiment_compound": -0.7506
        },
        {
            "id": "gzx1obd",
            "score": 1,
            "text": "Dont try flexing on another bros girl",
            "title_similarity": "0.58738273",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzx1r7l",
            "score": 1,
            "text": "Got to say fellas of Reddit, some of the suggestions on here are dope as hell. Would just love to see more real life aplication!",
            "title_similarity": "0.4566309",
            "sentiment_compound": -0.1759
        },
        {
            "id": "gzx1wl6",
            "score": 1,
            "text": "NO COCK BLOCKING simple as that. Girl version I’ve heard is No clam jamming",
            "title_similarity": "0.58753955",
            "sentiment_compound": 0.2871
        },
        {
            "id": "gzx29fl",
            "score": 1,
            "text": "The head nod",
            "title_similarity": "0.17423633",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzx2awr",
            "score": 1,
            "text": "When you meet up with the bros give a welcome hug. Just out your arms up and out and shout get over here. Physical reassurance of friendship should be a given and seen as anything other than platonic.\n\nI've had friends who were a bit weirded out at first with my friendliness however after a while it's normalised and bear hugs are fun. I have one friend who often refused (that's okay to) privately ask me for a hug once because he was going through some heavy shit and needed a bit of physical reassurance that everything was gonna be okay. He said \"no homo\" and I laughed \"we're in our thirties if I was gay if have had my wicked way with you by now, this ain't a long con of being friends for over 20 years just to hug you and turn you gay.\" Platonic love should be shown to the bros.",
            "title_similarity": "0.5516075",
            "sentiment_compound": 0.9898
        },
        {
            "id": "gzx2e6w",
            "score": 1,
            "text": "Don't fuck your bro's mom or sister. \n\n***Also, don't be fucking both bro's mom and sister. \n\n(The latter part shouldn't need to be written but I saw it happen, wish I had eyebleach that day)",
            "title_similarity": "0.71141356",
            "sentiment_compound": 0.6678
        },
        {
            "id": "gzx2ebc",
            "score": 1,
            "text": "I’d have a much nicer time if my friends actually followed all these rules",
            "title_similarity": "0.46093947",
            "sentiment_compound": 0.7184
        },
        {
            "id": "gzx2eu0",
            "score": 1,
            "text": "Do your best not to cross swords unless you’re both into it and have confirmed that you are both into it.",
            "title_similarity": "0.6211699",
            "sentiment_compound": 0.6369
        },
        {
            "id": "gzx2fee",
            "score": 1,
            "text": "If get with someone and and you later find out that the have a boyfriend after the fact, tell him, it’s not your fault because they didn’t tell you before hand, but it is up to you to let him know after.",
            "title_similarity": "0.5758539",
            "sentiment_compound": 0.4076
        },
        {
            "id": "gzx2ijg",
            "score": 1,
            "text": "If your friend manages to get in a relationship with a girl you like. You kill those feelings inside. Especially if your friends happy. Not sure if anyone does this but I've had feelings for a girl at the same time as a friend a few years back. He made the move before me and the next week they were official. We all hung out together throughout the relationship and it hurt sometimes that I couldn't be the one but I was happy that my friend was happy. I wouldn't destroy a decade of friendship for any girl.",
            "title_similarity": "0.36586165",
            "sentiment_compound": 0.9794
        },
        {
            "id": "gzx2ilf",
            "score": 1,
            "text": "I’d submit the “3 Midnight Amendments” courtesy of the McElroy Brothers:\n\n“Be Cool!”\n“C’mon”\n“Niiiiiiice”",
            "title_similarity": "0.48465025",
            "sentiment_compound": 0.4199
        },
        {
            "id": "gzx2m71",
            "score": 1,
            "text": "Only bros have the right to shit on other bros, and only when it's just the boys hanging out - NEVER shit on a bro in front of a girl he's interested in, and defend the boys when someone else shits on them.",
            "title_similarity": "0.5800631",
            "sentiment_compound": -0.2677
        },
        {
            "id": "gzx2ua0",
            "score": 1,
            "text": "Don’t date your best friend’s ex",
            "title_similarity": "0.571591",
            "sentiment_compound": 0.6369
        },
        {
            "id": "gzx2up1",
            "score": 1,
            "text": "Don’t date your best friend’s ex",
            "title_similarity": "0.571591",
            "sentiment_compound": 0.6369
        },
        {
            "id": "gzx2wcu",
            "score": 1,
            "text": "If you see a girl cheat on a bro, tell him. Even if this girl is your wife's bff, do the honourable thing",
            "title_similarity": "0.4917773",
            "sentiment_compound": 0.6124
        },
        {
            "id": "gzx2ww8",
            "score": 1,
            "text": "#1-Common BroCode Rule: Do not date your friends sister!! EVER!!\nTwice I've been in this situation and said \"nope, I'm too close/friends with your brother.\".... Then watched other \"said friends\" date my friends sister and watched the whole go up in flames... Friendships, parents, ect... all become a fuckin debacle!",
            "title_similarity": "0.4747578",
            "sentiment_compound": 0.8133
        },
        {
            "id": "gzx2zld",
            "score": 1,
            "text": "No tension, drama, and conflict should be between the bros because they are are like brothers in real life",
            "title_similarity": "0.54707384",
            "sentiment_compound": 0.2874
        },
        {
            "id": "gzx2zsc",
            "score": 1,
            "text": "Don’t look at each other while using a stall",
            "title_similarity": "0.4560577",
            "sentiment_compound": -0.2023
        },
        {
            "id": "gzx31u7",
            "score": 1,
            "text": "Dont fuck his GF or wife.  Simple code.",
            "title_similarity": "0.70430464",
            "sentiment_compound": 0.431
        },
        {
            "id": "gzx3515",
            "score": 1,
            "text": "The responses on this thread are so wholesome.",
            "title_similarity": "0.12181337",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzx35uc",
            "score": 1,
            "text": "Checking up on how they are doing",
            "title_similarity": "0.23811403",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzx39de",
            "score": 1,
            "text": "That people should stop immediately blaming the random person who their SO cheated on them with. The way it’s been seen in popular culture for ages is that it is uniquely the fault of the person outside the relationship even though they may display no ill intent. It’s likely a failure of communication among other problems within the relationship rather than the fault of any outsider.",
            "title_similarity": "0.56282747",
            "sentiment_compound": -0.9503
        },
        {
            "id": "gzx3bb4",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.31200892"
        },
        {
            "id": "gzx3d30",
            "score": 1,
            "text": "For the 30+ bros: it’s tough to make friends as we age, always be receptive to conversation at the park. Dads just trying to be dads, engage with dads that have similar aged children, your kids will enjoy the future play dates and if you and the other dad are compatible it’s even better. I’ve never been weirded out when a dad wants to exchange numbers for future play dates.",
            "title_similarity": "0.40883198",
            "sentiment_compound": 0.9313
        },
        {
            "id": "gzx3dxu",
            "score": 1,
            "text": "Don't try to out alpha another guy in your group . Its a bad look.",
            "title_similarity": "0.67464817",
            "sentiment_compound": -0.5423
        },
        {
            "id": "gzx3el8",
            "score": 1,
            "text": "Don’t creep on anyone and don’t let your bros be creeps.",
            "title_similarity": "0.67235076",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzx3ewf",
            "score": 1,
            "text": "No chitchat while peeing? Really? The \"rule\" I was aware of was casual discussion (weather / good band tonight / nice dick / whatever) was permitted if you were in equal bathroom position. Ie, both peeing, discussion ok. One peeing, other washing hands? I don't want to talk to you.",
            "title_similarity": "0.7192134",
            "sentiment_compound": 0.3222
        },
        {
            "id": "gzx3nc7",
            "score": 3,
            "text": "Dont be scum and help a girl cheat on her man. Bro or no bro.",
            "title_similarity": "0.600219",
            "sentiment_compound": -0.3612
        },
        {
            "id": "gzx3pkx",
            "score": 3,
            "text": "Be direct when your bro can't.\n\n\"Hey man, I hope this isn't awkward but...are you doing ok?\"",
            "title_similarity": "0.5761678",
            "sentiment_compound": 0.5178
        },
        {
            "id": "gzx3tfr",
            "score": 1,
            "text": "Breath that doesn’t smell like a shit ate a shit and then is hanging out in my bro’s mouth",
            "title_similarity": "0.5724583",
            "sentiment_compound": -0.6908
        },
        {
            "id": "gzx3veo",
            "score": 1,
            "text": "Talk to your bros with their issues. Depression's a bitch",
            "title_similarity": "0.42582887",
            "sentiment_compound": -0.5859
        },
        {
            "id": "gzx46qe",
            "score": 1,
            "text": "I don't know if it's much of a code but my dad always told me that in any situation you leave the bathroom cleaner than you found it",
            "title_similarity": "0.5674236",
            "sentiment_compound": 0.1901
        },
        {
            "id": "gzx4cul",
            "score": 1,
            "text": "If your bro tells you he likes a girl, it doesn't matter how close you are with the girl, you Do. Not. Tell. Her. It's not your place to say, he has to do it himself.",
            "title_similarity": "0.6332167",
            "sentiment_compound": 0.4071
        },
        {
            "id": "gzx4fhe",
            "score": 1,
            "text": "This isn’t so much a bro code, but more of a bro guideline I like to call the group intelligence rule. It’s based on the oddly innate phenomena that is bros trying to out-stupid each other.\nIt’s simple:\n\nTake the number of bros present in the group. Then divide 1 by that number. That is now the intelligence of each bro in the group.\n\nTLDR: the more bros in the group, the dumber they all get",
            "title_similarity": "0.5308687",
            "sentiment_compound": 0.8807
        },
        {
            "id": "gzx4fpv",
            "score": 1,
            "text": "No Gossip..... mic drop.",
            "title_similarity": "0.53145266",
            "sentiment_compound": -0.1486
        },
        {
            "id": "gzx4jyi",
            "score": 1,
            "text": "Bros before hoes",
            "title_similarity": "0.37687492",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzx4n4p",
            "score": 1,
            "text": "If a Bro breaks up with a girl, even if it's his own doing, that girl is off the cards for all the bros.",
            "title_similarity": "0.4553054",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzx4ne9",
            "score": 1,
            "text": "Don't sell your bros for a girl",
            "title_similarity": "0.68000066",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzx4sv8",
            "score": 1,
            "text": "Tell him if he stinks",
            "title_similarity": "0.37570018",
            "sentiment_compound": -0.25
        },
        {
            "id": "gzx4szp",
            "score": 1,
            "text": "Respect your bro's girlfriend/wife and don't flirt or have sex with her, even if she wants to.",
            "title_similarity": "0.61911345",
            "sentiment_compound": 0.4767
        },
        {
            "id": "gzx4u26",
            "score": 1,
            "text": "When you’re smoking weed with your friends don’t hog the joint and start talking a long joke or something without passing it. Also when you are lighting a bowl don’t like wave the lighter over the whole thing scorching the entire bowl corner it and pass it someone else has a fresh hit too",
            "title_similarity": "0.44362658",
            "sentiment_compound": 0.8442
        },
        {
            "id": "gzx4z9m",
            "score": 1,
            "text": "The golden rule. Do unto others......",
            "title_similarity": "0.33949715",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzx5cnb",
            "score": 1,
            "text": "If you break something you borrowed, you don't replace it. You upgrade it.",
            "title_similarity": "0.6273877",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzx5fbt",
            "score": 1,
            "text": "If you see a person struggling to hold up a motorbike from falling and you can, you should stop what you are doing and help them.",
            "title_similarity": "0.4877289",
            "sentiment_compound": -0.4404
        },
        {
            "id": "gzx5j4x",
            "score": 1,
            "text": "If you make a bet you stick to it. No takesys backsys",
            "title_similarity": "0.62752295",
            "sentiment_compound": -0.296
        },
        {
            "id": "gzx5jtj",
            "score": 1,
            "text": "Forgive your bros, a moment of kindness means a lot.",
            "title_similarity": "0.35760418",
            "sentiment_compound": 0.6249
        },
        {
            "id": "gzx5nt9",
            "score": 1,
            "text": "Don't use the middle urinal",
            "title_similarity": "0.5527954",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzx5q41",
            "score": 1,
            "text": "Bro code doesn’t cover sexual assault fyi for all the bros defending their shitty best friends",
            "title_similarity": "0.6147384",
            "sentiment_compound": 0.1779
        },
        {
            "id": "gzx5scj",
            "score": 1,
            "text": "I never had a real “bro” before. I used to have friends and they would only put me down or cockblock me",
            "title_similarity": "0.5026443",
            "sentiment_compound": 0.4767
        },
        {
            "id": "gzx678n",
            "score": 1,
            "text": "Nothing, absolutely nothing",
            "title_similarity": "0.3327058",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzx6csh",
            "score": 1,
            "text": "Treat each other like you are Eskimo brothers",
            "title_similarity": "0.43522364",
            "sentiment_compound": 0.6369
        },
        {
            "id": "gzx6nhq",
            "score": 1,
            "text": "Saying \"sup n\"",
            "title_similarity": "0.32141626",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzx6p6n",
            "score": 1,
            "text": "Incourage and support your bros in their passions and intrest. And never make fun of someone for what they wear.",
            "title_similarity": "0.68538064",
            "sentiment_compound": 0.4936
        },
        {
            "id": "gzx6zv4",
            "score": 1,
            "text": "Do not fuck with another man's automobile.",
            "title_similarity": "0.50813097",
            "sentiment_compound": 0.431
        },
        {
            "id": "gzx7ilk",
            "score": 1,
            "text": "Head down = acquaintance\n\nHead up = friend",
            "title_similarity": "0.358756",
            "sentiment_compound": 0.4939
        },
        {
            "id": "gzx7r7o",
            "score": 2,
            "text": "If a bro is disrespecting a woman, the bro needs to be checked.",
            "title_similarity": "0.53026277",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzx7s60",
            "score": 1,
            "text": "Dont mess around with your Bro's EX.",
            "title_similarity": "0.64434767",
            "sentiment_compound": 0.2755
        },
        {
            "id": "gzx7sal",
            "score": 1,
            "text": "When yo homies girl cheating: 📞🏃🏻‍♂️💨\n\n\nwhen yo homie cheating: 😪",
            "title_similarity": "0.2937721",
            "sentiment_compound": -0.802
        },
        {
            "id": "gzx7yfc",
            "score": 1,
            "text": "Have your bros back",
            "title_similarity": "0.3803341",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzx80i9",
            "score": 1,
            "text": "Don’t just be a friend, be a brother.",
            "title_similarity": "0.5107111",
            "sentiment_compound": 0.4939
        },
        {
            "id": "gzx82bl",
            "score": 2,
            "text": "If your bro dies, delete his browser history.",
            "title_similarity": "0.49399874",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzx85lx",
            "score": 1,
            "text": "Bros should recognize when other bros have more important things to do and respect it, like a job interview or sth",
            "title_similarity": "0.43581232",
            "sentiment_compound": 0.7713
        },
        {
            "id": "gzx869r",
            "score": 1,
            "text": "The head nod. Even I don’t know the bro - when we make eye contact and nod, we acknowledge, “we cool”.",
            "title_similarity": "0.5098984",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzx87s2",
            "score": 3,
            "text": "The only proper response to finger guns is finger guns.",
            "title_similarity": "0.50449973",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzx8ezu",
            "score": 1,
            "text": "Don't go after taken woman, unless their after you.",
            "title_similarity": "0.5929588",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzx8ozc",
            "score": 1,
            "text": "You are *always* a wingman for your single bro. You are *never* a wingman for your attached bro.",
            "title_similarity": "0.50924313",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzx8spn",
            "score": 1,
            "text": "No eye contact in a devil’s threeway…. 2 dudes",
            "title_similarity": "0.40613192",
            "sentiment_compound": -0.296
        },
        {
            "id": "gzx8y3v",
            "score": 1,
            "text": "Treat your partner with respect and no code should stop your bro from calling you on it. My best bro cheated on his girl so many times. It divided our group when I told his gf of 5 years of his consistent infidelity after o told him consistently to man up and stop fucking around and that if he kept doing it I’d tell his ol’ lady. He didn’t believe me and if it was me I’d want someone to let me know. 1st rule of bro club international..”we don’t protect douchery”",
            "title_similarity": "0.44692194",
            "sentiment_compound": 0.6124
        },
        {
            "id": "gzx94ak",
            "score": 1,
            "text": "Dont piss on the toilet seat. Unlike women we have urinals, so the toilet is mostly supposed to be for when youre in a pinch with nowhere to go. Dont sabotage a homie in a tough spot.",
            "title_similarity": "0.58679664",
            "sentiment_compound": 0.5475
        },
        {
            "id": "gzx96bv",
            "score": 1,
            "text": "Don't go after a girl that a Bro has a crush on and used to date unless with prior permission",
            "title_similarity": "0.5653951",
            "sentiment_compound": -0.1531
        },
        {
            "id": "gzx97ki",
            "score": 1,
            "text": "Stop saying bro",
            "title_similarity": "0.51208925",
            "sentiment_compound": -0.296
        },
        {
            "id": "gzx998d",
            "score": 1,
            "text": "All the guys i do Dungeons and dragons with are wholesome as hell. I love it when they do references from tv and anime back n fourth n what not. When the bois are happy everyone is happy:) always have wholesome times with the bois!",
            "title_similarity": "0.20720854",
            "sentiment_compound": 0.807
        },
        {
            "id": "gzx9cbc",
            "score": 1,
            "text": "If your bro is about to fuck up, dont let him do it",
            "title_similarity": "0.6454002",
            "sentiment_compound": -0.5423
        },
        {
            "id": "gzx9d12",
            "score": 1,
            "text": "If you see a minor girl being perv’ed on by an older man: bro code should state it’s perfect acceptable to cock block.",
            "title_similarity": "0.5295329",
            "sentiment_compound": 0.3612
        },
        {
            "id": "gzx9ica",
            "score": 1,
            "text": "No buddy fuckers...",
            "title_similarity": "0.53164756",
            "sentiment_compound": 0.2373
        },
        {
            "id": "gzx9ou8",
            "score": 1,
            "text": "Don't date your bros ex.",
            "title_similarity": "0.609865",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzx9pf3",
            "score": 1,
            "text": "Protect girls always",
            "title_similarity": "0.22626391",
            "sentiment_compound": 0.3818
        },
        {
            "id": "gzxa047",
            "score": 1,
            "text": "not sure if this is more 'guy code', but when you get to a urinal stall, FAN OUT. take the farthest urinal from another dude. simple algorithm.",
            "title_similarity": "0.6126835",
            "sentiment_compound": 0.3332
        },
        {
            "id": "gzxa0q7",
            "score": 1,
            "text": "If someone stares at a brother, whole squad has to stare back. Picture every scenario of that.",
            "title_similarity": "0.36102945",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzxa10f",
            "score": 1,
            "text": "Don’t bring up ex’s/ex hookups in front of now significant other.",
            "title_similarity": "0.59659857",
            "sentiment_compound": 0.2023
        },
        {
            "id": "gzxa6i3",
            "score": 1,
            "text": "Don't neglect the balls.",
            "title_similarity": "0.2915606",
            "sentiment_compound": 0.357
        },
        {
            "id": "gzxa8ja",
            "score": 1,
            "text": "If you arrive together, leave together!",
            "title_similarity": "0.38285783",
            "sentiment_compound": -0.126
        },
        {
            "id": "gzxabhb",
            "score": 1,
            "text": "One must always call out a bro when said bro is being creepy.",
            "title_similarity": "0.4926472",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzxacmd",
            "score": 1,
            "text": "Wait, the Bro Code isn’t international already?",
            "title_similarity": "0.6356009",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzxadjb",
            "score": 1,
            "text": "You and your bro have a responsibility to get an inebriated female home safely",
            "title_similarity": "0.39075235",
            "sentiment_compound": 0.4939
        },
        {
            "id": "gzxaeb4",
            "score": 1,
            "text": "If your bro doesn't have as much money as you, don't do rich people shit with them.",
            "title_similarity": "0.4493437",
            "sentiment_compound": -0.7596
        },
        {
            "id": "gzxaeh7",
            "score": 1,
            "text": "If a bro says he isn't doing great then offer help.",
            "title_similarity": "0.51644325",
            "sentiment_compound": -0.1516
        },
        {
            "id": "gzxamd1",
            "score": 1,
            "text": "No cameras at bucks parties",
            "title_similarity": "0.4449681",
            "sentiment_compound": 0.128
        },
        {
            "id": "gzxamor",
            "score": 1,
            "text": "Celebrate with a bro when they achieve and triumph and support a bro when they’ve failed or fallen",
            "title_similarity": "0.42142653",
            "sentiment_compound": 0.5719
        },
        {
            "id": "gzxaovw",
            "score": 1,
            "text": "DO NOT fuck your bro’s girlfriend. Oh yeah, and unless given permission, no exes, presuming she’s up for it.",
            "title_similarity": "0.70909417",
            "sentiment_compound": 0.431
        },
        {
            "id": "gzxawkx",
            "score": 1,
            "text": "The real bro code is that real men learn how to take care of others, to teach and to make the world a better place than you found it.",
            "title_similarity": "0.45827532",
            "sentiment_compound": 0.7269
        },
        {
            "id": "gzxb1ky",
            "score": 3,
            "text": "Acknowledge the nod",
            "title_similarity": "0.2539519",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzxb3ex",
            "score": 2,
            "text": "🚫🚫2 DIFFERENT MEN FEET SHALL NEVER COME IN CONTACT WITH ONE ANOTHER, WITHOUT SHOES WORN🚫🚫.",
            "title_similarity": "0.3713157",
            "sentiment_compound": 0.3465
        },
        {
            "id": "gzxbbie",
            "score": 1,
            "text": "Never share a girl",
            "title_similarity": "0.41313833",
            "sentiment_compound": -0.2235
        },
        {
            "id": "gzxbc35",
            "score": 1,
            "text": "Maintain a healthy majority, and a healthy minority, not for the majority of things but for all things.",
            "title_similarity": "0.33260906",
            "sentiment_compound": 0.4019
        },
        {
            "id": "gzxbdin",
            "score": 1,
            "text": "never sh!t talk a bro's missus, no matter how manipulative, cruel, rude, obnoxious she is.\n\nHe will sink or swim, he will never listen to your advice, she has his ear, she has his dingle berries. just be there when things hit the fan",
            "title_similarity": "0.5461018",
            "sentiment_compound": -0.8345
        },
        {
            "id": "gzxbey7",
            "score": 1,
            "text": "A bro shouldn’t threaten a fight if he’s not ready to back it up. Some of us actually believe what you say and will take it personal",
            "title_similarity": "0.59201014",
            "sentiment_compound": -0.7438
        },
        {
            "id": "gzxbfrt",
            "score": 1,
            "text": "Respect everyone you meet like a human being. Including women.",
            "title_similarity": "0.21383399",
            "sentiment_compound": 0.6808
        },
        {
            "id": "gzxbnnl",
            "score": 1,
            "text": "Always report relationship cheating. Known bro or not, enemy or not report the cheating.",
            "title_similarity": "0.43434992",
            "sentiment_compound": 0.2901
        },
        {
            "id": "gzxbxes",
            "score": 1,
            "text": "No chit chat while peeing?? I literally always spin the shit when I’m in a nightclub toilet taking a piss",
            "title_similarity": "0.36232048",
            "sentiment_compound": 0.1179
        },
        {
            "id": "gzxc0tw",
            "score": 1,
            "text": "\"Come on, let's leave\".",
            "title_similarity": "0.42694676",
            "sentiment_compound": -0.0516
        },
        {
            "id": "gzxc6m5",
            "score": 1,
            "text": "I left behind my crush because my bro had a conflict with her and I chose his side. Finding a bro is much harder than a girl.",
            "title_similarity": "0.4954444",
            "sentiment_compound": -0.4404
        },
        {
            "id": "gzxc8zo",
            "score": 2,
            "text": "When your bro is stylin’ give him a compliment.",
            "title_similarity": "0.39353603",
            "sentiment_compound": 0.4767
        },
        {
            "id": "gzxc9jx",
            "score": 1,
            "text": "Not too much eye contact when docking if one of you is straight.",
            "title_similarity": "0.4280771",
            "sentiment_compound": 0.2263
        },
        {
            "id": "gzxc9yx",
            "score": 1,
            "text": "Homies over hoes.",
            "title_similarity": "0.20300427",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzxcaqx",
            "score": 1,
            "text": "Never fight naked",
            "title_similarity": "0.43887052",
            "sentiment_compound": 0.2924
        },
        {
            "id": "gzxccaz",
            "score": 1,
            "text": "If someone goes for a fist bump, you fist bump them. Doesn't matter their race, age, height, nothing.",
            "title_similarity": "0.5120195",
            "sentiment_compound": -0.0191
        },
        {
            "id": "gzxccif",
            "score": 1,
            "text": "My bro’s love my chit chat at the urinal tho",
            "title_similarity": "0.32633045",
            "sentiment_compound": 0.6369
        },
        {
            "id": "gzxcfak",
            "score": 1,
            "text": "If your bro is being physically hit or excessively downtalked by his girl, boy, or SO, say something or do something. Seen way too many bros fall into abusive relationships this way",
            "title_similarity": "0.3355619",
            "sentiment_compound": -0.6369
        },
        {
            "id": "gzxcfdf",
            "score": 4,
            "text": "Tell your bros that you love them",
            "title_similarity": "0.3401747",
            "sentiment_compound": 0.6369
        },
        {
            "id": "gzxch65",
            "score": 1,
            "text": "Liqueur before beer never fear, Beer before liqueur never sicker",
            "title_similarity": "0.39192146",
            "sentiment_compound": 0.3875
        },
        {
            "id": "gzxch8r",
            "score": 1,
            "text": "A bro never uses a urinal directly next to another bro if other urinals are available",
            "title_similarity": "0.542359",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzxcp0z",
            "score": 3,
            "text": "The nod.",
            "title_similarity": "0.21940742",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzxd00f",
            "score": 1,
            "text": "There is no code... only truth. It’s what separates us from the fembots.",
            "title_similarity": "0.6440152",
            "sentiment_compound": 0.0258
        },
        {
            "id": "gzxd1ny",
            "score": 1,
            "text": "I got a two-fer for ya. \n\nHelp younger bros become savior bros. \n\nPut more bro in to the world than you take. \n\n\nExample: \n\nThe other day I was at the dispensary. A young man visiting town asked my brother and I if he could bum a ride back to his hotel after he had come outside with his purchase in hand. \n\nWalking through my town around sundown with a dispensary bag as an uninformed tourist isn’t the best spot to be in. So I went across town the opposite way from my home and dropped him off. To his credit this young man was well on his way to bro-hood. He offered to pay me for the ride in weed. \n\nInstead of accepting my brother and I told him to simply pay it forward and enjoy his visit. \n\nThe best thing you can do is put more bro in to the world for others. I assure you it comes full circle and may even help someone you do know.",
            "title_similarity": "0.4515105",
            "sentiment_compound": 0.9801
        },
        {
            "id": "gzxd2j5",
            "score": 1,
            "text": "You do significant work for a bro (moving, building, demo, etc.) they buy you a case of beer as a thanks. Thats bro code, bros.",
            "title_similarity": "0.40136087",
            "sentiment_compound": 0.5719
        },
        {
            "id": "gzxd4bp",
            "score": 1,
            "text": "Bros before hos. Always. No matter what.",
            "title_similarity": "0.4385227",
            "sentiment_compound": -0.0191
        },
        {
            "id": "gzxd5ro",
            "score": 1,
            "text": "Rule 1 for me has always been don’t go after your bros ex or someone you know they’re interested in",
            "title_similarity": "0.6651427",
            "sentiment_compound": 0.4019
        },
        {
            "id": "gzxd7eb",
            "score": 3,
            "text": "Always leave a space between urinals, unless they are all full.",
            "title_similarity": "0.36653215",
            "sentiment_compound": -0.0516
        },
        {
            "id": "gzxd801",
            "score": 1,
            "text": "If your bro supports the rival team. You are rivals for the duration of the match/tournament and the second the post match discussion is complete, you're beer buddies. \n\nYou do not take sports rivalry beyond the post match discussion.",
            "title_similarity": "0.47432157",
            "sentiment_compound": 0.3612
        },
        {
            "id": "gzxd83m",
            "score": 1,
            "text": "If there are three urinals and they are full (a sin being used by 2 people), you use the stall to pee instead of the middle one.",
            "title_similarity": "0.3625162",
            "sentiment_compound": -0.6597
        },
        {
            "id": "gzxdb8j",
            "score": 2,
            "text": "If a bro got a Boner, make sure to stand in front of it and hide it with your ass to help him avoid any embarrassment\n\n\n-Lao Tzu",
            "title_similarity": "0.6335139",
            "sentiment_compound": -0.6486
        },
        {
            "id": "gzxdcyp",
            "score": 1,
            "text": "Claim a fart or dump for your boy.",
            "title_similarity": "0.4386315",
            "sentiment_compound": -0.3818
        },
        {
            "id": "gzxddm0",
            "score": 1,
            "text": "any man can chi chat while peeing we do it all the time at work that is not a bro code at all",
            "title_similarity": "0.45034242",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzxde38",
            "score": 1,
            "text": "Skip one space in-between urinals, and don't talk while at urinals",
            "title_similarity": "0.5367887",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzxdh7o",
            "score": 2,
            "text": "Solidarity for the working class to produce a revolutionary dictatorship of the proletariat.\n\nReally, ya gotta look out for one another ya. Should probably start a club for it or something. Like the Internationale Workingbros Affiliation... We'll figure it out.",
            "title_similarity": "0.4452659",
            "sentiment_compound": 0.5719
        },
        {
            "id": "gzxdk3f",
            "score": 1,
            "text": "Don't \"act gay\" with your bros/boys/homies, *be* gay with them.",
            "title_similarity": "0.6612835",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzxdr56",
            "score": 1,
            "text": "Dont date your best bros sister.It puts them in a difficult situation and your friendship is not worth some hoe",
            "title_similarity": "0.5256001",
            "sentiment_compound": -0.5624
        },
        {
            "id": "gzxdti5",
            "score": 1,
            "text": "A workmate asked me how my mother was doing (she had a mini-stroke), while we were both peeing at the urinal , and all I could say was, \"Mate, I'm not talking about my mother while I've got my dick in my hand.\"",
            "title_similarity": "0.4724509",
            "sentiment_compound": -0.0258
        },
        {
            "id": "gzxdw29",
            "score": 1,
            "text": "Don’t let your bro be manipulated by a narcissistic woman",
            "title_similarity": "0.57958347",
            "sentiment_compound": -0.3818
        },
        {
            "id": "gzxdybc",
            "score": 1,
            "text": "Never hit on your bros girl or your bros ex",
            "title_similarity": "0.52108264",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzxe1oe",
            "score": 1,
            "text": "Homiesexual for the bro’s",
            "title_similarity": "0.3797274",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzxe326",
            "score": 1,
            "text": "If i'm peeing in urinal, dont be adjacent to me if its not crowded. If crowded, never look below shoulder height of neighbor.\n\nIf a girl talks to you, bros that are around should give a silent signal if its good or not.",
            "title_similarity": "0.6207549",
            "sentiment_compound": 0.4404
        },
        {
            "id": "gzxe4br",
            "score": 1,
            "text": "If a bro is visibly sad, give them a compliment that isn’t mushy. Something like: “Woah, that’s some sickass shades u got on”",
            "title_similarity": "0.44449642",
            "sentiment_compound": 0.3612
        },
        {
            "id": "gzxeaoa",
            "score": 1,
            "text": "Never put yourself in a position to fall or mess around with your bros ex.",
            "title_similarity": "0.5877692",
            "sentiment_compound": -0.3612
        },
        {
            "id": "gzxee3o",
            "score": 1,
            "text": "No cameras",
            "title_similarity": "0.3883717",
            "sentiment_compound": -0.296
        },
        {
            "id": "gzxegzy",
            "score": 1,
            "text": "Thou shalt not date a Bro’s ex-wife. It’s a big planet; can’t you find anyone else?",
            "title_similarity": "0.54362833",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzxei0g",
            "score": 1,
            "text": "Main girl is off limits, everyone else is fair game.",
            "title_similarity": "0.41625178",
            "sentiment_compound": 0.3182
        },
        {
            "id": "gzxeira",
            "score": 1,
            "text": "Don't fuck no bitch that fucking with yo dog, that's law.",
            "title_similarity": "0.6289481",
            "sentiment_compound": 0.0815
        },
        {
            "id": "gzxekp6",
            "score": 1,
            "text": "Don't say 'no homo' around the bros that are homo.",
            "title_similarity": "0.67984295",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzxekxa",
            "score": 1,
            "text": "Don’t fuck your bro’s ex. Especially if that bro was your best friend. Fuckin happened to me and it’s a very low feeling.",
            "title_similarity": "0.6416249",
            "sentiment_compound": 0.5082
        },
        {
            "id": "gzxelzy",
            "score": 1,
            "text": "If your bro told you a secret, never turn it as a weapon against him.",
            "title_similarity": "0.6916825",
            "sentiment_compound": -0.296
        },
        {
            "id": "gzxemqc",
            "score": 1,
            "text": "Kinda like how it's supposed to be international but is based on euro centric standards",
            "title_similarity": "0.5120488",
            "sentiment_compound": 0.154
        },
        {
            "id": "gzxesm6",
            "score": 1,
            "text": "No such code exists. At least to me it doesn't. Been fucked over to many times I've just gone lone wolf",
            "title_similarity": "0.4264666",
            "sentiment_compound": 0.0557
        },
        {
            "id": "gzxeuo1",
            "score": 1,
            "text": "Don’t destabilize several democratically elected socialist countries to prove that socialism doesn’t work.",
            "title_similarity": "0.6106948",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzxevtg",
            "score": 1,
            "text": "A bros should not make eye contact during a devil's three way.",
            "title_similarity": "0.63308156",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzxfa3o",
            "score": 2,
            "text": "We should normalise the “bro nod”\nWhen walking down the street.",
            "title_similarity": "0.50352097",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzxfb44",
            "score": 1,
            "text": "This is one of the most wholesome post I've read on Reddit.",
            "title_similarity": "0.2514492",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzxfcha",
            "score": 1,
            "text": "Ye shall not be jelly of a bro, ye shall instead fist bump for any level of achievement.",
            "title_similarity": "0.65794176",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzxfhkr",
            "score": 2,
            "text": "Kissing the homies goodnight ain't gay",
            "title_similarity": "0.57407117",
            "sentiment_compound": 0.5719
        },
        {
            "id": "gzxfjxn",
            "score": 2,
            "text": "If you make eye contact with someone you know: Head nod up.\n\nIf you make eye contact with someone you DON'T know: Head nod down.\n\nYou might notice yourself doing it subconsciously, but it would be nice to know it's universal.",
            "title_similarity": "0.5556214",
            "sentiment_compound": 0.5719
        },
        {
            "id": "gzxflt7",
            "score": 1,
            "text": "Bros before hoes...",
            "title_similarity": "0.37265784",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzxfmwv",
            "score": 1,
            "text": "Respecting women",
            "title_similarity": "0.13666923",
            "sentiment_compound": 0.4939
        },
        {
            "id": "gzxfq0y",
            "score": 1,
            "text": "You definitely chit chat with a bro while peeing tho, maybe not a stranger",
            "title_similarity": "0.5021359",
            "sentiment_compound": 0.4019
        },
        {
            "id": "gzxfqnj",
            "score": 1,
            "text": "Bras or no bras, my answer will always be no bras.",
            "title_similarity": "0.6260328",
            "sentiment_compound": -0.5267
        },
        {
            "id": "gzxfuvv",
            "score": 1,
            "text": "No going after  one Bro's family girls",
            "title_similarity": "0.58092415",
            "sentiment_compound": -0.296
        },
        {
            "id": "gzxfvcu",
            "score": 1,
            "text": "You definitely get more dates when you and your bro compliment each other in front of woman. Working together instead of cock blocking works way better.",
            "title_similarity": "0.32073426",
            "sentiment_compound": 0.6705
        },
        {
            "id": "gzxg0lx",
            "score": 1,
            "text": "Waves from cars and boats should always be returned, unless you are a monster",
            "title_similarity": "0.5017675",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzxg2sq",
            "score": 2,
            "text": "If that dude is in the hospital, or worse, and you can manage it, delete that browser history.",
            "title_similarity": "0.36002836",
            "sentiment_compound": -0.4767
        },
        {
            "id": "gzxg6mn",
            "score": 1,
            "text": "Dont use the middle urinal",
            "title_similarity": "0.541368",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzxg9g7",
            "score": 1,
            "text": "People don’t talk shit at the urinals?",
            "title_similarity": "0.5109176",
            "sentiment_compound": -0.5574
        },
        {
            "id": "gzxggow",
            "score": 1,
            "text": "If one of the boys gf is doing shady shit you tell him",
            "title_similarity": "0.41508362",
            "sentiment_compound": -0.5574
        },
        {
            "id": "gzxggv0",
            "score": 1,
            "text": "Do NOT use the urine stall next to each other",
            "title_similarity": "0.54411227",
            "sentiment_compound": -0.2023
        },
        {
            "id": "gzxgmks",
            "score": 1,
            "text": "No sex with your Bros ex.\n\nPeriod.",
            "title_similarity": "0.6042856",
            "sentiment_compound": -0.296
        },
        {
            "id": "gzxgnei",
            "score": 1,
            "text": "Never, NEVER even attempt anything with your boy’s ex, no matter how detached he tells you he is from her.",
            "title_similarity": "0.534093",
            "sentiment_compound": -0.1466
        },
        {
            "id": "gzxgqkq",
            "score": 1,
            "text": "Is this 2007?",
            "title_similarity": "0.17479528",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzxgsuo",
            "score": 1,
            "text": "The Geneva Conventions",
            "title_similarity": "0.3108433",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzxh5k7",
            "score": 1,
            "text": "Never bang your boys ex",
            "title_similarity": "0.588593",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzxh6zh",
            "score": 1,
            "text": "Be Kind",
            "title_similarity": "0.16808456",
            "sentiment_compound": 0.5267
        },
        {
            "id": "gzxh7hm",
            "score": 1,
            "text": "You must welcome a bro by a fist bump or man hug",
            "title_similarity": "0.44214597",
            "sentiment_compound": 0.7269
        },
        {
            "id": "gzxhbwe",
            "score": 1,
            "text": "Don’t go after your friends exes",
            "title_similarity": "0.6072668",
            "sentiment_compound": 0.4767
        },
        {
            "id": "gzxhesr",
            "score": 1,
            "text": "Top ten comments; literally the same 😆",
            "title_similarity": "0.10486406",
            "sentiment_compound": 0.5106
        },
        {
            "id": "gzxhfrl",
            "score": 1,
            "text": "Don't go to the stall to pee next to someone peeing if you can help it",
            "title_similarity": "0.6400552",
            "sentiment_compound": 0.2263
        },
        {
            "id": "gzxhjrj",
            "score": 1,
            "text": "Consent is sexy.",
            "title_similarity": "0.17943998",
            "sentiment_compound": 0.6486
        },
        {
            "id": "gzxhnox",
            "score": 1,
            "text": "Never tell his gf if he cheats on her.",
            "title_similarity": "0.58669674",
            "sentiment_compound": -0.4215
        },
        {
            "id": "gzxhq42",
            "score": 1,
            "text": "Call your bro if you miss him. He probably misses you too.",
            "title_similarity": "0.3986425",
            "sentiment_compound": -0.3612
        },
        {
            "id": "gzxhu2c",
            "score": 2,
            "text": "Don't date the ex.",
            "title_similarity": "0.5577239",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzxhxok",
            "score": 6,
            "text": "Carry around silver spray paint just in case another bro feels like doing some stupid shit. They'll never make it into Valhalla otherwise.",
            "title_similarity": "0.55210793",
            "sentiment_compound": -0.6705
        },
        {
            "id": "gzxhy7k",
            "score": 1,
            "text": "Your buddies exes and siblings are off limits 🤷🏻‍♀️",
            "title_similarity": "0.5575557",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzxi1hm",
            "score": 1,
            "text": "Loyalty.",
            "title_similarity": "0.23018068",
            "sentiment_compound": 0.5423
        },
        {
            "id": "gzxic49",
            "score": 1,
            "text": "Bro’s before hoes",
            "title_similarity": "0.32510966",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzxidd7",
            "score": 1,
            "text": "Not sure if bro code but don't fuck with a guy who is sleeping or using the washroom. It's the most vulnerable someone can be.",
            "title_similarity": "0.6451159",
            "sentiment_compound": 0.1292
        },
        {
            "id": "gzxif2w",
            "score": 1,
            "text": "Protect your boys girl, just as you would protect your boy. I can trust every single one of my friends to be around my girlfriend, and from conversations online that is not always the standard.",
            "title_similarity": "0.39920077",
            "sentiment_compound": 0.891
        },
        {
            "id": "gzximoz",
            "score": 2,
            "text": "A nice \"Hey king, nice cock\" never fails to brighten a man's day",
            "title_similarity": "0.27557907",
            "sentiment_compound": 0.6028
        },
        {
            "id": "gzxirvp",
            "score": 1,
            "text": "If your bro doesn't understand boundaries with girls, girls gonna be creeped out and they will associate you with it. Be a good bro and call out your bros when they are being disrespectful. Better you than others.",
            "title_similarity": "0.47189936",
            "sentiment_compound": 0.7003
        },
        {
            "id": "gzxis0i",
            "score": 1,
            "text": "Be a bro to that bro, don't be a fake bro bro..",
            "title_similarity": "0.55459285",
            "sentiment_compound": 0.3724
        },
        {
            "id": "gzxiwmd",
            "score": 1,
            "text": "No talking in the men's room unless there is an imminent threat. \n\nI've got my penis in my hand in public, the last thing I want is you trying to make eye contact talking about some bullshit.",
            "title_similarity": "0.6079235",
            "sentiment_compound": -0.7096
        },
        {
            "id": "gzxiwt7",
            "score": 1,
            "text": "Use Metric System.",
            "title_similarity": "0.18435799",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzxj0m3",
            "score": 1,
            "text": "If your bro dies and you have access to his computer/phone/etc., delete his browsing history.",
            "title_similarity": "0.4454844",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzxj2b4",
            "score": 1,
            "text": "Don't date their sister or their ex unless they made it very clear that it's all good.",
            "title_similarity": "0.6888786",
            "sentiment_compound": 0.6997
        },
        {
            "id": "gzxj5sy",
            "score": 2,
            "text": "No talking in a public bathroom.",
            "title_similarity": "0.4429942",
            "sentiment_compound": -0.296
        },
        {
            "id": "gzxjebb",
            "score": 1,
            "text": "Know when you are the 3rd wheel and have a plan for yourself or your friend in the event someone is a 3rd wheel... and never take it personally.",
            "title_similarity": "0.5758383",
            "sentiment_compound": 0.4939
        },
        {
            "id": "gzxjln4",
            "score": 1,
            "text": "If there are three empty urinals in a bathroom, take either of the end urinals, never the middle one.",
            "title_similarity": "0.4711175",
            "sentiment_compound": -0.2023
        },
        {
            "id": "gzxjly5",
            "score": 1,
            "text": "Be kind",
            "title_similarity": "0.16808456",
            "sentiment_compound": 0.5267
        },
        {
            "id": "gzxjm59",
            "score": 2,
            "text": "Don’t cockblock",
            "title_similarity": "0.5395062",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzxjwgs",
            "score": 2,
            "text": "Accept a beer, cigarette, coffee whatever it is if someone offers. It's not a question of whether you want it or not but an invitation to get to know each other. \n\nThis is more of a guideline though.",
            "title_similarity": "0.51688874",
            "sentiment_compound": 0.2382
        },
        {
            "id": "gzxk1ai",
            "score": 1,
            "text": "Yurinal spacing rule",
            "title_similarity": "0.34485048",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzxk1il",
            "score": 1,
            "text": "Never ever cock block if its two consenting adults. I don't care how jealous you are.",
            "title_similarity": "0.57606775",
            "sentiment_compound": 0.4023
        },
        {
            "id": "gzxk5zv",
            "score": 1,
            "text": "Nofomybroho . During or after their relationship",
            "title_similarity": "0.42516235",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzxkcii",
            "score": 1,
            "text": "Always stop your bro and punch your bro in the face if he is being a creep, making a person uncomfortable, or sexually assaulting them.",
            "title_similarity": "0.3927253",
            "sentiment_compound": -0.7964
        },
        {
            "id": "gzxkmcc",
            "score": 1,
            "text": "Don't be a fucking asshole",
            "title_similarity": "0.47259533",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzxkzuo",
            "score": 2,
            "text": "Always 1 buffer urinal away from each other in the restroom. Exception being a dire emergency. (We've all been there: that movie theater upgrade to the 55 gallon drum special soda you got talked into at the beginning kicks-in an hour later, you just have to pee now.) \n\nOtherwise, keep your distance and don't be breathing down my neck if you are waiting your turn. It's uncomfortable. Let me pee in peace.",
            "title_similarity": "0.50721055",
            "sentiment_compound": -0.25
        },
        {
            "id": "gzxl0d5",
            "score": 3,
            "text": "Don't sleep with your Bro's woman.",
            "title_similarity": "0.634019",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzxl584",
            "score": 3,
            "text": "Don’t let them fuck their life up doing dumb shit. Keep them grounded but gas them up if they are succeeding.",
            "title_similarity": "0.63614565",
            "sentiment_compound": -0.1027
        },
        {
            "id": "gzxlcex",
            "score": 1,
            "text": "don’t mess with his girl",
            "title_similarity": "0.57489073",
            "sentiment_compound": -0.3612
        },
        {
            "id": "gzxldik",
            "score": 1,
            "text": "Don’t ever ever date the bros ex gf or wife!!!",
            "title_similarity": "0.5162655",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzxlj1n",
            "score": 1,
            "text": "When saying something bad (real talk) about one of the bros to someone you have to say 'but he's a good guy though' afterwards.\nThis is assuming you don't hang with serial killers/rapists/cheaters etc.\nPretty much the bro code you follow is a reflection on your group.",
            "title_similarity": "0.6083715",
            "sentiment_compound": 0.7845
        },
        {
            "id": "gzxlq2t",
            "score": 1,
            "text": "Bros before hoes. My what I supposed to be a brother broke this one ×_×",
            "title_similarity": "0.47160345",
            "sentiment_compound": -0.4215
        },
        {
            "id": "gzxlqih",
            "score": 1,
            "text": "Don’t dis a bros salary when you make more than he does. High five and right on for your bro making his money. \n\nMy electrician neighbor feels the need to share what he makes an hour / year when the others neighbors are talking shop.",
            "title_similarity": "0.3423782",
            "sentiment_compound": 0.296
        },
        {
            "id": "gzxlva8",
            "score": 1,
            "text": "Guide the cock, don't block it",
            "title_similarity": "0.5752973",
            "sentiment_compound": 0.2037
        },
        {
            "id": "gzxm1gp",
            "score": 1,
            "text": "Bros before Hoes.",
            "title_similarity": "0.37481892",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzxm5qt",
            "score": 1,
            "text": "Never date a bros ex",
            "title_similarity": "0.4594367",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzxmgfb",
            "score": 1,
            "text": "Bro's before hoes, and homies over chicks.",
            "title_similarity": "0.3663332",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzxmgpf",
            "score": 2,
            "text": "Be excellent to each other.",
            "title_similarity": "0.18068296",
            "sentiment_compound": 0.5719
        },
        {
            "id": "gzxmgy5",
            "score": 1,
            "text": "When introducing one bro/friend to another or group I throw in something I like about them, respect about them, or a conversation starter to say “this person is cool, here’s something you can use to get the conversation started.”\nI have an especially awkward group friends that don’t immediately mesh with people, but open up once things get going.",
            "title_similarity": "0.4150775",
            "sentiment_compound": 0.6352
        },
        {
            "id": "gzxmru5",
            "score": 2,
            "text": "Don't Rape",
            "title_similarity": "0.47330654",
            "sentiment_compound": 0.5773
        },
        {
            "id": "gzxn0um",
            "score": 1,
            "text": "No staring at each other pee pees in a bathroom.",
            "title_similarity": "0.4721375",
            "sentiment_compound": -0.296
        },
        {
            "id": "gzxn87f",
            "score": 1,
            "text": "Never date a bro’s former girl. Or guy.",
            "title_similarity": "0.48891994",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzxnob6",
            "score": 1,
            "text": "If she's married you don't flirt. If she flirts you rat her out, then when she's single you have at it.",
            "title_similarity": "0.54833055",
            "sentiment_compound": 0.1779
        },
        {
            "id": "gzxnu40",
            "score": 2,
            "text": "Don't take the urinal next to another person unless there are no others open.",
            "title_similarity": "0.5914585",
            "sentiment_compound": -0.296
        },
        {
            "id": "gzxnvqe",
            "score": 1,
            "text": "No man should tolerate another man’s toxicity, no matter who the victim.",
            "title_similarity": "0.5353142",
            "sentiment_compound": -0.5226
        },
        {
            "id": "gzxnwjj",
            "score": 1,
            "text": "No homo",
            "title_similarity": "0.40768456",
            "sentiment_compound": -0.296
        },
        {
            "id": "gzxo08b",
            "score": 1,
            "text": "Only use urinals 1 3 and 5 never 2 and 4",
            "title_similarity": "0.38593525",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzxo69g",
            "score": 1,
            "text": "Beat the fuck out of rapists",
            "title_similarity": "0.28169844",
            "sentiment_compound": -0.8316
        },
        {
            "id": "gzxo7xg",
            "score": 1,
            "text": "Bros before hoes",
            "title_similarity": "0.37687492",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzxogyx",
            "score": 1,
            "text": "No eye contact in a devil's threeway.",
            "title_similarity": "0.41004628",
            "sentiment_compound": -0.296
        },
        {
            "id": "gzxohrg",
            "score": 1,
            "text": "Don't hit on your bro's ex.",
            "title_similarity": "0.6535806",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzxoj1i",
            "score": 1,
            "text": "ITT: just don’t be a dick",
            "title_similarity": "0.52055836",
            "sentiment_compound": -0.5106
        },
        {
            "id": "gzxonn2",
            "score": 1,
            "text": "One urinal as a buffer minimum distance if at all possible.",
            "title_similarity": "0.49183995",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzxono6",
            "score": 1,
            "text": "If she’s spoken for, she is ugly.",
            "title_similarity": "0.2771008",
            "sentiment_compound": -0.5106
        },
        {
            "id": "gzxoovh",
            "score": 1,
            "text": "Never, ever flirt with your bro's girl. \nFind your own, loser.\n\nDon't try to act like a fucking alpha in front of your bro's girl or your gang. Let him have the stage. \nHype him up. \n\nNo matter how hot she is. It's not worth your friendship.\n\nEven if they're not serious or casually dating. \nStay the F away.\n\nNever put bro down or make jokes about his insecurities in front of women. If you do, you're a bully and you deserve the worst.\n\nIf you see friends ganging up on him to poke fun, don't join. Back him up instead.\n\nDo not text bro's girl or be 'friendly' unnecessarily. You're not dumb. You know exactly what you're doing, you piece of shit. Also if you see another bro pulling this stuff, confront him and give them shit for it. Such behaviour should be discouraged.\n\nEven if she hits on you, back off. If she does, tell the bro immediately. Come what may. \n\nDon't let anyone bitch about bro in his absence. Have his back at all times. \n\nIf a bro is down or crying, don't make fun of him. Hug it out. Fucking talk. Listen to him and let him pour out. Men don't listen to their guy friends enough. Which is why they go around seeking random women for emotional support and end up getting even more fucked. \n\nFinally. Have some fucking standards.\nBe a good guy. Don't become part of the statistics women use to generalize shit like 'All men are pigs/They only want one thing'. Truth is majority of the men are guilty of that behaviour. \nYou're not living in the stone age and you don't have to bang every woman that looks your way. And those that give you attention easily are probably gonna give you trip to the clinics more than anything else.\nBe selective. Go only after who you truly like/attracted to. The difference is astounding. You'll be surprised how amazing it feels to not settle. Most women already figured that out. It's time we men do too. \n\nThat's all for now folks!",
            "title_similarity": "0.5190891",
            "sentiment_compound": 0.2826
        },
        {
            "id": "gzxorj8",
            "score": 1,
            "text": "Don’t be a dickhead, if your bro is being a dickhead stop him from being a dickhead. \n\nPretty easy code.",
            "title_similarity": "0.65818244",
            "sentiment_compound": -0.8555
        },
        {
            "id": "gzxouev",
            "score": 1,
            "text": "International bro code section 1\n- be a good bro when your bro is in times of need; allow your bro to express his emotions",
            "title_similarity": "0.47215885",
            "sentiment_compound": 0.5859
        },
        {
            "id": "gzxp1eb",
            "score": 1,
            "text": "Don’t ever sit on another mans motorcycle without clearing it with said bro.",
            "title_similarity": "0.43040928",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzxpb5r",
            "score": 1,
            "text": "You gotta ask permission before going after an ex of your bro.",
            "title_similarity": "0.6121839",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzxpfo7",
            "score": 1,
            "text": "If your bro's ex makes a move on you, just don't! She's not worth losing his friendship.",
            "title_similarity": "0.6102911",
            "sentiment_compound": 0.7067
        },
        {
            "id": "gzxpkbu",
            "score": 1,
            "text": "If your bro is in the army, don’t disrespect the army",
            "title_similarity": "0.56852686",
            "sentiment_compound": -0.4215
        },
        {
            "id": "gzxpl5z",
            "score": 1,
            "text": "If a bro’s girl cheats on him and his bro’s find out first it is the duty of the other bros to tell their bro no matter what",
            "title_similarity": "0.5013497",
            "sentiment_compound": -0.4356
        },
        {
            "id": "gzxpnil",
            "score": 1,
            "text": "Don't put other bros down in front of females? It's pretty mean",
            "title_similarity": "0.575281",
            "sentiment_compound": 0.4939
        },
        {
            "id": "gzxpq4o",
            "score": 1,
            "text": "Anyone who can't talk while he's taking a piss needs to take the stick out of his ass",
            "title_similarity": "0.5094774",
            "sentiment_compound": -0.7351
        },
        {
            "id": "gzxpsvq",
            "score": 1,
            "text": "Don’t fuck his girl",
            "title_similarity": "0.57166994",
            "sentiment_compound": -0.5423
        },
        {
            "id": "gzxpvzd",
            "score": 2,
            "text": "Whenever a bro Ric Flair “Wooo”s you must also “Wooo”.",
            "title_similarity": "0.41529024",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzxpvzr",
            "score": 1,
            "text": "No eye contact during a Devil’s three way?",
            "title_similarity": "0.45134303",
            "sentiment_compound": -0.296
        },
        {
            "id": "gzxq7uo",
            "score": 1,
            "text": "No dating friends ex",
            "title_similarity": "0.4505666",
            "sentiment_compound": -0.5795
        },
        {
            "id": "gzxq884",
            "score": 1,
            "text": "Don’t mess with your bro if he’s tripping on psychedelics. Ensure they have a good time.",
            "title_similarity": "0.62302184",
            "sentiment_compound": 0.4588
        },
        {
            "id": "gzxqct0",
            "score": 1,
            "text": "No sex with your bros ex. So many of my bro’s would do this, and it really messes up group dynamics",
            "title_similarity": "0.5833939",
            "sentiment_compound": -0.0258
        },
        {
            "id": "gzxqhuc",
            "score": 1,
            "text": "Don’t crack on too the girl ive been seeing for a couple weeks. \nDon’t throw your plans out the window for a wiff / 0.0001% chance of smelling poon tang. \nDon’t ignore your mates when on a night out because your “chasing tail” .\nDon’t date a psychotic female, that abuses your friends and alienates you, then tells me!! too apologise because she went off the rails and  you need peace! \nDon’t fuck with your mates career.\n\nAll these from the same bloke. Absolute flop. Fuck you Jonno",
            "title_similarity": "0.5531446",
            "sentiment_compound": -0.7332
        },
        {
            "id": "gzxqi7d",
            "score": 1,
            "text": "If you fall asleep first at the sleepover you better believe the rest of the bro’s schematic will be on those lips faster than you can gag It back up.",
            "title_similarity": "0.46209595",
            "sentiment_compound": 0.128
        },
        {
            "id": "gzxql0b",
            "score": 1,
            "text": "never forget your bro ...even if you hit big and he doesn't.",
            "title_similarity": "0.4098768",
            "sentiment_compound": 0.1695
        },
        {
            "id": "gzxqov9",
            "score": 1,
            "text": "zas wadssc",
            "title_similarity": "0.24855094",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzxqp3n",
            "score": 2,
            "text": "If you fuck a dudes girlfriend, you own him a pair of shoes.",
            "title_similarity": "0.39582172",
            "sentiment_compound": -0.5423
        },
        {
            "id": "gzxqu93",
            "score": 1,
            "text": "Do not take the urinal directly beside someone, unless there is no other option.",
            "title_similarity": "0.6459658",
            "sentiment_compound": -0.296
        },
        {
            "id": "gzxqxox",
            "score": 1,
            "text": "Turn Jealousy into complements, its amazing to receive true compliments. Being jealous is just so detrimental to yourself especially, you kinda feel happy when you give uplifting comments to them. You could apply this to anyone, not only the bros",
            "title_similarity": "0.3539722",
            "sentiment_compound": 0.8137
        },
        {
            "id": "gzxr3it",
            "score": 1,
            "text": "Don't yuck other's yums. Fetiishes, Food, Fun. Whatever it is, don't put down what lifts others up.",
            "title_similarity": "0.6031927",
            "sentiment_compound": 0.5106
        },
        {
            "id": "gzxr5qn",
            "score": 1,
            "text": "Don't date ur bestfriends girl not even a week after they breakup and he goes to the hospital",
            "title_similarity": "0.39194795",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzxr6mm",
            "score": 1,
            "text": "If you go over another bro’s house and their mom cooks for you. Thats now your mom too.",
            "title_similarity": "0.3305834",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzxrcuh",
            "score": 1,
            "text": "If you’re in a fight with another bro, never go for the nut shot. That shit hurts too much for that.",
            "title_similarity": "0.5717476",
            "sentiment_compound": -0.8519
        },
        {
            "id": "gzxrez3",
            "score": 1,
            "text": "The nod. A simple acknowledgement, a single gesture can be enough to convey tons of emotions, and this alone can let another bro, even just for 2 seconds in passing, how much you care about him by taking that time to recognize him.",
            "title_similarity": "0.41297042",
            "sentiment_compound": 0.2382
        },
        {
            "id": "gzxrwym",
            "score": 2,
            "text": "Don't piss in bro's mouth",
            "title_similarity": "0.67153454",
            "sentiment_compound": 0.3089
        },
        {
            "id": "gzxrzb8",
            "score": 1,
            "text": "Stand up when you shake a bros hand.",
            "title_similarity": "0.18604386",
            "sentiment_compound": 0.3612
        },
        {
            "id": "gzxs7k4",
            "score": 1,
            "text": "Normalize giving your bro a hug. Don’t make fun of your bro if he cries. Celebrate your Bros achievements in life. Compliment each other more and hold each other up. Support your Bros decision to get mental health care.",
            "title_similarity": "0.48903573",
            "sentiment_compound": 0.9571
        },
        {
            "id": "gzxsglt",
            "score": 1,
            "text": "Don’t try to date your bros girlfriend.",
            "title_similarity": "0.6465517",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzxskmp",
            "score": 1,
            "text": "Don't roast a hard drive in a microwave, just delete the fap folder.",
            "title_similarity": "0.587385",
            "sentiment_compound": 0.0762
        },
        {
            "id": "gzxsmy8",
            "score": 1,
            "text": "Don’t date your bro's ex then break up with her then marry her years later and make your bro the best man.",
            "title_similarity": "0.49934036",
            "sentiment_compound": 0.6369
        },
        {
            "id": "gzxsqq3",
            "score": 1,
            "text": "Never say \"another time\" when bro talks about how much he is depressed.",
            "title_similarity": "0.5035345",
            "sentiment_compound": -0.5106
        },
        {
            "id": "gzxss76",
            "score": 1,
            "text": "Don’t be a tool",
            "title_similarity": "0.420764",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzxt3zk",
            "score": 1,
            "text": "Never mock a guy for being ripped, just admire his dedication",
            "title_similarity": "0.43197417",
            "sentiment_compound": 0.6632
        },
        {
            "id": "gzxt49k",
            "score": 1,
            "text": "Open your ears to another brother. Friendship ain't all fun and games. Shit happens to people. Be there for them.",
            "title_similarity": "0.62924486",
            "sentiment_compound": -0.5271
        },
        {
            "id": "gzxt7f8",
            "score": 1,
            "text": "We made eye contact, it doesn’t mean that we need to fight. Let’s try bullshitting. Always loved a good bullshit talk with randoms. Never know what you’ll hear when the person knows you won’t see them again.",
            "title_similarity": "0.55962825",
            "sentiment_compound": 0.1027
        },
        {
            "id": "gzxt7n5",
            "score": 2,
            "text": "Don't fuck your friends wife, Andrew.",
            "title_similarity": "0.6354877",
            "sentiment_compound": 0.0762
        },
        {
            "id": "gzxteqz",
            "score": 2,
            "text": "Nothing wrong with talking and peeing. Some of the funniest things I’ve ever heard have been in that situation!",
            "title_similarity": "0.34090617",
            "sentiment_compound": 0.754
        },
        {
            "id": "gzxtip1",
            "score": 1,
            "text": "If he lies to his girl you go along with it. No matter how ridiculous it is hahaahha",
            "title_similarity": "0.4437245",
            "sentiment_compound": -0.6569
        },
        {
            "id": "gzxtm5t",
            "score": 1,
            "text": "I have witnessed the following which is why I no longer use urinals:\n\nWhen your homie is peeing at the urinal, come up behind him and offer him a snack. If he says yes, feed him the snack. Bonus points if you are also peeing at the urinal.",
            "title_similarity": "0.5551606",
            "sentiment_compound": 0.6124
        },
        {
            "id": "gzxtri4",
            "score": 3,
            "text": "Keep it real with your bro. If they do some shady shit, call them out on it. This really goes for all friends, but sometimes you need to reel your bros in more than others. True bros will learn from their mistakes.",
            "title_similarity": "0.5016589",
            "sentiment_compound": 0.152
        },
        {
            "id": "gzxu3nc",
            "score": 1,
            "text": "Never be funny in front of ur bro’s crush",
            "title_similarity": "0.52760655",
            "sentiment_compound": -0.4599
        },
        {
            "id": "gzxu4ge",
            "score": 2,
            "text": "You NEVER leave the boys for a girlfriend. No matter what",
            "title_similarity": "0.5094389",
            "sentiment_compound": 0.0191
        },
        {
            "id": "gzxu7or",
            "score": 2,
            "text": "You are your brother's keeper, like it or not.",
            "title_similarity": "0.46733397",
            "sentiment_compound": 0.3612
        },
        {
            "id": "gzxu8lw",
            "score": 2,
            "text": "Don't bang a friends ex",
            "title_similarity": "0.61287034",
            "sentiment_compound": -0.3724
        },
        {
            "id": "gzxup1p",
            "score": 3,
            "text": "Bros don't rape.",
            "title_similarity": "0.52920413",
            "sentiment_compound": 0.5773
        },
        {
            "id": "gzxupaq",
            "score": 2,
            "text": "This is beyond buried, but help a brother be telling him were to buy weed.",
            "title_similarity": "0.5073165",
            "sentiment_compound": 0.5499
        },
        {
            "id": "gzxuwsy",
            "score": 1,
            "text": "If your bro poops in the back of your pickup truck bro code says to take said poop and put it under his car seat.",
            "title_similarity": "0.32352233",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzxv2zb",
            "score": 1,
            "text": "Treat my tools and sockets with respect. Especially if we’re asking to borrow more than twice.",
            "title_similarity": "0.38343483",
            "sentiment_compound": 0.7003
        },
        {
            "id": "gzxv91j",
            "score": 1,
            "text": "Man reading these really makes me realize how shitty my so called friends were, literally none of them followed the bro code. Or not with me anyway",
            "title_similarity": "0.5205584",
            "sentiment_compound": -0.0571
        },
        {
            "id": "gzxv978",
            "score": 1,
            "text": "The Load Code of the road: Don't get any of your brogurt on your buddy.",
            "title_similarity": "0.69435716",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzxvdb1",
            "score": 2,
            "text": "Never ask for a bite of a bro’s food. Always wait for the bro to offer it up.",
            "title_similarity": "0.59067935",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzxvfrr",
            "score": 1,
            "text": "This is all just...be a good person.",
            "title_similarity": "0.2252067",
            "sentiment_compound": 0.4404
        },
        {
            "id": "gzxvmm1",
            "score": 4,
            "text": "a bro who sexually assaults and rapes is a bro no more.",
            "title_similarity": "0.39328182",
            "sentiment_compound": -0.8807
        },
        {
            "id": "gzxvr7d",
            "score": 2,
            "text": "A bro never has sex with another bro’s ex",
            "title_similarity": "0.50979143",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzxw0mv",
            "score": 1,
            "text": "Don’t use a urinal right next to another dude if there’s like 5 other urinals to choose from. It’s just weird.",
            "title_similarity": "0.47640562",
            "sentiment_compound": 0.2023
        },
        {
            "id": "gzxw41q",
            "score": 1,
            "text": "Bros don’t let other bros be sexist",
            "title_similarity": "0.63585925",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzxw6ec",
            "score": 1,
            "text": "Bros before translates in any language",
            "title_similarity": "0.47966662",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzxw88t",
            "score": 5,
            "text": "If a bro sexually assaults someone, you and your crew are bound by the bro code to take that dude out back and beat his ass.",
            "title_similarity": "0.42733544",
            "sentiment_compound": -0.7906
        },
        {
            "id": "gzxw904",
            "score": 1,
            "text": "Never ever bad mouth a bro just because you’re mad a girl likes him more than you.  Build him up, and if he screws or up, it’s on him.",
            "title_similarity": "0.44336158",
            "sentiment_compound": 0.1154
        },
        {
            "id": "gzxwbjd",
            "score": 1,
            "text": "The Universal Declaration of Human Rights",
            "title_similarity": "0.34094256",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzxwgkn",
            "score": 1,
            "text": "Share drugs freely",
            "title_similarity": "0.27068615",
            "sentiment_compound": 0.6249
        },
        {
            "id": "gzxwij9",
            "score": 1,
            "text": "Brokisses, brojob and brosex shall not adhere to any gender norms. It is merely broship.",
            "title_similarity": "0.6324816",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzxwtev",
            "score": 1,
            "text": "Never try to bang your boys girl!",
            "title_similarity": "0.5645486",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzxwyy3",
            "score": 1,
            "text": "Tell your bro when he’s being a dickhead. Don’t just appease him.",
            "title_similarity": "0.62120223",
            "sentiment_compound": -0.4588
        },
        {
            "id": "gzxwzdt",
            "score": 1,
            "text": "When offered a brewski by a Bro, a Bro will accept it. A Bro's favourite brand of beer is \"free\". A Bro's second favourite is \"cold\".",
            "title_similarity": "0.46921015",
            "sentiment_compound": 0.7096
        },
        {
            "id": "gzxx3g4",
            "score": 1,
            "text": "You ALWAYS go at least 2 urinals to the side, and if there are only 2, find a spot on the wall to stare at.",
            "title_similarity": "0.35943198",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzxx8sz",
            "score": 2,
            "text": "If you see someone shoplifting at the grocery store, no you didn't.\n\nNo, you didn't.",
            "title_similarity": "0.45370412",
            "sentiment_compound": -0.296
        },
        {
            "id": "gzxxh1q",
            "score": 1,
            "text": "😢",
            "title_similarity": "0.16523549",
            "sentiment_compound": -0.4767
        },
        {
            "id": "gzxxml0",
            "score": 2,
            "text": "The 2am friend...no matter what you have going on at the time, if your bro calls to be bailed out of jail, you drop everything and do it no questions asked",
            "title_similarity": "0.5902437",
            "sentiment_compound": -0.4939
        },
        {
            "id": "gzxy5mp",
            "score": 2,
            "text": "Keep it in your pants, it’s my sister",
            "title_similarity": "0.3792141",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzxy6q0",
            "score": 1,
            "text": "Be kind, be generous (when you can), stand up for others (guys, gals, non-binary pals)",
            "title_similarity": "0.27930716",
            "sentiment_compound": 0.7717
        },
        {
            "id": "gzxy9br",
            "score": 3,
            "text": "Be excellent to each other, and party on dudes!",
            "title_similarity": "0.25182152",
            "sentiment_compound": 0.7712
        },
        {
            "id": "gzxycg2",
            "score": 1,
            "text": "Never use the word ‘Brocode’.",
            "title_similarity": "0.5574789",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzxye27",
            "score": 1,
            "text": "Don’t bring up embarrassing things about your bro in front of others",
            "title_similarity": "0.6204449",
            "sentiment_compound": -0.3818
        },
        {
            "id": "gzxyffh",
            "score": 1,
            "text": "No chit chat while peeing? How else am I supposed to ask him to share the urinal",
            "title_similarity": "0.67177856",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzxyisw",
            "score": 1,
            "text": "1 month if he breaks up with her. Never if she breaks up with him.",
            "title_similarity": "0.4205116",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzxz63l",
            "score": 1,
            "text": "If a man goes down, delete his browser history and check his bedroom for anything his parents would find “interesting”",
            "title_similarity": "0.47407112",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzxz8yr",
            "score": 1,
            "text": "This is an obvious one, but stick by their side even when they’re not there.",
            "title_similarity": "0.4164879",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzxzgkc",
            "score": 1,
            "text": "There's no such thing as \"dibs\" on a girl but if a bro expresses interest in a girl don't swoop in and chat her up. I don't even think this is a bro thing, it's just common courtesy. If you both have a thing for the same girl then tell him, if he doesn't shoot his shot or pussyfoots around then it's all fair game.\n\nE: I tried to word this as respectful to women as I could and I can't help but feel like I've failed with those last 4 words. Apologies.",
            "title_similarity": "0.6503019",
            "sentiment_compound": 0.9015
        },
        {
            "id": "gzxzk3i",
            "score": 1,
            "text": "Bench on Monday",
            "title_similarity": "0.2569741",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzxzmnj",
            "score": 1,
            "text": "Leave Saturday for the Boys and when there are milkshakes in the yard, let your bros know",
            "title_similarity": "0.44911593",
            "sentiment_compound": -0.0516
        },
        {
            "id": "gzxzsrx",
            "score": 2,
            "text": "Reading some of the top comments made me realize that the bro code is real and I'm the one who has been surrounding himself with the wrong people.",
            "title_similarity": "0.5036626",
            "sentiment_compound": -0.3182
        },
        {
            "id": "gzxzzwo",
            "score": 1,
            "text": "Never smack a man/woman or beat them up or whatever in front of their children. A parent is everything to them and it can seriously affect their views on the people that are rasing and teaching him",
            "title_similarity": "0.5542799",
            "sentiment_compound": -0.1779
        },
        {
            "id": "gzy01ka",
            "score": 1,
            "text": "Don’t fuck your bros wife. Even if they break up.",
            "title_similarity": "0.63295245",
            "sentiment_compound": -0.5423
        },
        {
            "id": "gzy08i9",
            "score": 1,
            "text": "Swallow.",
            "title_similarity": "0.17393696",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzy093l",
            "score": 1,
            "text": "Don’t taze me bro 😎",
            "title_similarity": "0.65669346",
            "sentiment_compound": 0.4588
        },
        {
            "id": "gzy0s06",
            "score": 2,
            "text": "Be a bro, don’t procreate, bc you are a pox on the world.\n\nAnd you're not my fucking bro.",
            "title_similarity": "0.64809245",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzy0xe9",
            "score": 1,
            "text": "Don’t go after your bro‘s sister or anyone in their immediate family. It’s creepy yeah, why would you want to go for them anyway? Especially if they look similar or if their personality is similar! Might as well be tuning your bro if that’s the case!",
            "title_similarity": "0.71201295",
            "sentiment_compound": 0.6351
        },
        {
            "id": "gzy12ey",
            "score": 1,
            "text": "Telling your buddies a girl has a nice ass. It's so cringy when dudes do that",
            "title_similarity": "0.37087446",
            "sentiment_compound": -0.1779
        },
        {
            "id": "gzy1bmg",
            "score": 2,
            "text": "Try and make him look amazing in front of his crush.",
            "title_similarity": "0.25417972",
            "sentiment_compound": 0.4939
        },
        {
            "id": "gzy1gky",
            "score": 1,
            "text": "Don't touch another man's tools unless invited to do so.",
            "title_similarity": "0.6183051",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzy1kh2",
            "score": 1,
            "text": "When they get hyped about something even if it’s small but they really proud lift em up",
            "title_similarity": "0.21082288",
            "sentiment_compound": 0.6798
        },
        {
            "id": "gzy1oyn",
            "score": 1,
            "text": "You never use the urinal directly next to another dude using a urinal",
            "title_similarity": "0.47167233",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzy1s8u",
            "score": 1,
            "text": "How insecure are you with your sexuality? No chit chat while peeing? Come on man.",
            "title_similarity": "0.6508436",
            "sentiment_compound": -0.6553
        },
        {
            "id": "gzy1ust",
            "score": 2,
            "text": "No eye contact in a devil’s three way",
            "title_similarity": "0.42209744",
            "sentiment_compound": -0.296
        },
        {
            "id": "gzy21q8",
            "score": 1,
            "text": "If you can help it, leave an empty urinal in between you and another dude.",
            "title_similarity": "0.5666435",
            "sentiment_compound": 0.1779
        },
        {
            "id": "gzy2351",
            "score": 2,
            "text": "Don't take the urinal next to your bro unless no others are avalible.",
            "title_similarity": "0.7018225",
            "sentiment_compound": -0.296
        },
        {
            "id": "gzy23l9",
            "score": 2,
            "text": "Hold your bros accountable. We’re all gentleman, we need to act like it.",
            "title_similarity": "0.5302007",
            "sentiment_compound": 0.3612
        },
        {
            "id": "gzy2dj6",
            "score": 2,
            "text": "When their SO calls to ask where he is. He’s in toilet and will be out in a minute.",
            "title_similarity": "0.4038278",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzy2gf6",
            "score": 1,
            "text": "If a bro talking about something they have achieved or done and are really excited about it, don’t one up them...\n\nExample - \n\nBro 1 - Dude I went to Greece for holiday and...\nBro 2 - Dude, have you been to Germany? It’s so much better \n\nEveryone has different expectations and opinions and there is no need to bring people down cause you have „done better shit“ than them",
            "title_similarity": "0.5413271",
            "sentiment_compound": 0.8508
        },
        {
            "id": "gzy2imo",
            "score": 2,
            "text": "Don’t fuck your best friend’s fiancée.",
            "title_similarity": "0.5859623",
            "sentiment_compound": 0.1779
        },
        {
            "id": "gzy2kzg",
            "score": 2,
            "text": "My best friend died one time, another friend from a different circle who didn’t know him bought a crate of beer and invited me round to talk about my friend. Strongest bro move of all time.",
            "title_similarity": "0.35646287",
            "sentiment_compound": 0.9201
        },
        {
            "id": "gzy2oqe",
            "score": 1,
            "text": "Don’t fuck no bitch that fuckin with your dog ( or fucked) that’s law.",
            "title_similarity": "0.62254715",
            "sentiment_compound": -0.703
        },
        {
            "id": "gzy2vaj",
            "score": 1,
            "text": "Bros watch each other’s bags at the airport while the other one is in the restroom, bar, lost, etc. Bros must protect bags!",
            "title_similarity": "0.41471106",
            "sentiment_compound": 0.1511
        },
        {
            "id": "gzy2xc9",
            "score": 1,
            "text": "Never cockblock your bro",
            "title_similarity": "0.65738773",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzy2y2x",
            "score": 2,
            "text": "Don't sleep with the neighbours spouse",
            "title_similarity": "0.61147076",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzy3099",
            "score": 2,
            "text": "Don’t be the funny guy when your bro has his girl around.",
            "title_similarity": "0.55666137",
            "sentiment_compound": 0.4404
        },
        {
            "id": "gzy352o",
            "score": 1,
            "text": "Insults must have a specific time.",
            "title_similarity": "0.31932464",
            "sentiment_compound": -0.4215
        },
        {
            "id": "gzy36c8",
            "score": 1,
            "text": "When your bro genuinely needs to hear it, tell him he looks good: be sensitive to the times you can’t always default to “dude, you look like shit” as banter.",
            "title_similarity": "0.5113957",
            "sentiment_compound": 0.6597
        },
        {
            "id": "gzy386b",
            "score": 2,
            "text": "Tell the truth and don't lie. Ever. Don't lie to, don't lie about, and don't lie for. Just don't do it.",
            "title_similarity": "0.6440196",
            "sentiment_compound": 0.3182
        },
        {
            "id": "gzy3amk",
            "score": 2,
            "text": "Ask if they are doing ok and let them vent.",
            "title_similarity": "0.39687854",
            "sentiment_compound": 0.296
        },
        {
            "id": "gzy3g8p",
            "score": 2,
            "text": "Don’t sleep with your bros girl unless he asks",
            "title_similarity": "0.65391386",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzy3jcf",
            "score": 1,
            "text": "Not to hold each other's hand while peeing.",
            "title_similarity": "0.58674216",
            "sentiment_compound": 0.4939
        },
        {
            "id": "gzy3nn0",
            "score": 1,
            "text": "Shitting in the lobby bathroom when sharing a hotel room",
            "title_similarity": "0.21195449",
            "sentiment_compound": 0.0258
        },
        {
            "id": "gzy3r93",
            "score": 1,
            "text": "Eyes forward at the urinal.",
            "title_similarity": "0.2687112",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzy3rcs",
            "score": 1,
            "text": "Late to the party, but you should never make fun of a grown man crying. There's a reason he's crying and it's painful enough that he's willing to do it in front of people.",
            "title_similarity": "0.503209",
            "sentiment_compound": -0.9418
        },
        {
            "id": "gzy3x3r",
            "score": 1,
            "text": "Tell the truth or if you don't want to talk about it, don't lie. Having honest friends is so important.",
            "title_similarity": "0.53556764",
            "sentiment_compound": 0.5528
        },
        {
            "id": "gzy3xjh",
            "score": 1,
            "text": "If a dude's messing up a date, please step in and help. I'm tired of embarrassing myself",
            "title_similarity": "0.5002663",
            "sentiment_compound": -0.128
        },
        {
            "id": "gzy3y4i",
            "score": 1,
            "text": "Always have be a helping hand r/helpinghand",
            "title_similarity": "0.27000648",
            "sentiment_compound": 0.6597
        },
        {
            "id": "gzy4cb4",
            "score": 1,
            "text": "Dont tell your bro's crush that he likes them .without asking the BRO",
            "title_similarity": "0.5914654",
            "sentiment_compound": 0.296
        },
        {
            "id": "gzy4ccn",
            "score": 1,
            "text": "Even if someone is ‘doing it wrong,’ unless they are in clear and present danger of consequences they can’t recover from, just let them do it wrong. It’s not up to you to interrupt in order to correct how other people do things. It’s fine to chat with them about it afterwards, but don’t barge in and demand that they ‘do it right’ (aka your way) in the moment.",
            "title_similarity": "0.61977994",
            "sentiment_compound": -0.5423
        },
        {
            "id": "gzy4gbj",
            "score": 1,
            "text": " Pg. .zz",
            "title_similarity": "0.17490995",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzy4gbl",
            "score": 1,
            "text": " Pg. .zz",
            "title_similarity": "0.17490995",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzy4izi",
            "score": 1,
            "text": "Dont sleep with my girl simple enough:)",
            "title_similarity": "0.57606506",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzy4nc6",
            "score": 2,
            "text": "Fast pay makes fast friends.....no debts owed to bros.",
            "title_similarity": "0.42283022",
            "sentiment_compound": -0.1027
        },
        {
            "id": "gzy4qvf",
            "score": 2,
            "text": "Dont fuck your bro's partner gay or straight.",
            "title_similarity": "0.66087997",
            "sentiment_compound": 0.5789
        },
        {
            "id": "gzy4rb1",
            "score": 1,
            "text": "Support each others mental health",
            "title_similarity": "0.19824466",
            "sentiment_compound": 0.4019
        },
        {
            "id": "gzy51nw",
            "score": 1,
            "text": "Never leave a bro behind unless the safe word has been used. \n\nMany a friend has been left at bars with unfriendlies because they were not capable of clearly conveying they wanted out and away. Have a safe word with your bros that is drilled into your heads as a “get me the fuck outta here so I don’t have to deal with this even though I’m too drunk to explain it all right now and yeah I know she got a big butt and a nice smile but I really do not want to deal with all of this madness please help” sorta way. \n\nSpeaking from experience. I’ve never left a man behind, but I was left being a few times because I couldn’t convey. Safe words are a good thing.",
            "title_similarity": "0.5354898",
            "sentiment_compound": 0.8182
        },
        {
            "id": "gzy52em",
            "score": 1,
            "text": "Note sure if it's quite relevant, but always keep a spare urinal between you and the next guy",
            "title_similarity": "0.5314816",
            "sentiment_compound": 0.1655
        },
        {
            "id": "gzy58qk",
            "score": 1,
            "text": "No going after your bro's girl/ crush.",
            "title_similarity": "0.5757191",
            "sentiment_compound": -0.4215
        },
        {
            "id": "gzy5ca3",
            "score": 1,
            "text": "Always watch out if your bro's zippers are down",
            "title_similarity": "0.47220635",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzy5exs",
            "score": 1,
            "text": "this thread is making me ebrotional ಥ‿ಥ",
            "title_similarity": "0.30474055",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzy5eyj",
            "score": 1,
            "text": "Always cross swords.",
            "title_similarity": "0.2354418",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzy5jjy",
            "score": 1,
            "text": "Two balls per seat, tops.",
            "title_similarity": "0.0773914",
            "sentiment_compound": 0.5106
        },
        {
            "id": "gzy5sqg",
            "score": 1,
            "text": "dont piss in the urinal next to ur bro",
            "title_similarity": "0.561908",
            "sentiment_compound": 0.3089
        },
        {
            "id": "gzy5t0j",
            "score": 2,
            "text": "Do not date your bro's ex without clear and preferably written consent which is allowed to be rescinded by a bro at any time before 6 months.",
            "title_similarity": "0.5450176",
            "sentiment_compound": -0.0731
        },
        {
            "id": "gzy5uu0",
            "score": 2,
            "text": "Don’t act like an asshole and then pretend you were joking",
            "title_similarity": "0.55310464",
            "sentiment_compound": 0.4588
        },
        {
            "id": "gzy5yma",
            "score": 3,
            "text": "Don’t date a friend’s ex",
            "title_similarity": "0.5673841",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzy62rp",
            "score": 1,
            "text": "If your bro buys the first round, you get the second.",
            "title_similarity": "0.43775693",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzy6a1u",
            "score": 2,
            "text": "Stop your bros from raping people.",
            "title_similarity": "0.61843836",
            "sentiment_compound": -0.7906
        },
        {
            "id": "gzy6jp9",
            "score": 1,
            "text": "Don’t take the middle stall in the washroom",
            "title_similarity": "0.52874684",
            "sentiment_compound": -0.2023
        },
        {
            "id": "gzy6ldx",
            "score": 1,
            "text": "Delete the history",
            "title_similarity": "0.38904554",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzy6ptl",
            "score": 1,
            "text": "BROS OVER HOES",
            "title_similarity": "0.28675672",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzy6rtf",
            "score": 2,
            "text": "When your bro is down, take him out to eat. Chances are they aren’t doing well.  bros don’t let Bros go hungry.",
            "title_similarity": "0.6259593",
            "sentiment_compound": 0.4404
        },
        {
            "id": "gzy6tza",
            "score": 2,
            "text": "I personally love pee chats 😂\nBut just wanted to say wow, all these comments make me miss having bros",
            "title_similarity": "0.46245438",
            "sentiment_compound": 0.8338
        },
        {
            "id": "gzy6z4z",
            "score": 2,
            "text": "Don’t stick your dick in crazy. Way too many people only take into account looks for sexual partners without ever giving the thought to who these people actually are",
            "title_similarity": "0.53031766",
            "sentiment_compound": -0.7741
        },
        {
            "id": "gzy7421",
            "score": 2,
            "text": "Gonna get ignored but never boast about what you did for your BRO it is simply the shitties thing you could do",
            "title_similarity": "0.6553101",
            "sentiment_compound": -0.1655
        },
        {
            "id": "gzy7cn4",
            "score": 2,
            "text": "Step up. Step in.",
            "title_similarity": "0.1299452",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzy7r94",
            "score": 1,
            "text": "Never hit on your bro’s girl. That’s such a dick move, even if it’s in a joke-y manner. You’re only going to ruin your friendship & trust.",
            "title_similarity": "0.64870316",
            "sentiment_compound": -0.2263
        },
        {
            "id": "gzy7u1b",
            "score": 1,
            "text": "No groin kicking, in any type of fight no matter what cause. That’s always a cheap shot.",
            "title_similarity": "0.54945326",
            "sentiment_compound": -0.5959
        },
        {
            "id": "gzy7vqs",
            "score": 2,
            "text": "Don't be a fucking dick, you cunt.",
            "title_similarity": "0.50347686",
            "sentiment_compound": -0.7939
        },
        {
            "id": "gzy7wwb",
            "score": 1,
            "text": "While motorcycling: ALWAYS nod your head in acknowledgement as you pass. And tap your helment if cops are upcoming.",
            "title_similarity": "0.36431077",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzy7znv",
            "score": 1,
            "text": "1. Never talk shit to someone if front of their girl\n2. If your bro tells you a secret. Keep it.\n3. If your bro gets into a fight you have to back him up even if he’s in the wrong \n4. If your bro gets too drunk you make sure he at least gets his ass into an Uber\n5. If your bro is passionate about something hype him up. Don’t shit on his passion or dreams\n6. Never say something negative about your bro behind his back that you wouldn’t say to his face\n7. If you’re with your bros girl or family when he’s not there and they get into trouble they are now your responsibility \n8. If your bro goes through some tragic event while he’s with you or he tells you about it you stay with him and do whatever you can to help him get through it\n9. If someone asks you if your bro did something bad and you didn’t see it with your own eyes or hear it with your own ears don’t speak it with your own mouth. If you did hear it or see it still say you don’t know and they should ask him directly \n10. If your bro is trying to get with a girl always do whatever you can to hype him up to the girl and distract/entertain her friends even if you’re not into them.\n11. If your bro gets arrested for something minor you have to bail him out right away if you can afford it.",
            "title_similarity": "0.5562018",
            "sentiment_compound": -0.6573
        },
        {
            "id": "gzy8lfv",
            "score": 1,
            "text": "Assist on the pull when it clearly needs assistance",
            "title_similarity": "0.23758498",
            "sentiment_compound": 0.4019
        },
        {
            "id": "gzy8njh",
            "score": 1,
            "text": "Always keep a one urinal space in the bathroom",
            "title_similarity": "0.37349576",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzy8od4",
            "score": 2,
            "text": "Sex with a bro ain't gay if you say no homo",
            "title_similarity": "0.6376033",
            "sentiment_compound": -0.296
        },
        {
            "id": "gzy8oym",
            "score": 1,
            "text": "Always buy your round of drinks.",
            "title_similarity": "0.25009406",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzy8tv8",
            "score": 2,
            "text": "maintain eye contact when you are both jerking off together.",
            "title_similarity": "0.24306765",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzy92t2",
            "score": 1,
            "text": "When you see your bro, or any bro, start to make his play with a girl; even a girl you have in your sights, back off and let him shoot his shot fair and square. If it goes well for him, then the mood is right for you when you spot the next one. If he gets turned down, be cool and let your fellow player exit the scene with class before you get busy. Stay classy my bros.",
            "title_similarity": "0.4837534",
            "sentiment_compound": 0.8225
        },
        {
            "id": "gzy93iu",
            "score": 3,
            "text": "Never use a urinal right next to another bro",
            "title_similarity": "0.52113426",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzy96i0",
            "score": 2,
            "text": "Bros who have kids should be proud, caring dads and not afraid to show that they love them and actively share in their upbringing.",
            "title_similarity": "0.35347006",
            "sentiment_compound": 0.9325
        },
        {
            "id": "gzy9nd6",
            "score": 2,
            "text": "Don’t sleep with someone’s partner if you know they’re in a committed relationship.",
            "title_similarity": "0.6025422",
            "sentiment_compound": 0.2732
        },
        {
            "id": "gzy9o9u",
            "score": 2,
            "text": "Don’t ever cock block",
            "title_similarity": "0.57311416",
            "sentiment_compound": -0.5423
        },
        {
            "id": "gzya3il",
            "score": 1,
            "text": "Never get with your bro’s SO or Ex",
            "title_similarity": "0.6119872",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzya9u4",
            "score": 2,
            "text": "Respect a wedding band.  Don't go fucking up a marriage to get your rocks off.",
            "title_similarity": "0.60204303",
            "sentiment_compound": 0.4767
        },
        {
            "id": "gzyad70",
            "score": 3,
            "text": "Only talk shit to your bros face so they know it's banter. Never behind his back or to his friends.",
            "title_similarity": "0.5539938",
            "sentiment_compound": -0.128
        },
        {
            "id": "gzyafx8",
            "score": 1,
            "text": "Say the word 'Papaya' when they're being whipped.",
            "title_similarity": "0.3882087",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzyag8x",
            "score": 2,
            "text": "Don't become the funniest guy around his crush, instead bring up fun facts, interesting stories about your bro.",
            "title_similarity": "0.47610015",
            "sentiment_compound": 0.3561
        },
        {
            "id": "gzyal02",
            "score": 1,
            "text": "Call a bro our on the good and the bad. Treating a partner bad? Tell em. But also remember to just out the blue tell them when they are doing good. We all need accountability and to sometimes be blocked down a peg",
            "title_similarity": "0.5129084",
            "sentiment_compound": -0.09
        },
        {
            "id": "gzyaw2g",
            "score": 1,
            "text": "Never snitch on a brother. Either everyone takes shit for it, or no one will",
            "title_similarity": "0.6283161",
            "sentiment_compound": -0.7003
        },
        {
            "id": "gzyb33y",
            "score": 1,
            "text": "You don't get at their exes, crushes, or wives. If you want to, talk to them about it first. \n\nIf not you're no man, you're a thirsty sleeze. Not much of a man if you have no honor or integrity. Also a shitty friend if you don't respect bro-code.\n\nI'll extend this further and say that you shouldn't knowingly mess with another man's woman at all.",
            "title_similarity": "0.6658712",
            "sentiment_compound": -0.6876
        },
        {
            "id": "gzyb3lo",
            "score": 3,
            "text": "Debate philosophy while pissing, you goddamn coward.",
            "title_similarity": "0.509459",
            "sentiment_compound": -0.8316
        },
        {
            "id": "gzyb7t4",
            "score": 1,
            "text": "Never take the wheels out of another man's Heelys™.",
            "title_similarity": "0.4947666",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzybdgl",
            "score": 2,
            "text": "Don’t kill a dude you don’t know just because your political leader tells you to.",
            "title_similarity": "0.64120686",
            "sentiment_compound": -0.6908
        },
        {
            "id": "gzybdiz",
            "score": 1,
            "text": "Don’t break the high score on any games/consoles owned by your bro",
            "title_similarity": "0.5894687",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzybo35",
            "score": 1,
            "text": "Show up no matter what",
            "title_similarity": "0.2622801",
            "sentiment_compound": -0.0191
        },
        {
            "id": "gzybpzf",
            "score": 2,
            "text": "Bro’s before ho’s, snitches get stitches … obviously 🙄",
            "title_similarity": "0.34418312",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzybqsg",
            "score": 1,
            "text": "Rule 69: Duh",
            "title_similarity": "0.26904455",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzybt0u",
            "score": 1,
            "text": "The Official Bro Code, in it's entirety.",
            "title_similarity": "0.3761714",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzybvc2",
            "score": 4,
            "text": "Any man willing to go toe to toe with you deserves your respect, win or lose.  At least he had the balls to stand up for himself.",
            "title_similarity": "0.44264466",
            "sentiment_compound": 0.6369
        },
        {
            "id": "gzybwwj",
            "score": 1,
            "text": "Openly talk to mates about consent",
            "title_similarity": "0.45533523",
            "sentiment_compound": 0.2263
        },
        {
            "id": "gzyc04l",
            "score": 1,
            "text": "Bros before hoes",
            "title_similarity": "0.37687492",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzyc67b",
            "score": 1,
            "text": "Give your friends a reasonable amount of notice if you want them to attend your wedding.\n\nI know you might’ve been planning it for a year and had to put it off due to the pandemic but messaging on thursday night about attending on saturday morning is not sufficient notice.",
            "title_similarity": "0.44552904",
            "sentiment_compound": 0.296
        },
        {
            "id": "gzyc7jr",
            "score": 2,
            "text": "Never pick a urinal next to someone unless it's your only choice",
            "title_similarity": "0.6764127",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzycf79",
            "score": 1,
            "text": "If your bro is taking a shit at a party/club/holiday apartment, you become security on the door.",
            "title_similarity": "0.4071952",
            "sentiment_compound": -0.296
        },
        {
            "id": "gzyckoc",
            "score": 2,
            "text": "Last slice of pizza or last beer. Never both",
            "title_similarity": "0.44580674",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzycnhu",
            "score": 1,
            "text": "Leaving the women out where they should be included is not bro, but coward.  Man up and let 'em in where they should be in.  And don't be an ass about it.",
            "title_similarity": "0.6627458",
            "sentiment_compound": 0.7903
        },
        {
            "id": "gzycz2y",
            "score": 2,
            "text": "this applies to all genders: don't let your friends harass others. be a bro to other people too.",
            "title_similarity": "0.64323574",
            "sentiment_compound": -0.696
        },
        {
            "id": "gzyd58e",
            "score": 2,
            "text": "Always let a bro cry if he needs to. Never tell him to “harden up”",
            "title_similarity": "0.55680805",
            "sentiment_compound": -0.4767
        },
        {
            "id": "gzyd659",
            "score": 2,
            "text": "Don’t rape. Hold rapists and abusers of all types accountable.",
            "title_similarity": "0.44669992",
            "sentiment_compound": -0.9274
        },
        {
            "id": "gzydh5d",
            "score": 2,
            "text": "Thou shalt fill the gas tank of the bros car, if thou used it!!!",
            "title_similarity": "0.4499661",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzydi3w",
            "score": 3,
            "text": "If your bro calls you out listen and think before you react.",
            "title_similarity": "0.57360065",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzydskj",
            "score": 1,
            "text": "I need to make a bro first",
            "title_similarity": "0.47825518",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzyevmz",
            "score": 2,
            "text": "Always inform the other bro of a girl fight.",
            "title_similarity": "0.28644827",
            "sentiment_compound": -0.3818
        },
        {
            "id": "gzyfwrv",
            "score": 1,
            "text": "Being a good wingman.",
            "title_similarity": "0.10465867",
            "sentiment_compound": 0.4404
        },
        {
            "id": "gzygxc6",
            "score": 1,
            "text": "the bro code",
            "title_similarity": "0.43226343",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzygyzd",
            "score": 2,
            "text": "If you see any man unzipped, lowly say, hey, your post office is open.",
            "title_similarity": "0.42463958",
            "sentiment_compound": -0.25
        },
        {
            "id": "gzyh06s",
            "score": 5,
            "text": "never diss on the bros, for some hoes",
            "title_similarity": "0.5505973",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzyhfz0",
            "score": 9,
            "text": "Never knowingly fuck another man’s wife or girlfriend. That’s just a dick move.",
            "title_similarity": "0.54510593",
            "sentiment_compound": -0.1154
        },
        {
            "id": "gzyircs",
            "score": 1,
            "text": "To add to OP do not use the urinal right next to someone else and if you must- eyes straight ahead",
            "title_similarity": "0.68283415",
            "sentiment_compound": 0.2263
        },
        {
            "id": "gzyj66v",
            "score": 1,
            "text": "Bro code should be that chit chat while peeing is completely OK. Who doesn't love a drunken instant friendship at the urinals?",
            "title_similarity": "0.5860647",
            "sentiment_compound": -0.12
        },
        {
            "id": "gzyjgv9",
            "score": 2,
            "text": "Never push a bro down to get higher up yourself.\n\nWhen courting females, when climbing the corporate ladder or to get cheap laughs around the campfire.\n\nIf you can't reach it without standing on someone's feet, you're not supposed to reach it.",
            "title_similarity": "0.54013467",
            "sentiment_compound": 0.4682
        },
        {
            "id": "gzyjm3u",
            "score": 2,
            "text": "Never call each other a faggot.",
            "title_similarity": "0.5273448",
            "sentiment_compound": -0.6597
        },
        {
            "id": "gzykjte",
            "score": 7,
            "text": "If a good looking girl asks about the bro, Elevate all the good things but don't lie",
            "title_similarity": "0.4347043",
            "sentiment_compound": 0.4404
        },
        {
            "id": "gzylcqt",
            "score": 6,
            "text": "Don't date a bro's ex",
            "title_similarity": "0.60518",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzylic4",
            "score": 6,
            "text": "If your bro blacks out in the gym while bench pressing, put on some extra weights before the medics arrive",
            "title_similarity": "0.37023562",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzymb1g",
            "score": 3,
            "text": "Don't mingle with bros so",
            "title_similarity": "0.58122",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzymko2",
            "score": 3,
            "text": "Compliment each other more often.\nIt's amazing.",
            "title_similarity": "0.067939535",
            "sentiment_compound": 0.8
        },
        {
            "id": "gzymsqm",
            "score": 1,
            "text": "girl here but what's with all the \"no dating your friend's sister code\" \ncould someone care to explain please!\nI got a huge crush on my brother's friend but I remembered something about this \"code\"",
            "title_similarity": "0.5224323",
            "sentiment_compound": 0.9312
        },
        {
            "id": "gzynhhw",
            "score": 3,
            "text": "No ring-poaching, homie. Doesn't matter if she's with a bro, or if it's a bro-ette getting her bi spouse yoinked from them, or if it's two gay bros, or whatever, it still ain't cool. Don't try to split up a happy couple, married or not, just because you wanna get some.\n\nAnd that goes the other way too, broette code dictates you don't try to split a happy couple up to get at either of them as a woman, either. \n\nI've known too many people who liked chasing those who were already in relationships, because they found it to be an ego-boost that they could make someone cheat, or they found it thrilling to know they were \"teasing\" someone who couldn't reciprocate. It's just... Morally reprehensible.",
            "title_similarity": "0.67956924",
            "sentiment_compound": 0.7759
        },
        {
            "id": "gzynoxb",
            "score": 2,
            "text": "Dunno if it's different round here but urinal conversations are quite common.",
            "title_similarity": "0.33805063",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzyq0dp",
            "score": 1,
            "text": "Such wholesome comments, pinned this post. Thanks bros.",
            "title_similarity": "0.3566928",
            "sentiment_compound": 0.4404
        },
        {
            "id": "gzyqiyb",
            "score": 3,
            "text": "Don't embarrass him, in front of this crush...",
            "title_similarity": "0.53179765",
            "sentiment_compound": 0.0356
        },
        {
            "id": "gzyqju4",
            "score": 2,
            "text": "If I'm your neighbor and you borrow a tool is okay for a couple of times but if you ask constantly to borrow it instead of buying the fucking tools.",
            "title_similarity": "0.48090607",
            "sentiment_compound": 0.1154
        },
        {
            "id": "gzyr4gz",
            "score": 2,
            "text": "Hold your bro to his own higher values. Remind him of who he wants to be. Call him on his bullshit. And when he needs to share the darkness in his soul, listen to him without judgement.",
            "title_similarity": "0.56407607",
            "sentiment_compound": -0.2263
        },
        {
            "id": "gzyrhxr",
            "score": 2,
            "text": "The word “Cunt” is usually a compliment in Australia.",
            "title_similarity": "0.31300488",
            "sentiment_compound": 0.4767
        },
        {
            "id": "gzywrdj",
            "score": 2,
            "text": "Urinal spacing. Let's say there are 8 urinals, all un occupied. I walk in and use urinal 1. Do NOT come in and use urinal 2. I thought every bro knew this unwritten rule, but that is not the case.",
            "title_similarity": "0.5341581",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzyxjvz",
            "score": 1,
            "text": "Dont fuck it up, Don’t be a dick, do it better",
            "title_similarity": "0.5954021",
            "sentiment_compound": 0.3506
        },
        {
            "id": "gzz0u6j",
            "score": 2,
            "text": "When dividers aren't in place, leave a urinal between you and the next guy over.",
            "title_similarity": "0.57302284",
            "sentiment_compound": 0.0382
        },
        {
            "id": "gzz2ot3",
            "score": 3,
            "text": "Respect the man hug, it is the highest honour two bros can share together.",
            "title_similarity": "0.2815193",
            "sentiment_compound": 0.9022
        },
        {
            "id": "gzz319s",
            "score": 2,
            "text": "Don't date an ex of a friend you care about unless they tell you it's ok.\n\nI've always felt weird about this rule because people should be allowed to do whatever they want, you don't own someone after a breakup. But my ex started dating a close friend after we split and it just naturally divided our friendship; it's not a possession thing, it's just what can happen. Huge risk, because who wants to hang out with their friend and their ex at the same time?",
            "title_similarity": "0.5917729",
            "sentiment_compound": 0.9497
        },
        {
            "id": "gzz3rk0",
            "score": 2,
            "text": "Don't date his ex or try to date someone you know your bro is in love with, instead encourage your bro.",
            "title_similarity": "0.6586717",
            "sentiment_compound": 0.8176
        },
        {
            "id": "gzz4dgc",
            "score": 1,
            "text": "No means yes yes means anal/s",
            "title_similarity": "0.49984193",
            "sentiment_compound": -0.1921
        },
        {
            "id": "gzz4kmp",
            "score": 3,
            "text": "When a bro does something you find offensive (e.g. sexist, racist, whatever) let your bro know. Bros should also demand better of their bros.",
            "title_similarity": "0.579563",
            "sentiment_compound": -0.6808
        },
        {
            "id": "gzz4on0",
            "score": 1,
            "text": "If someone cries for help, you help them even if they're a cunt.",
            "title_similarity": "0.38862848",
            "sentiment_compound": -0.128
        },
        {
            "id": "gzzcf6y",
            "score": 2,
            "text": "Don’t have Sex with the Homies girl/Sister!",
            "title_similarity": "0.5935458",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzzfpo9",
            "score": 2,
            "text": "If you borrow a bro’s car, bring it back with a full tank of gas",
            "title_similarity": "0.28657344",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzzfu7d",
            "score": 1,
            "text": "Tall shalt not covet thy brosephs wife.  Unless it's a shred experience.",
            "title_similarity": "0.56787556",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzzimgo",
            "score": 1,
            "text": "r/Wallstreetsilver",
            "title_similarity": "0.22910288",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzznswb",
            "score": 2,
            "text": "You are asexual or gay with a Bro’s woman.",
            "title_similarity": "0.31058973",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzzxguv",
            "score": 1,
            "text": "When I tell you something in confidence, plase dont tell your wife or GF. \n\nAlso, when I want to hang out. I just hang out with you not you and your girl.",
            "title_similarity": "0.65622187",
            "sentiment_compound": 0.5574
        },
        {
            "id": "h00b3vj",
            "score": 1,
            "text": "Chinese ppl will straight up stare at your dick while you piss... not a bro code but felt it was relevant",
            "title_similarity": "0.55249834",
            "sentiment_compound": -0.3716
        },
        {
            "id": "h00d0t6",
            "score": 1,
            "text": "If a bro tells you a secret. CARRY THAT SHIT TO THE FUCKIN GRAVE.",
            "title_similarity": "0.5225755",
            "sentiment_compound": -0.8655
        },
        {
            "id": "h00m9ax",
            "score": 1,
            "text": "Never steal from the homie.",
            "title_similarity": "0.52053237",
            "sentiment_compound": 0.3875
        },
        {
            "id": "h04x82t",
            "score": 1,
            "text": "Don’t steal.",
            "title_similarity": "0.44607422",
            "sentiment_compound": -0.4939
        },
        {
            "id": "h1n940n",
            "score": 1,
            "text": "If by chance you see your bro out on a date don't go and interrupt to say hi.",
            "title_similarity": "0.6225877",
            "sentiment_compound": 0.4653
        },
        {
            "id": "h2i5yew",
            "score": 1,
            "text": "No matter how ugly he looks, always say \"damn bro you look nice in those clothes\" when they dress up. It matters more than you can imagine.",
            "title_similarity": "0.4134255",
            "sentiment_compound": -0.4895
        },
        {
            "id": "h2krhz4",
            "score": 1,
            "text": "Thou shall help thine bro when they migrate to a new domicile\n\nIf thou art a bro who has received such aid, you shall provide sustainence to those bros who have aided you. Beer and pizza are recommended, but dietary restrictions should be observed.\n\nThus sayeth the Bro Code!",
            "title_similarity": "0.59136546",
            "sentiment_compound": 0.3699
        },
        {
            "id": "h2pw5fh",
            "score": 1,
            "text": "No matter what if a bros girl calls asking about him and what yall are doing no matter what he is with you and is too busy to talk cause he is taking a shit or doing something stupid like jumping a 4 wheeler over a shed. And as soon as you hang up you have to text/call your bro and let them know exactly what happened.",
            "title_similarity": "0.45746237",
            "sentiment_compound": -0.6856
        },
        {
            "id": "h382kak",
            "score": 1,
            "text": "Don't let a bro get away with sexual harrassment. Hold him up to the same standards you hold yourself.",
            "title_similarity": "0.65720963",
            "sentiment_compound": 0.0
        },
        {
            "id": "hhr7ef4",
            "score": 1,
            "text": "Don’t fuck your friend’s daughters…",
            "title_similarity": "0.59518737",
            "sentiment_compound": -0.5423
        }
    ]
}