{
    "An old friend of mine casually told me that he gets rid of underarm hair by yanking them out. What upsetting things have your friends told you casually?\n": [
        {
            "id": "h5zy6op",
            "score": -4,
            "text": "That he has to sit down to pee",
            "title_similarity": "0.38586897",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5zisrp",
            "score": -10,
            "text": "Why is that upsetting to you? Lol",
            "title_similarity": "0.395632",
            "sentiment_compound": -0.0772
        },
        {
            "id": "h61daxv",
            "score": 0,
            "text": "My friend likes pineapple on pizza. We haven't spoke in a while",
            "title_similarity": "0.32306525",
            "sentiment_compound": 0.7184
        },
        {
            "id": "h601djt",
            "score": -2,
            "text": "Why's that upsetting? Nothing wrong with yanking armpit hair out i do it hell i pull out pubes too but thats out of boredom and usually happens while scratching my nuts.",
            "title_similarity": "0.65871406",
            "sentiment_compound": -0.8391
        },
        {
            "id": "h606zyq",
            "score": -3,
            "text": "I'm normally the friend that says upsetting things casually. It's fun for me to see someone's uncomfortable reaction. Most of my friends are immune to it now though because they almost expect it.\n\nI remember when I was in high school, I was sitting around the dinner table with my parents and sister and very casually asked my mom if I could use nair on my balls.",
            "title_similarity": "0.5422792",
            "sentiment_compound": 0.8425
        },
        {
            "id": "h60axf9",
            "score": -5,
            "text": "I had a friend in high school who out mayo on her fries like that shit was nornal.",
            "title_similarity": "0.44465792",
            "sentiment_compound": 0.2732
        },
        {
            "id": "h5zzths",
            "score": 5,
            "text": "A friend of mine once told me he tasted his own sperm, and it wasn't an accident.",
            "title_similarity": "0.48758823",
            "sentiment_compound": 0.696
        },
        {
            "id": "h60oldw",
            "score": 6,
            "text": "I know a fairly smart individual with a good head on his shoulders who is really buying into the anti-vax conspiracies.",
            "title_similarity": "0.5218513",
            "sentiment_compound": 0.6808
        },
        {
            "id": "h5zw1ju",
            "score": 2,
            "text": "my buddy uses Q tips for their “original” intention and not to clean his ears. lets just be clear if you have a Q tip in your hand and you DONT use it to clean your ears im calling the police",
            "title_similarity": "0.6663599",
            "sentiment_compound": 0.7385
        },
        {
            "id": "h606hwm",
            "score": 3,
            "text": "a friend told he has his wife yank his grey hair from his head...\n\nbro you're white with blond hair. knock it off.\n\neven if you were black with black hair.... just stop.",
            "title_similarity": "0.7030505",
            "sentiment_compound": 0.296
        },
        {
            "id": "h6167mq",
            "score": -1,
            "text": "That they wipe their ass standing up.",
            "title_similarity": "0.42791212",
            "sentiment_compound": -0.5423
        },
        {
            "id": "h5zrvec",
            "score": 28,
            "text": "Why would he want to get rid of underarm hair is the real question. Is this some fashion thing I haven't herd of?",
            "title_similarity": "0.66500723",
            "sentiment_compound": 0.0772
        },
        {
            "id": "h60u34k",
            "score": -6,
            "text": "My friend puts mustard on his sandwiches",
            "title_similarity": "0.3364238",
            "sentiment_compound": 0.4939
        },
        {
            "id": "h60okrr",
            "score": 3,
            "text": "[deleted]",
            "title_similarity": "0.336526"
        },
        {
            "id": "h61ryxn",
            "score": 3,
            "text": "She (42F) told me she thinks it’s cool that all our ancestry reports trace back to Noah’s Arc.",
            "title_similarity": "0.33247834",
            "sentiment_compound": 0.3182
        },
        {
            "id": "h61scb0",
            "score": 2,
            "text": "I saw a guy shower once and he didn't go \"in order\" - he washed his butt and then his chest/body/head. I find this so gross!",
            "title_similarity": "0.6284065",
            "sentiment_compound": -0.6466
        },
        {
            "id": "h62k04k",
            "score": 2,
            "text": "Friend ate his own corn out of his shit because he thought recycling stuff",
            "title_similarity": "0.6134484",
            "sentiment_compound": -0.1027
        },
        {
            "id": "h60wo2m",
            "score": 1,
            "text": "A friend of mine drains the water off his ramen noodles and then stirs in the flavor packet. He didn't understand that the water stayed in and the packet was for making broth.",
            "title_similarity": "0.5872866",
            "sentiment_compound": 0.4939
        },
        {
            "id": "h5zormy",
            "score": -6,
            "text": "I have no friends.",
            "title_similarity": "0.2566184",
            "sentiment_compound": -0.3724
        },
        {
            "id": "h600v10",
            "score": 4,
            "text": "One of my friends in my college ordered 3-4 dishes in our canteen and even ate some of the things that other people ordered, we thought he was hungry fair enough.He didn't attended college for he next two days and when he came back kept telling that he had diarrhea and ate too much and his body didn't handle it well to nearly each and every person he meet describing like something he was proud of ,everyone thought he was a weirdo and kept minimal contact with him. I do feel bad about him and I know judging someone's appetite is wrong but boasting about such things as a teenager makes you look bad in front of others.",
            "title_similarity": "0.5315888",
            "sentiment_compound": -0.7056
        },
        {
            "id": "h60hlm8",
            "score": 0,
            "text": "Found out a roommate would take his morning dump and rather then wiping would jump in the shower.",
            "title_similarity": "0.6464517",
            "sentiment_compound": -0.3818
        },
        {
            "id": "h60l9bn",
            "score": 0,
            "text": "I've been told from the women in my group of friends about the guys in my group of friends because people used to date.\n\nAnd yes, that means I know how they are in bed.",
            "title_similarity": "0.4733193",
            "sentiment_compound": 0.836
        },
        {
            "id": "h60yzmh",
            "score": 0,
            "text": "some online friend of mine asked me how if i shaved my pubes with a razor. i said ofcourse, dont you? nah, he cuts his with scissors cause hes scared of cutting himself down there.",
            "title_similarity": "0.6964435",
            "sentiment_compound": -0.2741
        },
        {
            "id": "h610kd7",
            "score": 0,
            "text": "Uses hand-me-down clothes and underwear from his older brother.",
            "title_similarity": "0.63207746",
            "sentiment_compound": 0.0
        },
        {
            "id": "h616r66",
            "score": 0,
            "text": "My friend can't pee. Unless they hear water flowing. So they always have to turn the tap on or something to pee.",
            "title_similarity": "0.51536286",
            "sentiment_compound": 0.4939
        },
        {
            "id": "h61w7s5",
            "score": 0,
            "text": "one guy in my school got goat noises made at him… he wasn’t good at anything, i’ll just say that",
            "title_similarity": "0.5600784",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h628wus",
            "score": 0,
            "text": "Female friend from years ago, casually told our friends that she routinely was naked around her family. We are talking her dad, brother, etc.",
            "title_similarity": "0.549016",
            "sentiment_compound": 0.7906
        },
        {
            "id": "h62clvx",
            "score": 0,
            "text": "Nasal hair removal by snorting a light match.",
            "title_similarity": "0.41533583",
            "sentiment_compound": 0.0
        },
        {
            "id": "h62k739",
            "score": 0,
            "text": "An ex of mine **plucked** his down-there hairs. The horror!",
            "title_similarity": "0.7459786",
            "sentiment_compound": -0.6114
        },
        {
            "id": "h63628j",
            "score": 0,
            "text": "My brother does that but with the hair on his balls. Just chillin in the bathroom and plucks a few because he’s bored.",
            "title_similarity": "0.6680067",
            "sentiment_compound": -0.3919
        },
        {
            "id": "h63f9kf",
            "score": 0,
            "text": "One of my friend once told  me \" Don't let your girlfriend swallow your cum during bj, she can get pregnant\" \nEver since i am afraid of bj s",
            "title_similarity": "0.55827594",
            "sentiment_compound": 0.4939
        },
        {
            "id": "h604s07",
            "score": 4,
            "text": "A friend told me he was meeting his gf and wanted to ensure he was fresh, sprayed aerosol deodorant on his penis. So luckily I didn't have to find out the hard way.",
            "title_similarity": "0.6033321",
            "sentiment_compound": 0.8988
        },
        {
            "id": "h60py2x",
            "score": 7,
            "text": "That her son was a furry.",
            "title_similarity": "0.29804122",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5zigdz",
            "score": 18,
            "text": "I do the same with my ass hair",
            "title_similarity": "0.356587",
            "sentiment_compound": -0.5423
        },
        {
            "id": "h60asg4",
            "score": 5,
            "text": "\"have you ever jerked off with a friend?\"\nAlso \" ever been curious?\" By two different friends lol",
            "title_similarity": "0.5671066",
            "sentiment_compound": 0.8738
        },
        {
            "id": "h5zu4lw",
            "score": -1,
            "text": "Dafuq?",
            "title_similarity": "0.23611574",
            "sentiment_compound": 0.0
        },
        {
            "id": "h60m7xy",
            "score": 1,
            "text": "After pooping they stand up to wipe",
            "title_similarity": "0.44802028",
            "sentiment_compound": 0.0
        },
        {
            "id": "h60pmdx",
            "score": 1,
            "text": "Well not my friend, myself, most of me were pretty shocked when I said I’m bisexual and I like yiff and femboys.",
            "title_similarity": "0.5612097",
            "sentiment_compound": 0.4352
        },
        {
            "id": "h60u3nf",
            "score": -1,
            "text": "That upset you?  Pussy.",
            "title_similarity": "0.40155405",
            "sentiment_compound": -0.3818
        },
        {
            "id": "h60vbjf",
            "score": 1,
            "text": "I yank out my nose hairs...",
            "title_similarity": "0.4976871",
            "sentiment_compound": 0.0
        },
        {
            "id": "h60vpva",
            "score": 1,
            "text": "My buddy does standing squats when doing number 2's in public rest rooms.",
            "title_similarity": "0.48838907",
            "sentiment_compound": 0.0772
        },
        {
            "id": "h60xxw6",
            "score": -1,
            "text": "That he was uncircumcised. Has he no shame.",
            "title_similarity": "0.43022984",
            "sentiment_compound": 0.3724
        },
        {
            "id": "h615unp",
            "score": 1,
            "text": "My brother wipes from the front",
            "title_similarity": "0.5665675",
            "sentiment_compound": 0.0
        },
        {
            "id": "h616yr2",
            "score": 1,
            "text": "A friend nonchalantly asked the group chat if we bit our toenails as kids.",
            "title_similarity": "0.60350055",
            "sentiment_compound": 0.4939
        },
        {
            "id": "h61at1e",
            "score": -1,
            "text": "My brother's friend told us that he stands up after he shits to wipe his ass because sitting down and wiping is \"too feminine\"...",
            "title_similarity": "0.666781",
            "sentiment_compound": -0.5267
        },
        {
            "id": "h61gj9b",
            "score": 1,
            "text": "I had a friend who was bare down there.... bc she plucked out her public hair 😬😬",
            "title_similarity": "0.59238696",
            "sentiment_compound": -0.1531
        },
        {
            "id": "h61lwb1",
            "score": -1,
            "text": "my friend told me recently that he wipes standing up and i honestly wanted to end the friendship right there",
            "title_similarity": "0.7266209",
            "sentiment_compound": 0.8442
        },
        {
            "id": "h61s1ux",
            "score": 1,
            "text": "At a holiday party my coworker/sort-of friend said, “I’m not feeling this party at all but [Jane] is really drunk and happy so I might be able to take her home if I stick around.” \n\nHe got pretty irritated when I told him that sounded kinda (very) rapey. He went home by himself thankfully. I did not continue to hang out with him.",
            "title_similarity": "0.5967198",
            "sentiment_compound": 0.9115
        },
        {
            "id": "h61vuzi",
            "score": 1,
            "text": "That’s what tweezing and waxing are, and anyone who has done that regularly can tell you that you don’t feel it nearly as much after a bit. \n\nMy bf was out with his cousin’s group of friends, and the new bf of a girl in the group sat next to him. They had been chatting for about 5 minutes when the new guy suddenly smacked his lips and asked “So… do you eat… the booty?” The guy followed it up with an argument that it was “sanitary” even if the recipient didn’t do anything in particular to clean the area. My bf was very uncomfortable. \n\nFor me, I was talking to a former friend about how disgusted I was with the story of Doc Antel in Tiger King taking advantage of young women. The guy responded, “don’t hate the player, hate the game.” I stopped talking to him immediately. Dude is a convicted sex offender, so it’s good that I no longer associate with him.",
            "title_similarity": "0.62278783",
            "sentiment_compound": -0.8232
        },
        {
            "id": "h61xuj2",
            "score": 1,
            "text": "When I was younger, a girl I was friends with told me to avoid looking fat, she would constantly suck in her stomach all day long",
            "title_similarity": "0.4734562",
            "sentiment_compound": -0.25
        },
        {
            "id": "h622zpq",
            "score": 1,
            "text": "I’ve tried this. It hurts.",
            "title_similarity": "0.40655378",
            "sentiment_compound": -0.4767
        },
        {
            "id": "h628dbb",
            "score": 1,
            "text": "Old roommate disclosed after two years of living with him that he didnt wash his hands after wiping because \"the paper protects your hand.\" Almost vomited right there knowing his stanky hands touched our refrigerator and food every day for two years.",
            "title_similarity": "0.5799582",
            "sentiment_compound": 0.6705
        },
        {
            "id": "h62jyr6",
            "score": 1,
            "text": "Toxic friend I cut off a few years ago told me that he used to pick poop out of his own ass using his fingers, roll them up between his fingers (like what you do with boogers), then throw them around in the bathroom when he was younger. Literally told me out of nowhere and I honestly just… how do you even react to that? I kinda just awkward laughed and brushed it off and pretended that we never talked about it. Thank god it was never brought up EVER again… before I cut him off, of course.",
            "title_similarity": "0.70975053",
            "sentiment_compound": 0.3684
        },
        {
            "id": "h62nmrt",
            "score": 1,
            "text": "I have a friend who believes in some conspiracy theories. Back in the day I use to talk about some of these theories  with him just for fun but I always continue with my life without obsessing with any of these theories. My friend however really likes to get deep in conspiracy theories and he has been like this for years. \nBoth of us like the band  Linkin park so when chester bennington died I was devastated. A couple months laterI saw my friend again so we start talking about stuff as usual until I remember about chester so I said \"dude did you hear about chester bennington?\" And his response was \"yeah, i heard that he faked his death so he doesn't have to deal with fame anymore\". my first though was \"oh, he's just telling me about a conspiracy theory that he heard\" so I just responded \"wow that's crazy\" but his next line was \"i don't get it. If he didn't want to be famous anymore why he didn't just quit his career instead of faking his death?\". I didn't respond to that, i just looked at him with what I can assume was a very confused expression on my face\nI knew my friend was into conspiracy theory but I thought he was like me, but no, he actually believe in this shit and is getting worse",
            "title_similarity": "0.5830126",
            "sentiment_compound": -0.9556
        },
        {
            "id": "h62r1xz",
            "score": 1,
            "text": "My friend laughed at the idea of asexuality, and lgbt people in general. She doesn't know I'm ace.",
            "title_similarity": "0.5124179",
            "sentiment_compound": 0.7351
        },
        {
            "id": "h635ktv",
            "score": 1,
            "text": "Was walking with a group of guy friends while in high school. These guys would discuss absolutely everything without shame. I still do. Anyway, we were talking about girls and sex. On dude asks very earnestly: “do you guys also get so horny sometimes that you wanna just take a girl and, you know, like totally rape her?” I was really surprised but someone else just casually answered how it wasn’t something that people should do. The guy asking the question accepted that and, to my knowledge, never pursued his career as a rapist. \n\nIt made me realize how much guys are a check on each other and learn what’s right or wrong from peers.",
            "title_similarity": "0.60577285",
            "sentiment_compound": -0.79
        },
        {
            "id": "h636hqb",
            "score": 1,
            "text": "My friend told me (and showed me) how he likes to put KETCHUP and SYRUP on top of his FRENCH TOAST\n\nI never had french toast in the vicinity of him ever again.\n\n🤢🤢🤢🤢🤢🤢🤢",
            "title_similarity": "0.48685962",
            "sentiment_compound": 0.7783
        },
        {
            "id": "h636trj",
            "score": 1,
            "text": "#People have WILDLY different pain tolerances that don't necessarily at all match up with their \"masculinity\" or perceived \"toughness\" and the fact that *that fact* isn't widely known or accepted pisses me off.\n\nHad a doctor annoyedly tell my 6'3\" broad-shouldered male self recently that \"it's OK, you're not going to die from your kidney stone\" like thanks lady, that's what I was groaning and moaning about in the #$%&* ER so thanks, I'm cured, where's the &*$%#&#*( exit",
            "title_similarity": "0.57554495",
            "sentiment_compound": 0.812
        },
        {
            "id": "h6376ec",
            "score": 1,
            "text": "You mean like waxing and tweezing like women have been doing for ages?",
            "title_similarity": "0.38042697",
            "sentiment_compound": 0.6124
        },
        {
            "id": "h63az1o",
            "score": 1,
            "text": "Biting toenails off. F'real.",
            "title_similarity": "0.36361468",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5zvuqr",
            "score": 270,
            "text": "That he wipes his ass standing up. \n\nI'm a life-long sitter and a cheeker. In case you don't know, a cheeker leans on one cheek, reaches around, and wipes their ass. My brother, Lord help him, is apparently an excavator. An excavator is reaching between your legs and wiping your ass. Still abnormal but not the monstrosity of STANDING UP and wiping.\n\nNow it is a common occurence that we ask close friends how they wipe their ass and give them the entire rundown of different (but wrong) wiping styles.",
            "title_similarity": "0.7204051",
            "sentiment_compound": -0.8462
        },
        {
            "id": "h5zq5fg",
            "score": 72,
            "text": "[deleted]",
            "title_similarity": "0.336526"
        },
        {
            "id": "h5zywrd",
            "score": 7,
            "text": "i pull a little out sometimes to test my pain tolerance. maybe once every few months.",
            "title_similarity": "0.41696352",
            "sentiment_compound": -0.2732
        },
        {
            "id": "h5zych9",
            "score": 2,
            "text": "I tweeze my underarm hair. I get that it isn't common but why is it upsetting?",
            "title_similarity": "0.61982816",
            "sentiment_compound": -0.631
        },
        {
            "id": "h5zz1af",
            "score": -2,
            "text": "Plot twist:  The friend was a woman !",
            "title_similarity": "0.35737178",
            "sentiment_compound": 0.5411
        },
        {
            "id": "h60f0z0",
            "score": -2,
            "text": "My best friend doesn’t separate his laundry. I never noticed and I lived with him. You think you know a guy and it turns out he’s a monster",
            "title_similarity": "0.64907944",
            "sentiment_compound": 0.8126
        },
        {
            "id": "h60lhui",
            "score": 2,
            "text": "A friend told me once that he went down on his jumpoff when she was on her period. I lost a bit of respect for him that day. Y’all do you, but I knew the girl and that was so effing gross. Really wish I could delete that conversation from my memory.",
            "title_similarity": "0.7169975",
            "sentiment_compound": 0.2211
        },
        {
            "id": "h60osu3",
            "score": 2,
            "text": "That they stand up to wipe after a poop",
            "title_similarity": "0.55342245",
            "sentiment_compound": 0.0
        },
        {
            "id": "h60vb4t",
            "score": 2,
            "text": "The yanking hair is actually healthy and in supposed to keep your underarm naturally colored instead of black like most of us. \n\nIn the Middle East most men actually remove their underarm hair because it makes your underarm cleaner and also because that’s what the Muslim prophet Mohamed (PBUH) did, but most people shave instead of yank.",
            "title_similarity": "0.5819524",
            "sentiment_compound": 0.4497
        },
        {
            "id": "h624l2h",
            "score": 2,
            "text": "I pulled out a nose hair with pliers . It made my whole brain sting.",
            "title_similarity": "0.5578213",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5zwzv6",
            "score": 76,
            "text": "I shave by tying my beard to a door handle and slamming the door s/",
            "title_similarity": "0.5360811",
            "sentiment_compound": 0.0
        },
        {
            "id": "h60fpvh",
            "score": 11,
            "text": "Not so much him telling me but me and my friends use Facebook video call when playing video games together and one of the lads usually has his camera turned off, well recently we were playing fifa pro clubs and this time he had his camera on, and we realised that he plays Xbox lying on his back on his bed about 10 feet away from his tv…",
            "title_similarity": "0.36822844",
            "sentiment_compound": 0.7964
        },
        {
            "id": "h60bfd8",
            "score": 2,
            "text": "To my best friend : boobs are just to extra soft meat with different colored big dots on them. And pussy is just a dirty extra large hole in the body",
            "title_similarity": "0.49525732",
            "sentiment_compound": 0.6705
        },
        {
            "id": "h60ebem",
            "score": -3,
            "text": "I can have sex with my wife without waking her up. During lunch ,when we were talking about movies.",
            "title_similarity": "0.487819",
            "sentiment_compound": 0.0
        },
        {
            "id": "h60f800",
            "score": 4,
            "text": "My 31 year old m8 openly eats bogeys",
            "title_similarity": "0.4189244",
            "sentiment_compound": 0.34
        },
        {
            "id": "h60iyif",
            "score": 3,
            "text": "I'm sorry but how is him yanking his hair upsetting to you.. \n\nThat makes no sense.",
            "title_similarity": "0.5993641",
            "sentiment_compound": -0.7964
        },
        {
            "id": "h60kpvt",
            "score": 1,
            "text": "I was shooting the shit withy boss the other day. He often overbshares. On this occasion he informed me;\n\n1. He masterbated that day. \n\n2. He's racist.",
            "title_similarity": "0.66773033",
            "sentiment_compound": 0.0
        },
        {
            "id": "h60lqsx",
            "score": 3,
            "text": "My buddy is always saying shit I wish I could unhear.\n\n\"I've had six threesomes in the past five years!\"\n\nUh, thanks?\n\n\"I'm not teeny.\"\n\nI didn't ask.\n\nAnd any time he talks about gruesome surgeries he's performed.",
            "title_similarity": "0.53717476",
            "sentiment_compound": 0.3164
        },
        {
            "id": "h60wmmb",
            "score": 2,
            "text": "It’s unfortunate that this will not be seen, but my friends in HS told me her mom puts in her tampons for her.",
            "title_similarity": "0.5280332",
            "sentiment_compound": 0.4854
        },
        {
            "id": "h61a1gu",
            "score": 3,
            "text": "That her husband only brushes his teeth once a week",
            "title_similarity": "0.44809744",
            "sentiment_compound": 0.0
        },
        {
            "id": "h61c0q6",
            "score": 3,
            "text": "In elementary school my best friend told me how she makes fudge and proceeded to show me. It was just her holding TP under her on the toilet and catching the poop in it.",
            "title_similarity": "0.45841193",
            "sentiment_compound": 0.8126
        },
        {
            "id": "h63707d",
            "score": 3,
            "text": "Not really a friend, but one time I was at a party and I didn’t really know anyone there aside from my best mate who was hooking up with some guy - anyways I sat beside this random dude because he had a cute dog with him.\n\nThis dude then proceeds to try to chat me up, “what do you like to do for fun?” I had asked - “you know those terrorist videos of people getting beheaded and stuff? Any horror movie is cool, but those videos are so real”\n\nNoped out of there real quick.\n\nWorst part is I ran into him about a week later on the bus, he hugged me before I could try to make an escape and tried to invite me back to his house. Gag.",
            "title_similarity": "0.6098474",
            "sentiment_compound": 0.4841
        },
        {
            "id": "h612yg0",
            "score": 4,
            "text": "In the locker room during PE way back in like 6th grade our buddy we called pip told us he stuck his finger up his asshole every time he showered.\n\n “Pip why the fuck would you do that?” \n\n“We’ll how else are you gonna get it clean?”",
            "title_similarity": "0.61618793",
            "sentiment_compound": -0.5204
        },
        {
            "id": "h5zzvlh",
            "score": -5,
            "text": "How they hate their facial hair and wishes it would stop growing.",
            "title_similarity": "0.60060024",
            "sentiment_compound": -0.5574
        },
        {
            "id": "h60apht",
            "score": 5,
            "text": "My friend flushes down sanitary napkins.",
            "title_similarity": "0.572969",
            "sentiment_compound": 0.4939
        },
        {
            "id": "h61izkh",
            "score": 7,
            "text": "A friend of mine told me that he regularly goes weeks without bathing or brushing his teeth.",
            "title_similarity": "0.490299",
            "sentiment_compound": 0.4939
        },
        {
            "id": "h5zk2rp",
            "score": 65,
            "text": "r/casuallyupsetting",
            "title_similarity": "0.27521396",
            "sentiment_compound": 0.0
        },
        {
            "id": "h607wax",
            "score": 33,
            "text": "She told me about how she manipulates her dad. \n\nat first I was like 😬😬😬\nbut I'm certain shes only manipulative of her dad because her relationship has not been great and shes probably a little spiteful.\nI've never seen her be manipulative of anyone else even when it might be beneficial to her so I don't worry about it too much.",
            "title_similarity": "0.6041111",
            "sentiment_compound": -0.0508
        },
        {
            "id": "h60dfd8",
            "score": 37,
            "text": "In college, a decent of amount of people would casually admit to drinking and driving and that would be the last time they really hear from me.",
            "title_similarity": "0.53628",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h60mh9n",
            "score": 39,
            "text": "My sister told me she'd started putting mayonnaise on her pizza.\n\n\nSaw her absolutely slather one the other day. To add insult to injury it was a pineapple pizza.",
            "title_similarity": "0.4260367",
            "sentiment_compound": -0.7269
        },
        {
            "id": "h603k2l",
            "score": 18,
            "text": "At the end of my first afghan deployment one of my weirder friend's told me he would beat his dick on patrol when we would be setting up perimeter security on like an elder meeting or whatever. He said he did it multiple times. There were definitely children around but he says he was being sneaky. Fucking degenerate.",
            "title_similarity": "0.63843244",
            "sentiment_compound": -0.1154
        },
        {
            "id": "h60lxbt",
            "score": 8,
            "text": "My friend told me that he thinks most people shouldn't be allowed to vote because they're not intelligent enough.",
            "title_similarity": "0.6005101",
            "sentiment_compound": 0.1828
        },
        {
            "id": "h6121t7",
            "score": 4,
            "text": "That “Covid isn’t real”",
            "title_similarity": "0.24627006",
            "sentiment_compound": 0.0
        },
        {
            "id": "h61gtjz",
            "score": 5,
            "text": "Guy I knew in HS was afraid to use electric razors on his family jewels and he explained that he used tweezers instead",
            "title_similarity": "0.65341985",
            "sentiment_compound": 0.4588
        },
        {
            "id": "h62eohq",
            "score": 8,
            "text": "An ex friend of mine, who I was friends with for about 10 years, casually told me he groped my ex girlfriend at her 21st birthday party. I thought he was joking or bullshitting at the time.\n\nHe's still a virgin and hasnt had a real girlfriend sonce freshman year of high school.\n\nAt the time me and my ex weren't on soeaking terms. (Because of some dumb stuff I said after we broke up.) A few years later me and her patch things up. We talk several times a month and I mentioned what my ex friend had said and how I didnt believe him. She broke down in tears because she thought it was her fault. She had been drinking a bit that night.\n\nI called him out on it while later but my friends want us to apologize to each other for reasons. Ive blocked him on everything since then.",
            "title_similarity": "0.56542736",
            "sentiment_compound": 0.6369
        },
        {
            "id": "h60ie5x",
            "score": 23,
            "text": "My friend flashed out his penis in the school bus.\n\nHe said: Ha He",
            "title_similarity": "0.44777718",
            "sentiment_compound": 0.6808
        },
        {
            "id": "h60htjz",
            "score": 7,
            "text": "I'm not a fan of gay people \nAlso ask me if I  was gay a week before he said that",
            "title_similarity": "0.5196202",
            "sentiment_compound": -0.2411
        },
        {
            "id": "h611242",
            "score": 7,
            "text": "My friend told me he accidentally got roofied once. The way he told the story though was, “I think the bartender was, you know, trying to help his buddy out, but he put it in the wrong drink.”\n\nCan never, ever, ever look at a person the same way if they think drugging a woman who would then get raped is “helping out a buddy.”",
            "title_similarity": "0.69042",
            "sentiment_compound": -0.8834
        },
        {
            "id": "h614pgk",
            "score": 9,
            "text": "They said \"it's not rape if they don't know you\". Yeah, not friends anymore.",
            "title_similarity": "0.5189556",
            "sentiment_compound": 0.0762
        },
        {
            "id": "h62hnvd",
            "score": 9,
            "text": "My best friends little sister works at cvs as a pharmacist in my home town. \n\nOne day, she came to visit me. That night, as we are laughing and joking, she told me that her sister sells my dad condoms all the time…\n\n1) my mom can’t have anymore children.\n2) why does my dad keep buying condoms when her sister is on shift?\n\nLike… is my dad cheating on my mom? Shit had me like 🧐😱😭",
            "title_similarity": "0.5353275",
            "sentiment_compound": -0.3736
        },
        {
            "id": "h5zzz9z",
            "score": 44,
            "text": "He could be suffering from a form of OCD called Trichotillomania. A compulsion to pull one's own hair out.",
            "title_similarity": "0.67054987",
            "sentiment_compound": -0.4767
        },
        {
            "id": "h60awvx",
            "score": 29,
            "text": "\"Oh guess what. You know my ex, the one I told you about [the one that admitted to cheating on him through most of the relationship, ie several *years*]? We're meeting up this weekend.\"",
            "title_similarity": "0.6015415",
            "sentiment_compound": -0.4939
        },
        {
            "id": "h61z03e",
            "score": 8,
            "text": "What friends",
            "title_similarity": "0.28254306",
            "sentiment_compound": 0.4767
        },
        {
            "id": "h5zmh17",
            "score": 51,
            "text": "I think your friend is yanking your chain",
            "title_similarity": "0.5524126",
            "sentiment_compound": 0.4939
        },
        {
            "id": "h60l7ck",
            "score": 10,
            "text": "When my husband's toe nails get too long he tears them off.... We have plenty of clippers.",
            "title_similarity": "0.5859493",
            "sentiment_compound": -0.2263
        },
        {
            "id": "h61dsxe",
            "score": 13,
            "text": "that he views his girlfriend of 17 years like a sister and hasn't had sex with her for the last 14 years? they're still together. that was quite a shock ngl",
            "title_similarity": "0.48180485",
            "sentiment_compound": -0.0972
        },
        {
            "id": "h61ejas",
            "score": 12,
            "text": "[deleted]",
            "title_similarity": "0.336526"
        },
        {
            "id": "h634myv",
            "score": 12,
            "text": "This doesn't compare at all to some things on this thread but a few years ago, the dude who I used to be best friends with, was really going through it with a breakup. We were on a drive in the middle of the night, he was going 95 on a shitty back road, Hinder's Lips of an Angel was blaring over the speakers, and he looked away from the road to look me in the eye and say \"you ever just feel like life is meaningless?\" And then I realized that man could have killed us both that night and would have felt next to nothing about it. \n\nAnyway, we're married now.",
            "title_similarity": "0.6031336",
            "sentiment_compound": -0.4215
        },
        {
            "id": "h616xlp",
            "score": 12,
            "text": "My best friend from high school told me he thinks me being pro-immigration from Mexico makes me evil.",
            "title_similarity": "0.6510356",
            "sentiment_compound": 0.4588
        },
        {
            "id": "h5zri23",
            "score": 822,
            "text": "I actually did the same for like 4 years. \n\nOne day, maybe 9th grade, my dad expresses his disgust at my armpit hair and asks why I don't take care of it. I tell him I don't have a machine and he says:\n\n \"For what?! Grab it with your fingers and tug really fast, that's what I do. Be a man!\"\n\nBoth my parents were watching me at this point and I didn't wanna look like I was scared so I did it (toxic masculinity). My dad just laughed and said go to the bathroom and finish up. I legit bled a bit. But it looked amazing. So I continued for like 4 years, until I saw my dad trimming his using a machine.",
            "title_similarity": "0.6813067",
            "sentiment_compound": 0.7915
        },
        {
            "id": "h60o6s5",
            "score": 16,
            "text": "Mine is a story of disgust and horror, as it was more of a \"watch this\" moment.\n\nI had a friend in middle school, we were walking to my house and there was a black Labrador in the road that came up to us.\n\nOf course I pet the dog, and my friend goes \"hey watch this\".  He then proceeds to reach under the dog and startes jerking him off till the red rocket came out.  I didnt know what to say nor do, I stood there in shock.  I was so mortified that I couldnt even say \"stop\".\n\nA lady opened her door and yelled at him, I snapped out of whatever place I went to in my head to not be in that moment.\n\nI told him I didnt feel good and he should go home, and I avoided him ever since.",
            "title_similarity": "0.53796524",
            "sentiment_compound": -0.7662
        },
        {
            "id": "h61qf67",
            "score": 17,
            "text": "He doesn’t wear sunscreen when out fishing for hours at a time because “everybody gets melanoma at some point in their life” (we’re both pale af lol)\n\nDude....no",
            "title_similarity": "0.42631957",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h5zticr",
            "score": 384,
            "text": "I’ve told people that I’ll take (cleaned and sanitized) nail clippers and cut off a skin tag, mole, or an inflamed tastebud. I had a wart on my foot once that I dug out. I once used a safety pin and pierced my ear in class in high school. This kind of stuff doesn’t really bother me, but I usually get pretty freaked out looks if I mention it.",
            "title_similarity": "0.62871766",
            "sentiment_compound": 0.0781
        },
        {
            "id": "h606k03",
            "score": 16,
            "text": "\"my wife probably isnt thrilled with the idea that you have had naked pics of her for years\"",
            "title_similarity": "0.54407656",
            "sentiment_compound": -0.3412
        },
        {
            "id": "h61bn4e",
            "score": 16,
            "text": "So probably a little late to the party, but I had a friend (he was 17, I was 15) while talking about the boys and girls we like at our school he hit me with the line \"If she's old enough to pee, she's old enough for me.\" The friendship kindof ended after that but two years later at our school's government classes trip to see real court cases this guy was on trial for statutory rape and give alcohol to a minor. So yea...",
            "title_similarity": "0.5675903",
            "sentiment_compound": 0.6908
        },
        {
            "id": "h60mivo",
            "score": 48,
            "text": "One of my oldest friends is schizophrenic but I've never really seen him have an episode. Then casually in conversation one day he drops that he believes an AI controls all our lives and because of this he won't ever die...\n\nOh yeah he also once tried to join the Army because \"I just wanted to kill people.\" This was apparently enough for him to be recruited to special forces. Suuure kid, sure.",
            "title_similarity": "0.619371",
            "sentiment_compound": 0.8972
        },
        {
            "id": "h60ebp2",
            "score": 84,
            "text": "My wealthiest friend bragging about moving most of his holdings to health insurance companies because the government being in bed with pharma lobbyists is \"free money\"",
            "title_similarity": "0.49469694",
            "sentiment_compound": 0.8658
        },
        {
            "id": "h610emg",
            "score": 22,
            "text": "An ex acquaintance. I already didn't like the guy, but he hung out in our groups often because he liked my friends too. We were talking about dreams and nightmares. Average stuff, you know? A few of us were talking about wet dreams, still pretty normal.\n\nEx acquaintance admits he had a recurring dream of him and our friends taking turns hunting me for sport. Guy was laughing describing the \"look on my face\" when he smashed my head in with an Xbox. \n\nThat's fucked up, but dreams are dreams.\n\nUntil I learned later the fucker was a lucid dreamer",
            "title_similarity": "0.59000325",
            "sentiment_compound": 0.9788
        },
        {
            "id": "h60bkgm",
            "score": 26,
            "text": "\"My friend has videos of your friend on his phone\" clearly suggesting nonconsensual.\n\nHe's dead now.",
            "title_similarity": "0.6266991",
            "sentiment_compound": 0.5859
        },
        {
            "id": "h60p5l5",
            "score": 155,
            "text": "They enjoy the challenge of drunk driving",
            "title_similarity": "0.41068435",
            "sentiment_compound": 0.2732
        },
        {
            "id": "h60vwj3",
            "score": 29,
            "text": "That they don't find lolis and lolicon weird. When I put it as drawings of children in compromising poses, he argued drawings do no harm. He's a neighbour and I wish he just never told me that",
            "title_similarity": "0.5433115",
            "sentiment_compound": 0.3291
        },
        {
            "id": "h61gx3q",
            "score": 144,
            "text": "Me: (nothing at all)\n\nHim: That's the problem with the nigs, they love to steal.\n\nMe: 😳😳😳",
            "title_similarity": "0.5838374",
            "sentiment_compound": -0.1779
        },
        {
            "id": "h60cjhy",
            "score": 93,
            "text": "I remember once seeing my friend remove his toenails by biting them. *Shudders*",
            "title_similarity": "0.6851368",
            "sentiment_compound": 0.4939
        },
        {
            "id": "h60p2jk",
            "score": 94,
            "text": "I don't know, but I have one friend who casually sniffs his fingers every time he scratches his balls. \n\nI don't know how to talk to him about it.",
            "title_similarity": "0.61203814",
            "sentiment_compound": 0.7469
        },
        {
            "id": "h60hytp",
            "score": 156,
            "text": "Threads like these remind me why I keep going back to r/askmen: to be disgusted and hilariously mortified within the same scroll down",
            "title_similarity": "0.59900177",
            "sentiment_compound": -0.2263
        },
        {
            "id": "h5zy0m6",
            "score": 657,
            "text": "I pluck my nose hairs out all the time. In your mid to late 20s a lot of dudes get nose and ear hairs like we’re damn old men. I’ve found that nose hairs are super easy to just pull out and it’s actually very satisfying idk why. Lol\n\nEdit: why has my comment of plucking nose hairs garnered this much of a conversation and this many upvotes? Lmao",
            "title_similarity": "0.6148426",
            "sentiment_compound": 0.9424
        },
        {
            "id": "h606len",
            "score": 457,
            "text": "I do that. it doesn't hurt after a while.  I twist the long hairs together and pull down, not straight out. Then I chase my terrified wife around the house with it. \n\ni have a friend who is a refugee from Iran. i say this because her mother was 5 weeks pregnant with her while getting waterboarded and other torture. that's the time the heart is still forming and she has a pacemaker now.  Well, she casually said her pacemaker stopped working ten days before the bar exam but she had no time to get that taken care of because she had to study.  she passed the bar, got the new pacemaker and lived but wtf man",
            "title_similarity": "0.48569334",
            "sentiment_compound": -0.4488
        },
        {
            "id": "h607t1f",
            "score": 607,
            "text": "I can’t remember exactly what it was but my friends who are dating were telling me and another friend about some weird shit they do when they are alone. Like cleaning their ears with each other’s tongues. Honestly it must have been horrifying because I cant remember exactly what it was. Anyways, me and the other friend looked at each other and then told them that they should probably never tell anyone else that ever.",
            "title_similarity": "0.71424055",
            "sentiment_compound": 0.7579
        },
        {
            "id": "h61j0g1",
            "score": 62,
            "text": "[deleted]",
            "title_similarity": "0.336526"
        },
        {
            "id": "h5zwqhc",
            "score": 593,
            "text": "Confessed to using his right hand to rub his spunk into his belly after wank, wondering what hand everyone else uses...  like,  hol up",
            "title_similarity": "0.5835173",
            "sentiment_compound": 0.836
        },
        {
            "id": "h5zxcmw",
            "score": 1262,
            "text": "Bragging about cheating... Like, one this isn't something I need to know and two, it's only making me think less of you.\n\nThere was also this one college roommate who started making some super pervy comments about an underage girl when we were watching an 80s movie once. Every couple years I run a Google search of his name.",
            "title_similarity": "0.5960257",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h5zl070",
            "score": 910,
            "text": "Pretty much out of the blue one day in high school during recess, my friend told me he once rubbed eucalyptus oil on his balls to get rid of an itch. He ended up in searing agony for about 15 minutes before he finally got the (pun not intended) balls to tell his dad what he'd done and to ask what to do to stop the pain.\n\nLet's just say that no-one's appetite appreciated that story.",
            "title_similarity": "0.54200864",
            "sentiment_compound": 0.34
        },
        {
            "id": "h603wal",
            "score": 93,
            "text": "My closest friend told me that he jerks off and discharges his entire load in his underwear then lets it dry. He argued that it's nothing because he changes underwear everyday. I was horrified to that extent that i was unable to mock him over his unhygienic attitude.",
            "title_similarity": "0.6912983",
            "sentiment_compound": -0.7717
        },
        {
            "id": "h61a6gu",
            "score": 96,
            "text": "My friend refused to chug beers. Not a big deal since some people just dont like to do that understandably. He then told me he couldn't, so I figured I could figure out why not and help him lol. Turns out, he had been drinking all liquids with his teeth together. He thought he was supposed to be using them as a solid particle filter of sorts. This also turned out to be why his teeth were so prone to cavities. He can chug beers now.",
            "title_similarity": "0.6157199",
            "sentiment_compound": 0.2575
        },
        {
            "id": "h61fstn",
            "score": 102,
            "text": "Not a about a friend but an old guy I used to work with.\n\nWe were driving down a street in a work vehicle and he saw a young girl maybe 13.\nHe proceeded to lick the window in her direction and said \"mmmm  good stock!\" \n\nHe was  dead serious and not the last time he said something like that.\n\nI have never been so disgusted by a person in my life.",
            "title_similarity": "0.5986239",
            "sentiment_compound": -0.7609
        },
        {
            "id": "h60276d",
            "score": 703,
            "text": "I had a friend in high school who I was semi close with. We started out as interested in eachother and it didn’t work out, so we were just friends and spoke occasionally. One day we happened to be having lunch together in the library and she was telling me about this guy she was then dating that I was cool with. Then she casually mentioned that they were actually cousins. Now I have no idea how closely related they were, but I was dumbfounded by how nonchalant she was about telling someone this and *not* giving context. 7 (?) years later, Facebook says they’re still together.",
            "title_similarity": "0.5392862",
            "sentiment_compound": -0.1416
        },
        {
            "id": "h5zzkiw",
            "score": 871,
            "text": "Nothing he told me it was just something he used to do. He used to hard boil eggs and stick a straw in it and literally would suck an egg. It was disgusting and everything smelled like eggs. He is also the same guy that would pull random deli meats out of his pocket and start eating. Full on sausages. Wtf! He was a strange dude.",
            "title_similarity": "0.5255692",
            "sentiment_compound": -0.8777
        },
        {
            "id": "h5zindt",
            "score": 3363,
            "text": "I had a friend who was in a long distance relationship. I was talking to him once and he was like \"yeah I went to a bar and got to talking with the bartender. We hit it off well and I took her home and we banged.\"\n\nI was like \"...what about your girlfriend?\"\n\n\"Oh, the bartender doesn't really matter\"\n\n(No they didn't have an open relationship agreement or anything)",
            "title_similarity": "0.545876",
            "sentiment_compound": 0.9247
        },
        {
            "id": "h602d3v",
            "score": 562,
            "text": "Like 5-6 years or so ago, he told me over Teamspeak that he scratches his inner ear using nail clippers, knives and screwdrivers. Literally 20 minutes later he couldn't tell why his ears were hurting/inflamed.",
            "title_similarity": "0.56980777",
            "sentiment_compound": 0.3818
        },
        {
            "id": "h5zqawz",
            "score": 2244,
            "text": "When I was younger I knew a guy who never had acne. We were at his house and talking about washing faces and stuff, he said he never did. \n\nTurns out he (supposedly) scraped at pimples with a butter knife to break them, and used rubbing alcohol to dry them out and clean the clogged pore or whatever. \n\nAbsolute fucking madman.",
            "title_similarity": "0.5986878",
            "sentiment_compound": 0.4019
        },
        {
            "id": "h60o7lr",
            "score": 246,
            "text": "My roommate MUST fall asleep with a piece of chocolate in her mouth. After she brushes her teeth. She hates the taste of toothpaste and eating the chocolate at night helps trigger her BM’s in the morning 😅",
            "title_similarity": "0.4885442",
            "sentiment_compound": 0.296
        },
        {
            "id": "h6072ks",
            "score": 258,
            "text": "My friend cut his nipple tip while cutting the hair around it with scissors. \n\nI still haven't recovered fully, he said it so casually that I had to pause and just WTF.",
            "title_similarity": "0.67980456",
            "sentiment_compound": -0.4003
        },
        {
            "id": "h60pmc0",
            "score": 968,
            "text": "Had a friend who had a headache once and i told him to take a pill \n\nFriend: *i don't believe in medication/medicine*\n\nThis would not have shocked me as much if we had not just GRADUATED FROM MEDSCHOOL",
            "title_similarity": "0.6366192",
            "sentiment_compound": 0.8106
        },
        {
            "id": "h5zwa0n",
            "score": 116,
            "text": "I do this with nipple hair",
            "title_similarity": "0.2722444",
            "sentiment_compound": 0.0
        },
        {
            "id": "h600hga",
            "score": 1467,
            "text": "A couple guys I knew came back home for a break from the marines and they were talking about how mentally damaging it is to be in certain situations and casually mentioned how he knew someone so desperate for sex that he would fuck goats and that it sadly wasn’t something unusual. I fully thought he was playing games with me but they were so dead serious.",
            "title_similarity": "0.6552957",
            "sentiment_compound": -0.9393
        },
        {
            "id": "h60oqa7",
            "score": 295,
            "text": "My ex casually told me one time when she was a teenager she peed in her younger brother's sports water bottle. I guess he asked for her to refill it and she decided to pee in it as a prank. She actually watched him drink it and spit it out",
            "title_similarity": "0.5935769",
            "sentiment_compound": 0.1779
        },
        {
            "id": "h5zui4q",
            "score": 3124,
            "text": "I worked with a guy at a summer camp who thought every man lactated. He had a particularly heavy flow one day and went to see the first aider because he wasn't sure what to do as it was going through his shirt. She just came out into the main area and said, \"I need an adult.\" I don't remember the specifics of the conversation but I do remember her saying \"you realize I'm not a doctor, right?\" Keep in mind this kid was like 15 and the first aider was just some 20 something college kid.\n\nHe was able to shoot like 3 feet though, so that was fun.",
            "title_similarity": "0.55523944",
            "sentiment_compound": 0.8301
        },
        {
            "id": "h5zz4yn",
            "score": 5828,
            "text": "Guy I knew was pretty good with women. Very good-looking and an excellent flirt. \n\n\"I don't see women as people.\" \n\n...oh, uh, ok.",
            "title_similarity": "0.43898284",
            "sentiment_compound": 0.8689
        },
        {
            "id": "h6006y4",
            "score": 1317,
            "text": "not a friend but in school, a random guy in the class just sat next to me and pulled out his dick and told me \"I can masturbate 3 times in just 15 mins\"",
            "title_similarity": "0.45915195",
            "sentiment_compound": -0.7402
        },
        {
            "id": "h602xd4",
            "score": 2242,
            "text": "Not rlly my friend but a dude in my high school class years ago thought guys had periods too and only learnt they didn’t in like year 10 (dunno what that is in the US), turns out he passed a kidney stone thinking that periods were when you peed little stones and not blood.\n\nEdit:WHY TF DID I GET A WHOLESOME REWARD",
            "title_similarity": "0.5508832",
            "sentiment_compound": 0.862
        },
        {
            "id": "h60i7xy",
            "score": 739,
            "text": "A guy i know was cutting his... i don't know the word in english but, the part of hard skin under his heel. The conversation was something like :   \n\"Hey X, what's the pile of weird slicey-thing on your computer desk\"  \n\"Oh, hard skin, why?\"",
            "title_similarity": "0.5009527",
            "sentiment_compound": -0.0644
        },
        {
            "id": "h5zww82",
            "score": 2277,
            "text": "As an extremely hairy dude, I'm already crying thinking about yanking all that shit out.\n\nI had to cut ties with a good friend of mine when I realized that he was attracted to underage girls (he is well into his 30s now), and had been trying to slowly justify it by casually giving reasons why it's ok over several years of conversations.\n\nEdit: Most karma I've ever received and it's about my Wookie-like appearance and pedophilia... Cool Cool Cool.",
            "title_similarity": "0.72335434",
            "sentiment_compound": 0.9081
        },
        {
            "id": "h60ov4t",
            "score": 1079,
            "text": "He wants to invite friends for five course meal, and when they show up he will serve them five courses of mac and cheese using different flavor boosters that they have in Canada.  \nCold mac and cheese is the first course, as the pasta salad\nMac and cheese with the pasta water still in it, as a soup course\nAnd for the finale, for dessert, he will serve mac and cheese with the cotton candy flavor booster.",
            "title_similarity": "0.3260194",
            "sentiment_compound": 0.5719
        },
        {
            "id": "h60njja",
            "score": 164,
            "text": "A coworker once told me, in order to communicate that he found a woman attractive, that he would gladly drink a smoothie out of her asshole.\n\nThat was like 10 years ago and it still fucks with me.",
            "title_similarity": "0.5786848",
            "sentiment_compound": 0.5719
        },
        {
            "id": "h604k7m",
            "score": 383,
            "text": "not upsetting, but kinda funny and unexpected, my friend casually mentioned that he jerks off with a finger in his butt during a thanksgiving dinner, like it was the only way to do it.",
            "title_similarity": "0.618037",
            "sentiment_compound": 0.9029
        },
        {
            "id": "h60jbn8",
            "score": 392,
            "text": "My brother told the rest of the fam he sometimes shits in the shower. When we reacted disgusted he tried to make us the weird ones for not doing it lol",
            "title_similarity": "0.7072574",
            "sentiment_compound": -0.8602
        },
        {
            "id": "h60ld96",
            "score": 178,
            "text": "a guy told me he hadn't showered in over a month one time.\n\nthis was AFTER we had sex, and, of course, I went down on him. didn't even notice, tbf.",
            "title_similarity": "0.5380893",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5znmm0",
            "score": 3751,
            "text": "We have a saying back home. \"Fucking the dog\" it just means you're just lazing around not doing anything productive. I said this when me and the boys were out having some drinks and they'd never heard it so they were joking about stupid canadian sayings\n\nThen one of the guys who was pretty hammered at the time looks up from his beer and says with total honesty\n\n\"I fucked a dog once\"\n\nThere was a long silence before we busted out laughing thinking he was just making a sick joke\nGuy acts a bit hurt like he'd just confided something in us and we were being assholes\n\nStopped hanging out with him after that",
            "title_similarity": "0.6249033",
            "sentiment_compound": -0.6915
        },
        {
            "id": "h605m93",
            "score": 2200,
            "text": "I work with a guy that told me he likes to credit card swipe his ass crack and smell it. How you even respond to someone casually telling you that is beyond me.",
            "title_similarity": "0.67921996",
            "sentiment_compound": 0.3818
        },
        {
            "id": "h5zqlun",
            "score": 6485,
            "text": "This were his exact words: I ate a kilo of pudding yesterday, and i shat in the sandbox in the kindergarden's playground.\n\nWe then went there, and guy wasn't lying.\n\nEdit: Guy was not on drugs, and he was 18 at a time",
            "title_similarity": "0.37419719",
            "sentiment_compound": 0.4168
        },
        {
            "id": "h5zkeo7",
            "score": 5362,
            "text": "When I was in my teens one of the guys in our group told us that he masturbates with hand sanitizer.",
            "title_similarity": "0.6001704",
            "sentiment_compound": 0.4939
        },
        {
            "id": "h60j38j",
            "score": 543,
            "text": "A co worker told us recently that his wife made him sleep outside when she was mad at him. Apparently she wouldn't let him come inside to shit either so he shit in a litter box on the porch. Why he told us this? No clue.",
            "title_similarity": "0.514162",
            "sentiment_compound": -0.9213
        },
        {
            "id": "h60hput",
            "score": 1348,
            "text": "This happened in middle school years ago. I was up till 4:00 am comforting my friend after her dog passed in her arms. Around 7:30 in the morning she called me laughing bc she was joking about her dog being dead, and she can’t believe I fell for it.",
            "title_similarity": "0.48305157",
            "sentiment_compound": 0.6908
        },
        {
            "id": "h60dgno",
            "score": 2588,
            "text": "I had a couple friends in high school that would go to each others houses and sleep over a lot. One day, one of them said to the other something about needing to clean the jizz off his face, and the way the other kid reacted was too genuine, like he actually expected to have jizz on him. \n\nThen we found out that they would play some game at these sleep overs, where the first person to fall asleep was basically just going to get jacked off on, and they both acted like it was no biggie and just a funny little thing. And I distinctly remember one of them saying the other one essentially gave him a handjob when he was half asleep and \"didn't realize\" what he was holding. \n\nI lost contact with both of them after high school, but I hope they're happy together.",
            "title_similarity": "0.609782",
            "sentiment_compound": 0.9403
        },
        {
            "id": "h60769y",
            "score": 1624,
            "text": "A friend of mine's little cousin used to take a dump and then wad up a few pieces of toilet paper into a ball. Instead of wiping his butt, he would cram the wadded up but toilet paper in between his butt cheeks and go throughout the day. He would later take the toilet paper out and claimed that was enough to clean his butt.",
            "title_similarity": "0.6665915",
            "sentiment_compound": 0.5927
        },
        {
            "id": "h607v4k",
            "score": 355,
            "text": "I had a friend once tell me that he would start taking as many people as possible to the grave with him if he ever got cancer.",
            "title_similarity": "0.56380695",
            "sentiment_compound": -0.5859
        },
        {
            "id": "h60joxb",
            "score": 655,
            "text": "A friend I’ve known sonce middle school told all of us mid-bullshitting session; “I stabbed two people once.” We all thought he was joking until we saw he was serious. Turns out it was in self-defense one night when he was walking home from work when three people decided to try and mug him",
            "title_similarity": "0.6492766",
            "sentiment_compound": 0.2263
        },
        {
            "id": "h5zoblv",
            "score": 1,
            "text": "Sometimes you don't mind a lil' strange.",
            "title_similarity": "0.31507894",
            "sentiment_compound": -0.2023
        },
        {
            "id": "h5zr099",
            "score": 2,
            "text": "Wait, his underarm, or somebody else’s?\n\nI need to know…",
            "title_similarity": "0.4161991",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5zxd3j",
            "score": 1,
            "text": "Nice, that's hardcore as fuck",
            "title_similarity": "0.28481787",
            "sentiment_compound": -0.1779
        },
        {
            "id": "h603l1n",
            "score": 6,
            "text": "I can do this, weirdly, in one of my armpits its virtually painless to rip hairs out, in other it’s as painful as you’d expect.",
            "title_similarity": "0.50354207",
            "sentiment_compound": -0.4939
        },
        {
            "id": "h6077ln",
            "score": 1,
            "text": "He was probably gonna mention the nether regions but perceived your disgust",
            "title_similarity": "0.63393563",
            "sentiment_compound": -0.7469
        },
        {
            "id": "h607nyw",
            "score": 1,
            "text": "Why would that be upsetting?",
            "title_similarity": "0.29961032",
            "sentiment_compound": -0.4767
        },
        {
            "id": "h607w1u",
            "score": 1,
            "text": "I have done that. Twist them up in a knot and slowly pull.",
            "title_similarity": "0.3891561",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6083xq",
            "score": 20,
            "text": "Sometime in the last month a friend told me he masturbated so much/hard one day he got friction burns.",
            "title_similarity": "0.54180235",
            "sentiment_compound": 0.4939
        },
        {
            "id": "h608oxn",
            "score": 2,
            "text": "that he drinks shots of eggs",
            "title_similarity": "0.24643731",
            "sentiment_compound": 0.0
        },
        {
            "id": "h60a5jc",
            "score": 7,
            "text": "I do my own dental work (mainly a wisdom tooth that needed some adjusting)",
            "title_similarity": "0.44771743",
            "sentiment_compound": 0.5267
        },
        {
            "id": "h60anpl",
            "score": 1,
            "text": "Plucking underarm hairs individually?!?!? What in the actual fuck??? \n\nDude sounds like a legit sociopath.",
            "title_similarity": "0.6199527",
            "sentiment_compound": -0.549
        },
        {
            "id": "h60bz6h",
            "score": 1,
            "text": "It's the things that I wasn't told that upset me.",
            "title_similarity": "0.45396605",
            "sentiment_compound": 0.2924
        },
        {
            "id": "h60chlp",
            "score": 1,
            "text": "We were talking about trimming pubes a while ago with some friends, and I casually mentioned that one of the reasons I trimmed my pubes was so they don't get caught by my pant's zipper. And for some reason they looked at me like I was some kind of degenerate. They all admitted to trimming. Is there something I'm not getting?",
            "title_similarity": "0.7705636",
            "sentiment_compound": 0.7717
        },
        {
            "id": "h60d6us",
            "score": 2,
            "text": "A former friend of mine puts ketchup and mustard on a pizza.",
            "title_similarity": "0.37885803",
            "sentiment_compound": 0.4939
        },
        {
            "id": "h60d80s",
            "score": 1,
            "text": "I do this but with my pubes",
            "title_similarity": "0.3181493",
            "sentiment_compound": 0.0
        },
        {
            "id": "h60eh7m",
            "score": 1,
            "text": "He was talking about his own armpit hairs, right?",
            "title_similarity": "0.63348675",
            "sentiment_compound": 0.0
        },
        {
            "id": "h60f2ly",
            "score": 3,
            "text": "Had a friend that I thought was nice and educated tell me he thought gay people just made the choice to be “that way”.",
            "title_similarity": "0.5601535",
            "sentiment_compound": 0.7184
        },
        {
            "id": "h60f3t1",
            "score": 1,
            "text": "A buddy of mine, when we were 16, told me he couldn't come hang out with us because he had just gotten out surgery for getting circumcized. I know this is not uncommon but man it still hurts to think about til this day.",
            "title_similarity": "0.5930332",
            "sentiment_compound": -0.631
        },
        {
            "id": "h60f4gu",
            "score": 4,
            "text": "I know someone that didn't wash below their waist in the shower because the water and soap would run down and clean below the waist anyway...",
            "title_similarity": "0.6290817",
            "sentiment_compound": 0.4019
        },
        {
            "id": "h60fbxh",
            "score": 3,
            "text": "Friend of mine told me that they would pick and eat their scabs.",
            "title_similarity": "0.5955163",
            "sentiment_compound": 0.4939
        },
        {
            "id": "h60fk6w",
            "score": 8,
            "text": "Had a friend let us know he buys new socks every week 'cause he likes to collect jizz socks beside his bed. He then showed us his hoard of stiff bundled socks and threw one at our friend.",
            "title_similarity": "0.52681553",
            "sentiment_compound": 0.8481
        },
        {
            "id": "h60fmzw",
            "score": 1,
            "text": "OUCH😱 that sounds painful. I'm almost glad I dont have friends",
            "title_similarity": "0.5516633",
            "sentiment_compound": -0.8199
        },
        {
            "id": "h60fx3m",
            "score": 1,
            "text": "His or other peoples’?",
            "title_similarity": "0.30301222",
            "sentiment_compound": 0.0
        },
        {
            "id": "h60gdvb",
            "score": 15,
            "text": "She said to me \"I saw someone put something in my drink, so I gave it to [name I have forgotten]. Don't worry, I brought her home when she wanted to sleep\".\n\nAnd yes, I was as baffled as you. That girl could have died, yet she was stupid enough to not see the seriousness in it. All casual, like it was buying an apple from a veggie shop.",
            "title_similarity": "0.6258538",
            "sentiment_compound": -0.089
        },
        {
            "id": "h60grft",
            "score": 10,
            "text": "At 35 years of age my friend chews a whole pack of gum at once.",
            "title_similarity": "0.36178297",
            "sentiment_compound": 0.4939
        },
        {
            "id": "h60h305",
            "score": 16,
            "text": "I once had a friend of mine tell me, after she had just gotten back from the bathroom of a restaurant, that no matter how much she wiped her ass there was still poop on the toilet paper.  \n\nOk, we've all had poops that take forever to wipe, I get it. \n\nBut then she told me she just gave up and was gonna deal with it when she got home.\n\nSo she's just sitting there with poop still on her ass?  That's such a foreign idea to me that I didn't even know how to respond.",
            "title_similarity": "0.63345796",
            "sentiment_compound": -0.7129
        },
        {
            "id": "h60hbnx",
            "score": 1,
            "text": "When I was about 15 a friend told us in a group setting that when he showers he always sticks a finger or two up his butt. He found it weird that none of us did it.",
            "title_similarity": "0.6138464",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h60hwpp",
            "score": 1,
            "text": "I’m sorry, but what? Actually, don’t answer, the question posed has disturbed me for many reincarnations to come. Toodles",
            "title_similarity": "0.5277003",
            "sentiment_compound": -0.5499
        },
        {
            "id": "h60iamq",
            "score": 3,
            "text": "My ex told me he lost his virginity to a prostitute. He was very overweight as a late teen/early 20 something and thought no one else would ever sleep with him.",
            "title_similarity": "0.523644",
            "sentiment_compound": -0.7425
        },
        {
            "id": "h60j456",
            "score": 1,
            "text": "I use to do that will butthole hair until I found out about shaving.",
            "title_similarity": "0.71124077",
            "sentiment_compound": 0.0
        },
        {
            "id": "h60j4m7",
            "score": 18,
            "text": "A good friend of mine doesn't cut their toenails. He's 24.",
            "title_similarity": "0.37320006",
            "sentiment_compound": 0.7854
        },
        {
            "id": "h60j820",
            "score": 3,
            "text": "my bff told me she cleans her privates with clearasil 💀 same pump as the one she uses on her face.",
            "title_similarity": "0.5971307",
            "sentiment_compound": 0.5994
        },
        {
            "id": "h60jasw",
            "score": 1,
            "text": "c",
            "title_similarity": "0.058448337",
            "sentiment_compound": 0.0
        },
        {
            "id": "h60jd11",
            "score": 2,
            "text": "She licks spoons and puts them back.",
            "title_similarity": "0.29516655",
            "sentiment_compound": 0.0
        },
        {
            "id": "h60jdub",
            "score": 1,
            "text": "You ever see the rim of a toilet / urinal covered in pubes? They didn't fall out.",
            "title_similarity": "0.3224823",
            "sentiment_compound": 0.0
        },
        {
            "id": "h60jo6p",
            "score": 3,
            "text": "My good buddy told me he wipes back to front",
            "title_similarity": "0.61450005",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h60l75m",
            "score": 1,
            "text": "Gah.  My brother in law does the same thing w his ear hairs.  Just yanks them out.",
            "title_similarity": "0.74279153",
            "sentiment_compound": 0.0
        },
        {
            "id": "h60l9gq",
            "score": 3,
            "text": "[deleted]",
            "title_similarity": "0.336526"
        },
        {
            "id": "h60lpu9",
            "score": 1,
            "text": "Perspective.",
            "title_similarity": "0.022111055",
            "sentiment_compound": 0.0
        },
        {
            "id": "h60lt41",
            "score": 6,
            "text": "Growing up my brother thought PMS was a drug that you injected into your arm.",
            "title_similarity": "0.5730928",
            "sentiment_compound": 0.1779
        },
        {
            "id": "h60mu9h",
            "score": 2,
            "text": "A friend told me he zoned out without deafening himself in discord and masturbated two different times.",
            "title_similarity": "0.6299037",
            "sentiment_compound": 0.3374
        },
        {
            "id": "h60mv9g",
            "score": 1,
            "text": "A friend of mine would do that with his pubs hair",
            "title_similarity": "0.5736805",
            "sentiment_compound": 0.4939
        },
        {
            "id": "h60n7j6",
            "score": 1,
            "text": "Made some new online friends. On VC with them. One of their voices sounded like they were in distress, so I asked them what was up. They said they just came back from doing a lie detector test at a police station because their ex was spreading lies that they raped her and all of that jazz, and how it basically is ruining his life. He has to let people know he’s a possible predator and all that now. Full sympathy to them ofc, but holy shit I was NOT ready to hear about that off a casual “are you ok?”",
            "title_similarity": "0.68638885",
            "sentiment_compound": -0.8487
        },
        {
            "id": "h60oi1b",
            "score": 1,
            "text": "\"Well that girl Dawn she gave me crabs\" \n\nI laughed in their face because dude was a man whore who didn't care where he put it. Sorry bro I told you something like this would happen.",
            "title_similarity": "0.5790479",
            "sentiment_compound": -0.1601
        },
        {
            "id": "h60pdmv",
            "score": 22,
            "text": "I had a friend who would “braid” his leg hair and pubes. His leg hair was ridiculously long.",
            "title_similarity": "0.473358",
            "sentiment_compound": 0.2023
        },
        {
            "id": "h60po3a",
            "score": 17,
            "text": "Someone I knew at university used to store unopened canned food in the fridge to keep it fresh.",
            "title_similarity": "0.46437117",
            "sentiment_compound": 0.3182
        },
        {
            "id": "h60poqc",
            "score": 1,
            "text": "Okay, hold on. That's one of the most effective and simple ways to do it. I just get some climbing chalk, put on a show, and apply some lotion when finished.",
            "title_similarity": "0.39874613",
            "sentiment_compound": 0.6478
        },
        {
            "id": "h60ppd8",
            "score": 25,
            "text": "My friend brings drinks into public bathrooms and sets them on top of the urinal",
            "title_similarity": "0.44660425",
            "sentiment_compound": 0.6124
        },
        {
            "id": "h60pv0u",
            "score": 1,
            "text": "Alright so my friend pulled his dick out of the little hole in his underwear (were both guys.) When I asked him \"wait was that your...?\" He responded with \"I just wanted to see how far it comes out.\"",
            "title_similarity": "0.6973646",
            "sentiment_compound": 0.2911
        },
        {
            "id": "h60q6sa",
            "score": 1,
            "text": "I tweezed my mustache once when it was first coming in.",
            "title_similarity": "0.6033368",
            "sentiment_compound": 0.0
        },
        {
            "id": "h60qkvp",
            "score": 1,
            "text": "That’s how I get rid of my ball hair",
            "title_similarity": "0.5700518",
            "sentiment_compound": 0.0
        },
        {
            "id": "h60qr2a",
            "score": 2,
            "text": "I yank my nosehairs when I am pissed off sometimes.",
            "title_similarity": "0.5661427",
            "sentiment_compound": -0.6369
        },
        {
            "id": "h60qs18",
            "score": 1,
            "text": "My friend told me he ate a kiwi with the skin on.\n\nI had to see it to beleive it",
            "title_similarity": "0.55699736",
            "sentiment_compound": 0.4939
        },
        {
            "id": "h60r53a",
            "score": 1,
            "text": "Knew a dude that said he got rid of his asshole hair by twisting them together and yanking it out. He said it hurt at first but after a while he got used to it.",
            "title_similarity": "0.7991405",
            "sentiment_compound": -0.296
        },
        {
            "id": "h60rvnk",
            "score": 12,
            "text": "well three years ago i was friends with this guy and he casually told me he bite a chuck of his dog’s neck out and left a scar and i kinda just cut contact after that",
            "title_similarity": "0.62679803",
            "sentiment_compound": 0.6222
        },
        {
            "id": "h60sl5s",
            "score": 1,
            "text": "Wtf 👁👄👁 why doesn't he just wax",
            "title_similarity": "0.47596222",
            "sentiment_compound": -0.5859
        },
        {
            "id": "h60smmb",
            "score": 1,
            "text": "Yeah, I've done that to my chest hair.\n\nI had this classmate at  who had terrible acne on his forehead, one day he took a shaving razor and shaved all the ACNE ON HIS FOREHEAD, he was bleeding from his forehead like a faucet!!\n\nOnce a guy on our group bragged he can cum in a minute, so, we held this competition on who is the fastest masturbator at 7th grade I think, I couldn't cum due to performance issues even though I started when I was in 4th grade.",
            "title_similarity": "0.578882",
            "sentiment_compound": 0.2924
        },
        {
            "id": "h60so34",
            "score": 3,
            "text": "Recently learned there are people in my life who do not wash their legs in the shower.",
            "title_similarity": "0.51137376",
            "sentiment_compound": 0.0
        },
        {
            "id": "h60spmt",
            "score": 1,
            "text": "I had a roommate that said this is how me manscapes",
            "title_similarity": "0.50579613",
            "sentiment_compound": 0.0
        },
        {
            "id": "h60sr9p",
            "score": 1,
            "text": "Well this will hurt some of you but I pull my ass hairs out after I am done wiping to ensure its cleaner..\n\nEdit: spelling",
            "title_similarity": "0.71593773",
            "sentiment_compound": -0.2382
        },
        {
            "id": "h60t07c",
            "score": 1,
            "text": "I pull out my nose hair rather than using a trimmer, because it's far quicker, lasts longer, and my fingers are actually tend to cover more ground somehow",
            "title_similarity": "0.46256542",
            "sentiment_compound": 0.0
        },
        {
            "id": "h60t57n",
            "score": 1,
            "text": "A friend from school just casually mentioned that whilst he was playing Call of Duty online, and in the pre match lobby, he would watch porn. This would happen in every lobby inbetween games, so he was playing COD in a semi-hard state for hours at a time. Havn't seen him in about 5 years.",
            "title_similarity": "0.41879672",
            "sentiment_compound": 0.7884
        },
        {
            "id": "h60tut7",
            "score": 1,
            "text": "Gotta wait for the statute of limitations",
            "title_similarity": "0.29960647",
            "sentiment_compound": 0.0
        },
        {
            "id": "h60tuwr",
            "score": 1,
            "text": "My old coworker told me she plucks her pubes out. When I looked at her like she was infuckingsane,  she looked at me and said \"what? It's not a lot of hair down there.\"  Apparently that's how she did her underarms and legs too. I always think of that now when I tweeze my eyebrows.",
            "title_similarity": "0.7186836",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h60u3hf",
            "score": 33,
            "text": "That he only puts a few dollars of gas in his car at a time because he gets tired of holding the handle and he’s never figured out how to use the gas pump latch",
            "title_similarity": "0.4805384",
            "sentiment_compound": -0.4404
        },
        {
            "id": "h60ug6u",
            "score": 3,
            "text": "Shaves nipples with a steak knife he leaves in the kitchen",
            "title_similarity": "0.30032855",
            "sentiment_compound": 0.0
        },
        {
            "id": "h60us2w",
            "score": 2,
            "text": "Twisted balls or wtf is that. Was a serious medical condition requiring hospital tho.",
            "title_similarity": "0.4211982",
            "sentiment_compound": -0.6249
        },
        {
            "id": "h60uzy0",
            "score": 1,
            "text": "My friend plucks his pubes \n\nHe says they don’t grow back and he feels no pain from it anymore",
            "title_similarity": "0.61412853",
            "sentiment_compound": 0.7097
        },
        {
            "id": "h60v20r",
            "score": 1,
            "text": "My best friend told me on my birthday that he would like to cut his toes if he could.He was serious.The context was that we were talking what inhumane things we would do to our feet and I told I'd cut my big toe.He then told me that",
            "title_similarity": "0.6701189",
            "sentiment_compound": 0.7717
        },
        {
            "id": "h60v79d",
            "score": 1,
            "text": "Pulling out hair might be a form of trichotillomania.",
            "title_similarity": "0.53206253",
            "sentiment_compound": 0.0
        },
        {
            "id": "h60vl6x",
            "score": 1,
            "text": "Yanking them out, waxing, what's the difference? When you rip hair out with either method, it eventually destroys the roots and it grows back thinner.",
            "title_similarity": "0.70175433",
            "sentiment_compound": -0.5574
        },
        {
            "id": "h60vn5j",
            "score": 6,
            "text": "When I did cross country in high school, I had a friend who told me he would make himself vomit before every race. We're talking jamming two fingers deep into his throat and just vomiting everywhere. He'd normally go off into the woods to do this, but you could smell it on him when he came back. I got invited to try it, but politely declined. He was really good though, so maybe he's onto something...",
            "title_similarity": "0.6256531",
            "sentiment_compound": 0.7498
        },
        {
            "id": "h60vrex",
            "score": 7,
            "text": "Not from friends, but this one guy I knew said as a kid he \"jerked off for distance with his guy friends\".\n\nI don't remember what we were talking about, but this one guy casually said to me \"I have a beautiful cock\". \n\nIn both cases, an awkward silence came over us and I was just sitting like ???",
            "title_similarity": "0.59490633",
            "sentiment_compound": 0.8901
        },
        {
            "id": "h60vvrd",
            "score": 1,
            "text": "As long as he stays the heck away from your hairz you'll be alright",
            "title_similarity": "0.4239927",
            "sentiment_compound": 0.25
        },
        {
            "id": "h60w75y",
            "score": 5,
            "text": "My friend casually told me that he eats his belly button fluff :(",
            "title_similarity": "0.5232456",
            "sentiment_compound": 0.25
        },
        {
            "id": "h60x35i",
            "score": 12,
            "text": "Not a friend, but I remember in highschool a guy openly would take loose hairs from female students’ shirts that had fallen naturally, so he could use the hair to FLOSS HIS TEETH in class",
            "title_similarity": "0.63793635",
            "sentiment_compound": -0.7914
        },
        {
            "id": "h60xaf4",
            "score": 31,
            "text": "I asked my buddy why he had a sanding block, which is used to smooth out rough wood, in the bathroom. \"Oh that's for my feet\" as he lifts his feet up and shows us the disgusting parts he scraped off his soles and big toes. He had these monster calluses on his big toes that he scraped off with razorblades.\n\nWe took him to seidels and got his feet measured for proper shoes, and his feet got better. Homie just lived like that like it was normal.",
            "title_similarity": "0.6084329",
            "sentiment_compound": 0.1531
        },
        {
            "id": "h60z27y",
            "score": 2,
            "text": "Eats cake in a bowl filled with milk",
            "title_similarity": "0.17028308",
            "sentiment_compound": 0.0
        },
        {
            "id": "h60z2bs",
            "score": 8,
            "text": "I don’t remember how we started talking about it, but the subject was constipation. In a serious tone he said, “sometimes my shit gets stuck and I have to dig it out”",
            "title_similarity": "0.5790539",
            "sentiment_compound": -0.8338
        },
        {
            "id": "h60z2xx",
            "score": 3,
            "text": "That he jerked off not by moving his hand back and forth, but by holding his two hands clasped together in front of himself and fucking them.",
            "title_similarity": "0.4750696",
            "sentiment_compound": 0.1779
        },
        {
            "id": "h60zoyt",
            "score": 10,
            "text": "That he exploded one of his nuts as a kid. Jumping from a tree and sacking himself on the frame of a trampoline.",
            "title_similarity": "0.334585",
            "sentiment_compound": -0.3182
        },
        {
            "id": "h60zxrl",
            "score": 14,
            "text": "My friend asked me how I keep my rectum asshole area so clean and dry during the summer time months. I told him I use women’s deodorant around the rim of my assholes and now he does the same thing I do. We’re blood brothers.",
            "title_similarity": "0.5936589",
            "sentiment_compound": 0.4388
        },
        {
            "id": "h610f0r",
            "score": 4,
            "text": "Well.... I got a friend of mine who likes to put his dick in a toilet paper roll wrapped with a washing cloth and yank the shit out of himself.",
            "title_similarity": "0.6863723",
            "sentiment_compound": 0.8316
        },
        {
            "id": "h610iuk",
            "score": 13,
            "text": "A guy said for no reason, \"I'm a sadist, but not sexually\".",
            "title_similarity": "0.50836605",
            "sentiment_compound": -0.1531
        },
        {
            "id": "h610mho",
            "score": 1,
            "text": "“Does your dick ever get stuck inside you like a button? Like when you press it does it go inside and stay”\n\nI’ve never felt more sad for my friend than that day. The day I had to smile nod and go on living knowing my buddy has a micro penis",
            "title_similarity": "0.6263995",
            "sentiment_compound": 0.8004
        },
        {
            "id": "h610qnc",
            "score": 2,
            "text": "Oh man we used to use safety wire pliers in the Marines to yank out nose hair and play odds or evens. Upsetting for everyone involved",
            "title_similarity": "0.63695735",
            "sentiment_compound": 0.2732
        },
        {
            "id": "h610ui3",
            "score": 1,
            "text": "Nah nah he’s a Psycho you need to watch that guy",
            "title_similarity": "0.5435077",
            "sentiment_compound": -0.2023
        },
        {
            "id": "h610w5l",
            "score": 1,
            "text": "Is he your \"old friend\" because he told you that and you didn't want to here that?",
            "title_similarity": "0.67586577",
            "sentiment_compound": 0.4548
        },
        {
            "id": "h6112j1",
            "score": 1,
            "text": "A friend once told me that his fiance had over 100 pairs of shoes. He was quite concerned about this but was proceeding with the wedding because she was very pretty.",
            "title_similarity": "0.39533827",
            "sentiment_compound": 0.7808
        },
        {
            "id": "h6115sa",
            "score": 1,
            "text": "Here's one to give you nightmares....\n\nI pluck my nose hair.\n\nShaving leaves stubble inside the nose which gets uncomfortable when it grows back to a certain length. Plucking lasts so much longer.",
            "title_similarity": "0.6206321",
            "sentiment_compound": -0.128
        },
        {
            "id": "h611tz0",
            "score": 29,
            "text": "One of my friends dated a guy for a month before she realized he had one hand. \n\nHe was apparently good at hiding it, lmao",
            "title_similarity": "0.5885816",
            "sentiment_compound": 0.8979
        },
        {
            "id": "h6137wt",
            "score": 1,
            "text": "My friend told me he takes ***all*** his clothes off while he takes a shit.\n\nThen I went on Reddit and saw that more than one person does that. Isn't that a lot of work? LOL",
            "title_similarity": "0.7799531",
            "sentiment_compound": 0.4824
        },
        {
            "id": "h613c5j",
            "score": 1,
            "text": "I do the same thing with my ass hair",
            "title_similarity": "0.362045",
            "sentiment_compound": -0.5423
        },
        {
            "id": "h613f60",
            "score": 1,
            "text": "A friend of mine told me he doesn’t flush toilet paper down the drain. Instead he throws it in the garbage in the washroom after wiping. Even when I told him it’s safe to flush he’s too stubborn to change. So we just make fun of him now",
            "title_similarity": "0.6807945",
            "sentiment_compound": 0.7717
        },
        {
            "id": "h613uox",
            "score": 1,
            "text": "That’s OK I use a lighter to get rid of nose hairs",
            "title_similarity": "0.5012109",
            "sentiment_compound": 0.4466
        },
        {
            "id": "h6140e8",
            "score": 1,
            "text": "That he tied a string around his sack, and tightened it more every day as self punishment for having sex outside of the relationship without his girl present...\nCan I use your bathroom?",
            "title_similarity": "0.6441888",
            "sentiment_compound": -0.4939
        },
        {
            "id": "h6140tv",
            "score": 1,
            "text": "Old roommate told me he keeps two sticks of deodorant… one for the normal reason, and one for his poop-shoot.",
            "title_similarity": "0.604282",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6143zs",
            "score": 5,
            "text": "When I was in 7th grade this girl told us how she put peanut butter on her vagina and let her dog lick it… I didn’t believe it at all until literally 3 years ago (I’m in my late 20s now) when my then roommate hung out with her AND SHE CONFIRMED THE WHOLE FUCKING THING. Turns out she did it multiple times and got caught by her mom.",
            "title_similarity": "0.45774734",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6146mu",
            "score": 4,
            "text": "One of my ex-friend's told me he didn't like black people. When questioned, he just said he didn't like them. He was also proud of his great grandpa being a high ranking member in the kkk. The rest of us are no contact with him now.",
            "title_similarity": "0.63976675",
            "sentiment_compound": 0.3356
        },
        {
            "id": "h614uyc",
            "score": 4,
            "text": "He got really excited telling me 16 is the age of consent where he had moved. I am a woman.",
            "title_similarity": "0.3673818",
            "sentiment_compound": 0.5563
        },
        {
            "id": "h615na8",
            "score": 1,
            "text": "Oh I watched an old college teammate casually peel off his sunburnt skin then chew on it, apparently his dad does it too",
            "title_similarity": "0.5764786",
            "sentiment_compound": 0.1779
        },
        {
            "id": "h615xr7",
            "score": 1,
            "text": "same thing but with butthole hair",
            "title_similarity": "0.37323955",
            "sentiment_compound": 0.0
        },
        {
            "id": "h615ybu",
            "score": 1,
            "text": "A good friend/former roommate microwaves his cereal milk",
            "title_similarity": "0.38920972",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h615yv1",
            "score": 2,
            "text": "They share toothbrushes and panties",
            "title_similarity": "0.38798073",
            "sentiment_compound": 0.296
        },
        {
            "id": "h61614m",
            "score": 18,
            "text": "A friend told me he made is dog lick his dick by smearing smear-sausage on it :(. The dog bit into it…",
            "title_similarity": "0.5376929",
            "sentiment_compound": -0.0258
        },
        {
            "id": "h6161ef",
            "score": 1,
            "text": "Isn't this just waxing?",
            "title_similarity": "0.38628304",
            "sentiment_compound": 0.0
        },
        {
            "id": "h61662r",
            "score": 1,
            "text": "Had a buddy tell my friend group he sits down to pee every time he uses the bathroom. After everyone looked at him astonished he backtracked and was like “well I mean I don’t sit down EVERY time” with a nervous look on his face",
            "title_similarity": "0.6046587",
            "sentiment_compound": 0.7351
        },
        {
            "id": "h616fo8",
            "score": 1,
            "text": "A lad I met through a friend of mine who doesn’t really drink got drunk he said he sticks his toothbrush up his arse and still uses it,a kitchen funnel and door handles sometimes, yeah we don’t see Glenn no more",
            "title_similarity": "0.6402161",
            "sentiment_compound": 0.1621
        },
        {
            "id": "h616jza",
            "score": 1,
            "text": "Plucking underarm hairs? That's amateur. \n\nI get mine lasered and waxed",
            "title_similarity": "0.60025096",
            "sentiment_compound": 0.0
        },
        {
            "id": "h616lj9",
            "score": 2,
            "text": "Good friend of mine randomly dropped into a conversation that he wipes back to front...\n\nLiterally moves his balls to one side and wipes his ass",
            "title_similarity": "0.7093712",
            "sentiment_compound": 0.3818
        },
        {
            "id": "h616lyl",
            "score": 6,
            "text": "An old friend said casually in conversation when wiping his butt he'd stick his finger in his hole to the first knuckle and rotate to clean just inside. He was very adamant that was the normal way to clean and was shocked when he found out no one else, in our group, did it. Still think about that one from time to time.",
            "title_similarity": "0.69312036",
            "sentiment_compound": 0.7003
        },
        {
            "id": "h616pu3",
            "score": 59,
            "text": "He poops with the toilet seat up.\n\nI haven't begun to understand the mechanics.",
            "title_similarity": "0.48234785",
            "sentiment_compound": 0.0
        },
        {
            "id": "h61703t",
            "score": 1,
            "text": "Why wouldn't he just shave his arm?",
            "title_similarity": "0.55561095",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6175g8",
            "score": 1,
            "text": "“I pluck my duck” (scrotum)",
            "title_similarity": "0.465662",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6176nb",
            "score": 1,
            "text": "I had a co-worker be amazed that he was the only one who uses an entire soapy finger to clean the inside of his butt hole every shower.",
            "title_similarity": "0.4960153",
            "sentiment_compound": 0.7096
        },
        {
            "id": "h6178j1",
            "score": 3,
            "text": "My friend told me he doesn't wash his water bottles like at all because it's just water and all he does is let it air dry. Whenever I did drink our of his bottles there is always a weird smell and taste. Never doing that again.",
            "title_similarity": "0.61703444",
            "sentiment_compound": 0.6124
        },
        {
            "id": "h617cms",
            "score": 9,
            "text": "Friend from college. Out of the blue at a party asks \"You ever taste your own cum? You know, just to see what it's like?\"\n\nBefore I could say no, he went on to add \"I did one time, just to check it out. It wasn't that bad.\"\n\nThanks Simon.",
            "title_similarity": "0.5524897",
            "sentiment_compound": 0.8483
        },
        {
            "id": "h617dd3",
            "score": 1,
            "text": "I have alopecia universalis and get a few isolated pubes once in awhile. I also just pull them out.",
            "title_similarity": "0.5310685",
            "sentiment_compound": -0.3182
        },
        {
            "id": "h617lem",
            "score": 1,
            "text": "Friend told me that he got head once and I freaked out and literally had to say \"please stop telling me this\" because I never really talk about this with any of my guy friends.",
            "title_similarity": "0.60504866",
            "sentiment_compound": 0.6369
        },
        {
            "id": "h6185m8",
            "score": 1,
            "text": "yanking nose hairs. and it causes super strong triple sneezes",
            "title_similarity": "0.37223643",
            "sentiment_compound": 0.802
        },
        {
            "id": "h618ojb",
            "score": 2,
            "text": "My homie rips his nails instead of trimming them\nIt makes me so mad",
            "title_similarity": "0.58932537",
            "sentiment_compound": -0.6269
        },
        {
            "id": "h6193so",
            "score": 1,
            "text": "I do the armpit hair thing too sometimes. Done it in my sleep without even realizing it.",
            "title_similarity": "0.49459308",
            "sentiment_compound": 0.0
        },
        {
            "id": "h619i00",
            "score": 1,
            "text": "\"Have you ever thought about the perfect way to murder someone?\"\nme: \"no, not really\"\n\"I don't mean someone in particular, just like the ideal situation for murdering someone...\" then I got to hear their ideal situation.",
            "title_similarity": "0.5940789",
            "sentiment_compound": 0.4588
        },
        {
            "id": "h619ul9",
            "score": 20,
            "text": "I was catching up with some friends recently and one of them asked me if I was still single and I responded saying I was, then one of my other friends nochalantly said \"well thats not suprising\" and the conversation moved on as if everyone just sort of agreed. I was so shocked by it that I had no idea what to say at the time but its really been eating away at me since.",
            "title_similarity": "0.59481055",
            "sentiment_compound": 0.3523
        },
        {
            "id": "h619vqm",
            "score": 1,
            "text": "That he's an 'ex-cheese man'. He was referring to his dick, and the state it apparently used to be in. No one asked for him to tell us this, but he did anyway. The same friend loudly declared down a group phone call that he had taken a shit and wiped his arse so hard it was now bleeding. None of us knew he was even on the toilet at the time.",
            "title_similarity": "0.6797906",
            "sentiment_compound": -0.6858
        },
        {
            "id": "h619xb8",
            "score": 1,
            "text": "That's dangerous ingrown hairs will get infected. Don't ask how i know ...",
            "title_similarity": "0.55404735",
            "sentiment_compound": -0.743
        },
        {
            "id": "h619yzl",
            "score": 1,
            "text": "my friend i used to have a crush on in hs been sleeping with a guy who doesn't bathe or shower regularly\n\nlike girl im sorry\n\ni don't care what your relationship problems are but i show hoes more respect than that lmao",
            "title_similarity": "0.5898724",
            "sentiment_compound": 0.8928
        },
        {
            "id": "h61aekh",
            "score": 1,
            "text": "My husband rips out itchy mustache hairs all the time and it makes me want to blow my brains out",
            "title_similarity": "0.6034187",
            "sentiment_compound": -0.2023
        },
        {
            "id": "h61ao2b",
            "score": 1,
            "text": "I do that with my nose hair.",
            "title_similarity": "0.3850548",
            "sentiment_compound": 0.0
        },
        {
            "id": "h61b7n2",
            "score": 2,
            "text": "A friend of mine revealed he used that same method for his butt hole hairs...",
            "title_similarity": "0.6100137",
            "sentiment_compound": 0.4939
        },
        {
            "id": "h61bqqt",
            "score": 1,
            "text": "I can't say much, I've done the same with nose hair.",
            "title_similarity": "0.45444682",
            "sentiment_compound": 0.0
        },
        {
            "id": "h61c2cq",
            "score": 1,
            "text": "We had just left a hotspring in Japan when my friend told me he peed in there after the rest of us had gotten out. There was a bathroom like 10 feet away",
            "title_similarity": "0.5891292",
            "sentiment_compound": 0.6908
        },
        {
            "id": "h61c9i9",
            "score": 1,
            "text": "That they tape their nipples to go snowboarding\n\nRunning, yes; even old-man-no-shoulder-pads hockey, yes (hockey mesh ain't that soft).  But it's completely preventable when layering",
            "title_similarity": "0.49674582",
            "sentiment_compound": 0.4019
        },
        {
            "id": "h61cev9",
            "score": 1,
            "text": "Sounds like a compulsive or neurotic disorder.",
            "title_similarity": "0.34561712",
            "sentiment_compound": -0.3818
        },
        {
            "id": "h61crd5",
            "score": 1,
            "text": "My cousin told me she rips her eyelashes out when she's stressed. I never realized but upon further inspection, she does indeed not have eye hair. Makes my stomach uncomfortable :/",
            "title_similarity": "0.60341203",
            "sentiment_compound": -0.802
        },
        {
            "id": "h61csu6",
            "score": 15,
            "text": "Not so much told me but a workmate walked up and said \"hey bro! Got any pliers\" so passed him said pliers, he then puts the pliers on his tooth and pulls out a fucking huge tooth that was givin him grief, he simply said \"shot bro, fuck paying a couple hundy for  that shit\".",
            "title_similarity": "0.62755156",
            "sentiment_compound": -0.9162
        },
        {
            "id": "h61dg6q",
            "score": 1,
            "text": "I call these “serial killer tendencies”.\n\nMy wife picks at her cuticles till they bleed.",
            "title_similarity": "0.59902036",
            "sentiment_compound": -0.6486
        },
        {
            "id": "h61dkoy",
            "score": 85,
            "text": "I had a friend tell me in middle school that they eat what comes out when they pop their zits. It changed me.",
            "title_similarity": "0.55250704",
            "sentiment_compound": 0.4939
        },
        {
            "id": "h61dus7",
            "score": 1,
            "text": "“What! I can’t believe you pay THAT much for new car tires. I just buy mine used.”",
            "title_similarity": "0.5584731",
            "sentiment_compound": -0.1759
        },
        {
            "id": "h61duur",
            "score": 2,
            "text": "This is me, not a friend, but I pull out my nose and ear hairs with my fingers.",
            "title_similarity": "0.671304",
            "sentiment_compound": -0.2057
        },
        {
            "id": "h61e8h0",
            "score": 1,
            "text": "There's such a thing as an epilator that is basically an electric tweezer... just sayin'",
            "title_similarity": "0.30859733",
            "sentiment_compound": 0.0
        },
        {
            "id": "h61e8k5",
            "score": 1,
            "text": "Not a friend, but a coworker said he still bathes his daughter. She is 14.",
            "title_similarity": "0.49267077",
            "sentiment_compound": -0.2057
        },
        {
            "id": "h61eabt",
            "score": 1,
            "text": "Same shit but it was butthole hair",
            "title_similarity": "0.45471513",
            "sentiment_compound": -0.3182
        },
        {
            "id": "h61efwx",
            "score": 1,
            "text": "A friend of mine has been in a sexual relationship with his cousin for years, apparently. I saw a picture that she was in, snarkily commented about how she was cute, and he just agreed. I didn't even ask about their relationship, he just casually mentioned that they usually end up having sex when they meet.\n\nI'm still not sure how to feel about that.",
            "title_similarity": "0.57568455",
            "sentiment_compound": 0.7928
        },
        {
            "id": "h61eg48",
            "score": 1,
            "text": "I had a friend tell me he liked the taste of his fingers after wiping. Needless to say I never touched his hands after that.",
            "title_similarity": "0.6838994",
            "sentiment_compound": 0.7184
        },
        {
            "id": "h61ehot",
            "score": 1,
            "text": "My husband does the same thing, only with taint and ball hairs. Only he didn't tell me, I saw it happen one day and was like, \"wtf did you just do.\" And then proceeded to tell me as he did it again and showed me the clump of hairs he pulled. The entire time acting.like it was no big deal as I silently screamed.",
            "title_similarity": "0.6908634",
            "sentiment_compound": -0.7003
        },
        {
            "id": "h61eiou",
            "score": 1,
            "text": "Talking to this dude about monogamy or something, and he casually mentioned that he likes to have as much sex with married women as possible because they \"never actually are monogamous\". I'm just like, bro, first you're lying to try and sound badass, second, if that's true then both you and her are assholes.",
            "title_similarity": "0.6342212",
            "sentiment_compound": 0.4588
        },
        {
            "id": "h61f6w6",
            "score": 3,
            "text": "I used to know a cop in El Paso we were at a junkyard he came in in the evening to get drunk with us and told us his maid who is now his wife likes it when he has anal sex with Vicks vapor rub",
            "title_similarity": "0.5721935",
            "sentiment_compound": 0.1027
        },
        {
            "id": "h61fhzg",
            "score": 2,
            "text": "A good friend of mine told me his girlfriend likes to listen to him using the restroom. Tells him he can't take his phone in and makes him leave the a.c. off.",
            "title_similarity": "0.6635095",
            "sentiment_compound": 0.8271
        },
        {
            "id": "h61fjy8",
            "score": 25,
            "text": "My mate told me he puts chocolate buttons in his mash potato. I nearly lost it.",
            "title_similarity": "0.53309214",
            "sentiment_compound": -0.3182
        },
        {
            "id": "h61g3hm",
            "score": 1,
            "text": "A friend told me he used to watch porn with his friend when he was younger. Then followed up by letting me know they used to both jerk the gherkin while watching together on the couch. 😬😱😨",
            "title_similarity": "0.5358554",
            "sentiment_compound": -0.7506
        },
        {
            "id": "h61gif4",
            "score": 11,
            "text": "Ex husband used to yank his toenails out w pliers rather than clip/cut them.",
            "title_similarity": "0.651422",
            "sentiment_compound": 0.0
        },
        {
            "id": "h61gsol",
            "score": 1,
            "text": "I do that with nasal hairs but your oxters. Jesus",
            "title_similarity": "0.5719409",
            "sentiment_compound": 0.0
        },
        {
            "id": "h61gzsz",
            "score": 1,
            "text": "Was his name omar?? Hs friend used to do this lol",
            "title_similarity": "0.5562665",
            "sentiment_compound": 0.7789
        },
        {
            "id": "h61h7ve",
            "score": 1,
            "text": "I nearly spat my coffee. What a weird guy?",
            "title_similarity": "0.5290276",
            "sentiment_compound": -0.1779
        },
        {
            "id": "h61hlcq",
            "score": 1,
            "text": "Friend - \"I'm legally psychotic\"\n\nMe - \"Girl, you should not tell people that\"",
            "title_similarity": "0.54431427",
            "sentiment_compound": 0.5574
        },
        {
            "id": "h61i0m0",
            "score": 3,
            "text": "A guy I knew had a thing for armpits. He told me: \"I like sniffing armpits because it smells like vagina.\" I asked how he went about sniffing women's armpits (he was straight and we were talking about women) and he says, \"Oh, I just smell my own armpits and imagine it.\" \n\n¯\\\\\\_(ツ)\\_/¯",
            "title_similarity": "0.63210654",
            "sentiment_compound": 0.7096
        },
        {
            "id": "h61i108",
            "score": 1,
            "text": "My friend bites his nails then puts the nail shards in his pocket to chew on later.",
            "title_similarity": "0.5193986",
            "sentiment_compound": 0.4939
        },
        {
            "id": "h61i549",
            "score": 1,
            "text": "My best mate doesn't always wash his hands when he owes, cos it's \"not always necessary\"\n\nIn other respects he's a great guy. Don't share crisps with him though.",
            "title_similarity": "0.54625165",
            "sentiment_compound": 0.8661
        },
        {
            "id": "h61i9ke",
            "score": 1,
            "text": "Guy I knew casually told me once that when he was younger, his brother and his brother’s friend had coaxed him into group masturbation. He never spoke another word about it.",
            "title_similarity": "0.61212635",
            "sentiment_compound": 0.5994
        },
        {
            "id": "h61ia5c",
            "score": 1,
            "text": "obligatory i-told-my-friends-this: ive been curious about death from a very young age and have been collecting bones for my whole life.",
            "title_similarity": "0.365688",
            "sentiment_compound": -0.3818
        },
        {
            "id": "h61ib8a",
            "score": 1,
            "text": "My former friend told me that in order not to ejaculate too fast when he's in bed, he thinks about his grandmother.",
            "title_similarity": "0.51720434",
            "sentiment_compound": 0.4939
        },
        {
            "id": "h61if7y",
            "score": 3,
            "text": "A while ago, but a friend told me he ate Mayo with a spoon.",
            "title_similarity": "0.46126026",
            "sentiment_compound": 0.6486
        },
        {
            "id": "h61iwvn",
            "score": 44,
            "text": "My buddy once looked at me straight faced and asked “yo have you ever shit with your asshole fully submerged in water?”",
            "title_similarity": "0.5983574",
            "sentiment_compound": -0.4019
        },
        {
            "id": "h61j3kv",
            "score": 1,
            "text": "One male friend excitedly talking about how he masturbated and ejaculated on our other male friend while he was sleeping during a sleepover in what I remember to be early high school. Brutal. Kept my distance after that one.",
            "title_similarity": "0.53863645",
            "sentiment_compound": 0.6808
        },
        {
            "id": "h61ju8b",
            "score": 6,
            "text": "[deleted]",
            "title_similarity": "0.336526"
        },
        {
            "id": "h61jup5",
            "score": 1,
            "text": "I'll one up you... My bf casually gets rid of his nose hairs by yanking them out. \n\nAlso does this with his sideburn hairs, he has a slight bald patch on one side of his face.",
            "title_similarity": "0.8190338",
            "sentiment_compound": 0.1779
        },
        {
            "id": "h61kfxh",
            "score": 2,
            "text": "That both my best friends have a thing for feet. I still love them, but I just don’t understand it.",
            "title_similarity": "0.464114",
            "sentiment_compound": 0.7391
        },
        {
            "id": "h61klz2",
            "score": 1,
            "text": "My cousin used to rip his eye lashes out as a child... his parents had a nasty divorce that caused some pretty major psychological issues of which him ripping his lashes out were the least of",
            "title_similarity": "0.6631458",
            "sentiment_compound": -0.1027
        },
        {
            "id": "h61l0uk",
            "score": 2,
            "text": "My boyfriend has lovely thick eyelashes - he thinks they are too thick and sometimes pulls them out! 😫",
            "title_similarity": "0.5541142",
            "sentiment_compound": 0.2942
        },
        {
            "id": "h61lg32",
            "score": 10,
            "text": "I have a friend… and After he uses the restroom and is wiping himself, he likes to smell the toilet paper after each wipe…. I’ll never forget",
            "title_similarity": "0.61770165",
            "sentiment_compound": 0.5371
        },
        {
            "id": "h61lt4j",
            "score": 2,
            "text": "I once knew a guy who fucked a dog.\n\nAnd then his cousin.\n\nEverytime I see him I feel like I am being preyed upon.",
            "title_similarity": "0.6315477",
            "sentiment_compound": -0.4404
        },
        {
            "id": "h61lwq0",
            "score": 1,
            "text": "That he never rinses his razor clean after he finished shaving. He just wets it once before and at the end of each shave. it until it’s so clogged with hair that it doesn’t work anymore. He shaves everything using the same razor.",
            "title_similarity": "0.58602",
            "sentiment_compound": 0.4019
        },
        {
            "id": "h61m5b8",
            "score": 3,
            "text": "I was playing apex with my friends (a dude and a girl), the male friend just casually told us that after he masturbate he just smears his cum all over his body",
            "title_similarity": "0.5825583",
            "sentiment_compound": 0.8316
        },
        {
            "id": "h61m7cc",
            "score": 1,
            "text": "I remember someone casually saying that they jack off with egg yolk saying it’s healthier, we all said something about getting salmonella that way. Interesting creatures we were.",
            "title_similarity": "0.45836663",
            "sentiment_compound": 0.5267
        },
        {
            "id": "h61m85c",
            "score": 2,
            "text": "Back in grade 9 one kid legitimately believed that if you touched your asshole you’d become gay. \n\nWhat this meant is that he didn’t really wipe and couldn’t do much physical activity because of chafing. There was also the smell…",
            "title_similarity": "0.5649384",
            "sentiment_compound": 0.0
        },
        {
            "id": "h61meyq",
            "score": 1,
            "text": "On a similar note. I pull my nose hairs out with pliers or my fingers if I don’t have pliers. Everyone I’ve told that gives me the same confused and horrified look.",
            "title_similarity": "0.6388497",
            "sentiment_compound": -0.7003
        },
        {
            "id": "h61mfgu",
            "score": 2,
            "text": "One of my best friends saying that he fully intends to be dead by 50.",
            "title_similarity": "0.48286375",
            "sentiment_compound": 0.4588
        },
        {
            "id": "h61mhu7",
            "score": 2,
            "text": "My friends from Dundalk told me they put rubber boots on farm animals so they can't run away when they fuck them, mainly just goats",
            "title_similarity": "0.43159425",
            "sentiment_compound": -0.1027
        },
        {
            "id": "h61ne22",
            "score": 1,
            "text": "We were at a  party. We were literally fucked up. I mean we couldn't walk straight. We were laughing and shit. There must have been about 10 girls and my buddies (15 boys). He Is my best mate.... He disappeared for a couple of minutes. I tried to find him but didn't tried as my legs were heavy. He comes out from a room with his belt in his hand and tells me he took a shit in the room as the bathroom was dirty and had a long line.\n\nI remember going to see just for a joke.... It was a nightmare. He must have had a food poisoning because there was puke and liquit shit.... And there was a lot. All the while he was smiling. I still remember the smell.",
            "title_similarity": "0.59438336",
            "sentiment_compound": -0.9391
        },
        {
            "id": "h61nfrq",
            "score": 30,
            "text": "[deleted]",
            "title_similarity": "0.336526"
        },
        {
            "id": "h61nnit",
            "score": 1,
            "text": "Fuck i do the exact same thing",
            "title_similarity": "0.1299878",
            "sentiment_compound": -0.5423
        },
        {
            "id": "h61nug3",
            "score": 3,
            "text": "I rip out my nose hairs. Love that eye watering pain. But not obsessively, just when one gets too long and starts waving in the wind and itching my nose.",
            "title_similarity": "0.59562135",
            "sentiment_compound": 0.2249
        },
        {
            "id": "h61o2gs",
            "score": 1,
            "text": "My best pal told me when we were young that he likes using the toilet after his dad because the seat is warm. Messed me up for a long time",
            "title_similarity": "0.5710603",
            "sentiment_compound": 0.7579
        },
        {
            "id": "h61oe1r",
            "score": 1,
            "text": "Had a friend tell me he once shit his pants on purpose just to see what it was like. Said he did it, washes himself up, and went to bed ashamed of himself at like 6pm.",
            "title_similarity": "0.62913597",
            "sentiment_compound": 0.128
        },
        {
            "id": "h61p8xl",
            "score": 8,
            "text": "Hello, friend.\n\nWhen I can easily reach and see them, I burn protruding moles with a cigarette lighter. A day or 2 later, I rub the area and a razor blade with alcohol. Then I cut the mole off. Then I sear that area of my skin again with the cigarette lighter.\n\nEDIT: The initial burn and wait for a day or 2 is to make sure the tissue is dead. Probe with a sterilized needle before attempting to cut. This has 2 purposes: 1) let's you know if the cutting will hurt. If the mole was thoroughly burnt, there should be little to no pain from the needle probe or the cutting. (2) Let's you know how much it's gonna bleed. Again, if it was thoroughly burned, there should be little to no bleeding.",
            "title_similarity": "0.56382924",
            "sentiment_compound": -0.687
        },
        {
            "id": "h61ph21",
            "score": 2,
            "text": "Driving with both feet. Sometimes he crossed them too.",
            "title_similarity": "0.2993269",
            "sentiment_compound": 0.0
        },
        {
            "id": "h61pyin",
            "score": 12,
            "text": "That she lets her dog lick her nipples after she showers",
            "title_similarity": "0.39907002",
            "sentiment_compound": 0.0
        },
        {
            "id": "h61q0g4",
            "score": 1,
            "text": "My nose and I will see our way out now.",
            "title_similarity": "0.3244143",
            "sentiment_compound": 0.0
        },
        {
            "id": "h61q6et",
            "score": 2,
            "text": "He uses an old straightend paper clip to get stuff out of his teeth.",
            "title_similarity": "0.5644196",
            "sentiment_compound": 0.0
        },
        {
            "id": "h61qs7t",
            "score": 2,
            "text": "My buddy told me that my wife sucks at sex 🤔",
            "title_similarity": "0.6513257",
            "sentiment_compound": -0.3612
        },
        {
            "id": "h61r3ci",
            "score": 1,
            "text": "We were all in the car, discussing the bubble tea we just bought. I mention that I don’t like the bubbles too chewy.\n\nMy friend goes “Wait… you’re supposed to chew them?”\n\nDudes been swallowing boba whole for years!",
            "title_similarity": "0.6119075",
            "sentiment_compound": 0.7177
        },
        {
            "id": "h61r9lz",
            "score": 2,
            "text": "I do this with nose hairs when they are ready irritating me.",
            "title_similarity": "0.59104365",
            "sentiment_compound": -0.128
        },
        {
            "id": "h61s6as",
            "score": 2,
            "text": "Dinner with friends and told them while I was at work I absentmindedly blew my nose into my COVID mask. They were pretty disgusted. Masks are still mandatory where I am so I had to wear it a while afterwards. Pretty yuk.",
            "title_similarity": "0.65063137",
            "sentiment_compound": 0.7506
        },
        {
            "id": "h61smsk",
            "score": 1,
            "text": "Friend of mine in middle school casually told me that he has masturbation competitions with his friends under the same blanket.",
            "title_similarity": "0.4997375",
            "sentiment_compound": 0.7906
        },
        {
            "id": "h61tp6f",
            "score": 2,
            "text": "My friend asked me if I also store food in my cheeks for later like a hamster.",
            "title_similarity": "0.49794006",
            "sentiment_compound": 0.6908
        },
        {
            "id": "h61tuon",
            "score": 3,
            "text": "A woman here, however, the man I spoke to admitted to eating his own seed.",
            "title_similarity": "0.49806505",
            "sentiment_compound": 0.1027
        },
        {
            "id": "h61u4nj",
            "score": 1,
            "text": "I pluck my eyelashes with a tweezer until I get them all.  Don't judge...",
            "title_similarity": "0.5260502",
            "sentiment_compound": 0.0
        },
        {
            "id": "h61ub3q",
            "score": 1,
            "text": "Some of y’all have friends training to evilly take over the world.",
            "title_similarity": "0.6023197",
            "sentiment_compound": -0.3182
        },
        {
            "id": "h61ucui",
            "score": 2,
            "text": "Dude was saying something about eating his cum after masturbating and we were like \"wait wut you eat it?\" and he was like \"you don't??\"",
            "title_similarity": "0.553732",
            "sentiment_compound": 0.6747
        },
        {
            "id": "h61ujqq",
            "score": 1,
            "text": "Butter",
            "title_similarity": "0.1447834",
            "sentiment_compound": 0.0
        },
        {
            "id": "h61urig",
            "score": 1,
            "text": "My friend bites into kitkats…. She doesn’t even break them apart.",
            "title_similarity": "0.29166347",
            "sentiment_compound": 0.4939
        },
        {
            "id": "h61v8j1",
            "score": 9,
            "text": "My friend and roommate, who shares a bathroom with one of my other roommates, noted that his preferred method of discharging his seed during alone time was to use “a flat surface,” therefore, the bathroom counter. \n\nHe is confident that his method allowed for easier cleanup afterwards.",
            "title_similarity": "0.588584",
            "sentiment_compound": 0.8555
        },
        {
            "id": "h61vsx2",
            "score": 2,
            "text": "my friend told me she reffers to her foot warts as 'little cauliflower holes'.",
            "title_similarity": "0.58240426",
            "sentiment_compound": 0.4939
        },
        {
            "id": "h61vz7g",
            "score": 2,
            "text": "An ex gf, upon watching me pee for the first time, was shocked that I didn’t wipe my dick at the end. She went on to INSIST that most men do and I was doing it wrong. Like, it turned into a fight.",
            "title_similarity": "0.6656192",
            "sentiment_compound": -0.8316
        },
        {
            "id": "h61w6u0",
            "score": 1,
            "text": "\"Your crush doesn't like you.\"",
            "title_similarity": "0.5094471",
            "sentiment_compound": -0.4039
        },
        {
            "id": "h61war2",
            "score": 2,
            "text": "Dang, I do that with nose hair.",
            "title_similarity": "0.40038005",
            "sentiment_compound": 0.0
        },
        {
            "id": "h61wcbr",
            "score": 2,
            "text": "I yank my nose hairs out.",
            "title_similarity": "0.51215094",
            "sentiment_compound": 0.0
        },
        {
            "id": "h61wn2m",
            "score": 2,
            "text": "Had a roommate once who casually came out to me as bisexual by offering me a blowjob.",
            "title_similarity": "0.58965254",
            "sentiment_compound": 0.1779
        },
        {
            "id": "h61x06s",
            "score": 2,
            "text": "Dude I know casually told me he was expelled from his high school for ripping out a bunch of pubes and then sprinkling them all over the girl next to him and all her school work. Have asked people who knew him back then and they confirmed. Apparently he didn’t know the girl at all and sprinkled the pubes like they were fairy dust.",
            "title_similarity": "0.6509323",
            "sentiment_compound": 0.296
        },
        {
            "id": "h61x5fw",
            "score": 5,
            "text": "He has never sat down to take a shit. Always crouches over the toilet and hovers.",
            "title_similarity": "0.24661188",
            "sentiment_compound": -0.5574
        },
        {
            "id": "h61x7jj",
            "score": 2,
            "text": "\"why don't you pee on the sink, isn't it normal for everyone?\"",
            "title_similarity": "0.44038463",
            "sentiment_compound": 0.0
        },
        {
            "id": "h61xa32",
            "score": 1,
            "text": "My friend eats the entire peanut. Shell and all.",
            "title_similarity": "0.2967355",
            "sentiment_compound": 0.4939
        },
        {
            "id": "h61xv33",
            "score": 2,
            "text": "I pluck chest and arm hair and put it on the head of one of our cats.\n\nPayback for all the cat hair.",
            "title_similarity": "0.45147562",
            "sentiment_compound": 0.0
        },
        {
            "id": "h61yroj",
            "score": 1,
            "text": " Did he mean his own, or that of someone else?",
            "title_similarity": "0.37784228",
            "sentiment_compound": 0.0
        },
        {
            "id": "h61yyrv",
            "score": 1,
            "text": "My best friend as a kid used to collect her Dads toenail clippings. Not only did she tell me, she showed me.",
            "title_similarity": "0.5470581",
            "sentiment_compound": 0.8126
        },
        {
            "id": "h61znn2",
            "score": 1,
            "text": "Was driving to stay with a college buddy of mine a few years after graduating. 2 hr drive but whatever this dude is one of my best friends. \n\nI’m about 30 minutes out and he calls me and says. He left the key “under the mat” for me. No big deal, used to happen all the time. Around an hour after being there I call him to see what was up. Apparently I had missed a text that came through right as I answered his call, he was going to another close by city for the night to smash some chick he used to date. Saw no problem with it. \n\nTinder can really fix a boring night, just as well as it can ruin one.",
            "title_similarity": "0.58405334",
            "sentiment_compound": 0.3273
        },
        {
            "id": "h61zst9",
            "score": 1,
            "text": "That he REALLY likes getting kicked in the balls. There was no lead up to this. We were talking about something as mundane as the weather, and he starts talking about it. Alexa, how do I unhear something?",
            "title_similarity": "0.6028584",
            "sentiment_compound": 0.3871
        },
        {
            "id": "h61zxc1",
            "score": 1,
            "text": "Why do you think it's upsetting? It might be weird since it is less painful to shave but not upsetting",
            "title_similarity": "0.4929242",
            "sentiment_compound": 0.0329
        },
        {
            "id": "h620i1p",
            "score": 1,
            "text": "Ehmmmm. I do too",
            "title_similarity": "0.10205042",
            "sentiment_compound": 0.0
        },
        {
            "id": "h620ih5",
            "score": 15,
            "text": "Not sure how to explain this, but a long time ago my friend asked me \"How do you roll your dick to make it feel good?\" When I asked what the fuck he meant. He pulled out a banana. Held it with both hands flat against it in either side, and starting rolling it in his his flat hands.  Asking me the same question again.\n\nTurns out he was asking why it didn't feel good to masturbate. And this guy's just rolling it around like a piece of blu tac you roll into a sausage shape.",
            "title_similarity": "0.57315695",
            "sentiment_compound": -0.3378
        },
        {
            "id": "h620prs",
            "score": 2,
            "text": "Had a coworker tell me that he had a growth on his leg that was bothering him, and then a week later told me he had taken care of it. I thought initially that he went to the doctor. Nope! He went into detail of how he just swabbed the area with numbing spray and cut it the fuck out by himself, then sewed it back up. Said it was the size of a half dollar or so.",
            "title_similarity": "0.658617",
            "sentiment_compound": -0.5848
        },
        {
            "id": "h621odu",
            "score": 2,
            "text": "If we're sharing, I do something similar with the hair that grows around my nipples.",
            "title_similarity": "0.3236091",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h621pp0",
            "score": 12,
            "text": "That him and his younger brother share the same Fleshlight.",
            "title_similarity": "0.41639435",
            "sentiment_compound": 0.296
        },
        {
            "id": "h6227e0",
            "score": 2,
            "text": "One of my friends told me he'd beat his gf if he ever caught her taking $$ out of his wallet, that kinda freaked me out",
            "title_similarity": "0.61852753",
            "sentiment_compound": 0.2944
        },
        {
            "id": "h622rqh",
            "score": 1,
            "text": "Friend of mine partially overheard me talking about the man with the golden gun, scaramanger and his third nipple. She turned around with an angry look on her face, asked me who told me, then realised I wasn't talking about her, that I had no idea she had a supernumerary nipple and turned around real quick, embarrassed that she had let it slip to the entire minibus that she had (at least) 3 nipples.",
            "title_similarity": "0.6258329",
            "sentiment_compound": -0.7351
        },
        {
            "id": "h622w37",
            "score": 1,
            "text": "I can't tell you",
            "title_similarity": "0.16717643",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6234of",
            "score": 2,
            "text": "So we were at a bachelor party and somehow the topic of  \"how do you wipe\" came up. One guy said he doesn't understand how some people, after they finish their business, stand up and then wipe. \n\nNow out of the half a dozen or so of us, at least 2 guys just blankly starred at him as if he was asking the most ridiculous question and vigorously defended the procedure of standing up and then wiping their buttholes... \n\nThey were roasted endlessly for the rest of trip.\n\nI sometimes bring it up in similar company and we (including the staunch defenders of the stand n' wipe) have a good laugh.",
            "title_similarity": "0.6519635",
            "sentiment_compound": 0.8024
        },
        {
            "id": "h625sb2",
            "score": 9,
            "text": "My friend often tells me about forgetting little things and it frustrates me every time. He leaves his fridge/freezer door open, forgets things like ID and his wallet and his phone, he’s always getting into trouble while driving. He borrowed a backpack from me once that was filled with my stuff and left it on the train. He once even left for work and didn’t even close his front door. Honestly.\n\n\nEdit: he also shits himself more often than a grown man should.",
            "title_similarity": "0.58625996",
            "sentiment_compound": 0.0
        },
        {
            "id": "h625t2s",
            "score": 1,
            "text": "That if he didn't like a cd album, he would jizz on in and then throw it away.",
            "title_similarity": "0.6045079",
            "sentiment_compound": -0.2755
        },
        {
            "id": "h625tn8",
            "score": 1,
            "text": "Once a friend told me that he installed a cctv camera in the toilet to record himself fapping and fap on that recording  😑",
            "title_similarity": "0.5938679",
            "sentiment_compound": 0.4939
        },
        {
            "id": "h625wws",
            "score": 1,
            "text": "pours milk first. Oh and he dosnt eat tomatoes\n\nEdit: also dosnt eat mushrooms",
            "title_similarity": "0.40062445",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6260lf",
            "score": 2,
            "text": "my best friend eats lip gloss. like, entire tubes of lip gloss. i’m fucking terrified.",
            "title_similarity": "0.49340627",
            "sentiment_compound": 0.6815
        },
        {
            "id": "h6269q9",
            "score": 3,
            "text": "I had a friend recently admit to me he was a virgin.  Nothing wrong with it but he’s 37 years old and isn’t even a follower of any faith, is extremely fit and not bad on the looks scale, just has no game whatsoever.  I told him if he went to church he’d have a wife within the year, but as far as I know he’s just hoping it happens for him.",
            "title_similarity": "0.4815064",
            "sentiment_compound": 0.9463
        },
        {
            "id": "h6279j2",
            "score": 1,
            "text": "My girlfriends coworker told her last night that his cousin’s sister is hot",
            "title_similarity": "0.46025395",
            "sentiment_compound": 0.0
        },
        {
            "id": "h627zp0",
            "score": 1,
            "text": "He fucked my girlfriend.",
            "title_similarity": "0.5729311",
            "sentiment_compound": -0.6597
        },
        {
            "id": "h6283pa",
            "score": 1,
            "text": "I've casually tell friends about dating someone on the top 10 Stalker list just one year before it happened. This man murdered the News Reporter he stalked just a few days before she was to move to Dallas for a major promotion.",
            "title_similarity": "0.5136935",
            "sentiment_compound": 0.0516
        },
        {
            "id": "h628bbj",
            "score": 6,
            "text": "So… from a different point of view, I think I’m one of these weird oversharing types. I sometimes have difficulty knowing what is and is not appropriate to say to people, and don’t really feel super embarrassed about stuff until I see people’s reactions and then it’s just pure shame.\n\nBut one story I told a friend of mine still makes me crack up, but boy is it not something you just share with someone without a lot of trust involved.\n\nThis was back in like 2002 or 2003 and I was a horny teenager and was on chat rooms in my bedroom trying to find girls to show me their tits. You know, normal horny teenage boy behavior. I found one who claimed to be a girl. They didn’t have their cam on, but I did, and they said if I do something for them they will show me their tits. So I agreed. They asked me to bend over and show them my asshole. I didn’t think anything of it at first, even when they told me to put something in my butt. I picked up a pen and they said “no, bigger.” So I found this big novelty candy cane, like a foot long and as big around as a silver dollar. They said that was perfect. I tried to put it in my butt but it was still plastic wrapped and the edges were sharp and hurt, so I unwrapped it. With a little effort (and no lube, I didn’t know what that was yet), I got it in there a couple inches.\n\nThis is when they disconnected, leaving me with nothing but minty delight in my rectum. I shrugged, feeling disappointed that this proved to be a one-way exchange, and pulled the wintery confection out of my butt… to find my body heat had melted it. Where the red and green stripes had been was now smooth white. I shrugged and threw it in the trash and didn’t think of it until later that night when I went to the bathroom and took a dump. When I got up to flush I discovered my turds were red, white, and green swirled.\n\nA few years later, sitting in my friend’s car outside our dorm building, I tell him this story. His face is just more and more shocked as it goes, disgusted and horrified. When I was done he just looked at me for a few seconds before yelling loudly “WHAT…. THE FUCK?!”\n\nOh, and it was in the telling of the story to him that I realized it was probably a male pedophile pretending to be a teenage girl to trick teen boys into desecrating their boy holes. Welp.",
            "title_similarity": "0.58214056",
            "sentiment_compound": -0.9017
        },
        {
            "id": "h628h56",
            "score": 2,
            "text": "He shaves off his moles.",
            "title_similarity": "0.53723586",
            "sentiment_compound": 0.0
        },
        {
            "id": "h628jyl",
            "score": 3,
            "text": "My BIL;\n\n1. Insists skid marks are normal\n2. Wondered aloud why \"scientists haven't bred pugs to cats yet\"\n\nThis man has higher education than I do.\n\nEdit; was reminded by other posts here..\n\n #3. Was incredulous that I have never shit myself \n\n-.-\n\nHe's 49.",
            "title_similarity": "0.53589094",
            "sentiment_compound": 0.4449
        },
        {
            "id": "h628n1m",
            "score": 1,
            "text": "How is that different from waxing.... Both still pull out the hair and I'm pretty sure if you do it enough you get desensitization on the areas",
            "title_similarity": "0.66856265",
            "sentiment_compound": 0.6705
        },
        {
            "id": "h628wpa",
            "score": 1,
            "text": "A friend of mine that did pub quizzes in my group of friends told me something shocking in one of their rounds. We did a round of two truths one lie to mix it up as it was the 5th pub quiz. Anyway we got to my friend who revealed that one of his truths was popping pimples on his asshole. Needless to say I was disturbed and I fully keep that fact in mind when speaking with him...",
            "title_similarity": "0.64896595",
            "sentiment_compound": 0.8689
        },
        {
            "id": "h6290tm",
            "score": 1,
            "text": "Not sure if this fits here but it’s an interesting story. My buddy from high school told me that a guy in our class got suspended because teachers found a “list” of students names and numbers next to each name in his folder. Apparently it was a list of all the popular kids with rankings. His defense was if these popular kids weren’t around then everyone else would thrive because the need to be seen as popular often stops the unpopular kids ability to share their good ideas. The kid had no intentions of hurting anyone he was actually nice to me. However, I was number 5 on that list and it makes me think.",
            "title_similarity": "0.5854441",
            "sentiment_compound": 0.9536
        },
        {
            "id": "h6294e2",
            "score": 1,
            "text": "That they don’t wash their feet in the shower",
            "title_similarity": "0.38632295",
            "sentiment_compound": 0.0
        },
        {
            "id": "h62978k",
            "score": 1,
            "text": "\" I have cancer but w.e, I have nothing to live for anyways\". My friend who died when he od'd on Fentanyl.",
            "title_similarity": "0.558278",
            "sentiment_compound": -0.5106
        },
        {
            "id": "h629iip",
            "score": 1,
            "text": "He told me he had a foolproof solution to homelessness. \"Give them all a year to get off the streets and find a job, then round up all the ones who are left and...\" *throat-slitting gesture*.\n\nHe followed that with \"I know it's harsh, but it's the only way.\"",
            "title_similarity": "0.63961506",
            "sentiment_compound": 0.128
        },
        {
            "id": "h629rac",
            "score": 2,
            "text": "I do that with nose hairs.",
            "title_similarity": "0.37234676",
            "sentiment_compound": 0.0
        },
        {
            "id": "h629zed",
            "score": 2,
            "text": "My friend is pretty tall and told me that he regularly pees in the sink because \"it's just easier\".",
            "title_similarity": "0.3952816",
            "sentiment_compound": 0.8481
        },
        {
            "id": "h62aeod",
            "score": 1,
            "text": "What... Why??? 🤣🤣",
            "title_similarity": "0.19111122",
            "sentiment_compound": 0.787
        },
        {
            "id": "h62afxf",
            "score": 2,
            "text": "My roommate rips out his big toenail when it gets \"too thick\". The first time he did it I was like \"yo wtf bro\" and he was like \"what? You don't do that when yours get too thick?\"",
            "title_similarity": "0.65825856",
            "sentiment_compound": 0.1431
        },
        {
            "id": "h62alky",
            "score": 1,
            "text": "One of my ex friends said he played vayne top",
            "title_similarity": "0.5481965",
            "sentiment_compound": 0.743
        },
        {
            "id": "h62ar3w",
            "score": 1,
            "text": "I can’t tell if he was messing w me or not.  But over the years he sticks to this story.  I had a buddy who traveled all over the US for work.  \n\nHe told me he would use the airport toilets. He’d flush the toilet to get ‘clean water’. Then use the water to ‘freshen up.’  Splash it on his face.  Brush his teeth.  Etc.  he explained that as it was fresh water it was clean and okay to do.  He has stuck to this story for years and swears I’m a princess for thinking this is gross.",
            "title_similarity": "0.6736336",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h62b26l",
            "score": 1,
            "text": "My dear friend rips her toenails instead of clipping them. She thinks I'm a bit of a princess for owning nail clippers bhahah\n\n\\-----by the way-----\n\nOP's friend could be dealing with trichotillomania. He might be pulling the hairs out bc he finds the behavior soothing and not just bc he wants hairless armpits. Something to consider.",
            "title_similarity": "0.681936",
            "sentiment_compound": 0.8834
        },
        {
            "id": "h62b3y6",
            "score": 2,
            "text": "this thread tells me I'm disgusting.",
            "title_similarity": "0.48343024",
            "sentiment_compound": -0.5267
        },
        {
            "id": "h62bfck",
            "score": 1,
            "text": "might have trichotillomania",
            "title_similarity": "0.31670892",
            "sentiment_compound": 0.0
        },
        {
            "id": "h62bszi",
            "score": 1,
            "text": "I had close friend a few years ago before I moved abroad and we were comparing the weirdest places we've ever masturbated. Then he dropped that he once had a wank under then table at a restaurant when eating with his family. I didn't hang out with him much after that....",
            "title_similarity": "0.56310296",
            "sentiment_compound": 0.3182
        },
        {
            "id": "h62c07p",
            "score": 1,
            "text": "My friend told me when we were hanging out. “I think every man has tasted his own spunk at one point or another.",
            "title_similarity": "0.6146144",
            "sentiment_compound": 0.4939
        },
        {
            "id": "h62cxbd",
            "score": 1,
            "text": "My old friend had a pair of “winter sandals” and we live in minnesota.",
            "title_similarity": "0.39048392",
            "sentiment_compound": 0.4939
        },
        {
            "id": "h62d8e7",
            "score": 3,
            "text": "Me and one of my friends yank the hair in the gap between the balls and the buttcrack. Idk why but is kinda relaxing. Recommended",
            "title_similarity": "0.5869998",
            "sentiment_compound": 0.7574
        },
        {
            "id": "h62da1h",
            "score": 1,
            "text": "I knew a girl who would bite her fingernails and the store the clippings in between her teeth.",
            "title_similarity": "0.38261464",
            "sentiment_compound": 0.0
        },
        {
            "id": "h62dorw",
            "score": 1,
            "text": "i wonder if your friend has that hair pulling condition (trichotillomania). if not and he does it for fun… well as a girl who waxes my pits that shit must hurt lol…\n\nmy old roommate once told me she doesnt shower when on her period and that she uses only one tampon per day because “whats the point of changing it if i have to keep doing it?” i hated this roommate because she was so messy and after she said that i just… i still dont know what to say. i wonder if she still does it (i didnt know her very well just lived with her like 8 years ago). fucking nasty.",
            "title_similarity": "0.6606634",
            "sentiment_compound": -0.879
        },
        {
            "id": "h62e18o",
            "score": 1,
            "text": "One of my old mates would cum on all his brand new clothes and wouldn’t wear them until he came on them.",
            "title_similarity": "0.67710304",
            "sentiment_compound": 0.0
        },
        {
            "id": "h62e9rj",
            "score": 1,
            "text": "While no longer a friend, a mid-40s married guy with kids shared that he was \"involved\" with a 16-year-old. Age of consent is 16 in the state we live in, so while morally questionable, it was legal.\n\nHe mentioned the girl having issues, and how he helped her work through them via their \"involvement.\" One of the worst parts to me is that he works in youth services in his church, so there's a good chance other girls seeking counsel/help with issues will turn to him.",
            "title_similarity": "0.5602573",
            "sentiment_compound": 0.5267
        },
        {
            "id": "h62eklg",
            "score": 1,
            "text": "Any time a friend has told me anything about their sex lives",
            "title_similarity": "0.4660209",
            "sentiment_compound": 0.4939
        },
        {
            "id": "h62f2hu",
            "score": 1,
            "text": "Dingle Berries. I've mentioned this in another thread. Had a buddy of mine casually talk about the inconvenience of \"dingle berries.\" If you're unfamiliar, they are pieces of shit that get stuck to the hairs around your asshole. I just don't get it. The only conceivable way to get these is to not wipe your ass. Wipe your fucking ass, my dudes!",
            "title_similarity": "0.6916656",
            "sentiment_compound": -0.8241
        },
        {
            "id": "h62f2wn",
            "score": 2,
            "text": "My best friend told me that when he starts feeling drowsy behind the wheel, he will pluck out a nose hair as slowly as he can.",
            "title_similarity": "0.6881417",
            "sentiment_compound": 0.836
        },
        {
            "id": "h62fdz6",
            "score": 3,
            "text": "Once a friend/ drug dealer informed me she didn’t do coke “like we do”\nThen proceeded to let me and my friend know she has her boyfriend “blow it up her butt and then they have anal” \nI have never forgotten it",
            "title_similarity": "0.69116104",
            "sentiment_compound": 0.7944
        },
        {
            "id": "h62fpit",
            "score": 13,
            "text": "When I was a kid I knew this girl (10) who said she would practice her kissing on her younger brother (6).",
            "title_similarity": "0.4332713",
            "sentiment_compound": 0.5719
        },
        {
            "id": "h62g3fg",
            "score": 3,
            "text": "My friend removes all of his nose hair with his tweezers. One at a time. He loves it, says it’s one the most painful things he can endure. I don’t know how he does it",
            "title_similarity": "0.6272096",
            "sentiment_compound": 0.5729
        },
        {
            "id": "h62h4jl",
            "score": 1,
            "text": "“We’ve only been friends with you for so long because you don’t say no.”",
            "title_similarity": "0.44917893",
            "sentiment_compound": 0.4767
        },
        {
            "id": "h62hg1i",
            "score": 1,
            "text": "Was chatting with two of my bosses yesterday, they were talking about this girl that jogs in front of one of their houses regularly with their little dog, to which my other boss replied with \"Do you think she'd be upset if I shot her dog?\" Wtf dude",
            "title_similarity": "0.55294454",
            "sentiment_compound": -0.7506
        },
        {
            "id": "h62idj7",
            "score": 2,
            "text": "I rip ny nose hairs out",
            "title_similarity": "0.5240446",
            "sentiment_compound": 0.0
        },
        {
            "id": "h62iqm5",
            "score": 1,
            "text": "An older guy I used to work with told me he’s started dating a girl that is into spirits and weird shit, so now he believes in the after life. Literally told me he was thinking of killing him self so he can re-incarnate so he could start over... he’s not even depressed. Just incredibly stupid",
            "title_similarity": "0.7155026",
            "sentiment_compound": -0.8931
        },
        {
            "id": "h62jc2y",
            "score": 1,
            "text": "That they’d attempted suicide more then ten times (I mean I can’t judge, it’s the same for me) but he said it so casually, he was used to it. And the thing is. HE WAS 13. And you should of seen this guys arms, I was shocked he even thought of wearing short sleeve shirts. His arms were covered in scars and cuts. He was the person I tried not to be, because I’m pretty sure he was either just depressed or bipolar.",
            "title_similarity": "0.5868397",
            "sentiment_compound": -0.4288
        },
        {
            "id": "h62jlk3",
            "score": 1,
            "text": "I don’t know if this is Normal or not but my friend told me he wants to invent penis deodorant",
            "title_similarity": "0.596172",
            "sentiment_compound": -0.5334
        },
        {
            "id": "h62jvb7",
            "score": 1,
            "text": "My best friend in high school used to drink an entire Nalgene-bottles worth of regular milk everyday. I could never really see him quite the same after that.",
            "title_similarity": "0.39574367",
            "sentiment_compound": 0.8519
        },
        {
            "id": "h62jvol",
            "score": 11,
            "text": "Might be a bit nsfw butttt I had a friend in high school who told our entire friend group that he tastes his own jizz after he beats one off. I’ll never forget his one-liner after the fact: “What? A chef has to taste his own food”",
            "title_similarity": "0.61858183",
            "sentiment_compound": 0.7944
        },
        {
            "id": "h62k2xb",
            "score": 1,
            "text": "That his dad used to hit his mom",
            "title_similarity": "0.6013596",
            "sentiment_compound": 0.0
        },
        {
            "id": "h62k37s",
            "score": 2,
            "text": "Native Americans did this regularly",
            "title_similarity": "0.18326832",
            "sentiment_compound": 0.0
        },
        {
            "id": "h62k7mk",
            "score": 1,
            "text": "Did not need to know how \"straight\" his junk is and how much women love it",
            "title_similarity": "0.48873356",
            "sentiment_compound": 0.7269
        },
        {
            "id": "h62kf9i",
            "score": 1,
            "text": "Guy I know says he captures farts in an old pickle jar..",
            "title_similarity": "0.5416586",
            "sentiment_compound": 0.0
        },
        {
            "id": "h62klx2",
            "score": 2,
            "text": "Had a friend tell me they *prefer* biting off their TOEnails instead of using clippers.",
            "title_similarity": "0.65825224",
            "sentiment_compound": 0.4939
        },
        {
            "id": "h62kvec",
            "score": 1,
            "text": "That he has a waifu pillow case of taiga from ToraDora(i may of got the name wrong) which he told me about one side sounded simi average and not as weird but still weird the other side tho she was pulling a full condom out her baby freeway.\n\nNow I don't really care what people buy or do i mean what ever but like this purchase really disturbs me and I'm not to sure why. Luckily I never saw it...we are also no longer friends due to some issues but sometimes i remember that convo and die a bit inside....",
            "title_similarity": "0.60554564",
            "sentiment_compound": -0.9503
        },
        {
            "id": "h62l12z",
            "score": 1,
            "text": "My roommate casually told me of how he wants to uhm... Intercourse with me in our dean's office alone. Ngl can't think of anything else since",
            "title_similarity": "0.60718185",
            "sentiment_compound": -0.0772
        },
        {
            "id": "h62lnxk",
            "score": 1,
            "text": "I had a friend tell me he masturbated to a picture of his cousin once. He asked if that was weird but seemed pretty nonchalant about it like he was asking me if his shoes matches his shirt.",
            "title_similarity": "0.6905235",
            "sentiment_compound": 0.8519
        },
        {
            "id": "h62luhh",
            "score": 1,
            "text": "Man you must be like 14 if this is upsetting you",
            "title_similarity": "0.46113893",
            "sentiment_compound": -0.1531
        },
        {
            "id": "h62m6s5",
            "score": 1,
            "text": "Not a friend but a housemate. All of us were having a chat after dinner in the kitchen. And this guy just blurts out that he does meth everyday...he had a full time construction job. \n\nHe moved out soon after because he started acting odd-er",
            "title_similarity": "0.5263722",
            "sentiment_compound": -0.2057
        },
        {
            "id": "h62mhws",
            "score": 1,
            "text": "This dude in high school would rip out his pubes and leave them in/on random places. It would make a sound when the pubes were removed. I could never believe what I was seeing/hearing.",
            "title_similarity": "0.62826633",
            "sentiment_compound": -0.0516
        },
        {
            "id": "h62mige",
            "score": 1,
            "text": "I yank out my pubes all the time when no one's watching. I've stopped since apparently it's weird and gross.",
            "title_similarity": "0.5815109",
            "sentiment_compound": -0.7845
        },
        {
            "id": "h62mmtu",
            "score": 1,
            "text": "My son told me he lifts the entire toilet seat/lid and sits on the rim of the toilet to go poop because “he is afraid he might poop on the actual seat”…wth kid, wth 😂",
            "title_similarity": "0.56031287",
            "sentiment_compound": -0.128
        },
        {
            "id": "h62mn0f",
            "score": 1,
            "text": "Grandpa says that his worker (never met him) is grandma’s son. He may have just been at the bar too long, I don’t know! I just fish.",
            "title_similarity": "0.54270375",
            "sentiment_compound": 0.0
        },
        {
            "id": "h62mr2f",
            "score": 1,
            "text": "Same but nose hair",
            "title_similarity": "0.30276984",
            "sentiment_compound": 0.0
        },
        {
            "id": "h62mrez",
            "score": 2,
            "text": "And I quote; “Why do people even talk to each other when they can sing like in musicals?”",
            "title_similarity": "0.378131",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h62n086",
            "score": 1,
            "text": "My S.O.’s friend: “You guys don’t stick your finger in your asshole, hook it and do a quick loop to clean it?” \nUs: “Umm, no, that’s a new one for us.”\nFriend: “Well that’s how my mom taught me.” He shrugs. \nWe sit in silence and horror wondering about their Mother/Son relationship.",
            "title_similarity": "0.73743117",
            "sentiment_compound": 0.6597
        },
        {
            "id": "h62n7pr",
            "score": 2,
            "text": "My husband sometimes cuts his skin tags off.\n\n&#x200B;\n\nEeeyuugh.",
            "title_similarity": "0.6536273",
            "sentiment_compound": -0.296
        },
        {
            "id": "h62n8xa",
            "score": 2,
            "text": "This one is me, but I told my friends in elementary school that I had fucked a cat, bc I thought I'd seem cool",
            "title_similarity": "0.53266525",
            "sentiment_compound": 0.0
        },
        {
            "id": "h62nwv2",
            "score": 10,
            "text": "when we were 18/19 a friend casually shared his attraction for 12 year old girls with me like I'd be on the same page. I went to the cops, and he was ultimately caught in a sting roughly 3 months later.",
            "title_similarity": "0.55025816",
            "sentiment_compound": 0.8957
        },
        {
            "id": "h62nxzk",
            "score": 3,
            "text": "When I was in middle school, I asked a kid if he used deodorant and he asked \"is that a Pokémon?\"",
            "title_similarity": "0.41665363",
            "sentiment_compound": 0.0
        },
        {
            "id": "h62nymw",
            "score": 1,
            "text": "A guy in high school told us that he had a \"feminine hygiene\" collection and whacked off to it.",
            "title_similarity": "0.64317197",
            "sentiment_compound": 0.0
        },
        {
            "id": "h62oc0b",
            "score": 1,
            "text": "As I literally sit here tweezing my underarms 😅😅😅 it's not that weird. Just like waxing",
            "title_similarity": "0.3696205",
            "sentiment_compound": 0.8597
        },
        {
            "id": "h62olpr",
            "score": 1,
            "text": "That my fingers were sucked by an old man",
            "title_similarity": "0.624341",
            "sentiment_compound": -0.4588
        },
        {
            "id": "h62ouqi",
            "score": 2,
            "text": "Why is that upsetting? You do the nipple hairs the same way. And the mustache hairs 2-3 days before some sort of important interview.",
            "title_similarity": "0.5204243",
            "sentiment_compound": -0.3804
        },
        {
            "id": "h62p371",
            "score": 1,
            "text": "Ouch",
            "title_similarity": "0.1344512",
            "sentiment_compound": 0.0
        },
        {
            "id": "h62q0x1",
            "score": 2,
            "text": "Just found out my boyfriend eats lemons like people eat oranges.\n\nIt's horrifying to watch.",
            "title_similarity": "0.583627",
            "sentiment_compound": -0.296
        },
        {
            "id": "h62q8wd",
            "score": 6,
            "text": "I was visiting a friend at his house several years ago, he got a roll of cookie dough out of the fridge, cut it open, and starting eating the dough with a spoon. He leaned against his kitchen counter and started telling me about how he and his wife bought the cookie dough at the grocery the day before, and when they got home he fucked his wife with it.",
            "title_similarity": "0.4779604",
            "sentiment_compound": -0.5106
        },
        {
            "id": "h62qaw6",
            "score": 1,
            "text": "? I don’t see the issue. I tweeze my underarm hair, leg hair and occasionally pubic hair.",
            "title_similarity": "0.5311644",
            "sentiment_compound": 0.0
        },
        {
            "id": "h62qsm6",
            "score": 2,
            "text": "A friend of mine once revealed to me that he poops while crouching on the toilet like a god damn gargoyle and washes his butt while standing straight up at the sink. \n\nProps to him for washing his asshole but wth man.",
            "title_similarity": "0.623441",
            "sentiment_compound": -0.3818
        },
        {
            "id": "h62rl8c",
            "score": 1,
            "text": "He sometimes wets the bed when he's drunk",
            "title_similarity": "0.44424346",
            "sentiment_compound": -0.34
        },
        {
            "id": "h62ryhk",
            "score": 1,
            "text": "Back in middle school, my friend’s brother told us he kept the insides of his shoes fresh by putting  mom’s and sister’s maxi pads in them—-thought they were odor absorbing shoe inserts.",
            "title_similarity": "0.59444064",
            "sentiment_compound": 0.3182
        },
        {
            "id": "h62rzs1",
            "score": 1,
            "text": "I mean, it's called trichotillomania and a lot of people fight with this everyday.  Be kind.❤",
            "title_similarity": "0.45888978",
            "sentiment_compound": 0.7184
        },
        {
            "id": "h62s4mm",
            "score": 3,
            "text": "One of my friends told me that she used to masturbate with an old styrofoam head someone gave her (the kind wigs are displayed on).\nI didn’t ask any details. She told me she kept it in the closet and finally threw it away because she felt like a pervert (she’s very Christian).\n\nI didn’t want to know any of her masturbation habits.",
            "title_similarity": "0.6427045",
            "sentiment_compound": 0.7184
        },
        {
            "id": "h62t8t5",
            "score": 3,
            "text": "My friend told me that he wipes his ass with Lysol cleaning wipes",
            "title_similarity": "0.67425287",
            "sentiment_compound": -0.0772
        },
        {
            "id": "h62ufk4",
            "score": 1,
            "text": "This thread delivers.",
            "title_similarity": "0.14203414",
            "sentiment_compound": 0.0
        },
        {
            "id": "h62uqve",
            "score": 1,
            "text": "One of my friends uses the same razor for everything. Ass, balls, armpit and face.",
            "title_similarity": "0.4778451",
            "sentiment_compound": -0.1027
        },
        {
            "id": "h62ur48",
            "score": 1,
            "text": "I pull my beard hairs out when stressed, OPs friend could be on a similar vibe?",
            "title_similarity": "0.72843117",
            "sentiment_compound": 0.2023
        },
        {
            "id": "h62va19",
            "score": 1,
            "text": "I do the same with nose hair.",
            "title_similarity": "0.3144194",
            "sentiment_compound": 0.0
        },
        {
            "id": "h62vzm0",
            "score": 1,
            "text": "My friends believe that soccer requires more skill than formula one",
            "title_similarity": "0.4128128",
            "sentiment_compound": 0.4767
        },
        {
            "id": "h62xnzq",
            "score": 1,
            "text": "Underarm hair is where I started. I don’t do it anymore, but do a fair amount of plucking. \n\nPlucking underarm hair is sort of relieving.",
            "title_similarity": "0.6579552",
            "sentiment_compound": 0.6966
        },
        {
            "id": "h62y0ve",
            "score": 1,
            "text": "They cut their toenails into sharp points to stab their brother with..",
            "title_similarity": "0.53285915",
            "sentiment_compound": -0.7096
        },
        {
            "id": "h62y8i4",
            "score": 2,
            "text": "A friend back in middle school told me he could bend over and suck his own dick.\n\nWonder if he still does so tho.",
            "title_similarity": "0.6220297",
            "sentiment_compound": -0.4588
        },
        {
            "id": "h62ytmk",
            "score": 1,
            "text": "My friend once told me she was pretty sure she was related Jesus Christ through marriage......I guess my blank look made her do a \"little\" more research because she now says that was a mistake",
            "title_similarity": "0.56608844",
            "sentiment_compound": 0.743
        },
        {
            "id": "h62yu30",
            "score": 1,
            "text": "My friend loves cereal, but hates milk. However, he needs milk to eat his cereal. When we were kids, there would be bowls of milk set out in random places. This admission of the milk/cereal conundrum, followed by the act of leaving milk bowls out bothers me to this day. To this day, he still does it.",
            "title_similarity": "0.53291327",
            "sentiment_compound": -0.3818
        },
        {
            "id": "h62z7np",
            "score": 1,
            "text": "My one friend used to shave without using facial cream… fucking clown",
            "title_similarity": "0.6300073",
            "sentiment_compound": 0.4939
        },
        {
            "id": "h62zebf",
            "score": 1,
            "text": "I have a friend that I’ve known for awhile and in high school he told me he sleeps with his socks on. 6+ years later that’s still the first thought I have when I see him.",
            "title_similarity": "0.46059367",
            "sentiment_compound": 0.4939
        },
        {
            "id": "h62zyz7",
            "score": 1,
            "text": "Ouch just fuckin ouch.... Damn masochist",
            "title_similarity": "0.50292206",
            "sentiment_compound": -0.7133
        },
        {
            "id": "h63006x",
            "score": 1,
            "text": "A friend told me she only brushes her teeth at night before bed….I mean if you’re only going to do it once why would it be the night time one!",
            "title_similarity": "0.52054036",
            "sentiment_compound": 0.5411
        },
        {
            "id": "h6304zd",
            "score": 2,
            "text": "Buddy of mine taught me a neat trick that I do not condone at all, so DO NOT DO THIS. Poison ivy got you scratching? Pop all the blisters it makes and pour bleach on the area, burns like fire but clears it up in a day at most.",
            "title_similarity": "0.64693356",
            "sentiment_compound": -0.0419
        },
        {
            "id": "h6308dv",
            "score": 1,
            "text": "This thread reminded me of when I was 17-18 (1991), & was in a rehab for 42 days. I met a lot of funny other young guys, & some would graduate, & come back to visit to show they were doing ok. One kid came back to visit & his face was bright red & looked raw, but oddly shaped like a beard & mustache. When he revealed the cause, he told us that he had used Nair (a product still available to remove hair, that typically women used then for their legs) & it had badly burned his face.",
            "title_similarity": "0.65056866",
            "sentiment_compound": 0.25
        },
        {
            "id": "h63096x",
            "score": 1,
            "text": "I guy I used to know told me some days he’ll just wear a condom. All day. Takes it off if he has to pee then puts a new one on.",
            "title_similarity": "0.5689944",
            "sentiment_compound": 0.0
        },
        {
            "id": "h630i6g",
            "score": 1,
            "text": "Not my story but my girlfriend's actually so when she was in high school an acquaintence mid conversation about crushes randomly pointed out the fact he was a prostitute at 18",
            "title_similarity": "0.5676584",
            "sentiment_compound": -0.5927
        },
        {
            "id": "h630lvt",
            "score": 5,
            "text": "My girlfriend in College made out with girls on multiple occasions at parties. We were at a party and as the nights in full swing I see my girlfriend across the crowded room making out with a girl. I go over tap her on the shoulder and say what the fuck are you doing? She said what? It’s a girl this isn’t cheating. I’m like ??? She’s like it’s not cheating. I’m like ??? She’s like it happens from time to time never with another guy just girls only. Called her idiot and told her we were done.",
            "title_similarity": "0.46883655",
            "sentiment_compound": 0.5063
        },
        {
            "id": "h6319ot",
            "score": 1,
            "text": "I had a buddy who told me he liked to masturbate, ejaculate on his chest and rub all over like it was lotion. He wasn't joking, was dead serious. He was confused when we all said \"Wtf\" he was like \"you all don't do this, haven't wondered what it feels like?\"",
            "title_similarity": "0.6176474",
            "sentiment_compound": 0.6884
        },
        {
            "id": "h6319yr",
            "score": 1,
            "text": "15 years ago at a guys only get together.\n\n\"Chicks don't know they like anal, so you just got to get them going and then force it in.\" -Joey\n\n\"Uh...dude that's rape.\"  -Me\n\n\"Not if they like it.\"-Joey\n\nThis was the same guy that slept with everyone's ex and told them to grow up after people found out.",
            "title_similarity": "0.65821385",
            "sentiment_compound": -0.8368
        },
        {
            "id": "h631vpy",
            "score": 1,
            "text": "My friends reacted pretty horribly when I mentioned to get rid of nose hair I stick a disposable razor up there and twist.",
            "title_similarity": "0.7783372",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h631yx7",
            "score": 1,
            "text": "A friend told me that he eats the heads off of burnt matches. I witnessed him \"sneaking\" one into his mouth years later.",
            "title_similarity": "0.59234023",
            "sentiment_compound": 0.4939
        },
        {
            "id": "h632dv0",
            "score": 1,
            "text": "One of my friends works construction told me that he doesn't use soap when he showers because it drys out his skin..I asked him when the last time he used some he said  probably 6 years ago",
            "title_similarity": "0.61454666",
            "sentiment_compound": 0.4767
        },
        {
            "id": "h632kvl",
            "score": 1,
            "text": "Friend told me in the middle of singing a song him and gf have hateful make up sex. Yes, they are still together.",
            "title_similarity": "0.57525516",
            "sentiment_compound": 0.4019
        },
        {
            "id": "h632nhp",
            "score": 1,
            "text": "I was seeing this dude and he did a lot of weird stuff but I think the most memorable one was when he was having a smoke on his balcony in the middle of the night and then had to pee.\n\nThis dude just peed from his balcony, I was obviously dumbfounded! Seeing my reaction he just calmy added: „It feels very freeing and breezy.“\n\nThis wasn’t even the first time he had done that apparently, he just didn’t see anything weird with it.\n\nA day later his brother came by and they are close and open with each other and I got along with him too, so I brought it up.\n\n„Your brother sometimes pees from his balcony and is trying to tell me how it isn’t weird at all?“\n\nHis brother just looked me dead into the eyes.\n\n„It isn’t.“\n\nThat’s when I noticed weirdness runs in the family.",
            "title_similarity": "0.5357915",
            "sentiment_compound": -0.8968
        },
        {
            "id": "h632rn0",
            "score": 1,
            "text": "When my friend told me he wipes back to front",
            "title_similarity": "0.64072114",
            "sentiment_compound": 0.4939
        },
        {
            "id": "h632va5",
            "score": 1,
            "text": "More than anything, I think it is amusing that you find a guy ripping his armpit hairs out upsetting, when women do it every day.",
            "title_similarity": "0.5894133",
            "sentiment_compound": -0.128
        },
        {
            "id": "h632y1i",
            "score": 1,
            "text": "that theyve done lots of crack and heroin",
            "title_similarity": "0.35879874",
            "sentiment_compound": -0.4939
        },
        {
            "id": "h6333ij",
            "score": 1,
            "text": "Had a friend that used a scotch brite pad as a loofa . . . Including on the family jewels etc. He was an aggressive scrubber too.",
            "title_similarity": "0.6372527",
            "sentiment_compound": 0.6808
        },
        {
            "id": "h6333jg",
            "score": 2,
            "text": "Maybe not as crazy as the others but my friends wife informed us at a bonfire that she really wants to see a car accident, she went on to specify that she wants to see the body and blood and guts everywhere especially. She also said this in front of our other friend who is a cop and has seen some pretty horrid shit and when he voiced this she asked him if he had pictures. My husbands parents were also at this bonfire and were very concerned. I kind of wanted to tell her to leave after that. I don’t think anyone knew what to say when she just casually expressed her interest in seeing something so awful, we were dumbfounded.",
            "title_similarity": "0.60573316",
            "sentiment_compound": -0.6685
        },
        {
            "id": "h6333ri",
            "score": 2,
            "text": "The approximate volume of their ejaculate.",
            "title_similarity": "0.28724435",
            "sentiment_compound": 0.0
        },
        {
            "id": "h633ltr",
            "score": 3,
            "text": "Back in college, a friend of mine shared with us that he turned condoms inside out to reuse them between orgasms with the same partner in order to save money on buying more condoms.  \n\nShockingly, he ended up getting his girlfriend at the time pregnant not even a month after telling us this.  A shotgun wedding followed soon after.  He’s long since divorced and paying a fuck ton of child support.",
            "title_similarity": "0.5916519",
            "sentiment_compound": 0.7203
        },
        {
            "id": "h633p66",
            "score": 1,
            "text": "That the government is withholding the real vaccine and YouTube will teach you all about it",
            "title_similarity": "0.5805313",
            "sentiment_compound": 0.0
        },
        {
            "id": "h633u3g",
            "score": 1,
            "text": "My 37 year old very American friend has never seen The Goonies",
            "title_similarity": "0.46735966",
            "sentiment_compound": 0.539
        },
        {
            "id": "h633uxh",
            "score": 2,
            "text": "My childhood best friend left me scarred by admitting he masturbates with butter. Like a stick of actual butter. Claims it's the best lube ever. I dont think hes wrong, just....wrong.",
            "title_similarity": "0.558554",
            "sentiment_compound": 0.949
        },
        {
            "id": "h633zbc",
            "score": 1,
            "text": "A friend told me that they eat ice cream with a fork. I stopped talking to them.",
            "title_similarity": "0.52357715",
            "sentiment_compound": 0.3182
        },
        {
            "id": "h6340sf",
            "score": 1,
            "text": "I knew this dude in high school who was convinced that girls had a third hole between vagina and anus.",
            "title_similarity": "0.48706087",
            "sentiment_compound": 0.4019
        },
        {
            "id": "h6348gx",
            "score": 1,
            "text": "I forgot to brush my teeth one night and she told me she regularly forgets for a couple of days.. but it’s “totally fine”…",
            "title_similarity": "0.5058565",
            "sentiment_compound": 0.0
        },
        {
            "id": "h634d9y",
            "score": 1,
            "text": "\"I have issue breading with a mask\"\n\n-- A commercial diver friend who do welding at surprising depth under the ocean",
            "title_similarity": "0.40108308",
            "sentiment_compound": 0.6486
        },
        {
            "id": "h634rfs",
            "score": 1,
            "text": "I knew a lady who would set her microwave to run instead of using the timer because she didn’t know how. Imagine. You’re baking cookies for 15 minutes in your oven and the microwave is running for the same amount of time with nothing in it.",
            "title_similarity": "0.40333188",
            "sentiment_compound": 0.0
        },
        {
            "id": "h634rhc",
            "score": 1,
            "text": "My friend told me he does this with his asshole hairs",
            "title_similarity": "0.7838698",
            "sentiment_compound": 0.4939
        },
        {
            "id": "h634vhe",
            "score": 1,
            "text": "I do that for my chest hair. If you do it 1 at a time you can't feel it",
            "title_similarity": "0.4475394",
            "sentiment_compound": 0.0
        },
        {
            "id": "h634vvn",
            "score": 1,
            "text": "My best friend told me that movies without action aren't worth watching. I don't know whether to be annoyed or fearful.",
            "title_similarity": "0.56708115",
            "sentiment_compound": 0.4754
        },
        {
            "id": "h6353u8",
            "score": 1,
            "text": "How my buddy clears his stricture. \n\n\nHe had scar tissue form inside his urethra, think like a thick spider web blocking a pipe. He had these little sounding tools they sent him and he had to open the way every 2 or so days. But it let him reclaim his sex life. He was so happy when he told us. He'd been with the same girl for 5 Years but had given up sex a year in because the stricture was just to much of an issue.",
            "title_similarity": "0.5888815",
            "sentiment_compound": 0.8277
        },
        {
            "id": "h635af0",
            "score": 1,
            "text": "Do you know me OP?",
            "title_similarity": "0.2997754",
            "sentiment_compound": 0.0
        },
        {
            "id": "h636lbz",
            "score": 1,
            "text": "As someone who does the same, ask away for I am unashamed",
            "title_similarity": "0.42592356",
            "sentiment_compound": 0.0
        },
        {
            "id": "h636ngq",
            "score": 1,
            "text": "I love this thread. Thank you OP",
            "title_similarity": "0.21899381",
            "sentiment_compound": 0.7717
        },
        {
            "id": "h636ryn",
            "score": 1,
            "text": "That I'm fat.. lol btw, I'm not sure how this is upsetting.. I'll just be like \"cool story bro\"",
            "title_similarity": "0.41780725",
            "sentiment_compound": 0.3691
        },
        {
            "id": "h636tkg",
            "score": 3,
            "text": "Tie between \"I never knew you were supposed to wash your feet\" and \"I never knew you were supposed to change your sheets\".",
            "title_similarity": "0.51337314",
            "sentiment_compound": 0.0
        },
        {
            "id": "h636tor",
            "score": 2,
            "text": "My girlfriend just told me she eats instant noodles with ketchup",
            "title_similarity": "0.42675966",
            "sentiment_compound": 0.0
        },
        {
            "id": "h636va7",
            "score": 4,
            "text": "When I was on my way out of the army (2010ish) a guy I was acquainted with asked if I wanted to come hang out at his house as he was having a party. I waffled a bit since I was pretty burned out at the time. He tried to tempt me by telling me he got a bunch of Jr High girls to come for free booze. Took me a second to realize he was inviting me to get underage girls drunk for the purpose of raping them. Hard passed and let the local PD know about his plans.",
            "title_similarity": "0.61615014",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h637el6",
            "score": 1,
            "text": "My roomate told me not an hour ago that she was \"really into the rind\" of orange peels. Upon further questioning I found out she just meant the peel.",
            "title_similarity": "0.5645403",
            "sentiment_compound": -0.1027
        },
        {
            "id": "h637hox",
            "score": 1,
            "text": "im a girl and i do that",
            "title_similarity": "0.1528625",
            "sentiment_compound": 0.0
        },
        {
            "id": "h637hqv",
            "score": 2,
            "text": "Boy, if this upsets you just wait until you learn what waxing is!",
            "title_similarity": "0.5308548",
            "sentiment_compound": -0.4883
        },
        {
            "id": "h637w6d",
            "score": 1,
            "text": "My friend told me today that he wrote a suicide note a couple weeks ago. That was upsetting\n\nEdit: he got help and is stable now",
            "title_similarity": "0.6454967",
            "sentiment_compound": -0.128
        },
        {
            "id": "h637x64",
            "score": 1,
            "text": "I get rid of my ass hair the same way , I kinda enjoy it I just tell my self pain is not real",
            "title_similarity": "0.6615159",
            "sentiment_compound": -0.5984
        },
        {
            "id": "h637ziw",
            "score": 1,
            "text": "Late to the party, but I was talking to a coworker about having an upset stomach and she suggested I just drink a little bit of bleach and water and it will clear right up. When I expressed how insane that was to her she tried to get another person to be on her side. They were not. She said it never caused her problems, she does it all the time. She also brushes her teeth with bleach, said it kept her teeth good while she was on meth back in the day.",
            "title_similarity": "0.606157",
            "sentiment_compound": 0.6171
        },
        {
            "id": "h63805o",
            "score": 1,
            "text": "That he makes 250k a year(profit, not gross) mowing lawns",
            "title_similarity": "0.30050814",
            "sentiment_compound": 0.3724
        },
        {
            "id": "h63893i",
            "score": 1,
            "text": "Burn their fingers",
            "title_similarity": "0.3918162",
            "sentiment_compound": 0.0
        },
        {
            "id": "h638f6t",
            "score": 1,
            "text": "I have a skin picking disorder and recently shifted from picking my face until it bleed every night for hours, to now I sit and pull out my pubic hairs one by one with tweezers......the pain is somehow relieving but I think it is actually self harm, but at least people noticed lately that my \"acne\" on my face went away so that's good",
            "title_similarity": "0.6056311",
            "sentiment_compound": -0.4083
        },
        {
            "id": "h638gjo",
            "score": 1,
            "text": "I pull my ball hair out",
            "title_similarity": "0.35186875",
            "sentiment_compound": 0.0
        },
        {
            "id": "h638hg3",
            "score": 2,
            "text": "Goat cucchi  is better than human. Just out of the blue. Mortified me lmao",
            "title_similarity": "0.39738068",
            "sentiment_compound": 0.7783
        },
        {
            "id": "h638vzd",
            "score": 1,
            "text": "An old coworker of mine used to enjoy bragging about how she’d keep about seven different guys on hand at any given time so she could always go on a different date to the same location each night. \n\nSometimes more than one would even show up on the same nights she said. \n\nWell I was invited to go with her and a few other coworkers one time and guess what? It happened right in front of me. But luckily it appeared neither one particularly cared, like at all. 🤷‍♂️ They may have even been friends judging by the way they interacted.",
            "title_similarity": "0.5042213",
            "sentiment_compound": 0.9286
        },
        {
            "id": "h638xrl",
            "score": 1,
            "text": "I had a friend who just randomly told me that bugs sometimes get caught in his leg hair while he sleeps.",
            "title_similarity": "0.6048484",
            "sentiment_compound": 0.4939
        },
        {
            "id": "h639ciz",
            "score": 1,
            "text": "My high school best friend told me that my girlfriend called him and confided in him that her father died.\n\nThey shared a fifth of vodka then they started making out. He told me they had sex multiple times and they wore out the batteries on her vibrator.\n\nHe was 19 she was 15, he graduated 2 years ahead of me. He statutory raped my girlfriend and asked me to tell him it wasn’t that bad.\n\nI still have difficulty trusting people.",
            "title_similarity": "0.5822421",
            "sentiment_compound": -0.3818
        },
        {
            "id": "h639h6y",
            "score": 1,
            "text": "I remember the guy on YouTube who thought we’re supposed to use toilet paper to catch our shit.",
            "title_similarity": "0.65292776",
            "sentiment_compound": -0.5574
        },
        {
            "id": "h639hhz",
            "score": 1,
            "text": "Using Bronner’s “Sal-suds” as an alternative to an “expensive chemical peel you can do at home”",
            "title_similarity": "0.5170248",
            "sentiment_compound": 0.0
        },
        {
            "id": "h63aczi",
            "score": 1,
            "text": "Have a circle of biker \"friends\", they casually talked about women (at their age group or older) on tiktok whom they'd harass and do other worse things with. Casually they talk about this in front of our house while we were resting. Simply the fact they're younger than me (15-18) and talking about women like that is beyond me.\n\nI left them ✌️",
            "title_similarity": "0.5976461",
            "sentiment_compound": 0.1779
        },
        {
            "id": "h63atfw",
            "score": 1,
            "text": "i do that with nose hair",
            "title_similarity": "0.34143397",
            "sentiment_compound": 0.0
        },
        {
            "id": "h63ayue",
            "score": 1,
            "text": "That he brushes his teeth using the hot water tap.",
            "title_similarity": "0.4140967",
            "sentiment_compound": 0.0
        },
        {
            "id": "h63b6h9",
            "score": 1,
            "text": "My best friend eats kiwis with the skins on.",
            "title_similarity": "0.29191655",
            "sentiment_compound": 0.8126
        },
        {
            "id": "h63b736",
            "score": 1,
            "text": "A friend of mine said 'we just hit each other sometimes when we fight, just like normal couples do'. This was after the wife called the cops on him for domestic violence and he was explaining his side of the story.",
            "title_similarity": "0.63092333",
            "sentiment_compound": -0.25
        },
        {
            "id": "h63bfzv",
            "score": 1,
            "text": "My friend licks girls’ molars when making out.",
            "title_similarity": "0.4483135",
            "sentiment_compound": 0.4939
        },
        {
            "id": "h63bv6z",
            "score": 1,
            "text": "My friend once told me he jacked off under his sheets while his family was in his room reading a story",
            "title_similarity": "0.49074867",
            "sentiment_compound": 0.4939
        },
        {
            "id": "h63bzvz",
            "score": 1,
            "text": "A friend who attended boarding school in Saudi Arabia told me her class was taken to watch a beheading.\n\nWell, you said “upsetting”…",
            "title_similarity": "0.6259059",
            "sentiment_compound": 0.6486
        },
        {
            "id": "h63c2qk",
            "score": 1,
            "text": "My ex told me he only wipes a maximum of 5 times. That should be sufficient to clean off any poop. He didn’t like to check.",
            "title_similarity": "0.54060686",
            "sentiment_compound": 0.6369
        },
        {
            "id": "h63c3gz",
            "score": 1,
            "text": "\"I never use chapstick, I just wait for my lips to start peeling and rip the skin off\"",
            "title_similarity": "0.51538384",
            "sentiment_compound": 0.0
        },
        {
            "id": "h63c9s5",
            "score": 1,
            "text": "That If they didn’t get the job at Seaworld, their dream place, they’d shoot up the school. \n\nYes, police were called. Yes they were serious",
            "title_similarity": "0.5370493",
            "sentiment_compound": 0.5719
        },
        {
            "id": "h63cbri",
            "score": 1,
            "text": "Have a friend who got married with his girlfriend after finding out she's pregnant. He used to drink with my bf in our place and one time he got drunk, (a month before the wedding), he was like, \"can you call and get a girl (prostitute) for me to have sex with? I can't take it anymore since haven't f*cked my gf/fiancé for a long time since I got her pregnant.\" HE WAS DEAD SERIOUS.",
            "title_similarity": "0.5343109",
            "sentiment_compound": -0.5812
        },
        {
            "id": "h63cd3z",
            "score": 1,
            "text": "An acquaintance showed me pictures of a corpse he found. He had details of who it was and the circumstances too,which I found disturbing.",
            "title_similarity": "0.59724045",
            "sentiment_compound": -0.7906
        },
        {
            "id": "h63cfj3",
            "score": 1,
            "text": "I used to pluck my ball hairs. Just a few each day but it kept the grass mowed down. I quit for some reason and use a trimmer now.",
            "title_similarity": "0.55510056",
            "sentiment_compound": 0.0
        },
        {
            "id": "h63chtd",
            "score": 1,
            "text": "Friend of mine back in the day told me he doesn’t use a jerk rag/sock/tissue. Just lets the fly and goes about his day.",
            "title_similarity": "0.5550309",
            "sentiment_compound": 0.2023
        },
        {
            "id": "h63ck13",
            "score": 1,
            "text": "my dad likes to do this with his ear and nose hairs,  and I have watched him do it.   He LIKES it.  I actually understand.   I admit it,  i like a bit o pain sometimes.  I hope to grow mine long enough to do the same.",
            "title_similarity": "0.5812578",
            "sentiment_compound": 0.8494
        },
        {
            "id": "h63d3fi",
            "score": 1,
            "text": "A family member once told my spouse and I seeing our child makes her ovaries ache......yeah that was a weird one lol",
            "title_similarity": "0.5367327",
            "sentiment_compound": 0.2732
        },
        {
            "id": "h63df55",
            "score": 1,
            "text": "my buddy yanks out his nose hairs with his fingers",
            "title_similarity": "0.6744777",
            "sentiment_compound": 0.0
        },
        {
            "id": "h63dgiy",
            "score": 1,
            "text": "Actually my friend told me that he gets rid of his balls hair using this same crucial method 😭",
            "title_similarity": "0.7713729",
            "sentiment_compound": 0.0258
        },
        {
            "id": "h63dkt6",
            "score": 1,
            "text": "Something I told a friend of mine in college a couple of years back was that I thought of myself as being a bit of a sociopath, nothing that I thought was thay weird and still don't but his expression showed how appalled and taken aback he was",
            "title_similarity": "0.6755142",
            "sentiment_compound": -0.5023
        },
        {
            "id": "h63dmgu",
            "score": 1,
            "text": "My friend use to shave his nuts with a straight razor",
            "title_similarity": "0.61222935",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h63dunb",
            "score": 1,
            "text": "My buddy said when he jacks off he aims his nut towards his chest!!!😂crazy",
            "title_similarity": "0.5047057",
            "sentiment_compound": -0.4168
        },
        {
            "id": "h63e0j7",
            "score": 1,
            "text": "Apparently my buddy can suck his own dick.",
            "title_similarity": "0.567952",
            "sentiment_compound": -0.7351
        },
        {
            "id": "h63e8vu",
            "score": 1,
            "text": "My boyfriend yanks his hairs out of everywhere all the time. It's just grooming. Animals do it.",
            "title_similarity": "0.5646393",
            "sentiment_compound": 0.0
        },
        {
            "id": "h63eewd",
            "score": 1,
            "text": "someone told me that they had a friend who stole from him so he choked the guys kitten to death",
            "title_similarity": "0.5759156",
            "sentiment_compound": -0.6222
        },
        {
            "id": "h63f1t8",
            "score": 1,
            "text": "My cousin told me he does the same thing TO THE HAIRS AROUND HIS ASSHOLE. He said it helps with hygiene and to do it after a shower. So I did, and now it's a regular thing for me too.",
            "title_similarity": "0.65159",
            "sentiment_compound": 0.3818
        },
        {
            "id": "h63f52r",
            "score": 1,
            "text": "My friend brushes before having his breakfast, and claims it’s normal.\nEdit: after*",
            "title_similarity": "0.5567803",
            "sentiment_compound": 0.4939
        },
        {
            "id": "h63fcko",
            "score": 1,
            "text": "Don’t have a story right now just wanted to say that as a guy I am thoroughly enjoying this thread.",
            "title_similarity": "0.49429315",
            "sentiment_compound": 0.5709
        },
        {
            "id": "h63fo1z",
            "score": 2,
            "text": "A girl friend I had from 12-years-old told me that she gets horny when she walks barefoot on gravel",
            "title_similarity": "0.45263457",
            "sentiment_compound": 0.4019
        },
        {
            "id": "h63fzyu",
            "score": 1,
            "text": "Super Christian, no premarital sex, virgin Davina told me that she and another friend went to the sex festival in San Francisco and watched a circle jerk, she mentioned this just as casually as could be. I hope she found someone, it would be pretty lonely to still be a single virgin at 42.",
            "title_similarity": "0.5104214",
            "sentiment_compound": 0.9001
        },
        {
            "id": "h63g31i",
            "score": 3,
            "text": "Sometimes I yank my nose hairs out with my fingers\n\nNose hairs are almost basically mustache hairs, and thick so",
            "title_similarity": "0.5685436",
            "sentiment_compound": 0.0
        },
        {
            "id": "h63g3ff",
            "score": 2,
            "text": "Dude you just open a can of worms. I regret reading this thread.",
            "title_similarity": "0.5799743",
            "sentiment_compound": -0.4215
        },
        {
            "id": "h63gfee",
            "score": 1,
            "text": "A friend told me she'd let her baby burn in a fire if it meant saving her cat's life. Ex friend I mean. I have no place in my life for psychos.",
            "title_similarity": "0.5157938",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h63gtzf",
            "score": 1,
            "text": "One of my middle school friend casually saying she had hardcore sex around her house. It was so out of nowhere but I didn't really care.\n\nOne day, we were in class (it was so long ago, I forgot what was the context) and I mentioned having children with cousins may cause child deformities similar to children created from incestuous relationship.\n\nSaid friend was semi-furious saying that it's not true and we somehow dragged our teacher into the conversation. She said chance is low (At this point, my friend was looking at me triumphantly) but there is still a chance depending on how closely related you are (in which I said \"See? There's a chance\"). I ONLY realized much later that her current boyfriend is her cousin.\n\nYears later, I attended her wedding but I'm not sure if her husband is the boyfriend from years before since I lost contact with her for quite some years prior.",
            "title_similarity": "0.61733145",
            "sentiment_compound": 0.8858
        },
        {
            "id": "h63gtzr",
            "score": 1,
            "text": "I get rid of my ass hairs by yanking them.",
            "title_similarity": "0.69931245",
            "sentiment_compound": -0.5423
        },
        {
            "id": "h63gu0j",
            "score": 1,
            "text": "My friend took a shit in the urinal because he thought that when the shit gets flushed it will be like grounded meat because it goes through those tiny holes\n\nAlso he took a shit inside Nutella jars that were supposed to be used for cigarette butts disposal. He did it multiple times",
            "title_similarity": "0.6378007",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h63gy03",
            "score": 1,
            "text": "This isn’t upsetting, just sort of awkward.\n\nI got wasted one night with my friends, drank a lot, smoked weed and ate until my stomach was basically telling me that I’d regret it. We went out to this small place that’s a national park, not too far away from out the city. We brought booze and some snacks. I had brought us a giant blunt, pure; not a spliff. I took like 3 puffs from it, and after a few minutes I started feeling like I was paralyzed - it was the middle of the winter so I couldn’t move at all. I ended up thinking that I was gonna die, because I could only look around with my eyes. Couldn’t talk, move anything or even make any sort of noise. My friends noticed that I wasn’t okay and two of my friends helped me up and helped me walk a few meters, and afterwards: I ended up throwing up my entire stomach.\n\nAfter I had completely covered a portion of the ground in vomit - my two friends offered to take me home. One friend had to go back and get his phone, whilst the other stayed with me. After the first friend went back to get his phone, the second friend decided it was a good time to confess his love for me - by attempting to make-out with me. Now, I’m bisexual, but I never liked him like that. I still remember his words, \"give me those lips,\" as if it’s from a romance movie. I shortly realised what he was going to do, and pushed myself away and told him, \"no no no, stop.\"\n\nWe’re still friends, I’m just wary around him nowadays.\n\nEdit: I should mention that he was also drunk. We both drank together.",
            "title_similarity": "0.543481",
            "sentiment_compound": 0.9026
        },
        {
            "id": "h63h0u1",
            "score": 1,
            "text": "One thing my friends find upsetting is that I “clip” my nails with other nails. My nails are decently strong but they are weak enough that I can use the nails to destroy the nails.",
            "title_similarity": "0.5919398",
            "sentiment_compound": -0.8151
        },
        {
            "id": "h63iq2s",
            "score": 1,
            "text": "My friend swallows the toothpaste and everything after brushing his teeth.",
            "title_similarity": "0.4958061",
            "sentiment_compound": 0.4939
        },
        {
            "id": "h63j74s",
            "score": 2,
            "text": "One time a friend confessed that he cleans his ass hairs by yanking them out by the handful. And how the one that he ripped out a hair on his asshole he finally understood civilian casualties in war and the price of conflict.\n\nGreat guy! He's working for the UN now as some sort of student intern I believe?",
            "title_similarity": "0.76434857",
            "sentiment_compound": -0.4003
        },
        {
            "id": "h63n0i7",
            "score": 1,
            "text": "My friend said if his gf visits a day or two after he watched porn, he can't get his thing up... My friend",
            "title_similarity": "0.58796036",
            "sentiment_compound": 0.7506
        },
        {
            "id": "h63o0dj",
            "score": 1,
            "text": "I friend once told me that she can flex her boobs and showed me, it was wiredly cool",
            "title_similarity": "0.39624354",
            "sentiment_compound": 0.6705
        },
        {
            "id": "h63oid9",
            "score": 1,
            "text": "That he cools chicken nuggets in the microwave..",
            "title_similarity": "0.28515923",
            "sentiment_compound": 0.0
        },
        {
            "id": "h63pekp",
            "score": 1,
            "text": "I'm not sure I'd call her a friend exactly but there was this girl I would occasionally sleep with at uni that, from what I can tell, was trying to pimp me out to her friends.\n\nOne night she started telling me about her friend who \"doesn't do too well with guys but really wants to have sex with you. Here's a picture of her, will you sleep with her?\"\n\nI looked at the picture, wasn't attracted to the friend, declined and just laughed it off as a weird conversation.\n\nA couple of weeks later she found me on a night out after I was a few drinks deep and started encouraging me to go back to hers, which I was all for until \"my friend, that one I showed you the picture of. She's waiting in my flat. I told her I'd come out to get you. She's traveled two hours to get here to have sex with you.\"\n\nFortunately even though I was drunk I still recognised this as fucking weird and told her it wasn't happening and I wasn't going back with her. \"Is it because she's a girl? I've got a guy friend who'd like to sleep with you instead if that's more your thing...\"\n\nNeedless to say I stopped seeing her after that. I heard from some mutual friends that after I started avoiding her she moved on to another guy and started the same thing with him...before moving on to a third guy. Apparently we were all the \"same type\" which to me means nerdy long haired game students.",
            "title_similarity": "0.5508326",
            "sentiment_compound": 0.9769
        },
        {
            "id": "h63pg97",
            "score": 1,
            "text": "I don’t think it’s that bad compared to what everyone is saying here, but I know a girl that told me she cannot stand ketchup, and she cannot eat anything that is red, because it reminds her of ketchup. She’s vegetarian & she just refuses to eat anything red.",
            "title_similarity": "0.4471846",
            "sentiment_compound": -0.3071
        },
        {
            "id": "h63qadw",
            "score": 1,
            "text": "Back in the days a guy from our social circle told us that he \"fucked\" his younger brother. I was completely shocked and went on to talk to his younger brother as soon as possible. \n\nYounger brother told me that he hasn't fucked him, but \"rimmed\" him with his dick. It does make the thing slightly better but still gross. \n\nFYI: These 2 guys where 15 and 12 back then.",
            "title_similarity": "0.6689732",
            "sentiment_compound": -0.6284
        },
        {
            "id": "h63qo2f",
            "score": 1,
            "text": "I’m in the states and a bud from the EU showed me a picture of fucking beans on toast??",
            "title_similarity": "0.45704612",
            "sentiment_compound": 0.0
        },
        {
            "id": "h63qo9j",
            "score": 1,
            "text": "My old man yanks his dick hair.",
            "title_similarity": "0.63271594",
            "sentiment_compound": -0.5106
        },
        {
            "id": "h63rif3",
            "score": 1,
            "text": "Female friend of mine once casually told me that 6months after breakup, she still has all his passwords and regularly checks on his facebook and insta inboxes to see who he is writing with and stuff.\n\nMade it sound like it was a witty thing to do and as if she was expecting me to laugh about it.\n\nShe shattered a good part of my trust in people. Because of her i will NEVER share my personal passwords, not even with my gf",
            "title_similarity": "0.55804473",
            "sentiment_compound": 0.9045
        },
        {
            "id": "h63rskj",
            "score": 1,
            "text": "My friend couldn’t comprehend the concept of me having a portable AC. He thought that either you have central AC or you don’t. He still gets confused when I tell him I have the AC on in the heat and I have to explain to him that it’s just an AC from home depot.",
            "title_similarity": "0.608973",
            "sentiment_compound": 0.2263
        },
        {
            "id": "h63tlvy",
            "score": 1,
            "text": "Girl I used to crush on said the same about public hair.",
            "title_similarity": "0.5833785",
            "sentiment_compound": -0.1531
        },
        {
            "id": "h63uinb",
            "score": 1,
            "text": "I pluck my pubes too",
            "title_similarity": "0.41056338",
            "sentiment_compound": 0.0
        },
        {
            "id": "h63w2n2",
            "score": 1,
            "text": "That they make forty dollars more an hour for doing contract work and are asked to do it more often by company head.",
            "title_similarity": "0.4275438",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6408f3",
            "score": 1,
            "text": "How?",
            "title_similarity": "0.101525865",
            "sentiment_compound": 0.0
        },
        {
            "id": "h644bb3",
            "score": 1,
            "text": "Me and my buddy at the time went to the gym. He was a gym rat and I was a noob.\n\nI hopped on the leg press machine and he came over to me and whispered for me to get off it.\n\nHe was 100% serious when he said that men don't do leg workouts.\n\nI finished my set and left. What a tool.",
            "title_similarity": "0.5916953",
            "sentiment_compound": -0.128
        },
        {
            "id": "h64iids",
            "score": 1,
            "text": "I do that to my nose hair.",
            "title_similarity": "0.39252603",
            "sentiment_compound": 0.0
        },
        {
            "id": "h64lnwx",
            "score": 1,
            "text": "Not said, but did. My friends came back from getting pho and wanted some ice cream from 711, my friend dropped his and he picked it up right off the ground in the sidewalk. Surprised he is still alive.",
            "title_similarity": "0.5963127",
            "sentiment_compound": 0.9349
        },
        {
            "id": "h653wjj",
            "score": 2,
            "text": "In my high school chemistry class, kid that sat next to me comes in one day with a big smirk on his face. When I ask him what’s up? He proudly tells me “you know that annoying girl in my cooking class… well today, I stepped out into the hallway, grabbed a handful of pubs and put them in her taco” and then proceeded to watch her eat the taco and asked her to rate it on a scale of 1-10",
            "title_similarity": "0.36341575",
            "sentiment_compound": 0.4588
        },
        {
            "id": "h65c8te",
            "score": 1,
            "text": "Washing face with hand soap",
            "title_similarity": "0.34676665",
            "sentiment_compound": 0.4939
        },
        {
            "id": "h65cq2s",
            "score": 1,
            "text": "In college we were working as bar staff during a slow night when one of the guys told us this in the  most honest - I'm. -gonna - impart -some -knowledge voice:\n\n\"You know the snatch on a female sheep looks just like a woman's snatch\"\n\nHe did this while holding is finger pressed together like he was grabbing pussy lips.\n\nWe got ultra quiet\n\nsomeway somehow we didn't wanna know how he knew.",
            "title_similarity": "0.5979856",
            "sentiment_compound": 0.8221
        },
        {
            "id": "h65oljy",
            "score": 1,
            "text": "“Earwax smells better than it tastes.”\n\nNot really a *close* friend.",
            "title_similarity": "0.5159773",
            "sentiment_compound": 0.7479
        },
        {
            "id": "h67punh",
            "score": 1,
            "text": "Really if a friend confides in me then I feel it polite to listen",
            "title_similarity": "0.3502966",
            "sentiment_compound": 0.5367
        },
        {
            "id": "h68ar26",
            "score": 1,
            "text": "A former best friend of mine randomly told me him and his gf (at the time) fuck dogs.\n\nNeedless to say, we are not friends anymore.",
            "title_similarity": "0.68015355",
            "sentiment_compound": 0.3283
        },
        {
            "id": "h693k0s",
            "score": 2,
            "text": "A dude of mine told me, outside on the open street,\nThat he yanks out the hair around his evil brown eye.\n\nWhy would anyone ever say that without getting asked? No clue.\nWhy would you clean your house when you don't expect visitors?\nNo clue.\nThe dude is homophobic",
            "title_similarity": "0.6971024",
            "sentiment_compound": 0.1119
        },
        {
            "id": "h69jcbs",
            "score": 1,
            "text": "After eating some fast food and driving down the road, he threw his garbage out the window. I was shocked because I respected and thought this guy was pretty cool up until than. When I said \"man why are you littering\" he says \"ohh dont worry about it that's what the clean up crews are for\". I than say \"oi mate you bloody wanker, people like you are the reason those crews exist ya bloody cunt i'll bang you up\".\nAfter that happened he got mad and tried to punch me. But luckily I had been training brazilian jujitsu and was easily able to subdue him. After he begged for mercy, he apologized and bought me some delicious spicy chicken tenders from popeyes with the blackened ranch to dip in. All was well after that and now we are better friends than ever. And he doesn't litter anymore!",
            "title_similarity": "0.6240752",
            "sentiment_compound": 0.9829
        },
        {
            "id": "h6muhpx",
            "score": 2,
            "text": "In High school a friend of mine got kicked out of his house and my grandma let him spend the night. While he was sitting on my bed, we started talking about skin care routines for some reason and this guy straight up tells me with all honesty that every time he showers, he nuts in a washcloth, mixes it with his body wash and scrubs his entire body with it. His “Secret moisturizer” is what he called it.\n\nNever talked to him much after that not gonna lie",
            "title_similarity": "0.60395694",
            "sentiment_compound": 0.8481
        },
        {
            "id": "h809ipm",
            "score": 1,
            "text": "That's how I get rid of my ball hair.",
            "title_similarity": "0.5621165",
            "sentiment_compound": 0.0
        },
        {
            "id": "h89fth1",
            "score": 1,
            "text": "\"I shower every two or so days.\"\n\nFucking gross, dude. Doubly so in the pandemic.",
            "title_similarity": "0.54474235",
            "sentiment_compound": -0.5657
        },
        {
            "id": "h98r1cb",
            "score": 1,
            "text": "That they shave off their genital worts in the shower as casually as they shave their body hairs. I don’t have the heart to say anything about it.",
            "title_similarity": "0.584844",
            "sentiment_compound": 0.7096
        },
        {
            "id": "h9dtt8r",
            "score": 1,
            "text": "A lot if you mfs had psychopaths as friends",
            "title_similarity": "0.573082",
            "sentiment_compound": 0.4767
        },
        {
            "id": "h9dw7z4",
            "score": 1,
            "text": "FUCK IT'S PAINFUL WHY DID YOU SUGGEST IT",
            "title_similarity": "0.45222294",
            "sentiment_compound": -0.7506
        }
    ]
}