{
    "Men who married their wives just for their looks, how is it going?\nInspired from r/AskWomen": [
        {
            "id": "huuwadt",
            "score": 5,
            "text": "You marry a set of big tits and they end up like deflated water balloons. Don’t do it!",
            "title_similarity": "0.45788917",
            "sentiment_compound": 0.2244
        },
        {
            "id": "huu2rjb",
            "score": -4,
            "text": "Right now I am together with a girl. I got really into her, because of the way she was: cute and submissive - our relationship was kind of crazy and I was really into it.\n\nLately she starts losing weight and therefor looks better, she also takes more care of her looks, but on the same time got so exhausting. She is trying to make me a good father or something with her childisch behavior. Anyways her new figure is what makes me stay.",
            "title_similarity": "0.6356374",
            "sentiment_compound": 0.0997
        },
        {
            "id": "huuzv7v",
            "score": 1,
            "text": "The looks fade as the years pass and kids arrive. Doggy is now my favourite position",
            "title_similarity": "0.33079612",
            "sentiment_compound": 0.0
        },
        {
            "id": "hutqhtl",
            "score": 32,
            "text": "[removed]",
            "title_similarity": "0.022824204"
        },
        {
            "id": "huvrupi",
            "score": 3,
            "text": "It's going great, still let's me finish on her face.",
            "title_similarity": "0.38338906",
            "sentiment_compound": 0.6249
        },
        {
            "id": "huueft1",
            "score": 10,
            "text": "My wife is and was an incredibly beautiful woman. She has the most amazing body and was always a head turner. I knew from the second we met that she was out of my league and took more than a month to convince her to go out with me. We've been married for ten years now, we have two girls that look just like her (except for skin tone) and we're going strong.\n\nI have repeatedly told her she got the short end of the stick in the married to the hot one department, but I get to take her out, ten years and two kids later, and still walk into a place and confidently know she's the hottest woman in the place.\n\nTo add to it, she's 13 years younger than me, so I get absolutely insane looks from people with the \"what the hell did that guy do to deserve her\" looks, which oddly makes me feel amazing. But, outside of that, we're absolute best friends who constantly find new adventures together. She has even said quite a few times that because of the way I treat her, she feels like she doesn't deserve me. So... Sometimes it works out.",
            "title_similarity": "0.62865293",
            "sentiment_compound": 0.9806
        },
        {
            "id": "huu5aes",
            "score": -2,
            "text": "If you wanna be happy for the rest of your life\n\nNever make a pretty woman your wife\n\nSo for my personal point of view\n\nGet an ugly girl to marry you\n\n.\n\n.\n\n.\n\n\nedit: at least four people don't get the reference",
            "title_similarity": "0.57033557",
            "sentiment_compound": -0.3022
        },
        {
            "id": "huuftfg",
            "score": 5,
            "text": "Still going strong after 20 years, she's just matured in to a sexy milf now, big tits nice arse n legs , she sucks dam good aswell , couldn't ask more more I am lucky. She has a Beyonce look about her. Her natural smell gets me off..",
            "title_similarity": "0.52130777",
            "sentiment_compound": 0.9269
        },
        {
            "id": "hutfs1u",
            "score": 205,
            "text": "I have been married to my beautiful wife for 30 years, 3 kids later and she is still my everything and best friend but it’s a 2 way street and like I tell younger couples it hasn’t been a flat stretch of road and at the end of the day it takes both of us to hold it together, that’s worked for us so far.",
            "title_similarity": "0.49845493",
            "sentiment_compound": 0.8555
        },
        {
            "id": "huto5m3",
            "score": -35,
            "text": "Never marry for looks. Marry for personality because after your married guess what you can send her somewhere and get implants and lipo and what ever else physical you or her want done. But like Ron White has said you can’t fix stupid.\n\nSo by the 26 down votes I’m guessing you want to marry for looks and not personality.",
            "title_similarity": "0.65487725",
            "sentiment_compound": -0.1901
        },
        {
            "id": "huu2xup",
            "score": 3,
            "text": "I married my wife for her body. Her face is so-so. We've been together for 18 years and I still enjoy getting naked with her.",
            "title_similarity": "0.5826343",
            "sentiment_compound": 0.4939
        },
        {
            "id": "hutwg4w",
            "score": -10,
            "text": "Hard to find beauty + brains + loving + kind woman. \nIt’s like finding a unicorn! 🦄",
            "title_similarity": "0.43369696",
            "sentiment_compound": 0.9259
        },
        {
            "id": "huvgo9y",
            "score": 4,
            "text": "I married my wife for looks and smarts. First looks then as I was helping her move in with me ( after getting married) I found certificates that she's Mensa from London, San Francisco, Dallas. We got married within three months of meeting each other and 16 years and three kids later, she's my BFF and she's not let me do any house hold chores in 16 years, my clothes get laundered, food magically appears, she never demanded that I do kid duty..and to think she used to be VP of a major bank and hire and fire people. \nI am grateful how my life turned out to be. I really think we have a connection that goes beyond this life.",
            "title_similarity": "0.59292907",
            "sentiment_compound": 0.8933
        },
        {
            "id": "huto8nt",
            "score": -38,
            "text": "If you want to be happy for the rest of your life\nNever make a pretty woman your wife\nSo for my personal point of view\nGet an ugly girl to marry you\n\nA pretty woman makes her husband look small\nAnd very often causes his downfall\nAs soon as he married her and then she starts\nTo do the things that will break his heart\n\nBut if you make an ugly woman your wife\nAh you'll be happy for the rest of your life\nAn ugly woman cooks meals on time\nShe'll always give you peace of mind\n\nDon't let your friends say you have no taste\nGo ahead and marry anyway\nThough her face is ugly, her eyes don't match\nTake it from me, she's a better catch\n\nSay man! Hey baby!\nI saw your wife the other day!\nYeah? Yeah, an' she's ugly!\nYeah, she's ugly, but she sure can cook, baby!\nYeah, alright!\n\nUpdate: just so you know, this is an oldie song. Not my actually thoughts on the matter. The post just reminded me of this song. It really shows how different the world was back then. That is all.",
            "title_similarity": "0.6257654",
            "sentiment_compound": 0.6676
        },
        {
            "id": "huv8hg4",
            "score": -2,
            "text": "I knew somebody would ask this. I think I did this without fully understanding it. Couple years into the marriage she got a breast reduction. I realized I was no longer was sexually attracted to her as the surgery is violent to her appearance and it wasn’t done from an illness so sex dropped to about 1/10th of what it was if that. She originally claimed the pain was debilitating but later admitted that it was to fit into “cuter clothes” and that she went heavy on the pain complaint so insurance would pick it up and she feared they wouldn’t. Afterwards, oddly enough, she actually did develop back pain like many of us do so the complaining about it mostly fell on deaf ears as supposedly this surgery was to originally solve her discomfort issue.  Ultimately the dishonesty for her sense of vanity was really pretty disgusting to me. No sex from there meant essentially no communication. From there we went from married couple to more like siblings or just room mates. Relationship over. Having been away from her awhile now I do miss her at times but I’m also grateful to be away from her narcissism. \n\n  I’ve shared this before to get hit with a wall of angry women regarding “objectification” or “fetish” etc… (or worse guys coming at me representing all of woman-kind and defending their honor)  I’m ok with this moniker as I think we all, men and women, have their *thing*. I’ve met so many women that absolutely will not date a guy under 5’10” or men that do not have hair, etc. That’s fine I think. Is it all women? No. But if a man is mainly attracted to a body part I think that’s pretty normal as well. In my case I just couldn’t fake being sexually attracted to my partner. We split on friendly terms.",
            "title_similarity": "0.60311913",
            "sentiment_compound": -0.1793
        },
        {
            "id": "huwmztw",
            "score": 0,
            "text": "This post is quite sexist, it proves women view men as some half witted idiots that only listens to their dick.",
            "title_similarity": "0.6205835",
            "sentiment_compound": -0.5106
        },
        {
            "id": "hutba49",
            "score": 87,
            "text": "[removed]",
            "title_similarity": "0.022824142"
        },
        {
            "id": "hutprvk",
            "score": 23,
            "text": "Married the tall pretty girl, super sweet and almost naive, kids are pretty too.  I did grow up with a hot mom that always got hit on, so standards were kinda high TBH.  26 yrs together now. Pretty girls have the same problems as ok girls I’ve found, you need to find sexual compatibility at the end of the day.  Equal sex drives matter.",
            "title_similarity": "0.6515519",
            "sentiment_compound": 0.9359
        },
        {
            "id": "hutpsmd",
            "score": -19,
            "text": "Marry for looks, work on their personality 🤙",
            "title_similarity": "0.65446126",
            "sentiment_compound": 0.4939
        },
        {
            "id": "huug1i4",
            "score": 1,
            "text": "fine i guess, annoys the shit outta me sometimes but the sex is good",
            "title_similarity": "0.45325327",
            "sentiment_compound": 0.705
        },
        {
            "id": "hutnvjb",
            "score": 19,
            "text": "Ten years in wife still hot. Mission successful... For now.....",
            "title_similarity": "0.39845368",
            "sentiment_compound": 0.5859
        },
        {
            "id": "hutoi8s",
            "score": 16,
            "text": "Any body I know IRL who married a conventionally attractive woman is divorced.",
            "title_similarity": "0.57367444",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hutg30l",
            "score": 30,
            "text": "Chads: i married her for everything, the looks is just a bonus",
            "title_similarity": "0.66983074",
            "sentiment_compound": 0.5423
        },
        {
            "id": "huu0dro",
            "score": 5,
            "text": "My friend married this hot girl , he had alot of money , now he is broke , she spend it all on gold and trips and expensive food and cars and now he hit rock bottom , i guess marry a rich girl that can support her own weight is an advice i would give and live by",
            "title_similarity": "0.65821666",
            "sentiment_compound": 0.7717
        },
        {
            "id": "huuac01",
            "score": 6,
            "text": "Found her in eharmony.  I was truthful in the massive amounts of questions they asking in who your looking for. I don't think she was. 15 years later she's gained 80 lbs and were in a completely sexless marriage. No spark. and im still paying off the debt she creates continually. Except now I'm also adding to that debt buying things in search of some kind of material happiness. Only difference between now and first seven years is that she's found a decent career making almost same money. But instead of saving for retirement at 45 years old.  We're paying off credit card debt together. So there is at least that.",
            "title_similarity": "0.52474177",
            "sentiment_compound": 0.4765
        },
        {
            "id": "hutrq0g",
            "score": 14,
            "text": "its ight, head is dope",
            "title_similarity": "0.19366293",
            "sentiment_compound": 0.0
        },
        {
            "id": "huu2v8o",
            "score": 6,
            "text": "What a good day to be demisexual",
            "title_similarity": "0.26898545",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hutrx1v",
            "score": 7,
            "text": "I got divorced last year hell we was separated more than married best decision I ever made and she didn’t get a dime haha 😂",
            "title_similarity": "0.4005411",
            "sentiment_compound": 0.6969
        },
        {
            "id": "hutoedq",
            "score": 215,
            "text": "Lol Reddit, imagine thinking that someone can find someone physically attractive and them ending up a great person to be around… no not on Reddit. The reality on Reddit is that ugly people have the top quality personalities and gorgeous people have hearts made of black coals.\n\nIn my experience some of the ugliest people are the most putrid toxic human beings I have ever come across due to how shit people have been to them. It really does create a monster.",
            "title_similarity": "0.5807463",
            "sentiment_compound": 0.8548
        },
        {
            "id": "huti56i",
            "score": -101,
            "text": "[removed]",
            "title_similarity": "0.022824142"
        },
        {
            "id": "huu2ny8",
            "score": 0,
            "text": "[deleted]",
            "title_similarity": "0.042279053"
        },
        {
            "id": "huv16fb",
            "score": 0,
            "text": "Here gents use this for reference -\nhttps://youtu.be/bbpGkrViOcE\n\n(Crazy/Hot matrix)",
            "title_similarity": "0.38021812",
            "sentiment_compound": 0.0
        },
        {
            "id": "huvju11",
            "score": 0,
            "text": "Yea, first wife married for looks, absolute 9 or a 10, as soon as I left for the army she started choking down as many dicks as she could. Got a divorce after a year when I finally returned home. \n\nGot remarried to a woman who made me laugh and was just as weird as me. Been together happily for 5 years now. Lesson I’ve learned looks while important are not everything. \n\nLoyalty is a lot more attractive than big tits that will sag to the floor in a few years anyway. 😂🤣",
            "title_similarity": "0.5960012",
            "sentiment_compound": 0.8703
        },
        {
            "id": "huwjj3d",
            "score": 0,
            "text": "It never lasts that way. It must be looks, and being into one another's interests. I found out after 17 years, and her looks fading, that she was faking until she made the relationship. I mean she was laying down the puss, but not after we almost got preggers, instead of going on the pill like every other women I dated.. I'm gonna have to find a lover, because she wants me too...",
            "title_similarity": "0.6394377",
            "sentiment_compound": 0.8422
        },
        {
            "id": "huwmpqn",
            "score": 0,
            "text": "Just like my Escalades... I make sure they don't get into an \"accident\" and trade in for a new model every 5 years or so.",
            "title_similarity": "0.39365122",
            "sentiment_compound": 0.1779
        },
        {
            "id": "huwuaad",
            "score": 0,
            "text": "Happy! 6 years in, two kids, she’s 15 years younger, life is grand.",
            "title_similarity": "0.23297492",
            "sentiment_compound": 0.7901
        },
        {
            "id": "huxrqba",
            "score": 0,
            "text": "“It’s your girlfriend, it’s just your turn” -G.C.",
            "title_similarity": "0.4834375",
            "sentiment_compound": 0.0
        },
        {
            "id": "hutypcj",
            "score": 80,
            "text": "My grandpa had a fiancee when he meet my Grandma, when he saw my grandma he broke up with his fiancee,\n\nI asked him why a few years ago he said \"my ex was a good lady, but your grandma had a smaller nose and fuller lips\"\n\nThey've been married young since the 60's, he died November 2020, they were together until his  death :,)\n\n&#x200B;\n\nhe also went to his ex's house and invited her and her mom to his wedding, not sure if stupid or \"alpha\"",
            "title_similarity": "0.6752681",
            "sentiment_compound": -0.8744
        },
        {
            "id": "hut4rht",
            "score": 21,
            "text": "Swimmingly.",
            "title_similarity": "-0.005986683",
            "sentiment_compound": 0.0
        },
        {
            "id": "hutlvx9",
            "score": 149,
            "text": "I got lucky and married my soul mate who ages like red wine. I never married her for her looks though. She just makes me complete. I had a trophy girlfriend decades ago who was abusive but my penis was making the decisions. She was one of those “if you’ve got it, flaunt it” girls. Well, she doesn’t still have the looks and all I would have ended up with is an abusive bitch. Tits and ass only get you so far. She’s got two kids and is (surprise) divorced.",
            "title_similarity": "0.670069",
            "sentiment_compound": -0.9408
        },
        {
            "id": "huuk9rr",
            "score": 37,
            "text": "My wife was a beauty queen... literally.\n\n35 years later she drinks too much. Doesn't work out. Has Alopecia, and has no eyebrows, and is going bald. She has had several skin cancers that have been removed, and overall I am not attracted to her. I love her. I won't leave her, but I am not attracted to her.\n\nFor better or worse.\n\nSo it goes.",
            "title_similarity": "0.5235921",
            "sentiment_compound": -0.1255
        },
        {
            "id": "hutxwog",
            "score": 13,
            "text": "Some advice my friend gave me after I broke up with a beautiful woman: “No matter how how hot she is, there’s somebody somewhere that’s sick of her bullshit.”",
            "title_similarity": "0.68926525",
            "sentiment_compound": 0.2732
        },
        {
            "id": "huttueg",
            "score": 5,
            "text": "Not good, turns out I can’t deal with crazy for long periods of time.",
            "title_similarity": "0.14798027",
            "sentiment_compound": -0.5867
        },
        {
            "id": "huu360h",
            "score": -6,
            "text": "I havent married a girl off looks. But I have fwbs with girls at my school based mostly off looks. I'm a white guy whos into brown girls and since I'm tall and attractive, they're generally attracted to me. In addition to them normally being fairly academically inclined, since I go to a top school in the country. Which is a great by product I guess. I never plan on getting married because I know countless couples who get divorced 20-30 years in. If a girl truly messes with you, marriage wont matter to her believe me. More than likely she wants something like kids or money, even if she claims she isnt a gold digger. These chicks now a days are brutal, every last one of em.",
            "title_similarity": "0.63159984",
            "sentiment_compound": 0.9496
        },
        {
            "id": "huv13xm",
            "score": 6,
            "text": "My parents didn’t marry for look and now I have small eyes, no lips, no chin, and big fucking ears",
            "title_similarity": "0.33588856",
            "sentiment_compound": -0.0803
        },
        {
            "id": "huttf1e",
            "score": 1,
            "text": "simple . are you a just gatekeeper,",
            "title_similarity": "0.14451443",
            "sentiment_compound": 0.0
        },
        {
            "id": "hutw8yk",
            "score": -1,
            "text": "Her atrocious personality was a bit to get used to but the head game was undeniably great.",
            "title_similarity": "0.37247396",
            "sentiment_compound": 0.7684
        },
        {
            "id": "hutyy67",
            "score": -1,
            "text": "shes still fuckin ugly but our marriage stays strong.",
            "title_similarity": "0.41284782",
            "sentiment_compound": 0.486
        },
        {
            "id": "huu1ydn",
            "score": 1,
            "text": "ask johnny depp",
            "title_similarity": "0.25887042",
            "sentiment_compound": 0.0
        },
        {
            "id": "huu4a6z",
            "score": 1,
            "text": "Reading the comments here is so sobering, lol. A lot of wisdom in one place.",
            "title_similarity": "0.31054267",
            "sentiment_compound": 0.6264
        },
        {
            "id": "huu8j2f",
            "score": 1,
            "text": "Lmao like galaxy brain redditors are going to upvote happy stories about marriages based on looks 😂",
            "title_similarity": "0.70487654",
            "sentiment_compound": 0.9186
        },
        {
            "id": "huudfi7",
            "score": 1,
            "text": "*looks at my wife*\n\nI’ll see myself out",
            "title_similarity": "0.4840235",
            "sentiment_compound": 0.0
        },
        {
            "id": "huuqqil",
            "score": -1,
            "text": "Pretty damn good. 20 years later she's still smoking hot and hasn't put any weight. Couldn't be happier.",
            "title_similarity": "0.39294288",
            "sentiment_compound": 0.1591
        },
        {
            "id": "huurk3x",
            "score": 1,
            "text": "Yeah, don't do it.   She's now plump & I'm miserable",
            "title_similarity": "0.24929568",
            "sentiment_compound": -0.25
        },
        {
            "id": "huuvoff",
            "score": 1,
            "text": "Do not fall for this trick!! Don't answer!!!",
            "title_similarity": "0.12250246",
            "sentiment_compound": -0.3438
        },
        {
            "id": "huuzh8b",
            "score": -1,
            "text": "This whole question is based on the premise that we understand why we feel and believe things, which is largely not the case.  We rationalize.  Our minds subconsciously invent reasons for what feelings motivated us to do.  Nowhere will this be more true than physical attraction.\n\nOn that basis, \"I love all of you\" is something somebody would classically say - *and believe* \\- while they are committed to / stuck with somebody.\n\nLikewise, \"I never really loved you\" is something somebody would say, and believe, after it is over.\n\nCheck out the studies on split-brain individuals - if you direct them to do something, it is handled by their right brain and they obey.  Then if you ask them why they did it, they unknowingly make up a rationalization, genuinely believing they did it of their own free will.\n\n[https://www.psychologytoday.com/us/blog/mind-brain-and-value/202008/psychology-the-left-hemisphere-the-brains-interpreter](https://www.psychologytoday.com/us/blog/mind-brain-and-value/202008/psychology-the-left-hemisphere-the-brains-interpreter)\n\nSo, whether somebody ends up believing that they married somebody else based solely on looks is largely dependent on how it turned out.  Somebody who is smitten is unlikely to realize it at the time.",
            "title_similarity": "0.64059997",
            "sentiment_compound": 0.9236
        },
        {
            "id": "huv0zay",
            "score": 1,
            "text": "We didn’t marry just for our looks, I don’t know anyone who does. Together 21 years, married 15.  Doing amazing.",
            "title_similarity": "0.5099478",
            "sentiment_compound": 0.5859
        },
        {
            "id": "huv2juk",
            "score": 1,
            "text": "Im not yet married, but my girlfriend is not only smart, but even smarter than me, knows 4 languages, and sometimes I feel like the dumb one, but its not like she is ugly, in fact i love her so much that i dont care if she doesnt have the perfect body, or of she is always with makeup and whatever, in my mind she is the most beutiful woman in this realm, but it wasnt looks what got me to her, it was speaking hours and hours without stopping, and we barely stopped talking since we met, I think you all should look for a woman like that, with hoom you can speak for hours and hours, you will love her looks whatever they are.",
            "title_similarity": "0.54106975",
            "sentiment_compound": 0.2417
        },
        {
            "id": "huv7ywk",
            "score": 1,
            "text": "I am guessing you will not get the response that you are looking for.",
            "title_similarity": "0.19402534",
            "sentiment_compound": 0.0
        },
        {
            "id": "huvh1xi",
            "score": -1,
            "text": "Horrible... looks faded and now I'm stuck with a mean old bag.",
            "title_similarity": "0.1953525",
            "sentiment_compound": -0.6705
        },
        {
            "id": "huvhcte",
            "score": -1,
            "text": "Pretty damn good considering 20yrs...rear end & midriff a bit loose but for age...and temprement excellent though sometimes a bit mad.",
            "title_similarity": "0.3370635",
            "sentiment_compound": 0.3182
        },
        {
            "id": "huvk78v",
            "score": -1,
            "text": "Look will fade while the cooking only tends to get better - the great Terry Pratchett",
            "title_similarity": "0.39559096",
            "sentiment_compound": 0.7906
        },
        {
            "id": "huvt2vl",
            "score": 1,
            "text": "Lol the real question is what man doesn’t marry his wife for her looks.",
            "title_similarity": "0.7470406",
            "sentiment_compound": 0.4215
        },
        {
            "id": "huwiqfc",
            "score": 1,
            "text": "im 22, haven't married anyone but I do have input.\n\nI've dated all kinds of girls, those less conventionally attractive but with beautiful personalities, those who are extremely beautiful but shallow and boring, and those who are beautiful AND have amazing personalities\n\nI'll tell ya this, gorgeous women are often either completely egotistical and shallow, or they are just amazing people because they lack insecurity which is a huge catalyst of issues\n\nthe most wholesome and good-energy girls i dated were the beautiful ones, even if we had nothing in common it was nice to just vibe with someone who has their shit together mentally\n\ni'll aim for beautiful + put-together, common interests aren't as important.",
            "title_similarity": "0.6052551",
            "sentiment_compound": 0.9926
        },
        {
            "id": "huxfxmv",
            "score": -1,
            "text": "Divorce is the leading source of income in rich women",
            "title_similarity": "0.5376626",
            "sentiment_compound": 0.5574
        },
        {
            "id": "huxpc3k",
            "score": 1,
            "text": "I married mine for looks but got lucky she’s also an amazing mom/person.",
            "title_similarity": "0.6914906",
            "sentiment_compound": 0.872
        },
        {
            "id": "huu2ugw",
            "score": 6,
            "text": "Going strongest than ever after 16 years and she’s getting gorgeous by the day",
            "title_similarity": "0.24756896",
            "sentiment_compound": 0.7845
        },
        {
            "id": "huujjfg",
            "score": 23,
            "text": "I'm going to be honest here. My wife has always been beautiful (met our 2nd week of college at 17 years old). I married her because she was and still is my best friend but the looks certainly don't hurt. Married at 23. Had two kids about 10 years later. Just celebrated our 20th wedding anniversary and I am still as attracted to her as ever. She is a smoke show and I still can't keep my hands off her. She pays close attention to what she eats and we both watch our weight. But it is more than just looks - it is her personality, energy, smarts, friendship, etc. that makes her even more hot in my eyes. I won the life lottery and I know it.",
            "title_similarity": "0.5553353",
            "sentiment_compound": 0.9883
        },
        {
            "id": "hutvq8v",
            "score": 15,
            "text": "I married mine for her personally now 3 years later we are divoring.",
            "title_similarity": "0.45182064",
            "sentiment_compound": 0.0
        },
        {
            "id": "huu0t0a",
            "score": 9,
            "text": "My girl has treated me like I'm nothing to her I've hurt for 3dsyd strait now can anyone show me how it feels to be happy even if it's for the moment all I know is pain. I'm free hit me up at any time I need company.",
            "title_similarity": "0.45959908",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hutehhe",
            "score": 2,
            "text": "Great.",
            "title_similarity": "0.03880273",
            "sentiment_compound": 0.6249
        },
        {
            "id": "hutzlkg",
            "score": 2,
            "text": "Its going pretty well",
            "title_similarity": "0.14447585",
            "sentiment_compound": 0.6486
        },
        {
            "id": "huu8rki",
            "score": 2,
            "text": "My wife is way out of my league, been together since I was 18 and she was 16, still together and happy, have 3 children now, our youngest will be 6 in 2 weeks.",
            "title_similarity": "0.41466486",
            "sentiment_compound": 0.5719
        },
        {
            "id": "huuhoiu",
            "score": 2,
            "text": "I didn't marry for looks, although I found her beautiful when we met. The astonishing thing is that I find her just as beautiful 43 years later. I didn't expect that. If this is infatuation it's a pretty long one.",
            "title_similarity": "0.6166656",
            "sentiment_compound": 0.9118
        },
        {
            "id": "huulsir",
            "score": 2,
            "text": "If you wanna be happy for the rest of your life, never make a pretty woman your wife!",
            "title_similarity": "0.49513605",
            "sentiment_compound": 0.3322
        },
        {
            "id": "huusho5",
            "score": 2,
            "text": "My mom chased my dad just for his looks, they are really different and now they have been married for 27 years or so. They argue about stuff most days but I’d still say they are very happy",
            "title_similarity": "0.66272706",
            "sentiment_compound": 0.6994
        },
        {
            "id": "huuubh7",
            "score": 2,
            "text": "Yesterday we looked at some old photos, and my wife was a smoking hot teenager who never realised how beautiful and sexy she was. I didn't marry *just* for looks, because she's also kind and super smart both of which I find even more attractive than beauty. After 30 years, we don't have teenage bodies any more, but hnnnnngggggg.",
            "title_similarity": "0.60997665",
            "sentiment_compound": 0.8502
        },
        {
            "id": "huuvjwv",
            "score": 2,
            "text": "Pretty good! Together for 10 years married for about 8 and have a 6 year old daughter, still have loads of fun and fancy the pants off of each other.  She's my everything and I'm hers.",
            "title_similarity": "0.4761026",
            "sentiment_compound": 0.8655
        },
        {
            "id": "huuynyw",
            "score": 2,
            "text": "ITT: 50/50 chance your beautiful wife is also not an airhead.",
            "title_similarity": "0.43069094",
            "sentiment_compound": 0.7096
        },
        {
            "id": "huuzfad",
            "score": 2,
            "text": "I fell in love with her and have great sex weekly 10 years later. Relationships can develop even if they start for superficial reasons. Beautiful women can shockingly be beautiful people if you grow together through the bullshit that is life. Just want to be on the pro-marriage and beautiful wives' side. Happy men do exist, and life is good.",
            "title_similarity": "0.68293095",
            "sentiment_compound": 0.9732
        },
        {
            "id": "huv1jqm",
            "score": 2,
            "text": "My GF is quite hot, an 8 when she wakes up I'd say - a 9 when well dressed and with the minimum amount of make-up.\n\nShe doesn't challenge me mentally though but... she's a fighter, she's tough and emancipated and this is a thing I love a lot about her and I feel I can fully trust her. She's a \"pillar\".\n\nSometime we find a topic we're both interested in and I get that minimum amount of mental challenge I need so I'm fine. Also, I'm an introvert and I don't speak much and I love to learn stuff all the time from any source so I can find ways to mentally challenge myself. I brainsturbate a lot",
            "title_similarity": "0.44110182",
            "sentiment_compound": 0.9801
        },
        {
            "id": "huva8w8",
            "score": 2,
            "text": "Met at 19.  She was the hottest girl at the party.  Got her to play pool with me even though I knew nothing more than put the balls in the hole (aye!).\n\nTurns out we’re different in almost every way.\n\nNow at 35, we’ve grown up together, through our differences.  There’s nothing more attractive than solving a marital issue with someone who knows your soul.\n\nShe’s still hot too so there’s that.",
            "title_similarity": "0.5136285",
            "sentiment_compound": 0.6633
        },
        {
            "id": "huvaa9p",
            "score": 2,
            "text": "Turned out amazing. She's the most selfless loving person I know.",
            "title_similarity": "0.3339324",
            "sentiment_compound": 0.8393
        },
        {
            "id": "huvfbrd",
            "score": 2,
            "text": "Yet another thread proving reddit is filled with the most pathetic people the world has to offer.",
            "title_similarity": "0.3942503",
            "sentiment_compound": -0.6115
        },
        {
            "id": "huvgg8k",
            "score": 2,
            "text": "[deleted]",
            "title_similarity": "0.042279053"
        },
        {
            "id": "huvgvop",
            "score": 2,
            "text": "I invested in her brains too. Still hot as fuck, and now she is a PhD. with double DD’s. I’m fucking winning. Don’t really give a shit about any of the others.",
            "title_similarity": "0.55088204",
            "sentiment_compound": -0.5677
        },
        {
            "id": "huvricl",
            "score": 2,
            "text": "My wife is beautiful AND Asian. I pounced on her days after meeting.\n\nThat said, she’s been a keyboard player in a metal band, had her own band, is an amazing artist. She’s a great roommate. We’ve been together 12 years.",
            "title_similarity": "0.47744724",
            "sentiment_compound": 0.9153
        },
        {
            "id": "huwt4jt",
            "score": 2,
            "text": "In this thread: a lot of people who are just sharing things about scorned loved ones based on hearsay. It’s generally a terrible idea to form an opinion of a person based on hearsay from a person experiencing bitter resentment. \n\nPeople without MAJOR issues of their own don’t typically marry emotionally unstable or stupid people. Whenever I’ve harbored resentments for my wife’s flaws, I snap out of it pretty fast when I remember my own.",
            "title_similarity": "0.59823185",
            "sentiment_compound": -0.7717
        },
        {
            "id": "huwyhgh",
            "score": 2,
            "text": "Amazing. She still has a fat fucking ass. 10/10 would recommend. Everyone else cope.",
            "title_similarity": "0.4020279",
            "sentiment_compound": 0.3626
        },
        {
            "id": "hux1lu3",
            "score": 2,
            "text": "I didn't marry my wife for her looks.  I DEFINTELY dated her for her looks (She's 6' tall, 140lbs, tiny but super curvy, exotically gorgeous, and a natural 32E).  Is she hot?  She's basically a human barbie doll.  Is she crazy?  Absolutely.  But I married her because I loved (and still love) who she is inside.  Her laugh, her smile.  Everything about her when she's happy.  We've been married 18 years and have 2 kids.  Her smile still makes me smile.",
            "title_similarity": "0.6302547",
            "sentiment_compound": 0.9933
        },
        {
            "id": "huuciv7",
            "score": 11,
            "text": "I love reading these. There are some really good men out there and possibly proves women only really need to pick better and not waste their time.",
            "title_similarity": "0.6304919",
            "sentiment_compound": 0.9122
        },
        {
            "id": "huto80a",
            "score": 244,
            "text": "I wished always wished I was that pretty, like 10/10 boyfriends friends get jealous THAT kind of pretty. Just seems like women like that can do /have whatever they want.",
            "title_similarity": "0.6968636",
            "sentiment_compound": 0.9187
        },
        {
            "id": "huu4676",
            "score": 4,
            "text": "Now how about those who married partners that they were first not attracted to?",
            "title_similarity": "0.6477934",
            "sentiment_compound": -0.3252
        },
        {
            "id": "huuvwpg",
            "score": 4,
            "text": "She’s like Michael Jackson in that South Park episode, in which all his plastic surgery rapidly deteriorates. Except she’s filthy rich (family inheritance), so I depend on her to keep my hopes of a career in ventriloquism alive.",
            "title_similarity": "0.5548986",
            "sentiment_compound": 0.8885
        },
        {
            "id": "huuz5zi",
            "score": 3,
            "text": "I lost my sight and a hand because I married a beautiful woman. \n\nI didn't know Bertha very long before we married, but she was beautiful and exotic and my dad was pushing me to marry her, so I thought why not? Immediately after the wedding I found out she was a violent schizophrenic and so was her mother, who they hid from me so I wouldn't find out. \n\nI knew we could never have a true marriage, but she was my wife, I had to keep her safe and under control. So I locked her in the attic and got my laundry lady to take care of her. \n\nThat worked for a while, until I fell in love with my adopted daughter's teacher. She was everything Bertha wasn't. Not very pretty, but quick and clever, and fun. \n\nI knew it was wrong but I decided I had to be with her, so I kept my wife a secret and tried to marry my sweet wonderful plain Jane. The wedding was interrupted though and Jane left me when she found out about Bertha. \n\nNot long after, Bertha escaped the attic and set fire to the house. This wasn't the first time she'd tried to burn the house down but it was the most successful. The house was blazing and she was on the roof and I tried to save her. She fell, and died. And I was horribly injured trying to escape the flames. \n\nNow I'm blind, one hand lost, and all I can think about is Jane. I miss her more than my sight. I fear I will never see her again.",
            "title_similarity": "0.628572",
            "sentiment_compound": 0.9538
        },
        {
            "id": "huv6v9l",
            "score": 2,
            "text": "I dated Miss America runner up. Smoking hot blonde. Thought I loved her.\n\n- She felt she needed to play dumb and childish, like Cher from Clueless \n\n- There were ALWAYS guys trying to steal her and she sortve made them think they had a shot so it was a constant pain.\n\n- Then she’d be “mental” and toy with my head and cry on dates but never tell me what’s wrong. Or cry on the phone saying she wanted to kill herself so I’d have to leave work or my friends to see her.\n\n- Then I finally broke up up with her. And she tells me she missed her period. I said “ok, let’s get a test” and she wouldn’t. I stuck my ground.\n\n- She then slept with my best friend as of if it would get me back!?! (He’s still a friend, I mean she was hot and jumped his bones lol)\n\n——- My current wife was a friend at first, and I actually chose to date over another hottie I was *really attracted* to. She met “Miss America” long ago and knows she wouldn’t compete but she is definitely beautiful. We’ve been married 22 years, 2 great teenage kids. Sex is great, we communicate. She’s smart, has a great career…. we like the same things. She even has BPD and went totally off the rails 10 years ago, but we fixed it with meds. I LOVE HER to death.\n\nSHE GETS MORE BEAUTIFULLY EVERY YEAR, somehow?!? Crazy weird. I’m lucky.\n\nYOU NEED TO BE “BEST FRIENDS” in order to have a happy marriage and get through all the crap life throws at you. Not boobs and butts.",
            "title_similarity": "0.65349436",
            "sentiment_compound": 0.9951
        },
        {
            "id": "huvnfsp",
            "score": 3,
            "text": "Ew. Who marries someone just because they’re hot? What a stupid way to be in the world.",
            "title_similarity": "0.6476631",
            "sentiment_compound": -0.5267
        },
        {
            "id": "huvo3gl",
            "score": 4,
            "text": "So what we've learned is... Attractive women have horrible souls.",
            "title_similarity": "0.421617",
            "sentiment_compound": -0.1531
        },
        {
            "id": "hutz9ip",
            "score": 46,
            "text": "So there are men put there fully admitting that they couldn't care less if a woman is totally incompatible with themselves, doesn't need to share interests, sense of humour, good head on her shoulders, so long as she looks good? I mean, you brought this on yourselves, why marry someone you only care about on a superficial level, and the expect her to actually truly care about you in return.",
            "title_similarity": "0.7061578",
            "sentiment_compound": 0.9401
        },
        {
            "id": "huuab2n",
            "score": 74,
            "text": "I walked up to my now wife because she was, and is, the most beautiful woman in any room. I married her because her personality is also the most beautiful in any room. \n\nShe's fun, funny, caring, loving and many, many other wonderful things. Her sheer beauty is just an added bonus at this point. Not a single thing about her I don't love - definitely didn't marry just for the looks, but it's what drew me to her.",
            "title_similarity": "0.6359273",
            "sentiment_compound": 0.9329
        },
        {
            "id": "hutt6g7",
            "score": 4,
            "text": "Good",
            "title_similarity": "0.06218054",
            "sentiment_compound": 0.4404
        },
        {
            "id": "huu2i0s",
            "score": 4,
            "text": "She turned out to be a psycho, racist, antivaxer.",
            "title_similarity": "0.3133734",
            "sentiment_compound": -0.6124
        },
        {
            "id": "huulfor",
            "score": 3,
            "text": "Got a friend that married way up from his rating. Had just started his company. She stayed home to have babies. Just when the last one was in HS she demanded a divorce because he had made millions and she had no skills. Grabbed a boat load of cash and proceeded to bang every hot stud in the bars.",
            "title_similarity": "0.58316946",
            "sentiment_compound": 0.0258
        },
        {
            "id": "huusmja",
            "score": 5,
            "text": "In High School, the skinny, flat chested awkward girls spent a lot off time alone. The buxom, big titty spank shack girls were where it was at. At my 30 HS reunion, the skinny girls were high level executives, gorgeous, well balanced. The spank shack girls  were fat, divorced and had mustaches.",
            "title_similarity": "0.44105625",
            "sentiment_compound": 0.5423
        },
        {
            "id": "huuumgi",
            "score": -4,
            "text": "This question probably needs to be rephrased, because it sounds negative and so it’s only going to attract negative responses. Someone who actually married someone for the looks and is happy will probably have justifications for it that make him less likely to respond.",
            "title_similarity": "0.65027785",
            "sentiment_compound": -0.296
        },
        {
            "id": "huuyz6r",
            "score": 4,
            "text": "It sucks they WILL eventually cheat",
            "title_similarity": "0.21096033",
            "sentiment_compound": -0.6705
        },
        {
            "id": "huv2vpt",
            "score": 4,
            "text": "Bear with me, I’ll just check with my husband",
            "title_similarity": "0.49820986",
            "sentiment_compound": 0.0
        },
        {
            "id": "huvc27w",
            "score": 5,
            "text": "Met my wife 7 years ago almost to the day. \nWas blow out of the damn water when I saw her. \nKnew I had to marry her, as she checked all the damn visual boxes. \nDated and married 8 months later. \nAnd holy hell are we in freaking love. \nShe’s such a badass mom and an amazing wife in all ways. I married for the looks and the brains. \nShe was and still is way out of my league, and for some damn reason she thinks I am out of her league. \n\nFound out dating we both had the same experiences in life growing up, not too similar but comparable, same motives for our individual futures, and it just clicked.",
            "title_similarity": "0.6606701",
            "sentiment_compound": -0.296
        },
        {
            "id": "huvlhv2",
            "score": 4,
            "text": "An old co-worker of mine married a girl because of her looks, and because he impregnated her at a party. I asked why did he marry though, they’d known each other just a few months and he said “all women are crazy, so might as well pick the hottest one.” Hahaha. He’s also sort of crazy, so maybe it’ll work out.",
            "title_similarity": "0.78104955",
            "sentiment_compound": 0.553
        },
        {
            "id": "hutwbm9",
            "score": 188,
            "text": "[removed]",
            "title_similarity": "0.022824142"
        },
        {
            "id": "hut9jwt",
            "score": 503,
            "text": "My wife was so fucking insanely gorgeous that I married her while she was still in high school. 27 years and 3 kids later, we still are still together.",
            "title_similarity": "0.4600544",
            "sentiment_compound": 0.6749
        },
        {
            "id": "huu9top",
            "score": 28,
            "text": "Reading the wholesome posts makes me not only envious, but also wanting a boyfriend who loves me for ME 🥲",
            "title_similarity": "0.6658654",
            "sentiment_compound": 0.7548
        },
        {
            "id": "huu6zvt",
            "score": 16,
            "text": "Not me but my best mate married an insanely good looking but fiery lady.  Kids came along she lost the look, Ever since then he’ll come out with me and cry into his beer about how shit is marriage is, jealousy, arguments, no trust, she treats him like dirt. I’m just waiting for the end. \nSo glad I picked a soulmate, we just work on every level - mindset, beliefs, goals, parenting plus the bedroom is fire 👍. Neither of us are lookers, it’s not everything,",
            "title_similarity": "0.6293438",
            "sentiment_compound": -0.7007
        },
        {
            "id": "hutvvgz",
            "score": 131,
            "text": "Not good.  I find sex with her is as addicting as tik tok and it’s beginning to impact my work.",
            "title_similarity": "0.5103023",
            "sentiment_compound": -0.3412
        },
        {
            "id": "huu4pix",
            "score": 5,
            "text": "Baddddd. She’s real real dumb.. we have two kids. It’s rough, but at least she’s fine and got some good lookin boys out of it…",
            "title_similarity": "0.41575027",
            "sentiment_compound": 0.5994
        },
        {
            "id": "huuy6zs",
            "score": 5,
            "text": "I’m not a man, but [this](https://www.ndtv.com/offbeat/pretty-girl-in-search-of-rich-husband-gets-reality-check-from-j-p-morgan-ceo-555195) wealthy person who answered an open letter from a gold digger is. \n\nShe asked why she can’t find a wealthy man to be with, and the wealthy person (THE CEO OF JP MORGAN) basically said that looks are a depreciating asset.\n\nSample: **From the standpoint of a business person, it is a bad decision to marry you. The answer is very simple, so let me explain.**\n\n**Put the details aside, what you're trying to do is an exchange of \"beauty\" and \"money\" : Person A provides beauty, and Person B pays for it, fair and square.**\n\n**However, there's a deadly problem here, your beauty will fade, but my money will not be gone without any good reason. The fact is, my income might increase from year to year, but you can't be prettier year after year.**\n\n**Hence from the viewpoint of economics, I am an appreciation asset, and you are a depreciation asset. It's not just normal depreciation, but exponential depreciation. If that is your only asset, your value will be much worse 10 years later.**",
            "title_similarity": "0.69189006",
            "sentiment_compound": 0.9893
        },
        {
            "id": "huv0oak",
            "score": -4,
            "text": "LOL assuming women are much different from each other, i dated many before marrying and they all are the fkn same...\n\n&#x200B;\n\nUgly women who get little attention are more humble and desperate for attention since they get little to none, but after a while they become as annoying or even worse than a good looking girl..\n\n&#x200B;\n\nOn the contrary good looking girls are harder to access due to having high demand but they are not different from an ugly one, cause guess what? They are women too :)\n\n&#x200B;\n\nSo this thread sounds like a butthurt questiom from ugly women who cant get laid, or cant get the date they want so they start blaming men who choose beautiful girls over them, thats natural to be honest, its not something you can control, its an instinct to go after attractive girls and ignore ugly one's...same applies to women",
            "title_similarity": "0.63503706",
            "sentiment_compound": 0.2237
        },
        {
            "id": "huv26qf",
            "score": 6,
            "text": "This is a great thread, I enjoyed reading the comments.\n\nThis is my experience.\n\nMy first wife, I have been married twice) was, and still is, very beautiful, and - on top of that - our sex life was great and wild AF while we were dating.\n\nAnd then, after we got married, the sex disappeared in both quality and quantity. And, to put thing into perspective in terms of timelines, when I say \"after we got married\" I mean the day of the wedding. To give some hard data, we didn't have sex the night of the wedding.\n\nAnyway.\n\nWhen we were dating it was great, once we got married, it sucked. I am madly in love with her, but after 7 years of that, I filed for divorce.\n\nI dated a bit and then, somehow, I got married again. My second wife was very pretty, very smart (wife #1 was not too bright), the whole package.  Well, we got divorced as well, I wanted out because I wanted more out of life and I wanted to live a little.  Looking in retrospect I was mistaken, but - like they say - life makes sense when we look back at it, but we can only live it going forward.\n\nAnd that's when I dated a lot of women, and three of them were drop dead gorgeous, solid 10.  Model-like features, gym forged hardbodies, great sex, the works.  But each time, after a few months, I found myself being with them only because of the looks, very shallow of me, I know. And because of their looks putting out with a lot of crap in the relationship that - at the end - it was not worth it.\n\nThese days I am dating someone who is very much like wife #2: very pretty, smart AF, good sex, and.. for the first time in my life I am not attracted at all to women's looks/features. Don't get me wrong, I am not into ugly women, LOL. but when looking at Instagram reels and I get served with some of those IG influencers... I don't see anything special, and I am actually having fun reading the top comments and I cringe, and I wonder who's more cringy: the commenters or the influencers?\n\nSo, there it is.  Beauty is really skin deep, and in my experience, most of the drop dead gorgeous women have a sense of entitlement that prevents them to actually do something with their life.  Just my opinion and not all beautiful women.",
            "title_similarity": "0.7099736",
            "sentiment_compound": 0.9942
        },
        {
            "id": "huvs29p",
            "score": 5,
            "text": "I married my wife cause she was hot. But also sweet, kind, generous, and loving. 20 years later, she's still hot, and all the rest. I'm pretty sure when we are 80, I will still think she's beautiful.",
            "title_similarity": "0.61080503",
            "sentiment_compound": 0.9872
        },
        {
            "id": "huu28v7",
            "score": 18,
            "text": "A good looking woman is good looking for a short period, a good woman is good looking the whole life...",
            "title_similarity": "0.43769985",
            "sentiment_compound": 0.891
        },
        {
            "id": "huttgyn",
            "score": 66,
            "text": "Only thing with these questions is those who have had bad experiences are maybe more likely to comment. Distorting reader perception.",
            "title_similarity": "0.36185512",
            "sentiment_compound": -0.6808
        },
        {
            "id": "huuxkxq",
            "score": 35,
            "text": "Did the opposite. My wife is super cute.  But not traditionally attractive.  \n\nShe’s my best friend though.  We’ve been together 10 years and have never even discussed breaking up.  I guess we’ve talked about it actually but not with any real intent. \n\nThe worst arguments last 24 hours at most.   And honestly I fought more with male roommates.  Just a by product of living with someone. No one is perfect.",
            "title_similarity": "0.5270244",
            "sentiment_compound": 0.7881
        },
        {
            "id": "huugxy1",
            "score": 6,
            "text": "Looks are important.  Anyone who says they aren’t is lying. I’m not saying that’s all you should be looking for. \n\n12 years later my wife is still beautiful and bubbly and fuckin like mad.",
            "title_similarity": "0.61076295",
            "sentiment_compound": 0.1567
        },
        {
            "id": "hut3ghx",
            "score": 981,
            "text": "What a dumbass reason to get married on looks alone",
            "title_similarity": "0.5269035",
            "sentiment_compound": -0.6808
        },
        {
            "id": "huuhura",
            "score": 23,
            "text": "The amount of fucking dorks in here who can't read the fucking title. lol",
            "title_similarity": "0.2959239",
            "sentiment_compound": 0.315
        },
        {
            "id": "huuusac",
            "score": 8,
            "text": "I was \"lucky\" to date very attractive women. It lasts about 4 months at most (for me).\n\n- always tons of guys hitting on them daily\n- the ones I was with were looking to jump up socially (better tickets, trips, homes)\n\nYes, I actually (stupidly) had feelings for them and thought they had feelings for me.\n\nNow I am very deliberate in not dating (for long) any woman too sexy. Former fitness competitor? Broke up with her after 30 days. Former model/actress? 40 days. Hot Mom? Broke up with her after 30 days.\n\nI do not trust it. Do not want to deal with it.",
            "title_similarity": "0.65567565",
            "sentiment_compound": 0.7277
        },
        {
            "id": "hutwr2m",
            "score": 234,
            "text": "Unironically just hooked up with a girl I used to think was on the ugly side. Got to hangout and know her better, and she's such a nice person I honestly don't care about looks anymore. Never thought that would happen, life is crazy",
            "title_similarity": "0.5696255",
            "sentiment_compound": 0.0956
        },
        {
            "id": "huu3p45",
            "score": 29,
            "text": "I finally met \"the one\" at 38. Totally hot (to me), super intelligent, and an awesome personality. I loved her from the moment she got out of her car. I am glad I never gave up and settled.",
            "title_similarity": "0.43559104",
            "sentiment_compound": 0.9578
        },
        {
            "id": "huwd954",
            "score": 27,
            "text": "My 20’s - only dated hot girls. Always a psycho or drama fest of some sort. No peace ever. Poon just ain’t worth it. \n\nMy 30’s went lone wolf to avoid drama and heartbreak. was pursued by a girl who was… not in the “hot”category. Eventually I asked her if she’d leave me alone if I went on one date with her. She agreed. Turns out: she was nice to me, like no other girl had ever been. She was loyal AF, stood by me through anything. Years later we’re still together, getting married, and so happy. I can’t imagine a life without her anymore. Nowadays I just laugh when I see guys putting up with hot women acting like total bitches.\n\nThe morale: screw looks. Get with someone who makes you feel like you’re loved, who’s always glad to see you come home at the end of the day. Find your best friend in a mate. I’m telling ya - that’s where it’s at. 🥰",
            "title_similarity": "0.61834323",
            "sentiment_compound": 0.9808
        },
        {
            "id": "hutodzi",
            "score": 954,
            "text": "I just remember my uncle's advice. Her looks aren't going to raise your children",
            "title_similarity": "0.4258659",
            "sentiment_compound": 0.0
        },
        {
            "id": "huu9kg7",
            "score": 11,
            "text": "how's it going at the shallow end?",
            "title_similarity": "0.11312686",
            "sentiment_compound": 0.0
        },
        {
            "id": "huv4rv5",
            "score": 10,
            "text": "I'm in a \"out kicked my coverage\" situation.  I'm an average looking man with a great/successful career and she's shes a strong bombshell that wants to take care of her family.\n\nI lean left in my politics and she leans right.  We were both divorced with no kids.  I think maturity helped us.  We both established our requirements and I forced communication.  I said that I wanted a partner and a copilot, not a passenger.  She said she wanted to have a family/2 kids (I wanted none) and a man she could rely on (her ex wouldn't pay the bills and lie about it until the power was shut off).  At the end of the day her looks tipped the scales for me taking a risk but I made the choice based on a lot of other information.  \n\nI can happily say that we are doing great.  We communicate and we compromise on things.  We sometimes fight but we laugh and joke alot more than anything else.  She expects me to financially keep my word and take care of the bills and she is (and wants to be mind you) a modern 50s housewife.  She runs our house and sets the expectations for our daughter and the baby we are expecting in a few months.  I would never have expected this would have been my life but its really great.  We both feel very lucky.\n\nEdit: before I get any hate on the \"50s housewife\" it's literally what she calls herself.  I had always envisioned a corporate power couple that worked hard and played hard and things like that.  But that smile she gave me the first time I met her melted my soul and she had me right there.  Physically attraction is important no matter what anyone says.  But it shouldn't be the only thing.  I think I just got very very lucky.",
            "title_similarity": "0.6260941",
            "sentiment_compound": 0.993
        },
        {
            "id": "huu831n",
            "score": 58,
            "text": "When I saw my wife I thought that she was way out of my league, I liked one of her pictures and she said something like, isn’t a handsome man like you gonna write me something ? been together for soon 3 years, been husband and wife for a year soon. Love her to bits, and she is a babe.",
            "title_similarity": "0.69692445",
            "sentiment_compound": 0.9349
        },
        {
            "id": "huu3203",
            "score": 30,
            "text": "Where is the thread on askwomen? I can't find it.",
            "title_similarity": "0.21941034",
            "sentiment_compound": 0.0
        },
        {
            "id": "hutredq",
            "score": 283,
            "text": "[I always think of this.](https://blazepress.com/2014/02/letter-j-p-morgan-ceo-pretty-girl-seeking-rich-husband-amazing/)",
            "title_similarity": "0.6589313",
            "sentiment_compound": 0.0
        },
        {
            "id": "huub0ih",
            "score": 11,
            "text": "Met my wife at a bar. Looked like a dream to me. 1979, been together since! Taurus and Aquarius.",
            "title_similarity": "0.44356805",
            "sentiment_compound": 0.5848
        },
        {
            "id": "huuvuop",
            "score": 12,
            "text": "I was 23, she was 27.  I only pursued her because of her looks (more specifically, her body).  As we got to know each other, I learned that we were not a good match, but I was dumb and just allowed the relationship to keep progressing, and proposed, and we got married.  \n\nDivorced 14 years later after a very unhappy and unsatisfying marriage.  We got two good kids out of it.\n\nAt 45, she's still very focused on her appearance, and she's still pretty damn hot.  I think we've had sex more times since divorcing than we did in the last 10 years of our marriage.",
            "title_similarity": "0.67524576",
            "sentiment_compound": -0.2151
        },
        {
            "id": "huty91i",
            "score": 108,
            "text": "pretty good, I'm naturally a quite lazy person, but very capable of planning stuff out, getting complicated shit done and generally making things happen if the motivation is there. she's a very motivated person, with certain things she wants from life that I also want but wouldn't really bother to get if it was just up to me, whereas she has drive, motivation and is a hard worker, but not really great at planning, organizing or prioritizing, so she keeps me motivated and sets the goals, then I make it happen. Together we've managed to build a multi million dollar business while raising 4 kids and she's still pretty hot,.",
            "title_similarity": "0.485631",
            "sentiment_compound": 0.9555
        },
        {
            "id": "huufdx6",
            "score": 114,
            "text": "Woman here… Everyone wondered why I married my ex at the time because he wasn’t particularly attractive. I thought it was because he loved me so deeply we would have a great friendship forever. It turned out he was only obsessed with having me be his for whatever reason and I became so lonely because he didn’t actually care about doing anything I wanted. It was all ego for him. I am not so pretty these days and have three kids and a divorce under my belt. Thanks for using my best years to fill your position of arm candy wife. It nearly killed me having to make the decision to leave and break up the family but I couldn’t let my kids continue to see me that depressed. Do not marry for looks. Friendship, kindness, sexual compatibility are way more important. If you want to have sex and have an emotional connection with someone their looks really seem irrelevant. You find them attractive BECAUSE of the good stuff.",
            "title_similarity": "0.6957583",
            "sentiment_compound": 0.9695
        },
        {
            "id": "hutz4es",
            "score": 44,
            "text": "It’s kind of a paradox: if you truly love your spouse( no matter the looks), she/he will be the most beautiful person in the whole universe. So to paraphrase: All of the individuals in this world are the most beautiful for somebody.",
            "title_similarity": "0.67821014",
            "sentiment_compound": 0.9434
        },
        {
            "id": "huu1eoo",
            "score": 111,
            "text": "Pretty damn good actually. After 20 years the sex and friendship are better than ever, we would never dream of being with anyone else. \n\nIt works when both parties are in it for the same reason.",
            "title_similarity": "0.5266199",
            "sentiment_compound": 0.8796
        },
        {
            "id": "huty4ai",
            "score": 351,
            "text": "Married a woman in spite of her looks, still divorced.",
            "title_similarity": "0.5357371",
            "sentiment_compound": -0.5267
        },
        {
            "id": "hutovow",
            "score": 486,
            "text": "Was seeing a girl unofficially and met my now wife. After meeting my wife I didn’t want to be with anyone else so I cut all contact; my wife was cool and gorgeous. 15 years together and it’s working out just fine.",
            "title_similarity": "0.5925919",
            "sentiment_compound": 0.7203
        },
        {
            "id": "huu7fsa",
            "score": 18,
            "text": "I don't think I would of even started dating a girl if she wasn't good looking. I mean that's usually the first attraction. \n\nI think the one comment said it best, \"you court for the looks, but you marry the mind\". The mind is really the person so it would define whether you stay together or not. And communication is one of the biggest things to keep a relationship going.  But I wouldn't just pick a girl and say she is butt ass ugly, let's go court her. I would have to be physically attracted to her to marry her. \n\nBeen married almost 10 years now, together for 13 and haven't fought once. We both seem to think we lucked out.",
            "title_similarity": "0.7012787",
            "sentiment_compound": 0.3999
        },
        {
            "id": "hutsb80",
            "score": 87,
            "text": "Like my friends always tell me....the day I played lotto for a beautiful,  caring, loyal and loving wife to me only...I won the jackpot.",
            "title_similarity": "0.55704516",
            "sentiment_compound": 0.9771
        },
        {
            "id": "huuxwq4",
            "score": 59,
            "text": "Men who marry women for the looks usually ends up with the type of woman who marries them for their money and the end result is an insufferable marriage between two really shitty people that usually ends in divorce. Poor kids\n\nEdit: I’m not saying that appearance shouldn’t be a solid contributing factor to the match, but it shouldn’t be the dominant factor and the foundation of the relationship",
            "title_similarity": "0.7558814",
            "sentiment_compound": -0.4933
        },
        {
            "id": "hut9ux9",
            "score": 2139,
            "text": "[deleted]",
            "title_similarity": "0.042279053"
        },
        {
            "id": "hut5y8s",
            "score": 2674,
            "text": "Actually first one i almost married. Total party. She loved to have good time. After second child she turned into closet pill head. Passed out drugged up on youngest. So now i have one daughter. Not two. She was sexy looking lesbo stripper but not marriage material. She ran out of state and live in Fl while my oldest girl lives with me. Find a connection other than looks.",
            "title_similarity": "0.54220176",
            "sentiment_compound": 0.7647
        },
        {
            "id": "hutwj7z",
            "score": 400,
            "text": "Ask all of the divorced milfs how well it's going\n\n#😏",
            "title_similarity": "0.48623562",
            "sentiment_compound": 0.2732
        },
        {
            "id": "huuwb8f",
            "score": 36,
            "text": "My grandpa once said of my grandma: I married her because she was a babe. \n\n60 years together later, he died a few months after she did. We all agreed it was from a broken heart.",
            "title_similarity": "0.5940492",
            "sentiment_compound": -0.1027
        },
        {
            "id": "huts4py",
            "score": 565,
            "text": "On the flip side, my Mom married my Dad because of his charms and good looks. He has a warm smile and a funny attitude. Women would compliment how he has beautiful eyes when he was in his 30s and would give him gifts. Ladies would give him expensive alcohol and food. \n\nMy Mom was crazy jealous. But then also because my Dad cheated on her several times. My Mom’s not ugly either, she’s okay, she has a soft beauty to her. \n\nI guess what I’m saying is, you have to be super confident to be with an attractive person. And have the capacity to tolerate other people, since they will give their attention and affection to your very attractive partner. Can you handle all of that? \n\nMy parents are still together after all the drama,  but there was definitely a lot of pain there.",
            "title_similarity": "0.75196433",
            "sentiment_compound": 0.9891
        },
        {
            "id": "hutva2i",
            "score": 317,
            "text": "Not so good my friend. Married for over 14 years now. Estranged for nearly 4. Live apart and oscillate between hatred and infatuation. I literally hate and love this woman at the same time...it's awful.",
            "title_similarity": "0.4791398",
            "sentiment_compound": -0.6439
        },
        {
            "id": "hutv3d4",
            "score": 47,
            "text": "Still married, been together 10 years.",
            "title_similarity": "0.2930168",
            "sentiment_compound": 0.0
        },
        {
            "id": "huudzku",
            "score": 47,
            "text": "My first wife was stunningly beautiful and crazy as batshit. We were together for five years. I should have ended it after 6 mos but I figured that I'd never find any as gorgeous again.\nI was actually so happy when it was over that I went out to dinner. I asked her new boyfriend, \"Do you like Rollercoasters with no breaks?",
            "title_similarity": "0.5300443",
            "sentiment_compound": 0.9461
        },
        {
            "id": "huuu02q",
            "score": 48,
            "text": "Every time I’ve dated someone really attractive it ended horribly. They had another partner, or they were literally insane and not working on themselves. I’m okay dating with mental illness or problems as long as they are working on it. Idk if inherent beauty has costs or what .\n\nMy current fiancé is so beautiful to me now but it wasn’t always this way. She was my coworker for a year, and best friend for a year later, and we knew each other two years before dating. then we slowly figured out we had feelings for each other that was beyond friendship. We have the best communication because of working together and being friends before dating. We worked really really well together and always had the nursing floor ran to perfection and helped each other out. We both have become more attractive because of the support we give each other as well and have an extremely positive relationship. She lost weight, has less anxiety and stress from ptsd. I gained muscle, started taking better care of myself and also have almost no mental illness issues anymore. We both kinda blossomed and grew after our relationship and I honestly see her as the most beautiful person in the world. She really is the most kind and caring human I’ve ever met. I didn’t think perfect relationships exist but damn. Been together 6 years now.",
            "title_similarity": "0.6926678",
            "sentiment_compound": 0.9979
        },
        {
            "id": "hutqcsb",
            "score": 1377,
            "text": "I mean frankly if you are in love with someone and the love is mutual, the person just becomes the most gorgeous person out there. You don't need big tits. Just make sure you are really good friends before taking up a marriage as it really gets easier to work things out rather than rushing into marriage and suffering through it because you don't wanna end up divorced.",
            "title_similarity": "0.64463514",
            "sentiment_compound": 0.9726
        },
        {
            "id": "huuezs6",
            "score": 443,
            "text": "ITT: people who married their wives because of their personalities who also happen to be hot and don't understand the question.",
            "title_similarity": "0.7992086",
            "sentiment_compound": 0.0
        },
        {
            "id": "huu1fym",
            "score": 7943,
            "text": "Met my wife at a New Years Eve party. She was smoking hot. Like WAY out of my league. I'm not even being hyperbolic here. She was a babe. I started talking to her because of her looks, not going to lie. But found out later she was a Star Trek nerd at the time. A big reader too. She was also kind of introverted. But yes, I was attracted by her looks. \n\nWe were married just 3 months later. Had only known each other for 3 months. Married in front of a judge. \n\nThat was 31 years ago, and we're still married. Our looks have waned, as they often do, but we're still together and we're still happy.\n\nEDIT: Didn't think this was blow up like it has. I see that some were saying this had nothing to do with the question. Sorry that I didn't clarify. It was only later that I found out about what she was into. At first it was total looks. We had only known each other for 3 months before marrying, so MANY of the things that learned about her were after we had married. I do not advocate doing this though, as it very easily could have gone the other way in that we had zero in common. This was pure luck. But make no mistake, in my eyes I saw was long blonde hair and killer body at first. Everyone I knew said I was insane marrying someone I hardly knew. \"She gorgeous, but you know nothing about her\". Had one work friend say \"did you ever think why she's single but she looks like that? There's something wrong there\". There wasn't.",
            "title_similarity": "0.6848779",
            "sentiment_compound": 0.975
        },
        {
            "id": "hutwudc",
            "score": 2392,
            "text": "I’m about to marry my fiancé and we’ve been together for nearly 10 years, I felt like time froze when I saw her for the first time at the bar on a large boat cruising down the river. She was looking in her wallet for cash, I walked up and paid for her drink and never looked back. My Fiancé is still the most beautiful woman in the world to me. I asked her to marry me on the same river but on a different boat 9 and a half years later.",
            "title_similarity": "0.5149816",
            "sentiment_compound": 0.5182
        },
        {
            "id": "huun8xo",
            "score": 53,
            "text": "Both my parents married each other purely for looks. They dated for like 3 months and got married because they are strong believers of their religion and were scared to date outside their ethnicity and culture. Unfortunately my dad turned out to have a low IQ, no personality and couldn't complete college while not having the co-ordination to be able to learn a skilled trade, while my mother had BPD among other things, but was able to become essentially the sole breadwinner. They've been fighting my entire life and say they just stayed with each other because of social pressure and that they have kids. Unfortunately I didn't inherit my dad's tall built body nor my mom's beauty/brains. So I'm just an average looking short guy with an average IQ and a pretty fucked up childhood.  \n\n\nNobody should marry for looks, I rather people marry for money if they don't love each other.",
            "title_similarity": "0.61317563",
            "sentiment_compound": -0.9545
        },
        {
            "id": "hutmpkr",
            "score": 268,
            "text": "Div pending",
            "title_similarity": "0.08244385",
            "sentiment_compound": 0.0
        },
        {
            "id": "hutumrv",
            "score": 5242,
            "text": "Met my wife nearly 15 years ago when she was 15 and I was 16. Thought she was the most beautiful girl I'd ever seen and automatically fell head over heels for her.\n\nStill happily together and we have a 5 month old daughter. I still think she's the most beautiful woman I've ever seen, no matter how much she protests.",
            "title_similarity": "0.4922285",
            "sentiment_compound": 0.9003
        },
        {
            "id": "huuisyy",
            "score": 68,
            "text": "ITT: people who didn't read the title and clearly approached for looks but married for more than looks.",
            "title_similarity": "0.75214046",
            "sentiment_compound": 0.2144
        },
        {
            "id": "huu05ka",
            "score": 7859,
            "text": "I asked my husband, and he said it's going great.",
            "title_similarity": "0.50540024",
            "sentiment_compound": 0.6249
        },
        {
            "id": "huud4fp",
            "score": 539,
            "text": "Johnny Depp probably has a few things to say about this",
            "title_similarity": "0.2815679",
            "sentiment_compound": 0.0
        },
        {
            "id": "hutctz8",
            "score": 6925,
            "text": "Never marry for looks. You court for the looks and you marry the mindset.",
            "title_similarity": "0.6006026",
            "sentiment_compound": 0.0
        },
        {
            "id": "huu7p0x",
            "score": 196,
            "text": "I married my first wife because she was supermodel level hot. It lasted a month.",
            "title_similarity": "0.6016648",
            "sentiment_compound": 0.0
        },
        {
            "id": "hut7xzv",
            "score": 5305,
            "text": "Ask an older popular male celebrity. lol",
            "title_similarity": "0.4779542",
            "sentiment_compound": 0.6808
        },
        {
            "id": "huti3u4",
            "score": 14378,
            "text": "Not so good…\nWhen I first saw her across campus, I literally said, ‘wow…who is that?’  \n\nProcessing divorce paperwork now, 19 years later. She told me she was NEVER attracted to ME. She married me because she wanted tall, beautiful children.",
            "title_similarity": "0.632444",
            "sentiment_compound": 0.3753
        },
        {
            "id": "hutuxo5",
            "score": 9904,
            "text": "I feel lonely beside her.",
            "title_similarity": "0.1952289",
            "sentiment_compound": -0.3612
        },
        {
            "id": "hutzrp9",
            "score": 811,
            "text": "I sorta did the opposite.  I was kind of an ugly duckling story, and married my (ex) wife not giving a shit about looks.  But apparently that was way more important to her than it was me, because she got so insecure thinking I was going to leave her or find someone better that she freaked out and ended up cheating on me with her boss.  \n\nLike, it got to the point of codependency that I intentionally gained a b 30lbs and our marriage went a lot smoother.  Then I got booked to film something I needed to be in good shape for; so I lost the weight pretty quickly and the relationship took a nosedive straight into the affair.\n\nI left, but did a lot of therapy on codependency, generational traumas, etc.  My current fiancé is night and day different on that front, takes care of herself, and practices great mental health hygiene.  It just so happens that she is also very attractive and wayyyyy less insecure.  Like, we never doubt that the other one has our own best interests in mind.",
            "title_similarity": "0.69352245",
            "sentiment_compound": 0.9801
        },
        {
            "id": "hutv20r",
            "score": 4134,
            "text": "My dad admitted he did that with my Mum. Was a real awkward conversation.\n\nMy Mum has severe mental issues with bpd, ptsd and possible adhd. She was a lot when I was a child, supera abusive. Literally hit/scratched my dad and threw things at him while he was too scared to leave.\nHe ended up resenting her.\n\nSomehow they managed to work through their issues now with couples and individual therapy.\nMy Mum still has crazy mood swings, forgets half the things you say and if she's triggered the day ks over. But it's a lot better than before. She's improving and is actually nice to be around now.\n\nDon't marry cause she's hot.\n\nEdit: don't talk shit about my Mum, I still love her, sje apologised for the abuse and she goes to therapy. She actively improved herself after she realised what she did",
            "title_similarity": "0.5108173",
            "sentiment_compound": 0.9516
        },
        {
            "id": "hutocku",
            "score": 5903,
            "text": "Currently in the midst of a divorce. So far so good 👍🏻",
            "title_similarity": "0.3608244",
            "sentiment_compound": 0.6213
        },
        {
            "id": "huug4cs",
            "score": 9933,
            "text": "I married my wife for her looks though not the looks she's been giving me lately.",
            "title_similarity": "0.76904833",
            "sentiment_compound": 0.34
        },
        {
            "id": "huuz9fs",
            "score": 1741,
            "text": "I have learned that my toaster is waterproof.",
            "title_similarity": "0.27940652",
            "sentiment_compound": 0.0
        },
        {
            "id": "huu7d1z",
            "score": 7457,
            "text": "I asked my father why he married my mother, and he said :\n\n\"Because she was a total babe\" (exact words). That was literally it.\n\nThe marriage didn't last 5 years, she cheated and there was a hostile divorce.",
            "title_similarity": "0.5983084",
            "sentiment_compound": -0.7096
        },
        {
            "id": "huuv0f6",
            "score": 1419,
            "text": "“I married for looks and now I’d kill for a conversation”. My co worker tells me his dad says this to him all the time.",
            "title_similarity": "0.7563553",
            "sentiment_compound": -0.6908
        },
        {
            "id": "hutvd3r",
            "score": 1,
            "text": "Link to original post?",
            "title_similarity": "0.12242208",
            "sentiment_compound": 0.3182
        },
        {
            "id": "hutwb63",
            "score": 1,
            "text": "I'd rather pay for love so I know what I'm getting",
            "title_similarity": "0.48173368",
            "sentiment_compound": 0.5859
        },
        {
            "id": "hutwv9b",
            "score": 3,
            "text": "Hoping to read a few positive comments where it turns out amazing",
            "title_similarity": "0.350915",
            "sentiment_compound": 0.8807
        },
        {
            "id": "hutx7p1",
            "score": 3,
            "text": "Well the main thing is you have beautiful tall children. Have you considered donating your sperm?",
            "title_similarity": "0.56765014",
            "sentiment_compound": 0.7184
        },
        {
            "id": "huty2xw",
            "score": 4,
            "text": "Looks can make me attracted to a woman, maybe have sex with her\n\nBut looks will never make me love a woman and dream of a future with her.",
            "title_similarity": "0.5684035",
            "sentiment_compound": -0.2851
        },
        {
            "id": "huu0rpt",
            "score": 4,
            "text": "# 'MEN OF CONFLICT-BASED EVOLUTION, YOUR TIME HAS PASSED'",
            "title_similarity": "0.39672422",
            "sentiment_compound": 0.0
        },
        {
            "id": "huu1xvx",
            "score": 1,
            "text": "Divorced",
            "title_similarity": "0.14755857",
            "sentiment_compound": 0.0
        },
        {
            "id": "huu2982",
            "score": 3,
            "text": "Was engaged (stupidly spent a crazy amount (for me) on the ring), thankfully never got to marriage. It didn't go well at all in the end.  We have a daughter together though and co-parenting is actually going well. Learnt my lesson though for sure!",
            "title_similarity": "0.5866481",
            "sentiment_compound": 0.4548
        },
        {
            "id": "huu2tf0",
            "score": 15,
            "text": "Whatever is your preference personality / look / intellect it's gonna be up to you to make it work and it's a non stop job !",
            "title_similarity": "0.33525282",
            "sentiment_compound": 0.2714
        },
        {
            "id": "huu3cq3",
            "score": 3,
            "text": "Never married this crazy chick but now I am going through her accusing me of sexually abusing our daughter and trying to take her away from me. She is a narcissistic alcoholic that basically used me as a piggy bank and told me after a year that she got pregnant with our daughter on purpose to get child support. She is trying to defame me to my whole family but they all know she’s a liar. So now I have to go to court and prove I did nothing wrong and try to get custody of my daughter back because she will ruin her life and twist her little brain into hating me. I am terrified of losing my daughter. She thinks any time she sees anything on my daughter she automatically thinks that I am abusing her and doesn’t realize children hurt themselves all the time.  She has been abused herself in her past so she is projecting all her issues onto our daughter and at me. She won’t seek therapy or go to AA. So yeah don’t fuck hot crazy women",
            "title_similarity": "0.53653646",
            "sentiment_compound": -0.9924
        },
        {
            "id": "huu3kzl",
            "score": 1,
            "text": "Looking good",
            "title_similarity": "0.15194544",
            "sentiment_compound": 0.4404
        },
        {
            "id": "huu4amm",
            "score": 1,
            "text": "Looking good 🧸☕",
            "title_similarity": "0.16206077",
            "sentiment_compound": 0.4404
        },
        {
            "id": "huu5ak6",
            "score": 1,
            "text": "My ex fiancé was a reach for me. She is stunning. I ignored red flags until they got too large, this was after she received the ring. The breakup brought things out of her I wished I had never seen. I honestly would’ve tried to mend things had it not been for her actions after the fact. I like to believe I dodged a bullet, but it still destroys me every day to think about her, and the thinking doesn’t stop.",
            "title_similarity": "0.6077323",
            "sentiment_compound": -0.8171
        },
        {
            "id": "huu5avu",
            "score": 8,
            "text": "8 years and going strong… so far so good.\nI’m the ugly one in the relationship so I should count my lucky stars lol",
            "title_similarity": "0.48004806",
            "sentiment_compound": 0.7484
        },
        {
            "id": "huu6zql",
            "score": 1,
            "text": "You are a woman arn't you.",
            "title_similarity": "0.28985286",
            "sentiment_compound": 0.0
        },
        {
            "id": "huuam42",
            "score": 1,
            "text": "Quite bored after six years. Nothing to talk about, no shared interests. Nothing particularly bad. Just boring",
            "title_similarity": "0.22353217",
            "sentiment_compound": -0.567
        },
        {
            "id": "huuaps0",
            "score": 1,
            "text": "This is going to be a even more popular thread in 10 years after all these surgeries and BBLs being so popular.",
            "title_similarity": "0.36043245",
            "sentiment_compound": 0.7724
        },
        {
            "id": "huuawu3",
            "score": 1,
            "text": "m",
            "title_similarity": "-0.0067664813",
            "sentiment_compound": 0.0
        },
        {
            "id": "huub7ro",
            "score": 2,
            "text": "What a fucking question to ask",
            "title_similarity": "0.20665064",
            "sentiment_compound": 0.0
        },
        {
            "id": "huubwqo",
            "score": 1,
            "text": "Ngl it’s wasn’t a marriage but just got broken up with after 4 years and idk how to accept it she won’t even answer anymore nothing bad happened between us so it’s like ??!???! Shit sucks tho I did see myself marrying this girl",
            "title_similarity": "0.46276432",
            "sentiment_compound": -0.681
        },
        {
            "id": "huucrui",
            "score": 3,
            "text": "From the comments I’ve read (about a 100) seems like a. Complete coin flip, beautiful.",
            "title_similarity": "0.34317267",
            "sentiment_compound": 0.7506
        },
        {
            "id": "huudfna",
            "score": 1,
            "text": "where is the askwomen thread?",
            "title_similarity": "0.29331532",
            "sentiment_compound": 0.0
        },
        {
            "id": "huudnf6",
            "score": 1,
            "text": "Divorced 1 year now!!",
            "title_similarity": "0.1795588",
            "sentiment_compound": 0.0
        },
        {
            "id": "huudnmv",
            "score": 1,
            "text": "100% this",
            "title_similarity": "0.12894061",
            "sentiment_compound": 0.0
        },
        {
            "id": "huudrc9",
            "score": 3,
            "text": "Looks are overrated and they fade.   If I could do it all over again, attitude is everything…",
            "title_similarity": "0.4324907",
            "sentiment_compound": 0.0
        },
        {
            "id": "huuea4d",
            "score": 2,
            "text": "They’re still hot af and it’s going well!",
            "title_similarity": "0.24342373",
            "sentiment_compound": 0.3382
        },
        {
            "id": "huueqmt",
            "score": 2,
            "text": "Not great, divorced",
            "title_similarity": "0.14883189",
            "sentiment_compound": -0.5096
        },
        {
            "id": "huuerq9",
            "score": 2,
            "text": "Not good .. I op-ed for money and look so I have the money part",
            "title_similarity": "0.4605379",
            "sentiment_compound": -0.3412
        },
        {
            "id": "huuevtt",
            "score": 43,
            "text": "Divorced... I did get a son out of it .. so worth it",
            "title_similarity": "0.49628556",
            "sentiment_compound": 0.3593
        },
        {
            "id": "huuflb5",
            "score": 1,
            "text": "Growing up, my next door neighbours were a funny looking couple.  He was short, fat and bald and she was a bit taller and built like an ironing board with the ultimate resting bitch face.\n\nYet they were happy together...living in a terraced house, our kitchens looked into each other over the garden wall.  On more than one occasion my parents spotted them engaging in sexy times (or as my mum put it: \"I can se why they call it bumping uglies!\").\n\nAnyway, Sue (next door) shared a pearl of wisdom with my mum - \"Always go for the ugly ones!  They'll be far too grateful to ever cheat on you!\"",
            "title_similarity": "0.5910209",
            "sentiment_compound": 0.9037
        },
        {
            "id": "huuflwr",
            "score": 1,
            "text": "For another perspective- it almost doesn’t matter why you get together. It could be looks, money, or personality, convenience, and is probably a combination of all of those. \n\nThe real work of marriage/partnership is about why and how you stay together. To quote Chris Rock, “two crackheads can stay together forever.”",
            "title_similarity": "0.5383122",
            "sentiment_compound": -0.046
        },
        {
            "id": "huug3hk",
            "score": 2,
            "text": "Looks will bring me in the rest keeps me in. Don’t do this.",
            "title_similarity": "0.27041155",
            "sentiment_compound": 0.0
        },
        {
            "id": "huugc4x",
            "score": 5,
            "text": "Made my buddy hire this smoke show that came in to interview. Fast forward 14 years later and we are less then a month away from our first sons arrival. I didn't know at the time but she was more beautiful inside then out. \n\nSo far the secret has been to continue to date. I'm a constant suitor and it's such a fun game to play.",
            "title_similarity": "0.5665117",
            "sentiment_compound": 0.9365
        },
        {
            "id": "huughtk",
            "score": 2,
            "text": "Great",
            "title_similarity": "0.04490944",
            "sentiment_compound": 0.6249
        },
        {
            "id": "huuhdui",
            "score": 1,
            "text": "Met my wife in High School. She was honestly a knockout. She hid it for about 4 years (thick sweaters, baggy clothes etc.) But damn, she was smoking hot.\n\nWe've been together since and will continue to be together. Time has passed, we aged, but she is still the smoking hot babe I met in school. Won't change.",
            "title_similarity": "0.51048255",
            "sentiment_compound": -0.4118
        },
        {
            "id": "huuided",
            "score": 2,
            "text": "Show me the worlds hottest chick and I’ll show you the dude that’s tires of fucking her.",
            "title_similarity": "0.65857756",
            "sentiment_compound": 0.0
        },
        {
            "id": "huuihz1",
            "score": 1,
            "text": "I'm not married yet (I'm a guy) but to me you marry someone because you want to be with them for the rest of your life. There are more things that you can love them for than we can count, but if you marry them for just their looks, to me that is the biggest waste of time I can imagine.",
            "title_similarity": "0.6982168",
            "sentiment_compound": 0.5499
        },
        {
            "id": "huuijf0",
            "score": 2,
            "text": "Not me but my father:\n\n*\"...well, turns out she's a nice lady too, so I guess I hit jackpot?\"*",
            "title_similarity": "0.69094014",
            "sentiment_compound": 0.7469
        },
        {
            "id": "huuk52i",
            "score": 1,
            "text": "Yo. Looks fade quickly. Like really quickly hahaha",
            "title_similarity": "0.2440014",
            "sentiment_compound": 0.749
        },
        {
            "id": "huukv7s",
            "score": 1,
            "text": "It's over",
            "title_similarity": "0.056362607",
            "sentiment_compound": 0.0
        },
        {
            "id": "huuldec",
            "score": 2,
            "text": "I’d say not so good if they put on 50+ lbs right after the wedding. That happens a lot.",
            "title_similarity": "0.43770537",
            "sentiment_compound": -0.464
        },
        {
            "id": "huuliwe",
            "score": 1,
            "text": "Change this question. Men who married period. How's it going?",
            "title_similarity": "0.6616953",
            "sentiment_compound": 0.0
        },
        {
            "id": "huulmyk",
            "score": 10,
            "text": "You should never marry for looks only. The person inside matters so much more.  Looks fade over time. I lucked out. I married a woman who was both beautiful outside and inside.  It hasn’t been always easy, life rarely is, but we married 28 years and I would do it again in a heartbeat. She made me a better person.",
            "title_similarity": "0.6508814",
            "sentiment_compound": 0.85
        },
        {
            "id": "huulyuv",
            "score": 2,
            "text": "Married at 26, divorced at 28, remarried at 31 for the right reason, never been happier.",
            "title_similarity": "0.58275443",
            "sentiment_compound": -0.4168
        },
        {
            "id": "huum8gn",
            "score": 2,
            "text": " Not great. We were married ten years and have been divorced seven now. Was fun while it lasted I guess",
            "title_similarity": "0.4673086",
            "sentiment_compound": 0.0015
        },
        {
            "id": "huumdmu",
            "score": 2,
            "text": "It's going swell actually. And she has the same taste in women that I do. So that's pretty neat...",
            "title_similarity": "0.44833887",
            "sentiment_compound": 0.7745
        },
        {
            "id": "huumld7",
            "score": 1,
            "text": "Great! Because I married her for her personality, too!",
            "title_similarity": "0.62143594",
            "sentiment_compound": 0.6892
        },
        {
            "id": "huummt3",
            "score": 2,
            "text": "Married 27 years today.",
            "title_similarity": "0.22960004",
            "sentiment_compound": 0.0
        },
        {
            "id": "huummwf",
            "score": 1,
            "text": "I am sure they get a fresh one every ten years or so.",
            "title_similarity": "0.28925496",
            "sentiment_compound": 0.5574
        },
        {
            "id": "huumq49",
            "score": 1,
            "text": "I was married to a really beautiful woman. I only lasted fpr 3 years, so not going well I should say",
            "title_similarity": "0.48579884",
            "sentiment_compound": 0.4793
        },
        {
            "id": "huumq7q",
            "score": 1,
            "text": "Fact: A lot of marriages in India are arranged.\n\nPpl decide whether to marry or not based on how the other person looks. Maybe that's why a lot of marriages in suck.",
            "title_similarity": "0.586517",
            "sentiment_compound": -0.4404
        },
        {
            "id": "huunskw",
            "score": 1,
            "text": "Not good at all",
            "title_similarity": "-0.030456847",
            "sentiment_compound": -0.3412
        },
        {
            "id": "huuo80v",
            "score": 1,
            "text": "Don’t marry for looks. That’s all i have to say. \nHonestly after the novelty wore off, it was a cluster in my mind. Here is this intelligent, sincere, person and all i focused on was looks. \nAfter about a bit of tight challenging, i shifted my mindset to her inner beauty and her real self. \nI have never been more in love",
            "title_similarity": "0.6536282",
            "sentiment_compound": 0.9669
        },
        {
            "id": "huuoywo",
            "score": 2,
            "text": "I was on a business trip and one of the sales guys was talking about his kids and the sports they’re in and somehow got to talking about his wife. Said they basically had zero in common and if they didn’t have their kids to talk about they’d have zero connection “but damn was she hot when we met” or something like that. Said it while laughing, but the whole thing was super uncomfortable. \n\nA few months later they were getting divorced and he was dating the rep for our biggest customer.",
            "title_similarity": "0.68540776",
            "sentiment_compound": 0.6059
        },
        {
            "id": "huup0ds",
            "score": 1,
            "text": "Never date anyone that makes less than you do",
            "title_similarity": "0.25787243",
            "sentiment_compound": 0.0
        },
        {
            "id": "huup9il",
            "score": 1,
            "text": "Pls b honest guys🤕",
            "title_similarity": "0.14300841",
            "sentiment_compound": 0.5574
        },
        {
            "id": "huupnsf",
            "score": 1,
            "text": "to whoever thinks some of this stories are inspiring. Don't. They just got lucky or they are lying.",
            "title_similarity": "0.48948377",
            "sentiment_compound": 0.296
        },
        {
            "id": "huupwld",
            "score": 3,
            "text": "Much better now, the divorce 13 years ago was rough though.",
            "title_similarity": "0.33401334",
            "sentiment_compound": 0.4404
        },
        {
            "id": "huuq1vn",
            "score": 2,
            "text": "Not… not great. The way she talks to customer service staff and her pretentious attitude above everything drains the life out of me. But I have zero self esteem or strength to leave. Hell she’s even cheated on me multiple times in our 4 year marriage yet here I am.",
            "title_similarity": "0.47050613",
            "sentiment_compound": -0.8749
        },
        {
            "id": "huur3j8",
            "score": 1,
            "text": "I dated several girls for various reasons over the years and I found that those who were stunningly beautiful were usually very judgmental, self-conscious, shallow, or just concerned about very superficial things where as girls who were slightly less beautiful exuded more confidence because they embraced their flaws and thus didn’t spend time caring about appearances. It would usually last a few months before I found despite the beauty, I wasn’t attracted to them anymore and would move on.",
            "title_similarity": "0.5937601",
            "sentiment_compound": 0.9294
        },
        {
            "id": "huurfig",
            "score": 1,
            "text": "Knew her since middle school, last seen when 18...met each other again with 29. She was a stunner and I asked her to marry me 6 months later. This year we are 10 years married and she is still the most beautiful woman to me. We have been through the good times and the bad and I am grateful each day for her. It was not only for her looks to be honest, but they were a major factor back then - not gonna lie. 😇",
            "title_similarity": "0.56356174",
            "sentiment_compound": 0.3019
        },
        {
            "id": "huurmzd",
            "score": 1,
            "text": "9 years and no doubts.",
            "title_similarity": "0.056984007",
            "sentiment_compound": 0.2235
        },
        {
            "id": "huurpnw",
            "score": 2,
            "text": "Looks are temporary. She don’t look the same after 2-3 years…",
            "title_similarity": "0.23983967",
            "sentiment_compound": 0.0
        },
        {
            "id": "huus6vn",
            "score": 1,
            "text": "One word “plastic surgery”",
            "title_similarity": "0.10504395",
            "sentiment_compound": 0.0
        },
        {
            "id": "huus7u5",
            "score": 3,
            "text": "People finding out it works both ways. Don't expect to marry someone for their looks and not have the same thing be happening to you. Same with sex. Do your absolute best to make that a low priority. Because the moment your dick doesn't work you're fucked buddy.",
            "title_similarity": "0.6606841",
            "sentiment_compound": 0.5132
        },
        {
            "id": "huusddu",
            "score": 2,
            "text": "Going great. Three kids later, she still looks amazing!",
            "title_similarity": "0.24352239",
            "sentiment_compound": 0.8478
        },
        {
            "id": "huusgwq",
            "score": 2,
            "text": "All these people saying it didn’t work out for them, but I date people cause I’m attracted to their personality and I’m still divorced, and have had a couple of bad breakups. I’ve learned relationships are hard no matter the reason you initially get together.",
            "title_similarity": "0.69771063",
            "sentiment_compound": -0.4139
        },
        {
            "id": "huuslbz",
            "score": 3,
            "text": "I am divorced with 3 kids, she is now a drunk tweaker.  See's the kids on average 1-2 days a month, never helps with money and constantly asks me for money even though I am poor and raising 3 kids by myself. She says she got covid a few weeks ago and has been having all kinds of heart, liver and kidney problems, which I am conflicted about.  But goddamn until she was 30ish she was smoking hot",
            "title_similarity": "0.4564022",
            "sentiment_compound": -0.7745
        },
        {
            "id": "huusmbm",
            "score": 5,
            "text": "I find that men are attracted to women who have similar features.  Once you know this you can’t stop recognizing how so many couples look alike.  That being said, these men who claim they married for looks are describing “their” hot.  I bet many of us would disagree about how hot.",
            "title_similarity": "0.8333456",
            "sentiment_compound": -0.25
        },
        {
            "id": "huusy6l",
            "score": 2,
            "text": "Pretty well after twenty years.",
            "title_similarity": "0.23217013",
            "sentiment_compound": 0.6486
        },
        {
            "id": "huut1vt",
            "score": 2,
            "text": "She’s still gorgeous!😍",
            "title_similarity": "0.20828593",
            "sentiment_compound": 0.807
        },
        {
            "id": "huutisn",
            "score": 2,
            "text": "Divorced",
            "title_similarity": "0.14755857",
            "sentiment_compound": 0.0
        },
        {
            "id": "huuttsl",
            "score": 2,
            "text": "Never married luckily, but we pretty much were - all but the ring (definitely easier than divorce, obviously). Turned out to be a manipulative, sociopath. Spent years thinking I was a horrible person. Finally realized what was going on after 7 years and left her. Unfortunately she’s still in my life, doing her best to make me miserable, because we have a kid together. But I’m dealing with her as I need, I’m obsessed with my amazing son, and I’m wildly happy right now. Life is good - learned a lot and got the best part of my life out of it, my son.",
            "title_similarity": "0.57386446",
            "sentiment_compound": 0.9781
        },
        {
            "id": "huutycp",
            "score": 5,
            "text": "Once she started taking my affection for granted, she started visibly taking in all the attention that she got from other men. She once left me with her kids from her previous marriage, went to the bar, and later cheated on me with an ex-boyfriend in a hotel room. Now she's a little older and years of drinking and smoking have caught up with her and she can't get by on her looks anymore. The way she looks at me whenever we see each other almost makes it worth what I went through with her.",
            "title_similarity": "0.63736683",
            "sentiment_compound": 0.4091
        },
        {
            "id": "huuudt7",
            "score": 1,
            "text": "I’m literally laughing here. Just for her looks? That’s so shallow and who does this needs their 3rd eye poked like a 3stooges skit.",
            "title_similarity": "0.4892804",
            "sentiment_compound": 0.6908
        },
        {
            "id": "huuufeq",
            "score": 1,
            "text": "It turns out she's really smart and kind too. Lucky me.",
            "title_similarity": "0.2963211",
            "sentiment_compound": 0.8576
        },
        {
            "id": "huuutni",
            "score": 8,
            "text": "I've heard a lot from patients over the years.  Hard to say how many are happy because they're not going to talk about it.  Those with bad experiences describe it as having condemned themselves to decades of misery, \"just for a piece of ass.\" Some who have found new love indicate it is much stronger and saner.",
            "title_similarity": "0.5520633",
            "sentiment_compound": -0.5423
        },
        {
            "id": "huuv6y6",
            "score": 3,
            "text": "The divorce papers are on my nightstand",
            "title_similarity": "0.32929975",
            "sentiment_compound": 0.0
        },
        {
            "id": "huuv9lb",
            "score": 3,
            "text": "Signed divorce papers yesterday",
            "title_similarity": "0.42130908",
            "sentiment_compound": 0.0
        },
        {
            "id": "huuvdcn",
            "score": 2,
            "text": "Not great",
            "title_similarity": "-0.03212643",
            "sentiment_compound": -0.5096
        },
        {
            "id": "huuwdr2",
            "score": 4,
            "text": "[Jimmy Soul - If You Wanna be Happy](https://youtu.be/Qh9ZZgDqzAg)",
            "title_similarity": "0.4283713",
            "sentiment_compound": 0.0
        },
        {
            "id": "huux2a5",
            "score": 4,
            "text": "First love, first marriage going through separation, I’m moving to the opposite side of the country to get away, abusive and manipulative nonstop attempts from her, everything superficial, took kids, fake domestic violence reports, i wrote a poem to try to get to her about how she makes me feel, she threatened to do another domestic violence report lol, really toxic lmao",
            "title_similarity": "0.55952847",
            "sentiment_compound": -0.8085
        },
        {
            "id": "huuxc42",
            "score": 3,
            "text": "Eh it's fine. My wife is hot and she loves me a lot. All I need",
            "title_similarity": "0.50496554",
            "sentiment_compound": 0.6705
        },
        {
            "id": "huuxoh8",
            "score": 5,
            "text": "100% do not do it. No matter how beautiful a person is, over time their incompatible personality will degrade that view of beauty In your mind until she’s no longer beautiful to you. Now you’re married to someone you don’t enjoy being with and aren’t attracted to.",
            "title_similarity": "0.58432734",
            "sentiment_compound": 0.7491
        },
        {
            "id": "huuy3rt",
            "score": 1,
            "text": "Almost every marriage happens like that here where I live.",
            "title_similarity": "0.31608936",
            "sentiment_compound": 0.3612
        },
        {
            "id": "huuzap8",
            "score": 2,
            "text": "The sex is great",
            "title_similarity": "0.339562",
            "sentiment_compound": 0.6249
        },
        {
            "id": "huuzkrd",
            "score": 3,
            "text": "Divorced after less than a year, about a decade ago. Totally dynamo in the sack and just…stunning. And exotic too. \n\nI’d say I regret it but she was really, really hot. Still screwed up from it.",
            "title_similarity": "0.4977677",
            "sentiment_compound": -0.7647
        },
        {
            "id": "huuzl6j",
            "score": 3,
            "text": "Divorced since 3years",
            "title_similarity": "0.19766921",
            "sentiment_compound": 0.0
        },
        {
            "id": "huuzsvl",
            "score": 2,
            "text": "I'm 61.  My trophy wife is 51.  It's going as expected.",
            "title_similarity": "0.42649102",
            "sentiment_compound": 0.0
        },
        {
            "id": "huuzzcf",
            "score": 3,
            "text": "When we married, she wasn't nearly as beautiful as when we divorced.  She was a great woman. Unfortunately by the time we divorced that was her only redeeming quality.  Now she's getting older and vanity is treating her harshly.",
            "title_similarity": "0.54523826",
            "sentiment_compound": -0.3283
        },
        {
            "id": "huv0dni",
            "score": 3,
            "text": "Ron White def had it it right. Don’t marry for looks alone cause you can’t fix stupid.",
            "title_similarity": "0.5160788",
            "sentiment_compound": -0.6597
        },
        {
            "id": "huv0eph",
            "score": 3,
            "text": "Terrible",
            "title_similarity": "0.02090132",
            "sentiment_compound": -0.4767
        },
        {
            "id": "huv0gj5",
            "score": 2,
            "text": "Not good",
            "title_similarity": "-0.025159521",
            "sentiment_compound": -0.3412
        },
        {
            "id": "huv0ong",
            "score": 12,
            "text": "All that glitters is not gold.",
            "title_similarity": "-0.026864197",
            "sentiment_compound": 0.0
        },
        {
            "id": "huv0pns",
            "score": 3,
            "text": "Ugh. These replies hurt. I’m not over the top beautiful-especially since I’m now older and am definitely not stupid but sometimes I look at situations and interpret the movie in a different way. I ask my husband questions to get clarification. He’s the most loving person I know and never makes me feel like a dummy.",
            "title_similarity": "0.5563447",
            "sentiment_compound": 0.8549
        },
        {
            "id": "huv0smn",
            "score": 6,
            "text": "The relationship lasted 1 year dating 1.5 years married. Divorced her, and I felt free and happy.",
            "title_similarity": "0.43241525",
            "sentiment_compound": 0.7906
        },
        {
            "id": "huv15qx",
            "score": 2,
            "text": "I’ll just leave this right here:\n\nhttps://youtu.be/pInk1rV2VEg",
            "title_similarity": "0.25365198",
            "sentiment_compound": -0.0516
        },
        {
            "id": "huv1639",
            "score": 7,
            "text": "Never getting married again as long as I live and I’ll be happy with that",
            "title_similarity": "0.3498863",
            "sentiment_compound": 0.5719
        },
        {
            "id": "huv184f",
            "score": 2,
            "text": "Married for 16 months but together for 11 years. It's going great. She's also 3\" taller than me.",
            "title_similarity": "0.34567344",
            "sentiment_compound": 0.7684
        },
        {
            "id": "huv1ivj",
            "score": 1,
            "text": "Yeah like redditors married someone for looks lmao",
            "title_similarity": "0.7280252",
            "sentiment_compound": 0.8225
        },
        {
            "id": "huv2aru",
            "score": 3,
            "text": "On older men marrying young hotties, it reminds me of the Steve McQueen line in the Magnificent Seven “reminds me of that fellow back home that fell off a 10 story building, as he was falling people on each floor could hear him say so far so good”.",
            "title_similarity": "0.5766866",
            "sentiment_compound": 0.5106
        },
        {
            "id": "huv2m25",
            "score": 2,
            "text": "I dated a girl for her looks once. She was so sweet and endearing…for about 3 or 4 months. One day the switch flipped and she turned into a psycho. It was a nightmare. \n\nNever again.",
            "title_similarity": "0.55184186",
            "sentiment_compound": 0.5949
        },
        {
            "id": "huv2xcx",
            "score": 2,
            "text": "I dated a girl when I was in my early 20’s and she was very pretty, prettiest girl I had dated up to that point, but she was not smart and somewhat of an awful person. Everything had been handed to her because of her looks and so she didn’t have a great personality. I could go into details about how shitty the relationship was, there were highs and lows, but ultimately I found myself taking Percocet as a way to escape how shitty the relationship was. It wasn’t a one way street, I was also not a great bf, but it just goes to show, there needs to actually be chemistry and common interest for a relationship to thrive, not just sexual attraction.",
            "title_similarity": "0.594478",
            "sentiment_compound": -0.8937
        },
        {
            "id": "huv3eic",
            "score": 4,
            "text": "Actually never married her. I was engaged .dropped 4 k on ring. Dumb",
            "title_similarity": "0.38492084",
            "sentiment_compound": -0.1531
        },
        {
            "id": "huv3u7p",
            "score": 1,
            "text": "I mean you obviously need to be somewhat attracted to a women to atleast marry her",
            "title_similarity": "0.6560677",
            "sentiment_compound": 0.3626
        },
        {
            "id": "huv3ypk",
            "score": 3,
            "text": "I once dated a smoking hot woman who admitted that she “didn’t understand why people like hugs.” Lots of mental issues. Looking back, I dodged a bullet, but I hope she’s doing better.",
            "title_similarity": "0.6610905",
            "sentiment_compound": 0.8641
        },
        {
            "id": "huv42z2",
            "score": 1,
            "text": "This post does not reference me, but I'll point out: this is a very weird post to comment on, considering you have to concede/admit that you (seriously?) only married someone based on looks. I mean, if you say it's one of the main reasons, that's more common - but to profess you've married on looks alone is like admitting you don't care about your relationship with your spouse at all.",
            "title_similarity": "0.6732797",
            "sentiment_compound": -0.7377
        },
        {
            "id": "huv43jb",
            "score": 6,
            "text": "I can't be myself, I can't be happy.  \nI'm constantly being blamed for something, I'm constantly being told that I'm annoying.  I should have left years ago, but now we have a 2 yr old son.",
            "title_similarity": "0.42467403",
            "sentiment_compound": -0.5992
        },
        {
            "id": "huv4br2",
            "score": 1,
            "text": "We had a kid shortly after college and decided to marry. Had some really rough patches but we learned to like each other and are in a good spot now. When I say rough I mean if we didn’t have a kid together I would have left her. She was insanely hot and even after two kids I think she’s the most beautiful girl I’ve ever seen",
            "title_similarity": "0.6793647",
            "sentiment_compound": 0.9311
        },
        {
            "id": "huv4n0h",
            "score": 2,
            "text": "I’m still on my first marriage.  Once we get old and divorced I’m marrying a 22 year old hottie.",
            "title_similarity": "0.524687",
            "sentiment_compound": 0.0
        },
        {
            "id": "huv4o0j",
            "score": 9,
            "text": "I have the prettiest 5yo girl on the planet. That's what I got from it. Now I'm trying to keep her from turning out like her mother.",
            "title_similarity": "0.48366898",
            "sentiment_compound": 0.7351
        },
        {
            "id": "huv4vvx",
            "score": 1,
            "text": "Probably shitty and with half their money gone. Lol",
            "title_similarity": "0.24839175",
            "sentiment_compound": -0.2023
        },
        {
            "id": "huv50l3",
            "score": 1,
            "text": "I love the way my wife looks.\nIn fact, if it wasn’t for the fact that she looks so damn good she wouldn’t have ever seen me.",
            "title_similarity": "0.5943683",
            "sentiment_compound": 0.5977
        },
        {
            "id": "huv5igb",
            "score": 1,
            "text": "[Here is the best advice - thanks Jimmy!](https://youtu.be/Qh9ZZgDqzAg)",
            "title_similarity": "0.40261477",
            "sentiment_compound": 0.8122
        },
        {
            "id": "huv5kv6",
            "score": 1,
            "text": "She ended up being a covert narcissist and 5 years later I’m getting a divorce as a shell of a former man. She was smart too, so I guess that didn’t help. Idk, good luck to everyone else.",
            "title_similarity": "0.5570532",
            "sentiment_compound": 0.872
        },
        {
            "id": "huv5n87",
            "score": 1,
            "text": "A hot girlfriend.",
            "title_similarity": "0.43125555",
            "sentiment_compound": 0.0
        },
        {
            "id": "huv5oc6",
            "score": 2,
            "text": "Dated for the looks, stayed for the personality and attitude. It’s been great. Many ugly ppl are also ugly inside.",
            "title_similarity": "0.51589787",
            "sentiment_compound": -0.3612
        },
        {
            "id": "huv65ef",
            "score": 2,
            "text": "Wife with model looks and now filing for divorce after 18 years of marriage. Honestly I'm glad its over. And I no longer find the media-hyped standard of beauty attractive at all anymore. Now I'm turned on more by personality and outlook on life, and by women of all types, sizes, colours, ethnicities.",
            "title_similarity": "0.6548989",
            "sentiment_compound": 0.8885
        },
        {
            "id": "huv6isa",
            "score": 1,
            "text": "Appearance is always deceptive.",
            "title_similarity": "0.17698526",
            "sentiment_compound": 0.0
        },
        {
            "id": "huv6o18",
            "score": 1,
            "text": "Honestly it’s going pretty good after a rocky start. 5 years in.",
            "title_similarity": "0.19815224",
            "sentiment_compound": 0.8442
        },
        {
            "id": "huv70i1",
            "score": 1,
            "text": "Where once there was beauty has become a wellspring of cunning and resourcefulness.",
            "title_similarity": "0.347045",
            "sentiment_compound": 0.743
        },
        {
            "id": "huv727g",
            "score": 2,
            "text": "I'm not married. But this post has been immensely valuable to me. 👍🏻",
            "title_similarity": "0.34592995",
            "sentiment_compound": 0.631
        },
        {
            "id": "huv77tf",
            "score": 1,
            "text": "https://youtu.be/ql4p7ipnFWE",
            "title_similarity": "0.14693622",
            "sentiment_compound": 0.0
        },
        {
            "id": "huv78aq",
            "score": 1,
            "text": "I don't know,  after my meme stocks portfolio going down the drain, she has been with her boyfriend 24/7.",
            "title_similarity": "0.5317532",
            "sentiment_compound": 0.0
        },
        {
            "id": "huv7c45",
            "score": 3,
            "text": "I used to think she would grow out of this “everything sucks “ Persona . 10yrs later , she’s still hot but I’m mentally burned on consistently being bombarded with negative vibes .",
            "title_similarity": "0.51623034",
            "sentiment_compound": -0.7783
        },
        {
            "id": "huv7jav",
            "score": 1,
            "text": "Pretty sure there’s a song about this",
            "title_similarity": "0.25175172",
            "sentiment_compound": 0.6705
        },
        {
            "id": "huv7mux",
            "score": 1,
            "text": "It doesn't look so good.",
            "title_similarity": "-0.013245782",
            "sentiment_compound": 0.5777
        },
        {
            "id": "huv83nx",
            "score": 1,
            "text": "Dated a guy was very good looking for 10 years. He was lack luster intellectualy I started to despise him. Yeah- its a thing.",
            "title_similarity": "0.5386898",
            "sentiment_compound": 0.1761
        },
        {
            "id": "huv83xd",
            "score": 1,
            "text": "If you wanna be happy for the rest of your life, never make a pretty woman your wife.",
            "title_similarity": "0.49565578",
            "sentiment_compound": 0.2668
        },
        {
            "id": "huv87h8",
            "score": 1,
            "text": "This question reminds me of this song.\n\nhttps://youtu.be/fxUY-99TPRY",
            "title_similarity": "0.39436984",
            "sentiment_compound": 0.0
        },
        {
            "id": "huv87l4",
            "score": 2,
            "text": "My second marriage was motivated by necessity (both single parents, needed to support each other) and looks.  Both very selfish reasons to get married.  Needless to say, her looks didn't make up for all of the unresolved childhood issues she was carrying around.  The things men overlook in the name of their dick.",
            "title_similarity": "0.66105735",
            "sentiment_compound": -0.2484
        },
        {
            "id": "huv8ihr",
            "score": 2,
            "text": "Never got married, maybe never will, but I did date a girl only for her looks once. Biggest mistake of my early 20s. \n\nHad to break off a friendship with her ex, lost time, ignored better options, had to deal with guys giving her attention and she wanting it, dealt with her best friend that was just going on and on about eating her up, literally, and got cheated on with the guy that has been *stalking and annoying her* for two years. \n\nFun times, never again.",
            "title_similarity": "0.6265918",
            "sentiment_compound": 0.8847
        },
        {
            "id": "huv8j84",
            "score": 1,
            "text": "Haha she was engaged to a woman when i first met her. Hated men. Weird how things work out",
            "title_similarity": "0.71995056",
            "sentiment_compound": -0.0516
        },
        {
            "id": "huv8k7c",
            "score": 1,
            "text": "[deleted]",
            "title_similarity": "0.042279053"
        },
        {
            "id": "huv8o1n",
            "score": 2,
            "text": "My wife is a smoke show and we’ve been mostly happy 20 years this April. I married her because she’s beautiful but she also shares most of my values and she has a good heart. She married me because I wouldn’t put up with her bullshit when we were dating.  She said about 6 months into dating, “You’re the first person I’ve ever dated that didn’t kiss my ass too much.” Well, honey Atlanta was FULL of lovely women in 1996, may still be for all I know.",
            "title_similarity": "0.5983061",
            "sentiment_compound": 0.9712
        },
        {
            "id": "huv8o3e",
            "score": 1,
            "text": "You know, it *is* possible to find a woman who looks amazing and also vibes with you on a level better than your bros, right?\n\nAnd even better, she actually *wants* to put your 2 inch destroyer in her mouth. \n\nNostalgia can be cruel sometimes🥲",
            "title_similarity": "0.58331156",
            "sentiment_compound": 0.4215
        },
        {
            "id": "huv95pe",
            "score": 1,
            "text": "Years ago I asked my dad why he married my mom and he told me “because she had a big ass and could do the splits”.\nThey were married for 13/14 years (I think) and are now divorced. However during that marriage he had a number of affairs and was physically abusive. So….not much of a loss there.",
            "title_similarity": "0.6209053",
            "sentiment_compound": -0.8658
        },
        {
            "id": "huv97qm",
            "score": 1,
            "text": "Admiral Ackbar is trying to tell me something before I reply, give me a second...",
            "title_similarity": "0.3673772",
            "sentiment_compound": 0.3182
        },
        {
            "id": "huv9ov8",
            "score": 3,
            "text": "I wasn’t popular in high school but now all the popular chicks I went to school with are all haggard looking with their husbands trying to dm me 20 yrs later so definitely don’t go on looks. I’m like nope cuz they look like crap now to. I’ll stick with my unpopular guys that have somehow also become better looking.",
            "title_similarity": "0.5704831",
            "sentiment_compound": 0.9537
        },
        {
            "id": "huv9qf7",
            "score": 7,
            "text": "Divorced with 1700$ payment a month, don’t do it",
            "title_similarity": "0.32279494",
            "sentiment_compound": 0.0
        },
        {
            "id": "huv9yjn",
            "score": 2,
            "text": "My fiance told me when we met he thought I was the most beautiful person he's ever met , a week later I got sick with appendicitis nearly dying . He rushed to hospital, beating the emts to the ramp . He stayed with me for 6 and half days, he helped me walk, eat , bath and just sat with me for 6 days . We have been together for 4 years now. And he swears I'm still the most beautiful person he's seen .",
            "title_similarity": "0.5338397",
            "sentiment_compound": 0.5083
        },
        {
            "id": "huvaf61",
            "score": 2,
            "text": "3 years of hard fucking, next wife 2 years of fucking gooood, last wife 13 years bouncing over each other when the kids are away.",
            "title_similarity": "0.44145423",
            "sentiment_compound": -0.1027
        },
        {
            "id": "huvam8k",
            "score": 1,
            "text": "What all these men fail to say is that their smoking hot wife is no longer smoking hot hence it’s not valid",
            "title_similarity": "0.51702315",
            "sentiment_compound": -0.6908
        },
        {
            "id": "huvao2u",
            "score": 3,
            "text": "Luckily, when I started dating the \"just her looks\" girl, I was mature enough to recognize the flaws outside of looks. Not that she was a bad person or anything. Just super non-compatible in the long run. Different interests. Different religious views. \n\nI can't tell you how long it took me to break up with her. Every time we would meet, we would have sex. And the sex was incredible. I would resolve to not have sex and just break up. I was impossible. I ended up breaking up over the phone rather than keep attempting to break up in person, which might still be going on now, 25ish years later. LOL",
            "title_similarity": "0.5890559",
            "sentiment_compound": 0.9312
        },
        {
            "id": "huvap7c",
            "score": 2,
            "text": "Great, she’s super busy with her career and I’m super busy with my professional video game aspirations. We spend some time together on the weekends for sex and then go back to our busy lives. Marriage is a partnership and I love it.",
            "title_similarity": "0.5411359",
            "sentiment_compound": 0.9524
        },
        {
            "id": "huvbfid",
            "score": 1,
            "text": "My dad knocked up his girlfriend at 19 after a Tool concert and I popped out. Wedlock marriage. They were married for ten unhappy years and my dad still abusively litigates my mom.",
            "title_similarity": "0.50996715",
            "sentiment_compound": -0.765
        },
        {
            "id": "huvbj2g",
            "score": 2,
            "text": "I didn’t marry my wife just for her looks, I don’t think.  But I also think she’s a 100/10 but she doesn’t believe me. \n\nbut I stumbled into that sub, and it kinda reminds me of a tame version of TwoX or FDS. Happened on two threads involving men that turned into women making fun of them, and the threads getting locked.\n\nWhat’s the opposite of misogynistic? Because I’ve seen 3 subreddits like it lately, and it has to have a name.",
            "title_similarity": "0.7407287",
            "sentiment_compound": 0.8271
        },
        {
            "id": "huvbux9",
            "score": 1,
            "text": "A lot of you guys have a “victim” mentality … My parents were both attractive in their youth years (still til this day) but essentially I think both partners have to be really physically attracted to each other, mutual sexual drive, and of course the not superficial things such as personality & traits that solidify your wants, needs and trust. My parents are still married. Although both my parents said marriage is hard especially when you’re both get attention constantly but if there’s a bond it’s no biggie. \n\n\nRule of thumb is don’t get married if you think you’re partner isn’t attracted to you, emotionally attached to you, or any good traits they don’t posses. Only you know deep down the truth or feeling. Don’t play yourself.",
            "title_similarity": "0.71286106",
            "sentiment_compound": 0.9701
        },
        {
            "id": "huvbwmu",
            "score": 3,
            "text": "I swiped right on my wife because she is SUPER hot.  She had nothing in her tinder bio.  \n\nI fell in love with her and married her because she is the most wonderful person I've ever known.",
            "title_similarity": "0.5627685",
            "sentiment_compound": 0.9303
        },
        {
            "id": "huvbxta",
            "score": 1,
            "text": "Going through a divorce after four years; she cheated twice (different guys.). No remorse accountability. Is dating someone else after 2 months of the separation; not the same coworker she was cheating on me with. Beautiful people with so substance are not worth it.",
            "title_similarity": "0.5800692",
            "sentiment_compound": -0.4314
        },
        {
            "id": "huvc7yd",
            "score": 31,
            "text": "I have been shot in the stomach with a 9mm point blank by her because she has severe anger issues that she will not address.  Lol.",
            "title_similarity": "0.444672",
            "sentiment_compound": -0.824
        },
        {
            "id": "huvcf1c",
            "score": 3,
            "text": "We divorced over 16 years ago. She was/is batshit crazy. Our marriage was six years of hell but I wouldn't trade a day of it because my kids are amazing.",
            "title_similarity": "0.48112315",
            "sentiment_compound": 0.4019
        },
        {
            "id": "huvcu2y",
            "score": 2,
            "text": "All I’ll say is the hotter they are the crazier, jealous, more prone to low self esteem and left unchecked infidelity, needier etc. they are! If any man says otherwise they’re lying to you or themselves! Oh and the “not good in bed” is a LIE!! They’re “pro’s”!!! \n\nLastly, think about the cliches.. “there are (2) types of women. A whore and a princess. You treat the princess like a whore and vs versa; the only time you’ll know which one she is the 1st time you actually get some”.  “The hotter they are the more issues”. And so on.. \n\nNow having been married 2x the hottest ladies I’ve seen.. (still married to #2 now 20+yrs) I’ll say what others aren’t! Relationships TAKE WORK if you give up for BS then you’ll be repeating that cycle you’re entire life until you correct it!  There is NOTHING that cannot be worked out! I love my wife like crazy, in fact, I didn’t know what love was until her!! \n\nSo overall to answer your question.. it’s been a hell of a ride but a good one!",
            "title_similarity": "0.60381114",
            "sentiment_compound": 0.4188
        },
        {
            "id": "huvcvre",
            "score": 1,
            "text": "I think people who marry just for looks, are mostly people who are jumping into marriage too quickly. Don’t be afraid to take a few years before the big commitment. There’s much more to long term compatibility.",
            "title_similarity": "0.6996759",
            "sentiment_compound": 0.3818
        },
        {
            "id": "huvd0l4",
            "score": 2,
            "text": "It doesn’t feel awesome on the other side, especially as you get older. Like, dude, wtf did you think was gonna happen? I’d stay in some sort of time warp and stay 23 forever? Really? And you find you way to work everyday. Pfft… \n\n(happily divorced, still like the guy, but shit, what a dumbass thing to do)",
            "title_similarity": "0.5167428",
            "sentiment_compound": -0.8121
        },
        {
            "id": "huvdg53",
            "score": 2,
            "text": "Well married at 21. Damn she was hot and it went well until we had the first child about 2 years later.\n\nThe second one came about 20 months later. Then the crazyness really set in. But she hid it most of the time or I just didn't care.\n\nThe lesbianness came out 7 years after that.\n\nTurns out depression (on both our sides), unresolved childhood trauma, eating disorders, borderline personality disorder and me working didn't go together. Who knew?",
            "title_similarity": "0.51872146",
            "sentiment_compound": -0.9523
        },
        {
            "id": "huve7td",
            "score": 1,
            "text": "Divorced.  Thank the maker.",
            "title_similarity": "0.36611742",
            "sentiment_compound": 0.3612
        },
        {
            "id": "huvevj2",
            "score": 1,
            "text": "Not well!",
            "title_similarity": "-0.0248839",
            "sentiment_compound": -0.2746
        },
        {
            "id": "huvf78t",
            "score": 1,
            "text": "Oh you mean everyone",
            "title_similarity": "0.09276843",
            "sentiment_compound": 0.0
        },
        {
            "id": "huvg0bx",
            "score": 3,
            "text": "My marriage is alright. You gotta work at it and people change.\n\nI didnt get along with people that were beautiful or ugly so i feel i should atleast get someone beautiful as long as their kind. We have nothing in common but some say opposite attract.\n\nEven if you married for their bubbling personality people change especially after kids.",
            "title_similarity": "0.7041545",
            "sentiment_compound": 0.8271
        },
        {
            "id": "huvg0x2",
            "score": 2,
            "text": "My SO told me just last night that I am so beautiful that even if that’s all I had going for me it would be enough. I can definitely work with that.",
            "title_similarity": "0.48510665",
            "sentiment_compound": 0.8267
        },
        {
            "id": "huvg73t",
            "score": 1,
            "text": "Fucking terrible!!",
            "title_similarity": "0.043120977",
            "sentiment_compound": -0.6094
        },
        {
            "id": "huvgdl0",
            "score": 1,
            "text": "It’s possible to be hot and nice. Somehow I manage. 😎",
            "title_similarity": "0.31394398",
            "sentiment_compound": 0.7003
        },
        {
            "id": "huvh1nk",
            "score": 1,
            "text": "When your dick is the only one who choose your wife, \nDo not espect it to last much",
            "title_similarity": "0.5498508",
            "sentiment_compound": -0.5106
        },
        {
            "id": "huvhea5",
            "score": 1,
            "text": "Could be better…",
            "title_similarity": "0.13993883",
            "sentiment_compound": 0.0
        },
        {
            "id": "huvhfe7",
            "score": 1,
            "text": "T TRB. E Ed fC e. zoom y",
            "title_similarity": "0.17104748",
            "sentiment_compound": 0.0
        },
        {
            "id": "huvhohv",
            "score": 2,
            "text": "Is this the wrong place to ask why we have to have ownership over our partners?",
            "title_similarity": "0.4037947",
            "sentiment_compound": -0.4767
        },
        {
            "id": "huvieuw",
            "score": 2,
            "text": "lol, anyone marrying for looks is likely going to be living a very unhappy life",
            "title_similarity": "0.53021085",
            "sentiment_compound": -0.0754
        },
        {
            "id": "huvikpp",
            "score": 3,
            "text": "When I was 26 I dated a 19 year old that had the body of a pornstar. Perfect rack, round firm ass, and all around great body. She was a head turner when we went out in public. I couldn't believe someone this hot was in to me.\n\nShe ended up being hollow inside from child neglect that she didn't fully share with me until after we separated. She would have episodes that made no logical sense. Hating me for no reason one day  then putting me on a pedestal the next, accusing me of trying to bang her friends and vice-versa, constantly going through my phone and social media, a slew of double-standards, and constantly feeling abandoned. She was diagnosed as bipolar that she knew about before we dated, but never disclosed to me. My unprofessional opinion is that she has BPD, or it's comorbid with her bipolar disorder. After she told me, all her wild ass behaviors made sense. \n\nWe dated off and on for three years, but the time we spent together was *the most toxic times of my life*. She ended up putting my physical well being in danger, threatened to call the cops to lie that I was beating her, and the final straw was when she hit me.\n\nI learned a lot about myself in those three years.",
            "title_similarity": "0.57180655",
            "sentiment_compound": -0.9818
        },
        {
            "id": "huvis9u",
            "score": 1,
            "text": "She cheated with a pizza guy and got pregnant while I was stationed overseas. Marriage didn’t last two years. She married him and had another kid then they got divorced. She’s working on divorce number 3 now lol.",
            "title_similarity": "0.5597641",
            "sentiment_compound": -0.0516
        },
        {
            "id": "huvjf2w",
            "score": 1,
            "text": "Not good as you age. \n\nSex changes away from fucking someone because they have good geometry. It’s all in the way they give you energy.",
            "title_similarity": "0.5660258",
            "sentiment_compound": 0.3806
        },
        {
            "id": "huvjl6r",
            "score": 1,
            "text": "Did not get married but spent 2 yrs with a 8-9 lvl hotty. Dark brunette with eyes that looked through your soul, really a different kind of hot than your conventional beauty. It was exhausting to constantly fend of advances from other guys. Like they’d hit on her while I’m standing there. To be clear these were fuckbois, good dudes don’t do this. I had to constantly be on alert. Didn’t last, she cheated on me, felt bad, I forgave her so she repaid me by leaving to pursue acting in nyc lol.",
            "title_similarity": "0.6580284",
            "sentiment_compound": 0.9161
        },
        {
            "id": "huvjtth",
            "score": 1,
            "text": "Not me, but a buddy of mine married his ex-wife because he loved her ass.  They had zero in common.  They had a kid about a year into the marriage and they separated when the kid was 1 month old.  Nothing but fighting ever since.",
            "title_similarity": "0.5898505",
            "sentiment_compound": 0.5048
        },
        {
            "id": "huvk7le",
            "score": 11,
            "text": "I think it’s going great!! Her boyfriend is an asshole though..",
            "title_similarity": "0.5975321",
            "sentiment_compound": 0.6892
        },
        {
            "id": "huvkh2e",
            "score": 1,
            "text": "She also makes more money than me",
            "title_similarity": "0.31303328",
            "sentiment_compound": 0.0
        },
        {
            "id": "huvkn8r",
            "score": 2,
            "text": "Reading through these responses and contemplating my own life lessons….I would recommend not getting married in general.",
            "title_similarity": "0.4393928",
            "sentiment_compound": 0.3612
        },
        {
            "id": "huvl5kx",
            "score": 1,
            "text": "fuckin awesome",
            "title_similarity": "0.1262115",
            "sentiment_compound": 0.659
        },
        {
            "id": "huvl8ko",
            "score": 1,
            "text": "Worst possible reason getting married.",
            "title_similarity": "0.44986913",
            "sentiment_compound": -0.6249
        },
        {
            "id": "huvlcbb",
            "score": 2,
            "text": "In my experience, really good looking people get very comfortable being treated and tailored by other people because of their looks. So, when they meet someone who treats them like any other person, they get offended. To them; there's someone always there to help them, do something for them, give them their undivided attention, and such. So, when they don't get that, life becomes unfair, hard and unjust. \n\nI guess you could say this is narcissism.",
            "title_similarity": "0.7117907",
            "sentiment_compound": 0.4915
        },
        {
            "id": "huvlftc",
            "score": 1,
            "text": "Ok. Thanks for asking.",
            "title_similarity": "0.1754258",
            "sentiment_compound": 0.4404
        },
        {
            "id": "huvlk7f",
            "score": 1,
            "text": "It’s going downhill. \n\nPhysical beauty, whether male or female, is a depreciating asset.",
            "title_similarity": "0.51243746",
            "sentiment_compound": 0.743
        },
        {
            "id": "huvlmax",
            "score": 2,
            "text": "Goddamnit dating my girl only for her looks now and this thread is a real eye opener. Scary shit.",
            "title_similarity": "0.6422884",
            "sentiment_compound": -0.7783
        },
        {
            "id": "huvlnfg",
            "score": 1,
            "text": "I’m onto my second wife now, but we’re not getting married.",
            "title_similarity": "0.46647644",
            "sentiment_compound": 0.0
        },
        {
            "id": "huvlupi",
            "score": 1,
            "text": "Going well.",
            "title_similarity": "0.111341685",
            "sentiment_compound": 0.2732
        },
        {
            "id": "huvlvuu",
            "score": 6,
            "text": "Gonna marry my girl of 3 years. I definitely approached because she was a showstopper. . I was an alcoholic. (Liquid courage)I thought we wouldnt work out because She is so hot, and I was a mess. But now I sobered up, I see that we actually are truly perfect for eachother. Sober me fits. It was a nice treat.",
            "title_similarity": "0.68175393",
            "sentiment_compound": 0.9535
        },
        {
            "id": "huvm31b",
            "score": 2,
            "text": "This makes me feel better about being kinda ugly",
            "title_similarity": "0.31586212",
            "sentiment_compound": -0.0276
        },
        {
            "id": "huvm3mz",
            "score": 2,
            "text": "I didn't marry but definitely was with my last girlfriend for years because the sex was great. We were never really very compatible so when the sex started to go south the relationship tanked too.",
            "title_similarity": "0.6245873",
            "sentiment_compound": 0.5808
        },
        {
            "id": "huvm4pv",
            "score": 5,
            "text": "Just asked my best friend and his response was \"that's pretty much all I've ever done. I loved them, don't get me wrong but I, for whatever reason, needed them to look hot. Married and divorced twice and engaged once. You've been there for the one I was ended to and the second marriage and I wasn't happy, it was all superficial \"happiness\". It's my downfall and a hurdle I'm learning to go around rather than jump. I'm enjoying being single and co-parenting my beautiful boys.\" Then went on to say I'm the best woman he's ever had in his life and joked that it's too bad I'm not his typical dhort n curvy, blue eyed, long blonde hair with fake tits chick we would already be married. (I'm practically the opposite, tall and slender, shoulder length brown hair, tatted and pierced and the mayor of the Itty bitty tittie committee)",
            "title_similarity": "0.7430831",
            "sentiment_compound": 0.9717
        },
        {
            "id": "huvm62z",
            "score": 3,
            "text": "Divorce is just wrapping up after close to a decade of physical, verbal, and emotional abuse. She’s a 14-year old trapped in a 40 year old’s body.",
            "title_similarity": "0.35101062",
            "sentiment_compound": -0.7906
        },
        {
            "id": "huvm8to",
            "score": 1,
            "text": "Reading the top comments I can’t help thinking of the line ‘Every man thinks he has the loveliest woman at home’. Take the positive and negative stories with a pinch of salt , beauty is relative.",
            "title_similarity": "0.6882409",
            "sentiment_compound": 0.802
        },
        {
            "id": "huvmbe6",
            "score": 2,
            "text": "Divorced",
            "title_similarity": "0.14755857",
            "sentiment_compound": 0.0
        },
        {
            "id": "huvmlb0",
            "score": 1,
            "text": "Women do it all the time, I'm not married tho, my friend is, and he says he's chillin",
            "title_similarity": "0.54113984",
            "sentiment_compound": 0.4939
        },
        {
            "id": "huvmprm",
            "score": 1,
            "text": "“If you wanna be happy for the rest of your life, never make a pretty woman your wife “",
            "title_similarity": "0.50726676",
            "sentiment_compound": 0.2668
        },
        {
            "id": "huvmxl6",
            "score": 2,
            "text": "I don’t know why anyone honestly would do that. For me, rudeness, stupidity and entitlement make even the 10/10 aesthetically pleasing humans immediately unbearable.\n\nOn a positive note, the flip side is also true. If someone has a magnetic and genuine personality , it can enhance your physical perception of them too. One example someone like Amy Poehler. Extremely basic looking, not a magnificent body, but she is so freakin funny and adorable that I find her incredibly attractive.",
            "title_similarity": "0.53107464",
            "sentiment_compound": 0.9534
        },
        {
            "id": "huvn9xm",
            "score": 2,
            "text": "She’s as good a mom as she looks. I won the game of life",
            "title_similarity": "0.45953006",
            "sentiment_compound": 0.765
        },
        {
            "id": "huvna81",
            "score": 6,
            "text": "She’s still stupid and I can’t fix that",
            "title_similarity": "0.121394455",
            "sentiment_compound": -0.5267
        },
        {
            "id": "huvnbe5",
            "score": 2,
            "text": "No one in a good relationship would feel that they just married for their looks",
            "title_similarity": "0.6811468",
            "sentiment_compound": 0.1779
        },
        {
            "id": "huvne7t",
            "score": 6,
            "text": "I'm  the opposite. Wife courted me for my attractiveness ( I'm a troll. I dunno why she wanted me. But alas, she got me.) Been struggling for years with an insecure wife that's sure I would cheat on her. I've never had sexual relations with anyone but her. We've been married 10 years but she still thinks I'm a secret gigalo even though I spend most of my time on gacha games and entertaining our kids...",
            "title_similarity": "0.61436987",
            "sentiment_compound": -0.7469
        },
        {
            "id": "huvnilh",
            "score": 3,
            "text": "Mine only lasted 5 days I walked in on her cheating.",
            "title_similarity": "0.24376066",
            "sentiment_compound": -0.5574
        },
        {
            "id": "huvnylo",
            "score": 5,
            "text": "My dad married my mum.. He was 35 i guess.. My. Mom was only 19/20 i guess.. The marriage was good for the first 5yrs.. The we moved an he started having trouble at his work place.. Was transferred several time.. He was an abusive man from before buh i guess my mum stayed for the stability since he had a decent job.. He's retired now and has no income.. My mum is struggling to put us all through school on her own.. I guess we should not settle for looks and stability",
            "title_similarity": "0.5605112",
            "sentiment_compound": -0.8402
        },
        {
            "id": "huvo237",
            "score": 1,
            "text": "Dont get married ez gg",
            "title_similarity": "0.28103858",
            "sentiment_compound": 0.0232
        },
        {
            "id": "huvo2u3",
            "score": 1,
            "text": "Umm, let me go check with my wife first 😔",
            "title_similarity": "0.49988222",
            "sentiment_compound": 0.0772
        },
        {
            "id": "huvo9tm",
            "score": 1,
            "text": "17 year….best decision I made. Not the marriage, but the divorce.",
            "title_similarity": "0.3616402",
            "sentiment_compound": 0.0
        },
        {
            "id": "huvob50",
            "score": 3,
            "text": "Note to self: don't marry just for looks.",
            "title_similarity": "0.44033438",
            "sentiment_compound": 0.0
        },
        {
            "id": "huvobe7",
            "score": 2,
            "text": "I married a woman that I deemed “safe” as in she’s average in attractiveness at best. Didn’t want to deal with possibility of getting cheated on or whatever. We’re divorced now because turns out we both wanted different things in life after 8 years. So if you’re like me don’t settle or be safe. Go for the one you want. You’ll just end up the same place as me.",
            "title_similarity": "0.6418525",
            "sentiment_compound": 0.8739
        },
        {
            "id": "huvoerb",
            "score": 3,
            "text": "Met my wife on tinder, so I of course thought she was smoking hot. Into our 5th year of marriage now and two fuck trophies, I’m one very lucky sob … Life is grand!",
            "title_similarity": "0.59160566",
            "sentiment_compound": 0.1547
        },
        {
            "id": "huvogzt",
            "score": 1,
            "text": "At the ripe age of 29 I am so glad I never got married when I was younger because I would of definitely went off of looks. At this point in life I don't care how my future wife looks (to a certain point). And will definitely only settle down with someone who is truly in love with me. My girlfriend at 21 years old, she was a definite 10/10, but she would steal things from me, cheat on me, and would rarely show me affection (affection isn't sex)... Yet I for some reason would always forgive her and felt trapped by her beauty... Thank God I didn't marry her, we would of been divorced by now for fact",
            "title_similarity": "0.58306575",
            "sentiment_compound": 0.8675
        },
        {
            "id": "huvoiuf",
            "score": 1,
            "text": "Going great, my spank bank is only  filled with past experiences with my wife. 2 kids later, we're both looking different and it's still awesome.",
            "title_similarity": "0.48802084",
            "sentiment_compound": 0.8481
        },
        {
            "id": "huvp1o0",
            "score": 1,
            "text": "Lookin good",
            "title_similarity": "0.13630146",
            "sentiment_compound": 0.4404
        },
        {
            "id": "huvp3di",
            "score": 2,
            "text": "I’ve dated many women based solely off their looks. To actually legally bind yourself to one you would need to be completely devoid of any kind of intelligence.",
            "title_similarity": "0.5248929",
            "sentiment_compound": 0.4951
        },
        {
            "id": "huvp4r3",
            "score": 1,
            "text": "I worked with a welder who said he married for looks. He also came right out and said he'd happily fuck over anyone at work if it gave him the slightest benefit. He was a real piece of shit",
            "title_similarity": "0.7871349",
            "sentiment_compound": -0.128
        },
        {
            "id": "huvph1v",
            "score": 2,
            "text": "My wife has the best tits. Our relationship could definitely be better.",
            "title_similarity": "0.5487931",
            "sentiment_compound": 0.836
        },
        {
            "id": "huvphgd",
            "score": 1,
            "text": "Poorly. We just separated.",
            "title_similarity": "0.15224823",
            "sentiment_compound": 0.0
        },
        {
            "id": "huvqb9v",
            "score": 1,
            "text": "Kayne (YE) relationship didn't last long and he was practically married to a narcissist porn video call girl lmao hell yeah not even billionaires make it to reality..Look Elon musk was married to a turtle who sings like a cat people understand one fact. Marriage is for the souls not for physical beauty. I have been married 18 years and his good looking but has a brain. I hope you all bitter people find beautiful brains and beautiful soul before looks. I swear if I was married to bag of rocks like YE would have checked myself into mental Ward too lmao.",
            "title_similarity": "0.60358065",
            "sentiment_compound": 0.9773
        },
        {
            "id": "huvqe0l",
            "score": 3,
            "text": "Apparently my husband is like this. I found out during my pregnancy that if I’m not attractive at the moment he just feels “platonic” love for me as he puts it. Destroyed all romantic feelings I had for him knowing he’s not in love with me at all for who I am as a person. We’re still married and friends and financial partners but idk if I can spend the rest of my life this way.",
            "title_similarity": "0.7153628",
            "sentiment_compound": 0.1687
        },
        {
            "id": "huvqror",
            "score": 1,
            "text": "Removed her for derailing",
            "title_similarity": "0.25707835",
            "sentiment_compound": 0.0
        },
        {
            "id": "huvqzdi",
            "score": 2,
            "text": "Not me but my uncle married a 20 yo model at his 40s. He was her plastic surgeon and even though they had absolutely nothing in common he always praised how she was a insanely beautiful woman and I'm pretty sure she had some kind of daddy issues. They had 2 kids but after her last pregnancy she became so scared of the weight she gained that her ED got worst till the point she passed away for underweight. He ended up marrying another of his young beautiful patients cause he didn't wanted to raise his kids alone.",
            "title_similarity": "0.63082314",
            "sentiment_compound": 0.9244
        },
        {
            "id": "huvrdkz",
            "score": 1,
            "text": "The trick is not to marry them.",
            "title_similarity": "0.18426529",
            "sentiment_compound": -0.0516
        },
        {
            "id": "huvrhrk",
            "score": 1,
            "text": "Wow. This is amazing cuz this is the FIRST time in my history of Reddit that I read ALL the comments in a post. \n\nMarried for 4 years and have a beautiful 2 year old daughter. Wife is fucking cute and way too cute for me, and I have my issues and she still loves me regardless. So going great so far. \n\nBy issues, she secretly found me to be bi, but still supports me regardless and I love her even more for it.",
            "title_similarity": "0.5591677",
            "sentiment_compound": 0.9735
        },
        {
            "id": "huvrxd7",
            "score": 2,
            "text": "Her sister is now the hot one.",
            "title_similarity": "0.46186328",
            "sentiment_compound": 0.0
        },
        {
            "id": "huvs2q8",
            "score": 4,
            "text": "If you intend on being with someone on the stringent basis of how symmetrical they are or what their appearance is, my question is: what does that say about you? In general, if you plan on being with someone for their “looks” it will not work out. Marriage is tough, Lots of work.",
            "title_similarity": "0.6677004",
            "sentiment_compound": -0.128
        },
        {
            "id": "huvsk4u",
            "score": 2,
            "text": "ask almost everyone in Indian subcontinent and esp in Bangladesh lmao",
            "title_similarity": "0.14451507",
            "sentiment_compound": 0.5994
        },
        {
            "id": "huvte9h",
            "score": 2,
            "text": "2 kids, divorced",
            "title_similarity": "0.17151698",
            "sentiment_compound": 0.0
        },
        {
            "id": "huvtlsr",
            "score": 2,
            "text": "My ex wife was Brazilian.... \n\nLasted 5 years, and only 2 of those years were us being married lol.\n\nMy current girlfriend, I fell in love with her personality, she is still super cute but she does not have my ex's body.... BUT personality is just so much better and it's so much easier dating her over my ex . Plus I am much more happier and that's what really matters.",
            "title_similarity": "0.5148127",
            "sentiment_compound": 0.9718
        },
        {
            "id": "huvtn0i",
            "score": 2,
            "text": "Mine is good from far and far from good.",
            "title_similarity": "0.18295217",
            "sentiment_compound": 0.7003
        },
        {
            "id": "huvtu2x",
            "score": 6,
            "text": "I met my wife on a blind date. She was the hottest, wildest chick I had ever come across and instantly fell in love. We are celebrating our 26th wedding anniversary this year and I couldn’t be more happily married, I still adore her.",
            "title_similarity": "0.57405585",
            "sentiment_compound": 0.9286
        },
        {
            "id": "huvu0v9",
            "score": 2,
            "text": "TIL don't marry a pretty girl. Just ejaculate and evacuate",
            "title_similarity": "0.39149648",
            "sentiment_compound": -0.3875
        },
        {
            "id": "huvubbr",
            "score": 1,
            "text": "My parents were beautiful and completely subject to prior traumas. They had children and divorced by the time I was four. I now have a roommate-like relationship with a woman I trust to at least thoughtfully coparent a child we have together if not have my intimate needs met. We didn't think it would turn out this way but here we are. She is learning to be kinder and I am learning to rapidly increase my income for all of us. We might get divorced when I know I am financially secure enough to support us all. For now it's really really fucking lonely often.",
            "title_similarity": "0.58792365",
            "sentiment_compound": 0.9144
        },
        {
            "id": "huvuozp",
            "score": 2,
            "text": "It’s going great…I’d rather have a pretty looking bitch than an ugly bitch.",
            "title_similarity": "0.50728434",
            "sentiment_compound": -0.8271
        },
        {
            "id": "huvuza6",
            "score": 2,
            "text": "[deleted]",
            "title_similarity": "0.042279053"
        },
        {
            "id": "huvv2l6",
            "score": 1,
            "text": "She can’t cook for shit but dat pussy is bomb…\n*…..just remembered I’m single*",
            "title_similarity": "0.3563295",
            "sentiment_compound": -0.3182
        },
        {
            "id": "huvvmyk",
            "score": 1,
            "text": "Wait people don’t marry other people because of looks?",
            "title_similarity": "0.5250251",
            "sentiment_compound": 0.0
        },
        {
            "id": "huvvnjw",
            "score": 1,
            "text": "yup, married my waifu for her looks. she's still on my glass shelf, looking cute",
            "title_similarity": "0.5369152",
            "sentiment_compound": 0.4588
        },
        {
            "id": "huvvvz9",
            "score": 1,
            "text": "Badly",
            "title_similarity": "0.021022901",
            "sentiment_compound": -0.4767
        },
        {
            "id": "huvvyvi",
            "score": 2,
            "text": "My opinion is if she likes you and she's hot and that's all you care about, go for it. Plenty of marriages end in divorce. This one might just be another in the long list including people who loves each other and just fall apart. I couldn't do that but hey, whatever floats your boat.",
            "title_similarity": "0.7100027",
            "sentiment_compound": 0.6542
        },
        {
            "id": "huvw295",
            "score": 2,
            "text": ">if you wanna be happy for the rest of your life, don't make a pretty woman your wife\n\nharry belafonte\n\nedit: 'pretty' not 'petty'",
            "title_similarity": "0.5433976",
            "sentiment_compound": 0.7063
        },
        {
            "id": "huvx0zy",
            "score": 1,
            "text": "Not me but a friend. He married her because she was, and I quote, \"Hotter than the sun.\" He was loaded so that's probably why she married him, because it turned out that she was an egotistical, vapid, vain cow who only cared about having the newest phone and the most expensive cars. She spent all day, every day spending my mate's money and hooking up with other men. \n\nThe marriage lasted just over two years because the poor sap wanted it to work and didn't realise the extent of how much she was taking him for a ride. He's happily married to a much, much nicer woman now.",
            "title_similarity": "0.70972717",
            "sentiment_compound": 0.8201
        },
        {
            "id": "huvx6g2",
            "score": 5,
            "text": "Ok gents, do me and the average in looks women a favor: don't tell us we're second choice. In the dating scene I see a shit ton of attractive men with 1-3 kids in yalls exact situation. Married for the wrong choices. Just don't date us and say you expected us to have great personalities because we aren't smoking hot. That's messed up. I've had two guys do that to me, one even told me that he got tired of dating models in LA because they were stupid so here he is talking to me. Of course it didn't work out cause he was just as stupid, but it definitely didn't work out because he said that. It makes it sound like were trolls and that he picked the least frightening troll to try to sleep with.  \n\nDon't make the same mistake twice, the end.😊🤭🤭🤭",
            "title_similarity": "0.768135",
            "sentiment_compound": 0.979
        },
        {
            "id": "huvx8dn",
            "score": 2,
            "text": "What if i married her for her personality, but now she looks better outside than in?",
            "title_similarity": "0.640583",
            "sentiment_compound": 0.5927
        },
        {
            "id": "huvxw2t",
            "score": 2,
            "text": "I would like to remind all the superficial dudes out there that a raisin was once a grape.",
            "title_similarity": "0.3918156",
            "sentiment_compound": 0.3612
        },
        {
            "id": "huvy3xd",
            "score": 1,
            "text": "Why is everyone here like .. my dad once said..... Am i missing something or is it too hard to confess to mistakes just like me .",
            "title_similarity": "0.5488241",
            "sentiment_compound": -0.0258
        },
        {
            "id": "huvy8vh",
            "score": 1,
            "text": "When I first saw her, I got all type of emotions down there. In a way, she is a bit out of my league.\nShe is very hot/babe/attractive to the point that guys still ask her out—- if only they knew.\n\n6 years in, and two beautiful babies,  couple therapy didn’t help, now I am going to therapy alone because Of my inability to leave two beautiful babies behind. \n\nLiterally, our babies are gorgeous, a lot of people tells us to have more babies.",
            "title_similarity": "0.65865195",
            "sentiment_compound": 0.891
        },
        {
            "id": "huvyako",
            "score": 1,
            "text": "I am a man and yes I do cry sometimes . Can we buy ticket to death ?",
            "title_similarity": "0.40916455",
            "sentiment_compound": -0.6486
        },
        {
            "id": "huvyfmm",
            "score": 1,
            "text": "Fantastic. We are in the process of divorcing now.",
            "title_similarity": "0.28030398",
            "sentiment_compound": 0.5574
        },
        {
            "id": "huvyga3",
            "score": 1,
            "text": "“If you want to be happy for the rest of your life, never make a pretty woman your wife, from my personal point of view, get an ugly girl to marry you.”",
            "title_similarity": "0.57304925",
            "sentiment_compound": -0.233
        },
        {
            "id": "huvykm1",
            "score": 1,
            "text": "The cautionary tale here, is as all people age we change. It cannot be stopped.  When you married you have I fluency over that change to a small extent only. Try and force her and you will have a dead marriage.. grow together in love and trust, and friendship.",
            "title_similarity": "0.60773623",
            "sentiment_compound": 0.7761
        },
        {
            "id": "huvyw55",
            "score": 3,
            "text": "At 18, I married a girl my age who was the absolute hottest girl I've ever seen in person at the time. She was a Slovakian volley ball player who was very fit, had a very thick feminine accent, aggressively hot in the face, and an ass that could give half the people in a mall whiplash as if it just didn't belong on a girl that slender. She didn't have much of a bust, but her ass would turn normal panties into thongs after a few steps. She was very grounded for a girl that was a 9 on the roughest day of the month, but make no mistake, I married her to lock her down and every guy around knew it. Even my battalion commander saw her picture in my locker during inspection, looked at my wedding ring and then at me and said \"you lucky bastard\", like he forgot he was a senior officer for a moment.\n\nYeah, that marriage didn't last three years. After awhile, it became very obvious that we were into each other just for our looks and I felt very lonely when I was around her. It was the most insane ego booster I've ever had and I felt like a king most of the time, but it never replaced the sadness of not having a true partner. To add insult to the situation, I discovered that she was using me to provide a stable household in which she'd be a stay at home mom. She just wanted to be the +1 to a man who would multiply with her and fulfill her projected purpose.\n\nShe's now single with two kids she had with a gangster and she ended up running off with them, leaving him behind. She called me crying and profusely apologizing for divorcing me because I wanted more than her bare minimum. The guy, who I had befriended in sharing concerns about her behaviors, contacted me later on wondering where she was and all I knew was what he told me. I know he wouldn't hurt her, but I never spoke to her between finalizing our divorce and hearing her cry over the phone. I was sitting on my then girlfriend's couch, living my best life and happy as a clam, to hearing her lose her shit and begging me to come back to her.\n\nLuckily I was smart enough at that time to say no, appreciating the lessons learned, and moving on to better and healthier things. I'm now with the prefect partner for me and I couldn't be happier. She's a super sassy pain in my ass who throws fuzzy dog toys at me when we \"fight\" and I'm smiling like an idiot just texting it out. She's the ride or die type who who will give you all her love while trying to not make it too obvious. She'll fake gag when you do something romantic and then she'll curl up into you during a movie with a cute little \"I love you\".",
            "title_similarity": "0.47977552",
            "sentiment_compound": 0.9248
        },
        {
            "id": "huvz4uv",
            "score": 3,
            "text": "Found out sex is painful for her, so after she hooked me in there’s been no more since.\n\n10 years married…. Literally just looking at her.",
            "title_similarity": "0.5800024",
            "sentiment_compound": -0.6249
        },
        {
            "id": "huvzetz",
            "score": 1,
            "text": "Your on the wrong social",
            "title_similarity": "0.14048189",
            "sentiment_compound": -0.4767
        },
        {
            "id": "huvzvwg",
            "score": 1,
            "text": "I'm still single but thanks for the advice though.",
            "title_similarity": "0.26240313",
            "sentiment_compound": 0.5927
        },
        {
            "id": "huw0bbj",
            "score": 3,
            "text": "As a divorce lawyer i think this is best way to pick your wife……",
            "title_similarity": "0.62419134",
            "sentiment_compound": 0.6369
        },
        {
            "id": "huw0t46",
            "score": 1,
            "text": "So it seems the only thing I've learned on here is beautiful women really are the craziest.",
            "title_similarity": "0.47123665",
            "sentiment_compound": 0.5325
        },
        {
            "id": "huw0xnj",
            "score": 1,
            "text": "My dad did this with both my mom and my current step mom. My mom is narcissistic, has severe anxiety and obsessive tendencies. She cheated on my dad and my dad still tried fixing it but she wasn’t willing to cooperate. My step mom was 24 and my dad was 42. She is extremely manipulative and would explode on me almost every day growing up. I would alternate running away from my dad’s when I got tired of my mom and back to my mom’s when I was tired of my step mom. My dad is a good guy, but by the time I turned 18 I couldn’t help but feel a little mad at him for making these two women apart of my life, and him never standing up against my step mom, even supporting her actions even when he later admitted to me he knew she was in the wrong 95% of the time",
            "title_similarity": "0.55421716",
            "sentiment_compound": -0.7879
        },
        {
            "id": "huw1c71",
            "score": 1,
            "text": "I remember the ancient days of dating, and dated a few women that were WAY out of my league (on paper), but after getting to know them they became less attractive to me. \n\nTo be fair, I did the same thing with my wife, but that worked out.",
            "title_similarity": "0.67513174",
            "sentiment_compound": 0.7477
        },
        {
            "id": "huw1iio",
            "score": 1,
            "text": "I'm only 30 and I would rather live the rest of my life asexual or with a woman I find unattractive but loves me and treats me with respect. \n\nMy wife has at this point threatened me so many times I can't counts. She's physically violent, does not allow me to sleep more than 4 hours because she sleep at 11 or 12 at night and I work at 4 am I'm not allowed to sleep before her or else she pours water on me. She has cleaned us out by 40 thousand spent on credit and debit card and last year cheated on me and now pregnant with someone else's kid. I put up with all of it because I don't have it in me to go through a custody battle or see my kids without both parents together. I got other personal reasons as well.",
            "title_similarity": "0.50473034",
            "sentiment_compound": -0.7095
        },
        {
            "id": "huw1jdd",
            "score": 1,
            "text": "Of ALL the things in the world humans compromise on, it baffles me why some people would settle for only looks or only personality and not find someone who fulfills both aspects. So many relationships I see get doomed from having looks the only thing that drew them together but neither really enjoying each others presence in the day to day life.",
            "title_similarity": "0.5481312",
            "sentiment_compound": -0.726
        },
        {
            "id": "huw1xll",
            "score": 1,
            "text": "Very fun on the dick:)",
            "title_similarity": "0.298739",
            "sentiment_compound": 0.0754
        },
        {
            "id": "huw22t4",
            "score": 1,
            "text": "Way too many people stay with their SOs for all the wrong reasons.",
            "title_similarity": "0.34415722",
            "sentiment_compound": -0.4767
        },
        {
            "id": "huw2fy9",
            "score": 1,
            "text": "It’s going great.  Married 16 years now.  Been friends for 34.",
            "title_similarity": "0.37698787",
            "sentiment_compound": 0.802
        },
        {
            "id": "huw2mav",
            "score": 1,
            "text": "“If you wanna be happy for the rest of your life never make a pretty woman your wife” - Jesus Christ of Nazareth.\n\nSo from my personal point of view get an ugly girl to marry you.",
            "title_similarity": "0.5818051",
            "sentiment_compound": -0.3022
        },
        {
            "id": "huw2q5z",
            "score": 1,
            "text": "We’re divorced now. Hopefully that decisively answers your question.",
            "title_similarity": "0.37861717",
            "sentiment_compound": 0.4019
        },
        {
            "id": "huw2wur",
            "score": 2,
            "text": "When you love someone they become the most beautiful person in the world anyway. So start there.",
            "title_similarity": "0.565258",
            "sentiment_compound": 0.8553
        },
        {
            "id": "huw2y1l",
            "score": 2,
            "text": "To sum up these posts: my mom was the piece of crap because she was mentally ill and my father was a saint for taking care of her despite letting himself and his children go through abuse because he thought she was hot. Somehow I believe the post was trying to make guy’s realize that looks aren’t everything but in the end everyone blames the woman. Abuse is not ok, but objectifying people then dealing with the consequences is how it goes.",
            "title_similarity": "0.67229706",
            "sentiment_compound": -0.9267
        },
        {
            "id": "huw2zqz",
            "score": 1,
            "text": "Looks AND money. Something to fall back on lol",
            "title_similarity": "0.37568942",
            "sentiment_compound": 0.4215
        },
        {
            "id": "huw337v",
            "score": 1,
            "text": "We already divorced SMH 🤦🏾‍♂️ what was I thinking 💭",
            "title_similarity": "0.34155542",
            "sentiment_compound": -0.4648
        },
        {
            "id": "huw34tz",
            "score": 1,
            "text": "Well I married for the money.",
            "title_similarity": "0.5505052",
            "sentiment_compound": 0.2732
        },
        {
            "id": "huw3fmu",
            "score": 1,
            "text": "I wonder how many of said guys got prenups",
            "title_similarity": "0.35322127",
            "sentiment_compound": 0.0
        },
        {
            "id": "huw3og2",
            "score": 1,
            "text": "Not me but my best friend was infatuated and put a ring on it within a year of dating. Skipped the engagement too. She ended up cheating and divorcing almost everything had her name on it( which was about 6 months) and it was just a fcked up, nasty divorce.",
            "title_similarity": "0.58663034",
            "sentiment_compound": 0.6808
        },
        {
            "id": "huw3pf6",
            "score": 2,
            "text": "Woman here.. I dated a homeless drug addict for 4 years solely because he was the most attractive man I’ve ever seen.  \n\nNow I’m an opiate addict, on the verge of losing everything. I have so much emotional trauma from that relationship. Our break up is very fresh. I can’t put into words yet what I was thinking or why I took him in solely because he was someone I was attracted to since I was in middle school. \n\nIt’s been a week. He keeps texting me berating me on breaking up with him. “I brought you back from the dead after you overdosed, why the fuck won’t you just text me back” \n\nThis is so hard.",
            "title_similarity": "0.56011385",
            "sentiment_compound": -0.7064
        },
        {
            "id": "huw3t0q",
            "score": 1,
            "text": "My ex-fiancé may have been in this camp. He chased me when I was in my early 20’s. Slender, big breasts, long red hair, and he constantly told me how sexy/hot I was. \n\n\nFailed to mention he was already married until he proudly showed me the divorce petition and said his wife had “given up” and he wasn’t into her anymore. I was young and dumb and enchanted by the idea I was somehow “winning” this interesting older guy. I had a tough childhood with a narcissistic family, I didn’t love myself, and the attention was intoxicating. \n\n\nFast forward 7 years. Our relationship hadn’t been good in years, we weren’t intimate at all for the last 12-18 months - I joked to a friend shortly before the end that we made great roommates. But my career was progressing nicely, the tables had turned and I was more in-desire professionally than he at this point. I was gaining confidence for the first time in my life. \n\n\nBut he was 12.5 years older and in his 40’s, I think he thought the relationship was an expression of his ‘manliness’. There NO way he could have thought it was ideal, just didn’t want to start over. He seemed to relish showing me off to coworkers and friends, always talking about my professional life or appearance, nothing deeper than surface level. \n\n\nWhen I met his boss for work purposes, he was sure to coach me on how to act to best reflect on him so he could (somehow?) leverage my success and our connection to get a raise. I .. still don’t understand that - we were in the same industry, but separate specialties. \n\n\nWhen I embarrassed him by overindulging at a bar-hop with people that happened to be MY coworkers, he kicked me out of an Uber, near blackout drunk in a seedy downtown area of a strange city, with no jacket or phone. I damn near laid down in a door alcove to sleep, but managed to realize I had my wallet and stumbled around until I found a main road and a traditional cab to take me to our hotel. When I finally showed up, he just grunted at me. In the morning, I apologized for getting drunk and he made me promise to never put him in that position again. Because he couldn’t imagine the fallout if his boss found out how embarrassing I am. He also said he was disappointed because he’d bought me all those drinks and didn’t get sex out of it. \n\n\nAnyway, I was the one to back out when I realized that I wasn’t getting cold feet, I just legitimately started to panic at the idea of spending the rest of my life as a token talking point to bolster his own sense of accomplishment. \n\n\nSo I left, he went crazy and stalked me, started dating and living with another woman within a year (it took him 5 to move in with me) while still emailing me weekly about how he was going to ruin my life. Told everyone I cheated on him (untrue) to give a “reason” because he refused to meet to talk about the relationship after I moved out, always citing he wasn’t in a “good place to talk”. I didn’t see the red flags until I left; beyond being an object, he had encouraged toxic codependency, isolated me from friends and family, hidden $75K of financial trouble, and in 7 years, barely finalized his divorce 2 months before we were to be married. \n\n\nThen he mixed heart meds and booze and died. He’d been doing it for years, convinced the warning on the bottle couldn’t ever mean it was dangerous for HIM. \n\n\nI felt guilty only for being relieved. It took therapy to realize that’s okay, too. Had I gone through with the wedding, I would have close to $100K in debt and that whole situation to deal with myself. I’m legitimately sorry his new gf had to go through that, but I’m not sorry it wasn’t me. \n\n\nIt’s been a few years. Now I’m with a wonderful man that would love me just as much if I was dumb as a stump and wore nothing but canvas sacks. \n\n\nThis may only be tangentially related to the question asked, but I know plenty of women and men that have been victims of abuse without even knowing. So if my story helps anyone realize they’re in a bad situation, this is your sign to get out while you can. Don’t get married because you think you should, or it’s the “right time”, or you think you’ll never do any better. \n\n\nIt’s okay to be selfish sometimes, and you deserve someone that lifts you up every day. You are loved, and you deserve love. Just make sure you love yourself first.",
            "title_similarity": "0.70634943",
            "sentiment_compound": 0.8267
        },
        {
            "id": "huw3zwd",
            "score": 2,
            "text": "Met my wife working at a grocery store. I’m not a clumsy guy but there were multiple occasions where I made a complete idiot of myself knocking things over because I felt nervous around her. That was 15 years ago and the best is yet to come!",
            "title_similarity": "0.47245145",
            "sentiment_compound": -0.1511
        },
        {
            "id": "huw4pq4",
            "score": 1,
            "text": "lol",
            "title_similarity": "0.0017224792",
            "sentiment_compound": 0.4215
        },
        {
            "id": "huw50fg",
            "score": 2,
            "text": "I didn’t. I got out of it before marriage and I’m glad I did:\n\nSo, I dated a woman for a few years who, to me, was the most attractive person ever. Definitely the most attractive person I had been with. After a year, or so, she started asking about marriage and the future. But I felt uncomfortable about it because she wasn’t really trustworthy. She couldn’t do conflict resolution at all. And I noticed, after awhile, that I didn’t feel love from her. Like, it wasn’t being reciprocated. I suspected that her desire for marriage was more about status and whatnot. \nNot soon after that realization, I ended the relationship. \n\nAbout a year and half later, I met a woman who worked with me. She wasn’t my type initially. She is beautiful, but just wasn’t quite what I went for in the past. But she had a great sense of humor and she was very kind. We started dating. Now we’re going on 6 years of marriage and we have two boys. \n\nIts a very great marriage. Im happy, content and I feel safe. Obviously all relationships have difficult times and we’ve had those. But overall, I made the right choice.\n\nMany years after I broke up with the previous woman, she text me a few times complaining about her husband, etc. I feel like I dodged a bullet.",
            "title_similarity": "0.6430003",
            "sentiment_compound": 0.994
        },
        {
            "id": "huw58c2",
            "score": 1,
            "text": "I think I’ve driven my husband nuts…\n\nIt’s all about making it up in the bedroom",
            "title_similarity": "0.5503968",
            "sentiment_compound": 0.0
        },
        {
            "id": "huw58wm",
            "score": 1,
            "text": "“If you wanna be happy for the rest of your life, never make a pretty woman your wife”\n“From my personal point of view, get an ugly girl to marry you”\n\n- The Coasters\n\nWe must listen to the wisdom of our ancient forefathers.  \n\nhttps://youtu.be/d-xvd6We49A",
            "title_similarity": "0.63852596",
            "sentiment_compound": 0.2896
        },
        {
            "id": "huw5r1t",
            "score": 2,
            "text": "Ginny’s weight never bothered me, I always thought she was beautiful. Rubenesque.",
            "title_similarity": "0.45083904",
            "sentiment_compound": 0.7061
        },
        {
            "id": "huw66oi",
            "score": 1,
            "text": "Which one?",
            "title_similarity": "0.0276075",
            "sentiment_compound": 0.0
        },
        {
            "id": "huw69ud",
            "score": 2,
            "text": "What about men who married wives because they love their personality despite their so-so looks?",
            "title_similarity": "0.8702474",
            "sentiment_compound": 0.6369
        },
        {
            "id": "huw6jhe",
            "score": 2,
            "text": "Marriage is a joke",
            "title_similarity": "0.42492086",
            "sentiment_compound": 0.296
        },
        {
            "id": "huw6pg7",
            "score": 3,
            "text": "Both my narc parents married each other for their looks. \nThen they spent the next 18 years cheating, abusing and torturing each other and their kids until their divorce.\n\nLast I heard my dad is remarried and might still be juggling 4 girlfriends (he's in his late 70s at this point)\nand my mom is being worshipped and adored by some rich dude she refuses to marry for some shit reason, but lives with after dumping her last 3 boyfriends for developing anxiety and ptsd from dealing with her. \n\nI've been no contact since I was old enough to move out for a reason. \n\nDon't marry for just looks.",
            "title_similarity": "0.6307279",
            "sentiment_compound": -0.7935
        },
        {
            "id": "huw7u1c",
            "score": 2,
            "text": "I married a beautiful and smart woman. Over the years her beauty has matured but she is still extremely smart.",
            "title_similarity": "0.46652496",
            "sentiment_compound": 0.8654
        },
        {
            "id": "huw7yjq",
            "score": 2,
            "text": "If you marry just for looks youre fucked. You marry for look AND compatibility. You only fuck around for looks till you find someone youre compatibile with.",
            "title_similarity": "0.7369368",
            "sentiment_compound": -0.836
        },
        {
            "id": "huw8rg4",
            "score": 1,
            "text": "Pretty good",
            "title_similarity": "0.08728168",
            "sentiment_compound": 0.7269
        },
        {
            "id": "huw8wtl",
            "score": 3,
            "text": "My gf isn't the prettiest girl in the world. But she is genuinely the nicest partner and most 50 50 on things I have ever met. I think im going to marry her",
            "title_similarity": "0.5709788",
            "sentiment_compound": 0.5108
        },
        {
            "id": "huwa2dy",
            "score": 3,
            "text": "Reading between the lines, this question is kinda’ misogynistic in the fact that it insinuates people that are physically attractive have nothing else going for them.",
            "title_similarity": "0.5458103",
            "sentiment_compound": 0.4404
        },
        {
            "id": "huwabv8",
            "score": 1,
            "text": "As a my psychology teacher once said: Never marry a beautiful person because beauty goes away with time, when you will be older things might not work out well.\n\nWhile I agree her statement was true I don't know if she actually thought about what she said and aplied the statement with her boyfriend, because she married a tall quite looking guy. My teacher wasn't ugly to be honest, her eyes were beautiful",
            "title_similarity": "0.6904315",
            "sentiment_compound": 0.933
        },
        {
            "id": "huwac09",
            "score": 1,
            "text": "Kill…me…please…",
            "title_similarity": "0.26937807",
            "sentiment_compound": 0.0
        },
        {
            "id": "huwb35v",
            "score": 1,
            "text": "On the other side, I married my ex because I was always told beauty fades. 9 years later, fooling for divorce. I wasn't particularly attracted to her, but great personality (until I deployed and she tried out all the dicks).\n\nNext relationship, definitely planning more emphasis on looks.",
            "title_similarity": "0.7158829",
            "sentiment_compound": 0.8743
        },
        {
            "id": "huwbg1t",
            "score": 2,
            "text": "I ended up with the best human being I ever met.",
            "title_similarity": "0.3142558",
            "sentiment_compound": 0.6369
        },
        {
            "id": "huwbmw3",
            "score": 2,
            "text": "It’s going well, starting to get to know her",
            "title_similarity": "0.31931007",
            "sentiment_compound": 0.2732
        },
        {
            "id": "huwbrpw",
            "score": 2,
            "text": "Divorced",
            "title_similarity": "0.14755857",
            "sentiment_compound": 0.0
        },
        {
            "id": "huwc5wq",
            "score": 1,
            "text": "Much more important to marry someone who’s good in bed than looks great. I’d rather be with a 7 who’s a 10 in bed than a 10 who’s a 7 in bed",
            "title_similarity": "0.47899765",
            "sentiment_compound": 0.8439
        },
        {
            "id": "huwc9gb",
            "score": 3,
            "text": "Taught me a lesson.  My first wife was very pretty.  But mentally a mess.  Undealt 2irh sexually abuse by her father fucked her up good.  Mentally and verbally abusive.  Jealous, may jealous.  Which really suck because she was a cheater.  General gaslighting.\n\nMy 2nd wife would be called plain.  But she is the most wonderful woman.  A great and supportive partner who I want to spend time with.\n\nMarry for the person not for what the person looks like.",
            "title_similarity": "0.7065779",
            "sentiment_compound": -0.9535
        },
        {
            "id": "huwcix2",
            "score": 2,
            "text": "I marry for laughs",
            "title_similarity": "0.49559462",
            "sentiment_compound": 0.4939
        },
        {
            "id": "huwcx3v",
            "score": 2,
            "text": "This is kind of an unreliable question, as if half of the guys are actually married to a conventionally attractive spouse. Fat chance.",
            "title_similarity": "0.68406487",
            "sentiment_compound": 0.5994
        },
        {
            "id": "huwd0q2",
            "score": 9,
            "text": "My father met my mother when she was 15 and he was 19. She was very, very beautiful. They were together for 72 years. She passed away Wednesday morning. They were romantic to the last...😊 ❤️",
            "title_similarity": "0.4942385",
            "sentiment_compound": 0.9212
        },
        {
            "id": "huwd8gz",
            "score": 3,
            "text": "Hey I know you asked men, but I figured out a couple years in that my ex married me for this reason. Let me tell you what that was like for me: \n\n1. invalidating of my actual full and unique personhood.\n\n2. Oppressive, as I was being held to a standard I was neither aware of, nor interested in upholding.",
            "title_similarity": "0.7273854",
            "sentiment_compound": -0.4917
        },
        {
            "id": "huwdm9e",
            "score": 3,
            "text": "This question is as depressing as asking “Men who married their wives for the blow jobs and crazy sex, how is it going?",
            "title_similarity": "0.7924764",
            "sentiment_compound": -0.6124
        },
        {
            "id": "huwdux5",
            "score": 1,
            "text": "Divorced. Twice.",
            "title_similarity": "0.21825086",
            "sentiment_compound": 0.0
        },
        {
            "id": "huwdymf",
            "score": 1,
            "text": "My ex husband married me for my looks. I'm not model hot or anything but he wanted a skinny white girl (he's Asian). It was terrible for me and we divorced three years later. He immediately tried to change me when we married. He complained about me all the time. He even complained when I danced in the living room. Apparently it made him sad because he wasn't a good dancer. \n\nHe was jealous, possessive, and complained to our marriage counselor that I made comments on the internet. Not any particular comments, but merely communicating with strangers was a red flag to him. He didn't defend me when his friends were rude to me, he didn't support my goals, he dragged me away from conversations at parties if I was taking to a man, though he had no reaction when a close friend of his hit on me. He simply didn't like anything about me and I was only there to show off. \n\nI learned two things: wait much longer to make a commitment to a person (so as to avoid superficial jerks like my ex) and don't ever date anyone who has no relationship with their family for no reason other than \"can't be bothered.\"",
            "title_similarity": "0.6250365",
            "sentiment_compound": -0.9834
        },
        {
            "id": "huweqai",
            "score": 1,
            "text": "Not great... shes can be aweful to be around very selfish and stubborn... its all about her all the time...she lives in a fantasy world...",
            "title_similarity": "0.37563497",
            "sentiment_compound": -0.8642
        },
        {
            "id": "huwesno",
            "score": 1,
            "text": "Look, I have two kids and had them purely because I wanted to get laid.  Life happens whether you want it to, or not.I still want my wife to sit on my face, so it’s working out great.",
            "title_similarity": "0.6804657",
            "sentiment_compound": 0.6908
        },
        {
            "id": "huwf224",
            "score": 1,
            "text": "\"I've dated a lot of pretty girls, but I've met very few beautiful women\" is probably one of the best things someone has said to me. After he told me that, I realized how shallow my relationships were that I sought based on shallow qualifiers. I think the worst part about strings of very attractive women is being in relationships for an extended period of time that don't help you learn much about what it takes to be in a sustainable, respect based, healthy relationship.",
            "title_similarity": "0.67983544",
            "sentiment_compound": 0.9591
        },
        {
            "id": "huwf58p",
            "score": 1,
            "text": "You do not look at your future spouse as an indication, you look at her mom. That's more likely what's shes going to look like.",
            "title_similarity": "0.43735164",
            "sentiment_compound": 0.3612
        },
        {
            "id": "huwf65z",
            "score": 2,
            "text": "Rough but great family pictures",
            "title_similarity": "0.4057294",
            "sentiment_compound": 0.7684
        },
        {
            "id": "huwf698",
            "score": 1,
            "text": "Anecdotal evidence can only take you so far OP. Allow me to share some scientific data to aid your research: https://youtu.be/pInk1rV2VEg",
            "title_similarity": "0.40706715",
            "sentiment_compound": 0.5209
        },
        {
            "id": "huwfgyu",
            "score": 1,
            "text": "rofl :)",
            "title_similarity": "0.088305324",
            "sentiment_compound": 0.7717
        },
        {
            "id": "huwg55f",
            "score": 1,
            "text": "FUUUUUUUUCK",
            "title_similarity": "0.113307714",
            "sentiment_compound": 0.0
        },
        {
            "id": "huwgl5i",
            "score": 1,
            "text": "My wife was a total babe when we married. She doesn't look as good as then anymore, so I'm glad I didn't marry her for how fucking hot she looked.",
            "title_similarity": "0.6319231",
            "sentiment_compound": 0.2197
        },
        {
            "id": "huwgn02",
            "score": 1,
            "text": "I'm not married but my gf I had when I was 18 who was very beutifull at that time changed a lot after her 25,not for good, especially her jaw, when we saw each other again was like damn... ,it's like after their 25 they get their woman face and stop looking like a very young girl, for some of them is very favorable but for other it changes completely their apariecie.\nNot trying to sound mean though.",
            "title_similarity": "0.53975964",
            "sentiment_compound": 0.9159
        },
        {
            "id": "huwh0xb",
            "score": 1,
            "text": "Believe it or not, by some miracle this beautiful but bitchy girl i started dating specifically because she was beautiful ended up becoming kind, funny, and sweet. It was an extremely hard time at first (not like i was perfect either) and there were break ups and make ups, but ultimately she's perfect now. And she occasionally still apologizes for being so mean for the first part of our relationship",
            "title_similarity": "0.63508284",
            "sentiment_compound": 0.9785
        },
        {
            "id": "huwh2yz",
            "score": 1,
            "text": "Aren't we all attracted to our significant other? That means personality and looks as well.",
            "title_similarity": "0.6471031",
            "sentiment_compound": 0.1451
        },
        {
            "id": "huwhkx7",
            "score": 1,
            "text": "The contradictory nature of each comment here  took me on JOURNEY",
            "title_similarity": "0.20953695",
            "sentiment_compound": -0.34
        },
        {
            "id": "huwi27p",
            "score": 1,
            "text": "I think those guys replace them for a newer model. I think they are living the life they want.",
            "title_similarity": "0.54136807",
            "sentiment_compound": 0.0772
        },
        {
            "id": "huwie9z",
            "score": 2,
            "text": "Pretty well actually.\n\nI wanted an ugly one so I don't have to worry about her cheating.\n\nGoing great so far",
            "title_similarity": "0.46475977",
            "sentiment_compound": 0.6002
        },
        {
            "id": "huwiyop",
            "score": 1,
            "text": "I almost did this. My ex gf of 4 years was stunningly beautiful, like one of the prettiest humans I’ve ever even seen, let alone been with.  \n\nShe was depressed though, and difficult to be around. I used to tell her she’d complain about the drapes on the yacht (we didn’t have a yacht lol, just an expression) she grew up spoiled and every guy she was with her entire life contributed to it once she was an adult. Myself included. \n\nNo work ethic, entitled, always upset. I just had enough of it after awhile and we broke up. She’s married to a rich guy now. Our mutual friends tell me they argue alot. Whisper arguments. Off in the corner at a party, then they leave all the sudden and don’t say goodbye to anyone. I know what that car ride home is like and I’m so happy I don’t have to take it anymore.\n\nI’m married now too. To a beautiful sweet woman, who smiles at me 1,000 times a day and I couldn’t be any happier with my life. Definitely very happy I didn’t get married just bc of ridiculous hotness lol. \n\nI saw my ex a couple weeks ago on a jogging trail. We talked for a few minutes, she congratulated me on getting married. I asked how things were going with her.. ‘I could be happier’ was the answer.",
            "title_similarity": "0.58517146",
            "sentiment_compound": 0.9846
        },
        {
            "id": "huwj3dk",
            "score": 1,
            "text": "From reading the comments its mostly good news for people with not incredible looks?",
            "title_similarity": "0.37384188",
            "sentiment_compound": 0.4404
        },
        {
            "id": "huwja1t",
            "score": 1,
            "text": "Great 24 years.",
            "title_similarity": "0.09983426",
            "sentiment_compound": 0.6249
        },
        {
            "id": "huwjarp",
            "score": 6,
            "text": "Married my wife on the potential that she will look hot and I will be ahead of the game. Few years into our marriage, she lost a bunch of weight, started going to the gym and got real hot and then she divorced me",
            "title_similarity": "0.6486856",
            "sentiment_compound": -0.3182
        },
        {
            "id": "huwjbtn",
            "score": 2,
            "text": "My relationship started out completely superficial. I asked her out because she was super good looking. We started hanging out a lot and really enjoyed spending  time together. She is honest, funny and a really good person in general. We are engaged and have been together for 6 years. I really feel like a won the lottery.",
            "title_similarity": "0.5668342",
            "sentiment_compound": 0.9817
        },
        {
            "id": "huwjemj",
            "score": 1,
            "text": "I married my wife, because she was the first woman in years, that I didn’t allow sex the first night. 16 years later, love her more, everyday.",
            "title_similarity": "0.52613246",
            "sentiment_compound": 0.7269
        },
        {
            "id": "huwjvow",
            "score": 3,
            "text": "She still looks good to me, after 46 years together...",
            "title_similarity": "0.26166588",
            "sentiment_compound": 0.4404
        },
        {
            "id": "huwjzgs",
            "score": 1,
            "text": "Anyone who did that and it went well will not answer here because a) the post could be found and endanger the relationship b) he will rewrite his own memory and add the reasons why the marriage went well to the reasons why he married.\n\nAlso marriage nowadays usually happens fairly late in relationships. Better ask men who \"became interested in their wives just for their looks\"",
            "title_similarity": "0.74577093",
            "sentiment_compound": 0.8316
        },
        {
            "id": "huwkcs5",
            "score": 1,
            "text": "Relevant to people who had an old school arranged marriage I guess 😂",
            "title_similarity": "0.5854838",
            "sentiment_compound": 0.4404
        },
        {
            "id": "huwl5d5",
            "score": 1,
            "text": "So all in all\n\n\nNot good",
            "title_similarity": "-0.015191985",
            "sentiment_compound": -0.3412
        },
        {
            "id": "huwmewf",
            "score": 1,
            "text": "She is beautiful ... --- ...",
            "title_similarity": "0.22152832",
            "sentiment_compound": 0.5994
        },
        {
            "id": "huwmn0d",
            "score": 1,
            "text": "Pretty don't impress.",
            "title_similarity": "0.18514839",
            "sentiment_compound": 0.2008
        },
        {
            "id": "huwmr7q",
            "score": 1,
            "text": "Women who have horrible thoughts of meh for no reason, why?",
            "title_similarity": "0.40703356",
            "sentiment_compound": -0.7184
        },
        {
            "id": "huwmxj5",
            "score": 1,
            "text": "Think it’s pretty obvious about the posts I’ve seen but…women who care more about their looks than any other aspect of their lives (work, family, etc) never make great life partners. This goes both ways too…it’s not just women. Vain is as vain does. Hopefully before you tie the knot you realize this, but that’s not the case for everyone unfortunately :/ \n\nAlso, yes there are some people out there who can create the balance necessary while staying faithful…I’m just saying more often than not, avoid them like the plague",
            "title_similarity": "0.6018856",
            "sentiment_compound": 0.0608
        },
        {
            "id": "huwmydl",
            "score": 1,
            "text": "[deleted]",
            "title_similarity": "0.042279053"
        },
        {
            "id": "huwn3jh",
            "score": 1,
            "text": "Not married but doing great, now there's two more with 50% of those looks",
            "title_similarity": "0.41429827",
            "sentiment_compound": 0.7684
        },
        {
            "id": "huwn4ay",
            "score": 1,
            "text": "Relatively ugly, short Friend was out of his league, was used for a green card. Hes now mostly broke and just sad to be around with. pussy blinds the meek men.",
            "title_similarity": "0.4189168",
            "sentiment_compound": -0.7184
        },
        {
            "id": "huwn8l8",
            "score": 1,
            "text": "Working on Year 18. We saw a marriage counselor in 2010 who told us we were the most incompatible married people she had ever worked with and advised separation. We didn’t because kids. \n\nAnyway, I was just telling a pal last week, who had asked how things are going, and I shared a recent revelation: If we weren’t married, my wife and I would not be friends. That’s such a heavy, sad fact to accept.\n\nwe’ve settled into roles of productivity. More coworkers now than lovers. When we go on a “date” it’s a lot of long, awkward silence. Same with trips that take hours. \n\nI’ve just accepted it as my reality.",
            "title_similarity": "0.64360094",
            "sentiment_compound": 0.5017
        },
        {
            "id": "huwn9f4",
            "score": 1,
            "text": "It's going terrible",
            "title_similarity": "0.064601645",
            "sentiment_compound": -0.4767
        },
        {
            "id": "huwnc36",
            "score": 1,
            "text": "Albeit looks are awesome. The way I have always thought it, is that looks will be one of the first things to go as you age. If you have nothing or little beyond that, it will always end up either early, badly, or if you stick around, you l, or both of you will miserable. Or not content. \n\nI know a couple of people in the latter, and it is mostly now due to the cliché of \"for the kids.\" In two other cases, it is due to religion, but in all of them, they seem to be just getting by. It's sad. Since I have known a few couples who truthfully enjoy being close to each other and it is palatable. My grandparents were like that. Many people seem to rush into it.",
            "title_similarity": "0.53012943",
            "sentiment_compound": 0.8765
        },
        {
            "id": "huwnf6i",
            "score": 1,
            "text": "She got fat and isn’t a babe anymore. Personality is a gOod though. She is a kind hearted and caring person. I couldn’t ask for a better mother to my children. We don’t have much to talk about besides our kids. Been together a long time, we have an 18 year old now. We still care deeply for one another. Honestly now that I have matured, I could care less what she looks like.",
            "title_similarity": "0.48032686",
            "sentiment_compound": 0.9729
        },
        {
            "id": "huwnoem",
            "score": 1,
            "text": "Been divorced for 5 yrs, I’ve had the kids for the past 3yrs, and none of us have heard from her in over 2 yrs. Just me and my 2 kids (so 3 kids altogether) living our best lives. Overall? I couldn’t be happier!",
            "title_similarity": "0.35096347",
            "sentiment_compound": 0.8356
        },
        {
            "id": "huwnvso",
            "score": 1,
            "text": "Idk you tell me",
            "title_similarity": "0.15562111",
            "sentiment_compound": -0.1027
        },
        {
            "id": "huwo8g4",
            "score": 1,
            "text": "I’m drunk",
            "title_similarity": "0.22352642",
            "sentiment_compound": -0.34
        },
        {
            "id": "huwo8xb",
            "score": 3,
            "text": "On behalf of my husband, it ain't going well! I was a snack 17 years ago, now I look like all I do is snack. I know my fat ass isn't what he signed up for, but lucky for me he loves me anyway.",
            "title_similarity": "0.49104857",
            "sentiment_compound": 0.8456
        },
        {
            "id": "huwocfj",
            "score": 3,
            "text": "Okay not related to the post but people on r/AskWomen are sensitive as fuck. Literally any question is offensive or breaks the rules.",
            "title_similarity": "0.41109633",
            "sentiment_compound": -0.8519
        },
        {
            "id": "huwotbs",
            "score": 3,
            "text": "I’ve been with my wife for 19 years. And I didn’t expect it to last. But I didn’t want to leave her. So for the 1st year or 2 I expected her to leave me. During this year or 2 I got a full understanding of exactly how opposite we are. She has a savory pallet I have a sweet pallet. She lefty I’m righty. She drives carefully I drive aggressively. I’m a task master she lives in her comfort zone. And the list goes on. Then I was venting to my good friend (he is 25yrs my senior and still currently married to his first wife) tells me that our opposing temperaments, mentalities, and general upbringing is a real blessing. He explained away my confusion by letting me know that we have the opportunity to create a life where we can stand in the gap for each other’s weaknesses and learn from each other’s strengths. Because we are so different that if we could make it work we could become an unstoppable dynamic. Then as only he and no one else could he challenged me by saying “it’ll only work if your man enough to set your ego aside at times and grow the strongest spine the world has ever seen and learn to really assess what’s really worth picking a fight over with your life partner, The mother of your children, and the queen of your kingdom that you’ll inevitably build”. He was absolutely right. He and his have been a great help in keeping us from being another statistic. Today I’m definitely a “how the heck” kinda guy.  As in “how the heck did he get that” :-).",
            "title_similarity": "0.57651687",
            "sentiment_compound": 0.9899
        },
        {
            "id": "huwpr0e",
            "score": 1,
            "text": "Lol 😂",
            "title_similarity": "0.02307355",
            "sentiment_compound": 0.6908
        },
        {
            "id": "huwqsd3",
            "score": 6,
            "text": "It was fun.. for about 1 year. It was great to show her off because that seemed important in my early 20's. Marriage lasted about 7 years, and the last 5 of those were miserable and took 1 year to finalize divorce. I think that being reminded she was beautiful her whole life and getting special treatment as a result of that messed her up. She was a model when we met and attracted attention from everyone because she was lit up the room with her beauty. Older men would approach us and tell me how lucky I was, how beautiful she was, etc. \n\nUntil.. I realized she was insanely jealous which meant I would interrogated for any suspicious behavior, direction I was looking, or how I greeted any female. I gave her zero reason to feel this way. Simple stuff like if I took \"too long\" at the gym or coming home from work would turn into heated arguments. For example, she once sent me to help her divorced female neighbor friend move some heavy boxes. I obliged and was gone 20 min because I was also asked to also help rearrange some living room furniture. When I returned she was convinced I had messed around and I had dishes and decor thrown at me while I tried to reason with her. I am athletic and can handle myself so I locked myself in the bathroom because I didn't want to lose my temper; I was so confused and lost. Eventually she would calm down and the conversation would result in her making me feel that I did something wrong and it was my fault for the way she felt. So many stories to tell but I was physically and emotionally abused until one day I woke up. So yeah, never judge a book by its cover.\n\nI believe fighting and making up was her way of feeling wanted. Her family was this way but I was too young to see the connection. Her dad was a womanizer. Her brother was the same.\n\nThis was 15 years ago. Last I heard she's been divorced (maybe 2x), has kids from multiple men, and is still a single mom.",
            "title_similarity": "0.6266038",
            "sentiment_compound": 0.6747
        },
        {
            "id": "huwr27y",
            "score": 1,
            "text": "She was super hot, also turned out to be a super whore too.\n\nSo not the best.",
            "title_similarity": "0.43973577",
            "sentiment_compound": -0.034
        },
        {
            "id": "huwrnoi",
            "score": 1,
            "text": "Lol when a  beautiful woman gets married - I know Divorce Lawyers are rubbing their hands together like Birdman.\n\n\n 🙏🏾💵💵💵",
            "title_similarity": "0.62317085",
            "sentiment_compound": 0.8481
        },
        {
            "id": "huwry7y",
            "score": 2,
            "text": "Ask Tom Brady",
            "title_similarity": "0.14550218",
            "sentiment_compound": 0.0
        },
        {
            "id": "huwtupm",
            "score": 1,
            "text": "As a begrudgingly single woman reading these replies I'm getting an awful lot of whiplash.",
            "title_similarity": "0.41339934",
            "sentiment_compound": -0.4588
        },
        {
            "id": "huwu2e3",
            "score": 1,
            "text": "It’s terrible",
            "title_similarity": "0.033444643",
            "sentiment_compound": -0.4767
        },
        {
            "id": "huwv9sg",
            "score": 7,
            "text": "Didn’t marry but dating a girl for 6 years. We’re both worked at abercombie. She was 5’9 blonde, great body. She was a freak in the bed too. Sex 3-4 times a day. Anal, a2m, facials, deepthroat, dream it do it. Literally used to have to take agreed upon sex breaks to let our special bits rest. Anyway. TOTAL FUCKING NUTCASE! Suicidal, controlling, narcissistic. I met my wife and she was normal. Like a sane logical women. I couldn’t believe it for months. Waste of 6 years.",
            "title_similarity": "0.55614096",
            "sentiment_compound": -0.3268
        },
        {
            "id": "huwvulo",
            "score": 2,
            "text": "I have body dysmorphia and I always wanted to be the pretty girl. After reading most of the comments  I'm glad I'm barely above average lol. At least me and my future husband might have happily ever after with our average looking kids.",
            "title_similarity": "0.6776035",
            "sentiment_compound": 0.9069
        },
        {
            "id": "huwxk6o",
            "score": 3,
            "text": "She's always horny but useless in the kitchen. Fair play, I can fetch my own scran. After a year of marriage I'm happy with my wife and sex with her is awesome.",
            "title_similarity": "0.6001546",
            "sentiment_compound": 0.9331
        },
        {
            "id": "hux0jug",
            "score": 3,
            "text": "I just got to see this. Yeah, they say that looks fade, blah, blah, blah.... And that personality is what matters. I get that, and I agree. But is it wrong to be attracted to someone, initially, based on their looks? And is it wrong to marry someone based on the looks (But be honest. If you're to the point of marrying someone, you've obviously gone passed looks and have gotten to know them, even a little bit.)?",
            "title_similarity": "0.7776633",
            "sentiment_compound": 0.2869
        },
        {
            "id": "hux1po0",
            "score": 1,
            "text": "This must be the saddest post I've ever read on Reddit... I'm sorry for everyone.",
            "title_similarity": "0.3666236",
            "sentiment_compound": -0.6486
        },
        {
            "id": "hux28ip",
            "score": 2,
            "text": "It's going bullshit.",
            "title_similarity": "0.056725465",
            "sentiment_compound": -0.5859
        },
        {
            "id": "hux40oj",
            "score": 3,
            "text": "My great grandpa said he married his wife because she was the prettiest woman in town. One glance at the graduating class picture later I'm inclined to agree. They were married until they died so I guess they had more than just her looks.",
            "title_similarity": "0.7524376",
            "sentiment_compound": 0.7717
        },
        {
            "id": "hux4jna",
            "score": 7,
            "text": "I did, it lasted about 8 years. \n\nAfter we married she became a humorless, entitled, nasty, hateful, gaslighting, mean spirited nightmare and oppositional to everything. (there were only hints of it before)\n\neg. If I worked on renovating our house she would criticize me for not paying enough attention to the family. If I stopped renovating and spent more time with the family she would criticize me for not making any effort to work on the house. \n\nShe wouldn't let me have any friends or interests or be in any groups or clubs.\n\nWas always snobbish, sarcastic, condescending and rude. She was a bully.\n\nI spent most of my marriage tiptoeing around her ego, avoiding confrontation and keeping the peace for the sake of the kids. After we split, even though she took everything I owned, my money, investments, assets, car, house, etc. it was a great relief to be away from her.\n\nShe was impossible to live with but to make up for it I got a gorgeous, smart and friendly daughter out of the marriage.\n\nI am now happily remarried to a loving, pleasant, intelligent woman.",
            "title_similarity": "0.46515882",
            "sentiment_compound": 0.9855
        },
        {
            "id": "hux4obx",
            "score": 1,
            "text": "Not well. Thanks for asking tho.",
            "title_similarity": "0.19771108",
            "sentiment_compound": -0.4973
        },
        {
            "id": "hux4qil",
            "score": 2,
            "text": "Great, she’s still Beautiful! …20yrs and counting!",
            "title_similarity": "0.2535363",
            "sentiment_compound": 0.8619
        },
        {
            "id": "hux4rpd",
            "score": 10,
            "text": "My dad’s sense of humour can be risky at times to say the least. He told me that he made the mistake of marrying for looks the first time (about my mum) and that he didnt make the mistake again. He said this in front of his second wife, who wasn’t amused...",
            "title_similarity": "0.7093172",
            "sentiment_compound": 0.577
        },
        {
            "id": "hux5ez6",
            "score": 1,
            "text": "I had standards of intelligence AND beauty…going on 22years and still love each other. It’s not without work, but it’s worth it to marry your best friend who also happens to be beautiful.",
            "title_similarity": "0.5783119",
            "sentiment_compound": 0.9734
        },
        {
            "id": "hux60ww",
            "score": 2,
            "text": "Thought my ex was super pretty. “Do not stick your dick in crazy” is advice I should have considered more strongly. \n\nTwo fantastic kids out of it and even though I got cheated on, would do it over in a heartbeat if it meant getting these two kids. \n\nWill never ever stick my dick in crazy again, no matter how hot she is - not worth it anymore",
            "title_similarity": "0.57814413",
            "sentiment_compound": 0.7445
        },
        {
            "id": "hux62lp",
            "score": 2,
            "text": "Sex is great thanks for asking",
            "title_similarity": "0.45742422",
            "sentiment_compound": 0.7906
        },
        {
            "id": "hux6vl8",
            "score": 1,
            "text": "Lol honestly all you deserve this. Moron men tbh. Probably all liberal losers too.",
            "title_similarity": "0.46217933",
            "sentiment_compound": -0.3291
        },
        {
            "id": "hux99ad",
            "score": 6,
            "text": "[deleted]",
            "title_similarity": "0.042279053"
        },
        {
            "id": "hux9bju",
            "score": 1,
            "text": "divorced",
            "title_similarity": "0.14755857",
            "sentiment_compound": 0.0
        },
        {
            "id": "huxd3gd",
            "score": 1,
            "text": "Anyone else dying to see a picture of every Top Voted comment?",
            "title_similarity": "0.51622885",
            "sentiment_compound": 0.2023
        },
        {
            "id": "huxdjdk",
            "score": 1,
            "text": "Does anyone really marry someone just for the looks? I mean, looks sure are important and most times are the first thing that get a guy's attention, but to marry someone just because of it is too much.",
            "title_similarity": "0.7456347",
            "sentiment_compound": 0.2617
        },
        {
            "id": "huxh8nc",
            "score": 1,
            "text": "With that wife, the current wife or the others?\n\nYeesh, how do you expect answers to such a vague question?",
            "title_similarity": "0.562906",
            "sentiment_compound": -0.1926
        },
        {
            "id": "huxhu1w",
            "score": 1,
            "text": "My ex girlfriend the only things I really liked about her were the sex and her looks. Glad I got out of that relationship. By a funny turn of events I then married my high school sweetheart she's still attractive of course but that's not the only thing I like about her. Don't marry for looks could have been a nightmare.",
            "title_similarity": "0.7180525",
            "sentiment_compound": 0.8967
        },
        {
            "id": "huxi93o",
            "score": 2,
            "text": "I think marrying someone on that factor alone is setting yourself for failure. I didn’t get married until I was 34. Dated for looks back in the day but waited for the one who had it all. It’s possible but you need to be in the field and take a lot of L’s. I did and found my pot of gold. We have a beautiful daughter and going for a second. My wife is Wonder Woman and I’m so thankful I never settled. You can still go for looks but it takes time.",
            "title_similarity": "0.63696814",
            "sentiment_compound": 0.9064
        },
        {
            "id": "huxink3",
            "score": 1,
            "text": "Better than you lmao",
            "title_similarity": "0.2087594",
            "sentiment_compound": 0.7783
        },
        {
            "id": "huxn724",
            "score": 1,
            "text": "I dated a woman who was a model. She had sexual trauma from men in her past. I was willing to look past all that and be patient with her because, as a person who is attracted to smarts and humor, I saw the smart and goofy person inside and really started to connect with her and open up. However, it didn't work out. It wasn't one person's fault, but it was tough to be intimate with her (not because of her looks).",
            "title_similarity": "0.6796966",
            "sentiment_compound": 0.473
        },
        {
            "id": "huxtwc0",
            "score": 1,
            "text": "I’ve never felt so lonely.",
            "title_similarity": "0.16228034",
            "sentiment_compound": -0.5009
        },
        {
            "id": "huxxffn",
            "score": 1,
            "text": "She still purdy",
            "title_similarity": "0.13714457",
            "sentiment_compound": 0.0
        },
        {
            "id": "huxxv5h",
            "score": 1,
            "text": "I’m starting to believe I’m dodging hella bullets, y’all telling me I gotta lower the bar",
            "title_similarity": "0.47442853",
            "sentiment_compound": -0.3818
        },
        {
            "id": "huxyxvv",
            "score": 1,
            "text": "It is just that cruel simplicity.",
            "title_similarity": "0.15096946",
            "sentiment_compound": -0.5859
        },
        {
            "id": "huxzcv8",
            "score": 1,
            "text": "No. Lol they told me that they would never get a jury to convict against a grieving mother. They said it was pointless to try.",
            "title_similarity": "0.31998882",
            "sentiment_compound": -0.128
        },
        {
            "id": "huy0d5w",
            "score": 1,
            "text": "Dennis Quaid, 66, said of his 27 year old wife, \"There's 30-something years between us, and we just don't even notice it.\" Um, Dennis, yes, I am sure you noticed. And when she strips down naked, and you still \"do not notice\", then, um, either you are lying, or you need to see a doctor.",
            "title_similarity": "0.50127786",
            "sentiment_compound": 0.1531
        },
        {
            "id": "huy0t3s",
            "score": 3,
            "text": "My wife is probably not the prettiest woman I could have married, based solely on superficial ranking.  I'm saying that based on a random sampling of guys rating the hotness factor of women.  I'm totally attracted to my wife, and she's a pretty lady, but the degree to which I find her hot is a result of much I love her company, how well we get along, and her personality.   To me, she is the prettiest woman on the planet.  We're both in our 40s now, and I still think she is the hottest woman for me. There's no one on the planet I'd rather see naked or have sex with.\n\nWhen someone who is a truly good, sincere person is committed to you, that's sexy/attractive. When a beautiful woman is a selfish, shitty person, you typically  find them less and less physically hot as you endure their shitty personality.",
            "title_similarity": "0.7116344",
            "sentiment_compound": 0.952
        },
        {
            "id": "huy3yll",
            "score": 3,
            "text": "Marrying a person for their looks, money, fame, position, etc, rarely ends well. Over 60 different men proposed marriage to me. Not one was for the right reasons (love) so I refused all. Most ended up dead, in jail, bankrupt, robbed by a woman, living with his mother & adult siblings, dying of lung cancer, in an unhappy marriage, etc. I'm glad I made the right choice & hadn't married any of them. I use my knowledge & experience when advising others on choosing the right partner. Be careful, people. And stay safe!",
            "title_similarity": "0.62347984",
            "sentiment_compound": -0.7467
        },
        {
            "id": "huy43co",
            "score": 3,
            "text": "Not a man, woman charmed by looks here. He's tall, athletic, and has blue eyes that I don't remember the last time I looked into. He lives on the couch and hasn't moved in 2022.",
            "title_similarity": "0.36010432",
            "sentiment_compound": 0.4588
        },
        {
            "id": "huy5p2u",
            "score": 1,
            "text": "No cap, facts",
            "title_similarity": "-0.04976111",
            "sentiment_compound": -0.296
        },
        {
            "id": "huy7nyk",
            "score": 1,
            "text": "my mom got with my father figure and eventually started fighting like crazy and he started using meth and she’s still with him even when he got abusive with her and us. they don’t live together anymore but are trying to fix things for my younger siblings i stopped considering him my father after he laid hands on my mom and my siblings he doesn’t deserve that title anymore",
            "title_similarity": "0.5623938",
            "sentiment_compound": -0.6858
        },
        {
            "id": "huz3hhu",
            "score": 1,
            "text": "My husband did that ...he married me because I  was beautiful (young and youthful) now after 3 kids, even a pimple on my face is a big deal for him....its sad to be a trophy wife...but well that's life.",
            "title_similarity": "0.7407149",
            "sentiment_compound": 0.6369
        },
        {
            "id": "huzgkce",
            "score": 1,
            "text": "Schönheit vergeht, hektar besteht",
            "title_similarity": "0.23023322",
            "sentiment_compound": 0.0
        },
        {
            "id": "huzz0gw",
            "score": 2,
            "text": "Looks?  Not exactly.  She was skinny and nerdy. Those were my only requirements. \n\n17 years later she’s still skinny and nerdy.  People scoff when she tells them she is a 40 year old mother of 2.   Most think she’s close to 30.  \n\nI like having in depth talks about Marvel, Star Wars and Star Trek. with her. \n\nAnd sex with someone thin.",
            "title_similarity": "0.5192996",
            "sentiment_compound": 0.0772
        },
        {
            "id": "hv0dei1",
            "score": 2,
            "text": "She still looks pretty good. :)",
            "title_similarity": "0.1592074",
            "sentiment_compound": 0.8442
        },
        {
            "id": "hv0dj8c",
            "score": 1,
            "text": "Pretty incredibly.",
            "title_similarity": "0.03144812",
            "sentiment_compound": 0.4939
        },
        {
            "id": "hv22ftd",
            "score": 1,
            "text": "If you want to be happy for the rest of your life\n\nNever make a pretty woman your wife\n\nSo for my personal point of view\n\nGet an ugly girl to marry you",
            "title_similarity": "0.6013224",
            "sentiment_compound": -0.233
        },
        {
            "id": "hv2ave6",
            "score": 1,
            "text": "My mom was beautiful and absolutely nuts. She was completely dysfunctional. In relationships, she would start screaming rows over literally nothing, impulsive, terrible judgment, manipulative, no boundaries. No one liked her. Occupational, she couldn't reliably hold a job, clean an apartment and barely functioned. She was forever 13 intellevtually and emotionally. She still managed to date a ton, even getting married twice and oddly, she was the one who initiated both divorces. They were willing to put up with more. Men put up with anything if women are beautiful. \n\nDon't marry for beauty unless she is also emotionally healthy.",
            "title_similarity": "0.6144207",
            "sentiment_compound": 0.7045
        },
        {
            "id": "hv5njjo",
            "score": 1,
            "text": "Did not marry for her looks... she is a wonderful person, mother of my 2 children and i love her...\n\nbut I'd be damn lying if I don't say that I DO miss her younger self looks...",
            "title_similarity": "0.62957454",
            "sentiment_compound": -0.7269
        },
        {
            "id": "hvf6gk1",
            "score": 2,
            "text": "My wife has always taken my breath away.  She is the most beautiful woman I have ever known. I can’t say I married her just for her looks, but I find her so attractive it is hard to imagine loving her that much.  \n\nThe funny thing is as the years pass, I know logically she must be losing some of her looks.  But for me, she is more beautiful than ever before.   We were together for every scar, the birth of children…every single change her body has gone through since she was 19.   They all tell a story of strength and character.  \n\nDid I marry her for her looks alone?   I can say I married her because the way she looks to me and honestly she is hotter than ever 41 years later.",
            "title_similarity": "0.68727815",
            "sentiment_compound": 0.9808
        },
        {
            "id": "hxc5344",
            "score": 1,
            "text": "Not well...",
            "title_similarity": "-0.017933559",
            "sentiment_compound": -0.2057
        },
        {
            "id": "hym7ol2",
            "score": 1,
            "text": "I divorced her for her personality",
            "title_similarity": "0.4458357",
            "sentiment_compound": 0.0
        }
    ]
}