{
    "What’s the worst ultimatum you were served while with a partner?\nMy ex told told me if we didn’t/couldn’t  upgrade our living space I had to get rid if my dog of 7 years. \n\nShe is not a dog, she is my baby. We went on a 2 hour walk today. She had bacon, fries and a burger bun as a treat.\n\nMy ex won’t talk to me anymore, my dog and I are cuddling.": [
        {
            "id": "i2jdo1n",
            "score": -2,
            "text": "Stop treating your dog like a kid, weirdo",
            "title_similarity": "0.49180925",
            "sentiment_compound": -0.3612
        },
        {
            "id": "i2ji8uf",
            "score": 4,
            "text": "She dodged a bullet",
            "title_similarity": "0.094442524",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2k2ohj",
            "score": -2,
            "text": "She is not your baby. Humans cannot give birth to dogs.",
            "title_similarity": "0.4213206",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2ja2zr",
            "score": 12,
            "text": "I mean, by the description, you seem to treat your dog like a human, so I think your partner came out on top.",
            "title_similarity": "0.37267795",
            "sentiment_compound": 0.7184
        },
        {
            "id": "i2j3gf4",
            "score": -12,
            "text": "TBH I don't think I'd want to live with someone who fed burgers to their dog. Dogs really don't need \"treats\".",
            "title_similarity": "0.70610034",
            "sentiment_compound": -0.0572
        },
        {
            "id": "i2jqdl7",
            "score": 1,
            "text": "i couldn’t watch porn bc it’s “basically cheating”\nEdit: grammar",
            "title_similarity": "0.5296772",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2j2gj2",
            "score": -12,
            "text": "Feeding your dog fries and a bacon cheeseburger is basically animal abuse",
            "title_similarity": "0.66443443",
            "sentiment_compound": -0.6369
        },
        {
            "id": "i2ijuha",
            "score": 29,
            "text": "You can't feed your dog that kind of shit. Well, already 7 you'll be solving that problem for any partners earlier than you want to.",
            "title_similarity": "0.7388301",
            "sentiment_compound": -0.4201
        },
        {
            "id": "i2jba7z",
            "score": 1,
            "text": "The worst ultimatum I was served was none at all. I never got a choice. Any time a girl dumped me, it was abrupt and out of the blue, after she had considered something privately or had a conversation with a friend or family member about me",
            "title_similarity": "0.6391567",
            "sentiment_compound": -0.5574
        },
        {
            "id": "i2imqj3",
            "score": -42,
            "text": "I kinda agree with your ex gf, you seem way to attached to your dog",
            "title_similarity": "0.40408826",
            "sentiment_compound": 0.2975
        },
        {
            "id": "i2j61ec",
            "score": 0,
            "text": "Short story award of 2022 ✨",
            "title_similarity": "0.2562787",
            "sentiment_compound": 0.7003
        },
        {
            "id": "i2iiwcb",
            "score": 57,
            "text": "Bro don't ever feed your dog fatty foods like that, Jesus Christ the poor thing could've had a heart attack or pancreatitis.",
            "title_similarity": "0.7500653",
            "sentiment_compound": 0.128
        },
        {
            "id": "i2iv0lr",
            "score": 10,
            "text": "Dump the bitch.  Keep the dog.",
            "title_similarity": "0.4624587",
            "sentiment_compound": -0.7506
        },
        {
            "id": "i2k320e",
            "score": 1,
            "text": "I've only been in one relationship, still in it 20 years later. Never got a true ultimatum, but it got close. I shut that down. I told her that in my relationships, we communicate. If the person requesting something feels strongly about it, they will make sure that is understood. If the other person does not respect that, then it's time to separate. That is how her parents fight. Yelling and threatening to leave.\n\nFor me, an ultimatum is emotionally abusive. If the relationship is not working, don't threaten the other person. Be amicable and break it off.",
            "title_similarity": "0.76786995",
            "sentiment_compound": -0.9502
        },
        {
            "id": "i2kioac",
            "score": 3,
            "text": ">My ex told told me if we didn’t/couldn’t upgrade our living space I had to get rid if my dog of 7 years. \n\nUnderstanda...\n\n>She is not a dog, she is my baby. We went on a 2 hour walk today. She had bacon, fries and a burger bun as a treat.\n\n>My ex won’t talk to me anymore, my dog and I are cuddling.\n\nHello, cringe department?",
            "title_similarity": "0.9841005",
            "sentiment_compound": 0.4019
        },
        {
            "id": "i2jacnr",
            "score": 9,
            "text": "If you love your dog you wouldn't give it human food. It's bad because it's processed and it'll fuck up their livers. They're not humans and you're doing more harm than good. My dad's dog had to go to the hospital and stopped being the dog he was because of his poor diet and nearly died. But keep giving it human food because it's obviously a human.",
            "title_similarity": "0.80085504",
            "sentiment_compound": -0.4432
        },
        {
            "id": "i2j8ebg",
            "score": 1,
            "text": "Weed or her.. i been single lol",
            "title_similarity": "0.3426451",
            "sentiment_compound": 0.4215
        },
        {
            "id": "i2ik9y4",
            "score": 5,
            "text": "You made the right decision.",
            "title_similarity": "-0.071087375",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2jgkol",
            "score": -9,
            "text": "Quit doing drugs or I'm leaving. \n\nYa bye.\n\nI always say upfront I'm a drug addict but I work I pay Bill's we won't go without. \n\nThen they're all surprised and for some reason take it personally that I do drugs lol. \n\nBut they'll smoke weed right in front of me. \n\nI like doing drugs. I probably won't ever quit. For what? Shit sounds boring. \n\nI did quit the booze though that shit is poison.\n\nIf I want to smoke crack in my free time leave my ass alone. At least I'm home not running the streets or fucking other women.",
            "title_similarity": "0.69001436",
            "sentiment_compound": -0.9253
        },
        {
            "id": "i2khi58",
            "score": 0,
            "text": "I told my ex I wanted a threesome with her sister we decided to break up now me and her sister have a happy relationship and she’s still married to her wife.",
            "title_similarity": "0.6705917",
            "sentiment_compound": 0.5719
        },
        {
            "id": "i2jbapq",
            "score": 8,
            "text": "It was my ultimatum.\n\nMy ex had been mithering me to make this specific meal for him. So I made it, placed it in front of him. He looked me dead in the eye & said \" I'm not eating that\". My response (ultimatum) was you eat it or wear it. He refused to eat it, so he wore it. Moral of my story is, do not call my bluff as I don't bluff.",
            "title_similarity": "0.7575879",
            "sentiment_compound": -0.7579
        },
        {
            "id": "i2lovn5",
            "score": -2,
            "text": "I hope you enjoy cuddling with your dog vs. human interaction/intimacy.  You sound like a child trying to get sympathy online.  Your dog is not your baby, it is a pet.  Someone that treats their pet like their child is difficult to imagine being with.\n\nWhat conversations led up to this?  How long were the two of you together?  Can you afford to upgrade and you just want to \"win\"?  So many questions.\n\nSounds like she dodged a bullet due to you not being willing to place her in a higher priority vs. your pet.  My guess is this is the actual problem and is came down to an ultimatum.  You chose your pet, once again, and she is gone, as she should be.",
            "title_similarity": "0.7128721",
            "sentiment_compound": 0.9386
        },
        {
            "id": "i2jiuei",
            "score": 1,
            "text": "Get up otherwise I’ll shag you.",
            "title_similarity": "0.3107594",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2jk9yp",
            "score": 1,
            "text": "Take your dick out of her right now or I will destroy your whiskey collection.",
            "title_similarity": "0.42617416",
            "sentiment_compound": -0.7783
        },
        {
            "id": "i2k3uw0",
            "score": -1,
            "text": "Well I don’t have an answer to this I just wanted to throw it out there that healthy relationships do not involve ultimatums. Compromise sure, but not ultimatums.",
            "title_similarity": "0.46156114",
            "sentiment_compound": 0.4678
        },
        {
            "id": "i2kj1n9",
            "score": -1,
            "text": "The reason why he/she broke up with you is that you call your dog your baby.",
            "title_similarity": "0.72436947",
            "sentiment_compound": -0.4215
        },
        {
            "id": "i2jz3d3",
            "score": 6,
            "text": "You’re gonna make your dog really sick with pancreatitis if you feed her that stuff. \n\nIf she’s your baby, please don’t feed her junk. It will hurt her in the long run.",
            "title_similarity": "0.70731115",
            "sentiment_compound": -0.6901
        },
        {
            "id": "i2idu8f",
            "score": 66,
            "text": "It's called a shit test. They don't stop. It's important to \"pass\" them by holding frame. Also, that includes punishing bad behavior with removing your attention and validation until she acknowledges the situation and takes accountability.",
            "title_similarity": "0.37991175",
            "sentiment_compound": -0.8861
        },
        {
            "id": "i2klfqp",
            "score": 3,
            "text": "Dude looking at your post history I’m not surprised your ex isn’t talking to you. You had way bigger problems than your dog…",
            "title_similarity": "0.7101245",
            "sentiment_compound": -0.5213
        },
        {
            "id": "i2jaj4f",
            "score": -8,
            "text": "'choose between me and the cigarettes'\n\ni chose the cigarettes \n\nshe hung on to me for another year and half anyway",
            "title_similarity": "0.5548887",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2k7w4k",
            "score": -7,
            "text": "Notice 90% of these are ultimatums by women?",
            "title_similarity": "0.33280838",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2j71xf",
            "score": -1,
            "text": "Living with a bitch … and a dog",
            "title_similarity": "0.44246012",
            "sentiment_compound": -0.5859
        },
        {
            "id": "i2jwex4",
            "score": -3,
            "text": "> She had bacon, fries and a burger bun as a treat.\n\nSounds unhealthy ... for both humans and dogs.",
            "title_similarity": "0.65038717",
            "sentiment_compound": -0.1779
        },
        {
            "id": "i2k73m4",
            "score": 3,
            "text": "It may not be true, but I think many women have learned toxic relationship ideals from their parents. They've heard rose-tinted stories from them about \"how your mother got her way\" and think it's ok to try that shit now. That it's just \"what you do\" and that if you, as a man, don't put up with it, somehow *you're wrong*.\n\nNever give up. Never surrender.",
            "title_similarity": "0.669437",
            "sentiment_compound": -0.7728
        },
        {
            "id": "i2jhf2k",
            "score": 6,
            "text": "I guess the time she told me if I didn't help pay for her speeding ticket we wouldn't get intimate (this was months into dating, in hindsight she was using sex as a weapon with excuses like \"I wanna build our connection\"), I obliged and it was the worst sex ever. I honestly felt used and stopped talking to her soon after, she had an OnlyFans and through her ads I found out very soon after we ended that she found 2 dudes to bang unprotected and make content with to sell. Pretty sure she didn't give them any ultimatums, that was when I learnt that women make up rules or goals for men they don't really want, but make exceptions and go out of their way for the dudes they want.\nI'm happily in a healthy relationship with a lovely woman who goes out of her way for me and I do for her. It's beautiful",
            "title_similarity": "0.76024944",
            "sentiment_compound": 0.9678
        },
        {
            "id": "i2k75v4",
            "score": 3,
            "text": "Her: \"We've gone out a few times now. You need to either step up and be a boyfriend, or quit wasting my time like some college kid.\"\n\nMe: \"I'm going to miss your candor.\"\n\nShe was a kick-ass chick, just not for me.",
            "title_similarity": "0.65678614",
            "sentiment_compound": -0.2023
        },
        {
            "id": "i2lmb2x",
            "score": -4,
            "text": "Imagine having to share a tiny place with a smelly fucking dog. Dude was trying to give you a chance and you chose dog smell. To each their own",
            "title_similarity": "0.5787285",
            "sentiment_compound": 0.4939
        },
        {
            "id": "i2k6hyl",
            "score": 0,
            "text": "If you don't marry me then your child is going to call another man daddy.",
            "title_similarity": "0.49093932",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2k7gd9",
            "score": 0,
            "text": "I had to propose by our 2 year mark. She felt that if we didn't know by 2 years then we shouldn't be wasting each other's time.",
            "title_similarity": "0.63560814",
            "sentiment_compound": 0.3089
        },
        {
            "id": "i2k7tkw",
            "score": 0,
            "text": "Don’t feed your dog stuff like that they can’t process the fat and it eventually kills them. Either their heart just like people get heart disease or it damages their pancreas",
            "title_similarity": "0.7077719",
            "sentiment_compound": 0.7906
        },
        {
            "id": "i2kegoi",
            "score": 0,
            "text": "My gf said if I didn’t give her 5 Flippo’s, she’d break up with me. I gave her the Flippo’s. We were 8.",
            "title_similarity": "0.62565136",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2kuhpk",
            "score": 0,
            "text": "my parents told me if i wanted top surgery, I had to become completely financially independent and pay for my own rent and college tuition. \n\nThe past six months have been so hard, but i’m one month post op and feel better about myself then I ever could have imagined",
            "title_similarity": "0.69544905",
            "sentiment_compound": 0.5599
        },
        {
            "id": "i2kuydd",
            "score": 0,
            "text": "[deleted]",
            "title_similarity": "0.08695337"
        },
        {
            "id": "i2l9oig",
            "score": 0,
            "text": "Good riddance",
            "title_similarity": "-0.048591316",
            "sentiment_compound": 0.4404
        },
        {
            "id": "i2lci70",
            "score": 0,
            "text": "Ummm, are you sure your wife isn't jealous of your dog? Seems like you spend more time with the dog",
            "title_similarity": "0.6039655",
            "sentiment_compound": 0.7415
        },
        {
            "id": "i2li04j",
            "score": 0,
            "text": "She's not your baby, she's your dog. You nutcase.",
            "title_similarity": "0.54999256",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2lle67",
            "score": 0,
            "text": "Shouldn't be giving your dog bacon, salt is bad for dogs",
            "title_similarity": "0.6510723",
            "sentiment_compound": -0.6742
        },
        {
            "id": "i2lowct",
            "score": 0,
            "text": "My ex gf told me that I had to stop bowling night or she would leave me. Well I couldn’t stop because I was really seeing another women. Eventually we ended our relationship and went our separate ways. I don’t see her often, but her mom and me often get together to bowl.",
            "title_similarity": "0.7395605",
            "sentiment_compound": -0.1901
        },
        {
            "id": "i2p3gko",
            "score": 0,
            "text": "“If We ever break up ill kill both of us”\n\nGot out more than five years ago, and I’m still working on the abuse from back then.",
            "title_similarity": "0.63031",
            "sentiment_compound": -0.9136
        },
        {
            "id": "i2j32w2",
            "score": 19,
            "text": "\"I have to walk with you to your house to make sure you're safe.\" I had only known this guy for 2 weeks and we definitely weren't close enough in the relationship to warrant him knowing where my house is. Worst part: he was over 18 in high school and I was a freshman (barely over 14).",
            "title_similarity": "0.77262765",
            "sentiment_compound": 0.4215
        },
        {
            "id": "i2ikzw6",
            "score": 5,
            "text": "Even after buying her bacon, fries and a burger bun, she still wanted the dog out?",
            "title_similarity": "0.7438803",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2jihok",
            "score": 5,
            "text": ">My ex won’t talk to me anymore, my dog and I are cuddling.\n\nWay to fucking go!",
            "title_similarity": "0.780305",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2iyfr9",
            "score": 16,
            "text": "Yeah that was a trash human. Im glad the baby ate well. Love and pets behind the ear from me!",
            "title_similarity": "0.44937104",
            "sentiment_compound": 0.8955
        },
        {
            "id": "i2j620k",
            "score": 1,
            "text": "he must respect and understand you at the first place because he loves you, now if thats the thing talk to him, share your opinions with him and share how do you feel about ridding your baby, communicate and understanding each other is very important.",
            "title_similarity": "0.3321101",
            "sentiment_compound": 0.9061
        },
        {
            "id": "i2jbf8d",
            "score": 1,
            "text": "We agreed with my wife that after 25 years together we are free to decide if we still want to be together or not... Still serving my time and joking about it. Joking...",
            "title_similarity": "0.5466155",
            "sentiment_compound": 0.8176
        },
        {
            "id": "i2jtxir",
            "score": 1,
            "text": "i cant date a stoner anymore, my response was..sorry about your luck",
            "title_similarity": "0.61462814",
            "sentiment_compound": 0.4588
        },
        {
            "id": "i2juyh0",
            "score": 1,
            "text": "Your dog is actually a human child?",
            "title_similarity": "0.19971652",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2kfgnl",
            "score": 1,
            "text": "Stop feeding your dog human food. It’s not a human. You’re going to make it die early.",
            "title_similarity": "0.6830957",
            "sentiment_compound": -0.7269
        },
        {
            "id": "i2ktuo8",
            "score": 1,
            "text": "If you don't stop telling me what you want from life and a decent relationship (dignity, no silent treatment, solidarity, companionship, let's not even talk about love and sex) , I'll end it.\n\n&#x200B;\n\nSo I ended it.",
            "title_similarity": "0.62132037",
            "sentiment_compound": 0.8437
        },
        {
            "id": "i2ktx7p",
            "score": 1,
            "text": "Speaking as a woman, we can be just as abusive as men, only the abuse we hand out tends to be more along the lines of emotional manipulation. Never give in. But then again, why were you living with a woman who doesn't like dogs? Silly boy.",
            "title_similarity": "0.61663574",
            "sentiment_compound": -0.7332
        },
        {
            "id": "i2ktyb8",
            "score": 1,
            "text": "It’s either your dogs go or I go. \n\nHad the doggies for 12 years, GF for 6 months. \n\nGF lost that fight easily",
            "title_similarity": "0.78318274",
            "sentiment_compound": -0.3612
        },
        {
            "id": "i2kui86",
            "score": 1,
            "text": "My cousin told me she would leave me if we didn’t move to Alabama.",
            "title_similarity": "0.5518187",
            "sentiment_compound": -0.0516
        },
        {
            "id": "i2kuol7",
            "score": 1,
            "text": "\nI was told if I don’t move to Florida, 1000 mi away, she would jump in the Gulf of Mexico and try to swim to Cuba. \n\nI did not move to Florida. I hope Cuba worked out for her.",
            "title_similarity": "0.5641956",
            "sentiment_compound": 0.4404
        },
        {
            "id": "i2kxay1",
            "score": -1,
            "text": "I hate women",
            "title_similarity": "0.34115285",
            "sentiment_compound": -0.5719
        },
        {
            "id": "i2lcd4r",
            "score": -1,
            "text": "She dodged a bullet, anthropomorphizing your pets isn't just a red flag, it's a red billboard.",
            "title_similarity": "0.43120885",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2llzmu",
            "score": 1,
            "text": "Dog always wins, always. Don’t even think, choose dog and walk away happily.",
            "title_similarity": "0.46089965",
            "sentiment_compound": 0.8074
        },
        {
            "id": "i2jadqn",
            "score": 6,
            "text": "I had to rid a girl over her unhealthy relationship with her dog. \n\nWould let it snap at my kids. Blame real children for causing outbursts. \n\nGood luck with your dog.",
            "title_similarity": "0.67920685",
            "sentiment_compound": 0.0258
        },
        {
            "id": "i2kfa3v",
            "score": -7,
            "text": "Yeah let's feed your animal the corpse of another animal, how cute.",
            "title_similarity": "0.34804288",
            "sentiment_compound": 0.128
        },
        {
            "id": "i2ii8jm",
            "score": 21,
            "text": "Upgrade that woman to homeless",
            "title_similarity": "0.3855623",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2ixlqk",
            "score": -2,
            "text": "You can run but you can’t hide. You can turn away but you’ll always hear me. You can die but I’ll never tell you who I am. When I appear before you it’ll mean you have failed.",
            "title_similarity": "0.53437865",
            "sentiment_compound": -0.9161
        },
        {
            "id": "i2jsh6n",
            "score": 2,
            "text": "We have three cats at my house and I tell my girlfriend all the time. If she gets anymore I'm leaving her.",
            "title_similarity": "0.67381054",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2k0w3x",
            "score": 2,
            "text": "Prove you love me or I'm leaving. \n\n&#x200B;\n\nto this day I don't know how to instantly prove to someone I love them.",
            "title_similarity": "0.44823498",
            "sentiment_compound": 0.8555
        },
        {
            "id": "i2k6h5n",
            "score": 2,
            "text": "I don’t remember the worst one because as soon as I’m given an ultimatum in the relationship, its over. Ultimatums are dealbreakers. In a mature relationship, I prefer to work out our differences and come to a compromise. If a compromise isn’t possible, it probably won’t work out depending on the gravity of the situation.",
            "title_similarity": "0.48014963",
            "sentiment_compound": -0.3182
        },
        {
            "id": "i2kfg9b",
            "score": -2,
            "text": ">. She had bacon, fries and a burger bun as a treat.\n\nSounds like you treat her as well as you're boyfriend... like garbage!",
            "title_similarity": "0.65626764",
            "sentiment_compound": 0.8955
        },
        {
            "id": "i2kost3",
            "score": 2,
            "text": "Noticed how most of these are given by women? \n\nWomen are dreamkillers",
            "title_similarity": "0.19587426",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2ksppb",
            "score": 2,
            "text": "\"If you don't get me pregnant, I'm going to divorce you.\"\n\n\nThat was the first time she threatened divorce. Three and a half years later, we have a beautiful daughter, and my wife is still going to divorce me. She brought it up for the second time in our relationship back in December, but this time she's following through.",
            "title_similarity": "0.7328799",
            "sentiment_compound": 0.1154
        },
        {
            "id": "i2kttfb",
            "score": 2,
            "text": "My first relationship after almost eleven years in prison was dysfunctional as all hell. Emotionally, I was incredibly fragile, and the girl I ended up dating took advantage of that to her fullest ability.\n\n**Everything** with her was an ultimatum. Compromise wasn't in her vocabulary. Any time she didn't get her way 100%, she would threaten to leave me over it; I can't tell you how many times she told me, \"If you don't like it, there's the door.\" I'm ashamed at how long I put up with her nonsense.",
            "title_similarity": "0.70609987",
            "sentiment_compound": -0.9361
        },
        {
            "id": "i2ktyc7",
            "score": 2,
            "text": "This has happened multiple times but a woman asking me to give up my passions to spend even more time with her (I’m a very attentive partner already). I gave up my ultimate frisbee club in college, baseball in high school… when one asked me to give up my band I knew it was time to get some self respect and ditch her.",
            "title_similarity": "0.7065208",
            "sentiment_compound": 0.8573
        },
        {
            "id": "i2j6118",
            "score": 50,
            "text": "We went to couples counselling which went about as well as you would expect when my ex was a therapist herself.  Not to mention it was I that wanted the session and her that fought it until she made it her idea.\n\nSession got us nowhere, therapist asked if we wanted to rebook she said \"we'll talk and get back to you.\"  Outside I ask her if she wants another session, she says only if you want to work on the relationship.  I just responded with \"do you want to book another session?\"  She said she is on the last straw with me and if I don't want to work on the relationship she will break up with me.  So I said, \"you want o book another session then?\"  \"only if you want to work on the relationship.\"\n\nA couple more laps of that race track and I just said Fuck it and ended the relationship.",
            "title_similarity": "0.6784328",
            "sentiment_compound": -0.4735
        },
        {
            "id": "i2j05fd",
            "score": 22,
            "text": "Apologize to his mistress that I yelled at when she called me to gloat.  He wasn't going to deposit the money for his kids if I didn't.  \n\nSomehow I managed. Best thing that ever happened to me. Almost want to send them flowers (they are no longer together).",
            "title_similarity": "0.7195104",
            "sentiment_compound": 0.5279
        },
        {
            "id": "i2j4amk",
            "score": 4,
            "text": "This is outrageous!!\n\nShe didn’t get any dessert after that?\n\nI’m calling PETA",
            "title_similarity": "0.585434",
            "sentiment_compound": -0.555
        },
        {
            "id": "i2jukna",
            "score": 3,
            "text": "My ex booked to go backpacking for a year without discussing it with me, my ultimatum was come or wait.\n\nI'd just started a new business so I couldn't, I chose the third option of breaking up with her instead.",
            "title_similarity": "0.76578844",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2kq680",
            "score": 2,
            "text": "If I didn’t get my license and learn to drive we wouldn’t get married. I have a severe phobia of driving and even get nervous just being in a car. Made the whole break up a lot easier honestly. Fk you Eric.",
            "title_similarity": "0.59435445",
            "sentiment_compound": -0.128
        },
        {
            "id": "i2lm6e7",
            "score": -3,
            "text": "Of course you think the dog is more important. It will never say no to you, or push you to improve. The blind dumb loyalty of an animal doesn’t replace true, voluntary love from another human.",
            "title_similarity": "0.5237718",
            "sentiment_compound": 0.8855
        },
        {
            "id": "i2ixndp",
            "score": 13,
            "text": "Lower your sexual drive or they'll get another polyamorous sexual partner, both happened shortly before my third committed relationship ended with being blocked on all social media",
            "title_similarity": "0.6254332",
            "sentiment_compound": -0.296
        },
        {
            "id": "i2ivqnt",
            "score": 24,
            "text": "Me or the PS5",
            "title_similarity": "-0.04962347",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2iqhxc",
            "score": 13,
            "text": "One of those make love to me like you mean it. \nI was stuck on auto pilot at the time. And neglected my wife and new born. \nWe are still together, but I do think about that",
            "title_similarity": "0.624901",
            "sentiment_compound": 0.1655
        },
        {
            "id": "i2j82ww",
            "score": 14,
            "text": "Best decision you could make,Dog does give you demands besides love it and take care of it.",
            "title_similarity": "0.30263537",
            "sentiment_compound": 0.9118
        },
        {
            "id": "i2kwp82",
            "score": -5,
            "text": "Are you overweight? That’s the vibe I’m getting from this post :(",
            "title_similarity": "0.15851277",
            "sentiment_compound": -0.6597
        },
        {
            "id": "i2jaylg",
            "score": 16,
            "text": "She said if I don’t treat her nicely then we are done and she will break into my room and steal all my shit right off the walls. \n\nThe thing is I had held my tongue countless times when she belittled, berated, and manipulated me, after changing my entire life to serve her. If anyone should get an ultimatum about “being nice” it should have been my ultimatum. You live and you learn.",
            "title_similarity": "0.5944593",
            "sentiment_compound": -0.7783
        },
        {
            "id": "i2iy9kx",
            "score": 63,
            "text": "Girl kept telling me to shave my beard or she wouldn't kiss me anymore. Not because It was uncomfortable for her face, but because she would just like me better without. It wasn't so much the fact that she wanted me to shave my beard, it was the fact that she didn't like me for who I was. Keep in mind I had the beard for years when I met her, and didn't change it up until that point. \n\n&#x200B;\n\nDumped her ass faster than a taco bell burrito after a night of drinking cheap beer.",
            "title_similarity": "0.74344265",
            "sentiment_compound": -0.7454
        },
        {
            "id": "i2jcwyd",
            "score": 5,
            "text": "Sort of general ... thus far has happened with two partners:\n\nfar too pushy/controlling, fail to listen/understand, and I just get to the point it's so f\\*ckin' annoying and so *not* worth it, that *nobody* is way the hell better than being with *that* partner ... and I call it quits ... or they call it quits on me not bending to their will and save me the trouble - either way, it's over, and I'm way the hell much better off.",
            "title_similarity": "0.59591424",
            "sentiment_compound": -0.9066
        },
        {
            "id": "i2jpjz1",
            "score": 5,
            "text": "My ex said if I try breakup with him, he will try kill himself.\n\nI said go ahead and he tried. Didn't choose the right method. Now 13 yrs later he is happily married with 2 kids and I have zero tolerance for emotional blackmail.\n\nThrow the man away you can get a better one",
            "title_similarity": "0.8004081",
            "sentiment_compound": 0.5574
        },
        {
            "id": "i2jf3bi",
            "score": 16,
            "text": "If I vaccinate our kids, she'll leave and take the kids with her.",
            "title_similarity": "0.4845001",
            "sentiment_compound": -0.0516
        },
        {
            "id": "i2j9mjr",
            "score": 35,
            "text": "\"Covert to Muslim or lose me.\"\nSo I ditched her, if someone is not respecting my ideas then they won't respect me as a person. Best thing I ever did.",
            "title_similarity": "0.6065511",
            "sentiment_compound": -0.3983
        },
        {
            "id": "i2jboks",
            "score": 6,
            "text": "My ex told me we had to have sex 4x a week or have an open relationship. We were already having sex at least 2x a week (often 3x), and we had been married for 6 years at that point. This was actually a very minor issue compared to all the others that came to light. I filed for divorce about a year later.",
            "title_similarity": "0.74345577",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2jv5qt",
            "score": 6,
            "text": "My ex said you either drop your dreams and risky behaviour or I leave. I chose my dreams, now I’m 22 and run my own highly successful chain of food trucks 365k each and have beautiful Somali girlfriend. She owns her own candle business.",
            "title_similarity": "0.7163354",
            "sentiment_compound": 0.8832
        },
        {
            "id": "i2jxxed",
            "score": 6,
            "text": "Best one I got came with a full blown apology!\n\nFeb 2020:\n\n“If you don’t stop buying extra food and prep for this so called pandemic I’m leaving you. There won’t be a pandemic!!”\n\nApril 2020:\n“You were right. Do we have any chocolate”",
            "title_similarity": "0.69905996",
            "sentiment_compound": 0.6219
        },
        {
            "id": "i2k1z6y",
            "score": 5,
            "text": "The last few months I have been taking great care of my fitness: eating right, lifting weights, cardio, martial arts etc. Went from looking like a dadbod slob to looking like a Street Level Superhero.\n\nMy fat, lazy SO threatened to withhold sex If I won't spend more time watching Netflix with her, instead of working out. She also complained about me \"weasting grocery money\" on veggies and lean meat I bought...while finishing a tub of Cookie Dough Icecream.\n\nMy eyebrows were lifted so high by my sheer incredulity that it felt like I invented cranial workout to complement my routine.",
            "title_similarity": "0.775462",
            "sentiment_compound": 0.7111
        },
        {
            "id": "i2j87sy",
            "score": 23,
            "text": "\"i dont want to live with someone who spents money on video games\" didnt even take me 1 second of thinking to just say \"cool, then we'll never move in together\"\n\nshe backtracked real fast...",
            "title_similarity": "0.5609709",
            "sentiment_compound": 0.2681
        },
        {
            "id": "i2j3v5d",
            "score": 43,
            "text": "No ring-ring no ding-ding. This was after dating 3 months. I ended it pretty soon after that. We were both 30.",
            "title_similarity": "0.6014372",
            "sentiment_compound": 0.4382
        },
        {
            "id": "i2iq857",
            "score": 105,
            "text": "Never gotten one. I’m very amenable to negotiation with an adult, but I wouldn’t tolerate manipulation from a child.",
            "title_similarity": "0.4603449",
            "sentiment_compound": -0.4215
        },
        {
            "id": "i2ibi8o",
            "score": 67,
            "text": "You made the right choice.  I'm happy for you and your kid!",
            "title_similarity": "0.07559671",
            "sentiment_compound": 0.6114
        },
        {
            "id": "i2j74j9",
            "score": 64,
            "text": "Wasn’t exactly an immediate ultimatum but my now wife, then fiancee told me I had to actually work on ditching my porn addiction or she was going to have to postpone or cancel the wedding because she couldn’t handle it anymore. I had vaguely tried to quit in the past but unsuccessfully, I’m currently 3ish months clean which is pretty cool, still have a helluva time with it but the progress is good for her and for me both.",
            "title_similarity": "0.74720114",
            "sentiment_compound": 0.899
        },
        {
            "id": "i2jd9nt",
            "score": 8,
            "text": "Her or my friends. I picked her. Quite the experience, would not recommend",
            "title_similarity": "0.3613714",
            "sentiment_compound": 0.2477
        },
        {
            "id": "i2jlns5",
            "score": 8,
            "text": "To stop smoking weed or he'd leave me. I used to only have one cone before bed.\n\nI asked him why, he said it was dangerous. I told him to stop riding motorbikes or I'd leave him coz it was dangerous. His mum even lost her legs in a motorbike accident and weed never killed anyone. \n\nHe took it back.",
            "title_similarity": "0.802346",
            "sentiment_compound": -0.8959
        },
        {
            "id": "i2jrkq1",
            "score": 8,
            "text": "She said something along the lines of 'now that we own a house together, I own your ass'... She did not in fact, own my ass.",
            "title_similarity": "0.48303753",
            "sentiment_compound": -0.7906
        },
        {
            "id": "i2jz6nr",
            "score": 7,
            "text": "She said “show me your phone or we’re over,” I said “yeah? show me yours too.” She argued back saying if I really trusted her I wouldn’t need to see her phone.\n\n- My ex-fiancé/near childs mother (she got an abortion). Fun, super cool, strong headed, bold, confident, suddenly all flipped one day…",
            "title_similarity": "0.6651988",
            "sentiment_compound": 0.9612
        },
        {
            "id": "i2k27sk",
            "score": 7,
            "text": "Not answering the question but I've recently told my gf to please stop drinking so much, that if it happens again that she doesn't remember the night I'll break up with her. All of this because she doesn't remember that she made out with another man on a night out some months ago and we agreed that she would control her drinking, but it has happened many times since then and I'm at my limit. Am I too controlling?",
            "title_similarity": "0.75357413",
            "sentiment_compound": 0.4215
        },
        {
            "id": "i2jgwva",
            "score": 232,
            "text": "She said either I go on stage now and slap the guy who makes jokes at her expense on live TV or she sleeps with our son's friend again.",
            "title_similarity": "0.6199118",
            "sentiment_compound": 0.7003
        },
        {
            "id": "i2ixvun",
            "score": 27,
            "text": "Nerf or nothing",
            "title_similarity": "0.13204241",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2jfuu2",
            "score": 27,
            "text": "\"I don't like those people. If you keep spending all your time on the phone with them, you're going to lose me.\"\n\nShe said this about my best friend who I'd known since the age of two. Who was freaking out as his wife was giving birth to their first child. In a hospital I'd worked in and knew like the back of my hand.\nSomeone who I'd not only known for significantly longer than I'd known her, but *who I'd known longer than she'd been alive.*\n\nSo yeah, dodged that bullet.",
            "title_similarity": "0.7584015",
            "sentiment_compound": 0.8606
        },
        {
            "id": "i2iwk0s",
            "score": 116,
            "text": ">My ex won’t talk to me anymore, my dog and I are cuddling.\n\nYou made the right decision.",
            "title_similarity": "0.7557738",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2jl61a",
            "score": 11,
            "text": "While on vacation, my ex told me I needed to start working more, and earn enough money to get my own place by the time I was 22. She was 19 and worked part time in a bar. I was already working 3 different jobs and saving. I told her once she got back she could find another man. So I broke up with her.",
            "title_similarity": "0.748183",
            "sentiment_compound": -0.4728
        },
        {
            "id": "i2j3hd0",
            "score": 56,
            "text": "Most of them are all similar and generic\n\n* Your friends or me\n* Your job or me\n* Your family or me\n*  This masculine hobby which I find filthy and embarrassing or me\n\nThe worst was more a threat than ultimatum.....If you don't stick around and support me in my struggle to \"be a lazy moocher and not work because I'm ***depressed***, I'm going to end my life\"....I said good luck with that, told her sister and blocked all of them.",
            "title_similarity": "0.72693765",
            "sentiment_compound": -0.8854
        },
        {
            "id": "i2jf48a",
            "score": 10,
            "text": "Good on you for keeping the dog. Same thing here, if it's between my dog and a person...the person is going.\n\nOP PLEASE READ:\n\nHate to be that guy but:\n\nCareful about feeding your dog all that human food. My dog got diabetes and he ate good dog food and rarely had big human food. The acute effects can be enough to make it a risk.\n\nYou do NOT want your dog to get diabetes. 2 shots a day, they can go blind (as mine did) and it just gets worse from there. I'm glad your dog got treats but just make sure you're going easy on them ok? There are plenty of tasty things a dog can eat that are safe. Roasted potatoes, carrots, broccoli, peas, and chicken breast, just to name a few. No salt or spices, or maybe just the tiniest pinch of salt and they go nuts for it, and it's much healthier",
            "title_similarity": "0.74029315",
            "sentiment_compound": 0.6791
        },
        {
            "id": "i2jvcfv",
            "score": 11,
            "text": "My ex told me she couldn't be with someone who smoked weed.  I'm single now.  Never bow to ultimatums.",
            "title_similarity": "0.6702538",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2inczp",
            "score": 777,
            "text": "Not me, but my husband's ex. She told him she was transitioning to a male and that they should have an open relationship. When he started seeing me, she said to tell her everything including when (not if) we started having sex. Y'know, open lines of communication. We both expected and supported this. I had the same arrangement with my now-ex.\n\nAnd then we had sex. He told her as soon as he got home, just like he promised. She then gave him the ultimatum of \"it's her or me\", and then over the next couple months spiraled into \"I changed my mind, months ago BTW, I don't approve of this anymore so you cheated on me\" and \"oh I'm not actually trans, my therapist was enabling me by listening to me and prescribing me hormones.\" (Hugely paraphrased of course, with a healthy dose of salt.)\n\nEDIT: I would like to state that I am completely an ally of the LGBT community and if someone tells me they're trans then I believe them. I did my best to support her decision when she still was saying she was trans. After all, my now-ex is trans too so I've lived the life of the spouse and #1 support person. Coming from actually having lived and experienced this story, it overall seems like she is a very confused person who went through a lot during her childhood, and overall had no idea who she was or wanted to be and probably still has a lot of growing up to do. I don't think the therapist was enabling her, I think she was scared it was wrong for her and didn't know how to communicate that (when she told my now husband and showed him the hormones, she told him \"but if you don't want me to transition, tell me and I won't\" which is a shitty place to put anyone).",
            "title_similarity": "0.67242",
            "sentiment_compound": 0.8466
        },
        {
            "id": "i2izdqg",
            "score": 65,
            "text": "Had an ex who thought my friend who's like my sister had feelings for me (she already had a bf) and she served me an ultimatum to break the friendship with her or break up.\n\nLater on I get to know that she cheated on her ex with me (hid that from me) and alot of other lies, I was mentally drained.\n\nI broke up with her, i'm doing pretty well right now and that friend has always been there for me super grateful for her and the support which she gave me as a sister.",
            "title_similarity": "0.66977984",
            "sentiment_compound": 0.9313
        },
        {
            "id": "i2j28x1",
            "score": 64,
            "text": "I had 2 weeks to \"get over\" my depression and anxiety or he would leave... Well I left.",
            "title_similarity": "0.69439125",
            "sentiment_compound": -0.5423
        },
        {
            "id": "i2ig310",
            "score": 127,
            "text": "I can’t imagine wanting to take something away from my wife that makes her happy.  Why would I want that, even if I thought she’d do it?",
            "title_similarity": "0.48569855",
            "sentiment_compound": 0.6124
        },
        {
            "id": "i2jgvms",
            "score": 14,
            "text": "\"We can stay together I guess but if you really want kids I refuse to have them by you.  You can accept that you wont be the father by blood of any of them or you can leave.\"\n\nI left.  For many reasons but this was a real cherry on top.",
            "title_similarity": "0.59168005",
            "sentiment_compound": 0.5251
        },
        {
            "id": "i2imc2j",
            "score": 753,
            "text": "The business, or me. I had started a business on the side. It was taking up most all of my free time. \n\nI chose the business. Make boatloads of money, and met an incredible girl. \n\nI'm glad she did it, and it's the best decision I have ever made.",
            "title_similarity": "0.43293634",
            "sentiment_compound": 0.8948
        },
        {
            "id": "i2j65nq",
            "score": 72,
            "text": "After three years she decided she wanted to return to the Christian faith and said we could only be together and create a family if I became a Christian. I moved back home the next day.",
            "title_similarity": "0.58664274",
            "sentiment_compound": 0.5994
        },
        {
            "id": "i2jgezg",
            "score": 73,
            "text": "He told me he wasn't gonna stop drinking, so I could either stay with him and his alcohol or leave.\n\nI left. He was shocked.",
            "title_similarity": "0.54031545",
            "sentiment_compound": -0.1561
        },
        {
            "id": "i2jcnjq",
            "score": 16,
            "text": "I have a general rule of thumb with ultimatums. If a loved one gives me an ultimatum, claiming that if I loved them, I'd pick them; well, I guarantee that I'll pick the option that didn't try and give me an ultimatum. There have been exceptions from this 'rule', but they have been very few and far between.",
            "title_similarity": "0.5051359",
            "sentiment_compound": 0.714
        },
        {
            "id": "i2k3j7m",
            "score": 84,
            "text": "We'd only been dating for about a month when she pulled this one on me...\n\nHer:  If you don't stop hanging out with your loser friends, you can forget we ever met.\n\n...Three hours later...\n\nPhone rings: Hello?\n\nHer: Where are you? We were supposed to be at my parent's 30 minutes ago.\n\nMe: Who is this?\n\nHer: This is blah blah blah.\n\nMe:  Who?\n\nHer: Blah blah blah!\n\nMe:  I don't think we've ever met. I don't know you. Please don't call here again.\n\nLoser friends: Damn!\n\nContinue to act as though I never met her before. Literally. From that day forward I would never acknowledge that we ever met, ever spent time together, were ever in a relationship, anything. Da fuq you think you are drawing that kind of line in the sand? Lol.",
            "title_similarity": "0.79320705",
            "sentiment_compound": -0.8135
        },
        {
            "id": "i2ibgnq",
            "score": 515,
            "text": "Sounds like you already got a great partner.",
            "title_similarity": "-0.00025771745",
            "sentiment_compound": 0.765
        },
        {
            "id": "i2jgpaq",
            "score": 19,
            "text": "She told me either i stopped working out because she didn’t like how I looked or she would kill herself\n\n6 months later I’m more jacked than ever and she’s still breathing",
            "title_similarity": "0.7375226",
            "sentiment_compound": -0.6249
        },
        {
            "id": "i2jz6aw",
            "score": 58,
            "text": "Oh boy OP, your story brought up some *shiiit.*  \n\nGot let go from my job due to Covid. Was struggling to start my own business, thankfully had some savings to hold the fort for a little while. Then it began.  \n\n\"I'm jealous that I still have to go work and you don't. Look at my friend's Instagram, her husband moved her abroad. If you really loved me you'd do the same.\" \n\nMy dog of 13 years was on his last legs due to cancer, I had to spend all day trying to make ends meet and spend all night taking care of him, covered in his blood and excrement, calming his seizures, fighting back tears as I heard his struggling breaths, all in the hope to ease his last few months with us.  \n\n\"You don't spend enough time with me. If you really loved me you'd make time for me.\"  \n\nFell into a deep depression (gee, I wonder why), gained weight, smoked weed, my mother's eyesight started developing problems, but I fought on, started freelancing, from working for clients to teaching music *while* helping her with *her* job. Stopped going out because she didn't like my friends, pretty soon even my social media needed her approval.  \n\n\"We don't do anything fun anymore. I want to get wasted with my single friends, write a book, be an influencer and speak on mental health. If you really loved me you'd to support me.\"  \n\nI'm still sad about my dog's passing,\nbut I'm real happy to lose that bitch.",
            "title_similarity": "0.8623004",
            "sentiment_compound": 0.7213
        },
        {
            "id": "i2ibuqm",
            "score": 20,
            "text": "Sounds like you got lucky!",
            "title_similarity": "-0.07506014",
            "sentiment_compound": 0.68
        },
        {
            "id": "i2jpd55",
            "score": 18,
            "text": "My ex has 5 euros for lunch and wasted the whole money first thing in the morning on cigars. \nAt lunchtime she came to me asking for money and I said \"You bought cigars, eat cigars\".",
            "title_similarity": "0.6964866",
            "sentiment_compound": -0.4939
        },
        {
            "id": "i2j6ffe",
            "score": 184,
            "text": "She asked me to cut my hair *before* her birthday one year. (I'm a dude, long hair, mid-back length). I actually did it, and chopped it all the way off for her, but on the day after her birthday....   She didn't pay any mind to the fact that I cut off 3+ years of growth for her just because I did it a day late.",
            "title_similarity": "0.74886394",
            "sentiment_compound": 0.164
        },
        {
            "id": "i2j73b1",
            "score": 22,
            "text": "Stop talking to my best friend who was a girl or my girlfriend who was jealous, \n\nTo this day the biggest regret of my life was choosing some shitty girlfriend over my best friend, I'll never make a mistake like that again",
            "title_similarity": "0.6804767",
            "sentiment_compound": 0.8288
        },
        {
            "id": "i2jlyrr",
            "score": 22,
            "text": "Ultimatums are when someone chooses to end the relationship by blaming the other person for not doing something they will not do.\n\nIf you're served one, the relationship is already over.",
            "title_similarity": "0.48952228",
            "sentiment_compound": -0.4939
        },
        {
            "id": "i2iue0b",
            "score": 498,
            "text": "So i gave an ultimatum: i told my ex gf stop taking 50000 pics of my food after it arrives and expecting me to wait for her to finish her photoshoot and because of her photoshoot i had to eat the now cold food. \n\n\nI gave her the ultimatum she didnt change... i left because i got sick of having cold food that was supposed to be hot",
            "title_similarity": "0.82656914",
            "sentiment_compound": -0.6705
        },
        {
            "id": "i2iso3m",
            "score": -24,
            "text": "sounds like you chose the easy way out instead of trying to upgrade living space!",
            "title_similarity": "0.24315575",
            "sentiment_compound": 0.69
        },
        {
            "id": "i2j593c",
            "score": 24,
            "text": "if I'm not marrying her, i should forget about her and my son.\nSo I married her.\nMost hellish 3 years of my life.",
            "title_similarity": "0.73755896",
            "sentiment_compound": -0.7501
        },
        {
            "id": "i2j94cu",
            "score": 25,
            "text": "My ex said we would break up unless I gave her a baby. Unfortunately she got both",
            "title_similarity": "0.69229865",
            "sentiment_compound": -0.34
        },
        {
            "id": "i2jm4j5",
            "score": 26,
            "text": "Believe in God or we're over",
            "title_similarity": "0.21605921",
            "sentiment_compound": 0.2732
        },
        {
            "id": "i2jwmcp",
            "score": 26,
            "text": "Oh boy. I had an ex in college give me so many.\n\n\"Either you plan on marrying me or we break up right now\". I was 20 years old at that point I didn't even know if I wanted to get married at all\n\nWe met by casually hooking up and 4 months into the relationship after coming back from spring break she tells me \"we can't do anything else below the belt until we're married or you start going to church\"\n\n\"If you feel like you're going to play video games even after college is over we should just break up now\"\n\nOur relationship felt like an unending ultimatum. when you're in a relationship like that it feels like trying to end things would be catastrophically terrible- but it wasn't, she screamed and screamed then left and when I thought I would be crying I was just sitting there with a shit eating grin on my face\n\nThat was 8 years ago, im 29. My fiancé now will play video games with me, and the only ultimatum I get is whether I'm fucking her on the bed or on the couch. It gets better my dudes- I promise it gets better.",
            "title_similarity": "0.7636137",
            "sentiment_compound": 0.907
        },
        {
            "id": "i2iluuz",
            "score": 63,
            "text": "Get rid or my Harley or we will be divorced,  still got my bike.",
            "title_similarity": "0.5200015",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2ieus1",
            "score": 535,
            "text": "You'll change your mind about dogs if you stay with me.\n\n\nDumped her ass and got me a girl that loves dogs",
            "title_similarity": "0.67748964",
            "sentiment_compound": -0.3612
        },
        {
            "id": "i2is2mu",
            "score": 279,
            "text": "When I was 16 (I'm 27 now) I gave my gf at the time an ultimatum, the ultimatum was that I would leave if she attempted suicide again, I later realized how stupid and stress inducing that was but being young and freaked out by the revelation that my gf was suicidal led me to make the ultimatum out of a misguided sense of compassion and attempted helping, thankfully she never committed suicide but we broke up a few months later for unrelated reasons",
            "title_similarity": "0.75125355",
            "sentiment_compound": -0.5165
        },
        {
            "id": "i2jhauw",
            "score": 121,
            "text": "My now wife told me if I didn't stop taking cocaine she would leave me.. 7 years clean now 😂👍\n\nNot a bad ultimatum but one I'll be eternally grateful for",
            "title_similarity": "0.6704617",
            "sentiment_compound": 0.843
        },
        {
            "id": "i2jgap3",
            "score": 27,
            "text": "My ex gave me ultimatums that I considered unfair. One - return from tour with Army in Korea, where I was a shoe-in for promotion and other bonuses. Second - have sex without protection because she wanted a lot of children so she can stay at home, where I drew the line at two children. It was an acrimonious divorce, she got to keep everything - kids, house. I was a bad father because I worked too much. IMHO, if there is even a hint of ultimatum, break the relationship and never look back. There is a good reason we aren't dealing with terrorists.",
            "title_similarity": "0.8157586",
            "sentiment_compound": 0.1265
        },
        {
            "id": "i2iye11",
            "score": 341,
            "text": "If I fed my dog bacon fries and a burger bun he would have the most rancid farts for the next 4-6 hours no way I’d be cuddling lol",
            "title_similarity": "0.77456045",
            "sentiment_compound": -0.4927
        },
        {
            "id": "i2j0plc",
            "score": 1227,
            "text": "Her: (screaming) ***\"Your career or me.\"***\n\nMe: (very calmly) \"Well let me ask you:\n\n1. Do you enjoy living in this nice apartment here in the middle of the city?... Yes\n\n2. Do you like dining out/going out to different places regularly?... Yes\n\n3. Do you have the benefit of going on cool vacations twice a year?... Yes\n\n4. Do you appreciate this car we are driving home in right now?... Yes\n\nOkay, then when are you going to find an (raising my voice) ***actual*** ***fucking job that pays well enough*** so I can find something else?\"\n\nI broke up with her shortly after.  She was/still is a *'freelance artist'* with no clients.  I like to think she is some other guys problem.",
            "title_similarity": "0.5217272",
            "sentiment_compound": 0.9819
        },
        {
            "id": "i2jx4af",
            "score": 136,
            "text": "If I didn't allow an open marriage I would be homeless and eat ramen the rest of my life. I was homeless for 6 weeks, but I left and started over and my shit and my money is all my own. He got herpes. 😂😂😂",
            "title_similarity": "0.8264575",
            "sentiment_compound": 0.7443
        },
        {
            "id": "i2j0ku3",
            "score": 266,
            "text": "Kids by the age of 25 or end relationship \n\nHad to break up, still pretty good friends though.",
            "title_similarity": "0.49655458",
            "sentiment_compound": 0.8481
        },
        {
            "id": "i2in7tk",
            "score": 46,
            "text": "What’s wrong with your living space?",
            "title_similarity": "0.2252183",
            "sentiment_compound": -0.4767
        },
        {
            "id": "i2j3bms",
            "score": 182,
            "text": "Had a GF tell me “ you love your daughter more than you love me” correction bitch, I don’t love you at all.",
            "title_similarity": "0.6056725",
            "sentiment_compound": 0.8768
        },
        {
            "id": "i2ibzxs",
            "score": 799,
            "text": "My ex once said “do what you want”\n\nShe lied.",
            "title_similarity": "0.47863972",
            "sentiment_compound": -0.3818
        },
        {
            "id": "i2ixglm",
            "score": 637,
            "text": "That’s masturbation is cheating and I wasn’t allowed anymore.",
            "title_similarity": "0.48066303",
            "sentiment_compound": -0.5574
        },
        {
            "id": "i2jraue",
            "score": 58,
            "text": "I had to give up my hobby. She felt like I spent too much time on it - on its solitary, this doesn't seem like an insane ultimatum, but here's the kicker:\n\nI found a way to keep doing my thing, but still spend more quality time with her by shuffling around some other things. I promised to block out certain days, to spend time and energy on making those days more special than just sitting around on the couch...\n\n..but it wasn't ever good enough. When I pressed her on it, I got her actual ultimatum: *\"You don't love me unless you sacrifice enough for me.\"*\n\nfuckin' noooope.\n\n\\- and don't even get me started on the time she got angry with me for helping a child in a traffic accident, lol.",
            "title_similarity": "0.65588313",
            "sentiment_compound": -0.5756
        },
        {
            "id": "i2ioeib",
            "score": 412,
            "text": "One of my closest friends said if I don’t get her a gift for her birthday she doesn’t know me anymore. Leveraged our entire friendship on a gift. She got the gift and lost me.",
            "title_similarity": "0.6839061",
            "sentiment_compound": 0.9081
        },
        {
            "id": "i2j162p",
            "score": 1493,
            "text": "\"I won't be with you if you don't stop using condoms. Trust me, I'm on the pill\" \n\nI ran fucking faster than I would have even if I wasn't a drunk-ass POS at the time. I'm just happy I found a semi-sane fiancee.",
            "title_similarity": "0.5594862",
            "sentiment_compound": 0.8355
        },
        {
            "id": "i2j3ybb",
            "score": 843,
            "text": "I've had a bunch of toxic relationships and have spent the last 18 months intentionally single so I can work on myself.\n\nHere are a few the best\n\nWhen things started to go bad a girl of been dating for 6 weeks told me that if I broke up with her she'd kill herself. I broke up with her and she was true to her word. She attempted (unsuccessfully) and spent the next 2 weeks in hospital.\n\nGot told about 1 month in that if we were to keep dating I needed to cut all contact with my best friend because she was jealous of her. This woman also also friends with my mate and we both worked with her. Oh, and she was a lesbian.\n\nGot told that I needed to immediately end all friendships with all women. I wasn't even allowed to have coffee at a cafe with a female friend. But she played squash with her ex every week then went to dinner with him after. Because of my work and social circles at the time, literally all of my friends were women.\n\nGot told that I needed to be ok with her being childish and throwing tantrums. The first time she threw a tantrum over something really benign she went to storm out and leave. Which I let her do and didn't stop her. She was FURIOUS that I didn't stop her. She did not appreciate it when I told her that I didn't stop her because she was an independent person who had the autonomy to make her own decisions and if she thought the mature thing to do was storm out then she had the right to make that decision.",
            "title_similarity": "0.79504746",
            "sentiment_compound": 0.5992
        },
        {
            "id": "i2j3yr9",
            "score": 79,
            "text": "[removed]",
            "title_similarity": "0.045773424"
        },
        {
            "id": "i2imazf",
            "score": 2347,
            "text": "If you don't cook tonight I will. Shudder!",
            "title_similarity": "0.43774045",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2jg5jm",
            "score": 215,
            "text": "Finally got together with a good friend of about seven-ish years, always been a happy go lucky person and a beacon of positivity in my life. \n\nApproximately seven months after getting together she tells me that we’re now going to be trying for a baby - no ifs, ands, or buts! \n\nThat I either go along with it and provide the baby gravy myself or she’ll go to a clinic in search of a sperm donor and I’ll just have to make peace with the idea of raising another man’s child. \n\nI told her I didn’t actually have to do anything and ended the relationship there and then.",
            "title_similarity": "0.7138965",
            "sentiment_compound": 0.9551
        },
        {
            "id": "i2ihbt0",
            "score": 2027,
            "text": "[deleted]",
            "title_similarity": "0.08695337"
        },
        {
            "id": "i2ie1f2",
            "score": 3062,
            "text": "Years ago, as a broke college student who could not afford a car, any car, so I only had a motorcycle: *\"You can't ride bikes anymore.\"*\n\nMe: *\"Goodbye.\"*",
            "title_similarity": "0.6827909",
            "sentiment_compound": -0.4215
        },
        {
            "id": "i2ixo46",
            "score": 1333,
            "text": "If you don't go back to your old job (no chance and I hated it) then this isn't going to work.\n\nI had to choose between what felt like a dream job and my partner. I chose the new job (no way I was going back) and it was the right choice at the time as we had other problems.",
            "title_similarity": "0.5916816",
            "sentiment_compound": -0.34
        },
        {
            "id": "i2jbbc5",
            "score": 529,
            "text": "***First thing i want to say here since men are reading this is we need to check our balls. Not with each other but you can if you want idc. If you find something go to the doctor.*****\n\nSo this one is kinda funny to me now that I look at it but. \n\nShe told me we need to bake some muffins for some bullshit charity thing or we will break up. I had just found out I had cancer so when that happens man your mental takes a huge shot. I said yeah come on over and cheer me up, not thinking it was for anything but me to cheer up. Well she came in and started making muffins or whatever. I was in a daze and helping along when I was mixing the batter with a spoon and accidentally dropped the spoon in the batter. For some reason the spoon slowly sank in the batter and it made me laugh, the bitch was right it did cheer me up. Oh no she started yelling at me that I just ruined her cake batter….. I stoped mid laugh looked at her out of my daze and wondered if she was acting or for real. NOPE she was for real screaming at me. I calmly grabbed all the bowls which was three if I remember off the island, she said she wasn’t done mixing them and started to yell more. I told her they were done and her face turned to confusing. I stacked them into each other and walked to the front door and threw them in the front yard. \n\n4year relationship I told her get the fuck out and find someone else to cook your muffins. \n\nCancer changes a lot on the psychological mindset but I’m glad I lost the piece of shit!!",
            "title_similarity": "0.7294369",
            "sentiment_compound": -0.8259
        },
        {
            "id": "i2j7yez",
            "score": 561,
            "text": "My ex gave me 6 months to become a Jehovah's witness or she would break up with me.",
            "title_similarity": "0.73409605",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2j3iuu",
            "score": 5736,
            "text": "I have ever since Kindergarten been hanging out with the same group of friends. We have always hung out in one of their basements since it had the most room and was rather central. We would for hours play Magic the Gathering, and video games. For us this was just how we did thing. In high school I began doing alot of sports so I gained more attention since I was more open and incredibly fit, once I hit college I had gotten a girlfriend who I would hangout but always see my friends. One day she said that my friends were doing nothing but bring me down and always making me looking like a loser because we played MTG. I was offered a ultimatum, I leave them to be \"cool\" with her or be a loser forever. To this day 4 years after college I play DND ever Sunday with my same friends and play MTG every week,  best decision.",
            "title_similarity": "0.67108655",
            "sentiment_compound": 0.9832
        },
        {
            "id": "i2ifzii",
            "score": 1101,
            "text": "Marry me now.  I was in my junior year of a computer science degree.  Not having it.",
            "title_similarity": "0.56063414",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2ik796",
            "score": 2000,
            "text": "My ex told me that my once a month trip to hang out with my friends needed to stop or she would leave me",
            "title_similarity": "0.72775817",
            "sentiment_compound": 0.1779
        },
        {
            "id": "i2jaft7",
            "score": 241,
            "text": "Ex.tried to make me choose between him and my cat. \n\nMy partner is my 17 year old cats favourite person.",
            "title_similarity": "0.60398686",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2j62j2",
            "score": 580,
            "text": "From same partner:\n\nMove to Japan\n\nBecome a Muslim",
            "title_similarity": "0.32727155",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2j8gdz",
            "score": 1583,
            "text": "My ex said she and her daughter were to move in with me and my kid 6 months after I bought my place or she's moving on.  We had been dating for 3 months prior to that.\n\nBullet dodged.",
            "title_similarity": "0.6834116",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2in2dd",
            "score": 5601,
            "text": "My ex said that if i dont move to her city we were going to break up. I did move to her city. We broke up.",
            "title_similarity": "0.6525668",
            "sentiment_compound": -0.4215
        },
        {
            "id": "i2ivunv",
            "score": 738,
            "text": "Not me but my best friend had one of those \"if you break up with me im going to kill myself\" girls. One of many mind fuckery tactics from her. Pure manipulation.",
            "title_similarity": "0.5753605",
            "sentiment_compound": 0.1901
        },
        {
            "id": "i2j0y5u",
            "score": 442,
            "text": "That she might hurt herself or commit suicide without me. Yeah, you're in a low place but that there is abuse. It took me a lot of time and courage to walk on from her.",
            "title_similarity": "0.543664",
            "sentiment_compound": -0.781
        },
        {
            "id": "i2jd3j8",
            "score": 1638,
            "text": "“If you don’t get a better job and start making more money, I’m breaking up with you”\n\nAt the time I was only like 19! And she didn’t even have *a* job",
            "title_similarity": "0.6655916",
            "sentiment_compound": 0.69
        },
        {
            "id": "i2j7db3",
            "score": 2350,
            "text": "My ex, who had permission to permanently work remotely (pre-covid), said we either move to LA or we break up. Working remotely isn't possible in my industry, I had an awesome place, and it would take me forever to start all over in a new city. A new city with a much higher cost of living...",
            "title_similarity": "0.6326506",
            "sentiment_compound": 0.6249
        },
        {
            "id": "i2j5s1m",
            "score": 1134,
            "text": "My wife told me that I had to stop seeing all my friends, install a tracking app on my phone, always let her read all my private mails and messages at any time and we should move to another city otherwise she get a divorce.\n\n*She* was the one who had betrayed my trust before this and was engaging in the most over the top [DARVO](https://en.wikipedia.org/wiki/DARVO) stunt I've *ever* seen.\n\nShe's my ex-wife now of course.",
            "title_similarity": "0.7203992",
            "sentiment_compound": 0.5667
        },
        {
            "id": "i2jb9yj",
            "score": 578,
            "text": "My ex wife was constantly angry and would go apeshit about the smallest, most inconsequential things, as well as being abusive to our elder daughter, both of which put a lot of stress on daily life. After years of this, she told me “It’s living in this society that makes me the way I am. If you want me to change, you’ll have to take me to another country. So we left Japan (her own country), where I’d spent the last 16 years building a life and business, and retured to my home country in a last ditch effort to keep the family together. It didn’t work of course, as I knew it wouldn’t. I tried for another 5 more years and then gave up and divorced her.",
            "title_similarity": "0.7856233",
            "sentiment_compound": -0.8689
        },
        {
            "id": "i2iyuyw",
            "score": 7,
            "text": "[deleted]",
            "title_similarity": "0.08695337"
        },
        {
            "id": "i2izw6h",
            "score": 5,
            "text": "I am glad you chose wisely. Otherwise you would be without both.",
            "title_similarity": "0.1642285",
            "sentiment_compound": 0.7003
        },
        {
            "id": "i2j0ve1",
            "score": 5,
            "text": "You made the right decision",
            "title_similarity": "-0.06496904",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2j1fyp",
            "score": 3,
            "text": "You made the right choice lol",
            "title_similarity": "-0.04763409",
            "sentiment_compound": 0.4215
        },
        {
            "id": "i2j2do5",
            "score": 3,
            "text": "Have sex with me or we’re done",
            "title_similarity": "0.2367289",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2j6ugu",
            "score": 43,
            "text": "[\"Either we get engaged now, or I'm leaving.\"](https://i.imgur.com/DjVo6Ms.jpeg)",
            "title_similarity": "0.32897595",
            "sentiment_compound": 0.4019
        },
        {
            "id": "i2j8ghp",
            "score": 13,
            "text": "An ex and I were trying to stay together while I moved a few states away for promised work. When that work fell through, I asked my then gf if she'd be able to pick me up from the airport that weekend. Within about 2 hours she had faxed me \"terms and conditions\" to move back into the apartment they my name was on. They included me having to pay her and her parents a monthly amount, be the person in charge of cooking and cleaning, as well as finding full time work to afford all that. Luckily, the people letting me stay with them offered their floor for as long as needed within reason. So I called her up and told her to fuck off. Only time I talked to her after was to apologize for being a dick, so that I could enter my marriage without that baggage. She was OK with it until I mentioned my selfish reason, then went off so I hung up. Fuck you Chelsea",
            "title_similarity": "0.7500233",
            "sentiment_compound": -0.5525
        },
        {
            "id": "i2j8prz",
            "score": 223,
            "text": "1. Quit your job or I'm breaking up with you. (Student working at school paper)\n\n2. If you break up with me I'm going to kill myself. (After I chose the job over her)\n\nEdit: This happened 10 years ago. She was lying and I haven't seen her in many many years.",
            "title_similarity": "0.7232424",
            "sentiment_compound": -0.8442
        },
        {
            "id": "i2j9wyt",
            "score": 1,
            "text": "Love = breaking up",
            "title_similarity": "0.24441694",
            "sentiment_compound": 0.6369
        },
        {
            "id": "i2ja36s",
            "score": 3,
            "text": "If you don't wanna cook I will, and you know how that goes.\n\nYep yep I went ahead and made us burgers,actually the best ones I ever made although she did have to wait for the buns to be made. No complaints afterwards tho",
            "title_similarity": "0.6682154",
            "sentiment_compound": 0.8707
        },
        {
            "id": "i2jd73p",
            "score": 1,
            "text": "that if i broke up with him he would kill himself. (surprise,, he didn’t)",
            "title_similarity": "0.5094856",
            "sentiment_compound": -0.7506
        },
        {
            "id": "i2jd80k",
            "score": 4,
            "text": "Either get me a cat or a baby. I got her 2 cats. She still faked taking contraceptives.",
            "title_similarity": "0.49845827",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2jdy99",
            "score": 5,
            "text": "My ex said if I start working out he’ll break up with me. Glad we broke up a few weeks later!",
            "title_similarity": "0.7059471",
            "sentiment_compound": 0.126
        },
        {
            "id": "i2je0og",
            "score": 4,
            "text": "If i ever tried weed she would end it. I had alraedy smoked for a while.",
            "title_similarity": "0.52868026",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2jelky",
            "score": 1,
            "text": "I was told that if we didn't get married, she was leaving. This was after we had just moved 5000 miles from home, to the middle of the pacific ocean, just us. It lasted five years... three good ones, two really bad ones.",
            "title_similarity": "0.61630714",
            "sentiment_compound": -0.2247
        },
        {
            "id": "i2jid02",
            "score": 3,
            "text": "It was my first actual relationship and she wanted to wait until marriage... Totally blindsided.  It was hard but I had to let her go.",
            "title_similarity": "0.6174495",
            "sentiment_compound": -0.0516
        },
        {
            "id": "i2jiigo",
            "score": 1,
            "text": "[deleted]",
            "title_similarity": "0.08695337"
        },
        {
            "id": "i2jj29s",
            "score": 2,
            "text": "Honestly I almost walked away from my wife earlier on in our dating life because of her dog. She only had the rescue dog 6 months before we met and it was her “baby”. I couldn’t stand how she treated the dog and what the dog was able to get away with. I was talked of the edge by a close friend that went through the same thing. We had a talk about some of the issues with the dog and made a compromise. That was 7 years ago and we’ve been married 4.",
            "title_similarity": "0.8701277",
            "sentiment_compound": 0.8591
        },
        {
            "id": "i2jjkmo",
            "score": 6,
            "text": "she said she would dump me if i kept eating things with mayo (fries, fish, burgers etc etc)",
            "title_similarity": "0.7053838",
            "sentiment_compound": -0.3818
        },
        {
            "id": "i2jk4qa",
            "score": 4,
            "text": "I had to stay with her or she would commit suicide. When I finally had the courage to end it she then started to phone my friends to tell them she was in the hospital because she jumped out of the window or even posing as her own mother to tell people she was dead.",
            "title_similarity": "0.62298965",
            "sentiment_compound": -0.3182
        },
        {
            "id": "i2jkcla",
            "score": 1,
            "text": "My first girlfriend from 15-17 was seriously emotionally and physically abusive, as well as super jealous. She made me drop out of college as she was “pregnant” or she would leave me. I dropped out and a month later she had a “miscarriage”.",
            "title_similarity": "0.7162746",
            "sentiment_compound": -0.6369
        },
        {
            "id": "i2jkmr0",
            "score": 3,
            "text": "I lived in China for a few years as an early education teacher, all of my colleagues were women and basically the only few who could speak English in that city, so I became close with around 3 of them. My gf noticed I had always been going on trips with them etc. so told me to stop going out with them so often. I told her nothing was going on and they were my friends and even invited her every time I went out but she told me i had to choose them or her.",
            "title_similarity": "0.7105297",
            "sentiment_compound": 0.1154
        },
        {
            "id": "i2jkwzw",
            "score": 4,
            "text": "Don't continue to study I want to make a family.\n\nI'm single, and I wish I decided to continue to study.\n\nWas one of worst decisions of my life",
            "title_similarity": "0.7005037",
            "sentiment_compound": -0.2732
        },
        {
            "id": "i2jlf0d",
            "score": 5,
            "text": "High school girlfriend told me to stop messing with a Rubik's cube so much, and it was either her or the cube. I called her out, and she backed down. Later found out she had been looking for an excuse to break up with me for months but didn't know how. At one point apparently a musical was considered.",
            "title_similarity": "0.78601646",
            "sentiment_compound": -0.1027
        },
        {
            "id": "i2jln94",
            "score": 5,
            "text": "My ex wanted me to move to a new country without a job or any security and expect me just to find work wherever I could. So glad I did not go !",
            "title_similarity": "0.6682793",
            "sentiment_compound": 0.7621
        },
        {
            "id": "i2jmnuj",
            "score": 11,
            "text": "Almost every ultimatum I was given was stupid, but I didn’t say that to her, I simply calmed her down and told her it’s not good to give ultimatums as that will ruin a relationship, let’s just work on things and hope for the best.\n\nNow she knows they were stupid and I openly tell her so, if she had carried on doing them, our relationship would have ended a long time ago.",
            "title_similarity": "0.63304657",
            "sentiment_compound": -0.2638
        },
        {
            "id": "i2jndbd",
            "score": 75,
            "text": "I planned a once a month to play video games with a group of college buddies. We all decided on a game that we all had and it was only one Saturday every month for a couple of hours. \n\nMy ex hated video games or anything that took attention from her and being alone. So she got upset that i chose my friend group over her. She wanted to go to the pool and I told her we can go later because I already made plans to hang out with my friends. She gets pissy and says if I am not done playing by the time she comes back she will be mad and I'll regret it. \n\nShe goes to the pool for 30 minutes, comes back, stares at me playing and throws her fucking cat at me. I catch her cat and make sure he is okay but he ends up clawing my arm and she is sitting there laughing about it.",
            "title_similarity": "0.7961875",
            "sentiment_compound": 0.5142
        },
        {
            "id": "i2jnng1",
            "score": 8,
            "text": "I just had to put down my 14 year old dog after a multi year long battle with cancer.\n\nYou made the right choice, OP, and enjoy the rest of your time with her. Good riddance to the ex, because you can absolutely do better than some ghoul who would try to make you pick between your dog or her.",
            "title_similarity": "0.79161143",
            "sentiment_compound": 0.3134
        },
        {
            "id": "i2jo33k",
            "score": 3,
            "text": "She realised that she is not monogamous. If I wanted a future with her I must be willing to adapt to that.",
            "title_similarity": "0.33000022",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2jp3ox",
            "score": 1,
            "text": "https://www.youtube.com/watch?v=oA6UYTbOEMQ",
            "title_similarity": "0.10018337",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2jqepf",
            "score": 3,
            "text": "Any ultimatum is not the way to go. Compromise is such a key part of any relationship, platonic or romantic.",
            "title_similarity": "0.3625735",
            "sentiment_compound": 0.4019
        },
        {
            "id": "i2jr0gx",
            "score": 4,
            "text": "I'm a toy collector, girl who I had just started dating at the time, said I couldn't buy anymore and to start giving some away.   We were done not too much longer.",
            "title_similarity": "0.6642227",
            "sentiment_compound": 0.34
        },
        {
            "id": "i2jrcx1",
            "score": 5,
            "text": "My ex (girl) keep unfriending my best friend (a girl) and my ex and best friend gave me an ultimatum, stop listening/contacts with the other person or relationship/friendship’s over. I sided with my ex. \n\nA year later ex cheated on me with a guy friend of mine. That’s how I lost my gf and best friend.",
            "title_similarity": "0.753563",
            "sentiment_compound": 0.9618
        },
        {
            "id": "i2jrfzb",
            "score": 2,
            "text": "Fuck your ex \nLove your dog!",
            "title_similarity": "0.55627346",
            "sentiment_compound": 0.2481
        },
        {
            "id": "i2jri9i",
            "score": 16,
            "text": "I was a single dad and my ex told me she expected me to put her before my three year old daughter.",
            "title_similarity": "0.71800613",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2jrmxl",
            "score": 1,
            "text": "She said I could have some cake or chocolate bar, but not both.  I'm still not over it.",
            "title_similarity": "0.47032663",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2jrya4",
            "score": 1,
            "text": "To convert my religion by a certain time frame.",
            "title_similarity": "0.18129684",
            "sentiment_compound": 0.2732
        },
        {
            "id": "i2jsbv9",
            "score": 4,
            "text": "i respond to ultimatums with extreme animosity. my girlfriend told me to get rid of my motorcycle or shes leaving. told her ok we’re done then. she calls back later in the day to apologize and to forget the ultimatum i can keep my bike",
            "title_similarity": "0.7217891",
            "sentiment_compound": -0.3597
        },
        {
            "id": "i2jsfux",
            "score": 8,
            "text": "\"it's me, or that stupid motorcycle.\"\n\nGuess who now has 2 motorcycles, and a hotter girl...",
            "title_similarity": "0.3779227",
            "sentiment_compound": -0.5267
        },
        {
            "id": "i2jt61h",
            "score": 1,
            "text": "If you don't give me a third child I will leave you for someone else. I did. 6 years later we divorced anyway.",
            "title_similarity": "0.64559454",
            "sentiment_compound": -0.0516
        },
        {
            "id": "i2jt70j",
            "score": 2,
            "text": "Glad she’s your ex mate.\n\nMy ex said if I didn’t like Harry Potter and some other bullshit Disney stuff, then this wasn’t gonna work out. Her forcing me to watch and like it now makes me despise everything Harry Potter. I already hated Disney because they are a terrible company.\n\nAnd to make it even worse, whenever I wanted her to watch and hopefully like the stuff I liked it was “nah, it’s shit not interested” but I HAD to love her crap. So glad I’m done with that basic ass bitch. So many things I’d love to rant about haha",
            "title_similarity": "0.7060481",
            "sentiment_compound": 0.81
        },
        {
            "id": "i2jtg6n",
            "score": 4,
            "text": "So all these aren't normal? I could make a bingo card just from my last gf.",
            "title_similarity": "0.47330266",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2jtln6",
            "score": 3,
            "text": "Maybe it's just me but if I'm given an ultimatum, I will purposely pick the option that they don't want me to.",
            "title_similarity": "0.3728893",
            "sentiment_compound": -0.0857
        },
        {
            "id": "i2jtved",
            "score": 3,
            "text": "Stop spending so much time playing music with my band. I said no. She did not follow through. *shrug*",
            "title_similarity": "0.61810327",
            "sentiment_compound": -0.0352
        },
        {
            "id": "i2ju0h2",
            "score": 24,
            "text": "Late reply but here goes.  \n\n\nMy ex was very spur of the moment with things. We were married a little under 2 years at this point. One day she decided she was going to be vegan. I told her I would support her in doing so and would eat vegan meals with her but that I would still want to eat meat myself. She came back at me saying: If you don't want to be fully vegan, then this marriage is over.  \nUltimately she did not go through with becoming vegan and we got divorced eventually (other reasons)",
            "title_similarity": "0.8706785",
            "sentiment_compound": 0.5672
        },
        {
            "id": "i2ju4n4",
            "score": 4,
            "text": "Clean up the kitchen or change the shit filled diaper",
            "title_similarity": "0.33485895",
            "sentiment_compound": 0.7717
        },
        {
            "id": "i2juabv",
            "score": 1,
            "text": "I do not think OP suspected that the first 100 or so 'Best' comments would be almost all men 😅",
            "title_similarity": "0.39131397",
            "sentiment_compound": 0.8507
        },
        {
            "id": "i2jun5t",
            "score": 115,
            "text": "My girl surprised me with a puppy, then after a week wanted to return him. When I refused she said her or the dog. I chose the dog.\n\nEdit: dog tax. https://m.imgur.com/gallery/K7gFSr4",
            "title_similarity": "0.7799698",
            "sentiment_compound": -0.0772
        },
        {
            "id": "i2junlu",
            "score": 3,
            "text": "The big takeaway from all of this is its always better to go with the thing and get rid of the partner in these situations",
            "title_similarity": "0.37321812",
            "sentiment_compound": 0.4404
        },
        {
            "id": "i2juwad",
            "score": 7,
            "text": "Had a girlfriend while I was a virgin and wanted to wait until I was ready: Either we have sex or I'll tell everyone you're gay",
            "title_similarity": "0.59097826",
            "sentiment_compound": 0.3612
        },
        {
            "id": "i2jv7kj",
            "score": 3,
            "text": "It was either stop seeing all my friends and family or disown everyone to be with her.\n\nI ran",
            "title_similarity": "0.53289855",
            "sentiment_compound": 0.2263
        },
        {
            "id": "i2jv8hv",
            "score": 3,
            "text": "\"It's either me or your mom\" - we dated for roughly 10 months at that point. Still cringe when thinking about it.",
            "title_similarity": "0.64339995",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2jvfwa",
            "score": 3,
            "text": "If i don't go with her to Europe (live there) , we would break up , that meant i had 1 month to become rich (i couldn't do it 🤣) ...",
            "title_similarity": "0.6627096",
            "sentiment_compound": 0.7783
        },
        {
            "id": "i2jvphe",
            "score": 3,
            "text": "Thanks to every story here for reminding me why I will never be in another relationship. :)",
            "title_similarity": "0.51934737",
            "sentiment_compound": 0.7096
        },
        {
            "id": "i2jwat1",
            "score": 6,
            "text": "Be with me ( abusive spouse ) or I’m taking the kids away. Not biologically mine but have been their father for three years now. Just trying to keep them safe.",
            "title_similarity": "0.71692437",
            "sentiment_compound": 0.3071
        },
        {
            "id": "i2jwi7w",
            "score": 3,
            "text": "dogs before hoes",
            "title_similarity": "0.23869911",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2jwul1",
            "score": 1,
            "text": "If I don’t cuff I can’t smash",
            "title_similarity": "0.16044119",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2jwwyr",
            "score": 2,
            "text": "Not me but my friend. Back in high school her bf was extremely volatile was said he would kill himself if they broke up. They eventually broke up and he was extremely depressed and continued to stalk her everywhere. At first I thought it was just coincidental, but we started seeing him everywhere before and after school; we would catch the train home we would see him on the other platform, sometimes on our train etc.\n\nAnd eventually one time when we were at the food court at a shopping centre, close to our school. A random kid came up to her and gave her a gift and said \"your boyfriend told me to give this to you,\" inside this gift was an expensive watch and this would keep occurring at random times.\n\nBut 2 years later they ended up getting back together and dated for another 8 years. But have now broken up again because she said he acts as if his her father. No physcial affection just authority controlled. I've hung out with them a bunch of times when they were together; he isn't a bad dude, quite decent but just seems way too mature now, just thinks too logically about everything, no display of any emotions",
            "title_similarity": "0.7325115",
            "sentiment_compound": -0.9121
        },
        {
            "id": "i2jx2nd",
            "score": 3,
            "text": "\"Propose to me before 2 years or I can't make us work.\"\n\nI can't believe I put up with as much as I did",
            "title_similarity": "0.65513414",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2jx2qz",
            "score": 8,
            "text": "My ex said that if she didn't have 100% control of all our money, then we wouldn't work out. Spoiler alert: we didn't work out.",
            "title_similarity": "0.6198603",
            "sentiment_compound": 0.296
        },
        {
            "id": "i2jx4fl",
            "score": 1,
            "text": "happy days! get rid of the man and not your baby.",
            "title_similarity": "0.4651479",
            "sentiment_compound": 0.6114
        },
        {
            "id": "i2jxapl",
            "score": 5,
            "text": "My first girlfriend told me I was her last stop before suicide, and if we ever broke up she'd kill herself. We were together for 5 years. I only loved her for 3 of those years, the last 2 I stayed out of fear that she'd hurt herself.\n\nWhen I realized I was considering suicide (in part due to having to endure her) I decided she can do whatever the fuck she wants but I wasn't going to keep sacrificing myself. Turns out it was a bluff.",
            "title_similarity": "0.7517187",
            "sentiment_compound": -0.9178
        },
        {
            "id": "i2jxcj0",
            "score": 1,
            "text": "Yeah wanted to keep the dog in a crate at night when she's used to sleeping on the bed.\n\nNOPE. My #1 girl comes first.",
            "title_similarity": "0.66245943",
            "sentiment_compound": 0.296
        },
        {
            "id": "i2jxi43",
            "score": 32,
            "text": "She told me I had to keep dating her or she’d burn my apartment down. \n\nI told her I had insurance and nothing of value in apartment anyway and to go for it. \n\nStill moved my guitar to my sisters house just in case. Never did burn it down.\n\nAlso, her apartment was attached to mine. Same building. Not the brightest.",
            "title_similarity": "0.7342423",
            "sentiment_compound": -0.6435
        },
        {
            "id": "i2jxlvo",
            "score": 10,
            "text": "My ex told me when I came home from work one day that she applied to work and live on a farm and if I didn't quit my job, sell or move my things into storage, and break my lease and join her on the farm, that I wasn't supportive of her and we would go our spearate ways.\n\nAnd then she had the balls to tell me I wasn't a very \"go with the flow\" kind of person. No, I just didn't \"go with her impulsive flow\" very much.",
            "title_similarity": "0.75619864",
            "sentiment_compound": 0.0803
        },
        {
            "id": "i2jxp90",
            "score": 2,
            "text": "With my first marriage,  I was subject to many ultimatums. \nThere are indeed useful ones that help you be a better person, but many are just for control.\nMy ex tried to cut me off from my family, and I realized, \nShe didn't care at all about my well being at all.\nUltimatums are a massive red flag.",
            "title_similarity": "0.71435183",
            "sentiment_compound": 0.0793
        },
        {
            "id": "i2jxxpz",
            "score": 9,
            "text": "I had rather terrible anxiety back like 6 or 7 years and it impacted our relationship and us going out and doing things because I'd be super anxious even if it was just 20 minutes away.\n\nOne day, she turned around to me and said \"Get over your Anxiety or I am breaking up with you\". Safe to say, not only did this make it worse, it was the worst feeling because I felt she was an amazing person until that point.  \n\n\nI am over my anxiety now, it took a couple of years of pushing myself.",
            "title_similarity": "0.68907756",
            "sentiment_compound": -0.2023
        },
        {
            "id": "i2jykqe",
            "score": 5,
            "text": "For me it was death by a thousand cuts. Every suggestion I didn't follow slowly turned into a demand later. By the end of our relationship she had ignored me for a couple weeks, for not doing what she had wanted.  Mine you I was wearing the shoes she likes, dressing how she likes, cutting my hair how she likes, and working on changing how I interact with people like she likes. My existence had turned into being someone else or I wasn't gonna have a woman she thought is a \"great catch\"\n\nI dumped her in a text. Anxiety melted away that day",
            "title_similarity": "0.7648244",
            "sentiment_compound": 0.6124
        },
        {
            "id": "i2jzaor",
            "score": 3,
            "text": "As you should, I'm glad you chose your dog haha",
            "title_similarity": "0.22251774",
            "sentiment_compound": 0.7184
        },
        {
            "id": "i2k045y",
            "score": 1,
            "text": "If I get a motorbike she will leave me 🤷",
            "title_similarity": "0.33699897",
            "sentiment_compound": -0.0516
        },
        {
            "id": "i2k07qs",
            "score": 3,
            "text": "Ultimatum, any ultimatum is a big fuck you. If you love someone you deal and learn to accept.  And they should do the same for you.\n\nIt's not complicated at all.",
            "title_similarity": "0.30998045",
            "sentiment_compound": 0.5106
        },
        {
            "id": "i2k0auy",
            "score": 2,
            "text": "stop talking completely to a guy (we had slept together in the past but were just friends now) and we start dating or we don’t date and he leaves and we never talk again\n\nCome to find out he was liking half naked pics of a girl he matched with through tinder earlier in the year and would go through my phone and delete contacts of people he didn’t want me talking to",
            "title_similarity": "0.7907361",
            "sentiment_compound": 0.8201
        },
        {
            "id": "i2k0hxw",
            "score": 6,
            "text": "She would always hang out with our mutual friend (knew him for 10+years, he and I gamed together almost every day), but would freak out if I hung out with female friends alone.\n\nEventually it came to a head, and she told me that she would leave if I didn't \"accept this one double standard\".\n\nWelp, fast forward a bit and she, out of nowhere, doesn't come home one night from work....you guessed it, she went to his place that night, and he was gaming with me when she got there.\n\n\nShe never came home. 4 months later, she finally came and moved out her stuff.\n\nThat was the end of an 11 year relationship",
            "title_similarity": "0.760447",
            "sentiment_compound": -0.4898
        },
        {
            "id": "i2k0jgr",
            "score": 4,
            "text": "Don't talk to your opposite sex friends again or I'm leaving.\n\nTold her not to let the door hit ya on the way out.",
            "title_similarity": "0.5669954",
            "sentiment_compound": 0.4767
        },
        {
            "id": "i2k0uu3",
            "score": 4,
            "text": "At 1.5 years dating (end of high school and 1 year into college at different towns) i was given ultimatum, over text... \"We either get married this year or we are breaking up.\" And I respond i'm not ready yet to get married and this is an unreasonable ultimatum.  She then responds,  \"What, you are breaking up with me?! I'm going to go kill myself. \" (Again, over text). I try to call her,  and no answer.  Didn't hear from her for a week.  I tried to reach her parents,  but they refused to speak to me stating i ruined her life,  etc.... lots of other drama after this event, but no,  we did not get married thankfully.",
            "title_similarity": "0.76943463",
            "sentiment_compound": -0.9348
        },
        {
            "id": "i2k0yi2",
            "score": 3,
            "text": "Me or the cat\n\nI still have the cat...",
            "title_similarity": "0.23827022",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2k112e",
            "score": 3,
            "text": "Any ultimatum is a dealbreaker for me.",
            "title_similarity": "0.24492839",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2k11vc",
            "score": 9,
            "text": "Ex told me he lost all trust in me because I went out to drink with a friend who was in a really bad place and needed someone to listen to him. His reason being \"men and women cannot be friends\". Asked me to install a tracking app on my phone and share all my passwords for him to feel assured that I wasn't doing something wrong. I'm glad that ended.",
            "title_similarity": "0.72194415",
            "sentiment_compound": 0.7968
        },
        {
            "id": "i2k1tc0",
            "score": 3,
            "text": "My ex girlfriend gave me the ultimatum to become a born again Christian or the relationship would be over as it’s frowned upon to date non religious heathens like myself.\n\nI went, i saw and I left. It was really cult like.",
            "title_similarity": "0.69409704",
            "sentiment_compound": 0.6461
        },
        {
            "id": "i2k1txn",
            "score": 5,
            "text": "She never wanted to meet my family. Whatever the reason, I can’t justify it after over a year.\n\nI gave her myself the ultimatum, and we never did it. Never broke up with her.\n\nI finally moved on when I found out she had sex prior to our relationship with her best guy friend (that I’ve also never met).\n\nThis in itself isn’t a big deal to me, but what made it a big deal is that I told her all the people I had sex with and she would look them up and start comparing herself to them and every once in awhile say I wanted them more than her. (Lived in a different state at the time so it isn’t like that would happen).\n\nMade me feel horrible for having past relationships. Yet, she was excused for it.\n\nAnyway, I know this is kind of off-topic from the post. I am better now and found the love of my life. This experience prepared me better :)",
            "title_similarity": "0.76964307",
            "sentiment_compound": 0.9753
        },
        {
            "id": "i2k1xam",
            "score": 2,
            "text": "I couldn’t hang out my female friend with family issues and literally no where else to escape to. Later she’d go over to a classmate’s apartment to “study” during uni and turn her phone off. Pretty sure there was some projection going on there…",
            "title_similarity": "0.66315556",
            "sentiment_compound": 0.802
        },
        {
            "id": "i2k22as",
            "score": 2,
            "text": "My gf said that if I don't go back to school she wouldn't marry me. Been out of college for about 6 months, and didn't get a degree because college was slowly killing me. She's slowly backed down from the ultimatum, but it was very scary when she first threw it up.",
            "title_similarity": "0.79025155",
            "sentiment_compound": -0.8121
        },
        {
            "id": "i2k29xi",
            "score": 2,
            "text": "My ex tried to make me go vegan with her. As well as text her pretty much every hour to let her know what was going on. And I couldn't have friends that were girls without getting in trouble and having to deal with comforting her late into the night. There's more, but it's just not worth listing. We're still pretty good friends, though. She was super toxic, but because of her past and her mental state because of it, she was just a bad girlfriend. She doesn't know what to do. She's a great friend though",
            "title_similarity": "0.7792014",
            "sentiment_compound": 0.9803
        },
        {
            "id": "i2k2np1",
            "score": 6,
            "text": "I was dating a girl who told me she'd be my girlfriend if I paid off her debt.\n\nLike 100k.\n\nNeedless to say I paid for dinner and told her to find her own way home.",
            "title_similarity": "0.6760961",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2k31go",
            "score": 3,
            "text": "I dated someone who said Game of Thrones or him (because he was controlling and very jealous- apparently the few male nude scenes were threatening for him). I laughed in his face and said get the F over yourself.",
            "title_similarity": "0.5373032",
            "sentiment_compound": -0.5709
        },
        {
            "id": "i2k33q2",
            "score": 1,
            "text": "Weirdo",
            "title_similarity": "-0.010951094",
            "sentiment_compound": -0.4215
        },
        {
            "id": "i2k33xh",
            "score": 35,
            "text": "My ex told me that if I ever loved OUR son more than him (he was a baby, like wth) he would kill us both. Haven’t seen that dick head in 17 years and my son doesn’t know he exists.",
            "title_similarity": "0.774551",
            "sentiment_compound": -0.7184
        },
        {
            "id": "i2k3x7x",
            "score": 1,
            "text": "Ultimatum generally means its time to end things, I've found that no matter what you do after the ultimatum, it ends. Good thing you chose your baby",
            "title_similarity": "0.50851095",
            "sentiment_compound": 0.4265
        },
        {
            "id": "i2k4h8h",
            "score": 1,
            "text": "*If the person next to you at a gig is doing drugs then we are over* is still the most ridiculous thing i've ever heard in my life",
            "title_similarity": "0.47004032",
            "sentiment_compound": -0.4201
        },
        {
            "id": "i2k4qi8",
            "score": 3,
            "text": "Not me, but a friend was told to convert religions or it was over. He might have considered it in the future, but he didn't like how he was suddenly presented this ultimatum.\n\nHe declined and they broke up. But the real shitty part is that the mutual friends they had just stopped talking to him. They all apparently sided with his ex which left him with almost no friends.",
            "title_similarity": "0.709247",
            "sentiment_compound": -0.8185
        },
        {
            "id": "i2k4rcv",
            "score": 2,
            "text": "I was told by an ex that if we weren't engaged after 6 months of dating that we'd have to think about what we were doing. She also wanted us to go find a different church because she didn't like the one I WORKED at. This was all said within a month of dating. We didn't make it to two",
            "title_similarity": "0.78826374",
            "sentiment_compound": -0.5216
        },
        {
            "id": "i2k4w3e",
            "score": 3,
            "text": "My ex, when we were going through some shit and I was basically kept in limbo over whether she still wanted to be with me or not, said one of the prime reasons she felt this way was because I was reluctant to buy a house with her. She said she felt bad about our life because all her other friends were buying houses and me not wanting to do it (because we don't make a lot of money, neither of us were content with our current jobs, and didn't even own a car between the two of us for starters) meant I wasn't committed, and I needed to start thinking about it.\n\nI did, I took some time, thought about the finances and looked at some houses in our city, and while I was still stressed about it, I told her I was willing to have that talk if it could save us. In hindsight, horrible idea but I was emotionally a wreck.\n\nThen it turns out, as she told me, she'd been thinking of breaking up for months - largely because she was questioning her sexuality and was pretty sure she was gay. That breakup was quite a whirlwind of emotions.\n\nAnd in case I need to clarify, I was nothing but accepting of her situation despite the fact that it hit me hard. We continued to share the apartment and live cordially til she moved out and still talk/visit occasionally.",
            "title_similarity": "0.7707236",
            "sentiment_compound": -0.4648
        },
        {
            "id": "i2k55n3",
            "score": 4,
            "text": "Had my ex give me an ultimatum of open relationship or breakup. So, did it and had my heart ripped out over and over. Wasn't enough for her, so she decided to keep pushing the boundaries until I couldn't handle it any more. Broke up with her, only for her to invent lies about me and make it impossible to date anyone else for fear of her coming back into my life and ruining my reputation to prospective partners. \n\nIf you're reading this V, fuck you.",
            "title_similarity": "0.7019975",
            "sentiment_compound": -0.8553
        },
        {
            "id": "i2k5lys",
            "score": 1,
            "text": "My ex told me to convert to christianity or it was over. Had the added bonus of her telling me i didn't love her son enough",
            "title_similarity": "0.6787481",
            "sentiment_compound": 0.0341
        },
        {
            "id": "i2k5tvd",
            "score": 3,
            "text": "My ex-girlfriend came home after shopping one evening, plopped a garment bag on the coffee table in front of me and my friends and announced , \"I BOUGHT MY WEDDING DRESS YOU BETTER PROPOSE SOON.\" Yes, I married her. Then divorced her. \n\nBonus Story: I had a longer-term live-in girl who no longer respected the established rules of our relationship. I asked her to move out of my home (where she had been living for free). She refused to leave, demanding I pay her $5,000 cash to vacate. I married her. Just kidding! I laughed in her face, and she ultimately moved out.",
            "title_similarity": "0.71849155",
            "sentiment_compound": 0.9095
        },
        {
            "id": "i2k625u",
            "score": 2,
            "text": "either stop being depressed or we'd break up\n\nlol you can guess how that went",
            "title_similarity": "0.4051473",
            "sentiment_compound": -0.4019
        },
        {
            "id": "i2k6hky",
            "score": 3,
            "text": "My ex told me I was not allowed to get fat or go bald, and when I said that I could only control one of those, she said, “I don’t care.”",
            "title_similarity": "0.6209242",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2k6k87",
            "score": 3,
            "text": "Wife said if I bring tea upstairs to my (home) office she will divorce me\n\nIf I install a dishwasher, but subsequently make her do the dishes, she will divorce me\n\nIf I don't but in her she'll divorce me\n\nThe beauties of arrange marriages folks\n\nFml",
            "title_similarity": "0.7158048",
            "sentiment_compound": 0.6808
        },
        {
            "id": "i2k6ofa",
            "score": 2,
            "text": "I was always talked down to about my friends, I'm sorry my friends can be idiots, but damn I love em and they came before you anyways. We're not together now. Haha.",
            "title_similarity": "0.6037387",
            "sentiment_compound": 0.4552
        },
        {
            "id": "i2k6vys",
            "score": 1,
            "text": "When being confronted she was on the way to an alcohol addiction and being told it had to stop, that \"We will see what will happen if I can't continue drinking\".",
            "title_similarity": "0.47879618",
            "sentiment_compound": -0.4588
        },
        {
            "id": "i2k73o1",
            "score": 2,
            "text": "My ex lied about being pregnant and made me choose between her and my immediate family, who I was living with at the time, she was quickly gone after that",
            "title_similarity": "0.6883443",
            "sentiment_compound": -0.3818
        },
        {
            "id": "i2k73s6",
            "score": 1,
            "text": "A baby. I now have a son.",
            "title_similarity": "0.16311185",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2k7epw",
            "score": 3,
            "text": "Full toxic gf wanted me to cut off my friends so i can spend more time with her and when i told her there is no way i am gonna do that she started telling them lies about me to make them hate me and cut me off. Of course they told me about her stories and i dumped her.",
            "title_similarity": "0.6449168",
            "sentiment_compound": -0.8885
        },
        {
            "id": "i2k7vmu",
            "score": 3,
            "text": "Ironically, she said if I gave her any ultimatums she would leave...",
            "title_similarity": "0.34333378",
            "sentiment_compound": -0.0516
        },
        {
            "id": "i2k8jou",
            "score": 1,
            "text": "A crazy stalker chick once asked me to choose between her and my then fiance. I feel like I don't have to say which one I chose.",
            "title_similarity": "0.58664083",
            "sentiment_compound": 0.0258
        },
        {
            "id": "i2k8k8z",
            "score": 2,
            "text": "I was in high school and LOVED theatre, still do- got a degree in it. My GF gave a fake one where she said \"if you had to choose between dating me and never doing theatre again-\" I guess I answered too quick because she got REAL upset.",
            "title_similarity": "0.57386386",
            "sentiment_compound": -0.0173
        },
        {
            "id": "i2k8sli",
            "score": 1,
            "text": "But your dog is a dog",
            "title_similarity": "0.20306662",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2k8zbt",
            "score": 3,
            "text": "Whoever has\n1. The Vagina\n2. The money\n3. Enough time in the marriage to murder you in a divorce\n\nHas the leverage",
            "title_similarity": "0.4805739",
            "sentiment_compound": -0.6908
        },
        {
            "id": "i2k91et",
            "score": 2,
            "text": "“It’s me or the Supreme brick”, I chose my supreme brick. The supreme brick is a useful tool to get you out of relationships, you just have to clean the stuff up afterwards.",
            "title_similarity": "0.43097126",
            "sentiment_compound": 0.9468
        },
        {
            "id": "i2k9a7w",
            "score": 1,
            "text": "That if I didn't get an abortion, they would leave me. Got the abortion, they left.",
            "title_similarity": "0.5389483",
            "sentiment_compound": -0.0516
        },
        {
            "id": "i2k9d0i",
            "score": 1,
            "text": "Not long after finding out she had been sneaking around texting and video calling her ex for months behind my back (I only found out because my friends fiancé caught her and my friend told my ex to tell me or he would), my ex decided she would give the ultimatum of, if we didn’t have a house and baby by the end of the year we break up. I made it clear that I wasn’t comfortable with this and needed time to regain her trust and the trust in the relationship before committing to a mortgage and a baby. She kicked me out and packed up my things up into boxes, I later reconciled with her, as I always did, and was given the same ultimatum.",
            "title_similarity": "0.78929406",
            "sentiment_compound": 0.959
        },
        {
            "id": "i2k9obv",
            "score": 1,
            "text": "No ultimatums, just want to say good on you for keeping the dog. They aren't disposable commodities.",
            "title_similarity": "0.48887503",
            "sentiment_compound": 0.25
        },
        {
            "id": "i2kaegy",
            "score": 1,
            "text": "The worst? \"If you love me, you'll let me have this!\" Naw. I'm not cool with someone else fucking my girlfriend. That let me know that she was already cheating. Totally zoomed away from that one.",
            "title_similarity": "0.60863596",
            "sentiment_compound": -0.696
        },
        {
            "id": "i2kauzj",
            "score": 1,
            "text": "He told me I had to get over the death of my ex. \nI got over the breathing boy instead.",
            "title_similarity": "0.5695536",
            "sentiment_compound": -0.5994
        },
        {
            "id": "i2kb05w",
            "score": 2,
            "text": "My gf said I’m not allowed to set foot in a gym. She says if I even just happen to see a women in yoga pants I am cheating (I’m also not allowed to go to the beach even tho I lived in Rhode Island for 5 years). I know this is absurd but I was taught what makes a man a real man is his ability to put the wants and needs of others before himself. We have been together 14 years.",
            "title_similarity": "0.81465894",
            "sentiment_compound": 0.1655
        },
        {
            "id": "i2kb7xz",
            "score": 1,
            "text": "Can't get ultimatums if you can't get dates\n\n- taps head",
            "title_similarity": "0.3987496",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2kbdjd",
            "score": 3,
            "text": "She said I had to stop being upset about my dog which had just died, (the one that had grown up with me since I was a baby) Or she would leave me.. So I dumped her.",
            "title_similarity": "0.79290897",
            "sentiment_compound": -0.8905
        },
        {
            "id": "i2kbggh",
            "score": 3,
            "text": "We had been dating for about a year and a half, and the friends referenced in the ultimatum I knew for over 6 years. Her ultimatum was until the time I spent with her was equivalent in quantity to the time I spent with friends over the course of having known them, that I shouldn't be seeing them. This was during undergrad and she lived about 200 miles away from me during the summer. I drove to see her every other weekend and pretty much spent 75% of the money I made on gas to do so. She would rather I sit at home and do nothing or be on the phone with her then see my friends. I think we broke up about a week after.",
            "title_similarity": "0.7682097",
            "sentiment_compound": 0.8658
        },
        {
            "id": "i2kbil3",
            "score": 3,
            "text": "She told me if I wouldn't have sex with her, she'd rape me in my sleep.\n\nNoped the fuck out of there immediately",
            "title_similarity": "0.57495177",
            "sentiment_compound": -0.8481
        },
        {
            "id": "i2kbk36",
            "score": 3,
            "text": "Not quite an ultimatum, but my wife told me a big part of her hesitation to have sex was fear of a surprise pregnancy. She was surprised when I went through with the suggestion of a vasectomy.\n\nThe frequency of sex continued to decline at about the same rate as before the procedure, and she initiated even less.",
            "title_similarity": "0.70925343",
            "sentiment_compound": -0.4497
        },
        {
            "id": "i2kbymu",
            "score": 1,
            "text": "An old tomato, take it or leave it",
            "title_similarity": "0.30736476",
            "sentiment_compound": -0.0516
        },
        {
            "id": "i2kbza3",
            "score": 3,
            "text": "Open our relationship or we break up. We broke up. Best decision I ever made.",
            "title_similarity": "0.5067829",
            "sentiment_compound": 0.34
        },
        {
            "id": "i2kc05t",
            "score": 5,
            "text": "Not exactly an ex, but I was seeing this girls for about a month and it seemed thing were going to get serious. So she made a list of things I had to doin order to get serious, that list included, loosing weight, changing job, changing my car, and a few pther small thing I cant remember.\n\nWe stopped speaking, untill a couple weeks later when I was on the road with my family, driving, and she called me up to say she was pregnant and hang up, I yad 5 more hours to drive, as soon as I got to my destination I called her again and she said it was all just a joke to get my attention because she wanted to see me..\n\nSafe to say I dodged a bullet there.",
            "title_similarity": "0.70389843",
            "sentiment_compound": 0.775
        },
        {
            "id": "i2kc9js",
            "score": 2,
            "text": "Please don’t feed your dog bacon, find some healthier treats!",
            "title_similarity": "0.64939857",
            "sentiment_compound": 0.3802
        },
        {
            "id": "i2kca5g",
            "score": 2,
            "text": "My ex told me that if I didn't vote in election season, both local and federal, that we would have to break up. 3 years later I was able to vote (just hit 18) but forgot to register cause life got in the way, On the day that some governor she didn't like was elected for our state she dumped me.",
            "title_similarity": "0.7866118",
            "sentiment_compound": -0.7364
        },
        {
            "id": "i2kcbv7",
            "score": 3,
            "text": "An ex (f) told me (m) if she couldn’t do anal play on me then it would be over. I had never done it before and it hasn’t ever interested me but I was head over heals for her so I said yes. Sometimes was good, sometimes not good. In the end I told her to stop when she whipped out some big dildo. Aaannndd never really done it again.",
            "title_similarity": "0.76670384",
            "sentiment_compound": 0.6637
        },
        {
            "id": "i2kceha",
            "score": 1,
            "text": "Ex-wife said I either give her permission to fuck my roommate or she would do it anyways.",
            "title_similarity": "0.60608125",
            "sentiment_compound": -0.5423
        },
        {
            "id": "i2kchmv",
            "score": 1,
            "text": "“I want a ring or we’re done.”\n\nWe were done. 2 weeks later she’s engaged.\n\n4 weeks after that she’s dead (aneurysm).",
            "title_similarity": "0.6687057",
            "sentiment_compound": -0.3182
        },
        {
            "id": "i2kcjyl",
            "score": 2,
            "text": "Ultimatimatums are such a red flag, the Chinese would be proud.",
            "title_similarity": "0.21230897",
            "sentiment_compound": 0.4767
        },
        {
            "id": "i2kclnp",
            "score": 2,
            "text": "My parents ended up with their dog after a guy got that ultimatum and made the wrong choice because this dog is the sweetest fella in the world. I tell them I wish their dig was female so that I could say the guy chose the wrong bitch.",
            "title_similarity": "0.76078665",
            "sentiment_compound": -0.8074
        },
        {
            "id": "i2kcrqm",
            "score": 2,
            "text": "I make it aware to any women I start to see that my pup is my ride or die. They were here first. \n\nLuckily, I've never been given an ultimatum before.",
            "title_similarity": "0.5329227",
            "sentiment_compound": -0.1531
        },
        {
            "id": "i2kcw95",
            "score": 1,
            "text": "Made the right choice OP.",
            "title_similarity": "-0.09732792",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2kd4zh",
            "score": 1,
            "text": "You made the right choice give that dog some kisses for me!",
            "title_similarity": "0.29441226",
            "sentiment_compound": 0.5562
        },
        {
            "id": "i2kdj1s",
            "score": 1,
            "text": "\"You're not allowed to fuck Catherine again\" - fucking bitch",
            "title_similarity": "0.44993216",
            "sentiment_compound": -0.3056
        },
        {
            "id": "i2kdjvp",
            "score": 2,
            "text": "If my business fails, we are getting divorced.\n\nTurned out to be a massive franchise scam that I’ve been dealing with for years.\n\nAnd yea, we’re getting divorced.\n\nShe also threatened to abort my kids on a few occasions.",
            "title_similarity": "0.7138035",
            "sentiment_compound": -0.8591
        },
        {
            "id": "i2kdpwm",
            "score": 1,
            "text": "It's me or the dog.\n\nIt's me or (best friend).\n\nUnfortunately for both occasions, I got stuck with both.",
            "title_similarity": "0.5968118",
            "sentiment_compound": 0.6124
        },
        {
            "id": "i2kdskf",
            "score": 1,
            "text": "Hey boss be careful with the bacon. Too much pork can cause pancreatitis in dogs. Just wanted to let you know since you two have a great relationship and I want that to last as long as possible!",
            "title_similarity": "0.6359631",
            "sentiment_compound": 0.7424
        },
        {
            "id": "i2kdulh",
            "score": 1,
            "text": "I mean, that's understandable. Dogs are living creatures and require space. So is an additional human. That said, if there wasn't space, she probably shouldn't have moved in to begin with.",
            "title_similarity": "0.4937895",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2ke152",
            "score": 2,
            "text": "“Stop spending so much time at the gym or I am leaving” \n\nLike bruh😂 if you are not helping me becoming the best version of myself then “there’s the door”",
            "title_similarity": "0.58750486",
            "sentiment_compound": 0.8277
        },
        {
            "id": "i2ke1hn",
            "score": 1,
            "text": "I was a fool and it was 1st major relationship but I had to be \"ok\" with a lot of things that were basically her being overly intimate, by mine and probably most people's standards,  with her friends. But the ultimatum that broke the camel's back was the one I told her 2 yrs into us dating. After 2 yrs of us dating and her talking about marriage about 4 times a week for that 2yr I told her we would be together work on problems together and get married someday or we won't.  We dated for about another 2 1/2 yr and she broke up with me to be with a cross-dressing friend she. Also, the ultimatum did get her to shut up about marriage after asking nicely didn't, although then it became more about what kind of kids we would have & etc.",
            "title_similarity": "0.758376",
            "sentiment_compound": 0.1027
        },
        {
            "id": "i2ke84a",
            "score": 3,
            "text": "[deleted]",
            "title_similarity": "0.08695335"
        },
        {
            "id": "i2keb3v",
            "score": 1,
            "text": "\"It's either me or the weed\"\n\nByeeeeeeeee",
            "title_similarity": "0.20837396",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2kee6j",
            "score": 1,
            "text": "She is a dog.",
            "title_similarity": "0.15891837",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2kegjk",
            "score": 1,
            "text": "Other than moving, and this one below, they never came up. I guess so many of exes knew what they had wasn't worth an ultimatum.\n\nI had to quit smoking to be with one. I said no, it's my only bad habit, they stayed anyhow. Broke it off a few years later because a high school crush asked her out. That lasted about a month lol",
            "title_similarity": "0.78752357",
            "sentiment_compound": -0.6971
        },
        {
            "id": "i2kehl0",
            "score": 3,
            "text": "Fiancé said “have a duel bachelor party with my bachelorette party or you don’t get a bachelor party.” I was so embarrassed that I lied to my friends and said I was busy traveling/working etc on an any weekend they suggested. They never knew the real reason.",
            "title_similarity": "0.6962288",
            "sentiment_compound": 0.3937
        },
        {
            "id": "i2keo4p",
            "score": 1,
            "text": "It was either her or the bog",
            "title_similarity": "0.08874791",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2ket0l",
            "score": 3,
            "text": "My ex said I either had to spend every day with her or we were over... I'm in high school with a bunch of extra curricular activities and a few close friends I want to spend time with as well",
            "title_similarity": "0.56177986",
            "sentiment_compound": 0.6705
        },
        {
            "id": "i2keubh",
            "score": 3,
            "text": "Propose to me now or lose me forever. \n\nI proposed. Ten years of an abusive marriage later and I’m finally rebuilding my life. Getting divorced next month.",
            "title_similarity": "0.6775971",
            "sentiment_compound": -0.7845
        },
        {
            "id": "i2kf2sh",
            "score": 2,
            "text": "She told me I was too nice and too forgiving… Had a talk about it for hours. I still don’t know how that makes any sense but we didn’t last long.",
            "title_similarity": "0.5192137",
            "sentiment_compound": 0.2263
        },
        {
            "id": "i2kf2x0",
            "score": 1,
            "text": "Give me the tv or I’m taking you to court for child support, custody of the kids",
            "title_similarity": "0.4304803",
            "sentiment_compound": 0.4019
        },
        {
            "id": "i2kf51w",
            "score": 2,
            "text": ">My ex won’t talk to me anymore, my dog and I are cuddling.\n\n[i bet OP looks like this](https://essereuomo.it/wp-content/uploads/2021/10/dsdsds-888x1024.jpg)",
            "title_similarity": "0.7530684",
            "sentiment_compound": 0.3612
        },
        {
            "id": "i2kf85c",
            "score": 5,
            "text": "If I leave her she'll \"fake injuries and call the police\". I got out of there ASAP.",
            "title_similarity": "0.43904233",
            "sentiment_compound": -0.5106
        },
        {
            "id": "i2kf93z",
            "score": 3,
            "text": "No more dungeons and dragons or we’re done I even offered to teach her how to play and that she could come with she just didn’t like it",
            "title_similarity": "0.6369031",
            "sentiment_compound": 0.4019
        },
        {
            "id": "i2kfjme",
            "score": 2,
            "text": "My ex told me if I didn't get pregnant immediately he'd divorce me - I got pregnant (twice) and we divorced anyway.",
            "title_similarity": "0.7109682",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2kfnb8",
            "score": 3,
            "text": "She told me to swear that I'll never go fishing. She's vegan. The next day she was much less emotional about fishing",
            "title_similarity": "0.6897311",
            "sentiment_compound": 0.0276
        },
        {
            "id": "i2kfvwr",
            "score": 1,
            "text": "While we were just fwb, she said we had to get together or we couldn’t be friends anymore.",
            "title_similarity": "0.49912778",
            "sentiment_compound": 0.765
        },
        {
            "id": "i2kfy3j",
            "score": 3,
            "text": "You better have a job and have visited the dermatologist by the time I get back from my grandmas (Christmas) or I’m done with you ! \n\nBitch who doesn’t have a job. Just wants my money. Not my GF and not my problem anymore.",
            "title_similarity": "0.73558533",
            "sentiment_compound": 0.1655
        },
        {
            "id": "i2kg15u",
            "score": 2,
            "text": "Just a heads up from an ol dude...\n\n&#x200B;\n\nReal SO's don't give \"ultimatums\", they share feelings and help come up with compromises.\n\n&#x200B;\n\ndamn that sounds cheesey reading it...",
            "title_similarity": "0.38385612",
            "sentiment_compound": 0.296
        },
        {
            "id": "i2kg9b9",
            "score": 3,
            "text": "My wife made me choose between our 4 kids or my oldest daughter from a previous relationship.",
            "title_similarity": "0.5705551",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2kgb5t",
            "score": 3,
            "text": " My fiancé, after watching me go through months of processing, told me AFTER I got hired she wouldn’t move to NY so I could join the NYPD.",
            "title_similarity": "0.74384856",
            "sentiment_compound": 0.3535
        },
        {
            "id": "i2kgbg4",
            "score": 1,
            "text": "Well the dog isn't asking you to remove the partner, pretty obvious who is in the wrong",
            "title_similarity": "0.4813459",
            "sentiment_compound": 0.296
        },
        {
            "id": "i2kgbvw",
            "score": 2,
            "text": "That was an easy choice. Keep the furbaby and drop the girlfriend. If she can't see your dog as your baby, then she needs a reality check. Hence why she is your ex now",
            "title_similarity": "0.72710633",
            "sentiment_compound": 0.2023
        },
        {
            "id": "i2kgduk",
            "score": 3,
            "text": "I had an ex tell me to pay off over $50,000 in my student loans within 2 years or we were done. Definitely glad to be out of that relationship",
            "title_similarity": "0.64732605",
            "sentiment_compound": 0.6486
        },
        {
            "id": "i2kggoh",
            "score": 1,
            "text": "Stop drinking. We broke up and I went 4 month binge, am still not sober, two days currently, might go a week tops. Don't expect an alcoholic to stop because you threaten them, they'll either hide it or not",
            "title_similarity": "0.724998",
            "sentiment_compound": -0.7351
        },
        {
            "id": "i2kgi1p",
            "score": 4,
            "text": "my ex said if I visited my friend studying abroad in Berlin for my 21st birthday, he would throw all of my belongings out our window and not let me back into my apartment after. He broke up with me on my birthday even after I wasted my $1600 plane ticket to Germany.\n\nedit: just realized i’m in the ask men subreddit sorry y’all",
            "title_similarity": "0.75974756",
            "sentiment_compound": -0.4767
        },
        {
            "id": "i2kglj7",
            "score": 3,
            "text": "Wife said I will never buy a bike. So I bought one. \nShe took my CC on a spending spree... She melted a card.",
            "title_similarity": "0.71884215",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2kh1xl",
            "score": 3,
            "text": "My ex told me I needed to decide on how I felt about the current state of our relationship or we'd break up, as feeling our relationship was in a currently unsustainable state meant I wasn't committed to trying to fix it.",
            "title_similarity": "0.5854472",
            "sentiment_compound": -0.0808
        },
        {
            "id": "i2khccg",
            "score": 3,
            "text": "One time I left during an argument to cool down and he told me if I left like that again it would be over. So silly old me tried my best from then on to stay and work it out during fights. The catch? He took it as the opportunity to walk out the door and kick me out of OUR apartment again and again. SILLY ME",
            "title_similarity": "0.6909001",
            "sentiment_compound": 0.837
        },
        {
            "id": "i2khkle",
            "score": 1,
            "text": "That I had to stop being manipulative and abusive. It's kinda hard to argue your case when being mad is abuse and being nice is manipulation ¯\\\\_(ツ)_/¯",
            "title_similarity": "0.40759078",
            "sentiment_compound": -0.9376
        },
        {
            "id": "i2khmdl",
            "score": 1,
            "text": "I’m the ex (f) . I told my ex to have the dogs off the bed during sexy time due to poo smell and they would bite me. I said train his dogs and take care of his dogs health and he said no…most disgusting chapter of my life …",
            "title_similarity": "0.8085289",
            "sentiment_compound": 0.4939
        },
        {
            "id": "i2khyny",
            "score": 1,
            "text": "Woman here. Asked my husband. He said \"you told me that if I kept making that chicken noise and dance at you, you were leaving. I didn't stop though I just save it for special occasions\". The proceeded to do the dance and noises that make me so angry.",
            "title_similarity": "0.70397645",
            "sentiment_compound": 0.3709
        },
        {
            "id": "i2khz5x",
            "score": 1,
            "text": "That's an EZ ex, no one threatens pupper. Also, if you love your dog please don't feed her that kind of food, it is horrible for her.",
            "title_similarity": "0.72777873",
            "sentiment_compound": 0.7365
        },
        {
            "id": "i2ki27j",
            "score": 1,
            "text": "My ex said that if I didn't let her imtimately touch me she would break up... we broke up the next morning",
            "title_similarity": "0.70655996",
            "sentiment_compound": -0.4215
        },
        {
            "id": "i2ki4xn",
            "score": 8,
            "text": "My ex burned my arm with hot oil by accident, plus in the ER my wonderful dad decided it was the best moment to tell me he was divorcing my mom. When I got home she bought me a wallet as an apology, and got pissed because I didn't \"appreciate\" it enough or comfort her, and made it about her, trying to make me sleep on the couch and hint at a breakup, I was in shock and had a really shit day so that just broke me and I started crying right there, think is the only time I've ever done that. Thankfully that snapped her out of it and we made up, but looking back it was a really shit move huh.",
            "title_similarity": "0.76847076",
            "sentiment_compound": -0.8819
        },
        {
            "id": "i2ki4zh",
            "score": 1,
            "text": "To hell with all that. You made the right choice keeping the dog",
            "title_similarity": "0.28579143",
            "sentiment_compound": -0.6808
        },
        {
            "id": "i2kihjn",
            "score": 1,
            "text": "Mine told me to stop talking to some of my best friends because I talked to them too much... A few days later we broke up.",
            "title_similarity": "0.7055833",
            "sentiment_compound": 0.5106
        },
        {
            "id": "i2kihzy",
            "score": 3,
            "text": "I wanted a divorce but he told me if I left I would never see my daughter again… because he would « make sure the courts know I’m a junkie ». I asked how since I’m not a junkie and he said « you will be ». This was a scary guy. He changed after we got married and I found out a lot i didn’t know about him and I wouldn’t have put it past him to shoot me up against my will or something, or disappear with my daughter. \n\nBut I got the divorce and none of that happened. It was all talk or he chickened out. We split custody tho and everything has been fine for 14 years. I just hate that piece of shit is in our lives but he is good to her. As good as someone like him can be.",
            "title_similarity": "0.75819385",
            "sentiment_compound": -0.6808
        },
        {
            "id": "i2kilb0",
            "score": 2,
            "text": "\"You can't leave me unless you leave me with a baby.\"\n\nHELL NO.",
            "title_similarity": "0.37429577",
            "sentiment_compound": -0.7495
        },
        {
            "id": "i2kioom",
            "score": 3,
            "text": "Not a partner. But, on a first date, a girl told me that if we got serious I would have to shave my chest. I paid and left.",
            "title_similarity": "0.7247697",
            "sentiment_compound": -0.1154
        },
        {
            "id": "i2kip0s",
            "score": 4,
            "text": "I had a girl back in the day tell me that if I wanted to date her I had to tell all my female friends to fuck off because she thought it was inappropriate to be in a relationship and have friends of the opposite sex. \n\nI told her to fuck off instead.",
            "title_similarity": "0.6499156",
            "sentiment_compound": -0.2023
        },
        {
            "id": "i2kit9x",
            "score": 4,
            "text": "\"Get rid of the baby or I walk out the door and you'll never see me again.\"\n\nI opened the door and showed him the way out. \n\nHe came back, we had the baby and we lasted another 6 years before I finally opened the door for the last time. \n\nHe loves his kid very much.",
            "title_similarity": "0.72881836",
            "sentiment_compound": 0.5719
        },
        {
            "id": "i2kiv9z",
            "score": 2,
            "text": "Me and an ex were in an argument, I was gonna crash at my place so we could talk calmly she said, that if I don't stay there (with her) we're done... FOR GOOD. I looked at her and said fine if thats what you want. I happily in another relationship",
            "title_similarity": "0.6457458",
            "sentiment_compound": 0.7531
        },
        {
            "id": "i2kjhx9",
            "score": 9,
            "text": "Buy her a house before I buy myself a car. We were in our late teens and nowhere even near marriage and she already had the next ten years planned.",
            "title_similarity": "0.6441898",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2kjkta",
            "score": 1,
            "text": "You should not be feeding your dog that...",
            "title_similarity": "0.43976796",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2kjyer",
            "score": 4,
            "text": "Me n my friend hang out every weekend, have a few beers, play some Mario kart or mortal Kombat, maybe watch a tv show where both into. \nWell she didn’t like that- even though she had a open invitation and I asked her every time- nope. I was spending too much time with him and not her, she said “ if you love me you’ll stop spending the evening over at Jakes house “ \n\nHere I am 6 years later and we still hang out every weekend, even if it’s just having dinner with the families. \nI think I picked the better choice lol",
            "title_similarity": "0.74751496",
            "sentiment_compound": 0.9509
        },
        {
            "id": "i2kkf2e",
            "score": 8,
            "text": "My ex said I had to skip my sisters college graduation to pick her up at the airport or we were over. I offered to buy her an Uber from the airport and she acted insulted somehow. Then I said “well I guess we’re over”",
            "title_similarity": "0.71376073",
            "sentiment_compound": -0.5106
        },
        {
            "id": "i2kl5xt",
            "score": 1,
            "text": "I got told to go to therapy. I'm still a phsyco fuck I guess.",
            "title_similarity": "0.42819571",
            "sentiment_compound": -0.5423
        },
        {
            "id": "i2kl7er",
            "score": 1,
            "text": "Well, it was either time with her, or video games. \n\nI don't have girlfriend anymore. Got a lot time and video games though.",
            "title_similarity": "0.4857173",
            "sentiment_compound": 0.2732
        },
        {
            "id": "i2klhg2",
            "score": 1,
            "text": "My partner refused to fly economy for our yearly overseas vacation. Being a penny pinching frugal type, this was a hard pill to swallow. It’s such a waste of money.  We didn’t fly economy and it was actually very nice. Still a complete waste.",
            "title_similarity": "0.7538465",
            "sentiment_compound": -0.6258
        },
        {
            "id": "i2kljfd",
            "score": 1,
            "text": "when she said \"I do\"",
            "title_similarity": "-0.0744873",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2klu4r",
            "score": 1,
            "text": "If you don't have sex with me were breaking up, if you don't come to XYZ with me we are breaking up, just petty nonsense",
            "title_similarity": "0.5695075",
            "sentiment_compound": -0.5423
        },
        {
            "id": "i2klw7q",
            "score": 4,
            "text": "This is going to be a weird one.\n\nI matched a girl from Tinder and we were planning to meet up when she says: \"I want you to meet my family\".\n\nI was pretty baffled, I asked her why and she told me that I seemed like a nice guy and she wanted me to meet her family as her boyfriend.\n\nI asked why against and she basically deteriorated, spoke a lot of stuff that is boiled down to \"you need to\", sent me half a dozen nudes \"by mistake\" and essentially became unhinged.\n\nOf course, all of that happened within around an hour of our first message, I never noped out faster.",
            "title_similarity": "0.7797659",
            "sentiment_compound": 0.6908
        },
        {
            "id": "i2km11u",
            "score": 1,
            "text": "Oh, you like hanging out with friends and family but I (ex) cannot go five minutes without throwing a holy bitch fit that I’m not center of attention? Well now buddy, it’s me or your friends and family?! \n\nDodged the bullet.",
            "title_similarity": "0.67259777",
            "sentiment_compound": 0.8075
        },
        {
            "id": "i2kmxcf",
            "score": 1,
            "text": "To get rid of my dog and two cats or get out.  \nWe are no longer together.",
            "title_similarity": "0.56414783",
            "sentiment_compound": -0.296
        },
        {
            "id": "i2knbbu",
            "score": 2,
            "text": "Quit smoking weed or I will break up with you. I’m still gassed to this day and now she even smokes weed too (on her own). Ironic.",
            "title_similarity": "0.633964",
            "sentiment_compound": -0.128
        },
        {
            "id": "i2knehh",
            "score": 3,
            "text": "We had been struggling with our marriage. I was never, ever controlling but one night she wanted to go out with some friends from work (all male). I politely asked her to stay in, watch a movie and go to sleep with me. Thinking this would be quality time for us and I worked at 430am the next day. \n\nShe bartered having sex with me. We had already been having issues with our sex life (not having enough sex). She said she was going to go out regardless of what I asked, but that we would have sex before she left and when she got home. \n\nSo, no sex for months, but now to get what she wanted we could magically have sex. Obviously sex isn’t everything, but it was a focal point of both of our issues.",
            "title_similarity": "0.74733764",
            "sentiment_compound": 0.1154
        },
        {
            "id": "i2knj5g",
            "score": 1,
            "text": "He told me I had to be in charge of all housework because I was \"better at it\" (yes, I'm a woman). His stuff was packed up the next day.",
            "title_similarity": "0.531218",
            "sentiment_compound": 0.6808
        },
        {
            "id": "i2knqno",
            "score": 2,
            "text": "My wife. Feed me or I'm leaving. This is three times a day. Still together 12 years later. Does that count?  I'm not sure not but I think she is serious. We joke about it all the time....then I feed her.",
            "title_similarity": "0.7269075",
            "sentiment_compound": 0.2189
        },
        {
            "id": "i2knyaq",
            "score": 5,
            "text": "Funny. Any ex that gave me an ultimatum wound up being my ex shortly thereafter.\n\nThe woman that's never given me one? But endlessly worked on equal compromises with me? We had our 16 year anniversary Saturday past.",
            "title_similarity": "0.7584593",
            "sentiment_compound": 0.3204
        },
        {
            "id": "i2knyqh",
            "score": 1,
            "text": "My ex, throughout the entirety of our 1.5 year relationship tried turning me Vegan. When the relationship was clearly at and end she demanded I become vegan or we were done. I chose the later.",
            "title_similarity": "0.7918843",
            "sentiment_compound": 0.2023
        },
        {
            "id": "i2kobex",
            "score": 2,
            "text": "Weed or him.... when he knew I smoked weed before dating him.And I do not even smoke often and never smoked around him or even be high around him. when i picked weed, he was quick to back pedal on it.",
            "title_similarity": "0.6561365",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2kodix",
            "score": 1,
            "text": "You chose wisely, my friend",
            "title_similarity": "0.033982884",
            "sentiment_compound": 0.7184
        },
        {
            "id": "i2kofts",
            "score": 1,
            "text": "My ex said that if I don’t quit smoking we’re going to break up I tried but I couldn’t make it work",
            "title_similarity": "0.6680564",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2konke",
            "score": 1,
            "text": "Not while, but right after. I dumped him. Maybe a week later, he told me he’d kill himself if I didn’t date him.",
            "title_similarity": "0.68941474",
            "sentiment_compound": -0.9022
        },
        {
            "id": "i2kov3w",
            "score": 1,
            "text": "Woah woah woah woah….woah……..woah……..\n\n\nWoah.     \n\nYou have a dog? Jk. No, your ex is still living with you and demanding you get rid of your dog?",
            "title_similarity": "0.7303172",
            "sentiment_compound": -0.3094
        },
        {
            "id": "i2kp1ke",
            "score": 1,
            "text": "I liked a girl who was very likely a lesbian with gender dysphoria. Her friend, we can call her Flabby, told me that she would only end up with me if I cut off my dick and let her fuck me up the ass. Of course i thought that was a crazy thing for someone to say but this girl, we can call her schmemily, went the rest of her life telling me i should take it up the ass and that i didnt know how to use my dick and that my dick wasnt pleasurable, etc. Yet, we would have great sex. It broke my mind and tbh its likely Flabby was taking advantage of a weird situation but i had to accept schmemily and flabby were having fun at everyone's expense.",
            "title_similarity": "0.6468574",
            "sentiment_compound": -0.8824
        },
        {
            "id": "i2kpc2q",
            "score": 1,
            "text": "My abusive ex was drunk (possibly high too, who knows) and told me if I wouldn’t have sex with him he was going to take it.",
            "title_similarity": "0.547566",
            "sentiment_compound": -0.765
        },
        {
            "id": "i2kq08i",
            "score": 3,
            "text": "Ex told me all metal, even Christian metal is satanic. She told me Its her or the music.\n\nQueue BFG Division..",
            "title_similarity": "0.5162796",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2kq55n",
            "score": 3,
            "text": "Well, we were in different places when we met. I wanted the relationship but wasn't quite ready while she was ready and willing. \n\nI was given 3 conditions for things to work out: move out from living with family, get rid of my cat, and make myself available for at least a couple times a week to meet up with her.\n\nI couldn't leave, didn't have the money to do so, and even if I did have the money, I was taking care of my grandmother who had early-mid stages of dementia and really should have been in assisted living. My cat was, at the time 15 years old and I'd had her since she was a kitten. I've had her longer than any other pet, she'll be 18 this year. Then this woman and I lived, on paper, a solid 58 minutes apart. However the population density and rush hour traffic is very different. The \"halfway\" point was her driving 3/4ths of the way and my struggling through rush hour traffic to go 1/2 of the way. It had to be that time because she was a school teacher and goes to bed at 8pm. I got off work at 5pm.\n\nA couple weeks ago I got curious after the last couple years when I ended things. She got married back in November to a guy that kinda looks like me and they look very happy.",
            "title_similarity": "0.778672",
            "sentiment_compound": 0.9413
        },
        {
            "id": "i2kqa3v",
            "score": 2,
            "text": "\"Start giving me blowjobs during sex or this isnt going to work out.\" After about 7 months of dating.\n\nLiterally explained to him on the first date that I dont do blowjobs.",
            "title_similarity": "0.73142236",
            "sentiment_compound": 0.34
        },
        {
            "id": "i2kqf8m",
            "score": 3,
            "text": "Kick my brother out or she'd leave.  My brother suffers from severe depression and anxiety to the point that he was officially disabled at the time.  The deal that I had with him before she was in the picture was that he doesn't have to worry about bills, he'll have a roof over his head and food to eat as long as he's getting help, meaning seeing his therapist and psychologist and taking his meds.  Well 5 years later she thought it was taking too long and he needs some tough love.  Ummm no bitch I'm not making my traumatized younger brother homeless, I love you too, but you can fucking kick rocks.",
            "title_similarity": "0.8053082",
            "sentiment_compound": 0.6209
        },
        {
            "id": "i2kqvuq",
            "score": 1,
            "text": "It seems that most come from women",
            "title_similarity": "0.0653559",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2kr4ty",
            "score": 1,
            "text": "Was cuddling with my ex as she suddenly bit my underarm. At first I let her, you know, just a love nibble, but then she keeps adding pressure until it started to hurt. Told her stop it hurts, she bites even harder into my arm, I beg her to stop because she is hurting me, didn't stop until i yank my arm out of her mouth.\n\n\nIt already happened once before, back then I was really upset and set a boundary that when I tell her to stop she has to stop.\n\n\nShe crossed a line, I walked out the room and went to bed in another room, I just wanted some alone time to cool off, because of how angry I was at her. \n\n\nShe followed me and kept bugging me to talk to her and gave me an ultimatum. If I don't talk to her now before she leaves the room, the relationship is over. \n\n\nI was angry and just wanted some alone time, after a while she left. And after I cooled off and cleared my mind I walked back and apologized, begging to give me another chance.",
            "title_similarity": "0.70269144",
            "sentiment_compound": -0.985
        },
        {
            "id": "i2kr7jk",
            "score": 1,
            "text": "She demanded we relocate from Gresham to Beaverton because it was a \"nicer area\". \nI found a job in Beaverton and quit my job of 5 yrs in Gresham.\nI gave up my two story, two bedroom townhouse that cost $575/mo RENT CONTROLLED LEASE.  (As in if I stayed on long term lease, at no point could my rent be raised. Not even at lease renewal.) In a very safe location. Where neighbors knew each other and looked out for one another. \nFor a 1 bedroom apartment that cost $720/mo.  \n\nAfter living there six months I come home to find someone broke in and took everything. 3 surround sound systems, 2 tvs, x-box, GameCube, PS2, laptop, my clothes, the furniture..   Everything I had ever owned.. gone. The only thing that was left was a king size bed, off it's frame. The heavy couch that folded out into a bed. (With the bed half out and mangled. As if they got it stuck, fought with it and gave up). And 1 ONE of my 4 snow tires for my car. Was left in the kitchen sink. \n\nThen she left me for my best friends dad.",
            "title_similarity": "0.7818039",
            "sentiment_compound": 0.6361
        },
        {
            "id": "i2kr9o0",
            "score": 1,
            "text": "either we are girlfriend and boyfriend, get married, & have a baby.... or never talk to me again. after 2 years, I left & we stopped talking on a good note.",
            "title_similarity": "0.7373538",
            "sentiment_compound": 0.25
        },
        {
            "id": "i2krdrr",
            "score": 1,
            "text": "# Welcome to the selfish insecure bad female ex thread",
            "title_similarity": "0.43587083",
            "sentiment_compound": -0.7506
        },
        {
            "id": "i2kricg",
            "score": 1,
            "text": "Hasn't happened to me but has happened to a former friend. He met some girl online that lived across the country. After like a month of talking online, he went to visit her for a few weeks. When he came back he told me that she gave him an ultimatum... ***either move to her town or they break up.*** The thing is, he was still halfway through college here at home. He made the decision to move away to her town. He literally dropped out of college to move across the country to be with her. I had loaned him $500 for a one way plane ticket to fly there. They've since got married and have kids but I thought that was a weak move at the time. She definitely wore/wears the pants in that relationship, calling all the shots. After he moved away he distanced himself from our entire friend group. We went from being pretty much best friends to complete strangers because of that move/his girlfriend lol. Haven't talked to him in a few years.",
            "title_similarity": "0.73706007",
            "sentiment_compound": 0.9855
        },
        {
            "id": "i2krng9",
            "score": 1,
            "text": "My ex, whom I had just recently got engaged to, told me that if we were going to get married we could not buy the house that we were living in, which I had been planning to buy for a few years. Before I even met her. We had talked about it, and she was ok with us buying it, until she decided she wasn't. It wasn't good enough for her. Clearly she wasn't good enough for me.\n\nEdit: typoe\nEdit: typoed typo",
            "title_similarity": "0.77457607",
            "sentiment_compound": 0.7379
        },
        {
            "id": "i2krog3",
            "score": 1,
            "text": "Stop asking questions.",
            "title_similarity": "0.1317189",
            "sentiment_compound": -0.296
        },
        {
            "id": "i2krpf9",
            "score": 1,
            "text": "Purchasing my first home:  \"I need to be on the deed or we're done.\"\n\nGirl, bye.  You ain't paying my mortgage, my down payment, or helped me pay rent.  Tf you thinking you get to co-own my house?",
            "title_similarity": "0.69292337",
            "sentiment_compound": -0.1027
        },
        {
            "id": "i2krwbq",
            "score": 1,
            "text": "She gave me an ultimatum to make a decision about the relationship on the spot. I don't like ultimatums so I left on the spot",
            "title_similarity": "0.53747886",
            "sentiment_compound": -0.2755
        },
        {
            "id": "i2krxab",
            "score": 1,
            "text": "My exfiance stated if I don't give him kids within two years yrs then he would leave me. So I left him within same week he gave me the ultimatum. He was furious because he thought I was scared to loose him. 🙄 He also kept postponing the wedding and making odd excuses.",
            "title_similarity": "0.776615",
            "sentiment_compound": -0.8979
        },
        {
            "id": "i2ks2k8",
            "score": 1,
            "text": "One partner: become muslim        \nOther partner: become Mormon \n\nLol no fuck that",
            "title_similarity": "0.4451969",
            "sentiment_compound": 0.6858
        },
        {
            "id": "i2ks2ol",
            "score": 1,
            "text": "That if we weren't \"trying\" to have kids by her 30th bday she would leave.\n\nThis, just as I'd had about a year of therapy and had begun to dig into things like letting myself get coerced into people pleasing and kind of lost decades of my own development and agency along the way. This, an ultimatum, just as I was trying to learn more about healthy boundaries, assertive communication, healthy negotiation.\n\nI felt like, to begin an ultimatum at that time and to give in, would also as a side effect set a precedent. That the next time our wants differed, it would just be an ultimatum again. And on top of it, I'd still be scrambling to people please rather than learning better boundaries and coping skills, and I'd be without those healthier skills trying to raise one or more kids who'd likely get caught up in some undeserved side effects of those messes instead of observing and having healthy patterns passed down.\n\nSo I saw her ultimatum and let her go ahead and peace out.",
            "title_similarity": "0.7034887",
            "sentiment_compound": 0.9637
        },
        {
            "id": "i2kscvl",
            "score": 1,
            "text": "My ex's sister announced that she was pregnant.  My ex said that it was unfair that her sister got pregnant before my ex did.  My ex said if she wasn't pregnant in less than a year that we would no longer be together.  I told her that I would save us some time, and I broke up with her on the spot.",
            "title_similarity": "0.7353708",
            "sentiment_compound": -0.5994
        },
        {
            "id": "i2ksemf",
            "score": 1,
            "text": "Had a girlfriend tell me she wanted to go on a break and only get back together if I slept with 5 different people beforehand. Apparently that was supposed to help her trust issues and insecurity. Didn't do it because I don't want to just sleep with random people.",
            "title_similarity": "0.66110575",
            "sentiment_compound": 0.4548
        },
        {
            "id": "i2ksg9b",
            "score": 1,
            "text": "Ultimatum=deal breaker",
            "title_similarity": "0.1716086",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2ksm26",
            "score": 1,
            "text": "You kept the right bitch",
            "title_similarity": "0.10134447",
            "sentiment_compound": -0.5859
        },
        {
            "id": "i2ksr5l",
            "score": 1,
            "text": "\"I need your passwords to Facebook, Instagram, Twitter, everything...\"",
            "title_similarity": "0.2956337",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2ksr73",
            "score": 1,
            "text": "If you leave me I'll kill myself",
            "title_similarity": "0.35170203",
            "sentiment_compound": -0.7096
        },
        {
            "id": "i2ksxsx",
            "score": 1,
            "text": "The one who makes me choose is the one who's going to lose.\n\nFuck ultimatums and the people who use them",
            "title_similarity": "0.42351526",
            "sentiment_compound": -0.7351
        },
        {
            "id": "i2kt3sh",
            "score": 1,
            "text": "Move in together or it's over. I tried, 5 year relationship over after 4 months of living together. I told her I needed more space than a two bedroom condo but she did not listen.",
            "title_similarity": "0.69663703",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2kthcz",
            "score": 1,
            "text": "I don't take ultimatums from anyone. I never have and never will. If they are giving ultimatums they are not for me, instead try to communicate to come to a compromise.",
            "title_similarity": "0.45757866",
            "sentiment_compound": 0.34
        },
        {
            "id": "i2kti01",
            "score": 1,
            "text": "Glad she showed her true colors. Anyone who'd ask you to get rid of a family member isn't worth your time",
            "title_similarity": "0.50645226",
            "sentiment_compound": 0.629
        },
        {
            "id": "i2ktshz",
            "score": 1,
            "text": "Couldn't set foot in his neighborhood or home. Was unfounded. Dropped off surprise valentines gift two years into dating and it was met with being told to leave immediately. When people talk about heart break, it feels like being stabbed in the left side of chest. Felt it then. Manage to stay for a long while despite that and ended up being cheated on.",
            "title_similarity": "0.79135257",
            "sentiment_compound": 0.6486
        },
        {
            "id": "i2ku5cv",
            "score": 1,
            "text": "I used Palmolive as my dish soap and said the odor was a dealbreaker.\n\nI did not changed my Palmolive",
            "title_similarity": "0.47839957",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2ku660",
            "score": 1,
            "text": "I used Palmolive as my dish soap and said the odor was a dealbreaker.\n\nI did not changed my Palmolive",
            "title_similarity": "0.47839957",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2ku6yv",
            "score": 1,
            "text": "I try to remember the difference between ultimatums and boundries. What you mentioned is definetely an ultimatum. Ultimatums are rarely about comfort, more about control. I can only think of a few occassions an ultimatum is appropriate. This is not one of them.",
            "title_similarity": "0.41254514",
            "sentiment_compound": -0.2755
        },
        {
            "id": "i2kuq69",
            "score": 1,
            "text": "I've had a dog. I love dogs. I'd never give up a dog. They're not babies though, I've had those too. Not even close.",
            "title_similarity": "0.5366726",
            "sentiment_compound": 0.6369
        },
        {
            "id": "i2kurdj",
            "score": 5,
            "text": "Wife said I had to get rid of my project car, it's a drain on time money and everything else.\n\nTo some this might seem like an easy thing but it's the first car I ever bought, and 27 years later I still own it. I am a petrol head, if you get it you're my people and if you don't I can't explain.\n\nAnyway I transferred the ownership to my first born kid and she hasn't said a peep about it since, in fact my kid has her own toolbox and we take stuff apart for fun on it\n\nNever surrender",
            "title_similarity": "0.7958112",
            "sentiment_compound": 0.7992
        },
        {
            "id": "i2kuvwe",
            "score": 3,
            "text": "She asked me to choose between my best friend or her. I'm not sure why but I'm guessing it's because my best friend is a girl so distrust and jealousy was probs the cause for that breakup. Couldnt even tell her that my bestfriend is gay cuz I promised I wouldn't tell anyone.",
            "title_similarity": "0.72903836",
            "sentiment_compound": 0.8519
        },
        {
            "id": "i2kuyfp",
            "score": 1,
            "text": "I told my partner she'd have to just accept and get used to being the third woman in my life after the two dogs, and she was simply surprised and pleased that she beat the cat to third.",
            "title_similarity": "0.679541",
            "sentiment_compound": 0.7506
        },
        {
            "id": "i2kv588",
            "score": 2,
            "text": "Lose weight (I wasn't that big) or no sex",
            "title_similarity": "0.42556274",
            "sentiment_compound": -0.5994
        },
        {
            "id": "i2kvai1",
            "score": 3,
            "text": "\"if you don't block your cousin I will cheat\" \nI didn't block my cousin. Hes my best friend he was already cheating when he gave the ultimatum.",
            "title_similarity": "0.6547893",
            "sentiment_compound": 0.682
        },
        {
            "id": "i2kvf6a",
            "score": 2,
            "text": "My girlfriend hated my daughter cause I was paying her school and she wanted me to stop so she could get that money for herself.  The classic you have to choose ultimatum: your daughter or me. \nShe's is now my ex girlfriend.",
            "title_similarity": "0.72484106",
            "sentiment_compound": -0.7506
        },
        {
            "id": "i2kvfra",
            "score": 1,
            "text": "If you don't get a house, you must throw away all of your baseball cards.",
            "title_similarity": "0.53530705",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2kvmb4",
            "score": 1,
            "text": "My gf wanted to become a military couple and expected me to be perfectly content with it, or we would break up.\n\nNeedless to say, i got suicidal because of it.",
            "title_similarity": "0.616657",
            "sentiment_compound": -0.0772
        },
        {
            "id": "i2kvsrq",
            "score": 1,
            "text": "I had made up and been friends with a woman who I loved in years past. When we were close she had cancer and our friendship grew very close, so after the love angst dust settled, we still had a close friendship and I didn’t want to throw that away.\n\nMy ex made me choose between dating her, or being friends with her. That’s how I learned that not making that decision is in itself making that decision.\n\nAnyway, I get her POV but asking me to cancel out one of the closest friendships I have ever had was easy enough to end the relationship.",
            "title_similarity": "0.62340426",
            "sentiment_compound": 0.9243
        },
        {
            "id": "i2kvzuu",
            "score": 1,
            "text": "Maybe not an ultimatum, but my ex told me basically that she wanted to break up with me, but that I had to initiate the break up.",
            "title_similarity": "0.60797983",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2kw34r",
            "score": 3,
            "text": "Adopt my extremist political views, or we're through. Happily divorced for 6 years.",
            "title_similarity": "0.59409934",
            "sentiment_compound": 0.6486
        },
        {
            "id": "i2kw53d",
            "score": 2,
            "text": "I was once given an ultimatum that I had to choose between her and attending a bachelor party...    \nIt was my best friend's wedding.  I was the BEST MAN.  We have been friends since the first grade. I was the one who introduced him to his wife.    \n\n\nI attended the bachelor party as a single man.",
            "title_similarity": "0.6438086",
            "sentiment_compound": 0.9561
        },
        {
            "id": "i2kwbts",
            "score": 1,
            "text": "\"A man who would ditch his dog over pussy, deserves neither dog, nor pussy.\"\n\nSpoken by someone, at some point, probably.",
            "title_similarity": "0.644374",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2kwde8",
            "score": 1,
            "text": "My ex told me if I walk away of an heated fight to calm this down he would break up with me , I left immediately 🙏",
            "title_similarity": "0.64957285",
            "sentiment_compound": -0.0772
        },
        {
            "id": "i2kwgzl",
            "score": 1,
            "text": "My Ex told me that I should stop being insecure of her with other men, while she was sleeping with them, which I had a clue of, hence, my insecurity.",
            "title_similarity": "0.6378",
            "sentiment_compound": -0.7783
        },
        {
            "id": "i2kwjwn",
            "score": 3,
            "text": "My ex said if I didn't stop studying for my law school exam she was going to kill herself.\n\n(Borderline personality disorder is next level)",
            "title_similarity": "0.6863786",
            "sentiment_compound": -0.7588
        },
        {
            "id": "i2kwksl",
            "score": 1,
            "text": "\n\n\"Your freedom or me.\"",
            "title_similarity": "0.00925836",
            "sentiment_compound": 0.6369
        },
        {
            "id": "i2kwofm",
            "score": 1,
            "text": "I had 3 months to fix (undefined) problems that she sprung on me after 4 years of living together. \n\nIt wasn't an ultimatum it was her trying to not \"kick the puppy\" and be the bad guy by dumping me.",
            "title_similarity": "0.7764183",
            "sentiment_compound": -0.8176
        },
        {
            "id": "i2kwyf6",
            "score": 3,
            "text": "My wife of 12 years left me just before the holidays (2019) because I refused to hit her during sex. She moved in with a guy 50 miles away for a year, untill he turned out to be physically abusive. She asked to move back in with me 3 times, but I refused. She now lives with her mom, and I'm raising our 4 y.o. son. I grew up around domestic violence, and it is absolutely abhorrent to me. I can't deal with BSDM, and she knew it before she asked. She's still chasing her fantasy.",
            "title_similarity": "0.8717271",
            "sentiment_compound": -0.958
        },
        {
            "id": "i2kx12g",
            "score": 3,
            "text": "If you can't except me sleeping with my step dad then we can't continue dating.",
            "title_similarity": "0.65701216",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2kx6q9",
            "score": 1,
            "text": "Sounds like you made the right choice",
            "title_similarity": "-0.0778377",
            "sentiment_compound": 0.3612
        },
        {
            "id": "i2kx7r2",
            "score": 1,
            "text": "\"Improve our sex life or I'm gone.\"\n\nI didn't, and she was. Can't blame her, she gave me fair warning and I just couldn't make it happen. I had my reasons (very stressful job and anti-anxiety meds) but she was right. If you're not getting what you want out of a relationship, you have the right to move on.\n\nTen years later, we're still close friends. Sop it wasn't a total loss.",
            "title_similarity": "0.6122164",
            "sentiment_compound": 0.8171
        },
        {
            "id": "i2kxgdk",
            "score": 1,
            "text": "So I’m going the other way with this..\n\nIn my early 20’s I was an absolute duche bag. There was a female I had been leading on for a while just to continue having sex with her. One night after getting home from a strip club completely hammered I called her to come over, she declined because it was like 3am. I told her if she came over I’d be her boyfriend, and if not I’d quit talking to her because she wasn’t “down for me”. She came over and the next morning I pretended that I didn’t remember saying that. The poor girl stuck around for months after that before smartening up. \n\nI grew up eventually and I found her on “MySpace” years later and apologized for how I was back then. She assumed I was trying to hit on her and cheat on my girlfriend at the time, called me all kinds of names which I’m sure I deserved.\n\nPoor girl.",
            "title_similarity": "0.7736123",
            "sentiment_compound": -0.34
        },
        {
            "id": "i2kxnp0",
            "score": 1,
            "text": "Go out and drink alcohol today and we’re done. \n\nSome backstory - I was a minimal drinker maybe once every couple of months, and had never cheated or been accused of doing so by him on other nights out. One summers day, I told me ex I was planning to go drinking with some friends. He flew off the handle and told me I couldn’t drink anymore. I asked why, his reasoning was because his mum used to get drunk and cheat on his dad. I told him I was going whether he liked it or not as I was not paying the price for his unresolved childhood trauma. He broke up with me not long after as he kissed a girl on a work night out, while he was drunk, and left me for her.",
            "title_similarity": "0.7523049",
            "sentiment_compound": -0.5264
        },
        {
            "id": "i2kxpu0",
            "score": 1,
            "text": "My fiancee told me to choose between her and my family. She felt as though as if anything were to happen to my family members, parents or siblings, I'd leave her and the future kids to take care of them if even temporarily.",
            "title_similarity": "0.61560595",
            "sentiment_compound": 0.4588
        },
        {
            "id": "i2kxyny",
            "score": 1,
            "text": "we’ve made massive strides since then so we’re still together (we were both very young when this happened) but he told me either i let him smoke weed and go crazy partying, or he was going to break up with me. he basically only told me this to get me to agree to him smoking that night with his friends. \n\nhe’s not this same person anymore thankfully and neither am I, but damn it hurt back then knowing weed and his friends he knew for less time than me were more important than our relationship.",
            "title_similarity": "0.67352366",
            "sentiment_compound": 0.8761
        },
        {
            "id": "i2ky6x4",
            "score": 1,
            "text": "The dog goes or I go.\n\nIt was unspoken, but absolutely clear.  If I kept the dog, I'd never enjoy a day in my life.",
            "title_similarity": "0.6469915",
            "sentiment_compound": 0.1021
        },
        {
            "id": "i2kynah",
            "score": 1,
            "text": "If you go to your brothers bachelor party I will break up with you\n\nI went, then I broke up with her, and said it was because the stripper blew my mind and she will be my new girlfriend (big fat lies about the stripper)",
            "title_similarity": "0.6907154",
            "sentiment_compound": -0.4404
        },
        {
            "id": "i2kynm7",
            "score": 1,
            "text": "> We went on a 2 hour walk today. She had bacon, fries and a burger bun as a treat.\n\nGood. Do not put anyone before your dog. Your dog comes first.",
            "title_similarity": "0.80633676",
            "sentiment_compound": 0.6808
        },
        {
            "id": "i2kyqyq",
            "score": 1,
            "text": "Told me that if I wasnt fine with all of her requirements after a year of dating that I should find someone else.\n\nSo I found someone who didn't require seeing me 7 days a week in order to ensure I wasn't cheating on them.",
            "title_similarity": "0.66918635",
            "sentiment_compound": 0.6036
        },
        {
            "id": "i2kywaw",
            "score": 1,
            "text": "I got a job out of state and asked my girlfriend at the time if she'd come with me. She told me not if we didn't get married. We've been married 29 years. We eventually moved  \"back home.¨   Even today if she told me; \"It's \\_ or me.\" I still think we'd be done.",
            "title_similarity": "0.7240597",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2kyxsf",
            "score": 3,
            "text": "I had to stop working out because muscles somehow equalled rape. I broke up with her on the spot. It was weird because she dated me while I was fit, so for her to come with that out of the blue surprised me.",
            "title_similarity": "0.6928876",
            "sentiment_compound": -0.7906
        },
        {
            "id": "i2kyxwv",
            "score": 1,
            "text": "I was the one that gave the ultimatum. Told my husband either he told his brother and his roommate to find another place to live in, or the wedding was off.\n\nFor context, husband had moved to a different state because of work and bought our first house. His brother and roommate automatically assumed they were going to live with us right after the wedding. Brother had relationship / drug issues at the time, and roommate did not contribute to any bills during the 3 - 4 years he lived with my husband.",
            "title_similarity": "0.7904552",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2kyzc9",
            "score": 1,
            "text": "I was told right before my engagement that we would have to wait years to actually get married because his sister needs to be married before us. He sister has absolutely no plans on getting married for the next 3+ years. If I am not ok with being engaged for 3-5 years then we need to break up because it doesnt look nice that the younger brother would get married before the older sister..",
            "title_similarity": "0.73840797",
            "sentiment_compound": -0.0034
        },
        {
            "id": "i2kz00m",
            "score": 1,
            "text": "\n\nAfter inviting my ex to join me on several different opportunities to vacation and get-away....\n \nMusic festival \"no I don't really care for the vibe, everyone is doing drugs and it's not for me\"\n\nSnowboarding in Colorado \"no I'd rather go to Costa Rica instead\" \n\nI say fuck it, I'm taking the time off from work and catching a plane ticket and going. He says that he'll break up with me if I go. \n\nI went, came back, and with new clarity on the toxic relationship I just spent a week away from, promptly took my things and left. \n\nThis is the same man who asked if he could go get lunch with a female friend, then admitted that he took her home and she \"came onto him\" and sucked his dick. \n\nSame man that fucked 5 different women when we took a break from each other, and claimed \" but none of them felt like you\" \n\n\nAlso, one more ultimatum that knocks my socks off. \" You're going to regret leaving me because I am going to become a famous artist, and you'll be missing out.\" \n\n\nAnd that's just the tip of the iceberg. I'm just embarrassed at this point, that I let that relationship keep going through all of the toxic sludge.",
            "title_similarity": "0.7389763",
            "sentiment_compound": -0.8032
        },
        {
            "id": "i2kz5ie",
            "score": 1,
            "text": "I was struggling to lubricate after birth.  \n\n\nhe said that he needed sex or else he would leave me.  \n\n\nmy baby and I are healthy and he has a gf he f\\*cks all the time... I would say everyone is happy but being a single mum because he was not willing to work extra for his sexy time kinda does suck and not enough to pay for my broken heart...",
            "title_similarity": "0.75205505",
            "sentiment_compound": 0.7552
        },
        {
            "id": "i2kz921",
            "score": 1,
            "text": "My ext wife made me throw out all the pictures of my first love(r) from when I was 17 - I was 31. I hadn’t seen her since I was 25 and hadn’t dated since we were 20. My ex wife never even met my gf from high school. It was “who’s it gonna me? Me or her?” Games. This was early in our marriage. I thought it would get better but it got worse. \n\nMy ex was a rare kind of cruel. I tolerated that til I was 49. \n\nOn the bright side - we are divorced and that pretty 17 year old in the pictures she was so threatened by? ….. she found me… and wouldn’t be happier.",
            "title_similarity": "0.82921016",
            "sentiment_compound": -0.4458
        },
        {
            "id": "i2kzac6",
            "score": 1,
            "text": "“I’m your girlfriend, you should wanna make me happy, cut your hair or we are breaking up”",
            "title_similarity": "0.5240027",
            "sentiment_compound": 0.3818
        },
        {
            "id": "i2kzbq8",
            "score": 1,
            "text": "My ex said if I don't quit Marijuana we are breaking up. We broke up and 6 months later she is a pothead.",
            "title_similarity": "0.73289",
            "sentiment_compound": -0.4215
        },
        {
            "id": "i2kzjci",
            "score": 1,
            "text": "I love when an ultimatum backfires. So much.",
            "title_similarity": "0.19987184",
            "sentiment_compound": 0.6369
        },
        {
            "id": "i2kzsw4",
            "score": 1,
            "text": "Do less drugs when she is out of town. It’s fair and I’m doing my best. She needed to cut back on drinking for our relationship I can do the same. Some ultimatums can be good or necessary. If you actively choose a substance over your partner that’s on you not them.",
            "title_similarity": "0.5157707",
            "sentiment_compound": 0.8625
        },
        {
            "id": "i2kzznp",
            "score": 1,
            "text": "I did have this one who said I would need to move to Malaysia if it was going to be long term as her mum didn’t trust white men.",
            "title_similarity": "0.6905645",
            "sentiment_compound": 0.5106
        },
        {
            "id": "i2l01sl",
            "score": 1,
            "text": "I was told I must fire an employee, who was a great person, and worker. They also worked for me for six years at the time.",
            "title_similarity": "0.52395123",
            "sentiment_compound": 0.4019
        },
        {
            "id": "i2l02ci",
            "score": 1,
            "text": "My ex got really weird about me  not changing my name after we got married, even though we had discussed it beforehand (I have kids from previous relationship, and kept my last name so we would all have the same last name) \n\nWhen he put me on his health insurance he put down his last name with my first name thinking I couldn't get any sort of medical care without changing my name. \n\nHe also lied and said he couldn't put me on the bank account until I'd changed my last name. And still expected me to deposit my checks into a bank account I didn't have access to. There was no way I was going to do that. \n\nAmong many other things. It was one ultimatum after another. Just one power struggle after another. It's like he considered a marriage certificate a reciept of sale. It was unbelievable. Within a year I knew I'd made a huge mistake and it took another 6 years to GTFO.",
            "title_similarity": "0.73987293",
            "sentiment_compound": -0.2467
        },
        {
            "id": "i2l04do",
            "score": 1,
            "text": "He wanted me to cut myself with a knife to “prove” my love for him. Said only after I did that would he take me back. Lol\n\nThat was the last straw for me that finally gave me the wake up call I needed to move on from his alcoholic ass.",
            "title_similarity": "0.6089963",
            "sentiment_compound": 0.34
        },
        {
            "id": "i2l0a2g",
            "score": 1,
            "text": "That I had to stop being all happy and friendly with my GAY best friend, or else he would leave. Luckily I didn’t stop, and my bff and I are still living our best lives while he is somewhere out there insecure af. 💅🏼",
            "title_similarity": "0.6633769",
            "sentiment_compound": 0.9652
        },
        {
            "id": "i2l0jm3",
            "score": 1,
            "text": "My ex always threatened to break up with me if I didn’t have sex with him when he asked. He would throw a fit and break up with me so in return he would get what he wanted so he would stay with me. \nAnother time was when I was driving 8 hours by myself to move to a different state for him and I wanted to stop in one of the pass through towns to say hi to my best friends, he said if I did that then we won’t be together anymore because he didn’t like my friends. \nAhhh good times, glad I found my self worth.",
            "title_similarity": "0.7885058",
            "sentiment_compound": 0.9517
        },
        {
            "id": "i2l0lja",
            "score": 1,
            "text": "I asked my high school boyfriend to not be so handsy with his gal pals and touching their lower exposed backs at a dance. He said “we just have different “beliefs””",
            "title_similarity": "0.6527554",
            "sentiment_compound": -0.4019
        },
        {
            "id": "i2l0vfe",
            "score": 1,
            "text": "Dog/cat > human partner because you know what? They won’t leave you for anyone else while people leave you eventually whether that be one day or 30 years from now",
            "title_similarity": "0.6444316",
            "sentiment_compound": -0.1027
        },
        {
            "id": "i2l0yec",
            "score": 1,
            "text": "I told her to leave my flat, she replied with \"no, what are you going to do? I'll go over your head and ask your landlord, he'll let me stay in the other rooms\"",
            "title_similarity": "0.5566654",
            "sentiment_compound": -0.0516
        },
        {
            "id": "i2l1bbs",
            "score": 2,
            "text": "Her:  Get rid of your dog or I am moving out.  \nMe:  I will miss you. \nHer:  aren’t you going to fight for me?\nMe:  no.  You are far too intelligent and accomplished to play games. I will respect your decision and know that it was thoroughly thought out.  \nHer:  you are a cold and heartless SOB.",
            "title_similarity": "0.6326934",
            "sentiment_compound": 0.3109
        },
        {
            "id": "i2l1dwx",
            "score": 1,
            "text": "This will be lost, but whatever. Not the worst, but it always bugged me. In high school a girl told me she wouldn't date me if I continued to push my glasses up by the nose bridge. Had to be a lift from the left arm of the glasses. Think we made it about a week.",
            "title_similarity": "0.73048705",
            "sentiment_compound": 0.5846
        },
        {
            "id": "i2l1h6d",
            "score": 3,
            "text": "2009 red wings stanley cup finals vs the Pittsburgh penguins. She wanted some action, I was watching the game, she even offered anal... God I wish I'd taken the anal -_-",
            "title_similarity": "0.56941235",
            "sentiment_compound": 0.5859
        },
        {
            "id": "i2l1ju0",
            "score": 1,
            "text": "I think I'm poly, I'm creating a FetLife account and if you don't like it, leave.",
            "title_similarity": "0.48163125",
            "sentiment_compound": 0.0613
        },
        {
            "id": "i2l1mie",
            "score": 1,
            "text": "\"If you break up with me I'll kill myself\".",
            "title_similarity": "0.42354333",
            "sentiment_compound": -0.6908
        },
        {
            "id": "i2l1tt2",
            "score": 1,
            "text": "Man, this thread really makes me appreciate my relationship...",
            "title_similarity": "0.046311077",
            "sentiment_compound": 0.4522
        },
        {
            "id": "i2l1x21",
            "score": 1,
            "text": "“I want more than two kids, maybe seven and if you won’t do that, I will find someone else “ coming from a guy who never helped raise the two we had and opted to kill himself with drug use instead. Therefore, left our two kids in permanent heartbreak and thankfully not 5 more!",
            "title_similarity": "0.7474551",
            "sentiment_compound": -0.7644
        },
        {
            "id": "i2l21o0",
            "score": 1,
            "text": "\"I don't want cat hair in my nice clean condo. You'll have to get rid of Kitty1 and Kitty2 before you move in.\"\n\n\"Um, are you aware that I've had these cats for almost 20 years? And they are family? And I love them more than most people? And they've seen women come and go for two decades?\"\n\nShe doubled down, and became single a few seconds later. No ragratz.",
            "title_similarity": "0.7811095",
            "sentiment_compound": 0.8496
        },
        {
            "id": "i2l28qd",
            "score": 1,
            "text": "Weird",
            "title_similarity": "-0.04359646",
            "sentiment_compound": -0.1779
        },
        {
            "id": "i2l299r",
            "score": 3,
            "text": "My current husband made this demand:\n\n\"I'm not going to marry a smoker\" \n\nSo I stopped smoking cigarettes and marijuana. Then I asked him to stop smoking marijuana -politely-. He's still smoking to this day making my road to recovery harder. When I confront him about it he tells me \"It was for your own good; for your health even!\" It wouldn't be so bad if I could trust that there weren't substances in my house.\n\nTl;DR: Husband said \"stop smoking and I'll marry you\" then didn't hold himself to the same standard.",
            "title_similarity": "0.747839",
            "sentiment_compound": -0.757
        },
        {
            "id": "i2l2ktl",
            "score": 1,
            "text": "LOVE MEEEEE!",
            "title_similarity": "-0.05657738",
            "sentiment_compound": 0.6696
        },
        {
            "id": "i2l2n37",
            "score": 1,
            "text": "My ex has bpd. There were so many ultimatums. \n\n1. Either we have an open marriage or I’ll leave you. \n2. Learn about BDSM or I’ll leave you. \n3. Let me buy you out of our jointly owned company or I’ll turn it into a zombie corporation worth nothing. \n\nI’m happily remarried to a wonderful person now.",
            "title_similarity": "0.6831282",
            "sentiment_compound": 0.3129
        },
        {
            "id": "i2l2nu5",
            "score": 3,
            "text": "If you don’t lose weight, I am going to find someone else. \n\nI lost 80 lbs by eating less than 500 calories a day. It was not pretty. Fucker still found someone else.",
            "title_similarity": "0.69538045",
            "sentiment_compound": -0.4915
        },
        {
            "id": "i2l2zsh",
            "score": 2,
            "text": "I needed to be ok with her best friend who will drill me with questions and will interrogate me.  She even made an ex of hers cry before. She \"speaks her mind\" and \"is blunt because she don't give a fuck hehehehe\".  I need to be ok with it because, \"hehehe that's just Kate. She's a crazy bitch but I love her hehehe\".  Made me think, hmmm, I wonder how stable this girl really is.  I mean who keeps friends like that around.",
            "title_similarity": "0.6040624",
            "sentiment_compound": 0.9622
        },
        {
            "id": "i2l3ecw",
            "score": 1,
            "text": "“If you even look at other male celebrities, we’re done” \n*proceeds to follow insta models and random women and hides it from me*",
            "title_similarity": "0.55605006",
            "sentiment_compound": -0.1779
        },
        {
            "id": "i2l3jip",
            "score": 1,
            "text": "Don’t you ever fucking dare say Fraggle Rock is better than the muppets again.",
            "title_similarity": "0.5631336",
            "sentiment_compound": 0.4404
        },
        {
            "id": "i2l40oj",
            "score": 1,
            "text": "The amount of people who bleed themselves dry for other people they're not even married to is mind boggling. I've never been given an ultimatum, because that's just a form of manipulation.",
            "title_similarity": "0.5817554",
            "sentiment_compound": -0.296
        },
        {
            "id": "i2l4e3d",
            "score": 1,
            "text": "My ex-wife left her Facebook open. You can pretty much take it from there. Messages to some guy she was planning to go see an hour north the following weekend. “He’s my husband, but you’re my crush”. \n\nI woke her up immediately and told her we were done and I was staying home for Christmas. (This was two weeks before Christmas) She cried and cried and cried, I slept on the couch. Next morning she wakes *me* up with an ultimatum. “*This* is who I am now. I’m poly and you can only blame yourself. You’re boring me. So if we’re gonna keep this relationship going, we’re open from now on or we’re done.”\n\nI moved out two days after Christmas and handled the divorce entirely myself.",
            "title_similarity": "0.79964113",
            "sentiment_compound": -0.9343
        },
        {
            "id": "i2l4hdz",
            "score": 1,
            "text": "I was told i needed to quit smoking and lose 1.5 lbs a week.  Not 1, not 2, but 1.5 \n\nI'd been trying to figure out how to end this relationship, so this was awesome news.",
            "title_similarity": "0.7451693",
            "sentiment_compound": 0.7348
        },
        {
            "id": "i2l4lvc",
            "score": 1,
            "text": "If you don’t let me go to NYC by myself, I’m going to tell everyone I know how controlling and abusive you are. I literally just told her to be careful",
            "title_similarity": "0.5409502",
            "sentiment_compound": -0.5574
        },
        {
            "id": "i2l4m35",
            "score": 1,
            "text": "Many years ago I got given a list of things I needed to change to “make it work.”\n\nIt wasn’t even a list of things that really mattered.\n\nOne thing was “How you hold the wheel when you drive.” She hated how I held the wheel with two hands instead of one. She also didn’t like how I wore Jordans on a date instead of dress shoes. \n\nSo the one thing I changed was my relationship status.",
            "title_similarity": "0.70382357",
            "sentiment_compound": -0.4019
        },
        {
            "id": "i2l4ney",
            "score": 1,
            "text": "Way back in my college days, my then-finance and I broke things off for a few months and then got back together. After we got back together, she started going out with another ex of hers several nights/week. This guy was CLEARLY interested in her, and was never shy about showing it while she and I were dating/engaged for several years. She insisted it was strictly platonic. \n\nEven giving her the benefit of the doubt, what he wanted out of the relationship was plain as day. Removing benefit of the doubt from her end of it, it was a textbook case of \"not letting go of one branch until you have a firm grasp on the next.\"\n\nThe ultimatum was the implied \"I'm doing this, deal with it\" from her. I never asked her not to see him, but I made it clear that it made me uncomfortable.\n\nI put up with it for about a month and then dropped her like a bad habit. Because she was a bad habit. F that noise.",
            "title_similarity": "0.69055927",
            "sentiment_compound": -0.5444
        },
        {
            "id": "i2l4ozm",
            "score": 1,
            "text": "OP, you are better off, glad you chose the dog.",
            "title_similarity": "0.3363923",
            "sentiment_compound": 0.7096
        },
        {
            "id": "i2l4p24",
            "score": 1,
            "text": "She wanted a baby.\n\nWhen we started dating, I explicitly said I wanted to take things slowly and gradually,, make things happen naturally. 6 months in, she all of the sudden yells at me for not talking about moving in. Figure it's a communication thing, and eventually she stops asking about it.\n\nOver the year and a half things gradually become more and more demanding. Final straw was the entire kid thing.\n\nI couldn't find myself having a child with someone that was just so fucking impulsive and emotionally unstable. Told her that I just can't predict when I'd be comfortable having a kid. She keeps pressing, and I finally just told her it's simply easier for me to tell her that I don't want children.\n\nFor someone in the fucking communication's field that prides on her \"communication\" skills it was quite... well, a pain in my ass.\n\nHaven't spoken to her in a year now.",
            "title_similarity": "0.7635883",
            "sentiment_compound": -0.6541
        },
        {
            "id": "i2l4wlq",
            "score": 1,
            "text": "Either stop spending so much time on my computer, or lose her. I’m a comp sci major. I graduate in 2 semesters and she’s been gone for 2 years now. I think I made the right choice.",
            "title_similarity": "0.70435154",
            "sentiment_compound": -0.5994
        },
        {
            "id": "i2l4x49",
            "score": 1,
            "text": "I have a cat of 7 years and my girlfriend is allergic to cats. When her and I were long distance, before she met my cat and only <6mo into the relationship, she had called me one night, slightly drunk, after talking with her parents about “what about your allergies when you eventually move in together?” She asked me if I would give up the cat so she could move in and I simply told her “nope” Of course she didn’t like that and we argued about it but it simply wasn’t negotiable for me. I just can’t fathom abandoning animals. \n\nWe currently live together 2 years later and she’s in love with the cat. I also found out my girlfriend just likes to exaggerate about her “allergies” lol.",
            "title_similarity": "0.77247846",
            "sentiment_compound": 0.8536
        },
        {
            "id": "i2l53p3",
            "score": 2,
            "text": "I'm getting the impression that the \"move or we break up\" ultimatum is essentially an attempt to have the recipient of the ultimatum refuse and be the \"bad guy\" in a breakup that definitely WILL happen regardless.",
            "title_similarity": "0.47585943",
            "sentiment_compound": -0.2732
        },
        {
            "id": "i2l5d7g",
            "score": 1,
            "text": "Yeah no, Don't play the ultimatum game with me. Last I checked we were both grown ass adults. I would simply ignore it and let her figure out what to do next.",
            "title_similarity": "0.54509246",
            "sentiment_compound": -0.7037
        },
        {
            "id": "i2l5ksf",
            "score": 1,
            "text": "Made me choose between Taco Bell for me. Or Chinese for her.\n\nI’m in a healthy relationship, so they’re pretty minor.",
            "title_similarity": "0.49803823",
            "sentiment_compound": 0.7334
        },
        {
            "id": "i2l5rcq",
            "score": 1,
            "text": "Glad you chose the right bitch",
            "title_similarity": "0.16372609",
            "sentiment_compound": -0.2023
        },
        {
            "id": "i2l66r9",
            "score": 1,
            "text": "The worst? Hard to say. I had a lot.\n\nPropose or I am leaving.\n\nBike or me.\n\nFriends or me.\n\nDad or me (that was actually my bio mom).\n\nBusiness or me.\n\nOpen relationship or leave.\n\nBJJ or me. \n\nWhen I was younger and dumber. I picked wrong. \n\nNow, I just laugh and say ok and leave. It's not hard to find someone, new. If you don't want to follow my program that is cool. Wish you luck. Let me know if you need anything.\n\nI have also gotten better at picking them from the start, so the ultimatems have become less frequent.",
            "title_similarity": "0.6350055",
            "sentiment_compound": 0.8113
        },
        {
            "id": "i2l68oo",
            "score": 1,
            "text": "Ex says stuff…\n\nGuy: so, doggo, you want to go for a walk?",
            "title_similarity": "0.39537153",
            "sentiment_compound": 0.0772
        },
        {
            "id": "i2l6ee7",
            "score": 1,
            "text": "I told my last boyfriend that he had to get an STI test TWICE and he wouldn't do it. The third time I asked, I threatened to end it if he didn't get one ASAP. Guess who ended up having an STI...",
            "title_similarity": "0.73326373",
            "sentiment_compound": -0.4588
        },
        {
            "id": "i2l6ghm",
            "score": 1,
            "text": "Long time ago. My gf at the time and I (M) were in our teens. I had a very strong relationship with my aunt who isn't much older than I am. We were more friends than aunt and nephew. We used to go for sushi pretty often as we both love sushi. We still do to this day. My gf at the time did not like sushi or most foods other than chicken fingers. Auntie and I went for sushi and didn't invite my gf once because, ya know, she doesn't like sushi. She finds out and not only accused me of cheating on her with my aunt????? But, also said I had to choose between her or my actual blood family member... \n\nLet's just say that my aunt and I continued getting sushi without any issues after that.",
            "title_similarity": "0.76275647",
            "sentiment_compound": 0.7154
        },
        {
            "id": "i2l6qod",
            "score": 1,
            "text": "Polyamory after 5 years together.",
            "title_similarity": "0.3011093",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2l6y2k",
            "score": 2,
            "text": "If you don’t let me move in with you, I’m going to have to move in with this other guy\n\nIf you break up with me, I’m going to kill myself\n\nIf you don’t meet up with me, I’m going to send the police after you and my friends will look for you on the streets and beat you up.\n\nOne time she started yelling these blood curling screams out the balcony because I took her up on her offer to break up. I left my room and while I was gone (~3-5mins), all the neighbors got involved, she opened the door for them and a guy ran into my apartment and laid hands on me. Then the police, fire department and medics  showed up yata yata yata. After everybody left, she took the guys number in front of me and then told me that I should be thankful to her, because she could’ve easily lied to the police and said that I was physically abusive. \n\nDon’t stick your duck in crazy.",
            "title_similarity": "0.6571702",
            "sentiment_compound": -0.8402
        },
        {
            "id": "i2l7f14",
            "score": 1,
            "text": "Sounds like ur living ur best life 😅",
            "title_similarity": "0.17226869",
            "sentiment_compound": 0.8481
        },
        {
            "id": "i2l855t",
            "score": 1,
            "text": "i love ultimatums! it makes the decision SOOOOOOOOOOOOO much easier, and fun.\n\n&#x200B;\n\nI have the type of personality where i'll sink the entire ship to kill the captain if someone is trying to manipulate or control me.",
            "title_similarity": "0.40923628",
            "sentiment_compound": 0.7088
        },
        {
            "id": "i2l89ky",
            "score": 1,
            "text": "You gave birth to a dog?",
            "title_similarity": "0.37916073",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2l8hz5",
            "score": 1,
            "text": "Lol A boyfriend of less than six months once tried to tell me it was him or the dog, that I had for over three years at that point.\n\nWell, I still have the dog and it shouldn’t be a surprise that relationship ended messily not long after that.",
            "title_similarity": "0.69167453",
            "sentiment_compound": 0.7184
        },
        {
            "id": "i2l8nvh",
            "score": 1,
            "text": "You sir, got the better part of the bargain. Congrats",
            "title_similarity": "0.15674873",
            "sentiment_compound": 0.7964
        },
        {
            "id": "i2l95v5",
            "score": 1,
            "text": "She said if I didn't go on stage and slap the comedian that offended her that she would continue to fuck other guys.",
            "title_similarity": "0.5734079",
            "sentiment_compound": -0.3182
        },
        {
            "id": "i2l9f25",
            "score": 1,
            "text": "You win. End of story. Give your pups a treat for me.",
            "title_similarity": "0.4049614",
            "sentiment_compound": 0.7579
        },
        {
            "id": "i2l9hm1",
            "score": 1,
            "text": "\"You can do whatever you want to me, but if I get hurt, it's your fault.\"\n\nNot really an ultimatum, but a shitty no-win game.",
            "title_similarity": "0.46742246",
            "sentiment_compound": -0.9313
        },
        {
            "id": "i2l9i38",
            "score": 2,
            "text": "If you don't come to work tomorrow, don't bother showing up Monday...such a drama queen.",
            "title_similarity": "0.56891024",
            "sentiment_compound": 0.2584
        },
        {
            "id": "i2l9imx",
            "score": 1,
            "text": "When I was 17, naive and in my first relationship. I had a girlfriend give me an ultimatum to drop one of my friends that was a girl or she’d leave me. Me being the stupid, new to relationships and people pleasing 17 year old I was I did it. Horrible mistake, lost a friend, got cheated on and left. \n\n8 years later me and the girl friend of mine I dropped for that ex girlfriend have reconnected, became friends again, and have started dating since reconnecting. As shitty as I was for dropping her, I am so appreciative she was open to letting me back into her life, and I learned a valuable lesson along the way.",
            "title_similarity": "0.73129845",
            "sentiment_compound": 0.4246
        },
        {
            "id": "i2la0it",
            "score": 1,
            "text": "My dog of seven years or the woman I'd known for two months.",
            "title_similarity": "0.608454",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2la3i0",
            "score": 1,
            "text": "I live in a state of mind that I don't accept an ultimatum. I'm not perfect, never have been. I'm flawed for sure. \nMy father taught me self value though. I dont think I've been truly given one by a partner. And if I did, I'd probably decline 🤷‍♂️",
            "title_similarity": "0.65099835",
            "sentiment_compound": -0.1734
        },
        {
            "id": "i2laq01",
            "score": 1,
            "text": "id never give up my dogs. the moment i took them in, they became a commitment that precedes any romantic relationship. i love my doggos, and no woman is gonna make me give them away.",
            "title_similarity": "0.5456042",
            "sentiment_compound": 0.8074
        },
        {
            "id": "i2lauqh",
            "score": 1,
            "text": "I had a girlfriend say she would stop having sex with me if I didn't quit smoking weed....she was really pissed when she caught me getting high in her roommates bed...roommate was awesome",
            "title_similarity": "0.6774204",
            "sentiment_compound": -0.3804
        },
        {
            "id": "i2law6m",
            "score": 1,
            "text": "If I hung out with my friends she'd get an abortion",
            "title_similarity": "0.4678175",
            "sentiment_compound": 0.4767
        },
        {
            "id": "i2lbehe",
            "score": 1,
            "text": "Probably not a good idea to put yourself up against someone’s dog lol. Easiest choice in the world.",
            "title_similarity": "0.40154377",
            "sentiment_compound": 0.4929
        },
        {
            "id": "i2lbev6",
            "score": 1,
            "text": "She told me if I wanted to eat her out I needed to shave my beard off. \n\nBeard didn't get shaved, pussy didn't get eaten.",
            "title_similarity": "0.7143555",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2lbhuw",
            "score": 1,
            "text": "Slap Chris Rock in the face or I’m fucking another stable of our son’s strapping young lads.",
            "title_similarity": "0.555297",
            "sentiment_compound": 0.4728
        },
        {
            "id": "i2lbp2c",
            "score": 1,
            "text": "My long term girlfriend in college told me that if I didn't propose by Valentine's Day we were through. I proposed on February 13th.\n\nI broke up with her ten months later when I realized she was mean and controlling. Best decision ever, the \\`\\`15 years since then have been awesome.",
            "title_similarity": "0.6939813",
            "sentiment_compound": 0.7579
        },
        {
            "id": "i2lbpjx",
            "score": 1,
            "text": " “you can get with this or you can get with that”",
            "title_similarity": "-0.10543201",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2lby73",
            "score": 1,
            "text": "Girl i dated for 3 months said that the relationship wouldn't go any further as long as i didn't propose. Bitch, you think i'm gonna propose after 3 months?????",
            "title_similarity": "0.6911079",
            "sentiment_compound": 0.6164
        },
        {
            "id": "i2lc34b",
            "score": 1,
            "text": "(30F) My former best friends/rock band that were my emotional pillar and expressive escape when I was going through a rough patch with my husband told me I'd have to leave him for three months (thereby risking divorce) and quit my stable full time job in order to tour the country and stay in the band. \nConversely, my husband said we were basically through if I quit my job and left him for that long to travel with an all-male band. What kind of choice was that? \nSo of course I stayed with my husband, even though we were on the verge of divorce already; I had to try to salvage the marriage. It was hard because the band kind of ghosted me and I lost my best friends and the opportunity to be a singer/songwriter and travel. My husband and I were still arguing a lot so I felt like I had no one to talk to or turn to (I was living away from home and family then) and my full time food service job seemed like such a pitiful comparison to writing music and traveling. It was a small town and I basically lost my whole friend group. But it's been six years and I'm still married, happily now, although it took a lot of effort and time. I've had a hard time making friends and finding a musical outlet since though.",
            "title_similarity": "0.74393356",
            "sentiment_compound": 0.9396
        },
        {
            "id": "i2lc5si",
            "score": 1,
            "text": "If I wanted to stick it in her ass I'd have to find someone else",
            "title_similarity": "0.35890043",
            "sentiment_compound": -0.5423
        },
        {
            "id": "i2lc88e",
            "score": 1,
            "text": "If I can’t make her a house wife, she would find someone who will.\n\nI was 21 at the time working my way through school. I started my college career later than most, working days classes at night type thing.\n\nShe eventually broke up with me, sucked for a while. Looking back I dodged a bullet. \n\nI’m happily married today and working as a RN.",
            "title_similarity": "0.6975866",
            "sentiment_compound": -0.296
        },
        {
            "id": "i2lcng4",
            "score": 1,
            "text": "Ex wife told me if she caught me smoking weed she'd leave me. I ended up leaving her cause she was a lying manipulative snake but thats a different subject.",
            "title_similarity": "0.68042713",
            "sentiment_compound": -0.3182
        },
        {
            "id": "i2lctx7",
            "score": 1,
            "text": "My ex was terrible at these. \nShe threatened to leave if I didn't remove my sister from my friends list on social media. She tried the same with friends and other family members (meaning, she'd threaten to leave if I didn't remove them from social media).\n\nI didn't give in to it, thankfully. It was all manipulation. Control tactics, to try and isolate me more. Glad she left later on.",
            "title_similarity": "0.70143205",
            "sentiment_compound": 0.0498
        },
        {
            "id": "i2ld4lm",
            "score": 1,
            "text": "That if I wanted to be in a relationship with him I would have to accept if his family met me, decided they didn't like me, stopped inviting me to their get together while he was able to go, and not try to stop him from being around the family members who told him to stop dating me. Lol. That was a big fat no and I completely stopped talking to him after that.",
            "title_similarity": "0.74696594",
            "sentiment_compound": 0.3718
        },
        {
            "id": "i2ld9mz",
            "score": 1,
            "text": "This one is fresh for me. I’m not allowed to play video games if we move back in together. She hates them and hates me when I play them.",
            "title_similarity": "0.70221406",
            "sentiment_compound": -0.4829
        },
        {
            "id": "i2ldeh3",
            "score": 1,
            "text": "I'd say upgrading living space directly benefits the dog too.",
            "title_similarity": "0.31681284",
            "sentiment_compound": 0.3818
        },
        {
            "id": "i2ldg1k",
            "score": 1,
            "text": "My ex-wife insisted that we would spend *every* Thanksgiving with her family (in Wisconsin) and that we would *move* to Wisconsin.\n\nNo to both. Last I knew she had re-married and still lived in the area. I’m low-key pretty sure the ultimatums were designed to break us up.",
            "title_similarity": "0.7802554",
            "sentiment_compound": 0.5106
        },
        {
            "id": "i2ldmy5",
            "score": 1,
            "text": "My ex said that when we are in public, we’re just friends.",
            "title_similarity": "0.40470934",
            "sentiment_compound": 0.4767
        },
        {
            "id": "i2ldnmi",
            "score": 1,
            "text": "I’ve never given an ultimatum. I believe if you feel the need to give one your relationship is over so why bother.",
            "title_similarity": "0.43816417",
            "sentiment_compound": -0.3976
        },
        {
            "id": "i2ldpnb",
            "score": 1,
            "text": "It's the patriarchy.....",
            "title_similarity": "-0.013358656",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2ldruv",
            "score": 1,
            "text": "If I (17 at the time) didn’t sleep with him (24), he was gonna r*pe me. Yes, he did deliver on that “promise.”\n\nETA: I told him I wanted to wait until I turned 18 (3 months away)",
            "title_similarity": "0.6163596",
            "sentiment_compound": 0.4019
        },
        {
            "id": "i2le26b",
            "score": 1,
            "text": "‘If you don’t change we aren’t getting married’. By that she meant party more, do drugs, blow your mortgage deposit. Didn’t change, got dumped. Looking back she did me a favour. Don’t change yourself for someone who treats you like trash. Jokes on her, I’m now worth a lot of money with a person who adores me and I adore her and we just generally enjoy life.",
            "title_similarity": "0.5831846",
            "sentiment_compound": 0.9493
        },
        {
            "id": "i2lemb3",
            "score": 2,
            "text": "She’s not your baby, she’s an animal you bought. \n\nStill made the right choice.",
            "title_similarity": "0.37756926",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2lemtx",
            "score": 1,
            "text": "Awww I love a happy ending. Pet tax?",
            "title_similarity": "0.26208967",
            "sentiment_compound": 0.836
        },
        {
            "id": "i2leoys",
            "score": 3,
            "text": "This was about 8 years ago now.  I had just been laid off, so money was tight.  We went on a big camping trip with her family 6 hours up north and I was down to my last couple bucks by the time we got back.  But with careful planning I made everything work and we had a great time.  I had just enough money in my account to make my vehicle payment on the following Tuesday.  \n\nEnter Ex; she came into the room demanding 100 bucks for hydro, and I explained that I cant give it to her until the following Thursday when my employment insurance payment comes in.  She countered with pay me the $100 or get the fuck out.  \n\nNot being one to play around, I sold off enough of my stuff to pay for a uhaul truck and storage locker and moved back in with my mom for a month.  Then I got called up and was offered a dream job that allowed me to buy a house 4 months later.  Meanwhile she has been in a state of financial hardship almost ever since and my house is almost paid off.",
            "title_similarity": "0.7851111",
            "sentiment_compound": 0.2263
        },
        {
            "id": "i2lepng",
            "score": 1,
            "text": "Damn theres a lotta clueless controlling bitches out there today",
            "title_similarity": "0.36103123",
            "sentiment_compound": -0.8442
        },
        {
            "id": "i2leuym",
            "score": 1,
            "text": "My ex wife wanted to have an open relationship or she “would resent me for the rest of our relationship.” We had been together for 9 years, 5 years married. We tried having an open relationship for a year. It was horrible. It was really stressful and she treated me like crap. She broke all of our “rules” of dating. She finally went to a psychiatrist because I told her I wanted a divorce. She was diagnosed as bipolar, which explained a lot in hindsight. I separated from and divorced her, which was really difficult. But ultimately it was the right decision and I’m happier and less stressed now.",
            "title_similarity": "0.7667352",
            "sentiment_compound": -0.5864
        },
        {
            "id": "i2lf4u6",
            "score": 1,
            "text": "Once you get an ultimatum, time to run as fast as you can. Either gonna break up regardless soon or live with a whole life on threats once they realize you’ll do anything they want.",
            "title_similarity": "0.4215239",
            "sentiment_compound": -0.3612
        },
        {
            "id": "i2lfev9",
            "score": 1,
            "text": "Been told by many exes that I needed to be more involved in their kids lives. I don't understand that, but it is apparently extremely common. Had a fwb tell me she didn't want to date because she knew I wouldn't want to be in her kids lives. At least, she knew the deal and didn't try to change me like the others.",
            "title_similarity": "0.66916865",
            "sentiment_compound": 0.8092
        },
        {
            "id": "i2lftuo",
            "score": 1,
            "text": "I said I wanted to break up and she threatened to commit suicide…",
            "title_similarity": "0.47529125",
            "sentiment_compound": -0.2023
        },
        {
            "id": "i2lg6ks",
            "score": 1,
            "text": "Gf said I had to quit playing so many video games and get out and get some exercise and socialize with people in real life, cut out the pop and junk food or we are through.  Gave it all up cold turkey, she was 100% spot on, glad I listened to her.  We are married now.",
            "title_similarity": "0.739151",
            "sentiment_compound": 0.4019
        },
        {
            "id": "i2lgr4j",
            "score": 1,
            "text": "My ex wife demanded I sleep with her more or she would cheat on me, sounds awesome right? She cheated on me anyways and later divorced me and said she was gay.",
            "title_similarity": "0.69232106",
            "sentiment_compound": -0.4767
        },
        {
            "id": "i2lgs2y",
            "score": 1,
            "text": "That I couldn’t have friends over at the apartment I paid 100 percent of the bills and rent on soley because he was ashamed he wasn’t working. And on top of that never got to decorate because he used the same excuse that he couldn’t contribute to make it his own…",
            "title_similarity": "0.7603989",
            "sentiment_compound": 0.2732
        },
        {
            "id": "i2lgxe5",
            "score": 1,
            "text": "In the midst of the divorce, right before she left the house to go on a date while I watched the kids, we were arguing (as you might expect) and my ex asked if I had to choose between her and our two children, who should come first. I said, \"The babies, of course.\" She felt that was the wrong answer.",
            "title_similarity": "0.78308994",
            "sentiment_compound": -0.7269
        },
        {
            "id": "i2lgz49",
            "score": 1,
            "text": "My ex said I had to change my sense of humor or things weren't going to work out. We broke up 2 weeks later. Jokes on her.",
            "title_similarity": "0.7804433",
            "sentiment_compound": 0.0772
        },
        {
            "id": "i2lh4z8",
            "score": 1,
            "text": "A girlfriend told me she wanted to by my best friend's girlfriend as well or we were breaking up.\n\nTo be fair we were in 3rd grade.\n\nNow that I think of it we never officially broke up.\n\nI wonder if my partner is gonna be upset if she finds out she is a side chick to a girl I haven't spoken to in 20 years...",
            "title_similarity": "0.73193586",
            "sentiment_compound": 0.8091
        },
        {
            "id": "i2lhooz",
            "score": 1,
            "text": "\"stay with me or I'll kill myself\"\n\nMentally ill people say some interesting things.",
            "title_similarity": "0.4631964",
            "sentiment_compound": -0.7003
        },
        {
            "id": "i2lhxr8",
            "score": 1,
            "text": "start a family in the next year. \n\n(known each other < 4 months)",
            "title_similarity": "0.33073455",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2lhzfz",
            "score": 1,
            "text": "My ex suddenly turned around in her desk chair and told me she wanted to have two kids in the next four years. We had been dating for 3.5 years and lived together for 3 of those. We had always agreed on no kids, but she secretly wanted to manipulate me into wanting them. There wasn’t an overt ultimatum, but we broke up a week later when it became clear to her that I would never have kids.",
            "title_similarity": "0.79267156",
            "sentiment_compound": -0.09
        },
        {
            "id": "i2lhziw",
            "score": 1,
            "text": "My Ex tried to say that if she couldn't sleep around on a break, the break would be permanent.\n\n\nI skipped the break part and went for the breakup.",
            "title_similarity": "0.6504223",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2li25k",
            "score": 1,
            "text": "My ex told me I needed to change.  Specifically that I needed self-confidence.  So I divorced him.  My self-confidence has never been better. :D",
            "title_similarity": "0.6143023",
            "sentiment_compound": -0.6859
        },
        {
            "id": "i2li88u",
            "score": 1,
            "text": "More of a dodged bullet , she told me not even a month into dating that she wanted me to sign a legal document agreeing to marry her in the next year and a half and told me that if I didn't sign it, I wasn't serious. She was a law student so I wasn't going to fuck around signing stuff.",
            "title_similarity": "0.64672256",
            "sentiment_compound": 0.716
        },
        {
            "id": "i2libcf",
            "score": 1,
            "text": "Had a few relationships in my life, currently married for 12 years and counting. Never had ultimatums, never heard of anyone giving ultimatums, only read about them here on Reddit.\n\nGuess it's some cultural thing in the US",
            "title_similarity": "0.63677317",
            "sentiment_compound": 0.34
        },
        {
            "id": "i2lif2b",
            "score": 1,
            "text": "\"Stay with me, don't break up with me or I'll kill myself\" I dumped him after way too long.",
            "title_similarity": "0.6015638",
            "sentiment_compound": -0.8126
        },
        {
            "id": "i2lirr3",
            "score": 1,
            "text": "Almost every woman I've known has dated a guy who's threatened to kill themselves if they break up. It's really weird how common that is",
            "title_similarity": "0.58398473",
            "sentiment_compound": -0.8655
        },
        {
            "id": "i2litim",
            "score": 1,
            "text": "I have absolutely nothing to add to this conversation, but can I just say one thing?\n\nI love my wife. She has never asked a single unreasonable thing of me in our 20 years together. She is a beautiful person. \n\nJust thought I'd inject something a little positive in an otherwise downer thread.",
            "title_similarity": "0.569761",
            "sentiment_compound": 0.9559
        },
        {
            "id": "i2liv95",
            "score": 1,
            "text": "I’m a woman and if any of my partners asked me to get rid of a pet there wouldn’t be a choice. They’d be leaving and the dog/cat/whatever is saying. Could never stay with anyone who asked me to do that.",
            "title_similarity": "0.71120155",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2livwr",
            "score": 1,
            "text": "If i stopped going to college we would have to break up. I ran out of money and had to get a full time job. we dated for 1 year and she disappeared immediately after I went for a job.",
            "title_similarity": "0.7326396",
            "sentiment_compound": -0.4215
        },
        {
            "id": "i2lixx1",
            "score": 1,
            "text": "Op chose wisely.",
            "title_similarity": "-0.06929002",
            "sentiment_compound": 0.4215
        },
        {
            "id": "i2lj0ni",
            "score": 1,
            "text": "That we have to get a dog, or else my wife won’t be with me anymore. \n\nWe got the dog, I take care of her 98% of the time, and I am very unhappy as I did not really want a dog.",
            "title_similarity": "0.79295164",
            "sentiment_compound": -0.0854
        },
        {
            "id": "i2lj1ng",
            "score": 1,
            "text": "She said I couldn't listen to one of my favorite bands (fun.) anymore. \n\nThey have a song One Foot with the lyrics \"I will die for my own sins, thanks a lot. We'll rise up ourselves thanks for nothing at all\"\n\nSo I guess I chose Satan and good music.",
            "title_similarity": "0.67077065",
            "sentiment_compound": 0.7964
        },
        {
            "id": "i2lj47p",
            "score": 1,
            "text": "Sometimes, people try to force you to choose.  It's a power play.  It never occurs to them that you might not choose as they expect.",
            "title_similarity": "0.39309895",
            "sentiment_compound": 0.34
        },
        {
            "id": "i2lj654",
            "score": 1,
            "text": "Fortunately for me I haven't needed to deal with an ultimatum.",
            "title_similarity": "0.1835033",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2ljbnj",
            "score": 1,
            "text": "She made me choose between taking care of my mom who just had a stroke or taling care of her a perfectly healthy woman, glad that rekationship is over",
            "title_similarity": "0.55398023",
            "sentiment_compound": 0.946
        },
        {
            "id": "i2ljcck",
            "score": 1,
            "text": "If you want to have a dog then we can't get married. Still have the dog.....",
            "title_similarity": "0.6194634",
            "sentiment_compound": 0.0772
        },
        {
            "id": "i2ljjxt",
            "score": 1,
            "text": "I was called in the middle of an out of state family reunion and told we couldn’t date anymore because, “we won’t go to heaven together when we die” and was given the ultimatum of joining their religion or ending the relationship. I hung up the phone as an answer (we were 16 and had been dating only 3 months).",
            "title_similarity": "0.7810688",
            "sentiment_compound": 0.5106
        },
        {
            "id": "i2ljjz7",
            "score": 1,
            "text": "\"Stop letting your little brother hangout with your friends or I will leave you.\" \n\nContext: my friends are all 20yrs old, and view my little brother(16 at the time) as their little brother aswell.",
            "title_similarity": "0.68532026",
            "sentiment_compound": 0.5859
        },
        {
            "id": "i2lk0ij",
            "score": 1,
            "text": "I gave one.  I told her if she goes on vacation with her ex and we are done. She did it and we were done.",
            "title_similarity": "0.47992963",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2lk5m9",
            "score": 1,
            "text": "I was basically told, you start taking me on luxurious vacations every month or it's over.  Well, I only get 3 weeks of vacation a year, so, that's not happening, lol.  Not that I can afford something like that anyways.  That didn't last much longer.",
            "title_similarity": "0.6864273",
            "sentiment_compound": 0.3111
        },
        {
            "id": "i2lkffu",
            "score": 1,
            "text": "My ex wife refused to work for seven years and lied to me repeatedly that she was going to go back to work she spent all our life savings and when I said I am leaving she told me I should stay and be unhappy.",
            "title_similarity": "0.810382",
            "sentiment_compound": -0.765
        },
        {
            "id": "i2lkx1x",
            "score": 1,
            "text": "She told me if i shave my head (witch i did countless time before our relationship) shes gonna break up with me.\n\nDumped her and shaved my head.",
            "title_similarity": "0.6981957",
            "sentiment_compound": -0.6369
        },
        {
            "id": "i2ll10i",
            "score": 3,
            "text": "“We have to get divorced and live separately until my mom dies. Then we can get married again.”\n\nHardest of passes.",
            "title_similarity": "0.6725206",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2ll36w",
            "score": 1,
            "text": "Accept she’s toxic habitual cheating garbage, or get torn down socially in your own hometown. All for being friends with (at the time we didn’t know) two dudes she was cheating on with one another. She got engaged to one, the other was going to propose. She denied, gaslit and got violent.",
            "title_similarity": "0.668595",
            "sentiment_compound": -0.8225
        },
        {
            "id": "i2ll6la",
            "score": 1,
            "text": "“Ask me to marry you within 6 months or we’ll break up” after we were together less than a year.\n\nI broke up with her like 2 weeks later and then I slept with her sister.",
            "title_similarity": "0.7048826",
            "sentiment_compound": -0.0772
        },
        {
            "id": "i2lla6j",
            "score": 1,
            "text": "Abusive partner threatened to leave me if I walked out the door to see a friend. I walked out. He left. Everyone wins!",
            "title_similarity": "0.66794837",
            "sentiment_compound": -0.2003
        },
        {
            "id": "i2llh4t",
            "score": 1,
            "text": "No it's your dog and judging by your post it will be the closest thing you have to a child",
            "title_similarity": "0.46182677",
            "sentiment_compound": -0.296
        },
        {
            "id": "i2llnbp",
            "score": 1,
            "text": "High school girlfriend went on exchange to Brazil during her Junior year. Told me I wasn’t allowed to date while she was gone for a year, but assured me that she ABSOLUTELY would be dating other dudes while in Brazil.",
            "title_similarity": "0.7210149",
            "sentiment_compound": 0.5023
        },
        {
            "id": "i2llnga",
            "score": 1,
            "text": "I had an unintentional addiction and was given an ultimatum to quit. It made me feel guilty for a while until I realized that making that bet was just an excuse.  \n  \nIf you’re curious what I mean by unintentional addiction, I tried CBD vapes to quit smoking cigarettes and they were laced with the same “research chemicals” as spice or “incense”.",
            "title_similarity": "0.60555017",
            "sentiment_compound": -0.0516
        },
        {
            "id": "i2llt4e",
            "score": 1,
            "text": "I want the whole tomato",
            "title_similarity": "0.15352018",
            "sentiment_compound": 0.0772
        },
        {
            "id": "i2lltim",
            "score": 1,
            "text": "Clearly, you chose wisely.",
            "title_similarity": "-0.046453558",
            "sentiment_compound": 0.6705
        },
        {
            "id": "i2llxh4",
            "score": 1,
            "text": "My ex demanded that I get circumcised because she was Jewish. I mean not practicing on any level but apparently that was important to her.",
            "title_similarity": "0.6251342",
            "sentiment_compound": 0.1901
        },
        {
            "id": "i2lmo03",
            "score": 1,
            "text": "So my ex knew that I had suicidal tendencies and issues with self harm. When I asked him if we could talk because I was being triggered, he told me he would only talk to me if I sent his pictures of me in a bra and underwear. Sadly I did. \nThen when I told him I was moving he tried saying that he didn't want me to because he \"loved\" me 🙄",
            "title_similarity": "0.6385762",
            "sentiment_compound": -0.7976
        },
        {
            "id": "i2lmvdm",
            "score": 2,
            "text": "The “ultimatum” itself has always been a red line for me. In any relationship if someone says “either do this or” I stop them and explain that I’m willing to talk about any concerns they have but if they are going to threaten me, and make no mistake that’s what an ultimatum is, then the discussion is over. If that also means the relationship is over then so be it. I’m not engaging in that kind of emotional blackmail.",
            "title_similarity": "0.5730053",
            "sentiment_compound": -0.5483
        },
        {
            "id": "i2ln5jd",
            "score": 1,
            "text": "My ex told me she was starting school in a different state soon, never mentioned it and just assumed I was coming with. That ended up being enough for me.",
            "title_similarity": "0.6091688",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2lnd34",
            "score": 1,
            "text": "/u/Heyhaveyougotaminute  Pupper tax OP",
            "title_similarity": "0.24648967",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2lnmhk",
            "score": 1,
            "text": "Either I marry her tomorrow and donate my 4 million to charity and turn vegan or she will burn my dog and shoot my daughter.",
            "title_similarity": "0.72010016",
            "sentiment_compound": 0.1027
        },
        {
            "id": "i2lo033",
            "score": 2,
            "text": "I had a very successful (6 figure) business in custom knives. I spent my time buying, selling, trading, going to shows, and even making custom parts for them. My girlfriends family were all very educated, as in just having a BA was like having a GED. Even though at 20 I was making more money than most of her family members, she told me one day that she was embarrassed by my job, it took “too much explanation.” A few days after that conversation she told me “stop playing with knives and go to law school like you were supposed to, or we can’t be together anymore.” \n\nShut my business down, went to school, slowly went broke, couldn’t afford the lavish gifts, or spontaneous trips anymore. She left me anyway.",
            "title_similarity": "0.713434",
            "sentiment_compound": 0.6801
        },
        {
            "id": "i2lo4de",
            "score": 1,
            "text": "World of Warcraft",
            "title_similarity": "0.20715219",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2lo9d5",
            "score": 3,
            "text": "Either sit here and argue with me for an indistinct amount of time with no logical resolution even though it's been well over an hour, or go home and sleep before your shift starts but you can't come back. Guess which option i picked?",
            "title_similarity": "0.7036021",
            "sentiment_compound": -0.1901
        },
        {
            "id": "i2lp64c",
            "score": 2,
            "text": "Either were getting married or she will leave me (after 2 years...). So nope, didn't work out.",
            "title_similarity": "0.6432028",
            "sentiment_compound": -0.0516
        },
        {
            "id": "i2lp6k8",
            "score": 2,
            "text": "Sorry to say pal, but you are with a cold selfish bitch. Dodge the bullet.",
            "title_similarity": "0.49168935",
            "sentiment_compound": -0.8885
        },
        {
            "id": "i2lpra0",
            "score": 2,
            "text": "Good choice for you. Get rid of that B\\*\\*\\*\\*(your ex, not your dog)",
            "title_similarity": "0.5072634",
            "sentiment_compound": 0.4404
        },
        {
            "id": "i2lpvm2",
            "score": 1,
            "text": "Ex told me I had to give up drinking when I only have a few once every few months, if that. She was changing religion and told me this is a must. I told her that’s your life choice not mine and you know I rarely drink. I got petty and kept a fridge full of beer while the relationship slowly went down hill. \n\nAlso, I don’t drink often cause I usually drive wherever I go because I get car sick when someone else drives.",
            "title_similarity": "0.81508493",
            "sentiment_compound": -0.6249
        },
        {
            "id": "i2lq1i0",
            "score": 5,
            "text": "I had a girl I was dating that told me I needed to get rid of my two dogs since they were from my previous marriage.\n\nI looked at her and laughed and tried to go back to watching the movie as she could not be serious. Turns out she was very serious and said I had to get rid of them as they reminded her of my ex wife and needed to move on to be with her. I got up off the couch, grabbed her purse and jacket and handed it to her and told to she could see herself our. I wasn’t giving up my dogs.",
            "title_similarity": "0.7673391",
            "sentiment_compound": 0.6161
        },
        {
            "id": "i2lq9u0",
            "score": 1,
            "text": "Wear something nicer than a tshirt and sandals when we go out for a meal.",
            "title_similarity": "0.27770504",
            "sentiment_compound": 0.4404
        },
        {
            "id": "i2lr974",
            "score": 2,
            "text": "reading peoples' stories just makes me appreciate my life more!",
            "title_similarity": "0.18682565",
            "sentiment_compound": 0.4574
        },
        {
            "id": "i2lrcdc",
            "score": 1,
            "text": "My ex told me he wouldn’t become an alcoholic if I didn’t get fat.",
            "title_similarity": "0.57530797",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2lrmui",
            "score": 1,
            "text": "Best friends ex was batshit crazy and a druggie. Tried to pull the whole self-harm/suicide package. Final straw was making up a pregnancy and miscarriage.",
            "title_similarity": "0.5792161",
            "sentiment_compound": 0.7096
        },
        {
            "id": "i2lrqo9",
            "score": 2,
            "text": "My now EXW told that I needed to support her exploration of polyamorous bisexuality while continuing to allow her to be a SAHM, or we could no longer be married.\n\nIt was actually the last part that really was the deal breaker.",
            "title_similarity": "0.5639819",
            "sentiment_compound": 0.5106
        },
        {
            "id": "i2lshyy",
            "score": 2,
            "text": "My husband didn’t have to give me an ultimatum.  I could tell that if some things didn’t change he was going to leave.  So I changed things.  We are better than ever.",
            "title_similarity": "0.49262732",
            "sentiment_compound": 0.4019
        },
        {
            "id": "i2lt4rp",
            "score": 2,
            "text": "So this happened when I was 21 and a sophomore in college. I had started dating this 27 year old woman who was studying at the same college. Little by little she had started to try to ease me into the idea that she's more conservative and religious than she had told me before. I wasn't into it and she started to expect that I would break up with her. While I was actually assuming that we would respect each other's boundaries, if we were to continue. So she did something incredibly nasty to pressure me into staying with her. She made an actual effort in threatening to accuse me of rape if I were to break up with her. I fell for it.\n\nOne night she tricked me into getting more drunk than she was. I didn't like getting drunk back then. I would only agree to it if we'd be equally drunk. I caught her dumping her drink down the sink after I had gone to the bathroom. I thought nothing off it, but looking back her pouring her drink down the drain whenever I'd go to the bathroom and she'd go to the kitchen would explain why it seemed like she was drinking so fast. While having sex she told me she wanted me to make her climax with my mouth. Which I did. After climaxing she unexpectedly cut off the sex by saying I would have to explain myself for raping her. I started crying, shaking and couldn't understand what was going on. After she had cleaned herself off in the bathroom she sat beside me and asked me to explain myself. I told her my recount of the night: a perfectly ordinary one, just more drunk than I expected, and then suddenly misery. Hers was different. She went back to bed to sleep - still naked. While I stayed up all night crying and thinking I was going insane.\n\nThe next morning she made us breakfast as if nothing was going on. She didn't even get fully dressed. I was on the other hand trembling like frightful jellö. While she ate breakfast she asked me to repeat my recount of the night. I did, wailing. She said she wouldn't be satisfied until my story was the same as hers. After finishing breakfast she took a shower and got dressed. Then she left, because she apparently had a doctor's appointment. Later that day she texted me that she told the doctor that she had been raped. I was frozen in fear for days.\n\nLater that week after class she wanted to go to my place to talk. I told her I'd rather talk where we would be within other people's line of sight. Then she started crying and yelling about how I supposedly was an abusive drunk. So I foolishly caved and agreed to go to my place. Once inside, she started initiating sex. I freaked out and told her I didn't want to. She started to undress anyway and I saw that she was covered in bruises. I was already suspecting that her mother was abusing her, but she tried to convince me that I had been giving her those bruises. She told me that she had pictures that she was going to include in her police report if she were to decide to file the report. She hadn't decided yet. The implication that she was going to formally and publicly accuse me of rape if I were to break up with her became heavier as the conversation went further. So I eventually, slept with her anyway. I stupidly thought it would be best to hold off the breakup until I had counterproof.\n\nSeveral weeks pass until her birthday party. In the meantime she had let slip once that the accusation wasn't real, but I wasn't able to record it. After the party her friends invited us to stay the night at their place. We had initially planned to sleep over at her mother's, but she accepted her friends' invitation anyway since it was my first time meeting them and it was closer. She let her mother know through a text. A little while later while we were having fun at her friends', her mother tried to kick down the front door. Apparently she had called a bunch of times, with no response. She demanded her daughter come back home with her, because I couldn't be trusted. She refused. Her mother told her she was stupid and willingly hurting herself. She was given the choice to either end things with me or to move out of her mother's house. She chose to keep me. Her friends and I were aghast. Her mother told her to collect her things in the morning and then left. The next morning we all agreed that it'd be best that I went home and that she'd try to mend things with her mother. I don't hear from her for over a week. I was mortified.\n\nA week later she told me that we needed to have a serious talk, but again only at my place. I realized that I needed to record the conversation and kept reminding myself to not forgot to turn on the app. Unfortunately, she wasn't stupid. She wanted us both to take the batteries out of our phones, because she felt paranoid. And then she was very frank about the rape not being real, but that she did have to claim rape to her friends to explain her mother's behavior. Her mother did in fact think I was a rapist, but that was because of my ethnicity. Mother also didn't approve of the age difference and assumed that that confirmed my predatory nature.\n\nThe threat remained and I stayed because I was scared. It also broke my spirit, as I had already been under a lot of pressure since before. The \"relationship\" became a stockholm syndrome pingpong nightmare where she would aggressively have to re-gaslight me whenever I became cognizant enough to resist her. This went on for 18 months. We didn't see each other for the last 6 of it, but shit still continued over the phone. After I had helped her graduate I had a mental breakdown and dropped out of college. Became an alcoholic. I may or may not have a child with her. Now I realize I could've gotten away scot-free if I had gotten legal counsel right away. I was still an ignorant, scared, stupid, lonely, naive and brash kid who got taken advantage of.",
            "title_similarity": "0.71984005",
            "sentiment_compound": -0.9988
        },
        {
            "id": "i2lt9bg",
            "score": 2,
            "text": "Most of the women mentioned in this are probably over on FDS right now \"leveling up\"",
            "title_similarity": "0.28819275",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2ltiuk",
            "score": 1,
            "text": "My ultimatum was: It's me or the drugs. Take a wild guess as to what the answer was.",
            "title_similarity": "0.30037573",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2luzvq",
            "score": 2,
            "text": "Was told by ex after 3 years of being together and banging like the end of the world was coming, that we had to be married to move in together. I got up and left and never looked back!",
            "title_similarity": "0.7072514",
            "sentiment_compound": 0.4199
        },
        {
            "id": "i2lva7e",
            "score": 5,
            "text": "After she lied about being on birth control and got pregnant, we where having a conversation about the relationship and how it's pretty much over because of the breach of trust and she said....\n\n\"If we stay together then we can have an abortion because we will have another chance later, if we break up I want to keep it because then I'll always have a little piece of you\" \n\nNever in my life have I been so comfortable lying to someone. We stayed together long enough for me to know for sure she wasn't pregnant anymore and then I dipped out.",
            "title_similarity": "0.7034062",
            "sentiment_compound": 0.8427
        },
        {
            "id": "i2lw3k2",
            "score": 3,
            "text": "Every once in awhile I start to think that maybe my choice to remain single was not a good choice, and then I come to this subreddit and it reminds me that the monumental task of wading through the psychos is more trouble than I want to go through. #singleforlife\n\nMy contribution to the question would be when my now ex-wife told me that I needed to find a way to spend more time with her, while paying all the bills, while she didn't work, or she was going to find another connection. She followed through on finding a connection, cheated on me, did it so obviously that her 10 year old daughter, my step-daughter, caught her and told me. I divorced her, 8 don't do ultimatums, I told her as such when she made the threat.",
            "title_similarity": "0.7308201",
            "sentiment_compound": -0.8956
        },
        {
            "id": "i2lw69r",
            "score": 2,
            "text": "Not an ultimatum that was given to me but to the friend who set us up. Both me and my I ex have known that friend since we were born. Didn't stop my ex from saying that she needs to block me on all social media if she wants to stay friends with her. The friend said she'll stay neutral as she should and asked to not be brought into this. Ex stopped talking to her. Now, the friend and I have kick-ass jobs while my ex remains jobless and almost ODed last year. I'm happy that I'm in a much better place.",
            "title_similarity": "0.75070816",
            "sentiment_compound": 0.9824
        },
        {
            "id": "i2lwzh8",
            "score": 3,
            "text": "My first GF told me that if I broke up with her she'd say the bruise on her leg from running into a table was from me. I left her and she called my family and friends saying that.",
            "title_similarity": "0.75354564",
            "sentiment_compound": 0.0772
        },
        {
            "id": "i2lzzfc",
            "score": 1,
            "text": "I was told that if i could not give up sheep sheering pornagraphy then it was over, needless to say shes with someone else now",
            "title_similarity": "0.5859592",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2m056z",
            "score": 1,
            "text": "Dog easy decision.",
            "title_similarity": "0.05661416",
            "sentiment_compound": 0.4404
        },
        {
            "id": "i2m0wlb",
            "score": 1,
            "text": "So I’ve had the same few different group of friends since middle and high school and some i know from elementary school and they are mostly women who I’m not attracted to and they never liked me we just all been great friends and are there for each other and when i got a girlfriend i explained that i had many female friends and how since i was in school we all been friends and she had a huge problem with it and told me that they all like me or I like them which wasn’t the case. She then behind my back started to delete their numbers and messages out my phone. I broke up with her and told her I’m not throwing my friends out for you who i just met. She then threw a tantrum and stalked me for a bit. My friends female or male tend to be overprotective of me cuz i have the idgaf attitude and i just never stand up for myself mot cuz i cant but cuz i dont like wasting energy on ppl so when they found out my ex was stalking me they had a huge problem and stayed at my house for 2 weeks just to make sure she dont pop up again like she did on Christmas. My ex did many crazy things before we broke up so im glad its over.",
            "title_similarity": "0.6843691",
            "sentiment_compound": 0.8131
        },
        {
            "id": "i2m136j",
            "score": 3,
            "text": "“Give me her Facebook and I’ll be your fucking Valentine”\n\n“Her” is referring to the new girl I went on a date with, but while still in contact with my very newly ex, said I’d still like to be with my ex on Valentines. She wanted her name so she could stalk her on fb and that was one of the last things she ever said to me lol. Avoided a nightmare with that chick.",
            "title_similarity": "0.65156496",
            "sentiment_compound": 0.5927
        },
        {
            "id": "i2m1ry3",
            "score": 2,
            "text": "Either stop talking to your mom, brother an sister or I'm leaving you an taking our son.. she filed for divorce and moved back to her tribes reservation, she took my son with her and never let's me see him.",
            "title_similarity": "0.7547221",
            "sentiment_compound": -0.296
        },
        {
            "id": "i2m1xrl",
            "score": 1,
            "text": "Honesty or Vegetarianism",
            "title_similarity": "0.20249015",
            "sentiment_compound": 0.4939
        },
        {
            "id": "i2m2psk",
            "score": 2,
            "text": "Ex told me she didn't like my dog who wasn't well trained at the time.\n\"Dog lives here, you dont\"\nDidn't go over well, not a big loss honestly",
            "title_similarity": "0.68781006",
            "sentiment_compound": 0.0577
        },
        {
            "id": "i2m38wv",
            "score": 2,
            "text": "She told me I wanted sex too much and to stop asking her for sex. She said she would tell me when she wanted sex. Unfortunately she never did.",
            "title_similarity": "0.5939864",
            "sentiment_compound": -0.5574
        },
        {
            "id": "i2m4b56",
            "score": 2,
            "text": "2 months in she wanted me only to use social media while she was next to me because a previous relationship and some guy cheating on her and looking at porn. This included Reddit. It was that or we break up. I was even like “it’s pretty boring and I rarely use it anyways but I’m logged in on the PC if you want to see the boring shit I follow”.  That wasn’t enough so we broke up. \n\nI probably messed up her head even more by telling her if I would have agreed then I would have made new accounts and not told her about them and used them incognito on my phone when she wasn’t around.",
            "title_similarity": "0.7436645",
            "sentiment_compound": -0.9164
        },
        {
            "id": "i2m4l2a",
            "score": 2,
            "text": "I had just landed my first grown up job after college and was making enough money to move out of my parents finally. A few of my friends and I had plans on getting a place together and found a great spot by the city. My (now ex) who I had been dating for less than a year basically said \"You're either getting a place with me or this isn't going to work\" and being young and dumb I agreed. Those guys lived in that spot for years and I was always so jealous and upset with myself seeing how much fun they had in that place.",
            "title_similarity": "0.7085262",
            "sentiment_compound": 0.3757
        },
        {
            "id": "i2m4vqp",
            "score": 3,
            "text": "When I was 18 I took my ASVAB and qualified for nuclear engineer in the navy. (We came from low income families so this opportunity would’ve put us well off) My ex who I was with for 4 years at the time was pregnant. I had my recruiter meet my family and was set to sign the papers and ship off a week later (Rushed everything to make sure I would finish boot camp and everything before her due date). Everyone was all for it until the recruiter and my family left. I was then told if I decided to go to the military that my ex and unborn child would be gone when I got back. Needless to say I stayed to be with my kid. All for her to turn around 2 years later and take the kid and run off with my best friend of 18+ years. Morale of the story don’t let a partner give you an ultimatum, if you want to do something go for it.",
            "title_similarity": "0.77324337",
            "sentiment_compound": 0.9273
        },
        {
            "id": "i2m5wo6",
            "score": 3,
            "text": "My now ex demanded i let her move into my house and basically surrender my personalized walk in closet that took me years to get just right. The final straw was get rid of my dog and keep her cat. It was over before she got home",
            "title_similarity": "0.7909915",
            "sentiment_compound": -0.2263
        },
        {
            "id": "i2m611q",
            "score": 2,
            "text": "I told my non-driving GF that she was going to learn to drive or I was gone (she was three months pregnant). 15 years later, My now wife and I fight over who is going to drive now",
            "title_similarity": "0.7523618",
            "sentiment_compound": -0.3818
        },
        {
            "id": "i2m6sgx",
            "score": 1,
            "text": "Sounds like you got the long end of the stick....",
            "title_similarity": "0.09552977",
            "sentiment_compound": 0.3612
        },
        {
            "id": "i2m7a99",
            "score": 3,
            "text": "My wife knows I don't do ultimatums. If she forces one on me, it'll backfire in her face...",
            "title_similarity": "0.56676906",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2m7f0t",
            "score": 3,
            "text": "If I didn’t lose weight he wouldn’t have sex with me. I was already 98 pounds",
            "title_similarity": "0.53405416",
            "sentiment_compound": -0.4019
        },
        {
            "id": "i2m7m5v",
            "score": 4,
            "text": "“Look, I just changed my mind about wanting to have kids, and now that I’m not a Christian anymore I need six months of being guilt-free single while yes, I’m going to have sex with other men, because I missed out in my early twenties, and then I can see if we should be together.” - married four years, together for six, right after I got done putting her through college and she found her first job after not contributing a dime to the marriage and cheating while telling me we were going to start trying/coming up with kids names/demanding I take a step back in my career to be the primary childcare provider.",
            "title_similarity": "0.7823833",
            "sentiment_compound": -0.4767
        },
        {
            "id": "i2m87og",
            "score": 2,
            "text": "Good choice !",
            "title_similarity": "-0.1634908",
            "sentiment_compound": 0.4926
        },
        {
            "id": "i2m8xzr",
            "score": 3,
            "text": "Friend who was almost a partner wanted me to text her every single day. She was unreasonably mad that I didn't want to. Our text conversations were the equivalent of \"how's the weather?\" type of smalltalk, and in hindsight, when we were together, she literally only talked about herself and would not shut the fuck up for even a second. If I had it to do over, I would have quit being friends with her long before the ultimatum because it wasn't a good friendship for either of us. I think it started out great but gradually became shitty when the honeymoon phase wore off. She also got mad because I didn't text her for a month (she didn't try to text me at all during this time because she was testing me). I apologized to her, but I told her that I had been depressed and also extremely stressed with everything going on in my life. I didn't even notice that a month passed. I was just trying to get through. It wasn't the fact that she wanted me to text her more often that made me mad. It was the fact that she never once asked why I had been depressed and stressed during all that time. For context, the entire time we were friends, she expected me to spend at least 2 hours listening to her talk about her problems every night after a night class. I was happy to do it when we were friends, but she had the nerve to act like she had always been there for me when I needed her but that I hadn't been there for her. I was basically done at this point. I told her I don't even text my family every day, and she really didn't like that. She basically just screamed at me on the phone for an hour and then hung up. We never spoke again except for smalltalk because we have to see each other in classes. It hurt initially, but then I realized our friendship was shitty anyway, and we would have been a lot better off if it had ended before that. It was like we were clinging onto it as it went downhill. I would have been perfectly fine with her saying she just didn't want to be friends anymore, but I'm still salty about how she acted like it was all my fault and blew up on me on the phone.",
            "title_similarity": "0.7533124",
            "sentiment_compound": -0.6245
        },
        {
            "id": "i2m9w6b",
            "score": 3,
            "text": "“If you divorce me I’ll violate my probation so I go back to jail” go right ahead bro. Back where you belong.",
            "title_similarity": "0.5985219",
            "sentiment_compound": -0.4939
        },
        {
            "id": "i2mahr6",
            "score": 5,
            "text": "It makes me sad that my fellow women would dole out this kind of crap. I’ve been shocked a few times by stories my gfs have told about what they’ve done/said to their bfs/husbands. Mean girls are a bummer.",
            "title_similarity": "0.60358346",
            "sentiment_compound": -0.8718
        },
        {
            "id": "i2mdj0b",
            "score": 2,
            "text": "I will find out tomorrow.",
            "title_similarity": "0.10545151",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2mdkc8",
            "score": 3,
            "text": "choose the dog over the bitch any time",
            "title_similarity": "0.37107328",
            "sentiment_compound": -0.5859
        },
        {
            "id": "i2mfj99",
            "score": 3,
            "text": "Women can be replaced, the unconditional love of a dog, can never match up to the love of a woman.\nI love my wife with all my heart, but even that love cannot measure the unconditional love my dog has for me.\n\nI would almost guarantee my dog would walk through the underworld of hel, for me.",
            "title_similarity": "0.7244299",
            "sentiment_compound": 0.9752
        },
        {
            "id": "i2mm5zm",
            "score": 2,
            "text": "Have never had a serious relationship ultimatum. The worst it’s ever been is something like “ok if you don’t pick what’s for dinner then we are having ____ “.",
            "title_similarity": "0.7039882",
            "sentiment_compound": -0.3352
        },
        {
            "id": "i2mu15n",
            "score": 3,
            "text": "I was told i had to either move in and start doing the things that her 3 year old daughter (not my child) should have been doing like trying to sleep in her own bed or she would find someone else who would. Considering the tons of false claims men get towards child abuse by jealous ex’s, ex in laws, and crazy gfs i think i had a pretty good reason to not want to sleep on the same bed with a 3 year old little girl. I let her find someone else who would do it.",
            "title_similarity": "0.67523843",
            "sentiment_compound": -0.3009
        },
        {
            "id": "i2myghj",
            "score": 1,
            "text": "You made the right choice ❤️",
            "title_similarity": "-0.040857613",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2n1d1d",
            "score": 2,
            "text": "I was dating this girl for about 6 years, our relationship had our highs and lows. At the time I was dealing with some family stuff and my mental state was all over the place. Prior to all this she was eager to get engaged and kept asking where is the ring when we are going to get engaged, I want to start moving on with our life. She told me I have a certain time frame to give her the ring or she is leaving me, When I heard that, the red flags should have alerted me but I ignored it. I felt I was always getting picked on about certain things I enjoyed. I gave her the ring on the deadline. We didn't even make it to a year engaged. I now have the ring back",
            "title_similarity": "0.6750176",
            "sentiment_compound": 0.9091
        },
        {
            "id": "i2n34ef",
            "score": 2,
            "text": "I got the suicide ultimatum from my girlfriend in my 20s. I was immature and an extreme empath so I couldn't leave her. 10 years later and more mature I said goodbye. Thank god or the tables might have been turned.",
            "title_similarity": "0.73176134",
            "sentiment_compound": 0.3828
        },
        {
            "id": "i2n4ak2",
            "score": 2,
            "text": "She was going to college on the other side of the state and I could come along or pretty much keep in contact but no guarantee she'd keep the relationship going.\n\nI chose to stay in my home town, we pretty much broke up, and she lasted about two months down there before she spiraled out of control and dropped out then moved back home.",
            "title_similarity": "0.6768",
            "sentiment_compound": 0.1506
        },
        {
            "id": "i2n56tt",
            "score": 3,
            "text": "If we didn’t go to uni together, we would breakup. We broke up 3 months into uni and two weeks after she found a new man. Joke’s on her though because I’ve found the girl of my dreams back in my hometown where I *wanted* to stay. Still wish her all the best though, she’s a great person at heart. She was just in a *very* bad place mentally when we were dating thanks to covid related issues. She’s very happy with her new man and I couldn’t be happier for her! (The relationship was very toxic and had to end anyways.)",
            "title_similarity": "0.76437783",
            "sentiment_compound": 0.9716
        },
        {
            "id": "i2n5qp8",
            "score": 3,
            "text": "**Leave my job because there's too many pretty women in my office.**\n\nWhen I said no, she then asked me if I think the women I work with are pretty. They are objectively good looking women, so saying otherwise for the sake of appeasing her would have been an obvious lie, which would have made her even more paranoid and distrustful of me whilst I was at work. So in the interest of honesty, I said they are obviously pretty but that doesn't mean that I'm interested in them.\n\nShe sniped at me that I'm wrong, and ranted at me for asking how I could even notice other women when I already have someone as pretty as her at home - and told me there is no woman in the world, better looking than her.\n\nI turned it back on her and asked her if there's handsome men at her work - and she tutted \"well obviously, but you're not model-pretty are you? I am, and I feel you don't appreciate this.\"\n\nI ended things there and then. A few months later, completely unprovoked, she started harassing my female colleagues, finding them on Messenger and sending them pages of messages warning them away from me and my toxic behaviour; she then started stalking them in the streets and approaching them in public to rant about me.\n\nI had to threaten her with the Police in the end. Glad I chose the job over her, all things considered.",
            "title_similarity": "0.5726129",
            "sentiment_compound": 0.6615
        },
        {
            "id": "i2n6du9",
            "score": 1,
            "text": "I probably could've worked with an ultimatum or two, I'm not proud. All I got was a demand for a divorce.",
            "title_similarity": "0.5324997",
            "sentiment_compound": -0.4685
        },
        {
            "id": "i2ncamn",
            "score": 2,
            "text": "None, but if a partner ever gave me a “terrible ultimatum” that relationship isn’t going to last for long. My partner is supposed to be my best friend and a caring companion, not a boss or a dictator.\n\nEdit: To topic creator: Well done! Your dog is more important than someone who doesn’t care about you enough to care about your dog too! If you want a friend add me 🙂",
            "title_similarity": "0.67912894",
            "sentiment_compound": 0.9907
        },
        {
            "id": "i2ncmv4",
            "score": 3,
            "text": "My ex told me I wasn’t allowed to work out or tell people I worked out because it meant I was “sexualizing myself” or we had to end it. I worked out 4-5 days a week and my peers in class were aware. I started giving people workout advice which triggered him. I once then posted myself at the gym with a friend and he went bonkers. Broke up with him on my way to the gym",
            "title_similarity": "0.7616948",
            "sentiment_compound": 0.4215
        },
        {
            "id": "i2ncplm",
            "score": 3,
            "text": "Not the worst ultimatum but the best outcome of one;  \nWhen me and My ex-fiance broke up he gave me the ultimatum of keeping the condo that we bought together or keeping the dog. \n\nI took the dog, the payout from my contributions for the condo and bought a house. Now my dog has a backyard and I have a cute little home that's all mine.",
            "title_similarity": "0.7228265",
            "sentiment_compound": 0.8499
        },
        {
            "id": "i2nfu3g",
            "score": 1,
            "text": "Why doesn't he earn more money to upgrade the living space himself then?",
            "title_similarity": "0.47167158",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2nhsmt",
            "score": 1,
            "text": "Worst ultimatum was when she put me in jail",
            "title_similarity": "0.5034205",
            "sentiment_compound": -0.6249
        },
        {
            "id": "i2nkefn",
            "score": 1,
            "text": "She wanted to have an open relationship or permission to cheat, or we were over.",
            "title_similarity": "0.36392176",
            "sentiment_compound": -0.4588
        },
        {
            "id": "i2nl3nb",
            "score": 1,
            "text": "The way",
            "title_similarity": "-0.17658256",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2nlld5",
            "score": 2,
            "text": "Move to a new city with me or I’m taking our daughter there without you. Worded nicer, but it was 100% an ultimatum. My daughter was born there, I stayed at home with her, and made more money but I was still worried she’d win custody.\n\nWe separated soon after we moved (shocking, I know) and we actually coparent extremely well now and are best friends. Everything actually worked out so whatever",
            "title_similarity": "0.6590569",
            "sentiment_compound": 0.9215
        },
        {
            "id": "i2nnjth",
            "score": 1,
            "text": "Glad to hear she is an ex. No sane person who give an ultimatum such as that. Hope you and your furry baby and doing good. Make sure to give your fur baby lots of pets for me, please.",
            "title_similarity": "0.67319",
            "sentiment_compound": 0.8807
        },
        {
            "id": "i2nnyf9",
            "score": 3,
            "text": "My wife withholds sex often.\nIdk why. I’m good looking, athletic and I spend more time with our kids than she does. I get them ready for school, walk with them to bus, pick them up, do homework. She cooks. I clean the dishes, give them baths and we alternate days to put them to bed.\nI’ve been telling her for 3 years the lack of sex is an issue. \nShe still only gives it up about once every 4/5 weeks. We had sex 13 times last year. And a total of 40x in 3 years.\nShe’s 41. I’m 33.\nI read several sources that say married couples aged 40-49 have sex 1.8x per week.\nNow she’s asking me to go through the process of upsizing our house. For a lofty amount of $$$… I’m strongly considering telling her that I don’t want to go in on a $775,000 house with a wife I can’t fuck. Period.\nI hate to be that guy, but shit, man!",
            "title_similarity": "0.77259266",
            "sentiment_compound": -0.75
        },
        {
            "id": "i2nog1s",
            "score": 2,
            "text": "Give up all my friends. Have nothing to do with my family. Give up my job. Move from my hometown. Learn to drive. This was on top of other ultimatums that I actually previously agreed to.",
            "title_similarity": "0.65195787",
            "sentiment_compound": 0.7184
        },
        {
            "id": "i2novbk",
            "score": 2,
            "text": "I don't have an ultimatum but Id keep the dog",
            "title_similarity": "0.36063975",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2o54e6",
            "score": 2,
            "text": "My now ex girlfriend had given me the ultimatum of her (who I have known for about 2 years at that point) or my female best friend (who Iv known since I could walk) so I told her to pack her shit and leave because I wasn’t about to just drop the person that Iv known since birth or someone that is just jealous of my friendship with her",
            "title_similarity": "0.7614299",
            "sentiment_compound": 0.34
        },
        {
            "id": "i2o8g0s",
            "score": 2,
            "text": "Threatened to commit suicide if I left her as she held a knife to her arm",
            "title_similarity": "0.50352156",
            "sentiment_compound": -0.743
        },
        {
            "id": "i2o9o3z",
            "score": 1,
            "text": "I learned as a teen if anyone ever gives you an ultimatum, you pick the ultimatum.",
            "title_similarity": "0.40387785",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2ooat2",
            "score": 1,
            "text": "Not so much an ultimatum but I said I needed to go to the dentist, she said get a better job that had benefits. I got a better wife instead.",
            "title_similarity": "0.62069327",
            "sentiment_compound": 0.9022
        },
        {
            "id": "i2p6zvn",
            "score": 1,
            "text": "Gonna own up to \"the worst\" ultimatum I gave my ex, at least he made it sound like it when he told everyone how terrible I was to give him this ultimatum.\n\nComing up to the summer break first year of uni, I was going back to Sweden for like 10 weeks, my ex (bf at the time) said long distance would be too hard for him (he really made it out like I would just stop existing and therefore it wouldn't be hard on me), and he wanted us to take a break over the summer and when I came back we could start dating again.\n\nI told him we either tried long distance or we broke up right away. He got upset, especially when I clarified that we would break up right away and not in two months when the term ended, and went and told everyone \"it felt like she gave me an ultimatum.\"\nI had to explain that there was no \"feeling like\", it was an ultimatum, plain and simple, as I wasn't gonna \"take a break\" so he could sleep around without feeling guilty.",
            "title_similarity": "0.77271855",
            "sentiment_compound": -0.7523
        },
        {
            "id": "i2pe70y",
            "score": 1,
            "text": "Babies before hoes",
            "title_similarity": "0.14580175",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2pgfr2",
            "score": 1,
            "text": "She cut herself with a knife and beat her self up and called the cops and told them I did that. I wasn’t even in the house I was at Walmart.",
            "title_similarity": "0.640344",
            "sentiment_compound": -0.2732
        },
        {
            "id": "i2pnslw",
            "score": 2,
            "text": "Every time my first husband and I had any kind of disagreement, no matter how trivial, he'd threaten to divorce me. During one argument, he told me to shut up or else. When I asked him if he really thought he was automatically right because he could beat me up, he answered, \"Well, you had best keep that in mind.\" Guess who left whom?",
            "title_similarity": "0.6977943",
            "sentiment_compound": -0.1943
        },
        {
            "id": "i2q12j6",
            "score": 1,
            "text": "When i started dating my wife she said I should know within 6 months if I wanted to marry her. So as 6 months approached, I broke up with her.\n\nBut jokes on her. Now she's my wife.",
            "title_similarity": "0.7200865",
            "sentiment_compound": 0.1531
        },
        {
            "id": "i2qc1o2",
            "score": 1,
            "text": "'If you don't let me have a cat I'm leaving.'\n\nk bye.",
            "title_similarity": "0.45768648",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2qdboj",
            "score": 1,
            "text": "The absolute madness in this thread I could literally top it, but this would take a reeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeealy long time to get all this shit down seriously it could be a book called falling in love with the crazy and don't be a noble self-sacrificing shit cause in the end you will be hurt and left to face the consequences of your sacrifices alone",
            "title_similarity": "0.56616294",
            "sentiment_compound": -0.9716
        },
        {
            "id": "i2reyal",
            "score": 1,
            "text": "She : “I get a dog, with or without your permission”\nTogether 7 years\nMarried 2 years\nJust bought an apartment",
            "title_similarity": "0.6828668",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2wwioi",
            "score": 1,
            "text": "Bit late not sure if it counts\n\nHer: Tell me who's dick you sucked in middle school (I was dumb) or I'm breaking up with you\nMe: *tells her*\nHer: *leaves me anyway \"",
            "title_similarity": "0.7225584",
            "sentiment_compound": -0.8901
        },
        {
            "id": "i334nq3",
            "score": 1,
            "text": "My ex told me that her mother had said I either had to start losing weight or get a full time job by the end of the month to prove I could take care of myself and thus take care of her. I was already working two part time jobs that totalled more than full time every week when I was dating her but man, hearing that really pissed me off.",
            "title_similarity": "0.778152",
            "sentiment_compound": -0.704
        },
        {
            "id": "i3gagy0",
            "score": 2,
            "text": "Keep the dog! Lose the ex!",
            "title_similarity": "0.47027463",
            "sentiment_compound": -0.508
        },
        {
            "id": "i4ufgjv",
            "score": 1,
            "text": "“I had my dog when I met you and I’ll still have her when you leave.”\n\nPut your dog first. She puts you first. Rare to find in a human. Someone who put you first wouldn’t put you in a position to make this decision.\n\nThis woman doesn’t have your best interests at heart.",
            "title_similarity": "0.6167506",
            "sentiment_compound": 0.886
        },
        {
            "id": "i5e8dzh",
            "score": 2,
            "text": "I can’t imagine being so awful as to tell someone this. I’m so glad it’s an ex.",
            "title_similarity": "0.40035743",
            "sentiment_compound": 0.0
        },
        {
            "id": "i5jo60c",
            "score": 1,
            "text": "She indirectly told me she would kill herself if I broke up with her",
            "title_similarity": "0.48571795",
            "sentiment_compound": -0.8176
        }
    ]
}