{
    "Pro-Trump group sent armed members door-to-door in Colorado to “intimidate” voters: Lawsuit | Lawsuit accuses Colorado group linked to Mike Lindell of violating the Ku Klux Klan Act and voting rights laws\n": [
        {
            "id": "i1j4rfu",
            "score": 14,
            "text": "God I wish a motherfucker would knock on my door like this.",
            "title_similarity": "0.43448225"
        },
        {
            "id": "i1jgpwz",
            "score": -1,
            "text": "[removed]",
            "title_similarity": "0.025070708"
        },
        {
            "id": "i1j3cat",
            "score": -2,
            "text": "[removed]",
            "title_similarity": "0.025070708"
        },
        {
            "id": "i1imoas",
            "score": 20,
            "text": "I’d love for them to knock on my door.",
            "title_similarity": "0.22015147"
        },
        {
            "id": "i1imp4w",
            "score": 95,
            "text": "Listen. STOP making fun of their tiny male genitalia, everybody, THEY DIDN’T CHOOSE TO HAVE TINY MALE GENITALIA. GOD DID. It’s like none of you have ever seen tiny male genitalia before. GROW UP.",
            "title_similarity": "0.33147997"
        },
        {
            "id": "i1j32ou",
            "score": 41,
            "text": "[removed]",
            "title_similarity": "0.025070708"
        },
        {
            "id": "i1jaywx",
            "score": 0,
            "text": "Are u telling me these racists are behaving like gop?",
            "title_similarity": "0.54303044"
        },
        {
            "id": "i1jbqoe",
            "score": 0,
            "text": "I WISH these people would come to my door and try this shit.",
            "title_similarity": "0.3953563"
        },
        {
            "id": "i1j7qpc",
            "score": 4,
            "text": "someone to give them a reason to shoot a minority.",
            "title_similarity": "0.36777467"
        },
        {
            "id": "i1ja3md",
            "score": 2,
            "text": "Towards the end of the article it becomes clear that they've been providing armed escorts to pedophiles onto the private properties of POC.",
            "title_similarity": "0.5754474"
        },
        {
            "id": "i1jejo6",
            "score": 9,
            "text": "This is incredibly disturbing… so I’d like to share my hilariously embarrassing voting story to lighten the mood.  Fuck those assholes.\n\nSo anyway, I was worried about this type of thing when I went to vote, as I’m sure many people were.  I live in the suburbs in a hotly contested voting area.  Essentially, we’re close enough to a major city to be a majority democratic voting block, but we’re right on the edge… one county out from us it’s rural red as far as the eye can see.\n\nI’m a middle aged white guy, which kinda makes the story.  There were rumors that some pick up trucks were gonna be parked in the parking lot “encouraging” people to vote for Trump.  At first I was gonna just vote in the city and avoid the drama, but I figured fuck that!  I’m gonna vote Democrat in the goddamn cornfields and everybody can fuck off.  This is a free country god damn it.\n\nThen I got there and I was kinda freaking out.  But no trucks.  That’s a good sign.  So as I walk towards the door, a black guy about my age is walking out.  Mind you, this is a hotly contested area during a potentially violent scenario, so my blood is rushing already, and I’m thinking I gotta say something to let this guy know I’m cool!  I want him to feel supported!  I don’t want him to think I’m one of those psychos everybody’s worried about.  He looks me up and down…then he holds the door for me and steps out of the way, and gives me a little nod.\n\nI was anxious to begin with, and all keyed up, so my brain wasn’t working properly or something.  So I shouted “THANKS BROTHER!!!”  in my best hulk hogan impersonation.   I walked through the door, and took another glance back at him, and this guy is just staring at me in complete baffled shock… probably thinking, “what a fucking nerd.” \n\nI’d like to think I broke the ice on the race barrier for that man, during a very stressful time.",
            "title_similarity": "0.60192347"
        },
        {
            "id": "i1jqy7c",
            "score": -1,
            "text": "On the topic of politics: One of the biggest criticisms of modern politics in my eyes is that it's lost a lot of nuance. It's become a winner take all game with both sides holding common ground hostage. Is it impossible to be a democrat against gun control and more powerful state governments? Is it impossible to be a republican that believes in prison reform and renewable energy investment? The Blue vs Red cesspool that is modern politics from both \"conservatives\" and \"progressives\" alike has suffocated away any potential for actual progress. The world isn't black and white, and there isn't a single politician alive that is right about everything, so it's time we started acting like it.",
            "title_similarity": "0.5987663"
        },
        {
            "id": "i1lbgcu",
            "score": -1,
            "text": "No it isn't time....when any person/party violates election law it needs to be addressed whether or not some judge or judges rule that the person challenging the results don't have standing. If you actually paid attention, they never said it didn't happen, they said the person didn't have standing to challenge, a fallicous reason, because as citizens we all have standing to challenge any election period. So no we can't let 2020 pass without making sure it doesn't happen again. And frankly I could give a rats ass if it one side or the other.",
            "title_similarity": "0.5836019"
        },
        {
            "id": "i1j7bjy",
            "score": 12,
            "text": "Colorado doesn’t really have conceal carry permits. The guns these folks are walking around with are being carried illegally",
            "title_similarity": "0.56239676"
        },
        {
            "id": "i1l7t70",
            "score": -3,
            "text": "Is it open carry? \n\n“Open carry is legal in Colorado for any person who is at least 18 years old and who can legally possess a firearm, except in Denver county and other posted areas.Dec 13, 2021”\n\nSensational headline is sensational for people too dumb to look up the facts.",
            "title_similarity": "0.62457806"
        },
        {
            "id": "i1j4z0y",
            "score": 13,
            "text": "Quick way of getting shot at through a door",
            "title_similarity": "0.27260253"
        },
        {
            "id": "i1kixib",
            "score": 12,
            "text": "I don't get it. Why do you ONLY here about the right doing this. It MUST be because the media is biased and not some other reason. edit: woah I thought my sarcasm was palpable. guess not.",
            "title_similarity": "0.43996447"
        },
        {
            "id": "i1kd1dk",
            "score": 2,
            "text": "Ok now is the time guys. Now is the time to show me with some verifiable evidence that anyone on the left does anything of this nature. You can even use Antifa it you want. All I need is one incident.",
            "title_similarity": "0.36699867"
        },
        {
            "id": "i1iwxbe",
            "score": 58,
            "text": "This is from the side that was all upset if people went door to door promoting the vaccine but this is totally ok? Wtf?",
            "title_similarity": "0.5063913"
        },
        {
            "id": "i1jfc29",
            "score": -36,
            "text": "Where are the reports made to police? Is there any CCTV footage? Doorbell cameras? Even a cell phone video? In a day and age where you a cat can’t shit in the bushes without being recorded why is there no substantive evidence beyond witness statements (which are easily falsified)?",
            "title_similarity": "0.48924047"
        },
        {
            "id": "i1jckqo",
            "score": -6,
            "text": "Oh please show up at my door (half a mile past the Range Safety Area No Trespassing No Firearms signs) armed and trying to intimidate. Please oh please oh please….",
            "title_similarity": "0.65264314"
        },
        {
            "id": "i1jbbbd",
            "score": 26,
            "text": "Crazy how there’s no reports of Biden supporters doing the same",
            "title_similarity": "0.29566485"
        },
        {
            "id": "i1j8ols",
            "score": -42,
            "text": "Sounds like Russian propaganda what a coincidence it being for TRUMP",
            "title_similarity": "0.44221324"
        },
        {
            "id": "i1jdgj6",
            "score": 8,
            "text": "If smith, bannon and lindell, and anyone else who participated, aren't arrested for coercion, I'm done. So now the gop can openly go and harass citizens for voting their conscience? gop needs to be shut down completely. The longer they are allowed to exist, the further over the line the step.",
            "title_similarity": "0.6370788"
        },
        {
            "id": "i1j4sb8",
            "score": -23,
            "text": "The USA has some pretty bad food laws for one thing. \n\nIn the USA companies are still allowed to call something '100% juice\" even if they added mass amounts of liquid sugar, as long as that syrup is made from juice originally.  Orange juice is a little different.   This is called \"stripping\".",
            "title_similarity": "0.41592136"
        },
        {
            "id": "i1ipmgz",
            "score": 7,
            "text": "[removed]",
            "title_similarity": "0.025070708"
        },
        {
            "id": "i1j4g7l",
            "score": 8,
            "text": "If armed persons enter my property, can I legally keep their weapons after I disarm them?",
            "title_similarity": "0.55161595"
        },
        {
            "id": "i1ilku1",
            "score": 17,
            "text": "Buttery Males!",
            "title_similarity": "0.034702525"
        },
        {
            "id": "i1j1rl0",
            "score": 7,
            "text": "Should have used that activism to promote vaccinations door-to-door",
            "title_similarity": "0.3359266"
        },
        {
            "id": "i1jzmen",
            "score": 2,
            "text": "Remember kids \"the county\" does not enforce voting laws. The state does.",
            "title_similarity": "0.4330051"
        },
        {
            "id": "i1kym6t",
            "score": 2,
            "text": "Show up at my door with a weapon and you’d better be ready to use it motherfucker.",
            "title_similarity": "0.48874754"
        },
        {
            "id": "i1l7qt1",
            "score": -3,
            "text": "The article heading is a total lIe!!! Colorado is an open carry state.",
            "title_similarity": "0.62932736"
        },
        {
            "id": "i1ljvo4",
            "score": -3,
            "text": "This is SO FAKE. I can't believe you guys keep falling for these racist narratives pushed by the fake media to cause race wars. No one's going door to door.",
            "title_similarity": "0.6243516"
        },
        {
            "id": "i1j7vqf",
            "score": 35,
            "text": "Just remember... VOTE DEMOCRAT!! I'm not saying the Dems are always right. However, the only way to end Republican rule and progress our nation forward, is to vote Dem. Not voting is no longer an option... unless you want to end up like the Russian people!",
            "title_similarity": "0.52093357"
        },
        {
            "id": "i1izq8o",
            "score": 0,
            "text": "Yeah but what ya gonna do...",
            "title_similarity": "0.025306927"
        },
        {
            "id": "i1jdg6m",
            "score": 0,
            "text": "These guys played a Red Dead Redemption 2  quest line and thought \"this is a great idea to base a movement on\"",
            "title_similarity": "0.34313256"
        },
        {
            "id": "i1jf1q6",
            "score": 0,
            "text": "Just shut the door in their face.",
            "title_similarity": "0.25926444"
        },
        {
            "id": "i1jh27l",
            "score": 0,
            "text": "They need to be not only arrested but publicly made an example of",
            "title_similarity": "0.46212935"
        },
        {
            "id": "i1jh36f",
            "score": 0,
            "text": "Color me surprised, now will there be consequences?",
            "title_similarity": "0.21044843"
        },
        {
            "id": "i1jhsv8",
            "score": 0,
            "text": "The only thing intimidating about this photo is how pale his gut is.",
            "title_similarity": "0.22619355"
        },
        {
            "id": "i1jj06g",
            "score": 0,
            "text": "Duh.",
            "title_similarity": "-0.13446796"
        },
        {
            "id": "i1jv9tg",
            "score": 0,
            "text": "[deleted]",
            "title_similarity": "0.04714236"
        },
        {
            "id": "i1k3zzp",
            "score": 0,
            "text": "I would love to see some recordings by people catching these morons in the act.  \n\nThat is sure to be some prime content.",
            "title_similarity": "0.4290399"
        },
        {
            "id": "i1k79iq",
            "score": 0,
            "text": "They would have been shot in the face. Some bulls***",
            "title_similarity": "0.45754457"
        },
        {
            "id": "i1kcm00",
            "score": 0,
            "text": "Any phone video of this actually happening?",
            "title_similarity": "0.16267638"
        },
        {
            "id": "i1kv73o",
            "score": 0,
            "text": "AintNothingGonnaHappen.gif",
            "title_similarity": "0.012311688"
        },
        {
            "id": "i1kwlq8",
            "score": 0,
            "text": "PLEASE knock on my door!",
            "title_similarity": "0.17095926"
        },
        {
            "id": "i1kz252",
            "score": 0,
            "text": "Can you shoot these guys and claim self defence?",
            "title_similarity": "0.5640892"
        },
        {
            "id": "i1l19s6",
            "score": 0,
            "text": "U step on my property lol castle 😂 Doctrine told u get the duk off my property jk",
            "title_similarity": "0.54854226"
        },
        {
            "id": "i1l4kvw",
            "score": 0,
            "text": "Y'all remember Homeland Security? Feels like they should round up all these fucking terrorists and lock them up.",
            "title_similarity": "0.69638693"
        },
        {
            "id": "i1l63l2",
            "score": 0,
            "text": "How absolutely awesome would it be if one of these guys got blasted with a shot gun through a door. Because the look like some lunatic showing up on the person porch armed..",
            "title_similarity": "0.6169894"
        },
        {
            "id": "i1l6wog",
            "score": 0,
            "text": "Bruh, i peep though the peep hole of my place and a see bunch of armed men, im shooting through the door; yall look like your funna rob me",
            "title_similarity": "0.59652674"
        },
        {
            "id": "i1lhyih",
            "score": 0,
            "text": "Yeah ok",
            "title_similarity": "-0.21435891"
        },
        {
            "id": "i1linxe",
            "score": 0,
            "text": "Lmao at all the cringe badasses in this thread",
            "title_similarity": "0.39921916"
        },
        {
            "id": "i1ljwpx",
            "score": 0,
            "text": "Come to my door and I’ll give them dee nuts",
            "title_similarity": "0.29665565"
        },
        {
            "id": "i1lk9ov",
            "score": 0,
            "text": "Omg this sub is shameless and wreaks of desperation lol",
            "title_similarity": "0.38102126"
        },
        {
            "id": "i1llkr8",
            "score": -5,
            "text": "I didn't know Trump was in the White House. He's much worse than Trump because he has so many people fooled. The leftist propaganda machine runs 24/7/365 and that's why people believed Joe when he said the contents of Hunter's laptop was \"Russian disinformation\"! He's lied throughout his political career but this was during an election campaign! Millions have already been polled and say if they'd known the truth they wouldn't have voted for him. In all things he's not presidential. Even Obama said \"Never underestimate Joe's ability to f**k things up!\" Yet so many lap up whatever he says. Even if they can't understand it!",
            "title_similarity": "0.7058507"
        },
        {
            "id": "i1lmy5e",
            "score": 0,
            "text": "This is stupid and ridiculous. I am pro trump but this here is actually going to make the republicans fear for their life and continue to vote for liberation. Let things go naturally and don’t interfere with what will happen already. The far right is also dumb for this",
            "title_similarity": "0.6423892"
        },
        {
            "id": "i1lpcer",
            "score": 0,
            "text": "Its Colorado. Should have opened the door blasting",
            "title_similarity": "0.488701"
        },
        {
            "id": "i1lqltq",
            "score": 0,
            "text": "I am pro-ice cream, however I do not speak on behalf of all ice cream manufacturers or consumers.",
            "title_similarity": "0.4121989"
        },
        {
            "id": "i1ltler",
            "score": 0,
            "text": "War in Europe in here. America will divide",
            "title_similarity": "0.5127622"
        },
        {
            "id": "i1lwvzj",
            "score": 0,
            "text": "It's time to start shooting these people, for an ironic twist they won't see coming.",
            "title_similarity": "0.5089612"
        },
        {
            "id": "i1lxa5y",
            "score": 0,
            "text": "Good way to get shot",
            "title_similarity": "0.18871576"
        },
        {
            "id": "i1m4bea",
            "score": 0,
            "text": "Idiot media..",
            "title_similarity": "0.20602544"
        },
        {
            "id": "i1m4pbd",
            "score": 0,
            "text": "I’ve campaigned door to door for people, I’ll never go on someone’s property unarmed.",
            "title_similarity": "0.45760846"
        },
        {
            "id": "i1nbp7x",
            "score": 0,
            "text": "Get a life... Better yet, get a job. Nice collection of CNN keywords.",
            "title_similarity": "0.2712456"
        },
        {
            "id": "i1ndzh1",
            "score": 0,
            "text": "Media is trying so hard to turn attention away from Biden and dems terrible policies that are very destructive to this country..he has he worst approval rating if any president..and as time goes on expect many attacks on Trump..it'sthe only thing  the democrats can do well ..LIE that's it..where's Hunter,,why did Biden lie about laptop saying it was Russian mis info..you are a lying jerk and need to be removed....keep on blaming everyone else",
            "title_similarity": "0.70682263"
        },
        {
            "id": "i1nj5r4",
            "score": 0,
            "text": "I feel the author is misleading readers. It happens alot. I'm sure the people opening their doors could've felt uneasy by an armed stranger. But open carry IS legal in Colorado. I would like to see the police reports of the threats that were made. If infact people were actually being threatened, then this article wouldve mentioned the arrests made. Just out of curiosity. WHY was it okay for protestors to threaten people when Trump was in office?",
            "title_similarity": "0.81192553"
        },
        {
            "id": "i1noo0d",
            "score": 0,
            "text": "Only thing we need Trump 2024",
            "title_similarity": "0.21560074"
        },
        {
            "id": "i1nrauf",
            "score": 0,
            "text": "FAKE NEWS. Being armed is legal. Did they draw weapons to intimidate? Call B.S.",
            "title_similarity": "0.593766"
        },
        {
            "id": "i1nv3ve",
            "score": 0,
            "text": "There is no intimidation here. They are investigating. They are knocking on doors and asking questions. The people do not have to respond if they do not want to. More fake news trying to hide the truth. Leftist morons will eat this up though.",
            "title_similarity": "0.47086334"
        },
        {
            "id": "i1szewv",
            "score": 0,
            "text": "you guys are actually still not done talking about Trump? you have everything in the world to talk about and its till Trump? day in and day out??",
            "title_similarity": "0.49182132"
        },
        {
            "id": "i2346xn",
            "score": 0,
            "text": "Oh yeah this has all the trademarks of Democrats and BLM they actually did this shit it's never prosecuted for it yet they staged some bullshit like this and try to save it conservatives did it I don't buy anything that boob tube says nothing but liars nothing but liars on any channel in USA not a single truth has been told on TV news as long as I can remember",
            "title_similarity": "0.5555372"
        },
        {
            "id": "i2pku9n",
            "score": 0,
            "text": "Oh. Everyone is shitting their britches now that the “non-racist’, White Supremacist invoking, leftist and “people of color” have drawn out the extreme racists.  Sorry, but, you get what you put out there. And since White Supremacist get blamed for a lot these days, they’re just coming to collect and reclaim their infamy by doing what they are infamous for. I mean. Come on. Hate breeds hate breeds hate breeds hate…efc",
            "title_similarity": "0.6359325"
        },
        {
            "id": "i1iytyd",
            "score": 20,
            "text": "*coming soon to FL*\n\nSince DeathSantis signed in the fascist election police law in, this will most likely start to happen in FL.",
            "title_similarity": "0.46498197"
        },
        {
            "id": "i1ja4sf",
            "score": -10,
            "text": "Does someone have a more accurate article? Perhaps from AP or Reuters?",
            "title_similarity": "0.3524642"
        },
        {
            "id": "i1j6zlo",
            "score": 5,
            "text": "Asking to get blown the fuck back. You never know who answers the door with a shotgun.",
            "title_similarity": "0.5578001"
        },
        {
            "id": "i1j7bym",
            "score": 5,
            "text": "I'm really curious what right do people think they have to go up to someone's house and ask them how they voted. That takes some audacious balls. But we're talking about rural white men here who, although they probably have physically small balls, they like to pretend that they have big balls to do this because this is \"their\" country. I fucking abhor these types and wish nothing but bad things to happen to them. Maybe pick up an HCA.",
            "title_similarity": "0.60682845"
        },
        {
            "id": "i1jhpum",
            "score": 6,
            "text": "Kkk ran my family out of a small town. Colorado had kkk children killing other kids in the 60s and still wont serve black ppl in Yampa.",
            "title_similarity": "0.7372992"
        },
        {
            "id": "i1iwn81",
            "score": -69,
            "text": "So very interesting. I remember a few years back as Black Panthers showed  up at voting locations, armed with rifles...you know, just to keep peace.\n\nJust Google it.",
            "title_similarity": "0.61243075"
        },
        {
            "id": "i1j7ge9",
            "score": -1,
            "text": "[removed]",
            "title_similarity": "0.025070708"
        },
        {
            "id": "i1j8n44",
            "score": 1,
            "text": "So are these people not arrested?",
            "title_similarity": "0.18030554"
        },
        {
            "id": "i1jawzd",
            "score": 1,
            "text": "So how is this not considered domestic terrorism? If black people did this in white neighborhoods we would have a police led slaughter.",
            "title_similarity": "0.6126759"
        },
        {
            "id": "i1jbjoa",
            "score": 1,
            "text": "So they’ll be charged federally right? Right???",
            "title_similarity": "0.3264408"
        },
        {
            "id": "i1jbpl4",
            "score": 1,
            "text": "Want to say i’m so glad to live in Canada, but all of the nonsense going on down there invariably effects us...",
            "title_similarity": "0.41611826"
        },
        {
            "id": "i1jc0f8",
            "score": 1,
            "text": "What are the stand your ground laws in CO like these days? If someone shows up at my house with a gun who isn't law enforcement and starts questioning me and interrogating me and doesn't leave immediately when I tell them too are going to see how quick they are.",
            "title_similarity": "0.6509763"
        },
        {
            "id": "i1jcd4x",
            "score": -1,
            "text": "I've got a great idea for how to use his pillows.",
            "title_similarity": "0.15928076"
        },
        {
            "id": "i1jceur",
            "score": 1,
            "text": "Members of our well regulated militia!",
            "title_similarity": "0.21124674"
        },
        {
            "id": "i1jd34i",
            "score": 1,
            "text": "And look how threatening people lives turned out....fuckin losers.\n\nAnd 2: they're not the only people who legally can carry guns. So imaging going on someone's property intimidating them and not expecting to get shot",
            "title_similarity": "0.6509409"
        },
        {
            "id": "i1jdi8o",
            "score": 1,
            "text": "Why does this not surprise me? Bunch of thugs.",
            "title_similarity": "0.41356155"
        },
        {
            "id": "i1jdr91",
            "score": 1,
            "text": "Can someone uphold the law? Asking for American s everywhere.",
            "title_similarity": "0.41579568"
        },
        {
            "id": "i1jdsbc",
            "score": 1,
            "text": "Mike Lindell? That guy who sells something on the radio?",
            "title_similarity": "0.3011936"
        },
        {
            "id": "i1jdsbe",
            "score": 1,
            "text": "Freedom of speech 1st Amendment is one thing, but at some point we need to decide between what’s censorship and what’s just an illegal menace, call people out and prosecute the Birds Aren’t Real/Microchips in Vaccines and Hotdog Water Cures and Prevents Covid people. \nA lot of good people trying to go to work, pay bills and save money at Zero% interest for retirement.",
            "title_similarity": "0.6027709"
        },
        {
            "id": "i1je28a",
            "score": 1,
            "text": "Colorado has a reputation for being pretty liberal, but the rednecks in that state are fucking extreme. Just moved from there to the South East and while there’s red necks aplenty here the ones in Colorado are a different breed. Oil working plains folk with nothing to do but hate the government.",
            "title_similarity": "0.72660476"
        },
        {
            "id": "i1je7ht",
            "score": 1,
            "text": "People need to wake up to what the gop has become under trump.  They are no longer pro democracy.  To many in the gop support or are cautiously silent on what putin is doing same as they will support or be cautiously silent with voter intimidation in America.  Today gop want authoritarian rule in America.",
            "title_similarity": "0.665429"
        },
        {
            "id": "i1jebu2",
            "score": 1,
            "text": "There should be legislation that says if you're caught trying to subvert democracy, the government takes every penny/asset you have and gives it to voting rights groups. Trump and Lindell included.",
            "title_similarity": "0.642988"
        },
        {
            "id": "i1jefnt",
            "score": 1,
            "text": "And because all of them together have a combined IQ of 47, there will most likely be violence. God bless America and their stupid ass gun laws. \n\nAnd yes, I know, not everyone is like that in the US. But people who do this kind of nonsense are the worst.",
            "title_similarity": "0.6559217"
        },
        {
            "id": "i1jeqp4",
            "score": 1,
            "text": "Sheesh.  Lucky that nobody really took offense and went wild west.",
            "title_similarity": "0.23841925"
        },
        {
            "id": "i1jf97s",
            "score": 1,
            "text": "Nothing says American like the freedom to threaten citizens’ freedom to vote.",
            "title_similarity": "0.48326573"
        },
        {
            "id": "i1jfey6",
            "score": -1,
            "text": "When Mormons go too far",
            "title_similarity": "0.3000095"
        },
        {
            "id": "i1jfptk",
            "score": 1,
            "text": "Oh they're all going to jail right?",
            "title_similarity": "0.4242526"
        },
        {
            "id": "i1jfqzr",
            "score": 1,
            "text": "Its quite clear that a significant amount of Republicans wish to return this county to the days where only white men can vote. These actions are not seen as too extreme by the average Republican and none of Trump and his Brown Shirt antics have been decried by the rank and file Republicans. To be a Republican in this time is to be promoting the worst possible outcome for the US.",
            "title_similarity": "0.5361381"
        },
        {
            "id": "i1jftzh",
            "score": 1,
            "text": "What an opportunity for these numb nuts to see the Second Amendment in action when they come on to private property armed and uninvited!",
            "title_similarity": "0.5639814"
        },
        {
            "id": "i1jg5xg",
            "score": 1,
            "text": "Once again members of the right participating in voter suppression and full stop fascism. uno American traitors.",
            "title_similarity": "0.6542919"
        },
        {
            "id": "i1jgc0j",
            "score": -1,
            "text": "If i lived in the US i would open my door with a fucking minigun",
            "title_similarity": "0.42480525"
        },
        {
            "id": "i1jgeb4",
            "score": -1,
            "text": "This is ridiculous. Who falls for this?\n\nIf some moron came to my door and asked me these stupid questions I'd tell him to F off, then I'd be calling the cops.",
            "title_similarity": "0.6274583"
        },
        {
            "id": "i1jgeqe",
            "score": 1,
            "text": "I would have called the police if they showed up at my door.",
            "title_similarity": "0.4492439"
        },
        {
            "id": "i1jgexc",
            "score": 1,
            "text": "When are we going to start labeling these idiots as domestic terrorists? C'mon.",
            "title_similarity": "0.63932025"
        },
        {
            "id": "i1jhjz6",
            "score": 1,
            "text": "Can we just call him Mike we dont need to be reminded of his shitty pillow company every opportunity likes is just more advertising for him",
            "title_similarity": "0.47740293"
        },
        {
            "id": "i1jir9a",
            "score": 1,
            "text": "Guess I'll start answering my door with my AK-47 then. \n\n\"Oh hi. How are you today? Really? How is it any of your business how I vote? Ahhh.. Mmmkay. Interesting. Yeah. No, no I'm not interested. Thank you. Have a nice day.\"",
            "title_similarity": "0.40844297"
        },
        {
            "id": "i1jizfo",
            "score": 1,
            "text": "I WISH a bunch of pussies came to my house with their weapons in toe as a discrimination tactic!!!! Please!!!! Come over to intimidate me to vote for that orange fucking toad!!!",
            "title_similarity": "0.60803115"
        },
        {
            "id": "i1jk8ud",
            "score": -1,
            "text": "These pussies would get rekt knocking on my door…",
            "title_similarity": "0.40281713"
        },
        {
            "id": "i1jkgr0",
            "score": -1,
            "text": "If they came to my. Door my dogs would tore them up. And then tbe buck shot would have finished tbem",
            "title_similarity": "0.5947478"
        },
        {
            "id": "i1jkh2j",
            "score": 1,
            "text": "It's not intimidation, they're just asking questions /s",
            "title_similarity": "0.014967918"
        },
        {
            "id": "i1jnzp5",
            "score": 1,
            "text": "My wife and I were talking about these people because there seems to be fears this will happen around polling places (or as close as they can legally get). \n\nNot to make light of how absolutely horrible this is for PoC, voting rights and democracy, but I laughed and said I would just lie and say I voted for the Trump backed candidate. They can wait until that night to be disappointed",
            "title_similarity": "0.67262506"
        },
        {
            "id": "i1joh16",
            "score": 1,
            "text": "An armed minority is an unoppressed minority.\n\nI wonder how confident this literal human trash fuck sticks would feel seeing every person's door they knocked on cleaning an AR15.",
            "title_similarity": "0.51383805"
        },
        {
            "id": "i1jojcq",
            "score": 1,
            "text": "All these “voter fraud” investigations remind me so much of the manbearpig episodes of South Park",
            "title_similarity": "0.62060976"
        },
        {
            "id": "i1jqcxh",
            "score": 1,
            "text": "Fascism is rising.",
            "title_similarity": "0.23196045"
        },
        {
            "id": "i1jt6y5",
            "score": -1,
            "text": "well I suppose they can't do that in states where everyone has sufficient weapons",
            "title_similarity": "0.3781655"
        },
        {
            "id": "i1kfrdq",
            "score": -1,
            "text": "That’s a nice ass 1911 tho",
            "title_similarity": "-0.023933267"
        },
        {
            "id": "i1kl94y",
            "score": -1,
            "text": "this is horse shit. people open carry in colorado even in denver. No one was scared there",
            "title_similarity": "0.41283613"
        },
        {
            "id": "i1kmgss",
            "score": 1,
            "text": "Deleted: Time to take a page out of the Rittenhouse/Goetz playbook: walk up to these fucks with rifle in hand, loaded with the safety off, and as soon as any of them reach down toward their gun, blow them away and say you were afraid. End Deleted.\n\nWhen it comes to these racist fuqs literally destroying my country, well, gonna have to agree and go ahead and follow through on this. \n\nComplacency and neutrality doesn't make it so you avoid picking a side. \n\nI'm done choosing to be on the wrong side by staying silent inside my house like a sheep!",
            "title_similarity": "0.66600007"
        },
        {
            "id": "i1knzlo",
            "score": 1,
            "text": "Ah yes make all gun owners look bad fuck MAGA idiots",
            "title_similarity": "0.5997299"
        },
        {
            "id": "i1kqzmt",
            "score": 1,
            "text": "You come to my door with a gun wearing a mask?  I call that a prelude to a home invasion and will act accordingly. Doesn’t the castle doctrine apply here?",
            "title_similarity": "0.6129235"
        },
        {
            "id": "i1ktdeb",
            "score": -1,
            "text": "Well this glows from a mile off",
            "title_similarity": "0.06393118"
        },
        {
            "id": "i1kx005",
            "score": -1,
            "text": "This is what happens when people feel like their system is corrupt. Dems accused the system of corruption in 2016.\n\nI am truly concerned that there will be REAL major bloodshed in the future.\n\nOur politicians and system is corrupt and only getting worse.\n\nWith big tech and mainstream media stoking the fires, a certain faction is very likely to reach their boiling point and light the keg in the 5-10 years.",
            "title_similarity": "0.683249"
        },
        {
            "id": "i1l4kuv",
            "score": -1,
            "text": "False flag for my opinion…. At this point everything related to guns, white ppl, pro American flag is related to trump…A2 is for everyone, even liberals & democrats.",
            "title_similarity": "0.6117325"
        },
        {
            "id": "i1l5tgh",
            "score": 1,
            "text": "According to conservatives - this is Ok.\n\nBut handing out bottles of water at voting site? Grounds for execution.",
            "title_similarity": "0.5187558"
        },
        {
            "id": "i1l95kb",
            "score": -1,
            "text": "Why do both sides think this will help their image?",
            "title_similarity": "0.19171692"
        },
        {
            "id": "i1lji25",
            "score": 1,
            "text": "Can you imagine a bunch of African-Americans showing up on people's doorstep with guns asking them to vote????",
            "title_similarity": "0.6459291"
        },
        {
            "id": "i1lk6mq",
            "score": 1,
            "text": "Sound to me like a; Hold your ground situation.",
            "title_similarity": "0.0289578"
        },
        {
            "id": "i1lnjar",
            "score": 1,
            "text": "I am so sick of seeing 1911’s holstered with un-cocked hammers. How in the fuck are you going to quickly defend yourself against some gay Lib when your pistol isn’t even ready to fire?!",
            "title_similarity": "0.5944326"
        },
        {
            "id": "i1lpwft",
            "score": 1,
            "text": "I've never seen my Dad as pissed as the day a guy we knew brought a loaded gun into his house. He absolutely lost his shit and I kind of get it now. I would definitely not like it if some ass clown came to my front door with a loaded gun that i didnt know. (I might be in fear of my life /s)",
            "title_similarity": "0.64788777"
        },
        {
            "id": "i1lrp3g",
            "score": -1,
            "text": "Lies",
            "title_similarity": "0.17371543"
        },
        {
            "id": "i1lsbm8",
            "score": 1,
            "text": "Quick way to get shot on many people’s property.  Dont come to my house with a gun and tell me what to do…. You would regret it.",
            "title_similarity": "0.6545483"
        },
        {
            "id": "i1m7xhp",
            "score": -1,
            "text": "Hahaha hahaha hahaha hahaha hahaha.  What absolute bs. And the comments back it up.   Bet it gets tossed out",
            "title_similarity": "0.3159765"
        },
        {
            "id": "i1meogg",
            "score": -1,
            "text": "Jussie is really stepping up the act.",
            "title_similarity": "0.09414117"
        },
        {
            "id": "i1n2l1d",
            "score": -1,
            "text": "Oh yes that’s right! That’s right after the routers were turned in by a whistle blower that showed some interesting things and they were going around verifying votes… I wonder why they’d be checking votes?",
            "title_similarity": "0.50532037"
        },
        {
            "id": "i1qvnwi",
            "score": -1,
            "text": "Ukraine is corrupt and Biden’s son, Nancy Pelosi son, Mitt Romney son, are all on Ukrainian energy company boards. So, if fuel skyrockets- they get paid. If America goes to any other type of energy - battery, electric , natural gas, or whatever- they get paid!\nThat’s the facts Jack",
            "title_similarity": "0.5994662"
        },
        {
            "id": "i1yhixw",
            "score": -1,
            "text": "Better than going door to door burning the place down in addition to intimidating as ANTIFA does.",
            "title_similarity": "0.4543749"
        },
        {
            "id": "i1l5eqd",
            "score": -7,
            "text": "I call bull shit, just more left wing propaganda.",
            "title_similarity": "0.47452486"
        },
        {
            "id": "i1l92j2",
            "score": -7,
            "text": "Salon probably shouldn't be allowed as a source. \n\nThis is from a single complaint and has nothing to do with Mike Lindell.",
            "title_similarity": "0.3638262"
        },
        {
            "id": "i1jeyf5",
            "score": -36,
            "text": "I honestly doubt the validity of the claims. I live in Larimer, next to Weld county. We have heard ZERO claims like this going on. Weld county, IS cowboy country. More than likely, this was just open carry, during voter registration. Which, open carry is extremely common in cowboy country. These areas are farm land. Tho, I’d be open to see evidence that this occurred. Until than, as someone who lives in the area, this is definitely NOT true.",
            "title_similarity": "0.5277316"
        },
        {
            "id": "i1jg51e",
            "score": -34,
            "text": "You should take this \"story\" with a huge grain of salt, because I can find no instance where the local media, IE. The Denver post, TV news channels 2,4,7,9,20,31 made any mention of this at all",
            "title_similarity": "0.45049933"
        },
        {
            "id": "i1jg55p",
            "score": -33,
            "text": "This sounds incredibly suspect and over exaggerated",
            "title_similarity": "0.24541374"
        },
        {
            "id": "i1j0t77",
            "score": -23,
            "text": "Man kind is  engaged in an eternal quest for that “something else” he hopes will bring happiness, complete and unending. \nFor those individual souls who have sought and found God, the search is over. He is that something else. \n-Paramahamsa Yogananda",
            "title_similarity": "0.3046527"
        },
        {
            "id": "i1jgwsg",
            "score": -23,
            "text": "The only thing worse than this is people actually believe this stuff is true. It's so ironic that the point of this article is to make bleeding hearts confirm they're doing the right thing but all it's doing is exposing how gullible they can be and the depths of stupidity they'll sink to for confirmation in themselves.",
            "title_similarity": "0.48462862"
        },
        {
            "id": "i1ku4gp",
            "score": -8,
            "text": "Sorry, I see [salon.com](https://salon.com) and immediately my suspicion is raised to DEFCON 1.  They are highly biased and frequently don't vet their sources, if they even cite them.  I find it is important to believe only half of what you read, none of what you hear.  Also, now that the NYT has come out supporting the laptop story previously reported by the NY Post, how can you take any news source at face value, when they are quick to politicize their reporting?",
            "title_similarity": "0.5565674"
        },
        {
            "id": "i1jeyli",
            "score": -35,
            "text": "Because there is no way a story can be twisted around to make it look one way or another?Journalism is dead, right or left, all “news” has a spin on it.  Stop reading stories like this and taking it as fact, like most of the nonsense spread about Trump during the election and his presidency.  You are all being manipulated.  There are thousands of first hand accounts of voter fraud during the last election and they were suppressed.  Just like these news stories that say “debunked voter fraud claims” and such statements like that.  How can anyone say one way or another there was or wasn’t voter fraud?  Stop being sheep!!",
            "title_similarity": "0.6819153"
        },
        {
            "id": "i1inlvq",
            "score": 10,
            "text": "So its either the Jehovahs witness or a gunman?",
            "title_similarity": "0.5215549"
        },
        {
            "id": "i1j0of8",
            "score": 2,
            "text": "I live in Colorado. In a suburb of Denver, at a Walmart, they had someone go over the intercom and talk about how our democratic candidate is handing out free crack pipes.",
            "title_similarity": "0.55980664"
        },
        {
            "id": "i1j7zu3",
            "score": 2,
            "text": "Remember when Republican voters and the GOP said and were worried that democrats and government officials would be going around during the pandemic and administering vaccinations or tests… and now the gop is threatening anyone who didn’t vote red on the grounds of “voter fraud”. And if you have nothing to hide why are you getting so defensive.. If this isn’t dealt with to the fullest extent of the law than truly we are fucked.",
            "title_similarity": "0.74428517"
        },
        {
            "id": "i1j883x",
            "score": 2,
            "text": "The GOP party is so desperate knowing they can't win unless they cheat and intimidate Americans into voting their way.",
            "title_similarity": "0.65870094"
        },
        {
            "id": "i1j89dt",
            "score": 2,
            "text": "Knock knock who’s there? Kkk who got shot the fuck up!",
            "title_similarity": "0.57637525"
        },
        {
            "id": "i1j8awx",
            "score": -2,
            "text": "Why bother suing? The quickest way to prevent this is just for an armed group to go and question republicans.",
            "title_similarity": "0.6089059"
        },
        {
            "id": "i1j8ccz",
            "score": 2,
            "text": "Make an example of these assholes. Share with the world, their employers, their neighbors, and anyone with eyes that they are essentially the klan 2.0. Take the fucking gloves off and ruin these seditionists.",
            "title_similarity": "0.71306753"
        },
        {
            "id": "i1j8fiu",
            "score": 2,
            "text": "My ⬆️ is for the lawsuit, not the racist bigots.",
            "title_similarity": "0.33314705"
        },
        {
            "id": "i1j8l0m",
            "score": 2,
            "text": "At least Republicans still believe in grassroots campaigns **/s**...",
            "title_similarity": "0.2910035"
        },
        {
            "id": "i1j8l2e",
            "score": 2,
            "text": "Why am I not surprised that a group of thugs working for a thug bothered and intimidated voters? Why am I not surprised some of them were armed and they picked on POC and people in poorer areas?",
            "title_similarity": "0.6429167"
        },
        {
            "id": "i1j8mse",
            "score": 2,
            "text": "[deleted]",
            "title_similarity": "0.04714236"
        },
        {
            "id": "i1j8nl2",
            "score": 2,
            "text": "Why are all these terrorists and violent scum conservative?",
            "title_similarity": "0.6719035"
        },
        {
            "id": "i1j9089",
            "score": 2,
            "text": "Shit like this is why I still would not change my vote. I’ll take a sucky president over an outright fascist any day.",
            "title_similarity": "0.53618693"
        },
        {
            "id": "i1ja3lc",
            "score": 2,
            "text": "Jesus fucking christ",
            "title_similarity": "0.13665798"
        },
        {
            "id": "i1jabc7",
            "score": 2,
            "text": "Isn’t this part of the literal definition of terrorism?",
            "title_similarity": "0.37665164"
        },
        {
            "id": "i1jahmf",
            "score": 2,
            "text": "This is the future Republicans want and desire. To be a Republican means winning by any means you can find. There is no bottom. \n\nDo not expect them to wake up one day and start being decent or reasonable. They mean to remain in power, and they will use intimidation and any other trick they can find.",
            "title_similarity": "0.49108878"
        },
        {
            "id": "i1jam3c",
            "score": 2,
            "text": "It will be great when they're all charged with felonies and lose the right to vote.",
            "title_similarity": "0.54377675"
        },
        {
            "id": "i1jaobi",
            "score": 2,
            "text": "If you are NOT ok with this, VOTE.  Look at the candidates and make good decisions.  We already have far-right candidates who see nothing wrong with this kind of thing running for important local positions, like overseeing elections or Boards of Supervisors or School Boards or local sheriff, etc.",
            "title_similarity": "0.4292873"
        },
        {
            "id": "i1jap1v",
            "score": 2,
            "text": "Republicans are fine with this, all the more so if it works.",
            "title_similarity": "0.13933745"
        },
        {
            "id": "i1jayhl",
            "score": 2,
            "text": "Voter intimidation isn’t illegal???",
            "title_similarity": "0.35941255"
        },
        {
            "id": "i1jb2t5",
            "score": -2,
            "text": "Shoot ‘em",
            "title_similarity": "0.102611884"
        },
        {
            "id": "i1jb85l",
            "score": 2,
            "text": "Violating the Ku Klutz Klan act, they are the KKK.",
            "title_similarity": "0.680527"
        },
        {
            "id": "i1jbhih",
            "score": 2,
            "text": "Naturally I don’t see any posts from the right about how insane this is…. But I’ll get a post about how pizza references are made by the liberal media to show support for child trafficking. These people are insane and worst off, endorsed and encouraged to be loud.",
            "title_similarity": "0.62310386"
        },
        {
            "id": "i1jbij4",
            "score": 2,
            "text": "On top of it all Salon.com gives these asshats the official government sounding moniker of ‘USEIP’ referring to them in this manner throughout their breathless pearl clutching article rather than what they should have officially been dubbed as—THESE CLOWNHOLES—further confusing the communities these trumpian criminals illegally harassed.  \n\nedited for weird punctuation",
            "title_similarity": "0.673393"
        },
        {
            "id": "i1jbqrd",
            "score": 2,
            "text": "Tell me, my Republican friends. How many of them are Antifa or whatever boogeyman you guys cooked up recently?",
            "title_similarity": "0.573769"
        },
        {
            "id": "i1jbyud",
            "score": 2,
            "text": "Republicans tried tactics that lead to voter suppression?\n\n*Feigns shock*",
            "title_similarity": "0.6750963"
        },
        {
            "id": "i1jc00r",
            "score": 2,
            "text": "I’ve given up on this racist shit hole of a country. Let’s see what comes of this…I’m going to guess not much",
            "title_similarity": "0.38425463"
        },
        {
            "id": "i1jc420",
            "score": 2,
            "text": "And we know know KNOW that there will be people showing up armed to polling places in the next elections. We’re going to see crazy amounts of voter intimidation.",
            "title_similarity": "0.7052118"
        },
        {
            "id": "i1jc47n",
            "score": 2,
            "text": "Can‘t win legally? Send Trump goons.",
            "title_similarity": "0.5356823"
        },
        {
            "id": "i1jce5f",
            "score": 2,
            "text": "Holy 😳. I hope Linden enjoys the My Pillow, Federal Prison edition.",
            "title_similarity": "0.2937363"
        },
        {
            "id": "i1jckci",
            "score": 2,
            "text": "This is quite scary. I hope they prosecute ANY group that goes around intimidating voters. _Any_ group, regardless of their politics and skin color.",
            "title_similarity": "0.76053834"
        },
        {
            "id": "i1jcymv",
            "score": 2,
            "text": "I have no qualms with responsible gun ownership, but if you're knocking in my door while armed, you best have a warrant and a badge.",
            "title_similarity": "0.45731223"
        },
        {
            "id": "i1jcz6c",
            "score": 2,
            "text": "The party supposedly against voter fraud is once again committing voter fraud.",
            "title_similarity": "0.67049503"
        },
        {
            "id": "i1jd39r",
            "score": 2,
            "text": "I'd give them one warning to get the fuck off my property and if they didn't comply would start getting bullets to the brain. I would not tolerate this bullshit and I won't now. They are lucky more people aren't as willing to go to their lengths on the left because they wouldn't be here.",
            "title_similarity": "0.5807828"
        },
        {
            "id": "i1jdf96",
            "score": 2,
            "text": "That's a great way to catch a load of buckshot. Fucking idiots all need to be arrested",
            "title_similarity": "0.58024216"
        },
        {
            "id": "i1jdh5u",
            "score": 2,
            "text": "Lol let them try that in Rochester NY. This city would bury them and I'm sure there's plenty of other cities they should not dare to go to. They are playing a dangerous game",
            "title_similarity": "0.6252938"
        },
        {
            "id": "i1jdi8c",
            "score": 2,
            "text": "Typical conservative tactic.",
            "title_similarity": "-0.02011826"
        },
        {
            "id": "i1jdt8f",
            "score": 2,
            "text": "I said it some years ago, republicans are building the brown shirts, see patriot boys or whatever the fuck they call themselves.",
            "title_similarity": "0.44195604"
        },
        {
            "id": "i1jdyze",
            "score": 2,
            "text": "\"The right to vote for me, death threats for you.\" - Conservative \"*pAtrIoTS*\"",
            "title_similarity": "0.552802"
        },
        {
            "id": "i1je54c",
            "score": 2,
            "text": "I bet these are the same type of assholes that cry \"muh freedom\" all the time.",
            "title_similarity": "0.4238603"
        },
        {
            "id": "i1jegde",
            "score": 2,
            "text": "Why is this just a lawsuit. These are felonies that they are committing, why isn’t the FBI involved?",
            "title_similarity": "0.6945031"
        },
        {
            "id": "i1jenad",
            "score": 2,
            "text": "I wish they would have come to my house so I could have legally killed them",
            "title_similarity": "0.56801903"
        },
        {
            "id": "i1jez7t",
            "score": 2,
            "text": "What about - ya know - **Terrorism**?\n\nThis is terrorism.  Using fear for political gains.",
            "title_similarity": "0.64815265"
        },
        {
            "id": "i1jfjq3",
            "score": 2,
            "text": "Fucking Nazi's",
            "title_similarity": "0.3681706"
        },
        {
            "id": "i1jflv1",
            "score": 2,
            "text": "Tiny pp squad",
            "title_similarity": "-0.05328027"
        },
        {
            "id": "i1jfus7",
            "score": 2,
            "text": "Why is this a lawsuit  and not a prosecution? Stay strapped homies. Hate to say it but there's only one language understood by the oppressor.  Violence.",
            "title_similarity": "0.5105488"
        },
        {
            "id": "i1jfxag",
            "score": 2,
            "text": "jesus christ, this is by definition terrorism. disgusting.",
            "title_similarity": "0.41423303"
        },
        {
            "id": "i1jgtfu",
            "score": 2,
            "text": "If someone showed up at my house toting an AR I’m shooting through the door lmao what is going through these morons heads",
            "title_similarity": "0.5728664"
        },
        {
            "id": "i1jgv9v",
            "score": 2,
            "text": "The real criminals weren’t the Mexicans they wanted the wall for…..",
            "title_similarity": "0.5219201"
        },
        {
            "id": "i1jh4k1",
            "score": 2,
            "text": "The both parties are the same slogan is all bullshit",
            "title_similarity": "0.2960974"
        },
        {
            "id": "i1jmqkm",
            "score": 2,
            "text": "When I lived in Chicago the scuzzy fat Italian-American dudes in cheap suits would walk around the suburbs carrying a clipboard and a mini bat going door to door to make sure everyone voted Republican. This was in the 1990s.",
            "title_similarity": "0.44070113"
        },
        {
            "id": "i1jnpgz",
            "score": -2,
            "text": "I sort of hate that the lawsuit and this article describes these people using the word \"agents.\" They're members of a private social group, and it's very unusual to use the word \"agents\" for that. Imagine saying \"Alcoholics Anonymous agents, golf club agents.\" \n\nIt matters because a key part of the lawsuit is that these folks presented themselves as government agents / law enforcement. That's illegal, and they're using that false legitimacy to intimidate people. We're lending them some of that legitimacy for free when we decide to call them \"agents.\"",
            "title_similarity": "0.66519654"
        },
        {
            "id": "i1k6bnf",
            "score": -2,
            "text": "[removed]",
            "title_similarity": "0.025070708"
        },
        {
            "id": "i1kq8sh",
            "score": -2,
            "text": "Lies",
            "title_similarity": "0.17371547"
        },
        {
            "id": "i1lceid",
            "score": -2,
            "text": "Ahhh yes the journalistic excellence that is salon, I remember this perfect article https://www.salon.com/2012/07/01/meet_pedophiles_who_mean_well/",
            "title_similarity": "0.29041907"
        },
        {
            "id": "i1lco28",
            "score": -2,
            "text": "Coming to you from super trustworthy salon.com",
            "title_similarity": "0.17932193"
        },
        {
            "id": "i1m3jnj",
            "score": -2,
            "text": "Hmmm…. Something smells… one dimensional about this headline. Time to cross reference outlets I guess",
            "title_similarity": "0.24999407"
        },
        {
            "id": "i1m7kl2",
            "score": -2,
            "text": "Of course you guys know this is all bullshit, right?",
            "title_similarity": "0.23951505"
        },
        {
            "id": "i1j0lzn",
            "score": -11,
            "text": "[https://www.youtube.com/watch?v=gcoJyvxlbCI](https://www.youtube.com/watch?v=gcoJyvxlbCI)",
            "title_similarity": "0.14819159"
        },
        {
            "id": "i1j1sp4",
            "score": -20,
            "text": "[deleted]",
            "title_similarity": "0.04714236"
        },
        {
            "id": "i1j9b2z",
            "score": -20,
            "text": "[deleted]",
            "title_similarity": "0.04714236"
        },
        {
            "id": "i1jd6hp",
            "score": -22,
            "text": "sounds like biased news for the sole purpose of slandering a guy thats not even in office anymore.\n\nP-R-O-P-A-G-A-N-D-A",
            "title_similarity": "0.5943836"
        },
        {
            "id": "i1jgm1t",
            "score": -19,
            "text": "So this is tied to mike Lindell. And everyone will be up in arms to call this domestic terrorism. Yet when governments and celebrities donated millions to the blm riots so that small businesses got burnt down, that was a good thing?",
            "title_similarity": "0.6961981"
        },
        {
            "id": "i1jox44",
            "score": -18,
            "text": "Well I’m glad this came from a reputable source. \n\n“The lawsuit does not offer specific examples of voters being intimidated or harassed by armed canvassers, but last year USEIP leader Charity McPike urged armed members to provide \"security\" for the group.”\n\nNo proof of this happening even in the lawsuit. Doubtful this has merit since salon is “news” source used for reporting it.",
            "title_similarity": "0.5554733"
        },
        {
            "id": "i1iwybz",
            "score": -82,
            "text": "People believe this shit??",
            "title_similarity": "0.28195173"
        },
        {
            "id": "i1jfpdn",
            "score": -11,
            "text": "Wished they would go to inner city Chicago to do their business. They maybe able to reduce gang population if they survive.",
            "title_similarity": "0.47664547"
        },
        {
            "id": "i1ith15",
            "score": 3,
            "text": "We have 3 large dogs. Their most fun on the planet is behaving unreasonably when strangers show up. Yes, we can stop them from doing it ( and do for delivery drivers). Anyone we don’t know? Oops.\n\nNot one has made the decision to walk up the stairs to the porch.",
            "title_similarity": "0.48573023"
        },
        {
            "id": "i1ixnse",
            "score": 3,
            "text": "I’m pretty sure this is what Jesus would do…. /s",
            "title_similarity": "0.14278407"
        },
        {
            "id": "i1j4t1w",
            "score": 3,
            "text": "Amazing way to gain support and sympathy to your cause, guys",
            "title_similarity": "0.22715053"
        },
        {
            "id": "i1j6a6m",
            "score": 3,
            "text": "Imagine intimidating people with weapons while knowing you can get shot in self defense",
            "title_similarity": "0.6208791"
        },
        {
            "id": "i1jamp8",
            "score": 4,
            "text": "As long as it’s already occurred, let’s hope it’s somehow uncovered that Lauren Boebert was also involved and we can get that dumb, crazy fuck out of office and behind bars.",
            "title_similarity": "0.49667022"
        },
        {
            "id": "i1jbs2g",
            "score": 4,
            "text": "The court case can be found here:\n\nhttps://www.courthousenews.com/wp-content/uploads/2022/03/colorado-voter-fraud-complaint.pdf\n\nI’m curious as to how it’s going to proceed. There’s a fair amount of substance, so I can’t imagine it’s going to be thrown out summarily.",
            "title_similarity": "0.5838851"
        },
        {
            "id": "i1jbwej",
            "score": 4,
            "text": "Hey the right-wing is getting a little TOO gnarly as of late…",
            "title_similarity": "0.12295614"
        },
        {
            "id": "i1jck5i",
            "score": 3,
            "text": "I think the scariest thing about this story is that a non govt entity is bringing this lawsuit and that police, the FBI, or any other govt investigator org is not mentioned at all despite this act violating federal law.  Our govt needs to wake the fuck up and enforce its laws no matter how hard they are to enforce to show the people at the top of these efforts that if you stir up crazies to violate the law you will have the full force of the govt coming down on you.  We need to cut the heads off of this monster sooner rather then later.  Otherwise there won't be a later for our democracy as we remember it.  At this rate I don't think there going to do it.",
            "title_similarity": "0.69852424"
        },
        {
            "id": "i1jdhe3",
            "score": 4,
            "text": "Blatant voter suppression and intimidation, next the GOP is gonna try to bring poll taxes and literacy tests back like it's 1869",
            "title_similarity": "0.6924054"
        },
        {
            "id": "i1jec9z",
            "score": 4,
            "text": "Weren’t conservatives worried about government sheeples coming door to door to force them to get vaccinated… how the turn tables….",
            "title_similarity": "0.52287245"
        },
        {
            "id": "i1jfu9r",
            "score": 4,
            "text": "I am a Gun tooting, beer drinking, deer hunting, former USMC Vietnam veteran, Liberal Democratic. Republicans are spineless cowards and supporters of Domestic Terrorist and fascists traitors who are Putin’s puppets and Russian assets fulfilling Khrushchevs prediction everyday!",
            "title_similarity": "0.7194153"
        },
        {
            "id": "i1jhb3d",
            "score": 2,
            "text": "And these are the \"freedom\" and \"constitution\" people that have the American flag plastered on all of their things yes?\n\nAlso, are any stores still selling the \"lose the election and\" CryPillow anymore? Would be so telling where a place stands if that thing was still on the shelves at somewhere like bed bath and beyond or Macy's at this point.",
            "title_similarity": "0.5211641"
        },
        {
            "id": "i1k0u8b",
            "score": -1,
            "text": "Whaaaat? No way!!!! I can’t believ… actually yes I can. Still isn’t as shocking as that hunter biden story the NYTimes just admitted was true.",
            "title_similarity": "0.3760944"
        },
        {
            "id": "i1l6o5u",
            "score": -3,
            "text": "That’s funny. \nWhat else can we pin on Trump?\n9/11?\nThe Fall of the Roman Empire?",
            "title_similarity": "0.5161773"
        },
        {
            "id": "i1ldovt",
            "score": -3,
            "text": "So now we're arresting ppl because they go around trying to tell ppl about what they believe in and how they live. Ppl on this thread really just imagining a hillbilly with his double barrel on a porch or what??",
            "title_similarity": "0.6604016"
        },
        {
            "id": "i1lffej",
            "score": -2,
            "text": "Im in CO. I'm going to call 100% BS.",
            "title_similarity": "0.21028116"
        },
        {
            "id": "i1ljah8",
            "score": -4,
            "text": "Oh, so a bunch of conservatives didnt feel comfortable going into suspected democrat neighborhoods… shocking… what a terribly misleading article",
            "title_similarity": "0.551821"
        },
        {
            "id": "i1lps7u",
            "score": 3,
            "text": "If they knocked on the wrong door and one or more of them died from being shot by a homeowner fearing a robbery or assault, you know every single dipshit conservative talking head would be all over it like flies on shit decrying how these \"peaceful\" demonstrators were gunned down in \"cold blood\" by a \"criminal\". They'd be digging hard into the homeowners past using whatever they can to make a stink and ruin that person's life, even if there was nothing there. \n\n\"The man who shot those demonstrators has a questionable past! He went to detention in high school, he's obviously got criminal tendencies!\"",
            "title_similarity": "0.71141624"
        },
        {
            "id": "i1mz8qr",
            "score": -3,
            "text": "How absurd. I remember when the black panther party was standing outside polling places armed with bats when Obama was in but of course the media refused to cover it and nobody filed charges or even arrested them. Just goes to show you that liberals and their supporters get away with murder but if you are a conservatives or a trump supporter as they now call it , they’ll link you to the ku klux klan lol. Just stay the course conservatives because they are trying anything in their desperate bid to hold on to power and will stop at nothing to achieve that, considering the state of affairs this country is in and the world under the Biden administration. There will be much more coming. Just let it bounce off. It’s all smoke and mirrors. Remember they save and put all this stuff away until election years and then you get barraged with it. Stay the course. Vote them out. Let’s take our country back and make it right again. It’s a train wreck right now",
            "title_similarity": "0.7079642"
        },
        {
            "id": "i1j4fks",
            "score": -49,
            "text": "I can't believe how many people fall for fake news like this. 🤦‍♂️",
            "title_similarity": "0.41970497"
        },
        {
            "id": "i1jf493",
            "score": -11,
            "text": "*Salon.com*",
            "title_similarity": "0.13228089"
        },
        {
            "id": "i1k986x",
            "score": -11,
            "text": "Y’all just believe anything lmao",
            "title_similarity": "0.09603801"
        },
        {
            "id": "i1jgslw",
            "score": -11,
            "text": "If it’s in the news then be skeptical. It’s all based on getting ratings and spewing their own agenda. This goes for both sides. 🙄",
            "title_similarity": "0.43356416"
        },
        {
            "id": "i1j6tig",
            "score": -39,
            "text": "Are these the same people that were outside a polling station in Philadelphia intimidating voters from 2008?  The Obama DOJ dropped everything to do with that case like a hot potato...\n\nObama did it, so it must be OK",
            "title_similarity": "0.64196146"
        },
        {
            "id": "i1ja7cb",
            "score": -42,
            "text": "Pro-Biden groups literally burned down buildings and terrorized cities back in 2020.  \nMy point here is both political groups have terrible people in them.",
            "title_similarity": "0.6609027"
        },
        {
            "id": "i1jgr8k",
            "score": -15,
            "text": "[removed]",
            "title_similarity": "0.025070708"
        },
        {
            "id": "i1jgx8s",
            "score": -12,
            "text": "i see you , russian disinformation",
            "title_similarity": "0.33662447"
        },
        {
            "id": "i1kc4p4",
            "score": -15,
            "text": "[deleted]",
            "title_similarity": "0.04714236"
        },
        {
            "id": "i1j5h9a",
            "score": 3,
            "text": "If someone who isn’t an actually official comes to my door with a gun they are going to know I support my second amendment right as well. Don’t show up to my house with a gun unless you intend on using it. You aren’t cool and it doesn’t make you look tough. You walk towards my front door with a gun and I’m going to assume you intend to harm my family or myself and I will act accordingly.",
            "title_similarity": "0.6268347"
        },
        {
            "id": "i1j5tsc",
            "score": 5,
            "text": "I'd love for that shit to show up at my door.",
            "title_similarity": "0.23772067"
        },
        {
            "id": "i1jez5w",
            "score": -4,
            "text": "So there was voter fraud?  Go figure",
            "title_similarity": "0.51409596"
        },
        {
            "id": "i1jhnvc",
            "score": 4,
            "text": "This is what people mean when they say ***Fascism is ALREADY in America***",
            "title_similarity": "0.4480177"
        },
        {
            "id": "i1jiddo",
            "score": -4,
            "text": "\"The lawsuit does not offer specific examples of voters being intimidated or harassed by armed canvassers\"",
            "title_similarity": "0.45877844"
        },
        {
            "id": "i1jrtj2",
            "score": -3,
            "text": "Honestly I think this is disgusting but don't know if it violates the KKK act. As they are not doing this to push them not to vote.This is done to find evidence of voter fraud and their methods are gross but filling it under this act might hurt the case and cause more division if it doesn't end up with charges. The people should be gone after for impersonation of an officer. I'm honestly not sure if knocking on someone's door and accusing them of voter fraud is illegal regardless of if you are carrying a weapon or not (as long as you are carrying legally). The targeting of areas is interesting as well and worthy of looking into, but once again idk if that is illegal. It's just from my understanding the act is used to threaten potential voters not to vote. This seems like it's post humously targeting them so idk if that falls under it. Could someone help me know?",
            "title_similarity": "0.61728597"
        },
        {
            "id": "i1jtbp6",
            "score": -4,
            "text": "Was anything said at the time??? To late now!",
            "title_similarity": "0.04986216"
        },
        {
            "id": "i1jvs5c",
            "score": -3,
            "text": "I agree it isn’t good. But KKK tactics? No.",
            "title_similarity": "0.28570208"
        },
        {
            "id": "i1jxjp0",
            "score": -4,
            "text": "No matter if its the far right or the far left, its all the same shit.  Extremists have influenced the world since the beginning.  Until people can work together for the common good, nothing will change.",
            "title_similarity": "0.3645892"
        },
        {
            "id": "i1k2vft",
            "score": -4,
            "text": "Yeah Trump’s a thug, but this is a page right out of the CIA handbook, which has a tragic history of supporting voter intimidation around the world, and often in much worse ways than has happened here. Not to mention DNC and the neoliberal media and their propaganda against progressive candidates, which amount to tampering with democracy as well. Hypocrisy all around, as per usual.",
            "title_similarity": "0.74024576"
        },
        {
            "id": "i1k71qg",
            "score": -5,
            "text": "Credible?  I don’t get me wrong I and down with the GOP these days as the next but I have never heard of Salon.com before and the name does not strike me as hard nosed investigative journalism",
            "title_similarity": "0.3488593"
        },
        {
            "id": "i1k9zem",
            "score": -3,
            "text": "This is wrong, but pointing the finger at half of the nation's population for the actions of a few is no different from the US judging all Russians for the actions of their terrible government, which is what half of these comments are.",
            "title_similarity": "0.6489967"
        },
        {
            "id": "i1kazje",
            "score": -3,
            "text": "Fake news",
            "title_similarity": "0.24598399"
        },
        {
            "id": "i1kc8eg",
            "score": -3,
            "text": "Just because they are open carrying doesn’t mean they are trying to intimidate. Lol",
            "title_similarity": "0.1417666"
        },
        {
            "id": "i1kchs5",
            "score": -6,
            "text": "Liberals still running on this delusional radicalized anti-American scorched earth campaign 🤦‍♂️",
            "title_similarity": "0.65635645"
        },
        {
            "id": "i1kfbzo",
            "score": -3,
            "text": "Modern journalism is less than worthless. As this article stands it's basically just a story, there's nothing concrete linking it to reality.",
            "title_similarity": "0.20987108"
        },
        {
            "id": "i1km3hn",
            "score": -3,
            "text": "How is open carry intimidating viters?",
            "title_similarity": "0.33269024"
        },
        {
            "id": "i1kslqq",
            "score": -6,
            "text": "Not that I find this unbelievable in any way, but is there a better source? Salon basically a tabloid.",
            "title_similarity": "0.4145211"
        },
        {
            "id": "i1lf3qg",
            "score": -5,
            "text": "Fake news ….",
            "title_similarity": "0.29150242"
        },
        {
            "id": "i1lxw55",
            "score": -3,
            "text": "This is such BS... fake news...",
            "title_similarity": "0.31485665"
        },
        {
            "id": "i1mzhi1",
            "score": -5,
            "text": "Keep in mind antifa and blm are the nazi fascists in this country right along with the new black panther party, progressives and Farrakhan. These are evil people and if you are a white Christian conservative they’d just as well see you dead.",
            "title_similarity": "0.68212247"
        },
        {
            "id": "i1iw57p",
            "score": -84,
            "text": "Just because a group supports Trump it doesn’t mean Trump supports them. Regardless or how bad a group is or who they are supporting I think that is a important distinction to make and it seems people have forgotten about it.",
            "title_similarity": "0.4206162"
        },
        {
            "id": "i1ja8ig",
            "score": -15,
            "text": "fuckin communists",
            "title_similarity": "0.3457441"
        },
        {
            "id": "i1jq44l",
            "score": -15,
            "text": ">The lawsuit, which is backed by the state chapter of the NAACP, the League of Women Voters and Mi Familia Vota\n\nSo fake news, got it.",
            "title_similarity": "0.6487499"
        },
        {
            "id": "i1jywqh",
            "score": -13,
            "text": "Yet another instance of federal agents pretending to be Trump supporters to make those who support Trump look like something they’re not. The feds have literally pulled this kind of stunt cents the 2016 election campaign. It’s getting really old",
            "title_similarity": "0.72521734"
        },
        {
            "id": "i1j5utr",
            "score": -42,
            "text": "Nice. More leftist propaganda by salon?",
            "title_similarity": "0.25126034"
        },
        {
            "id": "i1j9hup",
            "score": -32,
            "text": "Oh yeah salon.com , super not bias",
            "title_similarity": "0.042301364"
        },
        {
            "id": "i1j6jd8",
            "score": 6,
            "text": "GOP = Nazi = Putin\n\nKick out these treators to Russia",
            "title_similarity": "0.61862963"
        },
        {
            "id": "i1j7mkm",
            "score": 7,
            "text": "It did say : \"*is sending armed members door-to-door in areas with large numbers of voters of color, questioning people about how they voted and taking photographs of their homes.\"* so, no.\n\nExpect a follow up visit by the police and subsequent murdering.  Multiple police shootings of law abiding gun owners of color have shown that the 2nd amendment is transitory depending on your status as a minority.",
            "title_similarity": "0.7211782"
        },
        {
            "id": "i1jc8d5",
            "score": 6,
            "text": "I feel like this should be treason.",
            "title_similarity": "0.36221153"
        },
        {
            "id": "i1jdsbl",
            "score": -4,
            "text": "Nice",
            "title_similarity": "-0.1914639"
        },
        {
            "id": "i1jkink",
            "score": -5,
            "text": "Based",
            "title_similarity": "-0.1280264"
        },
        {
            "id": "i1jyhhy",
            "score": -5,
            "text": "So ANTIFA",
            "title_similarity": "0.10046076"
        },
        {
            "id": "i1jyqhm",
            "score": -5,
            "text": "You guys will buy anything they're selling...",
            "title_similarity": "0.13957384"
        },
        {
            "id": "i1k1pgw",
            "score": -7,
            "text": "Bullshit",
            "title_similarity": "0.09102191"
        },
        {
            "id": "i1k4gez",
            "score": -5,
            "text": "[removed]",
            "title_similarity": "0.025070708"
        },
        {
            "id": "i1k6962",
            "score": -4,
            "text": "BS!!! \n\nMore fake media.. not one of the listed organizations have filed any suits! People do some research and simply GO to their websites. You can read for yourselves what they are currently opposing, suing, protesting etc. \n\nTHIS is the exact 💩 that continues to misfeed the populous. \n\nSMH",
            "title_similarity": "0.5376657"
        },
        {
            "id": "i1ka3n8",
            "score": -6,
            "text": "And democrats send out unions to knock on doors and hand out pamphlets.",
            "title_similarity": "0.5989666"
        },
        {
            "id": "i1ki0ms",
            "score": -5,
            "text": "Not true!!!",
            "title_similarity": "0.08330693"
        },
        {
            "id": "i1kmkll",
            "score": -4,
            "text": "Na that shits Biden to turn more people against trump… trumps a lot smarter than people think",
            "title_similarity": "0.5070787"
        },
        {
            "id": "i1kr5kk",
            "score": -5,
            "text": "It’s sad that people  believe that this really happen. People wake up!!! Stop believe everything you read!!!",
            "title_similarity": "0.4176523"
        },
        {
            "id": "i1ksrep",
            "score": -4,
            "text": "So people take it on themselves to go door to door and find out if the address and residents are the same as the numbers recorded and voted and then people want to get “frazzled” when this happens??? Idiots",
            "title_similarity": "0.5583328"
        },
        {
            "id": "i1l2nrp",
            "score": -4,
            "text": "[removed]",
            "title_similarity": "0.025070708"
        },
        {
            "id": "i1l7zfo",
            "score": -5,
            "text": "BLM rioters were mostly biden supporters. So ig its fair to label everything they do as a pro-biden group just for that additional negative connotation.\n\nBut my statement doesn't take away the fact that this group is evil and what theyre doing is evil. Simple as that.",
            "title_similarity": "0.5555673"
        },
        {
            "id": "i1lfi46",
            "score": -7,
            "text": "Bullshit you liberals are going to start a war you will regret!",
            "title_similarity": "0.6131149"
        },
        {
            "id": "i1lgio0",
            "score": -6,
            "text": "And that’s what the black panther party did outside of voting booths when Obama was running. There’s good and bad in every race and everyone. That’s why we need to stop looking at things as red or blue, or black or white. We need to start looking at things as what’s wrong and what’s right. For the record. These people were stupid. We live in a free state. That means we should not have any oppression in speech or voting or in the way that we act. And I know everyone here can probably think of dozens of situations where this happens on each side. Don’t take a side, take a stand.",
            "title_similarity": "0.61832523"
        },
        {
            "id": "i1lim1n",
            "score": -6,
            "text": "Naturally this is all about TRUMP! Anybody who does something ignorant has to be Trump's fault. This is the kind of thinking that put Biden in our White House! And Joe shouldn't be there!",
            "title_similarity": "0.65063137"
        },
        {
            "id": "i1ljve7",
            "score": -4,
            "text": "BTW The Democrooks were the founding fathers of the KKK. Biden is a RACIST. It's in his blood and bones. He called black kids ROACHES. He had to appoint a BLACK WOMAN as SCOTUS. Not Native American, or Polynesian, East Indian, Japanese but BLACK. In an attempt to secure the BLACK VOTE. We're American and I'm colorblind! FJB",
            "title_similarity": "0.60200286"
        },
        {
            "id": "i1lkco7",
            "score": -6,
            "text": "The only fascists are the one's going door to door kovaids testing. Or the ones who require vaccinations for employment. Talk about segregation and Nazi Germany. That is breaking so many natural rights.  Civil rights act, discrimination laws, hipaa, Nuremberg Code, Geneva convention, etc. Some of these ppl are such hypocrites. Besides, this sounds fake.",
            "title_similarity": "0.60249114"
        },
        {
            "id": "i1jh6kk",
            "score": -18,
            "text": "[removed]",
            "title_similarity": "0.025070708"
        },
        {
            "id": "i1ixvcb",
            "score": 16,
            "text": "This isn't going to stop and this isn't going to be isolated and eventually these people are going to start shooting people in numbers.\n\nWe put up with school and mass shootings all the time. There's no reason that political murder won't join the mix.\n\nIf this kind of thing bothers you, you might want to look into arming yourself.",
            "title_similarity": "0.53119814"
        },
        {
            "id": "i1jdwnr",
            "score": -18,
            "text": "Except that this didn’t happen. Not even a little bit.",
            "title_similarity": "0.019511692"
        },
        {
            "id": "i1iu9m2",
            "score": 6,
            "text": "I'd laugh so hard at someone coming to my home to intimidate me to vote that I actually hope it happens. I could use the company tbh",
            "title_similarity": "0.5499189"
        },
        {
            "id": "i1jgtwl",
            "score": 7,
            "text": "Terrorists. They are the same as ISIS. Exactly the same.",
            "title_similarity": "0.29743338"
        },
        {
            "id": "i1jjgla",
            "score": -4,
            "text": "This can’t be true ain’t no way",
            "title_similarity": "0.11467096"
        },
        {
            "id": "i1jn01u",
            "score": -6,
            "text": "it's just called \"ballot harvesting\" in California",
            "title_similarity": "0.30282313"
        },
        {
            "id": "i1jy6gx",
            "score": -6,
            "text": "As a Trump supporter, if this is being accurately reported, I find this to be abhorrent. Please do not be so naive as to believe that nearly half of the nation (AKA Trump voters) believe this to be a legitimate means to garner support or to gain votes for GOP candidates. Keep this in perspective; some of your friends, family, or loved ones may not on the same page politically as you and most likely don’t support this type of behavior either.",
            "title_similarity": "0.5866259"
        },
        {
            "id": "i1jy8o9",
            "score": -7,
            "text": "I think it's necessary to address the fact that Salon is being unnecessarily clickbaity.  There's a lot of \"Mike Lindell\" and \"Trump\" tossed around to rile people up.  If you read the article, it's about a man named Shawn Smith, who is basically a nobody that had past links to Steve Bannon and Mike Lindell, and the guy worked Lindell's conspiracy theories into his groups material.",
            "title_similarity": "0.69241136"
        },
        {
            "id": "i1k15l1",
            "score": -6,
            "text": "Until these guys actually come to my neighborhood like the Black Lives Matter people did to burning stuff down I just I’m not gonna believe the news media",
            "title_similarity": "0.5764899"
        },
        {
            "id": "i1k89uy",
            "score": -7,
            "text": "Fake news",
            "title_similarity": "0.24598399"
        },
        {
            "id": "i1kadb1",
            "score": -5,
            "text": "Believing salon magazine article on this tells the world everything it needs to know about you",
            "title_similarity": "0.28818473"
        },
        {
            "id": "i1kaqq1",
            "score": -7,
            "text": "Trump 2024",
            "title_similarity": "0.20285186"
        },
        {
            "id": "i1kemu8",
            "score": -6,
            "text": "Anti- Trump delusion, lol",
            "title_similarity": "0.49936938"
        },
        {
            "id": "i1kwes7",
            "score": -5,
            "text": "3 people had their doors knocked on -> News blows this story up to make it seem the entire state was victimized by them -> reddit furthers this and makes it seem to the world that this is a regular occurance….\n\nFuckin sensationalism",
            "title_similarity": "0.6664953"
        },
        {
            "id": "i1kwiyx",
            "score": -7,
            "text": "Totally believable. Salon is known for their non biased reports.",
            "title_similarity": "0.059906274"
        },
        {
            "id": "i1l2kb1",
            "score": -7,
            "text": "BLM was doing plenty of intimidation as well",
            "title_similarity": "0.46884876"
        },
        {
            "id": "i1lc7h3",
            "score": -7,
            "text": "Lmao!\nBfs\nLiberal. Hopefully, the grid collapse to rid the planet",
            "title_similarity": "0.45479697"
        },
        {
            "id": "i1iwd91",
            "score": -75,
            "text": "Misinformation at its finest",
            "title_similarity": "0.07764935"
        },
        {
            "id": "i1jchgw",
            "score": -20,
            "text": "This is a bullshit story. Just like this page is bullshit. If you really believe this crap you are the problem. Mush minded sheep",
            "title_similarity": "0.4297927"
        },
        {
            "id": "i1japqt",
            "score": -21,
            "text": "Legal firearm owners aren’t criminals, but boy does the ant-gunners try and make us one.\nSad!",
            "title_similarity": "0.5242537"
        },
        {
            "id": "i1jaq7w",
            "score": -25,
            "text": "[deleted]",
            "title_similarity": "0.04714236"
        },
        {
            "id": "i1jat22",
            "score": -24,
            "text": "This ain’t even true. And stop saying this is taking away voter laws for us black people we already know it’s for non documented citizens to vote. Don’t use us as an excuse.",
            "title_similarity": "0.58985305"
        },
        {
            "id": "i1jb95o",
            "score": -24,
            "text": "This is actually false. Do better",
            "title_similarity": "0.13731432"
        },
        {
            "id": "i1jbb9r",
            "score": -26,
            "text": "Read it on Reddit so it must be true 🙄",
            "title_similarity": "0.2427751"
        },
        {
            "id": "i1jchql",
            "score": -21,
            "text": "Joe did this",
            "title_similarity": "-0.028040146"
        },
        {
            "id": "i1jcm2k",
            "score": -23,
            "text": "Black panthers did it but guess that was ok",
            "title_similarity": "0.20858651"
        },
        {
            "id": "i1k9hcf",
            "score": -8,
            "text": "Fake News?",
            "title_similarity": "0.26855648"
        },
        {
            "id": "i1kd4nh",
            "score": -6,
            "text": "Crazy there absolutely no evidence presented in the lawsuit, the news “source” is hyper left, and people are just rolling with it as if it’s fact.",
            "title_similarity": "0.44862324"
        },
        {
            "id": "i1kitjl",
            "score": -6,
            "text": "Salon not biased at all. Really. LOL.",
            "title_similarity": "-0.037764072"
        },
        {
            "id": "i1ktz94",
            "score": -8,
            "text": "BS! Who actually believes this crap",
            "title_similarity": "0.29148287"
        },
        {
            "id": "i1kuems",
            "score": -7,
            "text": "Sounds like bullshit 🤣",
            "title_similarity": "0.13300742"
        },
        {
            "id": "i1ioveu",
            "score": 256,
            "text": "One of the major problems with discussions surrounding guns is that because guns are said to be a Right questioning the motives of one who is carrying a gun is a non-starter for pro-gun advocates. For example why did Rittenhouse take a rifle to a protest. What were his motives. His apologists will say it doesn't matter because it was his Right. If people say they were intimidated or made afraid by the rifle the response is the same, 'it was his Right\". \n\nClearly armed people coming to your house, lurking around while you're standing in line to vote, etc is extremely intimidated. It's just very difficult to legally challenge because having a gun is said to be a Right.",
            "title_similarity": "0.6974124"
        },
        {
            "id": "i1jjea9",
            "score": -7,
            "text": "I live in Colorado and watch local news.  This is the first I'm hearing of this story.",
            "title_similarity": "0.42566615"
        },
        {
            "id": "i1jovet",
            "score": -8,
            "text": "Intimidate? Another fake story that they’ll retract or be found false. Boooo",
            "title_similarity": "0.45000717"
        },
        {
            "id": "i1jur7h",
            "score": -7,
            "text": "[deleted]",
            "title_similarity": "0.04714236"
        },
        {
            "id": "i1jynxx",
            "score": -8,
            "text": "Stop the cap… LATINOS FOR TRUMP. You guys need to stop being delusional and take the red pill… ffs man",
            "title_similarity": "0.54465675"
        },
        {
            "id": "i1ke98w",
            "score": -8,
            "text": " No way y’all are actually using salon as a reputable news source 🤦‍♂️",
            "title_similarity": "0.435347"
        },
        {
            "id": "i1kfc6a",
            "score": -9,
            "text": "Biden single Handley ruined this country In months, but let’s talk about Trump still lol",
            "title_similarity": "0.60212904"
        },
        {
            "id": "i1lbarg",
            "score": -8,
            "text": "Fake News",
            "title_similarity": "0.24598399"
        },
        {
            "id": "i1j4syi",
            "score": -48,
            "text": "Ah yes I get all my news from salon, \n trump is the devil",
            "title_similarity": "0.48221982"
        },
        {
            "id": "i1j0150",
            "score": 32,
            "text": "and I bet they'll get slaps on the wrist too.\n\nFuckers get all amped up when people of color vote and claim voter fraud, then go out and pull this bullshit and wonder why the rest of us are done with their bullshit.\n\nTHIS STUFF IS WHY YOU NEED TO ARREST TRUMP AND HOLD HIM ACCOUNTABLE FOR HIS ACTIONS.  ALLOWING HIM TO WALK FREE AND UNOPPOSED GIVES HIM POWER AND EMBOLDENS HIS FOLLOWERS TO BE MORE AGGRESSIVE.  \n\nFuck me they ATTACKED THE FUCKING CAPITAL OF THE UNITED STATES OF AMERICA, and we can't agree on whether the guy LEADING THE FUCKING RALLY should be held accountable for it.  \n\nThis shit right here is a result of our justice system failing in one place, and causing cascading problems in others.",
            "title_similarity": "0.782812"
        },
        {
            "id": "i1jb922",
            "score": -25,
            "text": "It’s all liberal political bullshit and media lies",
            "title_similarity": "0.5330736"
        },
        {
            "id": "i1jfpfn",
            "score": -8,
            "text": "[removed]",
            "title_similarity": "0.025070708"
        },
        {
            "id": "i1ksubs",
            "score": -7,
            "text": "Bullshit story....the \"group\" in question wasn't a GROUP it was people doing a door to door voting canvas...I'm sorry but people who have the right to carry a gun under Colorado law aren't stupid enough, like liberals believe, to brandish a gun....\nStop with fake news...and actually feel.the truth",
            "title_similarity": "0.68220305"
        },
        {
            "id": "i1l1f45",
            "score": -9,
            "text": "But no one cares about the US government helping the Ukrainian military that includes a Nazi branch Azov Battalion",
            "title_similarity": "0.5078435"
        },
        {
            "id": "i1l88zk",
            "score": -10,
            "text": "My god, how can you live with yourselves, every day is Trump this, Trump that. Get over it for fucks sake.",
            "title_similarity": "0.39517474"
        },
        {
            "id": "i1ilkyb",
            "score": 197,
            "text": "[removed]",
            "title_similarity": "0.025070708"
        },
        {
            "id": "i1iookt",
            "score": 9,
            "text": "MyTreason",
            "title_similarity": "0.022094116"
        },
        {
            "id": "i1jsjbu",
            "score": -10,
            "text": "Yes,  I'm sure the pillow guy is sending out armed groups to intimidate people",
            "title_similarity": "0.62949824"
        },
        {
            "id": "i1k4ioy",
            "score": -10,
            "text": "Maybe it’s to protect themselves because the left put targets on republicans",
            "title_similarity": "0.5293743"
        },
        {
            "id": "i1jiudw",
            "score": -11,
            "text": "Bull shit",
            "title_similarity": "0.21931385"
        },
        {
            "id": "i1jw0wr",
            "score": -12,
            "text": "That's a bullshit story",
            "title_similarity": "0.17031538"
        },
        {
            "id": "i1jzzvc",
            "score": -10,
            "text": "I knew this was bullshit.  First paragraph says “debunked” and “dismissed” but fun to watch the sheeple that believe everything they see.",
            "title_similarity": "0.42081082"
        },
        {
            "id": "i1k4h0e",
            "score": -13,
            "text": "Wow. What a bunch of horse shit. The real Nazis are those that censor free speech and are openly anti American. The brown shirts of the modern era. Reddit is a cancerous cess pool.",
            "title_similarity": "0.65434825"
        },
        {
            "id": "i1jf4r9",
            "score": -11,
            "text": "Can’t blame them",
            "title_similarity": "-0.022088889"
        },
        {
            "id": "i1jo3h5",
            "score": -10,
            "text": "All lies",
            "title_similarity": "0.25293368"
        },
        {
            "id": "i1k7c6c",
            "score": -11,
            "text": "This story is absurd on its face!  Are we supposed to imagine that the demonstrably anti-Trump media somehow didn't find out about this until this little, two bit socialite rag picked it up?  LMAO!  If there were even a shred of truth to this, it would have been wall to wall on every cable and legacy broadcast news outlet for weeks on end, there would have been congressional investigations, the FBI, CIA, DEA, ATF and a half dozen other alphabet soup agencies would have been called into overdrive action, people would have been arrested sent to jail ... and on and on.",
            "title_similarity": "0.70711136"
        },
        {
            "id": "i1kxs9w",
            "score": -13,
            "text": "Lol, I feel this when the blue-haired, nose ring kid comes by asking me to vote Dem.  Wish I knew I could sue over this. TIL",
            "title_similarity": "0.47983956"
        },
        {
            "id": "i1j4ho5",
            "score": -13,
            "text": "Ecco ....",
            "title_similarity": "-0.041247305"
        },
        {
            "id": "i1jk210",
            "score": -13,
            "text": "[removed]",
            "title_similarity": "0.025070708"
        },
        {
            "id": "i1jjl1z",
            "score": -14,
            "text": "Reddit really be like “look one sided article that bashes people that don’t agree with me and then calls them pedophiles at the end just for that extra own.”",
            "title_similarity": "0.6113417"
        },
        {
            "id": "i1j38ku",
            "score": -15,
            "text": "The way this world is set up, stay strapped or get clapped 🤷🏽‍♂️.",
            "title_similarity": "0.16491117"
        },
        {
            "id": "i1j8ntw",
            "score": -16,
            "text": "This is unacceptably bad.  This polarized bullshit is gonna fuckin' wreck society in bad and good ways, but mostly bad from my perspective.  Both, shall we say \"passionate\" folks on both sides of the political spectrum need to stop with this extreme reaction crap toward each other.\n\nAs for this particular group, we need to figure out a way to make an example of them in such a way that disempowers them and doesn't push them further into their own corners.  This is NOT fine.  We shouldn't tolerate this crap from \"armed officials\" nor \"citizen groups\" - if somebody is willing to go out in public armed and essentially threaten folks by probing them for information while openly brandishing firearms ... yeah, you can bet \"too many\" of those people are willing to go further.\n\nBoth sides need to cut the shit.  The \"nazi\" crap folks keeping bringing up happens across the political spectrum and in America right now there's two opposing forces essentially using manipulation and \"polite threats\" to send a message.\n\nIf you meet either with more force, or something that causes them to dig in deeper, we get more fucked.  If we do nothing, we get more fucked. \n\nFolks engaging in this behavior do not seen the nasty generations long pattern they are enforcing because they are too close to the pattern.  Both sides feel they are threatened and \"need to do something\" and think they have the \"right answers\"\n\nI'll wait patiently for the extreme reaction to this Door to Door crap to make it worse as usual.\n\nFolks don't change their lives until something makes them do it ... Like if the pain of not doing so is greater than the \"pain of change\" - such it is with humans in large groups as well.\n\nSeriously, y'all are fucked.  Even so, I still (perhaps naively) believe that things are overall improving and I take the global reaction to Ukraine as evidence of that.  Hopefully something similar happens in the US to help dissuade this sort of behavior ... from both sides.",
            "title_similarity": "0.62698686"
        },
        {
            "id": "i1jkqiq",
            "score": -17,
            "text": "So, wheres the proof for all these allegations? Other than the Lawyer who filed the Lawsuit, and all the claims they're making. There's nothing to back up these allegations.",
            "title_similarity": "0.47733247"
        },
        {
            "id": "i1joeji",
            "score": -17,
            "text": "Why all the Trump hate all the time.  I'd be more focused on the shit show that's unfolding now because of weak leadership and poor judgement.",
            "title_similarity": "0.5932535"
        },
        {
            "id": "i1iu9ag",
            "score": 44,
            "text": "[removed]",
            "title_similarity": "0.025070708"
        },
        {
            "id": "i1ji61t",
            "score": -18,
            "text": "BLM did this and it received no attention.",
            "title_similarity": "0.13042903"
        },
        {
            "id": "i1jj0zb",
            "score": -15,
            "text": "What bullshit fake news",
            "title_similarity": "0.30809844"
        },
        {
            "id": "i1jdf58",
            "score": -17,
            "text": "Pro-Biden group chains shut the doors to police station, then sets station on fire: turns out, it's the fault of themselves, just like these dinguses",
            "title_similarity": "0.60515636"
        },
        {
            "id": "i1jg61q",
            "score": -20,
            "text": "I always thought the kkk was linked to the democrats, makes sense why they would hire them to make the gop look bad. It’s a sad game, the whole world sees and laughs at the U.S killing it self from within",
            "title_similarity": "0.66515386"
        },
        {
            "id": "i1ji1hr",
            "score": -16,
            "text": "You will die and go to hell for holding on to these lies you need to ask for forgiveness from your savor Jesus",
            "title_similarity": "0.52447665"
        },
        {
            "id": "i1ji4ne",
            "score": -18,
            "text": "How is this intimidation? If you have an open carry state what's intimidating about it.\n Some snowflakes who see no problem with gangbangers killing kids in McDs drive thrus, but melt when law abiding citizens show up. OK for criminals who circumvent and break laws all day, but someone with a different pov and help help. Are they drawing the weapon and pointing it at them? No. Silly.\nFear a government that fears your gun. Governments that have taken guns from citizens:\nNazi Germany, the Soviet Union, People's Republic of China, Venezuela, Cuba, Democratic Republic of Korea( North Korea ). And look what they do or have done to their people. \nAs Mao Tsung said:\n Power flows from the barrel of a gun. \nAnd he killed over 100 million of his own people.",
            "title_similarity": "0.7290769"
        },
        {
            "id": "i1jp94d",
            "score": -19,
            "text": "Meh, The Left makes it a point to infiltrate nursing homes and promise the elderly the world if they can just get their signature.",
            "title_similarity": "0.46572143"
        },
        {
            "id": "i1janyg",
            "score": -21,
            "text": "And now for the liberals to now think that every person who voted for trump or supported him is like this group",
            "title_similarity": "0.42170596"
        },
        {
            "id": "i1jawbp",
            "score": -22,
            "text": "You mean like the black panthers did In Philly in 08?",
            "title_similarity": "0.39577967"
        },
        {
            "id": "i1j5blw",
            "score": -27,
            "text": "Salon . com needs to be banned from appearing in this subreddit. \n\nSensationalist headlines are meaningless to those with a brain.",
            "title_similarity": "0.4847481"
        },
        {
            "id": "i1j5jy1",
            "score": -24,
            "text": "Bullshit",
            "title_similarity": "0.09102191"
        },
        {
            "id": "i1j76y7",
            "score": -25,
            "text": "I like trump and I’m definitely voting for him but I would rise hell if they came to my door trying to intimidate me the gods",
            "title_similarity": "0.58633566"
        },
        {
            "id": "i1jao9g",
            "score": -24,
            "text": "Breaking news six months from now: “Lawsuit against pro-trump door to door intimidation acts dropped when prosecution discovers all members were undercover FBI agents. “",
            "title_similarity": "0.68609047"
        },
        {
            "id": "i1ituwh",
            "score": 32,
            "text": "Why is Lindell not in a Fed mental lockdown ward. Awaiting trial on charges?",
            "title_similarity": "0.50745296"
        },
        {
            "id": "i1j7idh",
            "score": -28,
            "text": "If it’s on Salon it must be true!",
            "title_similarity": "0.15266623"
        },
        {
            "id": "i1j8m34",
            "score": -31,
            "text": "They sound like true patriots to me. Someone need to tell people the Democrats are a threat to our Republic",
            "title_similarity": "0.5578696"
        },
        {
            "id": "i1j6478",
            "score": -39,
            "text": "If this is really happening, I AM 1000% SURE it's a DEMOCRAT LIBERAL agenda... Disguised a Trump supporters to confuse the opposition.\nGOD AMERICA WAKE THE F*CKKK UPPP... Democrats lie and manipulate all day...",
            "title_similarity": "0.6073275"
        },
        {
            "id": "i1ipa0s",
            "score": 474,
            "text": "Mein Pillow",
            "title_similarity": "0.009326726"
        },
        {
            "id": "i1ilo9y",
            "score": 545,
            "text": "Mypillow militia",
            "title_similarity": "0.18709342"
        },
        {
            "id": "i1iragz",
            "score": 122,
            "text": "Isn't it a crime? And isn't pretending to be an officer a crime? Can't they just call the police? I know the police are possibly sympathetic to the criminals in this case, but make the report then request federal investigation if the local police don't take action.",
            "title_similarity": "0.61385804"
        },
        {
            "id": "i1ir6qw",
            "score": 839,
            "text": "nothing says \"american\" like threatening people to vote as you tell them to under threat of violence.",
            "title_similarity": "0.5996768"
        },
        {
            "id": "i1ims2z",
            "score": 2787,
            "text": "[removed]",
            "title_similarity": "0.025070708"
        },
        {
            "id": "i1itqvb",
            "score": 139,
            "text": "Kinda feel like this is exactly how DeSantis‘ little election police bs here in Florida is going to go.",
            "title_similarity": "0.34351218"
        },
        {
            "id": "i1iy5vx",
            "score": 163,
            "text": "I had somebody stop by in Michigan during 2020 election. They were campaigning for Huizenga (R).  They had a side holstered gun.  I told them to get off my lawn before they lowered my property values.   They left.",
            "title_similarity": "0.6583475"
        },
        {
            "id": "i1j1f9k",
            "score": 163,
            "text": "How do we fight this bullshit? Seriously how do you fight people who have no problem attacking the Capitol, attempting to kidnap a Governor, intimidating citizens by showing up at their houses with weapons questioning their vote, putting librarians in jail for checking out “inappropriate” books, trying to outlaw birth control? My elected Democratic representatives are not doing shit. I have been researching countries it’s easy to immigrate to.",
            "title_similarity": "0.74376655"
        },
        {
            "id": "i1j2t00",
            "score": 174,
            "text": "I hate that the government is doing absolutely nothing about rampant conservative christian white nationalist domestic terrorist groups.",
            "title_similarity": "0.55358434"
        },
        {
            "id": "i1iv4o4",
            "score": 203,
            "text": "Brown shirts doing brown shirt things.",
            "title_similarity": "-0.0001782719"
        },
        {
            "id": "i1io19c",
            "score": 2069,
            "text": "Whatever this era is of US politics needs to end.",
            "title_similarity": "0.3415165"
        },
        {
            "id": "i1ixak1",
            "score": 262,
            "text": "Remember when they said Democrats were going to send people door to door forcing people to get vaccinated?",
            "title_similarity": "0.64319664"
        },
        {
            "id": "i1ix7ab",
            "score": 641,
            "text": "That's what Nazis did. We always hear that Hitler was \"democratically\" elected, but it's never mentioned how his goons intimidated voters, beat up opponents and so on.",
            "title_similarity": "0.57355917"
        },
        {
            "id": "i1iq0eh",
            "score": 363,
            "text": "Wait what? The my pillow guy?  Did they cut eye-holes in the pillow caes?",
            "title_similarity": "0.39968783"
        },
        {
            "id": "i1ipv77",
            "score": 4699,
            "text": "I feel like the people going door to door armed are the same ones that say things like, \"show up on my porch armed and uninvited and just see what happens\", while stroking a gun.",
            "title_similarity": "0.5115938"
        },
        {
            "id": "i1ivo61",
            "score": 2640,
            "text": "This is fucking crazy. Weren’t the right crying that armed federal law enforcement were going to be coming door to door to intimidate people into getting the shot?  Yet, this is ok?   Doing kkk style voter intimidation?",
            "title_similarity": "0.81003094"
        },
        {
            "id": "i1itfrm",
            "score": 7883,
            "text": "It’s actually worse than the title sounds.\n\n> \"Sometimes armed and donning badges to present an appearance of government officiality, USEIP agents __interrogate voters about their addresses, whether they participated in the 2020 election, and — if so — how they cast their vote__,\" the complaint says. \"It is reported that multiple agents have claimed to be from 'the county,' and have, without any evidence, __falsely accused the residents of casting fraudulent ballots__.\"\n>\n>The voting rights groups say the group's efforts to seek out areas where they believe voter fraud occurred has __largely focused on high-density housing areas and communities experiencing a growth in the number of minority voters__.",
            "title_similarity": "0.74166024"
        },
        {
            "id": "i1iq0q5",
            "score": 2,
            "text": "Did they say least double up and ask if you heard about Jesus?",
            "title_similarity": "0.35169494"
        },
        {
            "id": "i1iquq2",
            "score": 5,
            "text": "There is a My Pillow catalogue for all those that want better sleep before storming the capital.",
            "title_similarity": "0.4327774"
        },
        {
            "id": "i1itr71",
            "score": 6,
            "text": "Fascist gangs supporting Donald \"Adolph\" Trump backed by Mike \"Mussolini\" Lindell.",
            "title_similarity": "0.6056241"
        },
        {
            "id": "i1iuah9",
            "score": 1,
            "text": "Well that's crazy.",
            "title_similarity": "0.065440744"
        },
        {
            "id": "i1iuni7",
            "score": 10,
            "text": "You show up on my door with a gun, no badge, and no police cruiser then you’re going to get greeted by two big Italian Cane Corsos and a 1911 in your face.",
            "title_similarity": "0.47834802"
        },
        {
            "id": "i1iuqe4",
            "score": 3,
            "text": "What the fuck.",
            "title_similarity": "0.10713124"
        },
        {
            "id": "i1iuvjo",
            "score": 2,
            "text": "I’m just gonna go ahead and say it: we would not have this problem with Billy Mays.",
            "title_similarity": "0.22638346"
        },
        {
            "id": "i1iuxej",
            "score": 42,
            "text": "I feel this will only get worse in this year’s elections.",
            "title_similarity": "0.42944223"
        },
        {
            "id": "i1iuyla",
            "score": 18,
            "text": "That sounds like a crime to me.",
            "title_similarity": "0.29781637"
        },
        {
            "id": "i1iv2gw",
            "score": 1,
            "text": "imagine having to explain that one during a job interview...",
            "title_similarity": "0.24573697"
        },
        {
            "id": "i1iv8ta",
            "score": 86,
            "text": "> The USEIP is also working with the Colorado Republican Party on its \"Election Integrity Operations,\" according to the Times Recorder. A USEIP member is in charge of the GOP's program and has given joint presentations with Epp, the group's co-founder. Heidi Ganahl, the leading Republican candidate for Colorado governor, promoted the group during a recent event, declaring that they are \"doing great things.\"",
            "title_similarity": "0.6268686"
        },
        {
            "id": "i1ivfmp",
            "score": 2,
            "text": "These idiots don't really understand that the people they're trying to intimidate own guns too.",
            "title_similarity": "0.54903567"
        },
        {
            "id": "i1ivvzn",
            "score": 9,
            "text": "Trump trash scum",
            "title_similarity": "0.49399623"
        },
        {
            "id": "i1iw5sv",
            "score": 2,
            "text": "Land of the “free”",
            "title_similarity": "-0.09593534"
        },
        {
            "id": "i1iwdn4",
            "score": 2,
            "text": "Vladimir Putin would be proud of such efforts.",
            "title_similarity": "0.21483779"
        },
        {
            "id": "i1iwk52",
            "score": 38,
            "text": "Regular Americans FELT the harassment on a daily basis from Trump supporters. They were everywhere. They were every racist acting out their desires bc someone told them it was okay. That is domestic terrorism and has been happening since the United States was built on the backs of slaves and immigrants.",
            "title_similarity": "0.65885454"
        },
        {
            "id": "i1ix6rw",
            "score": 11,
            "text": "It’s so circular how those who vote GOP are overwhelmingly caught for voter fraud then complain of a broken system showing so much fraud.",
            "title_similarity": "0.68490696"
        },
        {
            "id": "i1ix7sr",
            "score": 7,
            "text": "So I have a question where were they doing this I live in Denver and didn't hear about this at all?\n\nMy guess is they were doing this in Colorado springs, there some batshit crazy conservatives down there. Just a heads up to my Denver neighbors and those people come to your door and their foot goes inside your front door you're welcome to shoot them and legally protected to do so\n\nAlso side note in the state of Colorado even though open carry is legal everywhere outside of Denver and Arvada, no one does it and you look batshit crazy if you're open caring. Actually found this the hard way I'm pretty liberal but own a 9mm\nAnd used to live in a not great neighborhood of Denver, and even brought it a few times with me when I was South and West in the state and cowboy country, and I learned immediately no one wears open carry guns in the state even though you can it is not socially acceptable and usually people think you're about to start a mass shooting.",
            "title_similarity": "0.7335068"
        },
        {
            "id": "i1ixgaa",
            "score": 2,
            "text": "Democracy. It ain’t pretty. Agitation is the tool to make more money. Education is the tool to set you free.",
            "title_similarity": "0.36746645"
        },
        {
            "id": "i1ixvgw",
            "score": 3,
            "text": "One day they’ll knock on the doors of someone as batshit crazy as they are and get shot",
            "title_similarity": "0.5673545"
        },
        {
            "id": "i1ixwjm",
            "score": 12,
            "text": "The consequences of not bringing tRump to face justice.\n\nTrumpism still runs rampant",
            "title_similarity": "0.54807943"
        },
        {
            "id": "i1iy7zb",
            "score": 2,
            "text": "Mike Lindell went from merely being a drug addict to a fascistic monster",
            "title_similarity": "0.58590686"
        },
        {
            "id": "i1iya2x",
            "score": 2,
            "text": "Well, time to buy a firearm.",
            "title_similarity": "0.24238002"
        },
        {
            "id": "i1iyovy",
            "score": 7,
            "text": "Were they wearing brown shirts by any chance?",
            "title_similarity": "0.13547479"
        },
        {
            "id": "i1iyqr8",
            "score": 3,
            "text": "Go on ask the Donald, they have thousands of liars ready to take your call and repeat his lies. 🤑",
            "title_similarity": "0.645278"
        },
        {
            "id": "i1iyua0",
            "score": 3,
            "text": "This is very similar to Hitler and Putin fascism too. Lock them up.",
            "title_similarity": "0.5757338"
        },
        {
            "id": "i1iyzfp",
            "score": 3,
            "text": "Imagine being such a sore loser that you have to threaten a whole county at gunpoint. Wild",
            "title_similarity": "0.676928"
        },
        {
            "id": "i1iz3sl",
            "score": 7,
            "text": "Probably Lauren Boebert’s district this is happening in Colorado",
            "title_similarity": "0.4147452"
        },
        {
            "id": "i1iz4g2",
            "score": 3,
            "text": "Why are the people not in prison?",
            "title_similarity": "0.26229385"
        },
        {
            "id": "i1iz4gk",
            "score": 4,
            "text": "Sadly, I can proudly say I predicted this behavior before it even started happening.  Trump supporters are ready to dispose of anyone who did not vote for Dear LEader, and they're not shy about it either. We need to take this threat more seriously.",
            "title_similarity": "0.59680474"
        },
        {
            "id": "i1iz56n",
            "score": 2,
            "text": "If someone intimidated me to vote for the other side it would just make me NOT want to vote for them even more. Unless they are sitting in the persons kitchen, watching them fill out their absent T balot, then walking it to the Post office, I don't understand the logic to this.",
            "title_similarity": "0.4589705"
        },
        {
            "id": "i1iz576",
            "score": 2,
            "text": "Scummy dictator methods",
            "title_similarity": "0.42816693"
        },
        {
            "id": "i1iz62d",
            "score": 2,
            "text": "Can neighborhoods file ‘no trespass’ orders?",
            "title_similarity": "0.22588119"
        },
        {
            "id": "i1iz7m7",
            "score": 2,
            "text": "They would do that in El Paso county, fucking Evangelicals. I'm glad they didn't go to my place!",
            "title_similarity": "0.5073043"
        },
        {
            "id": "i1izb61",
            "score": 3,
            "text": "White supremacy is begging to take hold in America and it’s terrifying. This is what real tyranny looks like.",
            "title_similarity": "0.6388458"
        },
        {
            "id": "i1iztoy",
            "score": 6,
            "text": "The reason they lied about the amount and source of vIolence around BLM protests and the reason they lied about voter fraud is to justify and encourage the violent action we have seen around right-wing protests and towards elections.",
            "title_similarity": "0.7581401"
        },
        {
            "id": "i1j055p",
            "score": 3,
            "text": "They keep doing the very things that they accuse the other side of wanting to do... Smh",
            "title_similarity": "0.30444443"
        },
        {
            "id": "i1j08xs",
            "score": 2,
            "text": "in a way this makes me happy, they know they are losing and most of the country is against them. soon they will have no power",
            "title_similarity": "0.37711403"
        },
        {
            "id": "i1j0b8g",
            "score": 1,
            "text": "I wish one of them would knock on my door..",
            "title_similarity": "0.2746622"
        },
        {
            "id": "i1j0cop",
            "score": 1,
            "text": "I wonder what I would do if they came to my door, I hope that I would not care who and what they were about.",
            "title_similarity": "0.37736234"
        },
        {
            "id": "i1j0ehf",
            "score": 3,
            "text": "Welcome to the new Jim Crowe.  I’m going to keep calling these racist traitors what they are.",
            "title_similarity": "0.5856589"
        },
        {
            "id": "i1j0emz",
            "score": 3,
            "text": "Sounds like a recipe to get yourself shot, to me.",
            "title_similarity": "0.33652768"
        },
        {
            "id": "i1j0i6r",
            "score": 9,
            "text": "Sounds like they should be facing charges and jail time.  \nBringing a gun to a planned crime, even a misdemeanor, is a felony in most places.",
            "title_similarity": "0.62151045"
        },
        {
            "id": "i1j0rzo",
            "score": 6,
            "text": "Are these the Gazpacho Police that Margarine Tater Greenbean was talking about?",
            "title_similarity": "0.40732637"
        },
        {
            "id": "i1j0u5t",
            "score": 1,
            "text": "I believe CBS still supports Mike Lindell and by extension these fringe terrorist groups.",
            "title_similarity": "0.40224344"
        },
        {
            "id": "i1j0uyz",
            "score": 3,
            "text": "How pathetic that they have resorted to doing this",
            "title_similarity": "0.25905743"
        },
        {
            "id": "i1j0x8j",
            "score": 70,
            "text": "This is just more evidence that Trump and his supporters are nothing but a bunch of racists. They're obviously trying to intimidate black and Latino voters by sending armed members door-to-door. This is a clear violation of the Ku Klux Klan Act and voting rights laws, and I hope this group is prosecuted to the fullest extent of the law.",
            "title_similarity": "0.7727747"
        },
        {
            "id": "i1j177l",
            "score": 2,
            "text": "Where’s peggy when u need him",
            "title_similarity": "0.13645953"
        },
        {
            "id": "i1j19ie",
            "score": 5,
            "text": "Colorado...You okay buddy?",
            "title_similarity": "0.23898801"
        },
        {
            "id": "i1j1w0c",
            "score": 4,
            "text": "This fucking pillow guy saga is bananas.",
            "title_similarity": "0.2548054"
        },
        {
            "id": "i1j1xfh",
            "score": 5,
            "text": "This is out of control.",
            "title_similarity": "0.13672605"
        },
        {
            "id": "i1j27p0",
            "score": 32,
            "text": "People are very angry in this country. I am 67 and never saw things the way they are today.. started with Trumps rise, pandemic, idea of wearing and mask and the big lie! Dangerous times from the anti government, anti history, anti LBGT, anti science folks in this country. They have been emboldened by Trumpism. Look out for another Tim McVay",
            "title_similarity": "0.7067416"
        },
        {
            "id": "i1j2bzf",
            "score": 15,
            "text": "Could we PLEASE put someone in jail for this?",
            "title_similarity": "0.44087055"
        },
        {
            "id": "i1j2jer",
            "score": 3,
            "text": "search of evidence to support voter fraud allegations that Voting rights groups have filed a lawsuit seeking to stop a pro-Trump group from going door-to-door in Colorado inhave already been debunked and rejected by courts.\n\nThe lawsuit alleges that the U.S. Election Integrity Plan — led by Shawn Smith, an ally of former Trump strategist Steve Bannon and MyPillow founder Mike Lindell — is sending armed members door-to-door in areas with large numbers of voters of color, questioning people about how they voted and taking photographs of their homes.\n\nThe lawsuit, which is backed by the state chapter of the NAACP, the League of Women Voters and Mi Familia Vota, alleges that the \"voter intimidation\" campaign violates the Voting Rights Act of 1965 and the Ku Klux Klan Act of 1871, a post-Civil War law aimed at preventing white vigilantes from terrorizing Black people to stop them from voting.\n\nThe lawsuit cites the \"County & Local Organizing Playbook\" used by the group, which instructs members to \"undertake citizen audit activities to either refute or confirm serious allegations of election malfeasance\" in order to \"support future legal action.\" The group, some of whose members are armed, has been going door-to-door in El Paso, Mesa and Weld counties in Colorado, using public voter lists to identify areas where they believe ballots were fraudulently cast, the Colorado Times Recorder reported last year. The report prompted an alert from Colorado Secretary of State Jena Griswold, who warned voters of unofficial canvassing efforts and urged residents to report harassment and threats to local law enforcement or the Justice Department.\n\n\"Defendants' objectives are clear. By planning to, threatening to, and actually deploying armed agents to knock on doors throughout the state of Colorado, USEIP is engaged in voter intimidation,\" the lawsuit states. \"USEIP's public-facing actions are a clear signal to Colorado voters — especially voters of color — that to vote in an upcoming election means facing interrogation by potentially armed and threatening USEIP agents at their doorstep thereafter.\"\n\nThe lawsuit claims that some members have worn \"badges\" and falsely accused voters of fraud.\n\n\"Sometimes armed and donning badges to present an appearance of government officiality, USEIP agents interrogate voters about their addresses, whether they participated in the 2020 election, and — if so — how they cast their vote,\" the complaint says. \"It is reported that multiple agents have claimed to be from 'the county,' and have, without any evidence, falsely accused the residents of casting fraudulent ballots.\"\n\nThe voting rights groups say the group's efforts to seek out areas where they believe voter fraud occurred has largely focused on high-density housing areas and communities experiencing a growth in the number of minority voters.\n\n\"No one should have to be afraid to go to the polls or fear that doing so will mean being threatened in their own homes,\" Courtney Hostetler, senior counsel for Free Speech for People and one of the lawyers leading the lawsuit, said in a statement. \"Free and fair elections can only occur when people know that they are able to safely vote without reprisal or intimidation.\"\n\nThe group's \"playbook\" thanks Lindell, a leading election conspiracy theorist. Smith, the group's founder, attended Lindell's election conspiracy-laden \"symposium\" last year in South Dakota along with former Colorado election clerk Tina Peters, who was indicted earlier this month for her role in leaking sensitive voting system data that was published by QAnon conspiracy theorists and right-wing websites. Griswold's office said earlier this year that Smith had also convinced another election official, Elbert County Clerk and Recorder Dallas Schroeder, to make copies of his office's hard drives that he later gave to \"unauthorized people in violation of Election Rules.\"\n\nShawn Smith, the head of USEIP last month led a \"lock her up\" chant while discussing Griswold at a rally and said that \"if you're involved in election fraud, you deserve to hang.\"\n\nHe can also seen in a video among a group of violent Trump supporters who clashed with police outside the Capitol on Jan. 6, 2021. He was accompanied by Colorado state Rep. Ron Hanks, a Republican candidate for U.S. Senate who has also pushed false election claims.\n\nSmith is also the president of another \"election integrity\" group called Cause of America, also funded by Lindell, which Smith announced on Bannon's \"War Room\" podcast.\n\nUSEIP appears to have fully embraced the QAnon conspiracy theory. Its website and the first page of its \"playbook\" include the slogan \"We Are the Plan,\" frequently associated with QAnon believers. During a presentation organized by Sherronna Bishop, the former campaign manager for Rep. Lauren Boebert, USEIP leader Cory Anderson (who is also a member of the anti-government Three Percenter militia) described the briefing as \"being red-pilled,\" according to the Times Recorder. (That expression, originally drawn from \"The Matrix,\" is popular among QAnon followers and other far-right conspiracy theorists.)\n\nThe lawsuit names Smith, as well as co-founders Holly Kasun and Ashe Epp, who was also at the Capitol on Jan. 6, 2021.\n\nIt alleges that their attempted canvassing for election fraud evidence had the \"purpose and effect of intimidating Coloradans from voting, trying to vote, helping others to vote, supporting or advocating for certain political beliefs, or exercising the right to speak, peaceably assemble, or petition the government for redress of grievances, in violation of Section 11(b) of the Voting Rights Act.\" The suit also accuses the group of violating a section of the Ku Klux Klan Act that bans \"conspiracy to interfere with civil rights.\"\n\n\"Sadly, efforts to intimidate voters are nothing new,\" NAACP general counsel Janette McCarthy Wallace said in a statement. \"The NAACP has a long and proud history of opposing those who would seek to thwart democracy. We could not sit idly by and allow voters to potentially be bullied out of exercising their rights.\"\n\nThe lawsuit does not offer specific examples of voters being intimidated or harassed by armed canvassers, but last year USEIP leader Charity McPike urged armed members to provide \"security\" for the group.\n\n\"We are attempting to line up security. However, anyone who carries protection might want to let us know so we can offer your cell phone numbers to those who are concerned,\" McPike said, according to Colorado Pols.\n\n\"No voter should ever feel threatened in the safety of their own homes,\" Celina Stewart, League of Women Voters chief counsel, said in a statement. \"The nefarious actions of the USEIP are a blatant form of voter intimidation used to target and with the intent to silence Colorado voters of color, which is in clear violation of the Voting Rights Act.\"\n\nThe USEIP is also working with the Colorado Republican Party on its \"Election Integrity Operations,\" according to the Times Recorder. A USEIP member is in charge of the GOP's program and has given joint presentations with Epp, the group's co-founder. Heidi Ganahl, the leading Republican candidate for Colorado governor, promoted the group during a recent event, declaring that they are \"doing great things.\"\n\nUSEIP did not respond to a request for comment. The group's website says it plans to expand to other states, including Arizona, Georgia and New Hampshire. Its training materials are already being used by conspiracy theorists in Utah who call themselves the Utah Voter Verification Project, according to the Salt Lake Tribune.\n\nResidents in Hurricane, Utah, alerted Washington County officials in December that members of the group, who refused to identify themselves, showed up at their doors with personal voter information, according to the report. The members also recorded voters without their consent.\n\n\"We can record anyone without telling them. We don't need permission,\" one unidentified trainer told the outlet. The group's training manual also stressed that \"you do not have to identify yourself at all.\"\n\nThe goal of the Utah group appears to be to collect affidavits from voters who claim to have evidence of illegal votes. In the wake of Trump's 2020 defeat, his legal team attempted to submit voter affidavits to prove their debunked allegations, but those efforts were almost entirely rejected by judges and discredited by election officials.\n\nThere has been no credible evidence of voter fraud in Utah, which Trump won by more than 20 points. Republican Gov. Spencer Cox and Lt. Gov. Deidre Henderson condemned those who are spreading \"misinformation\" about the election and dismissed claims of fraud as \"absolute falsehoods.\"\n\nOther Trump supporters have tried similar door-to-door audits. Cyber Ninjas, the bankrupt company that led Arizona's failed \"forensic audit,\" sought to send canvassers door-to-door in Maricopa County but ultimately relented after the Justice Department warned that such an effort would violate federal laws against voter intimidation.\n\nAnother group called the New Mexico Audit Force also sent its members door-to-door in heavily Republican Otero County, which had already spent $50,000 on an \"audit\" confirming that Trump had won the county by more than 25 points. The House Oversight Committee last Thursday announced a probe of the effort, warning that the audit \"illegally interferes with Americans' right to vote by spreading disinformation about elections and intimidating voters.\"\n\nUSEIP also appears to have had trouble vetting its volunteers. The group's training manual says that the group intends to check volunteers' social media and called on them for a \"gut check,\" saying leaders had \"learned (roundaboutly) that there were a couple of people in our group, who were volunteering for our events, who had a criminal history of sexual misconduct,\" and adding, \"it's unfortunate that we must check volunteers for pedophilic leanings.\"",
            "title_similarity": "0.90204436"
        },
        {
            "id": "i1j2lcs",
            "score": 6,
            "text": "[removed]",
            "title_similarity": "0.025070708"
        },
        {
            "id": "i1j2oqo",
            "score": 6,
            "text": "“Make America great again”, eh?",
            "title_similarity": "0.16718212"
        },
        {
            "id": "i1j2peb",
            "score": 7,
            "text": ">USEIP also appears to have had trouble vetting its volunteers. The group's training manual says that the group intends to check volunteers' social media and called on them for a \"gut check,\" saying leaders had \"learned (roundaboutly) that there were a couple of people in our group, who were volunteering for our events, who had a criminal history of sexual misconduct,\" and adding, \"it's unfortunate that we must check volunteers for pedophilic leanings.\"\n\nI love how the QAnon folks, led by Donald Trump, are driven to wipe out elitist corrupt politicians with links to pedophiles.",
            "title_similarity": "0.7191567"
        },
        {
            "id": "i1j2py7",
            "score": 5,
            "text": "Someone walks up to my property armed, trying to intimidate, they better get off my property before I exercise my rights.",
            "title_similarity": "0.594871"
        },
        {
            "id": "i1j2u0u",
            "score": 7,
            "text": "If this is the case, more investigating and jail for anyone involved. This is taking our freedom and not taken seriously enough.",
            "title_similarity": "0.41236708"
        },
        {
            "id": "i1j2u15",
            "score": 9,
            "text": "Another step towards fascism by the right…",
            "title_similarity": "0.19134685"
        },
        {
            "id": "i1j2z67",
            "score": 34,
            "text": "[removed]",
            "title_similarity": "0.025070708"
        },
        {
            "id": "i1j3cbl",
            "score": 6,
            "text": "According to the article, this happened in El Paso, Mesa, and Weld counties.  What I don't understand is why they were trying to intimidate people in counties that are already \"red\" counties?  Weld County gives us Ken Buck.  Mesa gives us the likes of Tina Peters and Boobert.\n\nThe USEIP really does draw the best people...\n> \"it's unfortunate that we must check volunteers for pedophilic leanings.\"",
            "title_similarity": "0.6694463"
        },
        {
            "id": "i1j3ez9",
            "score": 2,
            "text": "Which is why If they ask me, I voted Kanye",
            "title_similarity": "0.27492726"
        },
        {
            "id": "i1j3nvr",
            "score": 1,
            "text": "At least these guys knock when they try to weaponize fear against the masses",
            "title_similarity": "0.59212476"
        },
        {
            "id": "i1j3vv2",
            "score": 1,
            "text": "Yes",
            "title_similarity": "-0.17321771"
        },
        {
            "id": "i1j3y8b",
            "score": 2,
            "text": "Going full nazi junta to catch the .0008-ish percent of individual voters (of all ethnicities and political affiliation, by the way) who deliberately vote illegally (it’s usually clerical or bad data matching) seems a tad off. This is the rotten fruit of the collapse of truth that really took off leading up to and following the 2016 election.",
            "title_similarity": "0.7309936"
        },
        {
            "id": "i1j43pe",
            "score": 6,
            "text": "Such a third world country thanks to conservatives, gj pals.",
            "title_similarity": "0.35788482"
        },
        {
            "id": "i1j491n",
            "score": 6,
            "text": "That sounds like like it might fall under the definition of terrorism - the use of or threat of violence (intimidation) or political gain…",
            "title_similarity": "0.57321537"
        },
        {
            "id": "i1j4ft8",
            "score": 1,
            "text": "They’re not sending their best",
            "title_similarity": "0.13212912"
        },
        {
            "id": "i1j4ic5",
            "score": 15,
            "text": "Of course they only did this to minorities in red counties. Come to Five Points in Denver and try that shit.",
            "title_similarity": "0.4254144"
        },
        {
            "id": "i1j4ikw",
            "score": 9,
            "text": "And the damn morons still think having a KKK member in your family doesn't mean anything.",
            "title_similarity": "0.4811158"
        },
        {
            "id": "i1j4ou8",
            "score": 5,
            "text": "I’m not sure why this group isn’t targeting likely Trump supporters, as the voter fraud that was uncovered from the last election came from them.",
            "title_similarity": "0.63566554"
        },
        {
            "id": "i1j4rs3",
            "score": 5,
            "text": "GQP and it’s allies really like the Russia way",
            "title_similarity": "0.20767245"
        },
        {
            "id": "i1j4xvc",
            "score": 1,
            "text": "Lawn sprinkler time!",
            "title_similarity": "0.047755964"
        },
        {
            "id": "i1j4zfw",
            "score": 3,
            "text": "Of course republicans are out in full force disavowing these individuals and actions. /S",
            "title_similarity": "0.5682231"
        },
        {
            "id": "i1j4zmh",
            "score": 32,
            "text": "Why is this just a lawsuit? They should be facing criminal charges",
            "title_similarity": "0.56829923"
        },
        {
            "id": "i1j54hv",
            "score": 5,
            "text": "I wonder how much more of this stuff is going to come out.  They seemed to send a lot of people out to intimidate voters and election workers. This isn't how democracy works. This is authoritarian thugs being sent out by a fascist trying to overturn it.\n\nhttps://www.reuters.com/business/media-telecom/kanye-west-publicist-pressed-georgia-election-worker-confess-bogus-fraud-charges-2021-12-10/\n\n\"The following day, Jan. 6, Kutti’s prediction that people would descend on Freeman’s home in 48 hours proved correct, according to a defamation lawsuit Freeman and Moss filed last week against a far-right news site. Freeman, the lawsuit said, left hours before a mob of angry Trump supporters surrounded her home, shouting through bullhorns.\"",
            "title_similarity": "0.77740526"
        },
        {
            "id": "i1j58ay",
            "score": 1,
            "text": "Ah yes nothing like a piping hot mug of well poison in the morning.",
            "title_similarity": "0.20346689"
        },
        {
            "id": "i1j5aua",
            "score": 6,
            "text": "Only GQP supporters pull shits like this, meanwhile they cry about voter fraud and unfair shit. What a bunch of ass wipes",
            "title_similarity": "0.679399"
        },
        {
            "id": "i1j5epg",
            "score": 2,
            "text": "Mike Pillow really needs to be stopped.  He has gone too far with this insanity.",
            "title_similarity": "0.48006815"
        },
        {
            "id": "i1j5l2w",
            "score": 9,
            "text": "Funny the most active country against terrorism has the most domestic terrorists.",
            "title_similarity": "0.5423379"
        },
        {
            "id": "i1j5nbt",
            "score": 4,
            "text": "The perpetrators of things like this should be imprisoned for 30 years at least. Sickening and horrifying.",
            "title_similarity": "0.5383681"
        },
        {
            "id": "i1j5v0b",
            "score": 2,
            "text": "Disgusting.",
            "title_similarity": "0.12224957"
        },
        {
            "id": "i1j5vu2",
            "score": 2,
            "text": "So why hasn’t the state or feds jumped all over these shitbags? Why does a voter rights group have to fight this?",
            "title_similarity": "0.7572801"
        },
        {
            "id": "i1j5wvb",
            "score": 2,
            "text": "Someone post this on Trump or Conservative. I would but I'm banned....",
            "title_similarity": "0.5261553"
        },
        {
            "id": "i1j5yev",
            "score": 5,
            "text": "If they come to your house call the police immediately. If they force their way not your house you can handle that however you want, just remember they have to cross the threshold and you can’t invite them in. You don’t have to give any other warning other than “you aren’t welcome here  and I need you to leave”. After that feel free to deal with them as you would any other armed person forcing their way into your home. \n\nIf you allow them to draw breath here’s your rights to make an arrest. Colorado law allows you to use violence to make a citizens arrest, Barring you don’t bait them into an altercation. Know the law and this will all be over shortly. \n\nhttps://www.hmichaelsteinberg.com/understanding-colorados-citizens-arrest-law-16-3-201.html\n\nhttps://www.shouselaw.com/co/defense/legal-defenses/self-defense/",
            "title_similarity": "0.6364682"
        },
        {
            "id": "i1j621z",
            "score": 1,
            "text": "Trump supporters being pathetic as usual. Would love to see how they would enforce it their no-teeth threats.",
            "title_similarity": "0.56613886"
        },
        {
            "id": "i1j62bo",
            "score": 4,
            "text": "Voter intimidation should be have stiff penalties.  Throw them in jail. Fuck 'em.",
            "title_similarity": "0.6666733"
        },
        {
            "id": "i1j62pc",
            "score": 2,
            "text": "all i can think of is fight club, hit the prick with a broom. “im gonna go back inside, and get a shovel.”",
            "title_similarity": "0.51429737"
        },
        {
            "id": "i1j64ft",
            "score": 6,
            "text": "I have yet to see a news headline that starts with \"Pro-Trump\" group that ends up being wholesome.",
            "title_similarity": "0.40248126"
        },
        {
            "id": "i1j64z2",
            "score": 9,
            "text": "If you have to go to these lengths to secure the vote, perhaps you’re on the wrong team",
            "title_similarity": "0.41067445"
        },
        {
            "id": "i1j6g60",
            "score": 2,
            "text": "Lock them up!  Lock them up!",
            "title_similarity": "0.28751573"
        },
        {
            "id": "i1j6i9m",
            "score": 13,
            "text": "It's weird how a group that insists fraud occurred falsely represent themselves as being gov officials. It's not surprising, seeing how they're aligned with the same folks that sent people to falsely pose as electors following the 2020 election, or turned off security cameras to allow unauthorized people to have access to voting data on secure servers.\n\nJust some good ol law abiding citizens, right?",
            "title_similarity": "0.69227505"
        },
        {
            "id": "i1j6ocw",
            "score": 4,
            "text": "Does Colorado have stand your ground?",
            "title_similarity": "0.38712803"
        },
        {
            "id": "i1j6uwh",
            "score": 10,
            "text": "How very fascist of them.\n\nSmall-minded people trying to bring the world down to their level. I'm afraid we're heading for another civil war.",
            "title_similarity": "0.5616734"
        },
        {
            "id": "i1j6xc9",
            "score": 2,
            "text": "Wait, Alex was telling me this was what the evil globalists were planning to do with vaccines!\n\n/s\n\nThey really are the party of projection, huh.",
            "title_similarity": "0.6269337"
        },
        {
            "id": "i1j6xgn",
            "score": 2,
            "text": "These terrorists come to my state and knock on my door I’m telling them I voted for Kanye.",
            "title_similarity": "0.6540183"
        },
        {
            "id": "i1j6xjr",
            "score": 4,
            "text": "White people getting real squirrelly lately.",
            "title_similarity": "0.23829852"
        },
        {
            "id": "i1j76rm",
            "score": 1,
            "text": "Fuck. Bad things need to happen to the people doing this, but just like the January 6th coup, nothing will happen to these people.\n\nIt just keeps getting worse, doesn't it?",
            "title_similarity": "0.5263286"
        },
        {
            "id": "i1j77is",
            "score": 5,
            "text": "Would someone explain to me why this is a lawsuit (civil) and these folks haven't been prosecuted in criminal court? It's like, people (us, police, law makers, everyone) are just watching this subversion happen.  And one day, we will wake up and these idiots will control the country.  \n\n&#x200B;\n\n[https://www.law.georgetown.edu/icap/wp-content/uploads/sites/32/2020/10/Voter-Intimidation-Fact-Sheet.pdf](https://www.law.georgetown.edu/icap/wp-content/uploads/sites/32/2020/10/Voter-Intimidation-Fact-Sheet.pdf)",
            "title_similarity": "0.6231155"
        },
        {
            "id": "i1j79g6",
            "score": 2,
            "text": "Well, they ditched the hoods, and now knock on doors. This is the new KKK!",
            "title_similarity": "0.36784846"
        },
        {
            "id": "i1j7cuq",
            "score": 2,
            "text": "As a non-American, I keep reading these stories but never do I read about mass arrests being made. Wtf is going on? How are people getting away with this?",
            "title_similarity": "0.513585"
        },
        {
            "id": "i1j7egz",
            "score": 3,
            "text": "That seals it, I’m installing the trap door.",
            "title_similarity": "0.35167867"
        },
        {
            "id": "i1j7kmx",
            "score": 1,
            "text": "So, they we’re just like, “how can we bring back a meaner Boss tweed without Tammany hall?”",
            "title_similarity": "0.49210572"
        },
        {
            "id": "i1j7lfp",
            "score": 6,
            "text": "Oh, look, trump supporters literally using nazi tactics. Its like I was right about them from day one.",
            "title_similarity": "0.5636106"
        },
        {
            "id": "i1j7mb0",
            "score": 2,
            "text": "What a great idea - walk door to door in one of the more heavily-armed states trying to intimidate people. It's a wonder none were shot.",
            "title_similarity": "0.5375429"
        },
        {
            "id": "i1j7s4u",
            "score": 2,
            "text": "This is why we have prisons. If a politician tries to weasel them out, strip them of power. It's been time to play hardball for 10 years. We can't tolerate intolerance!",
            "title_similarity": "0.5845448"
        },
        {
            "id": "i1j8aq2",
            "score": 1,
            "text": "Aw man! I would LOVE for one of those fat corn chips to arrive at our door! Oh! What fun!",
            "title_similarity": "0.31569922"
        },
        {
            "id": "i1j8hq6",
            "score": 1,
            "text": "Mike Pillow needs to be locked up",
            "title_similarity": "0.38093755"
        },
        {
            "id": "i1j8om5",
            "score": 1,
            "text": "Blast em away",
            "title_similarity": "0.14920434"
        },
        {
            "id": "i1j8p6c",
            "score": 3,
            "text": "I just love the fact that all these morons think liberals do not arm themselves. Say hello to my little friend.",
            "title_similarity": "0.37077785"
        },
        {
            "id": "i1j8phs",
            "score": 1,
            "text": "luckily we have stand your ground laws… And if ever anyone brought a gun on my property that would be the end of it for them.",
            "title_similarity": "0.4489931"
        },
        {
            "id": "i1j8qi7",
            "score": 3,
            "text": "sometimes i imagine we could have a good country with access to guns for personal safety/sport shooting/hunting. then fucks like this ruin everything",
            "title_similarity": "0.6083132"
        },
        {
            "id": "i1j8tbg",
            "score": 1,
            "text": "\"Free and fair elections? Who needs that!\"",
            "title_similarity": "0.21176551"
        },
        {
            "id": "i1j8van",
            "score": 2,
            "text": "Even if I saw these clowns walk up to my door with fake badges, I know government officials don’t do that. I’d tell “I wasn’t going to vote for Biden, but now I will. Now get the hell off my property.”\n\nBefore you say something about their guns. They won’t shoot. And if they do, well then lets just say it is another issue for the GOP to deal with.",
            "title_similarity": "0.59769785"
        },
        {
            "id": "i1j8w49",
            "score": 3,
            "text": "Isn’t that a federal crime?",
            "title_similarity": "0.4302879"
        },
        {
            "id": "i1j8znm",
            "score": 2,
            "text": "Wow…this is disgusting…",
            "title_similarity": "0.17776531"
        },
        {
            "id": "i1j95mp",
            "score": 1,
            "text": "yikes!",
            "title_similarity": "0.0072057266"
        },
        {
            "id": "i1j9960",
            "score": 1,
            "text": "Stand your ground?",
            "title_similarity": "0.07752466"
        },
        {
            "id": "i1j997v",
            "score": 1,
            "text": "That's so dumb. If someone did that to me I would be sure to vote for the other guy. Whoever thought that threatening voters would get the vote you want is so dumb.",
            "title_similarity": "0.5304839"
        },
        {
            "id": "i1j9ber",
            "score": 1,
            "text": "Lock them up",
            "title_similarity": "0.24833944"
        },
        {
            "id": "i1j9dgt",
            "score": 1,
            "text": "Man, I'm like, totally so surprised.\n\n/s",
            "title_similarity": "0.15887448"
        },
        {
            "id": "i1j9rxn",
            "score": 1,
            "text": "i aint a lefty, and i aint a righty. guess im kinda ambidextrous in a way. but i'm a 2A supporter, and if some armed fuckheads are coming onto MY property to question me about my voting records? they're gonna be facing the same shit they brought to MY GODDAMN HOUSE.\n\nwho the fuck do these people think they are and what fucking fairy tale are they believing that they think they can do this shit with impunity?",
            "title_similarity": "0.7624748"
        },
        {
            "id": "i1j9ucl",
            "score": 1,
            "text": "Geez, this is like Roman Republic levels of corrupt fuckery",
            "title_similarity": "0.47940838"
        },
        {
            "id": "i1j9xqz",
            "score": 1,
            "text": "Seems like a pretty good way to get yourself shot.",
            "title_similarity": "0.20556928"
        },
        {
            "id": "i1j9ymr",
            "score": 3,
            "text": "Some more BoTh SiDEs stuff right here….\n\nOr are people gonna claim this is the same as handing out water in voting lines.",
            "title_similarity": "0.3090338"
        },
        {
            "id": "i1ja2i0",
            "score": 1,
            "text": "Can’t wait for them to show up at my house.",
            "title_similarity": "0.1558688"
        },
        {
            "id": "i1ja2rm",
            "score": 3,
            "text": "That’s a dumb way to get shot. You show up to my house with a weapon (you’re not LE) I’m coming outside with a weapon.",
            "title_similarity": "0.5062313"
        },
        {
            "id": "i1ja3kg",
            "score": 1,
            "text": "Is it 1876?",
            "title_similarity": "0.047238808"
        },
        {
            "id": "i1jahji",
            "score": 2,
            "text": "Isn't voter intimation a big dederal offense with significant jail time?",
            "title_similarity": "0.5983034"
        },
        {
            "id": "i1jaike",
            "score": 2,
            "text": "LPT: If I don't know you. You are armed, not the police, and you come onto my property, and knock even lightly. My cameras will prove I had the right to defend myself from an obvious home invasion.",
            "title_similarity": "0.60020185"
        },
        {
            "id": "i1jajwc",
            "score": 1,
            "text": "Damn, bowser sent his goombas to scare us.\nJust tell them to get off your property, that’s all they understand.",
            "title_similarity": "0.67151713"
        },
        {
            "id": "i1jal37",
            "score": 1,
            "text": "Typical Law abiding gun owners tho!",
            "title_similarity": "0.39958256"
        },
        {
            "id": "i1jb0aw",
            "score": 1,
            "text": "Light deez fuckers up.",
            "title_similarity": "0.20958412"
        },
        {
            "id": "i1jb456",
            "score": 1,
            "text": "Wait, people still answer their doors?  I stopped answering my door to people I don't know A LONG TIME AGO.  I've even had cops come to my door (not for me) and I still didn't answer.  If they're coming for me they can break that shit down.",
            "title_similarity": "0.46641633"
        },
        {
            "id": "i1jb52i",
            "score": 1,
            "text": "Sounds like a lack of manhood in Colorado.",
            "title_similarity": "0.38919663"
        },
        {
            "id": "i1jbcok",
            "score": 2,
            "text": "Knocking on my door, armed, to try and intimidate me in my own home is a good way to get shot in the face.",
            "title_similarity": "0.6072062"
        },
        {
            "id": "i1jbq21",
            "score": 2,
            "text": "Colorado is an odd place to do this considering the gun culture of the state. Almost everyone is armed.",
            "title_similarity": "0.65268946"
        },
        {
            "id": "i1jbxcg",
            "score": 2,
            "text": "Shit, come to my door in Colorado like that and see what happens",
            "title_similarity": "0.53320765"
        },
        {
            "id": "i1jcu2o",
            "score": 1,
            "text": "Dr. Ossain Sweet had the solution to this.  Easier now than ever.",
            "title_similarity": "-0.019284815"
        },
        {
            "id": "i1jd8dk",
            "score": 2,
            "text": "There should be loads of \"ring\" door will recorded videos. Where are they, let's publish them please if this happened to you.",
            "title_similarity": "0.3922009"
        },
        {
            "id": "i1jdxh2",
            "score": 2,
            "text": "Arrest all of them.",
            "title_similarity": "0.3797984"
        },
        {
            "id": "i1jf1ti",
            "score": 3,
            "text": "If the opposite was happening and it was 'libruhl' people doing this, you'd see it used as an excuse to cause violence and hurt random people.",
            "title_similarity": "0.57758176"
        },
        {
            "id": "i1jf5dr",
            "score": 6,
            "text": "This is why voter anonymity - not privacy, *anonymity* - is an absolute cornerstone of the whole idea of voting. It's one of the bigger reasons why electronic voting is the shittiest idea in the history of ideas. \n\nIf nobody can tell how you voted but your vote is still 100% reliably counted as a vote, intimidating you to vote any specific way is doomed to fail and may even backfire. \n\nJust tell the fucking fascists anything they want to hear, and then vote them off the damned planet.",
            "title_similarity": "0.6025999"
        },
        {
            "id": "i1jfogg",
            "score": 3,
            "text": "The good news, is that if anything makes Colorado more likely to pass the Approval Voting system in Colorado it will be this.\n\nOnce we finally get that system in place, a LOT of these fear tactics will be far less useful.",
            "title_similarity": "0.5959986"
        },
        {
            "id": "i1jgiu6",
            "score": 1,
            "text": "How  long before we have tons of accusations that this was actually ANTIFA?",
            "title_similarity": "0.43409526"
        },
        {
            "id": "i1jh8y2",
            "score": 3,
            "text": "Fuck em. Id say I'm voting for Biden. What tf they gonna do?  Shoot me? Lol.  Yeah ok",
            "title_similarity": "0.567799"
        },
        {
            "id": "i1jha18",
            "score": 1,
            "text": "These thugs, and those buying into their bullsh*t... are America's Worst.",
            "title_similarity": "0.5839188"
        },
        {
            "id": "i1jheyw",
            "score": 2,
            "text": "I do NOT condone violence BUT I am shocked that this didn't lead to one of these morons being shot.",
            "title_similarity": "0.39644524"
        },
        {
            "id": "i1jhg0f",
            "score": 1,
            "text": "I wish a motherfucker would",
            "title_similarity": "0.30858597"
        },
        {
            "id": "i1jhppj",
            "score": 1,
            "text": "they sure got lot of freedumb on their hands",
            "title_similarity": "0.115635924"
        },
        {
            "id": "i1ji50i",
            "score": 1,
            "text": "Holy shit this is bad and terrifying. I hope this gets shouted from the rooftops everywhere and isn’t buried.",
            "title_similarity": "0.47592837"
        },
        {
            "id": "i1jiaxa",
            "score": 2,
            "text": "Bullshit. Biden won fair and square! Everybody knows this! Like omg how could you",
            "title_similarity": "0.3120116"
        },
        {
            "id": "i1jicmw",
            "score": 2,
            "text": "Instead of saying Pro-Trump, say Pro-GOP. Trump was a symptom of the direction the GOP has been going.",
            "title_similarity": "0.49536204"
        },
        {
            "id": "i1jicvk",
            "score": 3,
            "text": "Tell me again how Trump supporters aren't totally psychotic? 🤣",
            "title_similarity": "0.3924315"
        },
        {
            "id": "i1jijye",
            "score": 1,
            "text": "Well, if you're going to do extremely illegal and dangerous racist stuff, you'd be pretty safe to do it it Nebraska.",
            "title_similarity": "0.5098206"
        },
        {
            "id": "i1jimum",
            "score": 1,
            "text": "And this is making American great again 🤦🏻‍♂️🤦🏻‍♂️",
            "title_similarity": "0.16380417"
        },
        {
            "id": "i1jinit",
            "score": 5,
            "text": "Colorado is a make my day state. You could literally shoot somebody dead for stepping onto your property with a gun and you're within your rights. This doesn't seem like the best state to be doing that in. Once the word got around in the neighborhood, it's very easy to see somebody taking these people up on their threats.\n\nThis is just stupid. Who does this type of shit and goes home thinking they're the good guy?",
            "title_similarity": "0.6793978"
        },
        {
            "id": "i1jipt2",
            "score": 1,
            "text": "That’s a great way to ensure his defeat",
            "title_similarity": "0.23691234"
        },
        {
            "id": "i1jir6y",
            "score": 2,
            "text": "Headline adjustment: Pro-Trump fascist group sent armed members...",
            "title_similarity": "0.6681855"
        },
        {
            "id": "i1jiv4k",
            "score": 1,
            "text": "Lol come to New Hampshire and try that. If you love politics thats your business, you step on my property for your political bullshit it’s fair game",
            "title_similarity": "0.5884558"
        },
        {
            "id": "i1jj2z7",
            "score": 2,
            "text": "Surely somebody has video from their Ring camera of something?  Unless they specifically avoid houses/apartments with door cameras.",
            "title_similarity": "0.4421066"
        },
        {
            "id": "i1jjbbq",
            "score": 2,
            "text": "And he still lost.",
            "title_similarity": "0.0678871"
        },
        {
            "id": "i1jjddv",
            "score": 2,
            "text": "This is fucking insane, I've NEVER heard of this happening, but I'm pretty sure this breaks all sort of laws. If I was the people who owned a residence I would honestly start arming up, do NOT answer your door and do NOT let people on your property.",
            "title_similarity": "0.59196067"
        },
        {
            "id": "i1jjn27",
            "score": 1,
            "text": "Political Discourse, perhaps.",
            "title_similarity": "0.22476272"
        },
        {
            "id": "i1jjpk4",
            "score": 2,
            "text": "This is one of those circumstances where I feel it's totally appropriate to, as a homeowner, stick a rifle in someone's face and insist that they wait for the Sheriff.",
            "title_similarity": "0.56770724"
        },
        {
            "id": "i1jk24d",
            "score": 2,
            "text": "No surprise there . It is fully supported by Trump & all his Oath Keepers",
            "title_similarity": "0.24865127"
        },
        {
            "id": "i1jk2pf",
            "score": 8,
            "text": "Open carry is, and always has been, only about intimidation.",
            "title_similarity": "0.37305593"
        },
        {
            "id": "i1jk8eu",
            "score": 1,
            "text": "*Merrick Garland could not be reached for comment.*",
            "title_similarity": "0.17637998"
        },
        {
            "id": "i1jkkhq",
            "score": 1,
            "text": "So they have to sue to be protected by the law. Fucking joke of a country we are.",
            "title_similarity": "0.59404486"
        },
        {
            "id": "i1jkn1n",
            "score": 2,
            "text": "Answers door to armed men demanding I vote Trump.\n\nNo thank you, I'm not interested in girl scout cookies.",
            "title_similarity": "0.59220254"
        },
        {
            "id": "i1jkq3x",
            "score": 2,
            "text": "This is the kind of thing we see in banana republics.",
            "title_similarity": "0.051875524"
        },
        {
            "id": "i1jktlh",
            "score": 3,
            "text": "We all knew this was coming. If they show up on your doorstep armed, Colorado has a castle doctrine.",
            "title_similarity": "0.53746283"
        },
        {
            "id": "i1jkwln",
            "score": 3,
            "text": "I thought they were the ones afraid that the third reich happens in America",
            "title_similarity": "0.5386559"
        },
        {
            "id": "i1jl9wq",
            "score": 2,
            "text": "We all know this shit was going on. \n\nWHAT ARE YOU GOING TO DO ABOUT IT AMERICA?",
            "title_similarity": "0.33041847"
        },
        {
            "id": "i1jljbr",
            "score": 3,
            "text": "I am a gun owner in Colorado.  What rights do I have to stop people like this from stepping onto my private property?  What right do they have to step onto my property armed? Even if they have an open carry license. Do I not have the right to feel safe on my own property?  This is why I do not agree with open carry. These people do not make me feel safe.",
            "title_similarity": "0.756199"
        },
        {
            "id": "i1jlsmx",
            "score": 4,
            "text": "I'll just leave this little nugget right here, one of the pro-Trump group members said:  \n  \n>\"it's unfortunate that we must check volunteers for pedophilic leanings.\"",
            "title_similarity": "0.5961546"
        },
        {
            "id": "i1jltrh",
            "score": 1,
            "text": "So much for don’t tread on me",
            "title_similarity": "0.07804372"
        },
        {
            "id": "i1jlu8s",
            "score": 1,
            "text": "Monsters are trying to take control of our government",
            "title_similarity": "0.66905177"
        },
        {
            "id": "i1jlv51",
            "score": 7,
            "text": "MGT only won because she ran un apposed because the person who was running against her, he was a Literary Doctor, was getting death threats against him and his family by \"unknown\" people.",
            "title_similarity": "0.6419214"
        },
        {
            "id": "i1jlwwr",
            "score": 3,
            "text": "It’s annoying how badly trump supporters want to be a cult",
            "title_similarity": "0.5608363"
        },
        {
            "id": "i1jlx8i",
            "score": 2,
            "text": "Oh good, I heard about that and thought it was horrific, I'm very glad to hear there is actually a law that covers it in some way.",
            "title_similarity": "0.35049844"
        },
        {
            "id": "i1jmdrg",
            "score": 2,
            "text": "BRB, digging Nazi-catching trapdoor in front of my entrance.",
            "title_similarity": "0.5003521"
        },
        {
            "id": "i1jmdt4",
            "score": 1,
            "text": "Bet they wont do that shit in the south...",
            "title_similarity": "0.29270035"
        },
        {
            "id": "i1jmi4h",
            "score": 1,
            "text": "Whenever I hear pro-Trump grouting immediately think fascists and I’m always right.",
            "title_similarity": "0.41300395"
        },
        {
            "id": "i1jmkdm",
            "score": 3,
            "text": "We no longer have two political parties conservatives are not playing politics they are actively conducting an insurrection people need to wake up",
            "title_similarity": "0.5644623"
        },
        {
            "id": "i1jmlu2",
            "score": 2,
            "text": "Pretty sure the Nazis did this as well, hmm",
            "title_similarity": "0.38466126"
        },
        {
            "id": "i1jmn61",
            "score": 2,
            "text": "They are getting prepared to deny the results in the upcoming elections unless Republicans win that’s not gonna lead to anything good",
            "title_similarity": "0.5412878"
        },
        {
            "id": "i1jmnf2",
            "score": 3,
            "text": "When a website starts with \"Patriots!\", then quotes Lincoln, it's def some Q shit.",
            "title_similarity": "0.5186137"
        },
        {
            "id": "i1jmo5q",
            "score": 4,
            "text": "I wonder how it would go if armed people of color started confronting voters in white neighborhoods. Seeing how a black guy can get murdered just for jogging I’m pretty sure there’s be a lot of white people and cops suddenly “fearing for their lives”.",
            "title_similarity": "0.6828462"
        },
        {
            "id": "i1jms22",
            "score": 3,
            "text": "People act like these degenerates value law in the first place.",
            "title_similarity": "0.35749623"
        },
        {
            "id": "i1jmuo7",
            "score": 3,
            "text": "Pillow fascists never showed up at my door. They’d get an earful and a 911 call. Nazi scum.",
            "title_similarity": "0.50963825"
        },
        {
            "id": "i1jmvgv",
            "score": 5,
            "text": "It is such a shame what has happened to the States. From someone living outside this country, the US no longer seems like a safe country to visit.",
            "title_similarity": "0.4692571"
        },
        {
            "id": "i1jmwto",
            "score": 3,
            "text": "This reminds me of the stereotypical criminal that conservatives warn you. The type that needs to be locked away forever because they will just keep on committing crimes.",
            "title_similarity": "0.6575301"
        },
        {
            "id": "i1jmy12",
            "score": 3,
            "text": "“Is that a gun? Bro what the fuck? Get off my property.”\n*slam*",
            "title_similarity": "0.60704124"
        },
        {
            "id": "i1jnad8",
            "score": 2,
            "text": "What do you mean a lawsuit? That sounds like civil court stuff. Throw these mother fuckers in jail...",
            "title_similarity": "0.62409544"
        },
        {
            "id": "i1jnc9n",
            "score": 1,
            "text": "Oh I HOPE these fuckers show up on my property 😡 fucking troglodytes",
            "title_similarity": "0.5191237"
        },
        {
            "id": "i1jnelz",
            "score": 2,
            "text": "Pieces of shit all of them.",
            "title_similarity": "0.11996184"
        },
        {
            "id": "i1jnggw",
            "score": 4,
            "text": "But of course, it's the Libs who cheated to steal the election.\n\nProjection is a hell of a drug. Ever since Agent Orange started accusing the other side of election fraud, it was clear that if any fraud happened it was on the GOP's side.",
            "title_similarity": "0.6881416"
        },
        {
            "id": "i1jnksd",
            "score": 2,
            "text": "Write your congress person.  Let’s keep a spotlight on this and follow up with criminal prosecution.",
            "title_similarity": "0.51961565"
        },
        {
            "id": "i1jnor2",
            "score": 3,
            "text": "I can totally see Lindell going to jail ( and they not give him a pillow )",
            "title_similarity": "0.52748984"
        },
        {
            "id": "i1jnouc",
            "score": 2,
            "text": "TLDR, don’t fucking open your doors for anyone I guess",
            "title_similarity": "0.34221435"
        },
        {
            "id": "i1jnowc",
            "score": 3,
            "text": "We should fire the police department heads of those cities for not doing anything. They certainly saw what was going on and did nothing.\n\nSame thing for the city council members at the time.\n\nIt takes a village.",
            "title_similarity": "0.5641974"
        },
        {
            "id": "i1jnznd",
            "score": 5,
            "text": "This is domestic terrorism. When are these racist cowards going to be thrown in the same cages they wish to see us in. God I hate these bozos",
            "title_similarity": "0.69646615"
        },
        {
            "id": "i1jo8x9",
            "score": 3,
            "text": "pfft… Colorado…please. Go do that shit in East LA, Oakland or New York City. \n\nGet bullied.",
            "title_similarity": "0.72254634"
        },
        {
            "id": "i1jo9yp",
            "score": 3,
            "text": "What a bunch of dorks. Nice guns, DORKS.",
            "title_similarity": "0.27589044"
        },
        {
            "id": "i1joloy",
            "score": 3,
            "text": "Sure hope they get the book thrown at them for this....",
            "title_similarity": "0.34843433"
        },
        {
            "id": "i1joonn",
            "score": 6,
            "text": "They are no longer flirting with fascism, they are out right practicing it.",
            "title_similarity": "0.26112"
        },
        {
            "id": "i1jope4",
            "score": 3,
            "text": "Read to see where in Colorado- exactly where I would have guessed.",
            "title_similarity": "0.387841"
        },
        {
            "id": "i1jov76",
            "score": 7,
            "text": "I was an election observer in Las Vegas Nevada and I had to deal with an armed fat man at the door of our polling station intimidating voters as they walked in.  You'd be shocked to hear how hard it was for us to get the cops to make him leave.  It was almost as if the cops didn't give a shit and was only when we went higher on the ladder until the cops made him leave.",
            "title_similarity": "0.6941041"
        },
        {
            "id": "i1jozde",
            "score": 7,
            "text": "This is literally the definition of terrorism.",
            "title_similarity": "0.36134166"
        },
        {
            "id": "i1jplff",
            "score": 1,
            "text": "They are doing this in Otero county New Mexico as well.",
            "title_similarity": "0.3864825"
        },
        {
            "id": "i1jppwz",
            "score": 3,
            "text": "[deleted]",
            "title_similarity": "0.04714236"
        },
        {
            "id": "i1jptc5",
            "score": 3,
            "text": "But conservatives won't talk about this",
            "title_similarity": "0.24874122"
        },
        {
            "id": "i1jq2pa",
            "score": 2,
            "text": "Under the 2001 USA Patriot Act, domestic terrorism is defined as \"activities that (A) involve acts dangerous to human life that are a violation of the criminal laws of the U.S. or of any state; \n\n*(B) appear to be intended (i) to intimidate or coerce a civilian population; (ii) to influence the policy of a government by intimidation or coercion; or (iii) to affect the conduct of a government by mass destruction, assassination, or kidnapping;*\n\nand(C) occur primarily within the territorial jurisdiction of the U.S.\"",
            "title_similarity": "0.72139186"
        },
        {
            "id": "i1jq333",
            "score": 3,
            "text": "You know you’re a big piece of shit when you violate a law called the “Ku Klux Klan Act.” One would hope so at least.",
            "title_similarity": "0.6894121"
        },
        {
            "id": "i1jq4up",
            "score": 2,
            "text": "I wonder if they offer the MyPillow in state correctional facilities.",
            "title_similarity": "0.4144169"
        },
        {
            "id": "i1jqioj",
            "score": 1,
            "text": "Show up at my door and they’ll be wishing they’d stayed home.",
            "title_similarity": "0.39049798"
        },
        {
            "id": "i1jqm7f",
            "score": 2,
            "text": "God bless America for real",
            "title_similarity": "0.1548076"
        },
        {
            "id": "i1jqtca",
            "score": 1,
            "text": "Great, add it to the list of crimes by right wing assholes so it, like the others, can be hand-waved away by complicit piece of shit republicans. \n\nI'm so fucking sick of this timeline. \n\nParty of law and order, my ass.",
            "title_similarity": "0.6904874"
        },
        {
            "id": "i1jr1fj",
            "score": 1,
            "text": "My god. Sounds like china. But it’s USA😳",
            "title_similarity": "0.14081767"
        },
        {
            "id": "i1jr338",
            "score": 2,
            "text": "This is why I never answer my door unless I am expecting someone.",
            "title_similarity": "0.34808657"
        },
        {
            "id": "i1jr5vf",
            "score": 2,
            "text": "Pro trump, or just psychopaths?",
            "title_similarity": "0.5474916"
        },
        {
            "id": "i1jr5wp",
            "score": 1,
            "text": "Wut?",
            "title_similarity": "-0.044300318"
        },
        {
            "id": "i1jr86t",
            "score": 2,
            "text": "Nothing says \"I'm scared of my guy losing\" or \"We can't win unless we cheat\" than going to someone's door and threatening violence unless I vote for the demagogue.",
            "title_similarity": "0.5861616"
        },
        {
            "id": "i1jrinf",
            "score": 2,
            "text": "Someone comes to my door open carrying a gun? They get a shotgun In their face and told to leave. They tried this shit here in arizona. It was hilarious to see how quickly they’d backpedal with a double barrel 12 gauge in their face.",
            "title_similarity": "0.69446826"
        },
        {
            "id": "i1jrkt9",
            "score": 1,
            "text": "Shit is out of control and many people actually love what's going on.",
            "title_similarity": "0.23505545"
        },
        {
            "id": "i1jrlzm",
            "score": 1,
            "text": "Some idiot shows up at my door with a gun, they’re really, really good g to regret it.",
            "title_similarity": "0.5610434"
        },
        {
            "id": "i1jrovx",
            "score": 1,
            "text": "probably the police themselves go door to door with them",
            "title_similarity": "0.4321932"
        },
        {
            "id": "i1jrrjv",
            "score": 2,
            "text": "Lol, how're they gonna know they voted for them?\n\nAnd of course Mike lindell the traitorous slug he his is connected to this. Fuck my pillow, all my homies hate my pillow.",
            "title_similarity": "0.6109475"
        },
        {
            "id": "i1jrutz",
            "score": 3,
            "text": "Given that Trump is the current head of the GOP, that would make them a pro-GOP group.  Don't let the GOP get off by blaming Trump.",
            "title_similarity": "0.5733421"
        },
        {
            "id": "i1js77k",
            "score": 2,
            "text": "Why do I always hear about “lawsuits” in cases like this? Where are the damn criminal charges?! These people are dangerous.",
            "title_similarity": "0.61793125"
        },
        {
            "id": "i1js7hx",
            "score": 2,
            "text": "Wow! That’s wild!! If it escalates any further, they might raid the Capitol to stop an election process.",
            "title_similarity": "0.7147486"
        },
        {
            "id": "i1js8hm",
            "score": 9,
            "text": "In 2016, I had two guys show up to my front door that were canvassing for Trump’s campaign. At the time, I wasn’t following politics very closely and didn’t think Trump had a chance of winning, but I didn’t like their vibe so I just tried to get them to leave.\n\n\nThey wouldn’t leave and when I went to close my door, they blocked it. I told them I wasn’t voting at all to get them off my doorstep, and they started berating me, threatening me, and came inches from violence. If I was feeling aggressive that night, it almost certainly would have escalated to a full-on 2v1 fight. \n\nFinally, I got verbally aggressive and neighbors started taking notice. (Very small courtyard and even small sounds reverberated.) They wished me a brutal death and proceeded to go knock on the next door over like nothing happened.\n\n\nLooking back, I should have reported it, but the idea that they knew where I lived and were clearly willing to use intimidation and potentially violence to strong arm people, I decided to try to let it go.",
            "title_similarity": "0.64936054"
        },
        {
            "id": "i1jsfb1",
            "score": 1,
            "text": "Oh wow republicans pulling KKK tactics, spreading voter fraud, intimidating their supposed fellow americans.\n\nThe right continues to never fail to actually do something horrendous.\n\nIs now the time to start refering to \"the right\" as *Domestic Terrorist Right*? Because if we don't straight up call them that now, people aren't going to give a shit.",
            "title_similarity": "0.69099224"
        },
        {
            "id": "i1jsgq2",
            "score": 2,
            "text": "This is why liberals and minorities should own guns. Everyone go check out r/liberalgunowners",
            "title_similarity": "0.5120709"
        },
        {
            "id": "i1jsilt",
            "score": 1,
            "text": "Stand your ground in Colorado?",
            "title_similarity": "0.41070879"
        },
        {
            "id": "i1jsl72",
            "score": 1,
            "text": "Anyone doing anything",
            "title_similarity": "-0.06871618"
        },
        {
            "id": "i1jsmks",
            "score": 3,
            "text": "A Putin style type thing… sending armed ppl to citizens homes to see how they are leaning to vote… intimidation-absolutely! Put yourself in their shoes, armed men asking how you are going to vote. WTF, what country are we living in 😱",
            "title_similarity": "0.7564577"
        },
        {
            "id": "i1jsny1",
            "score": 1,
            "text": "Sohmbitch, my county is included and I didn't get the opportunity to laugh in their faces",
            "title_similarity": "0.3592541"
        },
        {
            "id": "i1jso6l",
            "score": 3,
            "text": "How bone headed to you need to be just to remotely consider doing this\n\n(Edited poor phrasing)",
            "title_similarity": "0.32589352"
        },
        {
            "id": "i1jsp1x",
            "score": 5,
            "text": "Start arresting people then sheesh.",
            "title_similarity": "0.43945295"
        },
        {
            "id": "i1jsra2",
            "score": 2,
            "text": "Sounds like a good test of stand your ground. Come to my property doing sketchy shit like this and then photographing where I live without my consent? Oof",
            "title_similarity": "0.5394894"
        },
        {
            "id": "i1jsvq3",
            "score": 2,
            "text": "Come to my house packing a pistol and not having a badge, in my neighborhood will get you hurt or worse. Also be realistic, they’re doing it in neighborhoods which are sympathetic to their cause. America the republic has failed. You all realize? Right?",
            "title_similarity": "0.65730155"
        },
        {
            "id": "i1jsxt7",
            "score": 2,
            "text": "Impersonating a federal officer is a felony, is it not?",
            "title_similarity": "0.60215056"
        },
        {
            "id": "i1jt08f",
            "score": 1,
            "text": "Que se la pellen los de la Kkk y los de trompas, A la verga con el racismo, no degen que Estos menso les diegan nada.",
            "title_similarity": "0.50596476"
        },
        {
            "id": "i1jt7mi",
            "score": 8,
            "text": "To all my fellow Colorado Citizens. \n\nDo not invite them into your home don’t bait them into a confrontation however know your rights. If they cross your threshold it’s in like doubly king. Feel free to use what ever means you must to sort out this problem. If you do allow them to draw breath know your rights to make a citizens arrest while you wait for the police and or ambulance to haul them off. \n\nHere are some links to help you protect yourself. \n\nRemember to record video if possible and call 911 immediately even if they leave your house call the police and report what happened. Call the local representatives and other election officials too. \n\nhttps://www.hmichaelsteinberg.com/understanding-colorados-citizens-arrest-law-16-3-201.html\n\nhttps://www.shouselaw.com/co/defense/legal-defenses/self-defense/\n\nhttps://coag.gov/votingadvisory/",
            "title_similarity": "0.6460416"
        },
        {
            "id": "i1jt8hk",
            "score": 1,
            "text": "That is so messed up!! Horrible behavior.",
            "title_similarity": "0.26279286"
        },
        {
            "id": "i1jtd3i",
            "score": 1,
            "text": "Just ask them if they’re Putin supporters too.  And fuck off, I don’t tell you how you should vote.",
            "title_similarity": "0.531887"
        },
        {
            "id": "i1jtdw0",
            "score": 1,
            "text": "A good dose of bear spray to the face should solve that problem.",
            "title_similarity": "0.4033343"
        },
        {
            "id": "i1jtn9e",
            "score": 1,
            "text": "Don’t know what’s worse.\n\nThat these people exist or the authorities won’t seem to do much about it or the news ignores it.",
            "title_similarity": "0.42226306"
        },
        {
            "id": "i1jttx6",
            "score": 1,
            "text": "Oh the KKK back at it again? I’m sure these are the good people on their side just getting the word out to vote. /s",
            "title_similarity": "0.3490554"
        },
        {
            "id": "i1jtz87",
            "score": 1,
            "text": "It’s just sad that stuff like this set in some people’s mind that all conservatives are this way…",
            "title_similarity": "0.475761"
        },
        {
            "id": "i1juaas",
            "score": 2,
            "text": "Let them come to my door they won't like what they get!",
            "title_similarity": "0.44634044"
        },
        {
            "id": "i1jufsc",
            "score": 1,
            "text": "Lol, step into my parlor said the spider to the fly.",
            "title_similarity": "0.29911143"
        },
        {
            "id": "i1julen",
            "score": 1,
            "text": "Just put no soliciting sign up",
            "title_similarity": "0.12666997"
        },
        {
            "id": "i1juqj5",
            "score": 2,
            "text": "Please come to my house and give me a reason to shoot you",
            "title_similarity": "0.4872237"
        },
        {
            "id": "i1juswm",
            "score": 5,
            "text": "They will murder Arbery for walking in “their” neighborhood, but demand the right to walk freely in others’ neighborhood. They should not feel safe. They are armed because they know they’re not welcome and the justice system incredible leeway",
            "title_similarity": "0.6563767"
        },
        {
            "id": "i1jvcia",
            "score": 8,
            "text": "The same crybabies who constantly moan about the governmet going door to door “ taking all therrr guns” do crap like this😒 \nDeserve to get shot right in the face!",
            "title_similarity": "0.6452986"
        },
        {
            "id": "i1jvd4p",
            "score": 5,
            "text": "Nothing would make me vote against your cause faster than bothering me at my home. \n\nWich makes me think it was actualy antifa wich makes me think the whole two party system is stupid and we should vote in people outside the party system like John Stewart.",
            "title_similarity": "0.6359567"
        },
        {
            "id": "i1jvkxk",
            "score": 11,
            "text": "Let’s imagine for a second the roles were reversed. The Black Panthers are sending armed members to knock on doors of white people, ask them how they voted, and to take pictures of their homes. Now, try and imagine what Tucker Carlson and every other right winger would be saying about it.",
            "title_similarity": "0.7043396"
        },
        {
            "id": "i1jvpvi",
            "score": 3,
            "text": "Come to my door with that shit. Please.",
            "title_similarity": "0.25522056"
        },
        {
            "id": "i1jvq3m",
            "score": 4,
            "text": "Pussy idiot losers gotta flex their empty brains to try and win votes.  Surprised they weren’t caught licking the window and drooling before someone answered.",
            "title_similarity": "0.4790498"
        },
        {
            "id": "i1jvqn9",
            "score": 2,
            "text": "Fuck the “my pillow” freak",
            "title_similarity": "0.34636036"
        },
        {
            "id": "i1jvs7n",
            "score": 2,
            "text": "Come to my front door and try this shit, and you’ll get a gun in your face from someone who hates all political sides. Fucking morons.",
            "title_similarity": "0.74002004"
        },
        {
            "id": "i1jvv06",
            "score": 1,
            "text": "What needs to happen in the U.S. for reasonable, educated Americans to stop being understanding and nice to the fascist sympathisers in their country? Asking for a friend.",
            "title_similarity": "0.5740349"
        },
        {
            "id": "i1jvzb4",
            "score": 1,
            "text": "So here's my question, if a dude with a gun and a mouthful of dip knocks on your door and says you better vote for Trump, the leaves, what's stopping you from going \"you got it boss\" then voting however you want?",
            "title_similarity": "0.60797304"
        },
        {
            "id": "i1jw30y",
            "score": 6,
            "text": "The GQP assholes acting the gazpacho 😂",
            "title_similarity": "0.43737096"
        },
        {
            "id": "i1jw5rr",
            "score": 2,
            "text": "Republicans being Republicans. I'm from a red state, so I'm not nearly as shocked and horrified by all this as most of the comment section.",
            "title_similarity": "0.37293214"
        },
        {
            "id": "i1jwbc1",
            "score": 4,
            "text": "Republicans want Russia 2.0 so desperately. Of course with the Orange Traitor pedophile as their own version of Putin.  \n\n“The lawsuit alleges that the U.S. Election Integrity Plan — led by Shawn Smith, an ally of former Trump strategist Steve Bannon and MyPillow founder Mike Lindell — is sending armed members door-to-door in areas with large numbers of voters of color, questioning people about how they voted and taking photographs of their homes.”",
            "title_similarity": "0.8082159"
        },
        {
            "id": "i1jwh0q",
            "score": 2,
            "text": "Fascism is here folks, this is how hitler/Putin got their feet in the door.",
            "title_similarity": "0.44043994"
        },
        {
            "id": "i1jwpk2",
            "score": 2,
            "text": "Wow just wow",
            "title_similarity": "-0.15960273"
        },
        {
            "id": "i1jwprg",
            "score": 2,
            "text": "Fucking idiots, I would answer the door with my AR-15 who the fuck do they think they are, wouldn’t happen in NY",
            "title_similarity": "0.60094213"
        },
        {
            "id": "i1jwr4d",
            "score": 2,
            "text": "Super messed up,",
            "title_similarity": "0.15358187"
        },
        {
            "id": "i1jwsx5",
            "score": 2,
            "text": "nothing strikes fear into the heart of men like a pillow salesman",
            "title_similarity": "0.31029895"
        },
        {
            "id": "i1jwynv",
            "score": 3,
            "text": "Politic intimidation through violence (implied, for now). The seeds of fascism are sprouting on your country... Look up [Squadrismo](https://en.wikipedia.org/wiki/Squadrismo)",
            "title_similarity": "0.63322526"
        },
        {
            "id": "i1jxbf6",
            "score": 3,
            "text": "I find it ironic how the Klu Klux Klan Act was passed by none other than Ulysses S. Grant, a Republican who used it to prosecute the KKK (as the name of the Act implies), and now, a little over 150 years later, it may end up being used to prosecute Republicans.",
            "title_similarity": "0.6515386"
        },
        {
            "id": "i1jxdpx",
            "score": 3,
            "text": "I'd love to greet some MAGA fascists at the door. With my Mossberg.",
            "title_similarity": "0.37033957"
        },
        {
            "id": "i1jxtvf",
            "score": 3,
            "text": "Shoot them off your porch. If someone comes threatening you with guns you don't just ignore it... They certainly wouldn't.",
            "title_similarity": "0.53210413"
        },
        {
            "id": "i1jxuww",
            "score": 3,
            "text": "Every one of these cousin fuckers should be behind bars.",
            "title_similarity": "0.5110386"
        },
        {
            "id": "i1jxw5m",
            "score": 3,
            "text": "which like...it's a vote by mail state, what exactly is their plan? they going to come back in november and watch every house in hopes of catching them dropping off their mail?",
            "title_similarity": "0.5667907"
        },
        {
            "id": "i1jy41s",
            "score": 3,
            "text": "Everyone knows GOP stands for.  GOLF.  OIL.  PROSTITUTES",
            "title_similarity": "0.3012779"
        },
        {
            "id": "i1jyf41",
            "score": 2,
            "text": "Dafuq!? Makes sense that this happened everywhere but Denver and Boulder areas.",
            "title_similarity": "0.39966378"
        },
        {
            "id": "i1jz058",
            "score": 3,
            "text": "Not surprisingly, some of these were in counties where the County Clerks are under investigation for copying voting machine hardware. Both the door to door groups and the Clerks were part of Lindell's stupid 'stop the steal' conspiracy plot.  \nTina Peter has been indicted and released on bond, after presenting her 'findings' at Lindell's idiotic conference a few months ago. Now she's under investigation for a second complaint about a 'criminal defense fund' she set up. The whole thing is sure to be popcorn watching as it moves forward, as Mr. Q himself (Ron Watkins) seems to be directly involved; as is Lindell himself, who seems to have taken a passionate interest in Peters. He hid her out in his Texas bunker for a while, and has been making inflamed statements about her 'persecution'.  \nLindell and Peters are both single, BTW. Make of that what you will.  \nThe FBI investigation is ongoing; look forward to that!  \nColorado isn't fond of this nonsense, and a bill has been introduced to stop voting machine tampering by elected officials in the future. Hopefully the suit against these door-knockers deters idiots as well. We're a state with deep red and deep blue counties; thus we have a popular gay Democratic Governor (56% approval, and he has a Reddit account!), as well as the infamous Lauren Boebert... who of course, comes from a county with some of the door-knockers.",
            "title_similarity": "0.737018"
        },
        {
            "id": "i1jza05",
            "score": 4,
            "text": "I remember when the only thing I knew about Mike Lindell was he used to drugs hardcore before turning his life around to make pillows or something\n\nI was only kind of paying attention",
            "title_similarity": "0.48951948"
        },
        {
            "id": "i1jzdva",
            "score": 2,
            "text": "Mike Lindell should start sheets to his buddies.",
            "title_similarity": "0.32956284"
        },
        {
            "id": "i1jzfwz",
            "score": 1,
            "text": "Time to form our own voting police force. Wait… that was the voting police? Umm. \n/s",
            "title_similarity": "0.4160869"
        },
        {
            "id": "i1jzqrk",
            "score": 1,
            "text": "but if a Democrat did this...",
            "title_similarity": "0.20251732"
        },
        {
            "id": "i1jzrsx",
            "score": 6,
            "text": "You mean the state that elected Boebert to office, who goes to congress armed, who got her GED months before being elected, who ran (into the ground) a restaurant where the servers were encourage to carry pistols, had an armed group of intimidators go door to door in minority neighborhoods ask about how they voted in a state that went 13.5% (not even close to contested) more to Biden. \n\nWeird…",
            "title_similarity": "0.64741766"
        },
        {
            "id": "i1jzsw3",
            "score": 1,
            "text": "Come to my door with a gun and find out.",
            "title_similarity": "0.44636565"
        },
        {
            "id": "i1jzujr",
            "score": 2,
            "text": ">The lawsuit alleges that the U.S. Election Integrity Plan — led by Shawn Smith, an ally of former Trump strategist Steve Bannon and MyPillow founder Mike Lindell — is sending armed members door-to-door in areas with large numbers of voters of color, questioning people about how they voted and taking photographs of their homes.\n\nArmed racists gone wild.",
            "title_similarity": "0.8496098"
        },
        {
            "id": "i1jzxly",
            "score": 1,
            "text": "Wait, there’s Ku Klux Klan Act?",
            "title_similarity": "0.45497197"
        },
        {
            "id": "i1jzxuf",
            "score": 1,
            "text": "Yeah this is called terrorism and they need to be put in prison at the very least.  Any of them current/former military deserve worse than that.",
            "title_similarity": "0.58275414"
        },
        {
            "id": "i1k05wu",
            "score": 2,
            "text": "You've got to be a special category of idiot to show up visibly armed at somebody's doorstep without a badge.",
            "title_similarity": "0.5219936"
        },
        {
            "id": "i1k0a7y",
            "score": 1,
            "text": "You have to take his “The election was rigged, and I know who did it” at face value.",
            "title_similarity": "0.5435246"
        },
        {
            "id": "i1k0gea",
            "score": 1,
            "text": "If armed men show up to my door, I'm calling the police.",
            "title_similarity": "0.59609306"
        },
        {
            "id": "i1k0hvj",
            "score": 2,
            "text": "Try this dumb shit at my house :)",
            "title_similarity": "0.3873126"
        },
        {
            "id": "i1k0puc",
            "score": 2,
            "text": "Y’all talk politics I just want to know who carries a 1911 in a Serpa holster hammer down",
            "title_similarity": "0.6067519"
        },
        {
            "id": "i1k0tls",
            "score": 1,
            "text": "I would have thrown shit at them",
            "title_similarity": "0.35497758"
        },
        {
            "id": "i1k0ugv",
            "score": 1,
            "text": "[08/17/21 Colorado Election Conspiracy Group Going Door-to-Door in Search of ‘Phantom Ballots’](https://coloradotimesrecorder.com/2021/08/colorado-election-conspiracy-group-going-door-to-door-in-search-of-phantom-ballots/38866/)",
            "title_similarity": "0.70446366"
        },
        {
            "id": "i1k0vc0",
            "score": 1,
            "text": "In June of 2018, I was collecting signatures for clean energy Propositions, in front of businesses. One manager said that’s not okay here, I understood and went across the parking lot. \nTwo well dressed men told me that I couldn’t collect signatures but I didn’t say anything to them or ask first. They just saw my clipboard and badge. They didn’t say why and just tried to intimidate me. The men just held shopping carts and were trying to dress like managers who work there. \nWe were warned when getting hired, that there were also people out there, offering us $1000 to quit collecting signatures for clean energy. Those men didn’t offer anything and I know they didn’t work there. I of course called my boss and warned them. \nCrazy world for democracy.",
            "title_similarity": "0.5396795"
        },
        {
            "id": "i1k164r",
            "score": 1,
            "text": "Stick to pillows, Mike.",
            "title_similarity": "0.03453453"
        },
        {
            "id": "i1k1fo4",
            "score": 1,
            "text": "I gotta say... Of the laws one could break, that particular law certainly isn't one I'd choose. The mere name of it would sway a jury.",
            "title_similarity": "0.5100178"
        },
        {
            "id": "i1k1o8k",
            "score": 1,
            "text": "'Merica land of the free and the brave... what a shithole.",
            "title_similarity": "0.26614022"
        },
        {
            "id": "i1k23lx",
            "score": 1,
            "text": "Fascist assholes are fascist. Not surprising. I fucking dare them to walk up to my house. Pro-gun Texas leftist here, I'll show them a thing or two about walking up with guns onto my property. Fucking shills.",
            "title_similarity": "0.70183885"
        },
        {
            "id": "i1k24jb",
            "score": 1,
            "text": "I do believe it's jail time for those folks! :)",
            "title_similarity": "0.34785002"
        },
        {
            "id": "i1k2dhf",
            "score": 2,
            "text": "[removed]",
            "title_similarity": "0.025070708"
        },
        {
            "id": "i1k2xe3",
            "score": 1,
            "text": "Ok, now let’s put everyone involved in fucking prison. Up to and including those who continue to publicize lies about election fraud.",
            "title_similarity": "0.6666551"
        },
        {
            "id": "i1k3ems",
            "score": 3,
            "text": "American brownshirts",
            "title_similarity": "0.11845042"
        },
        {
            "id": "i1k3gpm",
            "score": 1,
            "text": "I wish they’d come to my door.  Fucking fascists!",
            "title_similarity": "0.49485987"
        },
        {
            "id": "i1k3xwb",
            "score": 3,
            "text": "I am just so sick of Trump and his minions. Sick and tired of it all!",
            "title_similarity": "0.47170192"
        },
        {
            "id": "i1k3ysr",
            "score": 3,
            "text": "Holy shit...taking pictures of their houses???that's creepy as fuck.",
            "title_similarity": "0.47059625"
        },
        {
            "id": "i1k3zun",
            "score": 1,
            "text": "If they tried this shit where I live in CO they wouldn't make it very far.",
            "title_similarity": "0.26588795"
        },
        {
            "id": "i1k4b5k",
            "score": 1,
            "text": "Normally I would breeze right past this or make a couple of shit posts (which would add absolutely nothing to what's already posted) and move on. But I live in Colorado and am embarrassed to say that this is the first I have heard of this. I can't guess how much more of this will go on after the mid-terms November 8. This is serious shit! So, to try to salvage something good from this sub I'll ask: \n\n**?Does anyone else here have any** ***first hand*** **information to share like KeepCuriousCo above?**",
            "title_similarity": "0.5940368"
        },
        {
            "id": "i1k4k1v",
            "score": 1,
            "text": "/r/liberalgunowners",
            "title_similarity": "0.13255124"
        },
        {
            "id": "i1k4qf1",
            "score": 1,
            "text": "Did our entire country fall through a time warp?\n\nThis is literally why we have Civil and Voting Rights Act. Do they know they’re the baddies?",
            "title_similarity": "0.64376855"
        },
        {
            "id": "i1k5ghc",
            "score": 2,
            "text": "Hey No-Merits Garland, and DOJ WE'RE WAITING!!!",
            "title_similarity": "0.18453512"
        },
        {
            "id": "i1k5r44",
            "score": 1,
            "text": "Republicans and they are not all morons most of them are just doing it because they're losing at the polls nobody wants them they're a bunch of liars they raise taxes they took money from the government that shouldn't have went in their pockets and they allowed January 6th can you believe that these guys need to all be voted out of office if you don't believe me tell me why.,....",
            "title_similarity": "0.63579285"
        },
        {
            "id": "i1k5x6v",
            "score": 1,
            "text": "Know what's going to end up happening we're going to end up getting rid of all the Republicans they're all going to be liberal lol",
            "title_similarity": "0.5128545"
        },
        {
            "id": "i1k6dqa",
            "score": 1,
            "text": "Be a damn shame if someone suffocated in his own pillow",
            "title_similarity": "0.36964926"
        },
        {
            "id": "i1k6hng",
            "score": 1,
            "text": "How the fuck do these people not think they’re totalitarians?",
            "title_similarity": "0.4505923"
        },
        {
            "id": "i1k6kbs",
            "score": 1,
            "text": "In Colorado?",
            "title_similarity": "0.3237201"
        },
        {
            "id": "i1k6nrl",
            "score": 2,
            "text": "Don’t open the door just let them knock and call the police to report their an arm person at the door. Save ring video as proof of incident",
            "title_similarity": "0.52760696"
        },
        {
            "id": "i1k6urt",
            "score": 3,
            "text": "I'd just call the cops and tell them a stranger is brandishing a gun on my property. Take lots of pics especially of license plates. Then wait for the cops to show up. Let them know that they also had what appear to be badges of some sort. \n\nThat is a lot of laws they are breaking at that point. Let the justice system work for you at this point.",
            "title_similarity": "0.7252365"
        },
        {
            "id": "i1k77le",
            "score": 2,
            "text": "And let me guess, nothing will be done about it either. No one from the GOP has been for all their sick and twisted shit they’ve been pulling.\n\nI am so fucking sick of all these right wing kkk fuckers. Wish we had a deserted island to drop them off on.",
            "title_similarity": "0.47311163"
        },
        {
            "id": "i1k78dg",
            "score": 2,
            "text": "Have them arrested and thrown in jail, no one is above the law I don't care how much money you have nobody is above the law.",
            "title_similarity": "0.5084925"
        },
        {
            "id": "i1k7kao",
            "score": 2,
            "text": "If a group of armed men approaches your home, is it legal to defend yourself? That would certainly feel like an incoming threat of violence to me.",
            "title_similarity": "0.6649729"
        },
        {
            "id": "i1k7qsv",
            "score": 1,
            "text": "These people think Putin and Trump are going to save the world.",
            "title_similarity": "0.3837015"
        },
        {
            "id": "i1k7wkt",
            "score": 2,
            "text": "I would laugh so hard if these LARPer pussies came to my door",
            "title_similarity": "0.3669828"
        },
        {
            "id": "i1k8076",
            "score": 1,
            "text": "Layers of illegal activity if prosecuted.",
            "title_similarity": "0.3819552"
        },
        {
            "id": "i1k8623",
            "score": 2,
            "text": "Strong SA vibes",
            "title_similarity": "-0.026187073"
        },
        {
            "id": "i1k87fn",
            "score": 1,
            "text": "Like I would answer the door in a bunch of overweight heavy breathers came knocking 😂",
            "title_similarity": "0.33339876"
        },
        {
            "id": "i1k89sh",
            "score": 2,
            "text": "[removed]",
            "title_similarity": "0.025070708"
        },
        {
            "id": "i1k8c79",
            "score": 1,
            "text": "This terrifying reality is why r/liberalgunowners exists.",
            "title_similarity": "0.46155083"
        },
        {
            "id": "i1k8rku",
            "score": 2,
            "text": "These people are the actual gestapo. It's unbelievable the level of projection that republicans engage in.",
            "title_similarity": "0.5598823"
        },
        {
            "id": "i1k9uoe",
            "score": 4,
            "text": "After Jan 6, is anyone actually surprised? If you're scared or angry about this, I get it I'm with you. But surprised?",
            "title_similarity": "0.39610857"
        },
        {
            "id": "i1k9vmt",
            "score": 1,
            "text": "Try this in Florida.",
            "title_similarity": "0.020121697"
        },
        {
            "id": "i1kaak0",
            "score": 3,
            "text": "“Shawn Smith, the head of USEIP last month led a \"lock her up\" chant while discussing Griswold at a rally and said that \"if you're involved in election fraud, you deserve to hang.\"”\n\nSo trump is going to be hung for interfering in georgias election?  It’s crazy how far and away their reality is.  At some point their reality has to crumble in the face of actuality",
            "title_similarity": "0.75784093"
        },
        {
            "id": "i1kai3z",
            "score": 1,
            "text": "Typical hypoocrisy",
            "title_similarity": "0.053566445"
        },
        {
            "id": "i1kaop9",
            "score": 4,
            "text": "This is not about politics, or gun rights, it's about the erosion our civil society has suffered recently and how much more it can take before it collapses and armed mobs are out knocking on everyone's doors. This **posse comitatus** shit has got to stop DAMN IT! Are we gonna wait until some one is killed (on either side)? I think if some one sticks a search light on their car and goes around pulling people over they get in a shit load of trouble for impersonating a cop, right? Can any LEOs here explain how what these guys are doing is OK, or is it? If it's not OK what is the punishment?",
            "title_similarity": "0.7022276"
        },
        {
            "id": "i1kb2bp",
            "score": 1,
            "text": "This clown is not even carrying it cocked and locked.",
            "title_similarity": "0.19675869"
        },
        {
            "id": "i1kb4kk",
            "score": 2,
            "text": "That is the “alt-right” foot solder demographic that can’t be bother to figure out out robo-calling and robo-texting strategies that most other “far-right” populist political campaigns have been doing for years.\n\nImagine this sort of thing going on in nazi Germany or the lead up to it. Probably not too far off.",
            "title_similarity": "0.5054798"
        },
        {
            "id": "i1kb4og",
            "score": 2,
            "text": "Welp as a gun owner if I ever get a knock on my door by these fools I’m answering with my .40 🤷🏻‍♀️",
            "title_similarity": "0.5785566"
        },
        {
            "id": "i1kbe2l",
            "score": 1,
            "text": "Wait…. We’re supposed to be indirect?",
            "title_similarity": "0.12931329"
        },
        {
            "id": "i1kbh9e",
            "score": 1,
            "text": "Please show up armed at my door, please!",
            "title_similarity": "0.2963729"
        },
        {
            "id": "i1kbvdq",
            "score": 1,
            "text": "How can it be legal to enter someone's private property with a gun without permission or consent from the owner",
            "title_similarity": "0.5097353"
        },
        {
            "id": "i1kbz65",
            "score": 1,
            "text": "I can't help but think that the next election cycle,  maybe it will be the next presidential cycle, something is going to give! \n\nCurrently the path our country is on is unsustainable, and we've seen the bumps and bruises turn to cracks in our society as a whole, we've seen those cracks turn to fissures, yet we carry on. We've not stopped the Democrats drifting to the right (particularly on their economic and fiscal policies), as the GOP have just become hard right extremist... while both sides bend over backwards not to upset their large corporate and ultra wealthy donors.  The \"news\" media keeps us angry at the newest outrage from the other side, while ignoring the depth of corruption caused by the [\"aristocracy of our monied corporations\"](https://founders.archives.gov/documents/Jefferson/03-10-02-0390).\n\nFrankly,  until the aspects of legalized bribery through campaign donations and our unequal justice system (also corrupted by money in politics) is resolved, we will keep spiraling downward. \n\nI don't know how,  or if it even will happen, but we need to fix the issue of money in our political/ legal system if we are going to reverse course on any of the multiple problems that could lead to the demise of America as we know it. I just don't see that happening.\n\nWe will continue the inane and asinine cycle of putting aristocrats in office, as most of the time it's a choice between wealthy far right extremist supporting Republican canidate, or fiscally conservative, socially \"left\" leaning Democrat canidate, both funded by (and representing)  wealthy donors and the owners of large corporations.\n\nThe problem is there isn't a \"we the people\" to our representives anymore, we the people don't have the money to run their campaigns, so we the people get no representation because we the people are not paying for these \"representives\" to represent us, the corporations and ultra wealthy are, so government serves them, not us. It's that simple if you ask me.",
            "title_similarity": "0.65653324"
        },
        {
            "id": "i1kc3gu",
            "score": 1,
            "text": "They are failures in every aspect of live that has real value so they turn to violence. This is all they can comprehend or appreciate",
            "title_similarity": "0.4944181"
        },
        {
            "id": "i1kc4gg",
            "score": 3,
            "text": "Wow, I did Nazi this coming",
            "title_similarity": "0.2546317"
        },
        {
            "id": "i1kca2b",
            "score": 1,
            "text": "I'd call the police immediately in Phoenix.",
            "title_similarity": "0.45196444"
        },
        {
            "id": "i1kcd4t",
            "score": 1,
            "text": "Fucking assholes. There’s no need to bring firearms to a house while canvassing. Pure fucking intimidation.",
            "title_similarity": "0.4888193"
        },
        {
            "id": "i1kcsnk",
            "score": 1,
            "text": "Can I meet them at my door with my gun? That's what's going to happen when they show up at my house. \" I feared for my life when they had guns so I killed them all\".\nThat's the law now, fucking idiots.",
            "title_similarity": "0.6708113"
        },
        {
            "id": "i1kcu2r",
            "score": 2,
            "text": "Met a fellow on Reddit last week from Colorado who slowly revealed himself to be pro-Trump. \nI tried to look past it but it’s such a slippery slope…dodged a bullet I guess 😕",
            "title_similarity": "0.65109324"
        },
        {
            "id": "i1kcw3t",
            "score": 3,
            "text": "Only in America could a crackhead who made a fortune selling pillows finance voter intimidation. \n\nIf any of these fascist goons show up on your doorstep, please upload video/photos so they can be identified.",
            "title_similarity": "0.67394376"
        },
        {
            "id": "i1kcw3u",
            "score": 1,
            "text": "Lock em up. Fuck.",
            "title_similarity": "0.28820288"
        },
        {
            "id": "i1kcz7d",
            "score": 2,
            "text": "\"urged residents to report harassment and threats to local law enforcement\" LOL half of them probably ARE local law enforcement",
            "title_similarity": "0.4883606"
        },
        {
            "id": "i1kd23m",
            "score": 1,
            "text": "Oh I wish these idiots would knock on my door, please try to threaten me haha",
            "title_similarity": "0.5209217"
        },
        {
            "id": "i1kdh2q",
            "score": 4,
            "text": "The same folks declared Covid a hoax despite a million + deaths but maintain there was rampant voter fraud despite zero evidence; 60 failed lawsuits and states-wide recounts.",
            "title_similarity": "0.63198924"
        },
        {
            "id": "i1kdl6e",
            "score": 1,
            "text": "Theil",
            "title_similarity": "-0.09821566"
        },
        {
            "id": "i1kdp43",
            "score": 2,
            "text": "**Wondering why these morons carry their guns on their guns on their hips?** I mean besides trying to look bad ass which still doesn't help when you can tell all the guy does is lay on his couch eating Cheetos cuz his fingers are permanently orange (just look at the paunches on the guys in the article picture)?\n\nA lot of these fools open carry because they haven't even had the rudimentary training required for a CCL (to purchase a hunting license a Hunter's safety course is required so at least we're not complete savages I guess). Unfortunately, open carry is permitted unless specifically prohibited by the location, there is also no waiting period to purchase a handgun in Colorado. Basically, an adult can walk into a sporting goods store, pass an instant background check, buy a pistol and walk out with it strapped to their hip with absolutely no experience or training required. I see more and more of the imbeciles at the range every time I go, with their Glock 17s acting like fools, muzzle sweeping everyone, and completely ignoring range rules and simple firearm etiquette. I don't feel comfortable anywhere around them and have packed my gear and left the range more than a few times. Lean to handle your fucking shit or leave it at home. I could give less than two shits if you shoot yourself or your buddies but I'm not sticking around. HEY SHIT-HEADS! - Just because you have the money to buy a gun that makes you look like law enforcement doesn't mean you are.",
            "title_similarity": "0.55417776"
        },
        {
            "id": "i1kdu6n",
            "score": 3,
            "text": "It amazes me that these guys were not formally arrested and charged by the state of Colorado, having to be sued by private civil rights organizations instead.\n\nSeems to me, there's a very troubling lack of law enforcement in both the LEO side and the attorneys general.  I think the governor needs to take a good long look at his AGs and ask some hard questions about their commitment to enforcing civil rights legislation.",
            "title_similarity": "0.65431714"
        },
        {
            "id": "i1ke2ch",
            "score": 3,
            "text": "If they’re so damn sure the election was stolen then why do they feel the need to carry guns with them? Are we supposed to be impressed? Big men with their guns? They suck.",
            "title_similarity": "0.67511487"
        },
        {
            "id": "i1kelwu",
            "score": 2,
            "text": "It’s frustrating. The GOP must always exist. It can’t be destroyed or nullified. It can’t even be broken up and stripped of power. It’s probably the most dangerous political entity on the planet and no matter what they do, or who they do it to, they are absolutely and completely guaranteed to get away with it.",
            "title_similarity": "0.52699924"
        },
        {
            "id": "i1ker5t",
            "score": 3,
            "text": "Oh look, once again doing what they've been accusing Democrats of doing.",
            "title_similarity": "0.54797477"
        },
        {
            "id": "i1kfio3",
            "score": 1,
            "text": "Minnesotan here, anybody else want this lunatic?",
            "title_similarity": "0.46235955"
        },
        {
            "id": "i1kfmmf",
            "score": 3,
            "text": "Jack boots and brown shirts in each and every GOPer's closet, soon to be released openly, the Trumpistan Gestapo must be stopped at any cost.",
            "title_similarity": "0.51052445"
        },
        {
            "id": "i1kfrhh",
            "score": 3,
            "text": "Mike Lindell, a piece of shit?      No, you must be kidding",
            "title_similarity": "0.33592728"
        },
        {
            "id": "i1kg0gs",
            "score": 2,
            "text": "Moving to CO from TX in a few months. Idk if I should be relieved for the familiarty or disappointed.",
            "title_similarity": "0.31370863"
        },
        {
            "id": "i1kg700",
            "score": 2,
            "text": "Imagine if this was happening in Russia",
            "title_similarity": "0.2446399"
        },
        {
            "id": "i1kgxke",
            "score": 2,
            "text": "/r/liberalgunowners",
            "title_similarity": "0.13255124"
        },
        {
            "id": "i1kh8ne",
            "score": 3,
            "text": "When you violate an act that's literally named after the Klu Klux Klan, you gotta be one gigantic racist pile of shit.",
            "title_similarity": "0.6820418"
        },
        {
            "id": "i1khmjm",
            "score": 3,
            "text": "They also intimidated people at the voting sites. They have no shame, and they don't care about democracy.",
            "title_similarity": "0.56488293"
        },
        {
            "id": "i1khvaq",
            "score": 2,
            "text": "This means they're keeping track of voting records and addresses. They might even have genocide plans \n\nI hope everyone they target stays safe",
            "title_similarity": "0.46051317"
        },
        {
            "id": "i1khxsp",
            "score": 5,
            "text": "This is some Venezuela style shit.",
            "title_similarity": "0.24107653"
        },
        {
            "id": "i1kj6br",
            "score": 1,
            "text": "Well fuck, that's mildly terrifying\n\nI haven't heard of anything like this where I live and I hope it stays that way. But what are you supposed to do if these goons show up at your door? Having a gun to scare them off is nice and all, but I don't feel comfortable using for personal reasons.  How do you stay safe if they won't leave and try to escalate?",
            "title_similarity": "0.5683719"
        },
        {
            "id": "i1kj8fd",
            "score": 3,
            "text": "I feel like I would just be more motivated to vote if someone pulled this shit in my neighborhood.",
            "title_similarity": "0.44576138"
        },
        {
            "id": "i1kkg2k",
            "score": 1,
            "text": "I live in Tony Exum’s district in El Paso County. It’s a pretty diverse area, but no one with guns has visited me or my friends. \n\nAm I surprised it’s happening? Absolutely not. But I *am* surprised no one like this has knocked on our door. We’re really active with the local Democratic Party. \n\nFuck these clowns. I may sign up to be an election judge this year, just to spite them!",
            "title_similarity": "0.5926905"
        },
        {
            "id": "i1kkgv0",
            "score": 2,
            "text": "Sounds like something Putin would do.",
            "title_similarity": "0.14115298"
        },
        {
            "id": "i1kkhlm",
            "score": 1,
            "text": "How are these guys not getting shot?",
            "title_similarity": "0.22921133"
        },
        {
            "id": "i1kki2c",
            "score": 1,
            "text": "Ha..come knocking on my door....please..",
            "title_similarity": "0.20656474"
        },
        {
            "id": "i1kkkcr",
            "score": 2,
            "text": "Don’t be intimidated by no one ever !!!",
            "title_similarity": "0.10913676"
        },
        {
            "id": "i1kkolv",
            "score": 2,
            "text": "Looks more like the kkk",
            "title_similarity": "0.19223717"
        },
        {
            "id": "i1kkyo9",
            "score": 3,
            "text": "This is the shape of things to come. Expect it to only get worse in the future.",
            "title_similarity": "0.22675581"
        },
        {
            "id": "i1klm5q",
            "score": 1,
            "text": "So basically brown shirts",
            "title_similarity": "-0.083163664"
        },
        {
            "id": "i1km9na",
            "score": 1,
            "text": "- 1911 with hammer down / chamber empty\n- Serpa shoot-yourself-in-the-leg retention holster\n- Phone tactically clipped to belt\n\nYeah seems about right for these kind of wannabes",
            "title_similarity": "0.4126094"
        },
        {
            "id": "i1kmedd",
            "score": 1,
            "text": "Based",
            "title_similarity": "-0.1280264"
        },
        {
            "id": "i1knas0",
            "score": 1,
            "text": "El Paso County. Sounds about right",
            "title_similarity": "0.060039785"
        },
        {
            "id": "i1ko1hd",
            "score": 2,
            "text": "How can anyone vote Republican?",
            "title_similarity": "0.39575684"
        },
        {
            "id": "i1ko8li",
            "score": 1,
            "text": "What the actual fuck!!",
            "title_similarity": "0.15434289"
        },
        {
            "id": "i1kojcd",
            "score": 2,
            "text": "If these fucks came to my house I'd be rolling video on them, their fake badges, and walking to their trucks to get their license plates.  Fuck these people who have to cheat to get their way in life.",
            "title_similarity": "0.6954017"
        },
        {
            "id": "i1koy5e",
            "score": 1,
            "text": "This is an outrage\n\nThe only reason they thought they could get away with this is because they wore fake ass badges to not get shot by law-abiding citizens. If you come to my home you better come friendly like. Multiple people need to go to prison for this.",
            "title_similarity": "0.6558448"
        },
        {
            "id": "i1kp59j",
            "score": 2,
            "text": "People always think this shit only happens in the South. Whatever.",
            "title_similarity": "0.31025964"
        },
        {
            "id": "i1kpste",
            "score": 1,
            "text": "Can we just start fighting back on these sorry MFrs now….?!??!!!",
            "title_similarity": "0.5101398"
        },
        {
            "id": "i1kq1sx",
            "score": 1,
            "text": "Conservatives are so messed up. Not all of them, just most of them.",
            "title_similarity": "0.3620318"
        },
        {
            "id": "i1kqfvx",
            "score": 1,
            "text": "If you oppose these people, you should buy a gun and learn how to use it reasonably well. Whatever your opinion on gun control.",
            "title_similarity": "0.47972196"
        },
        {
            "id": "i1kqz96",
            "score": 1,
            "text": "They wonder why we call them terrorists. This is by definition terrorism",
            "title_similarity": "0.53780353"
        },
        {
            "id": "i1kr4fa",
            "score": 1,
            "text": "Done with this shit, this is what happens when nothing is done and no one is ever held accountable",
            "title_similarity": "0.23733498"
        },
        {
            "id": "i1krobf",
            "score": 1,
            "text": "Something, something Klan Hood.\n\nSomething, something Pillow Case.",
            "title_similarity": "0.26189208"
        },
        {
            "id": "i1krx71",
            "score": 1,
            "text": "I’m shocked. SHOCKED! Well, not that shocked.",
            "title_similarity": "0.10021293"
        },
        {
            "id": "i1ksaat",
            "score": 2,
            "text": "I love how they're literally investigating how it's even possible that they're no longer in control because they are so egomaniacal that in their little heads it's impossible for them to be losers.",
            "title_similarity": "0.4461329"
        },
        {
            "id": "i1ksaif",
            "score": 1,
            "text": "Remember since 1985 Colorado is a castle state!",
            "title_similarity": "0.30067676"
        },
        {
            "id": "i1ksk66",
            "score": 1,
            "text": "Are these the *Real American Patriots* I've heard so much about?\n\nThe ones making America great again, again??",
            "title_similarity": "0.37795103"
        },
        {
            "id": "i1kt74z",
            "score": 1,
            "text": "Why didn’t they do that here in Texas?",
            "title_similarity": "0.34917617"
        },
        {
            "id": "i1ktkn5",
            "score": 1,
            "text": "Take pictures and video for references get it out there so others are aware",
            "title_similarity": "0.18022126"
        },
        {
            "id": "i1ktu0j",
            "score": 1,
            "text": "Only the DoJ prosecuting these people & judges issuing extensive sentences can rein them in",
            "title_similarity": "0.45519096"
        },
        {
            "id": "i1ku2ue",
            "score": 6,
            "text": "A black person cant drive through a white neighborhood in a uniform in a marked appliance repair truck. Can you imagine multiple blacks walking in a neighborhood in civilian clothes with pistols??? Ooops I forgot...there’s NO such thing as White Privilege",
            "title_similarity": "0.40762192"
        },
        {
            "id": "i1kupbf",
            "score": 2,
            "text": "But they aren't fascist?",
            "title_similarity": "0.09068774"
        },
        {
            "id": "i1kwh4l",
            "score": 2,
            "text": "As someone who grew up in Denver and went to school in mesa county, I’ll tell you that it’s highly racist and anti-progressive.\n\nIt’s their little oasis in dem Colorado.",
            "title_similarity": "0.65447974"
        },
        {
            "id": "i1kwkpr",
            "score": 1,
            "text": "I live in Colorado, not necessarily where these clowns are pulling their stunts, but still... show up at my door with these questions, I will gladly tell you to fuck off. I will not be intimidated or threatened by these fascist wannabes.",
            "title_similarity": "0.5938908"
        },
        {
            "id": "i1kwppg",
            "score": 1,
            "text": "I feel like if this was done in the south these people would have been swiss cheese before the person answering the door was even asked about voting",
            "title_similarity": "0.42621157"
        },
        {
            "id": "i1kx2pu",
            "score": 1,
            "text": "Wonder how pro-trump sub reddit world respond to this",
            "title_similarity": "0.55986565"
        },
        {
            "id": "i1kxc67",
            "score": 1,
            "text": "I remember hearing about this story not too long ago. probably another state. my question is. Where the hell are the videos of this happening.\n\nthis is not something that would go unrecorded. We live in an age where *everything* is caught on film.",
            "title_similarity": "0.2941559"
        },
        {
            "id": "i1kxjvg",
            "score": 2,
            "text": "May be time to arm up and go \"observe\" these knuckleheads.",
            "title_similarity": "0.22860202"
        },
        {
            "id": "i1kxz1b",
            "score": 4,
            "text": "They need to throw a net over Mike Lindell and drag him to prison.",
            "title_similarity": "0.59181213"
        },
        {
            "id": "i1kyu3f",
            "score": 2,
            "text": "What’s incredible about this is that as soon as someone shoots one of these dumb motherfuckers the NRA is suddenly going to care about gun violence",
            "title_similarity": "0.6223912"
        },
        {
            "id": "i1kzmrm",
            "score": 1,
            "text": "Merica!",
            "title_similarity": "-0.1090433"
        },
        {
            "id": "i1kztgr",
            "score": 1,
            "text": "Chairboooorrnnne Rangeerrrs fed the way...\n\n(There is a cadence in the US Army that is \"Airborne Rangers led the way\", just in case anyone didn't understand where the pun came from lol)",
            "title_similarity": "0.4987373"
        },
        {
            "id": "i1l04wi",
            "score": 7,
            "text": "Sounds about white",
            "title_similarity": "-0.07425316"
        },
        {
            "id": "i1l2w2f",
            "score": 1,
            "text": "Right wing media is one hell of a drug. \n\nEnsure you keep voting in your local, state, mid-term and presidential elections. Now is not the time to get complacent..",
            "title_similarity": "0.5952044"
        },
        {
            "id": "i1l39as",
            "score": 1,
            "text": "Come to the door armed",
            "title_similarity": "0.22913927"
        },
        {
            "id": "i1l3e45",
            "score": 2,
            "text": "If someone comes to my door armed and without a warrant then they are not going to be welcomed…and I’ll be the one asking questions while I record them",
            "title_similarity": "0.5330688"
        },
        {
            "id": "i1l3eov",
            "score": 1,
            "text": "I would not recommend trying those intimidation tactics in North Georgia. Just saying.",
            "title_similarity": "0.43612638"
        },
        {
            "id": "i1l3u2o",
            "score": 1,
            "text": "Prosecute them",
            "title_similarity": "0.3020834"
        },
        {
            "id": "i1l5eha",
            "score": 1,
            "text": "The lawsuit does not offer specific examples of voters being intimidated or harassed by armed canvassers, but last year USEIP leader Charity McPike urged armed members to provide \"security\" for the group.",
            "title_similarity": "0.5604249"
        },
        {
            "id": "i1l6cx8",
            "score": 1,
            "text": "This is domestic terrorism. All for what? Is it really worth it? Cowards. Absolute cowards",
            "title_similarity": "0.5874979"
        },
        {
            "id": "i1l6h2m",
            "score": 1,
            "text": "Get several thousand people, many who likely also have guns, really freaked out because you showed up like fucking Nazis to their homes to intimidate their vote.",
            "title_similarity": "0.72066355"
        },
        {
            "id": "i1l6prl",
            "score": 2,
            "text": "If they did that in Canada, we could call the police and they would go to jail.  They are brandishing weapons and using them to intimidate people.\n\nAmerica thinks it's \"freedom\" to allow armed white men to terrorize people, because the authorities identify with the armed white men.  Do you think the terrorized people feel \"free\"?",
            "title_similarity": "0.71496224"
        },
        {
            "id": "i1l6tcc",
            "score": 1,
            "text": "I feel like the kid in the back of the class that bounces in the chair with their hand raised begging for the teacher to call on them. \"Ooo, ooo, ooo, please send them to my house, please, please!\"",
            "title_similarity": "0.40961397"
        },
        {
            "id": "i1l6xqd",
            "score": 1,
            "text": "GOP: party of liars and hypocrites",
            "title_similarity": "0.4952026"
        },
        {
            "id": "i1l7bzd",
            "score": 2,
            "text": "\"Don't tread on me \" kind of people literally treading allover voting rights",
            "title_similarity": "0.4782989"
        },
        {
            "id": "i1l7d6t",
            "score": 1,
            "text": "Wow and you call this democracy???",
            "title_similarity": "0.176431"
        },
        {
            "id": "i1l815l",
            "score": 1,
            "text": "I'm conservative and this is extremely dumb and this is one of the many reasons people hate conservatives",
            "title_similarity": "0.5277604"
        },
        {
            "id": "i1l81m5",
            "score": 1,
            "text": "These people just make me want to vomit. Disgusting tactics. I feel bad for those residents being harrassed like this. Slam the door in their faces!",
            "title_similarity": "0.51724154"
        },
        {
            "id": "i1l845i",
            "score": 2,
            "text": "That is absolutely illegal. I hope they rounded them up and carted them off. If one of them faced law enforcement with an movement toward their weapon they would be shot. If they were unarmed and Black, they would be shot just for being a POC.",
            "title_similarity": "0.6506783"
        },
        {
            "id": "i1l8tqr",
            "score": 1,
            "text": "So all those Republicans out there who aren't racist or thugs etc.. I don't hear them talking about this as criminal.  Why? because they are okay with whatever the party does that wins elections.  Lying, cheating, threatening, violent insurrection - none it matters,some Republicans pretend to care (e.g. Mitt) but they don't care.",
            "title_similarity": "0.5222065"
        },
        {
            "id": "i1l8w8x",
            "score": 1,
            "text": "It didn't work, they're weak.",
            "title_similarity": "0.15238038"
        },
        {
            "id": "i1l90y1",
            "score": 1,
            "text": "Sue him",
            "title_similarity": "0.27039024"
        },
        {
            "id": "i1l94c8",
            "score": 3,
            "text": "Clear the jails out of folks in there for shit like marijuana offenses. I don't give a shit about them. Make space for these kinds of people. They're the real threat to liberty and society. \n\nThis isn't stupidity, it is domestic terror. Call them what they are. They are domestic terrorists. \n\nNot whatever dumb, self-important, batshit wacko acronym they came up with.\n\nThey are goddamn domestic terrorists. Full stop. And they need to be called this, charged like it, and sentenced as such. \n\nThese shit wagons are the real threat to society. If the country doesn't start prosecuting AND jailing them for the proscribed maximum sentence, we're in big(ger) trouble.",
            "title_similarity": "0.69379705"
        },
        {
            "id": "i1l96jp",
            "score": 5,
            "text": "\"...it's unfortunate that we must check volunteers for pedophilic leanings.\"\n\nYeah, it's unfortunate that there's such an overlap between the type of people who want to diddle kids and the type of people who want to deprive minorities of the right to vote. But strangely the group that also spews conspiracy theories about pedo cannibal adrenochrome cults never looks inward for the pedophilia that seems to be coming from inside the house.",
            "title_similarity": "0.6367146"
        },
        {
            "id": "i1lac4g",
            "score": 3,
            "text": "what the fuck kind of backwards shit is this ??!?",
            "title_similarity": "0.26636958"
        },
        {
            "id": "i1lai87",
            "score": 1,
            "text": "I’m looking forward to the next US election….. it will be a shit show of both sides shouting ‘voter fraud’ at each other. It’s already being set up in the respective news outlets.",
            "title_similarity": "0.66793954"
        },
        {
            "id": "i1layh8",
            "score": 1,
            "text": "Mein Kissen https://imgur.com/FdeBexE",
            "title_similarity": "0.13786136"
        },
        {
            "id": "i1lb6ya",
            "score": 3,
            "text": "Fuck Trump and EVERYONE who supports him!",
            "title_similarity": "0.5330559"
        },
        {
            "id": "i1lbe5n",
            "score": 2,
            "text": "*sees armed men at door with Trump stickers. Proceeds to call police and arm himself.*\n\n\nThe. End.",
            "title_similarity": "0.6328708"
        },
        {
            "id": "i1lbwq5",
            "score": 1,
            "text": "Hopefully they knock on the wrong door.",
            "title_similarity": "0.31202015"
        },
        {
            "id": "i1ld4xt",
            "score": 2,
            "text": "I'm ngl someone on my porch with a gun, id just fuckin laugh and close the door in their face, you need a gun to tell me your political views? The Mormons do your job with a Bible in hand instead of a deadly weapon. Also what are you gonna do shoot me?",
            "title_similarity": "0.63076156"
        },
        {
            "id": "i1ld8il",
            "score": 1,
            "text": "hope they charge em with terrorism and give em a nice long time out",
            "title_similarity": "0.42598546"
        },
        {
            "id": "i1ldfod",
            "score": 1,
            "text": "What a bunch of pussies.",
            "title_similarity": "0.09341358"
        },
        {
            "id": "i1le75f",
            "score": 1,
            "text": "*fake surprise face*",
            "title_similarity": "0.15710343"
        },
        {
            "id": "i1lek82",
            "score": 1,
            "text": "Yee haw and shit",
            "title_similarity": "0.072352335"
        },
        {
            "id": "i1lex0m",
            "score": 1,
            "text": "Nazi lives don't matter",
            "title_similarity": "0.12221517"
        },
        {
            "id": "i1lezbm",
            "score": 1,
            "text": "Red white and blue brown shirts",
            "title_similarity": "0.048387595"
        },
        {
            "id": "i1lf5b2",
            "score": 1,
            "text": "You come to my house ‘concealed carrying’  (you can almost always tell) or armed to talk to me about voting? Fuck right off.",
            "title_similarity": "0.6105373"
        },
        {
            "id": "i1lf7w1",
            "score": 3,
            "text": "Is it really any surprise that Pillow Mike is involved in even more extreme anti-voting behavior?",
            "title_similarity": "0.6323296"
        },
        {
            "id": "i1lfwo0",
            "score": 1,
            "text": "Throw them all in a cell with faulty plumbing.",
            "title_similarity": "0.4115581"
        },
        {
            "id": "i1lfyiv",
            "score": 1,
            "text": "Arrest them all?",
            "title_similarity": "0.40310383"
        },
        {
            "id": "i1lfz4u",
            "score": 1,
            "text": "What these racists pricks have to be stopped",
            "title_similarity": "0.48347354"
        },
        {
            "id": "i1lg2bp",
            "score": 1,
            "text": "You best be votin’ fer me and my pillow…. Or else!",
            "title_similarity": "0.2577009"
        },
        {
            "id": "i1lh8w4",
            "score": 1,
            "text": "Fucking terrorists.",
            "title_similarity": "0.37652385"
        },
        {
            "id": "i1lhrzv",
            "score": 1,
            "text": "In the long run, this is a monumentally dumb idea. With such easy access to such affordable, and good quality video recording technology, these morons will never know how many times they have indicted themselves on video. Then again, these guys were never known to be the smartest people in the room.",
            "title_similarity": "0.35956097"
        },
        {
            "id": "i1li2k9",
            "score": 3,
            "text": "Show up unsolicited on my front step with a firearm and you’re getting greeted by either 00-buck or .44 hog hammer.",
            "title_similarity": "0.540889"
        },
        {
            "id": "i1lif5z",
            "score": 3,
            "text": "So, armed conservatives coming onto private property with the intention of intimidation in minority neighborhoods in 2022, when liberal & minority gun ownership is at an all time high....and they aren't law enforcement?   \n\nAs a 2A, liberal household, that sounds like a situation that may not turn out quite like they expect.",
            "title_similarity": "0.76294386"
        },
        {
            "id": "i1linx4",
            "score": 1,
            "text": "an armed person threatening you at your own house, cant you just shoot them?",
            "title_similarity": "0.65118456"
        },
        {
            "id": "i1liqv0",
            "score": 2,
            "text": "You know liberals have guns too right?",
            "title_similarity": "0.4522261"
        },
        {
            "id": "i1liuf8",
            "score": 2,
            "text": "I wish these nutsacks would have come to my house",
            "title_similarity": "0.39576387"
        },
        {
            "id": "i1ljuz1",
            "score": 1,
            "text": "Prosecute them to the fullest extent of the law.",
            "title_similarity": "0.2726268"
        },
        {
            "id": "i1ljye9",
            "score": 1,
            "text": "Back away from the crack pipe!",
            "title_similarity": "0.34650224"
        },
        {
            "id": "i1lk8a5",
            "score": 1,
            "text": "Glowies.",
            "title_similarity": "-0.08528823"
        },
        {
            "id": "i1lko8e",
            "score": 1,
            "text": "Yawn, wake me up when there's a criminal case.",
            "title_similarity": "0.29421127"
        },
        {
            "id": "i1lku8t",
            "score": 1,
            "text": "Is this a joke?",
            "title_similarity": "0.15022206"
        },
        {
            "id": "i1llv95",
            "score": 1,
            "text": "Oh look, more right wing terrorism.",
            "title_similarity": "0.4071195"
        },
        {
            "id": "i1lmzoe",
            "score": 1,
            "text": "Can you imagine what US history classes will inevitably teach about the Trump administration years?\n\nI cannot even fathom how one would begin. I guess you could start off the first class where it all started (after his official \"win\"): \"I won the popular vote too, there was voter fraud that Hillary and her supporters committed\".\n\nLittle will those students know that it would end on the same note, just with a different character slotted in instead of Hillary.",
            "title_similarity": "0.664531"
        },
        {
            "id": "i1ln73d",
            "score": 1,
            "text": "And….. nothing will happen. I’m numb to it all anymore. I’m just waiting for a way out of the country.",
            "title_similarity": "0.23860505"
        },
        {
            "id": "i1lnfs3",
            "score": 3,
            "text": "Wait, you guys are answering your door?",
            "title_similarity": "0.2008563"
        },
        {
            "id": "i1lo705",
            "score": 2,
            "text": "The fucking GOP has lost its goddamn mind.",
            "title_similarity": "0.27447188"
        },
        {
            "id": "i1lp73d",
            "score": 1,
            "text": "I was wondering why so many people in charge of the elections in some manor have gone to jail lately. From judges all the way down. I'm not saying these folks don't feel intimidated. I don't think they went about this right. They should've done this different. But the people saying that there wasn't any voter fraud installed a KKK simpathiser in office.",
            "title_similarity": "0.5904765"
        },
        {
            "id": "i1ltase",
            "score": 1,
            "text": "What a bunch of dipshits",
            "title_similarity": "0.11687462"
        },
        {
            "id": "i1ltjlo",
            "score": 1,
            "text": "Wtf\nIf Republicans policies are so good, why do they stoop this low?",
            "title_similarity": "0.36299193"
        },
        {
            "id": "i1lu85j",
            "score": 1,
            "text": "Here’s the real question, will they get more jail time than Jessie Smollett? Absolutely fucking not",
            "title_similarity": "0.45103854"
        },
        {
            "id": "i1lvs99",
            "score": 1,
            "text": "Their stupidity & pathetic behaviors always get them caught 🤦🏻‍♀️😂",
            "title_similarity": "0.4264726"
        },
        {
            "id": "i1lvwhh",
            "score": 2,
            "text": "Honestly what good does this do? You can vote however you want the voting booth and they wouldn’t know anyway.  It’s really not that intimidating.",
            "title_similarity": "0.2900167"
        },
        {
            "id": "i1lvys2",
            "score": 1,
            "text": "I love when strangers come to my door - said no one ever beside that lonely guy",
            "title_similarity": "0.27423298"
        },
        {
            "id": "i1lwnqz",
            "score": 1,
            "text": "Lol pro trump ? Huhhhh",
            "title_similarity": "0.34964207"
        },
        {
            "id": "i1lxe7f",
            "score": 1,
            "text": "imagine violating the klu klux klan act",
            "title_similarity": "0.6100879"
        },
        {
            "id": "i1lxfwy",
            "score": 1,
            "text": "Land of the free, home of the brave - right guys",
            "title_similarity": "0.102145776"
        },
        {
            "id": "i1lxytx",
            "score": 1,
            "text": "I love people who carry un-cocked 1911’s - it’s like saying “I have this gun, but it will take me a while to use it, try me”",
            "title_similarity": "0.39468908"
        },
        {
            "id": "i1lz8i0",
            "score": 1,
            "text": "Fuck them morons",
            "title_similarity": "0.28561714"
        },
        {
            "id": "i1m0mv6",
            "score": 1,
            "text": "Are we not in 2022? Shit like this still exist?",
            "title_similarity": "0.13651474"
        },
        {
            "id": "i1m1ifg",
            "score": 1,
            "text": "I’m a libertarian and I live in NC, I vote Democrat or third party almost entirely and that top comment left me feeling kinda insulted. Basically if you show up on my property with or without a gun unexpectedly, you will be greeted by me with my firearm drawn. You will asked politely to leave, then the police will be called, but considering it’s a 40 minute response time if you do not leave before I start feeling threatened by your unwelcome presence then yeah that’s how that ends. But I also live in a private community 20 minutes from the nearest small town, and when I want people at my house I invite them. Unless you are here to give me free money or weed, I definitely don’t want whatever you are selling even if it’s your friendship! I have great friends I met naturally through life and I’m happy with that! People have a right to their privacy and to feel the way they want to in their own home. If someone started all this with an intimidating mindset and they weren’t police officers they’d get the one warning to leave my property but if I saw any movement towards their firearms it would be game over.",
            "title_similarity": "0.6129693"
        },
        {
            "id": "i1m32lk",
            "score": 4,
            "text": "Ku Klux Klan should be officially marked as a terrorist organization in the US.",
            "title_similarity": "0.64061546"
        },
        {
            "id": "i1m5ud1",
            "score": 1,
            "text": "They might get a surprise.",
            "title_similarity": "0.08714884"
        },
        {
            "id": "i1m7unl",
            "score": 3,
            "text": "GOP are nothing but closet Nazis. Trump is just the Commie Nazi with Putin's knee pads.",
            "title_similarity": "0.5242555"
        },
        {
            "id": "i1m8ir4",
            "score": 1,
            "text": "Thats a cheap fucken holster.",
            "title_similarity": "0.035161965"
        },
        {
            "id": "i1m9ss4",
            "score": 1,
            "text": "I dare th to knock on my door. they might not the result",
            "title_similarity": "0.32675546"
        },
        {
            "id": "i1maciu",
            "score": 1,
            "text": "*me answering door in stained tighty whiteys with my AR in one hand and a giant dildo in the other*",
            "title_similarity": "0.2745454"
        },
        {
            "id": "i1mbecn",
            "score": 1,
            "text": "When was this?\n\nE: also, where specifically in CO?",
            "title_similarity": "0.06412378"
        },
        {
            "id": "i1mblnh",
            "score": 2,
            "text": "The USA is imploding under the treasonous Trump alt-right.",
            "title_similarity": "0.6532234"
        },
        {
            "id": "i1mbvzq",
            "score": 2,
            "text": "I’d be recording them doing their schpiel and laughing in their faces the whole time and then calling the cops for trespassing. Then I’d be recording the cops to make sure they actually put the cuffs on their cousins and haul their asses away.",
            "title_similarity": "0.6401475"
        },
        {
            "id": "i1mc0hs",
            "score": 3,
            "text": "Feels like a crime whose punishment should be the removal of their voting rights.",
            "title_similarity": "0.5302633"
        },
        {
            "id": "i1mcldz",
            "score": 6,
            "text": "When Republicans lose, they send out the Gestapo. Fucking Republican Nazis.",
            "title_similarity": "0.5830909"
        },
        {
            "id": "i1meiwq",
            "score": 1,
            "text": "Lock him up",
            "title_similarity": "0.29880595"
        },
        {
            "id": "i1mevkl",
            "score": 2,
            "text": "One of the biggest news and MSM is silent.",
            "title_similarity": "0.21145171"
        },
        {
            "id": "i1mfxp3",
            "score": 1,
            "text": "*If you look at the pillowman, His background, his LOVE for the free enterprise system, his hate for Government, his hate for any regulations by Government, State, or Federal. As for minorities, I don't know that. Maybe you can find this in his background? See I have studied the two nutcase women in Congress, there background and it is easy to were they come from.  Most of the time you will find somewhere they have been convinced that all America's troubles come from the Black, Brown, Minorities, Immigrants. But mainly Black Americans.*",
            "title_similarity": "0.5871856"
        },
        {
            "id": "i1mjgnj",
            "score": 1,
            "text": "Trump 2024, KKK 2024",
            "title_similarity": "0.2504248"
        },
        {
            "id": "i1mk0x3",
            "score": 1,
            "text": "At what point do you realise you're the bad guys?",
            "title_similarity": "0.37844026"
        },
        {
            "id": "i1mkgv3",
            "score": 1,
            "text": "This reminds me of tactics used in maoist china mixed in with Khmer Rouge style anti-intellectualism.\n\n They are taking over the school boards down here and if they get their way they will be asking kids to turn their Democratic parents.",
            "title_similarity": "0.64655703"
        },
        {
            "id": "i1mlyhz",
            "score": 1,
            "text": "I just saw an ad for mypillow sandals. I wonder if that’s what these terrorists were wearing when they went door-to-door.",
            "title_similarity": "0.48348802"
        },
        {
            "id": "i1mo3nk",
            "score": 1,
            "text": "This is infuriating to read",
            "title_similarity": "0.25107884"
        },
        {
            "id": "i1mr8dt",
            "score": 1,
            "text": "Damn",
            "title_similarity": "0.024109818"
        },
        {
            "id": "i1ms882",
            "score": 1,
            "text": "Is this possibly fake news?",
            "title_similarity": "0.2568524"
        },
        {
            "id": "i1msmqf",
            "score": 1,
            "text": "Doubt",
            "title_similarity": "0.009598436"
        },
        {
            "id": "i1mtsnv",
            "score": 1,
            "text": "Just missing black arm bands...",
            "title_similarity": "0.11258126"
        },
        {
            "id": "i1muuxy",
            "score": 1,
            "text": "I feel as though every day I lose a little more of my ability to be surprised",
            "title_similarity": "0.187562"
        },
        {
            "id": "i1mv27j",
            "score": 1,
            "text": "When will republicans admit they are now the Kkk and Nazi sympathizer party and just stand on their laurels? Just be balls out. So we can all stand in unity and denounce the party of evil ducking garbage.\n\n*auto duck",
            "title_similarity": "0.69024056"
        },
        {
            "id": "i1mw5nm",
            "score": 1,
            "text": "This is horrible, but how are they gonna know who they voted for after the fact?",
            "title_similarity": "0.53486985"
        },
        {
            "id": "i1mx2vf",
            "score": 1,
            "text": "Colorado is sickening rich in its history of KKK. There’s small mountain towns still KKK driven. But no one in Colorado talks about it.",
            "title_similarity": "0.60937357"
        },
        {
            "id": "i1mya1j",
            "score": 1,
            "text": "I'm a \"Liberal\", and I own guns (quite a few actually).",
            "title_similarity": "0.3404571"
        },
        {
            "id": "i1mz1yf",
            "score": 1,
            "text": "With all these nutcases believing the election was stolen, imagine the domestic terrorism that’s about to happen around the 2024 election.",
            "title_similarity": "0.745924"
        },
        {
            "id": "i1mzswm",
            "score": 1,
            "text": "Baadgeez?  Baadgeez?  We don't need to show no stinking Baadgeez!",
            "title_similarity": "0.17825276"
        },
        {
            "id": "i1n082r",
            "score": 1,
            "text": "WTF? Anyone who went door to door trying to pursuade a person, while armed, especially during voting times, should be arrested for falsely impersonating LEO. *This is not neighborly conduct*! 😣 Edit grammar.",
            "title_similarity": "0.72200656"
        },
        {
            "id": "i1n0pyz",
            "score": 1,
            "text": "Shawn Smith, the head of USEIP last month led a \"lock her up\" chant while discussing Griswold at a rally and said that \"if you're involved in election fraud, you deserve to hang.\"\n\nIn an article laced with irony I find this one to be the juiciest.",
            "title_similarity": "0.7171632"
        },
        {
            "id": "i1n2tc2",
            "score": 1,
            "text": "And none of these idiots got shot? Surprising.",
            "title_similarity": "0.21050598"
        },
        {
            "id": "i1n34cw",
            "score": 1,
            "text": "These people are goddamn disgusting",
            "title_similarity": "0.3117868"
        },
        {
            "id": "i1n49wv",
            "score": 1,
            "text": "Fascism is when MyPillow.",
            "title_similarity": "0.2747165"
        },
        {
            "id": "i1n5av9",
            "score": 1,
            "text": "Anyone who comes to my home to try this will be shot.",
            "title_similarity": "0.58816266"
        },
        {
            "id": "i1nea4m",
            "score": 1,
            "text": "I wish these rejects would come to my door with all their stupidity!!! Bring your shit to Chicago you sissys!",
            "title_similarity": "0.6192472"
        },
        {
            "id": "i1neouq",
            "score": 1,
            "text": "The goon squad",
            "title_similarity": "0.3348373"
        },
        {
            "id": "i1nzzgd",
            "score": 1,
            "text": "Evangelicals going door to door is a lot different now.",
            "title_similarity": "0.364987"
        },
        {
            "id": "i1o0f5t",
            "score": 2,
            "text": "This is the only way these buttholes can compete in an election. They know there are more Democrat voters and have been for decades. If someone comes to your door the best thing is not answer and if they persist, call the police. I would suggest keeping pepper spray handy just in case. It would be great if these neighborhoods organized and placed signs that read, \"If you're coming here to intimidate us we take turns as snipers. Enter at your own risk.\" Sadly, that would probably just embolden these chowder heads more.",
            "title_similarity": "0.60121405"
        },
        {
            "id": "i1o21b6",
            "score": 1,
            "text": "I wish they came packing with fake badges to my door I would have let them in and then locked the door behind them!",
            "title_similarity": "0.54432666"
        },
        {
            "id": "i1pfk4y",
            "score": 1,
            "text": "Crackhead! 🎤Drop!",
            "title_similarity": "0.27772266"
        },
        {
            "id": "i1pmcjb",
            "score": 1,
            "text": "If I see armed guys that aren't cops at  my door, I'm calling the cops.",
            "title_similarity": "0.56239754"
        },
        {
            "id": "i1pnplf",
            "score": 2,
            "text": "I received a letter in the mail that said what I vote is public record and that all my neighbors will know what I vote. It also provided what party I was registered for. \n\nIn Georgia.",
            "title_similarity": "0.49040964"
        },
        {
            "id": "i1s2r0c",
            "score": 2,
            "text": "It’s just like Germany during the 1920’s. Just send the SA (brown shirts) to beat the shit out of everyone that doesn’t believe in our cause.",
            "title_similarity": "0.6526716"
        },
        {
            "id": "i1ykmpl",
            "score": 2,
            "text": "I wonder if they salute each other like those upper echelon yahoos at those Tom Cruise Scientolo-Cons?",
            "title_similarity": "0.47766435"
        },
        {
            "id": "i33kev1",
            "score": 1,
            "text": "https://open.spotify.com/episode/5Dsezq6ZDnKkkmPvCrwvHB?si=ixfGytALQ8uCJaqH96SClw",
            "title_similarity": "0.22061673"
        },
        {
            "id": "i37tcgr",
            "score": 1,
            "text": "Be sure to look under your bed for these “nazis”",
            "title_similarity": "0.3572269"
        },
        {
            "id": "i3iawv3",
            "score": 1,
            "text": "Kkk ran me out of town when i was running for governor.  Colorado has major issues with its police.",
            "title_similarity": "0.7918926"
        },
        {
            "id": "i4hqmhv",
            "score": 1,
            "text": "\"Mike Lindell, My Pillow Pimp\"",
            "title_similarity": "0.3261927"
        }
    ]
}